{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "224",
  "name": "PRC Classes",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/prc-classes-t2354523.html",
  "author": "Scawt",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "2.2K",
  "posts": [
    {
      "author": "Scawt",
      "avatar": "no_avatar.png",
      "timestamp": "3:46 AM - Apr 08, 2016",
      "content": "<div>Hi guys,<br/>\n<br/>\n What's the general consensus of PRC or other additional classes on this forum? Looking at the legacy Bioware ECBs I saw that a couple of those builds use non-standard classes, but outside of that I see basically no use of them at all.<br/>\n<br/>\n I took a look at the PRC content and honestly it seems so absolutely overwhelming and seems like it would completely change the experience of playing the game to the point that it wouldn't even be NWN anymore. However, that being said, one thing that has always bothered me is the treatment of katanas in NWN. It annoys me that the best way to create a character focussing on a katana is basically the exact same way that you would do it for a longsword - i.e. sword and board in full plate utilising WM and high STR feats. I really feel like a light armoured dex based character would suit the theme so well, but there's no build for this that really works without sacrificing too much, in my opinion.<br/>\n<br/>\n Anyway, I stumbled across some mentioned PRC classes on the nwn wiki, which has about 12 PRC classes, one of which is the Iaijutsu Master which would be the exact thing one wanting to make the aforementioned character would want to use. Thinking that there were only 12 classes and perhaps a few feats/skills I looked into installing this PRC pack, but as I mentioned, upon learning that there are over 100 classes, as well as countless other additions in the form of skills, feats and spells I was completely turned off the idea.<br/>\n<br/>\n As an aside, if anyone knows of a way to install a smaller version (perhaps the one that was in existence when the wiki was created) I would be very interested in hearing it.<br/>\n<br/>\n Thanks.</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:09 PM - Apr 08, 2016",
      "content": "<div>What you need to understand is that NWN, by default, is only the version last released and supported by BioWare as v1.69, specifically Bioware's interpretation of AD&amp;D v3.0 for a real-time gaming experience.  Therefore, the ruleset, the creature blueprints, the definition of the classes and how they interact within the Bioware NWN environment is rigid. Any other \"versions\" are customizations and are really NOT pure Neverwinter Nights.  They may be based on Neverwinter Nights, usually use the same Aurora Toolet to interface with the designing and similar NWNscript coding but, otherwise, are discrete games with their own set of dynamics.  Some versions implement AD&amp;D 3.5 and others even more exotic AD&amp;D versions to produce the sort of environments that gamers have expressed an interest that they would like to experience, over the years.<br/>\n<br/>\n PRC is simply one of these NWN-like game versions.  The fact that it changed the default game so extensively and had so many contributors to that effort over the years has led to its popularity and in some respects, downfall, because it was so hard to maintain within the vast scope it was attempting to address.  Basically, it is just Custom Content \"on steroids\" and has a legacy of unaddressed issues that may (or may not ever) be addressed in the future. So use it at your own risk.<br/>\n<br/>\n Now...<br/>\n<br/>\n As to why you will probably never see PRC class builds or concepts discussed within these forums is two-fold.<br/>\n<br/>\n First, our community has little or no experience using it.  There are occasions where requestors desire build advice for innovative PWs or SP content, but even in those occasions, any useful contributions by the community relies on how detailed the custom nuances have been described by the requestor.  Since each custom environment is theoretically discrete and unique as compared to the default game resources, full disclosure is required.<br/>\n<br/>\n Secondly, Kamiryn's CBC is the tool we use to allow us to respond quickly to requests if no other archived builds have been designed.  There is no PRC version of Kamiryn's CBC for PRC classes so that means that, even with fully documented custom class changes by the requestor, we would need to hash out build concepts on paper, manually, and THAT will never happen (if I can speak for the majority of our veteran contributors) due to the time and effort it takes to compile a sample build.  Since the PRC is only one such instance of custom game changes, it is highly unlikely you will ever find any effort on the part of Kamiryn to provide a spreadsheet utility to fill that void.  She did create a CBC specifically for NWN 2 that uses AD&amp;D 3.5 classes and ruleset but that is also the default version of NWN 2 (I don't even know what the latest Bioware version was released due to my sketchy experience with NWN2).<br/>\n<br/>\n Here are a few resources for the PRC which may help you achieve a better understanding of that content.  How well are they maintained or supported?  I have no clue.<br/>\n<br/>\n<strong><a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/hakpak/original-hakpak/player-resource-consortiums-prc-pack-v35\" rel=\"noreferrer\" target=\"_blank\">Player Resource Consortium's PRC Pack v3.5</a></strong> (there may be links to a \"PRC-light\" version around if you join the vault and use their discussion section)<br/>\n<br/>\n<strong><a class=\"postlink\" href=\"http://prc.athasreborn.com/\" rel=\"noreferrer\" target=\"_blank\">Player Resource Consortium's Forum and Links</a>  </strong>(there appears to be some recent activity posted here)<br/>\n<br/>\n You may have already visited these places.  If so, you know more than most of us in regards to the PRC.  Apologies for providing so little guidance but I declined to get involved in PRC after it forced me to reinstall the game after experiencing just too many conflicts with the default game many, many years ago.  It may be better today. Dunno, so good luck.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:36 AM - Apr 10, 2016",
      "content": "<div>Katana's should be if nothing else, at least finesse-able weapons. The game balance dictates that should be equivalent to Bastard Swords though, so they chose the \"lazy\" method of doing them identical.<br/>\n<br/>\n Sadly DnD does not (except in a very few cases) reward skill that much, so you simply take the Strength route for everything. In other systems like (Legends of the Five Rings, CODA, etc) skill is rewarded as much and even more so than brute strength, but not here. So the best WM's for example are 36 RAW STR Half-Orcs wielding Scimitars.<br/>\n<br/>\n On the PRC, it was mainly the luck of support that doomed it. And it is very unbalanced as well with Lich Mages that go up to 60 DC for their spells and Half-Trolls Fighters and so on. It has many good things about it but it lacks the server support. Also many people are confused as how to work it into their installation. At one point i had a NWN Directory that was over 21 GB in size and the game simply collapsed...<br/>\n<br/>\n And welcome to the guild Scawt!</div>"
    },
    {
      "author": "Scawt",
      "avatar": "no_avatar.png",
      "timestamp": "7:27 AM - Apr 13, 2016",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>Katana's should be if nothing else, at least finesse-able weapons. The game balance dictates that should be equivalent to Bastard Swords though, so they chose the \"lazy\" method of doing them identical.<br/>\n<br/>\n Sadly DnD does not (except in a very few cases) reward skill that much, so you simply take the Strength route for everything. In other systems like (Legends of the Five Rings, CODA, etc) skill is rewarded as much and even more so than brute strength, but not here. So the best WM's for example are 36 RAW STR Half-Orcs wielding Scimitars.<br/>\n<br/>\n On the PRC, it was mainly the luck of support that doomed it. And it is very unbalanced as well with Lich Mages that go up to 60 DC for their spells and Half-Trolls Fighters and so on. It has many good things about it but it lacks the server support. Also many people are confused as how to work it into their installation. At one point i had a NWN Directory that was over 21 GB in size and the game simply collapsed...<br/>\n<br/>\n And welcome to the guild Scawt!</div></blockquote>\n<div align=\"left\">I couldn't agree more. I literally was looking into installing the PRC pack explicitly for a prestige class which grants the \"weapon finesse (katana)\" feat. But I seriously do not want all that extra content crammed into my game.<br/>\n<br/>\n And after some short research it seems like you can't edit the innate scripts to control what weapons are and aren't included in the weapon finesse feat, so I guess this whole katana venture has come to an end.<br/>\n<br/>\n And thanks, glad to be here.</div></div>"
    }
  ]
}