{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "497",
  "name": "Level 30 Cleric Help",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/level-30-cleric-help-t515520.html",
  "author": "lightningkmf",
  "avatar": "10235222_1510287070.jpg",
  "replies": 6,
  "posts": [
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "10:45 PM - Oct 21, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Could I please get assistance with a cleric I am wanting to build. I was thinking of human for a race and possibly 21 cleric 6 ftr 3 rogue but honestly I am not sure of what a good split for a priest. I am open on my race but I think that human would probably offer the most benefit. I would like to be good at pvm and excel at pvp. This would be for Arelith so the typical 3 lvl split rule would apply. The only notable difference that I believe I should mention is that on arelith if you have epic spell focus in different spell schools you get different bonuses along with the normal additional +2 to your dc.They can be found <br/>\n<ul><li><strong>Conjuration:</strong><ul> <li>Summon spells provide buffed summons when casting Summon Creature (I-IX) and Epic Spell: Dragon Knight. More Spell Focuses in Conjuration provide greater buffs. Only creatures summoned with the spells above produced buffed summons, the Planar Binding Line of spells is not effected, despite being from the Conjuration school.<br/>\nGreater spell focus in conjuration has the same effect as the cleric animal domain that is summoning higher level Summon Monster I-VIII creatures. The effects of the two don't stack.<br/>\nEpic spell focus in conjuration now grants the -yoink spell, which lets you teleport another PC to your location (they get the option to go or not). It also further improves the buffs that non-undead summons get (+8hp. +1 AB and +1 damage per spell focus).</li></ul></li></ul>\n<strong>Abjuration:</strong><ul><li>Grants a +2 to dispel checks per focus (total of +6 with an epic focus). Epic focus in abjuration allows you to use the -ward command, which appears to function like a Mass Hold Person spell.<br/>\nThe shield spell protects against Isaac's Lesser Missile Storm if you have a spell focus in Abjuration, and against both missile storms if you have greater or epic spell focus in Abjuration.</li></ul>[/list]<br/>\n<strong>Divination:</strong><ul> <li>Characters with Epic Spell Focus in Divination can scry on other characters. Scrying works as a cutscene, showing the caster the target's current surroundings.  You are able to do this ever certain amount of game time.</li> </ul>[/list]<br/>\n<strong>Transmutation:</strong> <ul><li>Epic Spell Focus: Transmutation allows use of the Teleport ability. Typing -teleport brings up a Planar Portal dialogue, allowing the user to teleport to any known Portal for 100xp, once per day (here meaning once per rest). Also, with with normal and greater focus in Transmutation, a character is able to activate golems.</li></ul>[/list]<br/>\n<strong>Illusion:</strong> <ul><li>Epic Spell Focus: Illusion grants the Send Image ability, allowing the player to send an image of themselves to a target, say something, and vanish. The Send Image Ability works once every 18 minutes or so, and has no XP cost.</li></ul>[/list]<br/>\n<strong>Necromancy:</strong><ul><li>Spell focus: Necromancy gives Undead summons (Animate Dead, Create Undead, Create Greater Undead as well as Pale Master and Blackguard feat-spells) a very slight boost to their stats. Greater spell focus allows the caster to                                                                    cast twice for two summons, and you can mix and match summons (For example, a Shadow and a Skeleton Warrior). Epic Spell Focus instantly creates two undead creatures.<br/>\nEpic Spell: Mummy Dust and Epic Spell: Dragon Knight (for Pale Masters who summon a Dracolich, see below) get a minor statistics boost, but only one of them is summoned.</li></ul>[/list]<br/>\n<strong>Evocation:</strong><ul><li>Epic evokers get a significant boost to the power of Hellball and Greater Ruin: they're now actually worth taking for those casters.  I have witnessed a failed save of Greater ruin do about 350 damage. They are alot stronger now.</li> </ul>[/list]<br/>\n<strong>Enchantment:</strong><ul><li>The enchantment basins offer gold piece discounts to those with Spell Focus: Enchantment. 10% for basic focus, 20% for greater focus and 35% for epic focus. The percent values associated with each level is a reduction in base cost, which lowers gold cost, exp cost, and raises the percent chance of success. The decrease of failure makes it possible for epic Enchanters to make items that normal, unfocused people cannot make.</li></ul>[/list][/list][/list]<br/>\n<br/>\nThank you in advance for all your help. If there are any questions you have, I would be more than happy to answer or clarify anything that does not fully make sense.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "11:42 PM - Oct 21, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Caster or battle cleric?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "12:27 AM - Oct 22, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I believe battle cleric. I dont really care if we keep the fighter and rogue levels though or if they get tossed for something better.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "5:28 AM - Oct 22, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I should also note that I have read through both the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=10&amp;t=94\" rel=\"noreferrer\" target=\"_blank\">Cleric 18/monk 6 fighter 6</a> thread and the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=6&amp;t=96\" rel=\"noreferrer\" target=\"_blank\">Cleric 16/monk 6/fighter 8</a> thread.  Both look really good to me but I was unsure if one of those would be the best route to take and if so which one.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:43 AM - Oct 22, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>lightningkmf wrote:</strong>I should also note that I have read through both the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=10&amp;t=94\" rel=\"noreferrer\" target=\"_blank\">Cleric 18/monk 6 fighter 6</a> thread and the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=6&amp;t=96\" rel=\"noreferrer\" target=\"_blank\">Cleric 16/monk 6/fighter 8</a> thread.  Both look really good to me but I was unsure if one of those would be the best route to take and if so which one.</div></blockquote>\n\nI don't have time to look at both now, but I can tell you that sometimes it's a matter of personal preference too. There is no such thing in NWN as THE BEST ROUTE. What is the best for me may not be for you or another player according to playstyle. For example, a guy like me, who plays extremely aggressively and is usually surrounded with tons of mobs may find the Armor Skin and Cleave feats primordial, while someone who fights a few or even one monster at a time may prefer Knockdown. In a build posted by Mick Dagger called The Spellsword of Bahamut, he went for Spell Penetration and Greater Spell Penetration, whereas I would've gone for Divine Might and Divine Shield. In my Bane Crusher build, someone that doesn't like Crippling Strike that much could argue that it's best to go Ranger 26 Rogue 13 SD 1 instead for one more Favored Enemy. Those are personal choices, you gotta find the build that suits your playstyle better and have fun!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "5:59 PM - Oct 22, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am currently leaning towards the cleric 18 monk 6 fighter 6. Do you think that overall this build would be weaker than say they 20 cleric 6 fighter 4 rogue or is there another great combination of classes I am not even thinking of? I know that the latter would get more spells and have UMD but the former gets a lot of the monk goodies including better saves and armor class. The first is slightly easier to dispell as well. On arelith Mord's Disjunction is capped at 1d20 +20 though. It does not keep up with your character level. That should help with dispelling some. <br/>\n<br/>\nI do realize alot of this will depend on opinions but I think that people here will likely have very informed good opinions,<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:47 PM - Oct 22, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>lightningkmf wrote:</strong>I am currently leaning towards the cleric 18 monk 6 fighter 6. Do you think that overall this build would be weaker than say they 20 cleric 6 fighter 4 rogue or is there another great combination of classes I am not even thinking of? I know that the latter would get more spells and have UMD but the former gets a lot of the monk goodies including better saves and armor class. The first is slightly easier to dispell as well. On arelith Mord's Disjunction is capped at 1d20 +20 though. It does not keep up with your character level. That should help with dispelling some. <br/>\n<br/>\nI do realize alot of this will depend on opinions but I think that people here will likely have very informed good opinions, </div></blockquote>\nIt depends to some degree on what equipment you are comfortable with or prefer.  Any monk battle cleric will be using robes &amp; kama(s) to glean the monk progression whether it is a DW or single-hand attack.  The rogue version can use other weapons with heavy armor (and shield, if needed) though a DEX variant would lean towards robes (like the robed monk/cleric) and with UMD the rogue will still be able to equip all the monk equipment.  Either one can be built for STR or DEX though the UD from rogue will help most with a DEX build.  With single-hand/shield, the rogue cleric and get up to +10 AC from Magic Vest (x2) to help compensate for the lost AC from monk AC.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}