{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "880",
  "name": "Half-orc for Aielund",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/half-orc-for-aielund-t2355042.html",
  "author": "RunningWithWolves",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "325",
  "posts": [
    {
      "author": "RunningWithWolves",
      "avatar": "no_avatar.png",
      "timestamp": "6:19 PM - Mar 06, 2019",
      "content": "<div>Hi epic builders. I was looking for a half-orc build for my Aielund saga playthrough. I really liked <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/panthro-the-strongest-dever-in-the-world-fighter-1-t2354901.html\" rel=\"noreferrer\" target=\"_blank\">Panthro</a>, because its simple but still has things going for it, like songs and umd. Not quite as annoying as pre-buffing every fight, but not as brain dead as to click and afk. I assume i need to tweak it to avoid exp penalty and change all dev. crit required feats to something different. Epic levels are no problem, since i can just get more great strength, its pre-epic im concerned about. So far i either have to take useless feats, or end up with 3 apr at 20. I thought about swapping fighter for barbarian, but i want that sweet ews. And im not sure about the optimal leveling route for 4 attacks with no xp penalty. <br/>\nIm open for other build suggestions of course, if you think that im better off with something else.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:26 PM - Mar 06, 2019",
      "content": "<div>Hi there Running With Wolves, and welcome!<br/>\n<br/>\nPanthro seems reasonably adaptable, and if I cock this up Valerfor will be the first to stamp all over me, I'm sure.<br/>\n<br/>\nI don't know if you've played Aielund before, but you're unlikely to go beyond level 37, which actually helps in modifying this build, I think. Also, there aren't many groovy heavy flails in the campaign, so you might want to think about Greatsword instead.<br/>\n<br/>\nEqually, I wouldn't be over-concerned about the xp penalty - you've got 2 3/4 BAB classes, so scaling will apply, but if you are, here are my suggestions.<br/>\n<br/>\nGo F1, B1, F2+3, B2, F4, B3, RDD1-4, B4, RDD5-8, B5+6, F5+6 pre-epic. You can lose Power Attack, Cleave and Great Cleave. I might be tempted to replace them with Luck of Heroes, Iron Will and Toughness (you will need a decent Will save during the end-game). Now, you'd gain an extra Fighter bonus feat pre-epic and you can take your pick. Or you can keep Power Attack and Cleave and drop one of the aforementioned three.<br/>\n<br/>\nIn epic levels, you could go F7, RDD9+10, B7, F8+9, B8, F10, B9, F11, B10, F12, B11, F13+14, B12-16. You do get 1 level of 20% xp penalty at level 35, but by then you're fine anyway. The feats in epic could go: level 21, GSI; level 24, GSII; 25, EWF; 27, GSIII; 28, EWS; 30, GSIV; 32, AS; 33, GSV; 35, EP; 36, GSVI.<br/>\n<br/>\nHopefully that should do it.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "RunningWithWolves",
      "avatar": "no_avatar.png",
      "timestamp": "10:46 PM - Mar 06, 2019",
      "content": "<div>Hey Stagmeister. <br/>\nMaybe exp penalty is not a big deal, but i just cant bring myself to have it in PvM. Despite me building a half-orc, i feel no exp penalty builds having certain elegance to them. Or maybe is a Pavlovian conditioning from NWN2 builds. Also im not sure about the scaling you mentioned. I always assumed its flat 20% as per wiki.<br/>\nWell anyway i did some testing after i posted and here's what i came to:<br/>\n1) LoH, IW, Toughness.<br/>\nSave feats was my first choice too. Im just not sure how much value they add for a build that has an average saves regardless.<br/>\n2) Disarm, Imp. Disarm, Toughness.<br/>\nFirst i need to mention that i've never used Disarm, so i have absolutely no clue how useful it is in PvM or in this particular build. At the first glance i see some synergy with Curse Song, but maybe im wrong. This will require me to lower DEX to 8, bring INT to 13 and add first point into INT as to not waste more skillpoints. 1 lower ac and delayed strength progression is annoying, but for some more skill points its not terrible.<br/>\n3) Exotic Proficiency(scythe), IKD, Toughness. <br/>\nSame deal with the attributes here. And again, im not sure how much value i get. I remember reading a guide on gamefaqs than stated Scythe having about 1-2% higher damage compared to Greatsword on non-wm builds, that's really nothing. IKD is a feat i don't often see taken, so im not sold if it ads anything to the build.<br/>\n4) Power Attack, Cleave, Toughness.<br/>\nThe last option is to leave them as be. I assume Power Attack is not that good, since we want to hit all of our attacks more, than we want +5 damage, unless we fighting something that has low AC and therefore is easy to kill anyway. Cleave is more interesting since i assume we will fight trash hordes as in any other module, but on the other hand its wasted on hard enemies.<br/>\n5) ?<br/>\nSome other combination of the above, or maybe something else entirely like Extra Song.<br/>\n<br/>\nSo basically i hope someone gives their perspective on what will serve me better in the lands of Aielund, or in general PvM sense. The difference may seem minuscule, but that difference may very well make me restart 20 hours in. Chronicle restartis is a grave illness, you know.<br/>\n<br/>\nThanks for your reply.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:47 PM - Mar 06, 2019",
      "content": "<div>I'm with you all the way as far as xp penalties go, and yes could prevent them entirely with my suggestions if you went for Bard 12 at level 35 and Fighter 14 at 36 - I was just trying to get Epic Prowess in a bit earlier. The scaling I mentioned is that, while the xp penalty remains constant, you get more xp for a kill if you're not on a full BAB schedule (thus - and this is a made-up example - while you might only get 80% of the xp for a particular kill, it might well be of a 20% xp hike in the value of that kill) so it kind of balances out in the long run.<br/>\n<br/>\nAs for the pre-epic feats, a lot will depend on your own play-style. I know I only take Great Cleave if I'm going for Dev Crit (unless I've got feats to burn), and Power Attack is a bit pointless in itself for a Strength build, but you need it for Cleave (unless you're a monk), and Cleave is good. The only problems with LoH, IW and Toughness are when you have to take them. LoH can only be had at level 1, and neither IW nor Toughness can be taken as bonus feats. The Disarm twins are more useful with a 2-handed weapon, but they function in much the same way as KD/IKD do - your AB drops. But you couldn't take them anyway without an Int of 13+ (the same is true of IKD, btw), so let's not worry too much.<br/>\n<br/>\nAs for which weapon to go for, I'm basing this entirely on what's readily available in Aielund, as per your request, and there ain't many quality scythes lying around either. For a 2-hander it's either Greatsword or Greataxe. Valerfor would probably cook me in boiling oil for this (and I wouldn't blame him), but if I was going exotic with Panthro, then it's either bastard sword or katana, either with a shield.<br/>\n<br/>\nBut one of the wonderful things about Aielund (I so want to say \"is that Aielund's a wonderful thing,\" -sorry, having a Tigger moment) is that if you're operating from a quality build in the first place you should make it through if you learn how to adapt to its strengths and weaknesses.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "RunningWithWolves",
      "avatar": "no_avatar.png",
      "timestamp": "1:47 AM - Mar 07, 2019",
      "content": "<div>As i've mentioned im willing to lower Dexterity for some Intelligence in order to get Disarm, since i will likely wear a Dex item to cap AC in fullplate anyway, or buff it with potion or scroll. I also don't need any other stat aside from STR in this build. <br/>\nI just tested Disarm on some guards and it didn't work, but then i tested it on rangers and it worked perfectly. They seem to have poor ai and don't pick their weapons up. Also if i understand correctly if you have Imp. Disarm and wield a bigger category weapon, then you don't have a penalty to attack or even get a bonus to it. If it works this well in epic levels, when enemies have nasty enchanted weapons i think it will be useful in the fights with humanoids. <br/>\nSo far it looks like a better choice to me. At least its one more button to press since the build doesn't have spells. Seems more substantial than small bonus to Saves on a build that isn't focused on high saves. Unless of course im missing something and in that case i'll be thankful for any insight.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:22 AM - Mar 07, 2019",
      "content": "<div>As I said before, you will need a reasonable will save as you approach the end game. I don't want to throw spoilers out, but you may well have gained an item that boosts will nicely before then. Even so, you don't want a will save below around the mid 20s.<br/>\n<br/>\nAs far as Disarm goes, it's a -6 to your attack roll (-4 with Imp Disarm). You do get up to +4 on the attempt with a large weapon assuming it's against a smaller weapon. You're open to AoO with straight Disarm, but not with Improved. And it's normal damage. It checks against Fortitude.<br/>\n<br/>\nYour call as to whether it's worth it.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:13 AM - Mar 07, 2019",
      "content": "<div>Disarm is useful in single-player only if  the module creator made disarmable NPCs.  I have never tried it, so I don't know if the NPCs in Aielund are disarmale.<br/>\n<br/>\nI saw the katana mentioned as a possible choice of weapon.  In Aielund, katanas are great.  They have 1d8 base damage ike a longsword, and 18-20 critical threat like a scimitar, and there are several really cool katanas in the game.  I am also fond of shield AC.</div>",
      "author-color": "#00AA00"
    }
  ]
}