{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "114",
  "name": "Solo WoG",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/solo-wog-t2354874.html",
  "author": "Maximillian_Kane",
  "avatar": "10758866_1605883460.jpg",
  "replies": 25,
  "posts": [
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "2:11 PM - May 06, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hail, guys! <br/>\n<br/>\nDM Wise has recently been revamping the entire WoG server, and he's made the latest version available on th Vault. All one has to do is type Raine's World of Greyhawk on google and it'll pop up as the first choice.<br/>\n<br/>\nThere are good and bad things about playing it solo. The first good thing is that there are LOADS of quests to be done, many simultaneous plots developing, but no \"main quest\" to be done. There are ENDLESS paths from 1-40. One can start in 3 different level 1 areas, and from there pick from a handful of mid-level areas, and then start hitting the higher level areas. But, the bad part is that the server is HUGE and for someone who's not familiar with the place, you'll be pretty much lost and clueless. But, if you want to try it out, post here and I can point you in the right direction.<br/>\n<br/>\nJust as a teaser, you can start in one of 3 areas:<br/>\n<br/>\n1- The Isle of Ruskis: there's some \"pirating\" going on and you can help Shipwreck deal with his issues. Just as a fun fact, Shipwreck was actually a PC by none other than Grizzled-Dwarflord.<br/>\n<br/>\n2- Hommlet: there's trouble brewing in the village of Hommlet. You can investigate and find out who's behind it. The natural progression of this quest leads to the Temple of Elemental Evil. Just a hint. It's harder to complete the ToEE quest with a Good character.<br/>\n<br/>\n3- Borderkeep: the people of Borderkeep are besieged by countless Humanoid creatures from the Pomarj Empire. They've lost three settlements to the creatures, and you can go there to try to help them slow the advance of the Pomarj while they wait for reinforcements.<br/>\n<br/>\nIf one REALLY likes quests, one can actually do all 3, because of the way XP and encounters scale. They only scale up to a certain point. After that, they just don't give much XP. If you finish the Hommlet area as your first quest, you'll be at level 6 or 7. If you finish Ruskis, then go to Hommlet, you'll be level 7 at the end of Ruskis and 8 at the end of Hommlet. I always do Hommlet, then BK, you can finish all BK quests by level 13, whereas you'd be level 11 or 12 if you started there.<br/>\n<br/>\nThen you can explore the world and find out more. Here's a list of some of the areas (there are many more):<br/>\n<br/>\n-City of Greyhawk: many quests there.<br/>\n- Undermountain: many areas to be explored. You can level up from 1-40 only in UM.<br/>\n- Dragon Cult series (3 separate \"legs\" of this quest)<br/>\n- Against the Giants (Hill, Frost and Fire Giants)<br/>\n- The Great Northern Crusade (and many side quests)<br/>\n- Rary the Traitor (actually this one starts as \"The Soul Gem\", and there are MANY areas you can explore that are linked to this quest)<br/>\n- Underdark and Demonweb Pits.<br/>\n- A Winter Without End. <br/>\n<br/>\nTrust me when I say, if you've been playing Single Player modules, you have NEVER faced such EPIC challenges. Don't play low AC builds here, especially those without UMD, as the areas will be UNDOABLE. If you really want to TEST YOUR METTLE, this is the place to go! <br/>\n<br/>\nMagic level here is somewhat low to medium. The good items cannot be bought in shops, you need to get them in your adventures. So, are you ready to become one of the big boys? Lol!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "2:22 PM - May 06, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was about to open up a thread about this in the modules section. I have seen it on the vault.<br/>\n<br/>\nUnfortunately, it doesn't run properly with my EE (I installed everything as recommended, no other custom stuff yet, so that is not the reason). Loads horribly slow and crashes on leaving areas. Maybe it will get better with time, as both EE and the module are still under construction.<br/>\n<br/>\nMight test it with my platinum when I am through with Lord of Terror (for which I want to keep some extras in my override folder).<br/>\n<br/>\nHopefully, I will get it to run one day. Looks really interesting.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "2:30 PM - May 06, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Freaky Grandma wrote:</cite>I was about to open up a thread about this in the modules section. I have seen it on the vault.<br/>\n<br/>\nUnfortunately, it doesn't run properly with my EE (I installed everything as recommended, no other custom stuff yet, so that is not the reason). Loads horribly slow and crashes on leaving areas. Maybe it will get better with time, as both EE and the module are still under construction.<br/>\n<br/>\nMight test it with my platinum when I am through with Lord of Terror (for which I want to keep some extras in my override folder).<br/>\n<br/>\nHopefully, I will get it to run one day. Looks really interesting.</div></blockquote>\n\nHey man! Wise said he was working in some bugs for the EE version. But, since I don't have EE, I don't know whether it's working or not. You should check the forums for updates on that. I believe he made some progress recently.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "3:30 PM - May 06, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I will check, thank you.<br/>\nFrom level 1 to 40 without having seen everything yet, that sounds great indeed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "10:30 PM - May 07, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am playing it Aielund for the second time, once I will finish it I will replay it...with another build! Dwarven defenders, for now, stay there and wait! ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "3:12 AM - May 08, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Aquarius 233 wrote:</cite>I am playing it Aielund for the second time, once I will finish it I will replay it...with another build! Dwarven defenders, for now, stay there and wait! ;)</div></blockquote>\n\nTry the Shadow Priest, man. It'll make your life a lot easier <img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji2.png\" /><img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji1303.png\" /><br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "6:44 PM - May 08, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, now I'll play it, as I really want to advance into the \"northern crusade\" quest ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:35 AM - May 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In general, what things are changed from vanilla NWN? Specifically, how is Dev Crit changed?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "2:56 AM - May 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote:</cite>In general, what things are changed from vanilla NWN? Specifically, how is Dev Crit changed?</div></blockquote>\n\nIn general, DevCrit isn't changed. There are a few important changes in there, all listed in the Server Entrance, but I'll sum them up for you:<br/>\n<br/>\n1- The summoning system was COMPLETELY revamped! The summons last 5 rounds + 2 rounds per level, but they've been drastically improved. There's an item all caster classes start with called Book of Summons. You can use it to select the summoned creature from a list of possible creatures for each level. Here's the ones I use:<br/>\n<br/>\nSummon 1 - Black Bear<br/>\nSummon 2 - Brown Bear<br/>\nSummon 3 - Vegepygmy or Dire Wolf (but extended Summon 2 is better)<br/>\nSummon 4 - Large Magma Elemental or Grizzly Bear<br/>\nSummon 5- Huge Stag Beetle or Ash Elemental<br/>\nSummon 6- Legendary Boar or Xorn (I prefer Xorn, but you need Freedom to use him)<br/>\nSummon 7-9 Huge, Greater and Elder Elementals respectively. <br/>\n<br/>\nAlso, Druids and Clerics with the Animal Domain can summon a creature from one list higher, which allows them to summon a level 10 creature with summon 9. Level 10 summons are good until about level 21 or so, then they become less of a factor, even level 10 ones.<br/>\n<br/>\nAnimate Dead remains unaltered, but I believe the skells have been improved. And both Mummy Dust and Dragon Knight summons have been improved.<br/>\n<br/>\n2- There is a crafting system in place that allows players to create wands with 50 charges and to also craft scrolls with higher caster levels than they would originally. You can find more details about this in WoG forums.<br/>\n<br/>\n3- weapon buffing spells such as GMW work on bows too, adding AB and Mighty properties equivalent to the EB they add to weapons. Darkfire and Flame Weapon work on Arrow stacks.<br/>\n<br/>\n4- Rogue skills such as Search, Set Traps, Disable Traps, Open Locks, etc... are very useful.<br/>\n<br/>\n5- Animal companions and familiars can wear robes and gear, as long as it's not class-specific.<br/>\n<br/>\n6- There's a God and Pantheon system to Clerics, so be sure to check it before making one. <br/>\n<br/>\nHave fun!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:06 AM - May 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm in the midst of my first Dragon Age play-through atm, but when I'm done...<br/>\n<br/>\nOh, and just in the spirit of making the challenge even tougher for me, I thought I might try it with one of your builds, Max. I say this because I've always struggled when attempting them in the past (my problem, not the builds or yours). I also don't do casters (yet). Thus, I'm contemplating 3 builds: <strong>Champion of the Tribes</strong> (Barb 16/ CoT 22/ Rogue 2), which I'd always promised to try but haven't as yet; the not dissimilar <strong>Daelan Red Tiger</strong> (Barb 17/ CoT 18/ HS 5); and as a DEX-er, the <strong>Drow Fencer</strong> (Fighter 14/ Rogue 19/ WM 7). Reasonable for WoG? And I'll assume Rage is vanilla unless you tell me different.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:50 AM - May 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Max could work as a promoter for World of Greyhawk <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\nIn a more serious note, WoG is the best low-to-medium magic, persistent world out there, so it is well worth it if you are alright with the (high) level of challenge.<br/>\n<br/>\nDevastating critical is powerful, it is more powerful there than even most high-level modules that are full of undead &amp; constructs at VHL's because it uses a variety of opponents that do not have arbitrary enhancements to their saving throws. Some (very few) super-bosses are exempted from this obviously. Having devastating critical is so potent that is actually anti-climatic for some of us, so I use it sparingly for example but for a new player there, I do recommend to get all the help you can, you will need it till you learn the place better.<br/>\n<br/>\nMore on the difficulty...It is a huge step-up for someone that plays modules as-is till now! The first step is to start play (on hardcore rules) under Tony's A.I. some of them first, then try WoG, or else you will die by the score. Get ready for a cold bath since most of your \"reset buttons\" do not exist there, heal potions do not replenish all your hit points, there are no stones of recall and (in the live version) you cannot \"pause\" of course. The enemies are very smart, wizards, in particular, will give you a headache since they use all the best spells for their level, such as magic missile, acid arrow, Isaack's missile storm, the various Bigby's hands e.t.c. Fighters will taunt and use knockdown on you, clerics will bombard you with \"holy word\" and \"storms of vengeance\", some of them will also cast \"harm\" but this is not so often, all of them (casters) will also try to dispel you first thing, so a low caster level spell-sword will have certain problems. People who used to play Baldur's Gate II under SCS (Sword Coast Stratagems) will feel right at home with World of Greyhawk, the rest not so.<br/>\n<br/>\nNow, don't get me wrong, all of the above can be neutralized by using the correct tactics, build, and a healthy dose of luck, but all I am saying is that there should be a stepping stone first before you get into this giant of a module. Aielund Saga by Savant is a first one, The Swordflight series by RogueKnight another, and so on. And human mind is powerful tool, once you are used to this hardcore setting you will start to out-smart your enemies using their tactics against them. Having a strong build will help a LOT learning the setting, so this is where Max is right, that this is the perfect proving ground for the builds we make on ECB. Having Epic Doge &amp; Improved Evasion along with good AC, for example, is going to save you from a lot of trouble in WoG while in modules you can find those things on a ring. Heck, Sands of Fate had rings with ten properties in them!<br/>\n<br/>\nAs for the quests, those are really good, some are better than others of course and some are really old-school but in general they are well laid-out and each one will provide you with different kinds of challenge. You want the feel of a great knight going against the dark forces of Iuz? Great, then start the Northen Crusade quest and try to save the kingdom! You feel like exploring the desert? Fine, then go to save the Centaurs and find the hidden palace of Sattados the Cruel. What do you do when you have in your hands the cursed crown? Perhaps the acidic body of a powerful demon lord can melt it undoing its evil... Hidden quests, small &amp; large are waiting on every corner of this huge world and you cannot say with certainty that you have seen it all unless you invest a long time playing the module. Max exaggerated a bit when he said that there are multiple ways to forty level since the very high-level quests are specific and by nature cannot be many of them but for the lesser levels say, 1-30 lvl he is absolutely right. One thing that I wanted to mention, is that in WoG there is no arbitrary cap on experience earned, so when you fight something really strong you get what you deserve, allowing you to progress faster when you are stronger/smarter. Also, for best results, the World of Greyhawk should be played in the company of others like-minded folks, in other words, join a party online and let them old dogs of war to show you the place, it is a really good experience, trust me ;)<br/>\n<br/>\nUltimately though, I won't say that this is something that you absolutely have to try unless you want it. Play what you feel is right for you and enjoy this trip in fantasy as best as you can!<br/>\n<br/>\n<br/>\nEdit: Stag, Barbarian Rage in World of Greyhawk is very good, it literally scares the heck out of people! It is the sole reason why I made the Dragon Prophet, although that build is old now and could use a revamp for playability's sake.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "1:10 PM - May 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>I'm in the midst of my first Dragon Age play-through atm, but when I'm done...<br/>\n<br/>\nOh, and just in the spirit of making the challenge even tougher for me, I thought I might try it with one of your builds, Max. I say this because I've always struggled when attempting them in the past (my problem, not the builds or yours). I also don't do casters (yet). Thus, I'm contemplating 3 builds: <strong>Champion of the Tribes</strong> (Barb 16/ CoT 22/ Rogue 2), which I'd always promised to try but haven't as yet; the not dissimilar <strong>Daelan Red Tiger</strong> (Barb 17/ CoT 18/ HS 5); and as a DEX-er, the <strong>Drow Fencer</strong> (Fighter 14/ Rogue 19/ WM 7). Reasonable for WoG? And I'll assume Rage is vanilla unless you tell me different.<br/>\n<br/>\nCheers</div></blockquote>\n\nHey Stag! <br/>\n<br/>\nWell, I totally get you struggle with my builds, because I build for Max power at level 40, which means that the levelling is tougher (but doable) until the build matures. You need a hefty-sized bag of tricks to use my builds, which is exactly why I proposed you try WoG, to develop said bag of tricks. However, not all of my builds are like that, only the ones that can't afford regular skill dumps, etc..., because of spread constraints.<br/>\n<br/>\nIn general, also, on WoG you simply CANNOT buy any good items. You literally have to pry them off of someone's dead fingers. It's the only way to get the best items. The ONLY +5 Tower Shield in the server can only be obtained by beating a 56-AB devcritting general. The typical AC for a STR-based warrior is around 55-58 with the best gear. LOL, good luck with that! Hee hee hee.<br/>\n<br/>\nAs for the builds you mentioned, Daelan Red Tiger is undoable on WoG, as he's a VERY GOOD offensive toon, but his defense is AWFUL. He could be a great addition to a party, but solo, you won't be able to get past level 25. Trust me. Do this one on Single Player mods. Not even I can level this guy on WoG without help. And in general, like I told aquarius, try to avoid low-AC non-UMDing characters on WoG, or else you'll think it's impossible to play there. Empyre's Order of the Wyrm will get destroyed there. It could maybe work with the right items, but don't try it until you know the server. <br/>\n<br/>\nThe Champion of the Tribes could also work, but would be VERY HARD to level, because you'll need to survive 22 levels without Tumble and UMD, and would also need to know where the items that would allow you to survive are located and what strategies work with the enemies that have them, as well as what level you should be to attempt each one of them. I'd say this is not a good first build to try there, but later on, after you learn the server, it could work.<br/>\n<br/>\nThe Drow Fencer is the most appropriate one to start with out of these 3. He has periodic skill upgrades, ability to handle locks and traps, great AB and AC, so I suggest you start with that one. It won't be a cakewalk, but it's the best out of the three. <br/>\n<br/>\nThere are also a few other class combos that can work there: Fighter 12 WM 25 Rogue 3, my Ugly Mug Hero is also VERY POWERFUL offensively, but struggles in defense (needs immunities and good tactics), Bard / Fighter / RDDs are also pretty common and effective.<br/>\n<br/>\nAnd finally, on the hopes you could try something outside your comfort zone, the easiest characters to level up there are Clerics (with Animal Domain) and Druids, because of improved summons. Without summons, your life will be much harder for the first 20 levels. The BEST builds for a non-experienced player to try on WoG are Demolition Man and Shadow Priest. These don't rely on items to be powerful, meaning that you can have crappy items, but be a force to be reckoned with nonetheless. Just be sure to read the rules about gods and domains before making one. The Demolition Man has to be Ehlonna (LG) or Obad-Hai (LN) with Animal and Plant domains. The Shadow Priest has to be LN of Heironeous, I went with War and Luck IIRC. You can't have Trickery and War there and be Lawful, so I had to change it.<br/>\n<br/>\nEDIT: Read Valerfor's post. That's a good description of why enemies are so hard there. However, he forgot one thing: Enemies there USE STEALTH, so you may go inside a room thinking there are only two enemies inside, then get surrounded by 8 enemies who were hiding. LOL<br/>\n<br/>\nTake it EZ!<br/>\n<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:53 PM - May 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Maximillian_Kane wrote:</cite>\nThe Drow Fencer is the most appropriate one to start with out of these 3. He has periodic skill upgrades, ability to handle locks and traps, great AB and AC, so I suggest you start with that one. It won't be a cakewalk, but it's the best out of the three. <br/>\n<br/>\nThere are also a few other class combos that can work there: Fighter 12 WM 25 Rogue 3, my Ugly Mug Hero is also VERY POWERFUL offensively, but struggles in defense (needs immunities and good tactics), Bard / Fighter / RDDs are also pretty common and effective.<br/>\n<br/>\nAnd finally, on the hopes you could try something outside your comfort zone, the easiest characters to level up there are Clerics (with Animal Domain) and Druids, because of improved summons. Without summons, your life will be much harder for the first 20 levels. The BEST builds for a non-experienced player to try on WoG are Demolition Man and Shadow Priest. These don't rely on items to be powerful, meaning that you can have crappy items, but be a force to be reckoned with nonetheless. Just be sure to read the rules about gods and domains before making one. The Demolition Man has to be Ehlonna (LG) or Obad-Hai (LN) with Animal and Plant domains. The Shadow Priest has to be LN of Heironeous, I went with War and Luck IIRC. You can't have Trickery and War there and be Lawful, so I had to change it.<br/>\n<br/>\nEDIT: Read Valerfor's post. That's a good description of why enemies are so hard there. However, he forgot one thing: Enemies there USE STEALTH, so you may go inside a room thinking there are only two enemies inside, then get surrounded by 8 enemies who were hiding. LOL<br/>\n<br/>\nTake it EZ!<br/>\n<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk\n</div></blockquote>\n\nMany thanks, Max, much appreciated!<br/>\n<br/>\nPlenty of food for thought between both Valerfor's and your responses. I'm now torn in three directions. There's the aforementioned Drow Fencer, but - and drifting from your own builds, perhaps - also, one with loads of WM, for the crits and AB (quicker dispatching of enemies hopefully balancing the less than stellar AC); or, and this is where I'm leaning atm, a full-on DwD with EDR.<br/>\n<br/>\nHmm.<br/>\n<br/>\nOh, and on the trying \"something outside your comfort zone,\" two things: it's called a comfort zone for a reason, and if I'm attempting a whole new environment and level of difficulty, at least with a type of build whose skin I'm comfortable in, I stand more chance of seeing why I cocked-up and how to make the necessary adjustments - whether in-game or in-build. Second, please bear in mind that I have the dubious honour of being one of the few to make a balls-up of Mith's Blood and Faith, despite having read your Cleric Guide. I think I'll be trying a Ranger or Pally before going full-fledged divine. And the arcane can just go whistle.<br/>\n<br/>\nCheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "7:36 PM - May 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite><blockquote><div><cite>Maximillian_Kane wrote:</cite>\nThe Drow Fencer is the most appropriate one to start with out of these 3. He has periodic skill upgrades, ability to handle locks and traps, great AB and AC, so I suggest you start with that one. It won't be a cakewalk, but it's the best out of the three. <br/>\n<br/>\nThere are also a few other class combos that can work there: Fighter 12 WM 25 Rogue 3, my Ugly Mug Hero is also VERY POWERFUL offensively, but struggles in defense (needs immunities and good tactics), Bard / Fighter / RDDs are also pretty common and effective.<br/>\n<br/>\nAnd finally, on the hopes you could try something outside your comfort zone, the easiest characters to level up there are Clerics (with Animal Domain) and Druids, because of improved summons. Without summons, your life will be much harder for the first 20 levels. The BEST builds for a non-experienced player to try on WoG are Demolition Man and Shadow Priest. These don't rely on items to be powerful, meaning that you can have crappy items, but be a force to be reckoned with nonetheless. Just be sure to read the rules about gods and domains before making one. The Demolition Man has to be Ehlonna (LG) or Obad-Hai (LN) with Animal and Plant domains. The Shadow Priest has to be LN of Heironeous, I went with War and Luck IIRC. You can't have Trickery and War there and be Lawful, so I had to change it.<br/>\n<br/>\nEDIT: Read Valerfor's post. That's a good description of why enemies are so hard there. However, he forgot one thing: Enemies there USE STEALTH, so you may go inside a room thinking there are only two enemies inside, then get surrounded by 8 enemies who were hiding. LOL<br/>\n<br/>\nTake it EZ!<br/>\n<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk\n</div></blockquote>\n\nMany thanks, Max, much appreciated!<br/>\n<br/>\nPlenty of food for thought between both Valerfor's and your responses. I'm now torn in three directions. There's the aforementioned Drow Fencer, but - and drifting from your own builds, perhaps - also, one with loads of WM, for the crits and AB (quicker dispatching of enemies hopefully balancing the less than stellar AC); or, and this is where I'm leaning atm, a full-on DwD with EDR.<br/>\n<br/>\nHmm.<br/>\n<br/>\nOh, and on the trying \"something outside your comfort zone,\" two things: it's called a comfort zone for a reason, and if I'm attempting a whole new environment and level of difficulty, at least with a type of build whose skin I'm comfortable in, I stand more chance of seeing why I cocked-up and how to make the necessary adjustments - whether in-game or in-build. Second, please bear in mind that I have the dubious honour of being one of the few to make a balls-up of Mith's Blood and Faith, despite having read your Cleric Guide. I think I'll be trying a Ranger or Pally before going full-fledged divine. And the arcane can just go whistle.<br/>\n<br/>\nCheers!</div></blockquote>\n\nHey Stag!<br/>\n<br/>\nThe problem with non-PM STR builds is that the bosses there HIT HARD! They have really high saves, some have critical hit Immunity and those who don't sometimes have really high AC. And they have friends, and sometimes their friends are or can be dangerous. So, I would advise against trying one of these uber-offensive, defensive-lacking builds as your first character on WoG. When you get a better idea of the server, like where the good items are, what tactics work against what enemies, etc... then you can make one. If you want to go with a powerhouse warrior, do yourself a favor and use GDL's Charnel Lord or his Myrmidon Eternal. The Critical hit Immunity will allow you to survive some encounters that you otherwise would certainly perish in. There is a DevCritting boss that you can face at around level 25. If he rolls anything over 18 on one of his first 2 attacks, you're toast! You're lucky he wields a Dire Mace. Otherwise anything over 15 would be your undoing. He has something like 45 AB IIRC, and you'll have AT BEST 50 AC with such builds, probably less. And he's Undead, so you ain't Devcritting him.<br/>\n<br/>\nIf you won't go with a DEXer, like the Drow Fencer, please go with a PM-heavy warrior. You'll regret it if you don't. NOTHING compensates a low AC on WoG, at least not in all battles. In some, DevCrit may be effective, even OP'ed, in others, it'll be useless. Critical hit Immunity will always be useful. Even against mages, who will summon a Mummy Lord or Dragon Knight to beat you up.<br/>\n<br/>\nHeed my advice.<br/>\n<br/>\nTake it EZ!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "friedpiggy",
      "avatar": "no_avatar.png",
      "timestamp": "5:20 AM - May 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Have been playing through single player. Fun module. Flipping hard if you start in the wrong place (curse you Ruskis) The only complaint I have is that its very hard for a new player to find their way around. Need a map of how the various areas link together. not a detailed map of the areas, more so just a little thing showing that Greyhawk is south of Hommlet or something like that.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:42 AM - May 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Generally, the city of Greyhawk is on the north, Borderkeep is on the south &amp; the village of Hommlet is on the west side of the map. Pick as starting point Borderkeep if you are interested in a classic AD&amp;D experience, Ruskis island if you want pirates &amp; some treasure hunt or the village of Hommlet if you want the most polished (and easier at start) areas that eventually lead to the Temple of Elemental Evil, (T1-T4). The city of Greyhawk is full on quests too but you need to find them, asking around in temples, taverns or even at docks never hurts.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "7:50 PM - May 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey fried!<br/>\n<br/>\nI kind of agree with you due to the fact that WoG is such a HUGE place, it'd be nice for the new player to find their way around. On the other hand, it is meant to be a PW, and therefore doesn't need to include tools to make Single Player more viable. I'll happily be your guide through the module, though. Valerfor has produced a very good summary for you to be \"kind of\" aware of where you are, but maybe I'll go a little deeper, starting at GH (Greyhawk)<br/>\n<br/>\nGreyhawk:<br/>\n<br/>\nNorth - Shield Lands (only accessible via boat) / Ruskis (same as the previous one) / A Land that Time Forgot (only accessible after a certain quest part is completed, and only by boat as well)<br/>\n<br/>\nWest - Hommlet and ToEE (Temple of Elemental Evil)<br/>\n<br/>\nEast - Nothing<br/>\n<br/>\nSouth - Crossroads and BK (Borderkeep)<br/>\n<br/>\nHommet: <br/>\n<br/>\nNorth - ToEE<br/>\n<br/>\nEast - GH<br/>\n<br/>\nWest - Nothing<br/>\n<br/>\nSouth - Kron Hills and Gnarley<br/>\n<br/>\nCrossroads:<br/>\n<br/>\nNorth - GH<br/>\n<br/>\nEast - Cairn Hills, Urnst, Abbor Alz, KEP (Knife Edge Pass), and Bright Desert<br/>\n<br/>\nWest - Gnarley Forest and Kron Hills (North of Gnarley)<br/>\n<br/>\nSouth - Kreaglewood Forest and BK<br/>\n<br/>\nBorderkeep:<br/>\n<br/>\nNorth - Crossroads and GH<br/>\n<br/>\nWest - Welkwood and UM (Undermountain)<br/>\n<br/>\nEast - Humanoid Lands<br/>\n<br/>\nSouth - Nothing.<br/>\n<br/>\nKEP:<br/>\n<br/>\nNorth - Urnst<br/>\n<br/>\nWest - Cairn Hills<br/>\n<br/>\nEast - Abbor Alz &amp; Bright Desert<br/>\n<br/>\nSouth - Nothing.<br/>\n<br/>\nSo, basically, that's a rough \"sketch\" of WoG. What I didn't include, and won't, so as to avoid spoilers, was the list of quests and level you should be to do each quest, but if you have any questions, you could ask me via PM and I'll try to answer to the best of my ability without ruining your gaming experience. I can say that I know pretty much the whole server except UM. I know some areas in UM, but not all of it.<br/>\n<br/>\nEach area is HUGE and has sub-divisions. I won't spoil it for you, but if you have fun exploring , there is no better place to go than WoG.<br/>\n<br/>\nHave fun!<br/>\n<br/>\n@Val<br/>\n<br/>\nThe days that Moathouse was easy are long gone. It's still beatable, but WAY harder now. You should dust off one of your builds and have a go at it. It's still the same place, but MUCH improved since Wise begun working his magic! The West and East Shield Lands are simply BREATHTAKING, dude!<br/>\n<br/>\n<br/>\nTake it EZ!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "trebusze",
      "avatar": "no_avatar.png",
      "timestamp": "2:04 PM - Feb 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">How the hell do i play this server? :D<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://lh3.googleusercontent.com/4stz5Hn9meBjpvE6j5721-ByAEKNNsInsmq7SJD6B96ixhfr7Knfs05HcPdVn0X-jnFqbUc1eDd5LNJZ899FWmoFJ8d_iwuP_xMoO4i7yVIAa0-aUBCMqcojlLiTcFLWbVD3oTOw1v24-WkZXUwlb9CKEUq3NTY_Qe-IkJtvBjRrbt1rleIa2AN0j2416ym5sDCiBJ4IwxtZrFhBSWUYjrzW8c4YX0b0zsj2iPv9e51Vmcc9-nKw1Ep36pUrXluu26MjTxcSBUAAPxZ4rjoloNdJOUcFpzMk7TvM79mJokLq2iZ29mBNXtlCRdEQxM3Qkx6s8E02oJFVu0UXK06Segs5rJtwxZpxoleIV8Zr6b3JkgP6tFvSugy0Z4oddfttAS0MAqAigtMagRDHMb_Wzt30uDxo9IzSZ91ogQz0uCOep6wHjqGaQgF4WmNDSBaNGnXZYU1iSYQOF8yeG922UkYRiCY1L5Zw7_ZahmqEhDcXMAStxmxRDOXk2SnKvIn8qfb75T35_pOCYwD2Ao654TfG8xGcMBfBCgu36rvFDjPAZOG2-_Vg6Voqx0JniZdq6N2l2bDaHntN_REg_aXhhbX18F1obGPBw2G0wh2aAPJE4q-Jvv3VQcCTqtJOtCAJ_6LoaVYzqIXehgOv72pKV8RB9iAJT8KB3o0o4VfnwzS9SC5lfGcdIdCjHTCQ16Cf5PqsCbkVhnlmbVZ8wvMD_EM=w1171-h658-no\" /><br/>\n<br/>\nThis is supposed to be easy area...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:01 PM - Feb 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi trebusze! While it's not somewhere I've yet played, I bet those who have would like to know a bit more about your build (just where it is currently, not necessarily all 40 levels) before they could offer an expert opinion on what's not working or going wrong..<br/>\n<br/>\nBut I might be mistaken...<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "trebusze",
      "avatar": "no_avatar.png",
      "timestamp": "4:52 PM - Feb 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nothing much to say really. It's a lvl 2 cleric. Started at Hommlet area, basically anywhere he goes he dies quickly :p Although i din't take the Animal domain cuz i am finding Trickery to be more useful and you can't have them both, not on the lawful character at least. It will be Zen archery focused type btw. So many enemies attacking ninja style from behind while your summon is far away, holding other folks at distance lol :P <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:19 PM - Feb 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hit &amp; Run, tactics.<br/>\nYou're doing pretty OK from what I can see, keep going!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "6:50 PM - Feb 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Memorise 3 black bears. Use the book of summons to set the type of creature. Notice that everything sneaks. Grab a sling or bow. Detect mode, stalk 'em. Takes a while to get used to it.<br/>\n<br/>\nThe world is awesome, it's really rewarding if you get good at it (it's the dark souls of nwn).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Thorsson",
      "avatar": "10758835_1513245773.jpg",
      "timestamp": "9:08 PM - Feb 27, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've not played this, but I have played the PnP version of ToEE and I have played ToEE the computer game several times as well. They're not meant to be soloed; I have done it, but only as a focused sneaker. No way you ought to be able to take on the Giant Frogs solo before about 5th level, but in the module (and the original game) the frogs can grapple you with their tongue and then swallow you, so it's probably not so difficult with NWN's limitations.<br/>\n<br/>\nIn the original, you do a bunch of Fedex quests in Hommlet and you can also hire Henchmen there. Is Emridy Meadow in?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "11:54 AM - Feb 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Emridy Meadow is not in the module, this is the starter area if you go to Hommlet (which my phone autocorrected to Himmler). There are different types of frogs, more and more powerful ones spawn if you're higher level.<br/>\nThat said, it's very soloable, just pull them one by one, which you can do in WoG, and is probably the most important thing you should realise about the world.<br/>\nCleric is very good to start with.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "11:16 PM - Aug 29, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>trebusze wrote: <a data-post-id=\"14303\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=14303&amp;sid=cf7d0fffc5707a5b09a39a5996026f3d#p14303\">↑</a><div class=\"responsive-hide\">Feb 26, 2019</div></cite>Nothing much to say really. It's a lvl 2 cleric. Started at Hommlet area, basically anywhere he goes he dies quickly :p Although i din't take the Animal domain cuz i am finding Trickery to be more useful and you can't have them both, not on the lawful character at least. It will be Zen archery focused type btw. So many enemies attacking ninja style from behind while your summon is far away, holding other folks at distance lol :P </div></blockquote>\nHey mate! I suggest you read my guide called Playing Better in the Game Guides Section. I too experienced EXACTLY what you're going through the first few months I played on WoG. Thing is, this server will require you to play COMPLETELY differently than you're used to playing in Single Player mode. You'll need to be TACTICAL about where or when to engage, use consumables, set traps, conserve your spells, etc.. Basically, you'll need to learn how to play Neverwinter Nights at a high level. If that's what you're looking for, WoG is the best school you'll find out there.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "11:20 PM - Aug 29, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">WoG 101 - Monsters there use EVERYTHING the game has to offer. That means that sneaky creatures HIDE, which means you may be seeing just the least stealthy creature, and then quickly find yourself surrounded. You need to either invest points in Spot or Listen, and learn to walk around with Detect Mode ON!!!!<br/>\n<br/>\nThey also use Combat Feats and Skills, like Taunt, Knockdown, Divine Shield, Divine Might, some enemies use Disarm, etc...<br/>\n<br/>\nCasters there will dispel you ON SIGHT. It's really difficult to keep your buffs on if you don't use invisibility or stealth.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}