{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "346",
  "name": "Sorcerer Pale Master build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/sorcerer-pale-master-build-t2349752.html",
  "author": "KidMiracleman",
  "avatar": "10235447_1565972826.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "2:13 AM - Feb 08, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I am looking for a good Sorcerer Pale Master build.  The only restriction is that one has<br/>\nto take 20 levels of Sorcerer before you can take one level of Pale Master.  Was thinking of a <br/>\nSorcerer Pale Master Barbarian or Dwarven Defender build or maybe something else<br/>\n<br/>\n<br/>\nDavid<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:56 PM - Feb 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is not a good build with those restrictions in place.<br/>\n<br/>\nHaving 20 Sorcerer levels pre-epic means that your melee abilities are severely restricted. Basically you are stuck to 2 attacks/round and a base AB of 20 (if forty levels).<br/>\n<br/>\n<br/>\nAll those change though if you are interested mostly on casting spells and want PM levels just for the additional defenses. <br/>\n<br/>\nSorcerer provides natural sunergy with the Blackguard. You can go for a (Sorcerer 26/ BG 4/ PM 10) split and get incredible defenses without having to change alignment.<br/>\n<br/>\nGo for as much Charisma as you can, take Divine Shield with BG on a general Epic feat, and let PM give you the immunities. Don't forget to take the auto still line of feats so you can cast your spells while wearing a full plate and holding a tower shield.<br/>\n<br/>\n<br/>\nAll in all Blackguard will give you way more power than a Barbarian in Epic levels would do, or a Dwarven Defender for that reason. Imagine that with a base CHA of 30 (42 CHA enhanced) Blackguard will give you { +16 AC / +16 to all saves } with his abilities (Divine Shield/ Dark Blessing), as well as proficiency with heavy armor/all shields/martial weapons. In addition he will give you 1d6 sneak attack and a stacking bull's strength once per day. <br/>\n<br/>\nTo make this work even better, concetrate into the Necromany school which is also good for the theme of this character. Here is a build by <strong>Tyr </strong>that utilizes these three classes although it needs some slight adjustments (taking the BG levels in epic) to make it work in your case.<br/>\n<br/>\n<strong>The Sorcerer King</strong>  --&gt;  <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build272583.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 72583.html</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "5:30 AM - Feb 12, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Not really restrictions I put in place.  It is the server.  That you for the suggestion.  I will try that<br/>\n<br/>\nDavid<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:37 AM - Feb 12, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, i understood that. Too many PW try to restrict the powerful prestige classes in their opinion but forget to balance that out by giving to PM's their rightful proper half-spell progression or make any changes to the rest of the classes.<br/>\n<br/>\nMost people just play what's unrestricted (usually AA's or WM's), but few like you have the will to take upon the challenge.<br/>\n<br/>\nThat being said, this build is very powerful if you use it as a caster with unparalleled defenses, to give you an insight into what heights this build's defense can reach, imagine that 80 AC in a +5/+6 world is well within its reach.<br/>\n<br/>\n28 (full plate + tower shield) + 20 (EMA) + 5 (shield enhancement) + 4 (haste) + 11 (divine sheild - dodge cap) + 6 (PM) = 74 AC and you have the option of expertise/improved expertise/bigby's V as well. In a +6 environment this is at least 4 higher.<br/>\n<br/>\nAnd if your PW has the proper (modified) version of Tenser's then you can be a melee beast as well.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}