{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "993",
  "name": "One Bard tale: Bard 8/Fighter 5/Arcane Archer 27",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/one-bard-tale-bard-8-fighter-5-arcane-archer-27-t2354832.html",
  "author": "Niu7",
  "avatar": "10758869_1521841378.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "Niu7",
      "avatar": "10758869_1521841378.jpg",
      "timestamp": "10:40 PM - Mar 23, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Salut! Since NWN Enchanted Edition is coming I considered reply the whole game and want to share with you my Arcane Archer build that serves perfectly last time I play this game. <br/>\n<br/>\nThis build more oriented on bows rather than casting spells - it uses spells only for self-buffing needs.<br/>\n<br/>\nThe backstory of this build is simple - one day you realized that you want to tell the world your own story, and not tell stories about long dead heroes. But the Forgotten Kingdoms are not the place for inexperienced adventurers, especially if your weapon is a lute and a song. Therefore, you learned martial arts but approached this question creatively - as a man of art. And that's what happened.<br/>\n<br/>\nThe first thing to note that to qualify as an arcane archer, a character must fulfill all of the following criteria:<br/>\n<ul>\n<li>Base attack bonus: +6</li>\n<li>Feats: weapon focus on the longbows or shortbows, Point blank shot</li>\n<li>Race: elf or half-elf</li>\n<li>Spellcasting: a level of Bard, Sorcerer, or Wizard</li>\n</ul>\n<strong>So, Bard/Fighter/Arcane Archer</strong><br/>\n<br/>\n<strong>Race:</strong> elf <br/>\n<br/>\n<strong>Alignment:</strong> neutral<br/>\n<br/>\n<strong>Starting abilities:</strong><br/>\n<br/>\n14 str/16 dex/12 con/10 wis/12 int/14 cha<br/>\n<br/>\n<strong>Skills at level 20</strong><br/>\n<ul>\n<li>Use magic device (UMD): 22 (25) - we can use standard holy avenger item</li>\n<li>Tumble: 23 (27)</li>\n<li>Search: 5</li>\n<li>Spellcraft: 23 (24) +5 to all saving throws against spells</li>\n<li>Spot: max lvl available to the Arcane Archer</li>\n<li>Persuade: any (remember, +3 modifier from your cha)</li>\n<li>Perform: 9 (12) for Bard song</li>\n</ul>\n<strong>Skills at level 40<br/>\n</strong>\n<ul>\n<li>Use magic device (UMD): 22 (25)</li>\n<li>Tumble: 40 (50)</li>\n<li>Search: 5 or more</li>\n<li>Spellcraft: 40 (42) +10 to all saving throws against spells</li>\n<li>Spot: max lvl available to the Arcane Archer</li>\n<li>Persuade: any (remember, +3 modifier from your cha)</li>\n<li>Perform: 12 (15) for Bard song for 8 lvl bard</li>\n<li>Consider getting: Discipline, Hide, Move Silently, Listen</li>\n</ul>\n<strong>Bard spells</strong><br/>\n<ul>\n<li>Cantrips: All</li>\n<li>1st level spells: Lesser dispel, Mage Armor, Identify, Amplify also can be useful,</li>\n<li>2nd level spells: Cat's grace, Ultravision, Bull's strength</li>\n<li>3rd level spells: Displacement, Haste</li>\n</ul>\n<strong>Total damage bonus</strong><br/>\n<ul>\n<li>Enchant arrow: +14 (27 lvl of the Arcane Archer)</li>\n<li>Epic weapon specialization: +4</li>\n<li>Weapon Specialization: +2</li>\n<li>Bard song: +2</li>\n<li>Bow with Mighty: from +2 to +8 with max strength</li>\n</ul>\n<strong>Health:</strong> 270+<br/>\n<br/>\n<strong>BAB</strong> 28<br/>\n<br/>\n<strong>Attack bonus</strong><br/>\n<ul>\n<li>unarmed +31/+26+21+16</li>\n<li>with the chosen type of the bow (mundane bow) +55/+50/+45/+40</li>\n<li>with the chosen type of the bow (mundane bow) under Rapid shot +53/+48/+43/+38</li>\n</ul>\n<strong>Saves</strong><br/>\n<ul>\n<li>Will 19</li>\n<li>Reflex 33</li>\n<li>Fortitude 24</li>\n</ul>\n<strong>AC</strong> 28 (mundane)<br/>\n<br/>\n<strong>Skills and feats progressions </strong><br/>\n<br/>\nOk, start this game as a Bard, take Point blank shot and put 4 points in UMD, Tumble, Spellcraft, Persuade, Perform. This is your starting kit.<br/>\n<br/>\nAt level two add one skill point to the UMD, Tumble, Spellcraft, Persuade, Perform. At level three do the same and get Lingering song feat.<br/>\n<br/>\nAt level 4 switch to the Fighter class, save all skill points, ad one point to Dexterity and get Weapon focus feat. <br/>\n<br/>\nAt level 5 get the Rapid shot feat and save skill points.<br/>\n<br/>\nAt level 6 get Blind fight feat and save skill points, and at level 7 get Weapon specialization feat and save skill points.<br/>\n<br/>\nLevel 8 - now it's time to shoot someone. Change your class to the Arcane Archer. Add 5 skill points to the Search and the rest of the points to the Spot. Also, add one point to Dexterity.<br/>\n<br/>\nYour next progression should look like this:<br/>\n<ul>\n<li>Improved critical feat, Spot - x1 at level 9</li>\n<li>Spot - x1, at level 10</li>\n<li>Spot - x1, at level 11</li>\n<li>Dodge feat, Spot - x1, dex +1 at level 12</li>\n<li>Spot - x1, at level 13</li>\n<li>Spot - x1, at level 14</li>\n<li>Mobility, Spot - x1, at level 15</li>\n<li>Spot - x1, cha +1, at level 16</li>\n<li>Spot - x1, at level 17</li>\n<li><strong>Change to Bard</strong>, Called shot feat or Toughness feat (if you need more health, but this is really optional) or Extra music (for more songs! but this is really optional), UMD, Tumble, Spellcraft - max, Perform - x2, Persuade - rest</li>\n<li>UMD, Tumble, Spellcraft - max, Perform - x1, Persuade - rest</li>\n<li>UMD, Tumble, Spellcraft - max, Perform - x1, Persuade - rest, cha +1</li>\n</ul>\n\nOk, we did here. Half of the way is behind and we are at level 20 right now. <br/>\n<blockquote><div>\n<strong>One hudge remark!</strong> <br/>\n<br/>\nYou can change your class shifting and levels of the Bard at any levels after 13 level of your character (after 5 levels of the Arcane Archer to get Enchant arrow +3). Do this if you feel that you need more UMD, Spellcraft, and Tumble skills. And more Bard song. But remember, that you should mix them with Arcane Archer levels. For example - at level 13 and 14 get two levels of the Bard and max UMD, Spellcraft, and Tumble skills, then get Arcane Archer levels and at level 18 get one more Bard level. <br/>\n<br/>\nBy doing so, your UMD, Spellcraft, and Tumble skill scores will not match mine. For example, if you take the last level of Bard at level 18 of the character, they all will be at the 21 score. Also, if you do this - consider rising your UMD skill to the 22 later. <br/>\n<br/>\nRemember, that perform skill ALWAYS should be 9 at the Bard level 6.</div></blockquote>\n\nLet's move further now and concur epick levels!<br/>\n<br/>\nThe first thing at your first epick level - changing your class to the Arcane Archer and getting Epic weapon focus feat. You will do this at 21 level of your character. Also, add 1 skill point to the Spot.<br/>\n<br/>\nYour next five levels till level 27 will be the levels of the Arcane Archer. Through this levels add skill points to the Spot, add one more point to the Dexterity at 24 level, get Great dexterity I feat and one more feat of your taste. At the end of the topic, I will post several feats that work best with this character. <br/>\n<br/>\nAt level 27 change your class to the Fighter and get Epic weapon specialization. At this level save all skill points. <br/>\n<br/>\nAt level 28 change back to the Arcane Archer, get Great dexterity II, max Spot skill, and add one point to the Dexterity. <br/>\n<br/>\nThe next level of your character - 29 - will be the level of the Arcane Archer. Add skill points to the Spot and we are done here. <br/>\n<br/>\nAt level 30 change your character to the Bard. Max out Tumble and Spellcraft skills, add two skill points to the Perform and one feat of your taste. We are done here.<br/>\n<br/>\nAt level 31 change your class to the Arcane Archer and add all skill points to the Spot. Your next 5 level will be the levels of the Arcane Archer. Your progression should look like this:<br/>\n<ul>\n<li>Great dexterity III feat, dex +1 at level 31</li>\n<li>Great dexterity IV feat at level 32</li>\n<li>Great dexterity V feat, dex +1 at level 36</li>\n</ul>\n\nThrough all this level max Spot skill and save the rest skill points.<br/>\n<br/>\nAt level 37 change your class to the Bard and add skill points to the Tumble and Spellcraft skills till it will be 40. Add one skill point to the Perform and you are done.<br/>\n<br/>\nAt level 38 change your class to the  Arcane Archer. Max out Spot skill. <br/>\n<br/>\nAt level 39 grab Great dexterity VI or feat you like and max Spot skill. <br/>\n<br/>\nAt level 40 grab Great dexterity VI, add one point to the dexterity, max Spot skill.<br/>\n<br/>\n<strong>What to do next</strong><br/>\n<br/>\nWith this build, you will have some free skill points. Put them in Hide/Move silently in 1:1 proportion. Also, you can add some points to the Search and Listen. Or Heal if you want to be a great healer (never use it :-//). Or Discipline.<br/>\n<br/>\nNext - through my leveling guide I admit that you can get some feat at your taste. Here are some feats that will improve this build:<br/>\n<ul>\n<li>Improved initiative/Superior initiative - useful if you like to fight in the close combat and want to shot first;</li>\n<li>Toughness - if you need more health (honestly - I never take this)</li>\n<li>Epic Prowess - more attack bonus;</li>\n<li>Epic skill focus - Spot, Tumble, Listen, Hide, Move silently, Discipline;</li>\n<li>Armor skin - more AC.</li>\n</ul>\n<strong>About bows</strong><br/>\n<br/>\nThere two major group of the bows - short and large. Short bows have 1d6 damage and large bows have 1d8 damage. <br/>\n<br/>\nSince the game engine tries to produce averaged number, the basic difference between bows is 1 point of damage. It's not much, considering our bonuses. Therefore, the choice is solely in the appearance of weapons.<br/>\n<br/>\n<strong>Here is the list of some great bows that can be found in the game:</strong><br/>\n<br/>\nShortbows:<br/>\n<ul>\n<li>Assanti (HotU)</li>\n<li>Lesser Oathbow</li>\n<li>Lilting Note</li>\n<li>Phantom Bow</li>\n</ul>\n\nLongbows:<br/>\n<ul>\n<li>Forever (HotU)</li>\n<li>North Wind Bow</li>\n<li>North Wind Bow +8 (HotU)</li>\n<li>Ripper</li>\n<li>Taralash</li>\n</ul>\n\nI would like to receive your comments and critics on my build. Have a nice and fun game!<br/>\n<br/>\nP.S. sorry for my mistakes - English is a great language but it is not my native :-)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:29 AM - Mar 24, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome!<br/>\n<br/>\nThis looks good, but you need 12 Perform for the level 6 Bard song, not just 9.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Niu7",
      "avatar": "10758869_1521841378.jpg",
      "timestamp": "10:26 AM - Mar 24, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote:</cite>\nWelcome!<br/>\n<br/>\nThis looks good, but you need 12 Perform for the level 6 Bard song, not just 9.\n</div></blockquote>\n\nSalut! Sure, but you get +3 from cha. But you right - I forget to admit, that if a player will get bard levels earlier than  18, that he must put one more point in to Perform, to get it to the 10 total.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:26 AM - Mar 26, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome to the guild! :)<br/>\nA build with 27 AA levels is normally a strong archer. <br/>\nI have to say that I find it hard to evaluate this build. There is a lot of vital information missing; what abilities you pick at what levels and the ending abilities (stats). I find it hard to judge your feat selection. There must be several feats missing and I don't understand what is your main build, and what are tweaks. The same goes for skills.<br/>\nPlease read the build posting rules and use a standard formate.<br/>\nMick<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Niu7",
      "avatar": "10758869_1521841378.jpg",
      "timestamp": "2:17 PM - Mar 26, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote:</cite>\nWelcome to the guild! :)<br/>\nA build with 27 AA levels is normally a strong archer. <br/>\nI have to say that I find it hard to evaluate this build. There is a lot of vital information missing; what abilities you pick at what levels and the ending abilities (stats). I find it hard to judge your feat selection. There must be several feats missing and I don't understand what is your main build, and what are tweaks. The same goes for skills.<br/>\nPlease read the build posting rules and use a standard formate.<br/>\nMick\n</div></blockquote>\n\nSalut, Mick! Thank you for this response. A will revamp my build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}