{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "074",
  "name": "Druid Questions",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/druid-questions-t2355797.html",
  "author": "webshaman1",
  "avatar": "10404082_1510287071.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:23 PM - Sep 27, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello All, me again.<br/>\n<br/>\nMy final couple of Malazan builds should (I think) be druidic in nature (pardon the pun), and my experience is more than a little lacking in the field. So, before I embark on anything too ridiculous I thought I would consult with Guild members, who can tell me whether I'm barking up the wrong tree (yeah, now the nature puns are on purpose, sorry), or there might be something I could use.<br/>\n<br/>\nBoth builds are Imass Bonecasters - the Imass being ancestors of humanity from hundreds of thousands years ago, and Bonecasters being shamans of the clans, who are also Soletaken - the term used for shapechanging into their totem animal form - hence my thought of Druid for them.<br/>\n<br/>\nOne of these is, like most of the present-day Imass, now undead, and indeed initiated the Ritual of Tellan, triggering their immortality, such that they are now known as the T'lan Imass. This is Olar Ethil, and her totem animal is a (now undead) dragon. So I wondered about a Druid/ Pale Master mix (obviously with a few levels of an arcanist thrown in). Worth pursuing, do we think?<br/>\n<br/>\nThe other is possibly more problematic. This is Kilava. She denied the Ritual and has existed for all this time as a living Imass: a very powerful one who has also birthed gods. So far, so good. However, her totem animal is a black panther, but one powerful enough to take on and beat dragons with scarcely a thought, and that doesn't seem to chime well with druidic progression - unless panther-form scales beyond infinite wildshape levels. I considered whether Shifter - dire tiger shape would be better, but frankly have no idea, so am a bit stumped. One way around it would be to make a build that doesn't go to level 40 so I can maximize wildshape usage without deliberately gimping the build, but might that just be an easy option? Is there anything else I could do, or should I simply put this one in the too difficult pile?<br/>\n<br/>\nAny and all advice welcome (within the bounds of decency, of course).<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:30 PM - Sep 27, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A Druid/Shifter with Undead form would be better than a Palemaster mix, IMO.  There is no NWN equivalent of the Undead Dragon thingie outside of the Cult of the Dragon and Dracoliches (though there is also Kyuss and Dragotha, from Greyhawk), and there is no playable alternative for this without using CC.<br/>\n<br/>\nFor the other one, I would go Druid/Shifter and go Rak - it's a big tiger-like Outsider (which is about as close as you can get to the whole Panther thing in NWN, because the other options are NOT going to be anything near epic).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:01 PM - Sep 27, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Web - good food for thought! And at least I hadn't missed anything blindingly obvious.<br/>\n<br/>\nRak is an interesting call, but didn't they get their Ice Storms nerfed with EE? And without that, aren't they a bit poo?<br/>\n<br/>\nFor the first build, I could live without an undead dragon (oh, the wit, I kill myself! And again!), but I get what you say about undead form. The only problem really is that if that's where the build's concentration lies, it could bugger up the potency of later dragon form. And I'm not sure whether Druid or Shifter dragon would be better, either.<br/>\n<br/>\nOh good, more problems!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:05 PM - Sep 27, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, yes and no.<br/>\n<br/>\nYes, Ice Storm no longer can be meta-magiced (the nerf).<br/>\n<br/>\nHowever, as it scales with level, having lots of levels of the first class will make it stronger (because that is how Shifter stuff works).<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:47 PM - Sep 27, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Interestingly enough, my initial thought of a Druid/PM build have been done a couple of times before. Alas, the original Puff the Magic Dragon wouldn't work these days, but <em class=\"mention\">@grizzled_dwarflord</em> came up with one that would: <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build251344.html\" rel=\"noreferrer\" target=\"_blank\">Draco-lich of the Autumn Mist</a><br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: Apologies to the Dwarflord - it should read Dracolich of Autumn Twilight. Oh, and given it was apparently his first Druid build, he seems to have concocted one or two since!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:56 PM - Sep 27, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hmm...yes, I suppose that would work for a pseudo-undead Dragon!  That's thinking outside of the box!  Well done.<br/>\n<br/>\nAnd yes, Puff the Magic Dragon v 3.5 does work these days!  It is a real PITA to do, tho (I have levelled it to 40 on WoG...and it was PAINAL to do!)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}