{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "480",
  "name": "Counter to magic/clerics-Arelith",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/counter-to-magic-clerics-arelith-t2185153.html",
  "author": "Hafen",
  "avatar": "no_avatar.png",
  "replies": "23",
  "views": "3.8K",
  "posts": [
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "12:45 PM - Dec 27, 2011",
      "content": "<div>Greetings. My playing as priestess worn me down terrible, and i am looking for new character. <br/>\n<br/>\n1) She should be maximalised for PVP<br/>\n<br/>\n2)Level cap is 30, Arelith setting. That means when i take new class i need three levels of it in a row before free switching between them.<br/>\n<br/>\n3) Drow, that means elf. Subraces were removed lately, with gifts instead: +2 stat /+1ECL, +2 constitution /+0.5, Darkness 1/day +0.5, MR 32 +2 ECL, 10 000 gp +0.5ECL. I can pick up up to three of them<br/>\n<br/>\n4) Class preference is none at the moment.<br/>\n<br/>\n5) I would like to have it focused on melee, but being able to bypass magic of opponents, or to counter it as much as possible, and bring them down. Fight with pure melee can be worse.<br/>\n<br/>\n6) Weapon preference - I prefer elven style weapons like longsword, shortsword, rapier, scimitar. And dual wielding. But if neccesary i am willing to sacrifice it for better outcome.<br/>\n<br/>\n8) Maximum item enhancement - Amor usually +3, the same shields. I can get greensteal chain/scale/bended armor with no casting penalty for arcane. But these armors are just +2, shields +3 (can still be buffed by cleric upto +4/5).<br/>\n<br/>\n9) Spellcasting -I wish to build up character using magic to counter spellcasters, protecting herself from magic of divine and arcane origin, buffing herself. <br/>\n<br/>\nIn general: this character is meant to be the temple guard. Thoso troubling pristhood are usually magic-users (drow male wizards, kobolds sorcerers and others), and heretic clerics of epic levels. <br/>\n Please, do not stack ECL above 3. It is hell with ECL2 to lvl up, even with multiclass penalty which this one will likely get (only cleric does not count for her for multiclassing).</div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "12:51 PM - Dec 27, 2011",
      "content": "<div>We got also \"path of kensai\" which makes character perma hasted. In return she cannot use any kind of magic, that means also any sort of potions, scrolls. <br/>\n<br/>\nBut i think this set up could be real hell for leveling up, as everywhere are mushrooms causing poisons on stats, etc. There would be no way how to rmove it if not monks levels were taken.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:11 PM - Dec 27, 2011",
      "content": "<div>Some clarifications are necessary for this old soul to venture much further into this one:<br/>\n<blockquote><div><strong>Hafen wrote:</strong><br/>\n3) Drow, that means elf. Subraces were removed lately, with gifts instead: +2 stat /+1ECL, +2 constitution /+0.5, Darkness 1/day +0.5, MR 32 +2 ECL, 10 000 gp +0.5ECL. I can pick up up to three of them\n</div></blockquote>\nDefine \"ECL\".  In my own NWN vernacular, it means \"Effective Character Level\".  If that is what you mean, I have no idea how it would impact the effectiveness of a build since ECL was abandoned by NWN with the expansions.  If Arelith has implemented an ECL system similar to PnP you would need to detail it.  I recommend using the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/arelith-server-info-t515495.html?sid=bea023a3868db152a07200bca9f1e481\" rel=\"noreferrer\" target=\"_blank\">Arelith PW section</a> where someone has already started a thread that can be easily amended. <br/>\n<br/>\nBTW, what is \"MR 32\"?  Is this supposed to be spell resistance?<br/>\n<br/>\n(Note: Unless you use abbreviations which are common to all areas of NWN game play, server-specific ones will need to be defined at least once in any discussion.)\n<blockquote><div>\n5) I would like to have it focused on melee, but being able to bypass magic of opponents, or to counter it as much as possible, and bring them down. Fight with pure melee can be worse.\n</div></blockquote>\nI perceive a few issues of bypassing magical defenses: DR penetration (requires a minimum enhancement which may or may not be available on all weapons), concealment (if you can't strip the enemy concealment, you will have big problems hitting), elemental buffer (means you may need to be selective in achieving some magic weapon enhancement, like divine or magic damage, for instance), damage shields (pretty much assures you will need some sort of stripping mechanism or use of range attack until recipro protection ends).  Only the first few that occurred to me, though.<br/>\n<br/>\nBottom line is:  list specifically what magic you would like to focus on bypassing.  There are no \"catch-all\" builds, especially within 30 levels.\n<blockquote><div>\n6) Weapon preference - I prefer elven style weapons like longsword, shortsword, rapier, scimitar. And dual wielding. But if neccesary i am willing to sacrifice it for better outcome.\n</div></blockquote>\nI am inclined to build DevCrit vs. typically low Fort casters.  In nonDevCrit environs, IKD vs. no/low Discipline types will also work well against casters.\n<blockquote><div>\n9) Spellcasting -I wish to build up character using magic to counter spellcasters, protecting herself from magic of divine and arcane origin, buffing herself.</div></blockquote><blockquote><div> <br/>\nWe got also \"path of kensai\" which makes character perma hasted. In return she cannot use any kind of magic, that means also any sort of potions, scrolls. <br/>\n<br/>\nBut i think this set up could be real hell for leveling up, as everywhere are mushrooms causing poisons on stats, etc. There would be no way how to rmove it if not monks levels were taken.</div></blockquote>\nThese two statements seem to contradict each other.  Are you looking for a casting or non-casting remedy?  Confusing.\n<blockquote><div>\n Please, do not stack ECL above 3. It is hell with ECL2 to lvl up, even with multiclass penalty which this one will likely get (only cleric does not count for her for multiclassing).</div></blockquote>Once again, I have no clue as to how this ECL deal would impact a build.  If it just means it will more difficult to level certain class combos then get some party help until you have achieved your goal and then go dueling.  If you want to duel effectively at all levels... well... there ain't no such animal!  Builds are ALWAYS maximized for a particular level.  That's just the way it works.<br/>\n<br/>\nBased on the sketchiness of your request, I would guess a DevCrit battle cleric would serve well.  IIRC there have already been a few Arelith battle clerics posted so check around the Level 30 section and decide what appeals and what doesn't.  Any weapon that has wide crit range will suffice.  Dual-wielding may not be an option depending on which classes you combine (fighter/cleric is probably the easiest to DW a Devcrit build).</div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "10:37 PM - Dec 27, 2011",
      "content": "<div>Thanks for response!<br/>\n<br/>\nECL means system counts you several levels higher for purpose of gaining experiences. Old drow was like from prc but newly every single subrace was stripped of their bonuses and ECL and were made gifts instead of it. <br/>\n<br/>\nSR i mean Spell Resistence. <br/>\n<br/>\nI am taking into account all you have written. Dev Crit was disabled on arelith anyway. <br/>\n<br/>\nI consider taking monk: like 20 levels of monk for mind immunity spells, 30 spell resistence (20 lvls +10), high bonus speed, and all other cookies which it brings up. Also i was thinking of adding cleric and less levels of monk, but i already have a cleric. So my minds are something like that:<br/>\n<br/>\n20 monk 6 rogue 4 black guard<br/>\nStarting stats (all gifts are already counted in):<br/>\n<br/>\n10 str (2 from \"gift, ECL+1)<br/>\n22 dexterity (2 from\"gift\" ECL+further 1)<br/>\n12 constitution (2 from gift, ECL+0.5)<br/>\n14 wisdom <br/>\n12 inteligence<br/>\n8 charisma<br/>\nTotal ECL is 2.5 which is not above what i was used to on previous character.<br/>\nThe plan is to go for the dex highest as possible, to get AB up. 4 levels of blackguard to gain fourth attack, dual wielding kamas. The main reason why blacguard is poison. If i get so lots of attacks per round, once i must succed at improved KD or poisoning the target. From skills hide, move silently, discipline, tumble, umd. <br/>\n<br/>\nSecond version is to go with 6 assasin instead, to get poison, and instead of blackguard taking 4 fighter. For stripping off magic wards i hope for spell breach scrolls and similar things+wands with spells via UMD. <br/>\n<br/>\nEDIT 2: I rolled it for more detailed look how could it look like<br/>\n<br/>\n<strong>Monk 20, rogue 6, blackguard 4</strong><br/>\n<strong>HP</strong>s:238<br/>\n<strong>AC</strong> naked: 34<br/>\n<strong>SAVES</strong>: 18 27 16 <br/>\n<strong>Spell Ressitence</strong>: 30<br/>\n<strong>BAB: </strong>21<br/>\n<strong><br/>\nAbilities: </strong><br/>\nSTR 10<br/>\nDex 30<br/>\nCon 12<br/>\nInt 12<br/>\nWis 14<br/>\nChar 8<br/>\nSneak attack: 3d6<br/>\nSneak attack (blackguard): 1d6<br/>\n<strong><br/>\nFeats:</strong> ambiodexterity, armor skin, blind fight, epic prowess, epic weapon focus: kama, weapon focus: kama, great dexterity I, two weapon fighting, improved two weapon fighting, finesse, +all feats from monk up to lvl 20, rogue lvl 6 and blackguard lvl 4. <br/>\n<strong>Skills</strong>: 33 discipline, 43 hide and move silently, 40 tumble, umd 24 (after modifiers from stats applied), 27 +- free points. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWhat do you think of this? The only thing which scares me is low dmg, but i hope the high number of attacks could balance that - spamming improved knockdown with poisoned kamas.<br/>\n<br/>\nEdit: well kensai is well looking, but in the end it would mean i cannot use any scroll to dispell some ward on target, nor buff myself via potion/scroll/spell. The only one thing to heal my toon would remain healing kit. Not a easy to level up even (for example animate dead scroll i can use from the lowest levels if i have umd...and that zombie is unbreakeble even by npcs i fight with my lvl 17th cleric   ).</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:51 AM - Dec 28, 2011",
      "content": "<div>That kensai choice seems lame to me.  There are lots of ways to get around permahaste which, although being a boon if you can utilize it, isn't crucial to a build.  All builds will benefit sufficiently enough from the use of general magic items that if it were removed, those builds would suffer a vast disadvantage, one that even permahaste would not compensate.  My opinion, naturally.<br/>\n<br/>\nYour concern about low damage is well-founded.  As soon as you encounter any toon with Stoneskin, Ethereal Visage, etc. you won't do any damage except for crits... and kamas are one of the worst crit weapons, unfortunately.  So lets get real clear on what you are trying to achieve, eh?<br/>\n<br/>\nYour original request seemed to be focused on PvP caster-killing, right?<br/>\n<br/>\nIf so, I can't understand why you would go the DEX route since casters will not be trying to hit you with anything other than spells or damage shields so your AC can be relatively low.  If you were going against uber AB foes, then DEX makes sense.  You'll need more damage than this without DevCrit available.  KD only last 1 round so unless you cause LOTS of damage while they are prone, they just heal/buff and resume casting.  If they have recipro damage going, they can kill you while they are prone.  If you stop spamming KD to use a range attack, the enemy will be able to cast.<br/>\n<br/>\nBTW, maxing Discipline on a DEX build is pretty much a waste of skill points.  AB of over 33 is rather easy to reach even on a level 30-cap server.  I suggest limiting the skill investment only for strength builds (or those where strength can be boosted magically) where it will do some good.  Besides, casters will not be trying to KD or disarm you.   <br/>\n<br/>\nDispelling buffs is only one problem and it won't strip all defenses in one cast anyway.  Level 14 caster is immune to Lesser dispel, level 19 caster immune to standard Dispel Magic.  They will still be trying to spam IGMS or Bigby's or Harm... or some no-save spell.  Depending on SR 30 to save you won't work against any Level 24 caster with Epic Spell pen (any d20 automatically beats the SR). Also, any arcanist can use an Iron Golem polymorph (either by casting or scroll) to avoid the few paltry sneaks thrown in here if they become a problem.<br/>\n<br/>\nIf you don't do significant damage while they are prone your toon will die pretty quickly.  Ever consider Stunning Fist?  At least that lasts 3 rounds and you could switch back an forth with kamas if you still want to dual-wield, but you'll need higher WIS to get the stuns to succeed often.<br/>\n<br/>\nPerhaps some sort of monk/ranger if you can choose some effective FE's?  But I can't help with your ECL calculations for combos.  Another option might be to go the taunting route to reduce their casting effectiveness BEFORE attacking.  That BG would help with a plan like that.<br/>\n<br/>\nDunno.  IMO, either of the 2 builds posted should be rather easy for any decent caster to rule.</div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "2:13 AM - Dec 28, 2011",
      "content": "<div>Good points.<br/>\n<br/>\nI can raise str instead taking dex up to 30. 3 levels of assasin to get UMD + poisons, and 5 levels of fighter to weapon spec. + epic weapon spec. This would give me another 6 points for dmg. Weapons +3 have also +6slashing damage. <br/>\n<br/>\nSo maybe leaving dex on 24 at base, str 16 for +3, raising it further with equipment up to 22 (+6) or more. I could deal then about +18 damage+base kama dmg + D6 X element (which i can put on weapon). <br/>\n<br/>\nIf i saved discipline i could use traps instead, or spot.<br/>\n<br/>\nEdit: I walked through spells on nwn wiki, and 30/+5 DR is hard to pass by, since the only way to reach +5 is GMW. I will ask if its possible to make wand/scrolls for mordenkays disjunction from our lvl 30th house mages. <br/>\n<br/>\nAll bigbies spells have reflex save but clenched fist which remained fortitude. It's a bit good news, now just look at the reflex and max it up to pass DC 40+-...</div>"
    },
    {
      "author": "DeadZombie",
      "avatar": "no_avatar.png",
      "timestamp": "3:37 AM - Dec 28, 2011",
      "content": "<div>It's hard to take down caster classes on arelith. So much is geared toward them. With their epic boons to casting. They are going to deal over 500 dmg with a greater ruin and 600 dmg with a hellball that wont damage them or knock them down. I can't even remember all the other crazy epic boons they get. Then you got to deal with time stop etc.<br/>\n<br/>\nThen as a meleer you are going to have a problem with the armor slow penalty 20% slowing you down trying to chase a hasted mage.<br/>\n<br/>\nBest ways I've dealt with them in the past.<br/>\n<br/>\nArcane archer busts through Premo and stoneskin can hope to interrupt spells.<br/>\nWeapon Master with a scythe and a Gsanc scroll.<br/>\nSmite paladin if they are evil.*edit* Just realized you were in the underdark well this one wont work for sure.<br/>\n<br/>\nThe rules of engagement for pvp stops you from just popping out of hide and just laying the smackith down or laying a ton of traps.<br/>\n<br/>\nI know it wasn't much information but I hope it helps. I've not been able to crack how to stop a caster on there really since giga made it a low item server then Mith buffed them all to crap.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:39 PM - Dec 28, 2011",
      "content": "<div>How about unarmed Monk 24 / Fighter 6, with d20 damage, damage from STR and +6 damage from EWS? If +5 gloves aren't available, you can take the Improved Ki Strike feats to get +5. Since I know nothing about Arelith, this might not be a good idea.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:39 PM - Dec 28, 2011",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong>How about unarmed Monk 24 / Fighter 6, with d20 damage, damage from STR and +6 damage from EWS? If +5 gloves aren't available, you can take the Improved Ki Strike feats to get +5. Since I know nothing about Arelith, this might not be a good idea.</div></blockquote>\nYeah, I would be inclined towards a high-speed closer type like this, ignoring stealth completely since they are likely to have True Seeing in place at all times anyway.  My casters always do.  Just concede detection and make it a foot race.  Casters pale when confronted with real speed and will attempt to sanctuary to avoid melee range threats. <br/>\n<br/>\nThere is a documented speed exploit that the OP can try that involves Expeditious Retreat, Mass Haste &amp; monk speed to close at incredible speeds.  Also, a heavy investment into Initiative feats to get the first strike in as often as possible may sway the probabilities in one's favor.  I would really look at stunning fist's 3 round neutralizer over KD's 1 round and plan to dispatch your foe within that duration with high damage (And yes, SF can be spammed like KD).  Scythe is good for the lower APR rates but with monk APR &amp; AB progression, those 3 rounds can be made very effective unarmed.  Keep in mind that a concealed enemy will bypass most attacks so APR is key to assuring enough strikes land quickly.<br/>\n<br/>\nEssentially, though DEX assures very high reflex saves, it is at the cost of any sort of reliable damage strategy and I have ALWAYS recommended offense over defense in PvP.  As soon as you blink... you die!  <br/>\n<br/>\nAs far as dealing with Hellball, Greater Ruin... those uber arcanist staples... they are 1 cast per day.  Once avoided, the caster is dead meat vs. speed threats... usually.<br/>\n<br/>\nNaturally, this discussion is more skewed towards PvP.  A mob of duergar clerics spamming Implosion and Harm is an entirely different can of worms.</div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "8:23 PM - Dec 28, 2011",
      "content": "<div>Problem with stunning fist is i need wisdom. More wisdom = less AB, less AB = lower chance to hit the spellcaster. Thats why i plan to max out dexterity, to avoid thing mage will laugh at my attempts to hit him even. <br/>\n<br/>\nAlso, to get rid off some really bad stuffs like these elemental shields i have to pick up UMD (spell breachs scrolls, mordekains disjunction scrolls/wands) that means beside primary combat class (to achieve 4th attack) third class into it. <br/>\n<br/>\nThe damage wont be so much different with kamas +6 slashing damage +D6 divine essence (or we can get some fixed essences i must look into it now in what numbers) +6 from fighter feats and base d6, and still i can raise up str by items a bit.<br/>\n<br/>\nFor the ongoing damage from spells, wouldnt be helping feats like energy resistence?<br/>\n<blockquote><div>\nResist energy<br/>\nType of feat: general<br/>\nPrerequisite: fortitude save bonus +8<br/>\n<br/>\nSpecifics: The character gains +5 resistance against the chosen type of energy. (The first 5 points of damage of this type of energy are ignored.) <br/>\nThe choices for types of energy are acid, cold, electrical, fire, and sonic.<br/>\nEpic energy resistance supersedes resist energy; they do not stack.<br/>\nThis feat does stack with — and is applied before — other (non-feat) sources of damage resistance. </div></blockquote>\nThis means i can add damage resistence on items as well and it will stack with that feat. I quess i am able to take up to two of these before epic level.<br/>\n<br/>\nAlso, I can pick up two epic versions (instead of armor skin or great dex):\n<blockquote><div>Type of feat: defensive (general feat) (epic)<br/>\nPrerequisite: 21st level<br/>\n<br/>\nSpecifics: The character gains resistance 10 to the selected damage type (acid, cold, electrical, fire, or sonic). This feat may be taken multiple times, to a maximum of 100 resistance to each damage type.<br/>\n<br/>\nUse: automatic <br/>\nThis feat does stack with — and is applied before — other (non-feat) sources of damage resistance. </div></blockquote>\n\nSo i could cover like 4 kinds of energies, or one as 20/- and two other 5/- + items both. This will require reaserch IG what mages are using for spells. Bigbies spells I can bypass by high reflex save - dex is helping there and i can still go for some improving feat, just to pray to not roll 1s . <br/>\n<br/>\nWhat makes me sad are spells like IGMM. No idea how to counter them.<br/>\n<br/>\nAnd for death magic spells, yes protection will be needed sadly. The same for harm. Fortitude save is not going to be so high.<br/>\n<br/>\nFor the Initiative thing, do i really need feats when i plan like +10 on initiative roll from dex.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:20 AM - Dec 29, 2011",
      "content": "<div><blockquote><div><strong>Hafen wrote:</strong>Problem with stunning fist is i need wisdom. More wisdom = less AB, less AB = lower chance to hit the spellcaster. Thats why i plan to max out dexterity, to avoid thing mage will laugh at my attempts to hit him even. \n</div></blockquote>\nHigher than default base WIS helps, but so does Owl's and any other boost.  WIS 10 will win vs. Fort saves of 25 and under on a 30 cap server... a save type which is usually very low on casters except recipro builds, IMO your main problem.  (BTW, there is no  immunity/protection against Death Armor.)  Stunning fist gradually increases its effectiveness until the highest toon level is reached.  One strategy that seems to work well is to equip all the WIS-booting items (except if on armor, which is rare), and then after stun, switch out for all the AB boost stuff.  Meleers have loads of free quickslots for such equipment manipulations in PvP.\n<blockquote><div>\nAlso, to get rid off some really bad stuffs like these elemental shields i have to pick up UMD (spell breachs scrolls, mordekains disjunction scrolls/wands) that means beside primary combat class (to achieve 4th attack) third class into it.\n</div></blockquote>\nHow much have you PvP'd against decent casters?  While you are wasting an entire round trying to strip buffs &amp; shields via scrolls you will get captured by a Bigby or decimated by IGMS. In PvP, whoever can be the most debilitating in the first round or 2 usually wins.  Scrolls are just too slow for PvP, IMO, from getting my butt reamed learning that fact.  There are a few exceptions like summon/shapechange scrolls, but they will not help a meleer enough.\n<blockquote><div>\nSo i could cover like 4 kinds of energies, or one as 20/- and two other 5/- + items both. This will require reaserch IG what mages are using for spells. Bigbies spells I can bypass by high reflex save - dex is helping there... -clip- </div></blockquote>\nHuh? Has Bigby's been changed on your server?  None of them allow saves except for Clenched Fist and that one is a Fort save.  DEX won't help at all against any vanilla Bigby.\n<blockquote><div>\nWhat makes me sad are spells like IGMM. No idea how to counter them.\n</div></blockquote>\nEasy.  Run like a lightning bolt and stun them.\n<blockquote><div>\nFor the Initiative thing, do i really need feats when i plan like +10 on initiative roll from dex.</div></blockquote>True.  DEX will help with Initiative and reflex saves, but little else vs. casters.<br/>\n<br/>\nBTW, I recommend your change your topic heading to \"<strong>Counter to magic/clerics on Arelith</strong>\" since that is the main focus of this thread.</div>"
    },
    {
      "author": "DeadZombie",
      "avatar": "no_avatar.png",
      "timestamp": "4:19 AM - Dec 29, 2011",
      "content": "<div>Hmm, maybe the 20 monk 10 rogue build would be better? If they have damage shields though it might be a pain. The only save you will really have to worry about is fort. Implosions being a pain in the butt from clerics. Not sure how high a monk can get his fort.</div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "10:21 AM - Dec 29, 2011",
      "content": "<div>HipMaestro:<br/>\nSorry for confusion. Yes it is Arelith focused, and bigbies should have been change for reflex saves all, but clenched - fortitude remains. <br/>\n<br/>\nI know how pain in ass was bigbies spells for my rogue on other server. Fortunetly i could avoid it this time via reflex save, though no idea how high can be that DC.<br/>\n<br/>\nAlso, with 11APR i cannot simple smash someone who has that silly shield on himself. Each hit dealing in return 60 dmg...oh no way, two or three rounds and i killed myself (depending how often i hit with these 11 attacks).</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:51 PM - Dec 29, 2011",
      "content": "<div><blockquote><div><strong>Hafen wrote:</strong>HipMaestro:<br/>\nSorry for confusion. Yes it is Arelith focused, and bigbies should have been change for reflex saves all, but clenched - fortitude remains.</div></blockquote>\nNo problem.  But if I were you, I would revise the original title to reflect this so others don't get confused.  As the topic owner, only you or the admin can do that.  Since spell changes like this will certainly bias building toons on Arelith, it should probably be mentioned in the PW topic for Arelith. \n<blockquote><div>\nAlso, with 11APR i cannot simple smash someone who has that silly shield on himself. Each hit dealing in return 60 dmg...oh no way, two or three rounds and i killed myself (depending how often i hit with these 11 attacks).</div></blockquote>\nActually, 60 is very low unless Arelith has nerfed them.  Typical high-level arcanists average over 100 per hit with 3 shields up.  The only recourse is by kiting with a range weapon until the shields drops then switch and run in to stun before they can reset them.  You'll avoid all touch attacks and, with enough speed, can remain outside of all casting ranges.  But it takes a VERY long time.  Casting a Mord via scroll means the caster can be moving towards you while you read it and if hasted will be able to match your stripping animation with a touch attack kill.  <br/>\n<br/>\nIf you could find enough feats for about a half dozen or so Epic Energy Resist for fire &amp; acid you could just wade in and wail.  I have no idea how to do that with a level 30 cap toon.  Are there any items on Arelith granting significant resist for these damages?</div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "8:16 PM - Dec 29, 2011",
      "content": "<div>Well only one shield can be actived at time. <br/>\n<br/>\nI can enchance my items in enchantment basin for damage resistence, or even get crafted essence for it (i think its permanent). This counts together with \"ressit energy\" and \"epic resist energy\". Or should.<br/>\n<br/>\nLINK:<a class=\"postlink\" href=\"http://wiki.arelith.com/Alchemy#Warding_Essences\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Alchemy#Warding_Essences</a></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "9:34 PM - Dec 29, 2011",
      "content": "<div><blockquote><div><strong>Hafen wrote:</strong>Well only one shield can be actived at time.</div></blockquote> <br/>\nThat's a serious nerf then.  I'd concentrate on acid since that will do that 60+ you mentioned.  Elemental shield is about half that (around 35 or so per hit) of fire.  After about caster level 11 they would probably be using extended Mestil's if given the choice.\n<blockquote><div>\nI can enchance my items in enchantment basin for damage resistence, or even get crafted essence for it (i think its permanent). This counts together with \"ressit energy\" and \"epic resist energy\". Or should.</div></blockquote>\nDepending on how much crafted resistance you can accrue you may be able to get away with just a few epic energy feats then.<br/>\n<br/>\nFrom the wiki:<blockquote><div>\"...damage resistance from feats (resist energy and epic energy resistance) does stack with — and is applied before — other sources of damage resistance, even though the feats do not stack with each other.\"</div></blockquote>(The italicized part means Resist Energy does not stack with Epic Energy Resistance, but you may have known that already.)<br/>\n<br/>\nBut check with your server admin to be sure it hasn't been custom modified further, before you plan your build.<br/>\n<br/>\nSounds like recipro may have been nerfed enough that it can be bypassed with some equipment and enough ftr levels to grab the feats.  <br/>\n<br/>\nHow about no-save necro spells like Power Words?  Those can be a HUGE problem in PvP.  Did Arelith add saves to them also?</div>"
    },
    {
      "author": "DeadZombie",
      "avatar": "no_avatar.png",
      "timestamp": "10:20 PM - Dec 29, 2011",
      "content": "<div>No saves on power words. Or that darn cleric spell that blinds you. Mages can cast in imp expertise. And Greensteel armor and shield which gives them high ac and - spell failure but I do not know the %.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:52 AM - Dec 30, 2011",
      "content": "<div><blockquote><div><strong>DeadZombie wrote:</strong>No saves on power words. Or that darn cleric spell that blinds you. </div></blockquote> That's Sunbeam and they must have changed that one because the vanilla spell allows a reflex save.  If you can cast any sort of cheap summon and send it in ahead of you, you can avoid the blinding part but not the damage unless you save again. Worse IMO is Word of Faith, that can stun for a long time and instakill low-level creatures.\n<blockquote><div> Mages can cast in imp expertise. And Greensteel armor and shield which gives them high ac and - spell failure but I do not know the %.</div></blockquote>Are sorcs allowed to exploit Divine Shield with pally levels on Arelith?  If so, combined with Imp Exp they can become pretty much untouchable while casting except by... maybe... <br/>\n<span style=\"font-size:150%;line-height:normal\">...an Arcane Archer.</span> *lol* <br/>\n<br/>\nThat's probably the best counter, BTW.  AA's rule all casters, arcane &amp; divine alike, fearing no recipro dmg, they can dish out hurt with that nasty DR penetration arrow at long range!    Spam some called leg shots to slow down their escape attempts and... voila'... a dead magic-dealer with lots of feather-tipped sticks jutting out from its body! Though maybe this server decided to nerf their enchanted arrows?  Even so, with a few cleric levels for extra \"ummph\" they won't miss except for concealed foes occasionally (and who doesn't?) and will do lots of x3 crits.  Probably the best all-purpose, situation-independent caster killer around and needing nothing but mundane bows.</div>"
    },
    {
      "author": "DeadZombie",
      "avatar": "no_avatar.png",
      "timestamp": "3:16 AM - Dec 30, 2011",
      "content": "<div>It was infact Word of Faith. :p <br/>\n<br/>\nYeah the sorcs can use divine shield you see sorc pallys all the time or sorc bgs with it.<br/>\nAA enchant is the same.<br/>\n<br/>\nSeems they are the only build that can do so since sneaks have to pop out and talk before they attack.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "4:33 AM - Jan 02, 2012",
      "content": "<div>BTW, for arrows you can get 3 damage types on them (the arrows bonus +4 pricing from arrow metal type, then if you have a bundle you can add a perm and a temp essence to it and when you make the arrow the temp essence turns to perm) or at least I'm pretty sure you can, there is also alchemist fire you can add on for 1d6 fire damage (not sure if it works for arrows or if it stacks but that is a possibility for better arrows)<br/>\n<br/>\nSome of this might not work now don't know what changes have happened but you could test it. Though I'd put it out there anyway.</div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "3:38 PM - Jan 29, 2012",
      "content": "<div>Well seems i found solution.<br/>\n<br/>\nI simple dropped any primary combat class, taking up to 25/27 levels in monk.<br/>\n<br/>\nNow i consider just two variations.<br/>\n<br/>\nStats are going to be the same:<br/>\nSTR 10<br/>\nDEX 32<br/>\nWIS 14<br/>\nINT 12<br/>\nChAR 8  <br/>\n<br/>\nFirst one is 25 monk 5 assasin. Base attack 20. 3d6 death attack. Pre-epic feats for dual wield, toughness. Epic feats: epic focus on kamas, 3 times improved resistence to the magic+epic provess/great dex/armor skin. <br/>\n<strong> Spell resistence </strong>will become like<strong>41</strong> in total. Most spellcasters can reach up to 36 penetration. Majority of them multiclass at least 3 levels so it lowers their penetration to 33. The need to roll 8 to penetrate my monk would mean almost 50% chance to fail. <br/>\n<br/>\nSecond option is to take jsut 3 levels in assasin. I would get basic SR 37 + feats (up to 41-43). In this variations i consider taking another two feats for dexterity leaving SR at 39. <br/>\n<br/>\nHer equipment is going to be like:<br/>\n2 x kama +3, +6 priece damage, +D6 essence damage (divine up to fire) <br/>\nsilk shirt +2 AC, +1 dex <br/>\nboots +2 dex<br/>\ncloak +1 dex and str<br/>\nrings both  +1 dex and str<br/>\ngloves  +1 dex and str<br/>\namulet  +1 dex and str<br/>\nhelm +3 deflection AC<br/>\n<br/>\n---&gt; in total:+8 dex (rounded at 40 without taking feats), +5 AC, +4 str. she would be able to use wands of vestment/scrolls, magic armor, premoniation scrolls, spell breaching scrolls, also each part of cloths can be enhanced with energy resistence 5/-. <br/>\n I could take con bonus instead str, trading +2 damage for +60 hps. <br/>\n Ending AC should be like  46 with magic vestment, without haste, without potion of warding givng +3 natural AC. Dispelling like greater dispell shouldnt work on her since it must pass the SR, unlike spell breatch.<br/>\n<br/>\nSo she would deal little damage, but on the other hand, wizard focused character could hardly threat her with spells, she could poke him to the death no matter what time it takes. In mass battle she can bother spellcasters by dispelling them with scrolls, trying to knock them down etc.The only thing which makes me sad is her relative low AB only about +36 but woudlnt Divine power scroll solve that?</div>"
    },
    {
      "author": "johnbonmovi",
      "avatar": "no_avatar.png",
      "timestamp": "1:19 PM - Jan 31, 2012",
      "content": "<div>Lots of experience with mages on arelith here, these builds being posted will not survive, repeat not survive against any decent mages.  For example on this server I had a mage who could tensers into a form, with buffs that had 52ac and 38ab... with acid sheath and other buffs you would be dead.  If you are a build that doesn't have SR, you will get dispelled and bigbied and then die.  Arelith has godlike casters in-effect the only way to win would be to drop out of stealth and gank while unbuffed which unfortunately isn't an option.  The best counter to other mages on arelith is a mage.  Also, a dex based build is a simply terrible idea on arelith and are painful as hell to level up, especially in the underdark where the majority of mobs you will grind on are undead, or simply immune to crits/sneaks for no particular reason.</div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "12:26 PM - Feb 01, 2012",
      "content": "<div>Even when i can outrun them (170% speed bonus), almost immune to their spells and removing their spells?<br/>\n<br/>\nOnce polymorfed, they cannot cast spells which will help at least other members of my party to wear them down. Leveling so far isnt hell, if you have umd, know places and have few others to accompany. For example in company cleric around 12th level my monk with kamas went through all as through butter even on 10th level. I reached AC like 40 just with few simple buffs. So far it is working for now.</div>"
    },
    {
      "author": "johnbonmovi",
      "avatar": "no_avatar.png",
      "timestamp": "5:08 AM - Feb 02, 2012",
      "content": "<div>Your ab is too low you won't kd them or even hit good ones, without even trying hard on arelith you can get a mage to 52 ac, if you invest in ice thats easily 62, and there are ways to bump it even further.  You'll kill bad mages, but good mages will still tear you apart.  Also if we're talking about party members, how about that battle-cleric fighting for the epic mage, who will hit you with his 48ab on every attack and likely have more hp and ac than you.</div>"
    }
  ]
}