{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "110",
  "name": "The Skilled and Sneaky Draconian Arch-Druid [SSD] (Druid 36/Monk 1/Rogue 3) plus a discussion of DMR Dragon builds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-skilled-and-sneaky-draconian-arch-druid-ssd-dr-t2355112.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "2",
  "views": "7.3K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:32 AM - Jul 21, 2019",
      "content": "<div><span style=\"font-size:175%;line-height:normal\"><strong>The Skilled and Sneaky Draconian Arch-Druid [SSD] (Druid 36/Monk 1/Rogue 3) plus discussion of DMR builds</strong></span><br/>\n<br/>\n<strong>Introduction</strong><br/>\nThis build was inspired by all the dragon builds out there, dragons are cool! I wished to make a dragon build which includes very strong spell casting as well as some rogue class skills at the end (to take advantage of the excessive skill points Druids get). There are different flavors of dragons! For example there are better builds for 'combat dragons' such as <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/order-of-jormungandr-1-69-t2355108.html\" rel=\"noreferrer\" target=\"_blank\">Valerfor's Order of Jormungandr 1.69</a> and <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=8&amp;t=515398\" rel=\"noreferrer\" target=\"_blank\">Maximillan Kane's Champion of the Wilderness</a>. My dragon build is focused on very strong spell casting, with a Dragon Shape which is 'good enough', a lot of skills up his sleeve, and he's a little sneaky (who doesn't love that?). And I will quote Valerfor here, who has written the best comment about different flavors of dragons:<br/>\n<blockquote><div><cite>Valerfor wrote:</cite>\nDragons, when not nerfed (like in many, many other worlds) are amazing! And the also have different playstyles each one of them. Your Dragon has a lot of spell-powers for example, OoJ will have the best melee abilities &amp; another \"classic\" Dragon (Druid 28/ Monk 2/ Shifter 10) could be a Dragon fire-breathing machine. Let that sink for a while...A party of Dragons. Name them after the GoT ones, Meraxes, Balerion &amp; Drogon, shape-change into different colours each &amp; go to town.\n</div></blockquote>\nIt's optimized for play on the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/\" rel=\"noreferrer\" target=\"_blank\">World of Greyhawk</a> (WoG) persistent world (PW) server which is a challenging low to mid level magic environment, and has been play tested there to level 40. I've taken out a few of the major bosses (Arbas, Emeraxis, Trok, Maggris the demi-god of spiders, Dragotha the Dragolich, The Sultan), but have yet to take on the biggest bosses of the server, being Orcus/Jubileth/Lloth/WDK. I've play tested this until about level 15 in <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/aielund-saga-act-i-nature-abhors-vacuum\" rel=\"noreferrer\" target=\"_blank\">Aielund</a> as well, but I got bored of annihilating the modules and switched to WoG for a harder challenge. It should be strong elsewhere except in super high magic environments where other builds would be optimal. If I do change my build after fighting the biggest bosses I will make some edits but I think this build is going to be good enough. I thought it was time for this build to be finalised.<br/>\n<br/>\nThis build should be no surprise to the ECB or WoG communities as I've asked for a lot of feedback and help on the build from a lot of people. This is my first dragon build and was my first time playing on the WoG persistent world. People assisting me include Valerfor (who has been my Druid/Dragon mentor and who still corrects me!) and a lot of WoG players (BlackCobra, Knight_oflimbo, WebShaman, maeglhachel, gkorjax, MrKWMonk, MrZork) who are exceptional NWN players in their own right. DM Wise referred me to <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/true-seeing-t3591-s20.html\" rel=\"noreferrer\" target=\"_blank\">a thread written by The_Krit</a> on the Listen and Spot skills to help me with skill distribution. I've done a stack of research and reading on Druid / Dragon builds as well when designing this build, but even still there is stuff I am learning and being corrected on. For example I was recently advised by Grimnir and Valerfor that Dragon Shape has a random 'bite' attack which occurs approximately 1/3rd of the time, and will drop one's AB by 6, and yes its documented in <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Dragon_shape\" rel=\"noreferrer\" target=\"_blank\">the Wiki</a>. Anyway, feel free to comment if you do pick up anything strange. I have tried my uttermost with this large volume of content to keep it error free. I hope you enjoy this post!<br/>\n<br/>\n<strong>What the build can do</strong><br/>\nIn Druid form, he is a <strong>formidable </strong><strong>spell caster</strong>. This includes:<br/>\n- with capped Wisdom from items when resting, he can cast up to 75 memorized spells per day. 7 casts per day of level 7-9 spells, 8 casts per day of level 5-6 spells, 9 casts per day of level 3-4 spells and 10 casts per day of level 1-2 spells. I also added Scribe Scroll as a backup to make sure he doesn't run out of spells, in case he has trouble finding somewhere to rest and this has served me well in WoG. If this is unnecessary in the module you wish to play, there is limited exp gain, or if you just don't like the feat then please take Zen Archery or Knockdown instead at level 12, I totally understand. Scribe Scroll just fits well from a role playing sense of an Arch-Druid.<br/>\n- with 36 caster levels, spells last a long time (ie an extended Stonehold spell will last 72 rounds), buffs are undispellable aside from Mord's (and in game I have found my buffs can resist Mord's somewhat against some opponents), spell penetration is very good and can be made even better with a caster level 36 Nature's Balance spell<br/>\n- DC for spells are very nice with high wisdom plus three spell school foci (choose three schools from conjuration, necromancy, transmutation or evocation). Conjuration buffs up grease/stonehold and storm of vengeance DCs and is very strong. Necromancy buffs up slay living and finger of death DCs and is also very strong against non-death immune opponents. Transmutation buffs up entangle and drown DCs. Drown is strong against enemies with immunities, as it requires one to be non-living or have complete magic immunity to be avoided. Evocation is strong due to the large number of spells which use it but it uses reflex saves for half damage and in a challenging module one will get frustrated by the rogueish types out there with evasion/improved evasion (I certainly was). I decided not to use SF feats on evocation.<br/>\n- enormous crowd control for mobs with the grease (DC 35) / entangle (DC 33) / stonehold (DC 40) / storm of vengeance (DC 43) combo - reflex and will saves<br/>\n- single target control with hold animal (DC 34) and hold monster (DC 32) - will saves<br/>\n- single target instant death with slay living (DC 37) and finger of death (DC 40) - fortitude saves<br/>\n- single target near death with drown (DC 38, all living creatures) - fortitude save<br/>\n- spells which ignore saves such as harm (living) / heal (undead) (no save, and is automatic near death in Vanilla NWN, limited to 250hp on WoG server) and creeping doom (up to 1000 damage, which will be <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Talk:Creeping_doom\" rel=\"noreferrer\" target=\"_blank\">reached 95% of the time at caster level 24</a>)<br/>\n- very strong defensive capacities as a caster with close to 400hp unbuffed, barkskin (up to +5 natural AC), monk wisdom AC combined with owl's insight (up to +12 wisdom), stoneskin/greater stoneskin/premonition (up to 30/+5 DR soaking up to 360 physical damage), freedom of movement/death ward (death spell immunity)/spell resistance (up to SR 48), immunity to grease/entangle/web, +8 AC from tumble 40, +9 to saving throws against spells from modified spellcraft 45, uncanny dodge (UD), evasion, an animal companion and summons (up to summon creature IX/elemental swarm) to help tank damage and do damage<br/>\n- heal and mass heal (which I like to put on scrolls) to help keep the caster/companion/summons/party members alive and help damage undead enemies<br/>\n- UMD 33 modified to be able to cast scrolls/use wands from other caster classes without chance of failure, and to use most equipment from other classes (like those Harps which you pick up that you normally have to sell)<br/>\n<br/>\nIn Druid, Water Elemental and Dragon Shape (DS) forms, after level 31 he has <strong>formidable </strong><strong>rogue class skills</strong> which allows him to:<br/>\n- disable / retrieve traps (disable trap up to DC 66 unbuffed). In addition many modules will grant you exp for disabling traps, which is nice.<br/>\n- detect stealthy enemies (listen 60 and spot 26 with owl's insight active, no items)<br/>\n- should be able to detect most traps and hidden doors with search 29 (up to DC 49 unbuffed)<br/>\n- should be able to open most locks with open lock 25 in druid form [Take 20 DC 45] / 31 in elder water elemental form  [Take 20 DC 51] / 32 in elder air elemental form [Take 20 DC 52] / 39 in dragon shape form [Take 20 DC 59], can be buffed further with Cat's Grace potions/Greater Cat's Grace Spell, or Dexterity armor/shields/helm, or armor/shield/helms with open lock. Please note Thieves Tools can only be used in Druid form, and not in polymorphed form.<br/>\n- in Druid form able to set all deadly traps except deadly gas traps without any items with modified set trap 11 buffed by +4 from One with the Land. Traps cannot be set in polymorphed form.<br/>\n<br/>\nIn Dragon Shape form (up to three usages / day) he is a <strong>formidable </strong><strong>tanky melee combatant</strong>, with 854 HP, 79 AC, DR 40/+6, 6 attacks per round with Monk UBAB progression with around AB 50 with flurry of blows, various immunities (particularly sneak attack/mind immunity and immunity to the choice of fire/cold or acid), blind fight and 2d6 sneak attack. With capped strength from extended Blood Frenzy and Aura of Vitality the AB would be 52, adding Aid + Bless potions it would be 54, adding Wilderness areas it would be 56. If one can cap Dexterity whilst shifted (ie Greater Cats Grace + an item or two) AC would be 85.<br/>\n<br/>\nHe has the ability to do <strong>ranged damage</strong> with spells (ie call lightning / icestorm / flamestrike / firestorm / storm of vengeance) plus scrolls. If you also want to shoot them with a sling or bow then take Zen Archery at level 12 instead of Scribe Scroll. At level 40 with capped wisdom, it should net an AB of 42 (44 in wilderness areas) with a mundane shortbow with 2d6 sneak attack and three attacks per round which is not bad. I always thought that Zen Archery would be redundant with the ability to polymorph to do physical damage, all those sneak attacking archers up in guard towers etc I have encountered have changed my mind! Not to mention petrification spamming monsters and devastating critical fighters. Let your summons tank the damage while you shoot away, sounds like a good idea to me. Just be aware a cleric with Zen Archery will always outshine you due to their awesome AB and Divine Favor buffs.<br/>\n<br/>\n<strong>Weaknesses</strong><br/>\nNo build is perfect. I've spent a bit of time overcoming some weaknesses in my build and developed some strategies. None of which are critical, thankfully.<br/>\n<br/>\n- No investment in discipline. This is not as bad as you think, due to the build's high AC and general availability of knockdown immunity items. They need to hit you in order to knock you down, and there will be an penalty for attempting a knockdown on a huge creature. Regardless of one's AC, a knockdown immune item is attractive, particularly without Uncanny Dodge it will lead to one losing both Dodge AC and Dexterity AC, which could be quite a large drop in AC. Preferably a knockdown immune helmet is best so you can retain this ability when polymorphed (in WoG, this item is called a 'Thieves hood' and can only be used by rogues / those with UMD). In Aielund this Thieves Hood helmet I believe can be bought from the Thieves Guild in Act 2 and there should be vendors in Act 4 who sell knockdown immune helmets as well. Of course there are always boots which do the job in caster form. In dragon form and particularly with uncanny dodge it isn't overly critical. I have been knocked down before in Dragon form with little consequence really apart from injured pride as high AC, high HP and huge size in dragon form combined with uncanny dodge and DR 40/+6 helps is very protective (I've found this out when I forget to equip my Thieves hood). Its more of an issue in water elemental form or bear form without uncanny dodge due to the lower HP and DR, I had a near death in water elemental form against a whole mob of spell resistant speedy monks with improved knockdown and a death in Monk Bear form against a mob of 30 bandits, half of whom were clerics spamming greater dispelling on me removing all my buffs and grease spells, the others using improved knockdown on me. Both situations are highly situational. Any mob that wishes to knock you down with this build usually has to contend with your high DC grease/stonehold/SoV spell combo first but both mobs had answers for it. And if I was a better player, I wouldn't try to take on a mob of spell resistant speedy monks or 30 bandits at once in the first place. Maybe no more than 5 at time at most. Anyway, lesson learnt. And once I got that knockdown immune helmet plus uncanny dodge, it is enormous insurance to the player not dying.<br/>\n<br/>\n- Invisibility potions/scrolls for stealth (ie. invisibility/slay living cheese), this is not really a weakness, I bought some invisibility potions and spent 84 skill points elsewhere. <br/>\n<br/>\n- Uncanny dodge at level 39 is a little late in my build to be honest but done to avoid the 20% multiclass exp penalty for as long as possible with my class level combo. I worked around it for quite some time with smart game play (like not taking on 30 enemies at once, except when I did take on 30 enemies at once).<br/>\n<br/>\n- Regarding uncanny dodge and discipline, I seriously considered a D32/M3/R5 split to get UD earlier, 3d6 sneak attack and max discipline/deflect arrows/monk speed at the expense of 1 druid bonus feat / 4 caster levels including 4 spell penetration and less protection against Mord's. However my goal was to be a strong caster with DS as only one part of the tool kit. Such a split is still strong, and it might be grounds for a different dragon build (albeit slightly less caster focused). I also thought about a D32/M5/R3 split for immunity to disease, but I found RE diseases its rare for them to afflict you with a high fortitude score when polymorphed, and if you do get afflicted, at least in the persistent world I played in the ability damage was easily managed by chugging down potions of lesser restoration, and the high fortitude saves in polymorph form were also good enough the disease to not to persist.<br/>\n<br/>\n- I haven't taken the knockdown / improved knockdown feats because I figured extended Grease/extended Entangle/extended Stonehold/SoV could do a similar role. Those spells will last over a 40/42/72/36 round duration respectively with a huge AOE and target reflex and will saves (which covers the weak saves of many class types - fighters, support casters, rogues and arcane spell casters, the only exception being monks and magic immune enemies, but these enemies have a strong defense against everything). The only problem is spell casting cannot be done in polymorph form so a bit of planning is involved. Knockdown is certainly useful to reduce the amount of times one shifts in and out of into Dragon Shape as one cannot cast spells polymorphed, but warned there are certainly a few knockdown immune enemies in the late part of modules (particularly the end game of Aielund and the WoG PW). I chose not to heavily invest in it for this spellcasting type dragon build. <br/>\n<br/>\n- On the topic of AOE spells, AOE dispels cast by wizards and sorcerers are very powerful against divine spell casters who use AOE spells due to the way the mechanics work (using the charisma modifier for non-wizards to defend against dispel attempts, rather than wisdom, my charisma modifier is negative). So that 72 round extended stonehold might get dispelled without too much difficulty by a good wizard. This has certainly been my experience. Just something to be aware of. My druid's personal buffs are still difficult to dispel as the mechanics use caster levels. For more details, read the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Dispel\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki Page:Dispel</a>.<br/>\n<br/>\n- Levels 1-6 can be tough but this is true of most classes. I found myself able to manage with summons / animal companions / sling in a challenging environment. In a less challenging environment you could go scimitar/shield and chainmail and hit them in melee for kicks! Once you hit 7 and get that monk level and stoneskin at 8 from Druid 7, you are going to start cruising around in buffed monk bear style! <br/>\n<br/>\n- Reflex saves are low in druid form, but when you have Monk evasion and able to polymorph to water elemental or dragon shape, your saves go to about 25-35 odd. In addition one gets +9 to all saves against spells and one can avoid traps with high search and disable trap skills so this no longer is an issue. Watch out for those traps early on though! At one stage I considered taking the Epic Reflexes feat, but I felt this was redundant with the high dexterity scores of the common epic level polymorphed forms (water elemental and dragon shape). <br/>\n<br/>\n- Str 8 in druid form is playable in terms of weight management but you will want to have a strategy in place which includes avoiding tower shields, getting greater magic bags (-80% weight) / bags of holding (-100%) as well as the bull's strength spell and items which buff strength (ie belt of stone giant strength) as soon as possible. When I was excessively encumbered I couldn't play as a spellcaster (which is also ok if you are fine with playing as a Monk Bear, I did a large portion of the WoG Pomarj arc as a non-spellcaster, but the build is stronger if one can unload spells before polymorphing).<br/>\n<br/>\n- Level 21-29 can be tough whilst you are waiting to get dragon shape, but the powerful spellcasting abilities + summons + water elemental form was certainly manageable until then. I took DS at level 30, which is the earliest one can get DS without taking Champion of Torm (CoT) levels, and earlier than many dragon builds. DS is a huge power spike for this build.<br/>\n<br/>\n- Be wary of Dodge AC and Dexterity AC. Dodge AC (and Dex AC to an extent) is awful in that it provides a false sense of security. It will be inactive when flatfooted (ie not hitting an opponent, drinking a potion etc). In water elemental form this is 10 AC (dodge) + 6 AC (dex) respectively, in dragon shape, this is 20 AC (dodge) + 13 AC (dex) respectively. I would encourage hitting enemies as much as possible whilst polymorphed to keep Dodge AC and Dexterity AC up! Once uncanny dodge is obtained, Dexterity AC bonuses will remain no matter what (but Dodge AC will still need to be managed).<br/>\n<br/>\n- Enemies who have devastating critical -&gt; this is a terror for anyone, except for Pale Master builds who are critical hit immune. Dragons are not critical immune so I am very wary of these guys, even with a Dragon's very high fortitude save! That being said, having a high AC is actually very protective against critical hits, potentially granting even immunity to devastating critical if you get it high enough. To explain this, one has to understand the mechanics of how <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Critical_hit\" rel=\"noreferrer\" target=\"_blank\">critical hits</a> work, and the concept of a <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Threat_roll\" rel=\"noreferrer\" target=\"_blank\">threat roll</a>, and I think the wiki links listed explain this quite well. The basics are that if your AC is more than 20 higher than your opponents AB, then you will never be hit by a critical hit. Yes they will hit you if they roll a 20, but they will never critical hit you if your AC is that high due to the threat roll mechanics. Other ways to manage devastating critical hit is to <em>stay away</em>, let your elementals (who are critical hit immune) tank damage whilst you cast spells, of which you have a huge number of choices depending on whether they have immunities or not (if they are immune, creeping doom will always work). <br/>\n<br/>\n- Enemies with petrify abilities -&gt; this is a terror for the solo player. Thankfully Summon Creature VII to IX summons an elemental which is immune to petrify. Iron Golem form (from the Shapechange spell - level 9) or Water Elemental form is also petrify immune, so both are options. All these are good choices against weak petrify enemies. Against stronger enemies with petrify you are in a bit of a bind. High fortitude saves (which druids possess) plus the +9 to saves against spells are protective but will not make you immune. Either bring a friend along who can reverse the petrify, stay away and fight from long range, or take a 5% risk of instant.  <br/>\n<br/>\n- <strong>Terrain</strong>. This is the bane of any Dragon build. Dragons are huge creatures and cannot fit through standard doorways so be aware of this when indoors! It's generally not going to kill you though, its just more annoying in that it will force one to shift out of dragon shape, but one can use DS three times per day, so every usage does count.<br/>\n<br/>\n<strong>Discussion of other Druid / Monk / Rogue (DMR) Dragon builds</strong><br/>\nThe class distribution of D36/M1/R3, as far as I am aware, has not be used before, and I have searched the ECB archives, Tapatalk ECB forum and Google search. As far as I know, this is a unique build.<br/>\n<br/>\nFor comparison here are all the other DMR Dragon builds I could find.<br/>\n<br/>\nThere are 7 Druid/Monk/Rogue builds in the ECB archives. Two builds do not take Dragon Shape which are <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build117712.html\" rel=\"noreferrer\" target=\"_blank\">SharpDog's D20/M12/R8 build</a> and <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build246355.html\" rel=\"noreferrer\" target=\"_blank\">The Shadow's Breath (D20/R13/M7)</a>. Two builds cannot legally take the Dragon Shape feat due to the NWN v1.69 patch, which are <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build196069.html\" rel=\"noreferrer\" target=\"_blank\">Shadowy Dragon (D14/M1/R25)</a> and <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build200033.html\" rel=\"noreferrer\" target=\"_blank\">The Equaliser (D15/M6/R19)</a>. This leaves three ECB archive DMR dragon builds. Regarding the ECB tapatalk forum, there are two DMR dragon builds I could find, <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/nimble-mystic-dragon-druid-28-monk-9-rogue-3-t2354876.html\" rel=\"noreferrer\" target=\"_blank\">Caliax's Nimble Mystic Dragon (D28/M9/R3)</a> and <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/druid-monk-rogue-ideas-t2354773.html\" rel=\"noreferrer\" target=\"_blank\">VonMord's D32/M5/R3 build</a>. <br/>\n<br/>\nI thought I would give it a go at analysis of the remaining five DMR dragon builds. Bear in mind I've only done one dragon build so far, so there are others out there who are far more expert than me on this topic, but it forms part of general assessment of the quality of this build compared to others, so what the heck, lets go.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build310681.html\" rel=\"noreferrer\" target=\"_blank\">The Perfect Combatant (D26/R13/M1)</a> I think is an ok build. It has 7d6 sneak attack damage, takes Dragon Shape at 33 which is great and has blind fight/improved critical/improved knockdown/expertise, SF/GSF/ESF: conjuration (for great DCs with grease/stonehold/storm of vengeance), great rogue abilities and skills with uncanny dodge/improved evasion/hide/move silently/set trap/disable trap/listen/UMD/tumble etc. It has a 20% exp penalty from level 22 onwards which could be a turn off for players using single player modules where exp gain is limited. Buffs are undispellable apart from Mord's. Thax commented Cons 14 would improve spell casting ability and survivability with +80hp. I understand a SR of 32 for monsters is the maximum default used by monsters, so a caster level of 26 should succeed with spells 75% of the time against most non-monk non-caster max SR monsters (need to roll a 6 to 20) and spell penetration could be enhanced with with Nature's balance (I think my maths is correct here, correct me please if I'm wrong). Casting could be improved by taking D28/R11/M1 which also adds a bonus epic druid feat in exchange for 8 skill points, a rogue epic feat and 1d6 sneak attack, not sure if that would necessarily improve the build.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build230606.html\" rel=\"noreferrer\" target=\"_blank\">Nimble Dragon (D30/M9/R1)</a> takes Dragon Shape at 34 which is good! However it has some problems. I think there are two redundant feats, namely Dodge and Mobility. The Dodge feat provides Dodge 1 AC bonus against your current opponent, and Dragon Shape already reaches the Dodge AC Cap of 20, so this should be useless once you get DS. Mobility 4 AC bonus against attacks of opportunity is essentially redundant with high levels of tumble and you will not be spellcasting or attacking with a sling when polymorphed. Rogue 3 would also provide uncanny dodge. Stopping leveling Druid at 30 is odd. I would have preferred a D28/M9/R3 or D32/M5/R3 split for example. <br/>\n<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build152600.html\" rel=\"noreferrer\" target=\"_blank\">Dragon Slinger (D20/R13/M7)</a> takes Dragon Shape at 39 which is a little late as I think many modules will be concluded by then. I personally like to take DS a bit earlier, as DS is a huge buff to any Druid build. I think it dodges the 20% multiclass exp penalty until level 33. It makes use of zen archery and rogue sneak attack. It seems to be an unusual build focused on sneak attacks and attacking with a sling. <br/>\n<br/>\nRegarding the two Tapatalk DMR ECB builds, both take initial Wis 18 and Int 16 for an extra 43 skill points, which I think is ok. However I do think one gets a huge amount of skill points anyway with the DMR class combination plus human race. Like we are talking about 300+ skill points with Int 14 and human race. To give you an idea of the number of skill points I had, I had so many I was asking the WoG players for advice what to do with them in their forum, and I spent 160+ skill points with the first rogue level at character level 31 (which actually wasn't a huge deal, I could play ok until then). So I would tentatively propose that Int 16 is overkill. Dropping Int to 14 and increasing Cons to 14/Dex to 10 would improve durability as a caster with +80hp, +1AC +1 reflex saves +2 concentration, and has been a common suggestion made by Thaxll'ssyllia, in the old ECB forum.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/nimble-mystic-dragon-druid-28-monk-9-rogue-3-t2354876.html\" rel=\"noreferrer\" target=\"_blank\">Caliax's Nimble Mystic Dragon build (D28/M9/R3)</a> I like! I still think it can be improved. Strengths include maxed discipline, having SF/GSF/ESF conjuration, BF/IC unarmed, uncanny dodge, epic prowess, nice monk speed, knockdown/improved knockdown (albeit late), maximum hide/move silently (which can be further buffed by +14 with camouflage and one with the land and extra dexterity from polymorph). It doesn't seem to be very extensively play tested (only in the PGCC module - please correct me if I have got this wrong) from what I read. Dragon Shape is taken at 39, when the leveling up can easily be redistributed to take the feat at 33 for play-ability, as mentioned many modules will be over before you get to level 39. Expertise / Improved expertise I think is excessive when a druid can have a Dragon Shape AC of 77 with only buffs and no items, and I think AB should be your focus when playing in dragon form. It might help in the early game, vanilla NWN (and I think Aielund?) allows spell-casting whilst in improved expertise mode which is super strong but many persistent worlds (including WoG, Arelith) and some modules will not allow this, not even potion usage. I have a bias towards D32/M3/R5 or even a D28/M7/R5 build (its also kinder regarding multiclass exp penalties) but that's just me.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/druid-monk-rogue-ideas-t2354773.html\" rel=\"noreferrer\" target=\"_blank\">VonMord's build (D32/M5/R3)</a> in the non-finalised build section I also think is not also bad! Things I like include Dragon Shape at 33, maxed out discipline which is nice, some Monk speed and R3 giving uncanny dodge + whole bunch of class skills. The class distribution of D32/M5/R3 is ok and grants immunity to diseases. I would prefer maximising concentration as a caster, and use the skill points from lore + elsewhere to do it. From what I read VonMord from the thread feels strongly about not skilling up concentration, but I think its no good if you can't cast a spell which could be lifesaving because a kobold arrow tickles you or because of a Melf's acid arrow hitting you every round or something like that. Most modules have shops which will identify things for you at an affordable rate so Lore tends to be more of a luxury rather than a necessity, although sometimes Lore can be used to solve quests. It is true one could always shift without needing a concentration check or use a heal/invis potion or whatever, but with so many caster levels, I think the player will want to be casting spells and not be interrupted. I would drop the Extra Stunning Attacks feat (due to the nerf to 1 round, it would have been good in previous patches, even I have never used stunning fist with a 40+ DC in dragon shape, and Monk 5 grants 5 uses per day anyway), Expertise and Armor skin feat (Monk Dragons have plenty of AC already) and take SF/GSF/ESF: Conjuration as suggested by Valerfor, the grease/stonehold/storm of vengeance combo is super strong, and with high caster levels/high wisdom score seems too good to pass up, unless of course if all your enemies in your module have immunities to knockdown and mind affecting spells, then one could choose other good choices such as Necromancy, Transmutation or Evocation, or leave Armor Skin/Expertise and take Improved Knockdown or Zen Archery. As discussed I like the D32/M3/R5 better (trading disease immunity for +1d6 sneak attack, earlier uncanny dodge, more skill points) but D32/M5/R3 is still a powerful class combo.<br/>\n<br/>\n<span style=\"font-size:175%;line-height:normal\"><strong>The Skilled and Sneaky Draconian Arch-Druid (SSD): The build</strong></span><br/>\n<br/>\nThere are a couple of options with the build, depending on the situation:<br/>\n<br/>\n<strong>General feat level 12: Scribe Scroll, Zen Archery or Knockdown</strong><br/>\n- At character level 12, I would recommend the feat chosen could one of three feats. I've chosen <strong>Scribe Scroll</strong> because this build is designed for a persistent world with good access to gold and exp, and some limitations on healing, and I like having 50 heal scrolls/finger of death scrolls etc in my bag. Its also good from a role-play perspective of a wise Arch-Druid scribing a whole bunch of scrolls (of death) before bed time. This is probably not appropriate if you are on a single player module with limited exp. I would strongly encourage picking something else it that case. <strong>Zen Archery </strong>would be the next best feat I would take. Zen Archery grants you for the ability to shoot them with reasonable AB, if you don't want to get close like some petrification casting monster, some devastating critical using fighter, or if they are high up in some guard tower you can't access in polymorphed form. Rogue will provide a slight boost with sneak attack damage, which will usually be relevant. Or maybe you have some cool arrows, like an Arrow of Slaying you want to use. <strong>Knockdown </strong>is useful to spam on casters who are not knockdown immune and you want to preserve those Dragon Shape usages/day. If you don't like those feats, then other choices could be Spell Focus: Transmutation/Evocation, Toughness (which will also buff your poly-morphed forms HP - but I have not found HP not a problem) or Improved Critical (unarmed) to help get through damage resistant critical vulnerable enemies, but Scribe Scroll, Zen Archery or Knockdown probably provide the most versatility to this build.<br/>\n<br/>\n<strong>First Monk level at level 7 (for playability) or level 21 (for +1 AB)</strong><br/>\n- For the advanced player, the first level of Monk could be taken at character level 21 for an extra +1AB (Yay!). That being said, I am not an advanced player, and I needed every advantage I could get in a challenging persistent world I knew nothing about, so I took that level of Monk at 7 for playability and enjoyment. If you are good enough / know the module well and want maximal level 40 power -&gt; taking that monk level in epic levels is ideal for sure. So it is worth considering if you think you can do it! But if you aren't sure, I'd suggest playing it safe. <br/>\n<br/>\nDruid(36), Monk(1), Rogue(3), Human<br/>\nLawful Neutral<br/>\n<br/>\nSTR: 8<br/>\nDEX: 10<br/>\nCON: 14<br/>\nWIS: 18 (34)<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Druid(1): Spell Focus: Conjuration, Greater Spell Focus: Conjuration<br/>\n02: Druid(2)<br/>\n03: Druid(3): Blind Fight<br/>\n04: Druid(4): WIS+1, (WIS=19)<br/>\n05: Druid(5)<br/>\n06: Druid(6): Extend Spell<br/>\n07: Monk(1): {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n08: Druid(7): WIS+1, (WIS=20)<br/>\n09: Druid(8): Empower Spell<br/>\n10: Druid(9)<br/>\n11: Druid(10)<br/>\n12: Druid(11): WIS+1, (WIS=21), Scribe Scroll (or Zen Archery / Knockdown)<br/>\n13: Druid(12)<br/>\n14: Druid(13)<br/>\n15: Druid(14): Spell Focus: Necromancy<br/>\n16: Druid(15): WIS+1, (WIS=22)<br/>\n17: Druid(16)<br/>\n18: Druid(17): Greater Spell Focus: Necromancy<br/>\n19: Druid(18)<br/>\n20: Druid(19): WIS+1, (WIS=23)<br/>\n21: Druid(20): Great Wisdom I, (WIS=24)<br/>\n22: Druid(21)<br/>\n23: Druid(22)<br/>\n24: Druid(23): WIS+1, Great Wisdom II, (WIS=26)<br/>\n25: Druid(24): Great Wisdom III, (WIS=27)<br/>\n26: Druid(25)<br/>\n27: Druid(26): Great Wisdom IV, (WIS=28)<br/>\n28: Druid(27): WIS+1, (WIS=29)<br/>\n29: Druid(28): Great Wisdom V, (WIS=30)<br/>\n30: Druid(29): Dragon Shape<br/>\n31: Rogue(1)<br/>\n32: Druid(30): WIS+1, (WIS=31)<br/>\n33: Druid(31): Epic Prowess<br/>\n34: Druid(32): Epic Spell Focus: Conjuration<br/>\n35: Druid(33)<br/>\n36: Druid(34): WIS+1, Spell Focus: Transmutation, (WIS=32)<br/>\n37: Rogue(2)<br/>\n38: Druid(35)<br/>\n39: Rogue(3): Greater Spell Focus: Transmutation, {Uncanny Dodge I}<br/>\n40: Druid(36): WIS+1, Great Wisdom VI, (WIS=34)<br/>\n<br/>\nHitpoints: 394<br/>\nSkillpoints: 313<br/>\nSaving Throws (Fortitude/Will/Reflex): 25/35/18<br/>\nSaving Throw bonuses: Spells: +9, Fear: +2<br/>\nBAB: 24<br/>\nAB (max, naked): 24 (melee), 25 (ranged)<br/>\nAC (naked/mundane armor/shield only): 30/30<br/>\nSpell Casting: Druid(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nSome in game stats at level 40 (on 21/7/2019, WoG server):<br/>\nDruid form: HP 394, AC 51 (with +5 robes, +5 AC ring, Monk Wis AC and barkskin buff), Wisdom 46 (buffed to cap), F26/R19/W42. Spell resistance 48 (when buffed)<br/>\nLevel 7-9 spells: 7 casts per day, Level 5-6 spells: 8 casts per day, Level 3-4 spells: 10 casts per day, Level 1-2 spells: 11 casts per day<br/>\nSpell DCs: Grease 10 + 1 + 18 + 6 = 35 (R, Conj), Entangle 33 (R, Trans), Hold Animal 34 (W, Ench), Hold Monster 34 (W, Ench), Call Lightning 33 (R, Evoc), Firestorm 35 (R, Evoc), Stonehold 40 (W, Conj), Slay Living 37 (F, Necro), Drown 38 (F, Trans), Finger of Death 40 (F, Necro), Storm of Vengeance 43 (R, Conj)<br/>\n<br/>\nElder water elemental form: HP 554, AC 62, Str 36/Dex 22/Cons 23, AB 36/33/30/27/24/36 (with flurry), Dmg 2-20 +13 (Crit 20/x2) +2d6 sneak. Crit immune, Sneak immune, Fire immune, Mind immune, Knockdown immune (with Thieves Hood equipped)<br/>\n<br/>\nProper AB calculation for Dragon Shape (thanks to Valerfor, don't trust the sheet): 24 (BAB) +23 (57 Str) +6 (Enchantment of your claws) -2 (Huge size) -2 (Flurry of blows) +1 (Epic Prowess) = 50AB.<br/>\n<br/>\nDragon form: HP 854, AC 79, Str 57/Dex 36/Cons 32, DR 40/+6, AB 50/47/44/41/38/50 (with flurry of blows), Dmg 2-16 +23 (Crit 20/x2) +2d6 sneak. Sneak immune, Fire/Cold or Acid immune (depending on dragon form), Mind immune, Knockdown immune (with Thieves Hood equipped). If I can cap strength to 60 (eg. with extended Blood Frenzy and/or extended Aura of Vitality)-&gt; +2 AB. If using bless and aid potions-&gt; +2AB. If in the wilderness +2AB.<br/>\n<br/>\nConcentration 43(45), Disable Trap 42(46), Listen 42(54), Open Lock 25(25), Search 27(29), Set Trap 9(11), Spellcraft 43(45), Spot 8(20), Tumble 40(40), UMD 34(33)<br/>\n<br/>\n01: Concentration(4), Spellcraft(4), Save(20), <br/>\n02: Concentration(1), Spellcraft(1), Save(25), <br/>\n03: Concentration(1), Spellcraft(1), Save(30), <br/>\n04: Concentration(1), Spellcraft(1), Save(35), <br/>\n05: Concentration(1), Spellcraft(1), Save(40), <br/>\n06: Concentration(1), Spellcraft(1), Save(45), <br/>\n07: Concentration(1), Listen(10), Tumble(10), Save(31), <br/>\n08: Concentration(1), Spellcraft(2), Save(35), <br/>\n09: Concentration(1), Spellcraft(1), Save(40), <br/>\n10: Concentration(1), Spellcraft(1), Save(45), <br/>\n11: Concentration(1), Spellcraft(1), Save(50), <br/>\n12: Concentration(1), Spellcraft(1), Save(55), <br/>\n13: Concentration(1), Spellcraft(1), Save(60), <br/>\n14: Concentration(1), Spellcraft(1), Save(65), <br/>\n15: Concentration(1), Spellcraft(1), Save(70), <br/>\n16: Concentration(1), Spellcraft(1), Save(75), <br/>\n17: Concentration(1), Spellcraft(1), Save(80), <br/>\n18: Concentration(1), Spellcraft(1), Save(85), <br/>\n19: Concentration(1), Spellcraft(1), Save(90), <br/>\n20: Concentration(1), Spellcraft(1), Save(95), <br/>\n21: Concentration(1), Spellcraft(1), Save(100), <br/>\n22: Concentration(1), Spellcraft(1), Save(105), <br/>\n23: Concentration(1), Spellcraft(1), Save(110), <br/>\n24: Concentration(1), Spellcraft(1), Save(115), <br/>\n25: Concentration(1), Spellcraft(1), Save(120), <br/>\n26: Concentration(1), Save(126), <br/>\n27: Concentration(1), Save(132), <br/>\n28: Concentration(1), Save(138), <br/>\n29: Concentration(1), Save(144), <br/>\n30: Concentration(1), Save(150), <br/>\n31: Disable Trap(25), Listen(20), Open Lock(25), Search(23), Set Trap(9), Spot(5), Tumble(20), UMD(34), <br/>\n32: Concentration(2), Spellcraft(5), <br/>\n33: Concentration(1), Save(6), <br/>\n34: Concentration(1), Save(12), <br/>\n35: Concentration(1), Save(18), <br/>\n36: Concentration(1), Save(24), <br/>\n37: Disable Trap(11), Listen(8), Search(3), Spot(3), Tumble(10), <br/>\n38: Concentration(2), Spellcraft(5), <br/>\n39: Disable Trap(6), Listen(4), Search(1), <br/>\n40: Concentration(2), Spellcraft(5), <br/>\n<br/>\n<span style=\"font-size:75%;line-height:normal\"><strong>Edit:</strong> fixed some minor typos, reworded to emphasize this is my first DS build. <strong>Edit 2:</strong> fixed up some more typos and modified formatting slightly. Added details on knockdown immune helmets in Aielund. added some comments on devastating critical enemies, added section on petrify using enemies</span></div>"
    },
    {
      "author": "Entropy_Prime",
      "avatar": "no_avatar.png",
      "timestamp": "6:28 AM - Oct 06, 2020",
      "content": "<div>Thank you for this build. I am playing a variant of this build and it works very well in WOG.</div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "5:05 PM - Oct 06, 2020",
      "content": "<div>Hey Orion!<br/>\n<br/>\nSince this build came up in the history, I'd like to suggest a few improvements:<br/>\n<br/>\nI like the split, so I wouldn't go with 32/3/5. I think you get all the essentials and one more feat this way. And since you want Uncanny Dodge, that's the best possible way to get it. Otherwise 36/2/2 would also be OK. It's 1d6 + UD vs Deflect Arrows. I think i like your split better. But, it doesn't mean you can't improve the build by making a few changes:<br/>\n<br/>\n1- Move Extend Spell to 1, don't take the Spell Focus feats that early, because you won't be casting spells, you'll be summoning creatures, especially on WoG, so it doesn't make sense. Extend Spell / Blind Fight on 1 is better. <br/>\n<br/>\n2- Drop the focus in Necromancy, since you're not getting Epic Spell Focus. I never use insta-kill spells with my Druids. Things die almot instantly enough with other tactics. That would free up two feats to get Knockdown and Craft Wand (or Improved Critical: Unarmed). I like Scribe Scroll, you should keep it.<br/>\n<br/>\n3- Why do you take SF Transmutation so late in the build, instead of 2 more Great Wisdoms to pump up your DCs and AC? It's not like Drown will be that effective at those levels. I'd go with GWs.<br/>\n<br/>\n4- Why don't you delay that Monk level to 22 to gain 1 AB at the cost of saves? IMO you don't need the help of any Monk levels to level up a Druid on WoG. So, you're dropping 1 AB to make your life easier, when it isn't hard at alll to live without. With Spell Resistance, Spellcraft and Dragon stats, you should be OK with lowish saves, and in dragon builds, any point of AB is valuable, otherwise you won't be able to hit those end-game bosses you mentioned. You yourself suggested that alternative, but said you're not advanced enough. If I may suggest then a playstyle to level up a Druid, summon and cast more, shift less. In fact, I only shift to fight in very specific situations with my Druids. Most of the time, a couple of Stonehold castings plus an Animal Companion buffed with Freedom will do the trick in pre-epics. Especially on WoG. And buy those Branches of Giving. They ROCK. And equip your companion with gear and potions so it doesn't die so easily. All of the above I have done to successfully level 4 or 5 Druids to 40 on WoG. The builds that can go for Monk levels pre-epic are those that have more than 4, because then they can go 16/4 without dropping BAB points. Then, they can shift more in pre-epics.<br/>\n<br/>\n5- I'd tweak the skill distribution a little bit. A middle-of-the-road Spot score will do nothing for you. Literally, anything that invests in any stealth skills will be undetectable by you, which is a shame, considering you have such a high Wisdom score! I'd suggest dropping Listen altogether, since True Seeing on WoG adds to Spot, and going for full Spot as your detecting mechanism. Now, there is a problem that you can disable all traps, but you can't set them, so I'm wondering if those 9 skill points, alongside the 8 from Spot wouldn't be better spent somewhere else? I was thinking either Lore, to ID items, or dropping a few points from Spellcraft to increase Set Traps to be able to set Epic Traps. Or even dropping Concentration, since you won't be casting in Melee all that much. When you're in Melee, you'll be shifted, or you'll be casting from a safe distance, so Concentration would be a better skill to drop than Spellcraft.<br/>\n<br/>\nAnyway, I believe these tweaks would considerably increase the overall effectiveness of this build, especially in Dragon Shape.</div>",
      "author-color": "#00AA00"
    }
  ]
}