{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "040",
  "name": "Newbie questions: getting to level 40 and help with a build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/newbie-questions-getting-to-level-40-and-help-with-t2356083.html",
  "author": "Vinleboiteux",
  "avatar": "10759636_1701929568.jpeg",
  "replies": 12,
  "posts": [
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "4:26 PM - Apr 19, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi everyone,<br/>\n<br/>\nSo relatively recently got neverwinter enhanced edition for mobile. Used to play baldurs gate and nwn on pc some time ago. Don’t think I ever got into serious character builds and was always missing out on feats or spells etc.<br/>\n<br/>\nAnyways, this site is the best ressource I found up to now for builds ! Ty for all the time you all out into this. Hopefully forums are still active enough cause I got some newbie questions :)<br/>\n<br/>\nOk So I started the OC with a build from here. I wanted to play a heavy armor twohanded weapon darknight type character. I have been following this build <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/paragon-of-pain-bard-8-rdd-10-blackguard-22-t2354371.html\" rel=\"noreferrer\" target=\"_blank\">paragon-of-pain-bard-8-rdd-10-blackguar ... 54371.html</a><br/>\nNow I just got level 10 and my first blackguard level as I started chapter 2 of the OC. I realise now that its probly a level 40 build and not really optimal for the OC that ends at like level 17? Ish. But I’m having fun and don’t want to restart.<br/>\n<br/>\nI do have a question about the playstyle though. I have been using the buffs from the bard spells. I actually kind of 100% need them for tough fights. But the only way I can do this is to take off armor and buff and put armor back on. Is that how its supposed to be ? Its a bit tedious.<br/>\n<br/>\nNow on Mobile I have access to OC, SoU and HoU. My understanding is none of these go up to level 40 ? So how do i get there as a solo player ? Is it possible ? Or do I have to look into multiplayer worlds an aspect of the game that I have yet to explore.<br/>\n<br/>\nI also have access to the following modules for a price, i dont know the level range of any of them: Tyrants of the moonsea, Darkness over daggerfell, Wyvern crown of cormyyr, Pirates of the sword coast.<br/>\n<br/>\nI understand there are persistant worlds with set rules. Not sure they are available for mobile havent looked into it. Also bot sure how they work ? Is there still a story ? Do monsters respawn if they are killed by someone else ? I have to look into those if they are the only way to play level 40.<br/>\n<br/>\nAnyways ! Hopefully someone can come up with some answers for me ! Thank you for reading !<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:40 PM - Apr 19, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The OC will take you to ~ 20.  We have a lvl 20 build section on the ecb.<br/>\n<br/>\nIf you are planning on doing connecting adventures, Sou and HotU are somewhat connected.  I believe there is a custom Mod for inbetween.<br/>\n<br/>\nHotU I believe will take you into the 30s, but I don't think you will get to lvl 40.<br/>\n<br/>\nBut you, my friend, are in luck!<br/>\n<br/>\nBecause NWN is neverending story!  There are literally thousands of Mods, available for free, on the NWVault!  And there are adventures there that will take you all the way to lvl 40.<br/>\n<br/>\nI think eye of the beholder does.<br/>\n<br/>\nOf course, you may prefer more fun with others and more challenge than SP can offer - and that is when NWN opens itself to the wonderful worlds of Online Persistent fun!  Also, free of charge.<br/>\n<br/>\nSo, enjoy, no matter what you do.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:39 AM - Apr 20, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">He is playing NWN on a phone or tablet, so mods might not work.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:19 AM - Apr 20, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, what about custom Modules?  I think Infinite Dungeons is still a thing, right?  It should be available...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "3:43 PM - Apr 20, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey thanks for answering ! <br/>\n<br/>\nI checked it out in depths yesterday and there is a way to get the custom modules on IOS. Its sort of easy actually. But tedious, so tedious.<br/>\n<br/>\nAfter a bit more research I think good higher level adventures would be <br/>\nThe Aielund saga (goes like 1-35 ish ?)<br/>\nAnd Swordflight ( I think people get level 40 before the end of lasr act?) Though that one needs a good build with alot of min maxing apparently and tight ressource management.<br/>\n<br/>\nNot sure if you guys have more to recommend :)<br/>\n<br/>\nWe will see. Still gotta finish the OC with my dark knight style char :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:46 PM - Apr 20, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I can heartily recommend the Aielund Saga, which will get you to level 36-7. But be aware, there's no Dev Crit there.<br/>\n<br/>\nSwordflight is great, and I believe you can currently get into the 30s - Rogue Knight is still constructing the final part - but by the time it's done, you'll certainly hit 40.<br/>\n<br/>\nI don't know if these two are available to you, but if you want to reach level 40 you can either follow the OC with Mines of Twin Summit (designed to begin at level 16-ish, so you can just jump straight in after the OC), or do SoU and HotU and port your character into Sands of Fate (designed for a level c28 character, and going all the way to 40).<br/>\n<br/>\nIf you want to know more about any of these - and others - have a look in our Modules forum, where they all are expanded on and blathered about.<br/>\n<br/>\nEqually, we have a PW section, where some of the more popular ones are given some leg-room. Special mention, however, must - and should - be given to the wonderful World of Greyhawk. The gods know, it ain't easy, so be warned. But if you decide to give it a whirl, do sign up to our sister site: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/\" rel=\"noreferrer\" target=\"_blank\">WoG</a>, which is full of useful stuff and is an excellent community (including some of our own Guild members).<br/>\n<br/>\nEnjoy yourself!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "9:35 PM - Apr 21, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just to answer the OP as I recently purchased Daggerfell, Moonsea and PotSC when they were on very special offer at GOG.com, like less than £1 each!<br/>\n<br/>\nDaggerfell starts at level 7 I think and if you use a level 1 toon you have the option to manually level up or have the module do it for you. You will finish around level 15 if you do all the side quests which is the starting level for Moonsea, and indeed Daggerfell is referenced occasionally in the plot but they both work as stand alones. I actually played Moonsea first using Mick Dagger's  <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build217140.html\" rel=\"noreferrer\" target=\"_blank\">Guardian of Light</a> but at levelled to 15 and equipped with the stuff you have at the end of OC. It was terribly overpowered and combat a little too easy throughout. My advice would be to level up manually in the module and take what you are given. You will find plenty of good stuff as you go and should finish the module around level 25. For Daggerfell I used Valerfor's excellent <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/dwarven-warmaster-ftr-8-rogue-10-cot-22-t2350710.html\" rel=\"noreferrer\" target=\"_blank\">Dwarven Warmaster</a> with no special equipment. Again combat was mostly on the easy side. Both are excellent stories however and I will definitely go back and play them again, possibly even with a caster build if Stagmeister will ever forgive me!<br/>\n<br/>\nPotSC was a bit of a different beast with more puzzles and thinking which is not really my cup of tea, ymmv. Cant remember the starting level but it was quite low and ended up around level 13 iirc. Probably won't play this one much, I thought the final battle was disproportionately hard, not impossible but it kind of caught me by surprise compared to the rest of the mod.<br/>\n<br/>\nHopefully some food for thought there, and I would agree with everything above about the custom mods - Aielund is my personal favourite but I play many others as well. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:06 AM - Apr 22, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Dingpot wrote: <a data-post-id=\"28065\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=28065&amp;sid=82e22bd7420ed3f1c9c2e863a446a70d#p28065\">↑</a><div class=\"responsive-hide\">Apr 21, 2023</div></cite>\nBoth are excellent stories however and I will definitely go back and play them again, possibly even with a caster build if Stagmeister will ever forgive me!<br/>\n<br/>\nPotSC was a bit of a different beast with more puzzles and thinking which is not really my cup of tea, ymmv. Cant remember the starting level but it was quite low and ended up around level 13 iirc. Probably won't play this one much, I thought the final battle was disproportionately hard, not impossible but it kind of caught me by surprise compared to the rest of the mod.\n</div></blockquote>\nWell, I can forgive the occasional aberration - just don't let it become a habit, alright? The hammer is always ready. (I suppose that might seem like an implied threat, and that's because it is. We lose too many brothers and sisters to the dark side as it is!)<br/>\n<br/>\nAnd you've binned the blue and yellow to become Keldorn! Some of us still have the hope of an eventual return...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:23 AM - Apr 22, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">He's on the sauce again! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:38 AM - Apr 22, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"28068\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=28068&amp;sid=82e22bd7420ed3f1c9c2e863a446a70d#p28068\">↑</a><div class=\"responsive-hide\">Apr 22, 2023</div></cite>He's on the sauce again! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /></div></blockquote>\nHe's always on the sauce. It's which particular sauce that can cause...issues.<br/>\n<br/>\nFortunately, this one makes him gleeful and frivolous. So just imagine the Stagocalypse when he shifts. And he will...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "3:00 AM - Apr 22, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks again everyone !<br/>\n<br/>\nHappy this community is active. I might abuse of the privilege with alot of questions.<br/>\n<br/>\nYeah puzzles make me wanna skip that module for sure. Trying to build a char that makes sens is puzzle enough :)<br/>\n<br/>\nQuick question on game mechanics. My char just got Smite Good. What are the odds that I will fight someone Good during the OC ? And is there a way to check npc’s alignement during battle or just before or something ? <br/>\n<br/>\nHavent even finished act2 of OC and im allready looking at builds for SoU and HotU or aielund saga not sure which ill do first.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "7:54 AM - Apr 22, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>And you've binned the blue and yellow to become Keldorn! Some of us still have the hope of an eventual return...</div></blockquote>\nNever fear on that score, blue &amp; yellow I remain (pun intended) but felt like a change and also to reflect my penchant for Paladins!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "8:02 AM - Apr 22, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Havent even finished act2 of OC and im allready looking at builds for SoU and HotU or aielund saga not sure which ill do first.</div></blockquote>\n\nI would highly recommend The Nether Scrolls as a bridging module rather than go straight from SoU into HotU, only brings you up a couple of levels but they do make a significant difference. <br/>\n<br/>\nAlso feel free to keep asking questions. I'm still (relatively) new compared to the experts on here and still get substantial amounts of valuable advice. <br/>\n<br/>\nOh and welcome to the guild!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}