{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "367",
  "name": "Dex monk SD buld request",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/dex-monk-sd-buld-request-t2348876.html",
  "author": "KidMiracleman",
  "avatar": "no_avatar.png",
  "replies": "13",
  "views": "600",
  "posts": [
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "8:29 PM - Jan 25, 2014",
      "content": "<div>I need a dex monk SD build that is 35 monk levels and 5 Shadow dancer.  It has to have<br/>\nunarmed weapon focus.  The emphasize has to be on high AC.  <br/>\n<br/>\nThank you<br/>\n<br/>\nDavid</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:54 PM - Jan 25, 2014",
      "content": "<div>Hey man, <br/>\n<br/>\nWhy does it need to be 35 Monk and 5 SD? Any particular reason not to add a 3rd class?<br/>\n<br/>\nRoughly, here are some classes that mesh well with Monk SD:<br/>\n<br/>\nCleric - <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/the-shadow-priest-cleric-26-monk-9-sd5-t515430.html\" rel=\"noreferrer\" target=\"_blank\">take a look</a><br/>\n<br/>\nAssassin<br/>\n<br/>\nRogue<br/>\n<br/>\nFighter<br/>\n<br/>\nDruid<br/>\n<br/>\nRanger<br/>\n<br/>\nCoT<br/>\n<br/>\nJust as a rough guide. Besides, a Monk / SD alone won't have that big an AC, at least not without magical items.<br/>\n<br/>\nI don't feel qualified to make such build, as I'm not a fan of 2-class builds or pure builds. To me the fun of making characters is combining classes and exploring synergies. However, if you want to see a third class added to the build, I'd be interested to help.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "10:58 PM - Jan 25, 2014",
      "content": "<div>The reason is that the final Monk gloves are restricted to monks with 35 levels.  Sorry I did not include that information too<br/>\n<br/>\nWhat do you think of a paladin CoT Harper scout??<br/>\n<br/>\nDavid</div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "11:03 PM - Jan 25, 2014",
      "content": "<div>1) PvM or PvP - Builds that are maximized for PvM are often not maximized for dueling with other PCs.<br/>\n<br/>\n2) Level cap -60<br/>\n<br/>\n3) Race preference - dwarf?<br/>\n<br/>\n4) Class preference - <br/>\n<br/>\n5) Melee preference - <br/>\n<br/>\n6) Range preference - <br/>\n<br/>\n7) Weapon preference - dwarven waraxe<br/>\n<br/>\n8) Maximum item enhancement - +9<br/>\n<br/>\n9) Spellcasting - divine wraith divine shield divine might<br/>\n<br/>\n10) Custom factors - subraces</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:47 PM - Jan 25, 2014",
      "content": "<div><blockquote><div><strong>KidMiracleman wrote:</strong>The reason is that the final Monk gloves are restricted to monks with 35 levels.  Sorry I did not include that information too<br/>\n<br/>\nWhat do you think of a paladin CoT Harper scout??<br/>\n<br/>\nDavid</div></blockquote>\n\nWell, I think you can make a pretty powerful one, but HOW depends on a couple of things: do you want him to be a smiter o a generalist paladin?<br/>\nDo you want a STR-based one or a CHA-based one? or a split between STR and CHA?<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "12:20 AM - Jan 26, 2014",
      "content": "<div>I am thinking split.  Would like to end with a con of 22 for EPC and a str of 28 maybe 30<br/>\n<br/>\nIs that possible??<br/>\n<br/>\nDavid</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:19 AM - Jan 26, 2014",
      "content": "<div><blockquote><div><strong>KidMiracleman wrote:</strong>I am thinking split.  Would like to end with a con of 22 for EPC and a str of 28 maybe 30<br/>\n<br/>\nIs that possible??<br/>\n<br/>\nDavid</div></blockquote>\n\nCON? I wouldn't recommend a Paladin focusing on CON without any good reason. What is EPC?<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "1:33 AM - Jan 26, 2014",
      "content": "<div>I mean EDR  Epic Damage Reduction</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:45 AM - Jan 26, 2014",
      "content": "<div>Look, hear me out. If you want an EDR character, there are better class combos to achieve that, if you want a Paladin / COT / HS, that's not what they're good at. Paladin / CoTs are good at either smiting or killing stuff with Divine Might and Divine Shield, they also have very high saves because both classes give a bonus to saves (Paladin adds +CHA modifier to saves and CoT has +1 for every 2 levels). So if you want a pal / HS, I strongly suggest not going for EDR, if you want a toon with EDR, then I strongly suggest not going for Pal HS COT, do you understand?<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "2:18 AM - Jan 26, 2014",
      "content": "<div>Well I do not have to have it.  Was just asking if it was at all possible.  If not that is ok</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:10 AM - Jan 26, 2014",
      "content": "<div>A lot of things are possible, but that does not necessarily mean that they are good choices. <br/>\nIf you want to learn how to power-build, then Max is a good teacher!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "9:16 AM - Jan 26, 2014",
      "content": "<div>I can't see how having a high con would be a bad thing</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:20 PM - Jan 26, 2014",
      "content": "<div>David, in reply to your first comment:<br/>\n<br/>\nIt's possible, but it makes no sense. I really think you should read the guide I referred you to. There's A LOT of info there that you'll find useful. There are also some class guides you can take a look at. I wrote a Paladin guide, for example, which you can benefit A LOT from if you take the time to read it. The problem is that I understand where you're at, you're missing a lot of information and you are EXTREMELY server-biased in your NWN conceptions, probably because you've been playing at the same place for a long time. You know everything there is to know about your server, all the items, cool bosses, requirements, subraces, etc... But there is a whole new world out there that will increase your awareness of the game as a whole and even improve on what you already know about your server. In other words, you can use the knowledge you acquire here in combination with your knowledge of the server you play to come up with better optimized characters that are exceptionally well-tweaked for that environment.<br/>\n<br/>\nAs for the Paladin / CoT, please make another topic for it, as this is the Monk / SD one, and we are FAR off topic. Thanks!<br/>\n<br/>\nAs for the second comment, I think I can explain:<br/>\n<br/>\nEVERY POINT YOU PUT IN CON is one less point you put somewhere else. Having high CON by itself isn't bad, what's bad is what you trade it for. Let's take a look at two different situations for you to try to understand what I mean:<br/>\n<br/>\n1- A Fighter / Dwarven Defender / Rogue (12 / 26 / 2). Dwarven Defenders get DR as a class feature, and with 26 levels, they'll have 18 points of damage reduction just for having those class levels. They also receive d12 hit points and they have Defensive Stance (which increases their CON and AC as long as they don't move). They are also immune to Sneak Attack. So, they are DAMAGE-SOAKING MACHINES!! They have very high HPs, and with the EDR feats, they'll have 27 points of DR, PLUS A BELT OF DAMAGE RESISTANCE, that makes them nearly impervious to damage. <br/>\n<br/>\n2- A Paladin / COT - Paladins add CHARISMA to their saves, they also have Divine Might and Divine Shield to add CHARISMA as Damage and AC, they have CHARISMA buffs to increase their modifier, they have Smite Evil, which adds CHARISMA to their attack roll and class level to damage against evil. CoTs have Divine Wrath, which lasts a number of rounds equal to CHARISMA modifier. Harper Scouts get Great Charisma as a bonus feats, and CoTs have Great Smiting, which requires 25 CHARISMA as a requirement.<br/>\n<br/>\nLooking at these two examples it's pretty obvious where the EDR feats have better synergy, right? What you need to understand is that NO BUILD IS GOOD AT EVERYTHING. You cant be a high-AB-high-AC-damage-dealing-epic-casting-dev-critting-immune-to-criticals-high-HP-High-DR-spell-resistant-high-saves character. So, you will ALWAYS be faced with Strengths x Weaknesses of the build. As a rule of thumb, optimizing a build means maximizing strengths and minimizing weaknesses. Adding EDR to the first case above, you'll complement the strength of tanking and a high fortitude save thanks to 22 CON. If you choose to add it to the second, you'll be significantly lowering the effectiveness of your CHARISMA-based class features for more HP and a little bit of DR, which will make your character good at nothing and therefore WEAK. If you choose to lower WISDOM instead of CHA, you'll lose the ability to cast spells, if you lower STR, you'll lose AB, if you lower DEX (DEX will probably be at 8 already), if you lower INT, you'll lose Skill Points, and the ability to take Expertise (which works WONDERS with Taunt, I'm guessing you don't even use Taunt, right?) and IKD. Basically, CON is one of the least important things in a build like this. Except for DEX, all other attributes are more important than Constitution.<br/>\n<br/>\nI hope you understand what I'm trying to say.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "9:01 PM - Jan 26, 2014",
      "content": "<div>yes I do</div>"
    }
  ]
}