{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "223",
  "name": "Wizard Level Breakpoints",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/wizard-level-breakpoints-t2354526.html",
  "author": "Scawt",
  "avatar": "no_avatar.png",
  "replies": "5",
  "views": "756",
  "posts": [
    {
      "author": "Scawt",
      "avatar": "no_avatar.png",
      "timestamp": "2:40 AM - Apr 14, 2016",
      "content": "<div>Hi guys,<br/>\n<br/>\n I've been looking around for a guide on wizards which discusses levelling breakpoints, similar to the Cleric and Druid guides posted by Maximillian Kane on the game guides subforum, but I haven't had much luck in finding any.<br/>\n<br/>\n Personally I think there is some value in some of the low level spells that carry on for most of the game, namely all of the attribute buffing spells, darkness, ultravision, knock, find traps, etc. Then in the middle spell levels there are a lot of spells which you'd want a reasonable amount of caster levels to maximise the benefit of, namely damage spells or spells which have quite short durations until you can either extend them or just naturally extend them with increase CL.<br/>\n<br/>\n So when I've been looking at integrating wizard levels into a build I've been kind of sticking to the following breakpoints: <ul><li>5 levels if I want the bare minimum investment, for access to level 3 spells, the ability to use wizard only scrolls and the bonus wizard feat.</li> <li>10 levels if I want improved invisibility, stoneskin, elemental shield and the second wizard feat.</li> <li>17 levels if I want access to time stop but no other major level 9 spells</li> <li>as many levels as possible if I want to be a serious spellcaster for spell DC</li> </ul> The trouble for me is that when I'm hovering around the middle section of investing levels I feel torn between either cutting away as many wizard levels as possible to maximise investment in other classes (and ending up with 5 levels in wizard) or feeling like I should be putting as many levels as possible, though I'll admit I usually tend to the former rather than the latter as I have little to no experience actually playing a caster-focussed build.<br/>\n<br/>\n If you're worried about spell DC, what's the minimum amount of levels you'd ideally want to take? For example, I can see on Max's druid guide that 22 levels of druid is recommended for spell DC, but I don't know why. I also get the impression that if you're goal is to pump massive amounts of caster levels then you're better off using sorcerer, and dumping a level here or there into something that utilises the high CHA bonus. Is there a place for a medium to high level wizard usage in a build as well? Or is this best left for sorcerers?<br/>\n<br/>\n Thanks again everyone</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:24 PM - Apr 14, 2016",
      "content": "<div>A lot of this type of decision-making revolves around the environment so there is no one hard-'n-fast rule.  Whether you are using wizard as a primary, secondary or tertiary class also impacts how many levels can be devoted to raising penetration or gaining bonus feats.<br/>\n<br/>\n Are you planning to use the class for spellcraft dumps?  If so, how many?  See. There are many contingencies.<br/>\n<br/>\n Are there a lot of spell-resistant and spell-immune creatures?  That would influence how much your wizard would be relying on polymorphs.  Tenser can be extended and empowered which could translate into a \"breakpoint\" of Level 13 or 14.   Iron golems require Level 17.<br/>\n<br/>\n Wizards can scribe without a feat investment so spells like Time Stop would most likely be candidate for scribing to save the slot for more important spells like Mords or Shapechange. (and btw, unless you were planning the minimum INT investment, you'll be getting bonus slots from pumping your INT over 30.)<br/>\n<br/>\n But, TBH, except for using min wiz levels as a qualifier for AA or PM, I'll stick to either 17 or 24, for access to all spells or dispel resistance/epic spell qualifier.  Keep in mind that an arcanist is not an AB self-buffer like a cleric, at least not in mid-to-high magic environments since GMW's +5 enhancement is negated by normal weapon props available.  Empowered Bull or Cat (that would be Level 7 in your breakpoint guide) is hardly a game-changer as far as attacking prowess goes.  But damage shields are HUGE advantages that usually need to be extended to serve as staples (extended forms at wiz 5, 9, 11 respectively).<br/>\n<br/>\n It's probably not a good idea to encourage a wiz vs. sorc debate in a topic like this because it will only muddle the topic you are interested to investigate.  We can argue the preferential mage class issue another time.<br/>\n<br/>\n Web's <em>Melee Mage</em> is a great bit of exposition on playing the default arcanist from the legacy archive so I am furnishing here if you missed it during your search.  You can use it to help determine your \"breakpoints\".<br/>\nSpoiler [+]<br/>\n<br/>\n This was waaaayyy overdue - so here it is, in all it's mundane glory.<br/>\n<br/>\n Awhile ago, I suggested that a Wizard could be a better Fighter of the same level at beginning levels, and after much testing, I believe I have somewhat managed to optimize the build. The Melee Mage is a fascinating way to play a Mage, and is a rather non-traditional method, needing some re-thinking of how and what a Mage is good at.<br/>\n<br/>\n The starting stats are not only necessary to consider, but are crucial to the build - make a mistake here, and the Melee Mage will just not be effective. Aside from the primary casting stat Int, the next stat to be considered must be CON. This is very important, as will become apparent later. The other stats to invest points in depends on the the focus of the Melee Mage - are you going the Strength route, or the Dex route?<br/>\n<br/>\n Note that a Melee Mage is a pure Mage build. It is not one that multiclasses, and has full Spellcasting power. This is the real secret of the build, and it is immensely powerful.<br/>\n<br/>\n<strong>Beginning Build</strong><br/>\n<br/>\n Humans, Gnomes, and Dwarves make great Melee Mages. Humans, because of the amount of skill points, and the extra feat, and Dwarves and Gnomes because of the additions to Con. I consider it a toss-up between Dwarves and Gnomes as to which is better. I prefer Dwarves.<br/>\n<br/>\n I shall consider the Strength build first, as it is one that I have tested the most. As I prefer Dwarves, this will be with Dwarf as a Race.<br/>\n<br/>\n<strong>Melee Mage</strong><br/>\n<br/>\n<em>Dwarf Wizard</em><br/>\n<br/>\n Str: 14<br/>\n Dex: 10<br/>\n Con: 16<br/>\n Int: 18<br/>\n Wis: 8<br/>\n Cha: 6<br/>\n<br/>\n Some may wish to reduce the Int and add to Str - I don't prefer to, but some may.<br/>\n<br/>\n The first Feat I normally take is Martial Weapon Proficiency. If Human, I would suggest that and Toughness.<br/>\n<br/>\n For your skills, DO NOT ignore Discipline!! You will not be getting values near that of a pure Fighter, of course, but to ignore such will be a mistake, IMHO. If your PW/Mod incudes items that prevent Knockdown, then you may wish to skimp on Discipline, but I would not recommend it. There is still Disarm to be concerned about!<br/>\n<br/>\n The next thing is to decide what Specialist Wizard you wish to be. I would suggest being a specialist, as this gives one more spells (which is also the reason for the high starting Int) - I normally take Necromancy, as those spells lost normally can be found easily enough (True Sight) and Premonition is mostly useless by the time one gets it.<br/>\n<br/>\n After choosing a school, then choose your spells. This is very, very, very critical! The first level of your Melee Mages life will depend on your selection. I recommend Protection from Alignment, Mage Armor, Shield, Magic Weapon, Grease, Sleep, and any others that one sees fit. It is very important to remember, that you want spells that increase combat effectiveness in Melee, over those that have an offensive nature, and ignore melee effects.<br/>\n<br/>\n Next, choose a Familiar. This is also crucial for the first starting levels! Choose a Familiar, that will survive combat! The Mephits are good, as is the Imp. I would suggest taking one of them.<br/>\n<br/>\n You will be engaging in combat alongside your Familiar. You will find out that with your buffs and high hps (starting of 7), you should be able to hold your own pretty well, for the first couple of battles, until the Buffs wear off. If you cannot rest after that happens, and you are out of spells, then hang back, and let your familiar fight, use a crossbow or bow. Do not forget, you still have slots for Ray of Frost (a nice cantrip for first level). If you get into trouble, or your familiar dies, RUN!! That is very important. You will be wanting to add Expeditious Retreat to your spell reperatoir to aid in doing this, unless there are perma-haste items available early on (or potions of speed).<br/>\n<br/>\n When you finally hit 3rd level, your worries are mostly over. Select that Ghostly Visage and Flame Weapon!! Now you have excellent defense, and can deal the damage like the best of Fighters! You will want to pick up Bull's Strength, as well, and if possible, Cat's Grace. You will want to pick up Invisibility sometime.<br/>\n<br/>\n Upon reaching level 5, select Greater Magic Weapon and Keen Edge if your PW/Mod does not have keen weapons available. If such are available, Haste. If perma-haste is available, then I would suggest Negative Energy Burst, because not only is it offensive in nature, but it drains Strength as well! You might wish to consider Displacement, as well, though it is of rather short duration.<br/>\n<br/>\n<em>Feats</em> - You will have 11 feats to fill in to level 20. As a Human, you will have 12. Start with Martial Weapon Proficiency (add in Toughness as a Human) I would choose Toughness as the next feat (Weapon Focus or Power Attack, dependingly as Human), then go Still, Extend, Empower, and Maximize. Add in Weapon Focus (I normally go a two-handed weapon, but if you like getting crits alot, go with Scimitar), Power Attack along the way, either a Spell Focus or Spell Penetration, Cleave, and either a Greater Spell Penetration or Greater Spell Focus.<br/>\n<br/>\n Then you are ready for Epic Levels. You will of course be wanting Great Cleave in there, somewhere, along with Epic Warding (and maybe Epic Mage Armor, if you can squeeze it in there). Increase your Int as high as you can.<br/>\n<br/>\n<em>Spells<br/>\n<br/>\n 1st level<br/>\n Mage Armor<br/>\n Protection from Alignment<br/>\n Shield<br/>\n Grease<br/>\n Magic Weapon<br/>\n Expedious Retreat<br/>\n Ray of Enfeeblement<br/>\n<br/>\n 2nd level<br/>\n Flame Weapon<br/>\n Ghostly Visage<br/>\n Bull's Strength<br/>\n Cat's Grace<br/>\n Fox's Cunning<br/>\n Cloud of Bewilderment<br/>\n Endurance<br/>\n Invisibility<br/>\n Ultravision<br/>\n Darkness<br/>\n Death Armor<br/>\n<br/>\n 3rd level<br/>\n Greater Magic Weapon<br/>\n Haste<br/>\n Keen Edge<br/>\n Negative Energy Burst<br/>\n Displacement<br/>\n<br/>\n 4th level<br/>\n Elemental Shield<br/>\n Improved Invisibility<br/>\n Stoneskin<br/>\n Wall of Fire<br/>\n Ice Storm<br/>\n<br/>\n 5th level<br/>\n Mestil's Acid Shealth<br/>\n Bigby's Interposing Hand<br/>\n Energy Buffer<br/>\n Firebrand<br/>\n Cone of Cold<br/>\n Lesser Spellmantle<br/>\n<br/>\n 6th level<br/>\n Greater Stoneskin<br/>\n Ethereal Visage<br/>\n Tenser's Transformation (but only the PnP version, NOT BIOWARE's!°!!)<br/>\n IGMS (of course).<br/>\n Bigby's Forceful Hand<br/>\n<br/>\n 7th level<br/>\n Shadow Shield<br/>\n Bigby's Grasping Hand<br/>\n Mordenkainen's Sword (But only the PnP Version, NOT BIOWARE's!!!)<br/>\n<br/>\n 8th level<br/>\n Greater Sanctuary<br/>\n Mass Blindness/Deafness<br/>\n Mind Blank<br/>\n<br/>\n 9th level<br/>\n Bigby's Crushing Hand<br/>\n BBoD<br/>\n Mordenkainen's Disjunction<br/>\n Shapechange<br/>\n Time Stop</em><br/>\n<br/>\n Ok, so now you have your build, but how does one go about actually putting it to use? The most important thing to remember is to KEEP THE BUFFS UP! - so use your meta-magical feats to make sure that your buffs will last until the next planned rest. At beginning levels, this will be harder, but then, you don't have all that far to the next level, either. Using your low-level buffs and your Familiar will get you to 3rd level, and having Ghostly Visage and Flame Weapon will take care of the rest, most of the time. Don't forget to run, if things get hectic. You can always come back later. Use your spellslots wisely (optimize spellslot use with metamagic feats - for example, the 2nd level spellslots are normally only good for putting 1st level metamagic in - for you will want your buffs from those spells to last/be powerful, so they will either be Extended, or Empowered/Maximized. So put some stilled MM or Grease in there. Don't foerget to always have a reserve slot for an escape spell, like Invis, Improved Invis, Greater Sanc, or Time Stop, for example.<br/>\n<br/>\n The Melee Mage's main strength is to hack it's way through the m0bs, saving most of the offensive spells for the End Boss. This allows the Melee Mage to conserve it's spells, and it really becomes a Solo Machine of Destruction, a Great Party asset (put Greater Magical Weapon, Flame Weapon, and Keen on their weapons!), Stoneskin buffs, and Bull's Strength, Cat's Grace, and Owl's Wisdom, for those Monks. Don't forget the Improved Invis and Extended Haste (if perma haste is not around).<br/>\n<br/>\n For really tough Bosses (like Dragons, etc), Do your Death Armor, Elemental Shield and Mestil's Acid Shealth buffs, and Shapechange into an Iron Golem and let him kill himself on your shields, or if your PW/Mod has the PnP version, do a Mordenkainen's Transformation and hack the Boss to pieces! For really tough Bosses, I suggest either the Greater Sanctuary-BBoD combo (cast a Haste right after the summons, as you are hasted, to haste the BBoD without worrying about it being disrupted!) - It should hack the Boss to death. If your PW/Mod uses the PnP version of Mordenkainen's Sword, then buff that baby up to the Max!! Bull's Strength, Flame Weapon, Greater Magical Weapon, Keen Edge, Haste, and let it decimate the Boss.<br/>\n<br/>\n Continuing on, I present you with the Dual-wielding Melee Mage. This build may still need some tweaking, but so far it has served me well.<br/>\n<br/>\n<strong>Dual-wielding Melee Mage</strong><br/>\n<br/>\n<em>Elf</em><br/>\n<br/>\n Str: 10<br/>\n Dex: 16<br/>\n Con: 12<br/>\n Int: 18<br/>\n Wis: 8<br/>\n Cha: 8<br/>\n<br/>\n Very Important - take Toughess as your starting Feat!! That will give you a total of 6 hps to start with. Also, you will not be engaging in melee the first couple of levels - use a Bow instead, and let your Familiar Melee, until you get to around 3rd level. At that point, you will be able to melee effectively.<br/>\n<br/>\n<em>3rd level Feat : Weapon Finesse! Yes, that is critical. Now you can begin to lay the smack down...with a rapier.<br/>\n<br/>\n 5th through to 10th - the normal metamagical Feats.<br/>\n<br/>\n 12th again changes - TWF!! Now you can use both a Rapier and Dagger. Put GMW and FW on them and go to town!<br/>\n<br/>\n 15th - Take Ambidexterity, and Spell Penetration.<br/>\n<br/>\n 18th - The long awaited Improved TWF.<br/>\n<br/>\n 20th - GSP.</em><br/>\n<br/>\n The build is a pretty interesting melee character (with Haste, 5 attacks/round - now it is worth using Truestrike to attack with) and the AC is very, very nice. Even though an Elf, you still have decent hps. Have fun!!<br/>\n<br/>\n Greater Magic Weapon is one of the keys here. Up to +5 AB factor here, and of course you have your Buffs like Bull's Strength and Cat's Grace, adding in still more.<br/>\n<br/>\n If you think about it for a minute, it comes out pretty well. Normal Fighter Bab is 20 at level 20, right? Now, the AB will be somewhat higher, counting in Strength, Weapon Focus, and any pluses to the Weapon itself.<br/>\n<br/>\n The Mage has a 10 Bab at level 20. Add in some Greater Magic Weapon, and that becomes 15. Now add in some bonuses from either Bull's Strength or Cat's Grace - and you are looking at another +5 to that - so, 20 AB. You can get that a bit higher, but that is about the height of the AB curve at level 20. Still, that is sitting up there pretty good, all things considered on a low magic PW/Mod.<br/>\n<br/>\n The interesting thing is at lower levels. GMW is +1 per 3 levels up to a maximum of + 5, meaning it tops out at level 15. If we compare level 15 Melee Mage with a Fighter of the same level, some interesting things come out.<br/>\n<br/>\n Melee Mage - AB 7 + 5 = 12 add in some Strength of 14 + 6 for Some Empowered Bull's Strength, for example for another +5, and you have 17 total.<br/>\n<br/>\n Fighter - AB 15 + 1~2 (maybe 3, depending) weapon max is 18 max, with Strength of a maximum of 22 (23, really, but that doesn't help) for a Half-Orc giving a +6 for 24. The Melee Mage is behind, but not by all that much (and that is a max Fighter build). Enough for the m0bs. And that is all that matters, for most Bosses will be done with spells (you got a horde of them to use on the Boss now).<br/>\n<br/>\n For the Dexer, he actually has much better AB, but due to Dual-wielding, that suffers some penalties (but gets more attacks, which is then useful with Truestrike). My Dexer had an AB of 18 with a normal Rapier and Dagger combo (with GMW cast on it). I consider that acceptable. Note that that will go up the moment that the dagger gets put away by +4 - that is an AB of 22, which is only 2 behind the best Fighter build!!<br/>\n<br/>\n On a High Magic PW, of course, things will be more slanted in favor of the Fighter - due to GMW not being useful - as higher \"+\" Weapons become available, the advantage of GMW shrinks, accordingly.<br/>\n<br/>\n And that is how the Melee Mage hits. And does it pretty well. Remember, this is for the m0bs, and is not meant for Bosses! For the Bosses, use your spells!<br/>\n<br/>\n Any environment is going to require changes to the builds, accordingly. I think that most realize this, and modify the build in question to respond to such challenges. Obviously, if one is playing on a PW or in a Mod where the level is set higher than Party PvP, then some changes have to be made for spell selection, especially if one is going to be journeying with Familiar, Summons, and Party!<br/>\n<br/>\n As I have pointed out, the Attack bonus is not miniscule. Also, I would hate to see a Mod or PW where normal m0bs have ACs set at 75% Fighter AB!! What do the poor 3/4 Bab builds do? Swing away, hoping for that ever-elusive 20? Most Bosses are set to 75% - meaning the Fighter has a 25% chance of hitting - much better. M0bs are normally 50% - which makes the Melee Mage very nice (around 60%, all in all). About equal to the 3/4 AB Classes, but with incredible protections, so most damage just gets absorbed, not to mention a nice AC.<br/>\n<br/>\n No, the Melee Mage will not hit as often as the Fighter (it just doesn't have 4 attacks, nor that high of an AB), but it does have 2 at high AB, which has a very good chance of hitting at least once per round - and combined with Strength, +5 GMW and Flame Weapon damage, that is going to be enormous damage dealt. For the Dual-wielder, it has 5 attacks, 3 of which are at high AB. A bit less Strength damage, but that is not as important here, as the extra half a hit makes up for it with GMW and Flame Weapon damage.<br/>\n<br/>\n The Fighter with 50% for the first attack, will have degenerating hit chances for the other 3. Let us say 2 attacks per round, realistically will hit on average, to the Strength MM's 1, and the DWMM's 1 1/2.<br/>\n<br/>\n So, figure in Damage. The Fighter has a bit of elemental damage on the blade (a d6, maybe), will be lucky if the \"+\" is an enhancement bonus, say +1~2, add in Weapon Spec for + 4, and the Strength for around +6 for a total of 1-6 + 2 + 4 + 5 = 13~18 total. Multiply by 2 for 26~36 a round. Note that Cleave and Great Cleave have not been figured in here. Also, if the Fighter in question wishes to use a Two-Hander, his AC plummets (damage taken will rise). If the Fighter does go THW, then add in the 1.5 Strength for 3 more.<br/>\n<br/>\n The Melee Mage does 10+1d4 of Fire, + 5 from the GMW, plus Strength of + 7 (THW) for a total of 23~26 a round. One now begins to see that one hit from the MM is almost equaling two hits from the Fighter.<br/>\n<br/>\n The DWMM looks even better, due to the extra \"half hit\". True, the Strength is less (10 + 6 is going to be a +3 bonus to damage on the main hand, and the off-hand will be +1). So the Strength damage will be less, of course (around +4 average per round), But the other Damage will be Higher! 15+1d6 of Fire, +5 GMW, +4 strength for 25~30 damage a round!<br/>\n<br/>\n Here is the Feat slots for building with :<br/>\n<br/>\n<em>1st level is a normal Feat - Martial Weapon PRof.<br/>\n 3rd level is a normal Feat - Toughness<br/>\n 5th level is a Wizard Feat - Still spell<br/>\n 6th level is a normal Feat - Extend spell<br/>\n 9th level is a normal Feat - either go metamagic with empower, or do some optimizing, and take Power Attack here.<br/>\n 10th leve is a Wizard Feat - Empower or Maximize (depeinding on if one is going to go Cleave/Great Cleave or not).<br/>\n 12th level is a normal Feat - Weapon Focus (I take Greatsword).<br/>\n 15th level is a normal Feat and a Wizard Feat - if going the Cleave route, take Cleave, otherwise Power Attack here, and either Maximize or spell focus/spell penetration.<br/>\n 18th level is a normal Feat - either Great Cleave, or Cleave<br/>\n 20th level is a Wizard Feat - either Spell Focus/Penetration of Greater Spell Focus/Penetration.</em><br/>\n<br/>\n Ah, 75% to hit - yep, I missed that. Thanks for correcting my understanding.<br/>\n<br/>\n As for Discipline - a pure Melee Mage is never going to be safe from Knockdown and Disarm specialists (unless immunity to knockdown is present, and that still leaves Disarm) - and most builds are not 100% safe against these type of specialists, anyway. When fighting against such, I would suggest the Damage Shields/Iron Golem route. It normally works very well, as one Cleric who tried it on my Melee Mage found out very fast. True, he could knock me down. But due to my shields, and my rather high hps (which he had badly miscalculated), he ended up dying before I did.<br/>\n<br/>\n I once got Disarmed, as well. So, out came the Iron Golem. That solved that. One very dead Disarmer. The nice thing about it was, I only lost a normal Greatsword. So what.<br/>\n<br/>\n For normal m0bs, they won't be spamming knockdown - the AC is too high, I have found out, for the AI to spam it. Same goes for Disarm attempts.<br/>\n<br/>\n There is one Boss I know of, that rips melee builds to shreds (level 42 with dual wielded Katanas + 5, on a PW that goes to level 20) - I took it down with ease. How? GS and BBoD.<br/>\n<br/>\n As I have suggested, for Bosses, use your spells. That is what they are there for. That is why the MM does not multi-class. Your Melee capability is only for getting you to the Bosses, with most of your offensive spells still available and is not meant for the Bosses themselves.<br/>\n<br/>\n Also, there a lots of PWs that tend to stretch out an area, where no rest is available, to restrict a Mage's effectiveness. The MM build allows one to overcome these types of areas with impunity. I also know a lot of PWs that find ways to do away with Invis/GS protections, which causes quite the problem for most solo Mages.<br/>\n<br/>\n Note that I am not suggesting the MM to everyone, nor do I think that a Mage should be played this way all the time. It is just a very interesting variant - a new, possibly exciting way to play a Mage.<br/>\n<br/>\n As we all know, there is no \"perfect\" build. The MM has weaknesses - buffs being dispelled, Knockdown Specialists and Disarm Specialists being some of them. But the MM does have ways to at least deal with the situations, if they have time to prepare. Also, I believe the MM has limited effectiveness on Moderate to High Magic PWs/Mods.<br/>\n<br/>\n<br/>\n<br/>\n  </div>"
    },
    {
      "author": "Scawt",
      "avatar": "no_avatar.png",
      "timestamp": "4:41 AM - Apr 15, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>A lot of this type of decision-making revolves around the environment so there is no one hard-'n-fast rule.  Whether you are using wizard as a primary, secondary or tertiary class also impacts how many levels can be devoted to raising penetration or gaining bonus feats.<br/>\n<br/>\n Are you planning to use the class for spellcraft dumps?  If so, how many?  See. There are many contingencies.<br/>\n<br/>\n Are there a lot of spell-resistant and spell-immune creatures?  That would influence how much your wizard would be relying on polymorphs.  Tenser can be extended and empowered which could translate into a \"breakpoint\" of Level 13 or 14.   Iron golems require Level 17.<br/>\n<br/>\n Wizards can scribe without a feat investment so spells like Time Stop would most likely be candidate for scribing to save the slot for more important spells like Mords or Shapechange. (and btw, unless you were planning the minimum INT investment, you'll be getting bonus slots from pumping your INT over 30.)<br/>\n<br/>\n But, TBH, except for using min wiz levels as a qualifier for AA or PM, I'll stick to either 17 or 24, for access to all spells or dispel resistance/epic spell qualifier.  Keep in mind that an arcanist is not an AB self-buffer like a cleric, at least not in mid-to-high magic environments since GMW's +5 enhancement is negated by normal weapon props available.  Empowered Bull or Cat (that would be Level 7 in your breakpoint guide) is hardly a game-changer as far as attacking prowess goes.  But damage shields are HUGE advantages that usually need to be extended to serve as staples (extended forms at wiz 5, 9, 11 respectively).<br/>\n<br/>\n It's probably not a good idea to encourage a wiz vs. sorc debate in a topic like this because it will only muddle the topic you are interested to investigate.  We can argue the preferential mage class issue another time.<br/>\n<br/>\n Web's <em>Melee Mage</em> is a great bit of exposition on playing the default arcanist from the legacy archive so I am furnishing here if you missed it during your search.  You can use it to help determine your \"breakpoints\".<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Thanks! That was really helpful<br/>\n<br/>\n One question though - what is it about 24 levels in Wizard that is preferable? The bonus epic feat comes at level 23, so I assume there must be something about level 24 that hits a certain DC or something?</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:35 AM - Apr 15, 2016",
      "content": "<div>At Caster Level 24, only Mords can dispel your buffs (Greater Dispel or weaker cannot dispel at all).<br/>\n<br/>\n Sometimes you will see the claim that a caster with 24 levels is \"indispellable\" which is never really true. <br/>\n<br/>\n Mord is a combination of breach and dispel so that spell will dispel all but the highest level caster buffs pretty easily.  The scroll version is set at 17 which will dispel a DC of 18-37 (or buffed Caster level 6 to 25) depending on the roll so you can see except for the breach, Mord scrolls are really not all that powerful.  I am assuming when designers create other items (like books and rods) that cast Mords they are also limited to Clvl 17 though they may be able to customize the default limits to reach higher limits so check your server/mod.<br/>\n<br/>\n It works like this: At Caster 23, Greater Dispel can dispel buffs 5% of the time.<br/>\n                           At Caster 22, Greater Dispel can dispel buffs 10% of the time.<br/>\n                          At Caster 21, Greater Dispel can dispel buffs 15% of the time. etc., etc.<br/>\n At Caster level 19, only Greater Dispel and Mords can dispel its buffs.<br/>\n Caster level 14 buffs are only immune to dispel by Lesser Dispel.<br/>\n<br/>\n Doesn't matter whether arcanist, druid, cleric... whatever type caster.  It always works this way.<br/>\n<br/>\n Always check the caster level on scrolls/wands/rods (if you are using those to dispel) to figure out how much DC they can dispel.<br/>\n<br/>\n edit:  OOps!  I just realized I was focusing on self-buffing in my discussion.  So, instead of the term \"buffs\" insert the term \"magical effects\".  So then it covers effects like darkness, stun, paralyze, slow, blinding... basically all spell effects, not just those applied directly onto the caster (or party).</div>"
    },
    {
      "author": "Scawt",
      "avatar": "no_avatar.png",
      "timestamp": "12:35 AM - Apr 18, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>At Caster Level 24, only Mords can dispel your buffs (Greater Dispel or weaker cannot dispel at all).<br/>\n<br/>\n Sometimes you will see the claim that a caster with 24 levels is \"indispellable\" which is never really true. <br/>\n<br/>\n Mord is a combination of breach and dispel so that spell will dispel all but the highest level caster buffs pretty easily.  The scroll version is set at 17 which will dispel a DC of 18-37 (or buffed Caster level 6 to 25) depending on the roll so you can see except for the breach, Mord scrolls are really not all that powerful.  I am assuming when designers create other items (like books and rods) that cast Mords they are also limited to Clvl 17 though they may be able to customize the default limits to reach higher limits so check your server/mod.<br/>\n<br/>\n It works like this: At Caster 23, Greater Dispel can dispel buffs 5% of the time.<br/>\n                           At Caster 22, Greater Dispel can dispel buffs 10% of the time.<br/>\n                          At Caster 21, Greater Dispel can dispel buffs 15% of the time. etc., etc.<br/>\n At Caster level 19, only Greater Dispel and Mords can dispel its buffs.<br/>\n Caster level 14 buffs are only immune to dispel by Lesser Dispel.<br/>\n<br/>\n Doesn't matter whether arcanist, druid, cleric... whatever type caster.  It always works this way.<br/>\n<br/>\n Always check the caster level on scrolls/wands/rods (if you are using those to dispel) to figure out how much DC they can dispel.<br/>\n<br/>\n edit:  OOps!  I just realized I was focusing on self-buffing in my discussion.  So, instead of the term \"buffs\" insert the term \"magical effects\".  So then it covers effects like darkness, stun, paralyze, slow, blinding... basically all spell effects, not just those applied directly onto the caster (or party).</div></blockquote>\n<div align=\"left\">Thank you! That's quite clear.<br/>\n<br/>\n Just one more thing though, does that mean there's little to no value taking any levels beyond 24?</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:58 AM - Apr 18, 2016",
      "content": "<div>Generally speaking... as your caster continues to gain levels past 24 it becomes even more adept at the craft, joining the elite in spellcasting power and reliability.<br/>\n<br/>\n More specifically:<br/>\n<br/>\n Besides the obvious gain of duration, especially for buffs and AoE effects... for all spells that deliver effects based on clvl without limitation, like Elemental Shield, Mestil's Acid Sheath, Epic Warding... just to name a few off the top of my head...  the increase can become striking and eventually overpowering.<br/>\n<br/>\n Spell penetration also increases steadily by clvl until the point where Spell Pen feats eventually become superfluous i.e. a level 40 caster reaches spell penetration of SR 41-60 without any additional feats. Hence the \"magic\" SR monk level of 67 (vs. 40 +20 + 6/feats) to avoid all SR-check spells.  Keep in mind that the breach line of spells can further reduce the need of any spell pen feats, dropping the AoE radius SR up to -10 via Mord.  But not vs. a monk's SR.  Use your knowledge of the characteristic max SR of your chosen environment to determine where additional clvls or feats lose their relevance (as far as penetrating SR goes, anyway)<br/>\n<br/>\n As mentioned before, avoiding the dispelling effects of a scroll of Mord is a good metric to reach for any caster.  Let's look at the numbers for the scroll's intrinsic caster level (clvl) of 17:<br/>\n<br/>\n d20+clvl =/&gt; [DC] 12 + clvl effect possessor (cep);<br/>\n<br/>\n for scroll clvl 17 (which is the minimum level a Mord is available for wiz, but 18 is a sorc's minimum Mord level.  Bards and UMD 33 rogue/assassins are limited to Mord scrolls as far as ultimate dispelling options.):<br/>\n<br/>\n The dispel roll is...<br/>\n d20+17 (scroll) =/&gt; 12 + cep<br/>\n 18-<strong>37</strong> (roll 20) =/&gt; 12 + 25 (dispels)<br/>\n 18-<strong>37</strong> (roll 20) =/&gt; 12 + 26 (fails to dispel i.e. a Mord scroll cannot dispel spell effects from this caster)<br/>\n<br/>\n We use the roll of (20) to establish the high metric.  So, in the example above, a roll of 20 successfully dispels a cep of 25 (5% of the rolls) but cannot dispel a cep of 26. All lesser rolls fail. Hence, even caster level of 26 has some degree of relevance to gaining permanency of effects compared to clvl 24.<br/>\n<br/>\n This means that additional cep levels increase the ability to avoid dispelling even from a dispeller's queued Mord of an opponent's increasingly-high clvl.<br/>\n<br/>\n There is enough number-crunching to bore you to tears, but you asked for it, eh? <img class=\"img-emoji\" src=\"emoji/8.gif\"/><br/>\n<br/>\n [My illustrious members, if I've forgotten any pertinent factors in regards to high-level spellcasting benefits, please rectify my gaffe for our fellow conspirator.]<br/>\n<br/>\n edits: geez I can't type or read very good right now *grrrrrrr*</div>"
    }
  ]
}