{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "298",
  "name": "Dragon Blade, Barbarian 28 RDD 10 Bard 2",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/dragon-blade-barbarian-28-rdd-10-bard-2-t2292942.html",
  "author": "TyrTemplar",
  "avatar": "no_avatar.png",
  "replies": 0,
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "12:09 PM - Oct 16, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong>The Dragon Rider (Dragon Blade Series).</strong><br/>\n<strong>By Deborah “Tyr” Templar</strong><br/>\n<blockquote><div><strong>Author’s Note</strong> – Credits and Adaptation/Revision History: <br/>\nThis Soldier is based on my NWN2 Wind Duke (Dragon Blade), which was subsequently modified by myself and Mithdradates (serving as a mortal combatant in his NWN2 Hall of Training, see: <a class=\"postlink\" href=\"http://ecb2nwn2.faerunonline.com/builds/data2/30build296017.html\" rel=\"noreferrer\" target=\"_blank\">http://ecb2nwn2.faerunonline.com/builds ... 96017.html</a> ). In making these adaptations, Mith and I were keeping with the true spirit of our drakes in NwN1 (namely, pvp dev.critters, and which a number of my drakes forming a series, entitled: Dragon Blades (NWN-40) were not only based upon but which the Duke/Soldier itself traces from (i.e., the Dragon Blade series being modified for the NWN2-20 and again for the MoTB expansion), thus coming “full circle” in revisiting this series here in the NWN-40, accounting for 1.69 (patch), etc. To see the ORIGINAL Dragon Rider (and Magical Rider variant, among others in the series, with links therein also to the 11 other builds using this splendid class combo at time of original posting, including Finn’s clever “Mighty and Terrifying and Thundering Gnomish Barbarian” which. albeit different, shares the same level split as this one), see: <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build266094.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 66094.html</a> and links therein).  </div></blockquote>\n<strong>Dragon Blade.<br/>\nBarbarian(28), Red Dragon Disciple(10), Bard(2)</strong><br/>\n<br/>\n<strong>The EMPEROR'S NEW BLADE </strong><br/>\n<blockquote><div>Dragon Blades were an elite fighting force, comprised of plane warriors who actually rode and fought on dragons; the pair, rider and dragon, were dedicated to the preservation and defense of the native planes, many of whom took part in the Dragon Wars. It is said the bond between dragon and his/her rider is a strong and magical one. It is also said that, in time, the bond grows between a rider and his/her dragon, such that they begin to “see” and “think” as one, and that each of the pair eventually take on many characteristics of the other. It is widely believed all Dragon Blades (and their dragons) died out during the time of the dragon wars.<br/>\n<br/>\nThey are wrong: a few survived. </div></blockquote> <br/>\n<br/>\nTerracotta Soldier was a Dragon Blade, part of an elite fighting force, comprised of plane warriors who actually rode and fought upon dragons; the pair, rider and dragon, were dedicated to the preservation and defense of the native planes, many of whom took part in the Dragon Wars. It is said the bond between dragon and his/her rider is a strong and magical one. It is also said that, in time, the bond grows between a rider and his/her dragon, such that they begin to “see” and “think” as one, and that each of the pair eventually take on many characteristics of the other. It is widely believed all Dragon Blades (and their dragons) died out during the time of the dragon wars, but they are wrong: the Terracotta Soldier survived.<br/>\n<br/>\nHaving crashed on Earth, in an area today known as China, the Terracotta Soldier managed to carve out subsistence for himself for many years unnoticed by mortals, before making contact with a human child who was destined to become the first Emperor Qin; the child had been out in the woods for a picnic one day with his royal keepers, whom he engaged in a classical game of “hide and seek” when he happened on the Soldier while attempting to find a hiding spot near the river in which the Soldier was then bathing, his dragon-like wings clearly visible to the boy, which fascinated him.<br/>\n<br/>\n“You,” called the boy to the Soldier, who had caught him by pure happenstance. “What might you be?” <br/>\n<br/>\n“I am a Dragon Blade,” responded the Soldier, as much fascinated by the human child as the child was with the Soldier’s wings. ‘And you are a human child, yes?” <br/>\n<br/>\n“I am human, yes, but I am not a child,” said the boy while reaching down to inspect the Soldier’s clothing which the Soldier had carefully in military fashion laid out beside the river bank, before handing the clothes to the Soldier who had made his way to the bank. “I am the First Emperor Qin of China, a place I shall create in due course and you will address me accordingly; but what is Dragon Blade?”<br/>\n<br/>\nFascinated, the Soldier accepted his clothing from the boy, thinking to himself that mortal humans were a curious species before responding to the boy’s question, courteously bowing but with a playful smile on his face: “a dragon blade is an elite warrior, one who rides and fights on a dragon; but how can one be First Emperor of a place not yet in existence, young master?”<br/>\n<br/>\nThe boy thought on this momentarily, giggling, before mimicking the Soldier by bowing with an identically playful smile on his face, and asking: “and how can one be elite Dragon Rider when there is no dragon to ride, noble warrior?” <br/>\n<br/>\n“Aye, it seems we have a similar problem, don’t we?” asked the Soldier playfully, while getting dressed and joining the boy in a bout of giggling. <br/>\n<br/>\n“I know about dragons and of military matters, too, but I want to know more” said the boy. <br/>\n<br/>\n“You do, do you?” asked the Soldier.<br/>\n<br/>\n“Yes,” the boy responded, still giggling. “I know dragon goddess created humans, and I also know that if great noble warrior needs dragon to ride, and if future Emperor needs country to rule, then great ruler and great warrior should speak more about these things at the palace. If I tell you about the dragons here, will you come with me to my palace and ride one for my future army, maybe even lead my future army, noble warrior?”<br/>\n<br/>\nIt was an offer that the Terracotta Soldier simply could not refuse, for he longed to be one again with a dragon, so eager was he to once again feel the bond as can only be described and understood personally as between a dragon and his or her own personal rider; that, along with the boy’s undeniable charm and offer of a military position of course, was such that he eagerly agreed to accompany the boy to the palace, and thereafter became the head of the First Emperor’s Army, whom he loyally served and befriended, until the end.<br/>\n<br/>\nWhether there were any dragons in China at the time of Soldier's landing, and whether he found for himself another dragon to ride we may never know, But we do know that it is very likely, since ancient China it did in fact know about dragons. Indeed, according to ancient Chinese scripture, it was a demi-goddess, being half-goddess, half-drake, who is responsible for the creation of humans, whom she decided in secret to make one day while sun basking near a river bank, in accordance with a secret recipe known only to the gods. The creation lore of the North American Indians teaches us that it was a raven which was responsible for humans, with which the Ancient Chinese would not necessarily disagree, so far as they likewise believed that dragons were shape-shifters, able to take any form they pleased, with many dragons enjoying the bird form, according to the Ancient Chinese. It is a difficult question, the answer to which humans may never know; however, that dragons roamed the ancient world, what we now think of as dinosaurs, lends credence to these stories.<br/>\n<br/>\nWhat we also know from these ancient stories is that the dragon, whatever its form, was a wise and magical beast, which are said to have visited a number of ancient Chinese philosophers. These dragons appeared out of curiosity, as they were curious to find out more about these new beasts called humans. On finding that humans could think and speak, these dragons were delighted, with some generously sharing their teachings. Some of these dragon teachings, it is further said, found its way into the ancient book of Confucius, whose own learned readings, some say, included some ancient writings drafted by those while keeping the company of a dragon. But whether it was a dragon, or actually the Dragon Blade named Terracotta Soldier which is responsible for some of these ancient thoughts and philosophies, we may never know. On the other hand, we do know that so close had the First Emperor and the Soldier become throughout their lifetime that the Emperor, on death, was buried with not just one but 1,000s of Terracotta Soldier replicas, each based on the likeness of Terracotta Soldier, thus forming an entire Terracotta Army of Soldiers, for the purpose of guarding and watching over the First Emperor, to keep him company in death as the pair had been in life, such that their friendship and sharing of wisdom continues in the after-life to the present day. <br/>\n<br/>\n<strong>The Build--Pros and Cons: </strong><br/>\n<br/>\n• The Soldier enjoys a very good/high AB (all-natural 47+6 Raging: 53, +6 Taunt: 59), and the ability with rage alone to hit Bio ability caps (no assembly or equipment required, especially nice for a STR-based melee warrior). Combined w. over 600HPs (872 raging!) and Devastating Critical (DC 48!), makes for a very solid/PG warrior. <br/>\n<br/>\n• Defense is also solid, thanks not only to RDD immunities (Fire, etc.) but also Terrifying Rage (DC 53+1d10, i.e., enemies can’t hurt you when they’re fleeing in terror, and did I mention Dev.Crit with a DC 48, too?!). Saves are decent for a melee build, esp. Fort (thanks to Rage, which helps out Will Save, too); with UMD (always nice on a melee build) and a nice enough skill set, too. <br/>\n<br/>\nWITHOUT any further Ado, please meet:<br/>\n<br/>\n<br/>\n<strong>SOLDIER (Dragon Blade), the Dragon Rider</strong><br/>\n<strong>Barbarian(28), Bard(2), Red Dragon Disciple(10)</strong><br/>\n<br/>\nRace: Half-Orc (Darkvision)<br/>\nAlignment: Any Non-Lawful (Theme: Chaotic Good, Chaotic Neutral, or Chaotic Evil)<br/>\n<br/>\n<strong>I. Attributes: </strong><br/>\nSTR: 18 (34) <br/>\nDEX: 8<br/>\nCON: 16 (21) <br/>\nWIS: 8<br/>\nINT: 14 (16)<br/>\nCHA: 6 (8)<br/>\n<br/>\n<strong>II. Level Guide</strong>:<br/>\n01: Barbarian(1): Weapon Focus: Scimitar<br/>\n02: Barbarian(2): {Uncanny Dodge I}<br/>\n03: Barbarian(3): power attack<br/>\n04: Barbarian(4): STR+1, (STR=19)<br/>\n05: Barbarian(5)<br/>\n06: Barbarian(6): cleave<br/>\n07: Barbarian(7)<br/>\n08: Barbarian(8): STR+1, (STR=20)<br/>\n09: Barbarian(9): knockdown<br/>\n10: Barbarian(10)<br/>\n11: Barbarian(11)<br/>\n12: Barbarian(12): STR+1, blind fight, (STR=21)<br/>\n13: Barbarian(13)<br/>\n14: Barbarian(14)<br/>\n15: Barbarian(15): Improved Critical: scimitar<br/>\n16: Barbarian(16): STR+1, (STR=22)<br/>\n17: Barbarian(17)<br/>\n18: Barbarian(18): great cleave<br/>\n19: Barbarian(19)<br/>\n20: Barbarian(20): STR+1, (STR=23)<br/>\n21: Bard(1): Epic Weapon Focus: Scimitar<br/>\n22: Red Dragon Disciple(1)<br/>\n23: Red Dragon Disciple(2): (STR=25)<br/>\n24: Barbarian(21): CON+1, Terrifying Rage, (CON=17)<br/>\n25: Red Dragon Disciple(3)<br/>\n26: Red Dragon Disciple(4): (STR=27)<br/>\n27: Red Dragon Disciple(5): overwhelming Critical: Scimitar<br/>\n28: Red Dragon Disciple(6): CON+1, (CON=18)<br/>\n29: Red Dragon Disciple(7): (CON=20)<br/>\n30: Red Dragon Disciple(8): Devastating Critical: Scimitar<br/>\n31: Red Dragon Disciple(9): (INT=16)<br/>\n32: Red Dragon Disciple(10): CON+1, (STR=31), (CON=21), (CHA=8)<br/>\n33: Barbarian(22): Mighty Rage<br/>\n34: Barbarian(23)<br/>\n35: Barbarian(24): Armor Skin<br/>\n36: Barbarian(25): STR+1, Epic Skill Focus: Intimidate, (STR=32)<br/>\n37: Barbarian(26)<br/>\n38: Barbarian(27)<br/>\n39: Bard(2): Great Strength I, (STR=33)<br/>\n40: Barbarian(28): STR+1, epic prowess, (STR=34)<br/>\n<br/>\n<strong>III. Basics: </strong><br/>\na. Hitpoints: 632 (+240 Mighty+Greater Rage, or: 872) <br/>\n<br/>\nb. Saving Throws<br/>\nFort: 27 (+6 Mighty/Grt Rage, or: 33)<br/>\nWill: 15 (+7 Mighty/Grt Rage, +1 Song: or, 23)<br/>\nReflex: 15 (Uncanny Dodge)<br/>\n<br/>\nSaving Throw bonuses: Traps: +5 (Uncanny Dodge) <br/>\n*Spells: +5 if train spellcraft (see skillset, below). <br/>\n<br/>\nOther: <br/>\nDev.Crit, Terrifying Rage, Barbarian Speed, RDD Immunities (Fire, Paralysis, Sleep), Darkvision, UMD.<br/>\n<br/>\n<br/>\n<strong>IV. Combat Vitals:</strong><br/>\n<br/>\na. Offensive DCs<br/>\ni. Devastating Critical (DC):  42 / DC 50 Rage (self-cap STR, and -2 enemy saves*)   <br/>\nii. Terrifying Rage (DC): 52 (+1d10), or: 53-62<br/>\n<br/>\nb. Attack Bonus (mundane weapon)<br/>\nBAB: 30, AB: 46, +1 Song: 47 (no buffs, singing only)<br/>\n+6 Mighty Rage/Greater Rage<br/>\n---<br/>\nAB:  53, <br/>\n+6 Taunt: 59 (lowers enemy AC, effectively raising your AB) (Self-Buffs ONLY)<br/>\n<br/>\nBio-Cap AB: (assuming +20 weaponry / UMD): AB +72, +6 Taunt, or: AB +78 <br/>\n<br/>\n*Rage Note: +4 AB Mighty Rage (+8 str) and +3 AB Grt.Rage alone (+6 str): together, w. nothing more, readily hits Bioware’s +12 ability-cap.<br/>\n<br/>\nc. Damage (illustrative): <br/>\nMundane Scimitar:  1-6+12, +1 Song, +6 Mighty/Grt.Rage, OR: 1-6+19 (crit: 15-20/x2) <br/>\nAssuming +5 Keen Scimitar:  1-6+24 (crit: 12-20/x2)<br/>\n<br/>\n<br/>\n<strong>V. Defense Vitals:</strong><br/>\nAC: 23 (naked) <br/>\n+5 mundane medium armor<br/>\n+3 mundane tower shield<br/>\n--<br/>\n31 (-2 raging, but offset by TR); does not include any magical equipment or UMD.<br/>\n<br/>\nOther:<br/>\nTerrifying Rage (TR): enemies can’t hit you when they’re terrified.   <br/>\n<br/>\n<br/>\n<strong>VI. Skillpoints:</strong> 247*[/b]<br/>\nDiscipline 41(53), Intimidate 43(52), Listen 41(40), Lore 8(13)*, Perform 7(6), Taunt 41(40), Tumble 40(39), UMD 26(25)<br/>\n<blockquote><div>*Note: this Raging/Intimidating Soldier (melee) has been optimized for PvP. For PvE/PvM might I suggest detraining listen to full train UMD [i.e., 41(40)] with the rest into spellcraft instead (+5 Saves vs. Spells). That said, players should feel free to adjust for their own needs/environs as always.</div></blockquote>\n<strong>VII. Spell Casting:</strong><br/>\nBard(0), UMD, including BARD TOYS!<br/>\n<blockquote><div>** For those who want a Fighter PvP variant (focusing on Dev.Crit with a double weapon focus, IKD and disarm as per the TS in ECB2), see: <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/terracotta-soldier-dragon-blade-pvp-ftr-28-bard-2-rdd-10-t2293083.html\" rel=\"noreferrer\" target=\"_blank\">terracotta-soldier-dragon-blade-pvp-ftr-28-bard-2-rdd-10-t2293083.html</a> . If instead don’t want Dev.Crit, then see the Dragon Rider, Mighty Blade (with EDR III (DR 15/-), IKD and a(n even more terrifying) Terrifying Rage (DC 56-65!) follows here, <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/dragon-rider-the-mighty-blade-barbarian-28-rdd-10-bard-2-t2292943.html\" rel=\"noreferrer\" target=\"_blank\">dragon-rider-the-mighty-blade-barbarian-28-rdd-10-bard-2-t2292943.html</a>  (being a revised version in light of the patch, etc. of my original Dragon Rider, the Mighty Blade as originally posted in the ECB/NWN-40: <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build266094.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 66094.html</a> ). </div></blockquote>\n\nSlash, Rage and CRIT ON! ~ Tyr<br/>\n<br/>\nEdit: correct Dragon Blade/ Dragon Rider Build Series names.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}