{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "101",
  "name": "Fighter Build Normal Camping",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/fighter-build-normal-camping-t2354647.html",
  "author": "luisgms",
  "avatar": "10718214_1510287074.jpg",
  "replies": "9",
  "views": "480",
  "posts": [
    {
      "author": "luisgms",
      "avatar": "10718214_1510287074.jpg",
      "timestamp": "2:26 PM - Dec 05, 2016",
      "content": "<div>Hello everyone<br/>\n<br/>\n It's been a long time since I've played this edition and I do not remember exactly how to put together a good Fighter who uses two swords.<br/>\n I remember that it was the class that I liked to play on the tabletop RPG.<br/>\n<br/>\n Could someone help me create it?<br/>\n I'll play the normal game campaign. <br/>\n<br/>\n<em>Sorry for my English, it's not my native language.</em></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:36 PM - Dec 05, 2016",
      "content": "<div><span style=\"font-size:150%;line-height:normal\"><span style=\"color:#0000FF\"><em><strong>WELCOME ABOARD! <img class=\"img-emoji\" src=\"emoji/11.gif\"/></strong></em></span></span><br/>\n<br/>\n Your English seems fine to me.  We'll ask questions if we don't understand what you want... so no worries.  The key is:  Do you understand <strong>US</strong>?<br/>\n<br/>\n Do you want a PURE Fighter 18 or a multiclass with a few Tumble dumps like at Lvl 7 and 12? Like maybe Ftr 16/Mnk 2 or thereabouts.<br/>\n The Original Campaign (OC) is pretty easy so it doesn't matter that much and you'll have a henchman to accompany your toon if you want one. <br/>\n<br/>\n Just as a reminder if you don't remember...<br/>\n<br/>\n the OC takes a toon from 1 to a maximum of Level 18 if you solo and bit lower if you use help for most battles.  Make sure to slide your difficulty to at least \"Hardcore\" or harder.  Hardcore is considered Normal AD&amp;D difficulty.  Bioware's \"Normal\" is actually Easy and handicaps the monster AI slightly.  \"Very Difficult\" is about as close as the single-player settings get to multiplayer.<br/>\n<br/>\n Do you prefer any particular race?  Dwarves make excellent fighters.  Humans are a bit more flexible.  Elves can spot traps faster and have pointy ears.  Your choice.<br/>\n<br/>\n What sort of weapon(s) do you prefer to wield?  The OC doesn't offer a full selection but scimitar is usually a dependable one. With enough fighter levels, you may even be able to focus/specialize in a light offhand weapon besides the mainhand weapon.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:53 PM - Dec 05, 2016",
      "content": "<div>Hello and welcome to the ECB Guild, luisgms - good to have you aboard!<br/>\n<br/>\n I'll confess that I'm more of a player than a builder (but hopefully improving), but I'm sure one the great and good will be along shortly. In the meantime, I'm fairly sure they'll want to know some more about what you're looking for, so maybe I can help there.<br/>\n<br/>\n So far we know you're looking for a dual-wielding fighter. Do you want two different types of sword (eg, rapier and scimitar), or just the one - in which case short sword is your best bet to avoid penalties to your attacks? Are you wanting a Strength or Dexterity based build? Do you plan on wearing heavy or light armour? Is ranged attack an issue for you? Do have have a racial preference - a particular fondness for gnomes perhaps? Are you wanting to play as a good guy or an evil dude? Do you want any magical attributes? Do you have any preferences for second and third classes? Will you be going solo or with henchmen? Is the build just for the original campaign (OC), which will take you up to level 18, or do you want a full 40 level character who you can use anywhere (like SoU/HotU/Sands of Fate or Aielund, for example)? Do you plan to join a Persistent World or PvP, or just the PvM modules?<br/>\n<br/>\n That's the sort of thing people will need to know before being able to give full help. I know it seems a lot, but it's really just about what sort of character <strong>you</strong> want to play.<br/>\n<br/>\n No need to apologise for your English, it's fine (and much better than I could do in another language).<br/>\n<br/>\n Welcome once more! <img class=\"img-emoji\" src=\"emoji/15.gif\"/><br/>\n<br/>\n<strong><em>EDIT:</em></strong> I see Hip's got in before me - he's one of the great and good I mentioned earlier.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "luisgms",
      "avatar": "10718214_1510287074.jpg",
      "timestamp": "4:52 PM - Dec 05, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/><span style=\"font-size:150%;line-height:normal\"><span style=\"color:#0000FF\"><em><strong>WELCOME ABOARD! <img class=\"img-emoji\" src=\"emoji/11.gif\"/></strong></em></span></span><br/>\n<br/>\n Your English seems fine to me.  We'll ask questions if we don't understand what you want... so no worries.  The key is:  Do you understand <strong>US</strong>?<br/>\n<br/>\n Do you want a PURE Fighter 18 or a multiclass with a few Tumble dumps like at Lvl 7 and 12? Like maybe Ftr 16/Mnk 2 or thereabouts.<br/>\n The Original Campaign (OC) is pretty easy so it doesn't matter that much and you'll have a henchman to accompany your toon if you want one. <br/>\n<br/>\n Just as a reminder if you don't remember...<br/>\n<br/>\n the OC takes a toon from 1 to a maximum of Level 18 if you solo and bit lower if you use help for most battles.  Make sure to slide your difficulty to at least \"Hardcore\" or harder.  Hardcore is considered Normal AD&amp;D difficulty.  Bioware's \"Normal\" is actually Easy and handicaps the monster AI slightly.  \"Very Difficult\" is about as close as the single-player settings get to multiplayer.<br/>\n<br/>\n Do you prefer any particular race?  Dwarves make excellent fighters.  Humans are a bit more flexible.  Elves can spot traps faster and have pointy ears.  Your choice.<br/>\n<br/>\n What sort of weapon(s) do you prefer to wield?  The OC doesn't offer a full selection but scimitar is usually a dependable one. With enough fighter levels, you may even be able to focus/specialize in a light offhand weapon besides the mainhand weapon.</div></blockquote>\n<div align=\"left\">\n Hello HipRedux, I understand you perfectly, thanks for the attention.I've never used a multiclass character, I've always done pure-class characters, but if you recommend a multiclass to perfect the skills of using two weapons, feel free to suggest. I know the original campaign is easy, but I wanted to make a character to have fun, because it's been almost a decade since I played this game. I will accept your suggestion to increase the difficulty of the game. About the race, I'm a big dwarf fan, but I like playing with humans.I do not know if the rule allows, but I remember using two Bastard Swords, pretty destructive above level 10, and even got many attacks per turn.But I do not care much what weapons to use. It can be Long Sword, or Short, or even axes.</div></div>"
    },
    {
      "author": "luisgms",
      "avatar": "10718214_1510287074.jpg",
      "timestamp": "5:07 PM - Dec 05, 2016",
      "content": "<div><blockquote><div><strong>Stagmeister wrote:</strong><hr/>Hello and welcome to the ECB Guild, luisgms - good to have you aboard!<br/>\n<br/>\n I'll confess that I'm more of a player than a builder (but hopefully improving), but I'm sure one the great and good will be along shortly. In the meantime, I'm fairly sure they'll want to know some more about what you're looking for, so maybe I can help there.<br/>\n<br/>\n So far we know you're looking for a dual-wielding fighter. Do you want two different types of sword (eg, rapier and scimitar), or just the one - in which case short sword is your best bet to avoid penalties to your attacks? Are you wanting a Strength or Dexterity based build? Do you plan on wearing heavy or light armour? Is ranged attack an issue for you? Do have have a racial preference - a particular fondness for gnomes perhaps? Are you wanting to play as a good guy or an evil dude? Do you want any magical attributes? Do you have any preferences for second and third classes? Will you be going solo or with henchmen? Is the build just for the original campaign (OC), which will take you up to level 18, or do you want a full 40 level character who you can use anywhere (like SoU/HotU/Sands of Fate or Aielund, for example)? Do you plan to join a Persistent World or PvP, or just the PvM modules?<br/>\n<br/>\n That's the sort of thing people will need to know before being able to give full help. I know it seems a lot, but it's really just about what sort of character <strong>you</strong> want to play.<br/>\n<br/>\n No need to apologise for your English, it's fine (and much better than I could do in another language).<br/>\n<br/>\n Welcome once more! <img class=\"img-emoji\" src=\"emoji/15.gif\"/><br/>\n<br/>\n<strong><em>EDIT:</em></strong> I see Hip's got in before me - he's one of the great and good I mentioned earlier.</div></blockquote>\n<div align=\"left\">\n Hello and thank you for your attention. :D I was very happy to find this forum, I looked for many sites of builds and none presented / displayed some that interested to me. So I want a dual-wielding fighter. And that's basically it, I do not look for any specific weapons, but I prefer swords. It's been a long time since I played these rules of the game, so I do not remember exactly the difference of using strength or dexterity, so indifferent to me. I believe that if it is based on strength, it will need heavy armor, if it is based on dexterity, it may be light armor, what do you suggest? I believe I will not need a ranged attack, I'll get a companion who attacks from a distance to accompany me. I'm a big dwarf fan, but I like playing human too. I love chaotic and neutral characters, do you know the feeling of being able to do as you please? HAHA I've never played with a multiclass character, so I have no idea of ​​any, feel free to suggest. Like I said before, maybe I'll get a mate to attack from a distance, or maybe not. I want to play the original campaign and all the expansions, yes. I do not want to play PVP. Again, thank you very much for your attention.</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:16 PM - Dec 05, 2016",
      "content": "<div>This is a strength build so you can wear the heavy armor and haul loot without needing magic bags.<br/>\n<br/>\n I chose this mix to get Cleave without needing to invest into Power Attack and the offhand mace for the advantage vs. skels and other slash/pierce resistant types.  Evasion will also help vs. spells and traps to bypass damage when you make the reflex save.  The reflex is about average in this toon.  Iron Will because warriors are usually an easy target for will-based spells so anything helps<br/>\n<br/>\n You'll be cross-classing Spellcraft and Search skills to help vs. spellcasters and faster trap spotting.<br/>\n<br/>\n You can save feats by sticking to dual-small weapons but, TBH, I am comfortable with the current feat list \"as is\" and the bastard is indeed an attractive graphic.  You'll have the option of bastard/tower should the situation arise with a +2 boost to the AB when you swap.<br/>\n<br/>\n Human is another option but will cost 18 HP, a Fort save and 2 saves vs. spells to gain a feat and a handful of skill points.  This will need to be a lawful toon, however.  That's the requirement of taking monk levels.  Another option would be to dump skills to chaotic bard levels but at the loss of the useful monk feats.<br/>\nSpoiler [+]<br/>\n<br/>\n Fighter(16), Monk(2), Any lawful Dwarf<br/>\n<br/>\n STR: 16 (20)<br/>\n DEX: 15<br/>\n CON: 16<br/>\n WIS: 8<br/>\n INT: 14<br/>\n CHA: 6<br/>\n<br/>\n 01: Ftr(1): WP Exotic, WF: Bastard Sword<br/>\n 02: Ftr(2): Dodge<br/>\n 03: Ftr(3): KD<br/>\n 04: Ftr(4): STR+1 (17), WS: Bastard Sword<br/>\n 05: Ftr(5)<br/>\n 06: Ftr(6): Ambidexterity, WF: Mace<br/>\n 07: Mnk(1): {Cleave, Evasion}<br/>\n 08: Ftr(7): STR+1 (18)<br/>\n 09: Ftr(8): 2-Wpn Fighting, WS: Mace<br/>\n 10: Ftr(9)<br/>\n 11: Ftr(10): Imp 2-Wpn Fighting<br/>\n 12: Mnk(2): STR+1 (19), ImpCrit: Bastard Sword, {Deflect Arrows}<br/>\n 13: Ftr(11)<br/>\n 14: Ftr(12): Blind Fight<br/>\n 15: Ftr(13): ImpCrit: Mace<br/>\n 16: Ftr(14): STR+1(20), IKD<br/>\n 17: Ftr(15)<br/>\n 18: Ftr(16): Iron Will, Mobility<br/>\n<br/>\n HP, max: 230<br/>\n Saves F/W/R: 16/9/10 (20/13/14 vs spells)<br/>\n Add'l saves: Poison: +2<br/>\n BAB: 17<br/>\n AB (mundane, max, naked): 23 (bastard), 21 (bastard/mace}, 19 (ranged)<br/>\n AC (naked/mundane armor/shield only): 15/25 (+1 vs. last attacker, +4 vs AoOs)<br/>\n<br/>\n Skills: 88 - Discipline 21(26), Heal 16(15), Search 10(12) [crossclass], Spellcraft 8(10) [crossclass], Tumble 15(17)<br/>\n<br/>\n<br/>\n<br/>\n I highly recommend pre-testing this using the <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/halls-advanced-training-deluxe-hotusou-edition\" rel=\"noreferrer\" target=\"_blank\"><strong>Halls of Advanced Training module</strong></a> to make sure you figure out the skill allocation and get a whack at some test encounters in preparation for your adventure in Neverwinter.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:12 PM - Dec 05, 2016",
      "content": "<div>Okay then, we're getting closer. Pretty much a straight-up melee build, dual-wielding, chaotic and/or neutral. Still a few more bits and bobs, I'm afraid...<br/>\n<br/>\n Yes, Fighter gives you full BAB progression and many bonus feats, but has a poor set of skills and saves. Champion of Torm (prestige class) also gives full BAB and many bonus feats (not, of course, Weapon Specialization), but has incremental saves boosts every other level, and a slightly better skill set, but you can't be evil. Ranger gives Ambidexterity and 2-Weapon Fighting as free feats at level 1 (provided you wear nothing heavier than light armour, and if you want to wear heavy armour you'll need to take it as a feat), also has full BAB, gives an animal companion at level 6 and Improved 2-Weapon Fighting at level 9, and Favoured Enemies at several levels (we can come to that later, if need be), but no non-Ranger bonus feats and still a fairly poor set of skills and saves. Barbarian also has full BAB and greater hit points, as well as Uncanny Dodge, Damage Reduction and Rage, but again, poor saves (unless raging) and skillset, no extra bonus feats and is restricted to medium armour (unless you take the Heavy Armour feat). And they're your basic melee-type builds (Paladin is a non-starter with your preferences).<br/>\n<br/>\n Now, for the Original Campaign I reckon you'd only need 4 levels of Fighter, to get Weapon Specialization (6 if you wanted two different attack types - most swords will be slashing damage, but rapier and short sword are piercing, or you might fancy bludgeoning with a mace or small hammer in your off-hand). You can dual-wield bastard swords, but your AB <strong>will</strong> be penalised - you need a light weapon in your off-hand not to be, and you'd need the feat in Weapon Proficiency: Exotic as well. You'll also want a class that has Tumble as a class skill - to boost your Armour Class in the absence of a shield and/or heavy armour. A couple of Rogue or Bard levels would seem obvious for skill dumps (together with either Uncanny Dodge or Bard Song).<br/>\n<br/>\n If you wanted to play as a dwarf, that would leave CoT as the other class unless you wanted an xp penalty - something like Fighter 6 / Rogue 2 / CoT 10. If human, anything goes. It all really depends on what you have in mind.<br/>\n<br/>\n Hope this is helpful <img class=\"img-emoji\" src=\"emoji/11.gif\"/><br/>\n<br/>\n<em><strong>EDIT:</strong></em> Bloody hell - Hip's ninja'd me again! Oh well...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:30 AM - Dec 06, 2016",
      "content": "<div><blockquote><div><strong>Stagmeister wrote:</strong><hr/>\n<em><strong>EDIT:</strong></em> Bloody hell - Hip's ninja'd me again! Oh well...<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">My ninja must be a paraplegic because he waited at least 20 mins. to thwart your response.  There is a price to pay for thinking before typing, Stagmeister.  I thought I saw smoke and fumes coming from the Eastern horizon right around the time you posted.  Such dedication and focus.  It's scary! <img class=\"img-emoji\" src=\"emoji/8.gif\"/></div></div>"
    },
    {
      "author": "luisgms",
      "avatar": "10718214_1510287074.jpg",
      "timestamp": "11:40 AM - Dec 06, 2016",
      "content": "<div>Thank you guys. I'll use the tips you've given me to put together my new character. Any doubts that arise during the game, I'll contact you again. Again, thank you very much for receiving me on the forum and thanks for your attention.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:33 PM - Dec 06, 2016",
      "content": "<div>Please do let us know how you fare! And do have a look around the rest of the forum - there are plenty of Guides and builds to be examined and learned from - I know I still do.</div>",
      "author-color": "#AA0000"
    }
  ]
}