{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "173",
  "name": "Drow Cleric",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/drow-cleric-t2354509.html",
  "author": "easp",
  "avatar": "10577588_1510287072.jpg",
  "replies": 12,
  "posts": [
    {
      "author": "easp",
      "avatar": "no_avatar.png",
      "timestamp": "10:05 AM - Mar 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hey guys. I've been looking every where the a melee cleric build that doesn't incorporate monk or rdd levels. Really frustrating as theres not many forums left for nwn anymore.<br/>\n<br/>\n The server I play on is to max lvl 40. Its a roleplayer server so the character needs to be chaotic evil. Not sure but might be able to get away with chaotic neutral and use COT class if thats an option (Rp as champion of Lloth). I've really been thinking the character would be a cleric and some kind of fighter? Taking a straight level 40 cleric doesn't seem right.<br/>\n<br/>\n It's not a heavily populated server so their would be little pvp. <br/>\n<br/>\n Medium level magic settings, Its been a while since I've played nwn but the highest rated items you could get were +7 if I remember correctly.<br/>\n<br/>\n Theres no real other rules or anything that you need to be aware of really though dev crit is disabled I believe or heavily nerfed so no point investing in that. The sub race drow doesn't get any extra stats. <br/>\n<br/>\n It's a bit of a grindy server and I have alot of real life commitments so please no base class crossing if possible.<br/>\n<br/>\n My idea is to be a melee centred cleric. Taking advantage of the elf racial and using a rapier and also a shield. Stabbing enemies in the face with her rapier and casting harm on anything that deserves it. Preferably strength based please regardless of the rapier, thats just because the weapon suits a drow better.<br/>\n<br/>\n For domains I was thinking magic and strength?<br/>\n<br/>\n So too recap. A chaotic evil/neutral depending if COT is used, drow melee cleric who can cast all cleric spells with good penetration, hard too dispel and is capable in melee with a rapier and shield. Please avoid the xp penalties if possible but in the end if it comes to gimping a build or the penatly I'll just have to take longer grinding it out.<br/>\n<br/>\n Thanks guys and any extra information you need I'll do my best.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:47 AM - Mar 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Is Cleric the favored class for female Drow on your server? That would make this easier.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "easp",
      "avatar": "no_avatar.png",
      "timestamp": "11:01 AM - Mar 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Typically yes. The only time they wouldn't be is if the individual made a back story so they could Rp into another class. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:53 PM - Mar 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">First... <span style=\"font-size:120%;line-height:normal\"><strong>WELCOME</strong></span> to our humble little group of surviving toon builders!  What took you so long to find us??? <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n Other than the favored class switch from wizard to cleric, does drow use the same racial bonus set-up bias as elf?  Like Keen Sense, Weapon Prof, etc. Otherwise it seems it just uses the standard +2DEX/-2CON bias.<br/>\n<br/>\n The allowed alignments then would be limited to CN &amp; CE. Correct?<br/>\n<br/>\n To avoid the XP penalty that would be either a CE clc/ftr/asn or CN clc/CoT/rog.  Sound like something that would interest you?   Access to all arcane scrolls in either case.<br/>\n<br/>\n TBH, I think you are missing a bet with cleric going plate/tower STR with a DEX race instead of robes/lighter shield DEX but if that is your preference, so be it.  The rapier is kinda a natural finessing weapon. You can forget building a stealth toon, though, because the armor/shield penalties will kill that idea.<br/>\n<br/>\n Do you plan to exploit Divine Power BAB 15 or just reach for the highest BAB possible?<br/>\n<br/>\n Is there permahaste props on the server?  If not, you'll be needing Travel domain.  My second choice would be Strength just as you have suggested UNLESS there are no Imp Invis scrolls available, then would opt for Trickery to also boost the asn or rog skills and operate with the default DP slots.  What about scrolls?  Are there merchants that provide a typical supply of arcane scrolls and wands?<br/>\n<br/>\n I don't understand the benefit of the Magic domain at all.  Mage Armor is essentially worthless with Magic Vest x2 (MA's +1 dodge... Woohoo!).  Melf's arrow is too low damage to be of much value.  Cleric doesn't need NEB with the ability to cast so many negative energy spells (like Inflict/Harm).  Stoneskin you get with Strength domain.  So, in effect you'll be taking Magic domain to cast Level 5 Icestorms.  Is that your priority?<br/>\n<br/>\n Does your server use a Divinity system like WoG implements?  That forces a cleric to declare a divine association during creation and each divinity has a rigid pair of domains associated with it.  Also, choosing a divinity is further limited by alignment restrictions.  Just wondering.  Sometimes servers devise a way to nerf the cleric class by limiting domains so am checking quick before we assume too much.<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "easp",
      "avatar": "no_avatar.png",
      "timestamp": "11:37 PM - Mar 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the warm welcome mate. I use to role play in nwn years and years ago and wanted to get back into it with my bro since there's not many good games out these days.<br/>\n<br/>\n The sub race gets<span style=\"color:#39424D\">: dark vision, Spell Resistance: Innate spell resistance of 10 plus 2 every 4 levels. Spell-Like Abilities: 1/day - Darkness, Faerie Fire. </span><span style=\"color:#39424D\">Light Sensitivity: -5 to saving throws verses light based spells.</span><br/>\n<br/>\n<span style=\"color:#39424D\">Any none good alignment.<br/>\n<br/>\n Either of those classes sounds great. Though if you think Dex will be better than by all means do what you think is best. I'm just a dumb noob here.</span><br/>\n<br/>\n I intend to use divine power that's why I wanted to use the strength domain. There is permenent haste available so travel isn't necessary. I just thought magic would be a good domain to take. Though maybe trickery would be good?<br/>\n<br/>\n There is no divinity system in place too worry about.<br/>\n<br/>\n Also I'm sorry but looking at the server wiki I can't seem to find the cleric is drow favoured class. So I'll either have too cop an xp penalty or only multi class with cot or assassin as I'm not sure how easy it is too change alignments here. Sorry for the mix up.<br/>\n<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:37 AM - Mar 09, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I made an evil Clc/BG/Asn that had no XP penalty but it was not a very good build for a number of reasons.<br/>\n<br/>\n The Clc/CoT/Rog build 20% XP penalty can be postponed until level 36 which seems reasonable to me so that's the one I recommend.  It is a slow-developing cleric (to avoid early penalty) but a very strong one.  Epic Dodge and the 7-42 sneak damage both really help.  I would recommend using extended Darkness/Ultravision whenever possible because it all but eliminates the possible AoOs, prevents flankers from having their way in most cases and every successful attack will do sneak damage to vulnerable races.  I set this up with rogue skills but if you don't feel like using them, there are enough ranks there to max another class skill.  I was considering to maybe move some of those Lockpick ranks to Search, for example.<br/>\n<br/>\n Clc 17/ CoT 9/ Rog 14, any non-evil Elf<br/>\n Pre-epic Clc8/Rog8/CoT4<br/>\n<br/>\n (CoT 9 is there for a late Discipline dump for Dexer... nothing more.)<br/>\n<br/>\n STR 10, DEX 17(28), CON 12, WIS 15(19), INT 14, CHA 8<br/>\n Pre-epic STR 10, DEX 20, CON 12, WIS 17, INT 14, CHA 8<br/>\n<br/>\n HP: 350  (470 w/Emp Endurance)<br/>\n Saves (F/W/R): 27/27/35 (35/35/43 v spells, several points higher w/full buff)<br/>\n Add'l saves: Mind Effects: +2, Traps: +3<br/>\n BAB: 26 (this is not the DP exploit version)<br/>\n AB (max, naked): 39 (melee), 36 (ranged)<br/>\n AC (naked/mundane armor/shield only): 29/32<br/>\n<br/>\n Skills (includes trap skill level high enough to recover and set all deadly but gas)<br/>\n Concentration 42(43), Disable Trap 17(21), Discipline 43(43), Open Lock 28(37), Set Trap 10(21), Spellcraft 42(44), Tumble 40(49), UMD 34(33)<br/>\n<br/>\n Feats:<br/>\n Pre-epic: Doms <strong>War/Earth</strong>, Blind Fight, Weapon Finesse, WF: Rapier, Extend, IC: Rapier, Expertise, Empower,<strong> KD/IKD</strong><br/>\n Epic: Grt DEX, EWF: Rapier, Grt DEX, Grt WIS, Grt DEX, Defensive Roll, Grt DEX, <strong>Epic Dodge</strong>, Improved Evasion, Epic Prowess, Armor Skin<br/>\n<br/>\n Recommended domains:  Essential - Either Animal or War to gain access to Cat's Grace<br/>\n Earth - Stoneskin, Energy Buffer<br/>\n Trickery - To boost disable trap skill, locks, search, etc. and Imp Invis (this is the only %concealment spell available to cleric spellbook)<br/>\n Plant - +5 max nat AC, Creeping Doom<br/>\n<br/>\n The only firm choice is a domain that can buff DEX.  Figure on an empowered Cat's to boost AB, AC &amp; reflex by 3 with a good roll.<br/>\n<br/>\n For the other domain choice, consider that all arcane scrolls will be available and will cast up to Level 9 spells without failure via UMD 33.<br/>\n Besides Imp Invis, Trickery will boost most rogue skills so if you choose not to use them, the domain has less value.  Earth provides Stoneskin's DR and Energy Buffer (the only element protection vs. sonic damage).  Plant is valuable if +5 natural AC item props are rare to find and Creeping Doom is guaranteed to damage all creatures except those with immunity to spell levels or conjuration school.<br/>\n<br/>\n I haven't listed Strength domain as a recommendation because the extended Level 3 DP spell is not handy.  Slot 4 will be used for Empowered Cat's, Bull's, Owl's and Endurance. (and Fox's to increase saves vs spells if there is room).  There won't be slots to spare for Extended DP.  Extended Level 4 DP will only compete with Spell Resistance which may not be necessary when SR item props are equipped.  So Level 5 slots should be mainly DP.   Rather than Strength's Stoneskin, instead choose Earth domain for its arcane spells.<br/>\n<br/>\n Also notice that most of the 1x/day special abilities that have duration are practically worthless without higher CHA and even with an empowered casting of Eagle's, won't last long enough to affect combat much.  So, for all intents and purposes, ignore them.<br/>\n<br/>\n Robes vs. full plate - besides the potential encumbrance issue with a Dex build, robes will provide more AC. The unbuffed DEX AC will be 9 vs full plate 8+1 DEX which is a tie. But up to +3 more with Emp Cat's buff (and up to +6 when ability cap is met with items).  Assuming equal AC bonus enhancements, the comparison is 15 AC vs 9 AC maximum difference.  UMD will provide access to arcane and monk robes/gear.<br/>\n<br/>\n Shield - Any shield works fine except should be unequipped when setting traps if you stick with those skills.<br/>\n<br/>\n AB buffed potential: 39 + 6 (DEX cap) + 7 (max server enhancement) + 1 Aid + 1 Bless +1 DF +2 Battletide +1 Prayer +4 DP = 62  Note:  Haven't checked this but it might be slightly over the +20 AB cap that most servers use.  At any rate, the buffed AB will be at least 59.<br/>\n<br/>\n If the build seems interesting to you, I will help you work out the details and perhaps others will have further suggestions to improve it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "easp",
      "avatar": "no_avatar.png",
      "timestamp": "5:11 AM - Mar 09, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks so much for taking the time and explaining it all too me. It sounds really good and copping an xp penalty towards the end isn't a problem.<br/>\n<br/>\n Will the character still be able to hit for decent damage with its base attacks since its not strength based?<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:05 AM - Mar 09, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Rapier 1-6 piercing<br/>\n Darkfire 9-14 fire<br/>\n Div Favor +5 magical (ignores DR)<br/>\n Prayer +1 piercing<br/>\n Battletide +2 magical (ignores DR)<br/>\n Server weapon +7 piercing<br/>\n Divine Power +4 piercing<br/>\n Empowered Bull's +3 piercing<br/>\n [Note: Divine Power + Emp Bull's together can exceed the ability cap so when both are active only +6 (not +7) will be reported but when DP expires, the full +3 from Emp Bull's remains.]<br/>\n<em>All damage listed above will double on successful crit.</em><br/>\n<br/>\n Sneak damage +7-42 piercing (no multiplier)<br/>\n<br/>\n Any OnHit weapon damage property on rapier will not double on crit.<br/>\n<br/>\n Rapier w/ImpCrit = crit x2 15-20 (30%) or 12-20 (45%) with keen weapon<br/>\n<br/>\n Generally speaking, a Dex build benefits more than a Str build from Divine Power.  DP automatically raises STR to 18 before applying add'l Str boosts (per items &amp; Bull's).  A Str build only benefits from the increase to BAB.  The Str cap for this build is 22 (+6).  The main advantage of a DP Dex build is that with the increased AC potential, Epic Dodge and superior reflexes, enemies will be landing fewer hits (that includes range attacks as well) and than means fewer rounds devoted to healing in combat. In Expertise mode this toon will be near untouchable other than opposed natural 20s. <br/>\n<br/>\n For your own edification, you should try both versions of the same build to see for yourself the difference.  A Str version is extremely easy to build because you need not be concerned qualifying for Epic Dodge (Rog 13, Dex 25, Tumble 30) and therefore will have access to more combat feats (like Cleave, Called Shots, and others).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "easp",
      "avatar": "no_avatar.png",
      "timestamp": "10:26 AM - Mar 09, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh ok I didn't consider these things but thats why I'm here :)<br/>\n<br/>\n So what build order and feat order should I do?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:35 PM - Mar 09, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Make a stab at it yourself. The whole framework is described and feats are in order.<br/>\n<br/>\n Using <a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/other/tool/characterbuildcalculator-cbc\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#FF0000\"><strong>Kamiryn's CBC spreadsheet</strong></span></a> is the easiest and fastest way.  Some members use the <a class=\"postlink\" href=\"http://neverwintervault.org/sites/all/modules/pubdlcnt/pubdlcnt.php?file=http://neverwintervault.org/sites/neverwintervault.org/files/project/1828/files/pgc3_v43.zip&amp;nid=1828\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#FF0000\"><strong>Pretty Good Character Creator</strong></span></a>. There may be other adequate utilities around. Dunno. Focus on pre-epic levels 1-20 first.  Post it here then we'll do epic levels together.  Then we can discuss tactics to get the most out of the build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "easp",
      "avatar": "no_avatar.png",
      "timestamp": "8:03 AM - Mar 10, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">*edit<br/>\n<br/>\n Ok retry tell me how this goes. Had a big day at work so struggling to get my head around it a bit. Hoping to get a start on this character tomorrow so can start on a server with my brother.<br/>\n<br/>\n Finishing stats are as you said they should be. <br/>\n<br/>\n 1.Cleric - Blindfight<br/>\n 2.Cleric -<br/>\n 3.Rogue - Weapon Finesse<br/>\n 4.Rogue - +DEX<br/>\n 5.Rogue - <br/>\n 6.Cleric -  WF: Rapier<br/>\n 7.Cleric - <br/>\n 8.Rogue - +WIS<br/>\n 9.Rogue - Extend Spell<br/>\n 10.Cleric - <br/>\n 11.Cleric -<br/>\n 12.Rogue - +DEX, IC: Rapier<br/>\n 13.Rogue -<br/>\n 14.Cleric -<br/>\n 15.Cleric - Empower Spell<br/>\n 16.Rogue - +DEX<br/>\n 17.COT -<br/>\n 18.COT - Expertise, Knockdown<br/>\n 19.COT -<br/>\n 20.COT - +WIS, IKD<br/>\n 21.COT - Great Wis<br/>\n 22.COT - EWF: Rapier<br/>\n 23.COT -<br/>\n 24.COT - +DEX, Great Dex, Great Wis<br/>\n 25.Rogue -<br/>\n 26.Cleric -<br/>\n 27.Cleric - Great Dex<br/>\n 28.Rogue - +DEX, Def roll<br/>\n 29.Rogue -<br/>\n 30.Cleric - Great Dex<br/>\n 31.Cleric -<br/>\n 32.Rogue - +DEX<br/>\n 33.Rogue -  Epic Dodge, IE<br/>\n 34.Cleric - <br/>\n 35.Cleric -<br/>\n 36.Rogue - +DEX, Armor Skin<br/>\n 37.Cleric -<br/>\n 38.Cleric -<br/>\n 39.Cleric - Epic Prowess<br/>\n 40.COT - +DEX<br/>\n<br/>\n To answer your questions mate, its been 10 years since I've played NWN so I have no idea about either.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:52 PM - Mar 10, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You did well for your first attempt to hash out a class sequence.  Epic leveling is always the more difficult to plan because you are racing to get the feats that have the greatest impact on the playability as early as possible and that is not always easy, especially when juggling class levels to prevent unnecessary XP penalty.  Don't feel too overwhelmed.  Comfort will come in time as you build more and read about the decisions made in others' builds.<br/>\n<br/>\n Oh, and that ability burp... that is common for new users of the CBC.  I also did it and actually wrote Kamiryn to report that \"my CBC wasn't working right\".  *doh!* The key is that the fourth row (the darkest grey row) shows the final ability level after racial adjustments, the level that will appear in the character creation screen.  The input (white) row just shows how many ability points you are allocating from your starting pool.  I suspect you won't make the same mistake your next build attempt.<br/>\n<br/>\n But your ability mistake brings up a good point.  <br/>\n<br/>\n By accidentally setting the starting DEX at 18, it achieves two goals:  It increases AB, AC &amp; reflex by 1 at the cost of 40 HP and +1 fort plus an earlier Epic Dodge.  That's a great bargain normally.  But dropping CON to 10 is only feasible for an archer build, like AA perhaps.  The HP total @Lvl 40 will be 310 and even with Empowered Endurance that total will be too dangerous.  Even at the level I designed, CON 12, it is still a bit too low for comfortable melee.  It is only the cleric's metaspelling that provides enough of a health buffer to survive tough battles... and, of course, Epic Dodge at Lvl 33.  Only your own experience testing within the intended environment can determine whether the ability spread is viable or not for your own play style, so take notes as you play.  OK. Now to analyze your list...<br/>\n<br/>\n 1.  Cleric opener instead of rogue opener means fewer total skill points... but for this build there are plenty to spare so go for early spells.<br/>\n<br/>\n 2.  Set up an extra Lvl 3 slot at Clc 5 by taking one WIS bump (to 16) before (or at) Clc 5.  Lvl 8 would be the best choice.<br/>\n<br/>\n 3.  By taking the 2nd WIS bump at the end of pre-epic, it guarantees you will gain a Lvl 4 slot on the CoT level where you take Grt WIS, and that should be ASAP.<br/>\n<br/>\n 4. CoT 5-8 should be taken immediately in epic (21-24) to grab EWF and the Grt WIS (comment, note 3).  The extra saves and d10 doesn't hurt either.  This way, all the <strong>general</strong> feats can be assigned to Grt DEX to reach Epic Dodge ASAP.  With fighter and CoT, using the bonus feat slots for combat feats/general feats for Grt abilities is the trick to reach the high ability prereqs for ED and DevCrit early (and Dragon shape with CoT)... so write that one down.<br/>\n<br/>\n 5.  Epic Dodge requires Tumble 30 (minimum of Lvl 27 to reach this), DEX 25 (Lvl 28 earliest here) and Rog 13 (means 5 levels of rogue in epic but due to threat of XP penalty must be alternated with Clc levels).  Rog 13 is the toughest prereq to meet in this build combo unless you ignore the XP penalty altogether, then could get ED as early as Lvl 30.<br/>\n<br/>\n 6. Your last rogue level at 36 will cost -1 Tumble AC.   Level 37 works, though.  I had set the rogue dump level at 38 thinking I may want to reach UMD 40 should there be very expensive class-specific items to equip.  So, if items like that are available we may want to juggle some of the skill allotments around to achieve that with a dump at 38.  Like I said, there are plenty of skill points to play with.  At the current UMD level plan, all arcane spells via scrolls will cast without failure.<br/>\n<br/>\n 7. Your AB potential and AC level will be so high that delaying Prowess and Armor Skin late should have little impact.  I consider them icing on the cake in this build. I wouldn't make them a priority.<br/>\n<br/>\n Okay, must run now so digest this and make a revised attempt by simply editing the list posted rather than extending the thread longer with copies of it.  I will be watching so won't miss an edit, I assure you.  If you have questions about my comments, then make a new post for that reason.  Let's try to use your listing dynamically to prevent confusion.<br/>\n<br/>\n I do have two questions for you, though:<br/>\n<br/>\n A.  How available are arcane spell scrolls and how high level spell scrolls are sold?<br/>\n B.  Does Expertise mode work while spellcasting on this server?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:19 PM - Mar 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>easp wrote:</strong><hr/>--clip--<br/>\n<br/>\n 11.Cleric -<br/>\n<span style=\"color:#FFFF00\">12.Rogue</span> - +DEX, IC: Rapier                         <br/>\n<span style=\"color:#FFFF00\">13.Rogue</span>                                                         <br/>\n<span style=\"color:#FFFF00\">14.Cleric </span>-                                                          <br/>\n<span style=\"color:#FFFF00\">15.Cleric </span>- Empower Spell                             <br/>\n 16.Rogue - +DEX                                                <span style=\"color:#AFEEEE\">swap class sequence </span><span style=\"color:#D3D3D3\">17-20</span><span style=\"color:#AFEEEE\"> to </span><span style=\"color:#FFFF00\">12-15</span><span style=\"color:#AFEEEE\"> </span><span style=\"color:#AFEEEE\"> (and re-sequence, if needed to avoid penalty)</span><br/>\n<span style=\"color:#D3D3D3\">17.COT</span> -                                                            <br/>\n<span style=\"color:#D3D3D3\">18.COT</span> - Expertise, Knockdown                  <br/>\n<span style=\"color:#D3D3D3\">19.COT </span>-                                                           <br/>\n<span style=\"color:#D3D3D3\">20.COT </span>- +WIS, IKD     <br/>\n                                    <br/>\n 21.COT - Great Wis (general) <strong><span style=\"color:#FF0000\">&lt;----- Grt DEX</span></strong><br/>\n 22.COT - EWF: Rapier (bonus)<br/>\n 23.COT -<br/>\n<br/>\n 24.COT - +DEX, Great Dex, Great Wis (bonus)<br/>\n -- clip --<br/>\n<br/>\n 35.Cleric -<br/>\n 36.Rogue <strong><span style=\"color:#FF0000\">&lt;----- (Cleric) </span></strong>- +DEX  <strong><span style=\"color:#FF0000\"> &lt;---- WIS+1 </span></strong>, Armor Skin<br/>\n 37.Cleric <strong><span style=\"color:#FF0000\">&lt;-----  (Rogue)</span></strong><br/>\n<br/>\n -- clip --<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n You won't want to wait through 8 straight levels of CoT before taking a skill dump. Focus on pre-epic for now so you can play. We can adjust epic levels if needed later.\n<blockquote><div>To answer your questions mate, its been 10 years since I've played NWN so I have no idea about either.</div></blockquote>\n The questions were server-specific. I've never played there and have no way to discover these facts unless the player (You!) reveals them. The answers can impact the build choices. If you identify the server (and... if it furnishes a list of changes on a web site), I can make a more informed recommendation, if I can find the time to dig through their webpages.<br/>\n - - - - - - - - - - - - - - - - - - - -<br/>\n Skill schedule (includes most recent leveling corrections)<br/>\n Concentration 42(43), Disable Trap 5(9), Discipline 43(43), Open Lock 1(10), Search 16(20), Set Trap 5(16), Spellcraft 42(44), Tumble 40(49), UMD 34(33)<br/>\n remaining ----&gt; 28<br/>\nSpoiler [+]\n<table class=\"post_content_table\"><tbody><tr><td>-------</td><td>---------</td><td>---------------------------------------------------------------------</td></tr><tr><td>01:<br/>\n 02:<br/>\n 03:<br/>\n 04:<br/>\n 05:<br/>\n 06:<br/>\n 07:<br/>\n 08:<br/>\n 09:<br/>\n 10:<br/>\n 11:<br/>\n 12:<br/>\n 13:<br/>\n 14:<br/>\n 15:<br/>\n 16:<br/>\n 17:<br/>\n 18:<br/>\n 19:<br/>\n 20:<br/>\n 21:<br/>\n 22:<br/>\n 23:<br/>\n 24:<br/>\n 25:<br/>\n 26:<br/>\n 27:<br/>\n 28:<br/>\n 29:<br/>\n 30:<br/>\n 31:<br/>\n 32:<br/>\n 33:<br/>\n 34:<br/>\n 35:<br/>\n 36:<br/>\n 37:<br/>\n 38:<br/>\n 39:<br/>\n 40:</td><td>Clc<br/>\n Clc<br/>\n Rog<br/>\n Rog<br/>\n Rog<br/>\n Clc<br/>\n Clc<br/>\n Rog<br/>\n Rog<br/>\n Clc<br/>\n Clc<br/>\n CoT<br/>\n CoT<br/>\n CoT<br/>\n CoT<br/>\n Rog<br/>\n Rog<br/>\n Clc<br/>\n Clc<br/>\n Rog<br/>\n CoT<br/>\n CoT<br/>\n CoT<br/>\n CoT<br/>\n Clc<br/>\n Rog<br/>\n Clc<br/>\n Rog<br/>\n Rog<br/>\n Clc<br/>\n Clc<br/>\n Rog<br/>\n Rog<br/>\n Clc<br/>\n Clc<br/>\n Clc<br/>\n Rog<br/>\n Clc<br/>\n Clc<br/>\n CoT</td><td>Conc(4), Spcr(4), S - 8<br/>\n Conc(1), Spcr(1), S - 10<br/>\n D Trap(5), Lock(1), S Trap(2), Tumb(6), UMD(6)<br/>\n Srch(5), Set Trap(3), Tumb(1), UMD(1)<br/>\n Srch(3), Tumb(1), UMD(1), S - 5<br/>\n Conc(4), Spcr(4), S - 1<br/>\n Conc(1), Spcr(1), S - 3<br/>\n Srch(3), Tumb(3), UMD(3), S - 4<br/>\n Srch(1), Tumb(1), UMD(1), S - 11<br/>\n Conc(3), Spcr(3), S - 9<br/>\n Conc(1), Spcr(1), S - 11<br/>\n Disc(15)<br/>\n Disc(1), S - 3<br/>\n Disc(1), S - 6<br/>\n Disc(1), S - 9<br/>\n Srch(3), Tumb(7), UMD(7), S - 2<br/>\n Tumb(1), UMD(1), S - 10<br/>\n Conc(7), Spcr(7)<br/>\n Conc(1), Spcr(1), S - 2<br/>\n Srch(1), Tumb(3), UMD(3), S - 5<br/>\n Disc(6), S - 3<br/>\n Disc(1), S - 6<br/>\n Disc(1), S - 9<br/>\n Disc(1), S - 12<br/>\n Conc(6), Spcr(6), S - 4<br/>\n Tumb(6), UMD(6), S - 2<br/>\n Conc(2), Spcr(2), S - 2<br/>\n Tumb(2), UMD(2), S - 8<br/>\n Tumb(1), UMD(1), S - 16<br/>\n Conc(3), Spcr(3), S - 14<br/>\n Conc(1), Spcr(1), S - 16<br/>\n Tumb(3), UMD(2), S - 21<br/>\n Tumb(1), S - 30<br/>\n Conc(3), Spcr(3), S - 28<br/>\n Conc(1), Spcr(1), S - 30<br/>\n Conc(1), Spcr(1), S - 32<br/>\n Tumb(4), S - 38<br/>\n Conc(2), Spcr(2), S - 38<br/>\n Conc(1), Spcr(1), S - 40<br/>\n Disc(16), S - 28</td></tr></tbody></table><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}