{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "194",
  "name": "Hierophant of Velsharoon: Cleric 26/Bard 4/Palemaster 10",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/hierophant-of-velsharoon-cleric-26-bard-4-palemast-t2354621.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": 0,
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:25 PM - Nov 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><em>This is a repost of a build designed by Mithradates on 7/4/2002, furnished by Kalistez in <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354618/\" rel=\"noreferrer\" target=\"_blank\">a discussion of DevCrit cleric builds</a>.  We can thank Mith and him for the glimpse into a great concept!</em><br/>\n - - - - - - - - - - - - - - - - - -<br/>\n Hierophant of Velsharoon Backstory<br/>\nSpoiler [+]<br/>\n<br/>\n The pale glow of the morning sun could scarcely pierce the thick fog which swirled about the four adventures. “Urgh.” grunted the largest of them, as he tripped over a granite tombstone. The stones jutted out of verdant lawn at odd angles like the teeth of an ogre, once they had been laid straight and even but time had shifted them and worn away all traces of the men they stood to commemorate. “Curse this fog! I can’t see my hand before my face and I think my armour is starting to rust.” Boomed the husky voice of the warrior, favouring his wounded foot.<br/>\n<br/>\n “Cordhan’s right, we should have stayed at the inn ‘till noon. Our task would have been far easier and I could have finished my breakfast.” Echoed a smaller figure who was slightly ahead of the others. His soft voice, though clearly audible, was a whisper compared to his large companion. He brushed back a lock of sodden hair that had fallen before his eyes and shook some of the dew from his black leather armour, as he stooped down to examine the earth.<br/>\n<br/>\n “Lynx, you know very well time is of the essence. There are times the Morninglord can be hard master, and we must learn to do without. We should have left earlier, but I feel we shall need the power of the dawn in this battle. If you are quiet you can hear them.” Chastised the third member of the group, who was now attending to Cordhan’s foot. His rich tenor echoed off the stones of the graveyard, as he healed the wound with a prayer.<br/>\n<br/>\n Lynx retorted immediately, though his voice was tinted with indignation, it kept its quiet timber, “My ears are far keener than yours, Arlo. Leave the scouting to me, I don’t tell you and Cordhan how to serve Lathander. They’ve been around us since we entered, but they’ve been moving out of our path. It’s as if they’re avoiding us. I don’t think we need to concern ourselves about maintaining the element of surprise, it’s not like this fog would even affect their sight.” He paused to rise then continued. “ The earth here has been disturbed; Cordhan, watch that your big feet don’t end up in an open grave.”<br/>\n<br/>\n “It’s not like the undead to avoid a confrontation. These are no mindless automatons that surround us; the force that commands them must be powerful indeed.” Chirped the melodic voice of the last adventuress. Her heavy robes clung closely to her lithe form as she struggled to move under their weight. She leaned heavily on her staff as she moved closer to Cordhan and Arlo. For a few moments, the four adventurer listened to sounds of the wind blowing through the cemetery and the rustling of the grass just beyond their sight in the fog. “Fear not Elsa,” quipped Cordhan, now in better spirits since his encounter with the tombstone, “the master of these fiends will be no match for our righteous might.”<br/>\n<br/>\n “I doubt the four of you would pose more than a distraction for Velsharoon, for he is their master. I, like those I walk with, am merely his humble servant.” Spoke a raspy baritone voice, the voice of one who was unaccustomed to speech. The four friends turned towards the source of the voice who now approached them from behind. For a few moments there was silence, except for the wind and rustling of the grass from the direction of the voice. At first they saw the faint light of a fiery torch, then the fog spewed forth a dark figure. They could not make out a face, only the outline of a large armoured warrior. His armor was adorned with spikes that broke up his silhouette, giving him a decidedly demonic aspect. On one arm he held a large mantlet which obscured the left side of his body. In his right hand, what they had mistaken for a torch was a long curved dagger its blade wreathed in flame.<br/>\n<br/>\n Elsa began to chant, the air bristled with arcane energy which she shaped into a ward for herself. Cordhan and Arlo drew their weapons, while Lynx stepped back retreating into the fog. “Do you think that spell means anything to a servant of the Vaunted?” Mocked the figure. He charged forth, bringing his dagger down in an overhead thrust. There was a flash of blue light as the blade broke through the ward, sinking into the forehead of the sorceress and dropping her to her knees. The corpse of the elf twitched on the end his dagger as he planted his foot against her chest and pulled the blade free.<br/>\n<br/>\n As the body of the sorceress slumped back, Cordhan thrust at the figure with his sword. His blade broke through figure’s plate, driving up under his arm and deep into his torso. The figure lurched forward, sprawling onto his shield as the knight withdrew his blade. Cordhan heard the mumbled words of the figure and stepped close to finish off the mortally wounded foe. As the knight stepped in, the servant of Velsharoon rolled on to his back, his skeletal shield arm reached forth touching the knight’s greave. Cordhan gasped breathlessly as a wave of energy swept through his body, draining the life from his limbs. As the knight stumbled, reeling from the magical attack, the Velsharite sat up driving his blade into the warrior’s stomach, the flaming blade hissed as it quenched itself in his blood. As he withdrew the blade, which crackled to life with flame again, he pulled himself to his feet.<br/>\n<br/>\n “Back to the Abyss, foul fiend! “ shouted Arlo as he thrust the symbol of Lathander into the face of the Velsharite. The figure batted the symbol aside with his dagger and stepped in embracing the cleric. “I’m not undead yet, fool. Know that death will not be the end for you.” He mocked as he stabbed his dagger repeatedly into Arlo’s back. Arlo tried to scream, but all he could manage was a wet gurgle as blood flowed into his collapsed lungs. The Velsharite priest released his mortal foe, letting him sink to the ground.<br/>\n<br/>\n Lynx hunched silently in the fog, he didn’t dare move. He could only hear the crackle as the last of his friend’s blood burned off of the Velsharite’s dagger. He peered cautiously out from behind the tombstone which masked his presence as he looked towards the warrior. The figure was staring directly at him, his eyes were like pools of darkness and his pale face was festooned with black tattoos which gave him a skull like countenance.<br/>\n “Why didn’t you attack me like the others?” spoke the figure.<br/>\n “I-I figured if Cordan’s blow didn’t fell you, mine would do no better” Stuttered the rogue.<br/>\n “Good, you learn from what you observe and are not prone to rash actions. You do not follow Lathander, do you Lynx?”<br/>\n “No sir, I don’t follow Lathander or any of the gods, they’ve never done anything for me.” Stammered the rogue, surprised that Valsharite remembered his name.<br/>\n “Then you know you are doomed to an eternity of boredom within Kelemvor’s realm. It is not a fate I would wish on anyone. Hence I offer you a choice, you may go now and leave this place or you may walk by my side and I will teach you how to cheat death itself. Undeath is not to be feared, it offers us the chance to remain in this realm for more than the four score years allotted by the gods for humans like us. It also offers us power, would you like to continue skulking behind tombstones while others battle, or do you seek to drive your enemies before you like frightened cattle? To learn and to grow in power, perhaps in time to become gods ourselves like Velsharoon, that is what I offer you. He has shown us they way, and I will introduce you to his rites and mysteries.”<br/>\n “But you killed my friends.”<br/>\n “And if I did not, would your friends not have done the same to me? Think carefully before you decide, it is not often that one is presented with such an offer.”<br/>\n “If I join you, will you grant them a burial according to their rites?”<br/>\n “No, I will not barter for loyalty. A disciple gained through such a bargain would just as easily be lost. If you join me, you must do so for no incentive other than the knowledge I offer.”<br/>\n After a few minutes, Lynx stood up from behind the tombstone and walked over to the priest.<br/>\n “Good,” quipped the Valsharite, “we shall begin your training by welcoming your friends into the Vaunted’s embrace.”<br/>\n<br/>\n After the Cleric/Bard/RDD (Blood and Faith), I felt a Cleric/Bard/PM was in order and looking at the other Cleric/Bard/PMs I didn't see one with this level distribution and/or devastating critical. I went for devastating critical because, with an immunity to critical hits, it's just too juicy to pass up. For those who play in settings where the feat is banned, I've included a version without devastating critical. Because of the steep feat requirements, I had to use simple weapons and the melee weapon with the largest threat range out of them is the dagger (this build might work okay with a crossbow too). For the non-devastating critical version I chose the katana. I find the martial weapons are better but, since I had to spend a feat for a weapon proficiency, I figured I might as well grab an exotic. The build works well, the RDD fit better, but the PM immunities and AC boosts are not to be overlooked. The AB isn't good enough for high magic settings, but it should do nicely in no to mid magic settings. I didn't go for 16 PM levels and epic spells, because with 4 bard levels they don't last long enough to warrant the levels and I'd rather be harder to dispel as a cleric.<br/>\n<br/>\n<br/>\n<br/>\n<strong>Advantages</strong><br/>\n -Devastating critical. The DC is 38, which isn't that great, and it is with a... dagger, still death with a single blow is nice to have<br/>\n -Level 9 cleric spells. With 26 levels, They can't be dispelled except by Mordenkainen's disjunction or a holy avenger. With a 20 wisdom his DCs are pathetic so avoid spells with saves.<br/>\n -Good AC. He can manage a 57 with no magical equipment and a 69 with +5 equipment (76 if he abuses UEF).<br/>\n -High buffed AB. He has 3 attack and a 37 unbuffed AB, which is fairly low, but with a mundane dagger he can get 5 attacks (3 of them at max AB) with a 59 AB. He also has a taunt of 12, yes this is pretty low, but against an opponent who has put no skill points into concentration it does the trick.<br/>\n -Immunity to critical hits. Very useful in an environment with devastating critical.<br/>\n -Immunity to paralysis. Bad luck for assassins and monks.<br/>\n -High UMD. He can use items for any class, race or alignment.<br/>\n<br/>\n<strong>Disadvantages</strong><br/>\n -Mediocre hitpoints. Just shy of 400, he can buff them up a bit and has tons of healing spells, but they are still low.<br/>\n -Mediocre saves. The fortitude save and will save are okay vs. spells (unbuffed the best a mage can manage is a 30+spell level DC [the wizard 29/bard 2/RDD 9 can manage 1 higher]). The reflex save is low, and against effects other than spells his fortitude and will saves could be better.<br/>\n -Has to wait until level 24 for level 9 spells. The Great wisdom had to be taken on a cleric bonus feat<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>Hierophant of Velsharoon</strong></span><br/>\n<br/>\n<em>Race</em> Human<br/>\n<br/>\n<em>Alignment</em> CN/TN or CE/NE<br/>\n<br/>\n<em>Base Attributes</em><br/>\n STR 16<br/>\n DEX 8<br/>\n CON 14<br/>\n INT 14<br/>\n WIS 15<br/>\n CHA 8<br/>\n<br/>\n<em>Attribute Bonuses</em><br/>\n Levels 4, 8 and 12 increase Wisdom<br/>\n Levels 16, 20, 24, 28, 32, 36 and 40 increase Strength<br/>\n<br/>\n<em>Final Level Distribution</em><br/>\n Bard 4<br/>\n Cleric 26<br/>\n Palemaster 10<br/>\n<br/>\n<em>Clerical Domains</em><br/>\n Travel and Trickery<br/>\n<br/>\n<em>Level Distribution and Feats</em><br/>\n Level 1: (Cleric 1): Knockdown, Blind-Fight<br/>\n Level 2: (Cleric 2)<br/>\n Level 3: (Cleric 3): Weapon Focus (Dagger)<br/>\n Level 4: (Cleric 4)<br/>\n Level 5: (Cleric 5)<br/>\n Level 6: (Cleric 6): Extend Spell<br/>\n Level 7: (Cleric 7)<br/>\n Level 8: (Cleric 8 )<br/>\n Level 9: (Cleric 9): Power Attack<br/>\n Level 10: (Cleric 10)<br/>\n Level 11: (Cleric 11)<br/>\n Level 12: (Cleric 12): Improved Critical (Dagger)<br/>\n Level 13: (Cleric 13)<br/>\n Level 14: (Cleric 14)<br/>\n Level 15: (Cleric 15): Cleave<br/>\n Level 16: (Cleric 16)<br/>\n Level 17: (Cleric 17)<br/>\n Level 18: (Cleric 18): Great Cleave<br/>\n Level 19: (Cleric 19)<br/>\n Level 20: (Cleric 20)<br/>\n Level 21: (Cleric 21): Epic Weapon Focus (Dagger)<br/>\n Level 22: (Bard 1)<br/>\n Level 23: (Cleric 22)<br/>\n Level 24: (Cleric 23): Epic Prowess, Great Wisdom I<br/>\n Level 25: (Cleric 24)<br/>\n Level 26: (Cleric 25)<br/>\n Level 27: (Bard 2): Great Strength I<br/>\n Level 28: (Bard 3)<br/>\n Level 29: (Cleric 26): Armor Skin<br/>\n Level 30: (Palemaster 1): Great Strength II<br/>\n Level 31: (Palemaster 2)<br/>\n Level 32: (Palemaster 3)<br/>\n Level 33: (Palemaster 4): Overwhelming Critical (Dagger)<br/>\n Level 34: (Palemaster 5)<br/>\n Level 35: (Palemaster 6)<br/>\n Level 36: (Palemaster 7): Great Strength III<br/>\n Level 37: (Palemaster 8 )<br/>\n Level 38: (Palemaster 9)<br/>\n Level 39: (Palemaster 10): Devastating Critical (Dagger)<br/>\n Level 40: (Bard 4)<br/>\n<br/>\n<em>Final Attributes</em><br/>\n STR 26<br/>\n DEX 8<br/>\n CON 14<br/>\n INT 14<br/>\n WIS 19<br/>\n CHA 8<br/>\n<br/>\n BAB 25 (3 APR)<br/>\n<br/>\n<em>AB and Damage</em><br/>\n (no buffs, mundane dagger)<br/>\n 37/32/27 8+1D4 (17-20 x2)<br/>\n Devastating Critical DC 38<br/>\n<br/>\n AB, ranged: 25<br/>\n<br/>\n (+4 to STR [Bull's Strength], Bless, Divine Favor, Aid, Prayer, Divine Power, Battletide, Greater Magic Weapon, Darkfire, Haste, Dagger)<br/>\n 59/54/49/59/59 16+1D4 (17-20 x2) +7 magic +10+1D6 fire<br/>\n Devastating Critical DC 40<br/>\n<br/>\n (As above with +12 to strength and keen dagger)<br/>\n 63/58/53/63/63 20+1D4 (15-20 x2) +7 magic +10+1D6 fire<br/>\n Devastating Critical DC 44<br/>\n<br/>\n<em>AC</em><br/>\n 25 (no buffs, no equipment)<br/>\n 36 (fullplate, tower shield, no buffs)<br/>\n 59 (fullplate, tower shield, magical vestments x2, shield of faith, undeath's eternal foe, haste)<br/>\n 71 (as above, but with UEF x4)<br/>\n 71 (+4 to dexterity, +5 fullplate, +5 tower shield, +5 ring of protection, +5 amulet of natural armor, +5 boots of the sun soul, haste, undeath's eternal foe)<br/>\n 78 (as above, but with UEF x3)<br/>\n<br/>\n<em>Final Saves (Vs. Spells)</em><br/>\n Fortitude 24 (33)<br/>\n Reflex 15 (24)<br/>\n Will 26 (35)<br/>\n<br/>\n<em>Hit Points</em> 390 (max. every level)<br/>\n<br/>\n<em>Skillpoints</em> 223<br/>\n Concentration 43 (44)<br/>\n Discipline 43 (52)<br/>\n Spellcraft 43 (45)<br/>\n Taunt 13 (12)<br/>\n Tumble 40 (49)<br/>\n Use Magic Device 41 (40)<br/>\n<br/>\n<em>Skillpoint Distribution</em><br/>\n Level 1: Concentration 4, Spellcraft 4, Save 12<br/>\n Level 2: Concentration 1, Spellcraft 1, Save 15<br/>\n Level 3: Concentration 1, Spellcraft 1, Save 18<br/>\n Level 4: Concentration 1, Spellcraft 1, Save 21<br/>\n Level 5: Concentration 1, Spellcraft 1, Save 24<br/>\n Level 6: Concentration 1, Spellcraft 1, Save 27<br/>\n Level 7: Concentration 1, Spellcraft 1, Save 30<br/>\n Level 8: Concentration 1, Spellcraft 1, Save 33<br/>\n Level 9: Concentration 1, Spellcraft 1, Save 36<br/>\n Level 10: Concentration 1, Spellcraft 1, Save 39<br/>\n Level 11: Concentration 1, Spellcraft 1, Save 42<br/>\n Level 12: Concentration 1, Spellcraft 1, Save 45<br/>\n Level 13: Concentration 1, Spellcraft 1, Save 48<br/>\n Level 14: Concentration 1, Spellcraft 1, Save 51<br/>\n Level 15: Concentration 1, Spellcraft 1, Save 54<br/>\n Level 16: Concentration 1, Spellcraft 1, Save 57<br/>\n Level 17: Concentration 1, Spellcraft 1, Save 60<br/>\n Level 18: Concentration 1, Spellcraft 1, Save 63<br/>\n Level 19: Concentration 1, Spellcraft 1, Save 66<br/>\n Level 20: Concentration 1, Spellcraft 1, Save 69<br/>\n Level 21: Concentration 1, Spellcraft 1, Save 72<br/>\n Level 22: Concentration 1, Discipline 25, Spellcraft 1, Taunt 6, Tumble 25, UMD 21<br/>\n Level 23: Concentration 1, Spellcraft 1, Save 3<br/>\n Level 24: Concentration 1, Spellcraft 1, Save 6<br/>\n Level 25: Concentration 1, Spellcraft 1, Save 9<br/>\n Level 26: Concentration 1, Spellcraft 1, Save 12<br/>\n Level 27: Concentration 1, Discipline 5, Spellcraft 1, Taunt 2, Tumble 5, UMD 5<br/>\n Level 28: Concentration 1, Discipline 1, Spellcraft 1, Taunt 4<br/>\n Level 29: Concentration 1, Spellcraft 1, Save 3<br/>\n Level 30: Concentration 1, Spellcraft 1, Save 6<br/>\n Level 31: Concentration 1, Spellcraft 1, Save 9<br/>\n Level 32: Concentration 1, Spellcraft 1, Save 12<br/>\n Level 33: Concentration 1, Spellcraft 1, Save 15<br/>\n Level 34: Concentration 1, Spellcraft 1, Save 18<br/>\n Level 35: Concentration 1, Spellcraft 1, Save 21<br/>\n Level 36: Concentration 1, Spellcraft 1, Save 24<br/>\n Level 37: Concentration 1, Spellcraft 1, Save 27<br/>\n Level 38: Concentration 1, Spellcraft 1, Save 30<br/>\n Level 39: Concentration 1, Spellcraft 1, Save 33<br/>\n Level 40: Concentration 1, Discipline 12, Spellcraft 1, Taunt 1, Tumble 10, UMD 15<br/>\n - - - - - - - - - - - - - - - - - - - - - -<br/>\n<em>Note from Hip:  Most of the skill points from UMD can be moved to the Taunt skill, making the attack roll even more \"devastating\".  For bards, all that is needed in net ranks of UMD to read scrolls and use wands, arcane or divine, is enough to cover their value (10 net points, 20K value, should be enough), plus whatever amount to equip class-specific gear you've targeted to use.  Bards automatically pass the hardcore scroll check.</em><br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}