{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "207",
  "name": "Harper Scout Combos",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/harper-scout-combos-t2354639.html",
  "author": "grom56",
  "avatar": "10404082_1510287071.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:22 PM - Nov 24, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello All,<br/>\n<br/>\n I've been looking through non-arcanist Harper Scout combos in the Filter and Archive - mostly because I've never played one, and wanted to understand more of its dynamic - and a few things have struck me that I hope you can cast some light upon...<br/>\n<br/>\n The first is one no one can do anything about, but it seems odd to me that a \"scout\" doesn't have Search as a class skill, particularly as you need 4 ranks in the skill before you can take the class. Hey-ho.<br/>\n<br/>\n Secondly, no one seems to take Persuade past the 8 prerequisite ranks. Is there a particular reason for this, or is it simply that other skills take precedence in complete builds? By the same token, the description of the class would seem to suggest enhanced CHA would be a good thing, but the only build I can find that plays up to this is Thazzle's Harper Champion (Fighter 15 / HS 5 / Paladin 20), which merges the class with Pally to give a natural synergy.<br/>\n<br/>\n Thazzle's build and Hip's recent Wulgar Ironbow (Fighter 16 / HS 5 / DwD 19) also appear to be the only two DEXers in town (still talking non-arcanist), while there are several STR-based, full plate wearing Scouts out there. Again, is there anything particular that seems to point builds in that direction?<br/>\n<br/>\n I ask particularly because I'm soon to start constructing (another) RP character. There are 5 of us in a commitment to go adventuring together, and the rest haven't played NwN before, so I've been given the task of pulling some characters together for them, taking account of their preferences and character back-stories. Thus far, I've been able to nick, virtually intact, a couple of builds from the Guild, but this one's proving a tough nut to crack. Non evil, non lawful, non spellcasting, human, party leader (so persuasive and/or charismatic), not feeble, but not a mountain of muscle, focused in melee. My thinking to date has led me to consider a Fighter/CoT/HS, but I wanted to check your collective thoughts on HS before I fully tip myself down that rabbit hole.<br/>\n<br/>\n Thanks in advance<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "10:12 PM - Nov 24, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The prereqs do not necessarily indicate a class proficiency, Stagmeister.<br/>\n<br/>\n Blackguard's Hide skill prereq, likewise, does not reflect an actual synergy.  The bottom line: prestige prereqs are more of a class balancing measure than some sort of roleplay integration.<br/>\n<br/>\n As far as trying to roleplay a Harper Scout, specifically...  <br/>\n<br/>\n I wouldn't advise venturing into that arena.  Maybe just settle for an \"influence\" rather than some distinct expression of the class in your interactions.<br/>\n<br/>\n The Harpers have gone through so many transformations during their history... well... it's no wonder they are considered a secret society.  They defy identity.  They probably have a problem recognizing their own members if it weren't for their customary adornments and signets.  Historically... bards, druids, rangers and some wizards (nope, never any reference to sorcerers, contrary to NWN's interpretation) spent time among the Harper ranks. An HS is sort of like an elvish, arcane ranger that can disappear when it needs to.  Though their nom de plume seems to infer a bardic origin, it actually was derived from a family crest that had no relationship to bards or entertaining the masses.  I don't think their persuasiveness was ever considered their forte'.  IMO an Intimidation skill bias would more accurately reflect how members of their society interacted with those outside of their cloister.  Try not to make sense of Bioware's version of AD&amp;D 3.0. It is plagued with inconsistencies and arbitrary decisions.  Accept them \"as is\" (like buying a used car) and just roleplay around them.<br/>\n<br/>\n The term \"scout\" refers to their special abilities.  NWN's version of HS's detection bias is limited to spotting traps with Deneir's eye and a good ear (Listen), but the true Harper has elvish blood and access to a more substantial spellcasting repertoire that can boost their discovery talents.<br/>\n<br/>\n So, my advice is to ignore the roleplay aspects of the class and focus on its advantages being the only prestige Tumble class that can dump to Discipline and economical bonus feats, especially in epic levels.  You can glean all its advantages in just 5 levels which leaves a large pool to develop other classes.<br/>\n<br/>\n Also, both of their ability buffs will stack with pot buffs so, for example, if you roll a lucky 4 on both casts, the respective abilities can be boosted up to +10 (or +5 modifier)!.  That's HUGE for a non-spellcaster with only mundane resources.<br/>\n<br/>\n The main disadvantage of considering HS are all the prereqs needed for just 5 levels.  That's not always easy to justify.  Neither assassins nor BGs can be an HS but the class is generally easy to integrate into most combos.<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:33 PM - Nov 24, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Hip.<br/>\n<br/>\n If I'm reading you right, it's a great \"boost\" class, but should only really be considered as an adjunct to the main class/es. That's fine, I can work with that.<br/>\n<br/>\n And I suppose your cited downside of all the prereqs for a mere 5 levels is also there to act as a form of balance (no Harper pun intended). Much as all the malarkey one needs to accrue to achieve WM status.<br/>\n<br/>\n No knowledge is wasted, I hope. This should at least make any future build request stuff from me slightly less crappy (at least in this instance). I hope. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "5:57 AM - May 20, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Stag;<br/>\n I wanted to add a bit to the knowledge that Hip tossed your way...  I've got a few toons that have 5th level Harper.  Mostly they are Fighter/Rogue/HS types.  I think I have one Wizard/Rogue/HS somewhere....   My main reason for taking HS at the start was for the 5th level feat of potion crafting.  It may not seem all that handy on most servers of SP places out there, but on WoG there have been 5 or 6 types of potions added to this feat.   I've found them to come in handy when solo, and even when in a party.  <br/>\n<br/>\n When I can I'll edit this post with the added potions.  I should have looked them up first...  Doh!<br/>\n<br/>\n OK, here are the potions that Harpers can craft on WoG:   Standard two are Bulls Strength and Cats Grace.  Added for WoG are four more:  Invisibility; Ultravision; Haste and Clairaudience/Clairvoyance.<br/>\n<br/>\n All 6 can come in very handy, and I tend to try to make a 10 pack of each when playing a Scout.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:02 PM - May 20, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks grom, good to know. Pack-rat that I am, I've always got at least one bag of holding crammed with \"spare\" potions, and it would be quite nice to have a crack at making my own sometime.<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "6:50 AM - May 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I know just how ya feel Stag...   I have bags of potions as well.   And all my Wizards take all three of the craft feats:  Brew Potion; Craft Wand &amp; Scribe Scroll.   I like to have extras to share out with party members as needed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}