{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "963",
  "name": "\"There is no roof to this world!\"",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/there-is-no-roof-to-this-world-t2354888.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 50,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:13 PM - Jun 03, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello All,<br/>\n<br/>\nFor those who haven't been paying attention - in which case \"tut!\" - the nasty boys in the playground are making me construct a cleric in the spirit of Viconia DeVir, beloved of Baldur's Gate. She's a Drow cleric, but has been cast out by Lolth and adopted by Shar - goddess of darkness and loss. She is, in effect, a refugee - but she'd fry your gentleman's sausage on a skillet for describing her as such. Feisty is an understatement.<br/>\n<br/>\nNow, I've had a furtle about to see what I could come up with - bearing in mind I have never even played a cleric before (I tried Mith's marvelous Blood and Faith in Adam Miller's campaign, but flunked it), let alone built one.<br/>\n<br/>\nI have been persuaded by Valerfor (and because it makes life easier) that I could build her as human, rather than elf, thus avoiding an xp penalty, so here are my first thoughts... (oh, and thanks, Max, for your little contribution, that just made it worse!)<br/>\n<br/>\nI'm thinking Lawful Neutral (Viconia is able to be turned to True Neutral in BG ToB, but that won't work with what's coming) Cleric 23/ Monk 9/ CoT 8 (or Champion of Shar, so CoS). My initial stats could be STR 12, DEX 15, CON 10, WIS 16, INT 14, CHA 8. I'm then thinking of taking 14 Cleric and 6 Monk pre-epic - with 9 Cleric/ 3 Monk/ 8 CoT in epic levels. I'm thinking War and one of Destruction/Strength/Magic/Trickery as domains (I would have gone for Sun, but Vicky doesn't know what the sun is). <br/>\n<br/>\nAs far as feats go, having done some browsing it would appear that Extend and Empower Spell are the only big boys from the arcane/divine armoury that really matter. That would seem to leave me with enough pre-epic feats for Weapon Focus (rapier's my current favourite), Weapon Finesse, Imp Crit, Blind Fight and KD (Toughness and Great Fort would be nice, but you can't have everything).<br/>\n<br/>\nIn epic levels, I'm thinking that the 4 BFs from CoT and Cleric should all go into Great WIS, with other feats in EWF, Armour Skin and Epic Prowess. Now, if I'm right (and that is by no means guaranteed) then I've got the 10 stat bonuses to play with, along with 4 more epic feats. I could split them between DEX and WIS or concentrate on one. I have no idea.<br/>\n<br/>\nIn skills, I'm thinking Concentration and Spellcraft, Tumble and Discipline, hopefully with enough left for Spot or Listen, but I haven't done the sums yet.<br/>\n<br/>\nThere, now open for shooting at!<br/>\n<br/>\nCheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, just went for a pee, during which I remembered that I'll be getting KD/IKD anyway, so I can grab one of Toughness or Great Fortitude.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "11:49 PM - Jun 03, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Am I allowed to be a bit of a dick here? If so, keep reading, if not, disregard the rest of my post.<br/>\n...<br/>\n<br/>\nOK, you're reading. Here's the thing: I've been browsing you guys' BG characters builds and I must say thay all look very well made. However, some of them deviate a lot from the spirit of the original character. I understand that this is done in lieu of powerbuilding, however we have to consider a couple of things:<br/>\n<br/>\nFirst, no henchmen in the BG sag were properly optimized from a powergaming (or powerbuilding) prupose, in fact, a lot of them were sub-par and a couple were bellow average or terrible.<br/>\n<br/>\nSecondly, if we're to make a build based on a BG character we should restrict ourselves to the \"spirit\" of the character. Indeed, we should try to make the most out of that build, but within the artificial restriction of staying true to the nature of the original character.<br/>\n<br/>\nAs an example: it is perfectly OK (I would say even mandatory) to give Minsc barbarian levels to have him access rage. But it would not be correct to not make him a ranger, since being a ranger is what Minsc was and even affected his dialogue and some subquests in BGII.<br/>\n<br/>\nIn the case of Viconia, as far as I know you can't really take drow as playable race in vanilla NWN, but it would be incorrect, IMO, to make her anything but an elf, regardless of penalties.<br/>\n<br/>\nIn the same venue, while rapiers are probably attractive to such a build (Viconia was known for her high WIS, low STR and CON), it would be against the spirit of the original chracter.<br/>\n<br/>\nWhat I mean is, if she's not gonna be an elf, and she's gonna even be wielding rapiers, can you reeally call her Viconia?<br/>\n<br/>\nI mean no offense, I've no doubt that you can build a very interesting cleric character with what you've got on the table right now... I just don't think it would be ole' Vic.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:35 AM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Pelagius, I agree with you on so many things here. I managed to bite the bullet on elf because I've played Aribeth's Redemption as a human, so managed to rationalize it (I'm not putting another spoiler in, you'll just have to go back to the Minsc!!!..thread) for the purposes of this build.<br/>\n<br/>\nTo be fair, in BG and BG2, Drow males were specialist mages, but females were specialized clerics, which you can't do in NwN, so it was a question of what gives ground. Arguable both ways. Of course, it matters less in a PW where you can bump xp by re-spawning.<br/>\n<br/>\nI hope you've read all the nonsense this Viconia build came from (started with a malicious ;-) thread from Valerfor in Ye Olde Tavern, then moved to the Minsc!!!... thread). My intention throughout has been to make her as close as I can to her BG2 self.<br/>\n<br/>\nIf I've got original (BG2) Vicky right, her weapon proficiencies are in mace, sling and warhammer. In NwN, I'd be naturally inclined to morning star (and yes, some of that is personal preference). However, in NwN that virtually by necessity would make her a secondary character, given her STR and CON. And where BG is about cultivating an heroic party, you can't do that in NwN. One character is the hero/anti-hero. Thus, in pretty much all of these BG facsimiles, they're optimized for you to play them in a different environment, with different rules.<br/>\n<br/>\nI suppose I'm saying that compromise is where it's at. And there's certainly no offence taken, my friend. In fact, good to see you again!<br/>\n<br/>\n<em>[He's not answered any of your questions, has he, precious? No, precious - hit him with a rock]<br/>\n<br/>\n</em>Cheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "2:15 AM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Aye, even with tons of gear Vic was supposed to be a supporting character and never a frontliner.<br/>\n<br/>\nI'm no expert on building and, even worse, have little to no experience with cleric builds so there's not much I can help you with. However, I saw you planning on taking Knockdown, well, that's a feat you get for free with monk 6.<br/>\n<br/>\nMaces are also finessable so if you're going with them instead of rapiers I wouldn't bother with imp crit since it wouldn't do much and take toughness instead for more HP.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:57 AM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you're going to have Monk in the build with high DEX and WIS, naturally, you'll be wearing Monk robes. Why not choose a kama? Even with just one kama, you would have 5 attacks plus one from Divine Power plus one from Haste plus one from Flurry of Blows. Also, I would have at least 1 level of Monk beyond 6 so you can have a late Tumble skill dump without having to wait that late to get Knockdown / IKD.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:46 AM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks both. I did recognize that I'd get KD/IKD for free in my edit to the OP, but you may have missed that, sorry. One thing I did get wrong in the OP was the number of BFs I'd get: I cited 4, but it's 5 (CoT 2,4,6,8 and Cleric 23), so at least 1 stat bump or general feat needs to go into WIS to forestall the dreaded odd number. Likewise, if I hold to my proposed starting stats, at least one bump should go into DEX. I'm just not clear as to how far to raise either stat atm.<br/>\n<br/>\nWhile it's true that I'm thinking about 6 levels of Monk, that's pre-epic, with a further 3 in epic levels. This, as Empyre notes, allows for later skill dumps as well as getting the KD twins in pre-epic (it means I won't get Imp Evasion until L37, but again, we can't have everything).<br/>\n<br/>\nI hadn't considered kama, but if I'm going to bugger around with her weapons anyway, then it's a damned fine idea for the monk APR, thanks! And yes, I had pictured her just in robes (she can't carry much due to poor STR and CON), but iirc monks can carry a shield without negating their bonuses (but that might just be a dream).<br/>\n<br/>\nAnyway, onward we march!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:42 AM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You are dreaming of course...no shields for monks if you want to retain their numerous bonuses.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "10:48 AM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Have you checked the domains yet? What will she get?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:15 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@ Valerfor: bum. Wishful thinking on my part, I suspect, and I don't enough feats to go d-w. Never mind.<br/>\n<br/>\n@ FG: I've narrowed it down to 5 domains so far. War, for cat's grace and aura of vitality. Strength, for divine power and stoneskin. Trickery for invisibility, invis sphere and imp invis. Fire, for wall of fire and energy buffer. And Magic, for mage armour, Melf's acid arrow, neg energy burst, stoneskin and ice storm. I'm leaning towards Strength and Magic currently, but I seem to be changing my mind on an hourly basis atm. Happy to take advice on board!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "1:45 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If I can murk the waters a bit more... it just occured to me that cleric/monk would be a nice build for Tamoko, a minor antagonist character in BGI -one of Sarevok's bimbos- that I always felt a bit fond of because she was such a tragic character.<br/>\n<br/>\nAgain, I'd do it myself but I can't build a proper cleric character to save my life.<br/>\n<br/>\nEDIT: Also, she was human, perhaps a cleric/monk/rogue?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:03 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@ Stag,<br/>\n<br/>\nWell, you do, but if you do that, then you commit yourself into a melee cleric (which isn't bad at all - if that is what you want).  I think, that your first priority should be to decide what type of cleric you want, then you can decide about the classes and the proper split.<br/>\n<br/>\n@ Pelagius,<br/>\n<br/>\nYou are so right about Tamoko, in the novel, there is some more development for her character but the rest of it...eh, let's say it is only for avid Baldur's Gate fans. I would love to help you make your own version of her, but not in this thread, because Vicky is a jealous mistress ;)<br/>\n<br/>\n<br/>\nEdit: Tamoko is without question a Cleric-rogue-Cos*<br/>\n<br/>\n* Cos, stands for champion of Sarevok <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:19 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Pelagius wrote:</cite>\nIf I can murk the waters a bit more... it just occured to me that cleric/monk would be a nice build for Tamoko, a minor antagonist character in BGI -one of Sarevok's bimbos- that I always felt a bit fond of because she was such a tragic character.<br/>\n<br/>\nAgain, I'd do it myself but I can't build a proper cleric character to save my life.<br/>\n<br/>\nEDIT: Also, she was human, perhaps a cleric/monk/rogue?\n</div></blockquote>\nWell you can do your learning alongside me, then! I've only ever played a cleric once, and I gave up on that by level 5 (and it was Mith's stupendous Blood and Faith, so it's not like I can blame the build) - I've certainly never built one. Let me just proffer this bit of advice: the next time you see Valerfor and Mick Dagger smiling and offering to get the drinks in, run away - and then run away some more.<br/>\n<br/>\nAs far as Tamoko is concerned, iirc she wears full plate +2 (the only instance of that in the vanilla game) and wields either a morning star or flail, so maybe monk wouldn't be the way for her to go. Maybe cleric/blackguard/rogue or fighter? I see her as a sort of fallen Aribeth type.<br/>\n<br/>\nWhile we're at it, I don't know if you ever played the Dark Side of the Sword Coast BG module, but if you have, Jet L'eya was a great undead hunting cleric...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "2:26 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Be careful, guys... this thread was about Viconia, and if she hears you talking about other girls...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:46 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\n@ Stag,<br/>\n<br/>\nWell, you do, but if you do that, then you commit yourself into a melee cleric (which isn't bad at all - if that is what you want).  I think, that your first priority should be to decide what type of cleric you want, then you can decide about the classes and the proper split.<br/>\n<br/>\n@ Pelagius,<br/>\n<br/>\nYou are so right about Tamoko, in the novel, there is some more development for her character but the rest of it...eh, let's say it is only for avid Baldur's Gate fans. I would love to help you make your own version of her, but not in this thread, because Vicky is a jealous mistress ;)<br/>\n<br/>\n<br/>\nEdit: Tamoko is without question a Cleric-rogue-Cos*<br/>\n<br/>\n* Cos, stands for champion of Sarevok \n</div></blockquote>\nNinja'd!<br/>\n<br/>\nInitially, I'd thought of Viconia as making use of her deity's realm of darkness (let alone her coming from the Underdark) and having spent much of her time on the surface in disguise, so stealthy and vicious seemed to be the way to go - hence my initial thought about including Shadow Dancer.<br/>\n<br/>\nThen I changed my mind. She is proud and fierce - a sort of cornered lioness - so I thought, no, not the stealthy hunter, more of a \"Here I come, and the hells are coming with me\" type (an Icewind voice-set I believe, but whatevs). And that's where I'm at now - buff and batter.<br/>\n<br/>\nThat said, I could incorporate both types - telling her full life story, if you will. Stealthy and subtle at lower levels, and then becoming a powerhouse of destruction in epic levels.<br/>\n<br/>\nI'm currently trying to work out DEX and WIS bumps. One helps AC and AB, while the other boosts AC and casting power, and I'm running the risk of investing in both only enough to be adequate, rather than making one spectacular.<br/>\n<br/>\nIt ain't easy, this building malarkey!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:01 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Viconia is a dark elf, a drow. If they were implemented as a sub race in Vanilla NwN, the favored class for females would be cleric, with wizard for males. That would have made things much easier for you. Some mods and PWs have drow as a playable subrace with several changes, among them the favored class.<br/>\n<br/>\nBut in most cases you are stuck with the standard NwN races and classes. Choosing elf for a cleric is both possible and playable, but you limit yourself because of the many base classes that lead to an xp penalty.<br/>\nOf course you can use prestige classes to get what you need, but often it would be more convenient to pick a base class instead.<br/>\nGoing with human is a solution - but a human is not an elf. If one discovered that Viconia had a touch of human blood from one of the sex slaves of her ancestors, you could build with 1/2 elf (and call it 3/4 elf or 7/8 elf or something) and avoid the xp penalties. But to me that feels a bit like stretching things too far.<br/>\n<br/>\nTaking CoT for Great Wis in epic levels gives more feats than cleric alone, but more cleric levels give a stronger caster.<br/>\nTo me CoT, even as CoS, is problematic from alignment reasons alone. It would have been different if the class was an alignment independent and general Divine Champion class that could be chosen by evil characters.<br/>\n<br/>\nIf you want to build a dex based human cleric of Shar with monk levels, The shadow priest, or an adaptation of that build is very close to how I envision the build. But I am biased. The cleric of Shar that I talked about in the other thread was a human Shadovar with a dex based Cleric 26/ Monk 9/SD 5 build.<br/>\nBut there are many other ways to build with human.<br/>\n<br/>\nMy advice, if you want to build Viconia, is to stick with elf and see what you can do within that frame. Cleric is a great class on its own. If you want to add anything else, only do it for a very good reason, and keep it simple.<br/>\n<br/>\nMick<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:43 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for that, Mick, you've just made everything worse! I had just about come to terms with the more pragmatic approach (via my Aribeth's Redemption play-throughs, which is a module I don't believe you've indulged in), then you come along and yank the old conscience awake.<br/>\n<br/>\nI have fewer qualms about the Divine Champion element here, because if you romance Viconia properly in SoA/ToB she will shift to True Neutral. That said, my very first thought for her was exactly the split you mention for your Shadovar - at the time I was thinking of getting ED as well.<br/>\n<br/>\nAnd yes, it's bloody annoying that in vanilla NwN cleric isn't recognized as preferred class for female drow, but rules is rules, I suppose.<br/>\n<br/>\nSo, it looks like I'm back where I started. Wonderful.<br/>\n<br/>\nAlright, let's try a different tack, which might seem like cutting off my nose to spite my face. What about dropping Monk completely and going for 19 Cleric levels pre-epic, with 1 CoS, then 10 or 11 Cleric levels and 9 or 10 CoS in epic? She'd still be able to boost DEX and WIS, with WIS being purely for caster power and DEX for AB (allowing for probably light or medium armour and a shield restricting AC increases). Now, this would obviously mean I could only cross-class Tumble (I'm trying to resist making her a Cleric 29/ CoT 10/ Monk 1, even though I can see its appeal), lose the BF for being human (along with 43 skill points) and Cleave, (Imp)Evasion and the KD twins, together with disease immunity, AC and speed - I'm not selling this very well, am I?<br/>\n<br/>\nBUT...I'm supposed to be building a cleric, not a monk, so maybe that would be a good place to start.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:27 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I noticed that this thread is <span style=\"text-decoration:underline\">not</span> named after that certain mistress, perhaps on purpose...From my point of view, you guys should stop trying to make a truthful representation of Vicky with Neverwinter Nights rules, because if you do that, then she should be some sort of high-charisma hot cleric of Shar, with <span style=\"text-decoration:underline\">lots</span> of dexterity and the appropriate drow favorite weapons. And that is even more difficult to do than what you are currently trying now. Imagine trying to level-up dexterity, wisdom and charisma in a single build, all this and make her a really good caster at the same time. And no Vicky isn't the type of woman that is going to have any kind of monastic training, ever.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "7:33 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><em class=\"mention\">@Valerfor</em><br/>\n<br/>\nIf we don't try to make the build as truthful as possible to the nature of the orginal character, then this game is pointless, just make a cleric/monk/CoT build and call it whatever, but not Viconia. The challenge, the way I see it at least, is to make a powerful build as close to the original as possible. Of course, some compromises have to be made and there's limitations, in abilites and other things as to what can be done when translating one character from one game to the other.<br/>\n<br/>\nI agree that monk don'te really suit Viconia. Tamoko, on the other hand... (even if it's just a 1 level dip).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:26 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Okay then, so we're agreed, monk's gone (to be honest, it only featured because of WIS synchronicity, and because it's a class I love). And I'm back with elf. Gimping yourself is always fun, ain't it?<br/>\n<br/>\nI'll 'fess up, the title of the thread was because it was one of very few Viconia quotes I could remember, so nothing sinister in it.<br/>\n<br/>\nAye, in BG she did carry a decent CHA level, which at one stage pointed me towards Cleric/ Black Guard, but that would be 2 classes I don't know, and one is proving hard enough (same with Assassin, but I never really saw Vicky as one of those).<br/>\n<br/>\nSo, are we content with a Cleric/ CoT (call it what you will) mix, given that I'm now pretty well focused on a non-stealthy type - with War and Strength as domains? There remains the temptation to throw in a Rogue level or 3...should I resist or succumb to cheesiness?<br/>\n<br/>\nAnd I'm still not sure about optimal levels of DEX and WIS...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "9:13 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Suggestion: make a cleric/CoT build (would be fairly true to Vic's original character) and see if a level or three of rogue improves or detracts from the build.<br/>\n<br/>\nRe: domains, it would depend if you're making a \"fighting\" cleric or a \"casting\" cleric. I personally see Vic more of a caster, but that's your call.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:30 PM - Jun 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nOkay then, so we're agreed, monk's gone (to be honest, it only featured because of WIS synchronicity, and because it's a class I love). And I'm back with elf. Gimping yourself is always fun, ain't it?<br/>\n<br/>\nI'll 'fess up, the title of the thread was because it was one of very few Viconia quotes I could remember, so nothing sinister in it.<br/>\n<br/>\nAye, in BG she did carry a decent CHA level, which at one stage pointed me towards Cleric/ Black Guard, but that would be 2 classes I don't know, and one is proving hard enough (same with Assassin, but I never really saw Vicky as one of those).<br/>\n<br/>\nSo, are we content with a Cleric/ CoT (call it what you will) mix, given that I'm now pretty well focused on a non-stealthy type - with War and Strength as domains? There remains the temptation to throw in a Rogue level or 3...should I resist or succumb to cheesiness?<br/>\n<br/>\nAnd I'm still not sure about optimal levels of DEX and WIS...\n</div></blockquote>\nI have experimented a bit with pure elf, almost pure cleric.<br/>\nI was able to start out with a \"typical Viconia\" stat spread Str 10, Dex 16, Con 8, Wis 15, Int 14, Cha 14 and still reach Dex 26 and Wis 26, which is quite all right for a general purpose cleric. I needed no CoT to reach that wisdom. I could have dropped a lot of Dexterity and ended up with Dex 16 and Wis 36 if I wanted a caster (still no CoT)<br/>\nI am a bit worried about the low Constitution, but that's Viconia, I guess.<br/>\n<br/>\nEdit: I don't see any reason why you should use BG in this build, so I second your decision there. Assassin on the other hand is one of the very few tumble classes that let you avoid an xp penalty with elf. I would keep it on the \"maybe\" list.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:16 AM - Jun 05, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You really are determined to be a \"thwart, disnatured torment unto me\" aren't you, Mick? See, that's how bad it's got - going all Shakespearean on you now!<br/>\n<br/>\nMy initial elven (or elvish?) stat spread was Str 12 (or 10), Dex 16, Con 10 (or 12), Wis 16, Int 14, Cha 8. I dumped the Charisma because I'd already discounted BG and in the other BG you always got clobbered with a -2 to reputation when taking in a drow, so thought it justified. Vicky's BG2 stat spread was Str 10, Dex 19, Con 8, Wis 18, Int 16, Cha 14, so I tried to balance it similarly (given what I've said about Cha).<br/>\n<br/>\nAnd while it's very helpful to know that Dex 26, Wis 26 is \"quite all right\", that's not what Viconia is, is it? Anomen is \"quite all right\", Vicky is exceptional. But I don't see her as an assassin, sorry.<br/>\n<br/>\nBy my reckoning, in a build with at least 29 levels of Cleric and 10 CoT (where all CoT bonus feats are reached in epic levels), there are 10 natural stat bumps, up to 8 bonus feats in Wis (5 from CoT, 3 from Cleric), then - taking Armour Skin, Epic Prowess and EWF out of the general feat pool - a further 4 Great Wis or Dex feats are available. By my count, that's 22. Done equally, that would give a final Dex and Wis of 27 each. However, my issue (one of many) is what I gain and lose from tilting the scales one way or the other.<br/>\n<br/>\nAt the moment, and remembering how I played Viconia in BG2, I'm tempted by the more Wis, less Dex route, but I'm in new and empty waters here.<br/>\n<br/>\nAnd a single level of Rogue at 37 remains appealing (for all the gods' sake, please don't tell Max).<br/>\n<br/>\nCheers, and thanks so much for the opportunity!<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Oh, and I think I've finally made up my mind: a vengeful, offensive cleric is where Viconia should be going (and I don't want any childish giggles about \"offensive\", all right? You think this is fun?). I'm wanting bucketfuls of SoVs raining down on the rat-bastards!<br/>\n<br/>\nSo, maybe I'm right in wanting more WIS, and maybe I'm wrong in wanting CoT for more of a melee presence. Who'd have thought it?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:57 AM - Jun 05, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">CoT is more than simply wisdom buffs and melee presence, he strengthens your saves as well, which is always a good thing. Your only other option to get good saving throws apart from CoT would be Blackguard and some investment in charisma, which although a fine choice by itself, will undoubtedly complicate things somewhat.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:42 AM - Jun 05, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you go for a caster Cleric, how about pure Cleric? You would get 6 Cleric bonus feats, and great spell penetration (against spell resistance), and high WIS would give good DCs against saves. You could still cast buffs on yourself and have a strong melee presence.<br/>\n<br/>\nIf you want to focus on being a melee Cleric, how about Cleric 17 / CoT 3 pre-epic for 1 CoT feat pre-epic and then 7 more CoT in epic levels? You would get 4 CoT feats and 3 Cleric feats in epic levels, which should include EWF, EP, and AS. In that case, bringing WIS to 20 and otherwise going for a high DEX would be the way I would go.<br/>\n<br/>\nHere's another idea: Make 2 builds, a role-play version that is an accurate representation of Viconia while not being completely awful, and another more powerful version that you would actually want to play.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:20 AM - Jun 05, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@ Valerfor: Quite right, and the saves are always appealing - particularly Fort in this instance. And I've already knocked Charisma - and thereby Black Guard into a cocked hat.<br/>\n<br/>\n@ Empyre: All good suggestions, thank you. But seriously - <strong><em>two</em></strong> builds? Do you people just enjoy watching me suffer? (Don't even bother answering that one <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />)<br/>\n<br/>\nMy current feelings are leaning towards a caster cleric - standing on the ridge and raining down divine fury on vile jaluks to the tune of the Ride of the Valkyries (sort of LotR meets Apocalypse Now). And that brings with it the potential for Zen Archery. Of course, in BG mode, clerics couldn't use bows, but while NwN buggers up several other elf options, it does at least give them a natural affinity with bows. That way, I could really crank up the Wis while maintaining a respectable Dex. It does mean that, particularly at lower levels, I'll need a tank or summons, but a ranged attack means I wouldn't need KD or potentially Finesse, thereby giving me a bit more wiggle-room in feat terms. That, in turn, and if I take Empyre's suggestion of 3 CoT levels pre-epic, would allow me 8 pre-epic feats (one as a CoT bf), so I could cover Extend and Empower Spells, 2 WFs (you need 1 in a melee weapon before getting CoT, so I could grab mace or something similar), Blind Fight, Toughness, Zen Archery and Rapid Shot.<br/>\n<br/>\nAnd I'm still mulling over a little rogue cheese for late on...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:38 PM - Jun 05, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">OK Stagmeister, enough tormenting now! <br/>\n<br/>\nI agree with you on making just one build.<br/>\nA self buffing melee cleric is probably the closest to what you are used to playing. But then again, even a melee cleric has great help from some attack spells.<br/>\nA caster cleric is probably jumping in at the deep end, since you are unfamiliar with casters. But learning how to play a caster will be rewarding and open up new ways to play this game for you. <br/>\nAnd fear not - any normally built cleric is far from squishy! (And even \"quite all right\" clerics are quite astonishing to play)<br/>\n<br/>\nIf you feel that playing Viconia will add fun to the experience - than build her and play her!<br/>\nIf you want to make things easier for you by adding more freedom to what kind of cleric build you play, then do so!<br/>\n<br/>\nWe will try to nudge you in the right direction, and no more tormenting (hopefully). <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nMick<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:01 AM - Jun 06, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, my sharpened and honed friend. Afraid RL has somewhat balked any progress today (bloody people, eh?). And I am aware that my babbling and whinging has taken us onto the 3rd page of this thread without me offering up a build - let alone any other ones.<br/>\n<br/>\nSo, hopefully tomorrow I'll have something for you to shred. And you're right, a caster cleric would indeed be far from my comfort zone, but unless I try one I'll always be looking over for my comfort blanket, and that defeats the point of the exercise.<br/>\n<br/>\nJust don't expect me to abandon my heavies any time soon. It's all about attitude, right? One glimmer of sorcery or sleight of hand and the stamping down shall be harsh and final. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /> (I have no idea what this emoji is supposed to represent, btw. I'd have preferred the old dancing banana.)<br/>\n<br/>\nCheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:16 AM - Jun 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just tossing out a few thoughts now, before having a proper look tomorrow.<br/>\n<br/>\nPitching Viconia as a Cleric 29/ CoT 10/ Rogue 1 is assuming a successful romance with the Bhaal-Spawn, and the Rogue from her earlier existence post-Underdark (just at level 37). I'm thinking 18 Cleric/ 2CoT pre-epic (giving the 15 BAB). I'm dropping the bow stuff, it just didn't seem right for her. Thus, I have 7 feats and 1 CoT bonus feat. In no particular order, I'm thinking Empower and Extend Spell, Weapon Focus and Finesse, and then I have to perm 3 out of 6 - those being: Blind Fight, Knockdown, Expertise, Toughness, Imp Crit, and Dodge<br/>\n<br/>\nIn epic levels, there are 7 feats and 4 CoT bonus feats, so allowing EWF, Armour Skin and Epic Prowess and 8 stat bumps (together with the other 10 available). Atm, my thoughts on starting stats hasn't changed (as an elf). Those being, Str 10 or 12, Dex 16, Con 10 or 12, Wis 16, Int 14, Cha 8. As it stands, I'm thinking of adding 6 to Dex and 10 to Wis (to give Dex 22 and Wis 26), but I keep sloshing around on that.<br/>\n<br/>\nAs far as weapons go, for better stats rapier wins, with mace second (btw, Valerfor, on your Drizzt thoughts, kukri ain't the only finesse-able slasher, handaxe works too). Mace is more in keeping with a cleric build, so let's try that.<br/>\n<br/>\nAnd as for skills, I reckon there'd be about 168. So maxing tumble, spellcraft and concentration would leave enough for 1 more maxed skill and some dregs. The maxed one should, I feel, be spot, but I'm open to discussion, as ever.<br/>\n<br/>\nSorry if I'm boring you now.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:00 PM - Jun 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Alright then, first draft time. Feel free to hit it with sticks - although giggling might be less painful (if not to my ego). I haven't filled out the skills schedule as yet: that can come post-butchery.<br/>\n<br/>\n<strong>Viconia DeVir</strong><br/>\n<br/>\nCleric 29/ CoS 10/ Rogue 1<br/>\nElf, True Neutral<br/>\nPvM 1-40<br/>\n<br/>\n<strong>Stats</strong><br/>\n<br/>\nSTR 12<br/>\nDEX 16 (26)<br/>\nCON 12<br/>\nWIS 15 (26)<br/>\nINT 14<br/>\nCHA 8<br/>\n<br/>\nHit Points - 418<br/>\nSkill Points - 168: Concentration 43 (44), Lore 4 (6), Spellcraft 43 (45), Spot 38 (48), Tumble 40 (48)<br/>\nSaves - F 30, W 34, R 32 (all +9 v spells, +2 v mind effects)<br/>\nAC - naked 28/ full plate 29/ + tower shield 32<br/>\nBAB - 25<br/>\nAB (max) - 37 melee/ 34 ranged<br/>\nSpells - Cleric level 9<br/>\n<br/>\n<strong>Levelling</strong><br/>\n<br/>\n1. C 1: Extend Spell / (Domains: Strength and War)<br/>\n2. C 2<br/>\n3. C 3: Weapon Finesse<br/>\n4. C 4: Dex+1 (17)<br/>\n5. C 5<br/>\n6. C 6: Weapon Focus: Mace<br/>\n7. C 7<br/>\n8. C 8: Dex+1 (18)<br/>\n9. C 9: Empower Spell<br/>\n10. C 10<br/>\n11. C 11<br/>\n12. C 12: Wis+1 (16) / Blind Fight<br/>\n13. C 13<br/>\n14. C 14<br/>\n15. C 15: Knockdown<br/>\n16. CoT 1: Dex+1 (19)<br/>\n17. CoT 2: Imp Crit: Mace<br/>\n18. C 16: Toughness<br/>\n19. C 17<br/>\n20. C 18: Dex+1 (20)<br/>\n21. CoT 3: EWF: Mace<br/>\n22. CoT 4: GWis I (17)<br/>\n23. CoT 5<br/>\n24. CoT 6: Dex+1 (21) / GWis II (18) / Armour Skin<br/>\n25. C 19<br/>\n26. C 20<br/>\n27. C 21: GWis III (19)<br/>\n28. C 22: Dex+1 (22)<br/>\n29. C 23: GWis IV (20)<br/>\n30. CoT 7: GWis V (21)<br/>\n31. CoT 8: GWis VI (22)<br/>\n32. C 24: Dex+1 (23)<br/>\n33. C 25: Epic Prowess<br/>\n34. C 26: GWis VII (23)<br/>\n35. CoT 9<br/>\n36. C 27: Dex+1 (24) / GWis VIII (24)<br/>\n37. R 1<br/>\n38. C 28<br/>\n39. CoT 10: GDex I (25) / GWis IX (25)<br/>\n40. C 29: Dex+1 (26) / GWis X (26)<br/>\n<br/>\nIf I've messed the sums up (ignoring any other potential problems, of course), please remember I'm still a pencil and paper boy, no fancy builder mods for me, and I input everything directly here.<br/>\n<br/>\nOver to your good selves for comment. Hopefully she ain't too shabby. Thanks in advance.<br/>\n<br/>\nCheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, meant to mention, there's a 20% xp penalty from level 37-40<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:00 PM - Jun 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">At first glance the build looks like an OK cleric build (and that is good in my book).<br/>\n<br/>\nI have not been able to check the saves yet. <br/>\nYou take CoT pre epic to improve saves and get an extra feat. If you feel feat starved, Toughness not a feat to give priority.<br/>\nThe (possible/probable) tumble dump comes late. Evasion would be nice, and uncanny dodge would also be nice for this dex'er. Uncanny dodge let you use light armor and robes and retain your dexterity AC bonus. You have enough dexterity to wear robes once you buff with cat's. Buffing dexterity will actually improve your AC beyond what you can get from full plate. But you must find room for more rogue levels first if you want UD.<br/>\n<br/>\nI would use this kind of stat spread for a \"general purpose\" cleric.<br/>\nFor a pure caster I would take many more cleric levels, maxed wisdom and chosen a spell focus.<br/>\nFor a focused self buffing \"melee cleric\" I would have stopped wisdom at max 20 and taken between 15 (econo-cleric) and 24 (undispellable) cleric levels.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:36 PM - Jun 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Mick - I can live with that as feedback on the first draft of a class I don't really understand.<br/>\n<br/>\nI'll confess, I'm quite tempted by dropping the Wis to 20 and taking 24 Cleric levels. One of the reasons  for taking only the one level in Rogue was to minimize the xp penalty, but 6 levels was always tempting. One could argue that I should take Bard rather than Rogue, as Viconia's BG2 stats did give her a relatively high charisma, despite the reputation drop when taking her in-party, but that would give me too many things to try to balance (3 stats) for a newb cleric-builder.<br/>\n<br/>\nIf I were to go Cl 24/ CoT 10/ Rog 6, I'd lose 2 cleric BFs (GWis), a few hps, a small Will saves dip and more xp penalty (as well as spell DC, but as I have no idea how that works, fair enough). I'd gain Evasion and UD (3), more skill points (maybe allowing for UMD instead of so much Spot), more flexibility in skill dumps, better raw AC (and possibly AB, but I haven't worked it through yet), and a small Reflex saves bump.<br/>\n<br/>\nI'll see what I can do with such a split - with a Cleric 15/ CoT 4/ Rog 1 pre-epic (so losing another GWis in epic, but keeping a BAB of 15 before L20 and gaining a further bonus feat), and a Cleric 9/ CoT 6/ Rog 5 in epic levels. I'll go away, put some damp towels on my head, and see what I can do.<br/>\n<br/>\nAs ever, thank you!<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Possibly the most annoying thing, if one was looking to optimize, is that dropping of Monk - and I totally agree, she's not a Monk. That extra +8 AC when wearing robes from Wis (with my previous stats), let alone natural Monk AC increases (as well as speed and saves) is hard to ignore. But I guess that's part of being an NPC - you're never going to be optimized. I'm trying to stay true.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:33 AM - Jun 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So she's not going to be a caster cleric then?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:17 AM - Jun 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Er, no. You know that saying about your reach exceeding your grasp? Well it's bollocks - don't believe it for a moment. Plus...I'd had a drink, so committed myself to something I couldn't deliver. Again.<br/>\n<br/>\nAnd is it just my natural paranoia, or am I being gently nudged away from CoT?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:40 AM - Jun 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Stag, do not feel bad about dropping monk from your optimization suite, an armour &amp; shield clad war-cleric can almost match that without a problem. The only occasion that the monk's benefits to armour class would outweigh an armored cleric build is if you had gone for a full-caster build with high wisdom. So, build away without doubt about your ac ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:56 AM - Jun 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A bit of math: full plate +5, dexterity of 12 &amp; tower shield +5= 22 ac Versus robes +5, dexterity of 22 &amp; wisdom of 32 (enhanced)= 22 ac.<br/>\n<br/>\nThings will change in favor of the monk-cleric when the wisdom is very high (34+12 typical of caster-clerics) but only then. You might say that dexterity can &amp; will be further enhanced as well but you won't have uncanny dodge to protect it (unlike wisdom-based ac, that is constant) so it is kind of unreliable, to begin with.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:26 PM - Jun 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Only me again, with a second draft. This time she's gone a bit more Roguey - now being a Cleric 25/ CoT 10/ Rogue 5. I had initially tried with Rogue 6 and Cleric 24, but this way I can be undispellable earlier and have a later concentration and spellcraft dump. The xp penalty unfortunately now kicks in at level 18, but I think she becomes more playable earlier, so swings and roundabouts. Maybe I'm being too timid in my stat split, but I'm sure you'll let me know if I am. Again, I'll leave the allocation of skills until I've something more final to work with. Anyway, see what you think...<br/>\n<br/>\n<strong>Viconia DeVir (v2)</strong><br/>\n<br/>\nCleric 26/ CoT 10/ Rogue 4<br/>\nElf, True Neutral<br/>\nL1-40 PvM<br/>\n<br/>\n<strong>Stats</strong><br/>\n<br/>\nSTR 12<br/>\nDEX 16 (32)<br/>\nCON 12<br/>\nWIS 15 (20)<br/>\nINT 14<br/>\nCHA 8<br/>\n<br/>\nHPs - 372<br/>\nSaves - F 29/ W 31/ R 34 (all +9 v spells, +2 v mind effects)<br/>\nAC - naked 31, full plate 29, +3 with tower shield<br/>\nSpells - Cleric level 9<br/>\nBAB - 25<br/>\nAB (max) - 40 melee, 37 ranged<br/>\nSneak Attack - 2xd6<br/>\nSkill Points - 196: Concentration 43 (44), Spellcraft 43 (45), Spot 36 (43), Tumble 40 (51), UMD 34 (33)<br/>\n<br/>\n<strong>Levelling</strong><br/>\n<br/>\n1. C1: Extend Spell / (Domains - Strength &amp; War)<br/>\n2. C2<br/>\n3. C3: Weapon Finesse<br/>\n4. C4: Dex+1 (17)<br/>\n5. C5<br/>\n6. C6: Weapon Focus: Mace<br/>\n7. C7<br/>\n8. C8: Dex+1 (18)<br/>\n9. C9: Empower Spell<br/>\n10. C10<br/>\n11. C11<br/>\n12. C12: Blind Fight / Dex+1 (19)<br/>\n13. C13<br/>\n14. C14<br/>\n15. C15: Knockdown<br/>\n16. C16: Dex+1 (20)<br/>\n17. C17<br/>\n18. C18: Imp Crit: Mace<br/>\n19. C19<br/>\n20. CoT1: Dex+1 (21)<br/>\n21. CoT2: Great Dex I (22) / EWF: Mace<br/>\n22. C20<br/>\n23. R1<br/>\n24. C21: Great Dex II (23) / Dex+1 (24)<br/>\n25. C22<br/>\n26. C23: Armour Skin<br/>\n27. CoT3: Great Dex III (25)<br/>\n28. R2: Dex+1 (26) / (Evasion)<br/>\n29. CoT4: Great Wis I (16)<br/>\n30. CoT5: Great Wis II (17)<br/>\n31. CoT6: Great Wis III (18)<br/>\n32. R3: Dex+1 (27) / (Uncanny Dodge 1)<br/>\n33. C24: Great Dex IV (28)<br/>\n34. CoT7<br/>\n35. CoT8: Great Wis IV (19)<br/>\n36. CoT9: Great Dex V (29) / Dex+1 (30)<br/>\n37. R4<br/>\n38. CoT10: Epic Prowess<br/>\n39. C25: Great Dex VI (31)<br/>\n40. C26: Great Wis V (20) / Dex+1 (32)<br/>\n<br/>\nI'm still shooting in the dark here, so all comments welcome.<br/>\n<br/>\nCheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Have now jostled things around following Valerfor's comments below. Unless I've ballsed it up, this should be better.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:10 PM - Jun 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Since you are committed to a dextrous war-priest type here, I am expecting at some point that you will go for robes+shield, right? I mean you will have better AC that way than if you wear your armour. Your AC then is 33. And since you are so close to cleric  26th level, I suggest that you take it &amp; make this a cleric 26/ rogue 4/ cot 10, which is a very solid split. That will get you another epic feat that you can do whatever you want, some suggestions are dragon knight, greater ruin, great wis, etc. I would then split equally the rogue levels between 22nd, 27th, 32nd &amp; finally 37th level. Don't worry about having rogue levels pre-epic, clerics are totally fine even going pure. Your ab is fine, it actually is very good (39) given the potential of your buffs.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:13 PM - Jun 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And stag, take AS earlier as well, you can have it as your bonus 23rd cleric feat.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:11 PM - Jun 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\nSince you are committed to a dextrous war-priest type here, I am expecting at some point that you will go for robes+shield, right? I mean you will have better AC that way than if you wear your armour. Your AC then is 33. And since you are so close to cleric  26th level, I suggest that you take it &amp; make this a cleric 26/ rogue 4/ cot 10, which is a very solid split. That will get you another epic feat that you can do whatever you want, some suggestions are dragon knight, greater ruin, great wis, etc. I would then split equally the rogue levels between 22nd, 27th, 32nd &amp; finally 37th level. Don't worry about having rogue levels pre-epic, clerics are totally fine even going pure. Your ab is fine, it actually is very good (39) given the potential of your buffs.\n</div></blockquote>\nOh yes, robes (or some of that very light shadow armour that allows for a 10 Dex bonus) and shield. Apart from anything else, she'd nearly collapse under the weight of full plate and tower alone (iirc, combined they weigh in at 95), which would make carrying loot back and forth something of a chore without tons of bags of holding.<br/>\n<br/>\nI like the sound of cleric 26/ rogue 4/ cot 10. If I've got it right, technically I'd only need a wisdom of 19 to cast L9 spells, so that Great Wis was just to be tidy and could wait until level 40 and cleric 26, which also gives me the flexibility to grab Armour Skin earlier. I'd take the earlier 2 rogue levels at 23, 28 so I can max UMD at the same time as tumble, but that wouldn't matter for the last 2, which can remain at 32 and 37.<br/>\n<br/>\nThe issue pre-epic becomes balancing BAB and feats. I've taken Max's advice to heart about not exceeding a BAB of 15, so that would mean either 18 cleric and 2 cot, or 19 cleric and 1 cot, which would mean Vicky losing either 1 or 2 bonus feats. Now, I don't mind losing Expertise (sorry Max, this is not a WoG build), but I'm reluctant to lose another. I know Toughness is vulnerable (to be replaced by the missing Imp Crit I take at cot 2), but that would leave me with a mere 332 hit points. Is that still viable for a melee build - even cleric?<br/>\n<br/>\nMore damp towels required...<br/>\n<br/>\nThanks!<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Oh, and I'd drop the 6 skill points (by losing a rogue level for a cleric one) from spot.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:25 PM - Jun 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Now, because I'm not the fastest typist in the world (it took half an hour to do v2), I'm just going to edit the 2nd draft, above, so if you haven't seen it, tough. This one's better anyway.<br/>\n<br/>\nBy bits of jiggery-pokery instigated by Valerfor, this one gains 2 hit points while losing Toughness, along with 1 more to both Fort and Will saves, and another 1 to both AC and AB.<br/>\n<br/>\nThe cost is minus 2 to the Reflex save, 6 skill points, 1d6 of sneak damage, and loss of UD 2. Also - and I'm open to amendments here - because of the way I've levelled up in epics, I become undispellable 2 levels later and can't access level 9 spells until 5 levels later. Those latter two might just be a matter of juggling, and I think we've well established I'm not very dexterous.<br/>\n<br/>\nAnyway, please take another look...<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:06 PM - Jun 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like the new stat spread. I also like the earlier AS. She now has a really good AB &amp; AC for a combat-cleric in addition to her strong saving throws. I am not gonna lie, both melee damage &amp; spells are weak though so you are gonna rely on DF &amp; Darkfire &amp; special properties of the weapons. The way to do this properly with a cleric is to use a \"stat-stick\" &amp; then buff the heck out of it. In high-magic modules (pretty much everything that exists really, even Aielund is high-magic &amp; HoTU or SoF are absurd magic) that won't be necessary but it is good to know how to do that.<br/>\n<br/>\nHere is an example, take a magic weapon that has extra damage on it &amp; any other useful properties such as the \"rapier of the high road\", it doesn't matter if the enchantment is low. Then cast GMW on it to make it +5, then Darkfire to add 1d6 +10 fire damage, then Divine Favour (extended) to add another +5 damage to it, you now have a +5 keen Rapier with 1d6 acid &amp; 11-16 fire damage on it plus your strength bonus. Divine Power will automatically make your strength be \"18\" base so if you have cast empowered bull's before that, it is almost guaranteed to have 24 strength as well. And that is how clerics do damage out of nothing, really. It might seem \"too much to bother with at first, but once you put your extended &amp; empowered spells in your hotkey bar they are all ready to be used with just the press of a key.<br/>\n<br/>\nAnd since I was talking about rapiers, they are finessable and with the best crit-range so you could always go \"extend-spell, finesse, exotic weapons, empower-spell, focus in rapiers\" &amp; forget about the IC: mace.<br/>\n<br/>\nHit points are fine considering your high AC &amp; the ability to heal yourself with just a spell. Don't forget that from 9th level onwards you will also have the ability to cast empower \"endurance\" for +6 vitality that will last until your next rest. Cleric buffs (especially, extended ones) are nothing like potions you find in the game with their pitiful 3rd caster-level, this is the real thing.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:52 PM - Jun 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks very much Valerfor - particularly for the \"duffer's guide to weapon-buffing\". Much appreciated!<br/>\n<br/>\nOn the rapier issue; my initial thinking was mace for rp purposes, though I do recognise that rapier is the \"best\" of the finesse-able weapons for her. And because Vicky is an elf, she gets proficiency in rapiers anyway, so she wouldn't need that extra feat (I assume you meant \"martial weapons\", not \"exotic weapons\"), and could thus also take Imp Crit in it.<br/>\n<br/>\nNow I just need to understand this cleric DC shenanigans.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:31 PM - Jun 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh man...I totally meant \"martial weapons\" indeed &amp; forgot she is an elf &amp; already proficient with it.<br/>\n<br/>\nWith \"DC\" you mean her spells or the \"buffing routine\"?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:06 PM - Jun 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sorry, the spells. I've been assuming it works on the same sort of principle as Dev Crit does with str builds, but with wis as the determinant, though I may well be wrong.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:13 PM - Jun 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">DC formula for the spells is simple enough.<br/>\n<br/>\nDC= 10 +spell level +spell focuses (if any) +wisdom modifier.<br/>\n<br/>\nThere is one exception to this (Implosion) that add +3 DC to the total after all other calculations.<br/>\n<br/>\nViconia's strongest spells (9th level) will have a DC of (24) with the exception of Implosion that will have a DC of (27). Add plus (6) to those DC's for a maxed-out wisdom score.<br/>\n<br/>\nAnd then, there is Harm. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:35 PM - Jun 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think I understand now - thank you. And I was kind of right in my thinking, in that, for example your revamped Dwarven Wall won't have  the best Dev Crit DC in the world because of its CON rather than pure STR focus. In the same way this Viconia won't have the best spell DC because of her DEX rather than pure WIS focus. So, to make her a full-on, nigh on irresistible caster-cleric, monk really would be a good idea.<br/>\n<br/>\nOh bloody hell, I'm starting to think maybe Empyre's 2-build idea would be interesting now - if only for a compare and contrast exercise. Why do people insist on trying to improve me? <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nCheers!<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, forgot. What do you mean \"and then there's Harm\"? You tease!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:06 PM - Jun 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hehehe...You obviously never hired that elven cleric of Sehanine Moonbow in your play-throughs of OC. She does Harm, occasionally. <br/>\n<br/>\nHarm is a 6th level spell of Clerics/ 7th level for Druids, that reduces the Hit Points of your enemy (single) to 1-4. With-no-save. No matter how many Hit Points they might have. And since it does not have a saving throw in the first place, you do not need to have any high wisdom either.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:10 PM - Jun 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well that's excellent! (Depending on whether you're giving or receiving, of course.)<br/>\n<br/>\nI did take Linu (\"Hello, dear\") in my younger days, more for healing purposes than anything - I was new and she was nice to me - but ended up noticing that I was spending a fortune on resurrection-type scrolls for her, the AI in the OC being what it is.<br/>\n<br/>\nHowever, I have noticed it being cast on me at certain points in MoTS - though I didn't know what it was at the time, so learned to always have Heal pots to hand in those areas.<br/>\n<br/>\nThanks<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:14 AM - Jun 12, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Your combat cleric looks fine Stag. <br/>\nGo and play some, and experience how the cleric buffs improve how your character performs!<br/>\nWe can give you plenty of advice on that if you like, and feel free to read the cleric guides. But that will make more sense to you if you have some practical experience to relate it to.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:04 AM - Jun 14, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Shall we polish this up a bit Stag? It's a bit hard not to get your 6th level spells before 29th level.<br/>\n<br/>\nYes, you lose 1AB/ 1AC from the original version but an AB of 39 is already high for a combat-cleric.<br/>\n<br/>\n1. C1: Extend Spell / (Domains - <span style=\"color:#9900FF\">Trickery </span>&amp; War)<br/>\n2. C2<br/>\n3. C3: Weapon Finesse<br/>\n4. C4: <span style=\"color:#9900FF\">Wis</span>+1 (16)<br/>\n5. C5<br/>\n6. C6: Weapon Focus: <span style=\"color:#9900FF\">Rapier</span><br/>\n7. C7<br/>\n8. C8: <span style=\"color:#9900FF\">Wis</span>+1 (17)<br/>\n9. C9: Empower Spell<br/>\n10. C10<br/>\n11. C11<br/>\n12. C12: Blind-Fight / <span style=\"color:#9900FF\">Wis</span>+1 (18)<br/>\n13. C13<br/>\n14. C14<br/>\n15. C15: Knockdown<br/>\n16. C16: Dex+1 (<span style=\"color:#9900FF\">17</span>)<br/>\n17. C17<br/>\n18. C18: Imp Crit: <span style=\"color:#9900FF\">Rapier</span><br/>\n19. C19<br/>\n20. CoT1: Dex+1 (<span style=\"color:#9900FF\">18</span>)<br/>\n21. CoT2: Great Dex I (<span style=\"color:#9900FF\">19</span>) / EWF: <span style=\"color:#9900FF\">Rapier</span><br/>\n22. C20<br/>\n23. R1<br/>\n24. C21: Great Dex II (<span style=\"color:#9900FF\">20</span>) / Dex+1 (<span style=\"color:#9900FF\">21</span>)<br/>\n25. C22<br/>\n26. C23: Armour Skin<br/>\n27. CoT3: Great Dex III (<span style=\"color:#9900FF\">22</span>)<br/>\n28. R2: Dex+1 (<span style=\"color:#9900FF\">23</span>) / (Evasion)<br/>\n29. CoT4: Great Wis I (<span style=\"color:#9900FF\">19</span>)<br/>\n30. CoT5: Great Dex IV (<span style=\"color:#9900FF\">24</span>)<br/>\n31. CoT6: Great Wis II (<span style=\"color:#9900FF\">20</span>)<br/>\n32. R3: Dex+1 (<span style=\"color:#9900FF\">25</span>) / (Uncanny Dodge 1)<br/>\n33. C24: Great Dex V (<span style=\"color:#9900FF\">26</span>)<br/>\n34. CoT7<br/>\n35. CoT8: <span style=\"color:#9900FF\">Epic Prowess</span><br/>\n36. CoT9: Great Dex VI (<span style=\"color:#9900FF\">27</span>) / Dex+1 (<span style=\"color:#9900FF\">28</span>)<br/>\n37. R4<br/>\n38. CoT10: <span style=\"color:#9900FF\">Great Wis III</span> (<span style=\"color:#9900FF\">21</span>)<br/>\n39. C25: Great Dex VII (<span style=\"color:#9900FF\">29</span>)<br/>\n40. C26: <span style=\"color:#9900FF\">Great Wis IV</span> (<span style=\"color:#9900FF\">22</span>) / Dex+1 (<span style=\"color:#9900FF\">30</span>)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:16 PM - Jun 14, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Okay, so that's knocking a point off AB, AC and reflex saves, but adding one to spell DC and will saves, as well as bringing earlier access to better spells. Aye, that works for me - thank you! (With my RP head on, I'm still wary of taking rapier, but I do concede that it's the better option.)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}