{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "339",
  "name": "Face-beating Ranger (Ranger 26/Fighter 4/CoT 10)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/face-beating-ranger-ranger-26-fighter-4-cot-10-t2350745.html",
  "author": "eatU4myT",
  "avatar": "no_avatar.png",
  "replies": "5",
  "views": "1.8K",
  "posts": [
    {
      "author": "eatU4myT",
      "avatar": "no_avatar.png",
      "timestamp": "11:13 PM - Mar 03, 2014",
      "content": "<div>It is fairly common knowledge that DEX-based rangers don't really work.  However, Ranger Dual-Wielding doesn't work in better than light armour.  But, 6 attacks from dual wielding, boosted by Epic Weapon Spec and lovely Bane of Enemies gives a huge damage output.<br/>\n<br/>\nSo, how do you keep all that whilst maintaining your AC?  Or can you get away with not even trying?  I'm not daft enough to imagine that I'm the first to try it, but I've never actually seen a build written up with a single figure AC...<br/>\n<br/>\n<br/>\n<br/>\nClasses: Ranger (26), Fighter (4), Champion of Torm (10)<br/>\nRace: Dwarf<br/>\nAlignment: Any Non-Evil (Usually Chaotic Good)<br/>\n<br/>\nAs with any build that interests me, he is very playable from 1 - 40. <br/>\n<br/>\n<br/>\n<br/>\nI Stats:<br/>\n<br/>\n      Initial          Final<br/>\nStr\t16\t+10\t26\t<br/>\nDex\t06\t\t06<br/>\nCon\t18\t+ 4\t22<br/>\nWis\t12\t+ 2\t14<br/>\nInt\t14\t\t14<br/>\nCha\t08\t\t08<br/>\n<br/>\nNote:  This is a Gold Dwarf.  A Shield Dwarf would swap DEX for CHA - it doesn't really change the build.<br/>\n<br/>\n<br/>\nII Level Progression:<br/>\n<br/>\n01 Ranger\t\tStrong Soul<br/>\n02 Fighter\t\tWeapon Proficiency (Exotic)<br/>\n03 Fighter\t\tIron Will, Weapon Focus (?)<br/>\n04 Ranger\t\t<br/>\n05 Fighter\t\t<br/>\n06 Fighter\t\tToughness, Weapon Specialisation (?)<br/>\n07 Ranger\t\t<br/>\n08 Ranger\t\t<br/>\n09 Ranger\t\tBlind Fight<br/>\n10 Ranger\t\t<br/>\n11 Ranger\t\t<br/>\n12 Ranger\t\tKnockdown<br/>\n13 Ranger\t\t<br/>\n14 Ranger\t\t<br/>\n15 Ranger\t\tImproved Knockdown<br/>\n16 Ranger\t\t<br/>\n17 Ranger\t\t<br/>\n18 Ranger\t\tExtend Spell<br/>\n19 Ranger\t\t<br/>\n20 Ranger\t\t<br/>\n21 Champion of Torm\tGreat Constitution I<br/>\n22 Champion of Torm\tEpic Damage Reduction I<br/>\n23 Champion of Torm\t<br/>\n24 Champion of Torm\tGreat Strength I, Epic Damage Reduction II<br/>\n25 Ranger\t\t<br/>\n26 Ranger\t\t<br/>\n27 Ranger\t\tGreat Strength II<br/>\n28 Ranger\t\t<br/>\n29 Champion of Torm\t<br/>\n30 Ranger\t\tBane of Enemies<br/>\n31 Champion of Torm\tEpic Damage Reduction III<br/>\n32 Champion of Torm\t<br/>\n33 Champion of Torm\tGreat Strength III, Epic Weapon Focus (?)<br/>\n34 Champion of Torm\t<br/>\n35 Champion of Torm\tEpic Weapon Specialisation (?)<br/>\n36 Ranger\t\tGreat Strength IV<br/>\n37 Ranger\t\tEpic Prowess<br/>\n38 Ranger\t\t<br/>\n39 Ranger\t\tGreat Strength V<br/>\n40 Ranger\t\tEpic Toughness I<br/>\n<br/>\n<br/>\n<br/>\nIII Vitals:<br/>\n<br/>\nSaving Throws (F/R/W): 36/19/26<br/>\nHitpoints: 700<br/>\nAC: 8<br/>\nBAB: 30<br/>\nAttacks: 6<br/>\nAB: 39/34/29/24/39/34<br/>\n  (with mundane double-weapon of choice: 40/35/30/25/40/35)<br/>\n  (vs favoured enemies: 42/37/32/27/42/37)<br/>\nDamage: 1d8+8+6 with mundane double-weapon of choice<br/>\n  (1d8+8+6+2d6+6 vs favoured enemies)<br/>\n<br/>\n<br/>\n<br/>\nIV Skills:<br/>\n<br/>\nThere are quite a few skill points to play with here.  Maximise Discipline, obviously - when you can be hit by a lightly stunned goblin, that's a no-brainer.  There's also no point in cross classing Tumble - you're dumping AC here, so that clearly a waste.  Cross classing Spellcraft might not be a bad plan however, as that Will save is a bit low.<br/>\n<br/>\nOther than that, I would usually take a mix of stealth, detection and trap skills, all those ranger-fluff skills.  There are enough to max 5 skills.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWith 700HP and Damage Reduction 9/-, it takes a good few rounds to put him down.  During those rounds, he pumps out a LOT of damage - especially to any of his 6 Favoured Enemies.  These can be chosen to taste - I would usually take races that are likely to be found with damamge reduction, or huge amounts of HP.  You are trying to take them down quickly, before they get to many (virtually automatic) hits on you.<br/>\n<br/>\nLevel spread doesn't matter too much with 3 full-BAB classes, so I've mostly just aimed to take the most important feats as quickly as possible.  Still undecided whether pushing for Bane at level 30 is better than being able to take EDR III, EWF and EWS by that point.  Or a bit of juggling gets you EWF at 26, EWS at 28, Bane at 33 and EDR III at 35.  Could see that either way, though Bane is really the main reason to play a Ranger, so it feels right to take it early!<br/>\n<br/>\nExtend Spell is taken for spell book management, and due to the fact that Ranger lvl 3 spells are more useful than lvl4 spells. Worth swapping it for Power Attack?  Power Attack would normally be an early priority for me, to pick up cleave asap, but with 3 attacks by level 6, cleave is pretty redundant.<br/>\n<br/>\nAny thoughts?  The saves are lowish (Reflex obviously dumped at the same time as DEX and AC, but as far as I know there are no save-or-die tests linked to Reflex).  Is the Will save tolerable?</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:16 PM - Mar 04, 2014",
      "content": "<div>This build is illegal, not only because of the sub race, but documentation is lacking on when you take different ability rises and the sums do not add up. You should also be specific and write up the distribution of skillpoints at level 40, if not level by level.<br/>\nI do not understand your AB calculation, +39 seems a bit low.<br/>\nIt seems that you intend to let him wield a double weapon of some kind. You should specify what weapon he has focus in, rather than a \"?\".<br/>\n<br/>\nThe build concept is original. If you really have tried playing it (which I doubt since the write up is illegal), you should share your experience on when this kind of build will work and not, so the reader can know if this is something to try where he/she plays.<br/>\n<br/>\nLast, but not least: When you present unfinished builds, please do so in the \"build request/unfinished builds\" forum.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:01 PM - Mar 04, 2014",
      "content": "<div>It i as Mick said.<br/>\n<br/>\nAnd honestly this should be in the request/unfinished sub-forum rather than here, but since you have post it already let's try and make this work so you have a finished product under the topic title.<br/>\n<br/>\nI will try and address each aspect of the build separately so we have a better view of the build and make clear our intentions.<br/>\n<br/>\n<br/>\n1) Let's make him a standard Dwarf since not everybody has sub-races. Provided you want to make him an EDR Ranger i would suggest you start with the following spread.<br/>\n<br/>\nSTR 16  DEX 08  CON 17  INT 14  WIS 14  CHA 06  {you see i am ignoring DEX completely because we need the other stats more, Rangers thankfully have Cat's Grace in their spell list}<br/>\n<br/>\n<br/>\n2) You want to dual-wield instead of having a big weapon, but an exotic dual-bladed sword isn't the best solution because with two weapons we retain the option to use a sword &amp; board when the situation demands it.<br/>\n<br/>\nTherefore i strongly suggest you take short-swords as your weapons of choice. Kukris would be even better because we get to multiply all those bonusses more often. <br/>\n<br/>\nLet's spend a feat then and take Exotic weapon proficiency with Kukris. Again, If you need more AC you swap to Kukri &amp; Shield instantly.<br/>\n<br/>\n<br/>\n3) You want your Ranger to be very play-able from start to finish, lets introduce 4 Fighter lvls pre-epic so we get WS &amp; Heavy armour proficiency &amp; two more combat feats, we need them.<br/>\n<br/>\nYou might ask \" what to do with full plate when the dual-wielding works only in light armour \". The answer is that you will use full plate &amp; T. shield for those situations you need the AC. Always nice to have options.<br/>\n<br/>\nTherefore and with the acquisition of our bonus fighter feats we are able to get all those nice feats: WP - Exotic, WF: Kukri, WS: Kukri, IC: Kukri, Blind Fight, Toughness, KD, IKD, Expertise, Extend spell. Lot's of feats, nice.<br/>\n<br/>\nRanger will also provides us with the two-weapon fighting feats for free while we maintain light armour.<br/>\n<br/>\n<br/>\n4) By lvl 20, i suggest you take your attributes in order to have STR 18 &amp; CON 20. This will boost your damage &amp; AB while being very close to take the EDR feats as soon as they are available.<br/>\n<br/>\nBut first we need AB &amp; Damage, EDR can wait a little, since you are healthy as an Ox already and with a manageable AC - especially with your full plate ON. Good enough so far.<br/>\n<br/>\n<br/>\n5) In Epic lvls you need to rush Ranger so you get <strong>Bane of Enemies</strong> as fast as possible. If you take 2 CoT levels &amp; 7 Ranger lvls, you get to take BoE at lvl 29 as an Epic Ranger bonus feat. <br/>\n<br/>\nBy lvl 29 you will have both EWS &amp; BoE, nice.<br/>\n<br/>\n<br/>\n6) In Epic lvls we will have a total of 7 General + 5 CoT + 2 Ranger feats, total. We need to make good use of them, so let's try and take the essentials first - then pick up the rest.<br/>\n<br/>\nRanger shall give us (BoE) &amp; (Favorite Enemy Extra). It is important that you take another Favorite Enemy with your second Ranger bonus feat so your total damage output will apply to more enemies. Seven are the miimum.<br/>\n<br/>\nCoT shall give us (EWS: Kukris) &amp; (EWF: Kukris) &amp; (Epic Prowess) &amp; (Armour Skin) &amp; (EDR I). That' s five feats already but we need to grab the rest of EDR feats from our General feat pool.<br/>\n<br/>\n7 General feats should be ( EDR II) &amp; (EDR III) &amp; 5 Gr. STR feats. This will give us a nice rounded final spread of:<br/>\n<br/>\nSTR 26  DEX 08  CON 22 INT 14  WIS 14  CHA 06  {This should give your Ranger a final amount of 680 hp's &amp; 9 Dmg. Reduction along with 7 Favorite enemies}<br/>\n<br/>\n<br/>\n7) Skills. You now have a respectable amount of 230 skill points, you need to use them wisely, let's try and do that.<br/>\n<br/>\nDiscipline: 43 (51) &amp; Tumble cc 20 (19) &amp; Spellcraft cc 18 (20) &amp; Set Traps: 26 (25) &amp; Hide: 43 (42) &amp; Move Silently: 42 (41). Those are 230 skill points distributed, you now have the ability to set deadly traps of all kinds.<br/>\n<br/>\nHide &amp; Move silently will be boosted further by your spells that are stacking with each other so your stealth skills will be actually quite formidable. Why do you want that? For Alpha Strikes. Kill before they are even be able to respond back.<br/>\n<br/>\n<br/>\n8) About AC. Never-ever neglect AC!<br/>\n<br/>\nThe enemies in most PW's or competitive modules will see through that and start to use Power attack making your hard-earned EDR completely worthless. And they will crit often, very often. And you will be dead in a matter of seconds, EDR or not.<br/>\n<br/>\nNow actually you do have a respectable AC, especially with the help of Expertise.<br/>\n<br/>\n<br/>\nAnd that's it man. I now want you to make a final build based on the above if you like them and post it here in place of your original one. (use the EDIT button). That way once someone search the forum for an EDR-Dual wielding Ranger<br/>\n<br/>\nwill be able to find your build and see it complete.</div>"
    },
    {
      "author": "eatU4myT",
      "avatar": "no_avatar.png",
      "timestamp": "7:44 PM - Mar 04, 2014",
      "content": "<div>Yeah, apologies for the missing Stat increases, my bad.  Pre epic, he takes +2 WIS (to enable full spell usage) and +3 CON (to make Epic Damage Reduction available asap).  The fourth CON point is the level 21 general feat, and then there are +5 STR from 21-40 and +5 STR from feats.<br/>\n<br/>\nWasn't aware of the sub-race rule, so my bad again there, although as I stated it makes no overall difference to the build which of the two dump stats is a 6 and which is an 8.  Its a +1 AC &amp; +1 Reflex vs +1 Animal Empathy/Persuade/other charisma-based skill you choose.  In the context of the build, the skill bonus is actually more valuable.<br/>\n<br/>\n<br/>\nThe choice of double-weapon doesn't really make a difference to the AB or damage, excepting crits, so I've left it up to individual taste - I chose Dire Mace myself, as I always get suckered into the \"bludgeoning damage is least often resisted\" line.  Obviously you could choose to focus/specialise in a light weapon, (handaxes would then be my choice, or possibly maces).  Its another point to think about actually - dropping Exotic Weapons would free a feat for the desirable Power Attack, at the cost of reducing damage from d8 to d6.  Worth it?  He's not short of damage bonuses already?  I think the thing that swings it for me though is that you are then left looking for TWO decent handaxes, rather than ONE dire mace.<br/>\n<br/>\nAs far as the AB goes, I was working on 30 BAB, +8 from STR modifier, +1 from Epic Prowess, giving AB 39.  Dual-wielding the weapon he has focused in (assumed to be double or light) increases that by +3 for WF/EWF, and reduces it by -2 for dual-wielding, giving AB 40.  Then, fighting his favoured enemies with Bane, he would be at AB 42.<br/>\n<br/>\n<br/>\nI am playing the character currently in The Wanderer (how have I missed this mod until now?) as it seemed to fit the theme of the mod (a colonist arriving in a newly settled village in the wilderness).  At level 6, he is just staring to take off, with Weapon Specialisation helping him to win fights quickly enough to stay alive.  It has been tough fighting mobs at the lower levels (5 goblins can hit AC 8 more times per round than one boss can at that stage!).<br/>\n<br/>\nAny mod/world that makes damage reduction readily available would take the shine of him in a big way, as would massive damage bonuses on items - if everyone can shrug damage from hits, then being hit more often is going to be much worse, and if a weapon causes 2d12 elemental damage, then 2d6+6 physical damage from Bane looks less of a big deal.  Good, but not enough to build a character around.  I suppose I am saying that he would prefer a low magic setting.<br/>\n<br/>\n<br/>\nWould still be interested to know if there are any feat changes anyone can see that would make a big difference?  Or any tricks I've missed that would add anything to the build?</div>"
    },
    {
      "author": "eatU4myT",
      "avatar": "no_avatar.png",
      "timestamp": "7:47 PM - Mar 04, 2014",
      "content": "<div>Had a chance to read through your reply now, Valerfor.  Some interesting things here definitely.<br/>\n<br/>\n      Changing the starting stats (dropping CON by 1 to 17, and raising WIS by 2 to 14) is an obvious step - thanks.  Leaves you with the same ending stats, but saves an epic general feat - great!  Also allows us to put two pre-epic stat-ups into STR as you suggest later, to help early AB &amp; damage, without delaying EDR.  Really good suggestions there.<br/>\n<br/>\n      Not quite sure what you were meaning re: \"lets introduce 4 Fighter lvls pre-epic\" to make it more playable start to finish.  There are already 4 fighter levels in there at lvls 2 &amp; 3 and at 5 &amp; 6 - were you suggesting adding more?  Or just confirming that that is a good set up as it stands?<br/>\n<br/>\n      Skills - yeah, that's pretty much how I'm developing them at the moment.  I'm not cross-classing Tumble as stated originally, and am spreading the ones saved there and some of the stealth points in exchange for some detection skills.  In most single player modules, I tend to find a range of skills to be more useful (or at least more fun/rewarding) than a few maxed skills.<br/>\n<br/>\n<br/>\n      Choosing a light weapon for focus/spec to allow for shield usage (and also therefore full plate usage) - is that really something people do?  Each to his own, obviously, but I must say I'm suprised.  I can see having a ranged weapon for options, but having a whole back up armour &amp; shield set up - I don't know, for me it seems to take something away from a character concept.<br/>\n      Also, whilst its a bit self defeating - if you want a stealthy, trappy character who uses full plate &amp; shield, probably better to play a fighter/rogue, no?<br/>\n<br/>\n<br/>\n      As an  aside - and for future reference - is it the collective expectation of the guild members here that a poster should detail every detail, even for something that doesn't actually make a difference to the build?  For example, I only really see Discipline as an essential skill here.  Sure, Spellcraft, Hide &amp; Move Silently are probably the next most useful, but wouldn't people like to customise the build a bit themselves if they wanted to play it?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:04 PM - Mar 05, 2014",
      "content": "<div>Alright, let me answer your questions one-by-one.<br/>\n<br/>\n1) The later, four Fighter levels are good. Your build already had them inside but i was making a sort of a guide there to help you out in case you had any questions or wanted to see where i was going.<br/>\n<br/>\nNot only you, but for others that might have a question too. It took me more than an hour to write this, and take a step-by-step approach towards making the build. I thought it might was useful and so i posted as such.<br/>\n<br/>\n<br/>\n2) Skills, i strongly believe that the usage of your 230 skill points the way i did, is the best approach. Your argument \" in modules i find that splitting your skills is more useful\" does not hold any water here.<br/>\n<br/>\nAnd nobody here is interested to know that persuade skill is very good for OC/HoTU/SOU and the like, they know that in PW's this skill is next to useless. In OC/SOU/HoTU and the like you can win with your hands tied behind your back.<br/>\n<br/>\nAnd NO. Rangers have stealth skills and set traps for a reason.<br/>\n<br/>\nHere we try and make the best of the best. We do not simply say \" those are 230 skills points, use them as you want - discipline would be a good choice \". We define what's best.<br/>\n<br/>\n<br/>\n3) You keep neglecting tumble. You are pround that your build as you made it, does fine in \" Wanderer \". Which is a fine module by the way. But old and easy. Very easy in fact.<br/>\n<br/>\nBut here, we help people make real powerhouses that can overpower the best of the best of the Persistent Worlds out there and modules that have Tony's A.I incorporated. Try and play in such a module. Your Dwarf will die a very fast death.<br/>\n<br/>\nSo when you present people here with a build, you don't go around saying, \" here is a build with 8 AC \". That just doesn't work. Your 700 hp's will be nothing but two rounds worth to even a single Drow Weapon's Master in WoG.<br/>\n<br/>\n<br/>\n4) Quickslotting a Kukri &amp; T. Shield is nothing difficult. You can and must use it for when the situation arise. If you don't need to, then you are probably play in an environment that an ECB build is not needed at all.<br/>\n<br/>\nEven if you do not need it, again it is very welcome to have it as an option. A hard module might actually need those tactics.<br/>\n<br/>\nMost of the modules especially the old ones such as the \" Wanderer \" can be played, all of them with a single class fighter, longsword and shield, but that does not mean all of them are like this.<br/>\n<br/>\n<br/>\n5) For the information part. Yes, we try and put as much detail (without being excessive) as we can.<br/>\n<br/>\nCustomizing each build is up to the individual but we do put iside the builds what the optimal (for us) choices are. And the reason why they are made like this.<br/>\n<br/>\n<br/>\nI hope i made myself clear, if my post was sounded harsh, this was not my intention.<br/>\n<br/>\nI hope you have fun with your build in whatever module you will play but for posting a build here, yes we do have some rules that we need to follow.<br/>\n<br/>\nAnd i still want to see an edited build of yours that's proper, my suggestions or not doesnt matter. I hope you will make one when you have the time.</div>"
    }
  ]
}