{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "294",
  "name": "Taunting specialists wanted",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/taunting-specialists-wanted-t515438.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:52 PM - Sep 02, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">TBH, I have never really used Taunt before but it was available in a recent build I designed so any education would help me to maximize its effectiveness.  Please recognize that at present I am unable to actually playtest, but would still like to understand the limitations of the skill from a building perspective. The questions (these arose because the wiki doesn't seem to clarify them):<br/>\n<br/>\n1.  Effective range? The phrase \"aware of the taunter\" means little to me.  Is this another way of saying \"within the perception range\"?  If so, then it seems as though Taunts can be activated from long range, no?<br/>\n<br/>\n2.  Spamming.  Is there a cool-down?  If so, what is it? <br/>\n<br/>\n3. Re-rolls.  If one spams Taunt, can a maximum dice roll value be achieved and sustained?  Or will a poor roll \"overwrite\" a good one?<br/>\n<br/>\n4.  Since it is a combat action, it would break any hidden effects that spells such as Imp Inv or GS would provide.  But is it even available while under the effects of those spells?<br/>\n<br/>\nThat should get me headed in the right direction.<br/>\n<br/>\nSo, as usual, thanks, in advance for the learning lesson.  Contrary to popular belief, old dogs can indeed learn new tricks! *g*<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:05 PM - Sep 03, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm far from being a specialist, but I will give it a go anyhow.<br/>\n<br/>\n1- Taunt requires that the target be aware of you to work, so that means that you can't taunt someone without being in combat with them. If you taunt a neutral creature, it will be considered a hostile action and if its an NPC, he/she will most likely attack.<br/>\n<br/>\n2- You cannot SPAM Taunt, when you taunt someone, it takes a whole round to activate (meaning if you move or attack it will be interrupted) at the end of which it shows the result: either success or failure along with the opposed roll. Like this:<br/>\n<br/>\nTaunt: Success X + Taunt modifier = Y, DC: Z. That DC is the opponent's concentration check, which you can use to get an idea if the opponent is even Tauntable. If the DC is too high for you, unless your roll was very low on your taunt check you shouldn't even try it again.<br/>\n<br/>\nRegardless of success or failure, you have to refrain from using it for another full round after the result is out. Then after 6 seconds it becomes available again. When you rty to use it before these 6 seconds, a message will appear saying you can't use that skill: X seconds left or something like that.<br/>\n<br/>\nOne other common thing is to have your taunting interrupted by making an attack of opportunity. Whenever a Taunt is interrupted, the next time you try to taunt someone, it will be INSTANTANEOUS. I often use that to my advantage before tough melee bosses, I taunt a minion just prior to its death and then cancel before the result is out. Then I kill it and when I taunt the boss it comes out instantly. That can be very helpful, instead of standing in front of a very tough and very angry heavy hitting boss taunting him. <br/>\n<br/>\n3- I don't know this one, but the correct thing is to not taunt someone that has already been successfully taunted. If you failed last time, then after a round you can try again like explained above. Does anyone happen to know this? I have never tried it myself. Say, if the difference between ur taunt and the opponent concentration checks is 2, hence you diminish their ac by 2, if you re-taunt him and get a result of 6 dis time, does the new penalty override the old one, or does the first one count<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /> how about if your result is 1, does it override or does the previous result count? I cant test it, but combat debugging should tell u that much. My keyboard doesn't consider tilde where its supposed to be because it's a brazilian keyboard so i cant enter the modes.<br/>\n<br/>\n4- Like I said in 1, the target needs to be aware of you, so if you try to taunt anyone who isn't aware of you, a message will appear saying that. Kind of like Animal Empathy: Failure: target needs to be aware of you to use this ability.<br/>\n<br/>\n5- I know you didn't ask anything about that, but I should mention this anyway for whoever wants to know. Taunt cancels all combat modes, so if you use power attack, expertise or flurry of blows, when the result comes in, you will need to reactivate the combat mode.<br/>\n<br/>\nHope this clarifies thing a bit <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:48 AM - Sep 04, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I should be able to start play-testing with combat debug once I am back at home base so this is helpful for me to understand what works and what doesn't, Max.\n<blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\n1- Taunt requires that the target be aware of you to work, so that means that you can't taunt someone without being in combat with them. If you taunt a neutral creature, it will be considered a hostile action and if its an NPC, he/she will most likely attack.\n</div></blockquote>\nTo be \"in combat\" I can assume that both an archer or spellcaster can taunt from distance.  I've never seen any range specified per se, so according to this explanation, if my PC can target a hostile, it can taunt it from that range. Right?  Or if a range attacker taunts will the taunter need to move up within a taunt \"range\" to complete the action? <br/>\n<br/>\nIn addition, does \"in combat\" mean you must have already made at least 1 attack on a target before attempting a taunt?\n<blockquote><div>\n2- You cannot SPAM Taunt, when you taunt someone, it takes a whole round to activate (meaning if you move or attack it will be interrupted) at the end of which it shows the result: either success or failure along with the opposed roll. \n</div></blockquote>\nSo, to restate, the \"cool-down\" is a full round, meaning 1 round to complete a taunt and then when that action is finished another round must pass before the next taunt can be attempted. Am I interpreting this correctly?\n<blockquote><div>\nOne other common thing is to have your taunting interrupted by making an attack of opportunity. Whenever a Taunt is interrupted, the next time you try to taunt someone, it will be INSTANTANEOUS. I often use that to my advantage before tough melee bosses, I taunt a minion just prior to its death and then cancel before the result is out. Then I kill it and when I taunt the boss it comes out instantly. That can be very helpful, instead of standing in front of a very tough and very angry heavy hitting boss taunting him. \n</div></blockquote>\nNifty trick.  That is \"specialist-worthy\".  Gotta remember that one. \n<blockquote><div>\n3- I don't know this one, but the correct thing is to not taunt someone that has already been successfully taunted. If you failed last time, then after a round you can try again like explained above. Does anyone happen to know this? I have never tried it myself. Say, if the difference between ur taunt and the opponent concentration checks is 2, hence you diminish their ac by 2, if you re-taunt him and get a result of 6 dis time, does the new penalty override the old one, or does the first one count<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /> how about if your result is 1, does it override or does the previous result count? I cant test it, but combat debugging should tell u that much. My keyboard doesn't consider tilde where its supposed to be because it's a brazilian keyboard so i cant enter the modes.\n</div></blockquote>\nYeah, testing would be necessary I guess.  Since I never tried taunting all that much I didn't know whether it was displayed in the log or not.  Seems it is.  The description says the Taunt check rolls don't stack which suggests multiple taunts can be issued on the same target within those 5 rounds but it doesn't explain about whether an overwrite can occur before the duration expires or if the original taunt roll lasts for the full duration regardless of whether you attempt another one or not (i.e wasted rounds by attempting to gain a higher roll before 5 rounds end).  If it CAN be overwritten, if an enemy is particularly difficult to hit, it may be worthwhile to just keep attempting a new taunt if the alternative is to be swinging/shooting into the air missing.\n<blockquote><div>\n4- Like I said in 1, the target needs to be aware of you, so if you try to taunt anyone who isn't aware of you, a message will appear saying that. Kind of like Animal Empathy: Failure: target needs to be aware of you to use this ability.\n</div></blockquote>\nGotcha. No \"sneak\" taunts.\n<blockquote><div>\n5- I know you didn't ask anything about that, but I should mention this anyway for whoever wants to know. Taunt cancels all combat modes, so if you use power attack, expertise or flurry of blows, when the result comes in, you will need to reactivate the combat mode.\n</div></blockquote>\nThat's is useful, too.  I probably wouldn't have picked up on that until it happened repeatedly.<br/>\n<br/>\nThanks, Max.   I'm not 100% on it yet, but am gradually comprehending the dynamic.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:57 AM - Sep 04, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>To be \"in combat\" I can assume that both an archer or spellcaster can taunt from distance. I've never seen any range specified per se, so according to this explanation, if my PC can target a hostile, it can taunt it from that range. Right? Or if a range attacker taunts will the taunter need to move up within a taunt \"range\" to complete the action? <br/>\n<br/>\nIn addition, does \"in combat\" mean you must have already made at least 1 attack on a target before attempting a taunt?\n</div></blockquote>\n\nNo, your toon will move towards the target when you click the taunt button, so there is no such thing as ranged taunting. What I mean in combat isn't exactly about your character, but about the enemy. The enemy need to be AWARE OF YOU, which means they need to see you, in order for the taunt to work, and when they see you, they attack, so that's why i said in combat. Sorry, misexpressed myself there.<br/>\n<blockquote><div>So, to restate, the \"cool-down\" is a full round, meaning 1 round to complete a taunt and then when that action is finished another round must pass before the next taunt can be attempted. Am I interpreting this correctly?\n</div></blockquote>\n\nyes, exactly that.<br/>\n<blockquote><div>Nifty trick. That is \"specialist-worthy\". Gotta remember that one. \n</div></blockquote>\n\nmore of an exploit, but thanks. Anyone who's ever used taunt long enough has found this out. The first time I did it was like this: <br/>\n<br/>\n- Holy shit, my taunt got cancelled by an AoO (most of the time with opponent trying to heal)!!<br/>\n<br/>\nthen I moved on to another foe, and tried taunting him.<br/>\n<br/>\n- Hmm, interesting, next taunt was instantaneous, i wonder if it'd work if I intentionally cancel the taunt and attack...<br/>\n<br/>\nthen after testing<br/>\n<br/>\n- AWESOME!!<br/>\n<blockquote><div>Yeah, testing would be necessary I guess. Since I never tried taunting all that much I didn't know whether it was displayed in the log or not. Seems it is. The description says the Taunt check rolls don't stack which suggests multiple taunts can be issued on the same target within those 5 rounds but it doesn't explain about whether an overwrite can occur before the duration expires or if the original taunt roll lasts for the full duration regardless of whether you attempt another one or not (i.e wasted rounds by attempting to gain a higher roll before 5 rounds end). If it CAN be overwritten, if an enemy is particularly difficult to hit, it may be worthwhile to just keep attempting a new taunt if the alternative is to be swinging/shooting into the air missing.\n</div></blockquote>\n\nNot really, because you taunt him once, then need to wait a round, then taunt him twice, need to wait another round, by the time you taunt him the 3rd time, your original taunt will be expiring already and you've effectively only gained one more chance to taunt the bastard. I'd rather take my chances to roll 20s<br/>\n<blockquote><div>That's is useful, too. I probably wouldn't have picked up on that until it happened repeatedly</div></blockquote>\n\nit's kind of hard not to when a GIANT MESSAGE appears just above your character's head saying: Expertise Mode Deactivated. Unless you've disabled messages or something, if that is even possible.<br/>\n<blockquote><div>Thanks, Max.  I'm not 100% on it yet, but am gradually comprehending the dynamic.</div></blockquote>\n\nOne is glad to be of service <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "4:30 PM - Sep 09, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Something fundamental to be aware of, while you taunt someone you are flatfooted. That's why if you have to taunt someone nasty it's better to do it while a companion or meatshield is keeping him busy or while the bad guy is prone or otherwise unable to hit you.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:46 PM - Sep 09, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>KailPendragon wrote:</strong>Something fundamental to be aware of, while you taunt someone you are flatfooted. That's why if you have to taunt someone nasty it's better to do it while a companion or meatshield is keeping him busy or while the bad guy is prone or otherwise unable to hit you.</div></blockquote>\n\nAlso, it should be noted what being flat-footed means for those who don't know. You lose your DEX and Dodge bonuses to AC. Having the Uncanny Dodge feat, attainable by being Rogue 3, Barbarian 2, Assassin 2 or Shadowdancer 2, you retain the Dex bonus to AC even when flat-footed, losing only Dodge AC. In STR melee builds that go Full Plate / Shield, being flat-footed is of little importance, as they generally have +1 DEX AC and not too much dodge, except for those with Epic Mage Armor and Divine Shield, they can only get Dodge AC from boots. In regular NWN, a monk's boots +5 is as far as it goes. So if you Taunt with Expertise on with a meleer, you will effectively just lose 1 AC. If in a low magic environment, even less. However, Kail has some taunting Dragons, which gain their Dodge AC cap by shifting, so they really suffer when trying to taunt. You should know whether being flat-footed will be significant to your build and act accordingly.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}