{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "429",
  "name": "Warrior of Song Bard 22 BG 4 Fighter 4",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/warrior-of-song-bard-22-bg-4-fighter-4-t2298782.html",
  "author": "Nokteronoth",
  "avatar": "10235235_1549015559.jpg",
  "replies": 9,
  "posts": [
    {
      "author": "Nokteronoth",
      "avatar": "no_avatar.png",
      "timestamp": "4:04 AM - Nov 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I've been meaning to build this one for a long time now, but I have a lot of trouble with starting Bards for some reason. Obviously they're rather weak at low levels, and this one's no exception. It's supposed to use a shield and a scimitar- or it can be used with a scythe/greatsword.<br/>\n<br/>\nApologies that the skills aren't fully flushed out, I haven't figured out what to spend them all on.<br/>\n<br/>\nIt can be used with Human, Elf, Half-elf...or anything, really. Although I suggest against using a dwarf. <br/>\n<br/>\nOn Arelith, +2 CHA and +2 STR gifts may help this build out a lot. <br/>\n<br/>\nBard(22), Blackguard(4), Fighter(4), Elf<br/>\n<br/>\nPvM and PvP, although mostly PvP by end levels.<br/>\n<br/>\nSTR: 14 (18)<br/>\nDEX: 10<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 15 (18)<br/>\n<br/>\nHitpoints: 272<br/>\nSkillpoints: 182<br/>\nSaving Throws (Fortitude/Will/Reflex): 20/19/20<br/>\nSaving Throw bonuses: Spells: +7, Mind Effects: +2<br/>\nBAB: 21<br/>\nAB (max, naked): 28 (melee), 21 (ranged)<br/>\nAC (naked/mundane armor/shield only): 18/29<br/>\nSpell Casting: Bard(6)<br/>\nAlignment Changes: 0<br/>\n<br/>\nDiscipline 33(37), Hide 5(5), Listen 33(34), Perform 33(47), Spellcraft 33(35), Tumble 30(30), remaining skillpoints 15<br/>\n<br/>\nElf: (Hardiness vs. Enchantments, Keen Sense, Low-light Vision, Skill Affinity: Listen, Skill Affinity: Search, Skill Affinity: Spot, Sleeplessness)<br/>\n01: Bard(1): Power Attack<br/>\n02: Bard(2)<br/>\n03: Bard(3): Curse Song<br/>\n04: Bard(4): STR+1, (STR=15)<br/>\n05: Bard(5)<br/>\n06: Bard(6): Cleave<br/>\n07: Bard(7)<br/>\n08: Bard(8): CHA+1, (CHA=16)<br/>\n09: Bard(9): Extend Spell<br/>\n10: Blackguard(1)<br/>\n11: Blackguard(2): {Smite Good}<br/>\n12: Blackguard(3): STR+1, Divine Might, (STR=16)<br/>\n13: Bard(10)<br/>\n14: Bard(11)<br/>\n15: Blackguard(4): Divine Shield<br/>\n16: Bard(12): CHA+1, (CHA=17)<br/>\n17: Bard(13)<br/>\n18: Bard(14): Weapon Focus<br/>\n19: Bard(15)<br/>\n20: Bard(16): STR+1, (STR=17)<br/>\n21: Bard(17): Epic Skill Focus: Perform<br/>\n22: Bard(18)<br/>\n23: Bard(19)<br/>\n24: Fighter(1): CHA+1, Epic Weapon Focus, Improved Critical, (CHA=18)<br/>\n25: Fighter(2): Armor Skin<br/>\n26: Fighter(3)<br/>\n27: Fighter(4): Weapon Specialization, Epic Weapon Specialization<br/>\n28: Bard(20): STR+1, (STR=18)<br/>\n29: Bard(21)<br/>\n30: Bard(22): Lasting Inspiration<br/>\n<br/>\nWith the plain Greensteel gear available on Arelith (+3 Shield, +2 armor, +3 weapon). +1 STR and +1 CHA on all gear not armor/shield/weapon.<br/>\n<br/>\nAC is 53 when buffed, +41/+36/+31/+26 AB<br/>\n1-6+16+5slashing+3 bludgeoning+9 divine<br/>\n<br/>\nSaves are 27/29/27<br/>\n<br/>\n~Nok<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:28 PM - Nov 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll take a closer look at this later (kinda rushed atm)... but the DM/DS in a build that is not CHA-focused is just about worthless.  You'll sneeze and those buffs will be over.  Also, Blind Fight is essential for all meleers against concealment.  Once you free up the prereq of PA for the divine feats, you may find more use out of Knockdown/IKD than Cleave.  Without actually working it out, I'd leave CHA at 15, maybe 16 if necessary (your DCs and will be pedestrian anyway without focus) and max STR for AB/damage boosts and Discipline.  Lingering Song will make leveling MUCH easier if you can fit it in (pretty standard fare for a singer) and I'd love to bump up both Imp Crit into Pre-epic and WS/EWS to Level 21 (would be ftr 18 thru 21 perhaps) again for faster leveling.  The use of BG if only for divine feats probably weakens the overall potential IMO.<br/>\n<br/>\nLike I said, these are just first impressions without working it out... basically an impromptu wish list.  See if that makes sense or helps at all.  I'll leave the Arelith-specific considerations for last to expedite the analysis.<br/>\n<br/>\nLata with better help I hope. <br/>\n<br/>\nedit:<br/>\n- - --  - - - - - - Later that day...<br/>\n<br/>\nFor comparison purposes only, something the gnaw on... Brd 21/Ftr 5/CoT 4...<br/>\n<br/>\nAn alternate build:<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tBard(21), Fighter(5), Champion of Torm(4), Human<br/>\n<br/>\nSTR: 16 (24)<br/>\nDEX: 8<br/>\nCON: 12<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 16<br/>\n<br/>\n01: Brd01 - Blind Fight, Lingering Song<br/>\n02: Brd02<br/>\n03: Brd03 - Extend Spell<br/>\n04: Ftr01 - STR+1 (17), WF: Scimi<br/>\n05: Ftr02 - Knockdown<br/>\n06: Ftr03 - Toughness<br/>\n07: Ftr04 - WS: Scimi<br/>\n08: Brd04 - STR+1 (18)<br/>\n09: Brd05 - Curse Song<br/>\n10: Brd06<br/>\n11: Brd07<br/>\n12: Brd08 - STR+1 (19), Imp Crit: Scimi<br/>\n13: CoT01<br/>\n14: CoT02 - IKD<br/>\n15: CoT03 - Empower Spell<br/>\n16: Brd09 - STR+1 (20)<br/>\n17: Brd10<br/>\n18: Brd11 - Still Spell<br/>\n19: Brd12<br/>\n20: Ftr05 - STR+1 (21)<br/>\n21: CoT04 - EWF/EWS:Scimi<br/>\n22: Brd13<br/>\n23: Brd14<br/>\n24: Brd15 - STR+1 (22), Armor Skin<br/>\n25: Brd16<br/>\n26: Brd17<br/>\n27: Brd18 - Grt STR I (23)<br/>\n28: Brd19 - STR+1 (24)<br/>\n29: Brd20<br/>\n30: Brd21 - Lasting Inspiration<br/>\n<br/>\n* Values in brackets reflect the effects of a level 18 bard song<br/>\n<br/>\nHP: 276 [300]<br/>\nSaves (F/W/R): 19/16/18 (26/23/25 [28/26/27] vs. spells)<br/>\nBAB: 22<br/>\nAB (max, naked): 32 [34] (melee), 21 [23] (ranged)<br/>\nAC (naked/mundane armor/shield only): 17/28 [22/33]<br/>\nSR Penetration: 22-41<br/>\nDCs: meh, not so good w/o foci -&gt; 13 + SLvl<br/>\n<br/>\nSkills (213)<br/>\nConcentration 33(34)[40], Discipline 33(40)[46], Perform 33(36)[42], Spellcraft 33(35)[41], Tumble 30(29)[35], <br/>\nUMD 32(35)[41], remaining ----&gt; 19<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nRemarks<br/>\nElected KD/IKD over PA/Cleave (personal bias, in this case)<br/>\n<br/>\nStill Spell to cast all spells except Level 6 with 100% success in heavy armor/tower.<br/>\n^Related: Neither Darkness nor Displacement can be stilled but neither spell has a somatic component so good to go.<br/>\n<br/>\nCoT's Sacred Defense will compensate for some of the save boost lost by the BG's Dark Blessing.<br/>\n<br/>\nIf UMD is not all that desirable, max Taunt.<br/>\n<br/>\nAB progression w/Level 18 bard song &amp; Emp Bull's - +37/+32/+27/+22 (/+37 hasted)<br/>\nScimi crits: 30% of hits (15-20)<br/>\n<br/>\nBard Song after Level 16 has poor return on investment.  Only slight boosts will be gleaned on HP &amp; skill bonus for a substantial investment in Perform via +CHA and feats.  Duration = 105 rounds<br/>\n<br/>\nIf it is easy to reach +12 ability caps on your server, you may omit Empower Spell for its self-buffing advantage and if spell effects in general are not a consideration.  However, this toon's spellcasting potential is worth optimizing, IMHO.<br/>\n<br/>\nWith Emp Eagle's and modest +4 CHA in equipment (maybe lift Max's infamous +5 Nymph cloak out of his pocket while he is distracted?   ), a Level 19 Curse Song should reachable after Bard Song... again, not enough of a difference between Level 17 &amp; 19 songs to make it a build-breaker.  You may decide to swap Extend with Curse Song.  Shouldn't matter much either way, though.<br/>\n<br/>\nBTW, the AB &amp; damage stats you posted last less than a turn, a lot less.  While you are using Turn Undead rounds to boost your combat effectiveness, you'll be getting hit, probably KD'd or disarmed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Nokteronoth",
      "avatar": "no_avatar.png",
      "timestamp": "7:12 AM - Nov 23, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'mm replug everything through the Pretty Good Character Creator and see what happens. Although for level 20, I'm taking a fifth CoT level instead of Fighter. Then It'll have Divine Wrath. (Neither gets a bonus feat on that level, so I figured it'd be the same with either except that CoT gets Divine Wrath and a fun toy to play with for a round. To be showy.)<br/>\n<br/>\n~Nok<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:05 PM - Nov 23, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The problem with taking CoT instead of Fighter at level 20 is that you will not have a CoT feat at level 21 (it would be at 20 instead). You need either a Fighter feat or CoT feat in epic for Epic Weapon Spec.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "9:39 PM - Nov 23, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Nokteronoth wrote:</strong>I'mm replug everything through the Pretty Good Character Creator and see what happens. Although for level 20, I'm taking a fifth CoT level instead of Fighter. Then It'll have Divine Wrath. (Neither gets a bonus feat on that level, so I figured it'd be the same with either except that CoT gets Divine Wrath and a fun toy to play with for a round. To be showy.)<br/>\n~Nok</div></blockquote>\nI think you are gradually picking up on the value of all of these 1x/day feats.  \"Showy\" is a valid description.  Mainly they are intended as finishing actions to dispatch a tough opponent or boss once they have been injured enough to exact a killing stroke.  However, basing a build on those feats (Cleric's War/Battle Mastery is another one of those, probably superior to Divine Might or Divine Wrath, but requires many cleric levels to make it as effective), just weakens the build's potential.  <br/>\n<br/>\nIn the case of Divine Might, you need to vest into a class with prereq feats that you may never even use.  In PvP, Power Attack and Cleave are totally worthless.  PA because you won't hit anything with it but low AC toons and Cleave because you'd need to fight Pv2P to get any use at all out of it at all.  Also, with a pedestrian STR level resulting from splitting abilities to enhance CHA, your AB and damage will suffer dramatically. I.e. you won't get a chance to exhibit that \"showy\" divine damage because your toon won't be able to hit anything substantial.  Unfortunately, there are no \"permanent\" effect feats that add the CHA modifier to the attack roll or you'd see a whole new slew of builds posted.<br/>\n<br/>\nCoT's prereqs are more lenient (higher BAB but only WF feat), assists somewhat in providing some better feat availability, has some feat synergy with fighter class and helps to avoid the XP problems.  But Divine Wrath also needs a HUGE CHA commitment to become \"showy\".<br/>\n<br/>\nCommitting to a singer build is not a bad idea.  Songs are irresistible and with the Song/Curse combo will double both AB and AC boosts for your singer, a consequence of the reciprocal effect on enemies.  In dead or chaotic magic zones, Bards are sweet!  But singing is essentially just buffing, so a solid attack and defense build is necessary to end up with a competitive warrior.<br/>\n<br/>\nA few more comments, a few which I have repeated many, many times before (ECB vets, please take this opportunity to move the damp clothes into the dryer    )...<br/>\n<br/>\nPvP is always a custom build.  By \"custom\", I mean vs. a specific class combo.  There are no universal PvP builds.  When you optimize to deal with say a Weapon Master, you'll fall prey easily to clerics and mages.  The reverse is true.  Building to withstand caster foes, means your melee prowess will suffer and fighters will own you.  Not to mention those blasted Arcane Archers.  <br/>\n<br/>\nThose builds that advertise it as PvE or PvM/PvP require the basic build to be significantly redesigned for each type of PvP encounter and the original design can be unrecognizable.<br/>\n<br/>\nSo, the bottom line is: decide on EXACTLY what you seek to achieve and describe in detail your preferences.  Refrain from requests like \"a character that will cause huge damage against all kinds of opposition\".  There ain't no such animal and never will be without selecting that custom feat that assures your toon will roll nothing but 20's.  <br/>\n<br/>\nPlay style can make or break any build plan.  At times, a builder will actually go step-by-step through how they use the build in practice.  Should another user of the build stray too far from the optimum style, results may be poor.  So it is best to build-test-tweak-test-tweak-test, rinsing and repeating as necessary.  Usually, after a few alterations and retests it should become apparent where the weaknesses are and if it is within the scope of the build's framework to succeed as desired.  For every build that I have created and tested to my own satisfaction there are probably a dozen or more on the cutting room floor.  So don't be afraid to discard any \"guesses\".  It's part of the creativity cycle, amigo!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "DragonatorXII",
      "avatar": "no_avatar.png",
      "timestamp": "10:00 PM - Nov 23, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've done a similar build on arelith, and it actually turned out great. I went 20 Bard/Fighter 6/ Blackguard 4. I also used Divine Might, and shield. It did pretty amazing in PvM &amp; PvP, with a buffed AC of 72 and AB of 39. Switchable to 62 AC &amp; 49 AB, or 67 AC &amp; 42 AB. I started with 16 Strength, 15 Charisma, 10 Con, and 14 INT. I took the strength, constitution, and charisma gifts. Giving me 18 Strength, 17 Charisma, 12 Constitution, and 14 Intelligence starting.<br/>\n<br/>\nHip. you mentioned that DM/DS would be worthless. They ended with 18 Charisma. That can easily be picked up to 30 on arelith, giving it a duration of 10 rounds, an extra 10 damage, and +10 AC for 10 rounds. Which, is pretty useful in PvP on arelith. Especially when wielding a scimitar or rapier, that's an extra 20 damage on many hits, which can break the line of winning or losing.<br/>\n<br/>\nYou also mentioned still spell. On arelith, which this build is designed for (As noted by getting gifts, I can only assume!), there is armor that you can craft that has spell failure lower on it. So, still spell is a waste of a feat. But, for other PWs that don't have the option of still spell.. Yeah, good choice! I have to agree with power attack being worthless on the original build posted by Nok. Though, if that AB was boosted somehow, I can see power attack being useful against many melee characters. (From my experience, many melees on arelith have low AC. Generally the barbarian WMs and fighter-wms.) <br/>\n<br/>\n<br/>\nThe CoT/Bard/Fighter looks pretty solid. Though, I honestly think lingering song is a waste of a feat. It can make leveling easier, but you get lasting inspiration end build. That's my personal opinion though, since I always build for end build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Nokteronoth",
      "avatar": "no_avatar.png",
      "timestamp": "5:08 AM - Nov 24, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Alright. So I did a quick rebuild with just 16 Bard to see what would come of it.<br/>\n<br/>\nGot rid of Divine Shield/Might, added IKD and Improved Disarm. Added in Blind Fight, all the fun epic feats, and even gathered some extra STR. It would end up as a good build for using a greatsword/scythe (If a single feat gets killed off.)<br/>\n<br/>\nEDIT: I made it in PGCC with some arelith-basic items. (Greensteel +2 armor, +1 stat items)<br/>\nends 33 AC, 340 HP, 2-8+25 Scythe crits<br/>\naverage damage is in the 40's, crits at 170-180<br/>\n(Don't think I'll keep it without a shield, though.)<br/>\n<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tSTR: 15 (24)<br/>\nDEX: 10<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 15 (16)<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Fighter(1): Disarm, Weapon Focus, Knockdown<br/>\n02: Fighter(2): Improved Disarm<br/>\n03: Fighter(3): Blind fight<br/>\n04: Fighter(4): STR+1, Weapon Specialization, (STR=16)<br/>\n05: Bard(1)<br/>\n06: Bard(2): Curse Song<br/>\n07: Bard(3)<br/>\n08: Bard(4): CHA+1, (CHA=16)<br/>\n09: Bard(5): Improved Knockdown<br/>\n10: Bard(6)<br/>\n11: Bard(7)<br/>\n12: Bard(8): STR+1, Improved Critical, (STR=17)<br/>\n13: Bard(9)<br/>\n14: Bard(10)<br/>\n15: Bard(11): Expertise<br/>\n16: Bard(12): STR+1, (STR=18)<br/>\n17: Bard(13)<br/>\n18: Bard(14): Improved Expertise<br/>\n19: Bard(15)<br/>\n20: Champion of Torm(1): STR+1, (STR=19)<br/>\n21: Champion of Torm(2): Epic Weapon Focus, Epic Weapon Specialization<br/>\n22: Champion of Torm(3): {Smite Evil}<br/>\n23: Champion of Torm(4): Armor Skin<br/>\n24: Champion of Torm(5): STR+1, Great Strength I, (STR=21)<br/>\n25: Champion of Torm(6): Epic Prowess<br/>\n26: Champion of Torm(7)<br/>\n27: Bard(16): Great Strength II, (STR=22)<br/>\n28: Champion of Torm(8): STR+1, Called Shot, (STR=23)<br/>\n29: Champion of Torm(9)<br/>\n30: Champion of Torm(10): Great Strength III, Weapon Proficiency Exotic, (STR=24)<br/>\n<br/>\n<br/>\nHitpoints: 296<br/>\nSkillpoints: 197<br/>\nSaving Throws (Fortitude/Will/Reflex): 23/19/22<br/>\nSaving Throw bonuses: Spells: +6<br/>\nBAB: 21<br/>\nAB (max, naked): 32 (melee), 22 (ranged)<br/>\nAC (naked/mundane armor/shield only): 18/29<br/>\nSpell Casting: Bard(6)<br/>\nAlignment Changes: 0<br/>\n<br/>\nDiscipline 33(40), Hide 30(30), Move Silently 30(30), Perform 30(33), Spellcraft 30(32), Tumble 30(30), UMD 12(15), remaining skillpoints 2<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n~Nok<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:17 PM - Nov 24, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The term \"worthless\" was a relative one, probably inappropriate.  Apologies.  The efficiency depends on the server and types of battles.  It's simple arithmetic.  After 1 turn, you'll need to \"waste\" 2 rounds with a 2 turn attempts to resurrect the divine effects again.  Multiply that by the number of \"feat resurrections\" per battle and you are exposing yourself to what I feel are unnecessary \"free attack rounds\" for the enemy (IIRC TU attempts cannot cause an AoO).  But maybe your dice roll better than mine.  I usually get KD'd or disarmed when rebuffing in combat, or worse, DevCritted.  I've found it better to keep the pressure on and force the foe into a non-combat action  grab a free attack round and perhaps an AoO besides.  Some (or all) of the amount of the damage added by DM can be offset by the foe's counter during those lost rounds.  <br/>\n<br/>\nThe commitment to equip CHA boosters to provide better utility of the divine effects instead of +STR ones (again, w/o knowledge of item enhancements on Arelith) to overcome AC with the increased AB (unconditionally) and add phys. damage (again, unconditionally, except for DR considerations) albeit not of the divine type that DM provides...  that whole decision has a cost.  The Power Attack feat is necessary to meet the BG Cleave prereq (unless it is different on Arelith), so essentially 2 feats thrown away for BG if PvP is the ultimate goal (clerics can also elect DM/DS if really desired and w/o class prereqs).  PA &amp; Cleave... useful for dispatching mobs of kobolds, I suppose, or bashing chests... are PvM-only feats.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Nokteronoth",
      "avatar": "no_avatar.png",
      "timestamp": "8:35 AM - Nov 29, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was looking through the other lists of builds, and I came up with another mix-match, using the advice that 16 Bard levels is plenty. I didn't think it would be necessary to start a new topic for this, since it's just a slight tweak. <br/>\n<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tFighter(7), Bard(16), Weapon Master(7), Human<br/>\n<br/>\nI figure ending AB will be:<br/>\n5(STR) + 1 (Epic Prowess) + 22 (BAB) + 3 (WF+EWFoc) = 31 (Without bard song or spells)<br/>\nAC should be:<br/>\n10 (Base) + 2 (ArmorSkin) + 2 (DEX) + 3 (mundane Armor) + 3 (mundane Tower shield) + 6 (Tumble) = 26 (Again, without bardsong, spells, or buffed gear)<br/>\n<br/>\nCurse Song should probably be taken earlier, but it's a bit of a feat-hungry build. Could sub in more Fighter levels.<br/>\n<br/>\nSTR: 15 (20)<br/>\nDEX: 14<br/>\nCON: 12<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 14 (16)<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Bard(1): Dodge, Mobility<br/>\n02: Bard(2)<br/>\n03: Bard(3): Expertise<br/>\n04: Fighter(1): STR+1, Weapon Focus: Scimitar, (STR=16)<br/>\n05: Fighter(2): Spring Attack<br/>\n06: Fighter(3): Whirlwind Attack<br/>\n07: Weapon Master(1): Weapon of Choice: Scimitar<br/>\n08: Weapon Master(2): STR+1, (STR=17)<br/>\n09: Weapon Master(3): Improved Critical: Scimitar<br/>\n10: Weapon Master(4)<br/>\n11: Weapon Master(5)<br/>\n12: Weapon Master(6): STR+1, Knockdown, (STR=18)<br/>\n13: Weapon Master(7)<br/>\n14: Bard(4)<br/>\n15: Bard(5): Improved Knockdown<br/>\n16: Bard(6): CHA+1, (CHA=15)<br/>\n17: Bard(7)<br/>\n18: Bard(8): Blind Fight<br/>\n19: Bard(9)<br/>\n20: Bard(10): CHA+1, (CHA=16)<br/>\n21: Bard(11): Epic Weapon Focus: Scimitar<br/>\n22: Bard(12)<br/>\n23: Bard(13)<br/>\n24: Fighter(4): STR+1, Weapon Specialization: Scimitar, Epic Weapon Specialization: Scimitar, (STR=19)<br/>\n25: Bard(14)<br/>\n26: Bard(15)<br/>\n27: Bard(16): Curse Song<br/>\n28: Fighter(5): STR+1, (STR=20)<br/>\n29: Fighter(6): Armor Skin<br/>\n30: Fighter(7): Epic Prowess<br/>\n<br/>\nHitpoints: 266<br/>\nSkillpoints: 203<br/>\nSaving Throws (Fortitude/Will/Reflex): 14/14/20<br/>\nSaving Throw bonuses: <br/>\nBAB: 22<br/>\nAB (max, naked): 32 (melee), 25 (ranged)<br/>\nAC (naked/mundane armor/shield only): 20/30<br/>\nSpell Casting: Bard(6)<br/>\nAlignment Changes: 0<br/>\n<br/>\nAppraise 15(17), Concentration 12(13), Discipline 33(38), Hide 30(32), Intimidate 4(7), Move Silently 30(32), Perform 30(33), Tumble 30(32), UMD 15(18)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:47 AM - Nov 29, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Nokteronoth wrote:</strong>30: Fighter(7): Epic Prowess</div></blockquote>\nFighter 7 gives you nothing here. WM 8 will not add anything either.<br/>\nBard 17 will give you access to more known spells, give you more spell slots and open up for lvl 6 spells. Bard will also let you increase class skills to 33 ranks<br/>\n<br/>\nBard song and Curse song lvl 16 need 30 perform. With cha 16 you only need 27 ranks. If you plan on buffing with eagle's splendor, you can get away with 25 or 26 ranks<br/>\n<br/>\nI also think Curse song comes too late. I would have taken it earlier, perhaps swapped place with IKD<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}