{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "132",
  "name": "Assassins -  Is this Prestige Class Extinct?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/assassins-is-this-prestige-class-extinct-t2355268.html",
  "author": "grizzled_dwarflord",
  "avatar": "10758933_1548854436.jpg",
  "replies": "31",
  "views": "2.9K",
  "posts": [
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "8:41 PM - Dec 16, 2019",
      "content": "<div>Are assassins pretty much a gimmick class at this stage in NWN?  I can't think of a reason any longer to choose an Assassin over a Rogue in any situation.  Maybe to avoid xp penalty, but I don't find xp penalties a compelling reason any more.  <br/>\n<br/>\n<strong>Rogue Advantages</strong><br/>\n4 more skill points per level.  <br/>\nRogues can obtain early access to Crippling Strike that doesn't require special circumstances to fire like the Death Attack.  <br/>\nRogues receive more bonus Feats, to include Epic Dodge.  <br/>\nRogues receive same amount of sneak dice.<br/>\nRogues get Evasion for Free<br/>\n<br/>\n<strong>What does the Assassin offer on the other side?</strong><br/>\nInvis -- big whoop.  <br/>\nGhostly Visage -- oh boy<br/>\nDarkness - Meh<br/>\nImproved Invis -- Really the only redeeming aspect of the class.  However, Rogues can access this via items, scrolls, Dust of Disappearance, etc.<br/>\nBonus Feats come every 4 levels.  A 19th level Rogue would have 4 bonus feats.  A 19th level Assassin only 2.<br/>\nBonus Feats are meh -- with the exception of Great Dex, the rest are trash.  <br/>\nDeath Attack -- since the mini nerf to the Death Attack first flurry (and now only the first actual attack), this has even more diminishing returns.<br/>\n<br/>\nSo, if any of you are like me, and always feel jilted like a bride left at the altar when playing an Assassin, what could be done to restore some health, wellness, and balance to the Assassin class.  I'm asking about things within reason, that are balanced and wouldn't make it better than the Rogue, but maybe more on equal footing.  Looking for thoughts, opinions, suggestions, and good discussion.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:32 AM - Dec 17, 2019",
      "content": "<div>Hmm I've only played minor class assassin to dodge the multi-class exp bonus to access UMD, get a little death attack<br/>\n<br/>\nI'm curious if the improved invisibility from assassin is dispellable. I noted in some of the ECB archives there was discussion that it wasn't, however I noted the Blackguard Bull's Strength (also a spell-like feat) has been dispelled from me on a few occasions. Perhaps they are coded differently<br/>\nThe death attack disable duration for assassin is crazy. Like 1 turn / level. I wouldn't mind if death attack chance could be applied when flanking / knocked down and the duration nerfed, maybe 1 round / level or something more balanced. At the moment it seems to only apply if I attack enemies from stealth?<br/>\n<br/>\nIf it also helps GDL, I did post up something on Reddit about what people thought about balance changes, and the most upvoted response was that it was up to the module creators to make the balance changes. Even the parry skill or dirty fighting. Heh I think a lot of players have been burnt by patches implementing balance changes :)</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "1:52 AM - Dec 17, 2019",
      "content": "<div>A couple things.<br/>\n<br/>\nI think the duration of the assassins paralyze from the death attack already IS nerfed ! I certainly think it is much less than 1 minute per level of assassin.<br/>\n<br/>\nOn WoG the poisons available and the changes to the duration give a boost for the assassin class...but that is WoG dependent. And that also how it was BEFORE the nerf.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:08 AM - Dec 17, 2019",
      "content": "<div><blockquote><div><cite>gkorjax wrote: <div class=\"responsive-hide\">Dec 17, 2019</div></cite>\nI think the duration of the assassins paralyze from the death attack already IS nerfed ! I certainly think it is much less than 1 minute per level of assassin.\n</div></blockquote>\nif true, looks like the NWN Wiki might need updating  :)</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:29 AM - Dec 17, 2019",
      "content": "<div>Here is a reason to choose Assassin over anything else!<br/>\n<br/>\nMonk 38/Assassin 2.<br/>\n<br/>\nIt literally kills WoG.<br/>\n<br/>\nIt can go toe-to-toe (well, fist to claw, I guess) with WDK and wipe that silly, toothy grin off his face! Bruise Lolth's loathsome visage!  Cure AoO's foot fungus! <br/>\n<br/>\nAnd a whole lot more!<br/>\n<br/>\nBut I rather suspect that you mean the Class as a whole here, and not just smidgens!<br/>\n<br/>\nAnd in that, I really do agree!  The only thing going for the Class now is that it gets Uncanny Dodge at level 2.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:18 PM - Dec 17, 2019",
      "content": "<div>My biggest beef with Assassin is that it needs to be evil. Why? Because they're killers? Name me one class you've ever played that doesn't kill in NwN. Evil speaks to motive, and assassins can have as many of those as fighters, clerics, rogues, wizards and everything else. Surely neutral would be a better \"home\", if the class needs restricting at all, that is. I know there's nothing that can be done about it, but I need to take it out for an occasional airing.<br/>\n<br/>\nAs a SP module player, I could find the xp penalty of taking another base class harder to live with than on PWs, but it's not really an issue, as there are always ways around it.<br/>\n<br/>\nI have wondered about how to compensate for the gimping of DA, and had a few thoughts, but all come at the expense of knocking lumps off other classes. I'm thinking about giving them such feats (not necessarily intrinsic) as HiPS or Weapon Specialization. After all, they are supposed to be stealthy killers with magic-like abilities and also, if an assassin can't specialize in a weapon, who can? (The same applies to Weaponmaster as far as the latter goes - there's even a clue in the name.) But they would impact on Shadowdancer and Fighter respectively. There are others, but I'll save them for now.<br/>\n<br/>\nMaybe one way around it would be to make it a harder class to qualify for, which seems to make sense to me anyway - surely it shouldn't be a class you can just breeze into.<br/>\n<br/>\nTo be fair, I've only really made a concerted attempt to play/ build with the class for a couple of months about a year ago, and only successfully run Mick's Kama Shinobi in Aielund, so I'm no expert, just tossing my twopenny-worth in the mix.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:33 AM - Dec 18, 2019",
      "content": "<div>As far as I know the only problem with the assassin class in EE is that the death attack paralysis is limited to one attempt per round. Prior to that you attempted a paralyzing attack every time you targeted a flat footed creature. And you would do so with every attack in the actual flurry of attacks you attacked with. That would of course multiply the chance of succeeding with the paralysis compared to the single attempt after EE.<br/>\n<br/>\nOne question is if you have to play EE or if you can stick to 1.69. That depends on where you play.<br/>\n<br/>\nEven after EE assassin has its uses. One is to avoid a multiclass xp penalty as was mentioned above. You still get most of the rogue skills as class skills, \"SA\" damage and UD, so it may serve well as tumble class in some builds.<br/>\nMost of the spell like abilities are so-so. Ghostly visage can be of some use early on, but soon becomes obsolete. Improved invisibility is far better than the one rogues can cast with UMD. It lasts longer and is far more difficult to dispel. Cast from a sequencer it lasts so long that it almost becomes a permanent feature.<br/>\nThe feature I value the most as a builder is the Great dexterity bonus feat. It enables builds that end at dex 40 and have a high warrior like like AB.<br/>\n<br/>\nAfter EE the scales definitely have tilted in favor of rogue. <br/>\nDespite the similarities between the classes, one should treat assassin as something different. You can use the class to achieve results that are impossible with the rogue class. And rogue will give builds you cannot make with the assassin class alone.<br/>\n<br/>\nIf you want ED, crippling strike and more skills, build with rogue.<br/>\nIf you want high AB, DA paralysis, 50% concealment and no XP penalty in the build, assassin can be the class to use.<br/>\n<details><summary>Spoiler</summary>Ranger(10), Assassin(30), Halfling\n\nDEX: 20 (40)\nWIS: 12\nCHA: 8\n01: Ranger(1): Expertise, Favored Enemy I, {Dual Wield}\n03: Ranger(3): Weapon Finesse\n05: Ranger(5): Favored Enemy II\n07: Assassin(2): {Uncanny Dodge I}\n09: Assassin(4): Blind Fight\n11: Assassin(6)\n13: Assassin(8)\n15: Ranger(6): Improved Knockdown\n17: Ranger(8)\n19: Ranger(9): {Improved Two-Weapon Fighting}\n21: Assassin(11): Epic Weapon Focus: Dagger\n23: Assassin(13)\n25: Assassin(15)\n27: Assassin(17): Great Dexterity II, (DEX=28)\n29: Assassin(19)\n31: Assassin(21)\n33: Assassin(23): Great Dexterity VI, (DEX=34)\n35: Assassin(25)\n37: Assassin(27)\n39: Assassin(29): Great Dexterity IX, (DEX=38)\n\nSaving Throws (Fortitude/Will/Reflex): 20/18/36\n\nAB (mundane weapons): 47 (melee), 45 (ranged)\nDeath attack paralyzation DC: 42\nSpell Casting: Ranger(2), Assassin spell like abilities (undispellable), UMD\nSkillpoints: 258</details></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "4:58 PM - Dec 18, 2019",
      "content": "<div>Not bad, Mick, not bad at all.  Although in a way, your build example actually illustrates my point.  I can build that same character, and just swap out Assassin for Rogue.  I’m not restricted by alignment nor do I have an artificial hard cap in pre-epic for Rogue <br/>\nRanger(10), Rogue(30), Halfling<br/>\nAlignment: any  <br/>\n<br/>\nSTR: 10<br/>\nDEX: 20 (40)<br/>\nCON: 8<br/>\nWIS: 12<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\n01: Rogue(1): Expertise<br/>\n02: Ranger(1) , Favored Enemy I, {Dual Wield}<br/>\n03: Ranger(2): Weapon Finesse<br/>\n04: Ranger(3): DEX+1, (DEX=21)<br/>\n05: Ranger(4): Favored Enemy II<br/>\n06: Ranger(5): Weapon Focus: Dagger<br/>\n07: Rogue(2)<br/>\n08: Rogue(3): DEX+1, (DEX=22)<br/>\n09: Ranger(6): Blind Fight<br/>\n10: Ranger(7)<br/>\n11: Ranger(8)<br/>\n12: Rogue(4): DEX+1, Knockdown, (DEX=23)<br/>\n13: Ranger(9) {Improved Two-Weapon Fighting}<br/>\n14: Rogue(5)<br/>\n15: Rogue(6): Improved Knockdown<br/>\n16: Rogue(7): DEX+1, (DEX=24)<br/>\n17: Rogue (8)<br/>\n18: Rogue (9): Toughness<br/>\n19: Rogue (10): Crippling Strike<br/>\n20: Rogue(11): DEX+1, (DEX=25)<br/>\n21: Rogue(12): Great Dex I <br/>\n22: Rogue(13), Improved Evasion<br/>\n23: Rogue(14)<br/>\n24: Rogue(15): Great Dexterity II, (DEX=28)<br/>\n25: Rogue(16), Def Roll<br/>\n26: Rogue(17) <br/>\n27: Rogue(18): Great Dexterity III<br/>\n28: Rogue(19): (DEX=30), Epic Dodge<br/>\n29: Rogue(20)<br/>\n30: Rogue(21): Great Dexterity IV<br/>\n31: Rogue(22)<br/>\n32: Rogue(23): Dex 32<br/>\n33: Rogue(24): Great Dexterity V, ESA: Hide<br/>\n34: Rogue(25) <br/>\n35: Rogue(26)<br/>\n36: Rogue(27): Great Dex VI, Dex35<br/>\n37: Rogue(28), ESF: Move Silently<br/>\n38: Rogue(29), <br/>\n39: Ranger10, EWF: Dagger, Epic Prowess<br/>\n40: Rogue(30): Dex 36<br/>\n<br/>\nHitpoints: 280<br/>\nSaving Throws (Fortitude/Will/Reflex): 20/18/36<br/>\nSaving Throw bonuses: Traps: +2, Poison: +15, Fear: +2<br/>\n<br/>\nBAB: 27<br/>\nAB: 45<br/>\nAB (mundane weapons): 47 (melee), 45 (ranged)<br/>\nSneak attack damage bonus: 15d6<br/>\n<br/>\n For only 2 less AB than his assassin counterpart, the rogue version gains an additional <span style=\"text-decoration:underline\">132 skill points</span> (<em>enough to max out almost 4 more skills! Discipline, Disable Trap, Set Trap, I can crossclass for Spellcraft for more spell defenses</em>), Crippling Strike, Improved Evasion, Epic Dodge, ESF’s In Hide and Move Silently.   What am I losing other that 2 AB?  The Death Attack Paralysis?  Something very situational.  It has its uses, but those uses are very limited.  The other thing lost obviously is the 50% concealment, but that can be emulated.  And then there’s XP penalty.  Maybe.  On most PWs, 20% just means you take side jobs from time to time if you’re with a party.  If solo, it means nothing.<br/>\n <br/>\nI’m just not seeing any compelling advantage in making an Assassin vs. a Rogue.  Rogues make better assassins than assassins.  But that’s not really my argument.  I understand that the classes have to be different.  But I feel like that difference should at least be balanced in some regard.  So my question, and hence my quandary, is purely academic.  If all things being equal, and in a mid-magic world, what can be done to make the assassin class more attractive?  Someone mentioned remove the alignment restriction.  Someone else stated to make Poisons more worthwhile (I agree).  What about feat progression?  Given they’re hard-capped in pre-epic (the class that is), what if instead of every 4 levels for a bonus feat, it were every 3?  Or 5 skill points instead of 4?  Or Class Affinity for Hide and Move Silently (like a free Stealthy feat)?  <br/>\n <br/>\nSo basically I’m asking this, If you had chance to remake the assassin class, what would you do different?<br/>\n <br/>\nBy the way, for those who are under the impression that the Assassin’s Improved Invis is undispellable, that is false.  It absolutely may be dispelled, breached, or purged just like ordinary Improved Invis. I’m not sure where that myth started, but it may end here.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:38 PM - Dec 18, 2019",
      "content": "<div>Here are some ideas that may help even the score:<br/>\nGive assassins HIPS at level 8 (class level 3) and everybody wants to be an assassin!<br/>\nGive them the Dual wield and ITWF feats that the rangers get.<br/>\nGive them a real spell book with spells from lvl 1 to 4 and a useful spell selection.<br/>\nLet them handle locks and traps with a DC above 35 like rogues do.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "MentalDekay",
      "avatar": "10759116_1563898639.jpg",
      "timestamp": "5:53 PM - Dec 18, 2019",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote: <div class=\"responsive-hide\">Dec 18, 2019</div></cite>Here are some ideas that may help even the score:<br/>\nGive assassins HIPS at level 8 (class level 3) and everybody wants to be an assassin!<br/>\nGive them the Dual wield and ITWF feats that the rangers get.<br/>\nGive them a real spell book with spells from lvl 1 to 4 and a useful spell selection.<br/>\nLet them handle locks and traps with a DC above 35 like rogues do.</div></blockquote>\nThat sounds like an Arcane Trickster to me...something I wish was in the \"official\" NWN/EE. </div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "6:03 PM - Dec 18, 2019",
      "content": "<div>In my opinion vanilla Assassin is underwhelming in 1.69 and near useless in EE due to the Death Attack nerf. The only reason I would choose Assassin over Rogue is if there are custom changes to the class or for RP purposes like joining an assassin's guild.<br/>\nOn the server I play on assassins get bonus damage every 3 levels which is very useful since it bypasses DI/DR. On other servers I've played on in the past they receive more spells, have stealth bonuses, or get HiPS after a few levels.<br/>\nDeath Attack is countered by high fortitude saves, paralysis immunity, sneak immunity, or being in combat. Any opponent that has access to Freedom Of Movement or Freedom items can completely ignore the paralysis effect of Death Attack, and at that point you're better off being a Rogue.<br/>\n<br/>\nEven the builds mentioned here could be improved by switching to Rogue.<br/>\nChanging Monk38/Ass2 to Monk37/Rog3 gains 1d6 sneak attack, 12 skill points, Rogue proficiency with Disarm Trap, and removes the Lawful Evil alignment restriction at the cost of 2 HP and 1 SR.<br/>\nChanging Rang10/Ass30 to Rog29/Figh10/SD1 gives higher damage, Crippling Strike, Epic Dodge, and HiPS at the cost of 3 AB and Death Attack.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:10 PM - Dec 18, 2019",
      "content": "<div>Here's one thought: make it a full BAB class. Maybe making Dodge and/ or WFocus a prerequisite for the class, along with a minimum BAB entry requirement (surely simply being a miscreant who can hide a bit doesn't make one an assassin?).<br/>\n<br/>\nAgain, I'm just an amateur at the class...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "6:48 PM - Dec 18, 2019",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote: <div class=\"responsive-hide\">Dec 18, 2019</div></cite>Here are some ideas that may help even the score:<br/>\nGive assassins HIPS at level 8 (class level 3) and everybody wants to be an assassin!<br/>\nGive them the Dual wield and ITWF feats that the rangers get.<br/>\nGive them a real spell book with spells from lvl 1 to 4 and a useful spell selection.<br/>\nLet them handle locks and traps with a DC above 35 like rogues do.</div></blockquote>\nGive them an AB increase similar to Enhanced Arrow for AA's but it's automatic for whatever weapon they focus in.  To simulate their enhanced skill at hitting targets unseen.  So thats what?  +1 every 4 or 5 levels?</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:21 PM - Dec 18, 2019",
      "content": "<div>Changing Monk from 38 to 37 loses 2x SR!!<br/>\n<br/>\nNot acceptable for that build!!!!!<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:55 AM - Dec 19, 2019",
      "content": "<div>Thanks for the feedback on Assassin's Improved Invisibility's dispellability<br/>\n<br/>\nI think there are lots of things that could be implemented<br/>\nI think the most sensible 'buff' to the class is to improve its combat capabilities<br/>\nThis would be to distinguish it from rogue, a more 'combat' type rogue rather than skilled/versatile<br/>\n<br/>\nI think extra attack bonuses from stealth, against flatfooted/unaware, flanked or disabled opponents would be good<br/>\nI think Assassin could be a worthy candidate  to receive the Evasion feat<br/>\nMaybe d8 hit die would be appropriate if monks get d8 hit die<br/>\nAssassins should be allowed to be chaotic neutral I think<br/>\n<br/>\nPoison does need some buffs<br/>\nI don't think assassin should get HiPS , I think that feat is too powerful to give to the assassin toolkit and would make shadowdancer redundant</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:23 AM - Dec 19, 2019",
      "content": "<div>The Assassin is innately Evil and should stay so.<br/>\n<br/>\nPerhaps beginning Assassins are not; not until the first sanctioned murder. But certainly after that point they are.<br/>\n<br/>\nAssassins are Evil because they practice paid pre-meditated Murder. There is no way around this, and most insights into their training and acceptance into the trade requires that the murder - often it is a comrade, or even a friend.<br/>\n<br/>\nNow, many will try to \"spin this\" into being anything other than what it is - cold-blooded, First Degree Murder.<br/>\n<br/>\nThat makes the Assassin Evil.<br/>\n<br/>\nSo, with that, how can one make the Assassin better?<br/>\n<br/>\nMake his ability to murder better. I mean, we already have such powerful things as Dev Crit, HiPS, Epic Dodge, etc.<br/>\n<br/>\nI propose adding Murder Strike - which makes the Death Attack deadly again.<br/>\n<br/>\nJust like Dev Crit, it threatens death with the Death Attack, with the DC increasing with level of the Assassin.<br/>\n<br/>\nAt first the DC should be rather low - corresponding to Assassin being able to be taken at level 6.<br/>\n<br/>\nFrom there, it should increase.<br/>\n<br/>\nAs for the Spellbook, it should be like how the PRC did it (straight out of the PnP sourcebook itself) AND Assassin should allow one to qualify for any Arcane type requisite. <br/>\n<br/>\nI think that would put the Orestige Class back on the map.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "3:26 PM - Dec 19, 2019",
      "content": "<div>Regarding assassins being evil etc. I have no issues with people playing almost any class going beyond the boundaries of the alignment restrictions.  I feel that the classes available in NWN are the building blocks to achieve what one has in MIND, which often goes beyond the limitations of what game designers make. I bend their rules if I see fit and don't worry too much about. I don't do non allowed class combinations.<br/>\n<br/>\nThat said, Assassins HAVE to be evil? Nope.<br/>\nMy assassin only kills evil people. People who torture and kill for no reason. Paedophiles. Tyrants, etc.<br/>\nDoesn't sound necessarily evil in my book.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:39 PM - Dec 19, 2019",
      "content": "<div>But that is the point here - YOUR character isn't an Assassin, and hasn't had Assassin training.<br/>\n<br/>\nIn that sense, you can be any class and call yourself an Assassin.<br/>\n<br/>\nWe are talking about the Prestige Class Assassin here. One who has had the professional training, to learn the skills and abilities that this Prestige Class offers.<br/>\n<br/>\nIf you become an Assassin (Prestige Class) and take levels, then you have murdered purely in order to learn this classes skills and abilities.<br/>\n<br/>\nThat's evil with a big \"E\".<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "4:41 PM - Dec 19, 2019",
      "content": "<div>Wow, some great ideas and concepts.  Thank you everyone for humoring an old man.  Below is the table for the pre-epic Assassin.  Items in red are proposed additions.  In Epic there is no table to speak of unless everyone wants to see the Death Attack dice and Poison save progressions.  It's pretty static in epic, with a short list of epic bonus feats.  <br/>\n<table class=\"post_content_table\"><tbody><tr><td>1st</td>\n<td>+0</td>\n<td>+0</td>\n<td>+2</td>\n<td>+0</td>\n<td>use poison (<strong><span style=\"color:#cc0000\">Improve Poison Durations</span></strong>)</td>\n<td>3-6</td>\n<td>-</td>\n<td>1d6</td>\n</tr>\n<tr><td>2nd</td>\n<td>+1</td>\n<td>+0</td>\n<td>+3</td>\n<td>+0</td>\n<td>ghostly visage, uncanny dodge I, poison save  </td>\n<td>6-12</td>\n<td>+1</td>\n<td>1d6</td>\n</tr>\n<tr><td>3rd</td>\n<td>+2</td>\n<td>+1</td>\n<td>+3</td>\n<td>+1</td>\n<td></td>\n<td>9-18</td>\n<td>+1</td>\n<td>2d6</td>\n</tr>\n<tr><td>4th</td>\n<td>+3</td>\n<td>+1</td>\n<td>+4</td>\n<td>+1</td>\n<td><strong><span style=\"color:#cc0000\">Stealthy (+2 Hide/+2 Move Silently)</span></strong></td>\n<td>12-24</td>\n<td>+2</td>\n<td>2d6</td>\n</tr>\n<tr><td>5th</td>\n<td>+3</td>\n<td>+1</td>\n<td>+4</td>\n<td>+1</td>\n<td>darkness<span style=\"color:#cc0000\">*</span>, uncanny dodge II</td>\n<td>15-30</td>\n<td>+2</td>\n<td>3d6</td>\n</tr>\n<tr><td>6th</td>\n<td>+4</td>\n<td>+2</td>\n<td>+5</td>\n<td>+2</td>\n<td><strong><span style=\"color:#cc0000\">Ultravision 1/day</span></strong></td>\n<td>18-36</td>\n<td>+3</td>\n<td>3d6</td>\n</tr>\n<tr><td>7th</td>\n<td>+5</td>\n<td>+2</td>\n<td>+5</td>\n<td>+2</td>\n<td>invisibility 1/day<span style=\"color:#cc0000\">*</span></td>\n<td>21-42</td>\n<td>+3</td>\n<td>4d6</td>\n</tr>\n<tr><td>8th</td>\n<td>+6</td>\n<td>+2</td>\n<td>+6</td>\n<td>+2</td>\n<td></td>\n<td>24-48</td>\n<td>+4</td>\n<td>4d6</td>\n</tr>\n<tr><td>9th</td>\n<td>+6</td>\n<td>+3</td>\n<td>+6</td>\n<td>+3</td>\n<td>improved invisibility 1/day<span style=\"color:#cc0000\">*</span></td>\n<td>27-54</td>\n<td>+4</td>\n<td>5d6</td>\n</tr>\n<tr><td>10th  </td>\n<td>+7</td>\n<td>+3</td>\n<td>+7</td>\n<td>+3</td>\n<td>uncanny dodge III, </td>\n<td>30-60</td>\n<td>+5</td>\n<td>5d6</td>\n</tr>\n</tbody></table>\n <br/>\n1.       Darkness uses per day increase by every 4 levels beyond 6th.  So a 10<sup>th</sup> level Assassin would have 2/day, a 14<sup>th</sup> 3/day, etc.<br/>\n <br/>\n2.       Stealthy added as bonus feat at 4<sup>th</sup> level.  <br/>\n <br/>\n3.       Invis uses increase every 4 levels as well beyond 10<sup>th</sup> level.  An 18<sup>th</sup> level Assassin would have 3 per day<br/>\n <br/>\n4.       Improved Invis Uses increase every 5 levels beyond 10, to a maximum of 5 total at Level 30 Assassin<br/>\n <br/>\n5.       Epic Prowess can be an Assassin Bonus Feat<br/>\n<br/>\n<br/>\nOkay, so I took everybody’s suggestions into consideration.  Some of them were rather good, I just don’t know how hard it would be to manipulate the mechanics.  So, rather than make Assassins like Rogues (because <em>we do want them to be different</em>, and we don’t want to diminish the genius of the Rogue), or grant Assassins SD qualities (I agree with Orion in that HiPS should be a trademark for the SD class), or grant them more of a melee presence, I’ve elected to enhance the things they were already good at.<br/>\n <br/>\nSomeone mentioned Poisons.  Check!  Increase durations.  Some PWs do this.  I think WoG use to, not sure if they still do.<br/>\n <br/>\nAt 4<sup>th</sup> level, the Assassin gains an Assassin Bonus Feat: Stealthy.  I thought this was a fair compromise, and in keeping with the Assassin mythos of dark art training. <br/>\n <br/>\nAt 6<sup>th</sup> level, the Assassin, forever training in the Dark Arts, acquires the ability to cast Ultravision.  I’m not sure how hard it would be to add this as a Feat in the game.  Obviously we’re talking haks at this point.  Caster level equal to Assassin Level (like it is for their other Spell Abilities.<br/>\n <br/>\nNext, we increase Darkness, Invis, and Improved Invis uses.<br/>\n <br/>\nAllow Epic Prowess to be selected as an Assassin Bonus Feat.<br/>\n <br/>\nI do like the Murder Strike concept.  Maybe as a unique bonus feat?  That would require some engineering.  That can be a backburner project.<br/>\n <br/>\nThere.  That still keeps them uniquely Assassin.  It’s reasonable, it’s not OP, while still giving them unique advantages over their Rogue counterpart.  It doesn’t come across as unbalancing (unless maybe in a low-magic world, and then what classes aren’t unbalances in a low-magic world?) <br/>\n <br/>\nNow, who wants to be the one to propose this to Beamdog?  And if that fails, your admins on your favorite PW?</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:49 PM - Dec 19, 2019",
      "content": "<div>I like it.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:14 PM - Dec 19, 2019",
      "content": "<div>I would add: Reverse the death attack nerf.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "3:45 AM - Dec 20, 2019",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Dec 19, 2019</div></cite>But that is the point here - YOUR character isn't an Assassin, and hasn't had Assassin training.<br/>\n<br/>\nIn that sense, you can be any class and call yourself an Assassin.<br/>\n<br/>\nWe are talking about the Prestige Class Assassin here. One who has had the professional training, to learn the skills and abilities that this Prestige Class offers.<br/>\n<br/>\nIf you become an Assassin (Prestige Class) and take levels, then you have murdered purely in order to learn this classes skills and abilities.<br/>\n<br/>\nThat's evil with a big \"E\".<br/>\n<br/>\nSent from my SM-G955F using Tapatalk</div></blockquote>\nThe description of Assassin class on the wikipedia does not state as a pre requisite for being an assassin as \"murder\". Part of it does say that one needs a complete lack of morals etc...<br/>\n<br/>\n\"<strong>Description</strong>: (PRESTIGE CLASS) The assassin is a master of dealing quick, lethal blows. Assassins often function as spies, informants, killers for hire, or agents of vengeance. Their skill in a variety of dark arts allows them to carry out missions of death with shocking, terrifying precision. Unlike the blackguard, the assassin is not evil due to devotion to an evil power, but rather due to a complete lack of morals or ethics.\"<br/>\n<br/>\nLack of morals and ethics doesn't exclude murder, nor does it mandate it...<br/>\nI can picture lots of scenarios where one is trained in these dark arts, but doesn't necessarily kill anyone that doesn't deserve a good killing...<br/>\n<br/>\n<br/>\nThis type of arguments have been going on forever...you play your way, I'll play my way.<br/>\n<br/>\n<br/>\nAncient Dwarflord...I love your ideas for tweaking the Assassin class. In case you need to know, the durations certainly ARE extended on WoG.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:06 AM - Dec 21, 2019",
      "content": "<div>I think Grizzled_Dwarflord's balance suggestions are nice, they don't seem overpowered, and seem unlikely to me to upset players, so it might be something Beamdog might be interested in implementing if posted into their Trello suggestion website</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:24 PM - Dec 22, 2019",
      "content": "<div><blockquote><div><cite>gkorjax wrote: <div class=\"responsive-hide\">Dec 20, 2019</div></cite>The description of Assassin class on the wikipedia does not state as a pre requisite for being an assassin as \"murder\". Part of it does say that one needs a complete lack of morals etc...<br/>\n<br/>\n\"<strong>Description</strong>: (PRESTIGE CLASS) The assassin is a master of dealing quick, lethal blows. Assassins often function as spies, informants, killers for hire, or agents of vengeance. Their skill in a variety of dark arts allows them to carry out missions of death with shocking, terrifying precision. Unlike the blackguard, the assassin is not evil due to devotion to an evil power, but rather due to a complete lack of morals or ethics.\"<br/>\n<br/>\nLack of morals and ethics doesn't exclude murder, nor does it mandate it...<br/>\nI can picture lots of scenarios where one is trained in these dark arts, but doesn't necessarily kill anyone that doesn't deserve a good killing...<br/>\n<br/>\n<br/>\nThis type of arguments have been going on forever...you play your way, I'll play my way.<br/>\n<br/>\n</div></blockquote>\nThe Wikipedia is not the official source material.<br/>\n<br/>\nYou should know better than to use that sort of material over the original source(s).<br/>\n<br/>\nAssassin<br/>\n<br/>\nBlackmoor<br/>\n<br/>\n Under special circumstances and in large campaigns it is possible to allow the <br/>\ncharacter of the assassin. Only humans will become assassins. <br/>\n<br/>\nAssassins are always neutral. <br/>\n<br/>\nThe Original Ruleset only had 3 alignments - Lawful , implying honor and respect for society's rules; Chaotic, implying rebelliousness and individualism; Neutral, seeking a balance between the extremes.<br/>\n<br/>\nThe prime requisites of the assassin are dexterity (minimum of 12 or better) and strength <br/>\n(minimum of 12 or better) and intelligence (minimum of 12 or better). <br/>\n<br/>\n<strong>All assassins are part of the Assassins’ Guild. </strong><br/>\n<br/>\nBesides performing their evident role they may also serve as thieves, <br/>\nalthough their ability is two levels less than that of an actual thief of the same level. They are <br/>\nlimited to the wearing of leather armor, but they may use shields as well as any weaponry they <br/>\nchoose (including magical weapons of any sort).<br/>\nAssassins may have no followers until they attain the rank of Guildmaster. They may have no <br/>\nmore hirelings than their charisma score indicates for the number of followers another charac￾ter type may have. As Guildmaster they may have up to 50 “followers” (members of the Guild), <br/>\nbut such followers must be hired at 1st level and worked up.<br/>\nMagic: Assassins function as regards to thieves in all regards with respect to magic except <br/>\nfor weaponry.<br/>\n<br/>\nDisguise: Assassins are masters of disguise. They are able to assume the dress and manners <br/>\nof other classes, or even pose as someone of the opposite sex. There is only a 5% chance that <br/>\nan assassin will be recognized when in disguise, 10% if the assassin is posing as a member <br/>\nof the opposite sex. Disguise checks should be made daily. Modify the chance downward by <br/>\n1% for each 1 point in combined intelligence and wisdom below 20 which the intended victim <br/>\nhas, i.e. a victim with a combined intelligence/wisdom score of 18 has only a 3% chance of <br/>\ndetecting the assassin. For every combined intelligence/wisdom point above 24 the intended <br/>\nvictim has a ½% better chance of detecting the disguise, dropping all fractions, so an intended <br/>\nvictim with an intelligence/wisdom score of 31 has an 8% chance of spotting the assassin (31 <br/>\n— 24 = 7 × ½% = 3½% = 3% with dropped fraction of ½%).<br/>\n<br/>\nLanguages: Assassins with an intelligence of 16 or more are able to speak one additional <br/>\nalignment language (Law or Chaos), and if the assassin has an 18 or better intelligence both <br/>\nother alignment languages may be spoken; i.e. if Neutral, can learn Lawful and Chaotic.<br/>\nPoison: An assassin may freely use poisoned weapons, but there is a 50% chance each turn <br/>\nsuch a weapon is displayed that any person in viewing range of it (10’ or less) will recognise <br/>\nthe poisoned item and react with ferocity, i.e. attack with a +4 chance of hitting and +4 <br/>\npoints of damage when hitting occurs. If a poison substance is insinuated into food or drink it is <br/>\ngenerally assumed that the assassin must create the opportunity to perform this action — either <br/>\nthrough proximity to the item by means of employment or through disguise. This area must <br/>\nbe handled by the referee. <br/>\n<br/>\nDetails of poison types will be handled in some future supplement <br/>\nwhen alchemists are fully covered.<br/>\n<br/>\nCost: The cost per mission as shown in Book III of DUNGEONS &amp; DRAGONS is based upon <br/>\nthe hiring of a 6th-level assassin (Dacoit). Reduce this amount for the fee payable to a lower level assassin by 250 gold pieces for each level below 6th; double the fee for every level above <br/>\n6th, i.e. a 7th-level assassin costs 4,000 gold pieces, an 8th-level 8,000, a 9th-level 16,000, <br/>\na 10th-level 32,000, an 11th-level 64,000, a 12th-level 128,000, a 13th-level at 256,000, <br/>\nand the Guildmaster will work for no less than 512,000 gold pieces per assassination. 10% of <br/>\nthe fee for any assassination goes to the Guildmaster, all if he performs the mission personally.<br/>\nExperience: Besides gaining experience in the normal way, assassins also gain experience <br/>\nfor successful assassinations; thus, if a fee is paid and the mission completed the assassin gains <br/>\nexperience equal to 90% of the gold pieces paid, plus the experience points for the level of the <br/>\nassassinated victim, adjusted for the level of the assassin. [Use Exp. Points for Killing Monsters <br/>\ntable, calculating on hit die. Ex. — 4th-level assassin kills 5th-level M.U. — base value 175 <br/>\npoints + 125 points × 2 for special ability. Assassin gain 425 points × 5/4 = 551 points.]<br/>\n<br/>\nGuildmaster: Any 12th-level assassin (Prime Assassin) may challenge the Guildmaster of the <br/>\nAssassins’ Guild to a duel to the death, and if the former is victorious he becomes Guildmaster. <br/>\nThe Guildmaster may build a stronghold or control a “Barony.”<br/>\n<br/>\nLEVELS AND NUMBER OF EXPERIENCE POINTS NECESSARY TO ATTAIN THEM:<br/>\n<br/>\nAssassins Level Progression<br/>\n<br/>\nApprentice 0<br/>\nKiller 1,500<br/>\nMurderer 3,000<br/>\nSlayer 6,000<br/>\nCutthroat 12,000<br/>\nDacoit 24,000<br/>\nThug 48,000<br/>\nExecutioner 100,000<br/>\nAssassin 175,000<br/>\n Senior Assassin 275,000<br/>\nExpert Assassin 400,000<br/>\nChief Assassin 550,000<br/>\nPrime Assassin 750,000<br/>\nGuildmaster of Assassins — 1,750,000<br/>\n<br/>\nThere is no actual level above Prime Assassin, although there is power attained <br/>\nwith the rank of Guildmaster. A character cannot be Guildmaster of more than one Assassins’ <br/>\nGuild. There is only one Assassins’ Guild allowable in any one locale (large city or area of <br/>\nabout 2,500 square miles).<br/>\n<br/>\nThe Assassin has a chance to Assassinate (outright kill) according to level, given on a table.<br/>\n<br/>\nBase chance for successful assassination will be dependent upon the level of the assassin and the <br/>\nvictim — the referee will make any further adjustments necessary to particular case circumstances.<br/>\n<br/>\n1st Edition<br/>\n<br/>\nAssassins are a sub-class of the thieves, and they hove the functions of the <br/>\nlatter as well as their own. Thus, to be an assassin, a character must hove a <br/>\nminimum strength of 12, an intelligence of I I or more, and o dexterity <br/>\nscore of not less than 12. Assassins do not gain any experience bonuses for <br/>\nhaving high ability scores. <br/>\n<br/>\nJust as do thieves, assassins have six-sided dice (d6) for determining the <br/>\nnumber of hit points (q.v.) they can sustain. Assossinsore evil in alignment <br/>\n(perforce, as the killing of humans and other intelligent life forms for the <br/>\npurpose of profit is basically held to be the antithesis of weal). They con, of <br/>\ncourse, be neutral as regards lawful and chaotic evil. As mentioned above, <br/>\nassassins have thieving capabilities and their own ability functions. <br/>\nBecause they can use any sort of shield and weapon, they are generally <br/>\nsuperior to thieves in combat.<br/>\n<br/>\nAn assassin character need not be a member of the Assassins Guild of the <br/>\ntown or city he or she dwells in, but all non-player assassin characters are <br/>\nmembers of such guilds. There is one such guild in most towns and cities, <br/>\nand each controls an area of from 10 to 100 miles radius around the <br/>\nheadquarters town or city. <br/>\n<br/>\n<strong>Any assassin discovered in a guild area who is <br/>\nnot a member of the local Assassins Guild will be invited to join, thus <br/>\ncoming under the authority and command of the Guildmaster Assassin. <br/>\nThe assassin character need not join, but he or she will be under sentence <br/>\nof death if the character performs on assassination while not a guild <br/>\nmember.</strong> <br/>\n<br/>\nFurther discussion of Assassins' Guilds is given later. <br/>\n<br/>\n<strong>The primary function of assassins is killing. </strong><br/>\n<br/>\nThey may use poison - <br/>\ningested or insinuated by weapon. Poison ingested must be put into the <br/>\nfood or drink, and the character performing this action must detail exactly <br/>\nwhen, where, and how the poisoning will be done. The DM will then <br/>\nadjudicate the action. Poisoned weapons (see POISON) used run the risk <br/>\nof being noticed by others. All non-assassins within 10' of the bared <br/>\nweapon have a 10% cumulative chance each per melee round (q.v.) of <br/>\nnoting the poison and attacking the poison-using assassin and/or calling <br/>\nfor the city watch. (There is a 20% chance for attacking the assassin, a 50% <br/>\nchance for calling for the watch, and a 30% chance for shouting for the <br/>\nwatch and then attacking the assassin.)<br/>\n<br/>\nExample: An assassin draws a dagger with a poisoned blade. The first <br/>\nmelee round it can be seen by two persons. The percentile dice are rolled <br/>\nfor each, but unless 10 or less is rolled, they do not notice the venom. The <br/>\nnext melee round the two first seeing the weapon have a 20% chance of <br/>\nnoticing the poison, and any others seeing it for the first time have but a <br/>\n1OOh chance. If ony onlooker does see the poison, percentile dice are <br/>\nrolled: a score of 01 to 20 indicates attack, 21 to 70 indicates a hue and cry <br/>\nfor the watch, and 71-00 indicates both.<br/>\n<br/>\nAssassins attack on the same combat tables as thieves do, including back <br/>\nstabbing. However, if they surprise (q.v.) a victim, they may attack on the <br/>\nASSASSINATION TABLE. This gives a roughly 50% chance of immediately <br/>\nkilling the victim; and if this fails, normal damage according to weapon <br/>\ntype and strength ability modifiers still accrues to the victim. Thus, if a <br/>\npoisoned weapon is used, the victim must also make the saving throw <br/>\nversus poison or die. The assassin decides which attack mode he or she <br/>\nwill use: assassination, back stabbing, or normal melee combat. <br/>\nPrimary abilities of assassins which enhance their function are those of <br/>\nbeing able to speak alignment languages and being able to disguise, as <br/>\nfollows: <br/>\n1. Assassins with intelligence of 15 or more are able to learn an <br/>\nalignment tongue (even those special languages of druids and <br/>\nthieves). This ability is gained at 9th level (Assassin) and <br/>\nwith each advance in experience level thereafter. The <br/>\nmoximum number of alignment languages which can be <br/>\nspoken by an assassin is four - one for each point of <br/>\nintelligence above 14, i.e. one at 15, two at 16, three ot 17, and <br/>\nfour at 18 intelligence. <br/>\n<br/>\nThe assassin may select from the following languages: <br/>\n<br/>\nCHAOTIC EVIL NEUTRAL EVIL <br/>\nCHAOTIC GOOD NEUTRAL GOOD <br/>\nCHAOTIC NEUTRALITY NEUTRALITY <br/>\nLAWFUL EVIL DRUIDIC <br/>\nLAWFUL GOOD THIEVES CANT <br/>\nLAWFUL NEUTRALITY<br/>\n<br/>\n2. Disguise can be donned in order to gain the opportunity to <br/>\npoison or surprise a victim - or for other reasons. The assassin <br/>\ncan disguise himself or herself so as to appear to be a human, <br/>\nsemi-human, or humanoid creature of either sex. Disguise can <br/>\nlower height by two or three inches, or raise it by up to four or <br/>\nfive inches. It can make the assassin look slimmer or appear <br/>\nmuch heavier. Disguise can make the assassin appear to be <br/>\nvirtually any class of character, a simple pilgrim, a merchant, <br/>\netc. There is a chance, however, that the victim, or one of his <br/>\nor her henchmen or guards, will notice the disguise. There is a <br/>\nbase chance of 2% per day of a disguised assassin being <br/>\nspotted. This chance goes upwards by 2% if the assassin is <br/>\nposing as another class, another race, and/or the opposite sex <br/>\n(maximum of 8% chance). Each concerned party (victim, <br/>\nhenchmen, bodyguards) in proximity to the assassin will be <br/>\nchecked for, immediately upon meeting the disguised assassin <br/>\nand each 24 hour period thereafter. The chance for spotting a <br/>\ndisguised assassin goes downward by 1% for each point below <br/>\n24 of combined intelligence and wisdom of the observer <br/>\nconcerned, i.e. a victim with an intelligence and wisdom <br/>\ncombined total of 20 has reduced his or her chances of <br/>\nspotting the disguised assassin by 4%. The reverse is also true; <br/>\nintelligence and wisdom above a combined total of 30 <br/>\nincrease the chance of detection by 1% per point. Note: True <br/>\nseeing or a wand of enemy detection will discover an <br/>\nassassin, as will detect evil, or know olignment in some cases. <br/>\n<br/>\nThe secondary function of the assassin is spying. This mission can be <br/>\ncoupled with the stealing of some item. <br/>\n<br/>\nTertiary functions of assassins are the same as thieves. They have all <br/>\nabilities and functions of thieves; but, except for back stabbing, assassins <br/>\nperform thieving at two levels below their assassin level, i.e. a 3rd level <br/>\nassossin has the thieving abilities of a 1st level thief, a 4th level assassin <br/>\nthe abilities of a 2nd level thief, etc. <br/>\n<br/>\nPerforming an assassination will gain experience points for the character <br/>\n-awarded for both the fee paid and the level of the victim. These awards <br/>\nare determined by the referee on the basis of a formula given in <br/>\nADVANCED DUNGEONS I DRAGONS, DUNGEON MASTERS GUIDE. <br/>\nAn assassin character cannot have any hirelings until he or she attains 4th <br/>\nlevel; at that time lower level assassins may be taken into service. Upon <br/>\nattaining 8th level, the character may also include thieves amongst his or <br/>\nher hirelings. Upon attaining 12th level, the character may hire any class <br/>\ndesired. Of course, only neutral or evil characters will serve an assassin. <br/>\nThe total number of henchmen is that dictated by the character's charisma <br/>\nscore. \"Followers\" are also possible, but these come only at the two <br/>\nuppermost levels of the assassin class. <br/>\n<br/>\nIn order for an assassin character to gain experience levels above the 13th <br/>\n(Prime Assassin), he or she must have the requisite experience paints and <br/>\nthen either assassinate the local Guildmaster Assassin (14th level) or <br/>\nchallenge him or her to a duel to the death. likewise, a 14th level player <br/>\ncharacter assassin can journey to the place where the Grandfather of <br/>\nAssassins (15th level) has his or her headquarters and slay him or her by <br/>\nassassination or in a duel. Note that duplicity, trickery, ambush, and all <br/>\nforms of treachery are considered as fair by assassins. A higher level <br/>\ncharacter can accept a challenge and then have the challenger slain by <br/>\narchers, for instance. <br/>\n<br/>\nAs Guildmaster (or Guildmistress) Assassin, a character will have a body of <br/>\nguild members which numbers between 7-28. Upon change of leadership <br/>\nit is 75% likely that each guild member will leave the area. Thus, it will be <br/>\nnecessary far the new Guildmaster to allow new members into the guild. <br/>\nThese new assassins will all be 1st level and must be worked up in <br/>\nexperience levels. The maximum number of such \"followers\" of the local <br/>\nguild will be set by your referee. They are in addition to normal <br/>\nhenchmen. Note that guild membersare loyal only to strength, power, and <br/>\nprofit. <br/>\n<br/>\nThe headquarters of a guild is always within a large town or big city. It <br/>\nmust not be a noticeable fortress or an ostentatious place. It is typically a <br/>\nworehouse or other nondescript structure, with safeguards and traps <br/>\nodded. This avoids attention and unwanted notoriety. All expenses of <br/>\nmaintoining the guild and its members - excluding the Guildmaster - <br/>\nare assumed to be fully paid for by normal guild activities. Any <br/>\nimprovements, changes, the expenses of the leader, and all other special <br/>\ncosts must be borne by the Guildmaster Assassin. <br/>\n<br/>\nThe headquarters of the Grandfather of Assassins can be virtually <br/>\nanywhere and of any form - cavern, castle, monastery, palace, temple, <br/>\nyou name it. However, if it is a large and obvious place, the headquarters <br/>\nmust be located well away from all communities - such as in the midst of <br/>\na murky woods, a dismal marsh or fen, o lonely moor, o deserted island, Q <br/>\nremote coast, or far into forsaken hills or atop a mountain. Upon attaining <br/>\nthe headship of all assassins, the new Grandfather or Grandmother must <br/>\npay all remaining followers of the former head 1000 gold pieces for each <br/>\nof their experience levels, destroy the old headquarters, and construct a <br/>\nnew one somewhere else.<br/>\n<br/>\n2nd Edition<br/>\n<br/>\n In any reasonably corrupt culture, there are those who wish <br/>\nto eliminate someone whose very existence stands in the way of their plans. To <br/>\nserve them there are <strong> Assassins: trained killers whose services are for hire. </strong><br/>\n<br/>\nIn the AD&amp;D@ 2nd Edition Players’Handbook, the idea of an assassin, a hired killer, has been divorced from <br/>\nany particular character class. Indeed,a character can be any class and still be an assassin: this thief kit simply shows <br/>\nhow a thief can be converted into an efficient, discreet killer. Characters of other classes still can (and often will) be <br/>\nassassins, so it would be best not to let down one’s guard. <br/>\n<br/>\nAssassins must have the following minimum ability scores: Strength 12 Dexterity 12, and Intelligence 11. <br/>\n<br/>\nRole. <br/>\n<br/>\nThugs and Bounty Hunters may be seen as close relatives of the Assassin. It is important, then, to understand their differences, and what makes their roles distinct. Thugs typically serve as crude muscle. using bullying and intimidation. The Assassin, on the other hand, thrives on anonymity, on surprise-on his victim not even realizing that he is a target until it is much too late. A clever Assassin might never be seen by his victim. Here, too, the Assassin differs from the Bounty Hunter, for the hunter often seeks his quarry alive, and typically must bring back his prey (or the corpse thereof) as proof of his project’s success. <br/>\n<br/>\n<strong>Most Assassins are of evil alignment. <br/>\n<br/>\nHowever, it is conceivable that one <br/>\nmight be of a neutral (but not good) <br/>\nalignment. <br/>\n<br/>\nPlayer character Assassins, if they are permitted in the campaign, best fit this rare neutral description. </strong><br/>\n<br/>\nA PC might be the agent of some monarch, paid to arrange the discreet demise of those who threaten the kingdom‘s safety. While this certainly is not good (in the moral sense), the character might regard it as a justifiable evil because of the deaths the action prevents by obstructing rebellion, invasion, or whatever. <br/>\n<br/>\nMany Assassin thieves belong to guilds. The guilds use them to serve <br/>\ntheir own needs, and act as an intermediary for outsiders who wish to take <br/>\nout a contract on someone‘s life. <br/>\n<br/>\nSecondary Skills: Any. <br/>\n<br/>\nWeapon Proficiencies: Because of their <br/>\nspecialization in the art of killing, Assassins, unlike thieves of other kits, are permitted the use of any weapon. An Assassin often selects one favored weapon, such as a garotte or serrated dagger (or even something exotic, such as blowgun darts with an exotic insea poison <br/>\nfrom a distant jungle), to use for his killings. If the Assassin achieves infamy, the <br/>\nmarks of this weapon may become known as a sort of ”calling card:’<br/>\n <br/>\nNonweapon Proficiencies: Required: <br/>\nTrailing, Disguise. Recommended: Alertness, Be&amp;, -- Information Gather<br/>\ning, Herbalism, Land-Based Riding, <br/>\nObservation, Tracking, Voice Mimicry.<br/>\n <br/>\nSkill Progression: Assassins favor the skills of move silently, hide in <br/>\nshadows, detect noise and climb walls.<br/>\n <br/>\nThey also make occasional use of the <br/>\npick pockets skill-not for lifting purses, but for similarly delicate tasks, <br/>\nsuch as slipping poison unnoticed into a target’s goblet of wine.<br/>\n <br/>\nEquipment: Assassins are familiar with and make frequent use of a wide <br/>\narray of deadly devices. See Chapter 5 (page 90) for details on all sorts of special items, such as blade boots, death knives, folding bows, and so forth. <br/>\n<br/>\nEquipment to help their preferred skills (see ”Skill Progression” above), such as <br/>\nclawed shoes and gloves and camouflaged clothing, is also popular. <br/>\n<br/>\nIf the DM permits, poison is also available and frequently used by the <br/>\nAssassin. The Assassin may purchase poison (expensive and usually illegal), <br/>\nor attempt to manufacture or extract it himself (which can be dangerous as <br/>\nwell; see the special section on poison in Chapter 7 for more information).<br/>\n <br/>\nSpecial Benefits: Because of their training and experience with the use of <br/>\npoisons, Assassins also can identify poisons used by others. The base <br/>\nchance of doing so is the Assassin’s level multiplied by 5%. <br/>\nAssassins with intelligence of 13-15 get a +5% bonus on the attempt; 16- <br/>\n17, a +IO% bonus; and 18, +15%. <br/>\n<br/>\nFurther adjustments depend on how the Assassin attempts the identification: <br/>\nsight, smell, taste, or symptoms. Sight means examination of the poison or poisoned article. Many poisons have a distinctive appearance, or they may have a corrosive or discoloring effect on metals, foods, etc. Identification by sight has a -20% modifier. Its advantage is that the Assassin needn’t worry about poisoning himself in the process.<br/>\n <br/>\nA poison may also be identified by its odor. This carries a - 15 % penalty. Furthermore, if it is an ingested or contact poison, there is a 10% chance that the Assassin will be affected by the poison.<br/>\n<br/>\nThe DM may wish to forbid elven, gnome and halfling Assassins, however, since this profession is quite antithetical to their cultures<br/>\n<br/>\n<br/>\n3rd Edition<br/>\n<br/>\nThe assassin is the master of dealing quick, lethal blows. Assassins also excel at infiltration and disguise. Assassins often function as spies, informants, killers for hire, or agents of vengeance. Their training in anatomy, stealth, poison, and the dark arts allows them to carry out missions of death with shocking, terrifying precision.<br/>\n<br/>\nRogues, monks, and bardic assassins make for the classic skulking assassin in the shadows with a blade carrying certain death. Fighters, ex-paladins, rangers, druids, and barbarians operate as warrior assassins, with as much ability to kill as an assassin in combat as from the shadows. Sorcerers, wizards, and clerics may be the most terrifying assassins of all, for with their spells they can infiltrate and slay with even greater impunity. <br/>\n<br/>\nAs NPCs, assassins work in guilds or secret societies found hidden in cities or based in remote fortresses in the wilderness.<br/>\n<br/>\nSometimes they serve more powerful evil characters singly or in a group. Occasionally an assassin works alone, but only the most capable are willing to operate without any sort of support or backup.<br/>\n<br/>\nHit Die: d6.<br/>\n<br/>\nRequirements <br/>\n<br/>\nTo qualify to become an assassin, a character must fulfill all the following criteria.<br/>\n<br/>\nAlignment: Any evil.<br/>\n<br/>\nMove Silently: 8 ranks.<br/>\n<br/>\nHide: 8 ranks.<br/>\n<br/>\nDisguise: 4 ranks.<br/>\n<br/>\n<strong>Special: In addition, he must kill someone for no other reason than to join<br/>\nthe assassins.</strong><br/>\n<br/>\nClass Skills<br/>\n<br/>\nThe assassin's class skills (and the key ability for each skill) are Balance<br/>\n(Dex), Bluff (Cha), Climb (Str),<br/>\nCraft (Int), Decipher Script (Int, exclusive skill), Diplomacy (Cha),<br/>\nDisable Device (Int), Disguise (Cha), Escape Artist (Dex), Forgery<br/>\n(Int), Gather Information (Cha), Hide (Dex), Innuendo (Wis),<br/>\nIntimidate (Cha), Intuit Direction (Wis), Jump (Str), Listen (Wis),<br/>\nMove Silently (Dex), Open Lock (Dex), Pick Pocket (Dex), Read<br/>\nLips (Int, exclusive skill), Search (Int), Sense Motive (Wis), Spot<br/>\n(Wis), Swim (Str), Tumble (Dex), Use Magic Device (Cha, exclusive<br/>\nskill), and Use Rope (Dex). <br/>\n<br/>\nSee Chapter 4: Skills in the Player's Handbook for skill descriptions.<br/>\n<br/>\nSkill Points at Each Level: 4 + Int modifier.<br/>\n<br/>\nClass Features<br/>\n<br/>\nAll of the following are class features of the assassin prestige class.<br/>\n<br/>\nWeapon and Armor Proficiency: An assassin's weapon training focuses on weapons suitable for<br/>\nstealth and sneak attacks. Assassins are proficient with the crossbow (hand, light, or heavy), dagger (any type), dart, rapier, sap, shortbow (normal and composite), and short sword.<br/>\n<br/>\nAssassins are proficient with light armor but not with shields.<br/>\n<br/>\nNote that armor check penalties for armor heavier than leather apply to thes kills Balance, Climb, Escape<br/>\nArtist, Hide, Jump, Move Silently, Pick Pocket, and Tumble, and that carrying heavy gear imposes a<br/>\ncheck penalty on Swim checks.<br/>\n<br/>\nSneak Attack: If an assassin can catch an opponent when she is unable to defend herself effectively from his attack, he can strike a vital spot for extra damage.<br/>\n<br/>\nBasically, any time the assassin's target would be denied her Dexterity bonus to AC (whether she actually has a Dexterity bonus or not), the assassin's attack deals +1d6 points of damage, This extra damage increases by<br/>\n+1d6 points every other level (+2d6 at 3rd level, +3d6 at 5th level, and so on).<br/>\n<br/>\nShould the assassin score a critical hit with a sneak attack, this extra damage is not multiplied. <br/>\n<br/>\nIt takes precision and penetration to hit a vital spot, so ranged attacks can only count as sneak attacks if the target is 30 feet away or less.<br/>\n<br/>\nWith a sap or an unarmed strike, the assassin can make a sneak attack that deals subdual damage instead of normal damage. He cannot use a weapon that deals normal damage to deal subdual damage in a sneak attack, not even with the usual -4 penalty, because he must make optimal use of his weapon in order to execute the sneakattack.<br/>\n<br/>\nAn assassin can only sneak attack living creatures with discernible anatomies—undead, constructs, oozes, plants, and incorporeal creatures lack vital areas to attack. Additionally, any creature immune to critical hits is similarly immune to sneak attacks. Also, the assassin must also be able to see the target well enough to pick out a vital spot and must be able to reach a vital spot. <br/>\n<br/>\nThe assassin cannot sneak attack while striking at a creature with concealment or by striking the limbs of a creature whose vitals are beyond reach. If an assassin gets a sneak attack bonus from another source (such as rogue levels), the bonuses to damage stack.<br/>\n<br/>\nDeath Attack: If the assassin studies his victim for 3 rounds and then makes a sneak attack with a melee weapon that successfully deals damage, the sneak attack has the additional effect of possibly either paralyzing or killing the target (assassin's choice). While studying the victim, the assassin can undertake other actions so long as his attention stays focused on the target and the target does not detect the assassin or recognize the assassin as an enemy. If the<br/>\nvictim of such an attack fails her Fortitude saving throw (DC 10 + the assassin's class level + Intelligence modifier) against the kill effect, she dies. <br/>\n<br/>\nIf the saving throw fails against the paralysis effect, the victim's mind and body become enervated, rendering her completely helpless and unable to act for ld6 rounds plus 1 round per level of the assassin. If the victim's saving throw succeeds, the attack is just a normal sneak attack. <br/>\n<br/>\nOnce the assassin has completed the 3 rounds of study, he must make the death attack within<br/>\nthe next 3 rounds. If a death attack is attempted and fails (the victim makes her save) or if the assassin does not launch the attack within 3 rounds of completing the study, 3 new rounds of study are required before he can attempt another death attack.<br/>\n<br/>\nPoison Use: Assassins are trained in the use of poison and never risk accidentally poisoning themselves when applying poison to a blade.<br/>\n<br/>\nSpells: Beginning at 1st level, an assassin gains the ability to cast a small number of arcane spells. <br/>\n<br/>\nTo cast a spell, the assassin must have an Intelligence score of at least 10 + the spell's level, so an assassin with an Intelligence of 10 or lower cannot cast these spells.<br/>\n<br/>\nAssassin bonus spells are based on Intelligence, and saving throws against these spells have a DC of 10 + spell level + the assassin's Intelligence modifier (if any). When the assassin gets 0 spells of a given level, such as 0 1st-level spells at 1st level, the assassin gets<br/>\nonly bonus spells. <br/>\n<br/>\nAn assassin without a bonus spell for that level cannot yet cast a spell of that level. <br/>\n<br/>\nThe assassin's spell list appears below. An assassin prepares and casts spells just as a wizard does.<br/>\n<br/>\nSaving Throw Bonus vs. Poison: Assassins train with poisons of all types and slowly grow more and more resistant to their effects. This is reflected by a natural saving throw bonus to all poisons gained at 2nd level that increases by +1 for every two levels the assassin gains (+1 at 2nd level, +2 at 4th level, +3 at 6th level, and so on).<br/>\n<br/>\nUncanny Dodge: Starting at 3rd level, the assassin gains the extraordinary ability to react to danger before his senses would normally allow him to do so. At 2nd level and above, he retains his Dexterity bonus to AC (if any) regardless of being caught flat-footed or struck by an invisible attacker. (He still loses his Dexterity bonus to AC if immobilized.) <br/>\n<br/>\nAt 5th level, the assassin can no longer be flanked; he can react to opponents on opposite sides of him as easily as he can react to a single attacker. This defense denies others the ability to use flank attacks to sneak attack the assassin. The exception to this defense is that a rogue at least four levels higher than the assassin can flank him (and thus sneak attack him). <br/>\n<br/>\nAt 10th level, the assassin gains an intuitive sense that alertshim to danger from traps, giving him a +1 bonus to Reflex saves made to avoid traps, and a + 1 dodge bonus to AC against attacks <br/>\nby traps. <br/>\n<br/>\nAt 14th level : +2, <br/>\n17th +3, <br/>\n20th +4. <br/>\n<br/>\nIf the assassin has another class that grants the uncanny dodge ability, add together all<br/>\nthe class levels of the classes that grant the ability and determine the charatcter's uncanny dodge ability on that basis.<br/>\n<br/>\nAssassin Spell List<br/>\nAssassins choose their spells from the following list:<br/>\n1st level—change self, detect poison, ghost sound, obscuring mist,<br/>\nspider climb.<br/>\n2nd level—alter self, darkness, pass without trace, undetectable<br/>\nalignment.<br/>\n3rd level—deeper darkness, invisibility, misdirection, nondetection.<br/>\n4th level—dimension door, freedom of movement, improved invisibility, poison.<br/>\n<br/>\n<br/>\n3.5 Edition<br/>\n<br/>\nThe assassin is the master of dealing quick, lethal blows. Assassins also excel at infiltration and disguise. Assassins often function as spies, informants, killers for hire, or agents of vengeance. Their training in anatomy, stealth, poison, and the dark arts allows them to carry out missions of death with shocking, terrifying precision.<br/>\n<br/>\nMost rogues, monks, and bards who choose this class become examples of the classic assassin skulking in the shadows with a blade carrying certain death. Fighters, ex-paladins, rangers, druids, and barbarians operate as warrior assassins, with as much ability to kill in combat as from the shadows. <br/>\n<br/>\nSorcerers, wizards, and clerics  may be the most terrifying assassins of all, for with their spells they can infiltrate and slay with even greater impunity.<br/>\n<br/>\nAs NPCs, assassins work in guilds or secret societies found hidden in cities or based in remote fortresses in the wilderness.<br/>\n<br/>\nSometimes they serve more powerful evil characters singly or in a group. Occasionally an assassin works<br/>\nalone, but only the most capable are willing to operate without any sort of support or backup.<br/>\n<br/>\nHit Die: d6.<br/>\n<br/>\nRequirements<br/>\n<br/>\nTo qualify to become an assassin, a character must fulfill all the following criteria.<br/>\n<br/>\nAlignment: Any evil.<br/>\n<br/>\nSkills: Disguise 4 ranks, Hide 8 ranks, Move Silently 8 ranks.<br/>\n<br/>\n<strong>Special: The character must<br/>\nkill someone for no other reason<br/>\nthan to join the assassins.</strong><br/>\n<br/>\nClass Skills<br/>\n<br/>\nThe assassin’s class skills (and<br/>\nthe key ability for each skill) are<br/>\nBalance (Dex), Bluff (Cha),<br/>\nClimb (Str), Craft (Int), Decipher<br/>\nScript (Int), Diplomacy (Cha), Disable Device (Int), Disguise (Cha),<br/>\nEscape Artist (Dex), Forgery (Int),<br/>\nGather Information (Cha),<br/>\nHide (Dex), Intimidate<br/>\n(Cha), Jump (Str), Listen<br/>\n(Wis), Move Silently<br/>\n(Dex), Open Lock (Dex),<br/>\nSearch (Int), Sense Motive<br/>\n(Wis), Sleight of Hand<br/>\n(Dex), Spot (Wis), Swim<br/>\n(Str), Tumble (Dex), Use<br/>\nMagic Device (Cha), and<br/>\nUse Rope (Dex). See<br/>\nChapter 4 of the Player’s Handbook for skill descriptions.<br/>\nSkill Points at Each Level: 4 + Int modifier.<br/>\n<br/>\nClass Features<br/>\n<br/>\nAll of the following are class features of the assassin prestige class.<br/>\nWeapon and Armor Proficiency: An assassin’s weapon training focuses on weapons suitable for stealth and sneak attacks.<br/>\nAssassins are proficient with the crossbow (hand, light, or heavy),<br/>\ndagger (any type), dart, rapier, sap, shortbow (normal and composite), and short sword. Assassins are proficient with light armor but<br/>\nnot with shields.<br/>\nSneak Attack (Ex): This is exactly like the rogue ability of the<br/>\nsame name. The extra damage dealt increases by +1d6 every other<br/>\nlevel (3th, 5th, 7th, and 9th). If an assassin gets a sneak attack<br/>\nbonus from another source (such as rogue levels), the bonuses on<br/>\ndamage stack.<br/>\nDeath Attack (Ex): If an assassin studies his<br/>\nvictim for 3 rounds and then makes a sneak attack<br/>\nwith a melee weapon that successfully deals<br/>\ndamage, the sneak attack has the additional<br/>\neffect of possibly either paralyzing or killing<br/>\nthe target (assassin’s choice). While studying the victim, the assassin can<br/>\nundertake other actions so<br/>\nlong as his attention stays<br/>\nfocused on the target and<br/>\nthe target does not detect<br/>\nthe assassin or recognize the<br/>\nassassin as an enemy. If the victim<br/>\nof such an attack fails a Fortitude<br/>\nsave (DC 10 + the assassin’s class<br/>\nlevel + the assassin’s Int modifier)<br/>\nagainst the kill effect, she dies. If<br/>\nthe saving throw fails against the<br/>\nparalysis effect, the victim’s mind and<br/>\nbody become enervated, rendering her<br/>\nhelpless and unable to act for 1d6 rounds<br/>\nplus 1 round per level of the assassin. If<br/>\nthe victim’s saving throw succeeds, the<br/>\nattack is just a normal sneak attack.<br/>\nOnce the assassin has completed the 3 rounds of study, he<br/>\nmust make the death<br/>\nattack within the<br/>\nnext 3 rounds. If<br/>\na death attack is<br/>\nattempted and fails<br/>\n(the victim makes<br/>\nher save) or if the<br/>\nassassin does not<br/>\nlaunch the attack<br/>\nwithin 3 rounds of<br/>\ncompleting the<br/>\nTable 6–4: The Assassin<br/>\nBase Fort Ref Will —— Spells per Day ——<br/>\nLevel Attack Bonus Save Save Save Special 1st 2nd 3rd 4th<br/>\n1st +0 +0 +2 +0 Sneak attack +1d6, death attack, poison use, spells 0 — — —<br/>\n2nd +1 +0 +3 +0 +1 save against poison, uncanny dodge 1 — — —<br/>\n3rd +2 +1 +3 +1 Sneak attack +2d6 2 0 — —<br/>\n4th +3 +1 +4 +1 +2 save against poison 3 1 — —<br/>\n5th +3 +1 +4 +1 Improved uncanny dodge, sneak attack +3d6 3 2 0 —<br/>\n6th +4 +2 +5 +2 +3 save against poison 3 3 1 —<br/>\n7th +5 +2 +5 +2 Sneak attack +4d6 3 3 2 0<br/>\n8th +6 +2 +6 +2 +4 save against poison, hide in plain sight 3 3 3 1<br/>\n9th +6 +3 +6 +3 Sneak attack +5d6 3 3 3 2<br/>\n10th +7 +3 +7 +3 +5 save against poison 3 3 3 3<br/>\n<br/>\nstudy, 3 new rounds of study are required before he can attempt<br/>\nanother death attack.<br/>\nPoison Use: Assassins are trained in the use of poison and<br/>\nnever risk accidentally poisoning themselves when applying<br/>\npoison to a blade.<br/>\nSpells: Beginning at 1st level, an assassin gains the ability to<br/>\ncast a number of arcane spells. To cast a spell, an assassin must<br/>\nhave an Intelligence score of at least 10 + the spell’s level, so an<br/>\nassassin with an Intelligence of 10 or lower cannot cast these<br/>\nspells. Assassin bonus spells are based on Intelligence, and saving<br/>\nthrows against these spells have a DC of 10 + spell level + the<br/>\nassassin’s Intelligence bonus (if any). When the assassin gets 0<br/>\nspells per day of a given spell level (for instance, 1st-level spells<br/>\nfor a 1st-level assassin), he gains only the bonus spells he would<br/>\nbe entitled to based on his Intelligence score for that spell level.<br/>\nThe assassin’s spell list appears below. An assassin casts spells just<br/>\nas a bard does.<br/>\nUpon reaching 6th level, at every even-numbered level after<br/>\nthat (8th and 10th), an assassin can choose to learn a new spell in<br/>\nplace of one he already knows. The new spell’s level must be the<br/>\nsame as that of the spell being exchanged, and it must be at least<br/>\ntwo levels lower than the highest-level assassin spell the assassin<br/>\ncan cast. For instance, upon reaching 6th level, an assassin could<br/>\ntrade in a single 1st-level spell (two spell levels below the highestlevel sorcerer spell he can cast, which is 3rd) for a different 1stlevel spell. At 8th and 10th levels, he could trade in a single 1stlevel or 2nd-level spell (since he now can cast 4th-level assassin<br/>\nspells) for a different spell of the same level. An assassin may swap<br/>\nonly a single spell at any given level, and must choose whether or<br/>\nnot to swap the spell at the same time that he gains new spells<br/>\nknown for that level.<br/>\nTable 6–5: Assassin Spells Known<br/>\n—— Spells Known ——<br/>\nLevel 1st 2nd 3rd 4th<br/>\n1st 21 — ——<br/>\n2nd 3 — — —<br/>\n3rd 3 21 — —<br/>\n4th 4 3 — —<br/>\n5th 4 3 21 —<br/>\n6th 4 4 3 —<br/>\n7th 4 4 3 21<br/>\n8th 4 4 4 3<br/>\n9th 4 4 4 3<br/>\n10th 4 4 4 4<br/>\n1 Provided the assassin has sufficient Intelligence to have a bonus<br/>\nspell of this level.<br/>\nSave Bonus against Poison: Assassins train with poisons of all<br/>\ntypes and slowly grow more and more resistant to their effects.<br/>\nThis is reflected by a natural saving throw bonus to all poisons<br/>\ngained at 2nd level that increases by +1 for every two additional<br/>\nlevels the assassin gains (+2 at 4th level, +3 at 6th level, and so on).<br/>\nUncanny Dodge (Ex): Starting at 2nd level, an assassin gains<br/>\nthe ability to react to danger before his senses would normally<br/>\nallow him to even be aware of it. He retains his Dexterity bonus to<br/>\nAC (if any) regardless of being caught flat-footed or struck by an<br/>\ninvisible attacker. (He still loses any Dexterity bonus to AC if<br/>\nimmobilized.)<br/>\nIf a character gains uncanny dodge from a second class (such as<br/>\na barbarian/rogue), the character automatically gains improved<br/>\nuncanny dodge (see below).<br/>\nImproved Uncanny Dodge (Ex): At 5th level, an assassin can<br/>\nno longer be flanked, since he can react to opponents on opposite<br/>\nsides of him as easily as he can react to a single attacker. This defense denies rogues the ability to use flank attacks to sneak attack<br/>\nthe assassin. The exception to this defense is that a rogue at least<br/>\nfour levels higher than the assassin can flank him (and thus sneak<br/>\nattack him).<br/>\nIf a character gains uncanny dodge (see above) from a second<br/>\nclass (such as a barbarian/rogue), the character automatically gains<br/>\nimproved uncanny dodge, and the levels from those classes stack to<br/>\ndetermine the minimum rogue level required to flank the character.<br/>\nHide in Plain Sight (Su): At 8th level, an assassin can use the<br/>\nHide skill even while being observed. As long as he is within 10<br/>\nfeet of some sort of shadow, an assassin can hide himself from<br/>\nview in the open without having anything to actually hide behind.<br/>\nHe cannot, however, hide in his own shadow.<br/>\nAssassin Spell List<br/>\nAssassins choose their spells from the following list:<br/>\n1st Level: disguise self, detect poison, feather fall, ghost sound, jump,<br/>\nobscuring mist, sleep, true strike.<br/>\n2nd Level: alter self, cat’s grace, darkness, fox’s cunning, illusory<br/>\nscript, invisibility, pass without trace, spider climb, undetectable alignment.<br/>\n3rd Level: deep slumber, deeper darkness, false life, magic circle<br/>\nagainst good, misdirection, nondetection.<br/>\n4th Level: clairaudience/clairvoyance, dimension door, freedom of<br/>\nmovement, glibness, greater invisibility, locate creature, modify memory,<br/>\npoison.<br/>\n<br/>\nAs one can see, the Assassin is one of the oldest of Classes, in the same category as Monk.  It has existed down through the different editions (making a rather odd appearance in 4th Edition in an edition of Dragon Magizine) and appearing as well in 5th.<br/>\n<br/>\nThe beginning Assassin was not originally what we would label \"evil\" - though that alignment did not exist back then.  It was considered Neutral.<br/>\n<br/>\nThe 1st Edition rules did not automatically make the Assassin evil, either.  Rather, it tried to keep PC Assassins Neutral in alignment, though they could not be good.  It did not rule out evil ones, however, and most NPC Assassins were indeed evil in alignment.<br/>\n<br/>\n3rd Edition introduced the evil only rules.  This is obviously because of the rule stipulation that to become an Assassin, one had to kill someone soley for the purpose of becoming an Assassin.<br/>\n<br/>\nIt is specifically spelled out as a condition for taking the Prestige Class :<br/>\n<br/>\n<strong>Special: The character must<br/>\nkill someone for no other reason<br/>\nthan to join the assassins.<br/>\n<br/>\nAs such, yes, taking levels in the Prestige Class Assassin in 3rd edition requires one to have killed someone for the sole purpose of becoming an Assassin.</strong><br/>\n<br/>\nSince we are indeed playing 3rd Edition rules in NWN, and the Assassin Prestige Class is based on these rules, it is important to keep this in mind when considering the class, regardless of personal preference or opinion.<br/>\n<br/>\nAnd with that, I rest my case, based on the Official Sources, from the rulebooks themselves.</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "9:26 PM - Dec 22, 2019",
      "content": "<div>I'm glad that I'm not trying to play an assassin on YOUR world. I can't imagine trying to play while you're hounding me constantly, trying to get me to kill some little girl somewhere or something.<br/>\n<br/>\nKey word is also BASED ON. Strangely enough, things seem to be different in NWN than in these rules you posted. Death attack seems different than implemented in NWN...so do other things....<br/>\n<br/>\nYou play YOUR way, I'll play mine.  If the DMs on the world that I play on want to role play my Assassin as having killed an old lady, innocent girl, or etc, then I guess I'll either do what they say, or I won't plan an assassin.<br/>\n<br/>\nLucky for me its not a role play server.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:48 PM - Dec 22, 2019",
      "content": "<div>Been at a bit of a loose end this Sunday have we, Web? <span class=\"text-emoji\">😉</span><br/>\n<br/>\nOh - and bareheaded! Is that my festive treat?<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:13 PM - Dec 23, 2019",
      "content": "<div>I have nothing against using House Rules (Homebrew) for individual, group run Campaigns.<br/>\n<br/>\nIn fact, in my game sessions (yes, I DM D&amp;D, for a group, have done this for over 30 years now), I use a lot of Homebrew that I have \"collected\" from my years of experiences.<br/>\n<br/>\nThat said, we were not talking about some arbitrary \"homebrew\" situation here gkorjax, AND YOU KNOW THAT!  You specifically used wiki information to attempt to shore up your position - I called you on it and exposed your position for what it was - untenuable.<br/>\n<br/>\nIf you want to play an Assassin in 3rd Ed (or 3.5 Ed, for that matter) rules, that is a deviation from the ruleset.  This makes it then into House Rules (Homebrew).<br/>\n<br/>\nThis in and of itself is, as I said, fine, and is actually in the <em>spirit of the game! </em><br/>\n<br/>\nBut in any dialog about rules, especially in a group of individuals and/or an open forum such as we have in this case, we need to be clear about what we are talking about, and in what scope.<br/>\n<br/>\nAs for NWN, Bioware, and 3rd Edition.  Bioware itself stated the game is based on 3rd Ed (it actually was I believe a 2nd Ed first, then 3rd Ed came out during development, and there were adjustments made iirc - this put an end to the \"can I port my BG character into NWN\" discussion).  That certain parts of the rules were not included, for many things, or made up (like Knockdown, for example) is a known thing.  It is an <em><strong>OLD </strong></em>known thing, worn out and tired, that horse is long dead, flogged into undead existence!<br/>\n<br/>\nFact is, Bioware included the EVIL ONLY alignment restriction for Assassins.  You obvious desire for this to be wrong doesn't change this (and insight into this from the rulebook source(s) support Bioware's decision here).<br/>\n<br/>\nMy proposal for the modified Assassin Prestige Class would be to include a Death Strike feat (that acts much like Dev Crit, except it is based on level of the Assassin and Int) that could be activated from the radial.  It would allow 1 (one) such chance in the round to accomplish this, outside of combat (much like the Death Attack does with Para, but without the flurry stuff).  Another radial would be the DA (with flurry) which would threaten Para, but no Death Strike (deactivates if active).<br/>\n<br/>\nSneak Attack would be as normal.<br/>\n<br/>\nThis would give the Assassin an extra option to outright kill it's selected victim, which is obviously in the spirit of the rules here.<br/>\n<br/>\nI would go further to suggest adding in Exotic Weapon Prof (blowguns, etc), but that maybe too much.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:56 PM - Dec 23, 2019",
      "content": "<div>This thread started as a call for improvements for the assassin class in NWN. I agree with GD that the class deserves that.<br/>\nSo far the thread has sparked several good ideas. <br/>\nAs for alignment it is clear that assassins are evil as of the 3rd ed rules. The rules have evolved and it has not always been that way. Web has shared a lot of DnD lore with us as part of the alignment discussion. Some players have no problem with the concept of neutral aligned assassins. It is all right to state that in a thread where we reflect upon possible changes for the class.<br/>\n<br/>\nPlease keep the ideas flowing, I am sure that there is still room for improvement of the class.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "2:48 PM - Dec 23, 2019",
      "content": "<div>All I did was go to the nearest thing we have for an official basis on nwn,something that lists the mechanics and is more technically correct than what was originally known. There was no plot to shore up an argument either by ignoring or over quoting things... That said nwn  is based on DnD.<br/>\n<br/>\nBASED ON.<br/>\n<br/>\nYou play your assassins as people who killed innocent people,fine.<br/>\n<br/>\nI will play mine as neutral, or anything else, with  the \"evil\" part being a game mechanic that I choose to ignore, to further my character concept, with the tools available in nwn.<br/>\n<br/>\n<br/>\n<br/>\nSent from my Pixel 3 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:09 PM - Dec 23, 2019",
      "content": "<div>I'm with Mick on this one.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:17 PM - Dec 23, 2019",
      "content": "<div>I rather like Web's idea of a \"Death Strike\" feat (and loving the cutesy new avatar, btw), for a couple of reasons.<br/>\n<br/>\nFirst, as I believe Mick said somewhere else, \"I don't fight, I kill,\" so it would seem entirely appropriate for an assassin to be able to dispose of a target with a single blow, and getting progressively more proficient at it as they go. Quite how the mechanics should be applied (such as the DC, minimum requirements, and so on) we could discuss further.<br/>\n<br/>\nSecond, most classes have a sort of uber-feat: Dev Crit, Epic Dodge, Terrifying Rage, assorted insta-death spells, immunity to crits, Lasting Inspiration, etc. It seems plain mean to deny Assassin something specific to their class.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Sarthrovar",
      "avatar": "no_avatar.png",
      "timestamp": "4:48 AM - Jun 15, 2020",
      "content": "<div>This might be resurrecting a dead thread, but some other ideas:<br/>\n<br/>\nAdd some Assassin specific bonus feats and change bonus feat progression to one at level 10 and then one every 3 levels (ideas for bonus feats) - this would change total potential bonus feats from 5 bonus feats to 7; changing the selection allows for some more flexibility in character building and some of the options are specifically to address some of the weaknesses; Feats that can only be taken at epic levels could not be taken at Assassin 10 unless character was already an Epic Character. Also by forcing a choice it avoids the feeling from a player of having a wasted feat as a class default. <br/>\n<ul>\n<li><strong>Improved Evasion</strong> - (new to Assassin, but would need to be modified since Assassin doesn't qualify for Evasion)</li>\n[ul]\n<li>Would need to make Evasion a pre-requisite so a decision/investment in a synergistic class is forced (Evasion : SD 2, Monk 1, Rogue 2); this Feat currently doesn't have pre-requisites as the only classes that qualify already get Evasion at earlier levels.</li>\n<li>By avoiding giving Assassins Defensive Roll to qualify for Epic Dodge then this could still encourage a SD 5 + Assassin combo and allowing qualifying for ED without needing the 10 levels of SD. More flexibility to maximize Assassin levels, since 5 SD levels would still allow for 28 Assassin levels to be taken (changing bonus feat progression to every 3 levels means that last bonus feat would be at 28 instead of 30).</li>\n</ul>\n[li]<strong>HiPS </strong>[/li]\n<ul>\n<li>Similar to the 3.5e change to give Assassins the feat at Assassin level 8; however, by making this an optional bonus feat it allows some more flexibility in character building as those who choose to pair Assassin with SD would deprioritize this, those who want to save a class could instead take an Assassin to get HiPS</li>\n<li>Really helps Monk+Assassin combos as Monk gets Evasion to qualify for Assassin Improved Evasion and still get HiPS without needing the 1 level investment in SD</li>\n</ul>\n[li]<em><span style=\"color:#9900ff\"><strong>new</strong> </span></em><strong>Improved Death Attack</strong> - Target now dies instantly on failed fortitude save for Death Attack (similar to Dev Crit, no death spell immunity); even when target succeeds the save they are still paralyzed (unless immune to paralysis).[/li]\n<ul>\n<li>Death Attack was supposed to be an option to Kill or Paralyze but the NWN engine has some limitations; this would be a way to buff DA</li>\n<li>Immunity to paralysis still avoids paralysis but wouldn't provide immunity to the death effect. Immunity to crit and/or Immunity to sneak damage still negate.</li>\n<li>Make 8d6 DA (must be DA and not SA) a pre-requisite to avoid it being taken prior to Assassin 15; so should become available at similar character level as Dev Crit could be. </li>\n</ul>\n[li]<em><span style=\"color:#9900ff\"><strong>new</strong> </span></em><strong>Premeditated Assault</strong> - Allows Assassins to add their INT modifier to their damage rolls.[/li]\n<ul>\n<li>This would be overall base damage increase and not just Death Attack; helps make Assassins more effective against Crit/Sneak Immune. From a lore perspective makes use of Assassin training.</li>\n<li>Also opens some interesting possibilities for Wizard/Assassin combos</li>\n</ul>\n[li]<strong>Dual-wield</strong> - (like Ranger ability) - acts like a combo Ambidexterity/TWF, but as a single feat. Would carry same armor restrictions (light armor or robes only) (Does not qualify for ITWF).[/li]\n<ul>\n<li>Intent here would be to allow for some STR/INT Assassin DW builds that could potentially mix Wizard+max BAB class (Fighter, Barb, BG) instead of needing to depend on Ranger or 15 DEX + dedicating feats. </li>\n<li>Will not qualify for ITWF, but allows for some Dual Wield RP scenarios without taking heavy feat investment or Ranger class; avoiding ITWF requires builders to make choices on how important that extra off-hand attack is. Rangers get it for free helps them be separated from Assassin.</li>\n</ul>\n[li]<strong>Venom Immunity</strong> - (like Druid feat) immune to all poisons[/li]\n<ul>\n<li>I don't have a use for this in mind, but seems like it could fit the class and maybe some industrious builders out there could think of something</li>\n</ul>\n[li]<strong>Great Intelligence</strong> - (new for Assassin)[/li]<br/>\n[li]<strong>Epic Prowess</strong> - (new for Assassin)[/li]<br/>\n[li]<strong><em><span style=\"color:#9900ff\">new</span>  </em></strong><strong>Trained Killer</strong> - allows the assassin to use full death attack damage (just DA, not SA) against Favored Enemies without sneak restrictions. [/li]\n<ul>\n<li>Would apply only to Favored Enemies (Ranger or Harper Scout). Assassin would not be able to select Favored Enemies so is useless without spending levels on another class.</li>\n<li>This forces builders to consider trade-offs of adding more FEs versus higher DA damage, but giving Assassin some extra synergy with Ranger</li>\n<li>Death Attack paralysis does not apply (unless conditions for it were met normally), this is just for enhancing damage against FEs.</li>\n<li>For PVM could pick enemies that are normally sneak/crit immune for enhanced damage; for PVP would allow for higher damage in combat by changing FE selection - thus avoiding a universally better build but still allowing for some creativity in the build</li>\n</ul>\n[/ul]<br/>\n <br/>\nThe following two feats would help offset the fewer skills by giving some options to boost <em>specific </em>skills through custom feats (not as flexible as Rogue, but a way to offset the fewer skill points).\n<ul>\n<li><em><span style=\"color:#9900ff\"><strong>new</strong> </span></em><strong>Stealth Master</strong> - allows character to add their class level (Assassin levels, not character level) to their Hide and Move Silently skill checks.</li>\n[ul]\n<li>This could be potentially added to the Shadow Dancer pool of feats as well, and then modified to use the sum of SD + Assassin levels</li>\n</ul>\n[li]<strong><em><span style=\"color:#9900ff\">new </span></em></strong><strong>Master Trapper</strong> - allows character to add their class level (Assassin level) to the Set Trap skill, and half their class level to the Disable Trap and Craft Trap skill checks.[/li]\n<ul>\n<li>This could be potentially added to the Ranger pool of epic feats as well, and then modified to use the sum of Ranger + Assassin levels </li>\n</ul>\n[/ul]<br/>\nExisting Epic Feats:\n<ul>\n<li><strong>Self-concealment</strong></li>\n[ul]\n<li>With Imp Evasion above Assassins could now qualify for this feat without needing to take heavy investment in Rogue, Monk, or SD.</li>\n<li>If pool above still feels underwhelming then could potentially give Assassin first rank for free at level 10.</li>\n</ul>\n[/ul]<br/>\n <br/>\n General idea being having an expanded feat pool to allow customization and synergy with other classes but forcing some hard choices; while not completely stealing identity from other classes.<br/>\n <br/>\nAlso adding a disclaimer that the formatting in the preview does not seem to be working for lists with multiple levels of indents, so apologies if this turns out with horrid formatting. </div>"
    }
  ]
}