{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "228",
  "name": "Divine Scout: Paladin 29 / Champion of Torm 10 / Cleric 1",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/divine-scout-paladin-29-champion-of-torm-10-cleric-t2323677.html",
  "author": "WhiZard",
  "avatar": "10577588_1510287072.jpg",
  "replies": 8,
  "posts": [
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "1:46 AM - Mar 09, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Designed around environments where creatures are given high immunities with relatively few hit dice, this build is designed to deal irresistible damage from a range. If enemies close in, he will have a few melee smites at his side, a powerful lay on hands attack vs. undead, as well as a moderate turning ability for a large assortment of creatures. He can get the vast majority of standard creatures to be turned, but the instant death (for creatures whose hit dice + turn resistance is 14 or lower) is somewhat limited. While taking the cleric level late, certainly maximizes the spellcraft investment, it can be taken earlier especially if this character has need of clerical scrolls or the ability to turn more creatures. Though the blessed bolt is an instant kill for rakshasas, celestial avengers, and hound archons, the crossbow was selected mostly for its critical hit range; focus in the longbow is a viable alternative. This build certainly has problems in PvP (including not being able to remove death ward from shifted rakshasas, and not being able to turn the loyal balor summon); and the AB is certainly lacking for a ranged build, but the many instances where he can turn a creature and then attack it flatfooted, and there is nothing that creature can do about it, ensures that this build is quite valuable to a party, even if his soloing skills are not up to par. This build uses wisdom instead of dexterity for its shooting, which opens up a lot of spell slots in the paladin spell book, allowing for better defenses and refreshing some spells like divine favor and prayer. This build is also heavily feat starved, so it lacks several decent feats like point blank shot and divine shield.<br/>\n<br/>\n<strong>Divine Scout (Paladin 29/ Champion of Torm 10/ Cleric 1)</strong><br/>\n Human, Lawful Good<br/>\n PvM 1-40 (High Magic only, support character)<br/>\n<br/>\n Strength 14<br/>\n Dexterity 8<br/>\n Constitution 10<br/>\n Wisdom 16 (26)<br/>\n Intelligence 10<br/>\n Charisma 16 (26)<br/>\n<br/>\n Hitpoints: 398 (max roll), 276 (average)<br/>\n Skillpoints: 129<br/>\n Saving throws: Fortitude 36, Reflex 30, Will 37 <strong><span style=\"color:#FF0000\">(+8 vs. spells)</span></strong><br/>\n BAB: 30<br/>\n<strong><span style=\"color:#FF0000\">AB, melee: 33 (mundane greatsword)</span></strong><br/>\n AB, <span style=\"color:#FF0000\"><strong>ranged:</strong></span> 41/36/31/26 (naked, unbuffed)<br/>\n AC: <strong><span style=\"color:#FF0000\">13 (naked),</span></strong> 21 (full plate, unbuffed)<br/>\n Damage (mundane crossbow, unbuffed): 1d10<br/>\n Class level for turning: 28 (works on undead, vermin, elementals, and outsiders)<br/>\n Smite bonus damage: 39 x4 = 156<br/>\n<br/>\n Skills:<br/>\n Discipline 43 (45)<br/>\n Persuade 6 (14)<br/>\n Spellcraft 40<br/>\n Tumble 20 (19)<br/>\n<br/>\n Leveling:<br/>\n 1. Paladin (1): Power attack, Blind fight<br/>\n 2. Paladin (2):<br/>\n 3. Paladin (3): Divine Might<br/>\n 4. Paladin (4): Cha +1 (17)<br/>\n 5. Paladin (5):<br/>\n 6. Paladin (6): Zen Archery<br/>\n 7. Paladin (7):<br/>\n 8. Paladin (8): Cha +1 (18)<br/>\n 9. Paladin (9): Rapid Reload<br/>\n 10. Paladin (10):<br/>\n 11. Paladin (11):<br/>\n 12. Paladin (12): Extra Smiting, Cha +1 (19)<br/>\n 13. Paladin (13):<br/>\n 14. Paladin (14):<br/>\n 15. Paladin (15): Weapon Focus (Heavy Crossbow)<br/>\n 16. Paladin (16): Cha +1 (20)<br/>\n 17. Paladin (17):<br/>\n 18. Paladin (18): Weapon Focus (Greatsword)<br/>\n 19. Paladin (19):<br/>\n 20. Champion of Torm (1): Cha +1 (21)<br/>\n 21. Champion of Torm (2): Great Wisdom I (17), Great Charisma I (22)<br/>\n 22. Champion of Torm (3):<br/>\n 23. Champion of Torm (4): Great Wisdom II (18)<br/>\n 24. Champion of Torm (5): Great Charisma II, Cha +1 (24)<br/>\n 25. Champion of Torm (6): Great Wisdom III (19)<br/>\n 26. Champion of Torm (7):<br/>\n 27. Champion of Torm (8): Great Wisdom IV (20), Great Charisma III (25)<br/>\n 28. Champion of Torm (9): Cha + 1 (26)<br/>\n 29. Champion of Torm (10): Great Smiting I<br/>\n 30. Paladin (20): Great Smiting II<br/>\n 31. Paladin (21):<br/>\n 32. Paladin (22): Wisdom +1 (21)<br/>\n 33. Paladin (23): Great Smiting III, Great Wisdom V (22)<br/>\n 34. Paladin (24):<br/>\n 35: Paladin (25):<br/>\n 36: Paladin (26): Epic Weapon Focus (Heavy Crossbow), Great Wisdom VI, Wisdom +1 (24)<br/>\n 37. Cleric (1): Water Domain, Plant Domain<br/>\n 38. Paladin (27):<br/>\n 39. Paladin (28): Great Wisdom VII (25)<br/>\n 40. Paladin (29): Planar Turning, Wisdom +1 (26)<br/>\n<br/>\n<span style=\"color:#FF0000\"><strong>Skill Schedule</strong><br/>\n 01: Discipline(4), Persuade(3), Tumble(2), Save(1),<br/>\n 02: Discipline(1), Save(3),<br/>\n 03: Discipline(1), Tumble(1), Save(3),<br/>\n 04: Discipline(1), Save(5),<br/>\n 05: Discipline(1), Tumble(1), Save(5),<br/>\n 06: Discipline(1), Save(7),<br/>\n 07: Discipline(1), Tumble(1), Save(7),<br/>\n 08: Discipline(1), Save(9),<br/>\n 09: Discipline(1), Tumble(1), Save(9),<br/>\n 10: Discipline(1), Save(11),<br/>\n 11: Discipline(1), Tumble(1), Save(11),<br/>\n 12: Discipline(1), Save(13),<br/>\n 13: Discipline(1), Tumble(1), Save(13),<br/>\n 14: Discipline(1), Save(15),<br/>\n 15: Discipline(1), Tumble(1), Save(15),<br/>\n 16: Discipline(1), Save(17),<br/>\n 17: Discipline(1), Tumble(1), Save(17),<br/>\n 18: Discipline(1), Save(19),<br/>\n 19: Discipline(1), Tumble(1), Save(19),<br/>\n 20: Discipline(1), Save(21),<br/>\n 21: Discipline(1), Tumble(1), Save(21),<br/>\n 22: Discipline(1), Save(23),<br/>\n 23: Discipline(1), Tumble(1), Save(23),<br/>\n 24: Discipline(1), Save(25),<br/>\n 25: Discipline(1), Tumble(1), Save(25),<br/>\n 26: Discipline(1), Save(27),<br/>\n 27: Discipline(1), Tumble(1), Save(27),<br/>\n 28: Discipline(1), Save(29),<br/>\n 29: Discipline(1), Tumble(1), Save(29),<br/>\n 30: Discipline(1), Save(31),<br/>\n 31: Discipline(1), Tumble(1), Save(31),<br/>\n 32: Discipline(1), Save(33),<br/>\n 33: Discipline(1), Tumble(1), Save(33),<br/>\n 34: Discipline(1), Save(35),<br/>\n 35: Tumble(1), Save(36),<br/>\n 36: Save(39),<br/>\n 37: Spellcraft(40), Tumble(1),<br/>\n 38: Discipline(3),<br/>\n 39: Discipline(2), Save(1),<br/>\n 40: Discipline(1), Persuade(3), </span><br/>\n<br/>\n<em><span style=\"color:#000000\">edit: per Hip 20160916 (corrections/additions of missing info, in</span></em><span style=\"color:#FF0000\"><strong> red</strong></span><em><span style=\"color:#000000\">) </span></em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "11:51 PM - Mar 09, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Whizard, for one thing, I KNOW you know there is a need to list similar builds, which you have not done. Please do so and explain how yours is different from all in the ECB that has come before including my Sword of Tyr Pal26 CoT10 FTR4  for example. (Yes, a GS X melee warrior, hard AB and HPs, not an archer like the Divine Scout; most of the cther epic Pal/CoT combos are melee focused, true: but is this true of all of them or are you the very first smiting archer? Would be super duper cool if so, and do let us know.   <br/>\n<br/>\nThat said, x-bow is broken. Switch that out and pick up PBS (a must have on an archer). Couple quick notes: as to AB 40-ish is good for melee, especially nice with the Pal buffs for more I do agree; however, not all Pal buffs transfer over to archery (no holy bow for e.g.), so will want to get that up. This, because archers in general have little damage when they hit (reason why many go Arcane Archer), but a little smite sure helps (and like how you went zen of it, without need to raise dex). Otherwise, I do like the Scout, and great saves there. No such thing as too much saves, and must say you managed to squeeze a lot in there, too! <br/>\n<br/>\nSmite/Shoot ON! ~ Tyr<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "1:47 AM - Mar 11, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>TyrTemplar wrote:</strong>Whizard, for one thing, I KNOW you know there is a need to list similar builds, which you have not done. Please do so and explain how yours is different from all in the ECB that has come before including my Sword of Tyr Pal26 CoT10 FTR4  for example. (Yes, a GS X melee warrior, hard AB and HPs, not an archer like the Divine Scout; most of the cther epic Pal/CoT combos are melee focused, true: but is this true of all of them or are you the very first smiting archer? Would be super duper cool if so, and do let us know.   <br/>\n<br/>\nThat said, x-bow is broken. Switch that out and pick up PBS (a must have on an archer). Couple quick notes: as to AB 40-ish is good for melee, especially nice with the Pal buffs for more I do agree; however, not all Pal buffs transfer over to archery (no holy bow for e.g.), so will want to get that up. This, because archers in general have little damage when they hit (reason why many go Arcane Archer), but a little smite sure helps (and like how you went zen of it, without need to raise dex). Otherwise, I do like the Scout, and great saves there. No such thing as too much saves, and must say you managed to squeeze a lot in there, too! <br/>\n<br/>\nSmite/Shoot ON! ~ Tyr</div></blockquote>\n\nYou seem a little confused.  Here is the uniqueness factor of the build- it is a high level paladin that has expanded its turn ability to a large variety of creatures, (through a clerical level and planar turning unlocking elementals, vermin, and outsiders) while at the same time retaining most paladin pluses.  I have searched through the builds, and the only ones taking planar turning or even expanding the turn types are high level clerics (over 20+ cleric levels for those with planar turning).  The trick with turning and ranged fighting, is that you can often catch a turned creature flatfooted with a ranged weapon, however if you try to approach them with a melee weapon, they will just run away.  This potentially negates a lot of AC from the target.<br/>\n<br/>\nNext, smiting cannot be done with a ranged weapon, however, due to the charisma and strength buffs, he should have no problem scoring a smite on a few creatures with his greatsword once they come into melee range.  Smiting is simply another feature of the build, potent enough to do serious damage, but not a central focus of the build.<br/>\n<br/>\nThird, the 1.69 patch fixed crossbow.  So it is a viable weapon, almost equivalent to the bow.  Rapid shot loses its meaning in an environment with perma-haste, as the extra blow is demoted 5 points, making the attack power worse while in rapid shot mode than not in it.  As this is for high magic environments, the crossbow with rapid reload is still a strong weapon.<br/>\n<br/>\nAs for damage, I have already posted this build is for environments with significant damage immunity/reduction.  Physical damage is less of a focus compared to irresistible damage (divine might, divine favor, divine wrath).  Clerical scrolls can also add battletide to the list.<br/>\n<br/>\nFor listing other builds, given that there is none that synergizes smites and turning so well; I could list all the smite builds, all the ranged divine might builds, and all the heavy cleric turning builds.  But that number is so numerous without one looking all that similar.  If you want similar ending stats you could go <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build234356.html\" rel=\"noreferrer\" target=\"_blank\">divine archer</a> but that is more a of spellcasting build due to its heavy focus in cleric.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "2:42 PM - Mar 11, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Fair enough re: the similar builds, as yes there are over 100 of the combo in the ECB with epic Pal/CoT alone! However, just thought to ask if there were any other (like the Divine Archer for e.g.) that go a different route, but that one is cleric heavy and thus more spell/buff focused, I agree. So nice to see a Pal with the turning angle, as many sometimes forget Pals are pretty good at that, too (and where DM/DS comes from!). Said it would be super duper cool to know this, didn't I?  Nice.<br/>\n<br/>\nAs to confused, not at all. Firstly, can smite with your naked fist, with all the benefits applying to same. True, would cause an AoO without monk in the mix and can't holy sword your fist either but if you whittle them down from a distance via ranged, then pull out a melee weapon--any weapon--and there you go. As to the cross-bow, I don't see it fixed in my own testing. In fact, rather than following the ordinary attack progression (X/X-5/X-10) for some reason it's just showing X, X, X. I will test this in the OC and am happy to do so, unless you are saying that my game albeit a clean load with 1.69 is corrupted which I don't believe that it is.   In any event, you'll still want PBS in there, which is a must-have for all ranged. <br/>\n<br/>\nAs to PvE, things are a bit different than PvM and PvP, most true (where the E stands for environment meaning saves, immunity and reduction are very important, I agree, and up against some pretty tough undeads as well; and nice to have those saves and Pal immunities when, as a ranged character, things are being tossed at you in the back row as well. Tis good thinking, and nice to see). If you're in an environment where cleric and pal scrolls are available, then I might be inclined to actually drop an AB point and pick up 2 more great smiting instead so as to have GS V instead of GS III (which melee attack runs off STR and CHA not Wis/Zen as you know); this, so that when the Scout is all buffed up with innate casting along with the scrolls you mention can come out to the front in an emergency situation, like a team captain of sorts should the need arise (thus fulfilling a secondary role, and helping out your party). If so, will want to squeeze BF in there as well, letting you fight well against invisible creatures and denying them the bonus they'd otherwise get against you. Not a must for ranged characters but is for those who wish to step into the fray and melee sometimes, and as a Pal you're immune to fear, etc. anyway. That said, heh, if it's turnable ....  On the other hand, since you don't get Planar or access to cleric scrolls, etc. until the end of your career might not be an option, but still something to consider. This, making it a bit more playable, being able to help your party out more which is always good, yes? <br/>\n<br/>\nOtherwise, really NIFTY. A smiting ranged Pal with the turning is cool.<br/>\n<br/>\nSmite/Turn/Shoot ON! ~ Tyr<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "7:18 PM - Mar 11, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Tyr, did you remember to take rapid reload when using the crossbow?  The pre 1.69 bug was that the rapid reload feat granted only the second attack in the progression, now it grants all later attacks.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "8:08 PM - Mar 11, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Pre-patch Crossbow was very broken, yes; since 1.69 I'm showing it still is buggy, as above said though, but haven't tested in the OC proper as noted but one of the trainer/builders instead. Indeed, the OC being really the only way to know for sure. (Also haven't tested it with Zen either to see if that makes any difference: it shouldn't, but one never knows!). I know you test things as well, WhiZard, and not saying otherwise don't get me wrong but did you do so in the OC? (Trainers can sometimes be wrong, wonky things can sometimes happen when applying a patch I do well understand; I am happy to test in the OC proper if you like, unless of course you have.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "10:29 PM - Mar 11, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>TyrTemplar wrote:</strong>Pre-patch Crossbow was very broken, yes; since 1.69 I'm showing it still is buggy, as above said though, but haven't tested in the OC proper as noted but one of the trainer/builders instead. Indeed, the OC being really the only way to know for sure. (Also haven't tested it with Zen either to see if that makes any difference: it shouldn't, but one never knows!). I know you test things as well, WhiZard, and not saying otherwise don't get me wrong but did you do so in the OC? (Trainers can sometimes be wrong, wonky things can sometimes happen when applying a patch I do well understand; I am happy to test in the OC proper if you like, unless of course you have. </div></blockquote>\n\nI tested in a module I made post 1.69 and the crossbow has its full attack progression.  I took the character into the OC prelude, and he was still firing four shots per round.  I am not sure why yours isn't working, if you had rapid reload pre-1.69 you should be showing two attacks per round; but since you only have one I am thinking the rapid reload feat is not recognized.  Did you take the feat while leveling up, or did you assign it to an NPC?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "12:16 AM - Mar 13, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">How did you know that I build opposition sometimes?  Yes, that seems to be what was happening, thanks WhiZard. Happy to confirm that I rolled up a fresh character --in the OC proper! --and seems that reload is working--giving the number of attacks based on BAB (and I still do not know why it's not being recognized in my trainer/builder--it is odd, and looks like my weekend is going to involve pouring over some script!). <br/>\n<br/>\nTesting Stuff:<br/>\nAlso found in testing that haste was working, though. For the purpose of testing, namely to test a variety of different things I rolled up a DP Cleric with a BAB 25, X-bow foci with reload, and went zen (no smiting or other Pal goodies, though. Just a test). Test build gave 3 attacks as per that test-build's BAB (x/x-5/x-10). With haste, became X/X-5/X-10/X as, where reload's working. one would expect. Then, when threw DP on for the 4th attack it arrived properly as X+5 / X / X-5 / X+5 (if X is 41, then: 46/41/36/46), and with haste on top of that giving a 5th attack at X, such that haste does seem to be working with reload, at least according to my OC tests. <br/>\n<br/>\nShoot/Smite/Turn Undeads ON~ Tyr<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:35 AM - Mar 20, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Unusual build for sure, WhiZard.  Can't say I've ever seen one like it.<br/>\n<br/>\n For those who are not clairvoyant and rely on the CBC output to tell the full tale at a glimpse...<br/>\n<br/>\n The AB +41/+36/etc. described in the build is the range progression for the xbow, not for the greatsword. The normal (non-smite) melee AB is +33. Without PBS, the xbow attack in melee range will be reduced to AB +37. However, interestingly, WhiZard has set up the smite attacks to exactly match the same ranged AB (+41).  Extra Smiting provides that bonus for three smite attempts per day.<br/>\n<br/>\n What I am wondering is: since the normal greatsword attack is so pedestrian and also since only the smite attack gives the greatsword viability, wouldn't it be better to increase the productivity of the xbow by swapping ImpCrit: Hvy xbow for that single extra point in AB from WF: greatsword?  Eliminating it would drop the normal melee AB to +32 and the smite AB to +40. The xbow range would double from 19-20 to 17-20 and I doubt that greatsword will be getting much use outside of the occasional smite anyway.  Just a thought.\n<blockquote><div><strong>TyrTemplar wrote:</strong><hr/>\"because archers in general have little damage when they hit (reason why many go Arcane Archer)\"<br/>\n  </div></blockquote>\n\n Oh... and to correct some misinformation... archers in general do LOTS of damage.  Obviously, a dedicated STR fighter that picks up a bow will be a wimp, archer-wise. That is by design.<br/>\n AAs are merely the pinnacle of archer potential.<br/>\n<br/>\n Typical utility archers (beyond the scope of AA's) fall into 3 basic categories: Sneak/death (rog/asn) archers, divine (clc) archers and FE (rgr) archers.  There are also some CHA-based archers that do excellent damage but their AB is lame. Most all archers do plenty of damage even with mundane ammo (that x3 crit on bows is not a mistake) and do it from a distance of relative impunity (no AoO threats).  Stick Darkness into the strategy and they become near godly even against turbo-charged monks with injured legs.  Nah.  You wouldn't make generalizations like this if you built and played them often and in diverse environments.  Let us choose not to accentuate damage factors like mighty properties, the ability to toggle between damage types according to enemy resistance/immunity without losing weapon focus in the switch and the fact that +DEX ability boosts appear on more gear than +STR does. Xbows just crit more often. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}