{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "002",
  "name": "An Insight into the Cleric Class",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/an-insight-into-the-cleric-class-t515461.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": "14",
  "views": "38.4K",
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:29 AM - Sep 13, 2011",
      "content": "<div>Hail, mighty guildsmates. Last night I was talking in-game to one of our illustrious members who stated to me that he had never gotten the hang of playing Clerics, and was even having trouble playing Mith's Blood &amp; Faith build. I asked him a couple of questions, and after a couple of hours of chat in which I gave him several pointers in spellbook management and playstyle, he suggested that I should post all the info I shared with him for other members to base themselves upon.<br/>\n<br/>\n In all my many years of playing NWN, Cleric has been without a doubt the class which I have explored more thoroughly and diversely. I have made many Cleric builds, some STR-based, some DEX-based, some WIS-based. There is a spectrum of things that the Cleric class can bring to a build, the more levels you take, the more that spectrum broadens. Clerics can be great casters, great meleers, great snipers, or any combination of them. IMO it's the most powerful PvM class in Neverwinter Nights IF PLAYED PROPERLY.<br/>\n<br/>\n I will start by saying this: CLERICS ARE NOT HEALERS!! They can heal too, granted, but to make a healer Cleric is the NWN equivalent of buying a Ferrari to drive around town at 10 miles an hour. If you have the horsepower, USE IT!! There are 3 ways to EFFECTIVELY use the Cleric class in a build, each one more complete than the previous. I will demonstrate below:<br/>\n<br/>\n HOW AND WHEN TO USE THE CLERIC CLASS:<br/>\n<br/>\n The Cleric class is one of those classes that need to be taken heavily in order to be worth something in a build. I will state here that for a Cleric to live up to his potential, you need AT LEAST 15 levels of it. If any of your Cleric builds have less than that, then you're probably doing something wrong. There might be exceptions to the aforementioned statement, but I am not aware of any such exceptions in any of the hundreds of builds I have looked at since joining the ECB. Below I will list the three ways in which to use the Cleric class. I know I'm gonna get some heat from avado for saying that 15 level Clerics are good, but I stand by my opinion. In my playstyle, 15 levels of Cleric are very good:<br/>\n<br/>\n 1- Self-Buffer: You may use Cleric nearly exclusively as a self-buffer, negating the remaining aspects of the class in exchange for some other class feature from another class, or whatever. In this type of build, Cleric is a secondary class. To this effect, you will need a minimum of 15 Cleric levels and a maximum of 16, with 18 Wisdom. The reason for this is that your MAIN BUFFS are from spell levels 1-5, and as a general rule, they reach their CAP at level 15. I will get into this later on when I discuss spellbook management. Now this type of build is easily dispellable, which means you will need to memorize multiple copies of your most important buffs to avoid being crippled in melee. Also, this means that Spell Resistance is a big factor for you, and that if you face any enemies with high or high-ish SR, you're better off just engaging them in melee and avoiding spells altogether. With this setup, you need to avoid using all DC spells (spells which involve a saving throw), except in some very specific situations. IF you have capped Wisdom, AND if your enemies aren't spell-resistant, AND if the spell in question attacks their weak save, AND if it's a high level spell (level 8 mostly), then the chances are good that you will succeed. If so, then cast multiple instances of the same spell to ensure maximum effectiveness. Otherwise, stick with no-save spells and buffs. Extend Spell is a MUST HAVE in this type of build.<br/>\n<br/>\n I have one build here in the ECB that uses Cleric this way:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515401/The-Magical-Master-Cleric-15Wizard-23Monk-2#.VONEq-Z0zmQ\" rel=\"noreferrer\" target=\"_blank\">The Magical Master</a><br/>\n<br/>\n 2- Self-Buffer and Semi-Caster: You may use Cleric as a self-buffer with moderate casting prowess. This type of build takes 20-26 levels of Cleric and has 19 or 20 Wisdom. In this type of build, Cleric is the primary class of the build, but since the Wisdom score is low and the caster levels are average, you don't get to use the full power of the class yet. You can use all the buffs just like in the previous setup, but they will be near or totally undispellable (except by Mordenkainen's Disjunction, which can dispel even my mother in RL) and they will last longer. Your Wisdom is still low, but your caster levels are much better, so against Max Toolset SR of 32, you have good chances of penetration. You can use UMD scrolls to lower enemy SR to ensure that your spells will affect them. If you can cap your Wisdom with items / buffs, you can use your higher level spells to attack the enemy's lower save. With this type of build, as long as you know in which situation to use each DC spell, you can be pretty sure they will be effective, again, use multiple instances to increase your odds. I will talk more in-depth about this when I discuss spellbook management. Extend Spell is also very important and good to have to this type of character.<br/>\n<br/>\n I have one build here in the ECB that uses Cleric this way:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515430/The-Shadow-Priest-Cleric-26Monk-9SD5#.VONE4-Z0zmQ\" rel=\"noreferrer\" target=\"_blank\">The Shadow Priest</a><br/>\n<br/>\n 3- Self-Buffer and Full Caster: You may build a character to take full advantage of the Cleric goodies. To do that, you need 26+ levels of Cleric, a high Wisdom score and Zen Archery to make your casting stat also your primary combat stat. That way you're not to clumsy in combat (ranged) whilst remaining an excellent caster. This type of build is extremely powerful, resourceful and there is hardly a situation to which there is no way out. With your high Wisdom score, you can use the full extent of the Cleric offensive spells, take Spell Focus line of feats to enhance DCs and as many metamagic feats as you like to increase your casting power and better your spellbook management. You will be undispellable, your caster levels will be high, which means you will penetrate SR much more easily and in melee, although weaker, you will be by no means a wimp. But who's gonna melee when they can cast three Storms of Vengeance and mop the floor with all the stunned enemies, either with other AoE spells like Fire Storm or with a bow and arrows. Or Summons, whatever you want, this build can give you.<br/>\n<br/>\n I have one build here in the ECB that uses Cleric this way:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515420/Demolition-Man-Cleric-38-Monk-1-Rogue-1#.VONFIOZ0zmQ\" rel=\"noreferrer\" target=\"_blank\">Demolition Man</a><br/>\n<br/>\n As you can see, each of the three usages of Cleric gets increasingly powerful, so make sure if you ever do decide to remain with only 15 levels of Cleric, that whatever you're giving up the extra combat power for is worth your while. In my Magical Master build, a full Wizard spellbook, including Time Stop, Mord's and IGMS as some of my FAVOURITE spells and the 2 strongest Epic Spells were enough to me to shift the scales in favor of going Wizard-heavy and forfeiting Clerical goodness. If you take on a boss and use the Bigby 9 / Empowered Blade Barrier combo, you'll see what I mean . I guess I should mention that the Cleric can also be a party support character, but that's the 10-mile-an-hour-Ferrari thing all over again.<br/>\n<br/>\n Well, as far as usage goes, this is what I have to say. Now let's get more specific. It's about time!<br/>\n<br/>\n CLERIC SPELLS AND SPELLBOOK MANAGEMENT<br/>\n<br/>\n Now you will understand why many people say that Cleric is the most overpowered class in Neverwinter Nights, in fact you will probably tend to agree with them. I will divide this section into 3 parts for the sake of organization. First will be the MAIN BUFFS, then OTHER USEFUL SPELLS, and finally a look into the great Clerical OFFENSIVE SPELLS. Let's get started:<br/>\n<br/>\n MOST IMPORTANT BUFFS: Rather than ranking them by importance, I will organize them by spell level, except for Divine Power, which I will approach in-depth at the end of this section.<br/>\n<br/>\n Level 1:<br/>\n<br/>\n - Divine Favor: This spells adds +1 to AB and Damage for every 3 caster levels, capping at +5 (level 15). The damage is Magical and CANNOT BE RESISTED. It lasts 1 Turn (10 Rounds)<br/>\n - Shield of Faith: This spell increases your DEFLECTION AC by +2 and an extra +1 every 6 Caster levels, capping at +5 (level 18).<br/>\n<br/>\n Level 2:<br/>\n<br/>\n - Bull's Strength: Increases your Strength by 1d4 +1 for an hour per level.<br/>\n - Owl's Wisdom: Increases your Wisdom by 1d4 +1 for an hour per level.<br/>\n - Cat's Grace: Increases your Dexterity by 1d4 +1 for an hour per level. You need the Animal or War domains to have access to this spell.<br/>\n - Barkskin: This spell increases your NATURAL AC by +3 till level 6, +4 from levels 7-12 and +5 from level 13 on. It lasts 1 hour per level. You need the Plant domain to have access to this spell.<br/>\n<br/>\n Level 3:<br/>\n<br/>\n - Darfire: This spell adds fire damage to a weapon for 1 hour per level, The amount added is 1d6 +1 every 2 caster levels capping at +10 (level 20)<br/>\n - Magic Vestment: This spell increases your ARMOR AC by +1 every 3 caster levels if cast on an armor or your SHIELD AC by the same amount if cast on a shield. It caps at +5 (level 15) and lasts 1 hour per level.<br/>\n<br/>\n Level 4:<br/>\n<br/>\n - Greater Magic Weapon (GMW): This spell adds +1 enhancement every 3 caster levels to the target weapon. If cast on an ally, it will add the enhancement to the creature's main weapon. It caps at +5 (level 15) and lasts 1 hour per level.<br/>\n<br/>\n - DIVINE POWER* You can get this spell at both level 3 and level 4 if you take the Strength domain.<br/>\n<br/>\n Level 5:<br/>\n<br/>\n - Improved Invisibility: This spell makes you invisible and grants 50% Concealment bonus for 1 Turn per level. If you perform an offensive action (attack, cast a spell, etc..) you will become visible, but remain with the Concealment bonus until dispelled or until the duration expires. You need the Trickery domain to have access to this spell.<br/>\n - True Seeing: This spell allows you to automatically see invisible and hidden creatures. In many servers it has been modified to add to listen and spot when dealing with hidden creatures. It lasts 1 Turn per level. You can get it as a level 3 spell as well with the Animal domain.<br/>\n - Spell Resistance: Gives you a Spell Resistance of 12+ 1 every caster level for 1 Turn per level. Doesn't cap, how sweet<br/>\n<br/>\n These are the main buffs that make the Cleric a very competent self-buffer. There are many other spells that contribute to the class's power, but I believe these are the ones that define it. I will talk about the other buffs in the next section, but now it's time to talk about THE BEST SPELL IN THE GAME: DIVINE POWER:<br/>\n<br/>\n * This spell gives you, as an AB enhancement, whatever amount you lack to acheive the BAB of a Fighter of the same level. So if at level 20 you have 13 BAB, where a pure Fighter would have 20, Divine Power will give you a +7 AB enhancement. It's sick, I know. Not only that, but whenever that same fighter would have one more attack per round than your poor little self, this spell will also give you an EXTRA ATTACK PER ROUND AT FULL BAB (which makes a Cleric with DP better than a Fighter of the same level). And as a minor property but still very good for DEX-based toons, it sets your Strength to 18 if it's any lower. If it's higher it remains as is.<br/>\n<br/>\n Now the above is also very common knowledge within the ECB, but perhaps what I'm about to demonstrate next isn't. For the sake of simplicity, let's assume that you go straight Cleric for the first 20 levels, and draw conclusions based on the observation of how Divine Power works.<br/>\n<br/>\n Fighter-types gain an extra attack at levels 6, 11 and 16. So from levels 6-10, they have 2 APR (Attacks Per Round), from 11-15 they have 3 APR and from 16 on 4 APR.<br/>\n<br/>\n Clerics and all +3/4 per level BAB classes gain an extra attack at levels 8 and 15 so from levels 8-14 they have 2 APR and from 15 on they have 3 APR.<br/>\n<br/>\n By cross-examining these two charts, we can see that Clerics get Divine Power at level 7 (not considering Strength domain here), so at level 7 they get an extra attack per round. At level 8, Clerics gain another attack per round, so Divine Power no longer gives you an extra attack until level 11, when fighter-types gain the third attack per round. Then from 11-14 it goes back to giving you an extra attack per round, but at 15, Clerics gain their third attack per round so DP won't give you an extra attack till you reach level 16, when Fighters reach their fourth attack per round (which pure Clerics can't acheive with BAB), so from that level on, DP will always give you an extra attack per round.<br/>\n<br/>\n However, to make things simpler, I will state the following: IN MOST CASES, Divine Power gives you an extra attack from level 11 on. Peroid. Now why would I do that? Simple, I explained the whole mechanism so you would understand, but there are a few things that weren't taken into account. The first one is that at level 7, Divine Power only lasts 7 Rounds, which is VERY LITTLE, and all your other buffs are at a lousy +2 each (except Shield of Faith, which is at +3), so I generally don't bother using DP till level 9, when you can extend it for an 18 round duration and also your other buffs have increased to +3. Secondly, you're likely to have taken another non-full BAB class for skill dumps by then, save few exceptions. If you go, say Cleric 14 Wizard 1 (like my Magical Master build), you won't reach level 15 being a Cleric 15, so you won't gain that extra attack till level 16, when Fighter-types get their fourth attack and DP will forever grant you that juicy extra attack at full BAB.<br/>\n<br/>\n If you have a full attack schedule, attained with pre-epic BAB 16 or higher, then you don't get that extra attack at full BAB, so a Cleric should NEVER EVER EVER try to go over 15 pre-epic BAB. EVER!<br/>\n<br/>\n If after reading this you still don't agree that it's the best spell in the game, you need professional help<br/>\n<br/>\n Moving on with the guide, I will now talk about other useful spells to your combat strategy, buffs that are not vital, but that will give you very nice alternatives and properties:<br/>\n<br/>\n Level 1:<br/>\n<br/>\n - Bless: Gives +1 AB for 1 Turn per level to you and all nearby allies.<br/>\n - Protection from Alignment: Basically grants you +2 to all saves and immunity to mind spells from the chosen alignment, as the remaining property is simply overwritten by other better buffs. It also allows you to cast Gate (level 9 spell) and control the Balor. If you summon a Balor without Protection from Evil, it will turn hostile.<br/>\n - Mage Armor: Gives +1 DODGE AC (and +1 NATURAL AC if you don't have the Plant Domain) for an hour per level, The remaining properties are overwritten by better buffs. You need the Magic Domain to have access to this spell.<br/>\n - Endure Elements: Grants you 10/- resistance to all types of elemental damage for 24 hours. If you receive more than 10 damage from a single elemental type, the spell expires.<br/>\n<br/>\n Level 2:<br/>\n<br/>\n - Aid: Gives you +1 AB and 1d8 extra hit points for 1 Turn per level.<br/>\n - Darkness: Good if you are a sneaky Cleric. You can cast it behind you and attack enemies, then run back and hide in the Darkness just as if you had HiPS. Or you can cast it directly around an enemy and make all your attacks do Sneak damage.<br/>\n - Find Traps: Means you don't need to spend skill points to find traps. Make many scrolls of this if you can, as it's not really worth many slots.<br/>\n - Endurance: Gives you 1d4 +1 Constitution bonus for 1 Hour per level.<br/>\n<br/>\n Level 3:<br/>\n<br/>\n - Prayer: Gives +1 to AB, Damage, Saving Throws and Skill Checks to you and all nearby allies for 1 Round per level. If cast near enemies, they receive a penalty of -1 to all the above rolls for as long as the spell lasts.<br/>\n - Negative Energy Protection: Gives you immunity to Negative Energy damage and stat decreases, making you virtually immune to Curses, Poison and Disease. It lasts 1 Turn per level.<br/>\n - Protection from the Elements: Grants you 30/- resistance to all types of elemental damage for 24 hours. If you receive more than 30 damage from a single elemental type, the spell expires.<br/>\n<br/>\n Level 4:<br/>\n<br/>\n - Death Ward: makes you immune to all instant death effects EXCEPT FOR Drown and Implosion. Those two spells are not covered by Death Ward. Lasts 1 Hour per level.<br/>\n - Freedom of Movement: Makes you immune to paralysis, entanglement and slow effects. Lasts 1 Turn per level.<br/>\n<br/>\n Level 5:<br/>\n<br/>\n - Battletide: Creates an aura around you that gives you +2 circumstance bonus to attack rolls, damage (of magical type) and saving throws. It makes all nearby enemies who fail a Will save suffer a -2 penalty to attack rolls, saving throws and damage.<br/>\n - Stoneskin: Gives you 10/+5 DR per caster level to a maximum of 100 points of damage absorbed. Caps at level 10 and lasts 1 Hour per level or until you receive said damage. The remainder (if any) of the damage will be applied to you normally. You need to have the Strength domain to have access to this spell at level 5 or either Good, Magic or Earth domains to get it as level 4.<br/>\n<br/>\n Level 6:<br/>\n<br/>\n - Greater Sanctuary: This spell makes you invisible and untargetable by any spells or attacks until you perform a hostile action, the duration expires or you get dispelled (you can't be targeted by dispel effects directly, but they can be cast in an area and if you are in that area there is a chance this buff will be striped from you). It lasts 1 Turn per level. This spell has been changed on most servers, because it is overpowered and is bugged in many others, that's why I didn't list it as an essencial buff. In places where it's neither bugged nor changed, you may consider it as a part of the first list of MOST IMPORTANT BUFFS.<br/>\n<br/>\n Level 7:<br/>\n<br/>\n - Aura of Glory: Gives +4 to Strength, Dexterity and Consitution for 1 Round per level. You need to have the War domain to have access to this spell.<br/>\n<br/>\n As for buffs, there are no other important spells that need to be mentioned. You can also count in the Summon Creature line of spells and Animate Dead as well, as part of your low-level arsenal. Undeath's Eternal Foe was one of the greatest spells in Clerical arsenal, until they changed it to give Deflection AC instead of Dodge, now it's hardly worth mentioning. There are also Heal, Greater Restoration, Resurrection and Mass Heal as some other nice spells to have around (although I prefer scrolls or potions ).<br/>\n<br/>\n Now we will take a look at the relevant attack spells. Buckle up!<br/>\n<br/>\n EDIT: I forgot to mention that Endure Elements and Protection from Elements are BEST USED with scrolls. This is because neither the effect nor the duration of said buffs is influenced by caster levels. Buy and save up scrolls of these 2 spells, don't waste slots on them!!!<br/>\n<br/>\n CLERIC OFFENSIVE SPELLS<br/>\n<br/>\n Well, I will only describe the useful attack spells. There are many others, but I hardly ever use them, so I'm not qualified to quote them. If there are any other useful spells that I didn't mention here, please complement the info as you see fit. There are no good offensive spells before level 3, which coincidentally is where some of your most important buffs are, so leave the low level spells to the buffs and here we go from level 4 on:<br/>\n<br/>\n Level 4:<br/>\n<br/>\n - Hammer of the Gods: Does Divine damage to all enemies in an area and dazes them if they fail a Will save. The usefulness of this spell is for low-will save types like sneakers and meleers IF you have high wisdom and they're not Spell Resistant. If your WIS is 20, not many enemies will fail the save to make it worth your while.<br/>\n<br/>\n Level 5:<br/>\n<br/>\n - Flame Strike: Deals half-fire and half-divine damage to all enemies. It's an OK spell to have if your DCs are high, but otherwise it's subject to evasion. On the other hand, to those creatures that don't have Evasion, it's a good way to damage them, because Divine damage resistance is hard to come across.<br/>\n<br/>\n Level 6:<br/>\n<br/>\n - Harm: This spell reduces the target LIVING enemy's HP to 1d4. It has no save, but you must make a Melee Touch Attack and hit to inflict the damage. It's worth noting that Melee touch attacks ALWAYS use Strength modifier, even when you have Weapon Finesse. So ALWAYS cast Divine Power before using Harm. Many servers have modified this spell to do a certain amount of maximum damage, because as default it can do 10000000000000 damage as long as the target creature has that much HP. Heal can be used on UNDEAD to the same effect as Harm on the LIVING.<br/>\n - Blade Barrier: This spell summons blades that do PHYSICAL damage every round as long as the target fails a Reflex save. It is subject to Evasion and Damage Reduction, but with the sick amount of damage it does, if used on the right type of enemies it can be devastating.<br/>\n<br/>\n Level 7:<br/>\n<br/>\n - Word of Faith: Blinds enemies in the area of effect and also unsummons all summoned creatures in the area. This spell is a no save spell, so all enemies are automatically blinded.<br/>\n - Destruction: Instantly kills one enemy if he fails a fortitude save. The target takes 3d6 Divine damage even if he succeeds the save. This spell is useful agains single casters so you can conserve your Implosions for situations with several enemies, but only if you have High Wisdom, otherwise don't bother with it.<br/>\n<br/>\n Level 8:<br/>\n<br/>\n - Fire Storm: Great Area of Effect damage spell, very useful if you have high wisdom against a host of mobs surrounding you. It does half fire and half divine damage. Can be used in conjunction with Storm of Vengeance for the ultimate area of effect destruction. Is subject to Evasion, so you should know when to use it. Don't bother with it if you have low Wisdom.<br/>\n - Mass Heal: You can use Mass Heal to kill hosts of undead enemies by doing a ranged touch attack to them and then finishing them off with any area of effect spells. The devastating effect this has on undead makes you wish there was a Mass Harm. The ranged touch attack will ALWAYS use a Dexterity modifier, just like a melee touch attack will always use Strength.<br/>\n<br/>\n Level 9:<br/>\n<br/>\n - Implosion: THE BEST INSTANT DEATH SPELL OF THE GAME. Implosion has an innate +3 to DC and isn't subject to any immunities. It's useful to deal with casters even if you have low Wisdom, as long as you can cap it with buffs / items.<br/>\n - Storm of Vengeance (SoV): This is THE ULTIMATE STUNNER and disabler of low-reflex types. With a high Wisdom score, you can pretty much count on the fact that very few targets in the area of effect (if any) will be able to make their saves. It deals Electric and Acid damage, and every round the enemy is in the area of effect, they must roll a reflex save or be stunned for 1 round. Lasts 10 rounds and multiple instances in the same area STACK!!!<br/>\n<br/>\n Those are the main offensive spells on the Cleric's arsenal, and knowing when to use them is what will define great Cleric players from average ones. As you can see, there is pretty much a spell for every situation you find yourself in. Now we go to the next part of this guide, which is PLAYSTYLE.<br/>\n<br/>\n HOW TO PLAY CLERICS:<br/>\n<br/>\n Far be it from me to assert that this is the only way to play Clerics, even more so because there are many ways to use the class in a build, but it's a playstyle that I have adopted and tested in various environments, and I can tell you IT WORKS!<br/>\n<br/>\n Generally, when you go with Cleric in a build, you want to cap your buffs before level 20. There are very few exceptions to this, and I won't dwell much on them. Suffice to say that, save from an occasional skill dump you'll be investing heavily in Cleric levels as soon as you can.<br/>\n<br/>\n Levels 1-5 - Embrio stage<br/>\n<br/>\n For the first 5 levels, your main buffs are still kind of worthless. They're all at +1, except for Shield of Faith, which starts at +2. So playing as a self-buffer now is bound to get you into trouble rather than reward you. For these first few levels, you should summon creatures and buff them (if they last long enough, because on WoG the whole summoning system has been redone, so in WoG, instead of buffing the summons, have multiple summoning spells at your disposal). Let them tank while you either snipe if you're a DEX-based Cleric or flank your enemies in melee if you are STR-based one. At level 5 you get the Animate Dead spell, which summons a Tyrantfog Zombie. That thing's hide is nearly impervious and you can leave it in the middle of many enemies, as long as there are no casters around. It simply won't die from attack damage. Use Inflict Minor Wounds to heal the undead summon if you need to, but as a general rule, you don't need to.<br/>\n<br/>\n Levels 6-11 - Hatching stage<br/>\n<br/>\n At level 6, all your most important buffs gain an increase, which means you gain lots of AB and AC in fully buffed status. Still, so far you don't have Divine Power and you don't have many spell slots. Continue using Animate Dead (which will now give you a Skeleton Warrior) and Summon Creature spells. Have a couple of Divine Favors to go into full-power mode once or twice a day, but for the most part, use long-lasting buffs for you and your summoned creature. At level 7 you get Divine Power, but you can't Extend it yet, so only use one and in a very specific situation if you absolutely have to. At level 9 all your buffs (except for Shield of Faith) gain another increase and you get another \"upgrade\" to your full-power mode. Also, you now have level 5 spells, which means EXTENDED DIVINE POWER. You should still summon creatures because until level 11 it won't grant you an extra attack, so you won't become a beast just yet. Getting closer, though.<br/>\n<br/>\n Levels 12-26 - Beast stage<br/>\n<br/>\n After level 12, your summoned creatures will be much less cost effective, because again with the increase on every single one of your main buffs, your fully buffed mode is now pretty close to its cap. So now you can stop summoning altogether after level 12, because Divine Power will be granting you an extra attack at full BAB and all your buffs will be at +4. This is also when you start getting some nice spells like Harm, Blade Barrier and Word of Faith to add to your already formidable power. Use Blade Barrier empowered as a level 8 spell, both because there will be no better spells (unless you're going for the high Wisdom type of build in which case Fire Storm is also a very nice one). Blade Barrier is what avado calls the BOSS KILLER, cuz you can make the boss walk over a bunch of well-placed spells and take tons of damage. I don't use that strategy much, but it's worth mentioning because I respect avado's clerical knowledge.<br/>\n<br/>\n After you get level 9 spells, memorize a couple of Implosions to deal with nasty casters and more Storms of Vengeance to stun groups of melee mobs. You can take out an IMMENSE group of creatures with the SoV / Fire Storm combo. Always buff up with your Hour per level and Extended Turn per level buffs immediately after resting, use Divine Favor literally EVERY SINGLE ENCOUNTER and save Extended Divine Favors and Extended Divine Powers for tougher battles. Knowing how to conserve your buffs for the encounters where you need them is primordial if you want to effectively learn to play Clerics.<br/>\n<br/>\n After level 15, EVERY CLERIC CAN REACH THE +20 AB ENHANCEMENT CAP WITHOUT ITEMS. Divine Power will basically give you +5 (or more, never less unless you really screwed up), GMW +5, Divine Favor +5, Battletide +2, Prayer, Bless and Aid +1. You can even neglect some of these buffs, like I do Battletide and Prayer because they tend to ruin the element of surprise, which I customarily use a lot. Well, I do use Prayer, but I cast it far away from the enemies, for the extra AB and damage, but neglecting the decrease to enemy AB and damage it can cause. I feel it's not worth ruining the surprise for.<br/>\n<br/>\n Other interesting combos you can use are the Darkness / Hide combo or Darkness Sneak Attack combo, but use Extended Darkness at level 3, because level 2 should be all Extended Divine Favors, 1 Extended Bless and 1 Extended Shield of Faith. Your stat buffs such as Bull''s Strength should be Empowered at level 4. Here is how a lvl 15 Cleric's Spellbook with Capped Wisdom should look like:<br/>\n<br/>\n Level 1: Protection from Alignment (x2), Divine Favor (x7).<br/>\n<br/>\n Level 2: Extended Bless (x1), Extended Shield of Faith (x1), Extended Divine Favor (x6)<br/>\n<br/>\n Level 3: Darkfire, Magic Vestment (x2), Extended Darkness (x2 only if you are a sneaker, stealther), Prayer (x2 or x4) (or Divine Power x2 or x4 if you have Strength Domain).<br/>\n<br/>\n Level 4: Greater Magic Weapon (x1 or x2 if you are easily dispellable), Empowered Bull's Strength (x1 or x2 if you are a STR character), Empowered Owl's Wisdom (x1 or x2 if you have Monk AC bonus), Death Ward (x1), Empowered Endurance (x1) and Extended Negative Energy Protection (x1). The three last ones if you can afford the slots.<br/>\n<br/>\n Level 5: Extended Freedom of Movement (x1), Extended Divine Power (x6).<br/>\n<br/>\n Level 6: Extended Spell Resistance (x1), Extended True Seeing (x1), Extended Improved Invisibility (x2)(if you have the Trickery domain), Extended Battletide (x2), Harm (x2) or drop Battletide altogether and get 4 Harms, or drop Harm if it's been modified and get Blade Barriers up, or Heals if you're gonna be fighting Undead.<br/>\n<br/>\n Level 7: Extended Greater Sanctuary (x1 or x2 depending on the difficulty you're facing and whether or not you have Improved Invisibility or other forms of fleeing), Word of Faith (x2 or x3). You can squeeze a Destruction spell in here if you have high Wisdom.<br/>\n<br/>\n Level 8: Empowered Blade Barrier (x2), Fire Storm (x1) or Mass Heal (x3) if you plan to fight Undead monsters.<br/>\n<br/>\n If you go heavier on Cleric, the list above should serve as a good starting point for you to figure out how to fill up the extra spell slots and level 9 slots you will get by adding more Cleric levels.<br/>\n<br/>\n The last part of this guide will be the class combos involving Clerics, but that section is very extensive, so I will add it later on after thinking some more and researching some builds when I have the time. For now, this should be enough to keep you busy. I hope you find the info useful.<br/>\n<br/>\n EDIT: An Epic Cleric gains a bonus feat every 3 levels after 20, so 23, 26, 29, 32, 35, 38.<br/>\n<br/>\n Take it EZ!</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "8:11 AM - Sep 13, 2011",
      "content": "<div>Nicely done.<br/>\n<br/>\navado corrections!  LOL<br/>\n<br/>\nFirst, a cleric MUST use spellbook management.  What does that mean?  It means what Max says PLUS!  If you take meta feats, extend is nice.  However, what level are you stopping at?  26+, maybe it isnt the most essential.  Why?  No spell book management!<br/>\n<br/>\nYou cant extend some spells that you really do need IN SOME INSTANCES.  There is Silent spell, that allows you to cast these spells ONE SLOT HIGHER!  Since divine favor doesnt extend (duration, as far as I am aware doesnt double, still 1 turn), you have to decide on HOW you are going to play.  I know many of my associates feel extend is MUST HAVE!  Let me tell you, there are NO must haves!<br/>\n<br/>\nAlso, empower and max spell are important also, but not for reasons most considered!  In all honesty, I never cared that empower added damage or hit dice, and max gave me full damage (or a spell was silent or i could cast in armor or it extended).  What I considered ONLY was WHAT DID IT GIVE ME FOR BOOK MANAGEMENT!  yes, I had a cleric/bard/pm that had the Still feat (wasted feat by anyone's standards).  He was a lvl 40 and had excellent management (with ONLY that meta).  <br/>\n<br/>\nThe ERROR, and it is an ERROR i see most often with players is they want to have all these spells!  NO!  Like Max points out, only use the ones that you need and use ALOT of them!   At one time, I had a lv 30 cleric that had 15 divine powers and 20 divine favors (my numbers may be wrong, but the point ISNT).  If you do the math, that is 2 LEVELS FULL!  In undead areas (yes, they can be difficult if you havent been before), I have memorized Undead to deaths on lv 6, 7, 8, and 9!... OR if I know they are undead, but not groups of them, take heals on 6 and 7, mass heals on 8 and 9.   OR, i could take lv 9 as SOV, which was most of the time the case (it is just too solid).<br/>\n<br/>\nIt is my belief, that if you cant do this with your cleric, IF you are in a party, you are no help.  The name of MY game is DESTROY!  Fast, efficient.  <br/>\n<br/>\nIn most cases, you dont need to mem buff spells higher than lv 5 (II iirc is lv 5 extended).  It was common for me to have a spellbook with Divine favors in lv 1 AND 2 slots (maybe a buff spell if needed (items)).  LV 8 were ALWAYS Firestorms.  LV 9 SOV (Implodes are for newbies!  I have wasted too many of them when I could stunn them and cut them down faster).  I used Harms for those fights that you just want to get over.  <br/>\n<br/>\nI apologize Max for putting this in.  I know you arent finished yet.  I was going to insert my ol' guide that I wrote so many years ago, but alas, it is gone    <br/>\n<br/>\npeace</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:21 PM - Sep 13, 2011",
      "content": "<div><blockquote><div>You cant extend some spells that you really do need IN SOME INSTANCES. There is Silent spell, that allows you to cast these spells ONE SLOT HIGHER! Since divine favor doesnt extend (duration, as far as I am aware doesnt double, still 1 turn), you have to decide on HOW you are going to play. I know many of my associates feel extend is MUST HAVE! Let me tell you, there are NO must haves!\n</div></blockquote>\n\nDivine Favor DOES Extend. It lasts 2 Turns. True Strike is the lvl 1 AB buff that doesn't extend, and it isn't a Cleric buff.<br/>\n<blockquote><div>Implodes are for newbies</div></blockquote>\n\nNope, Implodes are for those enemies who have LOW FORTITUDE SAVES. Unless your Wisdom is very high, you need to factor in which are the weak saves of the enemy type you are facing. If you use SoV with a 20-wisdom Cleric against sneakers, then you don't know what the hell you're doing. Again, though, this might be a statement which was true where you used to play, but try this in WoG and you'll see what I mean when all your enemies succeed their saving throw.<br/>\n<blockquote><div>I have memorized Undead to deaths on lv 6, 7, 8, and 9!... OR if I know they are undead, but not groups of them, take heals on 6 and 7, mass heals on 8 and 9. OR, i could take lv 9 as SOV, which was most of the time the case (it is just too solid).\n</div></blockquote>\n\nI like that strategy, and have also used it in the past, but for the most part, Undead are also vulnerable to Fire damage (Darkfire), so you can take them out in melee, but your suggested way is faster. Mass Heal and Heal I use a lot as well, but whatever I cannot finish with those, I just hack and slash away. With my DEX-based Cleric / Monks of at least 8 APR, no undead lasts long. Mummies EVAPORATE in less than 1 round.<br/>\n<br/>\nBut I wanted to raise a point here which Mick PM'ed me about (thanks Mick ), I never did mention Turn Undead or Divine Might / Shield, so I will do this now:<br/>\n<br/>\n- Turn Undead and DM/DS: Except for the very early levels when you don't even have Darkfire, Turn Undead is kind of useless. I say this because combat-oriented Clerics already have to focus on 2 stats as it is, either DEX and WIS or STR and WIS. Turn Undead is modified by CHA, which would give you another stat to worry about, when there are simply spells that deal with undead better and faster. The same goes for Divine Might / Shield. If you go for those, you will end up with some low combat stats and having to worry more than it's worth about CHA-enhancing gear / spells. There might be builds that manage to use these effectively with the Cleric class, but ALL MY CLERICS SO FAR have TRASHED CHA. Whenever I want to go for Divine Might / Divine Shield, I go with Paladin, because they only need 14 Wisdom (only 4 spell levels), they get CHA bonus to saves, Aura of Glory (which Clerics don't get) to buff CHA more effectively and they get the same offensive buffs (except Divine Power) that the Clerics do. So I may be wrong here, but I'd recommend that you forget about these class-specific feats, as they are, at least to me, more crippling than helping. <br/>\n<br/>\nAlso, Mick showed me a link to a build in which he uses Cleric with less than 15 levels effectively. It's an Assassin 30/Monk 2/Cleric 8 with heavy DA DC. In all honesty, Mick, although it may work well, have you considered just HOW MUCH STRONGER that same build would be in melee combat had you gone Cleric 12 Monk 2 Assassin 26? You'd lose DA DC, sure, but your buffs would be much more meaninful, last longer and add +2 each to AB and AC (except for SoF, which would add +1). You would have +4 AB and damage (+2 DF and +2 GMW), +1 Darkfire damage, +3 AC (+2 MV on armor and +1 Deflection from SoF), plus Harm and Heal. How about Cleric 15 Monk 3 Assassin 22? All your buffs except SoF capped so +6 AB and damage, +1 Darkfire damage, +4 AC, +20% speed, 8th level spells and much better spell durations at the cost of 2 Epic Bonus feats and DA DC. The way you have set it up, if you can't paralyze the damned thing, you also can't kill it. With these alternative spreads you'd paralyze less enemies, but that wouldn't matter because you'd kick their butts anyway.<br/>\n<br/>\nBut anyway, if going for MAX DA DC with 10 APR, then as long as you know what you're giving up, I guess I understand (although I don't agree at all). Wish I could write more, but I gotta go to work!<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "4:31 PM - Sep 13, 2011",
      "content": "<div>Awesome information.<br/>\n<br/>\nI've been using a cleric as if they needed a real diverse spellbook. And when I kept dying in the first 6 levels always just deleted them.  Then promptly rolled up another arcane caster where I am more comfortable.<br/>\n<br/>\nI'll have to read this through a couple more times to digest the info, but will make a cleric much more interesting to play.<br/>\n<br/>\nThanks Max, I was going to try and type up the notes I took while we talked, but this is much more complete then my scribbles...<br/>\n<br/>\nConlaoch<br/>\n<br/>\nps.. I wonder if the Wayback machine can find a copy of avado's guide so we can have all that old info available as well...</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:08 PM - Sep 13, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nBut I wanted to raise a point here which Mick PM'ed me about (thanks Mick ), I never did mention Turn Undead or Divine Might / Shield, so I will do this now:<br/>\n<br/>\n- Turn Undead and DM/DS: Except for the very early levels when you don't even have Darkfire, Turn Undead is kind of useless. I say this because combat-oriented Clerics already have to focus on 2 stats as it is, either DEX and WIS or STR and WIS. Turn Undead is modified by CHA, which would give you another stat to worry about, when there are simply spells that deal with undead better and faster. The same goes for Divine Might / Shield. If you go for those, you will end up with some low combat stats and having to worry more than it's worth about CHA-enhancing gear / spells. There might be builds that manage to use these effectively with the Cleric class, but ALL MY CLERICS SO FAR have TRASHED CHA. Whenever I want to go for Divine Might / Divine Shield, I go with Paladin, because they only need 14 Wisdom (only 4 spell levels), they get CHA bonus to saves, Aura of Glory (which Clerics don't get) to buff CHA more effectively and they get the same offensive buffs (except Divine Power) that the Clerics do. So I may be wrong here, but I'd recommend that you forget about these class-specific feats, as they are, at least to me, more crippling than helping. </div></blockquote>\nI agree with you. A heavy investment in cha will be bad for a cleric, unless you have some very specialized builds. A cha focus is probably better in a paladin setting. On the other hand, if you have a high level cleric, TU will be quite potent even without much cha investment; a good way to stun or destroy undead, at least as a back up plan. And paladins can also take a lvl in cleric for sun domain, but I guss talking about paladins is moving slightly off topic.<br/>\n<blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nAlso, Mick showed me a link to a build in which he uses Cleric with less than 15 levels effectively. It's an Assassin 30/Monk 2/Cleric 8 with heavy DA DC. In all honesty, Mick, although it may work well, have you considered just HOW MUCH STRONGER that same build would be in melee combat had you gone Cleric 12 Monk 2 Assassin 26? You'd lose DA DC, sure, but your buffs would be much more meaninful, last longer and add +2 each to AB and AC (except for SoF, which would add +1). You would have +4 AB and damage (+2 DF and +2 GMW), +1 Darkfire damage, +3 AC (+2 MV on armor and +1 Deflection from SoF), plus Harm and Heal. How about Cleric 15 Monk 3 Assassin 22? All your buffs except SoF capped so +6 AB and damage, +1 Darkfire damage, +4 AC, +20% speed, 8th level spells and much better spell durations at the cost of 2 Epic Bonus feats and DA DC. The way you have set it up, if you can't paralyze the damned thing, you also can't kill it. With these alternative spreads you'd paralyze less enemies, but that wouldn't matter because you'd kick their butts anyway.<br/>\n<br/>\nBut anyway, if going for MAX DA DC with 10 APR, then as long as you know what you're giving up, I guess I understand (although I don't agree at all). Wish I could write more, but I gotta go to work!<br/>\n<br/>\nTake it EZ!</div></blockquote>\nMore cleric = more power  LOL.<br/>\nBut just for the record; what I posted you was a specialized assassin build with focus on sneaking up on a victim and pinning him down: \"I don't fight - I kill!\" <br/>\nSure, going heavier on cleric would make it a way better general purpose fighter build, fully in line with your recommendations. My point was rather that divine power is so powerful that in some builds it can justify even less than your recommended 15 levels of cleric. <br/>\n<br/>\nEdit: Low level cleric also gives access to darkness/infravision/TS, a great asset for an assassin.<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build264737.html\" rel=\"noreferrer\" target=\"_blank\">Link to the build</a></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:25 PM - Sep 13, 2011",
      "content": "<div>Yeah Mick, DP is awesome and your build is a \"wolverine\" kind of build (I'm the best at what I do). But I still have to say that your build doesn't use Cleric effectively. I guess there is no point in discussing this, since you have already agreed with me anyway. The build would altogether be much more versatile and powerful if you'd followed my guideline of at least 15 Cleric, but it wouldn't acheive that which you were aiming for. Like I said, I understand, but don't agree <br/>\n<br/>\nNow about your TU comment, a high level Cleric can cast ONE MASS HEAL, ONE UNDEATH TO DEATH (if he has high Wisdom) and anihilate all surrounding undeads instead of scaring the crap out of the most powerful ones and then have to chase them all around as they flee in separate directions. Not worth the work you have to put in, like I said, your spells can do better than that, and if not, meleeing with them in most cases will be faster than turning them.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:16 AM - Sep 14, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nNow about your TU comment, a high level Cleric can cast ONE MASS HEAL, ONE UNDEATH TO DEATH (if he has high Wisdom) and anihilate all surrounding undeads instead of scaring the crap out of the most powerful ones and then have to chase them all around as they flee in separate directions. Not worth the work you have to put in, like I said, your spells can do better than that, and if not, meleeing with them in most cases will be faster than turning them.\n</div></blockquote>\nExactly!  Which is why my PCs never cast that bleedin' fear spell even on the weak-willed (well, besides using up slots better utilized for direct damage spells or empowered buffs, that is).  Similar dynamic. Though, if you have a few archers in your party, they can practice their marksmanship on them while you loot corpses.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:14 PM - Sep 22, 2011",
      "content": "<div>THE CLERIC/MONK COMBO:<br/>\n<br/>\nRather than making a mega-giant UBER post with all the combos, I'll go one by one as soon as I remember. And what better way to start than with THE BEST NWN combo, IMO anyway. This combo is best used in a DEX build, because Monk bonuses don't work while wearing armor or shields, so if you go STR your AC will be seriously jeopardized. Also because DEX alllows you to dual-wield, which adds even more mojo to this already high-mojo combo. Now below I will elaborate on why it is that this combo is the best by showing the synergy between these classes:<br/>\n<br/>\n1- Cleric damage bonuses + Monk attack schedule: Well, as we all know, Clerics have no problem hitting anyone. Their AB buffs are OFF THE CHARTS! They also have many damage buffs that apply everytime they hit, and the more attacks per round you have, the more you hit, and the more you multiply the bonuses of these damage enhancements. Darkfire does 1d6 +10 capped, GMW gives +5 to damage, Divine Favor another +5 and Divine Power adds Strength damage, which will be most of the time 4. That is 25-30 bonus damage per attack, Cleric / Monks can get up to 8 APR (5 base, +1 DP, +1 Haste, +1 FoB). Throw in 2 extra attacks from dual-wielding feats and you can imagine the onslaught! There are still other bonuses not counted, like +2 Magical damage from Battletide and +1 from Prayer.<br/>\n<br/>\n2- Cleric Casting Stat + Monk AC bonus + High DEX + DWing feats: Generally, any non-Cleric-Monk dual-wielder has to drop some AC for the added offensive power that two weapon fighting gives. Cleric / Monks don't. They can dual-wield for the extra boon, while still having higher AC than a sword and board DEX-build in most enviroments, except High Magic. Wisdom buffs add AC as well as spell DCs. They also move faster after 3 levels, and anyone knows that a Cleric Speedy Gonzalez is something to be feared.<br/>\n<br/>\nNow those synergies are simply awesome in practice. You can have a dex-based build doing more damage a round than a Strength build (save a few exceptions), just because of the sheer amont of bonus damage added to each attack by Cleric buffs and the number of attacks that a Monk schedule provides (8x30 is more than 5x40). And still, they have a higher AC than most DEX-heavy builds, dual-wielders or otherwise. They get a free-permit to DW without losing a SINGLE POINT OF AC, and if they do, they get a sick damage output. Any dex-based Cleric/Monk can be very powerful, and we still haven't considered adding a third class. Let's do that now!<br/>\n<br/>\nYou can add Wizard and have a full arcane spellbook, epic spells etc.. like in my Magical Master build.<br/>\nYou can add CoT and get saves + Bonus Feats (which can be used to get Dual-Wield feats) like in a Cleric 26 Monk 6 CoT 8.<br/>\nYou can add Druid to get a full Druid spellbook with high DCs and Dragon Shape like in Kail's Order of Jormungandr build.<br/>\nYou can add SD for Epic Dodge and HiPS like in my Shadow Priest Build.<br/>\nYou can add Rogue just for UMD like in my Demolition Man build, or to also get Epic Dodge and Sneak Attack in a Cleric 26 Rogue 13 Monk 1.<br/>\nYou can add Weapon Master to increase the threat range of the Kamas and the multiplier of all your crits (although the feat requirements are too heavy to be worth your while IMO) like in a Cleric 26 Monk 7 WM 7.<br/>\nYou can add Assassin for Death Attack, Improved Invisibility and UMD like in Mick's build or in a Cleric 15 Monk 3 Assassin 22.<br/>\nYou can add Fighter to get WS / EWS and some bonus feats, similar to the CoT alternative, but instead of the saves you get WS and EWS and one extra feat (Fighter 1) like in Mith's Cleric 30 Monk 6 Fighter 4.<br/>\nYou can add Harper Scout for stackable Cat's Grace and a few more worthless skills  like in Cleric 29 Monk 6 HS 5<br/>\nYou can add Dwarven Defender to be immune to Sneaks and have a bit of DR like in Hip's Abbot of the Seven Winds (which is being reworked to be made a dexer last I heard).<br/>\n<br/>\nAs far as I know, no other class will give much benefits in terms of synergy, but any class when added to this combo can't help but be strong!<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "5:32 AM - Oct 22, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nDivine Favor DOES Extend. It lasts 2 Turns. True Strike is the lvl 1 AB buff that doesn't extend, and it isn't a Cleric buff.\n</div></blockquote>\n\nWOW!  How did I miss this one.  You mean, this was changed in a patch?  All the brightest minds in ECB had discussed this ad nausia, and all came to the same conclusion: DF can be extended, but DOES NOT last more than 1 turn!  That you say it lasts 2 is a miracle!  Please cite me actual facts on this.  Too many other fine and experienced players have told me otherwise, as has my own play up to and including 1.69 (the last patch).  <br/>\n<br/>\nThanks!</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "5:48 AM - Oct 22, 2011",
      "content": "<div>Divine favor extends normally for the duration of two turns. You can verify yourself by firing up the game and timing a normal and an extended DF.</div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "5:57 AM - Oct 22, 2011",
      "content": "<div>This was very helpful. Thanks for taking the time to post it.</div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "3:17 PM - May 14, 2018",
      "content": "<div>Thanks for sharing this. Very helpful.</div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "11:47 PM - Oct 19, 2022",
      "content": "<div>Just a question here, is the character screen lying to me? Just finished the Lord of Terror mod with cleric RDD and when buffed with divine power still showed only 3 attacks per round? 21 levels of cleric at this point btw.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:21 AM - Oct 20, 2022",
      "content": "<div>I'm not sure I am following you here.<br/>\n<br/>\nDo you mean when you are under the influence of Divine Power?  If so, the extra attacks do not show up on the character sheet.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:14 AM - Oct 20, 2022",
      "content": "<div>The character sheet is notorious for lying.  I don't think that has been fixed in EE.</div>",
      "author-color": "#00AA00"
    }
  ]
}