{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "748",
  "name": "The Contemplative Scoundrel (Rogue 21/Fighter 10/Monk 9)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-contemplative-scoundrel-rogue-21-fighter-10-mo-t2355260.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "3",
  "views": "154",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:10 AM - Dec 11, 2019",
      "content": "<div>Wondering what your thoughts were on this Base 42 AB 8-10 APR ITWF dual kama with WS/EWS Naked AC 32, with a Base AB 40 ranged 4-6 APR with a longbow with WS: longbow, point blank shot/rapid shot, 12d6 sneak attack, 400+hp and 291 skill points, epic dodge, crippling strike, deflect arrows with reflex save 33, UMD<br/>\n<br/>\n20% exp penalty, levels 18-22 only<br/>\n<br/>\nNot a unique class combo, notable builds being Empyre65's Dervish series of builds and Kail Pendragon's Monasteric Commando, but the amounts of class levels and features do make it different<br/>\n<br/>\nI could have dropped Int to 8 put cons to 15(16), put the first stat increase to +1cons, and rearranged the feats to drop armor skin for Great Dexterity for +40hp but I feel like it has enough, although if I can add the ability for the character to tank well in teamfights it makes it more valuable.<br/>\n<br/>\nThat being said I'm not sure I really want to RP a character who has a negative int modifier...<br/>\n<br/>\nIt also needs some sort of backstory, right now it feels somewhat like a unhittable naked powerbuild (metaphorically naked in terms of lore, he/she should be wearing robes)<br/>\n<details><summary>Spoiler</summary>Monk(9), Rogue(21), Fighter(10), Human\nSTR: 14\nCON: 14\nINT: 10\n\n01: Rogue(1): Toughness, Two-Weapon Fighting\n03: Monk(1): Ambidexterity, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}\n05: Fighter(2): Weapon Focus: Kama\n07: Fighter(4): Weapon Specialization: Kama\n09: Rogue(3): Blind Fight, {Uncanny Dodge I}\n11: Fighter(6): Improved Two-Weapon Fighting\n13: Fighter(7)\n15: Monk(4): Resist Energy: Fire\n17: Rogue(5)\n19: Rogue(7)\n21: Monk(5): Epic Weapon Focus: Kama\n23: Monk(7)\n25: Monk(8)\n27: Rogue(10): Epic Prowess, Defensive Roll\n29: Rogue(11)\n31: Rogue(13): Epic Dodge\n33: Rogue(15): Great Dexterity II, (DEX=28)\n35: Rogue(17)\n37: Rogue(19): Improved Sneak Attack I\n39: Rogue(21): Great Dexterity IV, (DEX=31)\n\nSkillpoints: 291\nSaving Throw bonuses: Mind Effects: +2, Traps: +5\nAB (max, naked): 42 (melee), 39 (ranged)\nSpell Casting: \n\n\n01: Disable Trap(4), Hide(4), Listen(4), Move Silently(4), Open Lock(1), Search(3), Set Trap(4), Tumble(4), UMD(4), Save(4), \n03: Discipline(1), Hide(2), Move Silently(2), Tumble(2), \n05: Discipline(2), Save(3), \n07: Discipline(1), Save(7), \n09: Hide(1), Move Silently(1), Tumble(1), UMD(5), Save(1), \n11: Discipline(1), Save(4), \n13: Discipline(1), Save(2), \n15: Discipline(1), Hide(2), Move Silently(2), Save(4), \n17: Search(1), Tumble(5), Save(3), \n19: Hide(1), Listen(1), Move Silently(1), UMD(1), Save(8), \n21: Discipline(6), Hide(1), Listen(1), Move Silently(1), Save(7), \n23: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(4), \n25: Discipline(1), Hide(3), Listen(3), Move Silently(3), Save(1), \n27: Hide(1), Listen(1), Move Silently(1), Tumble(5), Save(1), \n29: Hide(1), Listen(1), Move Silently(1), UMD(6), \n31: Hide(2), Listen(4), Move Silently(2), UMD(2), \n33: Disable Trap(1), Hide(1), Listen(6), Move Silently(1), \n35: Disable Trap(6), Hide(1), Listen(1), Move Silently(1), \n37: Disable Trap(1), Hide(1), Listen(1), Move Silently(1), Tumble(5), \n39: Hide(1), Listen(1), Move Silently(1), Save(9), </details></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:10 AM - Dec 11, 2019",
      "content": "<div>The first thing that strikes me is your effort to avoid XP penalties! A job well done <span class=\"text-emoji\">😌</span><br/>\nThe down side of building with three base classes is that avoiding an xp penalty restricts the order in which you can level up the different classes.<br/>\nYou invest a lot in archery, 5 pre epic feats - and then no epic archery feats. That strikes me as not being consistent.  I know why you do it. The build is feat starved in epic levels and you also want some Great dexterity. It  happens when you take most of your Fighter levels pre epic to build up BAB and stop there.<br/>\nBy all means, this is a good build. But do you really need Point blank shot, Rapid shot and Called shot? After all you have a melee specialist with 9 attacks per round! So let them at you! Even without a single archery feat a dexterity build will have a good AB for the bow as a back up weapon. You can use it for flanking (or) from the back to deal SA damage, or you can use it on single targets to pull aggro.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:59 AM - Dec 11, 2019",
      "content": "<div>Thanks so much Mick for your comments<br/>\nYou were very perceptive and yes I did have a lot of fighter feats to use pre-epic. I tried very hard to keep the AB up, dual wielding plus flurry drops the AB a bit, although the flurry attack has a higher AB than one thinks<br/>\nAnd some very solid feedback, I think I have over invested in ranged feats here, when I look at it again, a ranged AB of 39 as a secondary attack is more than satisfactory, any more investment seems extravagant <br/>\n<br/>\nCalled Shot is in there to drop AC / AB in melee form, and its also there for the ranged weapon usage too which is nice, I'd like to keep that<br/>\nPoint Blank Shot is in there to be useful in close range and to not have AB penalties when trying to sneak attack with the ranged weapons, essentially increases AB by 5 when trying to sneak attack at close range with the ranged weapons,  sometimes if there is a mob of enemies or allies in the way you gotta shoot to contribute, so I want to keep that in there.<br/>\n<br/>\nI can drop WF/WS: longbow and Rapid Shot and for resist energy: fire, resist energy: acid and iron will feats I'll edit it into the main post.<br/>\nThanks for the feedback, awesome to get the feedback/comments</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:02 AM - Dec 15, 2019",
      "content": "<div>Bit late to the party on this one, sorry.<br/>\n<br/>\nI do like the principle, and how you've gone about it. Just a couple of thoughts to mull over, if that's okay. If your goal is to be unhittable, how about dropping Toughness, which, after all is only useful if you <em>do</em> get hit? That would give you scope to take Improved Critical in kama. With a bit of feat shuffling you could then take Weapon Focus at level 3 (assuming you take both 2WF and Ambidexterity at level 1).<br/>\n<br/>\nAlso, and this is probably just me, you could bump your AC by a further point with Monk 10 at the expense of Rogue 21. The cost would be 4 skill points and 1d6 of sneak attack. If it helps balance the scales, you'd get an extravagant 2 more hit points as well.<br/>\n<br/>\nJust thoughts.<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: Oh, and Monk 10 means you could take your final level in Fighter - and therefore its bonus feat - earlier, while still maxing Discipline</div>",
      "author-color": "#AA0000"
    }
  ]
}