{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "280",
  "name": "Pre-Epic Class",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pre-epic-class-t2204015.html",
  "author": "DMTaino",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "1.3K",
  "posts": [
    {
      "author": "DMTaino",
      "avatar": "no_avatar.png",
      "timestamp": "10:33 PM - Feb 26, 2012",
      "content": "<div>I play on Ravenloft \"Prisoner of the Mist\" on my spare time.<br/>\n<br/>\nWhat would be the best class for a server where the max character level is 20th and multi-classing is upon request only. If asking for a 2nd class would need to have a description sent to DM<span style=\"text-decoration:line-through\">. Also the magic/coins is low.. From what my 5th lvl Half-Orc has is a +1. Doubt their is anything higher but not 100% sure.<br/>\n<br/>\nI'm not the best character builder; which is why I am asking the pros here. Any assistance and many thanks in advance!</span></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:55 AM - Feb 27, 2012",
      "content": "<div>\"Best\" is subjective.  It could mean \"the easiest to level\", \"the most interesting or fun\", \"the most dominant on the server\", \"the most popular\" or have another meaning altogether depending on your personal goal and incentive.<br/>\n<br/>\nYou have begun to define the server orientation pretty well but much more is needed for an informed recommendation.  <br/>\nFor instance...<br/>\n<br/>\nAre you comfortable playing a spellcaster? Typically arcanists and clerics are the most dominant classes, especially within the constraint of 20 levels which pretty much rules out Weapon Masters (for example) who tend to need epic levels to develop their strengths adequately.  Battle clerics normally rule the low-magic melee environment by their innate nature to overwhelm the low-magic conditions.<br/>\n<br/>\nThen there are the polymorph classes like druid &amp; shifter which excel in most low-magic realms.  Their versatility can overcome many situations.<br/>\n<br/>\nThe key to helping you to determine the best \"fit\" for you rests primarily on your own play style and preferences.  When you play any server for a period of time, usually you will notice a proliferation of a few classes and a paucity of others among the community.  You can use the observed bias as a barometer for your own PC to a certain extent but it won't necessarily indicate what is the \"best\" for  &gt;&gt; YOU</div>"
    },
    {
      "author": "DMTaino",
      "avatar": "no_avatar.png",
      "timestamp": "1:39 AM - Feb 27, 2012",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong>\"Best\" is subjective.  It could mean \"the easiest to level\", \"the most interesting or fun\", \"the most dominant on the server\", \"the most popular\" or have another meaning altogether depending on your personal goal and incentive.<br/>\n<br/>\nYou have begun to define the server orientation pretty well but much more is needed for an informed recommendation.  <br/>\nFor instance...<br/>\n<br/>\nAre you comfortable playing a spellcaster? Typically arcanists and clerics are the most dominant classes, especially within the constraint of 20 levels which pretty much rules out Weapon Masters (for example) who tend to need epic levels to develop their strengths adequately.  Battle clerics normally rule the low-magic melee environment by their innate nature to overwhelm the low-magic conditions.<br/>\n<br/>\nThen there are the polymorph classes like druid &amp; shifter which excel in most low-magic realms.  Their versatility can overcome many situations.<br/>\n<br/>\nThe key to helping you to determine the best \"fit\" for you rests primarily on your own play style and preferences.  When you play any server for a period of time, usually you will notice a proliferation of a few classes and a paucity of others among the community.  You can use the observed bias as a barometer for your own PC to a certain extent but it won't necessarily indicate what is the \"best\" for  &gt;&gt; YOU</div></blockquote></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:18 AM - Feb 27, 2012",
      "content": "<div>Then, barring serious class or spell nerfs... Wiz 20 or Sorc 20 for PvP.  Battle Cleric 20 for all else.  All these classes can self-haste which is probably the greatest advantage in the game.  In most situations, arcanists will rule divine casters with Time Stop, Bigby's &amp; IGMS which is usually where the server design comes in to try to balance things out a bit for PvP.<br/>\n<br/>\nTBH, though I have built for PvP, it requires an intimate knowledge of all the specifics of the server to be at all effective. Plus, any combat strategy that may be instinctive to use for one player may be inconvenient or downright unmanageable for another.  So that means lots and lots of trial and error with different variants, each of which is designed specifically to counter the strengths of another player's toon.<br/>\n<br/>\nThere is no such build that is maximized for both PvM &amp; PvP.  Impossible.  Vs. AI or vs. player control are vastly different build targets.<br/>\n<br/>\nA half-orc makes a decent cleric but sucks in the arcane arts.  Seems you want to ditch your outcast, though, so that may not be an issue.  A high WIS hasted DP battle Cleric 16/Monk 4 would have the fastest and best attack progression if you can get it approved.  BTW, you could design a build to dump to monk anywhere in the build as long as the approval process is completed by level 10 or so.  It may not be as easy to level but will end up with the same potential.  Just one example of building a toon while keeping your options open as you go.</div>"
    },
    {
      "author": "DMTaino",
      "avatar": "no_avatar.png",
      "timestamp": "3:32 AM - Feb 27, 2012",
      "content": "<div>[nods in agreement] Those three classes will work but since Wiz and Sor are a good class leveling them will be a pain/hard and very long. After posting the above I went and read a bit more and Monks/Paladins are and cant multi-class.   ... So the Cleric/Monk is out.. thinking of just going straight out for as you said \"Battle Cleric\".<br/>\n<br/>\nThanks for your advise and assistance. Now to see if someone can assists me building one.. Or at lease the beginning stats.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:12 PM - Feb 27, 2012",
      "content": "<div>Maybe a <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build301814.html\" rel=\"noreferrer\" target=\"_blank\"><strong>Melee Mage</strong></a> would prove to be a good balance between PvP and PvM.<br/>\nI'm not the best builder around, but I threw together a decent self-buffing melee Cleric for you.<br/>\n<br/>\nLevel 20 Pure Melee Cleric (Cleric 20)<br/>\nHuman, Any Alignment<br/>\nPlayable 1 - 20, PvM<br/>\n<br/>\nAbilities:<br/>\nSTR: 16 (18)<br/>\nDEX: 8<br/>\nCON: 14<br/>\nWIS: 16 (19)<br/>\nINT: 12<br/>\nCHA: 8<br/>\n<br/>\nLeveling Guide:<br/>\nHuman: (Quick to Master)<br/>\n01: Cleric(1): Power Attack, Cleave, Domain Magic, Domain Trickery<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Weapon Focus: Morning Star<br/>\n04: Cleric(4): STR+1, (STR=17)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): Extend Spell<br/>\n07: Cleric(7)<br/>\n08: Cleric(8): WIS+1, (WIS=17)<br/>\n09: Cleric(9): Blind Fight<br/>\n10: Cleric(10)<br/>\n11: Cleric(11)<br/>\n12: Cleric(12): WIS+1, Improved Critical: Morning Star, (WIS=18)<br/>\n13: Cleric(13)<br/>\n14: Cleric(14)<br/>\n15: Cleric(15): Empower Spell<br/>\n16: Cleric(16): WIS+1, (WIS=19)<br/>\n17: Cleric(17)<br/>\n18: Cleric(18): Great Cleave<br/>\n19: Cleric(19)<br/>\n20: Cleric(20): STR+1, (STR=18)<br/>\n<br/>\nStats:<br/>\nHitpoints: 200<br/>\nSkillpoints: 92<br/>\nSaving Throws (Fortitude/Will/Reflex): 14/16/5<br/>\nSaving Throw bonuses: Spells: +4<br/>\nBAB: 15<br/>\nAB (max, naked): 20 (melee), 14 (ranged)<br/>\nAC (naked/mundane armor/shield only): 11/22<br/>\nSpell Casting: Cleric(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nSkills:<br/>\nConcentration 23(25), Heal 17(21), Lore 13(14), Spellcraft 19(20), Tumble 10(9)<br/>\n<br/>\n01: Concentration(4), Heal(4), Lore(4), Spellcraft(4)<br/>\n02: Concentration(1), Heal(1), Lore(1), Spellcraft(1)<br/>\n03: Concentration(1), Spellcraft(1), Tumble(1)<br/>\n04: Concentration(1), Spellcraft(1), Tumble(1)<br/>\n05: Concentration(1), Spellcraft(1), Tumble(1)<br/>\n06: Concentration(1), Spellcraft(1), Tumble(1)<br/>\n07: Concentration(1), Spellcraft(1), Tumble(1)<br/>\n08: Concentration(1), Heal(1), Lore(1), Spellcraft(1)<br/>\n09: Concentration(1), Heal(1), Lore(1), Spellcraft(1)<br/>\n10: Concentration(1), Heal(1), Lore(1), Spellcraft(1)<br/>\n11: Concentration(1), Heal(1), Lore(1), Spellcraft(1)<br/>\n12: Concentration(1), Heal(1), Lore(1), Spellcraft(1)<br/>\n13: Concentration(1), Heal(1), Spellcraft(1), Save(1)<br/>\n14: Concentration(1), Spellcraft(1), Tumble(1), Save(1)<br/>\n15: Concentration(1), Spellcraft(1), Tumble(1), Save(1)<br/>\n16: Concentration(1), Spellcraft(1), Tumble(1), Save(1)<br/>\n17: Concentration(1), Tumble(2)<br/>\n18: Concentration(1), Heal(2), Lore(1)<br/>\n19: Concentration(1), Heal(2), Lore(1)<br/>\n20: Concentration(1), Heal(2), Lore(1)<br/>\n<br/>\nYour Wisdom reaches 19 just in time to allow you to cast level 9 spells.<br/>\nPower Attack will help you bash locked chests and doors, and is required for Cleave.<br/>\nCleave gives you an extra attack when you kill an enemy, which helps out early on when you only have 1 attack.<br/>\nMagic domain gives you Mage Armor and Stone Skin, two buffs that should be handy in a low magic world.<br/>\nTrickery domain gives you the very valuable Improved Invisibility spell.<br/>\nIn my opinion the morning star is the best choice of the few weapons that a Cleric has available without cross-classing as a Fighter or spending a feat on Martial or Exotic weapon prowess.<br/>\nExtend Spell will help your buffs last longer, which is handy early on when they expire so quickly.<br/>\nBlind Fight will help you against stealthy or invisible enemies.<br/>\nImproved Critical will make your weapon a little bit more effective.<br/>\nEmpower Spell will let you make your buffs do up to 1.5 times as much for you.<br/>\nGreat Cleave will give additional attacks when you are surrounded by enemies that you can kill in 1 attack.<br/>\n<br/>\nNow, we go on to the skills:<br/>\nConcentration will help you cast spells in combat.<br/>\nHeal will let you heal more health with a healing kit.<br/>\nLore will let you identify items without having to spend money at a vendor.<br/>\nSpellcraft will give you a bonus to saves against spells.<br/>\nTumble will give you some extra Armor Class.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:45 PM - Feb 27, 2012",
      "content": "<div>@the OP: Now that you've settled on an actual build request, i.e. Battle cleric 20, you would be better served to post the request in the appropriate forum dedicated to that purpose. (Unfortunately, I do not have admin privileges or I would move it there myself.) <br/>\n<br/>\nUntil then, I recommend HIGHLY pumping WIS (mucho slots &amp; DC) and exploiting Divine Power.  Dagger is the probably the best critting simple weapon available (yes... elemental, divine &amp; magic damage will crit). In a low-magic environment Trickery &amp; Travel domains are the best bang for your divine buck.<br/>\n<br/>\nBTW, check to see if Ravenloft provides standard crafting materials.  If so, consider the Craft Wand feat to make the severely-exploitive HoG wands.  In any case, compile all the cleric-specific (class and spell) server tweaks before you repost rather than dribbling in information we may need to help better, please.</div>"
    }
  ]
}