{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "252",
  "name": "High Vs Medium Vs Low Magic Worlds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/high-vs-medium-vs-low-magic-worlds-t2350427.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": "4",
  "views": "3.3K",
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:57 AM - Feb 24, 2014",
      "content": "<div>As per topic tittle, discuss freely about the merits of each one and what do you believe is better for playing in modern NwN.<br/>\n<br/>\nIf you have actual examples from the worlds you play in or modules please post those too.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:32 PM - Feb 24, 2014",
      "content": "<div>Allright, someone is steering our creativity huh?<br/>\n<br/>\nVery good topic to discuss. Let me weigh in here then.<br/>\n<br/>\n- Low Magic worlds (+1 to +4): I haven't had any online experience with this kind of world, but I've played a couple of low-magic SP modules. These environments tend to favor the self-buffers and casters, because meleers and stealthers need either items or scrolls to be competitive. Clerics due to the buffs and Druids due to the shapeshifting power are extremely powerful. Also, immunities are very hard to come by, so class features such as spell focus in disabling spells can have a higher impact in combat efficiency.<br/>\n<br/>\n- Mid-magic (+5 to +7): To me these worlds are the ones closest to balance. Items in these worlds tend to rival the bonuses achieved with buffs, maybe go above them in epics, but class features tend to still be effective and make a difference in combat. Here, the gap in power between classes as a whole is reduced, items give warriors their fair share of power, but self-buffers and casters are still effective. However, depending on the immunities available, some kinds of spells may be hard to use.<br/>\n<br/>\n- High-magic (+8 and above): These worlds tend to favor fighter-classes, heavy meleers, because they can get the AC that they can't reach through class features from items. I don't like these worlds that much because it's essentially a treasure hunt. Whoever has the best items is the best character. Why would you worry about 6 extra damage from Epic Weapon Specialization if you have a +10 sword with 2d12 divine and 2d12 cold damage? Lots of immunities make casters' lives impossible, and there are lots of battles of 20s given that the higher the enhancement level, the higher the AC to AB ratio (more points of AC gained than AB in a proportion of 5 to 1 (natural, armor, deflection, dodge, shield AC vs weapon AB)).<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:41 PM - Feb 24, 2014",
      "content": "<div>NWN is based on a tabletop game where a group of people play different characters that form an adventuring party under the guidance of a dungeon master. The different character types are supposed to have strengths and weaknesses and supplement each other when they face challenges. A skilled DM will present tasks where the different characters get their moments where they can shine.<br/>\nThe closest you come to that in NWN is multiplayer with an active DM online. That is where I have had my best experiences with the game, both as player and as DM.<br/>\n<br/>\nSingle player and solo play online is different in that all quests are pre-scripted and interaction is more predictable. You can have henchmen and summons to replace your fellow players, but you are often on your own and need a more versatile character to be able to handle what you will face. I believe the game (the tabletop game) was never ment to be played this way, and was not balanced for it. Just as it was never balanced for PvP.<br/>\n<br/>\nDifferent levels of magic have impact on what classes are good. In low magic the caster classes are best, in high magic environments the equipment outshines what you can do with spells, favouring the warrior classes.<br/>\nMany server admins feel that this becomes a problem when everybody play as cleric or melee mage on their persistant world, or any other class combination for that sake. So they try to \"BALANCE\" the classes by different means, often creating more problems than they manage to solve. Whenever they change things, part of the player base start to protest because \"their\" main/favourite character will suffer from the changes, and you see flame wars erupting in the forums, players quitting the server etc. etc.<br/>\n<br/>\nIf you ask what is better, I will say that neither is perfectly balanced for single player, but I thrive best when the magic level is at +3 to +5 and the encounters are balanced for that. But I also enjoy low magic as long as we have a priest, bard or mage in the party that can buff the warriors.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:45 PM - Feb 24, 2014",
      "content": "<div>OK, first to highlight two very good points from both of you since i could not say it better myself.<br/>\n<br/>\n1) Max post about the high magic worlds is spot on.<br/>\n<br/>\n2) Mick's post about the co-operation of classes is what is meant to be from the beginning. Classes are not meant to be balanced against each other but against the monsters. This is what many young players cannot comprehend.<br/>\nAlso Mick said something about the balance fixes by many World leaders, most of these fixes i have seen - cause more troubles than solve them. Still they are the owners of what they have created so they are free to do as they choose and not much can be said about it.<br/>\n<br/>\nMore about the Low Vs High magic.<br/>\n<br/>\nLow magic environments are the heaven of Casters by a large - huge even margin. No need to explain more about that, i imagine everyone here understands what i mean. There is simply no comparison. Thankfuly often these worlds are roleplaying focused so it doesnt matter in the large scale. It's rare if even possible to see an \"action\" PW that is low magic. Still i would prefer a low magic world than a High magic one.<br/>\n<br/>\nMedium magic PW's are where the most enjoyable in my opinion NwN experience can be found, (+5/+6) items with a few properties that are carefully selected with a slight boost in the weapons category i think it balances almost perfect withthe system presented in NwN. Weapons must be slightly better than the defensive items because you only have one weapon slot to increase AB while there are five defensive slots to increase AC. Most of the class feautures are important in those worlds are preserved but the fighting types have a chance now against the overpowered casters. Now if you enable HCR rules the casters become about equal to non-casters since they cannot rest whevener they like. HCR also balances things generally in favor of the monsters than the players, since the monsters are there typicaly for a single encounter while the players have to go through many of them to achieve their goal.<br/>\n<br/>\nHigh magic worlds, or Monty Haul types are very nice! At start... It is very nice to see these kind of items ---&gt; <a class=\"postlink\" href=\"http://wiki.hgweb.org/wiki/Plate_of_the_Legendary_Master\" rel=\"noreferrer\" target=\"_blank\">http://wiki.hgweb.org/wiki/Plate_of_the ... ary_Master</a><br/>\nbut in the long term they just change the game to a simple clash of swords. Since there are too many immunities and whole class feautures are incorporated into items so the only thing that matters in the end is pure physical damage and since the AC plays a very important role so you can achieve the highest number, you almost always see sword &amp; board types running arround. I guess nobody wants to throw away these enhancements ---&gt; <a class=\"postlink\" href=\"http://wiki.hgweb.org/wiki/Conquest_Through_Intimidation\" rel=\"noreferrer\" target=\"_blank\">http://wiki.hgweb.org/wiki/Conquest_Thr ... timidation</a><br/>\nBest type of builds in high magic worlds are DEX based WM's and generally anything that is DEX - based since STR builds offer almost nothing in these settings.<br/>\n<br/>\n* Higher Ground actually maybe the best High Magic PW as it is nice balaned for these changes somehow. Many house rules are incorporated into the system to make it work but even then, the general principles are not changed.<br/>\n<br/>\n** High magic works in single player mode though. Aielund and Lord of Terror both, offer some high magic items to the player but due to the nature of single player mode (a single protagonist) these changes work much better there than a PW.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:55 PM - Feb 24, 2014",
      "content": "<div>One thing more to say about magic items in general,<br/>\n<br/>\nMagic items are what steer imagination, is what players seek to find and strive to own. So magic items in general have to be plentiful and original (without being overpowered). I do not understand the players that want them to eclipse and remain nothing but plain low level items. First, fighting classes cannot operate fully without them and second that makes the game bland after a while. I say that after a long discussion we had on WoG about them. Again, plentiful &amp; original does not mean necessarily overpowered.<br/>\n<br/>\nFeel free to discuss about that too.</div>"
    }
  ]
}