{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "447",
  "name": "Necromancer Cleric (Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/necromancer-cleric-arelith-t2292217.html",
  "author": "Black Mage",
  "avatar": "no_avatar.png",
  "replies": "7",
  "views": "11.6K",
  "posts": [
    {
      "author": "Black Mage",
      "avatar": "no_avatar.png",
      "timestamp": "2:04 PM - Oct 11, 2012",
      "content": "<div>Hello!<br/>\n<br/>\nI know I’ve never actually posted here myself (Even though I’ve been here to read a few suggestions for builds in the past to see if I could learn anything) But I was hoping to ask for help with a PvP-focused Cleric  for the level 30 cap Arelith server. It’s RP based and I’m not a very good builder (I’ve been playing D&amp;D and NWN less than four months) but for the next character I have in mind, everything and its mother,  good or evil is going to try and PvP this character so  I was really appreciate any advice, tips or builds you could offer please? <br/>\n<br/>\nI was going to try and make an Evil Cleric (He does need to be LN,LE or NE for a certain god, but domains are free to choose from) with Epic Spell Focus Necromancy, this being because on Arelith Spell focuses have bonus effects (Evocation focuses boost hellball and greater ruin, Conjuration works like the animal domain and also boosts the planar binding, gate and epic summon spells (also lets you teleport other PC’s to your location should they agree), Abjuration makes the shield spell block the magic missile spells, boosts dispelling magic and gives a ward ability…Necromancy allows you to have two undead created by any of the undead spells as henchmen in addition to your normal summon). Undead are a big part of this character and I was also considering “Craft Wand” to make money in-game (The production costs are a third of the norm in Arelith) but that’s not essential.<br/>\n<br/>\nNow…The problem is after knowing I want GSF Necro I have no idea how to build this guy to be able to defend himself against other characters. I thought at first of just going up to level 30 Cleric and taking all the Evocation and Necromancy focuses for undead friends and a super hellball/greater ruin/Implosion.<br/>\n<br/>\nThen I wondered if adding Monk (Cleric 17/Monk3 then Cleric8/Monk1/Cleric1) would help him last longer in a fight because Kama’s, a good stealth ability as well as being able to just wear robes would fit in very nicely with this guys theme as he’s going to be follow the Mulhorundi/rip-off-of-ancient egypts gods, so walking around like an Egyptian mystic with strange weapons would be cool, but survivability is the most important thing above all else. This guy needs to be able to kick ass or be able to escape and I’m not sure if Dual-wielding, Rogue sneak attacks/stealth, casting or what is the best way to do that (I know..Im being vague but I have been musing on this for a while and I’m still none the wiser ).<br/>\n<br/>\nNow…Race wise  I personally like half-elves (On arelith there is a language system and an entire city where only elves are allowed to visit, half elves get an extra language and the ability to visit the said city) but I realise humans are better all round for the most part so that’s not a worry (For the god I have in mind for my character to follow the cleric does need to be human, half-elf or half-orc (I’ve never played the latter so that’s an even bigger mystery to me) .<br/>\n<br/>\nAlso, they have a gift system (maximum of three gifts) which in exchange for taking a higher ECL (you can still reach level 30, just takes even longer to get there) your character can get bonuses like an extra +3 to hide &amp; move silently, +5 Preform, +2 to one of his ability scores (So for +1 ECL you could bring your characters DEX from 16 to 18 at level 1 along with two other stats) that sort of thing. I think it’s worth taking them because I do intend to keep this character, so the extra time it takes to level won’t bother me Edit: I could use one of the gifts to use elf, halfling or gnome as a race for this particular god (at a cost of 0.5 ecl) but again...Not sure if it's worth it or not.<br/>\n<br/>\nI’ve never tried melee combat but I am fairly certain the highest AB weapon you can find is +3, so GMW does give a better bonus even if it does not stack with Darkfire.<br/>\n<br/>\nBanned Classes: Purple Dragon Knight,  Shifter, Red Dragon Disciple and Pale Master (The second pair have special requirements and the Pale Master requires a high “Role Play Rating” which I don’t have yet. I can apply to take Prestige Classes but again, my RPR is so low I can only have one. All the base Classes are free however  but when taking a new class I have to take three levels consecutively, but afterwards I can take them and my former class whenever I want (So while 3 Cleric/3 Monk and then 1 Rogue is ok, 29 Wizard/ 1 Rogue isn’t).<br/>\n<br/>\nBanned Feats: I think Devastating Critical is banned, as is Hide in plain sight (ShadowDancers gain +1 hide with every level and have a longer shadow evade duration instead)…Other than that I think the others are fine so long as the requirements are met (Ability score Gifts can be used to meet requirements).<br/>\n<br/>\nItems: Umm…No permanent haste on items comes to mind, as well as almost all good magic items have to be bought off players who have craft item feats/ Server trade skills.<br/>\n<br/>\nThanks for reading this, does anyone have any ideas for a build or what way I should head? PvE I can deal with, PvP or the ability to flee (Stealth,Monk speed, Travel domain haste..that sort of thing) is the big one for me (Because being a big bad evil necromancer, a lot of people good and evil are going to try and kill him once they realise what he is)<br/>\n<br/>\nEdit: One extra option for a cleric...They can take a \"Path of the Healer\" ability for free at character creation. The gain a free Cure crit wounds x5 and raise dead x3 per rest in exchange for only being able to use simple weapons (So no Martial or Exotic weapons) and being unable to use armour (Sheilds are still fine). I'm not sure about that but it's another potential extra. He would need to be LN to take it though.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:26 PM - Oct 11, 2012",
      "content": "<div>Good description so you'll get some useful suggestions, I'm sure.  Several of us have some experience building for Arelith though most that play on the server tend to be requesters rather than build dissectors, but still have a lot of server-specific advice to lend (In other words, whatever you design and use will likely not remain a secret for long  ).<br/>\n<br/>\nBefore taking this further, what would you prefer... a caster build or a melee build?  It matters big time for PvP.  Sure, a dual-purpose cleric can be manufactured but either DCs will be adversely affected or your attack power will suffer.  In PvP it usually comes down to very slight differences between attack vs. defense rolls between you and the foe so optimization is key.  Also, you may need to build one or more variants depending on the opposition.  Can you say mage? (ala... is Time Stop spell the default effect on Arelith?)  That will probably be your biggest hurdle in PvP, at least historically it SHOULD be.  High AB-high APR-high damage melee enemies next.  And throw in an AA to round things out, another pesky PvP adversary even at Level 30.<br/>\n<br/>\nAlso, you mentioned melee enough to assume you prefer a melee version over caster but seem to be waffling on whether the kama is the preferred weapon (the reference at the end to a \"free\" bonus with simple weapon confuses my own conceptualization).  Please make a choice.  It doesn't matter whether you have little experience in melee or not, it's always fun to learn an unfamiliar proficiency.  IMO if your main focus is to be necromancy, then design and play it as a necromancer with weaponry a distinct secondary consideration.  Just my first impression of the concept.<br/>\n<br/>\nWith many cleric levels and only 30 levels to play with, I would rule out dual-wield altogether with the feat starvation of the cleric class.  Only a fighter or CoT combo would help solve the prereqs issue and it will seriously dilute your casting prowess to do so.  You will probably need the shield AC anyway or expect to be hit A LOT.  Serious enemy WM scythe builds come to mind along those lines.  Or those blasted recipro-shielded, high CON mages are another.  I'd figure on keeping a shield handy and using my pre &amp; in-combat buffs primarily on my summons and hench, acting as a strong support cleric to keep them alive as long as possible.<br/>\n<br/>\nThe main problem with undead summons is restoring their HPs during combat.  That's where Harm SHOULD help, IIRC, though not sure how Arelith has scripted negative energy effects with party members.  Do you know?  Typically, negative traps will always hurt undead but otherwise, negative should heal them.<br/>\n<br/>\nSo, at this point, if you could focus in a bit tighter on what you would prefer/plan to play with, it would help us (especially we old goats) form an effective combat scheme.  Deal?</div>"
    },
    {
      "author": "Black Mage",
      "avatar": "no_avatar.png",
      "timestamp": "4:08 PM - Oct 11, 2012",
      "content": "<div>Hey again, Thanks for the feedback, I appreciate it ^_^<br/>\n<br/>\n<br/>\nWell...For the whole mystic necromancer flavour I'm trying to go for I think a focus on casting would help as so far I've kinda always gone for the support character (Ala my favourite as the \"white mage of final fantasy\" , sitting on the back row tossing out buffs, healing, summons and status effects and never really taking the frontline). Because you can get multiple summons for a meatwall its one of the reasons undead appeal to me, one casting at epic levels means an instant party of two mummies and a Balor/dragon knight/Mummy dust (the mummy dust creature doesn't count as an undead henchman for some reason) if I want another summon. I've also heard a rumour there is some In Game method to get four undead plus a summon but I've no clue how to do that, or if it's even true .<br/>\n<br/>\n I know I was waffling about Melee (sorry XD) , but that was because a lot of the higher level characters my character is likely to be fighting are Paladins, Weapon Masters (of the scimitar and  Scythe varieties), Blackguards and Rogue/Monks and I wasn't certain what the best angle to fend them off from was. I do personally kinda prefer Casters though (Especially if they have the stealth skills to ambush or slide around enemies that are too much to take on..The idea of being able to slide behind and enemy party and then charge them down with mummies from behind strikes me as quite funny now that I think about it  ).<br/>\n<br/>\nInterestingly Time stop dosent appear to be the \"go to\" for surface characters. I've only ever seen the drow use it (And \"surface\" characters don't get to see them too often thankfully) and one Elf use it, and I think it's been changed in that it no longer effects the entire server (Just the one area) and has a \"cool down\" period of 240 seconds independent of resting where it cannot be used again). For high level mage spells Wail of the Banshee and Weird seem to be the flavours of the day (I think that's because spell levels 7,8,9 need spell components to be used, and they aren't cheap so players are a bit iffy about using them unless they have high appraise skills) Clerics and Druids don't have that issue because they use \"Piety\" for their best spells, which is free to regain at altars and temples.<br/>\n<br/>\nI have no idea if it's a bug or not (I doubt it is) but healing kits can be used to heal undead party members, as can negative energy spells (Negative energy Traps still hurt t undead). I'm pretty sure Harm still has it's original effect and hasn't been nerfed as well.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:58 PM - Oct 11, 2012",
      "content": "<div>If I have time, during this weekend, I may be able to help you out. From what you're describing, you'll be better off with a Cleric / Monk with that Healing thing.<br/>\n<br/>\nI can build you something shortly and I can assure you that it will be GODLY if used properly. Gimme a couple of days if I can't finish it now.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:12 PM - Oct 11, 2012",
      "content": "<div>You may use Shuriken for the \"cool\" factor and you should add +2 to his Wisdom. This is a very good caster cleric with a little bit of Range power on the side:<br/>\n<br/>\nCleric(23), Monk(4), Rogue(3), Half-Elf<br/>\n<br/>\nSTR: 8<br/>\nDEX: 14<br/>\nCON: 10<br/>\nWIS: 18 (26)<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHalf-Elf: (Hardiness vs. Enchantments, Low-light Vision, Partial Skill Affinity: Listen, Partial Skill Affinity: Search, Partial Skill Affinity: Spot, Sleeplessness)<br/>\n01: Cleric(1): Point Blank Shot, Domain Travel, Domain Trickery<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Called Shot<br/>\n04: Cleric(4): WIS+1, (WIS=19)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): Zen Archery<br/>\n07: Cleric(7)<br/>\n08: Cleric(8): WIS+1, (WIS=20)<br/>\n09: Cleric(9): Extend Spell<br/>\n10: Cleric(10)<br/>\n11: Cleric(11)<br/>\n12: Cleric(12): WIS+1, Spell Focus: Necromancy, (WIS=21)<br/>\n13: Cleric(13)<br/>\n14: Cleric(14)<br/>\n15: Cleric(15): Greater Spell Focus: Necromancy<br/>\n16: Monk(1): WIS+1, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}, (WIS=22)<br/>\n17: Monk(2): {Deflect Arrows}<br/>\n18: Monk(3): Rapid Shot<br/>\n19: Cleric(16)<br/>\n20: Monk(4): WIS+1, (WIS=23)<br/>\n21: Cleric(17): Armor Skin<br/>\n22: Cleric(18)<br/>\n23: Cleric(19)<br/>\n24: Cleric(20): WIS+1, Epic Spell Focus: Necromancy, (WIS=24)<br/>\n25: Rogue(1)<br/>\n26: Rogue(2)<br/>\n27: Rogue(3): Epic Prowess, {Uncanny Dodge I}<br/>\n28: Cleric(21): WIS+1, (WIS=25)<br/>\n29: Cleric(22)<br/>\n30: Cleric(23): Epic Spell: Mummy Dust, Great Wisdom I, (WIS=26)<br/>\n<br/>\nHitpoints: 234<br/>\nSkillpoints: 158<br/>\nSaving Throws (Fortitude/Will/Reflex): 19/27/16<br/>\nSaving Throw bonuses: Spells: +7, Mind Effects: +4<br/>\nBAB: 20<br/>\nAB (max, naked): 20 (melee), 29 (ranged)<br/>\nAC (naked/mundane armor/shield only): 28/30<br/>\nSpell Casting: Cleric(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 33(33), Heal 33(41), Open Lock 12(14), Spellcraft 33(35), Tumble 30(32), UMD 16(15)<br/>\n<br/>\n01: Concentration(4), Heal(4), Spellcraft(4), Save(4), <br/>\n02: Concentration(1), Heal(1), Spellcraft(1), Save(5), <br/>\n03: Concentration(1), Heal(1), Spellcraft(1), Save(6), <br/>\n04: Concentration(1), Heal(1), Spellcraft(1), Save(7), <br/>\n05: Concentration(1), Heal(1), Spellcraft(1), Save(8), <br/>\n06: Concentration(1), Heal(1), Spellcraft(1), Save(9), <br/>\n07: Concentration(1), Heal(1), Spellcraft(1), Save(10), <br/>\n08: Concentration(1), Heal(1), Spellcraft(1), Save(11), <br/>\n09: Concentration(1), Heal(1), Spellcraft(1), Save(12), <br/>\n10: Concentration(1), Heal(1), Spellcraft(1), Save(13), <br/>\n11: Concentration(1), Heal(1), Spellcraft(1), Save(14), <br/>\n12: Concentration(1), Heal(1), Spellcraft(1), Save(15), <br/>\n13: Concentration(1), Heal(1), Spellcraft(1), Save(16), <br/>\n14: Concentration(1), Heal(1), Spellcraft(1), Save(17), <br/>\n15: Concentration(1), Heal(1), Spellcraft(1), Save(18), <br/>\n16: Concentration(1), Heal(1), Tumble(19), Save(3), <br/>\n17: Concentration(1), Heal(1), Tumble(1), Save(6), <br/>\n18: Concentration(1), Heal(1), Tumble(1), Save(9), <br/>\n19: Concentration(1), Heal(1), Spellcraft(4), Save(7), <br/>\n20: Concentration(1), Heal(1), Tumble(2), Save(9), <br/>\n21: Concentration(1), Heal(1), Spellcraft(2), Save(9), <br/>\n22: Concentration(1), Heal(1), Spellcraft(1), Save(10), <br/>\n23: Concentration(1), Heal(1), Spellcraft(1), Save(11), <br/>\n24: Concentration(1), Heal(1), Spellcraft(1), Save(12), <br/>\n25: Heal(1), Tumble(5), UMD(16), <br/>\n26: Heal(1), Open Lock(8), Tumble(1), <br/>\n27: Heal(1), Open Lock(3), Tumble(1), Save(5), <br/>\n28: Concentration(4), Heal(1), Spellcraft(4), <br/>\n29: Concentration(1), Heal(1), Spellcraft(1), Save(1), <br/>\n30: Concentration(1), Heal(1), Open Lock(1), Spellcraft(1),</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:35 PM - Oct 11, 2012",
      "content": "<div>I like Max's range idea.  The rogue tertiary is unusual.  Zen archery would also be my own synergy preference.  Without any weapon focus you are free to employ any range weapon you like, though I would prefer sling over any tossed weapon and take advantage of the Mighty damage when you use DP, doubling the base damage plus the potential of finding useful enhancements (like Mighty).  Usually bullet stacks are larger than darts or shurikens, as well. This would be a server-specific decision depending on the properties available on the ammo.  A few other considerations...<br/>\n<br/>\nMy first idea is to use the Craft Wand feat to create an inventory of Negative Energy Burst wands to use in your attack.  That would mean Evil Domain which seems to be a \"natural\" for the theme of the toon you are seeking to contrive.  The upside is that it will heal and increase the STR (and AB, of course) of your undead party helpers while reducing the STR of the opponents at the same time since all combatants SHOULD all be within the effective AoE of the spell when it is applied.  A few downsides is that the damage will not be all that much (but can be spammed), no better than half compared to the caster slot version (unless Arelith uses a custom algorithm to establish caster level on items) and ineffectiveness against any Neg NRG immunes (server-specific items &amp; cleric buffs).  And yes, Evil Domain will cost either Trickery or Travel to apply it.... the cost of strengthening the build's theme and optimizing the party members' potential.  IMO, especially in light of the range attack, neither AC nor concealment will become much of an issue except against AA's or any non-Zen archer who should succumb easily to Fort save spells.<br/>\n<br/>\nSince the concept is relying heavily upon the undead members, your main hurdle will be enemy turning.  Not a problem with any except pallies, BG's and *gulp* other clerics.  It's a serious problem, though, unless the henchs have some high server-specific TR rating that is not default.  Not sure even what the TR is for the Warrior Lord from Mummy Dust.  You may want to check one out in a trainer to see what it is before selecting that feat.  Otherwise, your summons will be fighting each other.    Still, seems to be worth consideration.<br/>\n<br/>\nSpell Focus/GSF/ESF (with at least Cleric 17) also seems to be a no-brainer (as Max worked in nicely  ).  <br/>\n<br/>\nI think your instinct about the synergy using monk at is well-founded with the high WIS needed to elevate the DCs enough to be effective and had considered Clc 24/ Mnk 6 first, though with the Zen Archery AB, those last 3 monk levels will provide KD/IKD, feats you probably won't use without melee attack.  Again, I like the rogue tertiary.  Max knows what an addict of UMD I am, I suspect.<br/>\n<br/>\nI wouldn't get too tied into personal biases (like preferring half-elf race) since, unless they contribute something that help optimize the build, they are unnecessary baggage to haul around.  In PvP, you will pay dearly for your unique preferences, even the key one here, evil necromancy-based cleric.  Human will at least yield that Craft Wand feat which should be very useful as long as your party is alive and kicking and provide 30 more skill points to help establish that stealth presence you mentioned.  Move Silently would be my first choice in that eventuality which would require the rogue levels to appear at the end.<br/>\n<br/>\nThese are my first impressions, without beginning to work out a detailed schedule, but at least the ball is rolling and may spark some more input in my absence. (I'll be checking back at some point so try to hash out something along the lines of what has been suggested, if you can... assuming you can use Kamiryn's CBC on your machine.)</div>"
    },
    {
      "author": "Black Mage",
      "avatar": "no_avatar.png",
      "timestamp": "2:31 AM - Oct 12, 2012",
      "content": "<div>Thanks for all the advice (and the build too)!<br/>\nWell…I cant actually get the spreadsheet up on this tablet so I’m gonna work it out, I know it's probably fudged it up a lot but eh..It's a draft I guess <br/>\n<br/>\nCleric(23), Monk(4), Rogue(3), Human<br/>\n<br/>\nSTR: 8<br/>\nDEX: 14 <br/>\nCON: 10<br/>\nWIS: 18 + 2 Gift (28)<br/>\nINT: 14 (+ 2 Gift? This way I could get Hide and Move Silently)<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master, Spell Focus Necromancy) (There is an item I know of at the start which gives clerics level 3 spell slots earlier than they should get them which in turn unlocks their level 3 spell list, meaning a new character who gets the item is able to summon undead right from the start)<br/>\n01: Cleric(1): Greater Spell Focus, Domain Trickery, Domain Magic (Gives NE Burst and Stoneskin, plus both are cleric domains for the god in question. Is evil still a better option though? It's also a supported domain funnily enough. I picked Trickery over Travel because if I was to take Open Lock, Divine Trickery would pump the stat up even higher...And I might even be able to rob or break into Player owned buildings with a high enough score. That said I've never tried it before, all my other characters are good aligned)<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Point Blank Shot<br/>\n04: Cleric(4): WIS+1, (WIS=21)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): Craft Wand (Mainly to be able to summon Skeleton Chieftains earlier than normal, spell levels haven't been altered)<br/>\n07: Cleric(7)<br/>\n08: Cleric(8): WIS+1, (WIS=22)<br/>\n09: Cleric(9): Called Shot<br/>\n10: Cleric(10)<br/>\n11: Cleric(11)<br/>\n12: Cleric(12): WIS+1, Zen Archery, (WIS=23)<br/>\n13: Cleric(13)<br/>\n14: Cleric(14)<br/>\n15: Cleric(15): Extend Spell<br/>\n16: Monk(1): WIS+1, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}, (WIS=24)<br/>\n17: Monk(2): {Deflect Arrows}<br/>\n18: Monk(3): Rapid Shot<br/>\n19: Cleric(16)<br/>\n20: Monk(4): WIS+1, (WIS=25)<br/>\n21: Cleric(17): Armor Skin<br/>\n22: Cleric(18)<br/>\n23: Cleric(19)<br/>\n24: Cleric(20): WIS+1, Epic Spell Focus: Necromancy, (WIS=26)<br/>\n25: Rogue(1)<br/>\n26: Rogue(2)<br/>\n27: Rogue(3): Epic Prowess, {Uncanny Dodge I}<br/>\n28: Cleric(21): WIS+1, (WIS=27)<br/>\n29: Cleric(22)<br/>\n30: Cleric(23): Epic Spell: Dragon Knight, Great Wisdom I, (WIS=28) (I thought the Dragon Summon while not quite in the theme could be pulled out on those occasions I run into people who have death to undeath , Turning, Smite evil…that sort. I think Every Wizard who can on Arelith has death to undeath, people choose it when levelling up because there is some bug with scrolls associated with it, so it’s the only way they can learn it)…*Gulps*…That never even crossed my mind until now…Uhh….Mabey I should be keeping the undead outside of battle just for fun (How effective is Death to Undeath anyway? I’ve never actually seen it used). <br/>\n<br/>\nHitpoints: 234<br/>\nSkillpoints: 227? (I’m on my Tablet atm so I’m trying to work this out in my head)<br/>\nSaving Throws (Fortitude/Will/Reflex): 19/27/16<br/>\nSaving Throw bonuses: Spells: +7, Mind Effects: +4<br/>\nBAB: 20<br/>\nAB (max, naked): 20 (melee), 29 (ranged)<br/>\nAC (naked/mundane armor/shield only): 28/30<br/>\nSpell Casting: Cleric(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 33(33), Heal 33(41), Open Lock 10 (12),  Spellcraft 33(35), Tumble 30(32), UMD 16(15) (I wasn’t sure where to dump the human skillpoint and I considered taking a gift for INT so I could drag up hide/ms a bit…Again, not sure about it)<br/>\n<br/>\n...I should have really thought about it before, I could still RP this guy as a necromancer without the Necro Focuses but I am starting to wonder if an undead meatwall is more of a burden than a boon. How would you view it? I know from other clerics, even the melee ones that ESF Conjuration and Evocation are popular…As is Divination for a non-combat reason (If your under the effects of Clairvoyance ESF Div lets you type in a name on the chat bar and basically spy on them for sixty seconds, provided they don’t have ESF Abjuration, in which case nothing happens and the other player gets a warning that someone had tried)  <br/>\n<br/>\nAlso…I know this might sound like a silly question, but what weapon would I be using these ranged feats for? (Is it Crossbow and then moving onto Shruiken? I’m just thinking about if getting Weapon Focus Martial or going full elf for a Longbow + Keen senses for the WIS bonus would capitalise on them). It would be fairly easy (Expensive perhaps, although craft wand could help) to enchant ranged weapons to have the mighty property (there is an IG chance system involving gold and Enchantment Focuses which can add properties to items, mighty is pretty cheap though If I remember, even if I do not have a clue where to buy shruiken. Can't be hard to make though)<br/>\n<br/>\nI could summon undead soon as I step of the starter area (After Char gen you get a short quest which brings you up to level 3) but to be honest I'm probably gonna be trying to keep his abilities secret for a while, So I would try and avoid casting or being seen with undead (grinding on the server off-peak hours for a little while basically). So maybe I took them a little early with this draft.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:21 AM - Oct 12, 2012",
      "content": "<div>Yeah, Magic domain probably makes more sense than Evil which was chosen for the thematic aspects.  Mainly, I feel NEB is a great spell to spam while your undead party is attacking a target.  Even if they make the save, your allies will get buffed so it is a no-lose proposition.  I'd still select Travel over Trickery though.  It's handy to have the Trickery benefits but let us be clear about ECB builds.  They are optimized for combat #1 and all else comes in later.  No effect is potentially unbalancing as Haste, so without relative ease of obtaining it as an item prop, it is (or should be) an essential for just about any build.  As a player, naturally, you have the freedom to modify a build to accommodate all the tempting bells and whistles to take advantage of the environments opportunities, but there is a cost to such wheedling... less combat prowess.  And in PvP, you will pay most dearly for the build that attempts to achieve a broad range of flexibility.  Trust me.  Focus on optimizing a single aspect of the build and then, if there is enough resources left, then you can address those secondary \"handy\" elements.  So, instead of sneaking around robbing unsuspecting areas, just kill them all and take their property.  You're supposed to be evil, right?  \"Sneaky\" is not on the alignment scale.   <br/>\n<br/>\nAs far as dealing with Undeath to Death, prebuff all your allies with Extended Silence.  They should be immune to all verbal spells until it expires.  For a level 23 Cleric, that would be almost 5 turns.  Can't speak for casting UtD via scrolls, though.  May want to test that scenario in a trainer, if the foes carry stacks of them around.  Too high level spell for wands, fortunately.<br/>\n<br/>\nYes, Turn Undead can be be a royal PITA for you and there is no counter except to turn them back again.  If it becomes a serious problem (like facing lots of high-level clerics, you may need to either boost your CHA way with items/Eagle's buff and/or fit in Extra Turning to deal with it).  Could be a lot of really interesting PvP battles with other clerics in this respect.  Sounds like fun to me.   <br/>\n<br/>\nVs mages?  I would use another build altogether.  The meleeing allies will likely die on the recipro shields quickly and your toon will die to spammed IGMS or a Bigby.  IMO high cleric vs. high mage is an exercise in futility, but feel free to gather your own consensus.<br/>\n<br/>\nIf you want to beat Listen &amp; Spot checks, then you will need to reach the highest possible MS &amp; Hide levels which forces this build to select rogue at Lvls 28, 29, 30.<br/>\n<br/>\nElf will be a downgrade in race.  Besides losing a feat, 30 skill points and suffer XP penalty it will cost CON/Fort.  You want to pump WIS in a build like this.  The DEX allocated is only a prereq for Rapid Shot or it could be left at base.  (The reflex benefit of 14 DEX is worthwhile, of course.)  You'll probably be wearing heavy armor so only 1 DEX AC will apply in most cases.  I think Elf, though perhaps preferable RP-wise, is a poor choice in this build.<br/>\n<br/>\nYou can place properties on ammo?  That's EXTREMELY odd.  But if so on this server, then it matters even less which range weapon you use.  If you want the benefit of a shield buffed with Magic Vestment, it will need to be a one handed one like darts, shurikens or sling/bullets, not xbow.  I know that Mighty is a common prop on slings but never seen it on any ammo before.  Repeating... the benefit of using a sling is that properties can be found on 2 different items rather than one.  But enhancements won't stack and will default to the highest of the 2 (+3 bullet w/+5 sling will be a +5 attack).<br/>\n<br/>\nTo be perfectly honest, I seldom use summons at all when I play.  I am an XP hog by nature, seeking to level as fast as humanly (or dwarvenly) possible.  Only ever used the skel warriors in low levels to breach certain tough areas (or druid bears at times), but always try to plan it that the summons will inflict critical damage to enemies and then die themselves before the enemies do.  Also, they are handy in absorbing trap damage.   Never tried summons/allies in PvP but doesn't mean it wouldn't be fun to try.  Rather than tread the same road that everybody else has, I've found it is more fun to try an original concept and refine it the best you can.<br/>\n<br/>\nWithout biasing towards your original ~Evil Cleric Necromancer~ theme, it's just a typical battle cleric with either STR or DEX focus and a maintenance level in WIS (max about 19 or 20).  Certainly, you can go that route with kamas if you like but there is simply no room in THIS build for Weapon Focus.  Max's idea to use a 1H/shield range attack as a support attack while displaced from the inner core of conflict is a sound one for a caster build.  I've seen builds similar to this before that were not focused on undead allies, but it should work the same.  You'll need to practice managing your allies which is not an easy feat.  Don't expect instant gratification when you try something this unusual against well-established recipes.  It seems a sound concept to me, but custom environments can make or break sound concepts based on their tweaks.  <br/>\n<br/>\nGood luck developing it!</div>"
    }
  ]
}