{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "668",
  "name": "More Balanced Blood and Faith? (Cleric 28 / Bard 2 / RDD 10)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/more-balanced-blood-and-faith-cleric-28-bard-2-rdd-t2355384.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "5",
  "views": "2.2K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:04 PM - Mar 05, 2020",
      "content": "<div><strong>More Balanced Blood and Faith ?</strong><br/>\n<br/>\nCleric / Bard / RDD is a very powerful class combination<br/>\n<br/>\nI've had a look at <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build243768.html\" rel=\"noreferrer\" target=\"_blank\">Mithdradates's Blood and Faith again</a>, written in 2006<br/>\nHe was very clear on what he felt the weaknesses were:<br/>\n- average HP<br/>\n- average fort save<br/>\n- average will save<br/>\n- poor reflex save<br/>\n<br/>\nIn many ways how clear he was made my life much easier as to how the build could be improved upon<br/>\n<br/>\nI increased the HP by 80 in this build to a very respectable 480 (720 capped) by increasing Con by 2 at the cost of 2 strength and 1 wisdom (I delay lvl 9 spells to level 23)<br/>\nI also increased the Fort save by 6 to a very respectable 31 (40) by swapping Epic Prowess for Epic Fortitude. It provides extra protection against implosion, petrify, devastating critical, and other nasties if your death ward gets stripped by Mords.<br/>\nThe Will save I left alone as the build has undispellable extended clarity available as well as UMD.<br/>\nThe reflex save I took Epic Reflexes to buff it to 19 (28) [edited]<br/>\n<br/>\nIt cost me 2 Str to make these changes which I was fine with, as the build ends on an even Str modifier (34)<br/>\nThe Base AB was 40, which is great for a cleric who can boost it to 66 pretty easily. I was unsure whether that 1 AB from Epic Prowess would have made the build more powerful compared to extra fortitude saves apart from the awesome wow factor. If the buffs get dispelled by Mords (or other dispels early game) he is a low warrior, but if they remain, he is a monster.<br/>\n<strong>edit: </strong>chose to go Morning Star for extra AC and another pre-epic feat, although one can always switch a spear if desired for extra damage<br/>\nI also took ESF: Concentration for Word of Faith / Harm during melee combat <br/>\n<br/>\nFeats wise I put Silent Spell and Craft Wand instead of Improved Critical and Improved Knockdown. I felt they gave the build more.<br/>\nTook domains of War [Cat's, Aura of Vitality] and Trickery [Improved Invisibility] (Erythnul)<br/>\n<br/>\nSkills wise I put discipline to 40, maxed concentration, near max spellcraft, tumble 40, UMD 33 modified. Spot is only 12(16) but I am hoping True Seeing and items such as a Watchman's Helm can help with detecting sneakers.<br/>\n<br/>\nI did consider a dwarf version but it lost a lot of skill points so I abandoned that idea.<br/>\nI also considered an EDR III version, however because RDD is obtained late, EDR III is ideally obtained late which is also not ideal either.<br/>\n<br/>\nOther cool stuff might have been ESF: Concentration for lots of harms with the great AB, also Empower Spell, and some ranks in Taunt of course to lower AC to hit them more. Sadly cleric has awful skill points / level.<br/>\n<br/>\nAnyway I have posted this one up for your review and commentary<br/>\n<br/>\nVery much a learning process for me<br/>\n<details><summary>Spoiler</summary>Cleric(28), Bard(2), Red Dragon Disciple(10), Human\n\nDEX: 8\nWIS: 16 (19)\nCHA: 8 (10)\nHuman: (Quick to Master)\n02: Cleric(2)\n04: Cleric(4): STR+1, (STR=16)\n06: Cleric(6): Knockdown\n08: Cleric(8): WIS+1, (WIS=17)\n10: Cleric(10)\n12: Cleric(12): WIS+1, Craft Wand, (WIS=18)\n14: Cleric(14)\n16: Cleric(16): STR+1, (STR=17)\n18: Cleric(18): Weapon Focus: Morning Star\n20: Cleric(20): STR+1, (STR=18)\n22: Cleric(22)\n24: Cleric(24): STR+1, Epic Fortitude, (STR=19)\n26: Red Dragon Disciple(1)\n28: Red Dragon Disciple(3): STR+1, (STR=22)\n30: Red Dragon Disciple(5): Epic Skill Focus: Concentration\n32: Red Dragon Disciple(7): STR+1, (STR=25), (CON=16)\n34: Red Dragon Disciple(9): (INT=16)\n36: Cleric(25): STR+1, Great Strength II, (STR=32)\n38: Cleric(26): Armor Skin\n40: Cleric(28): STR+1, (STR=34)\nHitpoints: 480\nSaving Throws (Fortitude/Will/Reflex): 31/26/19\nBAB: 25\nAC (naked/mundane armor/shield only): 23/34\nAlignment Changes: 0\nConcentration 43(56), Discipline 40(52), Lore 8(13), Open Lock 1(0), Search 5(8), Spellcraft 42(45), Spot 12(16), Tumble 40(39), UMD 33(33)\n\n02: Concentration(1), Lore(1), Spellcraft(1), Save(8), \n04: Concentration(1), Lore(1), Spellcraft(1), Save(12), \n06: Concentration(1), Spellcraft(1), Save(17), \n08: Concentration(1), Spellcraft(1), Save(23), \n10: Concentration(1), Spellcraft(1), Save(29), \n12: Concentration(1), Spellcraft(1), Save(35), \n14: Concentration(1), Spellcraft(1), Save(41), \n16: Concentration(1), Spellcraft(1), Save(47), \n18: Concentration(1), Spellcraft(1), Save(53), \n20: Concentration(1), Spellcraft(1), Save(59), \n22: Concentration(1), Spellcraft(1), Save(65), \n24: Concentration(1), Spellcraft(1), Save(71), \n26: Concentration(1), Discipline(4), \n28: Concentration(1), Discipline(1), Search(3), \n30: Concentration(1), Discipline(1), Spot(3), \n32: Concentration(1), Discipline(1), Spot(3), \n34: Concentration(1), Discipline(1), Save(6), \n36: Concentration(1), Save(15), \n38: Concentration(1), Spellcraft(5), \n40: Concentration(1), Spellcraft(5), \n</details>\n<strong>edit:</strong> updated after Yunim's suggestions, with thanks</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:10 PM - Mar 05, 2020",
      "content": "<div>I’ll review it in more detail later but for now ... Extended Truesight sorts stealth.  <br/>\n<br/>\nLooks good at first blush. I am generally happier playing tighter on HP, but higher HP options are always good on servers with more impacting  death scripts.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "6:09 AM - Mar 06, 2020",
      "content": "<div>I think I will drop Martial Weapon Proficiency and change the weapon focus to Morning Star, which is a good weapon, also has dual types of damage (piercing/bludgeoning) and very much fits thematically with Erythnul. Spear is good too (it has a great x3 crit and gets 1.5 str bonus) as a back up weapon.<br/>\n<br/>\nThis frees up a feat which can be used to take Great Fortitude (to boost the Fort save up further to 32[41]), allowing this guy to manfight with all that HP a lot better now with a Tower Shield. The more I play, the more I value the Fort save, and this guy will have 8 more fort save than the original 24[33] in addition to the 80 extra HP if I make this change. Mostly to deal with implosions and dev crits but death magic too if death ward gets stripped. <br/>\n<br/>\nI like builds with decent (but not over the top) HP and fort saves, it allows the character to 'get in the face' of the enemy much more effectively</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "10:22 AM - Mar 06, 2020",
      "content": "<div>This isn't really what I consider a balanced Cler/RDD, it still focuses on maxing AB but opts for higher HP. To make this a balanced Cler/RDD I suggest lowering the AB in order to improve the other aspects of the build. In low/medium magic worlds the self-buffed AB is already on par with a minmaxed WM, decreasing AB slightly would still result in a build with decent AB.<br/>\n<br/>\nChanging the level layout to Cler26/Bard4/RDD10 lets you have a pre-epic spread of either Cler12/Bard2/RDD6 (best for 40) or Cler18/Bard2 (best for smooth levelling). Cler12/Bard2/RDD6 gives +1 Fort, +3 Ref, and +4 Will at the cost of -1 AB compared to Cler20. It also means you can reach RDD9 at level 23 for more skill points.<br/>\n<br/>\nI would change the starting stats to 14STR/10DEX in order to end on even STR and WIS scores. I wouldn't bother increasing CON by 2, 16 CON and Toughness already gives you 480 HP (476 with Cler26/Bard4/RDD10).<br/>\n<br/>\nI agree with switching to morningstar over halberd, I suggest using the extra feat for either Expertise or Lightning Reflexes. Swapping 4 Great STR feats for Epic Prowess, Epic Reflexes, ESF: Conc and ESF: Disc would make the character much more balanced at the cost of 1 AB and 2 damage. If Discipline isn't important on WoG then stick with the starting stats of 15TR/8DEX and swap ESF: Disc for another Great STR.<br/>\nPersonally I only use ability feats if I'm minmaxing, aiming for a particular ability score, or if I have spare feats. Why bother with +1 STR when you could have +4 to saves or +10 to skills?<br/>\n<br/>\nNaked Stats [Comparison to your build]:<br/>\nAB: 24 (BAB) + 10 (STR) + 4 (Feats) = +38 [-2]<br/>\nAC: 10 (Base) + 8 (Tumble) + 2 (Feats) + 4 (RDD Bonus) + 8 (Armor) + 3 (Shield) = 35 [+1, no difference after buffs]<br/>\nHP: 316 (Base) + 120 (CON) + 40 (Feats) = 476 [-44]<br/>\nFortitude: 23 (Base) + 3 (CON) + 4 (Feats) = 30 [0]<br/>\nReflex: 19 (Base) + 4 (Feats) = 23 (25 with Lightning Reflexes) [+8/+10]<br/>\nWill: 26 (Base) + 5 (WIS) = 31 [+5]<br/>\nConcentration: 43 (Base) + 3 (CON) + 10 (Feats) = 56 [+9]<br/>\nDiscipline: 43 (Base) + 10 (STR) + 10 (Feats) = 63 [+11, would be +8 if your build was optimised for 40]</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:00 PM - Mar 06, 2020",
      "content": "<div>Thanks Yunim for your suggestions<br/>\n<br/>\nYou have made some excellent suggestions that I like. <br/>\nI can see in that whilst my build might be more balanced than the original, there could be more balancing to do.<br/>\nI like the idea of dropping the two Con increases for Str gains, and get two Epic General feats as a result.<br/>\nOne could be Epic Reflexes, the other could be ESF: Concentration for casting in close melee combat spells such as Word of Faith and Harm.<br/>\nAs to altering the pre-leveling layout I hesitate to drop the BAB 25, going cleric heavy early makes the build more playable throughout its lifespan, and the extra BAB is good to have if one is Morded with only 26-28 CLs. Cleric has so many powerful features that it can live without UMD and Tumble dumps for quite some time.<br/>\n<br/>\nOne other thing, I did mention in the title my goal is 'More balanced' Blood and Faith, not a 'Balanced Cleric RDD'<br/>\nI think a Str goal of 34 retains the Cleric /RDD High AB High Str identity of the build<br/>\nDiluting it further loses one of the special high Str elements brings RDD to builds, a very focused fighter could hit 34 for example, diluting it down to 30 makes it lose what makes it special <br/>\n<br/>\nGreat discussion btw, I dont think there has been much discussion about Cleric / RDDs for a while</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "10:17 AM - Mar 07, 2020",
      "content": "<div>Your changes, Orion, lean more towards my own preferences.  Craft Wand, Silent Spell.  I would drop either Toughness or Great Fort for IKD.  As a Domain junkie, I would probably go for Travel &amp; Trickery over war.  I would also pump Wisdom right away and then go for Strength, relying instead on Bulls and Divine Power for Strength increases until you reached your Strength-era increases.</div>"
    }
  ]
}