{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "069",
  "name": "What Started as a Tweak...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/what-started-as-a-tweak-t2354609.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 25,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:49 PM - Sep 28, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">While testing out Arvoreen's Silent Sting (Monk 21/Rogue 13/CoT 6), I thought about drawing up her antithesis: that is, where she's in and out of shadow, crippling and throwing multiple attacks out: what about someone who's just stuck in tar, shrugging and saying, \"Not hard enough, idiot. Try again,\" ad infinitum? In other words a Dwarven Defender. So I had a look around and came across <strong>Grizzled Dwarflord's</strong> <strong>Hearth Guard</strong> <strong>(DwD 22/CoT 10/Fighter 8)</strong> in the legacy archive. That looked lovely, but I wondered about some of the feats, and have always liked being skilled in 2 different weapon types (in this instance, slashing and bludgeoning), so looked at a few minor tweaks - effectively, a new lick of paint and some varnishing. At that point, I ran into some questions. These are detailed below, together with the ensuing discussions. GDL's original build is also given in the SPOILER below, for comparative purposes.<br/>\nSpoiler [+]<br/>\n<br/>\n<strong>The Hearth Guard</strong><br/>\n DwD 22 / CoT 10 / F 8<br/>\n Dwarf: LG or LN<br/>\n 1-40 PvM<br/>\n<br/>\nSTATS<br/>\n STR 16 (28)<br/>\n DEX 13<br/>\n CON 18 (22)<br/>\n WIS 8<br/>\n INT 13<br/>\n CHA 6<br/>\n<br/>\n Hit Points: 724<br/>\n Skill Points: 129 - Discipline 43 (52), Heal 2 (1), Lore 1 (2), Spot 43 (54), Tumble 20 (21)<br/>\n Saves: F 36 / W 24 / R 24<br/>\n AC (full plate) 26<br/>\n Initiative +15<br/>\n DR 24/-<br/>\n BAB 30<br/>\n AB: (melee) 43/38/33/28<br/>\n<br/>\nLEVELLING GUIDE<br/>\n<br/>\n 1 F1 - Blooded / WF<br/>\n 2 F2 - KD<br/>\n 3 F3 - Blind Fight<br/>\n 4 F4 - WS / STR+1<br/>\n 5 F5<br/>\n 6 F6 - Dodge / Toughness<br/>\n 7 F7<br/>\n 8 CoT1 - STR+1<br/>\n 9 CoT2 - IKD / Imp Crit<br/>\n 10 DD1<br/>\n 11 DD2<br/>\n 12 DD3 - Imp Initiative / STR+1<br/>\n 13 DD4<br/>\n 14 DD5<br/>\n 15 DD6 - Mobility<br/>\n 16 DD7 - STR+1<br/>\n 17 DD8<br/>\n 18 DD9 - Spring Attack<br/>\n 19 DD10<br/>\n 20 CoT3 - CON+1<br/>\n 21 CoT4 - GConI / EWF<br/>\n 22 F8 - EWS<br/>\n 23 CoT5<br/>\n 24 CoT6 ESkF:Spot / EDRI / CON+1<br/>\n 25 DD11<br/>\n 26 DD12<br/>\n 27 DD13 - GStrI<br/>\n 28 DD14 - EDRII / STR+1<br/>\n 29 DD15<br/>\n 30 DD16 - GStrII<br/>\n 31 DD17<br/>\n 32 DD18 - EDRIII / STR+1<br/>\n 33 CoT7 - GStrIII<br/>\n 34 CoT8 - Epic Prowess<br/>\n 35 CoT9<br/>\n 36 CoT10 - GStrIV / Superior Initiative / STR+1<br/>\n 37 DD19<br/>\n 38 DD20<br/>\n 39 DD21 - GStrV<br/>\n 40 DD22 - Armour Skin / CON+1<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>The Hearth Guard - A Tribute</strong><br/>\n DwD 22 / CoT 10 / F 8<br/>\n Dwarf - LG or LN<br/>\n 1-40 PvM<br/>\n<br/>\nSTATS<br/>\n STR 16 (28)<br/>\n DEX 13<br/>\n CON 18 (22)<br/>\n WIS 8<br/>\n INT 13<br/>\n CHA 6<br/>\n<br/>\n Hit Points: 724 (804 in Def Stance)<br/>\n Skill Points: 129 - Discipline 43 (52 - 53 in Def Stance), Listen 43 (42), Lore 3 (6), Tumble 20 (21)<br/>\n Saves: Fort 36 / Will 24 / Ref 24 (+2 Racial bonus v Spells and Poison, +2 Resistance bonus to all saves and +2 Fort when in Def Stance, +1 Ref bonus v traps)<br/>\n AC: naked 17 / full plate 25 / fp + tower shield 28 (+1 Dodge v last attacker, +4 Dodge in Def Stance)<br/>\n DR: 24/-<br/>\n BAB: 30 (4 APR)<br/>\n AB: melee 43/38/33/28 (+1 in Def Stance) / ranged 32<br/>\n 11 uses of Def Stance p/day (+2 STR, +4 CON, +4 Dodge AC, immune to Sneak Attack while attacking)<br/>\n Other Racial bonuses: Stonecunning, Darkvision, +2 Lore, Offensive training v Orcs, Goblins, Hobgoblins and Bugbears, Defensive training v Giants<br/>\n<br/>\nLEVELLING GUIDE<br/>\n<br/>\n 1 F1: WProf: Exotic / WF: DWaraxe<br/>\n 2 F2: WF: Warhammer<br/>\n 3 F3: Blind Fight<br/>\n 4 F4: WS: DWaraxe / STR+1 (17)<br/>\n 5 F5<br/>\n 6 F6: Toughness / WS: Warhammer<br/>\n 7 F7<br/>\n 8 CoT1: STR+1 (18)<br/>\n 9 CoT2: Dodge / Imp Crit: DWaraxe<br/>\n 10 DwD1<br/>\n 11 DwD2<br/>\n 12 DwD3: Imp Crit: Warhammer / STR+1 (19)<br/>\n 13 DwD4<br/>\n 14 DwD5<br/>\n 15 DwD6: KD<br/>\n 16 DwD7: STR+1 (20)<br/>\n 17 DwD8<br/>\n 18 DwD9: IKD<br/>\n 19 DwD10<br/>\n 20 CoT3: CON+1 (19)<br/>\n 21 CoT4: G Constitution I (20) / EWF: DWaraxe<br/>\n 22 F8: EWF: Warhammer<br/>\n 23 CoT5<br/>\n 24 CoT6: EDR I / EWS: DWaraxe / CON+1 (21)<br/>\n 25 DwD11<br/>\n 26 DwD12<br/>\n 27 DwD13: G Strength I (21)<br/>\n 28 DwD14: EDR II / CON+1 (22)<br/>\n 29 DwD15<br/>\n 30 DwD16: G Strength II (22)<br/>\n 31 DwD17<br/>\n 32 DwD18: EDR III / STR+1 (23)<br/>\n 33 CoT7: G Strength III (24)<br/>\n 34 CoT8: EWS: Warhammer<br/>\n 35 CoT9<br/>\n 36 CoT10: G Strength IV (25) / Epic Prowess / STR+1 (26)<br/>\n 37 DwD19<br/>\n 38 DwD20<br/>\n 39 DwD21: G Strength V (27)<br/>\n 40 DwD22: Armor Skin / STR+1 (28)<br/>\n<br/>\nSKILLS SCHEDULE<br/>\n<br/>\n 1 Disc 4 Lore 3 Tumble 2 (Save 1)<br/>\n 2 Disc 1 (Save 3)<br/>\n 3 Disc 1 Tumble 1 (Save 3)<br/>\n 4 Disc 1 (Save 5)<br/>\n 5 Disc 1 Tumble 1 (Save 5)<br/>\n 6 Disc 1 (Save 7)<br/>\n 7 Disc 1 Tumble 1 (Save 7)<br/>\n 8 Disc 1 (Save 9)<br/>\n 9 Disc 1 Tumble 1 (Save 9)<br/>\n 10 Disc 1 Listen 11<br/>\n 11 Disc 1 Tumble 1<br/>\n 12 Disc 1 Listen 2<br/>\n 13 Disc 1 Tumble 1<br/>\n 14 Disc 1 Listen 2<br/>\n 15 Disc 1 Tumble 1<br/>\n 16 Disc 1 Listen 2<br/>\n 17 Disc 1 Tumble 1<br/>\n 18 Disc 1 Listen 2<br/>\n 19 Disc 1 Listen 2<br/>\n 20 Disc 1 Tumble 1<br/>\n 21 Disc 1 Tumble 1<br/>\n 22 Disc 1 (Save 2)<br/>\n 23 Disc 1 Tumble 1 (Save 2)<br/>\n 24 Disc 1 (Save 4)<br/>\n 25 Disc 1 Listen 4 Tumble 1<br/>\n 26 Disc 1 Listen 2<br/>\n 27 Disc 1 Tumble 1<br/>\n 28 Disc 1 Listen 2<br/>\n 29 Disc 1 Tumble 1<br/>\n 30 Disc 1 Listen 2<br/>\n 31 Disc 1 Tumble 1<br/>\n 32 Disc 1 Listen 2<br/>\n 33 Disc 1 Tumble 1<br/>\n 34 Disc 1 (Save 2)<br/>\n 35 Disc 1 Tumble 1 (Save 2)<br/>\n 36 Disc 1 (Save 4)<br/>\n 37 Disc 1  Listen 4 Tumble 1<br/>\n 38 Disc 1 Listen 2<br/>\n 39 Disc 1 Listen 2<br/>\n 40 Disc 1 Listen 2<br/>\n<br/>\n<strong>Environmental issues</strong><br/>\n<br/>\n I have based my weapon choices predominantly what's readily available in Aielund (and what isn't, ie, Heavy Flail). Conversely, you won't find any Dwarven Waraxes in the OC, so you might find that WProf: Exotic is an unnecessary feat. In which case, go for Battleaxe and Heavy Flail (with its 1.5 damage) and take either Power Attack instead of Exotic WProf and then Cleave instead of the second Imp Crit, or just add in Disarm for use with your 2-hander. But you'll know what you can unearth and make good use of where you play. Equally, do feel free to swap Blind Fight and Knockdown around, and, if AC is your priority, switch Armor Skin with Epic Prowess. If taunting is an issue, the lack of Concentration may be an problem, but hey, only 129 SPs!<br/>\n<br/>\n<em>My initial queries fell into three categories: Feats, Saves and Skills.</em><br/>\n<br/>\n<strong><span style=\"color:#000000\">Feats.</span></strong> Cleave (and by default, Power Attack) was something I realised I was missing, and if I'm right the Cleaving doesn't interrupt Defensive Stance, would I be a fool not to take it? Given that it's effectively 2 feats, I reckon Iron Will and IKD are the most vulnerable. What do you think? Another way to go that allows me to keep IKD would be to take Fighter 8 at level 20, but that would mean losing one bonus feat in epic - either AS or EP would be my guess. All these seem to have pluses and minuses - what does the Guild think?<br/>\n<br/>\n<strong>Saves.</strong> I appear to have gone \"save-blind\". I did two sets of calculations on \"straight\" saves, and got F36/W27/R26 in one, and F37/W24/R22 in the other (both with my red changes implemented). Neither of which tallies with the Dwarflord's F36/W24/R24. Could you help, please?<br/>\n<br/>\n<strong>Skills.</strong> Massively skill-starved (only 129 points). I thought I'd go with Conc 8 (14), Disc 43 (52), Spell 19 (20), Tumble 20 (21), but this leaves me with a big fat 0 in detection (Listen, Spot, or even Search). To some extent it bothers me less in this build - I don't plan to be sneaking after enemies, I shall be beckoning them to me (I like the company) - but I wondered whether I could get INT to 14 without collapsing the build. The only way I can see it is to drop CON to 21, which is all you need for EDRIII, and start it at 17. I could then move out a pre-epic STR boost to CON and take the final (level 40) boost as STR. That would also mean I could bump WIS by 2 at creation, upping Will saves by 1. However, it would also drop Fort by 1 and HPs by 40. Or should I just bite the bullet? Any thoughts?<br/>\n<br/>\n Maybe this is all a bit anal of me, but I really would value your thoughts.<br/>\n<br/>\n Btw, there were of course, other DwD builds out there that I looked at, but I really liked the underpinning principles of this one, and thought it deserved updating to v1.69. I hope this attempt achieves that.<br/>\n<br/>\n Cheers <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:22 PM - Sep 28, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just first impressions before I head back to the job site...<br/>\n<br/>\n I agree about Spot but disagree about Listen.  Neither are for sneaking but rather detecting sneakers. You need not hunt to find them.  They will find you. Figure on getting spammed by lots of sneak damage if you can't hear them approaching.  Spot will only help in the rare instance that you happen to chose to set up your combat stance directly in a nest of hiding rogues/assassins shoulder-to-shoulder.  It could happen, I suppose, but in PvM the AI will typically cause them to move towards you long before you get that close.  The exception would be hiding rogue archers which don't need to move and won't except to maintain LOS.  Hence, the benefit of maxing both detection skills... but melee sneakers in motion seems to be more prevalent than occasional ranged attacks to me.<br/>\n<br/>\n Since your saves are very good anyway, my personal bias would induce me to take exotic for Dwarven Waraxe, the best 1H weapon available. Cost: Iron Will. Use Clarity (short term) and/or Owl pots (long term) for your Will concerns.<br/>\n<br/>\n I'll try to check your bean-counting upon return.  I do like the build's main notion, though.  It looks like a worthwhile adjunct to GDL's version.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:24 PM - Sep 28, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Hip.<br/>\n<br/>\n I are a plank. I'd been using eyes (or ears) that merely saw (or heard) me being aware of foes earlier and therefore better positioned to attack, rather than \"here come the rat-bastards, ready yourself.\" Offense rather defense (I even used NFL spelling), which kind of defeats the point of this build. And, given the option, I's always go Listen over Spot (I know there's a discussion about the various merits on another subforum). It does, however, leave me with a quandry - what to drop? My thinking is Spellcraft, given that I get natural Dwarven bonuses v Spells anyway. Iirc, Listen is governed by INT (though it could be WIS), so I could get to 43 (44 or 42, depending), which would drop Conc to 3 (9) - or I could take a little Lore for Conc and save a few bucks. After all, no decent taunt is going be saved by that level of Conc. Or mix and match is available, I suppose. I know what you say about archers, but I'd really hope for someone to help there (not necessarily looking for this to solo much).<br/>\n<br/>\n I'd actually opted for Exotic Prof and Dwarven Waraxe initially, but it's such a flighty thing - you might never find one worth the having, or you might find eight and kick yourself - that I ended up going standard Battleaxe. Of course, if I was going for \"best\" weapons, scimitars and large flails spring to mind (I can see the debate starting now...), but I also fancied the idea of \"proper\" Dwarf weapons featuring. It irks somewhat to have a dwarf take another proficiency for a weapon that should seem like second nature, but rules is rules I suppose...<br/>\n<br/>\n I know I tend towards high Will saves in particular. It's not just an Aielund thing, I hate being rendered useless, and - given my tendency to play meleers - Will failures tend to hit harder than others, so I try to counteract them if I can.<br/>\n<br/>\n I eagerly await further analysis (RL permitting) - but am currently off to meet Deekin in a Gnoll-infested village with the Silent Sting.<br/>\n<br/>\n Oh, and Grizzled Dwarflord gives a marvellous back-story for his build, if anyone wants to check it out, regardless of the build itself.<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:09 AM - Sep 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I no longer play environments that have not been designed as \"equal opportunity\" play areas.  A pox on the designer that tries to steer me towards their own personal bias.  But I do acknowledge the paucity of the dwarf's best ally, generally-speaking.  If it's SP, I'll just populate them myself and recompile.  If it's a PW, I'll make a courteous suggestion that the admin begin to rethink their decision to exclude Dwarf Axes, and if unattended, leave permanently for another server that has less anti-dwarven prejudice.  Assuming I really desire to RP dwarf, that is. And I often do.<br/>\n<br/>\n GDL's stats come out thus on the CBC:<br/>\n<br/>\n<em>AC, naked: 10 + 1dex +4tumble +2as = 17 (25 w/fplate, 28 w/fplate+tower) [+1 Dodge feat, last attacker]<br/>\n<br/>\n Saves F/W/R: 36/24/24 (38/26/26 v spells, racial)</em><br/>\n<br/>\n Apparently, GDL had the inconvenient habit of including Dodge's AC in his figures.  If nothing else, it made readers do the calculation for themselves. It's basically the same for <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Nature_sense\" rel=\"noreferrer\" target=\"_blank\"><em>Nature's Sense</em></a>.  Both are situational combat adjustments to the intrinsic base.  One applies only to last attacker and the other according to the tileset where the combat takes place.  It's fine to publish those figures but they should be hilighted so as not to confuse comparisons.<br/>\n<br/>\n The rest of his analysis concurs with the results of Kamiryn's calculator.<br/>\n<br/>\n In that bygone era, there was a lot of fanfic showing up on builds.  RP was the new rage (because a great proportion of NWNers came from the PnP world during NWN's infancy) and it really helped to set the theme with an interesting background.<br/>\n<br/>\n SoU is probably the closest balance to PnP that BioWare created.  Very stingy loot/resources and extremely challenging with strong reliance on hench ally.  My only issue is that it is so well made, I would have preferred that HotU follow the same path rather than become a power loot grab.  Yeah, well.  That's the reason for all the CC, eh?<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:11 AM - Sep 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The battleaxe-dwarven waraxe decision depends partly on where you are planning to play this build. The dwarven waraxe was introduced with HotU, so there are none of them in the OC or SoU. I don't remember seeing any in Aielund, but that could be only because I wasn't looking for them, but on the other hand, if there was a really good one, I'd be more likely to remember it.<br/>\n<br/>\n A common practice with dual-focus builds is to make the second weapon a heavy flail for the extra damage from being 2-handed. Since you would use that weapon mainly against crit immunes (like undead), you could drop Imp Crit for that weapon which would help you get Cleave, or at least compensate for the feat lost to Exotic Weapons, if you add it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:17 AM - Sep 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">^^^... what Empyre stated about Heavy Flail.<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n Improved Disarm spamming could also be a nice exploit to boost the AB beyond where the focus could carry it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:05 PM - Sep 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks a lot, Both.<br/>\n<br/>\n I'm still a bit shaky on multiple quotes, so I'll go old school, if you don't mind.<br/>\n<br/>\n @ Empyre - Excellent suggestion about Heavy Flail (and the 50% damage bonus doesn't hurt, either). I'll be taking Power Attack and Cleave now, dropping the second Imp Crit and Iron Will. I see this build as being about doing the simple things, but doing them well. The high HPs and DR will compensate for the lack of shield later on. On balance, I think I'll stick with Battleaxe for the other weapon - although I now find I'm being tempted by Great Axe. There are a couple of lovely Mauls in Aielund, but you can't focus in them, and the only way to use them at all - without UMD - is with Exotic Proficiency, but I digress, and I wouldn't want weapon choice to be a deal-breaker.<br/>\n<br/>\n @ Hip - On the saves, I suspect I'd somehow woven the racial bonus versus spells into my own calculation - thanks for clearing it up. Also for saving me from doing the AC calculation. As to the skills, I'll just grin and bear it with 129 points, maxing Discipline and Listen, and cross-classing Tumble to 20. This will leave a hefty 3 points for folk to do with as they choose. At least Stonecunning will give me a small chance of avoiding early traps underground, and the skills schedule shouldn't be too problematic to work out, which is a form of blessing.<br/>\n<br/>\n Now, I'm not sure what to do with the finished article (when it <em>is</em> finished, that is). Would it be appropriate to publish it as a tribute to GDL's build, or should I just leave it here? I'm certainly not looking for any glory from it, and I don't think the differences are sufficient to claim it as my own. I'll leave it with you to decide what would be best.<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:12 AM - Sep 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It is a good idea to have a 1-handed weapon (with shield) and a 2-handed weapon, so battleaxe plus heavy flail, or warhammer plus greataxe (but the first option is better, I think).<br/>\n<br/>\n When it is finished, and we all can decide together whether it is different enough.<br/>\n<br/>\n About a comment you made, no matter how high your UMD is, it won't help you use weapons or armor that you are not proficient.with. UMD only helps you use things that you are restricted from by class, race, or alignment, and maybe gender, but I'm not sure about that.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:54 AM - Sep 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>\n About a comment you made, no matter how high your UMD is, it won't help you use weapons or armor that you are not proficient.with. UMD only helps you use things that you are restricted from by <span style=\"color:#FF0000\"><strong>class, race, or alignment,</strong></span> and maybe gender, but I'm not sure about that.<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">It's just those three emulations that UMD checks against item cost.  However, a custom item could theoretically restrict all three categories (typically, it only restricts one) making the item extremely high in value, possibly beyond UMD's capacity (figuring maxed skill with SkF/ESkF &amp; high CHA), with class emulations being the easiest to pass.  As you've already indicated, you still must pass the related proficiency before a UMD check is performed.  Gender restriction is not possible without special scripting and modified 2das since it cannot be assigned to an item using the toolset.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:21 PM - Sep 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I mentioned gender because I have seen lots of female-only armor, including some in Aielund. I think that males can equip them and benefit from their properties, but they are invisible, like the emperor's new clothes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:37 PM - Sep 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I can attest to the invisibilty aspect. In my last run through Aielund I equipped Robert Black with the Queen Erynes Hell Armour (from the Insidiae quest), and there he was running around wearing a cloak, a black hat and a diaper when confronting the saqarin. Effective, though!<br/>\n<br/>\n Right, off to do the edit...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:52 PM - Sep 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>I mentioned gender because I have seen lots of female-only armor, including some in Aielund. I think that males can equip them and benefit from their properties, but they are invisible, like the emperor's new clothes.</div></blockquote>\n<div align=\"left\">Yeah, I've seen things like this implemented by using the unique property scripting like the talking sword in HotU.  On one server I played, your toon must become a member of a particular guild before being able to use the special member-only gear.   None of these sorts of restrictions check UMD, however.  They just set flags on the PC to control usage.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:10 PM - Sep 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The edit's up there now. I think I've squeezed in what I can, and hopefully got my sums right. I've maintained my use of the red for my changes, except for the skills schedule. Over to you now, good people!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:41 AM - Oct 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Discipline reaches 53 w/DS.<br/>\n<br/>\n Think about moving that last CON bump up to Level 28 for the extra HP/Fort save for a full 12 levels seeing as how this isn't set up as a DevCrit build.<br/>\n<br/>\n Looks to be ready for testing to me. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /> <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:33 PM - Oct 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just by way of an update on testing both this and the Silent Sting build, I find I've run into bother with both. Not the builds themselves, I hasten to add, just me being me. With this chap, my intention was to run him through the OC and Aribeth's Redemption before tackling Sands of Fate. Having just finished the Host Tower in Luskan, I realised that a Dwarf wouldn't be able to do the Aribeth mods. Arse. Also, interestingly enough, he's performing consistently at a better level with Heavy Flail than hunkering down with his Battleaxe behind a shield. That said, I'm still only running at baby levels of DwD, so perhaps not too surprising.<br/>\n<br/>\n As for Arvoreen's Silent Sting (I know, a different thread, but still mine, so I feel justified-ish), it's been harder work. I'm going through SoU with her at the moment (struggled hugely with Kel-Garas) and have just reached Undrentide. One of the issues is purely mine - I'm so used to being up front and personal that I really need to think hard about the covert stuff. The other issue is linked, in a way, in that it concerns henchies. My understanding is that Tony K's AI makes things a lot better, but as it stands, it's all very well me disappearing into the shadows and doling out deadly strikes, but my thicko companion just keeps getting butchered. I suspect that in all 3 of original series, if you want to travel with a companion, be careful which idiot you go with. Even Deekin's letting me down, for gods' sake!<br/>\n<br/>\n Hope everyone's well.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:49 AM - Oct 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Dwarves can't romance Aribeth?  Sheer bigotry!  She doesn't realize what's she's missing.  The beard really tickles and can become addictive even to the most prudish pally. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n Unless the content has invested in a very innovative hench AI (including Tony K's, for that matter), I usually tank the first part of any encounter while leaving my cohorts on standby.  Yes, that includes the frail and infirm, mages, thieves, archers...  makes no matter.  The party support always seem to engage more safely after the first round has been settled.  Then displace your toon to a more leisurely range to better command the battlefield.<br/>\n<br/>\n With UMD, you should be able to buff up your allies pretty well, though the caster-only scrolls like spell mantle and such are limited to the PC.  But scrolls of stoneskin and imp invis should be saved for the battles that matter most.<br/>\n<br/>\n Now... if you had pulled some of the baddies back into your trap field before sending in the hit squad...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:38 AM - Oct 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>Dwarves can't romance Aribeth?  Sheer bigotry!  She doesn't realize what's she's missing.  The beard really tickles and can become addictive even to the most prudish pally. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n Unless the content has invested in a very innovative hench AI (including Tony K's, for that matter), I usually tank the first part of any encounter while leaving my cohorts on standby.  Yes, that includes the frail and infirm, mages, thieves, archers...  makes no matter.  The party support always seem to engage more safely after the first round has been settled.  Then displace your toon to a more leisurely range to better command the battlefield.<br/>\n<br/>\n With UMD, you should be able to buff up your allies pretty well, though the caster-only scrolls like spell mantle and such are limited to the PC.  But scrolls of stoneskin and imp invis should be saved for the battles that matter most.<br/>\n<br/>\n Now... if you had pulled some of the baddies back into your trap field before sending in the hit squad...</div></blockquote>\n<div align=\"left\">Oh, Hip, those fickle Elven wenches! I suppose there should have been a clue in the \"Am I a pally - am I a blackguard - am I a pally?\" routine (despite Nasher's assertion that such character changes would seem impossible for an Elf). Alas, though, this is about the script for Hairybreast's Redemption. It won't matter that I've romanced and saved her bony ass - and been LG throughout (done it before as a bearded wonder), the mods are only geared for Elf, Half-Elf or Human Good aligned characters. Looks like I'll have to skip into HotU instead to get to L28 before Sands of Fate. I know there'll be assorted disconnections/contrariness, but this is only a test-run, after all, and I plan on following on with Aielund (was going to be Swordflight, but it won't get me high enough yet).<br/>\n<br/>\n Ah, henchmen. Lovely idea, some great conversations, but the bog-standard ones are really frustrating. I generally solo the 3 official campaigns now, but thought I'd try a companion with the Silent Sting (feeling a little insecure about playing a Dexer, I suppose). One is severely limited in SoU, particularly with one of the three options being a Rogue who's worse at it than me, but Linu and Daelan become available once more in HotU - though loyalty being loyalty, I'll probably stick with Deekin.<br/>\n<br/>\n Oh, and my trap setting is coming on well, except half the time my own hench is setting them off! Thus, I hear what you say about just parking them up. Life, eh?</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:40 AM - Oct 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the details about that bridge module, Stagmeister.  Would've never thunk they had a race limitation.<br/>\n<br/>\n Played many a game through SoU as a rogue in some capacity or another (that unreconcilable UMD fetish looms again). <br/>\n<br/>\n Ask Dorna to focus on cleric and she is a decent party buffer and healer.  Also went with Xanos but kept him as pure a barb as possible with the best hammer or greataxe (can't recall atm) that was available. His rage works nicely at such low level.  But he pissed me off as a sorc when I tried that training.  No sooner would my rogue spot a room full of sweet FREE traps to recover but the dang half-orc would cast Find Traps over my shoulder!  If I didn't need him for company I would've choked the life out of him.<br/>\n<br/>\n Also, there is a Mischa fix floating around the Vault somewhere.  If a pally ally suits your party better, maybe try her.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:55 AM - Oct 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I tried that Mischa patch once. When we were fighting J'Nah, she died for the first time, When I got back to Drago's, she was there but there was no way to talk to her.<br/>\n When I was playing a Rogue AA, I had Dorna level only as Cleric, and she took on Herodis by herself while I destroyed the mythal. Then I shot a single arrow before Herodis took me out of the fight by stunning or dazing me or something,like that. Dorna finisher her off all by herself. The moral of the story is that Dorna can become pretty powerful when leveling only as Cleric, and assuming you have her well-equipped, and also you should bring and use clarity potions for that fight.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:15 AM - Oct 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>. Then I shot a single arrow before Herodis took me out of the fight by stunning or dazing me or something,like that.<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Sounds like you lost a grapple check vs. one of her Bigby's, Empyre.  Stuff happens.<br/>\n<br/>\n About the only protection for a Dexer is to try to cap STR with items/Bull buff or pots.  That won't guarantee an escape but will vastly increase the chances. <br/>\n<br/>\n An alternate would be with SR but needs around SR 25+. Dunno if Dorna's SR buff would be high enough but perhaps her Freedom could bypass the grapple. Heurodis is a very high level wizard for a 12-15 level campaign finisher and has a True Seeing skin (like a dragon) making stealth futile in the encounter.<br/>\n<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:44 AM - Oct 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks both - I had no idea Dorna had some hidden priestlihood in her veins - very much worth knowing, don't know how it escaped my attention before. Clerics are always welcome campadres.<br/>\n<br/>\n Oh, and a confession on testing this build. Once I'd realised the impossibility of Aribeth's Redemption, I knocked the OC on the head - I was only doing it for that extension. So Hearth Guard Junior is now being tested in Aielund instead.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:58 PM - Apr 18, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I know, I know, I'm pulling up another old thread, but I've now given this re-tooling of a legend a good runaround through Aielund and the OC then HotU (would have been Aribeth's Redemption, but see the preceding discussion) and Sands of Fate, so believe he's as ready as he's ever likely to be for judgement.<br/>\n<br/>\n If you good folk think he's worth including in the Full Epic sub-forum as a tribute to GDL's original build, I'd be delighted. If not, I've still had a ball playing him. My intention would be to re-title the thread as something like \"A Tribute\" or \"V1.69\" and include the original build as a spoiler in the OP - upon which I'm about to do the edit.<br/>\n<br/>\n Hope you like it - I know I have.<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:42 PM - Apr 18, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n<blockquote><div><strong>Empyre65 wrote:</strong><hr/>. Then I shot a single arrow before Herodis took me out of the fight by stunning or dazing me or something,like that.<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Sounds like you lost a grapple check vs. one of her Bigby's, Empyre.  Stuff happens.<br/>\n<br/>\n About the only protection for a Dexer is to try to cap STR with items/Bull buff or pots.  That won't guarantee an escape but will vastly increase the chances. <br/>\n<br/>\n An alternate would be with SR but needs around SR 25+. Dunno if Dorna's SR buff would be high enough but perhaps her Freedom could bypass the grapple. Heurodis is a very high level wizard for a 12-15 level campaign finisher and has a True Seeing skin (like a dragon) making stealth futile in the encounter.<br/>\n<br/>\n  </div>\n</div></blockquote>\n<div align=\"left\">Somehow, I missed that post before. It wasn't one of the Hand spells. It was one of the effects like dazed or stunned or something like that.<br/>\n<br/>\n @Stagmeister: Your build might be too similar to the original to qualify as a separate build. In Kail's absence, we'll let Hip decide.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:28 PM - Apr 18, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@ Empyre: I'm more than fine with that - I ain't looking for any glory here. Although I do think the original deserves a place somewhere in the Guild, if that's possible.<br/>\n<br/>\n Oh, and in case you were looking for the edit of the OP, I was thrown out several times whilst doing it. But it is there now. I even managed the \"spoiler\"<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:19 AM - Apr 20, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">My suggestion is to republish GDL's original version as a completed/tested Level 40 ECB contribution similar to what I posted for Mith's <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354621/\" rel=\"noreferrer\" target=\"_blank\">Hierophant of Velsharoon</a> (which had gained some special interest within related discussions).<br/>\n<br/>\nThen, in a subsequent post within the same topic, detail and explain the variant that you've found useful to meet your own goals, comparing key elements that might distinguish it from the original Hearth Guard with your reason(s) to depart from the template.  In that way, a build search would locate both builds, though GDL's version would be used to establish the particulars.<br/>\n<br/>\nYou can either manually backcheck all of the Hearth Guard stats to confirm their accuracy or run through the CBC (which is what I did for all 200+ completed builds myself).  If you find any errors in the original, make notations to that effect within the originator's build (I use <span style=\"color:#FF0000\"><strong>red bolding</strong></span> to highlight things like this) but leave the original, posted information intact.<br/>\n<br/>\nIf you need help transposing from the legacy archive, let me know, Stagmeister.  It shouldn't involve very much effort beyond a standard cut 'n paste.<br/>\n<br/>\n<em>edit, 20170421:  <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354692/\" rel=\"noreferrer\" target=\"_blank\">GDL's original build</a> </strong>has been added to the Level 40 subforum, Stagmeister.  Feel free to amend your variant to the topic whenever you feel it's been tested enough to work out the kinks and itemize the differences.</em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:51 AM - Apr 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>My suggestion is to republish GDL's original version as a completed/tested Level 40 ECB contribution similar to what I posted for Mith's <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354621/\" rel=\"noreferrer\" target=\"_blank\">Hierophant of Velsharoon</a> (which had gained some special interest within related discussions).<br/>\n<br/>\n Then, in a subsequent post within the same topic, detail and explain the variant that you've found useful to meet your own goals, comparing key elements that might distinguish it from the original Hearth Guard with your reason(s) to depart from the template.  In that way, a build search would locate both builds, though GDL's version would be used to establish the particulars.<br/>\n<br/>\n You can either manually backcheck all of the Hearth Guard stats to confirm their accuracy or run through the CBC (which is what I did for all 200+ completed builds myself).  If you find any errors in the original, make notations to that effect within the originator's build (I use red bolding to highlight things like this) but leave the original, posted information intact.<br/>\n<br/>\n If you need help transposing from the legacy archive, let me know, Stagmeister.  It shouldn't involve very much effort beyond a standard cut 'n paste.<br/>\n<br/>\n edit, 20170421:  <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354692/\" rel=\"noreferrer\" target=\"_blank\">GDL's original build</a> has been added to the Level 40 subforum, Stagmeister.  Feel free to amend your variant to the topic whenever you feel it's been tested enough to work out the kinks and itemize the differences.</div></blockquote>\n<div align=\"left\">That's brilliant, thanks Hip - I'd been a bit busy the last couple of days and was just about to embark on your suggestion when I noticed the Hearth Guard in the Level 40 subforum - saves me making a mess of it!</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}