{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "559",
  "name": "New WoG player build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/new-wog-player-build-t2355505.html",
  "author": "mamabama",
  "avatar": "no_avatar.png",
  "replies": 10,
  "posts": [
    {
      "author": "mamabama",
      "avatar": "no_avatar.png",
      "timestamp": "9:16 AM - Jul 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello experts,<br/>\n<br/>\nOld time D&amp;D player here, grew up in the world of greyhawk pen and paper.  Got into computer gaming recently and found my way to NwN and WoG persistant world.<br/>\n<br/>\nSince WoG looked hard I \"trained\" myself in the game by playing OC, SoTU, HoTu and Sands of Fate, then moved on to Aielund Saga.  Now that Im pretty good at the game in \"pause mode\" figured i might be ready to try live mode and explore the high difficulty world of greyhawk.<br/>\n<br/>\nLooked through tons of buiilds here, but have no experience in building, so I wonder if someone might suggest a build to me.  RP wise I want to play an Elf roguey type that is great at traps.  Probably a lot of rogue levels for high SA damage, then become an artful trapper (or avoid areas) where there are lots of undead or SA immune enemies.<br/>\n<br/>\nAnyway, the combo I was thinking of (and found no builds) was 33rogue, 6monk, 1SD.  Basically a HIPS unarmed melee DEX rogue with IKD for sneak attacks (along with HIPS).  High AC, maybe epic dodge,xtra monk speed, high UMD and trap skills for lots of shadowy shuriken strategy, scrolls etc. Also elf for active search checks. A stealthy monk/rogue would be a fun way to explore a lot of those modules from childhood since you pay attention to details and have to use creative strategy to prevail (especially in SA immune areas).<br/>\n<br/>\nIm open to other builds too.  Someone said Assassins are improved on WoG so maybe that too.<br/>\n<br/>\nThanks for your time!<br/>\n<br/>\nMamaB<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:57 AM - Jul 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Greetings and hello MamaB!<br/>\n<br/>\nI have been playtesting a number of my builds in WoG which goes to 40. <br/>\nI started there over 12 months ago<br/>\nI like the Rogue 33 concept. Lots and lots of sneak attack damage!<br/>\n<br/>\nI have written a Rogue 33 Monk 6 SD 1 draft, I have only playtested it to level 6.<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-flash-rogue-33-monk-6-shadowdancer-1-t2355434.html#p20294\" rel=\"noreferrer\" target=\"_blank\">The Flash</a><br/>\nBy dropping TWF/Ambi/Improved TW Fighting this would give you three feats to spend on what you wish. <br/>\nYou can change the race to elf, as 20% multiclass penalties won't matter too much in a persistent world.<br/>\nWith the 6 ability points (+2 dex -2 con from elf, leave dex at 18) one can put Str to 14 and Int up to 10. Or whatever balance you wish.<br/>\nI also put probably too much HP, 300+ is probably enough. <br/>\n(Usually you will want more 16+ monk levels if you want to use fists ie 1d20 fists, otherwise I would consider dual kamas with an elf for lots of attacks)<br/>\n<br/>\nThere are other rogue 33 drafts I have written. <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20387#p20387\" rel=\"noreferrer\" target=\"_blank\">The Shadow of Corellion</a> others have enjoyed playing, it is an elf dual shortsword 6-7APR build, I have only playtested that one to 11 but I know Yogmister7 got that one up to level 30 very quickly. <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/avoreen-s-masterful-dagger-rogue-33-fighter-6-sd-1-t2355305.html#p18522\" rel=\"noreferrer\" target=\"_blank\">Aroveen's Masterful Dagger</a> I haven't had a chance to playtest yet. <br/>\n<br/>\nValerfor who has played WoG extensively in the past made <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-sentry-of-anduin-rogue-33-fighter-6-shadowdanc-t2350497.html#p586\" rel=\"noreferrer\" target=\"_blank\">The Sentry of Anduin</a> which is a halfling Rogue 33 Fighter 6 SD 1 build shortsword + shield with +20d6 looks very nice, maybe there are adjustments one can make to make it an elf. <br/>\n<br/>\nTorias wrote a <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=152#p152\" rel=\"noreferrer\" target=\"_blank\">Rogue Archer</a> Rogue 33, Fighter 6, SD 1 (+27d6 sneak), very very nice as well.<br/>\n<br/>\nHope that gives you some ideas. I think most well designed builds will work fine in WoG, there is some adjustment without pausing of course but one will learn how to manage this with time :) I think amongst this lot there will be a concept you like more than another so definitely keep the conversation going, and as a group the guild members can give you suggestions to get you what you need, as a group the ECB is a veritable gold mine of experience and knowledge. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "mamabama",
      "avatar": "no_avatar.png",
      "timestamp": "11:43 AM - Jul 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks so much Orion. These builds were exactly what I was looking for.  Its easier to find builds with the search engine on the github, but typically the more recent builds here are more evolved but can get buried in all the posts.<br/>\n<br/>\nAlot of these builds would fit the bill for me, with just a little tweaking.<br/>\n<br/>\nOne question, I see your kama \"flash\" can get up to nine attacks.  A non monk dual wielder like Corellon would max out at 7 attacks, correct?  And a hasted bow wielder like the Rogue Archer would have 6 attacks per round.<br/>\n<br/>\nAnother question, I do not see \"skill mastery\" in any of these builds.  Would that not allow laying epic or deadly traps \"at the feet\" of enemies and be rather vaulable?<br/>\n<br/>\nFinally, is HiPS altered on WoG or can it be used at will? I suppose True seeing enemies will spot you through it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:06 PM - Jul 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome mamabama!<br/>\n<br/>\nI have levelled the Rogue Archer to level 39.<br/>\n<br/>\nIt is a beast.<br/>\n<br/>\nOne could easily go Elf, but would get an XP penalty.<br/>\n<br/>\nWoG Assassins got a little boost with Poisons, but BeamDog has nerfed the Death Attack paralyzation to only count on the very first attack (no longer the first flurry as it was before).  Monk stunning fist is also nerfed, being only one round in duration (BeamDog nerf).<br/>\n<br/>\nShadow Dancers got a bigger boost on WoG, with some of the abilities (summons, shadow evade, etc) being boosted.  HiPS, however, is on a timer.<br/>\n<br/>\nLearning to play without the pause bar is a big step up.  You may feel overwhelmed at times.  Just keep in mind that many of us oldies do it, and in time it will come as if it is natural.  Clever use of both the hotbars and the F keys are very helpful in managing actions, items, spells, etc.<br/>\n<br/>\nWoG for first timers is very, very hard.  It has a very steep learning curve.  You will dirtnap often.  It is a PW that was made for Party play, so soloing it is very difficult, even for expert Players.<br/>\n<br/>\nMy advice - go slow, don't get discouraged, and ask for help if stuck, etc. You will find that most Players on WoG are very helpful.  We have all been where you are now.  I can tell you now, as an old time D&amp;D Player and DM, the Greyhawk PnP converted modules on WoG are first class - among the best conversions I have played.<br/>\n<br/>\nFrom Hommlet, to the Temple of Elemental Evil, the Giant series, Drow, Queen of the Demonweb Pits, and many, many more, all are well done conversions.  I kind of envy you due to all the wonderful things you are going to be discovering and enjoying.  NWN brings a unique experience to the D&amp;D world imo.  Reliving those old PnP modules in the NWN format has been for me an incredible and wonderous journey.  The new additions of the Saltmarsh U series is just awesome sauce.<br/>\n<br/>\nI think you will do well to start with a Rogue based Character with HiPS and good speed.  As an Elf, it should do very well as WoG does have lots of traps, secret doors, and other surprises that keen senses will be helpful against.  Sneaking is a viable tactic on WoG, with only a few creatures and bosses having vanilla True Sight.  The HiPS timer is annoying, but acceptable at 6 seconds.  You should be aware that there are rarely any convo stat, skill or feat checks on the PW.  So investing in Persuasion, etc will just be a waste of skill points, and you will want to put those very valuable skill points in other, more useful skills (UMD, Tumble, Hide, Move Silently, Concentration (due to Taunt), Discipline (to avoid being Disarmed), Open Locks, Disarm Traps, Craft Traps, Set Traps.  Note that Appraise is used at Merchants.  Also, just about every creature and their mamas sneak, so you will need Listen and/or Spot, as well as Search.<br/>\n<br/>\nYes, the skill points will be spent before one gets them.  One can never have enough skill points on WoG!<br/>\n<br/>\nI personally would suggest starting in Hommlet - it is the easiest route imo and is also one of the most memorable.  I would suggest purchasing a Horse at first - Horses grant more speed and can be used to kite opponents with ranged weapons (though without Mounted Combat there will be a minus to hit with ranged).  Later you will be able to pick up Boots of Travel and dispose of the Horse,  if you are so inclined.<br/>\n<br/>\nEnjoy!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:46 PM - Jul 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey mamabama!<br/>\nWeb has written some great stuff, I might read a bit of it myself :)<br/>\nRE attacks per round (APR) you are correct, nice one! :)<br/>\nSkill mastery I wouldn't bother with, set the traps with take 20 outside of combat, in combat I would focus on killing them with the crazy attacks per round, buffed with UMD and sneak attack and HiPS and lure them into traps. With HiPS you have an incredible strategic advantage as long as the enemy doesnt have real true seeing (ie a Dragon). Its nice but probably not quite as strong as other options<br/>\nHiPS has a timer of 6 seconds I believe in WoG. In vanilla NWN HiPS has unlimited uses / round. NPC enemies only check stealth once every 6 seconds. So how OP is that :) <br/>\nOh and strength is handy to have. I find myself regretting not putting Str to 14 on most of my rogue builds. (non rogues too). One can find ways to buff it up for non-sneak damage, and it helps for sure carrying mountains of loot across the vast plains of WoG. Not everything will be vulnerable to sneak attacks (ie Dragons, Undead, Constructs), so the extra Str is good, but for those who are vulnerable, they will not survive very long against a Rogue 33 build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "mamabama",
      "avatar": "no_avatar.png",
      "timestamp": "3:21 PM - Jul 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What an excellent introduction WebShaman, thanks for all these tips.   I don't mind an xp penalty since I wanted to take it slow anyhow, and I was planning indeed to start with Homlett, since that module was my first D&amp;D experience as a kid.  Is the Tomb of Horrors also somewhere in Greyhawk? I cannot recall.<br/>\n<br/>\nI am expecting to dirtnap a lot, but I want to go slow and enjoy the first playthrough, so that's all part of the fun.<br/>\n<br/>\n6 seconds on HiPS sounds like a good change.  I don't like the button mashing style of play anyhow.  Rehiding every second to get another sneak attack would get tedious fast.  HiPS, reposition, set a trap, then attack again sounds rather more fun.<br/>\n<br/>\nGood Orion, so Skill mastery does not look that useful.  Now its just to choose which roguey build type....if I decide on range then I will try an elf rogue archer, but your flash build elfed out looks super fun, as does the second iteration of your Avoreen's Masterful Dagger, taking fighter instead of monk.<br/>\n<br/>\nOne last question:  In Aielund there were lots of Asian style weapons, like Wakizashi (short sword proficiency).  If I did the Avoreen but with an elf, dual wielding short swords, are there some Asian models in Greyhawk? I like the look of wakizashi compared to classical short swords.  In that light, what are some of the nice looking weapon models in WoG in your opinion?  Are there some cool looking epic kama's in game as well? The kama's in Aielund were pretty boring.<br/>\n<br/>\nO, and what are ideal skill numbers for an epic trap master. ie Disable, Set, and Craft Trap?  I want to be recovering and planting deadly and epic traps with ease.<br/>\n<br/>\nThanks again everyone for the warm welcome.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:31 PM - Jul 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Greetings, mamabama!<br/>\n<br/>\nI've nothing to add about WoG, but you might find this of interest re all things trap-related.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/unravelling-the-world-of-nwn-traps-a-primer-t2176824.html\" rel=\"noreferrer\" target=\"_blank\">Unravelling the World of Traps in NwN</a><br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:42 PM - Jul 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">WoG uses CEP Weapons, which includes asian weapons like the waki, sai, goads, wind firewheels, etc.<br/>\n<br/>\nMost also have all the weapon feats as well as WM WoC.<br/>\n<br/>\nAs for Epic Traps - I am not sure if the system for making them is implemented on WoG. I know it was discussed.<br/>\n<br/>\nI have never attempted to make Traps on WoG as there are more than enough to Recover, and one can purchase them at specialty shops. YMMV.<br/>\n<br/>\nTo Disarm, one is going to need a modified level of 68 to Recover Epic Traps (which is what I do). Since there are lots of ways to boost Set Trap, I think 25 ranks will be enough with Take 20 to set them.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:02 PM - Jul 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Kamas I think you will be disappointed with the range. There are some ok late pre-epic kamas but I cannot recall a single epic kama.<br/>\nShortswords on the other hand, you will be very happy with. There are great epic shortswords that drop. <br/>\nThere are Wakizashis for sale but not a lot of enchanted ones.<br/>\nI cannot comment on looks as I haven't really modified them. With flame weapon (or bless weapon, <strong>great </strong>against undead with an amazing duration from scrolls) on them, it is hard to see the weapon sometimes :)<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_07ae97f3aa91ec9a1aabf6c49a8f1ac6_t.jpg\" />\n</dl>\n</span><span style=\"font-size:75%;line-height:normal\">This is Dianne (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19732#p19732\" rel=\"noreferrer\" target=\"_blank\">Mistress of Mayaheine</a>), I have playtested to about level 27. </span><br/>\n<span style=\"font-size:75%;line-height:normal\">Dual shortswords with flame weapon applied. Modified robes to have a metallic exterior. </span><br/>\n<br/>\nSet trap 45 modified should be enough to set epic traps with take 20, at least according to the NWN wiki, the DC to set the epic traps should be 65. <br/>\nDisable trap I usually put up as high as possible but I note Web has the numbers on how much is needed to recover. <br/>\nCraft trap you can invest in, however the best traps one can craft are deadly traps. I'd only invest a few points at most, and try to look for items to boost your craft trap skills. I have been able to craft deadly electrical traps with no ranks in craft trap, but with lots of int and +craft traps boosts. Reagents can be tricky to obtain to make deadly traps, 7 / trap is significant, retrieving em is likely going to be your priority, I think. Making a handful of low level traps early game is very very powerful. With a decent low level trap field (ie minor ele/fire traps), bosses can be taken down early game much easier, as long as they dont have evasion! I think it is worth making minor traps early game. I find once my sneak attack damage is nice and high, plus I get equipment / UMD / sequencers, I dont have to rely so much on traps as I used to, which is a good thing, evasion is a pretty nasty counter to trap damage output.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "mamabama",
      "avatar": "no_avatar.png",
      "timestamp": "6:18 PM - Jul 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Stagmeister, very helpful link!<br/>\n<br/>\nFrom HipMaestro's guide the numbers are<br/>\n<br/>\nDETECT epic traps, rogue only<br/>\nEventual: 43 - 20 = 23<br/>\nImmediate: 43 - 1 = 42<br/>\n<br/>\nRECOVER traps, epic, all classes<br/>\n58 + 10 - 20 = 48 (46 w/synergy); XCL, only w/foci &amp; modified INT &gt;/= 34 (See Note 4)<br/>\n<br/>\nSET epic traps<br/>\n65 - 20 = 45 (43 w/synergy); XCL, only w/foci &amp; modified DEX &gt;/= 28<br/>\n<br/>\nThough WebShaman notes above there are alot of ways to boost set traps, so 25 will do for that.<br/>\n<br/>\nThanks for the pics and info Orion.  If Kama's are a bit boring, maybe Ill try the dual shortsword build, or the Archer.  Think I'll go roll one up now.<br/>\n<br/>\nThank you all again for the good advice.  See you in game!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "8:24 AM - Aug 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Another Idea is:<br/>\n<br/>\n1. Ranger 9/Rogue 30/SD 1<br/>\n<br/>\n2. Bard 5 to 8 to 11/Rogue 28 to 31 to 34<br/>\n<br/>\n3. Monk 1/Ranger 9/Rogue 30<br/>\n<br/>\n4. Druid 25/Rogue 14/SD 1<br/>\n<br/>\nWhat these build splits do that the others do is offer you something in addition to sneak attacking, while still being a good Sneak Attacker.<br/>\n<br/>\nThe Ranger/Rog/SD gives you higher AB, improved 2 weapon fighting, and a Animal Companion(Animal companions are buffed, better in WOG then other PW's), and Spells, favored enemy..<br/>\n<br/>\nThe Bard/Rog/SD, gives you synergy, bard song, buff Spells<br/>\n<br/>\nMonk 1/Ranger 9/Rog 30 gives you a HELL OF A LOT of attacks per round, to go with sneak attacking(about 7,8,9,10 attacks per round with Flurry + Improved 2 weapon fighting + haste), animal companion, spells, favored enemy.<br/>\n<br/>\nIn these builds your only giving up 2,3,4,5 rogue levels, and taking 28,29,30,31 levels of Rogue, instead of 33, but what your getting makes that a great tradeoff.<br/>\n<br/>\nRace: Either Elf or Halfling(Elf gives you Bow and access to Rapier or Longsword.<br/>\n<br/>\nStats:<br/>\n<br/>\nStr 10 to 12 to 14(14 at extreme highest)(10 at extreme lowest)<br/>\n<br/>\nDex: 17<br/>\n<br/>\nCon 10 to 12 to 14(10 at lowest, 14 at highest, 12 at highest.<br/>\n<br/>\nWis 12 to 14 to 16(12 at lowest, 14 at average, 16 if Monk, and if Str is 10/12, Dex is 17,18, con is 10/12, int 13/14<br/>\n<br/>\nInt 14.<br/>\n<br/>\nCha 8/10.<br/>\n<br/>\nFeats: If taking SD: Dodge/Mobility either to start/ an or 3rd level,an or 6th level,an or 9th level<br/>\n<br/>\nIf no SD like in Monk 1/6/Ranger 9/Rogue 25/30, then:<br/>\n<br/>\n1. Expertise, <br/>\n<br/>\n3rd. Weapon Finesse(Can use a Rapier(18 to 20 crit, see improved crit rapier below), with Weapon Finesse, and use Dexterity Bonus for Both AB(Attack Bonus and AC)<br/>\n<br/>\n6th. Weapon Focus Rapier<br/>\n<br/>\n9th: Blind Fight, Point Blank Shot, Extend Spell(if take spell caster), Knockdown(If not going to take 6 levels of Monk to get IKD<br/>\n<br/>\n12: Improved Crit Rapier(A epic Keen Rapier(18 to 20 Crit, then 16 to 20 Keen, then 14 to 20 epic Keen), plus improved crit(16 to 20 on a normal rapier, 14 to 20 on a keen Rapier, 12 to 20 on a epic Keen Rapier.<br/>\n<br/>\n15: Improved Knockdown if dont take 6 levels of Monk, otherwise either Improved Expertise, Blindfight if didnt take earlier, Extend Spell, <br/>\n<br/>\nEpic Feats: Epic Dodge, Armor Skin, Epic Weapon Focus Rapier, Epic Prowess, Great Dex's, Fast Movement(Haste your character without using spell)<br/>\n<br/>\nThese class level splits, plus these stats, plus these feats, plus weapon finesse, improved 2 weapon dual wielding 2 rapiers one in each hand or 2 Kama's.<br/>\n<br/>\nLets you:<br/>\n<br/>\nDo other things besides sneak atracking.<br/>\n<br/>\nAnd when you sneak attack:<br/>\n<br/>\nYour going to attack a LOT, sneak attack a LOT.<br/>\n<br/>\nDo a LOT of Sneak Attack Damage.<br/>\n<br/>\nCrit a lot.<br/>\n<br/>\nDo a lot of Crit Damage.<br/>\n<br/>\nAs far as Skills.<br/>\n<br/>\n37 to 47in:<br/>\n<br/>\nHide<br/>\n<br/>\nMove Silently<br/>\n<br/>\nDisable Trap.<br/>\n<br/>\nUMD<br/>\n<br/>\nTumble.<br/>\n<br/>\nSearch<br/>\n<br/>\n26 to 36 in<br/>\n<br/>\nListen or Spot(But not both, choose 1 or the other.)<br/>\n<br/>\nDiscipline<br/>\n<br/>\nConcentration(If playing a Ranger/Rogue<br/>\n<br/>\nBard/Rogue<br/>\n<br/>\nDruid/Rogue<br/>\n<br/>\n17 to 25<br/>\n<br/>\nPerform(if a Bard/Rogue)<br/>\n<br/>\nYou might be tempted to take a 16 int for more skill points.<br/>\n<br/>\n14 is enough since Rangers, Monks, Bards, that multi class with Rogue, and since Rogue get a LOT of Skill points.<br/>\n<br/>\nIf want, need more skill points then a 14 int, stay with 14 int, and play a Human multiclassed rogue.<br/>\n<br/>\nIf take a 16 int, your not going to have enough for a:<br/>\n<br/>\nStr 10,12,14<br/>\n<br/>\nDex 17,18<br/>\n<br/>\nCon 10,12<br/>\n<br/>\nInt 14<br/>\n<br/>\nWis 12,14,16<br/>\n<br/>\nCha 8,10<br/>\n<br/>\nAlso make sure u have a minimum of 13/14 in INT, for both Skill Points and to take Expertise, Knockdown, IKD(if dont take 6 levels of Monk)<br/>\n<br/>\nAlso dont overlook point blank shot, ranged, at least early to mid levels.<br/>\n<br/>\nShooting enemies, pulling 1,2 enemies to you, where can finish them off with either melee or sneak attack or ranged, is better then fighting 7 to 100 enemies all at once.<br/>\n<br/>\nOthers can fine tune what I gave said for you a lot better then I can.<br/>\n<br/>\nBut these general multiclass splits, stats, feats, etc, are pretty good.<br/>\n<br/>\nNow whether these suggestions are what your looking for, I dont know.<br/>\n<br/>\nBut hey just throwing the ideas out there for you.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}