{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "359",
  "name": "Druid/Rogue (Amia)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/druid-rogue-amia-t2349315.html",
  "author": "VariaAvoreen",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "1.3K",
  "posts": [
    {
      "author": "VariaAvoreen",
      "avatar": "no_avatar.png",
      "timestamp": "10:16 PM - Jan 30, 2014",
      "content": "<div>Hey guys, I'm trying to optimize a build for the Amia RP Server.   The server allows for level dumps (unlike arileth, it does not require the 3 class in a row caveat) and is capped at level 30.  Druids have seen some changes in Amia, given the full spectrum of animal stat buffs and some other minor things.<br/>\n<br/>\nThe idea is he was ran off from the druid coven for stealing from the elders or whatever and took up a life of being a bandit on the road.  <br/>\n<br/>\nAnyway, I was wanting some sort of 24/6 mix (for dispell immunity), sneak attacks, good stealth, bow attacks unless he gets caught in melee where he would shift into something more tanky for survival.   I was thinking about Zen archery but I'm not sure how to make it all work well stats wise.    Ideally my group and I are eventually going to be holding up people on the roads running a sort of protection/extortion/toll racket, so if at all possible I'd like it to be pretty pvp functional.<br/>\n<br/>\nAny help is appreciated, I'm not necessarily married to the 24/6, as I think maybe a 24 druid/4 fighter/2 rogue might be a better, if less rogueish option, but I'm deferring to the experts here!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:10 AM - Jan 31, 2014",
      "content": "<div>With that setup, the best spread you can use is Druid 24 Monk 3 Rogue 3, 20 Druid straight pre-epic for \"optimal\" BAB. Monk adds custom attack progression to your shapes, Wisdom-based AC, Cleave and 30% movespeed with just 3 levels. With 3 Rogue levels you get Uncanny Dodge, Sneak Attack and access to UMD for an Improved Invisibility bonus to your shapes. Not to mention you'll have Owl's Insight capping your Wisdom and basically adding +6 indispellable AC to all your shapes. You also need to put all your stat points into Wisdom and trash your physical stats because when you shapeshift, all your physical stats get overridden, so whatever points you spend on Dex, Con and Str will only work while you're in Human form.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "VariaAvoreen",
      "avatar": "no_avatar.png",
      "timestamp": "7:12 AM - Jan 31, 2014",
      "content": "<div>Hey Max, thanks for the reply.<br/>\n<br/>\nOne issue with that split is that Monks on Amia have seen a few changes I failed to mention in the OP.   Most notably of which that the Monk wisdom bonus to AC is capped at monk level, and only granted at level 3.  So in the instance you've discribed here the bonus AC would be capped out at +3, which is still decent.<br/>\n<br/>\nI'd be interested on hearing some more thoughts! Thanks again.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:00 AM - Jan 31, 2014",
      "content": "<div>Well, if being indispellable is that big a deal, it's still worth the investment. Going from 3 to 7 attacks per round is still VERY GOOD in my book, wouldn't u say? Unless they've changed that as well not to work on Druid shifted forms. You might wanna check that out before making this guy. If you don't care as much about being indispellable, you could go crazy and stop Druid at 18 levels, just enough to get Dragon Shape, and take Monk in a way that grants you a higher AC and more of the Monk goodies. If you go, say, Monk 9 Druid 18 Rogue 3, you'd be able to take some Monk levels pre-epic to ease the leveling (not that it's any hard with spells and animal companions and summons and charmed animals LOL), gain KD / IKD for free, Improved Evasion and a 90% movespeed bonus, which for a Dragon is AWESOME! You'd also have 9 Stunning Fists attempts, and since SF is modified by WISDOM (which should be your highest stat, the DC should be decent enough. It's 10 + 1/2 character level (so 15) + Wisdom modifier. And a dragon who can stun you for 3 rounds and has 2d6 Sneak Attack damage to go with his claws and bite damage is ONE SCARY MONSTER!<br/>\n<br/>\nTake it EZ!</div>"
    }
  ]
}