{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "154",
  "name": "best weapon style? shield/2handed/dual?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/best-weapon-style-shield-2handed-dual-t2355304.html",
  "author": "doomwizard",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "642",
  "posts": [
    {
      "author": "doomwizard",
      "avatar": "no_avatar.png",
      "timestamp": "3:45 AM - Jan 19, 2020",
      "content": "<div>Does it depend on levels? like would it change from 1-10, lvl 20, 30 and 40? what are the other factors that influence which fighting style you choose for a build? The level of the magic in the pw? Like is dual wielding the best when you have high magic because enchantments make strength matter less, so two handed is less powerful, because it's only a d6+ of extra damage? What about class, is a 2 handed strength rogue a waste because a lot of your dmg comes from sneak dice?  Does the +3 ac you get from a shield matter less when magic gets higher vs lower? I'm sorry if this is a little vague. I've been thinking about this and trying to understand what makes a prudent choice. Conversely is there a best weapon in each class? Is a greataxe better than a greatsword, always? Or maybe it would depend on the accessibility of the keen spell? A scimitar however is always better than a longsword right? I just want to start a discussion and learn what influences you good people when thinking about what weapon to choose, especially interested in your opinions on low magic low level weapon choice.</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "4:36 AM - Jan 19, 2020",
      "content": "<div>It varies a lot depending on what PW you play on with available weapons, NPC immunity/resistance/reduction being the key bits.<br/>\n<br/>\nAll things equal the following is a decent standard:<br/>\n1. Two Handed Weapons do more damage at the expense of AC<br/>\n2. Two Weapon Fighting does more hit attempts at the expense of Ability to Hit and AC and may or may not take a Damage hit depending on if you use small/tiny or double weapons<br/>\n3. One Handed Weapon does an average damage but preserves AC<br/>\n<br/>\nGiven a low level, low magic PW, the average damage of the weapon matters more as does the multipliers.  Although resistances/reductions/immunities vary from world to world, how they are used is often significant, particularly on a low magic/level world.<br/>\n<br/>\nMeaning that a Kukri is an excellent weapon on a medium/high magic world whilst a Bastard Sword is an excellent weapon on a low magic world.  This is because the base damage of the weapon is more of a factor when you cannot add +20 AB/Damage to the weapon.  Both weapons are rubbish on an undead world where bludgeon pierces DR and slash/pierce does not ... nor do sneak attacks/criticals ... for example.  This again increases and decreases depending on Strength bonus (The higher the Strength, the less impacting a smaller base damage).  And again on whether the build a dex build (needs to be finessable) or a str build.  And further on if the race is a small race or a medium race.  What weapons can be/are keened ... suddenly rapier looks nice if it comes in keen.<br/>\n<br/>\nAlthough it really does boil down to the world you are on, there are standards.  The following weapons are generally considered top tier weapons fit for purpose depending on what you are doing/building:<br/>\n- Scythe, Greatsword, Greataxe, Heavy Flail, Halberd<br/>\n- Bastard Sword, Katana, Dwarven War Axe, Scimitar, Morningstar<br/>\n- Kukri, Kama, Shortsword<br/>\n<br/>\nIf I had to to pick the top \"go-to\" weapons as a \"general rule\" until you sort out the nuances of a particular PW, I would say Scythe (Halberd if you cannot afford Exotic Proficiency) for a TwoHander Build, Scimitar (Katana/Bastard/Dwarven Axe if criticals are unimportant and you have space for Exotic) for a One-Hander with Shield and Kukri (Shortsword if you cannot afford Exotic and/or criticals are unimportant) for a non-monk Two Weapon / Kama for a monk Two (and potentially One) Handed build.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "6:47 AM - Jan 19, 2020",
      "content": "<div>Hi Doomwizard<br/>\n<br/>\nZanithar has it correct I believe, everything depends on environment and the magical properties of the weapon really. <br/>\n<br/>\nBut take environment out of the equation and magical properties. <br/>\n<br/>\nScimitar / Rapier / Kukri are extremely popular for threat range for critical hits, particularly in a devastating critical build. <br/>\n<br/>\nScythe is quite nice for big numbered critical hits for strength two handed builds. Greatsword/Heavy Flail/Greataxe/Halberd do slightly more base damage.<br/>\n<br/>\nIn reality it is far more complicated as Zanithar has pointed out, and any ideal weapon really does depend on the magical properties of the weapon, combined with the damage types dealt, with the resistances of the opponent (ie bludgeoning vs undead) and what feats/spells you have (for example, Keen Weapon can be cast on Scimitars/Kukris but not Rapiers). <br/>\n<br/>\nA dex based dual wielder will not want to use a two-bladed sword for example, as it is not finessable. <br/>\n<br/>\nHere's a short list that I don't think anyone would criticise you for choosing any of the below<br/>\n<blockquote><div><strong>Normal sized races</strong><br/>\nSimple Two-Handed<br/>\n- Spear (20/x3), Quarterstaff (20/x2)<br/>\n<br/>\nMartial Two-Handed<br/>\n- Greatsword, Heavy Flail (19-20/x2), Greataxe/Halberd (20/x3)<br/>\n<br/>\nExotic Two-Handed<br/>\n- Scythe (20/x4)<br/>\n<br/>\nSimple One-Handed with Shield<br/>\n- Morningstar (20/x2), Dagger - crit based build including dev crit (19-20/x2)<br/>\n<br/>\nMartial One-Handed with Shield<br/>\n- Scimitar (18-20/x2), Rapier (18-20/x2), Longsword (19-20/x2), Warhammer/Battleaxe (20/x3)<br/>\n<br/>\nExotic One-Handed with Shield<br/>\n- Bastard Sword / Katana (19-20/x2), Dwarven Waraxe (20/x3)<br/>\n<br/>\nSimple Dual-WIeld<br/>\n- Dagger (19-20/x2), Mace (20/x2)<br/>\n<br/>\nMartial Dual-Wield<br/>\n- Shortsword (19-20/x2), Handaxe (x3)<br/>\n<br/>\nExotic Dual-Wield<br/>\n- Kukri (18-20/x2), Two-Bladed Sword (19-20/x2), Double Axe / Dire Mace (20/x3)<br/>\n- Kamas (20/x2) for Monks<br/>\n<br/>\n<strong>Small races</strong><br/>\nSimple Two-Handed<br/>\n- Morningstar, Club<br/>\n<br/>\nMartial Two-Handed<br/>\n- Scimitar, Rapier, Longsword, Warhammer/Battleaxe<br/>\n<br/>\nExotic Two-Handed<br/>\n- Bastard Sword/Katana/Dwarven Waraxe<br/>\n<br/>\nSimple One-Handed with Shield<br/>\n- Mace, Sickle, Dagger (for the crit range)<br/>\n<br/>\nMartial One-Handed with Shield<br/>\n- Shortsword, Handaxe<br/>\n<br/>\nExotic One-Handed with Shield<br/>\n- Kukri<br/>\n<br/>\nSimple Dual-WIeld<br/>\n- Dagger<br/>\n<br/>\nMartial Dual-Wield<br/>\n- None<br/>\n<br/>\nExotic Dual-Wield<br/>\n- Kukri<br/>\n<br/>\nSmall Monks<br/>\n- Fists or Single Kama</div></blockquote>\nCertain weapons are less favored statistically in my view. <br/>\n<br/>\nThese include:<br/>\n- Shuriken, Whips<br/>\n- Trident, Light Flail and Light Hammer when compared to other martial weapons<br/>\n- Lances, Magic Staff (unable to weapon focus/specialise/improve critical feats)<br/>\n<br/>\nThey could (and are likely to be) be superior to the above weapons with better magical properties. <br/>\n<br/>\nBut in general they do slightly less damage/hit and have the minimum threat range for critical hits of comparable weapons of the same type and size. </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:59 AM - Jan 19, 2020",
      "content": "<div>What to wield, and when to wield it?<br/>\n<br/>\nIt all has to do with damage.<br/>\n<br/>\nOf course, the AB is going to help determine this, as are secondary type things like crit range, crittable, elemental damage on the weapon, etc.<br/>\n<br/>\nNote that there are three primary damaging attributes : Piercing, Bludgeoning, Slashing.  Some weapons have more than one type (which makes them a bit more versatile).<br/>\n<br/>\nAs has been noted, magic level of the environment (max plus, max elemental damage, etc) will help determine what weapon is best suited for which type of wield.  Also, it makes a big difference how one is attempting to attack - Str, Dex, other.<br/>\n<br/>\nHitting (so that one can apply damage) is one of the main aspects to be considered here : as has been noted, different attack styles alter the chance to hit accordingly.  One other thing to consider is survivability - if one is getting cut apart, then the offense in question is mute.  The opposite is also true - if one is not doing any damage (and not taking any), then it is fairly irrelevant to have such an high AC and/or DR at the expense of offensive AB.<br/>\n<br/>\nSingle large, two-handed weapons tend to deal lots of physical damage - this is due to both the weapon damage itself, plus the 1.5x applied Str damage (if any).  As noted, it will normally (but not always) have less AC then Sword and Board (sword and shield). Most of your high end damage weapons are large, two-handed weapons.  These type of weapons traditionally cannot be finessed, though there are exceptions (like in the case of small characters using a finessable weapon as a two-hander). This style is mostly offensive in nature.<br/>\n<br/>\nSword and Shield is probably the most balanced of all the different styles.  It can fit both a str and a dex style. It is easy to \"swap out\" to one of the other styles, should that be necessary or desired.  It has a solid offense and a solid defensive attribute.<br/>\n<br/>\nTwo-Weapon style is mostly for dex builds, though some str builds might have them.  One traditionally uses this weapon style to apply many attacks in one round.  This is useful if one is trying to threaten crits, effects, or large amounts of elemental damage in one round.  It does suffer from a drop in AB - and is dependent on a number of feats to curtail a large drop (though the Ranger class gets some of these feats for free).<br/>\n<br/>\nAs Other I include the Monk UBAB fighting with Fists and Kamas.  It is different enough that it should have it's own catagory.  Unlike the other weapon styles, fighting with Fists cannot be disarmed (well, one could theoretically vorpal an arm off, I suppose...).  UBAB (unarmed basic attack bonus) has a progression of -3, unlike normal BAB's progression of -5.  This means that someone who has the same AB as a Fighter using the Two-Weapon attack style with Kamas as a Monk will have more attacks a round at the same -5 progression (assuming all the feats for Two-Weapon style and a small weapon - or tiny in the case of small characters - in the offhand).  This makes the potential for damage in that round higher at no additional cost (other than perhaps AC).<br/>\n<br/>\nAgain, because environments differ, it is hard to pin down just which style is best, especially considering all the different builds that can affect this (apart from items, opponents, etc).<br/>\n<br/>\nThings that I would consider is : is it reasonable to expect that a two-handed weapon will hit the opponent enough to be worth the AC drop (if any)?  If not, then it is probably wiser to go with one of the other weapon strategies.  Things that can affect this in an environment are the availability of \"uber\" weapons of a particular type.  An example would be like a Rapier with some nasty status effects combined with some irresistable energy effects in the hands of a small character that can also apply increased damage (like sneaks) to a creature that cannot act (due to the applied status effect of the weapon).<br/>\n<br/>\nIf I cannot reasonably expect my two-hander to be viable, then I should build accordingly and adopt one of the other styles, one that has a better expectation of success (re: damage.  It is really all about damage imo).<br/>\n<br/>\nConversely, as I have pointed out, one must keep an eye on how vulnerable one's own character is (AC wise).  If one is taking too much damage due to the weapon style, the point is really pretty moot - what might look flashy and/or threatening is hardly fun and useful if one is dirtnapping constantly, or having to chug heals every couple of rounds.<br/>\n<br/>\nAnd so we come to the Str vs Dex situation.  Dex wielders (dexxers) are considered, for the most part, to have the highest AB potential, at the cost to damage.  They also tend to have high ACs, as Dex is traditionally a stat that applies to the AC determination (but also has many different things to consider such as flat-footed, flanked, etc).  As also pointed out, Two-Weapon fighting is largely (but not necessarily only) limited to dex based fighting (due to AB and AC considerations).<br/>\n<br/>\nStr based fighting aka Two-Handed (though as has been noted, there are notable exceptions if the race of the character in question is small) tends to deal more damage per hit as Str is traditionally not only an AB modifier but also a damage modifier (and is one of the only stats that does this - though Cha can under some situations also be a damage and/or hit modifying stat).<br/>\n<br/>\nSo the Mantra basically goes :<br/>\n<br/>\nIf you are going to be facing mostly low AB based foes who have a lot of DR, you will most likely want to use Two-Handed weapons.<br/>\n<br/>\nIf you are going to be facing a variety of foes at once (some easy to hit, but deal large chunks of damage, some hard to hit, but deal little damage, etc) then Sword and Shield is probably the best bet (because it is very difficult to be slinging different weapons and DR items around in one round in attempt to counter).<br/>\n<br/>\nIf your character is primarily one that will be threatening lots of status effects, energy types, etc, then the Two-Weapon approach may be better suited - especially if opponents are resistent against Two-Handed and Sword and Shield styles.</div>"
    }
  ]
}