{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "076",
  "name": "Looking for advices for a level 20 PVP monk/assassin build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/looking-for-advices-for-a-level-20-pvp-monk-assass-t2354686.html",
  "author": "samurainostalgique",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "626",
  "posts": [
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "12:56 PM - Apr 01, 2017",
      "content": "<div>Hello!<br/>\n<br/>\n I'm currently playing on a french RP mid-magic (with +5 items) PW called \"Fastfrench\" as a human pure monk. The level cap is 20, and I've already attained it. However, the DMs are willing to let me reroll my character into a monk/assassin with brand new stats, if I roleplay his fall to evil and his learning process. It'll probably take a while, and I'm going to take advantage of this time to think about the build I'll use.<br/>\n<br/>\n As I've mentionned in the title, I'm primarily interested in PVP performance, because roleplay here tends to lead to wars, duels, etc. This toon fights unarmed and I want him to stay that way, for roleplay and aesthetic reasons. Besides, there aren't many good kama here but lots of good monk gloves. I don't care about playability before level 20 since I won't have to do the leveling again.<br/>\n<br/>\n A few informations about the PW:<br/>\n<br/>\n - No third class allowed, except in very specific combinations for the archer mage. So no monk/shadowdancer/assassin here sadly.<br/>\n<br/>\n - At least 4 levels in each class are required by the rules.<br/>\n<br/>\n - We are not forced to roleplay low attributes, so they can be min/maxxed as much as we want.<br/>\n<br/>\n - A few spells have been modified. Most importantly for this build, true seeing and find traps. True seeing \"only\" gives a 25 bonus to spot and listen and invisibility detection, whilst find traps only detects traps and no longer disables them. Also, divine favor only gives a bonus to damage, not AB, meaning that clerics and paladins can't achieve as high a AB as usual, and that even for them, dex monks are very difficult to hit.<br/>\n<br/>\n - The module was made before the HOTU expansion, which means that the UMD check for using scrolls is not implemented, so a character with even just 1 point in UMD can use all scrolls, provided that he is of sufficient character level. I've just tested it.<br/>\n<br/>\n - I have not found any traps for sell in shops. It might be possible to craft them, but the module uses a specific crafting system which demands a lot of time to get to the level where you can actually craft something good, and there aren't too many people motivated enough to craft regularly (I myself have given up on crafting...) so I wouldn't count on it too much. So it seems I'll have to invest in search and disable traps, so as to be able to recover traps myself in dungeons if I choose to make this character a trapper (fortunately though, some dungeons have lots of traps including some deadly ones I think).<br/>\n<br/>\n -Shields only give their base AC, and no additional AC, making it easier for average BAB classes like the monk to actually hit something in PVP. It is still difficult though, and weapon masters tend to use improved expertise when fighting against me to turn the fight into a battle of 20s.<br/>\n<br/>\n - Palemaster is not a popular class choice here, probably because of the level cap. In fact, there currently isn't any in the PW, so I don't really need to worry about immunity from critical hits.<br/>\n<br/>\n - I've found that there are a lot of taunters here, even characters who have taunt as a cross-class skill, like fighter/weaponmasters, so concentration is actually useful even for a non-caster.<br/>\n<br/>\n So there are 4 things for which I'm hesitating here.<br/>\n<br/>\n First, the level split:<br/>\n<br/>\n The most obvious choice here would be to get as many assassin levels as possible to have a high DC and high damage on the death attack and all the assassin spells, so a 10 monk/10 assassin split. But I'd be losing 1 point of AB, which hurts.<br/>\n<br/>\n The second option would be 12 monk/8 assassin. This one would lose no AB, would have 1d12 unarmed damage instead of 1d10, immunity to poison, and more importantly, diamond soul. Now, of course a 12 level monk's spell resistance won't do anything against a 20 level caster, but against non-casters, who use magic items (especially UMD users with wands and scrolls), to cast spells against me with a low caster level, this would make for some good protection.<br/>\n However, the death attack's DC would be 2 points lower (though the higher AB might make up for that by leading to more death attacks landed in the first place), I'd lose 1d6 damage on my death attacks and the assassin's improved invisibility would be lost. Then again, I can buy improved invisibility scrolls for the times when I really need the 50% concealment, since UMD allows me to use them. I can't buy as many as I'd want though, as shops only have a limited amount of them available at each server reboot.<br/>\n<br/>\n The third option I'm thinking about is 16 monk/4 assassin. This would give me 1d20 unarmed damage, 1 more AC point, and a better magic resistance. But of course, the death attack DC would be very low, the death attack damage would be only 2d6, and I'd lose the assassin's invisibility and darkness spells, though, as for improved invisibility, they can be casted from scrolls, and I can buy an infinite amount of invisibility potions.<br/>\n<br/>\n Second, the skill selection:<br/>\n<br/>\n Assuming a 14 intelligence, with the human bonus skill points, I would have enough points to max 7 skills. But that's not a lot when there are so many good class skills to choose from. Tumble, hide, move silently, and use magic device, seem essential to the build. However I'm not so sure about what to choose for the 3 remaining skills. I could go the trapper way, and take all 3 traps skills, though I'm not sure it's worth it to get them to the max, even though it's a PVP build. Otherwise, good skills choices would probably be concentration, discipline (I know that a dexterity based character will have a hard time resisting knockdowns even with maxxed discipline, but it still saved me a few times), spot, listen, and spellcraft. I'm unsure about dropping concentration, considering what I've said above about the taunters here.<br/>\n The truth is, I've never played a trapper before. Are traps good enough to justify investing in three skills just for them?<br/>\n<br/>\n Third the attribute distribution:<br/>\n<br/>\n Keeping in mind that the character is human, I'm thinking about something like this:<br/>\n<br/>\n Strength: 8<br/>\n Dexterity: 17 (22)<br/>\n Constitution: 13<br/>\n Intelligence: 14<br/>\n Wisdom: 14<br/>\n Charisma: 8<br/>\n<br/>\n But I've considered dropping the constitution to 9 to bump intelligence to 16, to get one more skill, and improve my death attack DC. I fear it would make me too fragile though.<br/>\n Another option would be this:<br/>\n<br/>\n Strength: 8<br/>\n Dexterity: 15 (20)<br/>\n Constitution: 14<br/>\n Intelligence: 16<br/>\n Wisdom: 14<br/>\n Charisma: 8<br/>\n<br/>\n But of course, losing 1 point of both AB and AC is quite painful...<br/>\n<br/>\n Fourth, the feats:<br/>\n<br/>\n I'll take blind fight, weapon focus, improved critical, weapon finesse and toughness, but I'm not too sure about the remaining 3; I've read in an assassin class guide that to make the paralyzing part of the death attack, one needs to make the initiative check, so I wonder if it could be worth it to take improved initiative, blooded and thug. Otherwise I'll probably take dodge, and save improving feats I'm thinking about luck of heroes and great fortitude). Or maybe discipline focus feats for hide and move silently.<br/>\n<br/>\n<br/>\n Now that I think about the fact that UMD would allow me to cast all the assassin spells with scrolls, I wonder if a monk/rogue might be a better choice with the crippling strike and skill mastery bonus feats.</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:52 PM - Apr 01, 2017",
      "content": "<div>Let me understand this...<br/>\n<br/>\nYou are considering using traps for PvP encounters?  Unless there are no rogues on the server, this is a recipe for failure since you will not have access to Skill Mastery which further means there's no way to set them during combat without a fair chance of suicide.  You may catch low-Search toons occasionally, but that's about all.  The only skill I'd consider investing in for PvP would be Search and even in that respect and assuming vanilla rules, an assassin cannot spot any trap with a DC of 36 or above and the rogues which will be setting them will certainly be surpassing that DC as a dedicated trapper and be spotting equivalent rogue-set traps..<br/>\n<br/>\nSo, what I'm saying is that you should build either for PvP or PvM but never both because dealing with PC combat is a whole other consideration. Naturally, you <span style=\"text-decoration:underline\">can</span> build that way, but the compromise means you will barely effective for both instead of very successful at one.  For PvP, try to maximize a single strength beyond the ability of other players to counter it.  If you are lucky, and there are very few strong counters, your toon will succeed more than fail. Figure on \"eating\" the weakness(es) of PvM combat in order to optimize your dueling efficiency.<br/>\n<br/>\nActually, the most important scroll I'd be collecting would be Darkness.  The duration is relatively short, but with a monk's UBAB, there will a lot of potential DAs within those 3 rounds (i.e. 18 attacks/21 hasted before expiry).  Without HiPS, opportunities to trigger PvP sneaks will be few.  What I've found is that few players walk around pre-buffed with Ultravision so, combined with the nerf on TruSee, seems an obvious exploit to me.  But that's another tendency that requires experience to evaluate fully.<br/>\n<br/>\nAll you can do as a DA specialist, is collect all the +INT gear possible, hopefully to reach the +12 cap (assuming the server hasn't modified this rule).  Use Bestow Curse scrolls on warrior types, typically with poor Will saves, to lower their Fort permanently.  That would have the same effect as INT +2 or another assassin level.<br/>\n<br/>\nWithout the hardcore scroll check, you only need enough <span style=\"text-decoration:underline\">net</span> ranks to cover the \"value\" (which is not the same as \"cost\").  You may also find/buy wands (you'd know better than I, of course) with useful charges for buff effects.  Not sure how the barter system works on your PW, but friends with Craft Wand may be able to trade valuable items towards your cause.  Just make sure that the net UMD ranks fall on 1, 5, 10... etc and that's the most efficient allocation to cover higher-valued items (Level 9 scrolls are usually valued over 5K ea., as an example requiring net UMD 10 to use them).<br/>\n<br/>\nAt this reading of your OP, I am inclined towards the mnk12/asn8 split but the ability split is up for grabs until you settle on a firm PvP strategy.  Unless there are significant needs to max more than the basic skills, I wouldn't become enraptured with controlling the DA DC by virtue of an unbalanced (&gt;14) INT starting level.  It's not an equitable trade-off with medium HD classes who need Fort and HP.</div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "4:34 PM - Apr 01, 2017",
      "content": "<div>Well, I did say I had no experience with with trappers :)<br/>\n<br/>\n So, given what you're saying about maximizing a single strength, maybe assassin isn't my best bet. After all, the assassin is a DA specialist, but with a 12 monk/8 assassin split, I would have only a 26 DC while reaching the +12 cap (this rule has not been changed, btw), and I think there are a lot of warrior types with mid 20s fortitude here. Then again there are also rogues, who certainly have good search skills.<br/>\n<br/>\n Perhaps a monk/rogue with skill mastery would be better, as I would have traps for all save types. Maybe a monk 4/rogue 16 split, allowing me to also get crippling strike and another bonus feat, and have 8d6 of sneak attack damage.</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:30 PM - Apr 01, 2017",
      "content": "<div>What about mnk12/bg8?  It's an optimal taunter and will max the monk UBAB at 7 APR (8 hasted).  SR 22.  Move speed +40%. At INT 13, you'll be able to max Conc, Taunt, Tumble and the 2 stealth skills with a handful of skills left over for (probably) some Listen.  The Doom Knight is one of the better summons for 20-cap limit and will use a fear aura at times.   <br/>\n<br/>\nPvP trapping is an art.  I recommend building a few <span style=\"text-decoration:underline\">PvM</span> trappers beforehand to get a feel about what works in different situations and build confidence rather than panic.  You'll eventually face PvP arcane Iron Golems and perhaps even BBoD on occasions, situations where traps have limited effectiveness.  I recommend, for PvP, either build a pure rogue (uber Set Trap skill including the matching skill focus) or skip traps altogether.  The best trap-setter will <span style=\"text-decoration:underline\">always</span> be a halfling and it appears you started as Human so are stuck with that much (no?).<br/>\n<br/>\nIMO, the key shortcoming building a non-trapper without assassin or rogue levels is lack of UMD.  The skill's handy for sure, but since you already get access to monk gear by virtue of class... the boots, robes and gloves are already available.  What you'll miss out on are the scroll buffs.  C'est la vie!  Can't be helped without access to a tertiary dump class.<br/>\n<br/>\nJust tossing out a build that could be used for comparison with other ideas.  The strength here is: stealth for avoiding perception, fast-close speed and a potentially immobilizing attack via IKD or SF (ideally, before they can go modal). The bare bones looks something like this:<br/>\nSpoiler [+]<br/>\n<br/>\nMonk 12/ Blackguard 8, LE Human only<br/>\n<br/>\nSTR: 10<br/>\nDEX: 17 (22)<br/>\nCON: 14<br/>\nWIS: 12<br/>\nINT: 13<br/>\nCHA: 8<br/>\n<br/>\n01 - Mnk(1): Blind Fight, Dodge, {Class: Evasion, SF}<br/>\n02 - Mnk(2)<br/>\n03 - Mnk(3): Weapon Finesse<br/>\n04 - Mnk(4): DEX+1 (18)<br/>\n05 - Mnk(5)<br/>\n06 - Mnk(6): WF: Unarmed, {Class: KD/IKD}<br/>\n07 - Mnk(7)<br/>\n08 - Mnk(8): DEX+1 (19)<br/>\n09 - BG(1): Expertise<br/>\n10 - BG(2)<br/>\n11 - BG(3)<br/>\n12 - BG(4): DEX+1 (20), ImpCrit: Unarmed<br/>\n13 - Mnk(9): {Class: ImpEvasion}<br/>\n14 - Mnk(10)<br/>\n15 - BG(5): ImpExpertise<br/>\n16 - BG(6): DEX+1 (21)<br/>\n17 - BG(7)<br/>\n18 - Mnk(11): SkF: Taunt (or SkF: Conc)<br/>\n19 - Mnk(12)<br/>\n20 - BG(8): DEX+1 (22)<br/>\n<br/>\nHP max: 216<br/>\nSaves F/W/R: 15/10/15<br/>\nAdd'l saves: Mind Effects +2<br/>\nBAB: 17<br/>\nAB (max, naked): 24 (melee), 23 (ranged) (+6 max taunt)<br/>\nAC:  (naked/mundane robes) 23/ (mundane plate/tower) 26 [+1 Dodge]<br/>\n<br/>\nSkills (122) - Concentration 23(25), Hide 22(28), Listen 12(13), Move Silently 22(28), Taunt 23(25), Tumble 20(26)</div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "12:32 AM - Apr 02, 2017",
      "content": "<div>Unfortunately, this is incompatible with the PW's rules.<br/>\n<br/>\n According to these rules, monks can only multiclass with one of the following classes: fighter, rogue, shadowdancer, and assassin.<br/>\n<br/>\n You're right, I'm stuck with human. I think I'll probably do a monk 12/assassin 8 in the end. If nothing else, the death attack will at least allow me to paralyze warriors on a fumble, and will paralyze some sneakers and mages quite easily.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:29 AM - Apr 02, 2017",
      "content": "<div>How about Rogue 4 / Monk 4 / Fighter 12? If you keep Monk and Rogue balanced, you can avoid the experience penalty. Or Rogue 12 / Monk 4 / Fighter 4.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "9:55 AM - Apr 02, 2017",
      "content": "<div>As I said in the OP, the PW's rules prevent me from using three classes.<br/>\n<br/>\n About traps, would it be possible to use monk speed to disengage from combat and then use them while taking 20? Because of the multiclassing rules, there are lots of people who don't have the search skill as a class skill, so maybe even if I'm not an optimal trapper, it would still be effective in some encounters, like the fighter/weaponmasters I've talked about in the OP.<br/>\n<br/>\n Or is this tactic impractical or unrealistic?</div>"
    }
  ]
}