{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "004",
  "name": "Tactical Archery: Tips and Tricks (including the 'SAMS' strategy)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/tactical-archery-tips-and-tricks-including-the-sam-t2355297.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 12,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:17 PM - Jan 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong>Tactical archery: Tips and Tricks</strong><br/>\n<br/>\nHail all ECB forumers!<br/>\n<br/>\nI have been a number of playing ranged builds pretty solidly for a good 3-4 months now.<br/>\n<br/>\nOf the three major ways of dealing damage (melee, ranged and spellcasting) and with the exception of some power-builds, ranged combat is thought of as the lesser of the three.<br/>\n<br/>\nHowever there are quite a few tactical thought processes involved in playing a ranged character which are not quite obvious.<br/>\n<br/>\nAlso both melee and spellcasters can make use of ranged weapons in certain ways.<br/>\n<br/>\nHere are some thoughts regarding using ranged weapons in solo player and party play. <br/>\n<br/>\nIn addition, I have included what appears to be a novel strategy taught to me by <em class=\"mention\">@BlackCobra</em> for melee stealthers which I have adapted for ranged builds I have called the SAMS strategy (Stealth-&gt;Attack-&gt;Move-&gt;Stealth) but one could also call it 'hiding in plain sight without HiPS' or 'attacking without really breaking stealth' but SAMS helps you remember the process to achieve the desired outcome. This strategy utilises an understanding of the detection mechanics of the NWN.<br/>\n<br/>\nHope you find this helpful. If you have any additions or further comments, or if things are difficult to understand feel free to comment or send me a PM<br/>\n<br/>\n<strong>Minimum prerequisites:</strong><br/>\n<br/>\n- Ranged weapon (longbow, shortbow, heavy crossbow, light crossbow, sling, darts, t<span style=\"color:#131513\">hrowing </span>axes, shuriken)<br/>\n- Ammunition (arrows, bolts, bullets, darts, throwing axes, shuriken)<br/>\n<br/>\nAll characters can use at least one ranged weapon. <br/>\n<br/>\nAll classes except druids (darts/sling) may equip heavy and light crossbows without additional proficiencies. <br/>\n<br/>\n<strong>Further improving ranged combat prowess:</strong><br/>\n<br/>\nThis can be achieved by:<br/>\n<br/>\n- Increasing the Ranged AB through racial choice (ie. Halfling provides +3 ranged AB with a sling, with small stature, good aim and +2 dexterity), feats (ie. Weapon Foci, Enchant Arrow), base attributes (Dexterity or Wisdom with Zen Archery), items (ie. Longbow +1, Ring of Dexterity +2), spells (ie. Divine Favor, Cats Grace)<br/>\n<br/>\n- Increasing the chance to hit against concealed (ie improved invisibility) or unseen enemies (ie 'listened' but not spotted enemies) with Blind Fight<br/>\n<br/>\n- Increasing the Ranged Damage per hit through character feats (ie. Improved Critical, Weapon Specialization, Bane of Enemies, Divine Might, Enchant Arrow), items (ie. Composite Longbow +1 with +3 mighty, Arrows +4) or spells (ie. Divine Favor). <br/>\n<br/>\n- Strength may increase ranged damage through the mighty item property. For bows, crossbows, slings and shuriken, this is required to be a magical property, and in most environments is commonly limited to +5. Darts and throwing axes intrinsically have the mighty property, and has no cap (ie. a throwing axe used by a 30 Str Fighter will have +10 strength damage added to each successful hit). <br/>\n<br/>\n- Avoiding having low strength unless you are wielding a crossbow. Having a negative strength modifier (ie. Strength less than 10) will lead to a reduction in ranged damage, unless the wielder is using a either a light or heavy crossbow. <br/>\n<br/>\n- Increasing the number of ranged attacks per turn, with Rapid Shot (for all weapons except crossbows), Rapid Reload (allowing crossbows more than 1 attack/round), the Haste magical item property or the Haste/Mass Haste spell<br/>\n<br/>\n- Detecting enemies before they detect you. The further away you attack, the greater advantage you have with your ranged weapon. This is can be enhanced with detection skills (spot and/or listen), detect mode, spells (Ultravision, See Invisibility, True Sight), equipment (ie. Watchman's Helm or Greater Robe of Eyes), high Wisdom scores, or certain feats (such as Elf Keen Senses and skill bonuses). <br/>\n<br/>\n- Utilising stealth to detect enemies before they detect you allowing you to attack at a distance, or to elude detection after being discovered, by going around corners, utilizing Hide in Plain Sight, or cleverly managing the NWN engine's detection mechanism.<br/>\n<br/>\n- Slowing enemy movement speed after they detect you. This could be through the use of traps such as tangle/frost/sonic/acid blob traps, spells such as grease or hold monster, feats such as Called Shot (leg).<br/>\n<br/>\n- Speeding up your own movement after detection, through the use of feats (such as Monk Speed), spells (Expedious Retreat, Haste, Mass Haste) or items<br/>\n<br/>\n- Preventing enemies from entering melee range through party members (ie a melee fighter teammate), companions/summons (ie. Summon Creature VI), or terrain (ie standing on a cliff ledge, shooting over barricades)<br/>\n<br/>\n- Devastating Critical can also be obtained on a ranged weapon (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/aelynthi-the-deadly-bard-7-arcane-archer-23-rdd-10-t2355162.html\" rel=\"noreferrer\" target=\"_blank\">Red Dragon Disciple</a> is a nice way to obtain this without hurting ranged AB, <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18440#p18440\" rel=\"noreferrer\" target=\"_blank\">half-orc is another potential option</a>)<br/>\n<br/>\n<strong>Strong ranged builds</strong><br/>\n<br/>\nExamples of strong ranged builds include:<br/>\n<br/>\n- Elf or half-elven Arcane Archer<br/>\n- Cleric Wisdom based Zen Archer or Arbalest<br/>\n- Fighter Archer or Crossbowman<br/>\n- High level Ranger Archer or Arbalest<br/>\n- Rogue/Assassin Archers or Arbalest<br/>\n- Divine Might users (Paladin/Blackguard/Cleric) to add damage to ranged attacks<br/>\n<br/>\n<strong>Ranged strategy: The Pull</strong><br/>\n<br/>\nThis is one of the most valuable strategies for any NWN player to learn.<br/>\n<br/>\nThe concept is to: <br/>\n- detect an individual enemy without them detecting you first<br/>\n- shoot them with a ranged weapon aiming to only make one enemy chase you<br/>\n- retreat to a safe location without any other additional enemies<br/>\n- defeat them if possible, using melee weapons, spells, or other strategies (see below)<br/>\n<br/>\nEnemies in NWN modules tend to group up in mobs, so singling out individuals makes life much easier.<br/>\n<br/>\nWands may achieve the same purpose however the range of a ranged weapon will likely be far superior.<br/>\n<br/>\n<br/>\n<strong>Ranged strategy: Pull into traps</strong><br/>\n<br/>\nThis is pretty simple, and you add traps to the previous strategy.<br/>\n<br/>\nThese could be damaging (such as fire/electrical traps), disable (such as frost/sonic/acid blob traps) or slowing traps (such as tangle traps). <br/>\n<br/>\nTangle traps have great DC (minor tangle DC 20 to deadly tangle DC 35) compared with other traps (a deadly frost trap has a DC of 15 for example).<br/>\n<br/>\nTraps additionally can be stacked forcing your opponent to make multiple DC saves.<br/>\n<br/>\nSpells may also act as 'traps', such as glyph of warding and delayed blast fireball.<br/>\n<br/>\n<br/>\n<strong>Ranged strategy: Put a summon or teammate in the way</strong><br/>\n<br/>\nThis is the same strategy as the pull, except you put a summon (using spells or UMD) or a melee teammate in the way, allowing you to shoot away unimpeded. <br/>\n<br/>\n<br/>\n<strong>Ranged strategy: Put terrain in the way</strong><br/>\n<br/>\nBasically you shoot enemies with cliffs / rivers / barricades in the way. They can't reach you with melee weapons, and you blast them with your ranged prowess.<br/>\n<br/>\n<br/>\n<strong>Ranged strategy: Utilize stealth - the Stealth-&gt;Attack-&gt;Move-&gt;Stealth (SAMS) strategy</strong><br/>\n<br/>\nThis is a strategy that @BlackCobra taught me with melee stealthers. I have applied this to ranged builds and I appreciate him giving me permission to share this information with you.<br/>\n<br/>\nThis only works against NPCs and creatures. This will not work against players.<br/>\n<br/>\nThis is how to do it:<br/>\n<br/>\n- approach an enemy NPC/creature undetected (<em>stealth</em>)<br/>\n<br/>\n- attack this enemy, breaking stealth/invisibility (<em>attack</em>)<br/>\n<br/>\n- <em>as quickly as possible</em> order a move to a different location (<em>move</em>) then <em>as quickly as possible</em> enter stealth mode (<em>stealth</em>)<br/>\n<br/>\nIf you have done this successfully you will re-enter stealth mode without the enemy detecting you. <br/>\n<br/>\nThe faster you do this, the more likely you will be successful. <br/>\n<br/>\nYou can repeat this process until you fail your combination, then you will need to choose a different strategy, such as ones discussed previously, or stealthing around a corner.<br/>\n<br/>\nWhy does this work? To understand why this works, one requires an understanding of how detection works in NWN. <br/>\n<br/>\nFirstly, for players detection almost feels continuous.<br/>\n<br/>\nHowever for NPCs, detection is much more periodic. <br/>\n<br/>\nThis is from the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Detect\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki Detect</a>, which is quoting a forum post from BioWare employee Brendon Holmes:<br/>\n<blockquote><div><strong>Passive (default) mode</strong><br/>\n<em>[...]<br/>\nSpot/listen roll:</em> d10 + half skill<br/>\n<br/>\n<strong>Active (detect) mode</strong><br/>\n[..]<em>Spot/listen roll:</em> d20 + full skill<br/>\n<br/>\n<strong>Stealth checks</strong><br/>\n<em>Player detects stealth:</em> 5 times per second<br/>\n<em>NPC detects stealth:</em> 4 seconds<br/>\n<em>Creatures roll for hide/move silently/spot/listen:</em> every 6 seconds</div></blockquote>\nUsing these details, in a PvM situation a NPC or Creature at a rate of 3-5% (or 20-30 times less frequently than) of a player. <br/>\n<br/>\nThis is a huge difference. I am unsure why it was coded in such a way.<br/>\n<br/>\nTherefore there is a 4-6 second window in which a player can potentially 'restealth' without being formally detected.<br/>\n<br/>\n<br/>\n<br/>\nHere is a series of screenshots to demonstrate the stealth-&gt;attack-&gt;move-&gt;stealth process. <br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_ccd6a0ee8f50fefe84662006c957abcd_t.jpg\" />\n</dl>\n</span><br/>\nI am stealthed and undetected by all the enemies in the screenshot. <br/>\n<br/>\nI attack the troll with my longbow then, as quickly as possible move to the green arrow located on the screen, then as quickly as possible activate stealth (I used the F1 quickbar hotkey in this example).<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_4abba815e1b99ff3bf02999e20981c9e_t.jpg\" />\n</dl>\n</span><br/>\nThe troll walks to my location which I had attacked him, whilst I relocate, undetected to the new location.<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_f6e690c2f57425176b3cb0da48b9790e_t.jpg\" />\n</dl>\n</span><br/>\nI repeat the same process in this screenshot. I am stealthed, attack the troll with my longbow, <em>as quickly as possible</em> click move to the green arrow, then <em>as quickly as possible</em> active stealth mode.<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_9ed356f2a734d2dfc5868560a734450a_t.jpg\" />\n</dl>\n</span><br/>\nI land a critical hit on this occasion and the troll dies, but I hope this demonstrates the method I am hoping to communicate to you.<br/>\n<br/>\nThe piles of corpses you see indicate the enemies I have defeated utilising this process, suffering minimal damage to myself. <br/>\n<br/>\n<br/>\n<strong>Ranged strategy: Utilize stealth - both out of sight, or in plain sight</strong><br/>\n<br/>\nFor me, and if I am solo, if the above strategy fails and I am detected, I will need to either: <br/>\n<br/>\n- Stealth 'out of sight' by running around a corner (see screenshot) or <br/>\n- Hide 'in plain sight' using an invisibility potion/spell or using the Hide in Plain Sight (HiPS) class feat from Shadowdancer level 1. <br/>\n<br/>\nNote that some creatures can potentially detect invisible opponents with the listen skill if you are close enough to them. <br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_fddf6b0b7df0c03085f3d8d8ef67266c_t.jpg\" />\n</dl>\n</span><br/>\n<strong>Ranged Strategy: Harass with high speed or slowing your opponent</strong><br/>\n<br/>\nThis is pretty simple, you pull one opponent, and get frequent free attacks by having a higher movement speed than your opponent.<br/>\n<br/>\nThis is achieved by:<br/>\n<br/>\n- being faster than your opponent, (for example, utilising haste/expedious retreat/mass haste, perma-haste items, horses or monk/barbarian speed). Monk speed is superior to barbarian speed as it unlocks the default movement speed cap and one can move combine expedious retreate/mass haste/perma-haste with monk speed to move <em>extremely </em>fast.<br/>\n<br/>\n- making your opponent slower, with tangle traps, called shot (leg), or spells such as grease/slow etc<br/>\n<br/>\n<br/>\nHope this is insightful to you!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:06 PM - Jan 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You almost hit the jackpot at the end...but then leave out the absolute most important part of range attacking :<br/>\n<br/>\nKiting.<br/>\n<br/>\nIn NWN, one can kite (and not just with missle weapons, but with wands, as well) by kiting.<br/>\n<br/>\nI use the WASD keys to kite.  This leaves my other hand free on the mouse to keep the cursor on the enemy so that I can attack it while I am running.<br/>\n<br/>\nAnd this is the key - while RUNNING.  Done correctly, your character will never stop and turn towards the enemy like a normal ranged attack, but will instead keep running, and <strong>shoot out of the back while doing so!</strong><br/>\n<br/>\nOf course, being faster than your opponent (or the same speed) is I think pretty obvious here.<br/>\n<br/>\nMastering Kiting is paramount to good ranged attacking imo. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:10 PM - Jan 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Web<br/>\nI actually use the WASD kiting strategy you taught me but forgot to write it in. <br/>\nI blame tiredness here<br/>\nTumble is pretty handy in such a situation.<br/>\nI'll edit it in when I get some time.<br/>\nNice save, very much appreciated<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:13 PM - Jan 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like this guide!<br/>\nThere is a tactics chapter in my <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=2835#p2835\" rel=\"noreferrer\" target=\"_blank\">AA guide</a> that covers some of the above tactics, and then some.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:03 PM - Jan 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for that Mick<br/>\nI like how you describe the WASD kiting strategy and will quote your section by editing the main post!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "6:49 AM - Jan 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice write up.  A couple things you may consider to add:<br/>\n<br/>\nPoint Blank Shot: removes the -4 penalty and provides an extra +1 to AB when your foe is within 15 feet.<br/>\n<br/>\nMounted Archery:  Since many folks will have neither Barbarian nor Monk, and will lack Haste at early levels, Horses may be the best thing available.  If on Horseback, mounted archery will reduce the -4 to a -2.  I don't think it's worth the feat investment, but it's probably worth mentioning.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "10:21 AM - Jun 06, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"18445\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18445&amp;sid=32cdfc24c8677c6feba9d7be94914ed7#p18445\">↑</a><div class=\"responsive-hide\">Jan 14, 2020</div></cite>You almost hit the jackpot at the end...but then leave out the absolute most important part of range attacking :<br/>\n<br/>\nKiting.<br/>\n<br/>\nIn NWN, one can kite (and not just with missle weapons, but with wands, as well) by kiting.<br/>\n<br/>\nI use the WASD keys to kite.  This leaves my other hand free on the mouse to keep the cursor on the enemy so that I can attack it while I am running.<br/>\n<br/>\nAnd this is the key - while RUNNING.  Done correctly, your character will never stop and turn towards the enemy like a normal ranged attack, but will instead keep running, and <strong>shoot out of the back while doing so!</strong><br/>\n<br/>\nOf course, being faster than your opponent (or the same speed) is I think pretty obvious here.<br/>\n<br/>\nMastering Kiting is paramount to good ranged attacking imo. </div></blockquote>\nI tried doing this and I can't figure it out. Does it work with slings? Crossbows? I keep one finger pushing down W to keep moving forward while I'm shooting at the same time by clicking on enemies with the left mouse button. Sometimes, it works. I'm shooting while I run without even stopping, turning and aiming. It's hilarious when it works. But more often my character just slows down when I click on an enemy behind me but doesn't shoot and eventually I've either slowed down too much or I've run out of space to run so I have to melee.<br/>\n<br/>\nCan anyone explain how to master kiting? Please? I would love to understand this better.<br/>\n<br/>\nIt's worked the best for me with bows. With slings and crossbows, I can't seem to shoot while running.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:53 PM - Jun 06, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You have to be at a slight angle to your opponent (at least, that is my observation).  Also, don't try to \"overkill\" while shooting (by this I mean clicking like a mad fiend).  You do not want to be overriding your directions with attacks.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:15 PM - Jun 06, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just to add a little bit to what Web says: be aware of your APR, otherwise you'll be at risk of, as he says, \"overkill\" and the AI will stop you  in your tracks to prepare for a new attack round.<br/>\n<br/>\nAfraid I can't say whether it works with slings or crossbows (or darts), but I have had some success with shurikens (and yes, you need a lot of the little beggars), so I can't see why it wouldn't.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "2:05 PM - Jun 06, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Make sure you're using the camera mode that lets you move and see independently (where moving forward with the keyboard doesn't snap the camera back, but rather lets you rotate it freely). Zoom out quite a bit to make things easier. It takes some practice. As far as I remember with my shooting Demolition Woman, with a sling and a short bow, it only works on the first flurry of the round - I think this is because once you move after your first flurry, the game takes it that you're done attacking for the rest of the round. Set a metronome or get used to counting out the 6 seconds in your head. Say I have two attacks on the first flurry, and I have Called Shot: Leg on F4. <br/>\n<br/>\nThe way I used to do it is to do F4-left click-F4-left click to queue up two called shots, let go of E (forward) for a split second until you slow down a bit, then resume running. This is the tricky bit, you do not have to wait all the while until the first projectile of the flurry fires but as I recall I had to let go of forward for a little bit. Every first flurry attack will fire, even though the animation would suggest that this is impossible.<br/>\n<br/>\nCalled shot: Leg stacks indefinitely, and the movement reduction stacks mulitiplicatively (a stack of five means 1*(0,8^5) = ~33% movement speed for the victim, NOT immobilisation), but every shot has its own 4-round timer, that is, hitting a target already affected by CS:L with another one does not refresh the stack.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "3:04 AM - Jun 08, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks everyone for your feedback! People in this guild are really generous when it comes to sharing information.<br/>\n<br/>\nI'll need to review your advice when I next attempt to shoot and run at the same time. If it proves too difficult, I may just go back to what I used to do, which is: shoot, immediately turn and run, count to about six in my head, then shoot (allowing for the full animation), then run, repeat until I run out of space to run or until the enemy is dead. That method is effective enough in many cases, but then again I've never really played a dedicated ranged toon.<br/>\n<br/>\nThanks again!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "3:10 AM - Jun 08, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mirnaia wrote: <a data-post-id=\"24608\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24608&amp;sid=e406646c6e01e780a48740096b6ca21a#p24608\">↑</a><div class=\"responsive-hide\">Jun 06, 2021</div></cite>Make sure you're using the camera mode that lets you move and see independently (where moving forward with the keyboard doesn't snap the camera back, but rather lets you rotate it freely). Zoom out quite a bit to make things easier. It takes some practice. As far as I remember with my shooting Demolition Woman, with a sling and a short bow, it only works on the first flurry of the round - I think this is because once you move after your first flurry, the game takes it that you're done attacking for the rest of the round. Set a metronome or get used to counting out the 6 seconds in your head. Say I have two attacks on the first flurry, and I have Called Shot: Leg on F4.</div></blockquote>\nI do use that camera mode and I do zoom out. I'm able to shoot the first flurry (as you said), then run then turn and shoot, etc. But I haven't been able to master the art of shooting while running.<br/>\n<blockquote><div>The way I used to do it is to do F4-left click-F4-left click to queue up two called shots, let go of E (forward) for a split second until you slow down a bit, then resume running. This is the tricky bit, you do not have to wait all the while until the first projectile of the flurry fires but as I recall I had to let go of forward for a little bit. Every first flurry attack will fire, even though the animation would suggest that this is impossible.</div></blockquote>\nI'm a little bit confused here because I thought WebShaman and others were saying that you don't need to ever let go of W (that's what I use to move forward). What you're saying does make sense, though. If I can't figure out how to shoot without letting go of W, I will try your method, which I'm quite sure will work since it makes a lot of sense.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "3:12 AM - Jun 08, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"24606\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24606&amp;sid=e406646c6e01e780a48740096b6ca21a#p24606\">↑</a><div class=\"responsive-hide\">Jun 06, 2021</div></cite>You have to be at a slight angle to your opponent (at least, that is my observation).  Also, don't try to \"overkill\" while shooting (by this I mean clicking like a mad fiend).  You do not want to be overriding your directions with attacks.</div></blockquote>\nI was trying to \"overkill\" as you said. I was pushing down W to move forward while I was also left-clicking (a bit like a madman) on the enemy I was targeting. As a result, I wasn't shooting but I was periodically slowing down. I'll try just clicking once and waiting patiently for my toon to shoot while I'm running forward.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}