{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "026",
  "name": "The cold-blooded killer: An assassin guide",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-cold-blooded-killer-an-assassin-guide-t2338372.html",
  "author": "WhiZard",
  "avatar": "10235235_1549015559.jpg",
  "replies": 11,
  "posts": [
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:31 PM - Jul 20, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong><span style=\"font-size:150%;line-height:normal\">The assassin and the kill</span></strong><br/>\nTo kill creatures is a central part of the NWN game. Different characters kill in different ways. We have the brawling fighter, the smiting blows of a paladin, and the fireball inferno from a raging sorcerer, the backstabbing by the flanking rogue or the hail of arrows from a dedicated archer, and so on.<br/>\nSo if the assassin class is all about killing, what sets the assassin apart from the other characters that kill?<br/>\nThe Wikipedia has a definition of assassination that may (or may not) serve as a guide to roleplaying an assassin: <br/>\n“Assassination is the murder of a prominent person or political figure by a <strong>surprise attack</strong>, usually for payment or political reasons. A person who commits such an act is called an assassin.<br/>\nAn assassination may be prompted by religious, ideological, political, or military motives; it is an act that may be done for financial gain, to avenge a grievance, from a desire to acquire fame or notoriety, or because of a military or security services command to carry out the murder.”<br/>\nA key feature here is the surprise attack that secures the death of the target.<br/>\nTo achieve this, the assassin class has the death attack class feat that works as a surprise attack. When executed correctly, the death attack can paralyze the target, rendering him helpless and an easy kill.<br/>\nThe class has several other features; feats, skills and spells that help the assassin scout, stalk, trap and escape, and in that way serve to support the death attack. An experienced character builder will also find several of these features attractive in builds made for other scenarios.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Qualifying for the assassin class</span></strong><br/>\nAssassin is a prestige class, and as such you can take a maximum of 10 levels pre epic and 30 levels all together. To qualify for the class a character must fulfill the following:<br/>\nAlignment: Any evil<br/>\nSkills: Hide 8 ranks, move silently 8 ranks<br/>\nYou can meet these requirements after character level 5. So the first assassin level can come at character level 6.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">What you get from taking levels in the assassin class</span></strong><br/>\nHit die: d6 giving 3-6 hit points/level <br/>\nProficiencies: Simple weapons, light armor<br/>\nSkill points: 4/ level + intelligence modifier<br/>\nPrimary saving throw: Reflex<br/>\nBase attack bonus: medium progression: +3/4 levels<br/>\nClass skills: Appraise, bluff, craft armor, craft trap, craft weapon, disable trap, heal, hide, intimidate, listen, lore, move silently, open lock, pick pocket, search, set trap, spot, tumble, use magic device<br/>\nFeats (at level): <br/>\nDeath attack (1)<br/>\nUse poison (1)<br/>\nPoison save (2)<br/>\nUncanny dodge I-III (2, 5, 10)<br/>\nSpells: Ghostly visage (2), darkness (5), invisibility (7), improved invisibility (9)<br/>\nEpic bonus feats: (14, 18, 22, 26, 30)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:48 PM - Jul 20, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><span style=\"font-size:200%;line-height:normal\">The death attack – explained</span><br/>\n<br/>\n<strong>The death attack consists of 2 components:</strong><br/>\n<strong>1) An attempt to paralyze the target</strong><br/>\n<strong>2) A damage bonus</strong><br/>\nThe death attack works both with melee attacks and with ranged attacks launched within 30 feet of the target.<br/>\n<br/>\n<strong>For the paralyzing attempt to occur</strong>, the target must be flat-footed when attacked, and the attack must hit.<br/>\nThe target is then forced to roll a fortitude save vs. the DC of the death attack. If he fails the roll, he will be paralyzed for 1 turn per assassin level.<br/>\nTo succeed with this, the assassin wants a high death attack DC.<br/>\nThe death attack DC = 10 + assassin class level + intelligence modifier.<br/>\nIt follows from this that the DC becomes high when taking many assassin levels, and that a high intelligence is beneficial.<br/>\nIt is relatively easy to hit a flat-footed creature. When flat-footed, a creature loses its dodge armor bonus and the armor bonus from tumble. The creature also loses its dexterity armor bonus, unless it has the uncanny dodge feat.<br/>\n<br/>\n<strong>The death attack damage bonus </strong>is 1d6 at assassin level 1 and increases by 1d6 every second assassin level. It is 2d6 at level 3, 3d6 at level 5 and so on, and finally 15d6 at assassin level 29.<br/>\nThis part of the death attack works like the sneak attack of the rogue and blackguard. The death attack damage will be dealt to flat-footed and prone creatures, as well as creatures already in combat as long as they do not fight the assassin directly.<br/>\nThe death attack damage will stack with damage from the sneak attack feat and from the blackguard sneak attack feat. It also stacks with damage from the improved sneak attack feat, but only if you already have the sneak attack feat from rogue or blackguard.<br/>\nThe bonus damage is not multiplied in the case of a critical hit.<br/>\n<br/>\nMonsters of the construct and undead types are immune to death attacks, as are any creatures that are immune to critical hits. Red dragon disciples get immunity to paralysis at RDD level 10. Freedom of movement also gives immunity to the death attack paralysis.<br/>\nImmunity to mind effects does not give immunity to the paralysis.<br/>\nHostile creatures with true seeing can be hard if not impossible to stalk and attack when flat-footed.<br/>\nCreatures with high fortitude saves, such as the warrior classes are of course more difficult to paralyze than the low fortitude characters such as rogues and wizards. Characters that have a bonus to their saves like paladins, blackguards and champions of Torm can be very difficult to paralyze, and even more so when they start taking save enhancing feats.<br/>\nAs a general trend, the death attack DC increases more than the save bonus does with increasing levels, as long as you keep taking assassin levels.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">A flurry of death attacks</span></strong><br/>\nWhen an assassin makes a death attack attempt at a flat-footed creature, she can land several death attacks simultaneously.<br/>\nThis is explained by the way the NWN game distributes the attacks when a character has more than one attack per round.<br/>\nIn NWN the attacks a creature makes through a round are placed in<strong> 3 groups or flurries</strong>. When you start attacking a flat-footed creature, you attack simultaneously with all the attacks that are grouped in the first flurry.<br/>\nThe following table shows the distribution of the attacks in the 3 flurries:\n<table class=\"post_content_table\"><tbody><tr><td>No of attacks per round</td>\n<td>1st flurry</td>\n<td>2nd flurry</td>\n<td>3rd flurry</td>\n</tr>\n<tr><td>1</td>\n<td>1</td>\n<td>0</td>\n<td>0</td>\n</tr>\n<tr><td>2</td>\n<td>1</td>\n<td>1</td>\n<td>0</td>\n</tr>\n<tr><td>3</td>\n<td>1</td>\n<td>1</td>\n<td>1</td>\n</tr>\n<tr><td>4</td>\n<td><strong>2</strong></td>\n<td>1</td>\n<td>1</td>\n</tr>\n<tr><td>5</td>\n<td>2</td>\n<td>2</td>\n<td>1</td>\n</tr>\n<tr><td>6</td>\n<td>2</td>\n<td>2</td>\n<td>2</td>\n</tr>\n<tr><td>7</td>\n<td><strong>3</strong></td>\n<td>2</td>\n<td>2</td>\n</tr>\n<tr><td>8</td>\n<td>3</td>\n<td>3</td>\n<td>2</td>\n</tr>\n<tr><td>9</td>\n<td>3</td>\n<td>3</td>\n<td>3</td>\n</tr>\n<tr><td>10</td>\n<td><strong>4</strong></td>\n<td>3</td>\n<td>3</td>\n</tr>\n</tbody></table>\n\nYou can see from the table that<strong> there are breaking points at 4, 7 and 10 attacks per round </strong>where the number of attacks in the first flurry increases.<br/>\n<strong>Every hit will deal the bonus damage.</strong><br/>\n<strong>Only the first attack has a chance of paralyzing the target.</strong> If the conditions for a paralysis attempt are present, i.e. the creature is flat-footed; the creature must make the save to avoid paralysis.  <br/>\n(This was changed with NWN EE. Before that every hit in the first flurry forced a save vs paralysis, multiplying the chance of paralyzing the target.)<br/>\n<br/>\nThe number of attacks per round is determined by several factors. The pre epic BAB gives from 1 to 4 attacks per round. At level 20 most assassin builds have somewhere between BAB +12 and BAB +18, giving 3 or 4 attacks per round. Dual wielding gives 1 extra attack or 2 attacks if you have the ITWF feat. Haste gives 1 extra attack. Feats like rapid shot and flurry of blows give 1 extra attack when active. The spell divine power can give an extra attack to characters with low or medium BAB progression. Monks, or rather characters with one or more monk levels follow the monk attack schedule when fighting unarmed or with a kama, giving room for up to 6 attacks per round.<br/>\nA character with pre epic BAB +16 or better will have 4 attacks per round. 2 of these will come in the first flurry. If that character is hasted, dual wields weapons and has ITWF; she will have 7 attacks per round. 3 of these will come in the first flurry. If the same character has monk levels, dual wields kamas, activates flurry of blows and is hasted; she will have 10 attacks per round. 4 of these will come in the first flurry.<br/>\n<br/>\nEdit: Attack table, EE changes<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:51 PM - Jul 20, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong><span style=\"font-size:150%;line-height:normal\">Assassin spells</span></strong><br/>\nThe assassin gets four spells that can be used once per day/rest. The assassin does not have a spell book like wizards or clerics do. Instead the spells are given as spell like abilities via class feats. The assassin spells use the same script as the original spells. The caster level is the assassin class level. The caster level has impact on the duration of the spells. The spells are not subject to arcane casting failure from armor.<br/>\n<br/>\n<strong>Ghostly visage:</strong> The assassin gets this spell at level 2. The spell grants damage reduction 5/+1, prevents all spells of level 1 or lower from affecting the caster, and grants 10% concealment. The duration is 1 turn per level. The spell is valuable at low levels when creatures attack your character with low level spells and mundane weapons. <br/>\nThe 10 % concealment is a small bonus, but it will also be effective at higher levels.<br/>\n<br/>\n<strong>Darkness:</strong> The assassin gets this spell at level 5. The duration is 1 round per level. It is valuable throughout the assassin’s career. The spell creates an area of darkness where creatures see nothing and most often end up standing inactive and flat-footed. Therefore, this is a perfect scenario for death attacks. <br/>\nThe spells ultravision and true seeing can piece the darkness. The assassin wants access to these spells to be able to operate effectively within the dark area. These two spells do not remove the darkness visuals, but let the character target other creatures inside the dark area. You can then use the tab key to highlight the creatures you want to target. <br/>\nThe assassin can also enter the dark area to hide and enter stealth before setting up a new death attack attempt.<br/>\n<br/>\n<strong>Invisibility:</strong> The assassin gets this spell at level 7. The duration is 1 turn per level, but if your character attacks or casts spells, the invisibility is broken. The spell is a supplement to the stealth skills as a means to scout, to stalk a creature, or to escape if need be. <br/>\n<br/>\n<strong>Improved invisibility:</strong> The assassin gets this spell at level 9. The duration is 1 turn per level. It gives invisibility like the invisibility spell. It also gives the assassin 50% concealment for the whole duration of the spell. This is a very strong defensive spell reducing the number of hits made against the assassin by 50 %. <br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Uncanny dodge I – III</span></strong><br/>\nUncanny dodge I: The character retains his dexterity bonus to AC, even if caught flat-footed or attacked by a hidden or invisible creature. <br/>\nUncanny dodge II grants a +1 bonus, and uncanny dodge III grants a +2 bonus on reflex saving throws made to avoid traps. <br/>\nUncanny dodge does not allow a character to retain dodge bonuses or tumble bonuses to AC when flat-footed, only the dexterity bonus.<br/>\nFor characters with high dexterity, which is often the case with assassins, uncanny dodge becomes very important, since the dexterity bonus becomes a significant part of their total AC.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">The poison feats</span></strong><br/>\n<strong>Poison save:</strong> The assassin’s save bonus vs. poison increases by +1 every 2 levels from +1 at level 2 to +15 at level 30. All save rolls vs. poison are fortitude rolls. If you fail the initial roll the poison inflicts a primary damage, and one minute later you must make a second roll to avoid the secondary damage. The damage usually is some amount of ability damage. The poison DC varies from 11 to 36 for different poisons. Fortitude is not a primary saving throw for assassins, so the poison save feat can give a welcome boost to these saves.<br/>\n<strong><br/>\nUse poison:</strong> The character is trained in the use of poison and never has to make a dexterity check when applying poison to a blade. This is a fine thing if you see a reason to cripple a creature first, rather than killing it right away. Coating the blade with a poison that works on constitution will help lower the fortitude saves and hitpoints of the creature, granting an even quicker kill. This works well together with the death attack. <br/>\n<strong><span style=\"font-size:150%;line-height:normal\"><br/>\nEpic assassin feats</span></strong><br/>\nThe epic assassin gets a bonus feat every 4th level (14, 18, 22, 26 and 30). You can choose between epic reflexes, epic skill focus hide, epic skill focus move silently, great dexterity, improved combat casting, improved sneak attack, self-concealment and superior initiative.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:56 PM - Jul 20, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong><span style=\"font-size:150%;line-height:normal\">Races for assassin</span></strong><br/>\nAll races can become assassins, but some are better suited than others are.<br/>\n<br/>\n<strong>Halflings</strong> have a +1 bonus to AB and AC from small stature. They get a racial +2 bonus to dexterity and a -2 penalty to strength. They have a +4 bonus to hide and spot and a +6 bonus to listen and move silently. They get a +2 bonus to rolls vs. fear and get a +1 bonus to all saves. Halfling assassins risk getting an xp penalty, unless they have rogue as one of their primary classes. Halfling is an excellent race for assassins.<br/>\n<br/>\n<strong>Gnomes</strong> have a +1 bonus to AB and AC from small stature. They get a +4 bonus to hide, move silently and spot, and a +6 bonus to listen. Gnomes also get a +2 bonus to saves vs. mind spells. They get spell focus illusion and a +2 bonus to concentration checks. They also get a bonus when fighting reptilians, goblinoids and giants. Gnomes get a racial +2 bonus to constitution and a -2 penalty to strength. Gnome assassins risk getting an xp penalty, unless they have wizard as one of their primary classes. Gnome is a very good race for assassins.<br/>\n<br/>\n<strong>Elves</strong> have keen senses and a +2 bonus to listen, search and spot. They are immune to sleep spells and get a +2 bonus to saves vs. mind spells. They are proficient with bows, rapiers and longswords. Elves get a racial +2 bonus to dexterity and a -2 penalty to constitution. Elven assassins risk getting an xp penalty, unless they have wizard as one of their primary classes. Elf is a very good race for assassins.<br/>\n<br/>\n<strong>Humans</strong> get one extra feat at level 1, 4 extra skill points at 1st level, plus 1 additional skill point at each following level. Human assassins risk no xp penalty. Human is a good race for assassins because of the extra feat and skill.<br/>\n<br/>\n<strong>Dwarves</strong> are sturdy fighters with a racial +2 bonus to constitution and a -2 penalty to charisma. They have a +2 racial bonus to saves vs. poisons and spells and a +2 bonus to lore and a +2 bonus to search when underground. They get a bonus when fighting orcs, goblinoids and giants. Dwarven assassins risk getting an xp penalty, unless they have fighter as one of their primary classes. Dwarves can become sturdy assassins, but get no racial benefits other than that.<br/>\n<br/>\n<strong>Half-elves</strong> are immune to sleep spells and get a +2 bonus to saves vs. mind spells. They get a +1 bonus to listen search and spot checks. Half-elven assassins risk no xp penalty. Half-elves have few, if any racial benefits geared towards becoming assassins and are worse off than both their parent races.<br/>\n<br/>\n<strong>Half-orcs</strong> get a racial +2 bonus to strength and a -2 penalty to both intelligence and charisma. Half-orc assassins risk getting an xp penalty, unless they have barbarian as one of their primary classes. The intelligence penalty affects the death attack DC directly. It also makes half-orcs get less skill points. Half-orc is not a good race for assassins as such, but the strength bonus can help make them strong thugs.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Abilities for the assassin</span></strong><br/>\n<strong>Dexterity:</strong> Most assassins focus on dexterity. The stat is great for stealth, theft and trap skills. The fact that the class gets uncanny dodge as class feat, only gets the light armor proficiency and can choose great dexterity with the epic bonus feats also points towards dexterity builds. Dealing enough damage often becomes a problem with dexterity builds. Assassins have death attack to produce damage. The UMD skill also let the assassin buff her weapon with spells that increase the damage output. The trap skills can also be a source of damage dealing.<br/>\n<br/>\n<strong>Strength:</strong> Death attack does not work against undead, constructs and creatures immune to critical hit, and will not give damage in toe-to-toe combat unless you manage to use knockdown. A high strength will give more direct weapon damage, and secure a reliable wapon damage in more combat situations. Strength will also boost the discipline skill, if you choose to follow that path. A strength-based assassin will have much in common with a strength-based rogue and will often be more of a front line brawler than a stalker.<br/>\n<br/>\n<strong>Intelligence:</strong> Assassins have a very good selection of class skills, almost identical to the rogue skill list. Unlike the rogue, assassins only get 4 skillpoints per level. A high intelligence gives extra skillpoints. Intelligence also boosts trap skills. <br/>\nLast, but not least, intelligence improves the death attack DC. That alone is a good reason to have at least intelligence 14 and carry items that increase intelligence, and buff with fox’ cunning.<br/>\n<br/>\n<strong>Constitution</strong> influences hit points and fortitude saves. That is important only if you want to make a melee character.<br/>\n<strong>Wisdom</strong> influences the scouting skills and the will saves. Although scouting has some importance, wisdom is not something you will give priority with an assassin, unless you multiclass with ranger, monk, druid or cleric.<br/>\n<strong>Charisma</strong> is of little use for assassins unless you want to talk people to death.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Some recommended feats</span></strong><br/>\nWeapon focus, epic weapon focus and epic prowess for better AB<br/>\nWeapon finesse for every dexterity build wielding melee weapons<br/>\nPoint blank shot and rapid shot if you will focus on missile attacks<br/>\nTwo weapon fighting, ambidexterity and improved two weapon fighting for the extra attacks from dual wielding<br/>\nKnockdown and improved knockdown to deal death attack damage to prone creatures<br/>\nBlind fight<br/>\nGreat dexterity <br/>\nWeapon specialization and epic weapon specialization for the extra damage<br/>\nHIPS if you can get it<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Some recommended skills</span></strong><br/>\nSpot or listen<br/>\nSearch<br/>\nHide and move silently<br/>\nTumble<br/>\nUMD. <br/>\nSome ranks in trap skills and open lock if you can afford it.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Some recommended spells</span></strong><br/>\nYou can multiclass with a class that can cast spells, or you can use scrolls with your UMD skill. Some spells are available as potions or on rods, wands and other items.<br/>\nDarkness <br/>\nInvisibility, improved invisibility<br/>\nTrue seeing, ultravision<br/>\nHaste<br/>\nCamouflage, one with the land<br/>\nCat’s grace, fox’ cunning, bull’s strength<br/>\nGreater magic weapon and flame weapon<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:58 PM - Jul 20, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong><span style=\"font-size:150%;line-height:normal\">Multiclassing with assassin as minor class</span></strong><br/>\nYou can use assassin as minor class in a character build almost as you use rogue. Assassin is a prestige class and gives access to “rogue” skills and “sneak” attack damage without causing xp penalty. Assassin has the same class skills as rogue, save persuade and parry. <br/>\nYou may also want to use assassin to get uncanny dodge to a dexterity build. Dexterity based bards, monks, rangers, fighters, arcane archers and clerics have no access to uncanny dodge unless they multiclass with a class that gets it as class feat. <br/>\nThe spell like abilities is another good reason to take assassin levels. 9 levels is an important target for the powerful improved invisibility spell.<br/>\n<br/>\nWhen you use assassin as minor class, the low number of assassin levels gives a low death attack DC. Nevertheless, sometimes creatures fail their saves, and the occasional paralysis is a welcome icing on the cake.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Building with assassin as major class </span></strong><br/>\nWhen assassin becomes the major class with around 25 assassin levels or even more, all the builds will eventually center on a certain focus with a high death attack DC, delivering consistent death attack paralysis, and dishing out heavy death attack damage. <br/>\nThe duration of the spells will also be much longer. <br/>\nAs a character builder you get to play with the epic assassin bonus feats. Great dexterity is on the assassin epic feat list, enabling a very high stat for dexterity-based assassins that can grant a high AB and AC as well as effective use of dexterity based skills. The strength-based assassin may want to take epic skill focus in the stealth skills, to be able to sneak about effectively in heavy armor.<br/>\n<br/>\nWhen planning an assassin build one has to consider what the other classes can bring to the build, what strengths that can be improved and what weaknesses that can be covered. Building for about 25-30 assassin levels leaves room for about 10-15 levels of other classes in the build.<br/>\n<br/>\n<strong>Ranger</strong> is the only class with full warrior BAB progression that has stealth as class skills. Rangers can get 8 ranks in the stealth skills at level 5 and start taking assassin levels at level 6. Rangers are proficient with martial weapons and get the dual wield feats as class feats, with ITWF at level 9, leaving room for all the 10 pre epic assassin levels before level 20. The ranger requirement of dual wielding in light armor fits perfectly for a dexterity-based assassin. Rangers get several spells that help assassins work better. Ultra vision helps pierce the darkness spell. The camouflage, one with the land and cat’s grace spells also benefit assassin stealth, AB and AC. The trackless step feat improves stealth when outdoors.<br/>\n<br/>\n<strong>Monks</strong> (characters with monk levels) fighting unarmed or with kamas follow the special monk attack progression and can activate the flurry of blows feat. This enables up to 3 more attacks per round than other builds. A kama-wielding monk build can reach 10 attacks per round, with 4 attacks in the first flurry (see above).  Monks get evasion at level 1 and has all three of fortitude, reflex, and will as primary saves. Monks get monk AC bonus, monk speed and stealth skills enabling early assassin levels. At level 6 monks get the improved knockdown feat.<br/>\n<br/>\n<strong>Shadow dancers</strong> get HIPS at level 1 and evasion at level 2. Shadow dancers can qualify for epic dodge at class level 10, or at level 5 in a build with 9 or more monk levels. <br/>\nHIPS is great for making repeated paralyzing death attacks with an assassin. You attack, hide and wait until everybody is flat-footed, then you attack again. In that way you can paralyze every single creature in a whole group of creatures, before you start finishing them off. The paralysis lasts one minute per assassin level, so you have all the time in the world to get the job done. Assassins get the HIPS feat in NWN2, but not in NWN.<br/>\n<br/>\n<strong>Shifters</strong> get the kobold commando shape at shifter level 7. Kobold commando has HIPS. The kobold commando shape overrides dexterity (dexterity 22), gives a + 10 bonus to stealth skills and has 2d6 sneak attack. It wields a +3 shortsword. The dexterity override let you build with a focus on intelligence for a surprisingly high death attack DC, or strength for a higher AB and damage output. Shifters have hide as class skill, but since you need 8 ranks in both stealth skills, you cannot take assassin before level 14.<br/>\n<br/>\n<strong>Rogues</strong> get sneak attacks, 8 skill points per level and evasion at level 2. Rogues also get stealth skills enabling early assassin levels and can qualify for epic dodge with 13 rogue levels. The damage from death attack and sneak attack stacks.<br/>\n<br/>\n<strong>Wizards</strong> get a long list of spells, among them the assassin spells and ultravision and true seeing for piercing darkness as well as haste spells for quick maneuvering and extra attacks. Intelligence is the primary casting stat. Intelligence gives more skillpoints and a higher death attack DC.<br/>\n<br/>\n<strong>Clerics</strong> provide slots for casting of darkness and spells that pierce darkness. The cleric spells are great as combat buffs, improving AB, AC and damage as well as number of attacks and granting several protections. The trickery domain fits assassin-clerics well, giving the invisibility spells and a boost to stealth, traps- and thieving skills.<br/>\n<br/>\n<strong>Bards</strong> have a great skillset, including stealth skills and can qualify early for assassin. Bards get all of the assassin spells, ultravision and the haste spells, but get them later than wizards do. The song boosts combat prowess, even at low levels.<br/>\n<br/>\n<strong>Fighters</strong> get extra combat feats, making it easier to fit in the dual wield feats, weapon specialization and what not. Fighters get all armor proficiencies and are proficient with martial weapons. They have the high BAB progression. Weapon specialization and epic weapon specialization provide better damage, a good thing to have, especially against creatures immune to death attack.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:00 PM - Jul 20, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong><span style=\"font-size:150%;line-height:normal\">How to play as assassin</span></strong><br/>\nPeople have different prefereces, and there are several ways in which to play an assassin character.<br/>\nYou can combine assassin levels with a warrior class and make a frontline brawler or flanker. The tactics will be like that of its rogue cousins, to land death/sneak attacks for the bonus damage. For that, you will need some distraction in the form of a party, or some summons, for flanking and backstabbing galore. Knockdown will also get the job done for you so you can land your heavy damage blows. <br/>\nYou can also play your assassin as a trapper, the way you would with a ranger or rogue. If so, I would add at least one rogue level to be able to handle epic traps. This guild has an excellent trap guide for reference.<br/>\nYou can also combine assassin levels with cleric to make a self-buffing grinder. <br/>\nMoreover, you can put a substantially amount of assassin levels into a druid/shifter dragon build.<br/>\nThis guild already has some splendid cleric guides and an illustrious druid guide, so I will not delve into that here.<br/>\n<br/>\nI will rather focus on the death attack with its two components, paralysis and damage, and how to use it effectively.<br/>\nTo make a death attack attempt that will both paralyze and damage a creature, the creature in question must be flat-footed. <br/>\n<br/>\nA creature is flat-footed if caught unaware and standing there doing nothing, i.e. none of the following: attacking, moving, casting a spell or activating a feat or special ability.<br/>\n<strong>For the death attacks to work properly, you have to operate alone!</strong> If you are in a party, all hostile creatures will be fighting your party and nobody will be flat-footed!<br/>\n<br/>\nIf the target cannot perceive the assassin approaching, he will be caught unaware.<br/>\nThere are several ways to make the assassin undetected. The target can suffer from blindness, there can be darkness, the assassin can be invisible, or the assassin can use stealth. If the target is an NPC, the assassin can even rush around a corner and make the attack before the creature has time to react (has time to fire the perception event).<br/>\n<br/>\nCreatures with true seeing can be a serious problem for an any stealth character, including the assassin. The true seeing item property and creature skin property will see through all invisibility and stealth. The vanilla version of the spell will do the same. In many modules and persistent worlds the spell is altered to giving a see invisibility effect and a bonus to spot, a change that makes life more viable for stealth characters.<br/>\n<br/>\nA creature will become flat-footed after the action queue empties and he stops doing anything. Normally it takes a few seconds extra, I believe it is until a round finishes. The character returning his weapons to the inactive pose is an indication of the flat-footed state. The combat music stops playing, if after a fight.<br/>\n<br/>\nCasting invisibility will make you go…well…invisible. The assassin has the class spells. There are standard invisibility potions that are quite cheap available in shops. You can use them repeatedly, if you want. You can buy scrolls and use wands or other items with the spell on them. In many modules there are ways to  you recharge such items for repeated use. You can also take levels in a spell caster class to get free uses of the spells.<br/>\nThe sanctuary spells can be an alternative to the invisibility spells as an effective way to make the assassin go unnoticed.<br/>\n<br/>\nI have explained briefly the use of darkness above. To use that spell most effectively it is important to have access to ultravision or true seeing to be able to target creatures inside the dark area. Darkness is a class spell. You can also find it on scrolls. In many modules and persistent worlds, you can get items with the ability to cast darkness on them. I have also seen custom darkness potions in shops and as loot- or chest drops some places. Taking levels in a spell caster class gives free uses of the spell. It takes some practice to get used to working with the darkness spell, but once you get used to it, you will see that it is a great means for crowd control and a quite safe arena for quick kills. When you get used to working with the darkness spell, you may even want to use the trick with other character types.<br/>\n<br/>\nI have not tried yet playing an assassin spamming the blindness spell, and I have not tested storming around corners for surprise attacks to see how often it causes paralysis. However, I have seen it happen.<br/>\n<br/>\nStealth is an effective way of stalking a creature, but nearby creatures will discover you once you attack. You can hide again behind a corner, in an area of darkness, or you can get HIPS. <br/>\nDepending on the AI, you can sometimes pull single creatures from a group by showing yourself to them one by one. They will approach you and walk up to the place where they last saw you. There you can attack from stealth and make short work of them, one at a time. <br/>\nIf you use HIPS, be patient and wait until the action is over and the creatures are flat-footed before you attack again. In this way, you can paralyze a whole group of creatures, one by one, before you break cover and butcher them. A spell caster may kill faster, but not with such cold-blooded style.<br/>\n<br/>\nIf you play the stalker type assassin and (against my advice) operate in a party, then at least promise me to hide the other party members in the woods, or down the corridor, out of sight. Then go in and target the boss. When you have paralyzed him, hide or go invisible again and call in your party to dispose of his henchmen.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:01 PM - Jul 20, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong><span style=\"font-size:150%;line-height:normal\">Assassin compared with rogue</span></strong><br/>\nThe two classes have much in common, yet there are several important differences between them.<br/>\nThey get the same hit die, or amount of hit points per level, have the same ¾ BAB progression and have reflex as primary saving throw. Death attack and sneak attack deal the same amount of damage under exactly the same conditions, and the two classes get the same progression of damage from these attacks, 1d6 at level 1, 2d6 at level 3 etc. The classes get roughly the same set of class skills (except parry and persuade). They also get the same armor proficiency.<br/>\nAs a prestige class, assassin will never cause an xp penalty. However, you have to qualify with an evil alignment and 8 ranks in the stealth skills. The class cannot be taken before level 6 and if you cross class the skills, the class will not be available before level 14. Rogue is available at character creation, making it far more flexible to build with, but can cause an xp penalty.<br/>\nRogues get far more skill points; 8 per level versus 4 for the assassin. Rogue is also available at level 1 when you get 4 times more skillpoints.<br/>\nRogues get bonus feats at level 10, 13, 16, 19, 24, 28, 32, 36 and 40. You can pick the pre epic rogue feats with any of these bonus feats, and you can pick epic bonus feats with every bonus level that comes after character level 20. The bonus feats the rogue can choose from pre epic are unavailable for the assassin and let the rogue, unlike the assassin, qualify for epic dodge. Rogues have a wider selection of epic bonus feats than assassins get.<br/>\nAssassins get epic bonus feats at level 14, 18, 22, 26 and 30. The list of feats is shorter than that of the rogues, but assassins can take great dexterity, which is unavailable as bonus feat for rogues.<br/>\nThe rogue class gets evasion. <br/>\nAssassins get uncanny dodge III, whereas rogues get uncanny dodge VI+ with better reflex saves vs. traps. <br/>\nAssassins get the poison feats granting easier handling of poisons and far better fortitude saves vs. poison.<br/>\nOnly rogues can detect and disarm the most difficult traps and open locks with a DC above 35.<br/>\nRogues get weapon proficiency rogue with a better weapon selection than what assassins get.<br/>\nAssassins get the spell like abilities. <br/>\nWhen playing, I have not been able to dispel, breach or “mord” the ghostly visage and invisibility spells. This needs more testing though.<br/>\nAssassins get the ability to paralyze hostile creatures with the death attack. Several creatures are immune, or difficult to target, but the death attack is still deadly effective against the majority of creatures you will encounter during PvM play.<br/>\n<br/>\nIf you like both the rogue and the assassin, you can build with both classes e.g. taking 13 levels of rogue to qualify for epic dodge and then fill up with assassin levels and perhaps a level or four from a third class like fighter, monk or shadowdancer.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:23 AM - Jul 25, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great guide, Mick, kudos!<br/>\n<br/>\nI would like to add just a couple of things to this very thorough guide. I have tried to combine Assassin with Wizard in the past, and found out that the synergy is only apparent. The deal is that both classes need many levels to be effective: the best arcane spells are high level, Assassin levels are the main component of a good DC for your DA, and you truly can't split the difference, so you either become average at both (DA DC and Spellcasting) or good at one and bad at the other. For all arcane spells, at least 23 Wizard levels are recommended, maybe even 26 for indispellability. Sure you can have 17 Wizard levels, but then you wouldn't be able to properly pierce SR even with feats and MD. Inversely, as Mick has already pointed out, 25-26 Assassin levels are needed for your DA DC to be good. The INT modifier of a mage won't grow in the same proportion as the DA DC should by taking Assassin levels, so you're always gonna be gimped either in one side or the other. <br/>\n<br/>\nThere are two ways I found to combine these two classes somewhat effectively: Being a mage with just one Assassin level for the natural 1 enemy roll paralysis, or being just an Assassin with a few Wizard levels for a couple of buffs and other sources of Invisibility, Darkness and Ultravision. In that second alternative you'd need to drop down your Assassin levels to 22 not to hamper your BAB greatly by taking too many Wizard pre-epic, sometimes, even 18 levels can work (but you won't be relying on paralysis too much). 4 pre-epic Wizard levels are more than enough (zero is the ideal ), then you take the 5th level in epics to use the bonus feat for Great Intelligence.<br/>\n<br/>\nOne other thing that I didn't see you mention was the synergy with Stunning Fists in the unarmed Monk / Assassin combo. You can fire 3 simultaneous Stunning Fists / Death Attacks in the first roll and make your opponent have to roll 6 saves before even starting the fight. Not too shabby and definitely worth the mention.<br/>\n<br/>\nNonetheless, truly great guide!<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:32 PM - Aug 03, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Maximillian Kane wrote:Great guide, Mick, kudos!</div></blockquote>\n Thank you Max!\n<blockquote><div>I have tried to combine Assassin with Wizard in the past, and found out that the synergy is only apparent. The deal is that both classes need many levels to be effective//<br/>\n There are two ways I found to combine these two classes somewhat effectively: Being a mage with just one Assassin level for the natural 1 enemy roll paralysis, or being just an Assassin with a few Wizard levels for a couple of buffs and other sources of Invisibility, Darkness and Ultravision. </div></blockquote>\n True! You want to give main class assassin builds an intelligence of at least 14 for the reasons I have outlined above. That is enough for the low level spells of wizard as minor class. I think that is the most important synergy between the two classes.\n<blockquote><div>One other thing that I didn't see you mention was the synergy with Stunning Fists in the unarmed Monk / Assassin combo. You can fire 3 simultaneous Stunning Fists / Death Attacks in the first roll and make your opponent have to roll 6 saves before even starting the fight. Not too shabby and definitely worth the mention. </div></blockquote>\n A good point absolutely worth mentioning! The stunning effect of stunning fist, lasts 3 rounds, which is often enough time to get the job done. Paralysis and stun also are different effects. Sometimes creatures immune to paralysis can be stunned.[/quote]<br/>\n [/quote]<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "10:07 PM - Aug 21, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Mick Dagger wrote:</strong><strong><span style=\"font-size:150%;line-height:normal\">Assassin spells</span></strong><br/>\nThe caster level is the assassin class level. The caster level has impact on the duration of the spells. The spells are not subject to arcane casting failure from armor.</div></blockquote>\n\nCorrect, but somewhat incomplete.  The main advantage of the assassin spells is that they are difficult to dispel.  For dispelling purposes the full hit dice (rather than just the assassin level) are used.  Thus a pure wizard of equal character level will only have a 45% chance of dispelling your buffs, whether you take a few assassin levels or many.  The duration of the assassin spells can also be increased by sequencing them.  When cast from a sequencer, assassin spells have a caster level of 509 (as far as duration goes, dispelling still uses full hit dice).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:36 PM - Aug 22, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>WhiZard wrote:</strong><blockquote><div><strong>Mick Dagger wrote:</strong><strong><span style=\"font-size:150%;line-height:normal\">Assassin spells</span></strong><br/>\nThe caster level is the assassin class level. The caster level has impact on the duration of the spells. The spells are not subject to arcane casting failure from armor.</div></blockquote>\n\nCorrect, but somewhat incomplete.  The main advantage of the assassin spells is that they are difficult to dispel.  For dispelling purposes the full hit dice (rather than just the assassin level) are used.  Thus a pure wizard of equal character level will only have a 45% chance of dispelling your buffs, whether you take a few assassin levels or many.  The duration of the assassin spells can also be increased by sequencing them.  When cast from a sequencer, assassin spells have a caster level of 509 (as far as duration goes, dispelling still uses full hit dice).</div></blockquote>\nThank you for the info WhiZard! Do you know what formula is used to determine the chance of dispeling these spells and the duration of the sequenced spells?<br/>\nI have never tried it. I didn't even know you could use a sequencer with the spell like abilities!   <br/>\nI have tried to mord the spells vs lvl 40 assassin characters in a trainer. Darkness was easy to lift, but removing ghostly visage was virtually impossible. The effect on invisibility spells is harder to judge in game since several actions will break the invisibility. Has anybody tested this systematically with the different breach and dispel spells?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "11:54 PM - Aug 22, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Mick Dagger wrote:</strong><blockquote><div><strong>WhiZard wrote:</strong><blockquote><div><strong>Mick Dagger wrote:</strong><strong><span style=\"font-size:150%;line-height:normal\">Assassin spells</span></strong><br/>\nThe caster level is the assassin class level. The caster level has impact on the duration of the spells. The spells are not subject to arcane casting failure from armor.</div></blockquote>\n\nCorrect, but somewhat incomplete.  The main advantage of the assassin spells is that they are difficult to dispel.  For dispelling purposes the full hit dice (rather than just the assassin level) are used.  Thus a pure wizard of equal character level will only have a 45% chance of dispelling your buffs, whether you take a few assassin levels or many.  The duration of the assassin spells can also be increased by sequencing them.  When cast from a sequencer, assassin spells have a caster level of 509 (as far as duration goes, dispelling still uses full hit dice).</div></blockquote>\nThank you for the info WhiZard! Do you know what formula is used to determine the chance of dispeling these spells and the duration of the sequenced spells?<br/>\nI have never tried it. I didn't even know you could use a sequencer with the spell like abilities!   <br/>\nI have tried to mord the spells vs lvl 40 assassin characters in a trainer. Darkness was easy to lift, but removing ghostly visage was virtually impossible. The effect on invisibility spells is harder to judge in game since several actions will break the invisibility. Has anybody tested this systematically with the different breach and dispel spells?</div></blockquote>\n\nThis information is found on <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Dispel\" rel=\"noreferrer\" target=\"_blank\">the wiki</a>.<br/>\n<br/>\nTo dispel an area of effect by targeting the ground, the check is scripted (not hard-coded) as:<br/>\n<br/>\nDispeller's caster level + dispeller's ability modifier (intelligence if the dispeller is a wizard, charisma otherwise) + spell bonus (25 for lesser dispel, 50 for dispel, 75 for greater dispelling, 100 for Mord's) vs. 2 * creator's ability modifier (intelligence if the creator is a wizard, charisma otherwise) + 20 + d100.  If the dispeller is an NPC they would get a further +30 bonus to dispelling.<br/>\n<br/>\nTo dispel a cheat cast spell (as the sequencers use) the check is: dispeller caster level + 1d20 vs. 12 + creator's hit dice.<br/>\n<br/>\nThe caster level retrieved by GetCasterLevel() for a cheat cast spell is 2 * innate spell level -1 (with a minimum of ten).  For most spells this maxes out at 17 as spells only go up to level 9.  But the assassin spells all have an innate level of **** which is interpreted as -1 (or 255 as it is stored in 8 bits).  2 * 255 - 1 = 509.  Thus the duration of assassin sequenced spells is very long.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}