{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "162",
  "name": "Resist Energy, Epic Energy Resistance, and some other feats",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/resist-energy-epic-energy-resistance-and-some-othe-t2355172.html",
  "author": "Agadris",
  "avatar": "10235235_1549015559.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "Agadris",
      "avatar": "no_avatar.png",
      "timestamp": "8:23 PM - Sep 24, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi everyone!<br/>\n<br/>\nBeen reading through some feat descriptions on NWN Wiki and got an itch to ask if you've ever taken the above-mentioned feats or at least considered doing so? Just curious...<br/>\n<br/>\nI also cannot recall ever seeing Improved Whirlwind Attack in any of the builds present here. And it looks like its non-improved version is taken only when building with WM. They seem to be working fine unlike all the initiative feats and don't seem to be pure garbage like Dirty Fighting or Courteous magocracy. Epic Reputation seems to be lame as well...<br/>\n<br/>\nAll these feats have no use then or I simply don't see it? Feel free to call me stupid if I don't (or if the very idea of this thread is stupid<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />).  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:13 PM - Sep 24, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">First of all, no question is stupid, no matter how amateurish it seems.  <br/>\nWe are all still learning here, trust me on that. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nSecondly, the idea of having other epic feats rather than simply great attributes have been explored in the past, mostly in the old ECB. <br/>\nThe thing is the most builds back then had relatively average AB's &amp; lots of extra abilities such as EDR, Esf: Taunt, etc. often streching too far for their own <span style=\"text-decoration:line-through\">good </span>AB figures. <br/>\nThe hypermodern* school of building had seen that &amp; focused more on single-minded elite builds, built specifically with one goal in mind, efficiency over diversity.<br/>\nI am as much to blame as others for that shift, but when you are in your fledging stage you want to produce impressive results &amp; establish a reputation, so that's unavoidable. <br/>\nTake a look at my Shadow-warrior for example, she has 48AB &amp; people wondered why it doesn't have even more or Dev Crit. because I sacrificed a modicum of power to give her good saving throws. <br/>\nIn my opinion, there is room for such builds still, especially so in tough PW environments, but one should look to balance things out &amp; not steer too much one direction or the other.<br/>\n<br/>\nThirdly, we now have previous knowledge of what the aforementioned feats do in real-world conditions &amp; we simply avoid feats that don't produce the best results.  <br/>\nAs an example, the old ECB greatly experimented with the \"Initiative feats\" thinking that this was an essential feat-chain for any first-striker, but the results were (very) poor.<br/>\nNowadays, we simply avoid them, since their worth is minimal at best. <br/>\nAnother example was Improved-whirlwind attackers with death-attack, a marvelous idea that in play proved it did nothing, at all. <br/>\nNowadays, we know that &amp; nobody takes it anymore. <br/>\n<br/>\nNow, if you want to see a good build that does have the Epic energy resist feats &amp; combines them with Dwarven Defender's natural DR,  such a build exists already, <br/>\nIt is called \"<strong><span style=\"color:#0000FF\">The Resistor</span></strong>\" by <span style=\"color:#0000FF\"><strong>Cinnabar Din</strong></span> =&gt; <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build249432.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 49432.html</a><br/>\nIt's a nice build &amp; I can see some minor improvements that could be done to it, already, if you wanted to explore that route. <br/>\nOf course, such builds have increasingly greater value in low-magic worlds where the items simply don't hand those resistances out like candies. <br/>\n<br/>\nThat will be all for now, I hope this answered some of your questions, at least. <br/>\n*Term is originally used in modern chess openings.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:17 AM - Sep 25, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Valerfor for your comments here, much I have learned. <br/>\n<br/>\nI like the Energy Resistance feats, as they stack with energy resistance from items etc. <br/>\n<br/>\nThe Resistor is quite a nice build. It has a nice balance of Base AB 40, 700hp and DR 20/21 to physical, fire, cold, acid. <br/>\n<br/>\nI can see what you mean by tweaks Valerfor. <br/>\n<br/>\nFor example I'm already looking at it and thinking:<br/>\n<br/>\n- I wonder if four fighter levels could be dropped to obtain DD 26. DD 26 provides additional DR 3/- (essentially a free EDR feat) and a bonus feat which could be used to obtain EP/EWF or epic energy resistance. Essentially there is no net loss in terms of feats in this build, and one gains 8hp, not that the build needs more :).<br/>\n<br/>\n- Also wondering if Iron Will can be swapped to Resist Energy Sonic or Lightning, for some additional all round DR. Will saves could be mostly worked around by using either mind immunity items (such as a Golden Circlet), clarity potions, fear immune items or using UMD lesser mind blank scrolls / wizard party members. <br/>\n<br/>\n- Lightning reflexes could be swapped too for one of the resist energy feats, although it has a nice synergy with the evasion feat so I would be loathe to swap it. Maybe Luck of heroes could be taken at level 1 instead potentially, which provides +1 to all saves.<br/>\n<br/>\n- Dex could be dropped to 13 and Int to 13 to allow access to Improved Knockdown, Expertise or Disarm if one wishes. In a non-dev crit build I am tempted to swap Power Attack and Cleave for some of these feats. <br/>\n<br/>\n- I wonder if  Str could be increased to 28 somehow<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:57 AM - Sep 25, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Glad you liked that bit of NwN history, as for the build, you got it exactly right Orion. <br/>\nIKD is a must, I feel.<br/>\nConstitution can be left at 21 &amp; gain either EDR III OR Armor Skin.<br/>\netc.<br/>\n<br/>\nAnother change I would personally make is to concentrate on two elements instead of three &amp; gain more resistance to them. <br/>\nProbably Acid &amp; Fire, for Lich dmg shields &amp; the like. <br/>\nStrength to 28, while it can be done, you would have to sacrifice a lot from these goodies.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "4:00 PM - Sep 25, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>We are all still learning here, trust me on that. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /></div></blockquote>\nI second that\n<blockquote><div>\nThe hypermodern* school of building had seen that &amp; focused more on single-minded elite builds, built specifically with one goal in mind, efficiency over diversity.<br/>\n*Term is originally used in modern chess openings\n</div></blockquote>\nYou can sense a trend if you compare newer builds with old builds like Valerfor says. The most extreme single minded builds will you find in PvP arenas, where the goal often is to make something that dominates another build, often with a rock, scissors, paper logic. You can also do the same in high magic environments where item properties let you cover up the weaknesses caused by maxing out something else to the extreme. <br/>\nAn important concern when you make a focused build is the search for synergies. How can different class feats and -skills complement each other? How much can you get for free by taking a given class? etc. If you know how to do that, you can make builds that are much stronger than the average. The old and classic legacy build, the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/exalted-sorceress-sorcerer-38-paladin-1-monk-1-t515460.html\" rel=\"noreferrer\" target=\"_blank\">Exalted Sorceress</a> is a brilliant example of what synergies can do with a build. <br/>\nIf you on the other hand lack focus and want \"everything\" in your build, you soon end up with a build that gets weaker with everything you add. Why, you may ask. It is because you only have a limited number of feats and skill points in a given build. When you put something in, something else has to be dropped. So focus is about knowing what you want with your build, and keeping it realistic. Synergies again, will give you more to work with. Here is a <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/devastating-rogue-rogue-36-fighter-4-t515458.html\" rel=\"noreferrer\" target=\"_blank\">legacy build</a> that suffers from putting too much into the build.<br/>\n<br/>\n@Valerfor: Funny that you should use an expression from chess theory. I like it. The way we build has developed. So building with a high focus may well deserve to be called Hypermodern as opposed to a more general purpose Classical build style.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}