{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "961",
  "name": "R/FTR/CoT",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/r-ftr-cot-t2354900.html",
  "author": "SuperDuperCoolDude",
  "avatar": "10235447_1565972826.jpg",
  "replies": 9,
  "posts": [
    {
      "author": "SuperDuperCoolDude",
      "avatar": "no_avatar.png",
      "timestamp": "4:50 AM - Jun 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I am curious to get some feedback on this build. I am playing Aielund Saga. I currently am running this with a human (gotta love those skill points) focusing on katana with a shield. I am 4/4/3 R/FTR/CoT. I don't think I will take anymore fighter since I have weapon spec and CoT does everything else about the same. I am thinking I want a rogue level every now and again to pump up skills and maybe eventually get crippling strike. I play largely as a strength fighter with rogue utility and of course knockdown sneak attack. CoT is in there since it gives largely the same perks as fighter but with better saving throws. I am wondering what people think would be the optimum balance between rogue and CoT. I am thinking I will do 8 rogue pre-epic, but after that I am not sure what I will do. I think a similar build with DD would be effective too. Any suggestions?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:19 AM - Jun 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Fighter / Rogue / Cot is a good combination. It would have been wiser to plan the build before you started playing, so it could have been optimal from the beginning. To help you now, we need to know your current situation. What feats have you taken, and how many points do you have in what skills (the base score before adding the ability bonus)? Also, what are your current abilities (Strength, etc.)?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SuperDuperCoolDude",
      "avatar": "no_avatar.png",
      "timestamp": "6:21 AM - Jun 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah, right you are. I am away from my pc for the evening but I think that I started with 16 str 12 dex 14 con 14 int 12 wisdom and 8 charisma and I have done all str when I had the option. I have taken luck of heroes, cleave, exotic weapon prof, kockdown, improved knockdown, weapon focus (katana), and weapon spec for sure. I think I have improved critical as well. Skills I have put all in on persuade, lore, disarm, lockpick, tumble, spellcraft, discipline, search, UMD and I have 4 in appraise. My last few levels have been CoT, before that I took a few rogue levels.<br/>\n<br/>\nI will get the exact numbers tomorrow, but the above is fairly accurate.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:34 AM - Jun 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Don't know if it's any help, but a couple of years ago I made my Aielund Sword Champion (Fighter 14/ CoT 20/ Rogue 6). It's currently on page 3 of the Full Epic sub-forum. It's a dual-wielder, but you've got so many feats at your disposal it'd be easily adaptable to katana<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SuperDuperCoolDude",
      "avatar": "no_avatar.png",
      "timestamp": "5:32 PM - Jun 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nDon't know if it's any help, but a couple of years ago I made my Aielund Sword Champion (Fighter 14/ CoT 20/ Rogue 6). It's currently on page 3 of the Full Epic sub-forum. It's a dual-wielder, but you've got so many feats at your disposal it'd be easily adaptable to katana\n</div></blockquote>\n\nI will check that out, thanks!<br/>\n<br/>\nOk, so I have cleave, power attack, weapon focus, weapon specialization,knockdown, improved knockdown, improved critical, weapon proficiency exotic, power attack, blind fight, iron will, and luck of heroes. Ability scores are 19, 12, 14, 14, 12, 8. Skills are appraise 4, disable trap 11, discipline 15, heal 2, lore 12, open lock 11, persuade 11, search 11, spellcraft 7, tumble 11, UMD 11. I will probably take toughness at some point, but I thought iron will was overall more helpful with my lowish will save, especially since neither CoT or rogue specialize in will saves. As I understand, Aielund takes out devastating critical and since overwhelming critical is not so great, I may just ignore that whole line.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:21 PM - Jun 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here is some advice although I don't have the full picture in my head...<br/>\n<br/>\nTake rogue (8) and stop both fighter (5) and CoT (7) at odd levels so that when you come into the epics you will have two bonus feats immediately. Take all the strongest feats (ewf, as, ep, ews) first to enhance playability and keep pumping strength as well. Take rogue at levels 22, 27, 32 &amp; 37 to max-out tumble for best AC.<br/>\n<br/>\nEdit: forgot to mention, stop fighter at 6th level. His use is to get us an immediate epic feat, then go all-out CoT &amp; rogue as mentioned above.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:21 AM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would take enough levels of Fighter and CoT in epic levels to get Epic Weapon Focus, Epic Weapon Spec, Armor Skin, and Epic Prowess as bonus feats, take Epic Will as a general feat, and use the other 6 general feats for Great Strength.<br/>\n<br/>\nFor pre-epic feats, take Toughness at level 18, take Great Cleave with your last pre-epic bonus feat, and take Improved Critical as soon as you can. What other feats you take are up to you because you have the basics covered already, but your options are limited. With 12 INT, you can't take Expertise, and with 12 DEX, you can't take Dodge.<br/>\n<br/>\nAlso, you can stop taking Open Lock, Disarm Trap, and Search now, Those are nice to have in Chapter 1, but from now on, you will have a Rogue henchman to handle those for you, until really late, but after that, I don't remember seeing any traps. Craft weapon will be handy in early Chapter 4, 16 ranks by level 24. Any more or any later would be a waste. Either Listen or Spot would be nice to have, and Spot is a class skill for both Rogue and CoT. Left-over points can go either in Lore or the conversation skills (Persuade, Bluff, and Intimidate). I just remembered, Concentration is also nice for resisting Taunts.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SuperDuperCoolDude",
      "avatar": "no_avatar.png",
      "timestamp": "4:58 AM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\nHere is some advice although I don't have the full picture in my head...<br/>\n<br/>\nTake rogue (8) and stop both fighter (5) and CoT (7) at odd levels so that when you come into the epics you will have two bonus feats immediately. Take all the strongest feats (ewf, as, ep, ews) first to enhance playability and keep pumping strength as well. Take rogue at levels 22, 27, 32 &amp; 37 to max-out tumble for best AC.<br/>\n<br/>\nEdit: forgot to mention, stop fighter at 6th level. His use is to get us an immediate epic feat, then go all-out CoT &amp; rogue as mentioned above.\n</div></blockquote>\n\nAhhhh good call on the pre epic levels. I had not thought of that!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SuperDuperCoolDude",
      "avatar": "no_avatar.png",
      "timestamp": "5:19 AM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote:</cite>\nI would take enough levels of Fighter and CoT in epic levels to get Epic Weapon Focus, Epic Weapon Spec, Armor Skin, and Epic Prowess as bonus feats, take Epic Will as a general feat, and use the other 6 general feats for Great Strength.<br/>\n<br/>\nFor pre-epic feats, take Toughness at level 18, take Great Cleave with your last pre-epic bonus feat, and take Improved Critical as soon as you can. What other feats you take are up to you because you have the basics covered already, but your options are limited. With 12 INT, you can't take Expertise, and with 12 DEX, you can't take Dodge.<br/>\n<br/>\nAlso, you can stop taking Open Lock, Disarm Trap, and Search now, Those are nice to have in Chapter 1, but from now on, you will have a Rogue henchman to handle those for you, until really late, but after that, I don't remember seeing any traps. Craft weapon will be handy in early Chapter 4, 16 ranks by level 24. Any more or any later would be a waste. Either Listen or Spot would be nice to have, and Spot is a class skill for both Rogue and CoT. Left-over points can go either in Lore or the conversation skills (Persuade, Bluff, and Intimidate). I just remembered, Concentration is also nice for resisting Taunts.\n</div></blockquote>\nSo in epic levels you would do a lot more Rogue? I am definitely starting to see the value of Rogue's sneak attack now that I have 3 regular attacks + 1 from haste. A knockdown is always really bad for any enemies I am fighting as I can usually get in 2-3 sneak attacks before they rise. Epic will is a good call. My will saves are quite low at the moment. What are good final numbers to shoot for before equipment? Mine are all above 10 at level 14.<br/>\n<br/>\nToughness is a good idea, it will somewhat mitigate the low hit die from Rogue levels. I probably won't take Expertise, even though I do have 14 int. Is there a compelling reason to use it? Does it work if I turn it on and then use a magic rod or similar? Dodge would be nice but I figured with sword and board it wasn't worth putting the points in dex for 1 AC.<br/>\n<br/>\nYeah, I probably will ditch open lock. Most things can be bashed open pretty quickly now anyway. I do like disarm trap as a lot of traps are worth 50-60 experience. So there are a lot less traps later? Is the Rogue companion in acts 3 and 4 pretty good? Is she not available for the end of the game? I was thinking about using the Fighter or Cleric/Paladin henchmen or maybe both. I have the Barbarian and Rogue in act 2 currently. What exactly does craft weapon do in chapter 4? I might invest in it if it's something awesome. I have slowed down my Lore investment since I have two rings that buff it and the price of identification is pretty paltry now. I will probably keep leveling Persuade and maybe do some Bluff or Intimidate going forward. Healing is tempting with all of the spiders I seem to find, but I have equipped everyone with amulets of health to counteract them. I didn't know that about Concentration!<br/>\n<br/>\nAnother question, how much money should I be hoarding? I have well over 200k at the moment while helping the dwarves in act 2. I am tempted to upgrade my katana +3 at the enchantment guy but that would take half of my cash and I don't want to be short later. I pick up and sell most items though (the dark dwarves are a great source of cash so far with their armor and short swords +1) and I also have a few points in appraise, plus the appraise ring you can buy in act 2, which has already paid for itself. Hopefully I can find another one of those, it makes a huge difference.<br/>\n<br/>\nThanks to you and everyone else for the input!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:05 AM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As it is now &amp; if you follow my advice for a pre-epic split of (rogue 8/ fighter 5/ cot 7) then you can finish on a nice (rogue 14/ fighter 6/ cot 20) final split. That will give you huge saves (you practically don't have to worry about them with that many cot levels), all the epic feats that you need for Aielund, the best bonus feats that rogue has to offer (10th crippling strike &amp; 13th improved evasion) and 7d6 sneak attack. Don't forget to take all general feat levels (21st, 24th, 27th etc.) as GR STR feats in order to become even more awesome.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}