{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "183",
  "name": "Quick Question (Hopefully)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/quick-question-hopefully-t2354493.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 10,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:50 PM - Jan 20, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi All, only me again.<br/>\n<br/>\n This should, I hope just be a quickie. Am in Aielund now, with Empyre's Monk/Fighter/Shadow-Dancer, but thought I'd also take a trip there with a build I'm familiar with - namely my little elven tank from the 'Non-shooty, non-magicky elves' thread. Now, I've had a look at that build and, of course, it has Dev Crit. So, I thought, minor alterations only...Naive. Easy enough pre-epic - just swap Great Cleave for Toughness. However, in epic I seem to have 2 Fighter bonus feats that I don't know what to do with! I've already moved EWF and EWS (levels 22 and 29 respectively) to earlier in the build, ditto Armor Skin and Epic Prowess (levels 33 and 38). This also means that I've put Great Strength I into the vacant level 21 slot - which means I can put another Great Strength (VII) into level 39. And now I'm left with an odd number in STR (41), which seems a waste, and a redundant bonus feat for Fighter 16.<br/>\n<br/>\n So, I'm thinking of dropping Fighter down to 14 and taking either 2 more levels of Bard (making it 16) - for the additional skill points, or RDD (making it 12) - for the HPs. What do you think?<br/>\n<br/>\n I'm aware that I'm tinkering with a phenomenal build, and moaning that I've got too many feats to play with, which seems to be an insane complaint, but your sage counsel would be appreciated. (You see what happens when I get interested again! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />)<br/>\n<br/>\n Thanks in advance!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:47 PM - Jan 20, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Stagmeister.... do me (and possibly others) a favor and link the phrase \"Empyre's Monk/Fighter/Shadow-Dancer\" to the build itself please.  I'd like to give a more detailed opinion but tbh, I don't have the time to hunt down the build you are referring to though I do recall seeing it posted somewhere.  I am also assuming by your comments that you are trying to fab a non-DevCrit version for the modules?<br/>\n<br/>\n About those odd final numbers... it really doesn't matter unless you are guaranteed of reaching the ability caps with items.  If, in the case of STR ability (in this case, your prime ability), chugging a pot of Bull's Strength rolls a d4 so there's an equal chance of getting an odd buff as an even buff.  So, if it comes out that way, so be it.  Quite often builds will allot DEX 13 for getting the dodge tree or INT 13 for the expertise tree and it's the same deal.  Chugging a Cat's potion to increase AC/reflex or a Fox's potion to increase Spellcraft saves has the same chance of odd/even buffing. <br/>\n<br/>\n Once you've linked the build I can help more until Empyre shows up.  I'm sure he's deliberated on a non-DevCrit version himself without me trying to reinvent the wheel.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:21 PM - Jan 20, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, bugger, I knew this wasn't going to be as simple as I'd hoped!<br/>\n<br/>\n First of all, thanks for giving me a 'learning opportunity' - I've no idea how to 'link', but I'll see what I can do!<br/>\n<br/>\n Second, the issue isn't about the Monk/Fighter/SD build at all ('cos it's already non-DevCrit), it's the Elven Dragon Dual-Wielder (Fighter 16/Bard 14/RDD 10) - which was the first build ever made for me (predominantly Empyre, but Valerfor came in with some epic-levels and skills changes - you'll see when I get the link sorted). It's a build I love, and with which I first learned how to play properly (for want of a better word). Thus, I thought: \"scary new game, I'd like someone familiar to play with\". Hence the query!<br/>\n<br/>\n Third, thanks for volunteering help!<br/>\n<br/>\n Right, time to try this link thingummy...<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354345/Nonshooty-nonmagicky-elves-you-know-you%27re-out-ther#7\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... out-ther#7</a><br/>\n and<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354345/Nonshooty-nonmagicky-elves-you-know-you%27re-out-ther#9\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... out-ther#9</a><br/>\n<br/>\n<em><strong>EDIT:</strong></em> Blow me down - it seems to have worked!<br/>\n<br/>\n<strong><em>EDIT 2:</em></strong> Well, it takes you to the thread, but not the specific post, damn it. Fyi, the relevant posts are #7 and #9. Sorry - still learning!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:00 PM - Jan 20, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Should look more like:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/reply/20850729/Nonshooty-nonmagicky-elves-you-know-youre-out-there#reply-20850729\" rel=\"noreferrer\" target=\"_blank\">Empyre's Elven Dragon Dual-Wielder</a><br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/reply/20850731/Nonshooty-nonmagicky-elves-you-know-youre-out-there#reply-20850731\" rel=\"noreferrer\" target=\"_blank\">Valerfor's variant of epic levels for above</a><br/>\n<br/>\n You want to navigate to a specific post rather than a topic in this case.  And lose that insanely long and nasty url string. These are the steps: <ul><li>Click on the url in upper RH corner of the post being accessed; a window pop-up appears containing two urls.</li> <li>Highlight/copy the one in the \"Link to reply in the thread:\" field.  (I use Ctrl-C to copy.)  Close the window.</li> <li>Highlight the text string in your paragraph you want to link.</li> <li>Click the Link icon in the Toolbar; a window pop-up appears containing an empty url field.</li> <li>Paste the copied url into the blank field.  (I use Ctrl-V to paste.)  Click OK.</li> <li>Rinse and repeat for each additional you want to reference.</li> </ul>\n It will eventually become second nature after about 100 times or so. *lol*<br/>\n<br/>\n As to your build concerns, well, look... I am totally confused what your version looks like.  Best to just paste whatever stage you have into this thread.  Ignore the skills for now.  We'll assume if there are any prereq skill levels (like Lore) that you have them allocated already.  Just your starting ability spread and ability/feat schedule is plenty to help me grasp where you are.<br/>\n<br/>\n Didn't anyone ever tell you that anything worthwhile is never ever QUICK? *lol*<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:44 AM - Jan 21, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Hip. For a clown, even I can see the logic of your guidance re the postings/links. Makes sense - let's see if I can break it! And big hands up for naming the respective URLs!<br/>\n<br/>\n I guess you've now seen the build(s). Simply put, I've taken Empyre's pre-epic build as is (using Valerfor's skills split, though we're ignoring skills for now, if I understand your post correctly), with the sole exception of swapping out Great Cleave at level 18 for Toughness (GC was only there, I suspect, in order to pursue a Dev Crit build), thereby granting extra HPs, hoorah!<br/>\n<br/>\n My issue comes in Epic, for which I used Valerfor's variant (it's all sounding terribly \"physics\", isn't it?). Clearly, OW Crit and Dev Crit are non-starters, so I popped my first Great Strength in at L21, and EWF at L22 (I took handaxe rather than shortsword as my preferred weapon, 'cos, well...). I then hiked EWS to L29 (still trying to keep the same level progession as the original), Armor Skin to L33 (Fighter 12 BF), and Epic Prowess to L38 (Fighter 14 BF). Great Strengths (II - VI) took all my 'natural' feats up to L36. Essentially, I'm asking for help at levels 39 and 40, where, if I stay with current progression, I take Fighter 15 (with a 'natural' feat) and 16 (with a bonus feat). I <em>could</em> take an extra Great Strength at L39, but it just means I could carry more stuff, which I would hope shouldn't be a problem at that stage. Equally, the rest of the Fighter class bonuses in Epic are of no real use (back in the day, I'd have leapt at Improved Initiative, but times change...). So I thought, \"how about dropping the last two Fighter levels for either two more levels of Bard - which I only use for singing purposes (I know, my bad, but I'll start looking at spellcasting once I've 'mastered' the mundane), or RDD - which will keep my hit points higher?\" That was all this was meant to be!<br/>\n<br/>\n Now, I'm aware I haven't posted where I'm at, but I'm trying to describe it, because I want to keep as close to the original(s) as I can. It's a build (builds?) I adore, and in whose skin I feel very comfortable, which is no bad thing when one goes somewhere new.<br/>\n<br/>\n Oh, and yes, I get what you say about 'quick' - maybe I should have said 'simple'! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:07 AM - Jan 21, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You don't need to worry about having an odd STR at level 40 because in the Aielund Saga, you'll only reach level 36 or, rarely, 37.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:33 AM - Jan 21, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Empyre, you star! So I don't need to worry about levels 39 and 40, 'cos they won't apply. Excellent - the little elven tank lives once more!<br/>\n<br/>\n And Hip, sorry! But again, still learned plenty - about the site and how to use it, this time - which can't be a bad thing!<br/>\n<br/>\n Thanks - off to load now - \"Evil, meet my sword!\"<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:31 AM - Jan 21, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Very good.  Once again Empyre arrives in the nick of time. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n One comment about your \"plan\".  Toughness is really nothing more than a \"filler\" feat. When all those that have major impact have already been slotted, that's where Toughness comes in. I would take IKD over Toughness any day of the week without even thinking about it.  Let's see, at that point you would have struggled mightily along without those precious 17 HPs and then at 18 all of a sudden become empowered to brave savage tests?  Nah.  All Toughness does is save a healing round once in a blue moon.  Even Called arm shots would serve this toon better, but still IKD would be my feat of choice.<br/>\n<br/>\n Another strange thing about this is:  Couldn't you sacrifice 1AB to gain access to Improved Invisibility, Keen Edge and +4 Magic Weapon?  Perhaps the environment is flushed with scrolls?  Unless these modules place keen prop indiscriminately on weaponry, that spell is worth its weight in gold.   Dunno.  All those bard levels with almost no casting ability is pretty odd. And the song is the single-turn version so don't sneeze during combat or it will be over by the time you reach for a rag to clean up.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:46 PM - Jan 21, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Many thanks, Hip.<br/>\n<br/>\n I probably ought to clarify a couple of things about the build. I specifically requested a non-magic-using elf - and even had to have bard song and use of armour explained to me. I was very much a newbie to NwN, and my only experience of Bard was in a Baldur's Gate/Icewind Dale context, which would have been a ludicrous choice for solo-ing the OC. This way, Empyre got me thinking about playing in a different way, which was invaluable. Equally, I was very dismissive of the knockdowns - and they do seem somewhat redundant in the OC. However, one of the reasons for my moving into a different story (Aielund, in this case) was to actually make use of these feats, as everyone else had told me how splendid they are. It does, therefore make sense to have IKD in the build, as you suggest, and so Toughness gets binned in its favour.<br/>\n<br/>\n It may well be that the build could be maxed in different ways, and I have no idea what sort of items and goodies await, but I like him, and I wanted someone I knew how to play to explore this new environment.<br/>\n<br/>\n Cheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:29 PM - Jan 21, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">No worries, Stagmeister! <br/>\n<br/>\n That's one of the kewl percs about the ECB... the discussions contain the true pearls.  I must admit that I have not once used any build posted here \"as is\" (other than my own :P) or from the legacy ECB, but have always been voracious reading the comments from the members.  They always bring play-style pointers to the table based on years of their own experience playing in so many more environments that I will never be exposed to.  As far as the design process itself, I build my own toon from scratch based on the intended content (which you are doing yourself for the Aeilund series), then check the class combo with the Search Engine to see what similarities or differences my newly-hatched concept has with previously-posted builds. Most times I will tweak the build slightly according to what I've read in the discussions, other times not if my specific application has little in common with those other builds.  Your own play-style should be the final deciding factor.  Whatever is most comfortable to play will always be the best recipe.<br/>\n<br/>\n BUT---&gt; Do not underestimate the hi-level Neverwinter Bard.  It's not just a skill dump class. <br/>\n<br/>\n A Bard can become a dominant choice for melee especially when synergized with another CHA-benefited class like CoT or cleric.  There was a mindful decision devising the AD&amp;D ruleset for making Bards non-lawful else the Bard/Paladin combo would be way too over-powering (but don't dismiss Bard/BG as a possibility).  A long-duration (i.e. Lingering Song/Lasting Inspiration 5+ hrs ) buff and curse that cannot be dispelled even by a Level 40 mage casting a Mord is pretty awesome.  How handy would a +15 boost to Discipline/Concentration/Hide/Heal/Taunt... etc. be during combat while reducing your opponents' skills an equal portion not to mention an equally destructive effect on their AC, AB and damage?  Just nasty IMO. How about a shapechanged Iron Golem singing and cursing while smashing through mobs of gawking enemies?  The ultimate partymate and solo artist both in one package.  The NWN Bard is not the gimped Baldur's Gate crossbowman eradicating fear with showtunes!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:49 PM - Jan 21, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Quite right, Reduxed Maestro! I myself have thus far only posted three builds (a Human Monk20/Ranger10/CoT10, a Dwarf DD23/Fighter10/WM7, and a Halfling Fighter16/Rogue14/CoT10). Interestingly enough, I enjoyed playing Mick Dagger's Halfling Champion (Fighter6/Rogue20/CoT14) considerably more than my own build of a similar nature, which also triggered an interest in DEX builds, that I'd never had before.<br/>\n<br/>\n At some point, I'd probably like to try to make a Bard/CoT build - with who knows what else - but I'm still wary of this magic malarkey, so I'd need to get a better handle on it first.<br/>\n<br/>\n Right, there's a pub in Aielund about to welcome a moistened elf into its warming bosom...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}