{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "337",
  "name": "The Immortal Charger: Barbarian 36 / Fighter 2 / Rogue 2",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-immortal-charger-barbarian-36-fighter-2-rogue--t515348.html",
  "author": "10235225",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "2.8K",
  "posts": [
    {
      "author": "10235225",
      "avatar": "no_avatar.png",
      "timestamp": "5:05 PM - Jul 05, 2011",
      "content": "<div>Hi folks! For about a year now, I've been a huge fan of the ECBG. I've read through many old threads from '06-'09 on the original Bioware forums, gasping at the prowess of all you builder folk. Whenever I'm making a new character and I have no idea what build to use, I hop on the ECB search and look for builds by some of my favorites, which include (but are not limited to!) Finneous, Griz, Grim, Kail, Bromium, Ithacan, Tyr, Mith, Cinnabar [Din], Thax'llssyllia, and so forth. Unfortunately a lot of these folks have left or are no longer around, so I figured I'd better start trying to make some builds myself. D:<br/>\n<br/>\nThat said, here's my first official build. I know how to make some basic builds and play them quite well, such as healers and mages. However, fighter builds I usually find a good deal trickier, so this is a large step for me.<br/>\n<br/>\nWithout further adieu: The Immortal Charger!<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~<br/>\n<br/>\nThe rain-bloated forest outside of Waterdeep was thickly cloaked in night. A faint crunching of leaves could be heard in the distance, very faintly echoing over the pitter-patter of thick raindrops. A watchful eye could have spotted two figures crouched behind some shrubbery, their eyes keenly watching distant torches move beyond the mist.<br/>\n<br/>\n\"Ssshh.\" A serpentine hiss came from one of the creatures. At first glance, they both looked quite human. One was a short, darkly clad male, while the other was an armored female. But the hiss that came from the bushes was far too alien to come from a human mouth. No, these two were undisguised pureblood Yuan-ti, their squinted eyes snake-like and their tongues very forked. <br/>\n<br/>\nAfter a moment of baited breath, the male broke the silence with an excited hiss. \"I hear them, Cathay-taz!\" The lanky female shot him a glare that could have melted ice. Her dim brown eyes were slanted in a fashion that made her look perpetually skeptical. Patches of scales lined her nose and cheeks, the raindrops making them glimmer slightly. <br/>\n<br/>\n\"Hussh, Ssutha-riz. They are closse.\" The young female's voice took on a slightly worried tone at these words. Reaching down with a gauntleted hand, she firmly grasped the dark scythe that lay on the leafed ground. Frenzied thoughts scurried through Cathay-taz's mind as the crunching footsteps got even louder. <br/>\n<br/>\n\"...'Ey. You 'fink 'at poster 'as 'tellin 'e truth?\" A faint cackle sounded above the buzzing drizzle of rain. \"I 'on't fink even snake people 'd be out 'ere in 'is weather, 'ey Sam?\" The female Yuan-ti heard a soft, furied hiss come from her brother's mouth. \"I guess it 'on't matter. If we get 'tha bunch 'an bring 'ere hides ta Ser Raphael, fink 'a all 'tha wine 'n wenches we kin get!\" More cackling, the sounds drawing ever closer to the heavily-breathing two.<br/>\n<br/>\n\"On three,\" Cathay-taz murmured in Abyssal, her scythe now raised to lie across her knee. She took a series of deep breaths, trying to focus all her anger at the world for throwing such hardships on her. \"One...\" As the dark boots of the trampling mercenaries finally came into sight, the young male beside her quickly unsheathed his twin shortswords. \"Two...\" Tilting her head upwards and offering a silent prayer to Shekinester, Cathay-taz tensed every muscle in her wiry body. \"Three.\" <br/>\n<br/>\nWith a sudden roar that seemed uncharacteristic for a teenaged female, the warrior maiden leaped out of the bushes and gave a blood-curdling hiss. The group of mercenaries numbered fifteen or so, but their expressions quickly changed from confident ones to concerned ones as they saw the two Yuan-ti emerge. \"'ell...'ere's only two.\" The speaker was a black-toothed, middle aged man with a bastard sword and a large shield in his hands, a Cheshire-cat grin perching upon his twisted face.<br/>\n<br/>\nWith another wordless yell, Cathay-taz raised her scythe above her head and brought it cleanly across one of the mercenary's necks. The flesh was torn cleanly from bone, despite the unfortunate man's heavy armor. It seemed as though she had grown from barely six feet in height to practically seven, her bottled rage spilling over in the form of an almost self-destructive strength and endurance. Charging forward in the middle of the group, she started to blindly hack left and right, hearing an echoed cry from her brother as he leapt into combat as well. <br/>\n<br/>\nThe mercenaries weren't too slow-witted, and one quickly moved to stab the young girl in the back. And yet, even though his blade went through her flimsy breastplate, her coating of scales caused the blade to turn and fold like paper. Horrified, the mercenary rogue stumbled backwards as the serpentine reaper turned to face him in her wild anger. Moments later, he was lying dismembered on the ground, while the scyther hurried to find another victim.<br/>\n<br/>\nAfter moments that seemed like hours, not one of the mercenary group lay breathing. Cathay-taz' brother was crouched again, bleeding slightly from a few wounds, but his raging sister had not a scratch to be seen. Strapping her scythe onto her back and stalking over to her only ally, the young female let out a hissed sigh and allowed her indescribable fury to melt to a boiling simmer.<br/>\n<br/>\n-The Immortal Charger: Barb 36/Fighter 2/Rogue 2-<br/>\n<br/>\nPvP 40/PvM 21-40<br/>\n<br/>\nA bit of context for this build: I play on a very, very high magic server. Weapons have +17 enhancement bonuses, and you can usually cap out AB with Bless and Aid scrolls/potions. Armor caps out at around +10, and monk dexers can usually get ACs into the high 80's/low 90's. Some tanks get high 80's. PvM is necessary to get gold and gear, but PvP is where the fun starts. So, as a recent module patch implemented a certain perk for barbarians, I decided to finally make one. The rule is, any barbarian with 35 or more levels gets a 10 round, once-a-day \"Deathless Rage\" perk, which not only makes the barbarian unable to drop below 1HP, but also makes them immune to sneaks and crits. <br/>\n<br/>\nThat out of the way, here's a list of some pros and cons.<br/>\n<br/>\nPros:<br/>\n-Good AB<br/>\n-Excellent HP! 744 with no gear.<br/>\n-Plenty of skillpoints.<br/>\n-Good saves.<br/>\n-UMD deliciousness<br/>\n-A total damage reduction of 18/-, since Epic Barb DR and EDR stack.<br/>\n-Terrifying rage with a petrifying DC (44 + 1d10)<br/>\n-Two-handed 1.5 damage<br/>\n<br/>\nCons:<br/>\n-Very little AC to speak of, though it's unlikely most will live long enough to get in a truly hurting blow.<br/>\n-AB could be better<br/>\n-Can't use heavy armor 'till level 21<br/>\n-Probably a bit slow to level until epic<br/>\n-No shields allowed, since yer a two-hander<br/>\n-Bit of an XP penalty towards the end<br/>\n<br/>\n<br/>\n\tBarbarian(36), Rogue(2), Fighter(2), Human (Any non-lawful)<br/>\n<br/>\n                STR: 16 (26)\t<br/>\n\t\tDEX: 12\t<br/>\n\t\tCON: 16 (22)\t<br/>\n\t\tWIS: 8\t<br/>\n\t\tINT: 14\t<br/>\n\t\tCHA: 8\t<br/>\n<br/>\n0\t40\tHuman: (Quick to Master)\t<br/>\n1\tBb\t01: Barbarian(1): Blind Fight, Weapon Proficiency Exotic\t<br/>\n2\tBb\t02: Barbarian(2): {Uncanny Dodge I}\t<br/>\n3\tBb\t03: Barbarian(3): Weapon Focus: Scythe\t<br/>\n4\tBb\t04: Barbarian(4): STR+1, (STR=17)\t<br/>\n5\tBb\t05: Barbarian(5)\t<br/>\n6\tBb\t06: Barbarian(6): Skill Focus: Intimidate\t<br/>\n7\tBb\t07: Barbarian(7)\t<br/>\n8\tBb\t08: Barbarian(8): CON+1, (CON=17)\t<br/>\n9\tBb\t09: Barbarian(9): Improved Critical: Scythe\t<br/>\n10\tBb\t10: Barbarian(10)\t<br/>\n11\tBb\t11: Barbarian(11)\t<br/>\n12\tBb\t12: Barbarian(12): CON+1, Toughness, (CON=18)\t<br/>\n13\tBb\t13: Barbarian(13)\t<br/>\n14\tBb\t14: Barbarian(14)\t<br/>\n15\tBb\t15: Barbarian(15): Resist Energy: Acid\t<br/>\n16\tBb\t16: Barbarian(16): STR+1, (STR=18)\t<br/>\n17\tBb\t17: Barbarian(17)\t<br/>\n18\tBb\t18: Barbarian(18): Resist Energy: Fire\t<br/>\n19\tBb\t19: Barbarian(19)\t<br/>\n20\tBb\t20: Barbarian(20): STR+1, (STR=19)\t<br/>\n21\tF\t21: Fighter(1): Great Strength I, Epic Weapon Focus: Scythe, (STR=20)\t<br/>\n22\tBb\t22: Barbarian(21)\t<br/>\n23\tBb\t23: Barbarian(22)\t<br/>\n24\tBb\t24: Barbarian(23): CON+1, Great Constitution I, (CON=20)\t<br/>\n25\tBb\t25: Barbarian(24): Terrifying Rage\t<br/>\n26\tBb\t26: Barbarian(25)\t<br/>\n27\tBb\t27: Barbarian(26): Great Strength II, (STR=21)\t<br/>\n28\tBb\t28: Barbarian(27): CON+1, (CON=21)\t<br/>\n29\tBb\t29: Barbarian(28): Epic Prowess\t<br/>\n30\tBb\t30: Barbarian(29): Great Constitution II, (CON=22)\t<br/>\n31\tBb\t31: Barbarian(30)\t<br/>\n32\tF\t32: Fighter(2): STR+1, Epic Damage Reduction I, (STR=22)\t<br/>\n33\tBb\t33: Barbarian(31): Great Strength III, (STR=23)\t<br/>\n34\tBb\t34: Barbarian(32): Epic Damage Reduction II\t<br/>\n35\tBb\t35: Barbarian(33)\t<br/>\n36\tBb\t36: Barbarian(34): STR+1, Great Strength IV, (STR=25)\t<br/>\n37\tRo\t37: Rogue(1)\t<br/>\n38\tBb\t38: Barbarian(35)\t<br/>\n39\tBb\t39: Barbarian(36): Epic Skill Focus: Taunt, Epic Damage Reduction III\t<br/>\n40\tRo\t40: Rogue(2): STR+1, {Evasion}, (STR=26)\t<br/>\n<br/>\n\t\tHitpoints: 744\t<br/>\n\t\tSkillpoints: 305\t<br/>\n\t\tSaving Throws (Fortitude/Will/Reflex): 28/15/17\t<br/>\n\t\tSaving Throw bonuses: Traps: +5\t<br/>\n\t\tBAB: 30\t<br/>\n\t\tAB (max, naked): 42 (melee), 32 (ranged)\t<br/>\n\t\tAC (naked/mundane armor/shield only): 15/26\t<br/>\n<br/>\n\tSkills: \tDiscipline 42(50), Heal 43(42), Intimidate 42(44), Listen 43(42), Open Lock 43(44), Search 10(12), Taunt 42(51), Tumble 20(21), UMD 20(19)<br/>\n<br/>\nI only took 20 tumble for sake of avoiding AoOs, since AC isn't a big part of this build. Rather than spend feats and skills on it to only have a low/middling AC, I decided to neglect it altogether. If you do want AC, put Search and Open Lock into Tumble, and grab AS instead of ESF:T. The skills are mostly flexible, aside from Taunt (preferable) and Intimidate (essential).<br/>\n<br/>\nThis would be my first official build, as I've said, so comments/crits would be appreciated.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:13 AM - Sep 12, 2011",
      "content": "<div>OK, sorry if this took too long for someone to pitch in, but the guild halls have been, as you well noted, very empty of late. <br/>\n<br/>\nNow, you need to have 35 Barbarian levels for the Deathless rage, and that limits your options very much. You can't take WS and EWS for better damage, which makes me wonder why Fighter? You do get 2 Bonus Feats, true, but if you won't take full advantage of one of the best benefits of getting Fighter, which is having access to WS and EWS, then I see no reason to go with it. I would personally drop Epic Skill Focus Taunt and go Barbarian 35 Fighter 4 Rogue 1. You lose Evasion, true, but you gain WS and EWS to make up for it. If not, then please take the first Rogue level at 23 for earlier dumps and playability. I would also consider drastically dropping CON and going Half-Orc Devcrit for a more offensive alternative. And I don't understand why you wouldn't take Mighty Rage. It can be stacked with Greater Rage to cap STR and CON without the aid of items.<br/>\n<br/>\nI think that it's quite hindering for a build to go 35 levels of barbarian, but the Deathless Rage does sound overpowered. Hard to come up with better advice than this, though.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:44 AM - Sep 12, 2011",
      "content": "<div>Didn't realize you could take WS &amp; EWS on the same level so the build post was well worth it to me, Max.    Now I don't have to blow another fighter level (or 2!) just to get EWS.<br/>\n<br/>\nBTW, how much value would Epic Skill Focus: Intimidate be worth in place of the Taunting one?<br/>\n<br/>\nA build can sort of float away as others are posted afterwards and that is a sad fact.  Good work bumping it as I hope the OP is still checking in.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:58 AM - Sep 12, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong>Didn't realize you could take WS &amp; EWS on the same level so the build post was well worth it to me, Max.    Now I don't have to blow another fighter level (or 2!) just to get EWS.<br/>\n<br/>\nBTW, how much value would Epic Skill Focus: Intimidate be worth in place of the Taunting one?<br/>\n<br/>\nA build can sort of float away as others are posted afterwards and that is a sad fact.  Good work bumping it as I hope the OP is still checking in.</div></blockquote>\n\nI agree, ESF Intimidate will be better for the Terrifying Rage DC. Go for it!</div>"
    }
  ]
}