{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "278",
  "name": "I see a lot of how do you beat casters? (Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/i-see-a-lot-of-how-do-you-beat-casters-arelith-t2216211.html",
  "author": "DeadZombie",
  "avatar": "no_avatar.png",
  "replies": "0",
  "views": "1.7K",
  "posts": [
    {
      "author": "DeadZombie",
      "avatar": "no_avatar.png",
      "timestamp": "3:56 PM - Apr 12, 2012",
      "content": "<div>Not sure if this is the right place to put it I hope it is.<br/>\n<br/>\nFirst lets go over some typical builds then some tactics.<br/>\n<br/>\nWell first thing is first for arelith. Only way to beat a truely built/good is with another mage or cleric. Caster classes on the server have far to much buffs and the mundanes have far to many nerfs. And sneakers have the rule where they can't just set traps up or pop out of hide to gank them.<br/>\nSome none caster builders that can handle them.<br/>\n<br/>\n1. Arcane archers<br/>\nPros: High Saves, High ab, Once you hit +5 arrows goes through premo + stoneskin, Ranged so you don't have to deal with acid sheath. <br/>\nCons: Hard as piss to level on arelith early levels. Damage is only decant depending on build. Arrows are a pain in the arse to craft unless ranger, Can be super nuked by mages if you don't get to interrupt. Must have to get a token from a DM which can be a pain.<br/>\n<br/>\nTactics: Basically you fart arrows trying to interrupt them and kill them. Rapid shot is always a must. Called shot is good if they are trying to run away. It is good to usually get positive energy resist on your items for the super greater ruin buff.<br/>\n<br/>\nThings to watch out for: Timestop + nukes. Super g ruin , super hell ball (which doesn't hurt the caster), If they Timestop + ruin igms a few times you are dead anyways.<br/>\n<br/>\nClerics are easier to pick off since most on arelith just spam implosion.<br/>\n<br/>\n<br/>\n2. 10 something + 20 Champion of Torm ( with scythe) (kensai version)<br/>\nPros: Crazy high saves, High ab and even crazier saves with Divine Wrath, imp Disarm for the melee casters, ikd for the casters, perma hasted, overwhelming crit.<br/>\nCons: Ab is only going to be at around 44 without wrath on a more mundanish build, you only get 1 wrath, +3 weapon so you must tear through mage defenses. Must have to get a token from a DM. Which can be a pain.<br/>\n<br/>\nTactics: Well, you will want to get acid resists essences, Divine wrath and proceed to IKD spam, With your saves they will have to start nuking you. golem form tactic won't be good for them since you will acid immune. Same tactic for caster cleric, melee cleric use divine wrath ab and imp disarm to get rid of their weapon!<br/>\n<br/>\nThings to watch out for: Mages: surviving the nukes as always. Clerics: HARM you can't drink protection from neg energy as a kensai, Word of faith....because their is no save.<br/>\n<br/>\n<br/>\n3. Dragon Druid<br/>\nPros: Nice ab, ikd bonus, acid immune, good will and fort, Dmg reduction, high hp, high ac, lots of druid spells to back you up, etc.etc.etc. Don't need to get a token to play it! Easily attainable now super +5 eating bear.<br/>\nCons: Low reflex, Large size.<br/>\n<br/>\nTactics: Shift....kill...<br/>\n<br/>\nThings to watch out for: Biggest thing is going to be a bigby spell. Reflex save on arelith dragons usually have piss poor reflexs but can be negated with feats possibly. Other than that you will shred through any caster on the server like paper. <br/>\n<br/>\n<br/>\n4. Weapon Master (scythe)<br/>\nPros: Can use UMD when mixed with rogue/bard, High damage, Can possibly sneak, best ab a mundane will get, IKD, Imp Disarm, can possibly 1 hit kill most casters.<br/>\nCons: 20% slow in heavy armor, horrible saves no matter what you do, must rely on umd items which will cost some $.<br/>\n<br/>\nTactics: UMD is your friend. Timestop, potion of mind blank, g sanc, spell mantles, potion neg energy protection, these will be your best friends! Then ikd and wait for a crit. Also helps as I said before to grab acid resist. <br/>\n<br/>\n<br/>\n5.  Paladin Cot Smither<br/>\nPros: One hit anything evil, High saves, High ab.<br/>\nCons: Get beat up by something not evil, Hp can be low on some builds for a melee, Possibly a pain to level.<br/>\n<br/>\nTactics: walk up and smite....if its evil <br/>\n<br/>\n6. Rogue!! (yes rogue)<br/>\nPros: High damage via epic sneaks, Sets traps, Hiding, high reflex save, UMD<br/>\nCons: Non ganking arelith rules, True seeing auto spots, low fort, low will, ab usually isn't that good, Damage comes from ikds.<br/>\n<br/>\nTactics: First tactic Ambushing Arelith style. Find target. Walk ahead of target. Get ready to fight target. Run away from target. Target follows and dies.<br/>\nTactic two: Time stop and various other umd scrolls.<br/>\n<br/>\nHope this helps some of you. I know how much it sucks to have a super nice rp session going then someone comes and kills you're entire platoon of soldiers just because they wear a dress and have a staff! xD</div>"
    }
  ]
}