{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "382",
  "name": "Battlecleric(Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/battlecleric-arelith-t2344668.html",
  "author": "Azshanola",
  "avatar": "no_avatar.png",
  "replies": "10",
  "views": "1.1K",
  "posts": [
    {
      "author": "Azshanola",
      "avatar": "no_avatar.png",
      "timestamp": "6:11 PM - Oct 28, 2013",
      "content": "<div>Hello! I am fairly new to the game,(only about a month or so total) and building in general. I have to say the hardest part about it is not knowing what I want to do it's the intimidation I feel about making new characters, feeling like I lack the knowledge of skills and their caps and feats in particular. Regardless! I come to you to ask with help for a cleric. I want to make this character for PVP and as the title says it's for Arelith so that means the usual. Level 30 cap, have to take 3 levels in a class before you can leave it, as I said I'm new and that includes to Arelith so correct me if I'm wrong but I think the best I can get are things like AB+3, damage bonus slashing +6, plus, and another 4 divine damage if I can get the right essence(as far as weapons anyways, its low magic).  RDD, shifter and PM are all out of the question. It's also a fairly slow leveling server so something that could survive well during the time it takes to get up there would be nice. Oh! Dev critical is disabled as well.<br/>\n<br/>\nHere are specific spell changes: <a class=\"postlink\" href=\"http://arelith.com/ph_magic.html\" rel=\"noreferrer\" target=\"_blank\">http://arelith.com/ph_magic.html</a><br/>\n<br/>\nBut some specific changes are no stacking weapon buffs, all of bigby's have a reflex save. Epic spell focus provides a special custom spell for each school. The specific spells are list above one or two sections down. <br/>\n<br/>\nAs far as getting down to the meat of things! I'd like to do elf. There are a couple of subraces on Arelith that change the racial stat weights, the only one I was interested in for RP besides just \"elf\" is sun elf. Sun elf: Int+2, con-2/Favoured class: Wizard<br/>\n<br/>\nAs I said in the title I'm interested in cleric, what I'd like to do with the build is make it a bit heavier on melee. I don't have a particular preference for one hand with shield or two hander but I would like to use a longsword(It's Corellon's favoured weapon, the god the character will be following). So essentially I was hoping a sort of battlecleric I suppose, that's what I had in my mind anyways. As far as spells I'd assume for that some that are offensive but primarily to buff myself up. Obviously abjuration perhaps being useful with the +2 to dispel checks per focus and +6 with epic focus, just so that I don't make myself powerful and ready to go then lose all momentum when the buffs are gone. <br/>\n<br/>\nAside from all of that! Feel free to suggest what you see fit! I'm new to building and I'd love to see the logic behind your answers and going deep into them to give good examples of skill caps, what I want where, etc. Thank you in advance!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:49 PM - Oct 28, 2013",
      "content": "<div>Hail and welcome to the ECB, Azshanola!<br/>\n<br/>\nI have been a member for a while and I have to tell you, I like your attitude! You could check out the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/game-guides-f60579.html\" rel=\"noreferrer\" target=\"_blank\">Game Guides</a> section to start understanding what NWN character building is all about. I myself have written a guide on the Cleric class, which you can use as reference both to build and to play, and a complete guide to the logic of building. There is a lot of information there, as you have probably figured, but alas, it's a very complex game. I also provide links to several builds in the main post to serve as reference.<br/>\n<br/>\nAs for this particular build, I'm thinking Cleric / Champion of Torm / X (probably Rogue). This way you can have lots of feats and high saves. Maybe Cleric 17 Rogue 3 CoT 10 with Cleric 17 CoT 3 pre-epic for a BAB of 15 (a good thing if you are a Cleric). If you want to be indispellable, you need 24 Cleric levels, so that restricts the combo possibilities a lot. If you want to avoid being vulnerable even while being dispellable, you can just have multiple copies of the important buffs and just rebuff if dispelled. Besides, there is always Mordenkainen's Disjunction, which will stripe you of your protections regardless of Caster level. Another possibility is Cleric 16 (you'll lose lvl 9 spells) CoT 10 Rogue 4, which would allow you a much smoother leveling thanks to UMD and Tumble updates in pre-epic. Start with Cleric 15 Rogue 3 CoT 2 pre-epic, and go CoT 8 Cleric 1 Rogue 1 in epics. You'll probably need to take 15 Cleric in a row, then 3 Rogue and then 3 CoT. The last Cleric level could come at 30 and the last Rogue at 27, the rest being CoT.<br/>\n<br/>\nSo, before I even attempt to build you something, which one is it? Dispellable and more versatile or indispellable and limited?<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Azshanola",
      "avatar": "no_avatar.png",
      "timestamp": "8:38 PM - Oct 28, 2013",
      "content": "<div>Thank you for the welcome and for the link! I'll be sure to check it out. Dispellable and more versatile would be nice because I think it would pay off better down the road.<br/>\n<br/>\nEdit: Also as I said, having been new I haven't played around with the domains too much, are there any that are just better then others? I was thinking going at the very least magic given one of Corellon's domains is arcana, I wasn't sure about the other one though and am unsure if there are certain domains that are just outclassed.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:02 PM - Oct 28, 2013",
      "content": "<div>That is server-specific. The server I play on has domain restrictions for Clerics so that they can't level up unless they have the correct domains for the god of their choice as well as a fitting alignment. You'd better make sure how it works in Arelith, especially because it's a RP-heavy place, I reckon, so there probably are restrictions. If not, then let me know and I'll get to work on a build, allright?<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Azshanola",
      "avatar": "no_avatar.png",
      "timestamp": "10:11 PM - Oct 28, 2013",
      "content": "<div>It looks like there's no restrictions on domains but just for the character I'd like to keep it as close as I can to the chosen god so Corellon. As I said, I think magic would be a good choice and the other one could be protection or war to fit into there. Or at least something that's not completely opposed to Corellon. So mostly no death, trickery or destruction if that isn't too much trouble! Alignment is the same way iirc but, of course I'll be sticking within his area so neutral good likely.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:35 PM - Oct 28, 2013",
      "content": "<div>Ok, here's what I've built. Empower spell can be swapped for Toughness if you feel the need for more HP (however I wouldn't).<br/>\n<br/>\nCleric(16), Rogue(4), Champion of Torm(10), Elf<br/>\n<br/>\nSTR: 16 (26)<br/>\nDEX: 10<br/>\nCON: 10<br/>\nWIS: 16 (18)<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nElf: (Hardiness vs. Enchantments, Keen Sense, Low-light Vision, Skill Affinity: Listen, Skill Affinity: Search, Skill Affinity: Spot, Sleeplessness)<br/>\n01: Cleric(1): Expertise, Domain War, Domain Magic<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Weapon Focus: Longsword<br/>\n04: Cleric(4): WIS+1, (WIS=17)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): Knockdown<br/>\n07: Cleric(7)<br/>\n08: Cleric(8): STR+1, (STR=17)<br/>\n09: Cleric(9): Extend Spell<br/>\n10: Cleric(10)<br/>\n11: Cleric(11)<br/>\n12: Cleric(12): STR+1, Improved Knockdown, (STR=18)<br/>\n13: Cleric(13)<br/>\n14: Cleric(14)<br/>\n15: Cleric(15): Empower Spell<br/>\n16: Rogue(1): STR+1, (STR=19)<br/>\n17: Rogue(2): {Evasion}<br/>\n18: Rogue(3): Blind Fight, {Uncanny Dodge I}<br/>\n19: Champion of Torm(1)<br/>\n20: Champion of Torm(2): STR+1, Improved Critical: Longsword, (STR=20)<br/>\n21: Champion of Torm(3): Great Strength I, {Smite Evil}, (STR=21)<br/>\n22: Champion of Torm(4): Great Wisdom I, (WIS=18)<br/>\n23: Champion of Torm(5)<br/>\n24: Champion of Torm(6): STR+1, Great Strength II, Armor Skin, (STR=23)<br/>\n25: Champion of Torm(7)<br/>\n26: Champion of Torm(8): Epic Weapon Focus: Longsword<br/>\n27: Rogue(4): Great Strength III, (STR=24)<br/>\n28: Champion of Torm(9): STR+1, (STR=25)<br/>\n29: Champion of Torm(10): Epic Prowess<br/>\n30: Cleric(16): Great Strength IV, (STR=26)<br/>\n<br/>\nHitpoints: 252<br/>\nSkillpoints: 156<br/>\nSaving Throws (Fortitude/Will/Reflex): 23/24/21<br/>\nSaving Throw bonuses: Spells: +7, Mind Effects: +2<br/>\nBAB: 20<br/>\nAB (max, naked): 32 (melee), 21 (ranged)<br/>\nAC (naked/mundane armor/shield only): 18/29<br/>\nSpell Casting: Cleric(8)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 33(33), Disable Trap 1(3), Heal 10(14), Open Lock 1(1), Spellcraft 33(35), Spot 32(38), Tumble 30(30), UMD 16(15)<br/>\n<br/>\n01: Concentration(4), Spellcraft(4), Save(8), <br/>\n02: Concentration(1), Spellcraft(1), Save(10), <br/>\n03: Concentration(1), Spellcraft(1), Save(12), <br/>\n04: Concentration(1), Spellcraft(1), Save(14), <br/>\n05: Concentration(1), Spellcraft(1), Save(16), <br/>\n06: Spellcraft(1), Save(19), <br/>\n07: Spellcraft(1), Save(22), <br/>\n08: Spellcraft(1), Save(25), <br/>\n09: Spellcraft(1), Save(28), <br/>\n10: Spellcraft(1), Save(31), <br/>\n11: Spellcraft(1), Save(34), <br/>\n12: Spellcraft(1), Save(37), <br/>\n13: Spellcraft(1), Save(40), <br/>\n14: Spellcraft(1), Save(43), <br/>\n15: Spellcraft(1), Save(46), <br/>\n16: Disable Trap(1), Open Lock(1), Spot(19), Tumble(19), UMD(16), <br/>\n17: Heal(8), Spot(1), Tumble(1), <br/>\n18: Heal(2), Spot(1), Tumble(1), Save(6), <br/>\n19: Spot(1), Save(9), <br/>\n20: Spot(1), Save(12), <br/>\n21: Spot(1), Save(15), <br/>\n22: Spot(1), Save(18), <br/>\n23: Spot(1), Save(21), <br/>\n24: Spot(1), Save(24), <br/>\n25: Spot(1), Save(27), <br/>\n26: Spot(1), Save(30), <br/>\n27: Spot(1), Tumble(9), Save(30), <br/>\n28: Spot(1), Save(33), <br/>\n29: Spot(1), Save(36), <br/>\n30: Concentration(25), Spellcraft(15), <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Azshanola",
      "avatar": "no_avatar.png",
      "timestamp": "11:03 PM - Oct 28, 2013",
      "content": "<div>Alright! Thank you, I'll be sure to study up on what I can in the other sections as well as look at this with new lenses!</div>"
    },
    {
      "author": "Azshanola",
      "avatar": "no_avatar.png",
      "timestamp": "12:01 AM - Oct 29, 2013",
      "content": "<div>I had some additional questions on the build after looking at everything, I noticed there isn't any discipline and as a melee character won't that be a major problem? I figure getting knocked down will be the end of me. The second question is why points into spot? With true seeing isn't it not an issue?<br/>\n<br/>\nAlso what spells are going to be used to buff the character?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:30 AM - Oct 29, 2013",
      "content": "<div><blockquote><div><strong>Azshanola wrote:</strong>I had some additional questions on the build after looking at everything, I noticed there isn't any discipline and as a melee character won't that be a major problem? I figure getting knocked down will be the end of me. The second question is why points into spot? With true seeing isn't it not an issue?<br/>\n<br/>\nAlso what spells are going to be used to buff the character?</div></blockquote>\n\nWell, feel free to tweak Discipline into the build if where you play there aren't any immunities to KD. You can get rid of Spot. This was more of a second-nature thing, since I didn't really take my time with this build, I made it in about 5 minutes. Where I play, immunity to KD is fairly common at the cost of some AC, and True Seeing was changed to add to Spot, so I subconsciously took that into consideration when crafting this build, at least now you know why. However, Discipline is only a class skill for CoT, so the first 18 levels you will HAVE TO do without it, from then on you can update it constantly. Please know that we won't learn a server's rules unless we are going to play there ourselves, so ultimately, server-specific tweaking is up to none other than you. I didn't even read the spell changes and I doubt anyone here will when we build you something, we have lives LOL. There might be something in there that weakens or strengthens this build, I wouldn't know, that's where you come in, right? <br/>\n<br/>\nAbout the buffs, read my Cleric guide, man, it's all in there! But as a rough guide:<br/>\n<br/>\nLong-term: Bull's Strength (Empowered to have a higher result)<br/>\nCat's Grace (to give you 1 AC from dex bonus to go with full plate)<br/>\nExtended Bless<br/>\nExtended Shield of Faith<br/>\nExtended Aid<br/>\nDarkfire<br/>\nGMW (you gotta pick between Darkfire and GMW in Arelith apparently, so pick one)<br/>\nMagic Vestment (x2, one for armor and one for shield)<br/>\nMage Armor (+1 Dodge AC and +1 Natural AC without items)<br/>\nOwl's Wisdom (Empowered for more effectiveness)<br/>\nEndurance (Empowered for more HP)<br/>\nExtended Freedom<br/>\nDeath Ward<br/>\nExtended Negative Energy Protection<br/>\nExtended Spell Resistance<br/>\nExtended True Seeing<br/>\n<br/>\nShort-Term:<br/>\nDivine Favor (all lvl 1 spells)<br/>\nExtended Divine Favor (all lvl 2 spells except for Extended Bless and Extended Shield of Faith)<br/>\nExtended Divine Power (as many slots as you have except for Freedom)<br/>\nExtended Prayer (a couple)<br/>\nExtended Battletide (a couple)<br/>\nExtended Aura of Vitality (a couple)<br/>\nExtended Regeneration (a couple)<br/>\n<br/>\nBasically, you buff up with your long term buffs (you can have multiple copies of the most important ones to deal with dispels) as soon as you wake up, then before every battle (every battle that requires buffs, obviously) you buff with Divine Favor and Extended Divine Power, and you have a couple of \"full power modes\" a day where you add one of each of the other buffs and use an Extended Divine Favor instead of a normal one (for tougher battles). Knowing how to conserve your buffs is VITAL to playing Clerics well, so don't buff up before EVERY ENCOUNTER or you'll run out all the time.<br/>\n<br/>\nBut, before you go playing this guy like a self-buffer from level 1, read my guide, OK?<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Azshanola",
      "avatar": "no_avatar.png",
      "timestamp": "12:57 AM - Oct 29, 2013",
      "content": "<div>Will do and thank you again!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:08 AM - Oct 29, 2013",
      "content": "<div><blockquote><div><strong>Azshanola wrote:</strong>Will do and thank you again!</div></blockquote>\n\nJust one more thing. There is XP penalty from the first Rogue level on for being Elf that would be negated by going Human. You'd get one more feat (which is useless since you'd have to use it for Martial Weapons anyway), more skill points, less DEX and more CON. I'm just pointing that out cuz you said leveling is slow. Well, it'll be slower for this guy!</div>"
    }
  ]
}