{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "951",
  "name": "Game of Thrones Challenge",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/game-of-thrones-challenge-t2354902.html",
  "author": "Pelagius",
  "avatar": "10753075_1529052830.jpg",
  "replies": 24,
  "posts": [
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "4:34 PM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">D&amp;D is not my only source of medievel fantasy narratives. I'm pretty sure this holds true for most of you. Whether you've read the books or just watched the series; or most likely have read and watched both, I'm sure none of you are strangers to this saga.<br/>\n<br/>\nInspired by the BG thread, here's a challenge: pick a character of your liking from Martin's A song of Ice and Fire saga and try to build a NWN character based on them. You can pick the show version of the character, the book version or even characters exclusive to each.<br/>\n<br/>\nI would start myself, but I'm still not confident enough on my builds to do so. However, if this thread takes off, I might post a character that I've been planning to use on a module I won't name yet.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:59 PM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's an intriguing idea Pelagius, but a couple of things come to mind. First, demonstrably, the paladin class is a no-go area. I would have said Brianna of Tarr could be a candidate, but charisma? 'Fraid not. Second, most of the \"best\" characters, in my opinion, wouldn't suit Neverwinter at all. Tyrion? Circe? Schemers and plotters do much better in strategy games.<br/>\n<br/>\nBut as I say, an intriguing idea. I'm assuming the leader of the White Walkers would be a PM. Would you have the Kaleesi as a summoner or shifter (playing a little loose, here)? An assassin or two for Mick to look at. But there would be an awful lot of straight up fighter-types and a very limited mage and cleric spread.<br/>\n<br/>\nMuch to think about, you have given us (from a different fantasy trope).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:18 PM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It is as Yoda said, I'm afraid.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "7:19 PM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Of course we should be looser on the exact translation from one universe to the other. Otherwise we'll get mostly, as you said, straigh human fighters and rogues and a couple of shapeshifters perhaps. I'm not gonna disclose just yet what I'm working on (I am, after all, allowed to give you guys a surprise, am I?), but here's a couple of ideas:<br/>\n<br/>\n-Tyrion: I would accept dwarf or -perhaps even better- halfling as a race. Should have levels on rogue or bard.<br/>\n-Daenerys: could be elf or half-elf to make for her heritage. Sorceress perhaps or conjurer/summoner<br/>\n-Jon Snow: Ranger, human, half-elf if you want<br/>\n-Ned Stark: There you have your paladin<br/>\n-Arya Stark: Rogue/Shadowdancer and perhaps a fighter as third class<br/>\n-The Mountain: Fighter/Barbarian/Blackguard?, would accept half-orc as race to showcase his huge size and how terrifying he is<br/>\n-The Hound: Fighter/CoT<br/>\n-Oberyn Martell: fighter/Rogue/Assassin<br/>\n-Thoros of Myr: Deffinitively a cleric, dude can even raise the dead<br/>\n<br/>\nYou get the idea<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:51 PM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nAn assassin  or two for Mick to look at. \n</div></blockquote>\nI have to admit that  I'm not that much into GoT. But I can always build you an assassin.<br/>\nJust give me the story.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "8:08 PM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote:</cite>\n<blockquote><div><cite>Stagmeister wrote:</cite>\nAn assassin  or two for Mick to look at. \n</div></blockquote>\nI have to admit that  I'm not that much into GoT. But I can always builds you an assassin.<br/>\nJust give me the story.\n</div></blockquote>\nThere's two (more if we count truly secondary characters) candidates to assasins:<br/>\n-Oberyn Martell is a highborn who is known to poison his weapons. His weapon of choice is a spear of sorts. He usually fights with light armor. He's kind of flamboyant and an hedonist.<br/>\n-Arya Stark: orphaned and stranged from her family she joins an order of shapeshifting assassins. She can impersonate people and is bent on revenge on those who killed her father. Her weapon of choice is a small sword that would be a rapier in nwn.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:12 PM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Daenerys could be a sorceress/rdd with summon \"dragon knight\" epic feat.<br/>\nThoros of My is a cleric alright with favorite spells \"darkfire\" &amp; \"raise dead\".<br/>\nJohn Snow is a ranger/fighter with a holy avenger type of sword. (Or a frostbrand if you like).<br/>\nTyrion is a pure rogue with very high intelligence. He has skill focuses in bluff &amp; taunt.<br/>\nOberyn Martell is a fighter/rog/wm with a spear &amp; a big mouth that got him killed.<br/>\nHodor is...err, Hodor. Ok, ok... straight fighter with eight intelligence &amp; epic toughness X.<br/>\nAnd Ned Stark is always dying, in every film. It's bad luck to make him.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:27 PM - Jun 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote:</cite>\n<blockquote><div><cite>Stagmeister wrote:</cite>\nAn assassin  or two for Mick to look at. \n</div></blockquote>\nI have to admit that  I'm not that much into GoT. But I can always builds you an assassin.<br/>\nJust give me the story.\n</div></blockquote>\nNow I'm not the greatest at this, and Pelagius has given his thoughts about my prime candidate, but I reckon Arya Stark would be an assassin/rogue - maybe with SD. The saga begins with her as about 10 years old, youngest daughter of a lord (Ned Stark). She is being instructed in how to be a \"lady\", but prefers her secret swordplay lessons with the court's fencing master. After travelling to the capital with her father, she then witnesses his execution (I'm rushing this, I know) and strives to get home to what remains of her family while undercover. Assorted mishaps happen en route, and, while travelling back with the Hound - a brutal killer, whom she goads, but also develops a bond with - she also witnesses her eldest brother and mother killed just as she hopes to be reunited with them. Further missteps and missed chances occur, and she finds herself on foreign shores with a school of assassins, wanting to learn the craft and avenge her family.<br/>\n<br/>\nI reckon that's a reasonable place to start.<br/>\n<br/>\nEDIT: Double-ninja'd!<br/>\n<br/>\nEDIT 2: Ned Stark still can't be a pally - he's no holy warrior, he's the king's best mate. I could buy CoT with him just about, but Fighter/WM would be his main classes, I suspect (after all, Kingslayer really wants to challenge him - albeit under unfair conditions - because of his martial prowess and legend). Talking of Pretty-Boy Lanister - design him as stumpy or not?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:53 AM - Jun 19, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Eddard Stark might not be a holy warrior in the literal sense but he could teach many paladins some lessons. And let's not ride into the weapon-master wagon here because that would leave us with no classes left to depict sir Barristan Selmy &amp; sir Arthur Dayne \"the sword of the morning\". ;)<br/>\n<br/>\nNo, most of them are simply warriors &amp; rogues and not \"optimized\" at all. If they were to be made in Neverwinter Nights then they should look somewhat like the old builds of ECB, era 04-06' or so, less specialized but more multi-talented. Throw lots of rogue in there for the skills &amp; sneak-attack, make less use of dump-stats, most importantly, have a good concept so that each one looks different from the others. The most experienced of them should have better AB than the others but no-one should be in excess of 40-42 AB. Keep that for the truly fearsome warriors like sir Barristan Selmy or sir Jorah Mormont.<br/>\n<br/>\nAnd I have an idea if you all agree, instead of starting yet another topic like the BG II NPC's one, we could concentrate our builds into one place called \"Role-playing builds\". If a moderator exists still then he could make us a \"sticky\" like the old one with the vanilla builds and we could put every good concept-build into that one. Those builds could be of use in role-playing heavy worlds were less emphasis in power-building is given, like AMIA or Arelith. Typically those PW's are low-to-medium magic as well, so it fits with the concept even better.<br/>\n<br/>\nI might try my hand in one of these characters once I have some free time, meanwhile, you can refer to gdl's old \"Valkyrie\" for a well-executed theme build.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build217045.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 17045.html</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:24 PM - Jun 19, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I did read up a bit on Arya Stark. What puzzles me is her bond with that (dire?) wolf and other animals. What is the nature of those abilities?<br/>\nI also wonder about her ability to impersonate other people and how to represent that in a build. Does she disguise herself, is there some kind of bluff involved, or is she a talented actor playing different roles? There are different ways of translating that to a build.<br/>\nI know that she kills with her tiny sword and poisons people. Are there other ways of killing people that she uses? Does she use traps? Is there any magic, eg. enchantment involved?<br/>\nMany things point in the direction of a dexterous and cunning rogue build. But that will not cover all of her talents.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:24 AM - Jun 20, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, in game terms Arya Stark was taught from the master of assassins. That guy is shown to be able to really do HiPS in at least one occasion. It is only natural that she \"graduated\" being able to do the same technique although she is still young to fully learn it exactly like he did. It is also already established that she is an assassin and that she poisons her weapons. The third part is that she is also shown to be able to hold her own against Brienne of Tarth in a mock battle and even produced a nifty trick with her dagger when the former tried to disarm her, passing it onto her other hand ready for a karmic strike. She did also kill the previous apprentice of the aforementioned master assassin and proved her worth to him. <br/>\n<br/>\nIt depends on how you interpret those things in deciding what her build could be. Some might say fighter/assassin/shadow-dancer is right but I, on the other hand, think that rogue/assassin/shadow-dancer is more appropriate for her. She does a lot of hiding in her early years and develops many rogue-like skills as well. She is definitely a dextrous type and she favours precision over brutal strength.<br/>\n<br/>\nHer bond with her dire wolf is severed early so she is not hanging with her anymore. Unless you count \"the hound\" (pun intended) as a pet...<br/>\n<br/>\nThe transformation part isn't natural (I know, you secretly wanted to make a cobold-commando shapeshifter out of her) but rather they use the carefully preserved skin of the faces of dead people to do these impersonations, along with some good acting.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:50 AM - Jun 20, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\nThe transformation part isn't natural (I know, you secretly wanted to make a cobold-commando shapeshifter out of her) but rather they use the carefully preserved skin of the faces of dead people to do these impersonations, along with some good acting.\n</div></blockquote>\nSo possibly bard rather than rogue?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "11:25 AM - Jun 20, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">To expand on what Valerfor said, and to add a couple notes:<br/>\n<br/>\nIn the books there's a lot of that it is not clearly explained, and every thorough explanation you'll come across is mostly fandom speculation. Chapters are also written from a character's perspective and Martin plays a lot with hearsay, misinformation and uncomplete facts. So:<br/>\n<br/>\nThe sons/daughters of Eddar Stark find a handful of baby dire-wolves, each of them take one as a pet and somehow form an unsplained and not well understood bond with them, dire-wolves being sort of magical beings in a low-magic setting (low magic at the beginning, eventually the magice lvels grows steadily).<br/>\n<br/>\nWhile it is never properly staed how, Arya sort of \"wears\" the skin of someone and through a level of acting that would go beyong mere impersonation can actually almos \"turn\" into someone else. This has no proper translation to NW, but the closest thing, at least in spirit, would be HiPS and having levels on shadowdancer.<br/>\n<br/>\nShe's very skilled with short or light blades, uses poisons or daggers mostly to kill people and a lot of deception. So assassin would be an option.<br/>\n<br/>\nI see her as a rogue/assasin/shadowdancer. I guess bard could work but I don't know enough about that class to properly say.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:56 PM - Jun 20, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I can try to make a build for Arya. I still don't understand her completely, but I'm getting closer.<br/>\nIf one can think of the bard class as something else than something you use to build an artist, then the class stands out as the only non lawful \"rogue\" class.  It is a class that has access to illusion end enchantment magic. It has the touch of magic without being a dedicated mage. <br/>\nIt can even summon a dire wolf if need be. It might fit the bill.<br/>\nDruid has the shapeshifting, but it is linked to some kind of unity with nature, and that seems a bit farfetched.<br/>\nArcane magic enables much of what you describe, but she is not a magician, is she? And definitely not a priest.<br/>\nSome of you feel that SD might fit well and represent some of her talents. It is still not quite clear to me how SD does that.<br/>\n<br/>\nSo I am left with Rogue, Bard, Assassin and Shadowdancer. <br/>\n<br/>\n@ Valerfor<br/>\nNo, I do not have a secret dream of making her a Kobold Commando. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /> <br/>\nBut it would be nice to find a fictional character that could fit that kind of build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:34 PM - Jun 20, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm quite tempted to suggest a Bard, Rogue, Assassin now. Leaving aside the nicely worded \"touch of magic\", she did join an actors' troupe for a time (admittedly while on an assassination mission), which also fits. I wonder whether our SD thoughts might be more driven by the instinct to bring something \"different\" to the build, because she's always in plain sight, even if sometimes camouflaged. She resists becoming faceless, finally reasserting her own identity - \"The girl is now No One.\": (reply) \"The girl is Arya Stark, and I am going home.\"<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:59 PM - Jun 20, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, she did fit the bill until she grew-up a little!<br/>\n<br/>\nIn a more serious note, the master-assassin is clearly shown the ability to HiPS in the first few seasons. Alright, you can't expect him to just \"vanish\" in thin air but you look at him and he just turns his back for a second, the next one he is already someone else! I guess this is as close we can come to D&amp;D HiPS in this very-low magic setting. Performing for the theatre might actually be just that, \"performing\" and rogues do have these skills in their repertoire, bluff, persuade, intimidate and so on. You already have the tools at your disposal to depict her, and even do a form of HiPS without shadow-dancer executing what is know as \"corner-sneaking\".<br/>\n<br/>\nIt is true that the level of magic keeps growing steadily but that is only as far as \"monsters\" are concerned because we are introduced slowly to things like giants and properly-sized dragons, the characters did not display any extraordinary abilities apart from the great druid, but he is almost an NPC at this point.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:13 AM - Jun 21, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Alright, it seems that Mick is going to do Arya, one way or another, so I am gonna wait for his build before I comment more on her. <br/>\n<br/>\nThe next question is, what I should attempt? If there is any interest, cast your votes ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:51 AM - Jun 21, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\nAlright, it seems that Mick is going to do Arya, one way or another, so I am gonna wait for his build before I comment more on her. <br/>\n<br/>\nThe next question is, what I should attempt? If there is any interest, cast your votes ;)\n</div></blockquote>\nMy first thought was Oberyn Martell, but Demos' excellent Spear Disciple (Monk 9/ Assassin 9/ WM 22) seems to pretty well cover him. Then either the Mountain or the Hound, but I think you yourself have provided ample potential candidates for them already. Brienne of Tarr or \"You know nothing,\" Jon Snow also come to mind, but they're a little one-dimensional for you, I suspect, so how about Beric Dondarrion? You might even squeeze some Pally in there!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "10:13 AM - Jun 21, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A side note on magic: As I said earlier, nothing on A Song of Ice and Fire is clearly stated and both the characters and the reader have to ponder whether something is true or false and specualte about the world and the events. It appears that magic has waned in the last thousands of years and that it is coming slowly but steadily at the beginning of the events of the saga. The return of the dragons, the white walkers and some wizards realizing that the cantrips they were able to perform are getting stronger seem all to be linked, although how or why still remains unknown.<br/>\n<br/>\nSo basically, we could use caster classes whiout really breaking much the original challenge.<br/>\n<br/>\nAnd I support Dondarrion being a pally, both for his personality (he still does some very questionable things) but at some point he's seem casting some sort of flame sword, which could be \"intperpreted\" as bless weapon or a similar spell.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:58 PM - Jun 21, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have made a draft for Arya. <br/>\nI did not min/max the stats, just tried to portray how she appears to me.<br/>\nI landed on letting Assassin- and SD supernatural abilities account for her special talents.<br/>\nI have chosen feats like Strong soul and Blind fight to match parts of her story. Expertise is from her martial training.<br/>\nHer special fighting style is represented by Weapon finesse, Expertise, Weapon focus, Dodge, Tumble, Defensive roll, Epic dodge and the concealment from her Improved invisibility. HIPS adds to that \"dance\".<br/>\nThe 13/26/1 level split have we seen before, but it is effective. I did try 10/25/5, but that was weaker.<br/>\nI am not quite sure where to go with the remaining skill points.<br/>\nFeel free to give me input on the build.<br/>\n<br/>\nRogue(13), Assassin(26), Shadowdancer(1), Human<br/>\nAlignment: CN and drifting towards NE/CE<br/>\n<br/>\nSTR: 10<br/>\nDEX: 16 (34)<br/>\nCON: 12<br/>\nWIS: 12<br/>\nINT: 14<br/>\nCHA: 12<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Rogue(1): Strong Soul, Expertise<br/>\n02: Rogue(2): {Evasion}<br/>\n03: Rogue(3): Weapon Finesse, {Uncanny Dodge I}<br/>\n04: Rogue(4): DEX+1, (DEX=17)<br/>\n05: Rogue(5)<br/>\n06: Rogue(6): Weapon Focus: Rapier<br/>\n07: Rogue(7)<br/>\n08: Rogue(8): DEX+1, (DEX=18)<br/>\n09: Assassin(1): Blind Fight<br/>\n10: Assassin(2)<br/>\n11: Assassin(3)<br/>\n12: Assassin(4): DEX+1, Improved Critical: Rapier, (DEX=19)<br/>\n13: Assassin(5)<br/>\n14: Assassin(6)<br/>\n15: Assassin(7): Dodge<br/>\n16: Assassin(8): DEX+1, (DEX=20)<br/>\n17: Rogue(9)<br/>\n18: Rogue(10): Mobility, Defensive Roll<br/>\n19: Rogue(11)<br/>\n20: Rogue(12): DEX+1, (DEX=21)<br/>\n21: Shadowdancer(1): Epic Weapon Focus: Rapier, {Hide in Plain Sight}<br/>\n22: Assassin(9)<br/>\n23: Assassin(10)<br/>\n24: Assassin(11): DEX+1, Great Dexterity I, (DEX=23)<br/>\n25: Assassin(12)<br/>\n26: Assassin(13)<br/>\n27: Assassin(14): Great Dexterity II, Great Dexterity III, (DEX=25)<br/>\n28: Assassin(15): DEX+1, (DEX=26)<br/>\n29: Assassin(16)<br/>\n30: Rogue(13): Epic Dodge, Improved Evasion<br/>\n31: Assassin(17)<br/>\n32: Assassin(18): DEX+1, Great Dexterity IV, (DEX=28)<br/>\n33: Assassin(19): Epic Prowess<br/>\n34: Assassin(20)<br/>\n35: Assassin(21)<br/>\n36: Assassin(22): DEX+1, Great Dexterity V, Great Dexterity VI, (DEX=31)<br/>\n37: Assassin(23)<br/>\n38: Assassin(24)<br/>\n39: Assassin(25): Great Dexterity VII, (DEX=32)<br/>\n40: Assassin(26): DEX+1, Great Dexterity VIII, (DEX=34)<br/>\n<br/>\nHitpoints: 282<br/>\nSkillpoints: 367<br/>\nBluff 43(44), Hide 43(55), Listen 43(44), Move Silently 43(55), Search 40(42), Tumble 40(52), UMD 32(33), remaining skillpoints 83<br/>\nSaving Throws (Fortitude/Will/Reflex): 18/18/36<br/>\nSaving Throw bonuses: Traps: +4, Poison: +13, Death: +1<br/>\nBAB: 25<br/>\nAB (max, naked): 41 (melee), 38 (ranged)<br/>\nAC (naked/mundane armor/shield only): 30/30<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:30 PM - Jun 21, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">She looks good to me, Mick, for what that's worth. The build also seems to track her progress through the saga accurately. Given that she's no trapsmith, and can't take animal empathy, maybe Persuade and Intimidate might work for the other skills?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:29 PM - Jun 21, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Mick, would you mind doing that ROG 10/ SD 5/ ASS 25 version for us?<br/>\n<br/>\nThanks,<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:06 PM - Jun 21, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\nMick, would you mind doing that ROG 10/ SD 5/ ASS 25 version for us?<br/>\n<br/>\nThanks,\n</div></blockquote>\nUnfortunately I did not save the CBC sheet when I experimented with that. I believe I went Ro 8, then As 8 at lvl 16, SD5 at lvl 21, As 15 at lvl 28, Ro 10 for ED at lvl 30, and then AS 25 at lvl 40. The saves were worse, the SA/DA was weaker and I lost an epic assassin feat which gave a lower dex.<br/>\nSo basically it took 4 more SD levels rather than 3 rogue levels to get Defensive roll. That cost me the 26th assassin level and a bonus feat.<br/>\n<br/>\nEdit: I believe Rogue 13/ Assassin 22/ SD 5 would make it possible to take the same amount of feats and get the same number of Great dexterity feats. You take ED as a rogue bonus feat and an extra Great dexterity on a general feat. But the DA DC would suffer.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:57 PM - Jul 01, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So has anybody builds for other GoT characters?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:06 PM - Jul 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote:</cite>\nSo has anybody builds for other GoT characters?\n</div></blockquote>\n\nAt the moment, that would appear to be a resounding \"nope\".<br/>\n<br/>\nIt seems a bit unfair that someone who knows less about the series than others has been the only one to offer up a build, so I'll try to come up with something for one of the more \"simple\" characters.<br/>\n<br/>\nTBC...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}