{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "404",
  "name": "Sorceror/Paladin/Blackguard",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/sorceror-paladin-blackguard-t2303873.html",
  "author": "10235387",
  "avatar": "10235244_1510287070.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "10235387",
      "avatar": "no_avatar.png",
      "timestamp": "5:33 PM - Dec 19, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I got the idea for this build while researching other builds - there are a few that put Pal/BG together for the Divine Grace/Dark Blessing stack, but I only found one that combines them with Sorceror <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build262838.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 62838.html</a> - that build (Sor 37/BG 2/Pal 1), however, is almost exclusively caster with the other classes there for the saves bump and takes the last warrior level as a skills dump in the late 30s.<br/>\n<br/>\nI'm focusing on more melee - the idea is either Sor 36/Pal 2/BG 2 or Sor 34/Pal 4/BG 2 or Sor 34/Pal 2/BG 4.  I dislike playing evil characters so with my current character (Sor 8/Pal 2/BG 2) I'm going through the OC and after having gotten the 2nd BG level, am now doing good things to try and get him back to LG by level 18.  <br/>\n<br/>\nMy \"role play\" started him as a Sorceror who got called to Holy Orders after level 3, but after level 5 suffered a mental break after his encounter with the Intellect Devourer in the prison and started committing evil acts (primarily intimidating commoners out of money).  Word got to his superiors, who suspended his Holy Orders so he fell back into sorcery, but his mental state was so bad that at level 11 he became a foul Blackguard.  In his 12th level, constant exposure to Neurik's anti-lycanthropy charms cures his mental condition and he starts on the rocky road to redemption.<br/>\n<br/>\nSo far in the OC, he is encountering NO resistance, which is surprising because I generally have trouble playing Sor/Wiz at low-levels (I solo and never use henchies).  I took the 4 warrior levels pre-epic so that he'd get 3 apr.  Right now, with sword/board and Still Spell for buffs, he just mows through each area.  <br/>\n<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tThe encounter in the Tomb in level 2 is almost always tough for me regardless of character, but this dude buffs, lobs a couple of Stilled Fireballs to soften up the screening monsters, then Stilled Ghostly Visage, potion of speed, Flame Weapon and KD the boss into submission.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nRight now, he's level 12 (Sor 8/Pal 2/BG 2 - I'm looking to get him to level 40.  I never do PvP so I'm interested in how he could be made into a good duelist.  Human only, and would like your thoughts on 34 or 36 Sor - I was debating two Pal or BG levels in epic to get DM/DS, but not wedded to it.  BG 4 gets sneak, but again I'm not into playing a lot of evil levels.  Also - to use a Holy Avenger, does the character have to be LG or just have Pal levels?<br/>\n<br/>\nHe's definitely a sword and boarder - I focused on longsword so that if I rebuild him for SOU, he can get the special weapon there.<br/>\n<br/>\nI don't want to waste the Sor levels, either.  I envision him dropping a Bigby's on a baddie, then coming in a finishing them off with the blade, calling in IGMS when the Devastating Kukri Master shows up, etc.<br/>\n<br/>\nRight now, his base stats are:<br/>\n<br/>\nSTR 14<br/>\nDEX 10<br/>\nCON 14<br/>\nINT 10<br/>\nWIS 12<br/>\nCHA 16 (19 at level 12)<br/>\n<br/>\nI pump Concentration and Spellcraft, except for 10 points to meet the BG Hide requirement.<br/>\n<br/>\nCurrent feats are Armor (all), Aura of Courage, BG Bull's, Cleave, Courteous Mageocracy, Dark Blessing, Divine Grace, Divine Health, KD, Lay on Hands, PA, Shield prof, Smite (both), Still Spell, Use Poison, WF - longsword, Weapon Prof (martial and simple)<br/>\n<br/>\nCurrent spells are <br/>\nLVL 1 - Mage Armor, Magic Weapon, Prot. from Align, Endure Ele, Identify<br/>\nLVL 2 - Gostly Visage, Cat's Grace, Flame Weapon<br/>\nLVL 3 - GMW, Fireball<br/>\nLVL 4 - Imp. Inv.<br/>\n<br/>\nAgain, I don't play on a server but trying to build a guy that would be good PVP.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:50 PM - Apr 22, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You can go Sorcerer 35 Bg 2 Pal 3 and get Divine Shield to add that sweet CHA bonus to your AC. There's still time!<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "10235387",
      "avatar": "no_avatar.png",
      "timestamp": "6:21 PM - Apr 23, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong>You can go Sorcerer 35 Bg 2 Pal 3 and get Divine Shield to add that sweet CHA bonus to your AC. There's still time!<br/>\n<br/>\nTake it EZ!</div></blockquote>\n\nWhat if I did Sor 34 BG2 Pal 4 - could I get DM along with DS if I levelled as a Pal at the right spots?  Would also need to work in Extra Turning somewhere?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:53 AM - Apr 24, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">No need for extra turning, you already have a high CHA score. The number of TU attempts is CHA modifier +3 so if you have 30 CHA (which you should), you have 13 TU attempts.<br/>\n<br/>\nWHY would a spellcaster want to do divine damage on PHYSICAL ATTACKS? Just for Tenser's use? Honestly, I would advise against that. You are a caster, you kill stuff with spells, that's what you should be good at. Sorcerer 35 gives you an Epic Bonus Feat, which can be used to get many good spellcasting feats (Great CHA, Epic Spells, Epic Spell Focus, etc..).<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}