{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "008",
  "name": "Brew Potion, Craft Harper Item, Craft Wand, Scribe Scroll feats: An in-depth guide",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/brew-potion-craft-harper-item-craft-wand-scribe-sc-t2355097.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "5",
  "views": "3.8K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:49 AM - Jul 08, 2019",
      "content": "<div><strong><span style=\"font-size:175%;line-height:normal\">Brew Potion, Craft Harper Item, Craft Wand, Scribe Scroll feats: An in-depth guide</span></strong><br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201907/10759084_ac127800a5056ad6ad86613c3f9a245e.jpg\"/><span style=\"font-size:50%;line-height:normal\">Source: <a class=\"postlink\" href=\"https://www.pinterest.com.au/pin/675891856546006243/\" rel=\"noreferrer\" target=\"_blank\">https://www.pinterest.com.au/pin/675891856546006243/</a></span><br/>\n<br/>\nHi all,<br/>\n<br/>\nI haven't encountered a practical guide to these craft magic feats, so I thought I would start one, based on all the information I can gather from this forum (and elsewhere) for the purpose of assisting builders and also my own education.<br/>\n<br/>\nI enjoy researching and looking up what others have written. At present I do not have extensive experience using these feats (apart from a little Scribe Scroll from playing Druid) and I am only beginning to learn the caster classes, so I would value others with this experience playing spell-casters to comment on this post, agree or disagree, add something know, let us know if there is anything I have missed. <br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">General comments about crafted magic</span></strong><br/>\nFirstly <span style=\"text-decoration:underline\"><strong>I would not recommend taking Brew Potion, Craft Wand or Scribe Scroll in the Original Campaign or Shadows of Undrentide</strong></span>. This is because the base item to craft such magic (Magic Potion Bottle, Bone Wand, Blank Scroll) is either unavailable, or difficult to obtain (in the case of the Bone Wand, the Wiki states it could be crafted from bones found from skeletal enemies with a modified craft weapon skill of 6 but I cannot confirm this).<br/>\n<br/>\nPotions and wands activate their buffs and abilities much faster than scrolls. Testing it out in game, its about 5 times faster. Wands cast their abilities the fastest. Scrolls have the advantage of not having spell level restrictions. Brew potion is restricted to all spells between Cantrips to level 3. Craft wand is restricted to all spells between Cantrips to level 4. <br/>\n<br/>\nThe usual Bioware script will not take into account the caster level of the individual doing the crafting when determining the strength of the spell casted by the item. Therefore any item that is made will have a preset caster level whether the creator has a caster level of level 3 or level 40. This is changed in certain modules such as World of Greyhawk to make the creator's caster level correlate to the caster level of the magic item (ie wand) in question. The caster level of the crafter will affect the number of charges placed on wands up to a maximum of 50, unless specifically overridden (as in WoG). I would recommend checking the Wiki or the Module/Persistent World regarding specifics before taking on any of the craft magic feats in character builds.<br/>\n<br/>\nKailPendragon's has posted on The_Krit's 'Craft Magic' fixes in response to these limitations. The_Krit created two fixes. One to address the issue that certain spells (such as Storm of Vengeance or Shapechange) could never be scribed onto scrolls. The other to address the issue of creator caster levels not correlating with the caster level of the potion/wand/scroll created, and to provide a scaling mechanism for module creators. If you are a module creator and wish to apply such 'fixes' to your modules, visit <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=16&amp;t=515387\" rel=\"noreferrer\" target=\"_blank\">viewtopic.php?f=16&amp;t=515387</a> to read Kail's post and to get more information.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\"><span style=\"text-decoration:underline\">Brew Potion</span></span></strong><br/>\n<strong>The Basics</strong><br/>\nPrerequisite: spellcaster level 3+ <br/>\n<br/>\nThe character can create a potion of any spell of third level or lower that the character knows and that targets a single creature. The spell must not bring harm to its target. <br/>\n<br/>\nThe caster will require a magic potion bottle. Such bottles do not exist in the NWN Original and Shadows of Undrentide campaigns, but do exist in HoTU. <br/>\n<br/>\nBrewing a potion costs a small amount of XP and some gold. The cost for brewing a potion depends on the innate level of the spell as well as the caster level of the resulting potion. These values are set by the game, and outlined in the Brew Potion Costs table in the NWN Wiki.<br/>\n<br/>\nThe usefulness of the Brew Potion feat is higher if access to potions is limited (or non-existent) AND there is excellent access to Magic Potion Bottles. The reality is most modules provide very easy access to potions of different varieties from shopkeepers with at least comparable access to Magic Potion Bottles. Therefore it is arguable this feat is situational to the module being played. Situations in which the player's access may be restricted to potions are from deliberate design by the creators (the rationale being 'lots of health potions' is not the way to win fights and to encourage strategy - ie kill the enemy spellcasters first and targeting enemy weaknesses such as weak saves) or incidental, for example there was a situation on the World of Greyhawk servers in 2012 where all the healing potions were purchased possibly due to popularity of the server and players have overpurchased the limited stock potions from vendors.<br/>\n<br/>\nFor more info on the technical aspects of the Brew Potion feat, visit <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Brew_potion\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Brew_potion</a><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Practical usage of Brew Potion</span></strong><br/>\n<strong>Spell usage beyond the spells/day limit</strong><br/>\nAllows casters to create buffs (such as Barkskin, Bull's Strength, Haste, Invisibility), put them into potions, and to use them as required, saving valuable spell slots for combat. This is particularly important if there are resting restrictions, or characters are adventuring in areas with limited or no resting capacity.<br/>\n<br/>\n<strong>Party play</strong><br/>\nAllows teammates, particularly those without spellcasting abilities or UMD, to use buffs. This is in contrast to scrolls and wands which have class restrictions or require the Use Magical Device (UMD) skill. <br/>\n<br/>\n<strong>Access to stronger potions, if the module uses the standard Bioware script</strong><br/>\nA standard Bull's Strength potion has a caster level of 3, whereas a crafted potion using the standard Bioware script has a caster level of 15. The standard potion would last for 3 hours, whereas a crafted potion would last for 15 hours (5 times as long). In theory a Level 3 wizard can therefore craft potions which cast Level 15 Bull's Strength on the user. In reality such potions are extremely expensive (1500gp) for level 3 characters, and such crafting would probably rarely occur unless for some reason that character was excessively loaded with money.<br/>\n<br/>\nNotable spells which when crafted into potions, have a caster level 12 or 15, include Animate Dead, Barkskin, Blade thirst, Bull's Strength, Cat's Grace, Clairaudience/clairvoyance, Cure serious wounds, Eagle's Splendor, Fox's cunning, Ghostly visage, Negative energy protection and Owl's Wisdom. Such spells should be considered excellent candidates for potion creation.<br/>\n<br/>\nIt is recommended checking if the module uses the standard Bioware script or uses a custom script such as The_Krit's script which takes into account the creator's caster level when crafting magic. <br/>\n<br/>\n<strong>Polymorph builds (Druid/Shifter)</strong><br/>\nPolymorphs cannot use scrolls or wands but can drink potions. If buffs are dispelled during combat, potions are a way to rebuff without leaving polymorph form. As discussed such crafted potions are often stronger than those purchased in stores. The ECB has a number of polymorph builds which use this feat:<br/>\n<br/>\nWhiZard's Draco Stunner (Druid 12/Shifter 22/Fighter 6) <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=8&amp;t=2328975\" rel=\"noreferrer\" target=\"_blank\">viewtopic.php?f=8&amp;t=2328975</a><br/>\nGrimnir's (Monk 25/Druid 5/Shifter 10) <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=11&amp;t=2354812&amp;p=11299\" rel=\"noreferrer\" target=\"_blank\">viewtopic.php?f=11&amp;t=2354812&amp;p=11299</a><br/>\n<br/>\n<strong>Characters being able to 'self remove' fear when afflicted by fear, with crafted Remove Fear potions</strong><br/>\nHipMaestro has commented characters afflicted by fear, can drink crafted potions of Remove Fear, to remove the fear effect. This is in contrast to scrolls, wands and spells, which are unable to be used. <br/>\n<br/>\n<strong>For laughs about the Brew Potion and Craft Wand feats:</strong><br/>\nMick Dagger's The Epic Scholar (Bard 1/ Wizard 39), an April Fools Day build (please note this is not a serious build) <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=8&amp;t=2326949\" rel=\"noreferrer\" target=\"_blank\">viewtopic.php?f=8&amp;t=2326949</a><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\"><span style=\"text-decoration:underline\">Craft Harper Item feat</span></span></strong><br/>\n<strong>The basics:</strong><br/>\nPrerequisite: Harper scout 5<br/>\n<br/>\nThis is different to the Brew Potion feat but is relevant to builders so I have included it here. <br/>\n<br/>\nAt level 5, once per day a Harper Scout may make a magical potion using this feat. The Scout chooses between either a Cat's Grace or Eagle's Splendor potion. The cost is only 5 exp and 60 gold to craft. This is in contrast with the 60 exp and 1500 gold for other classes with Brew Potion. The downside is such Harper crafted potions only are standard potions with a caster level of 3, and therefore inferior to those made with Brew Potion which will last five times as long, and be more difficult to dispel. <br/>\n<br/>\nIt should be noted the Harper Scout's Cat's Grace and Eagle Splendor feats, similar to the Blackguard's Bull's Strength feat, will stack with other sources of Cat's Grace and Eagle's Splendor. The potions made by the Harper Scout will stack with the Harper Scout's corresponding feats, but not other sources of these spells. For example a Harper Scout Cat's Grace feat will stack with a Craft Harper Item Cat's Grace potion OR a Wizard's Cat's Grace spell, but a Craft Harper Item Cat's Grace Potion will not stack with a Wizard's Cat's Grace spell.<br/>\n<br/>\n<em>Sample build using this feat:</em><br/>\nHipRedux's Wulgar Ironbow (Fighter 16/Dwarven Defender 19/Harper Scout 5) <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=8&amp;t=2354617\" rel=\"noreferrer\" target=\"_blank\">viewtopic.php?f=8&amp;t=2354617</a><br/>\n<br/>\n<em>Discussion about the Harper Scout class: </em><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=10&amp;t=2354639\" rel=\"noreferrer\" target=\"_blank\">viewtopic.php?f=10&amp;t=2354639</a><br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\"><span style=\"text-decoration:underline\">Craft Wand</span></span></strong><br/>\n<strong>The Basics</strong><br/>\nPrerequisite: spellcaster level 5+<br/>\n<br/>\nThe spellcaster can create a wand of any spell of fourth level or lower that he knows. <br/>\n<br/>\nCrafting a wand requires having a bone wand, and casting the relevant spell onto that wand. Certain spells, such as Expedious Retreat and True Strike, cannot be crafted into wands without a specific override in the module.<br/>\n<br/>\nThe wiki suggests bone wands are available in Hordes of the Underdark but not directly available in the Original Campaign or Shadows of Undrentide. The Wiki states bone wands could be craftable from bones dropped by skeletal creatures in these modules with a modified craft weapon skill of 6. I cannot confirm this just yet.<br/>\n<br/>\nWand usage is restricted to the type of caster creating the wand. An arcane caster creating a wand can only be used by casters of the same type that normally cast that spell, such as Bards, Wizards and Sorcerers. A divine caster creating a wand can only be used by clerics, druids, paladins and/or rangers depending on the spell involved. Certain modules and persistent worlds will restrict this even further.<br/>\n<br/>\nCrafting a wand costs a small amount of XP and gold. A newly created wand has 1d20 + 1 charge per level of the character caster (up to a maximum of 50 charges). The cost for crafting a wand is listed in detail in the NWN Wiki.<br/>\n<br/>\nFor more info: <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Craft_wand\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Craft_wand</a><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Practical usage of Craft Wand</span></strong><br/>\n<strong>Lots of low level spell casts, very quickly - converting one spell cast into up to 50 spell casts</strong><br/>\nCraft Wand allows a spell caster to convert a single spell from between Cantrip to level 4, into a wand able to cast that spell with 1d20 +caster level (up to 50) charges. So a level 20 wizard casting Isaac's lesser missile storm onto a wand, will use one spell, and get 21-40 charges on the wand. Only one charge is used per cast on the wand. So this grants 21-40 spells from 1 spell. This is super good. Certain modules such as WoG enhance this further by setting the default charges to 50. So one spell cast can turn into 50 casts on a wand. If a caster spams certain spells (such as Call Lightning, ILMS, Hammer of the Gods etc...) this feat should be strongly considered to help the spell caster continue casting in battle even when one runs out of prepared spells/day.<br/>\n<br/>\nThis is in contrast with Scribe Scroll and Brew Potion, which has a 1 to 1 ratio. So a single spell cast onto a scroll will grant a single spell cast, or a single spell cast into a potion bottle will grant a single spell buff. But a wand created by a single spell cast will provide up to 50 casts of that same spell. Craft Wand is extremely popular with casters from all the builds I have read and I believe it is due to this reason.<br/>\n<br/>\n<strong>Fast casting </strong><br/>\nWands activate their abilities very quickly, even faster than potions. Being able to quickly summon a creature IV, use Dismissal against enemy summons or use improved invisibility is highly valuble in such situations.<br/>\n<br/>\n<strong>Spell usage beyond the spells/day limit</strong><br/>\nAllows casters to cast extra spells without using up valuable spell slots. This is particularly important if there are resting restrictions, or you are in areas with limited resting capacity. <br/>\n<br/>\n<strong>Low caster levels</strong><br/>\nIf a caster has low caster levels (ie Wizard 13, for example), this can also allow the spell caster to cast additional spells including buffs with wand usage, saving spells/day, which will be limited. <br/>\n<br/>\n<strong>Access to additional spells usually unavailable to you, as a charisma-based arcane spell casters, </strong><br/>\nI wish to credited this to conlaoch (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=8&amp;t=2344104\" rel=\"noreferrer\" target=\"_blank\">viewtopic.php?f=8&amp;t=2344104</a>). In his post he commented that if you take certain arcane spells at certain levels, craft the number of wands that you want, then switch your spells at your next level, you can have access to a number of spells that you normally will not have access to. For example if a sorcerer take Ghostly Visage, craft 20 ghostly visage wands each being able to cast 30 spells, then remove it from his spell list when he levels up, that sorcerer will still have access to 600 caster level 15 ghostly visage spells but he will also free up your spell book for something else.<br/>\n<br/>\n<strong>Rebuffing after getting dispelled</strong><br/>\nIf your character has low caster levels, you should expect to have your buffs dispelled. Wands can help manage this issue. <br/>\n<br/>\n<strong>Teamwork with other spell-casters, rogues and bards with UMD</strong><br/>\nIn parties with other spell-casters, rogues and bards with UMD, a crafted wand can be given to your teammates, allowing them to cast such spells in combat.<br/>\n<br/>\n<strong>Crafting wands rather than scrolls, when scrolls are inferior</strong><br/>\nThe wiki has a list of spells which when crafted into a wand are superior when compared to being crafted into a scroll. <br/>\n<br/>\nNotable examples include (with the scroll caster level in brackets): Barkskin (3), Bull's Strength (3), Call lightning (5), Cat's grace (3), Animate undead (5), Cure serious wounds (5), Dismissal (7), Eagle's splendor (3), Elemental shield (7), Flame arrow (5), Ghostly visage (3), Hammer of the gods (7), Haste (5), Fox's Cunning (3), Owl's Wisdom (3), Ultravision (3). See the next section for a comparison of caster levels provided by wands.<br/>\n<br/>\nFor more details, note the table on <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Scribe_scroll\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Scribe_scroll</a><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">What spells are useful to craft into wands?</span></strong><br/>\nI am sure others have more experience on this topic. To be comprehensive I have looked through the list of spells that are craftable into wands, and selected a number of spells that appear to be great candidates to craft into a wand. Remember each wand provides up to 50 castings of that spell. This makes craft wand extremely attractive to spell casters.<br/>\n<br/>\n<strong>Buffs (note these are not immune to dispelling):</strong><br/>\n- Bull's Strength/Cat's Grace/Eagle's Splendor/Owl's Wisdom/Fox's Cunning (Caster level 15 - lasts for 15 hours)<br/>\n- Barkskin (Caster level 12 - lasts for 12 hours)<br/>\n- Elemental shield (Caster level 12) and/or Protection from Elements (Lasts 24 hours, caster level 10)<br/>\n- Haste (Caster level 10 - 10 rounds)<br/>\n- Stoneskin (Caster level 7 - DR 10/+5 absorb 70 damage, not that much weaker than DR 10/+5 absorb 100 which is maximal power, lasts 7 hours)<br/>\n- Freedom of movement / Death Ward (Caster level 7)<br/>\n- Improved Invisibility (Caster level 7)<br/>\n- Ultravision (Caster level 6)<br/>\n- Darkfire (Caster level 5)<br/>\n- Keen Edge (Caster level 5)<br/>\n- Magic circle against alignment (Caster level 5) or Protection against alignment (Caster level 2)<br/>\n- Shield (Caster level 5) for protection against magic missiles<br/>\n- Clarity (Caster level 3) - there are potions which do the same thing<br/>\n<br/>\n<strong>Offensive spells (note spell resistance may need to be overcome):</strong><br/>\n- Call lightning (Caster level 10 - maximum power)<br/>\n- Hammer of the gods (Caster level 20 - maximum power)<br/>\n- Flame arrow (Caster level 18)<br/>\n- Dismissal (Caster level 18, +6 DC to will save difficulty)<br/>\n- Isaac's Lesser Missile Storm (Caster level 13 - maximum power)<br/>\n- Lesser spell breach (Caster level 7, no saves, ignores spell resistance and lowers spell resistance)<br/>\n<br/>\n<strong>Summons, utility, healing and restorative spells:</strong><br/>\n- Animate dead (Caster level 15) and Summon creature IV (Caster level 7)<br/>\n- Knock and Find traps<br/>\n- Lesser restoration, Restoration, Neutralize poison, Remove Curse, Remove Disease, Cure Critical / Serious Wounds<br/>\n<br/>\n<em>Further reading on Craft wand</em><br/>\nMaximillian Kane's Dwarven Holy Wall (Cleric 15 / Dwarven Defender 22 / Rogue 3) - <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=8&amp;t=2354377\" rel=\"noreferrer\" target=\"_blank\">viewtopic.php?f=8&amp;t=2354377</a><br/>\nDraconic Arcanist (Wizard 26 / Bard 4 / RDD 10) - <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=8&amp;t=2344104&amp;p=5255\" rel=\"noreferrer\" target=\"_blank\">viewtopic.php?f=8&amp;t=2344104&amp;p=5255</a><br/>\n<br/>\n<br/>\n<strong><span style=\"text-decoration:underline\"><span style=\"font-size:150%;line-height:normal\">Scribe scroll</span></span></strong><br/>\n<strong>The basics:</strong><br/>\nPrerequisite: spellcaster level 1<br/>\n<br/>\nThe character can create a scroll of any spell that he or she knows. Costs a small amount of gold and exp. This feat is given for free to Wizards at level 1.<br/>\n<br/>\nIt requires a blank scroll and the spell in question to be cast onto the scroll. Blank scrolls were introduced in Hordes of the Underdark. Therefore blank scrolls will not be available in the original campaign and Shadows of Undrentide, making this feat useless in these campaigns.<br/>\n<br/>\nDespite the description, certain spells by default cannot be scribed onto scrolls and require a particular fix to make this possible. These spells include amplify, aura vs. alignment, blade thirst, dirge, fire storm, healing circle, invisibility purge, shades, shapechange, storm of vengeance, undeath to death, vine mine and war cry. A fix was created for module builders by The_Krit as mentioned earlier in this article.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201907/10759084_b59526d85212a1794b1a0abd6bd23c6c.jpg\"/><br/>\n<em><strong>Unable to scribe SoV: </strong>In this screenshot, I attempt to demonstrate the in-game bug which prevents creation of Storm of Vengeance scrolls. My level 21 druid is tries to create a Storm of Vengeance scroll. Despite having two further preparations of the spell available, he cannot create the scroll in question as it is 'faded out' (similar to Summon Creature IX and Heal - but they have no further preparations available, whilst SoV does). Clicking does not help. He can however create a Premonition scroll, Finger of Death scroll and Summon Creature VIII scroll (they are not faded out) as there are preparations of those spell available.</em><br/>\n<br/>\nScrolls that are crafted use a default caster level as outlined in the NWN Wiki. Some modules will override this to try to allow caster levels and the scrolls scribed to 'scale'.<br/>\n<br/>\nFor further information: <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Scribe_scroll\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Scribe_scroll</a><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Practical usage of scribe scroll</span></strong><br/>\n<strong>The best spells to be scribed onto scrolls are those which are not especially reliant on caster levels for effectiveness</strong><br/>\nThese are usually spells that are: <br/>\n- instantaneous<br/>\n- have fixed effectiveness regardless of caster level <br/>\n- have fixed durations regardless of caster level, or when scribed have reasonable caster levels to provide a reasonable duration<br/>\n<br/>\nI have reviewed the entire list of spells in the Wiki and identified a number of good candidates for spells to put on scrolls. <br/>\n<br/>\nSome of the readers of this forum will have much more experience with this function than I do, and as such I would encourage their input. <br/>\n<br/>\nI am sure a number of these scrolls could be purchased quite easily in most modules. Probably the harder spells to access on scrolls will be level 8 and 9 spells. <br/>\n<br/>\n<strong>Spells which are effective and ignore spell resistance  </strong><br/>\n<strong>Offensive spells</strong><br/>\nBigby's clenched fist/crushing hand/forceful hand/grasping hand/interposing hand, close to level 20 caster level (perhaps not as useful at level 40?)<br/>\nCrumble (penetrates spell resistance with no save!)<br/>\nGreater spell breach<br/>\nMordenkainen's disjunction (caster level 17)<br/>\nNature's balance<br/>\n<br/>\n<strong>Summons</strong><br/>\nElemental swarm<br/>\nGreater planar binding<br/>\nGate<br/>\nPlanar ally<br/>\nPlanar binding<br/>\nSummon creature VII, VIII, IX<br/>\n<br/>\n<strong>Buffs (being dispelled will still be important and relevant)</strong><br/>\nDeath ward<br/>\nEndure elements / Resist elements / Protection from elements (fixed 24 hr duration)<br/>\nFlame weapon (level 17 - lasts 36 turns, maximal damage)<br/>\nFreedom of movement<br/>\nGreater spell mantle (17 rounds)<br/>\nGreater stoneskin (11 hours)<br/>\nGlobe of invulnerability (lasts 11 rounds)<br/>\nHoly sword (lasts 17 rounds, paladin only)<br/>\nImproved invisibility (lasts 7 rounds)<br/>\nKeen edge (lasts 170 minutes)<br/>\nLesser mind blank / Mind blank<br/>\nMagic circle against alignment<br/>\nMass haste<br/>\nMestil's acid sheath<br/>\nPremonition<br/>\nProtection from alignment<br/>\nProtection from spells (+8 to saves vs spells, 13 turns, 3 allies)<br/>\nShadow shield (13 turns)<br/>\nShapechange (17 turns)<br/>\nShadow conjuration<br/>\nShield<br/>\nSpell mantle<br/>\nTrue seeing (9 turns)<br/>\nUndeath's eternal foe<br/>\n<br/>\n<strong>Utility</strong><br/>\nClarity (to cast on summons or allies)<br/>\nExpeditious retreat<br/>\nFind traps<br/>\nGreater sanctuary (18 turn duration, no saves, no spell resistance)<br/>\nGust of wind<br/>\nKnock<br/>\nLegend lore (+12 to lore for 5 turns)<br/>\nMass camouflage (+10 to hide)<br/>\nOne with the land (+4 set trap)<br/>\nTime stop<br/>\n<br/>\n<strong>Healing / restoration</strong><br/>\nLesser restoration / Restoration / Greater restoration<br/>\nHeal<br/>\nMass heal<br/>\nMonstrous regeneration<br/>\nNeutralize poison<br/>\nRegenerate<br/>\nRemove blindness/deafness<br/>\nRemove curse<br/>\nRemove disease<br/>\nRemove fear<br/>\nRemove paralysis<br/>\nResurrection<br/>\nStone to flesh<br/>\n<br/>\n<strong>Offensive spells which appear useful but will need to manage the opponent's spell resistance (due to mid to high teen caster levels on the spell crafted into the scroll)</strong><br/>\nDestruction  <br/>\nDismissal <br/>\nDrown <br/>\nEnergy drain <br/>\nEnervation <br/>\nFinger of death <br/>\nFlesh to stone <br/>\nHarm <br/>\nImplosion <br/>\nIsaac's greater missile storm <br/>\nIsaac's lesser missile storm <br/>\nMeteor swarm <br/>\nPower word, Kill / Power Word, Stun <br/>\nSlay living <br/>\nStonehold <br/>\nSunburst <br/>\nUndead to death<br/>\nWeird <br/>\nWord of faith <br/>\nWail of the banshee<br/>\n<br/>\n<strong>Using Scribe Scroll with unused spells before resting</strong><br/>\nThis is a pretty basic strategy. A caster carries a bunch of blank scrolls and needs to rest. That caster has left over spells. Before resting some or all of the left over spells the caster finds useful, are scribed as scrolls. For example, a Cleric has 2 casts of Heal left over but needs to rest to continue fighting. These Heal spells are scribed onto scrolls before resting, making the cleric have these spells available to him/her on scrolls when returning from rest in addition to the usual memorized spells.<br/>\n<br/>\n<strong>Party play</strong><br/>\nOther spell-casters and Rogues/Bards with UMD can use your scrolls to help with spell casting during combat.<br/>\n<br/>\n<strong>My experience playing Druid, with the Scribe Scroll feat</strong><br/>\nI have played a bit of Druid with the Scribe Scroll feat. Things I have found useful:<br/>\n<br/>\n- The Heal spell. I can stockpile for example 30-50 heal scrolls and use them whenever I wish, saving my spell slots for other abilities. In environment where healing is limited (such as World of Greyhawk) such stockpiling puts one at a significant advantage to other players who do not have access to this. 30-50 heal scrolls is equivalent to 7500 to 12500 hp worth of healing, if each heal spell is worth 250hp.<br/>\n- The Summon creature IX spell. Having a supply of summons is great as such summon can draw attention away from me as a spell caster, whilst I prepare other abilities/spells/strategies<br/>\n- Greater Stoneskin and Premonition spells. By having a reliable supply of these on scrolls I can always have access to Damage Reduction +5/20 or +5/30 and hopefully keep my character alive if he/she finds the buff has run out or has been dispelled/breached.<br/>\n- Protection against Elements scrolls. Such scrolls can also be purchased from vendors and are cheap, but being able to scribe them (as I don't have access to Craft Wand, which would be superior) is nice. The duration is fixed at 24 hours regardless of caster level. There is no real reason to memorise this spell unless a player is ridiculously thrifty (like I am) and leave a cast or two in my list to minimise consumable usage. The damage able to be absorbed is low (40) so the ability to recast with scrolls or wands is valuable.<br/>\n- Lesser restoration / Remove Disease / Neutralize Potion scrolls. Such scrolls never fail and provide access to the spells whilst freeing up spell slots. These can be purchased from vendors but being able to scribe them is also nice.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Taking all three feats and playing as a Crafter / Merchant</span></strong><br/>\nThanks for Valerfor's comment. I thought I would add this to the main post.<br/>\n<blockquote><div><strong>Valerfor:</strong><br/>\nYour main use of [taking all three craft magic feats] are the \"crafter PCs\" in PWs. <br/>\n<br/>\nYou make one character that is a crafter &amp; provides with valuable potions, scrolls &amp; wands entire parties. <br/>\n<br/>\nMany of us role-play them as merchants &amp; they certainly are welcomed wherever they go!</div></blockquote>\n<strong>Finally</strong><br/>\nHope you have enjoyed this read and it helps with building your characters. As mentioned I couldn't find a guide on this topic so I believe I have added to what is already available to builders. Appreciate if there are any spellcasters out there who have any comments to add from practical experience. <br/>\n<br/>\n<em><span style=\"font-size:75%;line-height:normal\">Edits: added picture, minor grammar/spelling fixes to make the text clearer, added screenshot demonstrating the game 'bug' not allowing SoV scrolls to be casted with accompanying text, added Valerfor's comment to the text</span></em></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:32 PM - Jul 09, 2019",
      "content": "<div>Your main use of this (all three of them) are the \"crafter PCs\" in PWs. <br/>\n<br/>\nYou make one character that is a crafter &amp; provides with valuable potions, scrolls &amp; wands entire parties. <br/>\n<br/>\nMany of us role-play them as merchants &amp; they certainly are welcomed wherever they go!</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:07 AM - Jul 14, 2020",
      "content": "<div><strong>An arcane payload in a bag, in a persistent world with scribe scroll on a sorceress :)</strong><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_004d01c7ca3a90b5520c96863d7901e4_t.jpg\"/></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:44 PM - Jul 14, 2020",
      "content": "<div>That looks like enough XP to actually level a character to 40! <span class=\"text-emoji\">😱</span></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:40 PM - Jul 14, 2020",
      "content": "<div>Uhhhh I didn't know the answer to that tongue in cheek comment Web so I did the math :)<br/>\n7 x 10 x 5 x appr 150exp = 52.5k<br/>\n<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Level_progression\" rel=\"noreferrer\" target=\"_blank\">780k to lvl 40</a> plus diminishing exp returns at higher levels so it is probably equivalent to 1 million exp or more<br/>\nSo its 2-5 levels I've delayed. To be fair though I didn't want to level too fast and miss out on some great content <br/>\nMost of the scrolls were written at level 12-22.<br/>\nThe psychological effect of having that bag is incredible however. A bag of Courage! :)</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:53 PM - Jul 14, 2020",
      "content": "<div>Just kidding!  That's a lot of scrolls.</div>"
    }
  ]
}