{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "616",
  "name": "The \"Priestess\" on Arelith for Sucy",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-priestess-on-arelith-for-sucy-t2355312.html",
  "author": "Zanithar",
  "avatar": "10759190_1575525433.jpg",
  "replies": 30,
  "posts": [
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "12:40 AM - Jan 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><em class=\"mention\">@Sucy</em> I am going to drop two Protection Healer builds in here for your review.  You can read more about the healer path <a class=\"postlink\" href=\"http://wiki.arelith.com/Cleric#Healer\" rel=\"noreferrer\" target=\"_blank\">HERE</a><br/>\nThe quick summary, they are limited to cloth armour and simple weapons but in exchange get some advanced healing powers and a cleric version of timestop called respite that does not stop time so much as remove you and your party from it briefly before returning you somewhat restored.  It is a class designed around using extended regeneration to feed another class skill called over healing.  A 30th level healer can \"overheal\" up to 150 hp.  Meaning they drop an extended regen on someone/something/themselves and that thing ticks up to 150 temporary HP and stays there as long as the Regen holds.  On a server where most 30th level characters have 300-400 HP this is the single largest HP buff in the game.  They have lots of other healing enhancements, it is worth a read/review of the link.<br/>\n<br/>\nOn Arelith, outside of Speciality builds like this one the Domain order of power is: Travel (Haste) &gt; War &gt; Trickery/Plant/Death &gt; everything else.  So a Battle Cleric should be Travel/War a Caster Cleric should be Travel/War.  This is niche build however and we trade Travel (Haste) for Autoquicken + Protection.<br/>\n<br/>\nI'll offer two builds.  Your largest issue I think will be a deity that closely matches the Priestess.  \"Earth Mother\" Deities will likely all be druidish plant/animal/water/fire/air/earth style domains which are very un-optimal for this build and frankly for any Cleric/Healer build on Arelith.  You will need Protection, the other Domain is more flexible. <br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Build 1:</span></strong><br/>\nProtection/War Domain: This is my recommended build for mechanical strength on Arelith and also seems to fit what I read about the character.<br/>\nThis build has two focuses:<br/>\n<br/>\nThe Protection Feat: Greater Sanctuary on Arelith has been reduced drastically in duration, it lasts Caster Level/4 rounds with a cool down of 240 seconds.  So, an Extended Greater Sanctuary will last 15 Rounds for a level 30 caster.  The Protection Feat is a Buffed up Sanctuary which, in this build, will last 43 Rounds.  You can cast all non-offensive spells whilst under this effect including summons (which break GSanc on Arelith), buffs and heals (used non-offensively).  Meaning you can enter the Protection Feat Sanctuary and be effectively immune from combat (Area of Effect can still impact you) for the duration of a PvP or PvE battle.  You will also be near impossible to see/find as True Sight is the only thing that can locate you (but does not allow targetting you) and Truesight has been changed to 1 round for the \"True sight effect\" and there are no \"True Sight\" items.<br/>\n<br/>\nThe War Feat: This grants you access to Aura of Vitality (The Awesomesauce) as well as Cat's Grace (a bonus).  Aura of Vitality (AoV), when cast by a caster with ESF: Transmutation is Turns/Level.  ESF: Transmutation also increases the effect of Animal spells (Bulls, Owls, Cats, Etc ..) from 1d4+1 to 1d4+3.  Meaning, that with AoV and the Animal Spells, you can almost reach the stat cap bonus for Str/Dex/Con.  This is exceedingly useful for buffing your summons, your party and yourself and makes your equipment exceedingly flexible.  <br/>\n<details><summary>Spoiler</summary>Cleric(30), Human\nSTR: 8\nCON: 12\nINT: 14\n\n01: Cleric(1): Spell Focus: Conjuration, Greater Spell Focus: Conjuration, Domain War, Domain Protection\n03: Cleric(3): Spell Focus: Transmutation\n05: Cleric(5)\n07: Cleric(7)\n09: Cleric(9): Extend Spell\n11: Cleric(11)\n13: Cleric(13)\n15: Cleric(15): Arcane Defense: Abjuration\n17: Cleric(17)\n19: Cleric(19)\n21: Cleric(21): Epic Spell: Dragon Knight\n23: Cleric(23): Epic Spell Focus: Transmutation\n25: Cleric(25)\n27: Cleric(27): Automatic Quicken Spell I\n29: Cleric(29): Automatic Quicken Spell II\n\nSkillpoints: 165\nSaving Throw bonuses: Spells: +7\nAB (max, naked): 19 (melee), 19 (ranged)\nSpell Casting: Cleric(9)\n\n\n02: Spellcraft(1), Save(20), \n04: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(3), \n06: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(5), \n08: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(7), \n10: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(9), \n12: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(1), \n14: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(3), \n16: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(5), \n18: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(7), \n20: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(9), \n22: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Tumble(5), Save(1), \n24: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(3), \n26: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(5), \n28: Concentration(1), Heal(1), Lore(1), Spellcraft(1), Save(7), \n30: Concentration(1), Lore(1), Spellcraft(1), Tumble(5), \n</details>\n<strong><span style=\"text-decoration:underline\">Build 2:</span></strong><br/>\nProtection/Heal Domains:  This is a healing focused build that doubles down on the healing aspect of the healer.  I generally find with the spontaneous healing changes to include Heal, Mass Heal and Healing Circle and the radius increase for Healing Circle and Mass Heal the Healer has a tremendous amount of healing and doubling down on it is more redundancy than improvement.  This build packs more than enough healing capability without spending a Domain on Healing.  The one exception to this might be group PvP if that is the character focus.<br/>\n<br/>\nThe build for this can be found <a class=\"postlink\" href=\"https://docs.google.com/document/d/1mxW1XakMTTdqdEVDM7IuYIOARZMmKUCDgpBJuIOqjY4/edit?usp=sharing\" rel=\"noreferrer\" target=\"_blank\">Here</a><br/>\n<br/>\nI recommend 3 modifications to this build if you go this route:<br/>\n1. In the build notes they mention taking Extend rather than Silent Spell.  Silent Spell is added for spellbook slot management purposes.  I have run this build and found that Extend offers far more usefulness on Arelith than Silent, especially given that spontaneous healing has been extended to include heal, mass heal and healing circle.  I strongly recommend taking Extend Spell over Silent Spell.<br/>\n2. Mummy Dust very likely does not fit the character RP, I would replace this feat with Scribe Scroll.  This offers two things, the first is a way to carry around more spells.  I would Craft a stack of Mass heals and heals.  It also offers Tier 3 DweomerCraft for the maximum enchant item ability another exceedingly useful thing to have on a build.<br/>\n3. Last but not least, this is an old build from before the big UMD/Lore change that has now linked cross class scroll usage with Lore.  Take 12 Con and 14 Int to start and drop 33 points into Lore.  If you also choose to swap out Toughness you can fit Scribe Scroll as a Toughness replacement and ESF: Lore as the Mummy Dust Replacement.  This, with some equipment and max lore skill will allow this build to hit 80 Lore.  80 Lore will allow you to use Timestop and Mords Disjunction scrolls as a pure 30 healer which is an immense power boost and doubles your defensive arsenal.  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:20 AM - Jan 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for posting this Zanithar. <br/>\n<br/>\nThis is a lot of information!<br/>\n<br/>\nI am very interested in the differences in build design compared with vanilla NWN, they are quite unique.<br/>\n<br/>\nI am interested to learn more about your thoughts re the spell foci <br/>\n<br/>\nThe first build has three spell foci (conjuration, transmutation and abjuration).<br/>\n<br/>\nThis is different to the usual spell focus evocation, which I understand is usually the most popular school for clerics for hammer of the gods / implosion / fire storm etc...<br/>\n<br/>\nConjuration I can understand for SoV.<br/>\n<br/>\nAbjuration I can kind of understand to improve the DC for dispel magic / greater dispelling.<br/>\n<br/>\nArcane defense abjuration I don't quite understand, in vanilla NWN it unfortunately is not included in the dispel rolls (I wish it was) but has this been modified in Arelith to give casters some spell protection?<br/>\n<br/>\nTransmutation I don't understand but this is probably because I'm haven't played Arelith significantly. I have taken a focus in transmutation as a druid player to improve the DC of the drown and entangle spells, although I found this not to be as high yield as other spell foci such as conjuration/necromancy for druids.<br/>\n<br/>\nAnyway just some questions from someone keen to learn a bit more how to build for Arelith!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "4:34 AM - Jan 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Absolutely, this is some of both the most interesting and the most frustrating bits of Arelith to be honest.<br/>\n<br/>\nEach of the spell Foci lines has been adjusted to provide strong secondary benefits which have rapidly also become the primary benefit of those foci.<br/>\n<br/>\nGSF: Conjuration offers a summon tier increase similar to the animal domain benefit.  Arelith has a tier X and tier XI summons.  Tier XI is limited to wild Mages as the Conjuration benefit and Animal do not stack from a Tier bonus perspective.  ESF: Conjuration also offers a summon PC feat called yoink.<br/>\n<br/>\nGSF and ESF Transmutation offer +1 and then +2 to animal spells and singular teleport and then group teleport.  They also offer increases in AoV duration (turns per level at ESF).<br/>\n<br/>\nAbjuration offers a couple of things, Each level offers an increase of +1 to dispels with ESF offering +2.  Dispel cap has been increased as well on Arelith, with Abjuration you get a 26 cap.  At GSF, immunity to ILMS and at ESF, immunity to IGMS in conjunction with a shield spell.  ESF also offers a ward feat preventing scrying (A Divination ESF ability), prevents teleports (Transmutation ability), getting yoinked (Conjuration ability) and offering a will saved brief paralysis for anything hostile entering.<br/>\n<br/>\nAbjuration Defence: Abjuration offers a +2 CL for resisting dispels.<br/>\n<br/>\nSo, the focus of the healer build is to stand behind something/someone and heal/buff it.  Summons get CL level bonuses AND spell foci bonuses, Conjuration for anything not undead and Necromancy for Undead.  This makes a deep Caster summoner very viable for end game content.  My healer has fought to and solo’d end game content on Arelith that some groups fail to fight to let alone kill.<br/>\n<br/>\nBecause of the way the server is built, saves are off the charts making DC based casters more challenging.  PCs can hit and do hit saves in the 50s on a 30 level cap server.  They are still viable of course and there are Evocation Clerics and Necromancy Clerics.  The epic spells require evocation to cast without damaging yourself and they are often used as PC combat “Enders” meaning get them down to half hp and Hellball -&gt; Ruin them.  <br/>\n<br/>\nSummons control has also been improved meaning a healer always has their summons walking ahead of them buffed to suck aggro.  My 30 healer “never” attacks and uses tumble to run around and shed aggro onto my tank/summons when attacked.  He wields a self enchanted sling with no ammo to avoid attacks of opportunity.<br/>\n<br/>\nFeat Changes:  <a class=\"postlink\" href=\"http://wiki.arelith.com/Feat_changes\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Feat_changes</a><br/>\n<br/>\nSummon Changes: <a class=\"postlink\" href=\"http://wiki.arelith.com/Summoning_Changes\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Summoning_Changes</a><br/>\n<br/>\nSummon List: <a class=\"postlink\" href=\"http://wiki.arelith.com/Summons\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Summons</a><br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "4:51 AM - Jan 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I mentioned 53 AB being on the higher end of the melee range and that some niche build breech this for short duration as do some archer builds.  My Epic Dragon Knight hits just over this fully buffed.  I was in the midst of working out exactly how much over as the sheet is not accurate and I had questions on how it all worked when I lost the desire to play in Arelith and moved to WoG for a bit :)<br/>\n<br/>\nMeaning my summons pack more AB than a PC melee weapon master build ...<br/>\n<br/>\nAnd I can stand behind it, immune to targeted damage for 73 rounds, healing and buffing it :)<br/>\n<br/>\nI like WoG because I like the way it is balanced and the depth of the modules, but Arelith is one representation of the way classes “should” have been built and balanced.  It is actually pretty amazing.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sucy",
      "avatar": "10759119_1564073093.jpg",
      "timestamp": "9:47 AM - Jan 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Wow that was a lot of useful information, thank you. I definitely will use the first build judging from what I read, seems to suit the character much more as well. We will probably be starting to play tomorrow depending on who else can show up, since these characters will only probably be almost exclusively played together.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:34 AM - Jan 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">No worries, let me know if you have questions around either build.  I am happy to help and I keep reasonably up to date with the Arelith changes.  Which reminds me I should probably update the wiki ... hmmm update the Arelith wiki or play World of Greyhawk ... what to do ...<br/>\n<br/>\nCommoner and Specialist updates can wait!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sucy",
      "avatar": "10759119_1564073093.jpg",
      "timestamp": "11:06 AM - Jan 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I do have some questions about Arelith but I’ll wait to ask here or through pms when I get home. Thanks again!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sucy",
      "avatar": "10759119_1564073093.jpg",
      "timestamp": "10:08 PM - Jan 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><em class=\"mention\">@Orion2019</em> <em class=\"mention\">@Zanithar</em> <br/>\n<br/>\nJust wanted to thank both of you for your help and input on the builds! We started leveling and the group hit level 5 before stopping, but should pick up again tomorrow night.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:17 PM - Jan 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Sucy wrote:</cite><em class=\"mention\">@Orion2019</em> <em class=\"mention\">@Zanithar</em> <br/>\n<br/>\nJust wanted to thank both of you for your help and input on the builds! We started leveling and the group hit level 5 before stopping, but should pick up again tomorrow night.</div></blockquote>\n\nAll good, I am curious though, what deity did you take for her?  Also, I’ll have some feedback on your other character today.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sucy",
      "avatar": "10759119_1564073093.jpg",
      "timestamp": "3:01 PM - Jan 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Zanithar wrote: <a data-post-id=\"18638\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18638&amp;sid=03973d8700149541251e2df449d86b47#p18638\">↑</a><div class=\"responsive-hide\">Jan 25, 2020</div></cite><blockquote><div><cite>Sucy wrote:</cite><em class=\"mention\">@Orion2019</em> <em class=\"mention\">@Zanithar</em> <br/>\n<br/>\nJust wanted to thank both of you for your help and input on the builds! We started leveling and the group hit level 5 before stopping, but should pick up again tomorrow night.</div></blockquote>\n\nAll good, I am curious though, what deity did you take for her?  Also, I’ll have some feedback on your other character today.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div></blockquote>\nI chose Chauntea, not sure if it is optimal or not but I could always change if there are better choices. It was mostly for rp reasons.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sucy",
      "avatar": "10759119_1564073093.jpg",
      "timestamp": "10:52 AM - Jan 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So looking through the character menu there are a lot of crafting skills. Are there any in particular I should choose or are they all good? Assuming forging would not benefit me, I was thinking either cooking or alchemy which would be for rp reasons again. I took gift of crafting for the extra 10 points but figured I’d ask anyway!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "12:07 PM - Jan 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">They are dependant on what you want to do.  Cooking is not quite finished as a crafting skill and is very labour intensive, as a result there are not too many people that take it.  Alchemy is a solid craft with some decent coin to be made and much of what it produces is used in other crafts.<br/>\n<br/>\nFor Arelith, I typically make my melee characters alchemists with the thought that it focuses on a needed melee consumable (essences and skeens), but there are other sellable consumables as well.  Everything else is a one off cost.  Meaning I buy my weapon and I never have to buy it again, etc.  But I always need essences.  The exception is when I am planning on a 5% build or a racial crafting build.  My Orog is a forger for example.<br/>\n<br/>\nMy healer is a tailor and a tier 3 Dweomercraft so everything he wears and wields outside of his staff is made by tailoring and/or enchanting.<br/>\n<br/>\nAll this boils down to the idea that there is no best choice and I think alchemy is just fine for your healer and either forging or alchemy for your melee build would be fine as well.  Forging if you want to try to 5% enchant dwarven rune axes.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sucy",
      "avatar": "10759119_1564073093.jpg",
      "timestamp": "12:25 PM - Jan 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you! Didn't really think about tailoring much, since I thought I would be using dweomercraft to enchant basic gear. The craftable cleric robe seems nice so I'll look into tailoring a bit more as well, but being able to give out essences and skleens seems super nice. Also apparently you can craft golem hearts with alchemy, so she could make golems with gs: transmutation if she ever finds a control stone and body!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sucy",
      "avatar": "10759119_1564073093.jpg",
      "timestamp": "11:01 AM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This might be a really dumb question but how important are the quicken spell feats? If I drop all 4, I could fit esf lore and esf abjuration into the first build and be able to cast ward along with time stop? Or would the cast time be too slow for it to matter<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:26 AM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Sucy<br/>\n<br/>\nI believe there are no dumb questions here.<br/>\nAll questions must be valued, for every question is a step closer to enlightenment, for both the asker, the reader and responder.<br/>\n<br/>\nIn Vanilla NWN Quicken Spell is useful to:<br/>\n<br/>\n- cast more spells of a certain type if you already have extend/silent/empower/maximise (it casts spells 4 levels higher than previously). A good example being Grizzled_Dwarflord's The War Machine of Gruumsh build, GDL uses quicken spell to open up more spell levels so he can cast the Divine Power spell more often. <br/>\n<blockquote><div><strong>The Divine Power of Gruumsh:</strong> observe the number of Divine Power Switches available:<br/>\n3rd: 7 Normal<br/>\n4th: 7 Extended<br/>\n5th: 7 Extended<br/>\n7th: 5 Quickened<br/>\n8th: 5 Quickened</div></blockquote>\n- to cast two spells in a round, if you are not hasted<br/>\n<br/>\nIn an environment where haste is easily available (and this includes equipped items with the 'Haste' magical property on them, or potions of speed which supply a haste spell to the drinker), Quicken Spell tends to be not particularly useful as this is a much easier way to cast two spells in a round.<br/>\n<br/>\nLooking at the Arelith Wiki I do not see many significant changes beyond it being able to be obtained 'at spell circle 3 (I assume this means level 3 spells)' but I hope an Arelith player can discuss this further from an Arelith perspective.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "12:25 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm pretty sure that both builds Zanithar posted, as well as most Arelith builds in general, are built for PvP with PvM being less of a concern. This build doesn't get a reliable source of Haste, and in PvP any Haste potions or wands will be easily dispelled due to the low caster level of 10 (assuming vanilla potions/wands). Also vanilla Haste potions (not sure about Arelith) only last for 10 rounds which is an extremely short duration for a server like Arelith, since it has both rest restrictions and a game clock where 1 game hour is 6 real time minutes.<br/>\n<br/>\nIf you're not planning on partying with a Haste caster every single time you play then Auto Quicken is a very useful feat, for both PvM and PvP.<br/>\nHaving said that, I might be overestimating the importance of AQ3 since I don't play on Arelith.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "12:31 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The quicken line  is added in lieu of the Travel Domain on a Sanc Healer, there are spare feats available to handle it.  Essentially letting you drop the most powerful Cleric Domain.  However, by all means you can swap them out for other feats if needed and rely on divine haste wands.  The cost is more in the time needed to leverage haste and its refresh which in turn can result in your death (rarely in PvM and more commonly in PvP).<br/>\n<br/>\nIf you are planning on engaging in PvP I wouldn’t drop it.  If you are not, it is fair game as far as I am concerned.<br/>\n<br/>\nMy healer has it and he actively avoids PvP., with no “quick buffer tools” it sure is convenient :)<br/>\n<br/>\nAs for the builds, they are built to manage PvP with the idea that PvM is a subset of what is needed for PvP and any build that can handle PvP will be solid in PvM.  This is accurate on Arelith, less accurate on other servers.  But it really boils down to what you want to build for ...<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "1:09 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That fits with my experiences on most PvM/PvP servers. Usually high end PvM is balanced around what PvP characters can deal with, with a few exceptions (usually the toughest bosses/dungeons) that require dedicated PvM builds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sucy",
      "avatar": "10759119_1564073093.jpg",
      "timestamp": "6:00 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Aha okay, was just curious if the quicken feats were quality of life or actually pretty important. I was looking at the Lore rework page on the wiki and it requires 80 Lore to use time stop, and I don't think I can hit that with out ESF Lore. I'll just stick with the current build anyway since I like the idea of turn/level Aura of Vitality.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "8:43 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You cannot make it to 80 Lore without Dwarf (they get a small lore bonus) or SF/ESF lore or 16 int.<br/>\n<br/>\nAdd to the above all the lore equipment in the game PLUS every slot enchanted for lore (you can get to 79 with 14 int and all the gear/enchants).<br/>\n<br/>\nYou could drop Auto Quicken III or Scribe Scroll for ESF:Lore or drop the whole Quicken line as you outlined. <br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sucy",
      "avatar": "10759119_1564073093.jpg",
      "timestamp": "6:11 AM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well I guess it depends on how important tier 3 dweonercraft is. I would have to drop edk or scribe scroll to fit it sadly and the thought of being the groups enchanter is nice, but edk seems like a very important summon.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "6:21 AM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">EDK is a boss farming tool.  I personally would always take it on any 30th level caster build especially on a cleric as they get exceptional buffing options (There are not many viable 30CL builds).  Some people will say gate is a better option, those people do not realize that you need to hit the end game mobs to kill them and your EDK has the best AB of any summon on a 30CL with the applicable Epic Spell Focus.<br/>\n<br/>\nDweomercraft is one of the top tier skill sets to make viable end game equipment builds.   That said, there are a bunch of those folks about.  I prefer to be able to do my own predominately because 5%ing things is labour (clicking) intensive and I feel bad about asking someone else to do it for me even if I pay them.<br/>\n<br/>\nPersonally (and I have a rebuilt on my 30 healer), I have not quite sorted out if I am going EDK, Scribe Scroll and ESF:Lore and dropping AutoQuicken III (most of the important stuff is not in the 7-9 range) or not.  <br/>\n<br/>\nSo, do not feel there is a solid choice advantage here :). I am rather hoping that there is another piece of lore equipment somewhere in the loot tables I am not aware of and I will not have to make that choice :)<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sucy",
      "avatar": "10759119_1564073093.jpg",
      "timestamp": "7:21 AM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, I guess I’ll keep it in mind while leveling since epic levels are very far off still. Dropping auto quicken 3 would solve the problem but I’ll see what skills are in that range before making the decision!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Elisturus",
      "avatar": "no_avatar.png",
      "timestamp": "12:28 AM - Apr 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Can I ask, what's the deal with 1 skill in open lock and the high CHA?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:14 AM - Apr 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Some skills, such as Disable Trap or Open Lock, require at least one skill rank before you can even attempt to use them. I always put at least 1 rank into skills that require training so that I have the ability to use them.<br/>\n<br/>\nIn vanilla NWN the DC of Divine Protection is modified by the CHA of the cleric, so a higher CHA results in a better Divine Protection.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "3:24 AM - Apr 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Elisturus wrote:</cite>Can I ask, what's the deal with 1 skill in open lock and the high CHA?</div></blockquote>\n<em class=\"mention\">@Yunim</em> is correct, but to add a little more Arelith flavour, you can enchant equipment to add most skills.  Generally people will carry a set of enchanted equipment to meet a need. <br/>\n<br/>\nIn this case, the build I provided Sucy would optimally have a full set of enchanted equipment (11 items) with +2 Lore/Disable Traps/Open Locks/Search on it.  There are a couple of tailored items that would would swap in for the end game netting 50 open locks/disable traps which lets you open all the runic chests and most everything else.<br/>\n<br/>\nFor the Charisma, it nets a DC 53 vs Will, 43 round sanctuary effect that does not dismiss summons when cast and is not dismissed when a summon is cast under the effect (from memory) on the protection feat sanctuary.  Greater Sanctuary on Arelith has been changed both in duration and it breaks when you cast a summon spell.  <br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Elisturus",
      "avatar": "no_avatar.png",
      "timestamp": "11:06 AM - Apr 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah gotcha.<br/>\n<br/>\nSo the CHA helps beef up sanc so that the healer can just stay in there and cast any sort of support/summon spells. That's pretty brilliant.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Elisturus",
      "avatar": "no_avatar.png",
      "timestamp": "9:25 AM - Apr 29, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I tried out this build on the test server, works fine except I think I might have messed up the leveling somewhere.<br/>\nFeat wise every thing is good, but I ended up with 21 will save instead of 22 and 3 extra skill points. Which I just dumped into craft mastery.<br/>\n<br/>\nI don't think it's a major issue, but, did I screw it somehow?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Elisturus",
      "avatar": "no_avatar.png",
      "timestamp": "9:39 AM - Apr 29, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">To add to that though, the EDK is a beast + the protection domain sanctuary lasts a good 37 rounds, with is a good long while and having every spell cast as if hasted definitely makes things easier.<br/>\nThe only dangerous part is if the protection sanctuary is dropped for whatever reason, talk about super squishy.<br/>\n<br/>\nOne question though, any reason that you didn't take the GSF: abjuration and took arcane defense: abjuration instead? GSF would have given the shield spell immunity to GMS as well as LMS.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:04 AM - Apr 29, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Elisturus wrote:</cite>To add to that though, the EDK is a beast + the protection domain sanctuary lasts a good 37 rounds, with is a good long while and having every spell cast as if hasted definitely makes things easier.<br/>\nThe only dangerous part is if the protection sanctuary is dropped for whatever reason, talk about super squishy.<br/>\n<br/>\nOne question though, any reason that you didn't take the GSF: abjuration and took arcane defense: abjuration instead? GSF would have given the shield spell immunity to GMS as well as LMS.</div></blockquote>\nArcane Defence, on Arelith, offers a +2 CL for the purposes of resisting dispels.  A Protection Feat healer, and very specifically this healer support build is meant to spend as much time as possible in a state of relative damage immunity.  Either by not attracting aggro or by actively avoiding being targeted using extended GSanc and the Protection feat. <br/>\n<br/>\nThe biggest weakness of most cleric builds is the large spin up time and the impact of being dispelled.  It is possible to dispel the various Sanctuaries but it takes an area of effect (sanctuary prevents direct targeting) dispel and also being able to see the target (Truesight has an 1 round duration).<br/>\n<br/>\nSo, it is a flexible opportunity as is the auto quickness line depending on what you are looking for.<br/>\n<br/>\nI would generally avoid taking GSF: Abjuration for the IGMS protection as the healer has other tools to both avoid this and mitigate it, as well as other things to be doing then quaffing a shield potion.  However ESF: Abjuration for the Dispel bonus AND the custom Ward feat is definitely interesting.  Also interesting is Epic Spell Mummy Dust, Empower Spell, Toughness, Craft Wand ESF:Lore (for level 9 wizard spells via scroll).<br/>\n<br/>\nI have definitely considered dropping SF: Abjuration and Arcane Defence: Abjuration for ESF:Lore and Mummy Dust.  I suspect I would if I was not human or I was in the Underdark.  The single biggest Cleric weakness is lack of a Breach spell and being able to cast Mordekainen’s Disjunction requires an 80 lore which a healer build can meet with ESF:Lore and bunch of targeted enchanted/crafted gear, Timestop scrolls are also a very solid bonus.<br/>\n<br/>\nFor your EDK you can bump its AB a bunch using cleric spells, and heal/overheal including adding regen.  It chews through end game content and will surprise PCs in PvP who can just avoid most EDK summons by relying on AC.<br/>\n<br/>\nIt is also very much worth remembering that you can spontaneously cast Heal and Healing Circle.  Build your spell slots out to ensure you account for this.<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Elisturus",
      "avatar": "no_avatar.png",
      "timestamp": "10:34 AM - Apr 29, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I can definitely see that for a necromatic healer, with a more offensive focus.<br/>\nI could see that sort of build working better with the FS though, the higher focus on CHA would mean that you would have a higher DC for dispell attempts, so you could cut back a bit on spell focus feats and explore other areas.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}