{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "142",
  "name": "New Caster wants to know: Fireball vs. Scintillating Sphere",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/new-caster-wants-to-know-fireball-vs-scintillating-t2355356.html",
  "author": "UrbanHermit",
  "avatar": "10759229_1581741214.jpg",
  "replies": 67,
  "posts": [
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "7:15 PM - Feb 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Greetings, all. I have returned to this game after many years under the allure of the Enhanced Edition and decided to try a caster for the first time instead of my usual preference for melee characters. Going with a Sorceress, because... reasons!<br/>\n<br/>\nAnyhoo, my lovely little budding human Sorc has been merrily working her way through chapter one of the OC, anxiously running circles around a mage-armor-buffed Daelan or Grimnaw to draw aggro to them (as I have read in many places is the thing to do) while praying for good rolls from her Wand of Sleep, plinking away at what she can with a crossbow and taking a shot with Burning Hands when it seems efficient to do so. Actually, she soloed the open streets in Beggar's Nest because the slow moving zombies are just such ripe (pun intended), and fun, targets for Burning Hands.<br/>\n<br/>\nNow, we've got level III spells just around the corner and the seemingly obvious Fireball as a choice. But, in looking at the other \"nuke\" in the third level arsenal, I see that Scintillating Sphere is basically the same spell other than range and element. I know it might seem like a no-brainer that the greater range is better, but I've been playing around with Pretty Good Character Creator in the test area and happen to think the electric zap is cooler than the fire blast.<br/>\n<br/>\nAnd we all know that looking cool is important. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nConsidering that just about EVERYthing rushes you to melee in this game, does the range really matter all that much? Is there ever a good reason for the preference of lightning over fire in the earlier levels? I do realize it's just a level 3 spell and other things will be more important a little further down the road. But I'm one of those people who enjoys the leveling process, trying to learn what I can, and having a little fun along the way.<br/>\n<br/>\ntldr: Is there ever a reason to take Scintillating Sphere over Fireball?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:19 PM - Feb 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes.<br/>\n<br/>\nWhen most opponents have either dr or immunity to fire.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "7:37 PM - Feb 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>When most opponents have either dr or immunity to fire.</div></blockquote>\nAnd how would one know such a thing in advance? It's a Sorcerer and can only change spells on level-up.<br/>\nAnd just a side thought, will electricity bash chests the same as fire? Because... you never know when that comes in handy. Although, the starter Rod of Frost has turned out to be quite useful for that purpose... a bit slow, but it works. We'll be holding onto to that as long as it keeps doing the job... when the Pixie isn't around, of course.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:40 PM - Feb 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Second (or more) playthrough?<br/>\n<br/>\nIt should affect chests equally well.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "7:55 PM - Feb 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Like I said, returning to the game after many years. My recollection of the various details concerning foes is a bit vague.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:25 PM - Feb 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You can (pause and) right click on your foes to see if they have any immunities, resistances or vulnerabilities. <br/>\nEarly on I would not think there is a problem with either spell. But I have not played a sorcerer in the OC for a veeery long time. On a general basis, I most often prefer fireball for the range and that it won't affect my familiar when I choose the fire mephit.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:11 AM - Feb 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I always chose fireball for the coolness factor the explosion looks cooler.<br/>\nAlso it reminded me of fireballs in Baldurs Gate.<br/>\n<br/>\nOnly when I started casting Scintillating Sphere I realised I had to walk closer as a mage to cast it. Often the enemy would see me before I cast destroying the element of surprise / targeting. As a result I preferred fireball in the end.<br/>\n<br/>\nThe Wiki states the cast range of fireball is 40m whilst scintillating sphere is 20m, all things equal I would choose fireball as a sorc. Then as they run towards you in a straight line blast em with a lightning bolt. Then henchmen can clean up.<br/>\n<br/>\nI wish grease and fireball would lead to a big firey mosh pit sometimes...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:26 AM - Feb 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, it would be nice to have combination magic ala Original Sin : Divinity!<br/>\n<br/>\nGrease is <em>flammable</em> and can be set on fire.<br/>\n<br/>\nIce Storm + Fire = Steam<br/>\n<br/>\nAnd so on.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "4:57 AM - Feb 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Only when I started casting Scintillating Sphere I realised I had to walk closer as a mage to cast it. Often the enemy would see me before I cast destroying the element of surprise / targeting.</div></blockquote>\nYeah, I realized that tonight. It's a notable difference in wide open spaces. Probably less so in dungeons and interiors where you have umpteen guards/goblins/whatever suddenly swarming the doorway you just opened.<br/>\n<br/>\nAs it happened, my Sorc leveled up on the 3rd kill upon entering the Docks District. So I did my usual pre-level-up-save and then made a couple runs with both of these spells, with Daelan in tow, against the Muggers and Thugs roaming the streets, as well as Androd's mansion for some close quarter action. I had him stand his ground while I did the casting from a distance thing and found out you do get fewer surprise attacks with the shorter range.<br/>\n<br/>\nHaving the henchman ball them up is mostly pointless because between cleave and attacks of opportunity, they can drop 3 enemies in the time it takes you to wind up one spell and your big AoE nuke of glory fizzles out on a single target.<br/>\n<br/>\nI then tried a third option and swapped out Melf's for Flame Weapon and took the Dire Wolf summon for that first level 3 spell. Dismissed Daelan and did the run again with just the wolf, and I gotta say... I was pleasantly surprised. A level 6 Flame Weapon feels like it lasts a looong time and the wolf has knockdown to boot. At this point I think it's a better option than just having 4 AoE spells that <em>might</em> do good damage.<br/>\n<br/>\nFrom what I've been reading this is not all that surprising nor disappointing. She's still basically a humble party buffer whose crossbow bolts of lightning and frostbite do more damage than a few spells per day. And Burning Hands is still useful at this level, methinks.<br/>\n<br/>\nStill not decided on the two spells in question, nor have I dismissed them altogether, either. Just putting them on hold for now, so the feedback is still muchly appreciated.<br/>\n<br/>\ntldr: Dire Wolf + Flame Weapon beats Fireball/Shockball... <em>for now</em>.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:35 AM - Feb 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I wouldn't worry about it all that much - the OC was made to be easy for just about any Class.<br/>\n<br/>\nI doubt you will be facing many fire/electricity immune opponents throughout the game.<br/>\n<br/>\nGo with Fireball if you have to choose.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "6:08 PM - Feb 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>I wouldn't worry about it all that much - the OC was made to be easy for just about any Class.</div></blockquote>\nWell, \"easy\" is a relative term. I'm a mostly casual (though sometimes serious) gamer and I'm still finding the OC to have it's challenges. Playing on normal mode, btw, so no damage to party members from AoE. It's a good boot camp for learning the game system. <br/>\n<br/>\nMy Cleric/Fighter was fairly easy to play through the OC with. And my Rogue/Fighter/Shadow Dancer made the run through SoU/HotU fairly painless. I'm enjoying the learning curve with this Sorceress. And I am having to do quite a bit of lernin' with all these spells and whatnot. But that's what makes this game so interesting, IMHO.<br/>\n<br/>\nNeverwinter Nights was my introduction to the world of D&amp;D back in 2005 and came at a time when I needed a good distraction from mundane, everyday life. I quickly became quite engrossed with it then, and revisiting it now is stirring up a lot of fond remembrances.<br/>\n<br/>\nSo, I guess I kinda' answered my own question. But then, I think asking the question is what prompted me to do my own little bit of exploration. I'm not exactly \"worrying\" about anything, just trying to maximize the satisfaction of winning a few tough fights here and there. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:09 AM - Feb 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@ UrbanHermit, when you become more experienced with your Sorceress you will see that almost all of the direct damage spells in the game are sub-par, to say the least. That's because of the necessarily abstract nature of the game compared to the \"real\" hit points your enemies would have in Pen &amp; Paper D&amp;D. Battlefield control &amp; instant-death spells will become your bread &amp; butter later in the game with the possible exception of \"horrid wilting\" which is a good spell to have in nearly any mage. Till you get there, \"firebrand\" is an adequate choice, especially for the core rules difficulty &amp; of course...Isaack's greater missile storm. <br/>\n<br/>\nGood gaming!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "5:36 PM - Feb 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you <em class=\"mention\">@Valerfor</em> for the tips and encouragement. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nI must admit, the limited use of spells on a \"spellcaster\" is a bit frustrating. <br/>\n<br/>\nIn Guild Wars 2 there is no mana/energy pool and the only limit on skill use is the cooldown timer on each one. My Elementalist's staff auto-attack is Fireball... which she freely slings left and right every 1.4 seconds all day long without even <em>thinking</em> about resting.<br/>\n<br/>\nIt's cool, though. I've become captivated by the sorcerer class in this classic game and not giving up anytime soon.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "4:38 AM - Feb 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In chapter 2 now and decided to give Scintillating Sphere a go on the last level up. And wouldn't you know it... my first tough fight was with a Lich, Brother Toras, who has increased immunity to... electrical! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nI gotta' say, I'm definitely paying much more attention to the combat log playing a caster than ever before.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "11:47 AM - Feb 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">UrbanHermit,<br/>\nAs a frequent wizard player, I don't usually find myself taking many damage dealing spells until I get 4th level spells. The buffs are just too good, especially when combined with a decent henchman and a summon.<br/>\n<br/>\nTo illustrate at level 8 (for sorcerer, 7 for wizard), drop an extended Flame Weapon, regular Bull's, and regular Mage Armor on a summoned dire wolf. Watch the magic happen.<br/>\n<br/>\nAlso, both Scintillating Sphere and Fireball top out at caster level 10, making other spells much more useful at 11+.<br/>\nMy favorite level 3 buffs:<br/>\nGreater Magic Weapon<br/>\nHaste<br/>\nKeen Edge<br/>\n<br/>\nUtility:<br/>\nFind Traps<br/>\nSummon Monster III<br/>\n<br/>\nMy favorite level 3 offensive spells:<br/>\nFlame Arrow<br/>\nStinking Cloud<br/>\nNegative Energy Burst<br/>\nSlow<br/>\n<br/>\nIn particular, Flame Arrow and Negative Energy Burst are both lack-luster at low levels, but really start to become great at caster level 20+. In contrast, Stinking Cloud and Slow are always nice.<br/>\n<br/>\nTo further expand on my fondness for Stinking Cloud, it's great as an area denial effect. Unless the targets are poison immune (monks, druids, or gear), it's AoE with a round/level duration. Even against high saves, everyone rolls a 1 eventually. Its daze shuts down most offensive actions and renders characters without uncanny dodge flat-footed. Sit back, let your elemental summon melee in the cloud, while you shoot them with a crossbow, cast other spells, loot, or get a drink all while standing off to the side in safety. With the creatures in the cloud rolling to save every round, combined with the duration, Stinking Cloud clearly out performs most other level 3 spells. It may not be as flashy, or do any damage, but it will cause the demise of your opponents.<br/>\n<br/>\nA final thought, if you play wizard, this is another reason to take a level of rogue early. Those crossbow shots on dazed opponents will all be sneak attacks.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "12:06 PM - Feb 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">One more thought:<br/>\nFinger of Death working on a lich... something doesn't add up. I'm not saying UrbanHermit is wrong, but someone might have missed something during module development and setting creature properties.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:14 PM - Feb 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, the normal lich in the OC is not immune to death magic as it should be.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "2:08 PM - Feb 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>To further expand on my fondness for Stinking Cloud, it's great as an area denial effect. Unless the targets are poison immune (monks, druids, or gear), it's AoE with a round/level duration. Even against high saves, everyone rolls a 1 eventually. Its daze shuts down most offensive actions and renders characters without uncanny dodge flat-footed.</div></blockquote>\nI've been curious about Stinking Cloud, and crowd control in general. I don't see it on most \"spell lists\" I've come across. I'm going to go back and re-roll that level up and try it out. As I mentioned earlier, I was running Dire Wolf Summon + Flame Weapon, kind of missing it now. May go back to that for a little longer.<br/>\n<br/>\nYeah, still feeling very much dependent on the henchmen. Particularly Grimgnaw, that delightfully creepy Dwarven Monk is a beast when he gets Dark Moon Robes (perma-haste) on one of his level-ups. Unfortunately, can't use Flame Weapon on him since he fights unarmed. I am using the Henchman AI/Inventory mod, so could give him a kama, but... naaahhh.<br/>\n<blockquote><div>Yeah, the normal lich in the OC is not immune to death magic as it should be.</div></blockquote>\nApparently so, because I swear, it worked. Playing in normal mode, so that may have something to do with it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:01 PM - Feb 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">IMO there is a tangible shift in power for sorcerers when they reach level 8 - 10.<br/>\nBefore that you rely on summons/ familiars/ henchmen as buffed frontliners.<br/>\nOnce you get Stoneskin and Improved invisibility in addition to your lower level buffs, your character can take more punishment, becomes more independent and can start casting attack spells more regularly. Fireball will still be effective at those levels, both in level 3 and 4 slots.  But once you get Firebrand it becomes your new Big Stick.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "5:08 PM - Feb 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>IMO there is a tangible shift in power for sorcerers when they reach level 8 - 10.<br/>\n Before that you rely on summons/ familiars/ henchmen as buffed frontliners.</div></blockquote>\nSome interesting advice I came across from another forum from many years ago was this:<br/>\n<br/>\nLevels 1-3, hide behind the tank.<br/>\nLevels 4-6, you still hide behind the tank, but now you can cast Identify a lot.<br/>\nLevels 7-low teens, keep the tank around but now you can deal some damage.<br/>\nLevels low teens and up, ditch the tank. You ARE the tank.<br/>\n<br/>\nI re-rolled that last level-up and went back and fought Brother Toras again with Linu, the Cleric hench, in tow. I had the party \"stand their ground\" and pulled most of his minions back to us before running in for him, this time.<br/>\n<br/>\nLinu and her bear worked his few remaining minions, my sorc and her wolf handled bro Toras. Lesser Spell Mantle scroll for her (along with a ring of elemental resistance), Lesser Spell Breach scroll for him. X-bow+flame bolts, Wolf+Flame Weapon, Melf's Acid Arrow and Magic Missiles and he actually went down fairly quick.<br/>\n<br/>\nThat's another thing, I'm using scrolls a lot more with this character. Others I've played have always ended up with a huge collection of unused scrolls in their packs because I kept holding onto to them for \"that really important fight that's surely to come soon.\"<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:10 PM - Feb 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>UrbanHermit wrote: <a data-post-id=\"19158\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19158&amp;sid=93faaa0f12f894bb1498041493b88fd2#p19158\">↑</a><div class=\"responsive-hide\">Feb 18, 2020</div></cite><blockquote><div>IMO there is a tangible shift in power for sorcerers when they reach level 8 - 10.<br/>\n Before that you rely on summons/ familiars/ henchmen as buffed frontliners.</div></blockquote>\nSome interesting advice I came across from another forum from many years ago was this:<br/>\n<br/>\nLevels 1-3, hide behind the tank.<br/>\nLevels 4-6, you still hide behind the tank, but now you can cast Identify a lot.<br/>\nLevels 7-low teens, keep the tank around but now you can deal some damage.<br/>\nLevels low teens and up, ditch the tank. You ARE the tank.\n</div></blockquote>\nInteresting advice!<br/>\nMight be specific to the Original Campaign. Been a while since I played it. It might work there.<br/>\nI can see how keeping the summons / etc alive longer helps with ongoing damage<br/>\nYour spells are major contributors to your ability to tank, if they run out or get removed (by a dispel or breach spell) then you should let others tank.<br/>\nThe low AC of mages and low hit die (d4/level) means tanking is not the best for that class.<br/>\nAs a result some environments are not favorable for this strategy unless you build specifically to tank as a mage (such as Mestil's Half-Dead Juggernaut)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "7:27 AM - Feb 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"19163\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19163&amp;sid=93faaa0f12f894bb1498041493b88fd2#p19163\">↑</a><div class=\"responsive-hide\">Feb 18, 2020</div></cite>Your spells are major contributors to your ability to tank, if they run out or get removed (by a dispel or breach spell) then you should let others tank.<br/>\nThe low AC of mages and low hit die (d4/level) means tanking is not the best for that class.</div></blockquote>\nOkay, out of respect and admiration for the \"elite\" character builders here, I guess it's time for me to confess... I'm not playing a pure Sorcerer. I gave her 3 levels of Bard. It's a theme build. You know... the singing sorceress thing. Yes, I'm aware that there are no real synergies with Sorcerer/Bard other than sharing Charisma. But, it <em>is</em> the OC and I knew this was basically going to be a henchman/summons support play-through, ending at around level 17, and decided to have a little RP fun with it.<br/>\n<br/>\nI used the Bard levels for skill dumps. 10 points Tumble, 5 points UMD at level 10. With 20 CHA that makes 10 UMD which allowed her to buy monk gear from the priest at Tyr's Temple in chapter 2. Dark Moon Robes for the perma-haste +4 AC, and Sun Soul Boots for the +2 Dodge AC. Add +1 from 12 DEX and +2 from Tumble and she's got 19 AC unbuffed in cloth. Mage Armor + Shield + a potion of Barkskin and she's at 28 AC.<br/>\n<br/>\nLevel 3 Bard Song gives +1 Attack and +2 Damage, essentially making it a temporary universal combo of Weapon Focus + Weapon Specialization for the henches and summons, as well as her own X-bow shots. Extra Music taken at Bard 1 lets her sing 7 times per day.<br/>\n<br/>\nAt level 12, now, she's got Extend Spell, Greater Spell Penetration and Spell Focus: Evocation (in anticipation of Firebrand).<br/>\n<br/>\nOther than delaying her Sorcerer levels, it seems to be working pretty good, so far. But it's the Sorcerer class that has me the most interested, and hence, my inquiry here. I have every intention of playing a pure Sorcerer for a second run through SoU/HotU after this friendly little romp through the OC. Which, I imagine, is where the real Sorcerer training will take place. Following that I'd finally like to get around to taking on <em>The Aielund Saga</em> with an Exalted Sorceress, or similar build.<br/>\n<br/>\nI humbly thank those who have thus far replied and appreciate your kind indulgence of my ramblings.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:42 AM - Feb 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh wow... you are playing a.... Bard-orcerer?<br/>\n<em class=\"mention\">@Aquarius 233</em> is pretty good at them. <br/>\nVery smart. Small amounts of minor classes are very good to mix!<br/>\nOccasionally she can equip a shield, medium armor and hit things too<br/>\nGreat fun. Health is low but in the OC I guess you can survive ok.<br/>\n<br/>\nAs for the confessional, one of the moderators Stag / Mick or Empyre can help with that. Mick is a much more experienced tip-top sorcerer out of all of them who I am learning from his postings, but <em class=\"mention\">@Stagmeister</em>  I believe is enthusiastically attempting in diversifying his talent pool. Experience versus enthusiasm? Who do you choose in this situation? Hard one...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "12:52 PM - Feb 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"19170\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19170&amp;sid=93faaa0f12f894bb1498041493b88fd2#p19170\">↑</a><div class=\"responsive-hide\">Feb 19, 2020</div></cite> Experience versus enthusiasm? Who do you choose in this situation? Hard one...</div></blockquote>\nCheck their foreheads for the dents from the respawn pole..    :)   go with the one with less dents...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:10 PM - Feb 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"19170\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19170&amp;sid=93faaa0f12f894bb1498041493b88fd2#p19170\">↑</a><div class=\"responsive-hide\">Feb 19, 2020</div></cite>\nAs for the confessional, one of the moderators Stag / Mick or Empyre can help with that. Mick is a much more experienced tip-top sorcerer out of all of them who I am learning from his postings, but <em class=\"mention\">@Stagmeister</em>  I believe is enthusiastically attempting in diversifying his talent pool. Experience versus enthusiasm? Who do you choose in this situation? Hard one...</div></blockquote>\nInteresting use of the word \"enthusiastically\" there, Orion - try \"resentfully\" or \"reluctantly\" and you'll be closer to the truth of it. Go with Mick every time - I know I plan to.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:13 PM - Feb 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, everyone knows (well, except Sorcs) that they are the less intelligent version of Wizards, anyway...<br/>\n<br/>\nOh, and narcissistic!<br/>\n<br/>\nYep.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:19 PM - Feb 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"19186\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19186&amp;sid=93faaa0f12f894bb1498041493b88fd2#p19186\">↑</a><div class=\"responsive-hide\">Feb 19, 2020</div></cite>Yeah, everyone knows (well, except Sorcs) that they are the less intelligent version of Wizards, anyway...<br/>\n<br/>\nOh, and narcissistic!<br/>\n<br/>\nYep.</div></blockquote>\n*To self*: Must resist that bait...must resist that...must resist...must...<span style=\"color:#999999\">must</span><span style=\"color:#cccccc\">...m...</span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "5:19 PM - Feb 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Woohoo! Ice Storm! Finally, she feels like she's got a little magical muscle up her sleeves. And who needs to take Fireball when you've got Staves of Power dropping at your feet? She's gotten 3 of them, so far. <br/>\n<br/>\nI've seen Vampiric Touch and Negative Energy Burst show up as popular choices on spell lists for level 3. Any thoughts on those?<br/>\n<br/>\n<blockquote><div>Yeah, everyone knows (well, except Sorcs) that they are the less intelligent version of Wizards, anyway...<br/>\n<br/>\nOh, and narcissistic!</div></blockquote>\nBut, all that Charisma... Ooohhh, sooo charming and persuasive. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:35 PM - Feb 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What's not to like about NEB?<br/>\n<br/>\nArea effect (small, but still...), does damage AND lowers Str based on level (yummy!) AND is one of the best ways to buff and heal your Undead pal while simultaneously hurting the enemy!<br/>\n<br/>\nAwesome sauce!<br/>\n<br/>\nAs for the Vampiric Claw...well, everyone wants to play as a Vampire, right?<br/>\n<br/>\nSeriously, it is great for healing yourself while simultaneously damaging your opponent. Especially behind damage walls!<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "12:31 AM - Feb 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"19215\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19215&amp;sid=93faaa0f12f894bb1498041493b88fd2#p19215\">↑</a><div class=\"responsive-hide\">Feb 20, 2020</div></cite>Especially behind damage walls!</div></blockquote>\nI'm guessing that would be things like spell mantles?<br/>\n<br/>\nI tried the suggestion of <em class=\"mention\">@Ten Pura</em> and went with Stinking Cloud. Been having mixed results, but haven't used it a whole lot, yet. I definitely like the effect it has when it does land on multiple foes, though.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:46 AM - Feb 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Damage Shields: Try using mestils Acid Sheath and Stoneskin again a meleer who doesn't hit too hard<br/>\nElemental Shield is good too<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "7:25 PM - Feb 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Damage Shields... ahem... yes, of course... I knew that. *Says the absent minded old fart* Haven't bothered with them yet because we have been too busy <em>avoiding</em> being hit.<br/>\n<br/>\nI've done a little more playing around with \"snare\" type spells. Stinking Cloud saved Grimgnaw's butt last night. Using it and then dropping an Ice Storm seems rather effective. And watching zombies fall down in grease is fun.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "7:36 PM - Feb 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">dont forget you can layer them too... grease for the reflex impaired,   stinking cloud for the sickly ones...   acid cloud just cause it looks like jello.....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:16 AM - Feb 22, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And this is what Sorceress &amp; spellcasters are in general UrbanHermit, choices.<br/>\nBrute force (IGMS), damage shields, epic summoning, transformations, death spells, etc.<br/>\nYou always have choices to make regarding any situation presented.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "7:27 PM - Feb 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">wow, I had to check it in the toolset... they really forgot to add death immunity to brother toras :O<br/>\nor maybe they removed it from his skin on purpose? he has all the other usual undead immunities, like crits, disease/poison, drain, mind affect and paralisys<br/>\n<br/>\nEDIT\n<blockquote><div><cite>webshaman1 wrote:</cite>Yeah, the normal lich in the OC is not immune to death magic as it should be.</div></blockquote>\nOkay, I thought this was just a guess, but it's actually a statement.<br/>\n<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Lich\" rel=\"noreferrer\" target=\"_blank\">Lich on nwn wiki.</a><br/>\n\"A lich has most of the usual undead immunities, specifically to critical hits, disease, level drain, ability drain, mind-affecting spells, paralysis, poison, and sneak attacks. However, a lich does not have the usual undead immunity to death magic. <em>(Probably a bug.)\"</em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "7:48 PM - Feb 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And me in my newbness didn't even give it a second thought when I looked at my scrolls and said, \"Let's see what <em>this</em> one does to the Lich?\" <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nI'm glad I mentioned it. I might have been left wondering why, in future non-OC undead battles, my scrolls of Death Finger weren't working. Do you get a combat message indicating immunity to death magic if you try that in other campaigns/worlds?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:45 PM - Feb 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>UrbanHermit wrote: <a data-post-id=\"19364\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19364&amp;sid=9eca3528eefb1d3bcae669ce4301cbf6#p19364\">↑</a><div class=\"responsive-hide\">Feb 25, 2020</div></cite>Do you get a combat message indicating immunity to death magic if you try that in other campaigns/worlds?</div></blockquote>\nIf you right click on your target, you see a list of effects and immunities, at least for vanilla NWN.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "9:13 PM - Feb 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote: <a data-post-id=\"19366\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19366&amp;sid=9eca3528eefb1d3bcae669ce4301cbf6#p19366\">↑</a><div class=\"responsive-hide\">Feb 25, 2020</div></cite>If you right click on your target, you see a list of effects and immunities, at least for vanilla NWN.</div></blockquote>\nYes, you mentioned that earlier. Although, I was previously asking about planning for any foreseeable foes and not just checking what is immediately in front of you. Still, the reminder is noted... that is something I need to get into the habit of doing.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:58 PM - Feb 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>hunearo wrote: <a data-post-id=\"19335\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19335&amp;sid=9eca3528eefb1d3bcae669ce4301cbf6#p19335\">↑</a><div class=\"responsive-hide\">Feb 24, 2020</div></cite>wow, I had to check it in the toolset... they really forgot to add death immunity to brother toras :O<br/>\nor maybe they removed it from his skin on purpose? he has all the other usual undead immunities, like crits, disease/poison, drain, mind affect and paralisys<br/>\n<br/>\nEDIT\n<blockquote><div><cite>webshaman1 wrote:</cite>Yeah, the normal lich in the OC is not immune to death magic as it should be.</div></blockquote>\nOkay, I thought this was just a guess, but it's actually a statement.<br/>\n<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Lich\" rel=\"noreferrer\" target=\"_blank\">Lich on nwn wiki.</a><br/>\n\"A lich has most of the usual undead immunities, specifically to critical hits, disease, level drain, ability drain, mind-affecting spells, paralysis, poison, and sneak attacks. However, a lich does not have the usual undead immunity to death magic. <em>(Probably a bug.)\"</em></div></blockquote>\nThey likely forget it/it's a bug, that's not uncommon at all to happen in games with such broad scope when the developer teams try to get them ready for release in a relatively short amount of time. Many such \"mistakes\" can be found in the game &amp; other games too. For example, if you look at Baldur's Gate files for Drizzt in the program you will see that in the initial version (not the EE) he had his weapons equipped on his head slot &amp; his game class was \"Innocent!\" Or that for Neverwinter Nights, Giants &amp; the rest of the big guys might wield two-handed swords but they actually inflict damage equal to the one-handed version of it, some of them have actually equipped shields that don't show properly in their game models, etc. <br/>\n<br/>\nBack then (late 90's / mid-2000s) the developer teams were counted in a dozen people or two at most, nowadays it is common for developer teams to consist of 200+ members &amp; they still release games with several bugs that they later \"fix\" through live updates...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:06 AM - Feb 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote: <a data-post-id=\"19370\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19370&amp;sid=9eca3528eefb1d3bcae669ce4301cbf6#p19370\">↑</a><div class=\"responsive-hide\">Feb 25, 2020</div></cite>Back then (late 90's / mid-2000s) the developer teams were counted in a dozen people or two at most, nowadays it is common for developer teams to consist of 200+ members &amp; they still release games with several bugs that they later \"fix\" through live updates...</div></blockquote>\nIt's incredible that such small teams could achieve so much.<br/>\nI think these pioneering individuals had something special to succeed. Perhaps qualities such as vision, drive, ambition, passion and creativity. <br/>\nSheer workforce certainly helps I guess, but I do worry about overly hierarchical corporate environments which could stifle creativity.<br/>\nAt the other extreme, I read about other environments exist where employees can do what they wish, work on what project they wish, and decisions are made by democratic voting by employees rather than management, marketing or shareholders deciding.<br/>\nReally interesting to know what it is about environments that fosters successful, creative and productive teams.<br/>\n<br/>\nLarian Studios seems to be having a good run securing the Baldurs Gate 3 project from Wizards of the Coast. I suspect WotC already decided to choose them based on their track record, well before they brought their sales pitch.<br/>\nIn contrast Blizzard is having a terrible run over the last 6-12 months with WC3 Reforged (<a class=\"postlink\" href=\"https://www.metacritic.com/game/pc/warcraft-iii-reforged\" rel=\"noreferrer\" target=\"_blank\">a user score of 0.5 / 5 on MetaCritic</a>!), Overwatch and other stuff receiving very negative press and reviews, and it is interesting to see how they will drag themselves out of the troubles they are in. <br/>\nI suspect they have forgotten the consumer and the importance of producing a great product that people want to buy into that they see as good value.<br/>\n<br/>\nI was shocked to read installing Reforged deleted your old WC3 installation, all the WC3 old custom maps one made, and any further custom maps that you create become the copyright property of Activision Blizzard. I think it's a very delayed kneejerk reaction to Dota 2 and League of Legends success, which were inspired by an old WC3 multiplayer custom map.<br/>\nHope that doesn't happen with NWN, for all the custom module makers and DMs for PW's out there. Hours of labor and love these community members have put in, can be lost in an instant by bad decision makers, as happened when the Bioware Forums &amp; NWN Vault shut down.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:33 AM - Feb 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I hope Blizzard, EA &amp; the rest will get the message (when they start to lose $$) but all companies should look upon CD-Project Red (The Witcher, series) &amp; see why they are so successful. Their Diablo remaster was a total joke-they just changed the resolution &amp; you couldn't see the sprites cause they were so small...A lone modder would do better than that! <br/>\n<br/>\nWe need more passionate people that don't care only for the $$-grab. <br/>\nSome things were totally better in the old days, for sure.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "8:12 PM - Feb 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"19373\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19373&amp;sid=70ff5852d880c1bd1eb1faa4f2ae5df4#p19373\">↑</a><div class=\"responsive-hide\">Feb 26, 2020</div></cite>Hope that doesn't happen with NWN, for all the custom module makers and DMs for PW's out there. Hours of labor and love these community members have put in, can be lost in an instant by bad decision makers, as happened when the Bioware Forums &amp; NWN Vault shut down.</div></blockquote>\nWell, isn't this an interesting turn in the discussion... which I don't mind at all, really. I've gotten more than I expected out of it, already.<br/>\n<br/>\nThis game still impresses me with how timeless it is and how well the community has held together. I was delighted to see, upon my return to the game, that the Vault and all of it's goodness was still around. Even many of the old forum discussions and guides from days gone by are just a Google search away.<br/>\n<br/>\n<br/>\n<blockquote><div><cite>Valerfor wrote:</cite>Their Diablo remaster was a total joke-they just changed the resolution &amp; you couldn't see the sprites cause they were so small...A lone modder would do better than that! <br/>\n<br/>\nWe need more passionate people that don't care only for the $$-grab. <br/>\nSome things were totally better in the old days, for sure.</div></blockquote>\nIt is surprising, to me, how the \"old graphics\" can still evoke a sense of atmosphere when used in the right way. Combined with good writing, voice acting and a wonderful musical score, it continues to be emotionally engaging, even when going back through old, familiar content.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:23 PM - Feb 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>UrbanHermit wrote: <a data-post-id=\"19387\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19387&amp;sid=70ff5852d880c1bd1eb1faa4f2ae5df4#p19387\">↑</a><div class=\"responsive-hide\">Feb 26, 2020</div></cite><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"19373\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19373&amp;sid=70ff5852d880c1bd1eb1faa4f2ae5df4#p19373\">↑</a><div class=\"responsive-hide\">Feb 26, 2020</div></cite>Hope that doesn't happen with NWN, for all the custom module makers and DMs for PW's out there. Hours of labor and love these community members have put in, can be lost in an instant by bad decision makers, as happened when the Bioware Forums &amp; NWN Vault shut down.</div></blockquote>\nWell, isn't this an interesting turn in the discussion... which I don't mind at all, really. I've gotten more than I expected out of it, already.<br/>\n<br/>\nThis game still impresses me with how timeless it is and how well the community has held together. I was delighted to see, upon my return to the game, that the Vault and all of it's goodness was still around. Even many of the old forum discussions and guides from days gone by are just a Google search away.<br/>\n<br/>\n<br/>\n<blockquote><div><cite>Valerfor wrote:</cite>Their Diablo remaster was a total joke-they just changed the resolution &amp; you couldn't see the sprites cause they were so small...A lone modder would do better than that! <br/>\n<br/>\nWe need more passionate people that don't care only for the $$-grab. <br/>\nSome things were totally better in the old days, for sure.</div></blockquote>\nIt is surprising, to me, how the \"old graphics\" can still evoke a sense of atmosphere when used in the right way. Combined with good writing, voice acting and a wonderful musical score, it continues to be emotionally engaging, even when going back through old, familiar content.</div></blockquote>\nYou're not wrong there, UrbanHermit. I'm currently finishing Baldur's Gate I again and loving it (I'm playing with Trilogy, so will be transitioning into BG II). It's non-EE so retains all that made and makes it glorious. Minsc FTW!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "9:14 PM - Feb 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"19388\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19388&amp;sid=70ff5852d880c1bd1eb1faa4f2ae5df4#p19388\">↑</a><div class=\"responsive-hide\">Feb 26, 2020</div></cite> Minsc FTW!</div></blockquote>\nWhoever came up with the concept of a miniature giant space hamster in a D&amp;D setting was... brilliant.<br/>\n<br/>\n\"Go for the eyes, Boo. Go for the eyes!\"<br/>\n<br/>\nI was only able to get through a few hours of Baldur's Gate before losing interest in it, sorry to say. Not the story or characters, but the game format put me off, at the time. I know it's a classic and keep telling myself I need to give it another go, now that I'm more familiar with turn-based games and D&amp;D in general. We'll see... <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nFor now, back to the task at hand. Chapter 3 of the OC and the continuing adventures of my singing sorceress.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:27 AM - Feb 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, the Giant Space Hamster is from Spelljammer (so before BG) - <a class=\"postlink\" href=\"https://forgottenrealms.fandom.com/wiki/Giant_space_hamster\" rel=\"noreferrer\" target=\"_blank\">https://forgottenrealms.fandom.com/wiki ... ce_hamster</a><br/>\n<br/>\nAnd one of the variants is, of course, <a class=\"postlink\" href=\"https://forgottenrealms.fandom.com/wiki/Miniature_giant_space_hamster\" rel=\"noreferrer\" target=\"_blank\">https://forgottenrealms.fandom.com/wiki ... ce_hamster</a><br/>\n<br/>\nThe real genius was making a loony Ranger with a Miniature Giant Space Hamster as an Animal Companion!  Then matching that up with the right voice actor.<br/>\n<br/>\nThe rest is history!<br/>\n<br/>\nBG was a masterpiece of a game!  The amount of D&amp;D lore that was used to make it is incredible.  Truly jaw-dropping imo.  I mean Bioware really packed a lot of different stuff in BG.  And then there is the design, truly a masterpiece of wilderness adventuring with dungeon and city stuff put in to boot!  I especially like the \"open world\" sandbox feel of the game.<br/>\n<br/>\nYou can basically just go a direction, as you please.  There are very little limitations - a novel thing back then.  And everything still works, if you do go off the beaten path.<br/>\n<br/>\nFilling all those areas with stuff, and making it all work must have been a massive undertaking!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "3:25 AM - Feb 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote:</cite>BG was a masterpiece of a game!  The amount of D&amp;D lore that was used to make it is incredible.</div></blockquote>\n\nAs I previously said, NWN was my introduction to things D&amp;D, so I have some sentimental attachment to it. Never got into PnP, in spite of an interest in Sword and Sorcery Fantasy. Went to a game store a few weekends once and sat in on some beginner sessions, but never developed any lasting interest.<br/>\n<br/>\nAaaand... you guys got to me. I found a copy of BG The Original Saga (+ Tales of the Sword Coast) on Amazon for $12.99 and figured, what the heck, why not. I suppose I could have found a download online, but I think the box will look cool sitting on a shelf. Here's to hoping it'll run on Win10.<br/>\n<br/>\nMeanwhile, back in a cave in Moonwood... holy moly... my saucy little sorceress just took out a bunch of Drow mages and assassins all by her lonesome. Well, the wand of Summon Dire Spider she had looted helped... just a little. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:33 PM - Feb 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>UrbanHermit wrote: <a data-post-id=\"19392\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19392&amp;sid=70ff5852d880c1bd1eb1faa4f2ae5df4#p19392\">↑</a><div class=\"responsive-hide\">Feb 27, 2020</div></cite>\nAaaand... you guys got to me. I found a copy of BG The Original Saga (+ Tales of the Sword Coast) on Amazon for $12.99 and figured, what the heck, why not. I suppose I could have found a download online, but I think the box will look cool sitting on a shelf. Here's to hoping it'll run on Win10.<br/>\n<br/>\nMeanwhile, back in a cave in Moonwood... holy moly... my saucy little sorceress just took out a bunch of Drow mages and assassins all by her lonesome. Well, the wand of Summon Dire Spider she had looted helped... just a little. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /></div></blockquote>\nJust as a little tip: it's worth getting BGII - both Shadows of Amn and Throne of Bhaal, which will expand your choices dramatically - much as SoU and HotU add colour to NwN by adding other classes, etc. If you download BG Trilogy or Weidu (both free), you'll also be able to continue your journey all the way to level 40 (BGI finishes with you between level 8 and 12 depending on class). I also play with Dark Side of the Sword Coast installed (it's also free and gives a huge add-on adventure to BGI and enables uncapped xp).<br/>\n<br/>\nAnyway, I digress. It might be that my poor old brain is staggering to a gentle halt, but I don't remember Drow in Moonwood. Cultists, yes; dragons, yes; giants, trolls and ogres, yes; but Drow?<br/>\n<br/>\n...Oh, hang on, just got it! In the Oubold quest! Sorry. Well done!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "6:15 PM - Feb 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"19400\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19400&amp;sid=70ff5852d880c1bd1eb1faa4f2ae5df4#p19400\">↑</a><div class=\"responsive-hide\">Feb 27, 2020</div></cite>Just as a little tip: it's worth getting BGII - both Shadows of Amn and Throne of Bhaal, which will expand your choices dramatically - much as SoU and HotU add colour to NwN by adding other classes, etc. If you download BG Trilogy or Weidu (both free), you'll also be able to continue your journey all the way to level 40 (BGI finishes with you between level 8 and 12 depending on class). I also play with Dark Side of the Sword Coast installed (it's also free and gives a huge add-on adventure to BGI and enables uncapped xp).</div></blockquote>\nVery interesting. I took a quick look at Weidu. Definitely like the idea of playing BG with the improved BG2 engine. And I see BG2 Ultimate Collection, also for $12.99, at Amazon. As Sharwyn would say, \"Done and done.\" Starting to feel a sense of anticipation for that future adventure.<br/>\n<br/>\n<blockquote><div>...Oh, hang on, just got it! In the Oubold quest! Sorry. Well done!</div></blockquote>\nThat's the place. Actually, she had Boddyknock along for the ride. When first talking to him to get his story started, he mentioned an interest in the Hill Giants in the area. So, in a moment of RP, I decided to take him along to satisfy his gnomish curiosity. Not that m'lady need another sorcerer at her side, but she was curious herself to see what spells he would use. <br/>\n<br/>\nPrismatic Spray is very pretty! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nAnyhow, she got distracted by the cave and Mr. Glinckle thought it would be a good idea to run through a Drow Priest's Blade Barrier. That didn't go so well and he was whisked away back to Tyr's Temple. Upon seeing that she decided to borrow from the gnome's sense of logic and made a tactical decision... run.<br/>\n<br/>\nOne thing I have learned for sure, playing a caster... running is always an option. She waited for the BB of death to wear out and went back to carry on. And in all fairness, I did have to reload once when she failed a death spell. But then, that's what the \"G\" key is for, right? <br/>\n<br/>\nAll in all, it was a successful encounter and I was quite pleased with how we handled it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:08 PM - Feb 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As long as we're talking about Infinity Engine games, there are also Icewind Dale I and II.  Icewind Dale II is the only other game besides NWN that uses the 3.0 rules, although its interpretation of the rules is quite different.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:16 PM - Feb 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Very true, Empyre, though I believe they billed Icewind II as using 2.5 rules, and it was the only game that did. I confess, though, I've never finished it. I did/do enjoy Icewind I - the only downside in my book is the lack of interaction between characters (because you create all of them), though others may see that as a positive. It's also a wee bit too \"channelled\" for my liking - \"You'll go no more a roving...\"<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:57 PM - Feb 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Since we are off topic now :<br/>\n<br/>\nBGI&amp;II EE, with Dragonspire inbetween is pretty good!<br/>\n<br/>\nI never really did like Throne of Bhaal all that much, tbh.  But BGII, aside from Irenicus (which as an NPC is done well imo), who I personally don't like due to some of the things that happens (specifically, the Prison).  I won't mention anything else, to avoid spoilers.<br/>\n<br/>\nBut to the point - the introduction of the new Companions, areas, and the updated Engine is just good stuff!  It allows for a totally different Party feel, with the interactions often being hilarious and fun.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:04 PM - Feb 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Icewind Dale was always second-fiddle to Baldur's Gate Saga. You wonder from dungeon to dungeon &amp; kill things, buy more stuff then kill bigger things &amp; somewhere in there is a story that may or may not get to you. There is no interaction between the NPCs neither the brilliant magic system of its big brother. That being said, IWD 1 is superior to IWD 2 &amp; it has some strengths versus BG, namely the lovely music &amp; art-style. There is also more combat involved in general. <br/>\n<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/GBqL1ZjVCRc\" style=\"background:url(https://i.ytimg.com/vi/GBqL1ZjVCRc/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><br/>\n<br/>\nPlanescape Torment goes the other way around. It is considered by some to be even greater than BG (it is not) because the story is superb (nameless one) the interactions between the NPCs are the best but there is one big caveat. There is almost next to no combat. It also features some very \"cinematic\" high-level spells, those must have been the best the world had seen by that time, truly next level in production value. <br/>\n<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/OKZZEPoVb4c\" style=\"background:url(https://i.ytimg.com/vi/OKZZEPoVb4c/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><br/>\n<br/>\nAnd then, there is Temple of Elemental Evil, not an Infinity Engine game but a good D&amp;D 3.0 RPG with similar UI to Baldur's Gate but with two important differences. One is that the game is turn-based &amp; not real-time with pause (better for some people, but I prefer real-time action)  &amp; the other is that the game is taking place mostly in a big dungeon crawl, so its scope is limited in comparison. Still a good game though &amp; one of the last of that era. <br/>\n<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/xNPqwMcSiXE?start=155\" style=\"background:url(https://i.ytimg.com/vi/xNPqwMcSiXE/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><br/>\n<br/>\nIn my opinion, though, Baldur's Gate Saga trumps them all, with ease. It doesn't get more epic than that, it simply doesn't!<br/>\n<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/-qJMJgLEQJs\" style=\"background:url(https://i.ytimg.com/vi/-qJMJgLEQJs/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "1:54 AM - Feb 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Wow... so much passion for the older games. I just spent the past couple of hours or so reading up on things related to BG. Definitely looking forward to taking it for another spin, now.<br/>\n<blockquote><div><cite>Valerfor wrote:</cite>That being said, IWD 1 is superior to IWD 2 &amp; it has some strengths versus BG, namely the lovely music &amp; art-style.</div></blockquote>\nAnd I see that the music was done by Jeremy Soule. I'm familiar with his work from the Guild Wars games. Even after thousands of hours of gameplay, I still enjoy hearing it and feeling the nostalgia it evokes from those early adventures back in 2005. He is truly a gifted composer.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:08 PM - Feb 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I didn't know that (about Jeremy Soule)...And to think I was playing GW2 a lot for a solid 2 years. <br/>\nI do know the blond guy's voice is from Peter Cullen (Optimus Prime &amp; Predator) however. They did an amazing job with it admittedly. <br/>\n<br/>\nAbout the passion of the old games, you're right UH, I think they did an original &amp; passionate job with them. Not all, but there's quite a few of them that all of us will immediately recognize as favorites or games that had substance, like diablo, starcraft, AoE2, Baldur's Gate, Doom, etc. to name but a few. <br/>\n<br/>\nHeh, Empyre, still designs maps for the original Doom (or so I think) once in a while.<br/>\nAs long as you're having fun with them, there is no old or new, they are just good games I guess, just like with the Neverwinter Nights <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:19 PM - Feb 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote: <a data-post-id=\"19421\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19421&amp;sid=42b09f1c6f0fec17f8a60aaa60a3cff5#p19421\">↑</a><div class=\"responsive-hide\">Feb 28, 2020</div></cite>About the passion of the old games, you're right UH, I think they did an original &amp; passionate job with them. Not all, but there's quite a few of them that all of us will immediately recognize as favorites or games that had substance, like diablo, starcraft, AoE2, Baldur's Gate, Doom, etc. to name but a few. <br/>\n<br/>\nHeh, Empyre, still designs maps for the original Doom (or so I think) once in a while.<br/>\nAs long as you're having fun with them, there is no old or new, they are just good games I guess, just like with the Neverwinter Nights <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "7:42 PM - Feb 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sorry to hear that, Mick. The only physical ailment I've suffered, other than a few extra pounds from snacking while gaming, is that I've got a callus on the lower-inside part of my hand, just below the palm, from holding a mouse for hours on end. <br/>\n<br/>\nMusic is very important in games, IMHO. I was on Teamspeak with someone once, while playing Guild Wars 2, and commented on how much I loved a certain piece that was playing at the moment. He told me he didn't know what I was referring to because he had the music turned off. I was like, \"What.... SACRILEGE!\" <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:56 PM - Feb 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">For my money, the best NwN music comes in the Drow township of Lith My'athar in HotU and Fairloch in Aielund (just to tease you further down NwN's many tortured paths...)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "11:24 PM - Feb 29, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"19388\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19388&amp;sid=42b09f1c6f0fec17f8a60aaa60a3cff5#p19388\">↑</a><div class=\"responsive-hide\">Feb 26, 2020</div></cite>You're not wrong there, UrbanHermit. I'm currently finishing Baldur's Gate I again and loving it (I'm playing with Trilogy, so will be transitioning into BG II). It's non-EE so retains all that made and makes it glorious. Minsc FTW!</div></blockquote>\nNot to drag this into anymore of a BG discussion, but since you <em>did</em> mention it... <br/>\n<br/>\nI see in a certain <a class=\"postlink\" href=\"https://tamrielfoundry.com/articles/the-ultimate-baldurs-gate-experience/\" rel=\"noreferrer\" target=\"_blank\">Trilogy installation guide</a> that there are a lot of additional \"recommended\" mods. Things like difficulty balances, NPC packs for banter and romances, extra quests (\"unfinished business\"), and so on.<br/>\n<br/>\nI like the idea of the continuous playthrough, bug fixes and graphics improvements, but I just want to enjoy the main story and not get bogged down in a bunch of extras <em>unless</em> they actually do add to the experience.<br/>\n<br/>\nAny thoughts on this stuff?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:02 PM - Mar 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I can't remember for the life of me what I included in Triology, but I do recall I got all my info from Spellhold Studios - which I assume is still going - if that's any use?<br/>\n<br/>\nInstalling Triology is by no means mandatory, but its main benefit is that those party members you'll likely have travelled with during BG1 who are also available in BG2 (by no means all of them) will retain the levels and skills you've given them during the first campaign (weapon proficiencies, spells, etc), while without Trilogy they will have their default skillset for BG2.<br/>\n<br/>\nYou will be given romance options in BG2 (it doesn't feature in BG1), regardless of whether you install Trilogy or not, one of which in particular brings plenty of xp as it progresses through its long-term unfolding. You are, of course, free to decline them (or indeed have your prospective \"partner\" chuck you if you give the \"wrong\" responses).<br/>\n<br/>\nThere are also many side-quests in BG2 given to you by NPCs (some of which require said NPC to travel with you, but most do not), together with your own \"stronghold\" quest (which depends on what sort of character you're playing - warrior, mage, thief, etc). These all add colour, as well as xp and gear, but the main point of them is to get you to the level you will need to be to have any chance of success by the time you reach the finale. This is as true for BG1 as it is for BG2. Throne of Bhaal is much more linear (and all the poorer for it). In essence, explore the world of Baldur's Gate as much as you can - it's a marathon, not a sprint!<br/>\n<br/>\nHope this helps a bit.<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: I would still install Dark Side of the Sword Coast. Albeit it's an \"unofficial\" BG1 module, it's perfectly compatible with the main game and requires no additional installations. It brings with it more and better gear and foes, together with an assortment of additional companions. These will benefit you throughout, regardless of whether you decide to complete the Dark Side quest line or not.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:06 PM - Mar 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you have bought the original saga instead of the GOG release (Enhanced Edition) then there are three primary ways to play the game: <br/>\n<br/>\na) Play it like Stag does, with the <span style=\"text-decoration:underline\">Trilogy mod</span>, that may take hundreds of other mods &amp; stack them to the base game &amp; offers a sort of pseudo-continuity between BG I &amp; II. <br/>\n<br/>\nb) Play it with the <span style=\"text-decoration:underline\">Easy TuTu</span> setup which is a lot \"lighter\" than \"Trilogy\" &amp; offers a more plain-jane experience but closer to authentic. This is what I used to play after having a few of the Original Saga experiences. Here's the link to that =&gt; <a class=\"postlink\" href=\"https://usoutpost31.com/easytutu/\" rel=\"noreferrer\" target=\"_blank\">https://usoutpost31.com/easytutu/</a><br/>\n<br/>\nc) Play it with just the Original Game, it's Expansion &amp; the Baldurdash fixes. Unfortunately, I won't be able to show you that way because the domain/site has expired after twenty years or so &amp; it's fixes are instead incorporated to the Gibberlings3 fixpack (Baldur's Gate II Fixpack) that despite the name works perfectly well for BG1 as well.  Here's the link to the fixpack =&gt; <a class=\"postlink\" href=\"https://gibberlings3.github.io/Documentation/readmes/readme-bg2fixpack.html\" rel=\"noreferrer\" target=\"_blank\">https://gibberlings3.github.io/Document ... xpack.html</a><br/>\n<br/>\nNow, here is where these three ways differentiate from each-other: The Original Saga + Baldurdash fixpack is all using the BG1 engine to run everything. There is none of the BG2 spells or enhancements/nerfs to the game. It is the \"Vanilla\" thing. That means between others, that arrows, for example, are \"killers\" &amp; that there are no dual-wielding options or stoneskin spell yet, neither are available spell-triggers &amp; such. The weapons are all separated in very broad categories (swords long &amp; short for example, instead of katanas, longswords, short-swords, greatswords, etc.) &amp; there is a distinct \"Stoney\" UI that through it you play the game. <br/>\n<br/>\nVanilla Game Inventory UI<br/>\n<a class=\"postlink\" href=\"https://simg.chomikuj.pl/093f308e1ff8cd2d5640f1be262f46806222c09a?url=http%3A%2F%2Fwww.mobygames.com%2Fimages%2Fshots%2Fl%2F331013-baldur-s-gate-windows-screenshot-inventory-screen-team-members.png\" rel=\"noreferrer\" target=\"_blank\">https://simg.chomikuj.pl/093f308e1ff8cd ... embers.png</a><br/>\n<br/>\nThe Easy Tutu setup is using the BG II engine (&amp; all of its enchantments) to play both games meaning the game (BG1), overall, it's easier than intended because you can now have half-orc fighters that start with 19Str/19Con, you have dual-wielding &amp; you have Stoneskin for your mages. To counter that up, the game uses a few more spawns were it should &amp; it works quite well, especially if you have never seen the Original. Contrastingly, arrows are a lot weaker now, walking speed has been increased &amp; most importantly AD&amp;D's \"Kits\" for each class have entered the game. You'll no longer have a plain fighter but a lot of specializations to choose from, including the mighty Berserker. Paladins now have the Cavalier option &amp; Mages can now choose the Sorceress! The game is still awesome &amp; you'll quickly forget the differences once start playing, it's the gameplay that will keep you up the nights, not the graphics (as is the case with Neverwinter Nights). <br/>\n<br/>\nEasy TuTu Inventory UI<br/>\n<iframe allowfullscreen=\"\" data-s9e-mediaembed=\"imgur\" onload=\"var c=new MessageChannel;c.port1.onmessage=function(e){var d=e.data.split(' ');style.height=d[0]+'px';style.width=d[1]+'px'};contentWindow.postMessage('s9e:init','https://s9e.github.io',[c.port2])\" scrolling=\"no\" src=\"https://s9e.github.io/iframe/2/imgur.min.html#G3rXQ4v\" style=\"border:0;height:400px;max-width:100%;width:542px\"></iframe><br/>\n<br/>\n<br/>\nThe Trilogy setup is much like Easy TuTu but it also has the option for hundreds of mods that it handily manages for you (This is referring as \"The Big World setup\") &amp; it offers its own take on the transition between BGI &amp; II. The UI &amp; everything is completely BG II on this. <br/>\n<br/>\nBaldur's Gate Trilogy Inventory UI<br/>\n<a class=\"postlink\" href=\"https://media.moddb.com/images/members/1/283/282946/baldursgatetrilogy_inventory.jpg\" rel=\"noreferrer\" target=\"_blank\">https://media.moddb.com/images/members/ ... entory.jpg</a><br/>\n<br/>\n<br/>\nAnd just for contrast, the Enhance dEdition's Invenroty UI<br/>\n<a class=\"postlink\" href=\"https://us.v-cdn.net/5019558/uploads/FileUpload/ee/a11277ff86deecc06d0430acbe4506.jpg\" rel=\"noreferrer\" target=\"_blank\">https://us.v-cdn.net/5019558/uploads/Fi ... be4506.jpg</a><br/>\n<br/>\n<br/>\nAbout the Dark Side mod, I would personally avoid it for my first playthrough with the game. To put it simply it completely changes the gameplay balance of the game introducing high-magic variables in every category. NPCs, Items, Spells, Levels, Enemies, etc. but I would instead suggest you to try it after you have completed the Original game at least once. <br/>\n<br/>\nNow, my apologies for this wall-o-text but as a final comment, I would like to ask you (Stag or anyone else that knows BG II well enough). Doesn't the game music before you enter Yaga-Shura's temple reminds you of Basilis Poledouris CONAN?<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/pXkcoIWRUrY\" style=\"background:url(https://i.ytimg.com/vi/pXkcoIWRUrY/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "7:31 PM - Mar 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>Now, my apologies for this wall-o-text...</div></blockquote>\nNo apology needed. I really appreciate you taking the time to spell that all out. <br/>\n<br/>\n<br/>\n<blockquote><div><cite>Stagmeister wrote:</cite>Installing Triology is by no means mandatory, but its main benefit is that those party members you'll likely have travelled with during BG1 who are also available in BG2 (by no means all of them) will retain the levels and skills you've given them during the first campaign (weapon proficiencies, spells, etc), while without Trilogy they will have their default skillset for BG2.</div></blockquote>\nThat sounds appealing to me. Most likely going with that.<br/>\n<br/>\n\"Tutu\" rings a bell. I do believe I used it those 10 or 12 or so years ago when I tried the game out the first time. I'm playing on a 24\" widescreen monitor so any graphic improvements and the widescreen mod are absolute must haves. I'm not enough of purist to think I'll be missing anything by not going through the vanilla BG1 experience.<br/>\n<br/>\nThank you very much for the replies, guys. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202003/10759229_603549b179e3395290a770a92f41dd2f.jpg\" /></dl>\n</span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:48 PM - Mar 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah great then, after I read that few words \"widescreen mod\" &amp; the rest I'm sure now that you can handle pretty much anything with its installation. Keep in mind however that the story assumes that some of your friends in Bg1 have died, so...<br/>\nAnyway, I don't want to spoil more for you, unless you do want that info regardless. <br/>\n<br/>\nThe portrait looks lovely! <br/>\nBack when Black Isle started the game they have very limited funds so...It is rumored that almost all the women portraits in the game are, in fact, the same person, just with minor alterations. If you look more closely you'll see that  =&gt; <a class=\"postlink\" href=\"http://mikesrpgcenter.com/bgate/npcs.html\" rel=\"noreferrer\" target=\"_blank\">http://mikesrpgcenter.com/bgate/npcs.html</a><br/>\n<br/>\nBaldur's Gate &amp; Icewind Dale &amp; Planescape Torment, all use AD&amp;D 2nd Edition Rules. <br/>\nThac0 stands for (To Hit AC zero) and it's a simple subtraction of your roll vs the AC (Armor Class) of the target. <br/>\nFor example, say your fighter has Thac0 15 &amp; you roll 13 on d20 &amp; the Ogre has an AC of 5. <br/>\nThac0 15 - 13 = 2 (You could hit an AC of 2 or higher), the Ogre has an AC of 5, so your fighter easily scores a hit against it. <br/>\n<br/>\nIn general: Thac0 &amp; Saving throws = The lower the better.<br/>\n<br/>\nThe game manual will explain the rest, it's very easy to read =&gt; <a class=\"postlink\" href=\"https://www.oldgames.sk/en/game/baldurs-gate/download/6079/\" rel=\"noreferrer\" target=\"_blank\">https://www.oldgames.sk/en/game/baldurs ... load/6079/</a><br/>\nFor anything else, you might have questions for, just ask ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "11:46 PM - Mar 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, it's that \"lower is better\" thing that's making me have to think a little extra hard. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nAnd I didn't realize that an inline image would automatically get added to the \"gallery\" and show up on the home page. I hope y'all don't mind.<br/>\n<br/>\nOh, I'm sure I'll have plenty of questions, but I'll try and find answers elsewhere to avoid dragging this even further into the off-topic zone. Thanks, again, for the help on everything.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:41 AM - Mar 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>UrbanHermit wrote: <a data-post-id=\"19434\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19434&amp;sid=2ccaec9d1df80761630cd5837f840fa8#p19434\">↑</a><div class=\"responsive-hide\">Mar 01, 2020</div></cite>Yeah, it's that \"lower is better\" thing that's making me have to think a little extra hard. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nAnd I didn't realize that an inline image would automatically get added to the \"gallery\" and show up on the home page. I hope y'all don't mind.<br/>\n<br/>\nOh, I'm sure I'll have plenty of questions, but I'll try and find answers elsewhere to avoid dragging this even further into the off-topic zone. Thanks, again, for the help on everything.</div></blockquote>\nFor goodness' sake don't worry about the Gallery... First, it makes a nice change to have another view (although I'll 'fess up, I quite like the haughty Dynaheir original, even though it doesn't fit terribly well with the voice). And second, you could do like I do and hit that little symbol on the top right of the Gallery bit of the homepage (looks like a minus sign or a hyphen), which makes it all invisible. Then, if you want to see them all again, click it again, by which time it will look like an addition sign (essentially, they're collapsing and expanding).<br/>\n<br/>\nI wish you good travels in Baldur's Gate - but better ones in Neverwinter Nights!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "10:49 PM - Mar 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Got BG Trilogy up and running. I did a quick run through a clean, vanilla BG, first (stretched out on my widescreen as it was), up to the point of meeting Xzar and Montaron, for a refresher. I was actually surprised by how well I remembered it. <br/>\n<br/>\nI decided to give the BG1 NPC Project mod a try. No romances, just the general NPC tweaks/improvements. I did the same quick run after the Trilogy+mods install, and was pleasantly surprised, when retrieving the letter from Gorion's body, to have Imoen initiate a dialogue that didn't happen before.<br/>\n<br/>\nOne of her responses suggests that you bury his body and then afterward says, \"Make sure I don't have to bury you too.\" It was a very nice improvement, IMHO, and added a little more emotional depth to the encounter than just silently looting his corpse and walking away. Plus, the extra music pack available for the NPC Project, that gives ambient music for the added unvoiced dialogues, uses a piece that I immediately recognized from NWN for Imoen. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nSo, yeah... win-win. Thumbs up for the NPC Project. At least, as far as I can tell so far.<br/>\n<br/>\nNow I'm itching to actually <em>start</em> BG in earnest, but not until I complete my OC run. Back to the Creator Race Ruins we go!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:29 AM - Mar 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Make sure to follow up the OC with Mines of Twin Summit for a proper 1-40 level playthrough &amp; see how your character turns out at epic levels.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:34 AM - Mar 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just as a btw, I've just finished BG1 and transitioned into SoA with my first Kensai at level 9. It was a bloody challenge I'll tell you - no armour, no shield, no gloves or hat - I died <em>a lot</em> early on. I sacrificed a little in CON for the extra DEX bump going with elf (better AC, but fewer HPs) and had Minsc and Boo tanking for me. I wished I could have gone with a katana, but there are only about 2 in the entirety of BG1, and neither crop up until really late. Instead I went longsword (elf AB bonus and an early +2 blade useable up to the end-game), but am now getting pips in flail (those who know BG2 will know what for). It was a toss-up between that or katana (again, those who know, know). Anyway, just thought I'd share! Off to rescue Aerie the faerie now...<br/>\n<br/>\nOh, and here's a link to our Mines of Twin Summits thread: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/mines-of-twin-summits-1-2-and-3-t2354731.html\" rel=\"noreferrer\" target=\"_blank\">MoTS</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "10:51 PM - Mar 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote: <a data-post-id=\"19485\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19485&amp;sid=2ccaec9d1df80761630cd5837f840fa8#p19485\">↑</a><div class=\"responsive-hide\">Mar 04, 2020</div></cite>Make sure to follow up the OC with Mines of Twin Summit for a proper 1-40 level playthrough &amp; see how your character turns out at epic levels.</div></blockquote>\nI think for something that challenging I'd rather go with my preferred Battle Priest type character. I like being the guy who can take a lot of hits while cracking skulls and calling upon divine powers to blast his enemies... without having to rest all the time. I've already decided that's what I'll be using for BG, Fighter/Cleric multi-class... and yes, <em class=\"mention\">@Stagmeister</em>, I've read good things about flails, which makes me very happy. <br/>\n<br/>\nThis OC run with a spellslinger has been to try something a little different while experiencing the whole thing over again. Seems like I just spent most of it mopping up after Grimgnaw with a x-bow and blasting away with Eltoora's el-cheapo wands of fire and lightning. I think I really need to try a pure Sorc to get a proper feel for it. Still thinking about doing SoU/HotU again, with that in mind.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}