{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "266",
  "name": "Any ideas?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/any-ideas-t2354339.html",
  "author": "Krankui",
  "avatar": "10235447_1565972826.jpg",
  "replies": 6,
  "posts": [
    {
      "author": "Krankui",
      "avatar": "no_avatar.png",
      "timestamp": "4:04 PM - Nov 17, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello guys!<br/>\n<br/>\n I'm pretty confused about what i would like to play. I know for sure that has to be a human, elf or halfling PVP character. Classes I consider are monk, ranger, shadowdancer and blackguard (of course build can contain other classes but these should be leading). One of my types is <strong>Ranger 23/ Weapon Master 7/ Shadowdancer 10</strong> by DragonRaider69 (<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build244558.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 44558.html</a>). It has epic dodge, bane of enemy, hips - looks pretty strong. The main problem for me is leveling this character, it's very hard and painful (yeah I believe this is the problem for most DEX based PVP builds). Other thing is if this build can compete on server full of bard strenght builds walking around? Casters are probably out of range since damage output is too low to bring them down quickly, but thats ok, I'm not worried about sorc and wizards. And here is my question what build should I consider to play? I would like to play something like monk/shadowdancer/smth or something with ranger, blackguard and would like to have ittle to no spells. Focus is PVP but easy levelling is an additional advantage. Oh and server is rp low or mid magic. The max enhancement is +5.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:03 AM - Nov 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome to the guild Krankui!<br/>\n<br/>\n About the build you consider to play, nobody is more expert to say that but yourself. You seem to me a bit undecided but also afraid if the build you would like to play will be good in PvP. The build you linked by \"DragonRaider\" is very tight in it's stracture, you have to accept it as it is, or play something else. IIf your world has an easy leveling then i would advice you to just accept it as it is, but if leveling takes normal time or more then you might want to consider playing something else. We really cannot give you good advice though without more details about the PW that you play, especially if this is for PvP, changes to classes, feats and ablities are very important to know. Is devastating critical allowed? Any changes to Heal/Harm spells? HiPS are modified? All these and more are very important information for getting a really strong build for PvP. So, give us more informatiion and i am sure we are going to help you find a good build to play and enjoy!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Krankui",
      "avatar": "no_avatar.png",
      "timestamp": "11:48 AM - Nov 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you for your response!<br/>\n<br/>\n Now I will try to make everything more clear. I will start with the most important changes affecting PvP:<br/>\n<br/>\n - Harm and heal are capped at 250 max dmg/heal<br/>\n - There is no devastating crit.<br/>\n - HIPS isnt modified<br/>\n - There is no true seeing effect, spell gives bonus spot and listen (+10)<br/>\n - DMG from mestil's acid sheath, elemental armor and death armor is lowered<br/>\n - Greater sanctuary is only avaiable to clerics and lasts 15 seconds<br/>\n - True strike gives bonus equal to 5 + 1/2 level of wizard/sorc ab and lasts 9 seconds + 1/3 of mage level<br/>\n<br/>\n Ok so thats the changes in feats/spells. To make this easier I decided to go monk way beacause already have a monk halfling (-2 STR, +2 DEX, +2CON here) with the following stats:<br/>\n STR 10<br/>\n DEX 18<br/>\n<span style=\"color:#000000\">CON 14</span><br/>\n INT 14<br/>\n WIS 14<br/>\n CHA 8<br/>\n<br/>\n It's level 5 now with dodge and weapon finesse for the feats and + 1 DEX picked at level 4. The idea is to make this monk/shadowdancer/Champion of Torm, but I dont know if picking CoT is worth? And what are possible other choices? I would like to have an epic dodge, good ac and highest possible ab with this build. Prefer to fight with hands but kamas are ok too. I know that with no changes in HIPS at all and disabling true seeing effect SD becomes a beast and very solid pick. I know this build lack of dmg and probably the most reasonable option to fix this is to pick rogue or assasin for sneak attack. Unfortunately my character has to be lawful neutral so the assasin is not avaiable. I'm wondering if warrior is a good option here? I mean weapon spec is nice boost to dmg. I also have a question about self concealment... is it worth when monk has an empty body?<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:47 PM - Nov 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Before i even start talking about choices, i will give you two builds to think about,<br/>\n<br/>\n<span style=\"color:#0000CD\"><strong>Hin-Hurricane Ironman Ed</strong></span>. (scroll down the page for the second build) =&gt; <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354310/HinHurricane-Monk-25-Rogue-5-Fighter-10#.VG4LaslIrhQ\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... G4LaslIrhQ</a><br/>\n<br/>\n<span style=\"color:#0000CD\"><strong>Shadow Warrior</strong></span> =&gt; <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354307/Shadow-Warrior-Fighter-8-Shadow-Dancer-10-Weapon-Master#.VG4LpslIrhQ\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... G4LpslIrhQ</a><br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:07 PM - Nov 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And now i will try to answer some of your questions as best as i can,<br/>\n<br/>\n 1) If your main concern is PvP then CoT save bonusses are useful only when players do something to you that you need to save for. If there is not Dev, Critical and players don't use many spells then you probably do not need the saves that CoT gives you and you are better with Fighter instead. Take these with a grain of salt as i do not know how PvP is working in your server, for example if there are KD immune items in abudance then you obviously need to change the feats of your builds to IDS maybe and stuff like that. Items change as many things if not more for a build, than the changes in feats and skills and <strong>you</strong> <strong>have </strong>to take them into careful consideration if you want to be successful in PvP.<br/>\n<br/>\n 2) Monk's <em>\"</em>Empty Body\" ability is quite useful indeed, as it is long duration (for PvP) and cannot be dispelled, ergo is good to have it.<br/>\n<br/>\n 3) Consider another way also to make a build, if your server is a +5 maxed PW and the AC's aren't so high as to make the PvP battles a \"rolling the most twenty's fest\", then a really high AB build with WM preferably, will probably eat them alive before they can even react. A \"Scyther\" with 50 AB, might be a big surprise to them if they expect all dexterity builds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Krankui",
      "avatar": "no_avatar.png",
      "timestamp": "3:28 PM - Nov 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey on second thought and testing things i decided to give up DEX builds. The reasons are painful leveling and too low dmg output in my server environment. So I hit on an idea of creating bard 16/ fighter 14/ rdd 10. This build looks so strong and solid. I can pull very high AC and even higher with imp. expertise, AB is so good too, and with provoke/curse song/bard song is even better. I'm able to cast V level spells in armour so full plate is not a problem. DMG output is enormous with warhammer/battle axe (its probably better since it can be the target of keen spell). I have only one doubt about last epic feat I should get. Is it better to get epic skill focus taunt or concentration? I dont really know how does taunt work. is it taunt skill + d20 against concentration skillonly (with no roll) then I'm pretty sure taking concentration is a better option. Am I right?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:14 PM - Nov 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, (Ftr/ Bard/ Rdd) builds are one of the strongest options there is.<br/>\n<br/>\n Taunt, is an <strong><em>opposed skill check</em></strong> so you always want to have as higher \" Taunt \" skill as you can. Without a doubt you should select <strong><em>Esf: Taunt</em></strong> as your Epic feat of choice.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}