{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "750",
  "name": "Melee Mage - Low Level / PvP",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/melee-mage-low-level-pvp-t2355261.html",
  "author": "Jack Bauer",
  "avatar": "no_avatar.png",
  "replies": "4",
  "views": "430",
  "posts": [
    {
      "author": "Jack Bauer",
      "avatar": "no_avatar.png",
      "timestamp": "4:19 PM - Dec 11, 2019",
      "content": "<div>Hello, I am looking to create a melee mage aimed for level 6. This server will feature both PvE and PvP and I would like to play as an elf. I have speculated either going pure wizard or possibly 5 wizard 1 ranger, or perhaps even 5 wizard 1 fighter while attempting to swap armor and such over for the extra AC. I have no prefered weapons so using a 2her two one handers or a ranged weapon are all good options.<br/>\n<br/>\nI believe the server is low / medium magic.<br/>\n<br/>\nThank you for taking the time, I really appreciate the effort. I am mostly curious as to if I should be considering light / heavy armor, given the low level nature of the server it seems pretty easy to maximize AC with expertise and plate armor and become pretty much unhittable. <br/>\n<br/>\nI really look forward to hearing your guys insight thanks.<br/>\n<br/>\n-JB.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:29 PM - Dec 11, 2019",
      "content": "<div>Hello Jack,<br/>\nI assume that you are familiar with WebShaman's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/melee-mage-wizard-40-t2354625.html\" rel=\"noreferrer\" target=\"_blank\">Melee Mage</a>.<br/>\nWebShaman is here and active. Maybe he will contribute with some insight on the subject.<br/>\n<br/>\nElf as race has some pros and cons. Wizard is favored class, so any multiclassing is easy. You get some martial weapons for free, but not martial two-handers. If you want to focus on dexterity, elf is beneficial with it's bonus. But the cost is low constitution with less hitpoints. That leaves less room for mistakes.<br/>\nA very important difference for a caster build with such a low level range is that there is little point in going all out on intelligence the way you would do with a level 40 build. You will not be able to cast anything better than level 3 spells, so in theory you can do with intelligence 13. On the other hand, if you take intelligence 15 and add one more to get 16 at level 4, you will get a bonus spell slot for level 1, 2 and 3. Your spells DC will also improve by +2. There will still be buy points left for the combat stats. <br/>\nYou also want to take a specialist wizard for the extra spell slots. What school to choose depends more on what spells from the opposing school you can live without.<br/>\nYou will have 3 general feats and one meta magical bonus feat from Wizard 5. If you can cast in Expertise mode, you should pick that feat. You want a Weapon focus. Rapier will work well for both strength and dexterity builds. If you go dexterity you also need Weapon finesse. As for the meta magic, you may want extend. Craft wand is an important option on some PWs.<br/>\nIf you take 6 Wizard levels the BAB will be +3. In comparison a lvl 6 bard or rogue will have BAB +4 and a pure warrior will have BAB +6 with 2 attacks per round. You can compensate some for that with your buffing spells, a sturdy familiar and a summoned Dire wolf.<br/>\nArcane casters take a big step power wise once they get level 4 spells with Stoneskin and Improved invisibility. If you can get them on scrolls, use them. <br/>\nAt those low levels sequencers can be a great help. You can almost say that they add spell slots and the spells are in general cast on a higher level than your own caster level.<br/>\nYou don't have to take a fighter level. But the bonus proficiencies, the bonus combat feat and a possible Discipline skill dump will give a better melee presence. The cost is that your spell casting becomes a little weaker and you will not be able to cast your fireballs successfully with heavy armor in combat.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:14 AM - Dec 12, 2019",
      "content": "<div>Mick makes some great pointers, is a Master Builder, so it is worth saying to head his advice.<br/>\n<br/>\nThat said, I need some more information here.<br/>\n<br/>\nI think you are taking Elf for the Weapon Proficiencies (because dual wielding is out, obviously).<br/>\n<br/>\nWhile clever (saves you the Martial Weapons Feat), it affects your Con.<br/>\n<br/>\nNot necessarily a bad thing - as Mick has pointed out, at 6th level, you won't really need max Int, so concentrating on Dex and a few points in Con will work here.<br/>\n<br/>\nYou will probably be using Flameweapon as your damage dealer I suspect.<br/>\n<br/>\nTo the information:<br/>\n<br/>\nWhat is the highest \"+\" available for items (both attack/defense)?<br/>\n<br/>\nIs it mundane items only?<br/>\n<br/>\nIf not, what magical items are available?<br/>\n<br/>\nWith a limit of 6th level, Clerics and Druids are going to be problematic (esp. Clerics with Animal Domain for powerful Summons along with their combat boosting spells!)<br/>\n<br/>\nDruids with their Animal Companion and powerful Summons, of course. <br/>\n<br/>\nSo I suspect you are doing the same thing, a combat Familiar and Summons.<br/>\n<br/>\nBut before we get into the \"meat\" of things, I need to know the above info, please.<br/>\n<br/>\nAlso, is MCing allowed?<br/>\n<br/>\nMan, a Zen Archery Cleric with the Travel Domain...is gonna WRECK stuff up! I hope magic items are minimalized! I wonder if there is enough feats to get rapid reload? A heavy crossbow at range is going to be pretty nasty with up to 3 attacks/round with a maxed Wis! Plus some of the damage/AB boosting spells?<br/>\n<br/>\nWRECK A$$!<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "5:28 PM - Dec 12, 2019",
      "content": "<div>A human Wiz5/Figh1 is probably the best build for what you want, although elf works too. The following assumes that scrolls are available on the server in order to get a full spellbook of all level 3 spells, if that's not the case then spell selection will be something else to consider. Permahaste items are very useful but not essential, so I will assume that those are not available on the server.<br/>\n<br/>\nThe starting stats for an elf are 16STR/12DEX/13CON/8WIS/16INT/8CHA, with +1 CON at level 4. As an elf you have 3 general feats, 1 wizard feat, and 1 fighter feat. Humans get an extra general feat which is the main reason I would suggest picking human.<br/>\nThe wizard feat is the trickiest to decide, it's a choice between Craft Wand, Extend Spell, Still Spell, Spell Penetration, or a Spell Focus. The usefulness of Craft Wand depends completely on your server, if wands are freely available then it's not important. On my test build I chose Extend Spell for longer buffs but since spell slots are limited it's not that useful. Still Spell will let you cast level 2 and below spells in full armor, so you can cast Magic Missile or Melf's Acid Arrow mid-combat if needed. Spell Penetration is useful if you decide to focus on casting, but if you focus on melee then it's not important. Note that SR is only available through items or on monsters, players can't achieve SR through their build alone by level 6. While your DCs aren't amazing a +2 or +4 boost could be worth it, although unfortunately the best wizard DC spells are level 4+.<br/>\nAs for the other feats, I would say that Expertise and Weapon Focus are essential. I chose WF: Scimitar on my test for the crit range (especially after Keen), but any one-handed simple or martial weapon works. Improved Expertise is useful but not essential, since when fully buffed the +5 from Expertise is enough against most builds. It might be worth taking if you plan on tanking during PvM. I chose Blind Fight and Knockdown for the remaining two feats, although they're not really essential. This build has See Invisibility and Displacement has a very short duration, but Improved Invisibility is available to some builds (including this one) so Blind Fight isn't completely useless. If Improved Invisibility is common on your server in PvM or PvP then I consider Blind Fight an essential feat. You will only have 1 APR (unless permahaste is available) so KD is useless for you when alone, however your summons and allies will be able to take advantage of it. You can use one of the general feats for a Greater Spell Focus if DCs are something that you want to focus on.<br/>\n<br/>\nAs has already been suggested, you should choose a specialist school. On my test I chose Illusionist but that might not be the best choice for your server. The spells I slotted for my test were all buffing spells. At level 1 is Mage Armor, Magic Weapon, Protection From Alignment, and Shield. At level 2 is Bull's Strength, Flame Weapon, Ghostly Visage, and See Invisibility. At level 3 is Keen Edge, Protection From Elements, Summon Creature III. If they're available on your server, any items that boost INT or add bonus spell slots are very useful.<br/>\n<br/>\nFinally, choose Faerie Dragon as your familiar (or at least switch to Faerie Dragon at Wiz5). At level 5 it has Improved Invisibility and a Confusion Bolt which is tough to avoid.<br/>\n<br/>\nPutting this together, we have a very tough level 6 melee build.<br/>\nAB: 3 (BAB) + 5 (STR, assuming +4/+5 from Bull's Strength) +1 (Feats) + 1 (Magic Weapon) = +10 (+5 with Expertise)<br/>\nAC: 10 (Base) + 1 (DEX) + 8 (Armor) + 3 (Shield) + 4 (Shield) + 3 (Mage Armor) = 29 (34 with Expertise)<br/>\nHP: 30 (Base) + 12 (CON) = 42<br/>\nYour scimitar is +1 EB, keened, and has a level 5 Flame Weapon, all of which can't be dispelled.<br/>\nOn top of this you have 50% Concealment, See Invisibility, PFA: Good and PFA: Evil, 5/+1 DR, 30/- Elemental DR, immunity to level 1 spells, a dire wolf, and a familiar with a touch attack Confusion Bolt (no save, but PFA: Good or Clarity will block it).<br/>\n<br/>\nOnto the negatives, buffing takes over a minute and most of the buffs only last for 5 minutes. If permahaste or instabuffing is available then this isn't too much of an issue, but if your server has rest restrictions then this will be a problem. You also have to remove your armor to buff which means that it's not suited to surprise PvP. If you're not buffed when PvP starts you will struggle, although even unbuffed your AC in Expertise should be enough to leave most opponents rolling for 20s. Dispel will be a problem, as will other casters that focus on casting. Thanks to being a wizard you can slot to fight them as a caster, but you will need to carry a spare set of robes unless you fancy fighting naked. The saves are very low but all level 6 builds have low saves so that's not a problem unique to this build.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:42 PM - Dec 12, 2019",
      "content": "<div>This thread might be relevant:<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/what-makes-a-strong-low-level-1-10-build-t2354767-s20.html\" rel=\"noreferrer\" target=\"_blank\">what-makes-a-strong-low-level-1-10-buil ... 7-s20.html</a></div>",
      "author-color": "#00AA00"
    }
  ]
}