{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "273",
  "name": "any way to get dead modules?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/any-way-to-get-dead-modules-t2271268.html",
  "author": "Templar",
  "avatar": "10235261_1528181864.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "Templar",
      "avatar": "10235261_1528181864.jpg",
      "timestamp": "2:25 AM - Jul 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Is there anyway to download dead modules?<br/>\n<br/>\nI've got a laptop with nwn that doesn't usually go online and I'd like to play some of these persistent worlds that people have made, hosted, then ignored doing single player or lan party style. Sometimes searching the web comes up with an email but I've yet to get any answers.<br/>\n<br/>\nSo is there a way to download a module that is currently up and running since I can't find an email or I get no response from the supposed host?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:11 AM - Jul 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It depends on the module. I know that WoG has the module up in the vault, but it depends on the server owners, I guess<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Templar",
      "avatar": "10235261_1528181864.jpg",
      "timestamp": "7:46 AM - Jul 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">is there a way to download modules that are active without getting them directly from the host? I mean, I'm able to log into it... is there someway to save all that information that I'm running around inside?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:35 AM - Jul 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Templar wrote:</strong>is there a way to download modules that are active without getting them directly from the host? I mean, I'm able to log into it... is there someway to save all that information that I'm running around inside?</div></blockquote>\n\nI don't think so unless the host posts it on the Vault. Other than that, no.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:59 AM - Jul 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Unless they have been loaded to the Vault the only way (and the best way, BTW...) is to log in and talk to a DM.  They will know the best way to contact the admin(s).  In some cases, the email addies have not been updated or they just don't check them often enough.  Modules from highly active servers will always be easier and faster to get responses than the less popular.  Those with very little participation will be difficult to contact anyone.  But if by \"dead\" you mean servers that were discontinued, forget it.  The original designers are either on to other projects, RL commitments or just retired and you have missed your chance.  There's a remote chance that a designer of one of the newer PWs had also designed one of those defunct ones, but that is a proverbial shot in the dark, IMO.  Also, not all content is available for public distribution due to copyright/design control.  Some designers don't want to see all their hard work showing up on another server under some sort of distorted guise.<br/>\n<br/>\nIf I were you, I would pursue the personal networking route.  <br/>\n<br/>\nAs far as getting character-type information from the server side for locale Vault, sorry.  It would just open the server to hakking and they are always taking significant measures to prevent that.  An SP module for your own use is about the best you can hope for.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}