{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "424",
  "name": "Dual wielding WM build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/dual-wielding-wm-build-t2303704.html",
  "author": "Mick Dagger",
  "avatar": "10235235_1549015559.jpg",
  "replies": "3",
  "views": "6.2K",
  "posts": [
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:00 PM - Dec 18, 2012",
      "content": "<div>In <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/robin-hood-wildwood-warrior-ranger9-ftr12-wm19-t2302002.html\" rel=\"noreferrer\" target=\"_blank\">another thread</a> I asked: How will a Ftr/WM/Rogue 2-3 compare to this build:<br/>\n<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<blockquote><div><strong>TyrTemplar wrote:</strong><br/>\n<strong>Robin Hood (Wildwood Warrior) Ranger(9), Weapon Master(19), Fighter(12)</strong><br/>\n<br/>\n<strong>I. Attributes:</strong><br/>\nSTR: 17 (32)<br/>\nDEX: 13<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHuman / Any Alignment (Theme: Chaotic Good)<br/>\n<br/>\n<strong>II. Level Guide:</strong><br/>\n01: Fighter(1): weapon proficiency exotic, dodge, mobility<br/>\n02: Fighter(2): expertise<br/>\n03: Fighter(3): weapon focus: bastard sword*<br/>\n04: Fighter(4): STR+1, weapon specialization: bastard sword, (STR=18)<br/>\n05: Fighter(5)<br/>\n06: Fighter(6): weapon focus: dire mace, weapon specialization: dire mace**<br/>\n07: Fighter(7)<br/>\n08: Fighter(8): STR+1, spring attack, (STR=19)<br/>\n09: Fighter(9): whirlwind attack<br/>\n10: Weapon Master(1): weapon of choice: bastard sword<br/>\n11: Weapon Master(2)<br/>\n12: Weapon Master(3): STR+1, blind fight, (STR=20)<br/>\n13: Weapon Master(4)<br/>\n14: Weapon Master(5)<br/>\n15: Weapon Master(6): knockdown<br/>\n16: Weapon Master(7): STR+1, (STR=21)<br/>\n17: Weapon Master(8)<br/>\n18: Weapon Master(9): improved critical: bastard sword<br/>\n19: Weapon Master(10)<br/>\n20: Fighter(10): STR+1, improved critical: dire mace**, (STR=22)<br/>\n21: Ranger(1): epic weapon focus: dire mace**, epic weapon focus: bastard sword, {Dual Wield}<br/>\n22: Ranger(2)<br/>\n23: Ranger(3)<br/>\n24: Ranger(4): STR+1, great strength I, (STR=24)<br/>\n25: Ranger(5): epic prowess<br/>\n26: Ranger(6)<br/>\n27: Ranger(7): great strength II, (STR=25)<br/>\n28: Ranger(8): STR+1, (STR=26)<br/>\n29: Ranger(9): {Improved Two-Weapon Fighting}<br/>\n30: Weapon Master(11): great strength III, (STR=27)<br/>\n31: Weapon Master(12)<br/>\n32: Fighter(11): STR+1, (STR=28)<br/>\n33: Fighter(12): epic weapon specialization: dire mace**, epic weapon specialization: bastard sword<br/>\n34: Weapon Master(13): weapon of choice: dire mace**<br/>\n35: Weapon Master(14)<br/>\n36: Weapon Master(15): STR+1, great strength IV, (STR=30)<br/>\n37: Weapon Master(16): epic toughness I**<br/>\n38: Weapon Master(17)<br/>\n39: Weapon Master(18): great strength V, (STR=31)<br/>\n40: Weapon Master(19): STR+1, armor skin, (STR=32)<br/>\n<br/>\n*<strong>Weapon Note:</strong><br/>\nFor Theme/RP reasons, I gave Robin Hood, Wildwood Warrior (as a true-to-life Knight) Bastard Sword (Sword-and-a-Half), being the knight’s weapon (medium size, slashing weapon; consistent damage with nice crit range in the hands of a WM as well, while enabling board use/AC) and dire mace, double-sided/double-bladed bludgeon weapon making great use of ranger dual-wield for really nice damage output of course [Str. based, WM \"crit.crazy\" factor, Fighter WS/EWS, dual wield i.e. 6 apr (7 apr hasted), and all of it tripling on a crit! Wave bye-bye to your foe (Robin is a seasoned Knight, after all)], while theme-wise being a cross between Quarterstaff and Mace; this, as a “compromise” so far as the mace was also a side arm of medieval warriors (standard issue for bashing (bludgeon) enemies pre-plate, and to wrap around shields) but at the same time incorporating the staff legends of Robin Hood so far as the tales are quite clear that, during a show down with Little John on a bridge, Robin was bested by the latter, who beat him off the bridge with a stick (aka quarter staff, but which NWN is not a double-sided but, rather, a large weapon, contrary to the description). <br/>\n<br/>\n<strong>**Alternative Path—Dev.Crit: Don’t want double weapon spec, prefer Dev.Crit instead?</strong><br/>\nIf so and/or not interested in theme, then feel free to drop second weapon (in which case, select kurki as main and in this case only weapon (wonderful range i.e. 13-20/x3 / Keen: 10-20/x3), forcing those crits and chewing through foes like there's no tomorrow, while enabling sword+board/AC when desired as well). Take Power Attack and Cleave at Lev 6 (instead of WF/WS 2nd weapon), Grt.Cleave at Lvl 20 (instead of IC: 2nd weapon), picking up OC: kukri at lvl 34 (instead of WoC: 2nd weapon), DC: kukri at lvl 37 (instead of Epic Toughness, -20HPs or 480 adj); additionally, instead of EWF/EWS 2nd weapon at levels 21 and 33, grab EITHER Epic Fort along with Grt.Fort (+6 Fort, or Fort: 28 adj; recommended if looking to PvP your Robin in dev.crit arena) –OR- 2 more Grt.STR (STR 34 adj., i.e. +1AB/Dam., or: Naked AB 50, and +1 DC on Dev.Crit, or: DC: 42 / 48 bio-cap) et voila: dev.crit instead. <br/>\n<br/>\nFor those fans who prefer their Robin Hood not as a true-to-life knight but, rather, as a legendary archer (as he was portrayed in subsequent legends), see: Robin of Locksley, Wildwood Outlaw: (placeholder).<br/>\n<br/>\nAnd now back to our regularly scheduled program…<br/>\n---<br/>\n<br/>\n<strong>III. Basics:</strong><br/>\n<br/>\na. Hitpoints: 500<br/>\n<br/>\nb. Saving Throws (Fortitude/Will/Reflex): 22/15/21<br/>\nSaving Throw bonuses: Spells: +4<br/>\n<br/>\n<strong>IV. Combat Vitals:</strong><br/>\nBAB: 30, AB (naked): 49 (melee) (-2 dual)<br/>\n<br/>\nMundane Bastard Sword (Slashing): AB 49/44/39/34; Damage: 1-10+17 (crit: 15-20/x3) <br/>\n*Round Totals (Per Hit: 18-27): 76-108 (Per Crit: 54-81).<br/>\n<br/>\nGear (+6 STR, +5 Keen Bastard Sword, Aid Scroll, Haste): AB 58/53/48/43/58; Damage: 1-10+25 (crit: 13-20/x3)<br/>\n*Round Totals (Per Hit: 26-35): 130-175 (Per Crit: 78-105).<br/>\n<br/>\nMundane Dire Mace (Bludgeoning): <br/>\nMain: AB 47/42/37/32; Damage: 1-8+17 (crit: 17-20/x3) / Off: AB 47/42; Damage: 1-8+11 (crit: 17-20/x3)<br/>\n* Round Totals: Main (Per Hit: 18-25 x 4 apr: 72-100) + Off (Per Hit: 12-19 x 2 apr: 24-38): 96-138 damage<br/>\nPer Crit: Main Hand: 54-75 damage on each crit  / Off Hand: 36-57 damage on each crit.<br/>\n<br/>\nGear [+6 STR, +5 Dire Mace of Puncture (1d10 Piercing), Aid, Haste]: <br/>\nMain Hand: AB 56/51/46/41/58; Damage: 1-8+25, +1d10 Piercing (crit: 17-20/x3) <br/>\nOff Hand: AB 56/51; Damage: 1-8+18, +1d10 Piercing (crit: 17-20/x3)<br/>\n<br/>\n*Round Totals: Main (Per Hit: 27-43 x 5 apr: 135-215) + Off (Per Hit: 20-36 x 2 apr: 40-72): 175-287 <br/>\nPer Crit: Main-Hand: 81-129 damage on each and every crit / Off-Hand: 60-108 damage on every crit.<br/>\n<br/>\n<strong>V. Defense Vitals (AC):</strong><br/>\nAC (naked): 17 +1 dodge: 18, +3 Studded Leather, +3 Tower: 24, +5 Expert.Mode: 29 (*Add +3 Cat’s Scroll alone, or AC 27 / 32 Expert.Mode).<br/>\n<br/>\n*Full Battle Dress/Plate (Sword+Board): 17 Naked, +1 dodge: 18, +8 Plate, +3 Tower: 29, +5 Expert.Mode: 34 AC<br/>\n<br/>\n<strong>VI. Spell Casting:</strong> Ranger Class entitles use to Ranger items-- i.e. scrolls.<br/>\n<br/>\n<strong>VII. Skillpoints:</strong> 233*<br/>\nDisable Trap 1(5), Discipline 43(54), Heal 3(2), Intimidate 4(3) (WM prereq), Listen 43(42), Search 1(3), Set Trap 14(15, +Take20: Deadly Traps), Spellcraft 18(20), Spot 43(42), Tumble 20(21)</div></blockquote>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSince I don't want to hijack the original thread, I post a build here for comparison (not tested in game yet):<br/>\n<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tRobbin' the Hood (Streetfighter)<br/>\n<br/>\nFighter (16), WM (22), Rogue (2)<br/>\n<br/>\nHuman of any alignment<br/>\n<br/>\nAttributes<br/>\nStr 16 -&gt; 32<br/>\nDex 15<br/>\nCon 14<br/>\nInt 14<br/>\nWis 8<br/>\nCha 8<br/>\n<br/>\nLevel guide:<br/>\n01 Fighter 1 WP Exotic, WF Kukri, Dodge<br/>\n02 Fighter 2 Mobility<br/>\n03 Fighter 3 Expertise<br/>\n04 Fighter 4 WS Kukri, Str +1 (17)<br/>\n05 Fighter 5<br/>\n06 Fighter 6 Blind Fight, Knockdown<br/>\n07 Fighter 7<br/>\n08 Fighter 8 Spring Attack, Str +1 (18)<br/>\n09 Fighter 9 WW Attack<br/>\n10 Fighter 10 IC Kukri<br/>\n11 Weapon Master 1 Weapon of Choice: Kukri<br/>\n12 Weapon Master 2 TWF, Str +1 (19)<br/>\n13 Weapon Master 3<br/>\n14 Weapon Master 4<br/>\n15 Weapon Master 5 Ambidexterity<br/>\n16 Weapon Master 6 Str +1 (20)<br/>\n17 Weapon Master 7<br/>\n18 Weapon Master 8 ITWF<br/>\n19 Weapon Master 9<br/>\n20 Weapon Master 10 Str +1 (21)<br/>\n21 Fighter 11 G Str I (22)<br/>\n22 Fighter 12 EWF Kukri<br/>\n23 Weapon Master 11 <br/>\n24 Weapon Master 12 WF Dire Mace, Str +1 (23)<br/>\n25 Weapon Master 13 Weapon of Choice: Dire Mace<br/>\n26 Weapon Master 14 <br/>\n27 Weapon Master 15 G Str II (24)<br/>\n28 Weapon Master 16 EWF Dire Mace, Str +1 (25)<br/>\n29 Fighter 13 <br/>\n30 Fighter 14 EWS Kukri, G Str III (26)<br/>\n31 Rogue 1 <br/>\n32 Weapon Master 17 Str +1 (27)<br/>\n33 Weapon Master 18 G Str IV (28)<br/>\n34 Weapon Master 19 Epic Prowess<br/>\n35 Weapon Master 20<br/>\n36 Weapon Master 21 G Str V (29), Str +1 (30)<br/>\n37 Weapon Master 22 Armor Skin<br/>\n38 Fighter 15<br/>\n39 Rogue 2 G Str VI (31)<br/>\n40 Fighter 16 Power Attack, Str +1 (32)<br/>\n<br/>\nBuild Vitals:<br/>\nHP: 472<br/>\n<br/>\nSaves: (Fort/Refl/Will) 22/22/15<br/>\n+4 to saves vs spells<br/>\n<br/>\nSkills: Total skillpoints: 227<br/>\nDiscipline 43 (54), Listen 42 (41), Tumble 40, UMD 34 (33), Intimidate 4 (3), Spellcraft 18 (20), Disable Trap 1(5), Set Trap 13 (15), Open Lock 10 (12)<br/>\n<br/>\nArmor Class:<br/>\nVanilla Full Plate: 30<br/>\nVanilla Tower and Full Plate: 33<br/>\nExpertise +5<br/>\n<br/>\nAttack Bonus:<br/>\nBAB: 30<br/>\nSingle Kukri: 50/45/40/35<br/>\nDual Kukris: 48/43/38/33/48/43<br/>\nDire Mace: 48/43/38/33/48/43<br/>\n<br/>\nDamage:<br/>\nKukri: 1d4 + 17 (13-20/x3) (10-20/x3 with Keen edge spell from UMD)<br/>\nOff hand Kukri: 1d4 +11 (13-20/x3)<br/>\nDire Mace: 1d8 + 11 (18-20/x3)<br/>\nOff hand Dire Mace: 1d8 + 5 (18-20/x3)<br/>\n<br/>\nPower Attack: +5 to damage from all attacks<br/>\nSneak Attack 1d6<br/>\n<br/>\nCasting: UMD: Can cast from all scrolls without casting failure. Can buff weapon with GMW, Keen edge, Flame weapon. Can buff up with Improved invisibility, Haste, spellmantles etc. etc<br/>\nHas access to gear restricted to other classes, races and alignments.<br/>\nEvasion coupled with reflex save of 22 (26 vs spells)<br/>\n<br/>\n<strong>Edit:</strong> Added Evasion and SA damage from Rogue<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI welcome any feedback on the build<br/>\n<br/>\nMick</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "4:18 PM - Dec 19, 2012",
      "content": "<div>Streetfighter, eh? (Robbin' the Hood is kind of pushing it, ain't it? Lest this be a take on Men-in-Tights to go along with the Prince of Thieves, I suppose   ). Streetfighter with rogue works, though! <br/>\n<br/>\nNice take, Mick. Glad to see all the inspiration my build inspired, truly (then, suppose Robin Hood has that effect on us all, with ECBers having their own take as to what that \"inspiration\" means    ).<br/>\n<br/>\nAh, but doesn't achieve what it is that ranger gives as said. Hare are the comparisons.<br/>\n<br/>\nLoss of 2 strength, unlike Robin (thanks to free dual without more, no need of useless DEX) which Strength on account of those dual wield requirements the Streetfighter will never be able back; this in turn means Streetfighter will NEVER be able to achieve a Dev.Crit DC 42 (which is excellent, being the very best one can possibly achieve without RDD in the mix, not everyone wanting to play RDD and in many places they're banned). Then, I do aim for level 40 excellence, if I ever may say so humbly.   <br/>\n<br/>\nAs to the double weapon path instead, as you see, by trying to grab more strength (which I appreciate) means you in reality dumped the second weapon focus. Robin enjoys not only WF/EWF and WoC on both weapons, but also IC, WS and EWS on both as well. This, being something Streetfighter cannot possibly do without gutting strength, on account once again of those dual wield DEX requirements and lack of WM's boni feat selection as said (which feats fighter and Cot get, 2 more feats coming in on ranger, which dual req't ranger bypass as well, thus 3 more feats and more STR etc in turn; it's how it is that I achieved what it is that I did, no other class being excused from those requirements. and requiring also 3 feats also just to pick up dual wield as well and by definition means NEVER being able to accomplish that which it is Ranger does in turn   <br/>\n<br/>\nMeantime, if playing in an arena where dev.crit is banned, I'm going with scimitar (more base damage than kukri yet sharing that same exact wonderful threat range, i.e., 10-20/x3 keen (that extra damage tripling on a crit as well), enabling use of the big board and of course plate as well, only it don't go flying out of your hands in the game of disarm as would a kukri --which be tiny weaponry (if dev.crit is banned, no point in going with that; ah, but if dev.crit isn't, then, heh, 6 apr (7 apr hasted) as against a Naked DC 42? Can't no more strike back or disarm if foe is dead, and as against a Naked DC 42 ... LOL. Otherwise, forget about it. Go scim and grab Two-Bladed Sword (large, double-bladed weapon just like dire mace, same exact damage except it's slashing instead of bludgeon thus enjoying that great dual wield, etc., only with a much better crit threat factor (same as enjoys bastard sword and great sword). Ability to deliver two different damage types being super nice PvM/E but not matter in PvP, where you'll prefer the crit factor instead and being a large weapon no disarm woes either, making quick work of your foe instead. Thing is, need WS/EWS/IC and not just WF/EWF on both like Robin does to enjoy all that!   Giving up very important things, and thus needing to drop yet even more strength for that (and no, PA don't make up for that--trading \"to hit\" is something epic weapon masters pull in order to have damage to deliver, but can't deliver if don't hit, and what's the point of taking WM if going to do that; with Ranger, high str, dual wield, etc. and either dev.crit -or- double weapon focus so as zero need for that (PA is redundant when have damage; if you drop strength so as to fit everything in, then take PA up front and center so as to make up for it a bit at least, even though it means giving up your AB in turn. Should be fine for PvM/E, what a lot of WMs do--i.e., just so darn reliant on the crits in order to do damage, just don't work so good (as in not at all) when up against crit/sneak immunes. I personally hate that, like all my AB and damage in tact, going for double weaponry focus, fully spec'd, combine with high STR, dual wield and WS/EWS, heh, shore up the WM's weakness' yet same time enjoying all of its benefits, yes? Whole point. <br/>\n<br/>\nThen, those darn dual wield DEX requirements getting in the way of a non-ranger, eh? (meaning, once again, not comparable as don't achieve what it is 9 ranger does in turn, just don't, there being no other way to bypass those requirements among other things as said). <br/>\n<br/>\nAlso, loss of HPs. Less than 500! I appreciate Streetfighter has more than 400 (which is the melee minimum), but that's the floor not the ceiling. REAL melee warriors want more. Why? Because melee warriors stand out in the front lines, front and center, high AB/damage ensures the dead don't strike back, with HPs to take a beating should things go wrong. Remember also that sneaky dex' rogues pull first punch, and how also it was in the old days we used to discuss melee by among other things how many IGMS (Max) missiles a melee could take?   <br/>\n<br/>\nNow, could cut AS for ET, but that would still be less than 500 as enjoyed by Robin, and zero benefit over light armor in turn (which as I set out on the thread, just isn't an issue; and which, even if do that, still don't get to 500 (and also meaning a loss of yet another feat right there). <br/>\n<br/>\nTraps? Those are nice, great idea!  Give up the ranger's entitlement to items, scrolls, but pick up UMD to replace that, only you give up an important part of your scouting skills in order to do it--namely, dropped spot (there be synergies b/w listen and spot as said, the former speaks to M/S whereas the latter speaks to hide, not just for PvP but monsters can also be sneaky in PvM/E as well, we are not after all an AA archer--no imbue arrow explosions, etc. on hearing something or watching a sneaky rogue disappear; UMD is nice but not really that effective on a non-caster/melee build. We are a melee, not a caster after all, and  UMD buffs are readily dispelled by just about everything out there (dispelling comes in scroll form as well.  Used to be I trained up UMD on melee, so as to get around the restrictions; this, due to the inherent limitations of melee builds--namely, if can't get to something to hit it, you can't damage it. Without UMD or traps, kinda screwed. Not so when have traps (which are better than UMD, far more \"versatile\" (as in deadly) than trying to toss a UMD fireball off or something as a melee, not being a caster. Everything else: well, that is what KD is for (nothing can harm you when on their backs, and what it is that melee do!!).  <br/>\n<br/>\nStill it's nice to play with magic, which ranger spells all of them coming in scroll form provides and on its own (true of paladin class, too). Just saying. And if in an environs where UMD/Scrolls like GMW etc. are plentiful, then you will find a +5 weapon as well as keen weaponry, too (weaponry enhancements don't stack; but IC, WM ki crit and keen weaponry all do!). Yes, UMD is nice for shoring up i.e. that oh so typical weakness of melee--namely, will save. But clarity comes in the form of a potion as well, in all magic level environs, being one of if not the easiest thing to shore up on the NWN planet, so with traps (assuming paladin or ranger entitlements) don't need no UMD in turn. <br/>\n<br/>\nI'd tell you to cut (useless) DEX and throw those ability points into STR instead ... oh, but right not being a ranger, in order to enjoy the benefits of dual wield (and you've only one weapon focus really, not two, and never getting to a Dev.Crit DC 42 without such STR either) the Streetfighter can't, cuz s/he's not a ranger but a rogue!!!       <br/>\n<br/>\n(Psst. Closest you can possibly get is with a CoT/WM/Fighter mix, same issue in terms of 2 Str down from the get go and always no matter what cf. ranger (on account of that dual DEX requirements), and loss of a feat as well (drop AS), only problem is: no traps -or- magic entitlement of any nature, type, or kind whatsoever, hence back to the age old problem of melee--i.e., if can't hit ...   . Playing around with that combo in revising a different character I did over at the ECB/NWN2 (dang nab it. Wish we had 4 classes to play with like NWN2, but we don't. We'll see in turn). Like I said, Ranger is best ...   <br/>\n<br/>\nGave it a really good college try, though. (Appreciate same, Mick. I do; and must say, what a really nice \"twist\" on the WM/FTR/Rogue combo if I do say so myself -- robbin' the Hood, indeed!   ..  ).<br/>\n<br/>\nTyr</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:49 PM - Dec 20, 2012",
      "content": "<div>There is something about that Robin build that I like, especially the way you use ranger in epic levels to gain epic feats instead of 2 rather worthless FEs and get ranger dual wield as well.<br/>\nBut it inspired me to try a different approach to that kind of build and see what I could do with it it.   <br/>\nAnd I am satisfied with the result  <br/>\n<br/>\nBoth builds have a very high AB.   <br/>\nBoth builds dual wield.<br/>\nBoth builds focus in two different weapon types with slashing and blunt damage.<br/>\nBoth builds have trap skills to set deadly traps.<br/>\nBoth builds can dish out damage like there is no tomorrow.   <br/>\n<br/>\nWhen it comes to what sets the builds apart, we see things a bit differently . <br/>\nI have made a non Dev Crit build and will compare with the non Dev Crit version of Robin.<br/>\nI will give you the numbers and some comments.<br/>\n<br/>\n<strong>AB</strong><br/>\nStreetfighter: +50   <br/>\nRobin: +49<br/>\nBoth are among the highest naked melee ABs in the game. 50 is better than 49. +1 is taking back half the dual wield penalty.<br/>\n<br/>\n<strong>Hitpoints</strong><br/>\nStreetfighter: 472<br/>\nRobin: 500<br/>\nThe difference, 28 HP is negligible, especially given Streetfighter's better defence.<br/>\n<br/>\n<strong>Strength and dexterity</strong><br/>\nStreetfighter: Str 32, Dex 15<br/>\nRobin: Str 32, Dex 13<br/>\nRobin starts with Str 17 and Dex 13 where Streetfighter starts with Str 16 and Dex 15. Both cost 18 buypoints. Streetfighter only needs 1 more Great strength to get par strengthwise.<br/>\n<br/>\n<strong>Saves (Fort/Refl/Will)</strong><br/>\nStreetfighter: 22/22/15 +4 vs spells<br/>\nRobin: 22/21/15 +4 vs spells<br/>\n<br/>\n<strong>Dual wield</strong><br/>\nStreetfighter: Is built to dual wield both weapon types (Kukri and Dire mace). Gets the dual wield feats pre epic. The AB difference between Kukri and Dire mace pre epic is only 1. Can dual wield in full plate.<br/>\nRobin: Is built to dual wield the Dire mace only. Can dual wield Bastardswords at a -4 AB penalty. Gets the dual wield feats in epic levels lvl 21/lvl 29. No dual wield pre epic. Must dual wield in light armor with an AC penalty of 5 in studded leather vs full plate. The AC penalty can be reduced to 2 with cat's grace or dex items.<br/>\n<br/>\n<strong>Sword'n board</strong><br/>\nBoth can wear full plate and tower.<br/>\nStreetfighter: Wields a Kukri giving 1d4+17 (13-20/x3) or 1d4+17 (10-20/x3 keened with scroll/ UMD) damage.<br/>\nRobin: Wields a Bastard sword giving 1d10+17 (15-20/x3) damage.<br/>\nStreetfighter (base damage 18-21) will land more critical hits for 3x damage.<br/>\nRobin has higher base damage (18-27). <br/>\n<br/>\n<strong>Damage</strong><br/>\nStreetfighter will hit more often because of higher AB<br/>\nKukri vs Bastard sword: see above<br/>\nDire mace: <br/>\nStreetfighter has WF, EWF and EP for a dual wield AB of 48. Dire mace is a back up weapon for Streetfighter.<br/>\nRobin has WF, EWF, EP for a dual wield AB of 47. Dire mace is Robin's main dual wield weapon.<br/>\nRobin has WS, EWS and IC for +6 damage and greater crit range (17-20/x3)<br/>\nRobin has access to the Blade thirst spell from ranger scrolls.<br/>\nUMD: Streetfighter has access to Haste for an extra attack at full AB, GMW for +5 weapon, Keen edge for (10-20/x3) on the Kukris, Flame weapon for 11-14 fire damage. Weapon buffs normally don't get dispelled.<br/>\nPower Attack: Streetfighter has PA to get +5 damage at the cost of -5 AB. With an AB of 50 you can afford to use it. A means to grind even faster through the mobs.<br/>\nSneak Attack: Streetfighter inflict 1d6 damage on a successful sneak attack, not exactly great, but still slightly better than nothing<br/>\n<br/>\n<strong>Defence</strong><br/>\nStreetfighter: AC is 30 in full plate and 33 with tower and full plate. With Expertise the AC becomes 35 and 38<br/>\nRobin: AC is 21 in studded leather and 29 in full plate and tower. With expertise the AC becomes 26 and 34<br/>\nStreetfighter can dual wield in full plate and has +8 AC from Tumble as class skill<br/>\nRobin has +4AC from cross training Tumble. With dex items/cat's buff, Robin can improve AC in studded to 24, or 29 with Expertise<br/>\nStreetfighter has UMD and access to scrolls like Improved invisibility for 50% concealment, Haste for +4 dodge AC, Spell mantles  to protect vs IGMS attacks etc..The list is long.<br/>\n<br/>\n<strong>Skills</strong><br/>\nStreetfighter: 227 skillpoints<br/>\nRobin: 233 skillpoints <br/>\nRobin has 43 ranks in both Spot and Listen. Streetfighter only takes one of them and spends skillpoints in UMD and Open lock.<br/>\nStreetfighter has Tumble as class skill for an extra +4 to AC from the same investment in skillpoints.<br/>\n<br/>\n<strong>Various</strong><br/>\nRobin: Can use ranger gear and can cast from ranger scrolls.<br/>\nRobin: Has a pet   <br/>\nStreetfighter: Can use gear from all classes, races and alignments, and can cast from any scroll in the game.   <br/>\nStreetfighter: Has Evasion to avoid damage from traps and spells.<br/>\n<br/>\nThe usefulness of UMD: You can use items that are unavailable without. You can get that fat pair of monk boots, that Bard harp, a wizard staff that can cast exotic spells or perhaps an attractive paladin helmet and that assassin weapon.<br/>\nCasting from all scrolls opens up a new world for non caster classes. Low caster levels can be dispelled, that is true, but if that is your only concern, you miss out on a lot. Not all opponents have the ability to dispell! Weapon buffs will not be dispelled. And you get access to Dispell, Breach and Mord yourself! You also have a  list of utility spells like Knock, Find traps, True seeing, etc that to some extent can replace skills like Open lock, Search, Disarm traps, Spot, Listen and so on. And spells can give you immunities, better AC, AB and damage etc, but you all know that already.<br/>\n<br/>\nI have a good feeling about my build   <br/>\n<br/>\nMick</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "8:09 PM - Dec 20, 2012",
      "content": "<div>Mick, <br/>\nFirstly, bastard sword and dire mace are \"theme\" weapons on Robin. <br/>\n<br/>\nFor PvM/E, swap to kukri to chew if like and whip out dire for the big boss (and sneak/crit immunes like undeads), pounding through. Fact remains: Streetfighter spec's up one weapon (just the kukri), not the dire mace (lacks WS/EWS and IC on that), whereas Robin thoroughly enjoys it all on not just one but two. Streetfigher gutted everything for STR, so that is kinda cheating (If Robin spec'd only one weapon, AB 50, STR 34, Dev.Crit 42, being something Streetfighter simply will never be able to do, and hardly \"boast\" a double weapon focus when he has only actually spec'd one, eh? Unlike Robin who does in fact enjoy two.  <br/>\n<br/>\nOh, and gear? Well, everything gets the exact same thing, too. (I know you know this). And as to UMD? That don't make up for the lack of feats, nor lack of damage either. Firstly, dire mace cannot be keened; but even if it could (and can't), in a world where all these lovely scrolls Streetfighter intends to beg and borrow for, magic weaponry including built-in keen item property -AND- elemental damage enhancements thereon are available, too. So don't need no UMD scrolls (for what? Casting a fire ball? Won't beat SR much less get around the saves issues; speaking of which, if want to take advantage of \"evasion\", then either take a saves boost feat or raise your dex!).<br/>\n<br/>\nBTW, with a REAL double weapon focus (let's give Robin kukri and dire mace for PvM'E), means on top of full spec as is (which Streetfighter don't have), gets not only magic weaponry with the keen prop built in (a keen scroll would add nothing more, don't stack with the item prop anymore than magic enhancements like GMW, etc. do either), but also 3 different elemental damage enhancements, namely: fire, cold and acid..All covered!! (Beauty of not only a double weapon focus, but also dual wielding, too, yes?!!?).<br/>\n<br/>\nMeantime, Streetfighter don't own any such scrolls, not a single one. Acting as if he has a spellbook or something, which he don't.<br/>\n<br/>\nIt's a mere wish list. Don't exist in low magic (at best, find a +3 enhancement like blade thirst (ranger scroll) and aid (also a ranger scroll), not that either need such things \"to hit\" (not with this AB they don't); thing is though, if drop strength to actually spec up both weapons (which Robin has and enjoys), Street fighter kinda loses some AB there, eh? (Should be fine in low magic, though; still, real hard naked AB/damage like Robin has whether with the dev.crit path OR fully spec'd double weapon path is best   . Mid-magic there's gear as said, but whatever you get, everyone else of course gets, too. Meantime, and thing is, higher the magic setting, more things you find that dispel as well (there being a world with monster/dragons that do enjoy the power of mord's, yes, monsters with Mord's! And over on WoG lots of things dispel, too, so UMD buffs don't mean much in turn. In PvP? Forget about it. Everything and their PET dispels. Either sufficient caster level to avoid that, or you don't, and Streetfighter don't). <br/>\n<br/>\nFind a +3 weapon enhancement (blade thirst) in low magic at best, which IMO is a ranger scroll, same with Aid. If you want more, play a caster so as to have a spellbook instead. Much rather have all my AB/damage (WF/EWF, WoC, IC, WS/EWS -and- high STR) on both weapons, and higher HPs as well. And no, the difference in HPs is not negligible either; without the same damage set-up, ...<br/>\n<br/>\nBesides, you really think a point or 2 of AC is going to make any difference at all? Seriously? It don't. All that dodge, tumble, etc. goes right out the window when attacked out of stealth (all those so-called UMD buffs Street fighter hopes to get but which don't own, dispelled). Not just in PvP either, as PvM/E monsters can be stealthy, and many dispel (dragons with Mord's!!!), too. Scout skills full trained, synergies you know (oh, and ultravision + purge invis? They be ranger's, too.   <br/>\n<br/>\nBut, yes, it's fun to toss fire balls and play with wands, and when I want to do that I play a caster (thing called beating SR, etc. which with UMD Streetfighter can't do, not to mention all those saving throws that enemies get, and which as against Streetfighter they'll beat every time, unless praying for an auto fail d1; heh, about as useless as a pet, but the pet is at least cute, oh yes it is!   ). <br/>\n<br/>\nRobin is a pure H&amp;S melee build, not a caster, and news flash: Streetfigher ain't either. <br/>\n<br/>\nPlay tip: with rights and entitlements to ranger items and scrolls, that be plenty magic enough (ranger's book is designed for melee, super nice with the traps). Stacking grease works good, lay it on high and pile it on thick (stacks with itself as said, enemies fall down, as they do when you KD them. Be it large, double-bladed weapon or otherwise, with 6 apr (7 apr haste item, and yes, fully spec'd weapons), they are dead. In terms of \"hordes\", traps thin 'em out good. Soften em up fine, and you finish em. Or, enjoy the DEV CRIT DC 42 dual wield and ... well, you know already. (Far better than trying to sling from a scroll as if a caster when not a caster, no hope in Hel to beat SR much less saves and if want to boast about evasion, for god's sake, man, RAISE YOUR DEX!!!). Whole Point of a WM is to CRIT ... (works best with high strength, WS/EWS and IC on both weapons, like Robin has.   ).<br/>\n<br/>\nYes, I think I'd like Street fighter more if he actually went DEX. At least the STR needed for the PA (which you'll want to take up front and in the beginning) wouldn't be wasted ... have a nice AC, go dual wield short swords (street knives. slashing) and mace (street club, bludgeon) maybe. Make up for the lack of STR Streetfigher would have if he genuinely actually fyll spec'd both weapons. (See? Robin takes from the rich, gives to poor street fighers lacking HPs, IC, WS/EWS and the ability to EVER (as in NEVER) achieve a Dev.Crit DC 42 either , eh?...     <br/>\n<br/>\nTyr<br/>\n<br/>\nPS Good sparring with you, Mick (thanks!).</div>"
    }
  ],
  "author-color": "#AA0000"
}