{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "131",
  "name": "cleric/monk/weaponsmaster",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/cleric-monk-weaponsmaster-t2354580.html",
  "author": "Kittie",
  "avatar": "10577588_1510287072.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Kittie",
      "avatar": "no_avatar.png",
      "timestamp": "9:23 PM - Aug 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><span style=\"color:#4C5D77\">Its wonderful to see that nwn and the</span>community<span style=\"color:#4C5D77\"> hasn't died completely I havn't played in 5yrs and I'm trying to get back into playing there is soo much to relearn I have forgotten the majority of character building. I do remember that I want the epic class to be cleric and that there should be 11 or 12 lvls of monk.<br/>\n<br/>\n 1) PvM or PvP -  PvM </span><br/>\n<br/>\n<span style=\"color:#4C5D77\">2) Level cap - 60</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">3) Race preference - Human</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">4) Class preference - I'm perfectly happy with just going cleric/monk but wanted to know if adding wm lvl would be worth it and about where to take the needed feats for the added class. I'm used to lvl 40 mod cap so I'm a little lost on what to do with an extra 20 lvls</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">5) Melee preference - dual-wielding </span><br/>\n<br/>\n<span style=\"color:#4C5D77\">6) Range preference - cleric aoa spells</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">7) Weapon preference - </span><span style=\"color:#4C5D77\">kamas</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">8) Maximum item enhancement - not sure</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">9) Spellcasting - a good mix of both support and offensive </span><br/>\n<br/>\n<span style=\"color:#4C5D77\">10) Custom factors - none that I can think of<br/>\n<br/>\n Thank you for any help and advice you can lend</span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:38 PM - Aug 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome back!  Funny you should pick this moment to visit us because...<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i1132.photobucket.com/albums/m573/HipMaestro/400flash_zpskob6wpps.gif\" /><br/>\n Yes, you've just helped us reach a milestone.  Imagine that!  Of course, that means a special treat chosen just for you....<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i1132.photobucket.com/albums/m573/HipMaestro/cookie_zpsotwp3nr0.gif\" /><br/>\n I hope you are not fussy about sharing.  They are just too tempting! <br/>\n<br/>\n Anyhoo, as to your request...<br/>\n<br/>\n Let me get this straight.  You are seeking an epic cleric (that means at least 21 levels) with at least 11 monk.  That totals 32 right there so the most you could manage would be WM 8.  That's fine to get the extended crit range and multiplier but not really getting into the AB bumps.  But fortunately, a cleric doesn't need any help reaching the AB cap so that might work for you.<br/>\n<br/>\n However, there is going to be a cost.  To be spending the feats to qualify for WM, your spellcasting will suffer.  It will be a tight squeeze to get any metamagic (extended Divine spells are needed for long crawls and empowered abilities will compensate for any weaknesses like low HP, lowish saves, that sort of thing), focus in at least one school and cut through any SR (i.e. penetration feats).  For a divine WM, you are better off with either cleric/fighter or cleric/CoT depending on how picky you are about weapon choice.  A cleric with less than 24 levels will be easier to dispel.  That's another aspect to keep in mind for a dedicated self- and party-buffer.<br/>\n<br/>\n But if you do decide to force WM into this, I'd recommend going with a DEX build since Dodge requires DEX 13 anyway (or DEX 15 w/DWing).  Your Divine Power will more than compensate for low STR (plus the empowered Bull spell you have available).  That means finessing your weapon(s), and kamas will work nicely.   I haven't checked our completed builds or the legacy archive yet, but there's likely already something along the line of your request out there.<br/>\n<br/>\n As far as how to handle legendary levels, each server has different rules, so when you discover those, be sure to post them.  I am sure the members will have some suggestions with full disclosure (oh... and please post any custom info directly in the thread rather than a link because most times we don't have time to wander around websites looking for information and still do justice to your request).<br/>\n<br/>\n<em>edit: The ECB has nothing with this combo and only two builds in legacy, neither of which is worth anyone's time (IMO).  There's a good reason why you don't see both WM and DWing in a feat-starved cleric build and here is an example of exactly why (it's not a pretty sight)...</em><br/>\nSpoiler [+]<br/>\n<br/>\n Cleric(22), Monk(11), Weapon Master(7), Lawful Human<br/>\n<br/>\n STR: 10<br/>\n DEX: 16 (24)<br/>\n CON: 10<br/>\n WIS: 16 (19)<br/>\n INT: 14<br/>\n CHA: 8<br/>\n<br/>\n 01 - Clc(1): Dodge, Expertise<br/>\n 02 - Mnk(1)<br/>\n 03 - Clc(2): Wpn Finesse<br/>\n 04 - Clc(3): DEX+1 (17)<br/>\n 05 - Clc(4)<br/>\n 06 - Clc(5): WF: Kama<br/>\n 07 - Mnk(2)<br/>\n 08 - Clc(6): DEX+1 (18)<br/>\n 09 - Clc(7): Mobility<br/>\n 10 - Clc(8)<br/>\n 11 - Clc(9)<br/>\n 12 - Mnk(3): DEX+1 (19), ImpCrit: Kama<br/>\n 13 - Clc(10)<br/>\n 14 - Clc(11)<br/>\n 15 - Clc(12): Spring Attack<br/>\n 16 - Clc(13): WIS+1 (17)<br/>\n 17 - Mnk(4)<br/>\n 18 - Clc(14): Whirlwind<br/>\n 19 - Clc(15)<br/>\n 20 - Clc(16): WIS+1 (18)<br/>\n 21 - WM(1): EWF: Kama, WoC: Kama<br/>\n 22 - WM(2)<br/>\n 23 - WM(3)<br/>\n 24 - WM(4): DEX+1 (20), 2-Wpn Fighting<br/>\n 25 - WM(5)<br/>\n 26 - WM(6)<br/>\n 27 - WM(7): Ambidexterity<br/>\n 28 - Mnk(5): WIS+1 (19)<br/>\n 29 - Clc(17)<br/>\n 30 - Clc(18): Imp 2-Wpn Fighting<br/>\n 31 - Clc(19)<br/>\n 32 - Mnk(6): DEX+1 (21)<br/>\n 33 - Clc(20): Grt DEX (22)<br/>\n 34 - Clc(21)<br/>\n 35 - Mnk(7)<br/>\n 36 - Mnk(8): DEX+1 (23), Blind Fight<br/>\n 37 - Mnk(9)<br/>\n 38 - Mnk(10)<br/>\n 39 - Mnk(11): Armor Skin<br/>\n 40 - Clc(22): DEX+1 (24)<br/>\n<br/>\n HP: 334<br/>\n Saves F/W/R: 24/28/26 (33/37/35 v spells)<br/>\n Add'l saves: Mind Effects: +2<br/>\n BAB: 25<br/>\n AB (max, naked): 36 (melee), 32 (ranged)<br/>\n AC (naked/mundane armor/shield only): 33/33<br/>\n<br/>\n Skills: 237 - Concentration 43(43), Discipline 42(42), Intimidate 4(3), Listen 42(46),<br/>\n Spellcraft 43(45), Tumble 40(47), remaining ----&gt; 19<br/>\n<br/>\n<br/>\n<br/>\n<em>With kama focus, instead of bleeding the potential, I recommend you aim for something like cleric/monk/CoT.  That way you can get all your essential feats in pre-epic, have great saves, be able to DW kamas wearing robes and still have a serviceable spellcasting prowess offensively or as party support.  I also recommend lowering that \"Monk 11-12\" idea to no more than Monk 8 to get IKD in early epic with 2 late dumps to tumble &amp; discipline.  Clc24/Monk8/CoT8 has a lot more potential than Clc28/Mnk12 when you need to bump two different abilities in the same build.  Clc24/Mnk6/CoT10 is also very good but deciding when to take your last skill dump can be hard to determine depending on how much you figure on using IKD.  Unless there is some server-specific reason for needing more than 6-8 levels of monk?</em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kittie",
      "avatar": "no_avatar.png",
      "timestamp": "7:00 PM - Aug 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you!! Who doesn't enjoy a chocolate chip cookie even shared :)<br/>\n<br/>\n well there are some unique server modifications to report sub-races (Pagan +2 Dex, +4 Wis) also seems to give a lot of extra feats (1 every other lvl) which helps tremendously with a feat driven build like this one.<br/>\n With just a quick fly through test dummy untried in actual gameplay I threw this together<br/>\n<br/>\n<br/>\nSpoiler [+]<br/>\n<br/>\n<br/>\n 22 cleric / 11 Monk / 7 Weapons Master<br/>\n<br/>\n<br/>\n +2Dex, +4 Wis subrace bonus<br/>\n<br/>\n<span style=\"color:#FFFFFF\">stats </span>start /  final<br/>\n<br/>\n str 14 / 14<br/>\n dex 14(16) /  25<br/>\n con 10 / 10<br/>\n wis 14(18) / 23<br/>\n int 14 / 14<br/>\n chr 12 / 12<br/>\n<br/>\n 1. Monk (1) Dodge, Mobility<br/>\n 2. Cleric (1)<br/>\n 3. Monk (2) Weapon Focus(kama)<br/>\n 4. Monk (3) +1 Wisdom(19)<br/>\n 5. Monk (4) Expertise<br/>\n 6. Cleric (2) Spring Attack<br/>\n 7. Monk (5)<br/>\n 8. Cleric (3) +1 Wisdom(20)<br/>\n 9. Monk (6) Whirlwind Attack<br/>\n 10. Wpmaster(1) Weapon of Choise(kama)<br/>\n 11. Cleric (4) Ambidexterity<br/>\n 12. Cleric (5) 2 Weapon Fighting +1 Wisdom(21)<br/>\n 13. Cleric (6)<br/>\n 14. Wpmaster(2)<br/>\n 15. Wpmaster(3) Weapon Finesse<br/>\n 16. Monk (7) +1 Dex(17)<br/>\n 17. Monk (8) Imp. 2 Weapon Fighting<br/>\n 18. Cleric (7) Imp. Crit (kama)<br/>\n 19. Monk (9)<br/>\n 20. Monk (10) +1 Dex(18)<br/>\n 21. Cleric (8) Armor Skin, Epic Prowess<br/>\n 22. Cleric (9)<br/>\n 23. Wpmaster(4)<br/>\n 24. Cleric (10) Epic Weapon Focus +1 Dex(19)<br/>\n 25. Wpmaster(5)<br/>\n 26. Wpmaster(6)<br/>\n 27. Cleric (11) Imp. Combat Casting<br/>\n 28. Cleric (12) Great Wisdom I(22) +1 Dex(20)<br/>\n 29. Cleric (13)<br/>\n 30. Wpmaster(7) Blindfight<br/>\n 31. Cleric (14)<br/>\n 32. Cleric (15) +1 Dex(21)<br/>\n 33. Cleric (16)<br/>\n 34. Cleric (17) Lightning Reflexes, Great Wisdom II(23)<br/>\n 35. Cleric (18)<br/>\n 36. Cleric (19) Great Dex I(22) +1 Dex(23)<br/>\n 37. Cleric (20) Great Dex II(24)<br/>\n 38. Cleric (21)<br/>\n 39. Monk (11) Blinding Speed<br/>\n 40. Cleric (22) +1 Dex(25)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n Never tried playing with CoT builds might be something there if this build doesn't work out :D <br/>\n after some thought to your advice I'm thinking about going with 21 cleric/ 12 monk/ 7 Weapons Master<br/>\n the reason for the higher monk lvls is for diamond soul<br/>\n there was also a feat I've never seen before (Intuitive Attack) would that be better than (Weapon Finesse) for this type of build? and if so then what other feats should I consider to finish tweaking this build.<br/>\n<br/>\n<br/>\n Again thank you soo much for your help and advice :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:09 PM - Aug 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, Diamond Soul is nice with many more monk levels (like around 20 or more) but a cleric's Spell Resistance spell makes DS redundant.  Sure, DS cannot be breached, but for a Cleric 24, the SR would be 36 and even breached via Mord it will be 26, still better than a Monk 12's SR 22.  And naturally, lesser breaches will have less effect on the buff's stability.<br/>\n<br/>\n As long as that Intuitive Attack uses the DEX modifier to establish AB, then it could work.  Otherwise, without Weapon Finesse, your kamas will be using the STR modifier for attack.  BTW, you are taking Weapon Finesse w-a-a-a-a-y too late.  It should be taken within the first 2 or 3 levels of a melee build else you will be swinging and missing.  Your build is suffering from rushing to qualify for WM.  In the sample I provided Blind Fight is ridiculously late but such is the problem with a forced fit.  But the problem is the same in both cases.  You must sacrifice playability all for the sake of crit range and multiplier, which, IMO is really not worth it.  There is a reason no one designs this combo after 10+ years of toon building.  Wanna guess what that might be?<br/>\n<br/>\n Your ability spread is not optimized.  Unless your allotment to charisma is some sort of roleplay gesture, it gimps this build.<br/>\n<br/>\n You can't take ImpCC without CC.  However, rather than waste 2 feats just max concentration.  That way you need not be concerned about getting taunted either which CC/ImpCC won't help with.  Maybe your subrace thingy gives CC for free but even so, there are more important aspects that need addressing than avoiding some AoOs trying to cast within melee range.  If you learn to melee within Darkness, your cleric will never be open to AoOs again.  Think about it.  And I have yet to see Darkness \"molested\" by custom spell alterations.<br/>\n<br/>\n Plan your subrace bonuses to result in EVEN final ability scores.  Those trailing (odd) numbers serve no purpose and waste potential.<br/>\n<br/>\n TBH, I would always strive for at least 24 levels of cleric in a caster build rather than those extra monk levels that really serve no purpose other than the high saves the class gets.  Without Extended metamagic you are going to need the longest non-meta duration possible and all the slots you can muster as your divine buffs expire in just a couple turns (DivFavor/DivPower/Prayer/Battletide).<br/>\n<br/>\n The advantage of a cleric/monk/CoT is that Great Wisdom becomes available in epic levels as CoT bonus feats.  The synergy between cleric and monk benefits from being able to optimize your primary attack ability (in this case, DEX) with the normal bumps while gaining WIS in parallel via CoT.  For instance, CoT 10 offers +5 WIS by virtue of bonus as long as they are taken after level 20. The extra WIS affects cleric's spell DC (essentially universal +1 spell focus per each 2 WIS), monk WIS AC, Will saves and bonus slots.  The power of this combination is in its wisdom more than any other ability.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}