{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "868",
  "name": "Lawful Sexy, a Master Roshi tale: Monk 25 / Paladin 3 / Champion of Torm 10",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/lawful-sexy-a-master-roshi-tale-monk-25-paladin-3--t2354989.html",
  "author": "EasternPromises",
  "avatar": "10759017_1547723389.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "EasternPromises",
      "avatar": "10759017_1547723389.jpg",
      "timestamp": "9:27 AM - Jan 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Good evening all,<br/>\n<br/>\n<br/>\nAfter basically creating Valerfor's One Punch Man exactly and being pleasantly surprised it had already been done (if a little put out) I continued my quest of making a viable unarmed beat down hero. So I present Master Roshi, able to go super saiy... I mean, super human for time and gain massive divine bonuses. He has great saves and with a little CHA gear will make every save barring a nat 1 (if your server does that kind of thing). I could use any feedback you have!<br/>\n<br/>\nPros: 7 Attacks w/ flurry, 1d20+11 weapon damage, 41 AB, incredible saves, highly buffable, good stunning fist DC (34)<br/>\n<br/>\nCons: Many PWs have good unarmed support, but if yours doesn't this guy will be lackluster. Also no dev crit because where I play it's been nerfed, however it's very doable by dropping 2 GSs and Zen archery. <br/>\n<br/>\nIf for any reason you are having issues reaching the dodge cap take an additional level of Pally and get DS. <br/>\n<br/>\n<br/>\nWise Super Human:<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201901/10759017_5a7381eabc324a47eb3a8660dd666290.jpg\" />\n</dl>\n</span><br/>\n<br/>\nPaladin(3), Champion of Torm(12), Monk(25), Human<br/>\n <br/>\nSTR: 16 (32)<br/>\nDEX: 10<br/>\nCON: 10<br/>\nWIS: 14 (18)<br/>\nINT: 12<br/>\nCHA: 14<br/>\n <br/>\nHuman: (Quick to Master)<br/>\n01: Monk(1): Power Attack, Blind Fight, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n02: Monk(2): {Deflect Arrows}<br/>\n03: Monk(3): Weapon Focus: Unarmed<br/>\n04: Monk(4): STR+1, (STR=17)<br/>\n05: Monk(5)<br/>\n06: Monk(6): Toughness, {Knockdown, Improved Knockdown}<br/>\n07: Monk(7)<br/>\n08: Monk(8): STR+1, (STR=18)<br/>\n09: Monk(9): Zen Archery, {Improved Evasion}<br/>\n10: Monk(10)<br/>\n11: Monk(11)<br/>\n12: Monk(12): STR+1, Improved Critical: Unarmed, (STR=19)<br/>\n13: Paladin(1)<br/>\n14: Paladin(2): {Smite Evil}<br/>\n15: Paladin(3): Divine Might<br/>\n16: Monk(13): STR+1, (STR=20)<br/>\n17: Monk(14)<br/>\n18: Monk(15): Weapon Focus: No-Dachi<br/>\n19: Monk(16)<br/>\n20: Champion of Torm(1): STR+1, (STR=21)<br/>\n21: Champion of Torm(2): Epic Weapon Focus: Unarmed, Epic Prowess<br/>\n22: Champion of Torm(3)<br/>\n23: Champion of Torm(4): Great Wisdom I, (WIS=15)<br/>\n24: Champion of Torm(5): STR+1, Great Strength I, (STR=23)<br/>\n25: Champion of Torm(6): Great Wisdom II, (WIS=16)<br/>\n26: Champion of Torm(7)<br/>\n27: Champion of Torm(8): Great Strength II, Great Wisdom III, (STR=24), (WIS=17)<br/>\n28: Champion of Torm(9): STR+1, (STR=25)<br/>\n29: Champion of Torm(10): Great Wisdom IV, (WIS=18)<br/>\n30: Monk(17): Great Strength III, (STR=26)<br/>\n31: Monk(18)<br/>\n32: Monk(19): STR+1, (STR=27)<br/>\n33: Monk(20): Great Strength IV, (STR=28)<br/>\n34: Monk(21)<br/>\n35: Monk(22)<br/>\n36: Monk(23): STR+1, Great Strength V, (STR=30)<br/>\n37: Monk(24)<br/>\n38: Monk(25): Armor Skin<br/>\n39: Champion of Torm(11): Great Strength VI, (STR=31)<br/>\n40: Champion of Torm(12): STR+1, (STR=32)<br/>\n <br/>\nHitpoints: 390<br/>\nSkillpoints: 228<br/>\nSaving Throws (Fortitude/Will/Reflex): 33/33/31<br/>\nSaving Throw bonuses: Spells: +4, Mind Effects: +2<br/>\nBAB: 26<br/>\nAB (max, naked): 41 (melee), 31 (ranged)<br/>\nAC (naked/mundane armor/shield only): 29/31<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n <br/>\nDiscipline 43(54), Heal 19(23), Listen 41(45), Spellcraft 21(22), Spot 43(47), Tumble 40(40)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:42 AM - Jan 20, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So you are the reason they nerfed stunning fist eh?<br/>\n<br/>\nOne possible alteration to the build, make this Monk 26/ Pally 4/ CoT 10,<br/>\nDitch Zen Archery &amp; take Divine Shield as well, it will make this more capable in medium-magic PW's.<br/>\nAlso, you could swap Int/Con ability scores for more HP's since one detection skill is usually enough.<br/>\n<br/>\nThis is another very good build nevertheless, you turn out to be a prolific builder Sky.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "5:39 PM - Mar 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I love monks, and I like charismatic characters from an RP point of view, so I really love the idea of a charismatic monk beating up his opponents with divine might and divine wrath, but I'm guessing this is only really effective on very high magic worlds where you can cap a lot of attributes with items, isn't it? I mean, a regular monk already has four attributes to cap, and this one needs charisma on top of all that. And without charisma bonuses, these divine buffs are really too short to do much good. Or am i missing something here?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:36 PM - Mar 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I don' talk for everyone but I will tell you how I was doing this in WoG (quadruple stat buffing), which is a low-to-medium PW.<br/>\nYou can buff with temporary buffs. For example, this one is a Paladin so he can use wands of bull's strength, eagle's splendor, aura of glory, gmw, holy sword, bless weapon, etc.<br/>\nTogether with the permanent magic items, bracers, belts, etc. You can have most characters almost to the attribute cap no matter how many stats they need.<br/>\nYou can also use 1/day items with things like greater cat's grace on them and the rest, these stack with regular versions if you have them.<br/>\nOf course, ideally, you also need a crafter toon.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "12:17 PM - Apr 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Fair enough, I didn't take aura of glory into account. With that and eagle splendor, a single charisma item can be all that is needed to reach the cap.<br/>\n<br/>\nIn fact, I've decided to make a level 30 version of this and give it a go on a roleplay PW. I'd go with DS instead of zen archery, and considering that I still want at least 20 levels of monk, I'd take fighter instead of CoT, as I think that epic weapon specialization is a bit better than what you get with so few levels of CoT. And since I don't take CoT, I don't need weapon focus: NoDachi. That leaves the question of what I'll do with that feat. I could take dodge, or skill focus: taunt if I choose to max out taunt (that would require me to take at least one paladin level in epics, but I think it could be worth it, as the AB, while decent, isn't exceptional, and while getting caught flatfooted leaves this guy very vulnerable, he can still use the insta taunt exploit), but I've been thinking that maybe extra turning could prove useful here. After all, this guy will have at most 11 turn undead uses, which, if he uses both DM and DS, only makes for 5 uses each and one left, with a duration of 8 rounds per use, and 6 additional turn undead attempts from extra turning makes that 8 uses each, making this more playable I think. What do you say?<br/>\n<br/>\nNote that I could use blackguard instead of paladin since I don't have to deal with the alignment restriction from CoT, but in this PW, Aasimars are implemented as a human subrace with an undispellable permanent magical bonus of +2 charisma and +2 wisdom, favored class: paladin, and a few other minor bonuses, but they have ECL+1 and have to be good aligned, so if I want to play as one, I'll have to take paladin. These bonuses would help a bit with capping the attributes, but on the other hand I'd miss out on a bit of sneak attack damage, and more importantly, I'd progress slower with ECL and probably a multiclass penalty at some point (though I could always just go with monk/paladin and reroll with fighter levels at max level considering that rerolls are fairly easy to get in this PW), so I guess it really depends on whether I decide to RP as evil or good.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}