{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "357",
  "name": "Zen Archery AA(Druid!)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/zen-archery-aa-druid-t2349361.html",
  "author": "Azshanola",
  "avatar": "no_avatar.png",
  "replies": "5",
  "views": "1.7K",
  "posts": [
    {
      "author": "Azshanola",
      "avatar": "no_avatar.png",
      "timestamp": "5:26 AM - Feb 01, 2014",
      "content": "<div>I've been fiddling around with the idea of ranger/druid/AA based around Zen Archery. I'm not sure how viable this is but, figured I'd give it a go. Race would be elf, of course, so the usual +2 dex -2 con unless we go with a subrace. There's wild elf for +2 dex -2 int or wood elf +2 str -2 int  and -2 cha (I believe it might be +2 con as well the wikia is a little outdated). Anyways! Starting off, Arelith requires at least 3 levels in a class before you can switch out for the next one. So, at least 3 levels of ranger first, why ranger? Ranger offers a package that allows you to make a bundle of arrows(5 stacks) daily. They start off as some partially upgraded arrows and as the time goes by, they get better, also not having to buy arrows and having access to them whenever you need them is nice! More then that, for RP and such, you can track other players if you are a ranger, that sort of thing. Plus I just think it fits in with the character!<br/>\n<br/>\n<br/>\nGranted, I'm not really one that's good with min maxing, I just kind of threw stats where I thought I needed them admittedly, looking back on it, if we're going with zen archery, dex seems rather pointless so maybe boot it down from what I had, take away from cha, those sorts of things. Whichever elf is better, I'm not quite sure, coming to you guys for this sort of thing, I've never truly built anything beyond the usual ranger/rogue/AA sort of thing. Anyways, it would be nice to be able to be PVP and PVE viable if that is at all possible. Leveling also takes some time so, being viable at least during some stage of leveling would be awesome!(Cap is 30) Magic items are +2 at the highest, it's a low magic server, those usual types of things. Either way! If someone could take a look at this and fiddle with it, or at least help me along the way that would be wonderful! If not, understandable, either way thanks in advance!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:54 PM - Feb 01, 2014",
      "content": "<div>Hey man!<br/>\n<br/>\nIt's IMPOSSIBLE! AA Requires an arcane caster class: Sorcerer, Wizard or Bard.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:02 PM - Feb 01, 2014",
      "content": "<div>I believe ranger qualifies for AA on that server. (I might be mixing it up with some other server though).</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:48 PM - Feb 01, 2014",
      "content": "<div><blockquote><div><strong>Mick Dagger wrote:</strong>I believe ranger qualifies for AA on that server. (I might be mixing it up with some other server though).</div></blockquote>\n\nYeah, just read the whole post and he did mention a Ranger / Rogue / AA, which is also impossible.<br/>\n<br/>\nOK, Azshanola.<br/>\n<br/>\nI'll presume Mick is right and that Ranger allows you to be AA.<br/>\n<br/>\nI see a problem right off the bat with a Druid / Ranger AA. Both Druid and AA should be taken heavily in a build to be effective. AND it's a level 30 build, so you already have fewer levels to mess around with. AND in Arelith you need 3 levels of each class, so you dan't take just one Ranger, EVEN fewer levels. The best way I see this happening is a high-level Druid with AA on the side to complement his Zen Archery prowess. You'd want at least 18 Druid to qualify for Dragon Shape. So, Druid 18, Ranger 3 AA 9 would be the least bad spread for such a concept. This build would have high DCs for all your spells, all Druid shapes except Elder Elementals (which isn't that big a loss, trust me) and +5 to AB from AA.<br/>\n<br/>\nSo, is that what you want?<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Azshanola",
      "avatar": "no_avatar.png",
      "timestamp": "7:10 PM - Feb 01, 2014",
      "content": "<div>Yes! Sorry, I thought I tossed it in there, should have made it more visible but...Ranger -does- qualify as a substitute for the arcane requirement. As far as the build, that sounds perfect acceptable, yes!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:53 PM - Feb 01, 2014",
      "content": "<div><blockquote><div><strong>Azshanola wrote:</strong>Yes! Sorry, I thought I tossed it in there, should have made it more visible but...Ranger -does- qualify as a substitute for the arcane requirement. As far as the build, that sounds perfect acceptable, yes!</div></blockquote>\n\nOK, so you go ahead and build it, post it here and we'll help you improve it <br/>\n<br/>\nI see a problem in it that you don't have any Tumble or UMD in there, which is always nice to have, but if there ever was a build that needed Tumble less than others, it's an archer build.<br/>\n<br/>\nTake it EZ!</div>"
    }
  ]
}