{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "205",
  "name": "A poor AA in a dungeon.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/a-poor-aa-in-a-dungeon-t2354704.html",
  "author": "grom56",
  "avatar": "10745842_1510287074.jpg",
  "replies": 8,
  "posts": [
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "9:22 AM - May 20, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I'm taking a measure of bravery from Stag and gonna toss out my first silly question to you all.  <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n Here's the thing, I like the idea of playing an AA, I have one running in WoG now as a matter of fact, but I keep finding myself passing over poor Amberdane whenever I suit up for a solo run.  The guy is in pretty good shape and does a really nice job soloing wilderness areas and the like, areas where he has room to move and use his called shot (leg).  But I can't seem to get myself to take him into a dungeon, it's silly I know, but all those hallways and small rooms, just seem to defeat me.   I guess I should give the class break down for him:  AA/WIZ/Fighter  8/7/4 at this point.  Was planning on ending at 26/11/4.  I'm hoping that someone here can give me a few tips to settle my nerves about taking him into tight spaces.   Can an AA do well, soloing dungeons?<br/>\n<br/>\n Thanks for reading....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:40 PM - May 20, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi grom,<br/>\n<br/>\n I don't think it a silly question at all. I've just completed my first run-through as an AA (in Aielund), and the hardest thing I found to manage was exactly what you describe. It would have been agonising as a soloist, but chucking a tank in as doorway/corridor blocker made life so much easier. Nonetheless, PBS, Rapid Shot, Imbue and Hail of Arrows I found particularly useful at relatively low levels. In a solo run, I'd think the stealth skills would be particularly helpful in sniping, nipping around the corner and getting into shadows - not that they're much use for the build you're currently playing, I'm afraid. Throwing in a casting of darkness would also help confuse indoor opponents I guess.<br/>\n<br/>\n Anyway, I'm far from an AA expert. Have you read Mick Dagger's excellent Guide to the class? It's in the Game Guides section and very informative it is, too. If you have some time on your hands, you could also have a glance at my <strong>Arcane Archer - A First Stab</strong> thread in the Unfinished Builds / Build Request forum. I'm not blowing my own trumpet here, it includes contributions from those who<strong> do</strong> know what they're talking about.<br/>\n<br/>\n Cheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, grom - and to be fair, you did say you built on the hoof, but your intention of finishing at AA26/Wiz11/F4 seems to sum to 41 levels...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "2:13 AM - May 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ha!  You got me Stag....   that was supposed to be AA25/Wiz11/F4.   Me and math have never been close don't cha know??  <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n I was just getting ready to read both your build and Mick's guide tonight...  thanks for the nuddge.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "7:35 AM - May 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I haven't got Hail of Arrows yet, but I do use Imbue quite often.  It's a lot of fun to use.   I'm going to try to get my guy hunting in a major cave area on WoG soon, maybe this weekend...   I'll let you know how it goes.  I read both your build and Mick Dagger's Guild and they both gave me some ideas.<br/>\n<br/>\n Now, I know I'm not a builder, but reading over your \"First Stab\" brought up a few questions and gave me an idea for my next AA toon.  My first question has more to do with something I've seen in a few different builds here, and that I just have no clue what's going on:  In your listing of your skills, you have Heal: 1 (0).  Two things about this I don't follow, what's with the second number and why have the skill if it's dropped somehow to \"0\"??  <br/>\n<br/>\n My second question is about your Wizard levels.  I'm not understanding why you only take two levels?  A third level opens up another level of spells, which I would feel to be very handy to have.  This may be because of the Monk levels, I confess that I've never run a Monk, so have no clue about that.  But if you only need a single level of Wizard to open AA, why take the second level at all?  I must say I'm lost.   I found it very hard to keep my Wizard levels at no more then 11 and really would feel any less to really hurt in the long run.   <br/>\n<br/>\n I did enjoy reading the build, and could see trying it but would swap Rogue in where you have Monk, and maybe drop Wizard for Bard.  I don't care for the Bard class much, so I could see me only taking a few levels in it to open the AA path.  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:45 AM - May 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll try to answer as best I can, but please bear in mind \"these views do not necessarily reflect the position of the Guild\". Disclaimer over.<br/>\n<br/>\n On the skills question: that used to bamboozle me, too, but the convention is that the first figure denotes the input into the skill - in this case, just the 1 point - while the one in parenthesis shows the nett result, in this case, and with a -1 WIS, that means 0. Again, for this particular example a single inputted point in any skill is really neither here nor there, so I whacked it in Heal, otherwise I'd be left with a spare point and I don't like danglers much.<br/>\n<br/>\n On the Wizard issue, it's quite simple. I don't do arcanists (a mixture of personal preference and lack of experience), so initially I only wanted a single Wiz level - just to qualify for AA: the second A being of greater importance to me. Not once did I cast a single spell while playing up to level 37. I ended up taking 2 levels for +1 BAB. That's because you can only take a max of 10 levels of AA pre-epic, so would initially have been left with 9 levels of Monk and 1 of Wiz. Monk is a 3/4 BAB class and Wiz a 1/2 class: which meant I'd have a BAB of 10 (AA) + 6 (Monk) + 0 (Wiz) = 16 pre-epic. Taking the second level of Wiz and dropping one of Monk gave the result of BAB 10 (AA) +6 (Monk) +1 (Wiz) = 17, thus a better chance to actually hit my target.<br/>\n<br/>\n On reflection, I think I'd take Rogue instead of Monk myself, but Monk is my single favourite class, so when constructing that build - which was me venturing into unknown territory (should really have called it \"First Shot\", I suppose) - I reverted to a class I was comfortable with. I would have gone with Bard instead of Wizard (I tend not to regard Bardsong as \"true\" arcanism) except for two things. First, Bard is a non-Lawful class, while Monk has to be Lawful. Second, I was playing as an elf, which has Wiz as its favoured class, so I'd attract an xp penalty by taking Bard. That matters less in a PW - where you can nullify the effect by having respawning foes popping up constantly - than it does in module play, where you can't, and it can actually set you back a couple of levels or more.<br/>\n<br/>\n There you go - hope this makes sense!<br/>\n<br/>\n Cheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, meant to mention, Empyre posted his Persuasive Archer build within the First Stab thread, and that's a Rogue/AA/Wiz build which might appeal to you.<br/>\n<br/>\n<em><strong>EDIT 2:</strong></em> Have just been having a browse through some earlier and diverse discussions on this 'ere forum (having a quiet Sunday), and what do I find? The very first thread in the NwN Tavern sub-forum, from 2011, entitled \"Where's me Beer?\" was authored by one \"grom\" - any relation, perchance?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "2:44 AM - May 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think I understand now Stag....   Except for the pesty skill stuff....  I understand both why you took the 1 point and why it's shown as a 0, so I'm good.<br/>\n And while I understand now why the 2nd level in Wizard, it highlights a main reason I'm not a builder!  I would have never been able to break down the BAB like that....   But I do see where you were coming from with it.<br/>\n Playing on WoG pretty much all the time, I've never been worried about xp penaltys, but I can see how it would effect a build if you plan on playing somewhere that does have them.<br/>\n Thanks for the replys Stag!   Things are less foggy now!<br/>\n<br/>\n I did look over Empyre's build, thanks.<br/>\n<br/>\n And you found me out Stag!   That post was written by me...  way back.   When I found this place a short time ago, I had forgotten all about it, and when I tried to join as Grom it told me that the name was in use.   I figured that was me from the past, and trying my standby password did not work.  I did mention I'm an old man right??  I had no clue what the password might be, so I had to make a new account using Grom56 instead.  Ah well... <br/>\n I went back andr reread that old post and man did it bring a smile to my face!   There's Din and Bob posting as well, Kail...   Even Mick Dagger...  Plus a few who's handles I didn't remember or write down so can't mention here, but dang!  <br/>\n<br/>\n Thanks for the memories Stag!!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:48 AM - May 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, in the interests of full disclosure, it was Monsieur Michel de Dagger who first pointed out the BAB stuff to me - and who also remains skill point monitor-in-chief in my mind. I'm a relative newb to the game - only been playing since late 2014 - but I stumbled onto this site early on and they haven't told me to shut the f*** up yet, so I'm sticking with it!<br/>\n<br/>\n While I can't quite claim your venerable stature, I do have over half a century on my back, so I find I have no problem with asking dumb-ass questions - vanity and pride are not issues for me any more.<br/>\n<br/>\n Oh, and, if you're interested, you can still grab the builds and discussions from aeons past via the Legacy Archive - downloadable from a link Hip graciously provided in the Rules and Tools sub-forum here.<br/>\n<br/>\n But most importantly: I shall capitalize you in future - especially as you've now got a cool sigil!<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "8:40 PM - Jun 05, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Grom...<br/>\n<br/>\n ya said you have wiz 7? Wiz 7 gets ya lvl 4 spells....<br/>\n<br/>\n so any and all of the below will slow things down to give you more time to shoot em... not all are area of effect... so make sure ya know what it will do before ya get overrun...<br/>\n<br/>\n 1st lvl<br/>\n Grease, Color Spray, Scare, Sleep<br/>\n<br/>\n 2nd lvl<br/>\n Blindness, Darkness, Web<br/>\n<br/>\n 3rd lvl<br/>\n Slow, Stinking cloud<br/>\n<br/>\n 4th lvl:<br/>\n confusion, Fear, Wall of Fire<br/>\n<br/>\n And then there are the manual things....<br/>\n Bags of tanglefoot, bags of spikes, choking powder...<br/>\n<br/>\n<br/>\n And I forgot to mention some of my all time favorites...<br/>\n<br/>\n Summon Meat Shield Lvl 1-4.<br/>\n<br/>\n Also useful for more caster heavy variations of toons as well....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "3:28 AM - Jun 08, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">All good advice Con, I will try to work most of that into my play.   I do like having a wand of summons, even if it's only that nice handy Dagger....  I may have to spend so gold and scribe me some scrolls for these spells...   Hmmm...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}