{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "278",
  "name": "Thoughts ?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/thoughts-t2348108.html",
  "author": "Kalistez",
  "avatar": "10235447_1565972826.jpg",
  "replies": 9,
  "posts": [
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "8:03 AM - Jan 06, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi Guys,<br/>\n<br/>\nI am looking for a build to play on a PW.  It is low to mid magic (up to +6 ish) with no permahaste and very limited immunities (individual spells as opposed to schools or types).  <br/>\n<br/>\nUp to this point I have been tossign up between<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/mith-s-blood-and-faith-cleric-26-bard-4-rdd-10-t515481.html\" rel=\"noreferrer\" target=\"_blank\">Mith's Blood and Faith</a><br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/the-bane-crusher-ranger-23-rogue-16-sd-1-t515517.html\" rel=\"noreferrer\" target=\"_blank\">Max's Bane Crusher</a><br/>\n<br/>\nand <br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/shadow-sword-fighter4-rogue26-cot10-itwf-ed-sc-5-t2297238.html\" rel=\"noreferrer\" target=\"_blank\">Tyr's Shadow Sword</a><br/>\n<br/>\nIt is a very slow levelling world with quite severe xp penalties on death so I need something that is playable the whole way through, not just tough at 40 (I was going to take 4 levels of rogue pre epic in max's build for umd and tumble dumps)<br/>\n<br/>\n<br/>\nI would prefer dual wielding and epic dodge but it is not a deal breaker if the build is tough.  That said UMD is pretty much a must.<br/>\n<br/>\nThanks in advance<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:56 PM - Jan 06, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Kalistez!<br/>\n<br/>\nFunny that you ask us to pick between 3 TOTALLY DIFFERENT builds! Let me sort of outline the characteristics of each build so you can decide what you want to play.<br/>\n<br/>\n1- Mith's Blood &amp; Faith is a highly offensive STR-based self-buffer with insane AB and damage thanks to Clerical goodies and RDD boni. The AC is only average, the saves are bad (as with any non-CoT Cleric), but you shouldn't have too much trouble leveling him up. You can take Travel domain here and have access to Haste.<br/>\n<br/>\n2- My Bane Crusher is a dual-wield stealther with HiPS, BoE and Epic Dodge, which is very hard to level early on, so for this particular setting where death isn't recommended (not that it ever is LOL) I wouldn't go with the Bane Crusher. 4 Rogue pre-epic would ease the leveling, but you still don't get most of your Sneaks and important feats till way later in the build, so the first 20 levels are a pain to deal with even with the Rogue addition. The good thing about this build is that you can select your Favored Enemies strategically, picking types that are immune to criticals and sneaks so that you always have a way of dealing damage to all kinds of enemies.<br/>\n<br/>\n3- Tyr's Shadow Sword is a versatile build that lacks in the non-Sneak damage department, but more than makes up for it with excellent defensive properties. I'd say that if you want to avoid death, this is the one you should use, no question. High saves, High AC, Traps, very versatile, while only struggling against sneak-immune types, but that's what traps are for, right?<br/>\n<br/>\nAlso, for this particular world, I'd like to recommend 2 builds I have that would probably excel and one that isn't mine but is also a monster:<br/>\n<br/>\n1- My <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/draconic-arcanist-wizard-26-bard-4-rdd-10-t2344104.html\" rel=\"noreferrer\" target=\"_blank\">Draconic Arcanist</a>. No Permahaste, you say? Worry not, this guy has all Arcane spells, EMA, Autostill 3, EW, 39 unbuffed AB etc.. In these settings, he would probably excel. You need to be mindful of the weapon choice, because where I play Tenser's has been modified. If in your server Tenser's isn't modified, you should probably follow WhiZard's suggestion of focusing in a Longsword, which is further down the topic.<br/>\n<br/>\n2- My <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/drow-fencer-fighter-14-rogue-19-weapon-master-7-t2329192.html\" rel=\"noreferrer\" target=\"_blank\">Drow Fencer</a>. This guy is similar to Tyr's Shadow Sword, except he doesn't dual-wield for an even higher AC (shield). He has ED, no SC5 (Improved Invisibility scrolls accomplish just the same), 47 unbuffed AB (3 higher than Tyr's build), but he does have XP penalty which can be a problem where leveling is slow, EWS, lower saves (no CoT). Still, he's very versatile. If you don't want XP penalty, all you need to do is go with Halfling instead of Elf, but the downside is that you'll also need to swap Rapier, as it's a 2-handed weapon for a Halfling, but you'd gain +1 AB from small stature.<br/>\n<br/>\n3- GDL's <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build249289.html\" rel=\"noreferrer\" target=\"_blank\">Citadel</a>. This guy is a very cool tanky build with a lot of versatility, but low AB. He can soak up damage like there's no tomorrow, can't be flanked, and will slowly but surely wear enemies down, sapping their STR with Crippling Strike and Sneak Attacking them until they are undone.<br/>\n<br/>\nAnyway, I hope this post doesn't create any more doubts in your head than you already have lol. I think it's always nice to be undecided between several great and very powerful builds, don't you?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:00 PM - Jan 06, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey again!<br/>\n<br/>\nYou said you don't want to die. I actually forgot one build that is really all for surviving. It's <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build213875.html\" rel=\"noreferrer\" target=\"_blank\">GDL's Death's Rival</a>. As for most of GDL's builds, this one also has low AB, but if you want something versatile that is specialized in SURVIVING, this guy is your go-to build! <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "8:14 AM - Jan 07, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Max !<br/>\n<br/>\nI was actually leaning towards Tyr's build as I have been playing this lately <br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build117503.html\" rel=\"noreferrer\" target=\"_blank\">Eleven Rogue</a> <br/>\n<br/>\nand really been enjoying it. (the one in the second post)<br/>\n<br/>\nFrom looking at it the CoT levels outweigh the single level of Shadowdancer.<br/>\n<br/>\nDeath's rival looks really interesting.  I would be tempted to drop toughness for exotic and kukri's and to take blind fight earlier but I don't see it effecting the build much.  <br/>\n<br/>\nWithout knowing if II scrolls are readily available, would you go for SCV or EDR ?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:30 PM - Jan 07, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'd probably try to find out first, maybe make another type of character. When I play something new, I normally start with a Druid, because they're really self-sufficient and very little reliant on items, that way it allows me to find out more about the items in the world to only then create toons that rely on items more. You can ask players you meet there, etc...<br/>\n<br/>\nAs for GDL's build, I'd keep it as is until you know more about the world to make adjustments to it based on your knowledge of the server rather than on doubts. Dropping Toughness would reduce the HP, which is the way the build tanks, but it's viable if you make up for it with intelligent in-game decision-making. However, Kukris are OK, but most of the damage that the build does is Sneak Attack, which doesn't multiply on criticals, so the extra threat range isn't going to make much of a difference, and you'll still struggle against crit-immune monsters. I'd go for maces, which are bludgeoning weapons, the least common type of damage resistance found in any monster type, like Golems, Undead and other known crit-immune monsters. And where I play, there are maces that stun on hit, which is excellent if combined with 24 Rogue levels.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "1:06 AM - Jan 16, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Max,<br/>\n<br/>\nI was playing with Mith's Elven Rogue build linked above and came up with the following, would you be able to give it the once over for me ?<br/>\n<br/>\n<br/>\nRogue(21), Fighter(14), Shadowdancer(5), Elf<br/>\n<br/>\nSTR: 14<br/>\nDEX: 18 (32)<br/>\nCON: 12<br/>\nWIS: 10<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nElf: (Hardiness vs. Enchantments, Keen Sense, Low-light Vision, Skill Affinity: Listen, Skill Affinity: Search, Skill Affinity: Spot, Sleeplessness)<br/>\n01: Rogue(1): Dodge<br/>\n02: Fighter(1): Weapon Finesse<br/>\n03: Fighter(2): Mobility, Weapon Proficiency Exotic<br/>\n04: Rogue(2): DEX+1, {Evasion}, (DEX=19)<br/>\n05: Rogue(3): {Uncanny Dodge I}<br/>\n06: Fighter(3): Weapon Focus<br/>\n07: Rogue(4)<br/>\n08: Shadowdancer(1): DEX+1, {Hide in Plain Sight}, (DEX=20)<br/>\n09: Fighter(4): Blind Fight, Weapon Specialization<br/>\n10: Fighter(5)<br/>\n11: Rogue(5)<br/>\n12: Rogue(6): DEX+1, Two-Weapon Fighting, (DEX=21)<br/>\n13: Fighter(6): Ambidexterity<br/>\n14: Fighter(7)<br/>\n15: Rogue(7): Knockdown<br/>\n16: Fighter(8): DEX+1, Improved Two-Weapon Fighting, (DEX=22)<br/>\n17: Rogue(8)<br/>\n18: Shadowdancer(2): Improved Critical, {Darkvision}<br/>\n19: Shadowdancer(3)<br/>\n20: Shadowdancer(4): DEX+1, (DEX=23)<br/>\n21: Rogue(9): Great Dexterity I, (DEX=24)<br/>\n22: Fighter(9)<br/>\n23: Rogue(10): Improved Evasion<br/>\n24: Fighter(10): DEX+1, Great Dexterity II, Epic Weapon Focus, (DEX=26)<br/>\n25: Shadowdancer(5): {Defensive Roll}<br/>\n26: Fighter(11)<br/>\n27: Rogue(11): Great Dexterity III, (DEX=27)<br/>\n28: Fighter(12): DEX+1, Epic Weapon Specialization, (DEX=28)<br/>\n29: Rogue(12)<br/>\n30: Fighter(13): Great Dexterity IV, (DEX=29)<br/>\n31: Rogue(13): Epic Dodge<br/>\n32: Rogue(14): DEX+1, (DEX=30)<br/>\n33: Rogue(15): Self Concealment I<br/>\n34: Rogue(16): Self Concealment II<br/>\n35: Rogue(17)<br/>\n36: Rogue(18): DEX+1, Self Concealment III, (DEX=31)<br/>\n37: Rogue(19): Self Concealment IV<br/>\n38: Rogue(20)<br/>\n39: Fighter(14): Self Concealment V, Epic Prowess<br/>\n40: Rogue(21): DEX+1, (DEX=32)<br/>\n<br/>\nHitpoints: 346<br/>\nSkillpoints: 336<br/>\nSaving Throws (Fortitude/Will/Reflex): 20/15/33<br/>\nSaving Throw bonuses: Spells: +4, Mind Effects: +2, Traps: +6<br/>\nBAB: 27<br/>\nAB (max, naked): 42 (melee), 39 (ranged)<br/>\nAC (naked/mundane armor/shield only): 29/32<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nDisable Trap 12(16), Discipline 42(44), Heal 1(1), Hide 42(53), Listen 30(32), Move Silently 42(53), Open Lock 10(21), Search 24(28), Set Trap 11(24), Spellcraft 20(22), Tumble 40(51), UMD 36(35)<br/>\n<br/>\n<br/>\n01: Disable Trap(1), Heal(1), Hide(4), Listen(4), Move Silently(4), Open Lock(1), Search(4), Set Trap(1), Tumble(4), UMD(4), Save(12), <br/>\n02: Discipline(5), Save(11), <br/>\n03: Save(15), <br/>\n04: Disable Trap(1), Hide(3), Listen(1), Move Silently(3), Open Lock(1), Search(1), Set Trap(1), Tumble(1), UMD(3), Save(10), <br/>\n05: Disable Trap(1), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Set Trap(1), Save(14), <br/>\n06: Save(18), <br/>\n07: Disable Trap(1), Hide(2), Listen(1), Move Silently(2), Open Lock(1), Set Trap(1), Spellcraft(5), Tumble(5), UMD(3), Save(2), <br/>\n08: Hide(1), Listen(1), Move Silently(1), Save(7), <br/>\n09: Save(11), <br/>\n10: Save(15), <br/>\n11: Save(25), <br/>\n12: Discipline(2), Save(31), <br/>\n13: Disable Trap(1), Hide(5), Listen(1), Move Silently(5), Open Lock(1), Set Trap(1), Tumble(5), UMD(6), <br/>\n14: Disable Trap(1), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Set Trap(1), <br/>\n15: Disable Trap(1), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Set Trap(1), <br/>\n16: <br/>\n17: Disable Trap(1), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Set Trap(1), Spellcraft(5), <br/>\n18: Hide(2), Listen(1), Move Silently(2), Tumble(5), <br/>\n19: Hide(1), Listen(1), Move Silently(1), <br/>\n20: Hide(1), Listen(1), Move Silently(1), <br/>\n21: Disable Trap(1), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Set Trap(1), UMD(5), <br/>\n22: Discipline(15), <br/>\n23: Disable Trap(1), Hide(2), Listen(1), Move Silently(2), Open Lock(1), Set Trap(1), Tumble(5), UMD(5), <br/>\n24: <br/>\n25: Hide(2), Listen(1), Move Silently(2), <br/>\n26: <br/>\n27: Disable Trap(1), Hide(2), Listen(1), Move Silently(2), Set Trap(1), Spellcraft(5), <br/>\n28: <br/>\n29: <br/>\n30: Discipline(5), <br/>\n31: Disable Trap(1), Hide(4), Listen(1), Move Silently(4), Search(1), Tumble(5), UMD(5), <br/>\n32: Hide(1), Listen(1), Move Silently(1), Tumble(5), <br/>\n33: Hide(1), Listen(1), Move Silently(1), UMD(5), <br/>\n34: Hide(1), Listen(1), Move Silently(1), <br/>\n35: Hide(1), Listen(1), Move Silently(1), Save(3), <br/>\n36: Hide(1), Listen(1), Move Silently(1), Save(10), <br/>\n37: Hide(1), Listen(1), Move Silently(1), Spellcraft(5), Tumble(5), Save(2), <br/>\n38: Hide(1), Listen(1), Move Silently(1), Save(9), <br/>\n39: Discipline(15), <br/>\n40: Hide(1), Listen(3), Move Silently(1), Search(18), <br/>\n<br/>\n<br/>\n<br/>\nSD was taken as early as possible for playability reasons due to the slow levelling nature of the server.  I also went from 1 level of SD to 5 so I could take 4 pre epic and not get -1 BAB.<br/>\n<br/>\nI have managed to squeeze in just about everything except for Imp KD, without getting an XP penalty until level 33.<br/>\n<br/>\nThe only other thing I am considering is dropping SCV for either<br/>\n<br/>\n A)  IKD, Great Dex x4<br/>\n B)  IKD, Epic Toughness *2, ESF Hide *2<br/>\nor<br/>\n C)  Some combination of the above (and maybe Crippling Strike.)<br/>\n<br/>\nThanks for your help.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "9:47 AM - Jan 16, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like sneaker builds and this is a strong sneaker. <br/>\n<br/>\nAs to your questions: Many will say that you can get by without SC5 by using Improved Invisibility scrolls. And, that can be essentially true, depending on the environment. However, keep in mind that 1) casting Imp Inv from a scroll reliably under hard core rules requires UMD of 28 or higher. That isn't too bad, especially considering that *usually* you can try and cast again, if you fail the UMD check. And you wouldn't have SC5 before you get the requisite UMD anyway. 2) More importantly, IMO, is whether the enemy casters in your environment cast greater dispelling and breaches often. Where I play, most enemy casters have a pretty standard sequence when they spot an enemy PC: call a summons, buff themselves, and debuff their opponents. That means that Imp Inv from a scroll (caster level 7) is going to disappear very quickly. And, 3) scroll Imp Inv lasts 7 minutes, which means that it will be running out on you quite often. If you are good at keeping stacks of those scrolls around and rebuffing often, this isn't a problem. Anyway, just some things to consider.<br/>\n<br/>\nNot sure if you know this, but you don't have to invest any ranks in the heal skill to use healer's kits. Maybe that 1 point in heal serves another purpose on your PW, but I thought I'd mention it.<br/>\n<br/>\nYou can get by with 18 ranks of spellcraft, since the save bonus is based on the total skill levels, which will be 20 with this build. Having an adjusted spellcraft of 22 isn't needed for that save bump and isn't getting you much else.<br/>\n<br/>\nYou can't take ESF in the same skill more than once. Maybe ESF: Hide and ESF: Move Silently? Actually, with your will save being what it is, if you free up an epic feat, you might consider Great Will or ESF: Spellcraft to get that will save up a bit. That is going to be this build's weak spot, unless you can find mind-immunity gear.<br/>\n<br/>\nMany people (and I am generally among them) consider it better to take two Great Constitutions instead of two Epic Toughnesses. The reason is that both result in an extra 40 HP at level 40 and the extra CON means +1 fortitude saves (and +1 concentration). Most of the exceptions fall into some combination of three circumstances: When you are looking for extra HP in a shape-changer whose forms override CON, when Epic Toughness is a class bonus feat and Great Con is not, or when you aren't planning on playing the build to level 40 and you absolutely need the extra HP in the lower epics.<br/>\n<br/>\nAnyway, that's some food for thought.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:07 PM - Jan 16, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Kalistez,<br/>\n<br/>\nI agree with Zork here, but I'm gonna go even further on the analysis. <br/>\n<br/>\n- I'd drop Rogue down to 19, and SD down to 1, which gives you 6 more Fighter levels and costs you 1d6 Sneak Attack and skill points, but gives 3 extra feats to play with. The resulting spread would be Fighter 20 Rogue 19 SD 1. You can go Fighter 16 Rogue 4 pre-epic and just play it more like a Fighter. If you don't want to, at least go Rogue 19 SD 5 Fighter 16 for another feat. The Rogue Bonus Feats I'd take would be Defensive Roll (at 10), Improved Evasion (at 13), Epic Dodge (at 16) and Crippling Strike (at 19) as an icing to the cake. If you keep SD at 5, you get Defensive Roll from that, so you can swap that one for Improved Sneak Attack and take it last.<br/>\n<br/>\n- I'm presuming you'll be dual-wielding Kukris due to the exotic weapons, TWF feats and finesse, right? If you are, why not go Halfling instead of Elf? You'll get +1 AB and +1 AC from small stature, a racial bonus to stealth skills and won't have XP penalty cuz Rogue is the favored class of Halflings. Win / Win situation.<br/>\n<br/>\n- Personally, I wouldn't waste any skill points in Spellcraft. Yes, they do give a nice bonus to saves, but I'd much rather put them in Rogue skills, such as Disable Trap (to be able to recover all traps you find and use them on your enemies), Set Trap, Listen, etc... Just use UMD scrolls and potions (or item-swapping) for immunities when necessary.<br/>\n<br/>\n- With the extra Fighter feat, you can get IKD. Whatever you have left, pump up your DEX!<br/>\n<br/>\nI'm sure there's more, but I'm out of time now.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "6:22 AM - Sep 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><hr/>I'd probably try to find out first, maybe make another type of character. When I play something new, I normally start with a Druid, because they're really self-sufficient and very little reliant on items, that way it allows me to find out more about the items in the world to only then create toons that rely on items more. You can ask players you meet there, etc...<br/>\n  </div></blockquote>\n Hi Max,<br/>\n<br/>\n Sorry for the necro,<br/>\n<br/>\n Do you have a goto druid build that you use on new worlds, and if so would you mind posting it ?<br/>\n<br/>\n Thanks<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:33 AM - Sep 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am not Kane but if you want a Druid build that is <strong>not </strong>a Dragon and very play-able from the beginning, might i suggest this?<br/>\n<br/>\n =&gt; <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2353943/GREEN-KNIGHT-OF-EHLONNA-DRUID-28-FTR-4-COT-8#.VBvOphZIrhQ\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... BvOphZIrhQ</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}