{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "568",
  "name": "The Black-Hearted Dragon Poet (Druid 20/Bard 16/Blackguard 4)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-black-hearted-dragon-poet-druid-20-bard-16-bla-t2355531.html",
  "author": "TheSquid",
  "avatar": "10759318_1592552655.jpg",
  "replies": 7,
  "posts": [
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "6:39 PM - Aug 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">EDIT: apparently Divine Might does not add to AB... fixed the dragon stats accordingly. The build is still viable, but it is not the machine of destruction I hoped. Thanks Orion for pointing this out. <br/>\n<br/>\nHi all<br/>\n<br/>\nI made yet another Dragon Shape build, trying to address what I think is its main issue, i.e. low AB. As a Druid there are very limited ways to raise AB (I think only buffing STR), and most buffs you can get from other classes are dispellable at least by Mord's. Worst is, you cannot rebuff or cast defensive spells while shifted.<br/>\n<br/>\nHere I use Blackguard for 4 APR, dark Blessing and Divine Might, and Bard for (curse) song, UMD, Taunt and Tumble. The result looks playable to me, and it might actually be very very good in certain situations.<br/>\n<br/>\nHere is the build:\n<details><summary>Spoiler</summary>\n</details>\n<br/>\nPros:<br/>\n- High AB in Dragon Shape. Depends on buffs that can be cast when shifted and cannot be dispelled.<br/>\n- Full Druid spellcasting (SoV has DC 35 which will work against mages, Finger of Death has DC 34).<br/>\n- Full UMD usage for equipment optimisation and arcane spellcasting via scrolls.<br/>\n- Before level 36, Divine Shield and Might plus Druid buffs make you a passable meleer in human form, and arguably better than a Monk in bear/elemental form.<br/>\n- Dark Blessing means you have excellent Will and good Fortitude (which can be increased by 6 with CHA and have +8 against spells). All saves become insane in Dragon form.<br/>\n- Full Bard spellcasting, albeit without Still Spell. Access to Haste, Cat's Grace and Improved Invisibility is particularly useful for a Druid.<br/>\n- Blackguard gives you 1d6 sneak attack and another stackable copy of Bull's Strength which is nice.<br/>\n<br/>\nCons: <br/>\n- No feats to speak of. In particular, no KD, no BF, no Spell Focus, no Epic Spells, etc etc.<br/>\n- Lower AC and worse attack schedule than a Monk. Expertise compensates a bit, Divine Shield helps (not in Dragon Shape) and the AB is so high it is better than the Monk in many situations.<br/>\n- Dragon Shape comes late (36). Hopefully you have a decent melee presence into the 30s with the song/curse song maturing.<br/>\n- Low HP in human form.<br/>\n- Both Druid and Bard maturity in abilities and spellcasting come late.<br/>\n- Lowish reflex save vs. non-spells (still equals that of a Rogue 40 with 10 DEX), no evasion. When shifted, reflex is very good.<br/>\n- When flat-footed, the dragon has about 10 AC. Taunting makes you flat-footed. Use at your own risk. <br/>\n- Depends on resting in ways which are difficult to optimise. Elemental shape/Wild shape/Song/DM/DS all have few usages per day (and Druids get few spells/day), so combining them is not obvious.<br/>\n- No discipline. Wear a KD immunity armor/shield/helm or suffer. Prone dragons are also flat-footed.<br/>\n- No chance to pierce SR except Mord scrolls. At least you have some melee presence.<br/>\n<br/>\nSome Dragon Shape stats at level 40:<br/>\n<br/>\nAC: 41 (base+DEX+dodge+size) + 6 (cap DEX) + 8 (tumble) + 5 (gear) + 2 (curse song) + 5 (Expertise) + 5 (barkskin)= 72.<br/>\nAB: 49 (base+STR+enhancement+size) + 6 (cap STR) + 2 (song) + 5 (curse song) + 6 (taunt) + 2 (War Cry) = +70/+65/+60/+55.<br/>\nUndispellable AB assuming Expertise is on, no Taunt, and no stats from items : 49 + 2 + 5  - 5 = +51/+46/+41/+36.<br/>\n<br/>\nFor comparison, a simple Druid/Monk/X build with 44 WIS and capped STR and DEX has (in Dragon Shape):<br/>\n<br/>\nAC: 41 + 6 + 8 + 5 + 17 = 77 with no other buffs (or Expertise). The 17 bonus from WIS is not lost when flat-footed.<br/>\nAB: 49 + 6 = +55/+52/+49/+46/+43 (/+40 if one takes a full BAB class). Monk also gets Flurry of blows for yet another attack, but at a loss of so precious AB.<br/>\n<br/>\nComparisons with other Dragon builds:<br/>\n<br/>\nThe excellent <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-world-ender-druid-32-fighter-2-monk-6-t2355416.html\" rel=\"noreferrer\" target=\"_blank\">World Ender</a> build manages 97 buffed AC (I am a bit confused as to how, but at least 87 should be undispellable). The similarly excellent <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/order-of-jormungandr-1-69-t2355108.html\" rel=\"noreferrer\" target=\"_blank\">Order of Jormungdandr</a> has 88 buffed AC (at least 82 undispellable).<br/>\nOn the other hand, the World Ender has the above +55 attack schedule (it can only buff its STR), while the OoJ boosts an amazing +66/+66/+66/+63/+60/+57/+54/+68 with haste and flurry when fully buffed. This is 3 more attacks/round than our Dragon Poet, and with similar AB. Most of it comes from Divine Power, which  can be dispelled even by Greater Dispelling. In fights which involve dispel spams, enemies with not-super-high AB, very high AC, and which do not last too long, the Poet might be better.<br/>\nOne should also point out that these builds get Improved KD, Blind Fight, etc, which out Poet does not have.<br/>\n<br/>\nOverall, I think this is a cool idea that has potential and has not been posted before (on the ECB database there are 3 builds with Dragon Shape+Bard, one of which takes PM for crit immune dragon, and two take RDD I am not sure what for; on this forum I found <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17462#p17462\" rel=\"noreferrer\" target=\"_blank\">an AA build</a>).<br/>\nThe idea to use Divine Might in a Dragon build has been tried at least in the <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build164532.html\" rel=\"noreferrer\" target=\"_blank\">Order of the Divine Dragon</a> and in the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17604#p17604\" rel=\"noreferrer\" target=\"_blank\">Divine Damage Druid</a> (both Druid/Cleric/Monk), as well in at least <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build304912.html\" rel=\"noreferrer\" target=\"_blank\">a Paladin build</a> (which has alignment shifts). On this forum I found <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19#p19\" rel=\"noreferrer\" target=\"_blank\">Tiamat's Claw</a> (Druid/BG/Monk) which looks amazing but needs alignment shifts as well.<br/>\nI am curious about what you guys think (feel free to be brutal), cheers!<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:05 AM - Aug 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I agree one wishes for more AB on dragon shape builds.<br/>\n<br/>\nIt is an interesting idea to utilise the bard / curse 16 song for effective +7 AB and AC, and taunt for a further effective +6 AB (-6 AC to enemies), a total of 11 AB added. One can sing and use curse song and taunt while polymorphed hooray! Divine Might does not add AB sadly. Dodge AC from Bard Song and Divine Shield will be subject to the 20 AC cap, will be useful for non dragon shape forms. There is also bardic spell casting including improved invisibility. Blackguard provides stackable bulls strength.<br/>\n<br/>\nI have always found dispels and Mords a bane for my dragon shape. With barkskin (+5) and owls insight (up to +6 wis AC) removed thats 10-11 AC gone, plus less str means up to -6 AB. With CL 20 it will be ok in some environments but will struggle in a dispel heavy environment or against enemies with high spell resistance such as drow or monks although nature's balance will help when you get it. <br/>\n<br/>\nBoth Bard 16 and Dragon Shape are pretty late at level 36-38 which are power spikes for both classes. <br/>\n<br/>\nI think you should try to near max discipline here. In dragon shape you will be essentially knockdown immune and dire bear shape very highly knockdown resistant due to str and size factors.<br/>\n<br/>\nIn a dispel heavy environment I would try to fit scribe scroll or craft wand. I would also consider whether a Druid / Blackguard / Monk combo might be enough to achieve what you need through taunt for up to +6 effective AB, while keeping divine might/shield, and adding monk Wis AC, UBAB and undispellable or mord resistant buffs. Perhaps druid 32 blackguard 5 monk 3? Some alignment shifting would sadly be needed though and I think you are not keen on this, or perhaps it will not work in the environment you plan to take this in. I note Tiamat's Claw was written by Kail, who played a lot of WoG, perhaps the Druid/Blackguard/Monk combo will work if you take it there.<br/>\n<br/>\nAlso Bless and Aid potions are always handy to have, +2 AB makes a difference, and one can drink them when polymorphed, thankfully.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "10:10 AM - Aug 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What, Divine Might does not add to AB? I am an idiot.<br/>\n<br/>\nScratch everything, I will start over.<br/>\nThanks Orion for the nice reply!<br/>\n<br/>\nUpdates will follow!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:11 AM - Aug 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Kail, who played a lot of WoG, perhaps the Druid/Blackguard/Monk combo will work if you take it there.</div></blockquote>\n\nSince this would require an alignment change, it is against the written rules of WoG.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:36 AM - Aug 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">True Webby<br/>\nJust postulating<br/>\n<br/>\nThis is what I had in mind regarding a taunting monk dragon druid, it would be quite the boss if it is possible to play... in the end it is up to the DMs how they want to enforce it all :)<br/>\n<br/>\nPretty please DM let me play an evil monk dragon ?<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">The Malevolent Taunting Dragon</span></strong><br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202008/10759084_603586923c6256c94a76bc5dbd60d4ea.jpg\" />\n</dl>\n</span><br/>\n<span style=\"font-size:50%;line-height:normal\">Source: <a class=\"postlink\" href=\"https://wallpapertag.com/wallpaper/middle/f/f/8/546085-black-dragon-wallpaper-1920x1080-for-pc.jpg\" rel=\"noreferrer\" target=\"_blank\">https://wallpapertag.com/wallpaper/midd ... for-pc.jpg</a></span><br/>\n<br/>\n<details><summary>Spoiler</summary>Druid(29), Monk(6), Blackguard(5), Human\nLN-&gt;LE-&gt;LN-&gt;LE\nSTR: 13\nCON: 8\nINT: 10\n\n01: Druid(1): Scribe Scroll, Blind Fight\n03: Druid(3): Extend Spell\n05: Druid(5)\n07: Druid(7)\n09: Druid(8): Spell Focus: Conjuration\n11: Druid(10)\n13: Druid(11)\n15: Monk(3): Power Attack\n17: Blackguard(2): {Smite Good}\n19: Blackguard(4)\n21: Druid(13): Great Wisdom I, (WIS=23), *Alignment Change*\n23: Druid(15)\n25: Druid(17)\n27: Druid(19): Great Wisdom III, (WIS=26)\n29: Druid(21)\n31: Druid(23)\n33: Druid(25): Dragon Shape\n35: Druid(26)\n37: Monk(6): {Knockdown, Improved Knockdown}\n39: Druid(29): Great Charisma II, (CHA=19)\n\nSkillpoints: 205\nSaving Throw bonuses: Spells: +3, Mind Effects: +2, Fear: +2\nAB (max, naked): 27 (melee), 36 (ranged)\nSpell Casting: Druid(9)\n</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:46 AM - Aug 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, if the alignment restrictions are off...I want my Barb/Monk/DD <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:15 PM - Aug 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">True true<br/>\nI am curious about two things<br/>\n1. Monk and Blackguard<br/>\n2. Druid and Blackguard<br/>\n3. Monk and Druid<br/>\nare all alignment allowed combos<br/>\n<br/>\nPlus Kail wrote a Druid / Monk / Blackguard, lasted edited 2016. <br/>\nCoincidence? hmm... maybe. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "1:32 PM - Aug 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I made a post asking about this in the WoG group. The wordings in the tapatalk rules section, in the server entrance area, and on the github page differ slightly, but it seems clear (also in DM Wise's interpretation) that the intended meaning is as Webshaman says, ie any alignment change in order to get levels in a class is forbidden. I don't know if this is scripted or just left to the players to comply, in my version of Raine's WoG offline module it is possible to take a monk level on a (lawful) barbarian though. <br/>\n<br/>\nAnyway I will fix the mistake about Divine Might and leave this build as is. It is a lot less powerful than I thought, and I think that investing 4 feats and a lot of CHA in blackguard+dm+ds is probably not worth it here.<br/>\n<br/>\nI am still intrigued about how to make the most out of a bard 16/dragon shape build. <br/>\nSince monk is out (alignment) we probably need a full BAB class. I think one could try to build more of a melee druid that does not rely on shifting to fight (as no monk AC means very low AC when shifted), with either fighter or CoT levels. Or barbarian for uncanny dodge?!?<br/>\nThen when dragon shape is attained you obviously will be happy to use that as well:)<br/>\n What do you think?<br/>\n<br/>\nSent from my SM-G920F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}