{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "280",
  "name": "Sword of Tyr (Celestial Smiter) Pal26 CoT10 FTR4",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/sword-of-tyr-celestial-smiter-pal26-cot10-ftr4-t2294174.html",
  "author": "TyrTemplar",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "13.9K",
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "10:08 PM - Oct 23, 2012",
      "content": "<div><strong>SWORD of TYR (Natural AB 40, GS X) <br/>\nBy Deborah “Tyr” Templar</strong><br/>\n<br/>\nThis build was originally published in the ECB II on December 12, 2007, adapted for the MoTB from a series of characters originally designed for the NWN2 (“Angel-Demon Wars, NWN2”), being adapted from a series initially designed for the ECB1 (“Templar Series, NWN1”), 2006. This character serves as an opponent in the “Battle of the Builds” (NWN2 Testing and Training Module by Frank Perez) and has been revised for the ECB1 on account of the 1.69 Patch. What follows is the build:<br/>\n<br/>\n<strong>The Sword of Tyr</strong>. <br/>\nA Holy Warrior/Classic Paladin with ALL NATURAL AB 40 (Melee), +7 Smite: 47 (60, +12 Smite Evil: 72 Self-Buffed). 400+ HPs. Great Smite X. A melee warrior/Knight proper, with GS X.  <br/>\n<br/>\nPaladin (26). Champion of Torm (10), Fighter (4), Race: Human / Alignment: LG<br/>\n<br/>\n<strong>I Attributes:</strong><br/>\nSTR: 17 (22)<br/>\nDEX: 9<br/>\nCON: 8<br/>\nWIS: 14<br/>\nINT: 8<br/>\nCHA: 16 (25)<br/>\n<br/>\n<strong>II. Level Guide:</strong> <br/>\n01: Fighter(1): toughness, power attack, weapon focus<br/>\n02: Paladin(1)<br/>\n03: Paladin(2): knockdown, {Smite Evil}<br/>\n04: Paladin(3): CHA+1, (CHA=17)<br/>\n05: Paladin(4)<br/>\n06: Paladin(5): divine shield<br/>\n07: Paladin(6)<br/>\n08: Paladin(7): CHA+1, (CHA=18)<br/>\n09: Paladin(8): divine might<br/>\n10: Paladin(9)<br/>\n11: Paladin(10)<br/>\n12: Paladin(11): CHA+1, blind fight, (CHA=19)<br/>\n13: Paladin(12)<br/>\n14: Paladin(13)<br/>\n15: Paladin(14): extra smiting<br/>\n16: Paladin(15): CHA+1, (CHA=20)<br/>\n17: Paladin(16)<br/>\n18: Paladin(17): improved critical<br/>\n19: Paladin(18)<br/>\n20: Paladin(19): CHA+1, (CHA=21)<br/>\n21: Fighter(2): Great Charisma I, epic weapon focus, (CHA=22)<br/>\n22: Fighter(3)<br/>\n23: Fighter(4): epic prowess<br/>\n24: Paladin(20): CHA+1, Great Charisma II, (CHA=24)<br/>\n25: Paladin(21)<br/>\n26: Paladin(22)<br/>\n27: Champion of Torm(1): Great Charisma III, (CHA=25)<br/>\n28: Champion of Torm(2): STR+1, great smite I, (STR=18)<br/>\n29: Champion of Torm(3)<br/>\n30: Champion of Torm(4): Great Strength I, great smite II, (STR=19)<br/>\n31: Champion of Torm(5)<br/>\n32: Paladin(23): STR+1, great smite III, (STR=20)<br/>\n33: Champion of Torm(6): great smite IV, great smite V<br/>\n34: Champion of Torm(7)<br/>\n35: Champion of Torm(8): great smite VI<br/>\n36: Champion of Torm(9): STR+1, great smite VII, (STR=21)<br/>\n37: Paladin(24)<br/>\n38: Paladin(25)<br/>\n39: Champion of Torm(10): great smite VIII, great smite IX<br/>\n40: Paladin(26): STR+1, great smite X, (STR=22)<br/>\n<br/>\nAdjustments—Options:<br/>\n<br/>\n<strong>PvM/PvE</strong>:<br/>\n*More Natural Melee AB?  No problem. Drop 2 Grt.Smite in exchange for 2 Grt.Str (+1 AB/Damage), assuming you can “live” with GS VIII [Natural Melee AB 41, +7 Smite (61, +12 Smite Self-Buffed).<br/>\n<br/>\n*More Skills? Sure! STR: 17 (22), DEX: 8, CON: 8, WIS: 13, INT: 10, CHA: 16 (25). Netting 43 more skills in exchange for the loss of 4th Level Paladin Spells (NB: 1.69 capped Holy Sword;  but also means giving up Freedom, Death Ward, though (an option in turn PvM/E; not recommended PvP). <br/>\n<br/>\nAlternative (if can “live” with GS IX): STR: 16 (22), DEX: 8, CON: 8, WIS: 14, INT: 12, CHA: 16 (25), drop 1 Grt.Smite and pick up a GRT.STR so as to finish back up on STR 22; in turn, 86 skills to full train Spot 42(44+2 Prayer) and Concentration 43(42) OR Taunt 43(50, +5 Aura/Courage: 55, +6 AB (effective)), with 2 left over (tossed into Heal) as follows: Discipline 43(49), Heal 2(4), Spot 42(44), Taunt 43(50), Tumble 21(20). Play-Tip: for the “Boss” Taunt and Smite (Or, better yet: KD, Taunt then Smite). <br/>\n<br/>\n*Skills –AND- Natural (Melee) AB you say? Here you Go: STR: 17 (24), DEX: 8, CON: 8, WIS: 13 (14), INT: 10, CHA: 16 (25). Dropping 2 GRT. Smites in exchange for Grt.Strenth as above, and picking up a Grt.Wisdom Lwl. 28 (CoT bonus feat, assuming you still want the 4th level spells in light of the patch as noted). <br/>\n<br/>\n<strong>*IMPORTANT Note—PvP (Good v. Evil): </strong>DO NOT BOTHER with Taunt. If up against an evil Assassin/ED, taunt will get you killed (it’s what they are banking on when/if they come to you: with hard, natural AB (melee 60, +12 Smite Evil: 72 Self-Buffed) let them come, if they dare). If sneaker has ED, they will avoid the first attack of the round, but that’s OK. You’ve 2 more…wait for it (“attack evaded”) and “Bam”. Assassin Dispatched. (Only takes the one, …  <br/>\n-------<br/>\n<br/>\n<strong>III Basics:</strong><br/>\n<br/>\na. Hitpoints: 400 (409)<br/>\n<br/>\nb. Saving Throws (buffed): <br/>\nFort: 34 (48)<br/>\nWill: 30 (44)<br/>\nReflex: 27 (41)<br/>\n<br/>\nPaladin Immunities, spells (fear, disease, mind-spells, death magic, paralysis, slow, entanglement, Etc.)<br/>\n(+1 Resistance, +1 Prayer, +5 Aura/Eagles', +2 Protection v Alignment, +5 Divine Wrath). <br/>\n<br/>\n<strong>IV. Combat Vitals:</strong><br/>\n<br/>\na., Attack Bonus:<br/>\nMundane Weapon: BAB: 30, AB 40 (melee), +7 Smite: 47 (Bio-Cap: 66, +13 Smite: 79)<br/>\nSelf-Buffed AB: 60 (melee), +12 Smite (Aura/Eagle’s): 72<br/>\n<br/>\n[+2 Bull’s Str, +5 Divine Favor, +1 Prayer, +1 Bless, +1 Aid, +5 Divine Wrath, +5 GMW (or Holy Sword)]<br/>\n<br/>\nb. Damage—Comparative:<br/>\n<br/>\n*Mundane Scimitar: 1-6+6 (crit: 15-20/x2) <br/>\nSelf-Buffed: 1-6+14, +1d6 v Evil, +5 Magic, +17 Divine (crit: 15-20/x2) (12-20/x2 Keen)<br/>\nPer Smite: +396 Smite (+792 on a crit).<br/>\n<br/>\n*Mundane Greatsword: 2-12+9 (crit: 17-20/x2)<br/>\nSelf-Buffed: 2-12+18, +1d6 Evil, +5 Magic, + 17 Divine (crit: 17-20/x2) (15-20/x2 Keen)<br/>\nPer Smite: +396 Smite (+792 on a crit)<br/>\n<br/>\n3 Smites Per Day or Rest: One does the trick … <br/>\n<br/>\n[+2-3 Bull’s, +5 Div.Favor (Magic), +1 Prayer, +5 and 1d6 Evil Holy Sword (+5 GMW), +5 Div.Wrath, +12 Div.Might (Aura/Eagle’s)]<br/>\n<br/>\n<strong>V. Defense Vitals:</strong><br/>\nAC 13, +8 Plate, +3 Tower Shield: 24, +1 Prayer, +2 Protectv Alignment, +12 Div.Shield (Aura/Eagle’s): 39<br/>\n<br/>\n<strong>VI. Spell Casting:</strong> Paladin(4)<br/>\n<br/>\n<strong>Vii. Skillpoints</strong>: 86<br/>\nDiscipline 43(49) (+Bull’s, Prayer), Heal 1(3), Tumble 21(20, +Prayer). <br/>\n<br/>\nSmite ON! ~ Tyr</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:14 AM - Dec 19, 2012",
      "content": "<div>I can't figure out what 4 fighter levels add to this build without WS/EWS.  Please explain.</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "12:18 PM - Dec 19, 2012",
      "content": "<div>Happy to explain it and so very glad that you asked! <br/>\n<br/>\nAllow me to explain the level/combo: 26 Paladin for the non-dispel factor (need a minimum 24 to be bullet proof against all dispel attempts barring Mord's, 2 more for bonus feat, etc.). CoT 10 for Sacred Defense, Feats and (true) synergies with the Paladin, being a natural prestige progression for the class (CoT levels stack with Paladin for smite damage, an actually useful DW, and feats as well). Fighter 4 for more feats (3 feats for only 4 levels), which in turn allows the Sword of Tyr to achieve in addition to GS X, etc. a proper au natural melee presence as well (now buff for oh so much more). Namely, 400 HPs, Naked AB 40 (Note: with DF, just that one buff alone and solely, that's AB 45. Now bring on the rest, as there's lots more!). Not at all buff, smite or gear reliant either (and mord's, smord's). This--i.e. Naked AB 40, 400 HPs- being the minimum standards for a melee build, which includes paladin, being a melee class after all. (Simply put: not everything is evil, not up against the big boss all day either, and there is also when it comes to PvP always the issue of Mord's). Neither buff nor smite dependent in turn, yet with the good Paladin book along with self-healing, etc. not so darn gear dependent either (paladins are self-sufficient warriors, nice feature of the class; same time, enjoy the very same entitlements as others do when it comes to gear, whatever they get, you get, too). <br/>\n<br/>\n<strong>In brief:</strong><br/>\nPaladins do not enjoy the same amount of bonus feats as gets the fighter class. Both are warriors proper (warrior BAB, etc), and there are synergies between the 2 as such. Seasoned PnP players will recognize the Paladin as in essence being a Fighter that traded in boni feats for a really nice spell book, self-healing, turn undead, etc. and of course the ability to attain the uber power of GS X, should one be bold enough to go for it, with all the rights, privileges and LG honour that that GS entails, alignment restriction being a part of it in PnP as well (notice I said \"seasoned\" and not \"old\" ... much better term!    ). <br/>\n<br/>\nBy bringing in some fighter, Sword of Tyr readily gets some of those feats right back, and without in any way detracting from the power of smite but, rather, making it even more powerful in turn (to put it another way, absolutely no reason to \"trade\" one's melee warrior presence for the power of GS X vs evil alone, no need to choose, when as the Sword of Tyr clearly shows you can (and should!) have both, enjoying it all in turn!), but without which dip in fighter it wouldn't be possible (i.e., bringing the \"melee\" back into a melee build by bringing back in some feats as said). <br/>\n<br/>\n<strong>Discussion:</strong><br/>\nAs set out above, thanks to the fighter (feats), Sword of Tyr maintains a naked melee presence proper while achieving GS X as well, all Pal goodies such as DM, DS in tact [running off all that great charisma of course, including what is a useful Div.Wrath (when have GS X as here, heh, one smite alone typically does the trick, such that DW is still up and running long after your foe is dead), with the good Paladin book of course for oh so much more, which buffs speak not just to smite of course but melee as well)]. Feats being what the fighter brings, making it all possible (yes, it is!). 1 pre-ep to get ALL important melee feats along with those of the Paladin's as well, such as for e.g. BF AND KD both, which isn't an either/or proposition on a melee build, need both. (Note: KD is self-explanatory. Amazes me how some players still think they can get away without BF, though, which they can't. Paladin is a warrior, great spell book, etc. yes, but that book doesn't include true seeing such that BF is important to Paladin as it is all others without true seeing, and warriors especially. Basically, allows one to fight well even if blinded or against invisible creatures, taking away the bonus they'd otherwise get to hit, and it also (and severely) curtails what otherwise would be the effectiveness of impr.invis/SC-5 as well. In other words: don't wanna leave home without it. Just don't). <br/>\n<br/>\nThen, in epics, 3 more fighter for EWF/EP as fighter bonus feats, freeing up Paladin and CoT to get all that great smiting in order, which comes on rather fast and furious in and throughout epics (all 10 of them in fact--'tis a beautiful thing!), yet also enjoying a proper melee presence. Paladins are not after all \"Holy Smiters\" but, rather, HOLY WARRIORs in turn meeting the minimum melee standards, with non-dispellable buffs, etc. for oh so much more, <br/>\n<br/>\nCombo makes for a strong/PG Holy Warrior/Classic Paladin, smiting evil back to whatever level of Hell it came from, but at the same time able to toe-to-toe melee combat as against non-evil, etc. as well, as all proper melee warriors/Knights should -- and that with fighter 4, by bringing those feats right back in to the paladin qua warrior is how it's done! (I do say ever so humbly  ).<br/>\n<br/>\n<strong>Fighter WS/EWS--Alternative:</strong><br/>\nSure, if can \"live\" with \"only\" GS VIII then by all means feel free to adjust so as to pick up WS/EWS on fighter 4 (taking WS on fighter 4 instead of EP, bumping that to CoT 4 and grabbing EWS on CoT 2; only Fighter can take WS, but once it's open both Fighter and CoT both are entitled to EWS et voila: +6 more damage v every alignment on the NWN planet, which is yet another option, and a good alternative when it comes to PvM/E actually (cuz not everything is evil, as said). Meantime, when it comes to PvP (and/or environs where you'll get a +5 magic sword), feel free to drop the 4th level Paladin spells and pick up on alternate skills path instead; alas, that Holy Sword has been capped by the patch; and still have GMW in any event. Yes, I agree: HS' divine damage boni v. evil is nice, but hardly is damage v evil an issue (you have GS X!!). With a Fort 48 (self-buffed ONLY, no gear, etc) not exactly worried about \"death magic\" either, and why I mention it (PvP especially, where you'll enjoy detection more than a capped Holy Sword).<br/>\n<br/>\nAppreciate the question, and really does speak to of our <strong>Yardstick Project</strong>, doesn't it?! (Thanks, Hip; and was getting to it, you know.    ).<br/>\n<br/>\nSmite -and- Slash ON! ~ Tyr</div>"
    }
  ]
}