{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "727",
  "name": "an attempt. (bard 3, fighter 4, rogue 3)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/an-attempt-bard-3-fighter-4-rogue-3-t2355301.html",
  "author": "doomwizard",
  "avatar": "no_avatar.png",
  "replies": "1",
  "views": "132",
  "posts": [
    {
      "author": "doomwizard",
      "avatar": "no_avatar.png",
      "timestamp": "2:32 PM - Jan 17, 2020",
      "content": "<div>Hello. I've been lurking here for quite some time, and have learned a lot from all your great ideas about building characters and would love your help. I play on a really low level, low magic server called efu. Here is the wiki which has the rules: <a class=\"postlink\" href=\"https://wiki.efupw.com/index.php?title=Main_Page\" rel=\"noreferrer\" target=\"_blank\">https://wiki.efupw.com/index.php?title=Main_Page</a> . Basically a rapier with +1 piercing damage, and 1d4 massive critical is a very fine weapon to find, and there exists some +1ac armor of different types, and things like cloaks if they are really nice might offer +1 will, or something. Potions are very important, with strength, divine favor, bless, aid, and other similar low level spells being pretty common whereas something like a keen edge, or stoneskin scroll or item would be fairly rare and valuable. There are a lot of other small changes that may or may not be incidental, like barbarians getting 10% dmg reduction at level 5,<br/>\n<br/>\nso my idea here is to try and make a dex based, high ac (mage armor here increases worn armor to 4 and no higher), high ab melee fighter that is playable at all levels since it is very hard to get to level 10. And also must be good at pvp and pvm. He has weapon specialization from fighter, and from bard he gets level 3 song for +2 damage, as well as curse song. Taunt, tumble, spellcraft, and discipline. from rogue you get 2d6 sneak attack which could be forced with the help of a wand of tasha's hideous laughter, or hold person, web etc... as well as uncanny dodge, (fighter/barbarian can't multiclass or I would have done that, for hp/ab)<br/>\n<br/>\nI guess to sum up the basic idea of this build is to take non easily replicable forms of damage/ab buffs and try and figure out how to make a dex build frontliner.<br/>\n<br/>\nhuman, level 10<br/>\nhp 76<br/>\nbab 8<br/>\nfeats: blindfight, dodge, weapon focus rapier, weapon specialization rapier, curse song, weapon finesse, extra music, improved critical rapier.<br/>\nstr 10<br/>\ndex 18 (20)<br/>\ncon 10<br/>\nint 10<br/>\nwis 10<br/>\ncha 14<br/>\nwhen fighting would generally have grace, strength, and ethereal visage on from potions.<br/>\n<br/>\nthanks for reading! I would really appreciate your help and ideas.<br/>\n </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:42 PM - Jan 17, 2020",
      "content": "<div>Hello and welcome doomwizard!<br/>\n<br/>\nI've had a quick look through the link to EFU, and your concept seems a fine one. I haven't done an analysis of what class to take when yet, but your feat selection seems good, though I'd be tempted to take Knockdown over Dodge. Others may disagree with me on this, but I'd be looking to use the bard's song and curse and largely forgetting about the spells, so I'd think about dropping charisma down and pumping more into intelligence for lots of juicy skill points.<br/>\n<br/>\nI'll go sharpen a pencil and see what occurs - though others are likely to come up with better in the meantime.<br/>\n<br/>\nGood to have you on board!</div>",
      "author-color": "#AA0000"
    }
  ]
}