{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "906",
  "name": "Tanker needed!",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/tanker-needed-t2354980.html",
  "author": "stalkcasper",
  "avatar": "10759025_1547024419.jpg",
  "replies": "6",
  "views": "195",
  "posts": [
    {
      "author": "stalkcasper",
      "avatar": "10759025_1547024419.jpg",
      "timestamp": "10:03 AM - Jan 09, 2019",
      "content": "<div>Hey all! I am looking for the best tank that could be made. Human/Evil/level 40. I currently use the Bard RDD Fighter build however, I am sure there is better. Perhaps with better AB? Not sure. I play in a server that is based on warzones. So, I love tanking always have. Just making sure if I can do better than the build I already have? Toss me whatever builds you can please! :D I am seeking a strong tank to survive in war PvP! Thank you all!</div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "5:04 PM - Jan 09, 2019",
      "content": "<div>Hi there! What's your current build? What are the current PvP build trends on the server? The more you tell us about the environment the better the good people here can help you.</div>"
    },
    {
      "author": "stalkcasper",
      "avatar": "10759025_1547024419.jpg",
      "timestamp": "9:45 PM - Jan 09, 2019",
      "content": "<div>Ah, gotcha! It is called Isles of Styss! :D The enviroment is pretty open PvP with 0 to no restrictions. My build is the heavy armor/longsword/shield build of 2bard/28 fight/10 RDD. I saw someone saying if you want a decent tank that has good offense and defense. Ranger RDD Bard? I have no clue how to build that, however. Thank you!</div>"
    },
    {
      "author": "stalkcasper",
      "avatar": "10759025_1547024419.jpg",
      "timestamp": "9:56 PM - Jan 09, 2019",
      "content": "<div>I can reach 75 Ac and 69 AB with 896 HP. What kills me are crits and mages.</div>"
    },
    {
      "author": "Thorsson",
      "avatar": "10758835_1513245773.jpg",
      "timestamp": "10:17 PM - Jan 10, 2019",
      "content": "<div>Mages, there's not much you can do about.<br/>\n<br/>\nSo the question is what can you do about high damage critters? I presume you are looking at Str-based WMs here - do you have any idea of their AB (and AC)? If the AB was the same as yours the first attack has a 75% hit chance, then it would be 50%, 25% and the rest at 5%, although they would get another 75% attack with Haste. Depending on the weapon they will crit a fair bit with those numbers. Any AC you can get is going to help, but you really want a fair bit more. 5 more AC would reduce the crits by about half. BTW does that AC include Bard Song (or the effects of Curse Song, reducing their AB).</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "11:56 PM - Jan 10, 2019",
      "content": "<div>Google Exalted Sorceress. That's historically the best PvP build that's out there.<br/>\nIf not, I recommend F12/DD26/Rogue2 or something like that. With reservations that I really suck at PvP, but that's what I've heard.</div>"
    },
    {
      "author": "MindlessMan",
      "avatar": "10759034_1548028287.jpg",
      "timestamp": "10:49 AM - Jan 21, 2019",
      "content": "<div>26 cleric 9 monk 5 sd is prob. one of if not the best pvp build around you can find the build in the lvl 40 section its called the shadow priest by Max </div>"
    }
  ]
}