{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "159",
  "name": "Class Level Sweet Spots",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/class-level-sweet-spots-t2355190.html",
  "author": "MentalDekay",
  "avatar": "10759116_1563898639.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "MentalDekay",
      "avatar": "10759116_1563898639.jpg",
      "timestamp": "5:46 PM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Is there a single place where someone has listed the level sweet spots for all the classes?<br/>\n<br/>\nFor instance fighter 4 because you get WS, bard 16 for song bonuses, sorc/wiz/cleric/druid 24 for undespellable (if that's the right term or even the right level).<br/>\n<br/>\nRelated topics would be ability stats; strength 23/25 for OC/DC, dex 25 for ED; tumble mod 5 for the AC bonus; simple to read feat trees (like Civilizations maps out techs).<br/>\n<br/>\nThere's plenty of tools and info (the nwnwiki, the CBC spreadsheet, here, etc) but the varied presentations make it take a lot of effort to glean things.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:36 PM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The simple answer is \"no\", and I'm not sure there actually should be. Yes, there are stock answers (such as you mention above), but the danger with them is you stop thinking of new or different ways of using a class and start restricting your possibilities. I think the Game Guides section covers all you need to know about many classes and what different levels taken mean in practice, and other guides are being worked on (I know i'm on my 7th draft of a CoT guide currently - they're hard!). Equally, there's a guide for Skills and Where to Stop, which can be useful.<br/>\n<br/>\nOthers may like the idea of a Sweet-Spot Table, but I'm ambivalent veering on the against.<br/>\n<br/>\nThe debate starts here!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MentalDekay",
      "avatar": "10759116_1563898639.jpg",
      "timestamp": "7:46 PM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Your objection is reasonable and understandable. I'd argue that a conscientious user of such a tool would be able to avoid those pitfalls.<br/>\n<br/>\nOn a feat tree, maybe some (relatively) simple Javascript, VBA or Excel tool could take a feat input and list all of its reqs. \"Spring Attack\" -&gt; \"Mobility\", \"Dodge\", \"Dex 15\", ... <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:09 PM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I agree with Stag that a sweet spot table I don't see it as useful. I find building a very creative process, it isn't fixed and hard, its actually quite fluid and its what makes building interesting to me. Almost like painting perhaps? Or composing music?<br/>\n<br/>\nEven the examples given are not hard and fast. One may want to have more levels of fighter for more BAB / bonus feats for example, particularly epic bonus feats. Or maybe a caster gets a bonus feat at level 26? Or you want your caster to be Mord's resistant? Or penetrate high level enemy spell resistance?<br/>\n<br/>\nTo give another example, I wrote a guide to using <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/using-monk-as-a-minor-class-an-in-depth-guide-t2355099.html\" rel=\"noreferrer\" target=\"_blank\">Monk as a minor class</a>. I concluded there was no optimal level of amount of monk as a 'minor class'. One could use 1, 3, 6, 9, 12, 15, 16, 18 or 20 levels and get quite reasonable benefits. It ended up being quite a long discussion regarding what I initially thought was a small topic.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nI think philosophically your question stems to the process of building which is a very interesting question. <br/>\n<br/>\nWhen I try to create a build, I start with the goals of the build, decide on the classes. Ie I want to make a high BAB Cleric / Fighter -&gt; with the highest BAB possible? or undispellable buffs? or a zen archer with the highest wisdom score possible and ultra high spell penetration/mords resistance? Do I want that build to have Dev Crit? Or Divine Might? Or be a dex based build? What about Tumble and UMD? How much HP does the build need? 300? 400? 500?<br/>\n<br/>\nFollowing this I decide on the BAB (ie do I want ending BAB 26+), and caster levels (ie do I want Cleric 17 for level 9 spells? or Cleric 24+ for undispellability? or Cleric 35+ for Mord's resistance)<br/>\n<br/>\nThen I do the class split. Start with Pre-epic split to create the BAB. Ie if I want an ending BAB 26, then Cleric 16 / Fighter 4. BAB 28, Cleric 8 / Fighter 12. Etc.<br/>\n<br/>\nThen the epic split just depends on the caster levels / bonus feats obtained. It gets a little murky here and I start looking up the NWN Wiki as to when a class gets bonus feats at how many levels etc. Cleric 24 sounds cool, but Cleric 26 gets a bonus feat for example and grants two additional caster levels. etc etc. At this stage sometimes I decide on a third class and insert it here! Then I think about stats, feats, HP etc etc... then the classes might be adjusted again etc etc... Skill points I do at the end. Sometimes I adjust the stats again if I want more or less. Adjust the race too. The optimising process is very fluid messy and creative. <br/>\n<br/>\nHope that kind of helps with the discussion<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:22 PM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh on the feat input and requirements, Kamiryn incorporated them into his CBC Excel spreadsheet. <br/>\n<br/>\nI'm away from home right now and am doing building on Google Sheets using his spreadsheet and the feat restrictions don't quite work so I have to check things carefully. <br/>\n<br/>\n but when you load it in MS Excel if you take a feat too early (ie Resist Energy without base Fortitude 8  the preceding level, not including Luck of Heroes/Great Fortitude or CoT bonuses but including fort bonuses from constitution scores -&gt; who the hell remembers that wait I just did! -&gt;, or try to take Blackguard without any hide skill or cleave or the required BAB) it will come up in red and tell you you have buggered up<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}