{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "327",
  "name": "Pale Master Challenge",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pale-master-challenge-t2352410.html",
  "author": "KidMiracleman",
  "avatar": "no_avatar.png",
  "replies": 15,
  "posts": [
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "4:05 AM - Apr 04, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">On my server I play on one needs 20 levels of Sorcerer before they can take one level of Pale Master.  Who can make a build of<br/>\nSorcerer Pale Master and Dwarven Defender with that is mind??<br/>\n<br/>\nDavid<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:00 AM - Apr 04, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Dwarf has a cha penalty which is bad for sorcerers. Charisma does nothing for a DD and DD does nothing important for a sorcerer.<br/>\nDD needs BAB +7 to qualify. That means 14 levels of sorcerer before you can take DD. Max BAB will then be 23 with max 3 attacks. On top of that you will not be able to focus heavily on strength to build AB if the caster part of the build is to be taken seriously.<br/>\nIt is possible to build such a character, but it will be weak, both as a caster and warrior.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:42 PM - Apr 04, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It is as Mick said unfortunately, some times we think of cool concepts but  for one or the other reason they cannot possibly made into workable builds, especially when we have such huge lvl restrictions. The good thing though is that in this game with it's thousands of possible combinations and feats, there is always some way to get what we want, maybe with another method, but definitely can be done   <br/>\n<br/>\nFor example you thought about a Sorcerer/ PM/ DD with the hope you could make a really tough caster, am i right? A sorcerer 26/ PAL 4/ COT 10 or the equivalent would make a much stronger combination, with Epic Warding, Divine Shield &amp; Might, plus Unreal saves and still retain a good spellcasting power, being undispellable and all. Or you could try perhaps a Sorcerer 26/ BG 4/ PM 10 if you want a superb defense. The thing here is that BG is way more powerful than a DD in this build.<br/>\n<br/>\nI will give you some examples or really strong Spellswords, and you can tell me if you like them.<br/>\n<br/>\nSPELLSWORD OF BAHAMUT =&gt; <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/spellsword-of-bahamut-sorc-26-paladin-4-rdd-10-t515415.html\" rel=\"noreferrer\" target=\"_blank\">spellsword-of-bahamut-sorc-26-paladin-4-rdd-10-t515415.html</a><br/>\nDRAGONIC ARCANIST =&gt; <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/draconic-arcanist-wizard-26-bard-4-rdd-10-t2344104.html\" rel=\"noreferrer\" target=\"_blank\">draconic-arcanist-wizard-26-bard-4-rdd-10-t2344104.html</a><br/>\nTHE AUGUST SPELL-BLADE =&gt; <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build300792.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 00792.html</a><br/>\nSORCERER KING =&gt; <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build272583.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 72583.html</a><br/>\n<br/>\nAll of them are fully armoured/ Undispellable Casters with a strong melee presence, the last one has PM in it as well.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "11:57 PM - Apr 04, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I forgot to mention the derro subclass gets bonuses to CHA.  I was thinking of the damage reduction so yes<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:28 AM - Apr 05, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Even better then, Mick's Spellsword of Bahamut for example can trade spell penentration &amp; greater spell penentration for Power attack &amp; Divine shield and with the Derro sub-class have an even 22 (34) CHA. Now he is claded already in full plate armour &amp; has Epic Warding too for 1300 Dmg absorption along with Dragonic armour (+4 AC) and RDD immunities. Add the +12 AC from Divine shield plus Shadow shield e.t.c. you see where i am going? A DD defenses pale before those things. And unlike some others Spellswords, Mick gets a clear 40 AB before things like buffs, Divine Power and others get in the mix. And he is an undispellable caster (escept Mords of course, use spell shields for them) btw.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "12:52 AM - Apr 07, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There some bosses who do major critical damage.  I wanted a build that would give me crit immunity and some nice AB that would let me use a warhammer<br/>\nor long sword or some other nice one handed weapon.<br/>\n<br/>\nDavid<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:04 AM - Apr 07, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Check the builds i linked to you, the last one Has Pale master Immunities and Blackguard there too. You can use any one handed weapon you like with it. It is a very nice build IMO.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "3:10 AM - Apr 08, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">How about Sorc 20 / RDD 10 / PM 10???<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:52 PM - Apr 08, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I will answer to your question, but something tells me that you still haven't taken a good look at the builds i linked to you. Cause i linked to you what's best of the best already, builds that can tear apart a server. Anyway, let's move to your question and let me show you why sometimes just throwing 3 powerful classes together won't work.<br/>\n<br/>\n1) Charisma is your best stat in this build, it is luckily to be well over 42 buffed at lvl forty. Yet, there is no class from these three to take real advantage of it. Neither Paladin nor Blackguard to transfer this massive Charisma as a bonus to your saves or make it Divine damage or Armour Class via DM/DS.<br/>\n<br/>\n2) The weird restriction of 20 Sorcerer lvls before a single lvl of Pale Master along with the RDD, make for a build that almost never mature but to the last possible lvls. It is like a carrot dangling in front of a rabbit that is trying to catch it but never quite succeed in doing so. If you attempt to build such a character all the good things will come amongst 35-40 lvls. Before that you will be a sad imitation of a caster with an undead dragonic heritage.<br/>\n<br/>\n3) In this class split there is absolutely no epic bonus feats whatsoever. Moreover, the luck of epic Sorcerer lvls means that you cannot qualify for epic spells at all, so no epic mage armour or epic warding for you. And these are amongst the best epic feats a Sorcerer can take. Furthermore you will have difficulty even acquiring base feats for your class with so few epic feats available.<br/>\n<br/>\n4) With just 20 Sorcerer lvls you will be dispellable even from greater dispels that every single epic mob will have and throw at you. A couple of them and you are suddenly without all those juicy buffs you just spend 10 minutes casting. And then you will die, horribly so. Furthermore you will have too low a penetration to affect any serious opponent with your spells, so again you will be left with a caster that is forced to resort in melee combat most of the time.<br/>\n<br/>\n5) With no full BAB classes at all and with so many 1/2 BAB classes thowed in you will be left with a very low AB compared to other spellswords. And you will have to spend general feats to take even the most basics, like martial weapon proficiency.<br/>\n<br/>\n<br/>\nThere are more actually but i feel that i illustrated my point about this class mixture,fairly well. The point is, that unless you are looking for an RP character, power-gaiming wise this combo simply won't work for you. You are better off, if you simply choose something from the builds i linked to you before or another possible combo that actually works. Both of your suggestions although they sound like interesting characters are simply non-viable for a competitive environment.<br/>\n<br/>\n<br/>\nI hope i helped you,<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "12:01 AM - Apr 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes you did and I actually did check out the builds in the links.  Only the last one has the 10 PMs levels that I need but in the build it takes a PM level too soon<br/>\nI need 20 sorcerer levels first.  How about 20 Sorcerer 10 PM and 10 Champion of Torm??<br/>\n<br/>\nDavid<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:56 AM - Apr 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Unless something is eluding me, there is simply no need for him to take that Palmaster lvl pre-epic, in fact it is way more beneficial to keep adding Sorcerer lvls instead. You can move that Palemaster lvl in epics along with the rest of them. Perhaps he took that lvl for saving some skill points and not forced to cross-class Hide for the Blackguard requirements. I do know why he took the fourth BG lvl at forty, but i cannot see why he took the first Pale master lvl so early except for the saving of five skill points and the early boost of +2 AC. My suggestion would simply move that PM lvl at Epics along with the rest of them. Sorcerer 26/ BG 4/ PM 10 is a very nice build, although i would change some things if i did it myself, but anyway it will cover you nicely for what you want.<br/>\n<br/>\nYou third suggestion, has an alignment confilct, does your server allow these kind of builds? <br/>\n<br/>\nAlso keep something in mind for future reference. If the build you have in mind does not have any Charisma synergy between it's classes, then you are simply much better to make this with a Wizard instead of a Sorcerer. Wizard will give you way more skills, five more feats and loose nothing. Sorcerers are only used when we want a Charisma synergy between the classes. Instead of Sorcerer 20/ Pm 10/ XX 10 you should go with Wizard 26/ PM 10/ XX 4, that is much, much better. For example Wizard 26/ Fighter 4/ PM 10 would make a nice build perhaps for what you want, which is a Caster that has PM immunities &amp; AC and can carry with some efficiency a longsword. Another possibility that also get Epic spells, is Wizard 20/ Fighter 4/ PM 16 for +4 AC more, but he will be dispellable.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "2:05 AM - Apr 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">We can change alignment on the server I play on.<br/>\n<br/>\nDavid<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:03 AM - Apr 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Does it have to be Sorcerer? Using Bard instead would help a lot.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "8:22 PM - Apr 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It would help but it can only be 20 levels of sorcerer or wizard.<br/>\n<br/>\nDavid<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:31 PM - Apr 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Kharindale eh?<br/>\n<br/>\nDavid, what would you like for us to do, build a more optimized version like Wizard 26/ PM 10/ Fighter 4 OR you are set in your proposed build of Sorcerer 20/ PM 10/ CoT 10? And could we replace Sorcerer with the better Wizard OR you are set on using that Dwarf sub-class that gives +2 CHA as you have said before? I reccommend not to play something like those, but if you have set your mind on them (like with your Pally / WM) then i will build you one such, Concept above all<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "10:28 PM - Apr 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am not really set on anything.  It just needs to have 20 levels of wizard or sorcerer first before one level of pale master can be taken.  <br/>\nI would prefer the dwarf sub class just because of the good spell resistance it gives but it could be any race and any other class.  I <br/>\nam open for anything at this point.  Not even sure what a difference a shield would make.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}