{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "309",
  "name": "A really odd Rogue",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/a-really-odd-rogue-t2350688.html",
  "author": "madmocha",
  "avatar": "no_avatar.png",
  "replies": 9,
  "posts": [
    {
      "author": "madmocha",
      "avatar": "no_avatar.png",
      "timestamp": "5:37 PM - Mar 02, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">OK, starting with a human, strength build... <strong>Rogue</strong> heavy, with a very muddling, middle of the road attribute spread except for increased CHA for roleplay purposes.  Oh, and Dex for more-or-less the same reason.  I was thinking something along the line of:<br/>\n<br/>\nStr.15<br/>\nDex.14<br/>\nCon.12      I think this spread is correct.<br/>\nWis.08<br/>\nInt.14<br/>\nCha.14<br/>\n<br/>\nAnyway, I figured that since I had that much Cha, I could maybe cross-pollinate with Bard for some added buffs.  The main build I was looking at, though, was Rogue/Ftr.<br/>\n<br/>\nI've looked at a number of Rog/Ftr builds, and many seem to start with one Rog, then five or so levels of Ftr.  I'd like to get more Rogue in at the beginning for an early boost to needed skills.  Say...<br/>\n<br/>\n1. Rogue<br/>\n2. Fighter<br/>\n3. Rogue<br/>\n4. ?<br/>\n5. ?<br/>\n<br/>\nI know, it's all an odd mix.  I was going strength, just... well, I'm not a big Dex build fan.         Don't like little weapons, and pussy-footing around.  On the other hand, environment says I'm going to be stealthing quite a lot, so the need of a heavy skill set.<br/>\n<br/>\nI was eyeing the GDL's \"The Last Great Bounty Hunter\", along with \"Zhentarim Field Agent\" and Avado's \"Tyr's Devastating Thud\" as templates, though quite changed.  Still, I'm not sure that it's possible to take that weak-knee'd mess I layed out above, and make something useful.  What think ye.  Does that attribute spread allow for any promise?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:47 PM - Mar 02, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Madmocha, first i need to make you some questions if you dont mind.<br/>\n<br/>\nFor what environment that build is for?<br/>\n<br/>\nIf it is for a persistant world is totally different thing than help you make a build for a module such as ADWR. or The OC/SOU/HoTU.<br/>\n<br/>\nAnd yes up until high magic worlds/modules STR-based in almost everything is the way to go, it is way better.<br/>\n<br/>\nYou starting spread while far from optimal it is okay and will not have a huge impact to the abilities of your character in the long run.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "madmocha",
      "avatar": "no_avatar.png",
      "timestamp": "7:20 AM - Mar 03, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Uh... yeah, you guessed right.  ADWR.  Avoided before since I didn't really like dexing.  Heard it was a good mod though and decided to try it with a strength character.  The character qualifiers though, make it unusual.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:12 PM - Mar 03, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Okay, i need you then to answer me to one more question before we can proceed to the build, since this is a character that you are gonna play for 50+ hours and the most important factor<br/>\n<br/>\nis to make sure you are gonna enjoy it. <br/>\n<br/>\nFirst of all ADWR is a module that ends (both parts) at about lvl 20, so we better optimize the build for that level and not for forty, that would be un-wise   <br/>\n<br/>\n<br/>\nOne thing I need to know, is what are you aiming for, namely-do you want a character with dual weapons, a single 2-handed sword, a rapier wielding shadowdancer?<br/>\n<br/>\nWe could even take advantage of that \" forced \" charisma with four lvls of Blackguard or Paladin (depending how you want to RP it).<br/>\n<br/>\nThere are many-many possibilities even with those restrictions in place, and this precisely is what makess this game awesome even after all those years.<br/>\n<br/>\n<br/>\nBut, since we are half-way already i thought i would make you a beta-build to see if you would like it and if i am moving to the right direction.<br/>\n<br/>\nThis build is meant to be able to hide &amp; move silently even in full plate if need be and it can deliver sneak attacks with IKD very consistently.<br/>\n<br/>\nThis is a generic, heavy-in rogue build with many feats &amp; skills to custom for your needs. I am sure that it can advance in the module with ease, but as i said<br/>\n<br/>\nfun-factor counts most!<br/>\n<br/>\nAnyway tell me what do you think of this at a first glance..<br/>\n<br/>\n<br/>\n<strong>Revenge of the Princess</strong><br/>\n<br/>\n<strong>(Fighter 4/ CoT 4/ Rogue 12)</strong><br/>\n<br/>\n RACE: Human (Female)<br/>\n<br/>\n ALIGNMENT: Any Non-Evil<br/>\n<br/>\n PLAYABILITY: PvM 1-20<br/>\n<br/>\n<strong> STARTING STATS</strong>:<br/>\n STR  - 15<br/>\n DEX - 14<br/>\n CON - 12<br/>\n INT   - 14<br/>\n WIS  - 08<br/>\n CHA - 14<br/>\n<br/>\n<strong> ENDING STATS</strong>:<br/>\n STR  -  20<br/>\n DEX  - 14<br/>\n CON  - 12<br/>\n INT    - 14<br/>\n WIS   - 08<br/>\n CHA  - 14<br/>\n<br/>\n Hit Points: 192<br/>\n<br/>\n Skill Points: 205<br/>\n<br/>\n Discipline: 22 (27)<br/>\n Disable Traps: 21 (25)<br/>\n Hide: 23 (30)<br/>\n Move Silently: 23 (30)<br/>\n Open Locks: 13 (15)<br/>\n Pick Pockets: 2 (4)<br/>\n Listen: 21 (20)<br/>\n Search: 10 (12)<br/>\n Set Traps: 11 (15)<br/>\n Tumble: 20 (22)<br/>\n Spellcraft: 8 (10)<br/>\n UMD: 23 (25)<br/>\n<br/>\n Saving Throws (Fort/Ref/Will): 15/ 17/ 7 → 17/ 19/ 9  (saves Vs spells) &amp; (evasion)<br/>\n<br/>\n Naked AC: 16/ 26/ 31  (full plate &amp; tower shield) →  (Expertise)<br/>\n<br/>\n BAB: 17<br/>\n<br/>\n AB:  +23/ +18/ +13/ +8  (Bastard Sword)<br/>\n<br/>\n DMG: 1D10 +7 / 17-20 x2  (Bastard Sword) → (add 6D6 Sneak attack &amp; Crippling strike)<br/>\n<br/>\n Spellcasting: UMD full ranks<br/>\n<br/>\n<strong>LEVELING GUIDE</strong>:<br/>\n<br/>\n01) Rogue (01): Expertise, Stealthy<br/>\n02) Fighter (01): WP Exotic<br/>\n03) Fighter (02): WF Bastard Sword, KD<br/>\n04) Rogue (02): Evasion<br/>\n05) Rogue (03): Uncanny Dodge<br/>\n06) Fighter (03): Blind Fight<br/>\n07) Fighter (04): WS Bastard Sword<br/>\n08) Rogue (04): <br/>\n09) Rogue (05): IKD<br/>\n10) CoT (01): <br/>\n11) CoT (02): IC Bastard Sword<br/>\n12) Rogue (06): SF Hide<br/>\n13) Rogue (07): <br/>\n14) Rogue (08): <br/>\n15) Rogue (09): SF Move Silently<br/>\n16) Rogue (10): Crippling Strike<br/>\n17) Rogue (11): <br/>\n18) CoT (03): Toughness<br/>\n19) CoT (04): Power Attack *<br/>\n20) Rogue (12): <br/>\n<br/>\n<strong>SPECIAL NOTES</strong>: <br/>\n<br/>\n* OR Improved Expertise<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "madmocha",
      "avatar": "no_avatar.png",
      "timestamp": "8:10 PM - Mar 03, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Okay... answers.<br/>\n<br/>\n1. I like big swords.     Bastard sword is probably (roll-playing wise) more in-line with a female character (young princess and all), but... I hate wasting feats (exotic weaponry) when fighter allows gaining great sword which there would probably be more of anyway.  Unless there's better reason to go the other way.<br/>\n<br/>\n2. This is just a personal thing, but I don't really get into evil characters... at least not just for evil's sake.  Revenge or what-not, if there's good reason for it, I can deal with that.  From what I've read of the mod, It's a princess who loses family and is taken in by underworld entities.  Hard for me to picture a protected young lady of the court flip-flopping into some evil whore (...), so I would intend to play her as good, bold, strong (and probably skip out on some of the edgier aspects of the mod.<br/>\n<br/>\n3. I didn't know if adding Paladin or Bard would end up just weakening (physically) the character...<br/>\n<br/>\n   Wow!  I just got down to skimming over your build after writing the above.  That really looks nice.  Didn't realize you had already stuck in bastard sword... Would you recommend that over great sword?  I'm open to what-ever.<br/>\n<br/>\n   Also, I'd read somewhere that you tend to loose your equipment at times through the mod.  That's what made me wonder about a buffing class as a secondary aspect of the build.  If you are operating at times with mundane equipment, would buffing be helpful, especially to a character who does not have high Dex?  Or will that not really be an issue?  I Really like the look of what you've done, though.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:24 PM - Mar 03, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Greatsword you said?<br/>\n<br/>\nLovely! Better saves then and bigger damage output at the cost of potentially +7 AC (large shield +5).<br/>\n<br/>\nHere is the GreatSword version, choose whatever pleases you the most!<br/>\n<br/>\n<br/>\n<strong>Revenge of the Princess II</strong><br/>\n<br/>\n<strong>(Fighter 4/ CoT 4/ Rogue 12)</strong><br/>\n<br/>\n RACE: Human (Female)<br/>\n<br/>\n ALIGNMENT: Any Non-Evil<br/>\n<br/>\n PLAYABILITY: PvM 1-20<br/>\n<br/>\n<strong>STARTING STATS</strong>:<br/>\n STR  - 15<br/>\n DEX - 14<br/>\n CON - 12<br/>\n INT   - 14<br/>\n WIS  - 08<br/>\n CHA - 14<br/>\n<br/>\n<strong>ENDING STATS</strong>:<br/>\n STR  -  20<br/>\n DEX  - 14<br/>\n CON  - 12<br/>\n INT    - 14<br/>\n WIS   - 08<br/>\n CHA  - 14<br/>\n<br/>\n Hit Points: 192<br/>\n<br/>\n Skill Points: 205<br/>\n<br/>\n Discipline: 22 (27)<br/>\n Disable Traps: 21 (25)<br/>\n Hide: 23 (30)<br/>\n Move Silently: 23 (30)<br/>\n Open Locks: 13 (15)<br/>\n Pick Pockets: 2 (4)<br/>\n Listen: 21 (20)<br/>\n Search: 10 (12)<br/>\n Set Traps: 11 (15)<br/>\n Tumble: 20 (22)<br/>\n Spellcraft: 8 (10)<br/>\n UMD: 23 (25)<br/>\n<br/>\n Saving Throws (Fort/Ref/Will): 16/ 18/ 8 → 18/ 20/ 10  (saves Vs spells) &amp; (evasion)<br/>\n<br/>\n Naked AC: 16/ 23/ 28  (full plate) →  (Expertise)<br/>\n<br/>\n BAB: 17<br/>\n<br/>\n AB:  +23/ +18/ +13/ +8  (Greatsword)<br/>\n<br/>\n DMG: 2D6 +9 / 17-20 x2  (Greatsword) → (add 6D6 Sneak attack &amp; Crippling strike)<br/>\n<br/>\n Spellcasting: UMD full ranks<br/>\n<br/>\n<strong>LEVELING GUIDE</strong>:<br/>\n<br/>\n01) Rogue (01): Luck of Heroes, Stealthy<br/>\n02) Fighter (01): WF Greatsword<br/>\n03) Fighter (02): Expertise, KD<br/>\n04) Rogue (02): Evasion<br/>\n05) Rogue (03): Uncanny Dodge<br/>\n06) Fighter (03): Blind Fight<br/>\n07) Fighter (04): WS Greatsword<br/>\n08) Rogue (04): <br/>\n09) Rogue (05): IKD<br/>\n10) CoT (01): <br/>\n11) CoT (02): IC Greatsword<br/>\n12) Rogue (06): SF Hide<br/>\n13) Rogue (07): <br/>\n14) Rogue (08): <br/>\n15) Rogue (09): SF Move Silently<br/>\n16) Rogue (10): Crippling Strike<br/>\n17) Rogue (11): <br/>\n18) CoT (03): Toughness<br/>\n19) CoT (04): Power Attack *<br/>\n20) Rogue (12): <br/>\n<br/>\n<strong>SPECIAL NOTES</strong>: <br/>\n<br/>\n* OR Improved Expertise<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:38 PM - Mar 03, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I see you are not keen on playing evil builds, although my suggestion were made in the perspective of revenge for what she has endured (thus Blackguard suited the build) and that's fine, cause Paladin is better!<br/>\n<br/>\nFor example in this build four levels of Paladin would give you Fear &amp; Disease Immunity and +2 to all your saves at the cost of two feats (which we can afford to loose in the GreatSword version).<br/>\n<br/>\nAnd Paladin opens up the possible selection of two very powerful Divine feats. Namely Divine Might &amp; Divine Shield.<br/>\n<br/>\n<br/>\nBut after all said and done i do think that a build that doesn't forces you to be LG is better suited in a Rogue heavy module like this. You can play a good Princess without being Lawful and you are more open to any <br/>\n<br/>\nmoral choices that the module might throw at you. Still, if you want a Divine version, just ask and you shall receive   <br/>\n<br/>\nHappy gaming!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "madmocha",
      "avatar": "no_avatar.png",
      "timestamp": "3:59 AM - Mar 04, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks much for all your help, Valerfor, it is highly appreciated.  Just wish I could figure out how you all manage to retain all of this stuff.  I've been around NwN for a long time and still feel like a primary school student.  Uhhg...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:42 AM - Mar 05, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>madmocha wrote:</strong>Thanks much for all your help, Valerfor, it is highly appreciated.  Just wish I could figure out how you all manage to retain all of this stuff.  I've been around NwN for a long time and still feel like a primary school student.  Uhhg...</div></blockquote>\n\nWell, there was a time, a while ago, where the forums were more active. Everyday we had like 5 new posts back at the old Bioware forums. That means we had a lot more builds to discuss, and more people to discuss them with. When you posted a build, people would go crazy on critiquing it. We had many more guides available as well, which are good to kickstart your learning. But, it does require you to want it. If you just sit back and let us build everything for you, you won't grow in knowledge as fast as if you read our guides and start experimenting builds on your own and then let us critique them and explain our reasoning for suggesting each tweak.<br/>\n<br/>\nPlaying online helps a lot too, because in general it's WAY MORE challenging and requires overall better builds and a higher level of play for you to be able to overcome the challenges of PWs like WoG. I know A LOT OF PEOPLE who play on WoG for years and haven't managed to get A SINGLE TOON to level 40. I have SOLOED 5 toons to 40. How? I make powerful builds, I play well, I have a lot of tricks in my bag and I know what are the toons' weaknesses and strengths, so that gives me a more accurate assessment of different situations and how to overcome them. I have even soloed a Wizard 29 / PM 10 / Assassin 1 without Tumble for 37 levels and he is now level 38. I think it's a difference in dedication, in will to learn from me to these other players (and also probably playstyle, since I am a powergamer by nature). Generally, the players that fail have a profile closer to yours: they are too attached to the \"character\" part of the character, and care little about game mechanics. There was a guy who played a \"Sir XXXXXXX\" paladin who didn't take KD because it was an \"unfair advantage\". It's fine, I guess, but in a real fight, paladins KILL things, they cut off heads, they slay evil wherever it hides. They use brute force ALL THE TIME, so saying they wouldn't KD someone is just plain stupid. Also, I just have trouble roleplaying with pre-set dialogue options. I think of a character in a more complex ways, and classes and game mechanics kind of represent facets of his personality. That allows me to powerbuild the crap out of my toons without losing the flavor of actually having a character and not just a little puppet to command.<br/>\n<br/>\nAnyway, if you feel like a beginner, we can help you out. You could start by reading the guides in the Game Guides section. It's A LOT OF INFO to take in, but it's also a good place to start. If you have any questions, I'll be happy to answer. The knowledge about the game that you will accumulate will depend on how \"seriously\" you take the game from now on. The tools are all here. Will you take it upon yourself to learn the ropes?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Hatter",
      "avatar": "no_avatar.png",
      "timestamp": "1:19 PM - May 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've just returned to playing NWN after several years, and was thinking to start ADWR again. Last time I was played Rogue/Fighter very DEX focused. Now I'd like to play a character with some more melee capabilities, so this build is exactly what I was looking for. Thank you very much, guys!<br/>\n<br/>\n However, as I remember there are some RP possibilities in this module, so I was wondering how to modify this build (greatsword version) to squeeze in some Persuade?<br/>\n<br/>\n Edit: I think i'll just rearrange skill points distribuition. I'll drop Spellcraft, and I am thinking about droping Listen (I don't think invisible opponent are a particular problem in this module)<br/>\n<br/>\n Thanks and good gaming!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}