{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "250",
  "name": "Ruminating",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ruminating-t2350672.html",
  "author": "madmocha",
  "avatar": "no_avatar.png",
  "replies": 4,
  "posts": [
    {
      "author": "madmocha",
      "avatar": "no_avatar.png",
      "timestamp": "9:57 AM - Mar 02, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">So... went to register and found I already was.  Didn't remember that.  <br/>\n<br/>\nIt's been quite a long time since picking up the old nicked and tarnished blade.  But she's still a beaut.  Seeing her glint in the fire light, hanging there above the mantle; I just had to pull her down again.  The memories...  I can still hear the raucous laughter, the clinks of mugs, the stale smells of sweat, and smoke... The Dwarf lord, eyes twinkling, leaning over his pint.  Haven't seen some of that crowd in many a day.  Kind'a tugs at your soul.  <br/>\n<br/>\nENOUGH!  No place to be lookin' sour into the ale.  Here's to memories and those remembered; friends, old and new.<br/>\n<br/>\nNow, where was I?  Oh... I really did have a question.  It's really noobish, only because, well, I've never actually used Knock Down.  The feat.  From brief glances at the descript, it appears it only works if you are fighting someone larger or smaller???  Somehow that doesn't sound right, but I just never got around to pursuing the question.  I know many swear by it.  If you are, say playing a human in a largely human environment, is it effective still?<br/>\n<br/>\nI also have a question about a build, but I can post that over on the build request forum.<br/>\n<br/>\nThanks.<br/>\n<br/>\nBTW.  Good to see some of the old names still around.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:06 PM - Mar 02, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good to see you back, madmocha.<br/>\n<br/>\nNice intro too!<br/>\n<br/>\n<br/>\nNow about the Knockdown (KD for short). Yes, it is absolutely essential to every melee that can afford it and the improved version of it is even better.<br/>\n<br/>\nHow it works: You press the KD icon on your taskbar (or F* key) and then select the target, right in the next attack sequence your warrior will try to execute the feat as best as he can.<br/>\n<br/>\nIf you succeed, then your opponent will be on his butt for the next part of the round. Now, while he is prone he gets easier to hit by 4 points and he can not respond to your attacks at all.<br/>\n<br/>\n<br/>\nThe KD feat as you have read only works within a size category from yourself. Meaning you can KD a smaller opponent and even a large one if you are medium size but you can not KD a huge<br/>\n<br/>\ncreature at all, because it is two size categories bigger than you (Huge --&gt; Large --&gt; Medium). To accomplish this you will need to take IKD (improved knockdown feat - that requires an INT of 13).<br/>\n<br/>\nAnother important thing about KD is that it is AB based - meaning it is not a STR-based feat like the equivalent \" trip \" on the PnP version of DnD, so even Rogues or DEX-based characters will find it <br/>\n<br/>\nvery useful as long as they have a sufficient AB to win an opposed check from their opponents. The check is (Your AB Vs Opponents Discipline + 4 + Size modifier). <br/>\n<br/>\n<br/>\nTo give you an example. Say your human rogue/shadowdancer/fighter attempts to KD an opposing guard while he is escaping the city's palace with a precious diamond in his hands. <br/>\n<br/>\nYour base AB is say 40 and you attempt a knockdown on your opponent. He has 43 ranks in Discipline modified further by his strength for a total of 50. Now, you take a -4 penalty on your check<br/>\n<br/>\nwhich is the equivalent of a +4 on your opponents roll. So he has a grand total of 54 + whatever he rolls. He rolls the Dice and get a 7 for a total roll of 61.<br/>\n<br/>\nYou on the other hand have a nice +5 rapier and a belt of Agility +6 that modify your total AB to 51. You roll a 14 on the D20 for a total roll of 65. With a nice twist of your blade you sent your <br/>\n<br/>\nopponent to rest on the ground for the next part of the round! (total rolls of 65 Vs 61) = success!<br/>\n<br/>\nNow here is the deal, not only he cannot respond to your next few attacks and he gets a -4 penalty to his armour class but also you can pass your sneak attacks on him! Because a prone opponent is <br/>\n<br/>\nvulnerable to sneak attacks as well.<br/>\n<br/>\n<br/>\nTo sum it up. <br/>\n<br/>\nYour knockdown check is the sum of your {base AB + weapon echantments + ability enchantments + other modifiers that affect your attack bonus + size difference Vs your opponent}.<br/>\n<br/>\nYour opponents anti-knockdown check is the sum of his {Discipline ranks + his strength modifier + 4 + size difference Vs you} - (normally zero for equal size opponents).<br/>\n<br/>\nYou can not KD an enemy more than one category larger than you. If you are medium you cannot KD a Huge opponent and even for Large ones you take a further -4 penalty on your checks.<br/>\n<br/>\nWhile an opponent is prone you can pass through him your sneak attacks.<br/>\n<br/>\nWhile an opponent is prone he can not respond to your attacks &amp; he takes a -4 penalty to his armour class.<br/>\n<br/>\nThe Improved Knockdown feat lets you KD even Huge opponents (like Dragons - but not if you are a Halfling) &amp; gives you a further +4 to your check, effectively canceling the penalty you had at first.<br/>\n<br/>\nThe improved knockdown feat requires an INT of 13 or higher to take and it has as a requisite the normal knockdown feat.<br/>\n<br/>\n<br/>\nOkay, sorry if i went a bit overboard with the explanation of the feat, but that shows it's importance i think  <br/>\n<br/>\nIn most of the cases you will be fine with the normal KD feat. And yes in a human-based environment it works really well.<br/>\n<br/>\nSometimes an opponent will have a flat out immunity to KD but that's alright, this is the case with every immunity out there.<br/>\n<br/>\n<br/>\nSo, yeah pick it up and use it a lot!<br/>\n<br/>\nAnd if you have further questions we will be glad to answer you.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "madmocha",
      "avatar": "no_avatar.png",
      "timestamp": "5:23 PM - Mar 02, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Valerfor,<br/>\nWow.  That was better then anticipated.  Thanks.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:35 PM - Mar 02, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Before you even get to do the Knockdown check, you must first hit your opponent with your attack, which has a -4 AB penalty. Then, that same roll is used for the Discipline check.<br/>\n<br/>\nYou get an additional -4 penalty against larger opponents, but a +4 bonus against smaller opponents. So, if you're medium sized, you get a -4 penalty against large opponents, +4 against small opponents, and +8 against tiny opponents, added to the -4 you always get from knockdown.<br/>\n<br/>\nImproved Knockdown lets you knock down opponents as if you were 1 size larger. This means that you can knock down huge opponents, but it also affects the penalty or bonus for the size of the opponent.<br/>\n<br/>\nAnd yes, you can knock down opponents the same size as you.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Knockdown\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Knockdown</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "madmocha",
      "avatar": "no_avatar.png",
      "timestamp": "7:35 AM - Mar 03, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Empyre.  Yeah, I've read that paragraph you linked to many times, it was always the line, \n<blockquote><div><strong>wikea wrote:</strong>A character can only make a knockdown attempt on opponents that are one size category larger than himself, or smaller.</div></blockquote>\nthat confused me.  Made it sound like you could only do larger or smaller, not the same size.  But I get it now.  <br/>\nSo I assume if you swing and miss you have to keep trying till you connect before the knockdown checks take place.  Okay, got it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}