{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "302",
  "name": "Discipline for high-ish AC builds ?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/discipline-for-high-ish-ac-builds-t515396.html",
  "author": "MrZork",
  "avatar": "no_avatar.png",
  "replies": 2,
  "posts": [
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "11:29 AM - Aug 06, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I'm sure this topic is old hat to more experienced builders, but I thought I had a basic handle on when it's worth putting points into discipline and now I'm not so sure.<br/>\n<br/>\nJust for some context, I am working on a mostly wizard Wiz/Ftr/Rog build who takes Autostill III and both Expertise feats. (Not a max AC build, by any means, but high relative to available skill ranks in this case.) Once I have the basics laid out and I start polishing, I go to the build search engine to see what smarter builders have done. (BTW, that is half the fun of building for me: figuring out how and why others have done things differently so that I can pick up some pointers. ^_^) Not surprisingly, there are several similar builds and the most similar (same level spread, close on feats) is <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build231822.html\" rel=\"noreferrer\" target=\"_blank\">grizzled_dwarflord's War Wizard</a>. I notice that it has maxed discipline. <br/>\n<br/>\nSo, the question is: How much value is there in maxed discipline for a non-strength build where the character's practical AC is going to be significantly higher than his easily achievable discipline? <br/>\n<br/>\nThe basics of it look like this to me: My character's base AC in mundane plate + tower is 31. Add +20 (Epic Mage Armor) + 1 (Mage Armor) + 1 (DEX buff) + 10 (Improved Expertise) to get 63 with basic, long-lasting buffs (and 61 of that is non-dispellable). And, in combat, the character is likely to consider an extended Haste to be a pretty high priority, which brings things to 67 before adding in any magic shield AC bonus or fancy boots. Now, I can work things to get 44 ranks of discipline and maybe bump that to 46 or so with strength buffs (40 and 42 are more realistic here). So, someone attempting knockdown (or disarm or called shot, though who is bothering with those against a mage?) has to hit before my discipline comes into play. So, he's rolled a 67 or better, which becomes the DC for my skill check. Basically, to resist the KD, I need to somehow make 45 + discipline tricks + d20 add to at least 67. Even with ESF: Discipline, I am relying on luck to resist the attack, and my normal inclination is to find something else to do with that epic feat.<br/>\n<br/>\nNow, the exceptions to the above scenario may be numerous. For one thing, lower-level mobs might be spamming KDs to for natural twenties and, in that case, their modified attack roll might be low enough to beat on the opposed roll. Similarly, any high-tumble build loses dodge AC bonuses when flat-footed (and DEX bonus without Uncanny Dodge), so there's another case where maxing discipline, even if it's still significantly lower than nominal AC, might be helpful. Ditto for taunt (although that's not as likely to work against a caster build). And, as usual, if HotU-style +30 discipline magic items are available, then that may change things, though I usually have other plans for those inventory slots...<br/>\n<br/>\nMy feeling at this point is that most of the time, discipline won't do much good in this sort of build and maybe it would not generally do much good in non-strength builds, particularly where ESF: Discipline is a hard feat to squeeze in. What are people's opinions on this? Have I missed some significant considerations that favor discipline in such cases? (I am interested in PvM and PvP considerations.)<br/>\n<br/>\nBTW, please let me know the errors in my thinking. Up until now, I have essentially been kind of haphazardly buying discipline when I played a melee (especially strength) build or when I happened to have lots of skill points on hand (or relying on the availability of knockdown immunity or AC buffs when worrying about strong opponents). One way or the other, I haven't really though much about what benefit discipline was providing.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:21 PM - Aug 06, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">For a wizard or sorc, even a battle type, I find Discipline completely worthless, especially with very high caster-level splits.  Once I get my 3 damage shields in place can wade into a pack of meleers and begin spamming IGMS or whatever I have slotted (or using Tenser's/Shapechange to melee).  Even if KD'd, all flankers will eventually kill themselves on the shields.  But I approach it differently, choosing Epic Warding/DR spells and high CON, low AC w/no Expertise... so that even the amount soaked is still \"reflected\" back to the attackers.  You just can't heal while prone so that is the reason for the high CON (to last until the 4 rounds end). With as high a caster level as Griz has in his build the extended shields would last forever unless there are mantle strippers in the mob and in that case, Discipline still means little since you will be attacked by spells.  If you decide to \"compete\" against the spammers, perhaps Emp Bull's Strength would help, but that still seems the hard way around the issue to me.<br/>\n<br/>\nMy high-level fighting bards have always maxed Discipline and with the singing and cursing at that level, it seems to avoid KD/Disarm pretty reliably.<br/>\n<br/>\nAs far as general usage, I believe you laid it out correctly for a non-reciprocal PC, DEX-base or otherwise: max discipline for melee builds. If there are loads of KD and Disarm spammers in the environment (and who really knows until you play there a bit?), then the skill focus feats are pretty much a prerequisite so would probably need more fighter levels in the build to warrant your feat selection.  Naturally, no matter which way you try to balance the defense, those 20's will hit so there is no magic skill level to guarantee check wins, it's just a matter of what will happen once you are prone that matters most.  <br/>\n<br/>\nTBH, I don't really prepare a build to defend against bosses with ridiculous AB, AC &amp; many special abilities/attacks because it would skew the build too much.  If one maintains the max Discipline throughout the character development your PC should be able to consistently avoid most of the debilitating attacks from the creatures with gradually increasing stats.<br/>\n<br/>\nAs to PvP, can't help you much there, sry .  We occasionally engage in some duels just for giggles but find the whole concept too boring to build for it.  However, with PvP areas on roleplay servers, it may become a consideration, though there would always be a trade-off between fighting with player-controlled vs. AI.  Not sure how I would build for such a scenario.  Probably just play elsewhere where I don't need to manage Pkers, I guess (or build a high-CON reciprocal-damage bloke *lol*).<br/>\n<br/>\nI really believe it is worth testing the specific environment to answer this question best.  If you are forced to deprive your character of more useful skills because of the 43 you plan to spend on Discipline, try ignoring it and see how it performs.  <br/>\n<br/>\nIMO the same kind of issue issue comes up about Concentration with a pure melee build.  Can you afford all the taunts and still remain effective?  It's the same sort of dynamic that you are bringing to the fore here.<br/>\n<br/>\nI hope some of my ramblings were useful to you, MrZork.  I appreciate how well you laid out your concerns and will strive to do the same for my own technical questions.  Now let us hope the vacationers will check in to contribute their thoughts, eh? <br/>\n<br/>\nCheers, amigo!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "12:50 AM - Aug 07, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for that advice and discussion. I am thinking to make discipline a low priority for this \"armored mage\" build. I totally agree that it's tough to make a generalist build (which this is supposed to be) immune to every specialty attack. But KD is kind of a standard attack strategy against wizards, so it's a concern.<br/>\n<br/>\n[Interestingly, if this were more for a reciprocal damage build (gods help us against green dragons!), I might be tempted to keep discipline maxed in order to avoid getting KD swarmed by mobs in such a way that I couldn't reliably heal or cast Greater Sanctuary (or some other \"bail out\" spell). After all, KD spammers with lower AB will hit on 20s, but they won't knock me down unless I fail the opposed check, whose DC might be quite low.]<br/>\n<br/>\nIf I decide discipline isn't so important, that gives significantly more freedom as to when I take the second level of fighter, since there are no worries about trying to use it for a late skill dump. Taking Armor Skin earlier might be nice...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}