{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "137",
  "name": "Arelith Elven Druid",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-elven-druid-t2354573.html",
  "author": "Valerionx",
  "avatar": "10577588_1510287072.jpg",
  "replies": 12,
  "posts": [
    {
      "author": "Valerionx",
      "avatar": "no_avatar.png",
      "timestamp": "7:57 PM - Aug 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hey there guys, I just came back from a long hiatus and decided to do something ....new? I wanted to make an Elven druid. <img class=\"post-image\" loading=\"lazy\" src=\"https://s-media-cache-ak0.pinimg.com/736x/ce/e6/d3/cee6d3468240ac89dc66a4e03303f189.jpg\" /><br/>\n<br/>\n<br/>\n Now Arelith has a lv 30 cap. But, I was thinking about creating a elven druid, a druid whom focuses mostly in casting, but if need be can transform and take a few hits. Now, I know a good synergy might be druid/cleric, druid/monk. But, I want to keep it with as many druid levels as viable. Preferably till the 26th level so as to get infinite elemental shapes (unless this would not help what I'm going for). Monk might be good due to the AC bonus it gets from wisdom, but so late in I can't help but wonder if just a pure druid would be better. (Since one could wear armor without risk of spell failure) Weapon of Choice if any would be a longsword or Rapier.<br/>\n<br/>\n I figured these stats would be a good starting place (feel free to correct me) Mostly PvM, but PvP can be a slice of life (not the focus though)<br/>\n Race: Elf, Alignment: Lawful Neutral.<br/>\n STR: 10<br/>\n Dex: 12<br/>\n Con: 12 <br/>\n Wis: 16 <br/>\n INT: 14 <br/>\n CHA: 12 (For animal empathy, etc)<br/>\n<br/>\n Now some of the skills I want to focus on just a bit would be Animal Empathy, Heal, Concentration, tiny Lore (identifying items isn't that important, so possibly no points), but maybe spellcraft (till 15 points maybe?). (If monk levels taken) Discipline, Hide and move silently.<br/>\n<br/>\n However, you guys are the experts, so I realize none of this may be any bit realistic. But, yeah that's why I came here to get guidance. I wanted it to mainly be a caster though. So... yeah xD Anything I missed please feel free to tell me, and I'll do my best to answer<br/>\n<br/>\n<br/>\n Leave you with this:<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://67.media.tumblr.com/2cd2bb08b0f2dcb751e46d2a7bbfdb90/tumblr_nn3k5vD6CP1rv231do1_1280.jpg\" /><br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:47 PM - Aug 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Can't help with the build, but can give huge applause for the first pic! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:24 AM - Aug 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome back into the soup.  I hope you've had plenty of time to develop some innovations for toon building.  Anyways, let's get right to it with some comments which may help your decision...<br/>\n<br/>\n Designing a Level 30 cap Dragon shape:  Impossible without building a Dru/CoT. So you can cross that off your list if it was ever on.<br/>\n<br/>\n Your strongest polymorph will be the Iron Golem (via Shapechange spell).  However, a Mord can dispel it.  All the druid shapes cannot be dispelled.<br/>\n<br/>\n All of your shapes are unarmed.  One level of monk guarantees that all your shapes will use the monk -3 progression rather than the standard -5 one.  It also means more attacks per round just like the monk has.  <br/>\n<br/>\n Note: there is one major difference between monk attack and creature attack (claws/bites/slams, etc)........  <br/>\n<br/>\n When hasted (or with boost from Divine Power ala cleric), the additional attack for the creature (polymorph) is not at full BAB like it would be for the monk (i.e. it's not a FREE attack). It's just another decreasing BAB attack that follows the same progression. But since you have no way to haste your attacks for more than 5 rounds with a Speed pot anyway in this build, the difference will probably never come into play.  But your polymorphs CAN consume pots during combat, if you choose to.  Unless you can find armor, hat or shield with permahaste.  All those item props will merge for all druid shapes except any AC bonus will be converted to deflection so will not stack.<br/>\n<br/>\n At Monk 1, a Dru26 that can reach WIS 26 and cast Owl's Insight, the AC bonus for all polymorphs is +14 AC and will stack with all other sources of AC.  WIS is never overwritten by a polymorph's merge.<br/>\n<br/>\n Monk 1 provides the Cleave feat for free without investing at least STR 13 and Power Attack to get it.  All forms, native and polymorphs (including the Shapechange versions) will be using Cleave automatically.<br/>\n<br/>\n Monk 1 provides Stunning Fist.  This attack can be used by all druid polymorphs (including the Shapechange versions) and can reach an exalted DC.  For example, since a Dru26 can cap WIS via Owl's Insight buff and assuming the intrinsic final WIS is 26, the DC for Stunning Fist will be 10 + 15 + 14 = 39 vs. Fort on a cap 30 server.  Few opponents will be able to resist the 3-round stun.<br/>\n<br/>\n Monk 1 provides Flurry of Blows.  This attack can be used by all druid polymorphs (including the Shapechange versions) and adds another attack with the same -3 monk progression but at a -2AB penalty to all attacks that round.<br/>\n<br/>\n Monk 1 provides Evasion.  With a reflex save (the save level governed by the shape's DEX stat), many evocation spell damage and reflex trap damage can be resisted.<br/>\n<br/>\n Monk 3 provides a 10% move speed bonus.<br/>\n<br/>\n In other words, I recommend a Lawful neutral Dru26/Mnk4 elf with the first 3 levels of monk at Level 21-23 so as to not gimp your BAB which will determine the attack prowess of all your shapes.  The last monk level should go at Level 27.  <br/>\n<br/>\n My ability split for the elf would be STR 8, DEX 10, CON 10, WIS 18 (26), INT 16, CHA 8 (or move 2 points from CON to STR or CHA.  It doesn't affect the potential either way.)<br/>\n<br/>\n The skills (ranks) that will determine your effectiveness in combat most are Discipline (33), Spellcraft (32/35), Hide (30), Move Silently (30), Listen (30/40), Tumble (30).  Remaining: 49, for your RP bias.  The modified level of the stealth skills and Tumble will be determined by the overwrite of DEX by the polymorph merge as will the modified level of Discipline by the overwrite of STR.<br/>\n<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerionx",
      "avatar": "no_avatar.png",
      "timestamp": "4:07 AM - Aug 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>Welcome back into the soup.  I hope you've had plenty of time to develop some innovations for toon building.  Anyways, let's get right to it with some comments which may help your decision...<br/>\n<br/>\n Designing a Level 30 cap Dragon shape:  Impossible without building a Dru/CoT. So you can cross that off your list if it was ever on.<br/>\n<br/>\n Your strongest polymorph will be the Iron Golem (via Shapechange spell).  However, a Mord can dispel it.  All the druid shapes cannot be dispelled.<br/>\n<br/>\n All of your shapes are unarmed.  One level of monk guarantees that all your shapes will use the monk -3 progression rather than the standard -5 one.  It also means more attacks per round just like the monk has.  <br/>\n<br/>\n Note: there is one major difference between monk attack and creature attack (claws/bites/slams, etc)........  <br/>\n<br/>\n When hasted (or with boost from Divine Power ala cleric), the additional attack for the creature (polymorph) is not at full BAB like it would be for the monk (i.e. it's not a FREE attack). It's just another decreasing BAB attack that follows the same progression. But since you have no way to haste your attacks for more than 5 rounds with a Speed pot anyway in this build, the difference will probably never come into play.  But your polymorphs CAN consume pots during combat, if you choose to.  Unless you can find armor, hat or shield with permahaste.  All those item props will merge for all druid shapes except any AC bonus will be converted to deflection so will not stack.<br/>\n<br/>\n At Monk 1, a Dru26 that can reach WIS 26 and cast Owl's Insight, the AC bonus for all polymorphs is +14 AC and will stack with all other sources of AC.  WIS is never overwritten by a polymorph's merge.<br/>\n<br/>\n Monk 1 provides the Cleave feat for free without investing at least STR 13 and Power Attack to get it.  All forms, native and polymorphs (including the Shapechange versions) will be using Cleave automatically.<br/>\n<br/>\n Monk 1 provides Stunning Fist.  This attack can be used by all druid polymorphs (including the Shapechange versions) and can reach an exalted DC.  For example, since a Dru26 can cap WIS via Owl's Insight buff and assuming the intrinsic final WIS is 26, the DC for Stunning Fist will be 10 + 15 + 14 = 39 vs. Fort on a cap 30 server.  Few opponents will be able to resist the 3-round stun.<br/>\n<br/>\n Monk 1 provides Flurry of Blows.  This attack can be used by all druid polymorphs (including the Shapechange versions) and adds another attack with the same -3 monk progression but at a -2AB penalty to all attacks that round.<br/>\n<br/>\n Monk 1 provides Evasion.  With a reflex save (the save level governed by the shape's DEX stat), many evocation spell damage and reflex trap damage can be resisted.<br/>\n<br/>\n Monk 3 provides a 10% move speed bonus.<br/>\n<br/>\n In other words, I recommend a Lawful neutral Dru26/Mnk4 elf with the first 3 levels of monk at Level 21-23 so as to not gimp your BAB which will determine the attack prowess of all your shapes.  The last monk level should go at Level 27.  <br/>\n<br/>\n My ability split for the elf would be STR 8, DEX 10, CON 10, WIS 18 (26), INT 16, CHA 8 (or move 2 points from CON to STR or CHA.  It doesn't affect the potential either way.)<br/>\n<br/>\n The skills (ranks) that will determine your effectiveness in combat most are Discipline (33), Spellcraft (32/35), Hide (30), Move Silently (30), Listen (30/40), Tumble (30).  Remaining: 49, for your RP bias.  The modified level of the stealth skills and Tumble will be determined by the overwrite of DEX by the polymorph merge as will the modified level of Discipline by the overwrite of STR.<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Thank you kindly for the speedy response! I'm happy to be back. Well Dragon Shape is indeed possible without COT (There's a totem druid in combination +2 Wis with some clever usage can indeed net you with the Dragon Shape at lv 30 (with gift +2 Wis). But, Dragon Shape was never my intention. You know how many druids I see rolling dragon? ...All of them. Literally. All of them. Why? Probably because it was a decent build to begin with, but.. yeah I wanna be different from all those...Dragon sayers. (Even though, it's definitely useful if you know what you're doing)<br/>\n<br/>\n<br/>\n Looking at it, I don't really feel like being a walking hospital (Cleric/Druid), although I know that isn't actually the intent with the cleric.<br/>\n<br/>\n Like my original post my intent isn't to make a full melee Druid (Caster foremost, Melee if possible second.). I imagine Listen could be replaced with Concentration. Yes? I only ask this because of the spell True Seeing. As it would give away Greater Sanctuary, Invisible, and Hidden targets much more reliably than just seeing the via 'red' little splashes of noise on the screen. Something regular listen wouldn't be able to do. If I'm not mistaken even to dispell it, it would require them to come out of hiding in the first place no? (Well outside of the bonus 'whisper' range it grants, but that's not really important.)<br/>\n<br/>\n I might be under the impression that casting or using items removes one from 'Stealth Mode', Invisibility, or Sanctuary. I like where you're going about this, but I also want it to be able to use spells as I originally intended it too. (Which, I don't know if anything but Concentration would really affect it that much). Well except maybe a Spell focus, but I only see Evocation and/or Conjuration worth taking long term.<br/>\n<br/>\n I know listen is technically 'undispellable', but I imagine the skill points allocated to 'listen' would be better served elsewhere. (Even though, one can make succesful listen checks even when blind/deaf) ...Though, if you're deaf the game contradicts itself, but yeah. But, I'd like to hear your thoughts on this so far as to get the most of what I want, and what would still borderline 'possible'.<br/>\n<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:04 AM - Aug 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Valarionx wrote:</strong><hr/>\n \"Preferably till the 26th level so as to get infinite elemental shapes\"<br/>\n<br/>\n<br/>\n  </div></blockquote>\n That infers to me that when you elect to morph, you want to be combat-optimized for that occasion.  Perhaps that was not your intent, though.  Maybe you feel that using polymorphs is just being cute from time to time.  If so, what's the point of striving for Dru26?  Infinite is only an advantage for a druid who intends to spend a lot of time in shifted form.<br/>\n<br/>\n If I were playing this caster druid, I would use stealth (AND invisibility if you have access to pots) to approach quickly using the monk speed (and hasted, if I happened on one of those permahaste items I had mentioned or after drinking a Speed pot), use stunning fist to immobilize my prey, then unmorph and begin unleashing my offensive spell repertoire.  That's the reason for the stealth focus.  As an enemy finding myself face-to-face with an elder water elemental (yes, that would be my personal choice to use for stealth) would cause most players at least a moment's panic, just long enough to stun them (or drown them if you get a lucky roll).<br/>\n<br/>\n Listen skill can spot enemies not within line-of-sight (LOS).  High WIS toons are particularly good at this. You need not fear getting ambushed through a doorway or around a corner which is a tactic often used by rogues, assassins and other stealth specialists.  Drop the skill if you like (it's not my build after all, it's yours), but IMO that is a mistake, especially if PvP is any consideration.  True seeing will not help you detect enemies in situations like this.<br/>\n<br/>\n As my recommended attack strategy has indicated, neither overwhelming damage to break your casting cycle nor a taunt threat will come to bear if your attack is concealed.  It's just too fast.  I see no benefit for a caster who is laying on offensive power from a position of complete autonomy to need concentration at all.  Concentration is mainly needed for casters who cannot use artillery spells to kill like necromancers and are forced to wade into a mob and cast shoulder-to-shoulder.  With a druid's pet and their excellent summons, there is no reason a druid must approach melee range of any foe.  But when the scenery and space has disappeared and melee becomes inevitable...   ....SHIFT!  ...for the love of Sylvanus, SHIFT!<br/>\n<br/>\n One aspect of requesting design input from the regulars here... <br/>\n<br/>\n We build to vanilla v1.69.  If a server or module has bent the rules or offers methods of bypassing the default constraints of class limitations, that is YOUR responsibility to adjust a default build to suit your chosen environment.  Unless you are getting build advice from another player of Arelith (highly unlikely since nobody on the same PvP server wants to show their hand), the recommendations you get here will certainly not contain those sorts of considerations.<br/>\n<br/>\n This toon-building business all comes down to playstyle.. You build and use what is most comfortable for you to use.  As awesome as someone's build design appears on paper, if a player cannot find a way to take advantage without jumping through hoops, it's probably not a good build for that player to try to implement.<br/>\n<br/>\n The typical sequence used with the build I've been mentioning is to venture while concealed in some way, either by stealth or invisible, then when the enemy is spotted (i.e. recon stage completed), displace beyond their perception range, then buff full, resume concealment and then attack.  It's usually wise to pull dangerous mobs apart to lessen the chance of getting pummeled by lucky crits.  But this is just one proven tactic that works reliably.  If you have your own tricks, build to suit them.<br/>\n<br/>\n BTW, any action other than just standing or moving breaks stealth including drinking pots and using heal kits.  Ummm... I think you can disable traps and pick locks and still remain in stealth, but generally, anything you do breaks it.  Invisibility and Sanctuary will only break when taking hostile action.  So you can self-buff unseen under those effects.  But as I indicated before, even if they have True Seeing in effect, you will be able to approach around corners and behind obstructions undetected with a high enough stealth rating.  The key is to venture into unknown areas with at least all your long-term buffs active and be ready to back away when an enemy's position is spotted to complete the balance of your pre-buffs.  Else, you are asking for trouble which could easily have been countered with preparation.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerionx",
      "avatar": "no_avatar.png",
      "timestamp": "4:54 PM - Aug 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n<blockquote><div><strong>Valarionx wrote:</strong><hr/>\n \"Preferably till the 26th level so as to get infinite elemental shapes\"<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n That infers to me that when you elect to morph, you want to be combat-optimized for that occasion.  Perhaps that was not your intent, though.  Maybe you feel that using polymorphs is just being cute from time to time.  If so, what's the point of striving for Dru26?  Infinite is only an advantage for a druid who intends to spend a lot of time in shifted form.<br/>\n<br/>\n If I were playing this caster druid, I would use stealth (AND invisibility if you have access to pots) to approach quickly using the monk speed (and hasted, if I happened on one of those permahaste items I had mentioned or after drinking a Speed pot), use stunning fist to immobilize my prey, then unmorph and begin unleashing my offensive spell repertoire.  That's the reason for the stealth focus.  As an enemy finding myself face-to-face with an elder water elemental (yes, that would be my personal choice to use for stealth) would cause most players at least a moment's panic, just long enough to stun them (or drown them if you get a lucky roll).<br/>\n<br/>\n Listen skill can spot enemies not within line-of-sight (LOS).  High WIS toons are particularly good at this. You need not fear getting ambushed through a doorway or around a corner which is a tactic often used by rogues, assassins and other stealth specialists.  Drop the skill if you like (it's not my build after all, it's yours), but IMO that is a mistake, especially if PvP is any consideration.  True seeing will not help you detect enemies in situations like this.<br/>\n<br/>\n As my recommended attack strategy has indicated, neither overwhelming damage to break your casting cycle nor a taunt threat will come to bear if your attack is concealed.  It's just too fast.  I see no benefit for a caster who is laying on offensive power from a position of complete autonomy to need concentration at all.  Concentration is mainly needed for casters who cannot use artillery spells to kill like necromancers and are forced to wade into a mob and cast shoulder-to-shoulder.  With a druid's pet and their excellent summons, there is no reason a druid must approach melee range of any foe.  But when the scenery and space has disappeared and melee becomes inevitable...   ....SHIFT!  ...for the love of Sylvanus, SHIFT!<br/>\n<br/>\n One aspect of requesting design input from the regulars here... <br/>\n<br/>\n We build to vanilla v1.69.  If a server or module has bent the rules or offers methods of bypassing the default constraints of class limitations, that is YOUR responsibility to adjust a default build to suit your chosen environment.  Unless you are getting build advice from another player of Arelith (highly unlikely since nobody on the same PvP server wants to show their hand), the recommendations you get here will certainly not contain those sorts of considerations.<br/>\n<br/>\n This toon-building business all comes down to playstyle.. You build and use what is most comfortable for you to use.  As awesome as someone's build design appears on paper, if a player cannot find a way to take advantage without jumping through hoops, it's probably not a good build for that player to try to implement.<br/>\n<br/>\n The typical sequence used with the build I've been mentioning is to venture while concealed in some way, either by stealth or invisible, then when the enemy is spotted (i.e. recon stage completed), displace beyond their perception range, then buff full, resume concealment and then attack.  It's usually wise to pull dangerous mobs apart to lessen the chance of getting pummeled by lucky crits.  But this is just one proven tactic that works reliably.  If you have your own tricks, build to suit them.<br/>\n<br/>\n BTW, any action other than just standing or moving breaks stealth including drinking pots and using heal kits.  Ummm... I think you can disable traps and pick locks and still remain in stealth, but generally, anything you do breaks it.  Invisibility and Sanctuary will only break when taking hostile action.  So you can self-buff unseen under those effects.  But as I indicated before, even if they have True Seeing in effect, you will be able to approach around corners and behind obstructions undetected with a high enough stealth rating.  The key is to venture into unknown areas with at least all your long-term buffs active and be ready to back away when an enemy's position is spotted to complete the balance of your pre-buffs.  Else, you are asking for trouble which could easily have been countered with preparation.</div></blockquote>\n<div align=\"left\">Yes, I apologize. That's indeed my fault. I gave one thing whilst striving for another. I shall be more specific, you're only doing your best to help, but you cannot do that if I'm unclear, it leads to more questions than solutions or answers.<br/>\n<br/>\n Despite this, you are on the right track. I want to be able to cast (with potentially not every spell being resisted everytime)  But, if need be I wanted a druid that could as you put it 'SHIFT! ....for the love of Sylvanus, SHIFT!' for melee. But, for my future knowledge, does Concentration have any affect on if somebody decided to shoot an arrow at you? Does that help prevent interruption, or would that fall under your concealed advice for no concentration as well? I'm merely asking for those 'types' that don't need to get in your face shoulder to shoulder. (Archer NPC's, Players, etc) I'm merely taking in all considerations, so I ask for your patience. Best to ask these questions now.<br/>\n<br/>\n Okay, see that's the explanation I was looking for Listen can spot enemies not within LOS. So, one could potentially see them around a corner or through a doorway. I didn't know this little tidbit of information, and if necessary I could always just cast true seeing and still have listen... the best of both worlds. I just assumed it helped see enemies within LOS in stealth mode. As during my times messing with it, I never was shown that indication, but maybe I wasn't just looking close enough. ....That or my driving camera mode prevented this type of usage.<br/>\n<br/>\n<br/>\n Yes, I know , but please do not think merely because I state the dragon is possible, that I intend for you to know such information. If anything, it's information you have now that you didn't before, and you can choose whether or not to consider it for other people. And you are right, You cannot reasonably ask other's of Arelith for advice on building. Not because of them not wanting to show their hand. (Some of them will genuinely help). But, others will give misinformation, just so that the build they have will stand above yours. I.E Concentration is not needed for a Caster. You should take Discipline instead.<br/>\n<br/>\n<br/>\n Yes, I think you can set, and disable traps and pick locks whilst stealthed normally. But, just about anything else might kick you out of it. But, yeah.. .that was my idea of a playstyle, Caster until forced to 'go green' in melee.  ....Never understood how come Druids never got Polymorph Self though. (You know, the spell) Well minus the Zombie. Maybe because they already have lots of shapes, but that might just be me. Anyway, I will let you respond, and I suppose we shall see where our conversation goes. Looking forward to it.<br/>\n<br/>\n<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:37 PM - Aug 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have been told that when setting a trap, that click you hear when the trap has been successfully set will break your stealth mode.<br/>\n<br/>\n I can't be of much help here because I have ever played a Druid in NWN, but I do have one planned:<span style=\"color:#008000\"> </span><strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2353943/GREEN-KNIGHT-OF-EHLONNA-DRUID-28-FTR-4-COT-8#.V6YtEjXDSBo\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#008000\">Valerfor's Green Knight of Ehlonna</span></a></strong>. Maybe a variation of that could work for you. It would need to be adapted for 30 levels and for Arelith's rules and environment.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:41 PM - Aug 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>I have been told that when setting a trap, that click you hear when the trap has been successfully set will break your stealth mode.<br/>\n<br/>\n  </div></blockquote>\n Yup.  Setting traps breaks stealth, invisibility and sanctuary.  The game considers it a hostile action even though there is no target creature or area threatened.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:45 PM - Aug 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ranged attacks cause much less base damage and crit much less.  The chance of interrupting casting is small.<br/>\n Use your DR buffs to make it that much harder for them to cause net damage.  Use Stonehold and SoV against archer packs.   Defensive Casting mode will take damage out of the skill check... if you remember to use it.<br/>\n<br/>\n Discipline is more important.  KD/IKD can immobilize the caster while a failed Concentration check just means another attempt must be made for a wasted spell.  Discipline can also protect from ranged Called Shots.  The penalty is not near as severe as only the caster's movement gets slowed and DEX AC lowered a bit.<br/>\n<br/>\n You've got 49 spare points with INT 16.  Why not throw a handful into Concentration just to placate your concerns?  10 or so should be enough for most ranged attacks.  Even maxing Concentration is no guarantee you won't get interrupted from time to time by lucky crits and encounters with AAs and divine archers.  It's still just a dice roll.   Your AoV and Blood Frenzy will boost the skill a few more points.<br/>\n<br/>\n Tactics?  I would steer away from close-range spells like Harm and Finger if I were you.  You'd be playing right into their hands.  Flame Lash is about the closest I'd come before shifting into a melee form.  If your artillery disabling spells are effective, then you could close in native form and use close-range spells.  Now that I mention those spells... Harm has been nerfed on Arelith, right?  How about Finger? Do they still die with a failed Fort?<br/>\n<br/>\n Just be careful with your animal summons all the way through to the tiger.  They all have terrible Will saves and can be feared or dominated in a second.  Elementals are immune to such threats.  And the same deal goes for your wildshape vs. your elemental shape though to a lesser degree because your shape's Will save is quite high as an animal.<br/>\n<br/>\n Dunno how you players can stand drive mode.  It's always made me nauseous and makes LOS too hard to determine.  But whatever floats your boat.  Mine sinks while trying to drive at ground level.<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerionx",
      "avatar": "no_avatar.png",
      "timestamp": "1:09 AM - Aug 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>Ranged attacks cause much less base damage and crit much less.  The chance of interrupting casting is small.<br/>\n Use your DR buffs to make it that much harder for them to cause net damage.  Use Stonehold and SoV against archer packs.   Defensive Casting mode will take damage out of the skill check... if you remember to use it.<br/>\n<br/>\n Discipline is more important.  KD/IKD can immobilize the caster while a failed Concentration check just means another attempt must be made for a wasted spell.  Discipline can also protect from ranged Called Shots.  The penalty is not near as severe as only the caster's movement gets slowed and DEX AC lowered a bit.<br/>\n<br/>\n You've got 49 spare points with INT 16.  Why not throw a handful into Concentration just to placate your concerns?  10 or so should be enough for most ranged attacks.  Even maxing Concentration is no guarantee you won't get interrupted from time to time by lucky crits and encounters with AAs and divine archers.  It's still just a dice roll.   Your AoV and Blood Frenzy will boost the skill a few more points.<br/>\n<br/>\n Tactics?  I would steer away from close-range spells like Harm and Finger if I were you.  You'd be playing right into their hands.  Flame Lash is about the closest I'd come before shifting into a melee form.  If your artillery disabling spells are effective, then you could close in native form and use close-range spells.  Now that I mention those spells... Harm has been nerfed on Arelith, right?  How about Finger? Do they still die with a failed Fort?<br/>\n<br/>\n Just be careful with your animal summons all the way through to the tiger.  They all have terrible Will saves and can be feared or dominated in a second.  Elementals are immune to such threats.  And the same deal goes for your wildshape vs. your elemental shape though to a lesser degree because your shape's Will save is quite high as an animal.<br/>\n<br/>\n Dunno how you players can stand drive mode.  It's always made me nauseous and makes LOS too hard to determine.  But whatever floats your boat.  Mine sinks while trying to drive at ground level.<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Yes, I understand.<br/>\n<br/>\n Harm does 10 damage per caster level I believe and finger of death is the samee old version. If it's not that big a deal I'd probably only put 10 in it, and then allocate the extra points elsewhere.<br/>\n<br/>\n I shall be careful with the shapes indeed, but as to how I can handle drive mode/ Probably due to the WASD movement is easiest for me, always found the other modes a bit hard with the camera movement, but maybe ill try to adjust.<br/>\n<br/>\n<br/>\n So, long term. How would you play out the build? Obviously monk in the 21-23 would go as you suggested, but what sorta of feats  would you recommend throughout. I'd type longer, but i managed to burn my fingers in the oven. Is there perhaps a detailed transcript throughout leveling you would recommend?<br/>\n<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:55 AM - Aug 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey... don't mess with your own comfort on my account.  I was just surprised to hear about another WASD navigator playing on-line like that.  At times, the placeables can create snag points which can only be escaped with the keys.  It's just that I suck at it is all.  Anyways...<br/>\n<br/>\n I estimated the ability split incorrectly.  You can get WIS to <strong>28</strong> rather than 26... so...<br/>\n ...xtra slots earned -  Slvl 1: 3, slvls 2-5: 2 ea., slvls 6-9: 1 ea.<br/>\n If large bones drop on server, <em>Craft Wand</em> is a difference-maker.  My caster druids never leave home without it.<br/>\n Spam Lvl 18 Flame Strikes to your heart's desire, economize buff slots and earn gold from rich UMDers.  Else, <em>Scribe Scroll</em> but only if blank scrolls are sold.<br/>\n Casting from items solves the Concentration check issue but with the trade-off of AoOs.  Pick your poison.<br/>\n<br/>\n It's pretty tough to focus on schools within 30 levels.  My strategy has always been to either reach Epic Focus or don't bother. Wizards are better suited for such endeavors. Your high WIS should take care of saves well enough I expect.<br/>\nSpoiler [+]<br/>\n<br/>\n Druid(26), Monk(4), Lawful Neutral Fear-no-smite Elf<br/>\n<br/>\n STR: 8<br/>\n DEX: 10<br/>\n CON: 10<br/>\n WIS: 18 (28)  <br/>\n INT: 16<br/>\n CHA: 8<br/>\n<br/>\n 01: Dru(1): Spell Pen<br/>\n 02: Dru(2)<br/>\n 03: Dru(3): Grtr Spell Pen<br/>\n 04: Dru(4): WIS+1 (19)<br/>\n 05: Dru(5)<br/>\n 06: Dru(6): Extend Spell<br/>\n 07: Dru(7)<br/>\n 08: Dru(8): WIS+1 (20)<br/>\n 09: Dru(9): Empower Spell<br/>\n 10: Dru(10)<br/>\n 11: Dru(11)<br/>\n 12: Dru(12): WIS+1 (21), ImpCrit: Unarmed<br/>\n 13: Dru(13)<br/>\n 14: Dru(14)<br/>\n 15: Dru(15): Craft Wand (or Scribe scroll or Toughness)<br/>\n 16: Dru(16): WIS+1 (22)<br/>\n 17: Dru(17)<br/>\n 18: Dru(18): Blind Fight<br/>\n 19: Dru(19)<br/>\n 20: Dru(20): WIS+1 (23)<br/>\n 21: Mnk(1): Armor Skin, {Cleave, Evasion, Imp Unarmed, Stunning Fist}<br/>\n 22: Mnk(2): {Deflect Arrows}<br/>\n 23: Mnk(3) {Monk speed, Still mind}<br/>\n 24: Dru(21): WIS+1 (24), Epic Spell Pen<br/>\n 25: Dru(22)<br/>\n 26: Dru(23)<br/>\n 27: Mnk(4): Grt WIS (25)<br/>\n 28: Dru(24): WIS+1 (26), Grt WIS (27)<br/>\n 29: Dru(25)<br/>\n 30: Dru(26): Grt WIS (28)<br/>\n<br/>\n Concentration 10, Discipline 30, Hide 30, Listen 30(41), Move Silently 30,<br/>\n Spellcraft 32(35), Tumble 30, remaining ----&gt; 39<br/>\n<br/>\n Will save vs. spells when buffed with Owl's Insight + Resistance will be 40.<br/>\n Stunning Fist DC when buffed with Owl's Insight + Resistance will be 40.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerionx",
      "avatar": "no_avatar.png",
      "timestamp": "7:04 AM - Aug 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>Hey... don't mess with your own comfort on my account.  I was just surprised to hear about another WASD navigator playing on-line like that.  At times, the placeables can create snag points which can only be escaped with the keys.  It's just that I suck at it is all.  Anyways...<br/>\n<br/>\n I estimated the ability split incorrectly.  You can get WIS to <strong>28</strong> rather than 26... so...<br/>\n ...xtra slots earned -  Slvl 1: 3, slvls 2-5: 2 ea., slvls 6-9: 1 ea.<br/>\n If large bones drop on server, <em>Craft Wand</em> is a difference-maker.  My caster druids never leave home without it.<br/>\n Spam Lvl 18 Flame Strikes to your heart's desire, economize buff slots and earn gold from rich UMDers.  Else, <em>Scribe Scroll</em> but only if blank scrolls are sold.<br/>\n Casting from items solves the Concentration check issue but with the trade-off of AoOs.  Pick your poison.<br/>\n<br/>\n It's pretty tough to focus on schools within 30 levels.  My strategy has always been to either reach Epic Focus or don't bother. Wizards are better suited for such endeavors. Your high WIS should take care of saves well enough I expect.<br/>\nSpoiler [+]<br/>\n<br/>\n Druid(26), Monk(4), Lawful Neutral Fear-no-smite Elf<br/>\n<br/>\n STR: 8<br/>\n DEX: 10<br/>\n CON: 10<br/>\n WIS: 18 (28)  <br/>\n INT: 16<br/>\n CHA: 8<br/>\n<br/>\n 01: Dru(1): Spell Pen<br/>\n 02: Dru(2)<br/>\n 03: Dru(3): Grtr Spell Pen<br/>\n 04: Dru(4): WIS+1 (19)<br/>\n 05: Dru(5)<br/>\n 06: Dru(6): Extend Spell<br/>\n 07: Dru(7)<br/>\n 08: Dru(8): WIS+1 (20)<br/>\n 09: Dru(9): Empower Spell<br/>\n 10: Dru(10)<br/>\n 11: Dru(11)<br/>\n 12: Dru(12): WIS+1 (21), ImpCrit: Unarmed<br/>\n 13: Dru(13)<br/>\n 14: Dru(14)<br/>\n 15: Dru(15): Craft Wand (or Scribe scroll or Toughness)<br/>\n 16: Dru(16): WIS+1 (22)<br/>\n 17: Dru(17)<br/>\n 18: Dru(18): Blind Fight<br/>\n 19: Dru(19)<br/>\n 20: Dru(20): WIS+1 (23)<br/>\n 21: Mnk(1): Armor Skin, {Cleave, Evasion, Imp Unarmed, Stunning Fist}<br/>\n 22: Mnk(2): {Deflect Arrows}<br/>\n 23: Mnk(3) {Monk speed, Still mind}<br/>\n 24: Dru(21): WIS+1 (24), Epic Spell Pen<br/>\n 25: Dru(22)<br/>\n 26: Dru(23)<br/>\n 27: Mnk(4): Grt WIS (25)<br/>\n 28: Dru(24): WIS+1 (26), Grt WIS (27)<br/>\n 29: Dru(25)<br/>\n 30: Dru(26): Grt WIS (28)<br/>\n<br/>\n Concentration 10, Discipline 30, Hide 30, Listen 30(41), Move Silently 30,<br/>\n Spellcraft 32(35), Tumble 30, remaining ----&gt; 39<br/>\n<br/>\n Will save vs. spells when buffed with Owl's Insight + Resistance will be 40.<br/>\n Stunning Fist DC when buffed with Owl's Insight + Resistance will be 40.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Yeah, I mostly like driving camera mode. (The other camera angles give better positions I admit) But, in driving mode it feels more... how do I put it? Like you're going through the dungeon instead of overlooking it. That and turning around and having your character unable to see in front of him because the camera doesn't move with the direction is kinda wonky. (Quickly adjusted, but wonky. Course, I don't like to be too terribly zoomed out, so there's that.) Though, if you're feeling up to it. You should try Driving mode with the camera just about on your characters back (little zoomed back) gives a interesting outlook on things. I am also going to try and get use to the other camera views. (As sometimes...driving mode is a terrible thing to have in some places)<br/>\n<br/>\n<br/>\n I appreciate the help with the build. I think Scribe scroll will be. more useful here Mostly because, as I remember correctly you can get blank scrolls in great access (and they are cheap). Then, again I logged into a whole different world from what I left not too long ago. Even the starter city did a upside down turn.<br/>\n<br/>\n Again thanks for the help, Hipredux, and remember... to fight a Wizard? Summon a Rabbit. That's the worst enemy for them. I still have nightmares *shudders*<br/>\n<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:47 PM - Aug 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">For your notebook and edification...<br/>\n<br/>\n I found an old stat sheet on a similar build I used for the Elder Water shape ~somewhere~ and modified down to a Level 30 toon (mine had higher WIS @Level 40 of course ).<br/>\n<br/>\n Gear: naked w/+5 small shield<br/>\n Buffs: Emp Bull STR, Owl's Insight, Premonition, AoV, Resistance, Blood Frenzy, Spell Resist, Pots of Speed<br/>\n HP 510<br/>\n AC* 60 (61 w/o BF)<br/>\n AB* (hasted) +35/+32/+29/+26/+23/+20  (6 APR)<br/>\n AB (hasted, FoB mode) +33/+30/+27/+24/+21/+18/+15 (7 APR)<br/>\n Dmg: 17-35 bludgeon crit 19-20 x2<br/>\n Saves (F/W/R): 29/36/23 (36/43/30 vs spells)<br/>\n SR 38<br/>\n DR 15/+3 until shape expires, 30/+5 for first 260 dmg<br/>\n Immunities: crits, sneaks, fire dmg, mind effects, paralysis, poison, disease<br/>\n<br/>\n *Earth shape gets +3 AB increase but -6 DEX AC and -3 dodge AC (net ~51 AC) and slightly better dmg.  I always liked the Water's fire immunity myself plus the nifty blue animation itself.<br/>\n<br/>\n Didn't know that trick about the rabbit.  I must remember that. *jotting feverishly*<br/>\n<br/>\n Good luck in your escapades on Arelith, mate!<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}