{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "591",
  "name": "Help me build a LVL 25 Rogue/Assassin",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/help-me-build-a-lvl-25-rogue-assassin-t2355483.html",
  "author": "GankAnRun",
  "avatar": "10759310_1590835636.jpg",
  "replies": 11,
  "posts": [
    {
      "author": "GankAnRun",
      "avatar": "10759310_1590835636.jpg",
      "timestamp": "1:33 PM - May 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Here is what i am looking for following the guidelines as a template:<br/>\n<br/>\n1) PvM will be the main focus as it is mostly focused on RP in this PW but would be nice to be able to take on a player in an \"Assassination.\" I love the assassins ability to paralyze and mixed with the rogues Sneaks getting some big hits in to open a fight for the party. Being able to get to hard to reach (Locked/trapped) places would be nice as well.... and liberating a few pockets of heavy coins here and there is always fun. <br/>\n<br/>\n2) Level cap - 25 is the level cap but it is a slow process to even reach level 10, so something that is not going to suffer in lower levels would be nice or at least provide a small 2-3 person party a good opening and be able to clear possibly trapped paths.<br/>\n<br/>\n3) Race preference - I like the Halfling idea in the little villain build I saw in the level 20 cap builds <br/>\n<br/>\n4) Class preference - I want to play a rogue/assassin build. In the server I am going to be playing on Assassin gets HiPS at Lvl 8, If some charisma can be sprinkled in to help with \"Disguise\" checks that would be great, if not i'll just make sure to stay stealthy.<br/>\n<br/>\n5) Melee preference - dual-wielding wouldn't be a bad option with maybe Daggers or if possible Kukri? I know halfling has to stick with small weapons. Dexterity-based to help be sneaky, sneak attacks (stealth), specialized attacks (sneaks, and death attacks)<br/>\n<br/>\n6) Range preference - DEX sling or dart<br/>\n<br/>\n7) Weapon preference - Short range, ranged weapon like sling or dart, or a Dual wield. whichever is a more viable option... looking at some other builds already made I am thinking sling would be my best bet<br/>\n<br/>\n8) Maximum item enhancement - I think +3 is the MAX for enhancement buried somewhere in the epic vaults of insane difficulty somewhere? the best named special items i see in the one note is enhancement +2.<br/>\n<br/>\n9) Spellcasting - It's an assassin, so not much here in the way of spellcasting, but you can see <a class=\"postlink\" href=\"https://onedrive.live.com/redir?resid=3E975EC13BD6615E%2120854&amp;authkey=%21AG4Q5LUQEwjMvaY&amp;page=View&amp;wd=target%28Classes.one%7Ca87119a1-8d5b-4de0-bf3c-47142fbae7eb%2FAssassin%7Cadfc39bb-ea7f-4458-939e-aec46fdb0a0a%2F%29\" rel=\"noreferrer\" target=\"_blank\">here</a> in the one note they do get some things.<br/>\n<br/>\n<br/>\n10) Custom factors - this is the one note for the server I am looking to utilize the build <a class=\"postlink\" href=\"https://onedrive.live.com/redir?resid=3E975EC13BD6615E%2120854&amp;authkey=%21AG4Q5LUQEwjMvaY&amp;page=View&amp;wd=target%28Thay%20Overview.one%7C84883662-8be2-43b1-876c-0310db4104a3%2FIntroduction%20to%20the%20Thay%20PW%7C401d4f9d-e903-4ec9-99f7-687ccdf20b72%2F%29\" rel=\"noreferrer\" target=\"_blank\">Thay PW one note</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:16 PM - Jun 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello and welcome, GankAnRun!<br/>\n<br/>\nI'm afraid Assassin isn't my area of expertise, so this is just a greeting, really. What I will do, though, is put in this link to your query on Mick's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/little-villain-rogue-7-assassin-10-sd3-t2351642.html\" rel=\"noreferrer\" target=\"_blank\">Little Villain</a> build from the level 20 forum. Hope someone can come along with real advice soon.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sarthrovar",
      "avatar": "no_avatar.png",
      "timestamp": "7:25 AM - Jun 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm not familiar with that particular server, but looking at the OneNote it seems there are some custom skills such as disguise. Likely putting skill points into Disguise will serve better than adding stat points to CHA. Weapon Finesse requires +1 base attack so cannot be taken at level 1, which will make the first few levels a challenge, but below is a potential level progression to get a dual-wielding Kukri Halfling rogue/assassin. I would probably be tempted to move points from STR, CON, and CHA to buff INT to 18 to get more skill points. Level Cap of 25 also precludes the pre-reqs for Epic Dodge. The Rogue 10 bonus feat could be swapped out for something different, but Crippling Strike seemed to fit the theme. The HiPS at Assassin (8) is also custom for this server, but removes the need for investing in Dodge and Mobility as pre-reqs for Shadow Dancer. Hopefully this will help get you started with some ideas/variations.<br/>\n<br/>\nRogue(10), Assassin(15), Halfling<br/>\nAlignment: Any evil<br/>\n<br/>\nSTR: 12<br/>\nDEX: 18 (26)<br/>\nCON: 10<br/>\nWIS: 8<br/>\nINT: 16<br/>\nCHA: 10<br/>\n<br/>\n01: Rogue(1): Ambidexterity<br/>\n02: Rogue(2): {Evasion}<br/>\n03: Rogue(3): Weapon Finesse, {Uncanny Dodge I}<br/>\n04: Rogue(4): DEX+1, (DEX=19)<br/>\n05: Rogue(5)<br/>\n06: Assassin(1): Weapon Proficiency (Exotic Weapon)<br/>\n07: Assassin(2)<br/>\n08: Assassin(3): DEX+1, (DEX=20)<br/>\n09: Assassin(4): Weapon Focus: Kukri<br/>\n10: Assassin(5)<br/>\n11: Assassin(6)<br/>\n12: Assassin(7): DEX+1, Two Weapon Fighting, (DEX=21)<br/>\n13: Assassin(8)<br/>\n14: Assassin(9)<br/>\n15: Assassin(10): Improved Two Weapon Fighting<br/>\n16: Rogue(6): DEX+1, (DEX=22)<br/>\n17: Rogue(7)<br/>\n18: Rogue(8): Blind Fight<br/>\n19: Rogue(9)<br/>\n20: Rogue(10): DEX+1, Crippling Strike, (DEX=23)<br/>\n21: Assassin(11): Epic Weapon Focus: Kukri<br/>\n22: Assassin(12)<br/>\n23: Assassin(13)<br/>\n24: Assassin(14): DEX+1, Great Dexterity I, Great Dexterity II, (DEX=26)<br/>\n25: Assassin(15)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "GankAnRun",
      "avatar": "10759310_1590835636.jpg",
      "timestamp": "9:56 AM - Jun 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">would this build run a little smoother if maybe it was elf or human? I said halfling because of the little villain build... but I could go with any race. The general idea behind the character is not in the race but more in the profession and play/combat style.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:22 AM - Jun 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think overall it depends how important knocking down opponents is to you. For me, I like to knockdown opponents and unload a pile of sneak attack damage, making me less reliant on stealth and flanking, or other tricks such as darkness/ultravision. <br/>\n<br/>\nHalflings make great rogues and stealth characters, there is +2 dex -2 str, their small size grants bonuses to spot/listen checks, stealth, attack bonus and armor class.<br/>\nThe downside of the smaller size is that they find it harder to knockdown enemies, are easier to knockdown. Certain weapons are wielded differently or completely be unable to be wielded. A human or elf can equip large weapons such as longbows,  rapiers can be finessed, and small weapons (such as shortswords, kamas) can be dual wielded at a -2 penalty, whereas a halfling would have a -4 penalty dual wielding such small weapons, it is only tiny weapons (daggers/kukris) where small characters get a -2 penalty with dual wielding. They also get a +1 bonus to saves, which is nice as well, and AB using throwing weapons.<br/>\n<br/>\nIn Sarthrovar's build, kukris are tiny weapons and knockdown is not taken, so halfling is not really at a disadvantage, and gains +1-2 AB compared to elf and human respectively, better stealth and better spot/listen checks. <br/>\n<br/>\nIf one chose to dual wield shortswords or maces this would save the character a feat by not needing to take exotic proficiency, allowing the build to get knockdown. I would then make the character an elf and dual wield shortswords. It has keen senses to match or even better the halfling's detection, the AB is only 1 lower, but it can knockdown enemies better, it can use a longbow. Human is also good, allows for an extra feat which the build really wants, which allows for the character to get improved knockdown, and more skill points. <br/>\n<br/>\nJust my preference though, and others may have other thoughts regarding this. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:12 PM - Jun 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I may look into this for you, since my build sparked the idea. I have to wait for a couple days though because RL is rather busy atm.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "GankAnRun",
      "avatar": "10759310_1590835636.jpg",
      "timestamp": "9:25 PM - Jun 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10235235&amp;sid=2c1c7fe12c773fa42d41638ee87f0057\">Mick Dagger</a> wrote: <a data-post-id=\"20809\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20809&amp;sid=2c1c7fe12c773fa42d41638ee87f0057#p20809\">↑</a><div class=\"responsive-hide\">Jun 02, 2020</div></cite>I may look into this for you, since my build sparked the idea. I have to wait for a couple days though because RL is rather busy atm.</div></blockquote>\n\nThat would be awesome mick, I appreciate it. RL is always more important so whenever you get the time would be cool. <br/>\n<br/>\nOrion I like the thoughts behind the knockdown, but not huge on my prioritizations. Though it would be a nice to have it’s not a need to have for me. Making the adjustment to bump intelligence would be a likely route as I would like to have pick pocket and the server custom attribute disguise. I’d be willing to give up use magic device as that’s not something I typically use in my play style. Kukri is not a must, just a higher crit range tiny weapon is why I was thinking Kukri. But mace or dagger Or any rogue proficiency type weapon would be an option as well freeing up the talent point for maybe better two weapon fighting talents. RP is the main goal of this build but don’t want it to be at the expense of being able to go out and level and be an effective character.  <br/>\n<br/>\nThanks for the help y’all <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sarthrovar",
      "avatar": "no_avatar.png",
      "timestamp": "4:40 AM - Jun 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">When I play a dex based HiPS build with sneak attack (or death attack) I like to get a ranged alternative that can benefit from Rapid Shot, the halfling build above was feat starved so it wasn't possible to free up two extra feats. There are a lot of hit and run tactics that can be done with rapid shot. A lot of build making depends on preferred play style, and if you play in a group how your character fits in with the rest of the group. If you relax the race constraint and the weapon type the possibilities expand a lot. I intentionally didn't post a skill schedule on the build above as a lot of the fine tuning of skills will depend on the specific module/environment and personal preference. <br/>\n<br/>\nBelow is a variant of the build I posted above but as a human and picks up the ranged feats (Point Blank Shot and Rapid Shot) and knockdown (but not improved knockdown); it picks up the ranged feats early to help with early leveling; it delays ITWF to prioritize the utility feats knockdown and blind fight. It keeps Rogue Sneak Attack at 5d6, but loses Crippling Strike. It drops the Assassin Death Attack from 8d6 to 7d6 to let the human get to 26 Dex by taking an extra fighter bonus feat in epic levels. It gains 20 skill points compared to the halfling, but loses 1 AC and 1 Ranged AB. The variant below is based on short swords, but could be swapped for a different weapon type. The last fighter level could be changed to assassin to trade Epic Weapon Focus for an extra 1d6 Death Attack. The build could be modified for an Elf as well to take advantage of the racial bonuses, but will have less skill points for distribution than the human. \n<details><summary>Spoiler</summary>Human, any evil, Rogue(9), Assassin (14), Fighter (2)\nSTR: 13\nCON: 10\nINT: 16\n\n02: Rogue(2): {Evasion}\n04: Rogue(4): DEX+1, (DEX=18)\n06: Assassin(1): Knockdown\n08: Assassin(3): DEX+1, (DEX=19)\n10: Assassin(5)\n12: Assassin(7): DEX+1, Weapon Focus: Short Sword, (DEX=20)\n14: Assassin(9)\n16: Rogue(6): DEX+1, (DEX=21)\n18: Fighter (1): Two Weapon Fighting, Improved Two Weapon Fighting\n20: Rogue(9): DEX+1, (DEX=22)\n22: Assassin(12)\n24: Fighter(2): DEX+1, Great Dexterity II, Epic Weapon Focus: Short Sword, (DEX=25)\n</details>\n<details><summary>Spoiler</summary>Potential skill split for 268 points:\nMove Silently: 26\nSpot: 20\nUMD: 26\nOpen Lock: 20\nPick Pocket: 20\nSet Trap: 20\nno craft trap though...\n</details>\nThe human build could swap the order of the feats and levels a little bit if you delayed weapon focus until 18 and took the fighter level at 15 then ITWF could be kept at level 15. It would achieve dual wielding a bit earlier and delays the need to decide on a specific weapon type, but also delays the AB from weapon focus.<br/>\n<br/>\nThe build does most of it's damage through sneak/death attacks, which are not multiplied by critical strikes so the difference in threat range isn't that significant. For builds I usually play, the threat range is most impactful for STR focused builds because the bonus damage from strength is multiplied by critical strikes.<br/>\n<br/>\nThe thing with rogue/assassin builds is that Sneak Attack (Death Attack) damage increases on odd levels, Assassin gets a bonus feat every 4 levels in Epic. Rogue gets the most skill points but can be traded for fighter level(s) for extra Feats, so build around those parameters as the core and then tweak per taste. Also crit immune (sneak attack immune) enemies like undead or constructs will be annoying which is where alternative damage from traps or UMD can become useful.<br/>\n<br/>\nAlthough, I'm secretly and eagerly awaiting what Mick comes up with as Mick has posted some awesome builds that I've played with.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:15 AM - Jun 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">First of all, I'm sorry for not being able to help with the build before now. If you have already started playing your assassin, I can understand that.<br/>\nI think Sarthrovar's halfling build is very good. I would not bother with ranged combat feats though, unless you want to have that as a main focus. The high dex and SA alone will take good care of ranged AB and damage in most environments, until you can get weapon finesse.<br/>\n<br/>\nBeware that the assassin DA paralysis has been nerfed with NwN EE patch 1.74. It now only triggers a save vs paralysis with the first attack in a flurry. Earlier you could paralyze with all the attacks in the flurry.<br/>\nThat makes rogue more attractive than before as an alternative to assassin with more skill points, more bonus feats to choose between, access to ED, the ability to handle high DC locks and traps and so on. Some servers try to compensate for that by adding extra bonus spells and class feats to the assassin class, such as HIPS on your server.<br/>\n<br/>\nIf HIPS is important for your game play, I would still consider SD on a slow levelling server. With HIPS at assassin level 8, the earliest you can get it is at character level 13. With SD, you can get HIPS at character level 8.<br/>\n<br/>\nIf you don't want SD, you still have a 3rd class available. Monk with dual kamas, monk UBAB and flurry will secure more SA/DAs per flurry and per round.<br/>\nA full BAB class (warrior) can help you get BAB 16 or better for full warrior attack schedule.<br/>\nFighter, blackguard or an evil divine champion (if you can substitute CoT for that where you play) are good options offering different kind of improvements.<br/>\n<br/>\nIf you want to use a warrior class, ranger has stealth as class skills and qualifies for assassin just as quickly as rogue, but with +2 better AB. Ranger also gives dual wield and ITWF if you take enough levels.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sarthrovar",
      "avatar": "no_avatar.png",
      "timestamp": "5:07 AM - Jun 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">One more build to consider...<br/>\n<br/>\nRanger will get 2 Favored enemies (build below picks Undead and Construct since they are crit/DA immune); Ranger will get to start with BAB 1 so can take Weapon Finesse at first level and with dual-wield<br/>\nBuild will play much differently than one that starts as a rogue base class (will get significantly fewer skills) and will miss out on Evasion and Sneak Attack (5d6); dual-wield acts like Ambidexterity and Two Weapon Fighting, but do not count towards ITWF; so ITWF is delayed until Ranger 9; but it means you can dual wield with weapon finesse at level 1. The build doesn't get access to all \"rogue\" like skills (disable trap, open lock, UMD, Tumble) until the first Assassin level; Ranger does get Hide, Move Silently, Search, and Set Trap as class skills.<br/>\nRanger also gets an animal companion at level 6 (can serve as a meat shield/distraction)<br/>\nThe build will get to 16 BAB pre-epic for the full 4 main hand attacks; it uses the Ranger bonus feat at level 10 to get Epic Weapon Focus<br/>\nThe ranger d10 hit dice per level actually results in slightly higher potential HP than the rogue based build (rogue is d6) even though the CON modifier is negative.<br/>\nI should probably post a skill schedule for below, but Ranger has class skills for Hide and Move Silently to qualify for Assassin; Assassin has Tumble as a class skill to qualify for SD for earlier access to HiPS. Dodge and Mobility are taken as early feats to qualify for SD (which is fine since ranger doesn't need to spend feats on Ambidexterity or Two Weapon Fighting).<br/>\nBuild takes Improved Knockdown (uses Elf instead of halfling for the size bonus), gets the Elf keen senses racial.<br/>\n<br/>\nElf, any evil, Ranger(10), Assassin (14), SD (1)<br/>\n<br/>\nSTR: 10<br/>\nDEX: 19 (28)<br/>\nCON: 8<br/>\nWIS: 11<br/>\nINT: 16<br/>\nCHA: 8<br/>\n<br/>\n01: Ranger(1): Weapon Finesse, {Favored Enemy (Undead)}, {dual-wield}, {trackless step}<br/>\n02: Ranger(2)<br/>\n03: Ranger(3): Dodge<br/>\n04: Ranger(4): DEX+1, (DEX=20)<br/>\n05: Ranger(5): {Favored enemy (Construct)}<br/>\n06: Ranger(6): Mobility, {animal companion}<br/>\n07: Assassin(1): {Use Poison, Death Attack}<br/>\n08: Shadow Dancer(1): DEX+1, {HiPS}, (DEX=21)<br/>\n09: Assassin(2): Knockdown, {Ghostly Visage, Uncanny Dodge I, Poison Save}<br/>\n10: Assassin(3)<br/>\n11: Assassin(4)<br/>\n12: Assassin(5): DEX+1, Blind Fight, {Darkness, Uncanny Dodge II}, (DEX=22)<br/>\n13: Assassin(6)<br/>\n14: Assassin(7): {Invisibility} <br/>\n15: Assassin(8): Improved Knockdown<br/>\n16: Assassin(9): DEX+1, {Improved Invisibility} (DEX=23)<br/>\n17: Ranger(7)<br/>\n18: Ranger(8): Weapon Focus: Short sword<br/>\n19: Ranger(9): {Improved Two Weapon Fighting} <br/>\n20: Assassin(10): DEX+1, {Uncanny Dodge III} (DEX=24)<br/>\n21: Ranger(10): Great Dexterity I, Epic Weapon Focus: Short Sword, (Dex=25)<br/>\n22: Assassin(11)<br/>\n23: Assassin(12)<br/>\n24: Assassin(13): DEX+1, Great Dexterity II, (DEX=27)<br/>\n25: Assassin(14): Great Dexterity III, (DEX=28)<br/>\n<br/>\n167 Hit points<br/>\nAC 24 (naked)<br/>\nMelee AB (Short Sword)<br/>\n+29/24/19/14 Short sword (main hand)<br/>\n+29/24 Short sword (offhand)<br/>\n<br/>\nRanged AB +28<br/>\n<br/>\n198 Skill points:<br/>\npossible distribution<br/>\n15 Disable Trap<br/>\n15 Disguise<br/>\n15 UMD<br/>\n25 Tumble<br/>\n15 Set Trap<br/>\n15 Search<br/>\n14 Open Lock<br/>\n28 Move Silently<br/>\n28 Hide<br/>\n28 Listen<br/>\n<br/>\nNo points for: Spot, Pick Pockets, Discipline, or Craft Trap; Listen taken over Spot because of Blind Fight mechanics<br/>\n(can redistribute above as needed for personal preference)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "6:16 AM - Jun 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Looks nice!<br/>\nA slight variation to get evasion would be to swap rogue for assassin (getting 20% exp penalties as an elf however) or find a way to get SD 2 (perhaps Ranger 10 / Assassin 13 / SD 2 - it would lose the assassin 14 bonus feat though)<br/>\nWeapon finesse at level 1, Improved knockdown + 7d6 death attack + 6 APR - delightful. Camouflage to buff stealth and spam hips<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sarthrovar",
      "avatar": "no_avatar.png",
      "timestamp": "1:53 AM - Jun 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Orion you bring up some interesting points.<br/>\n<br/>\nIf wanting to keep Evasion, the easiest tweak to the ranger build would be to take 2 levels of SD back-to-back and drop 1 level of Assassin pre-epic (need to keep 9 ranger levels for the BAB). The epic feat at level 24 could be swapped out for Epic Prowess or Armor Skin; however, if one is willing to drop the final DEX down to 26 an arguably better alternative would be to change the starting stats.<br/>\n<br/>\nAlternate starting stats, for Elf Ranger(10)/SD(2)/Assassin(13)<br/>\nSTR: 12<br/>\nDEX: 18 (26)<br/>\nCON: 8<br/>\nWIS: 12<br/>\nINT: 16<br/>\nCHA: 8<br/>\n<br/>\nThe point buy system means the 19 DEX cost 3 points, redistributing those points to get to 12 WIS and then an extra +2 floating points that could be put into STR, CON, or CHA. I put them in STR for +1 damage and extra carrying capacity. The WIS 12 would allow the level 10 Ranger to cast level 2 spells, including Cat's Grace - which would bring a self-buffed DEX to 28+ (although temporary and subject to dispelling); in addition to providing a bit more utility if wanting to use something other than Cat's Grace. The same level progression to keep 2 SD levels to get Evasion, 9 pre-Epic Ranger levels for BAB, and 9 pre-Epic Assassin levels (for Improved Invisibility and DA). The net result is swapping the 2 points of DEX for 3 stat points, enabling level 2 Ranger spells and getting Evasion instead of just getting Evasion with Epic Prowess.<br/>\n<br/>\nThe other topic of swapping Rogue for Assassin is a much more fundamental shift. Ranger level 1 spell selection includes Ultravision which synergizes well with the Assassin Darkness feat, really most of the Ranger level 1 spells provide good situational utility. Rogue would lose the paralysis from Death Attack, and all the Assassin specials (Darkness, Invisibility, Use Poison, Poison Save, Ghostly Visage, Improved Invisibility); however, Rogue would gain a lot more skill points, does not carry the alignment restriction, and would get 2 bonus Rogue feats (which could be used to get Improved Evasion and Defensive Roll, or whatever else is desired). It also swaps the dynamic of a prestige class versus a base class, so an Elf would be subject to the leveling XP penalty (as you called out). A human would not be subject to the same XP penalty, but would also bring into the discussion the different racial bonuses. My personal preference for building around Rogue over Assassin would be to build using a human and take advantage of the bonus skill point to reduce INT to 14. Then build towards Ranger level 2 spells (12 WIS) and final DEX of 26. There is an extra pre-Epic bonus feat that I don't have a good suggestion for but here are some options: Exotic Weapon Proficiency, Improved Critical, Stealthy, Toughness, Point Blank Shot, Called Shot, a second Weapon Focus, Brew Potion, or Craft Wand. I'm using Craft Wand in the progression below. The level progression also comes into play, as Rogue would get extra skills if taken at level 1 but would delay Weapon Finesse (so a choice has to be made), I'm going with Rogue first below but could be exchanged with Ranger if wanting to give up skill points for earlier Weapon Finesse.<br/>\n<br/>\nHuman starting stats (for a Ranger/SD/Rogue variant)<br/>\nHuman, Any alignment<br/>\nSTR: 12<br/>\nDEX: 18 (26)<br/>\nCON: 8<br/>\nWIS: 12<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\n01: Rogue(1): Blind Fight, Dodge<br/>\n02: Rogue(2): {Evasion}<br/>\n03: Ranger(1): Weapon Finesse, {Favored Enemy (Undead)}, {dual-wield}, {trackless step}<br/>\n04: Ranger(2): DEX+1, (DEX=19)<br/>\n05: Ranger(3): <br/>\n06: Ranger(4): Mobility<br/>\n07: Ranger(5): {Favored enemy (Construct)}<br/>\n08: Shadow Dancer(1): DEX+1, {HiPS}, (DEX=20)<br/>\n09: Ranger(6): Knockdown, {animal companion}<br/>\n10: Rogue(3): {Uncanny dodge I}<br/>\n11: Rogue(4)<br/>\n12: Rogue(5): DEX+1, Improved Knockdown, (DEX=21)<br/>\n13: Rogue(6): {Uncanny dodge II}<br/>\n14: Rogue(7): {Invisibility} <br/>\n15: Rogue(8): Weapon Focus: Shortsword<br/>\n16: Rogue(9): DEX+1 (DEX=22)<br/>\n17: Rogue(10): {Improved Evasion}<br/>\n18: Ranger(7): Craft Wand<br/>\n19: Ranger(8) <br/>\n20: Ranger(9): DEX+1, {Improved Two Weapon Fighting} (DEX=23)<br/>\n21: Ranger(10): Great Dexterity I, Epic Weapon Focus: Short Sword, (Dex=24)<br/>\n22: Rogue(11): {Uncanny dodge III}<br/>\n23: Rogue(12)<br/>\n24: Rogue(13): DEX+1, Great Dexterity II, {Defensive Roll} (DEX=26)<br/>\n25: Rogue(14)<br/>\n<br/>\n266 skill points (if rogue @ level 1)<br/>\n<br/>\n254 skill points (if ranger @ level 1) - not shown<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}