{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "146",
  "name": "2-Handed Sword, STR-based Elf Request",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/2-handed-sword-str-based-elf-request-t2354557.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:19 PM - Jul 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello All,<br/>\n<br/>\n Hope everyone's well. I've been out of circulation for a while, that rapscallion RL will keep messing with me.<br/>\n<br/>\n Anyway...<br/>\n<br/>\n This may sound a little odd, but I'm trying to plant a couple of characters I scribble about into a NwN setting (specifically Aeilund, ie, non-DevCrit, although hopefully translatable into other PvM scenarios). As ever, I have a concept for each, but I need guidance into the starting blocks (perhaps the track itself), please. I'm assuming it would be better to post the requests separately, so I'll do it one at a time.<br/>\n<br/>\n Right then, Elf (effectively Drow) is the closest race, but non-evil. He's STR based and wields a two-handed sword. He has some 'other' blood, so RDD looks a likely candidate. However, he's not given to spellcasting, although has the ability, nor to wearing heavy armour. He was born of Chaos, but seeks to impose Law in the world. He's also charismatic, inspiring great loyalty in those around him and fear in those opposed to him. Barbarian seems wrong to me, so maybe Pally or Fghtr (28-ish)/Sorc (maybe just 1 or 2)/RDD (10, at a guess)? Whatever happens, I'm aware I'm likely to get a sizeable xp penalty. In an ideal world, his Will saves and SR would be off the charts, but we can't have everything, of course.<br/>\n<br/>\n Any thoughts welcome!<br/>\n<br/>\n Cheers<br/>\n<br/>\n PS: I see the nigh-on mythical Kail is back - hoorah!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:11 AM - Jul 09, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am thinking of a Fighter 14 / Bard 16 / RDD 10. If you keep Fighter and Bard even, you can avoid an experience penalty, and get a pretty good Bard song as a bonus.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:36 AM - Jul 09, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Now that's interesting - a variation on my very first request (Non-shooty, Non-Magicky Elf, if you remember). IIRC, you built me a Fighter 16/Bard14/RDD10, who was great. That was a D-W/Dev Crit build, so this would actually give me more leeway. Thanks, Empyre - just the spark I needed for this chap!<br/>\n<br/>\n Alas, there's another request to come (I want to try running them simultaneously - they're my two big-boy hardasses in my writing, and I just want to see what would happen if...)<br/>\n<br/>\n Oh, and I must remember to put an Aielund Finale shot on the Good, Bad and Ugly site - just to show you I have actually completed it!<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}