{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "233",
  "name": "What's your most UBER NWN toon / build? Why?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/what-s-your-most-uber-nwn-toon-build-why-t2354375.html",
  "author": "Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:51 AM - Jan 30, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hail, ECBers!<br/>\n<br/>\n After work sucked the life out of me for the past couple of years, I'm BACK, and like a super sayan, stronger than before (although not blonde and with green eyes for some reason hehe).<br/>\n<br/>\n The other day, my good friend Valerfor, with whom I shared extensive conversations about NWN builds, and I were playing together and I was showing him what I consider to be my most amazing creation in all these years of NWN. Maximillian Kane, my <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515401/The-Magical-Master-Cleric-15Wizard-23Monk-2#.VMpMmuZ0zmQ\" rel=\"noreferrer\" target=\"_blank\">Magical Master</a> build. Val said that the toon is obviously powerful but not \"the end of the world\" kind, and that he understands that there are some toons or builds that are just dear to us for some reason. I respectfully disagree. He's one of those toons that you really need to play PROPERLY in order to understand the potential. It's really funny, because I know that in the ECB, my Shadow Priest build and my Demolition Man build received much more positive feedback and interest, but even those builds can't compare to Max when it comes to the following criteria:<br/>\n<br/>\n 1- Power: AB, AC, (and AB-to-AC-ratio), Saves and DPR (Damage Per Round). Some players would say that HP also comes to effect when trying to judge a build's power. Although that might be true in some cases, in game playing Max, what low HP means is that you have less time to react. Of course, on a low AC build, it would matter more, but it's not the case here. Saves are low, that is one of the build's main weaknesses, but what good are they if you have an alternative way that almost prevents you from ever rolling saves (if you play him properly)? For spells, he has Spell Mantles, Death Ward for death spells, for traps he has his Pixie Familiar and Evasion (and the Find Traps spell) and for Devcrits he has his MONSTRUOUS AC. NOTHING can crit him unless he's flat-footed, but then he has True Seeing and Greater Sanctuary to avoid ever being in that position. With WoG items (not going to list them) he can reach 77 AC (82 with Expertise). In Vanilla NWN with items, he gets to 72 (77 with Expertise) AC with just a few items to add to Wisdom and to Dexterity and a +5 Monk boots.<br/>\n<br/>\n He also has 61 AB and 7 Attacks per round fully buffed (not hard to do at all), 8 with Flurry of Blows and he has Clerical buffs to add to damage. A Fighter Bard RDD only has 5 attacks per round hasted (but no means of hasting himself without items), so even though he does more damage per hit, per round he doesn't do as much 5 x 50 = 250, 8 x 35 = 280 (except against resistant enemies).<br/>\n<br/>\n Comparatively, my Shadow Priest build has the following stats: AB 63 and AC 74 (also fully equipped and fully buffed), which is godly on WoG too, and he has Epic Dodge. Max has a slightly lower AB and no Epic Dodge, in exchange for a higher AC and a full Arcane spellbook at his disposal along with the Scribe Scroll feat, which he can use to create scrolls of both Arcane and Divine Sources to add to his arsenal. His HP are low, his saves are low, but as we saw they don't really matter that much, and he IS DISPELLABLE. This is maybe his greatest weakness. As you have just read, you can scribe scrolls, so use them to bait the dispels, when the enemy runs out you use your buffs. Try to approach invisible and deal with casters right away so you avoid being dispelled. Or you can, alternatively, use dispel-baiting tactics, which you need to master in order to play him well.<br/>\n<br/>\n 2- Versatility: If you ever thought that there wasn't a do-it-all kind of toon, well, there is one. The only thing he can't do is beat high SR, but he's more than capable of meleeing or sniping them. Against max Toolset SR (32), he can Mord's on the target and then let loose a storm or two of missiles on him, Time Stop, rinse and repeat. Here is a list of things he can do:<br/>\n<br/>\n - Open Locks, Disable Traps, Find Secret Doors, all through his Familiar (pixie)<br/>\n - Melee quite efficiently against all non-resistant mobs. Against fire and physical resistant mobs, he has his own bag of tricks. Spells, Divine Favor and Battletide damage, which are both pretty much irresistible. Damage Shields. They might take longer or cost more spells per day, but they eventually die as well.<br/>\n - He has tools to deal with ANY situation he encounters. Undeads? Mass Heal Scrolls and spells. TOUGH bosses with low HP and low AC who hit like a truck? Bigby 9 / Empowered Blade Barrier combo. HARD mage boss? Bigby 6 and then kick his ass to death, or if he's immune to KD, the old Time Stop / IGMS combo, or a more evil one: Approach invisible, Hasted and with Divine Power cast. Time Stop, True Strike, Harm, Empowered Magic Missile. In servers where Harm is modified to cap at a certain number, you can cast multiple instances of Harm, then IGMS or ILMS depending on how much HP the boss has.<br/>\n - He can craft scrolls of Evard's Black Tentacles and cast them on his enemies to bait dispels before showing himself (like from behind a corridor at a certain angle where he can still hit the enemies without being spotted), or he can buff himself through scrolls so he gets voluntarily dispelled until his enemies are devoid of further dispels and then he can buff, or he can use a few once-a-day items that provide buffs to bait dispels knowing that he will be dispelled and then buff.<br/>\n - Since he's a Finesse character, his sniping capabilities are very good as well, so he can also switch to a bow and fire from a distance. If there is only a narrow passage between enemy position and his position, he can cast Evard's between the target and himself and/or Grease (which many people forget exists) and then kite away while the target slowly approaches and dies in the process.<br/>\n<br/>\n One KEY ability that you need to have in order to play him well is the ability to CONSERVE YOUR RESOURCES!! If you don't need to buff to win a fight, DON'T BUFF!!! You will need to be ready in some situations where things get nasty, so that extra couple of spells that you used just to kill something faster could be dearly missed. Especially the Cleric short-term buffs. If you know when to use them, you'll be unstoppable. Also, ALWAYS HAVE ALTERNATE GEAR to switch around and cover your essentials. You KNOW YOU ARE DISPELLABLE, so BE PREPARED!!! If you get dispelled, go invisible and switch that Periapt of Wisdom for an Amulet of Natural AC +5. Yes, you had Shadow Shield for Natural AC, but now it's gone. You can't be without.<br/>\n<br/>\n For example, on WoG there is a certain boss who is the Demon Prince of the Undeads, and he's TOUGH AS NAILS. If you go at him right away with all your buffs on, he will slaughter you (unless you IGMS him to death, which you can, but where's the challenge in that?). He has a lot of Divine Shield uses, and he has Epic Warding among other things. So to beat the crap out of him, you must wait for him to run out of Divine Shields. If you see him cast it, just be patient, wait, heal occasionally when he rolls a 20 (the only way he'll ever hit you) and just wait for all his main buffs to expire. Then you buff up and spank him like a little girl! Nah, it still takes forever to kill him, but he does eventually and very reluctantly drop dead lol.<br/>\n<br/>\n 3- Synergies:<br/>\n<br/>\n Max IS THE MASTER OF SYNERGIES. He has so many that it's even hard to fathom and process, but I'll try to list them here:<br/>\n<br/>\n - Scribe Scroll + 23 Wizard Levels + 15 Cleric levels = you can scribe UNLIMITED SCROLLS OF ALL THE SPELLS AVAILABLE TO THESE CLASSES except of Cleric 9 spells (which are mostly save-spells, so useless to you anyway).<br/>\n - Epic Mage Armor + Dexterity-based toon + Wisdom AC and high-ish Wisdom (30 capped) + Haste + Expertise + Prayer, Battletide and Bigby 5, Negative Energy Burst Debuffs = you have the highest non-Bard/PM/RDD AC ever seen in NWN AND you can raise your effective AC up to any needed number within the boundaries of logic by using debuffs to your opponent's STR and AB. maybe even higher than any other build. If only you had Curse Song! lol!<br/>\n - Monk Attack Schedule + Cleric Buffs' Damage Boost + Monk Cleave bonus feat + Wizard FW bonus Damage + Wizard Haste spell + Monk Flurry of Blows = Many attacks to which you apply the huge damage boost from your Clerical and Wizard buffs.<br/>\n - Spell synergy: There are many combos that I have come up with that involve Cleric and Wizard spells being cast in combination, and I'm sure I'll think of more. Here are the coolest:<br/>\n       - Bigby 7 or 9 (which holds the character in one place even if he has freedom in case of 9) + Empowered Blade Barrier + Evard's Black Tentacles (if necessary, remember, conserving your resources is vital!) = You can sit back and watch a heavy melee non-resistant monster die while focusing on other targets. DO NOT use this combo against enemies that have ways of dispelling you, such as battle clerics. There are better tools against those. <br/>\n       - Damage shields + Shapechange Iron Golem + heal potions (which you can constantly save by using scrolls of Mass Heal to heal instead of potions in non-imminent-death situations) = You can become immune to criticals and let any monster kill him/her/itself with this combo and you'll never run out of healing because you don't need to use potions of heal most of the time (when you're dying, quaff a potion, as a scroll takes longer to activate).<br/>\n      - Time Stop + True Strike + Divine Power (it's a Melee touch attack, so it's invariably modified by Strength) + Aura of Vitality + Harm + Magic Missile = You can insta-kill any tough non-SR enemy. If Harm has been modified, you may need multiple instances, but still, having one of these combos a day can be VERY useful!<br/>\n      - Grease + Evard's + Bow + Clerical buffs = in narrow passages against lots of enemies, you can kite at them while they try to slowly approach you  and take damage in the process. Remember that Evard's doesn't work on small creatures, so no using this on Kobolds!!<br/>\n     <br/>\n I guess what I'm trying to say here is that although many toons can have higher stats than Max on one particular stat, or even two, they'd have to give up too much for it and they'd be too gimped on the other stats. There are many toons with higher AB (I myself have at least 10) and damage than Max, but only by a few points (AAs excluded) and their AC will be significantly lower, and they don't have a full Wizard and nearly full Cleric spellbook at their disposal. There are spellswords with better casting abilities, but they can't come even close to Max's meleeing capabilities and most are STR-based, so cannot kite effectively. There are some builds (maybe, depends on whether you count debuffs lol) with a higher AC than him, but their ABs and damage output will be significantly lower than Max's and they don't have the Wizardness :D. There's just so much that he can do, that he's incomparable. Yes, he only get EMA and EW at lvl 39, but he's BY NO MEANS a wimp till then. If you're dying with him, you're likely doing something wrong.<br/>\n<br/>\n So, I have \"defended\" the love of my NWN life. How about you guys? What's your favorite toon and why?<br/>\n<br/>\n Take it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "10:36 PM - Feb 08, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Rather than posting what I might consider a \"best build\" I would recommend you take a look at a good build that shares many of the pros and cons of your own build. <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build301943.html\" rel=\"noreferrer\" target=\"_blank\">Dark magic permeater</a> is a high DC caster with a powerful melee option. This build can attack from invisibility with 7 APR in Tenser's form with the first three attacks having a 28 DC (higher when intelligence is buffed) versus paralysis. He deflects arrows while attacking and can always set up a DC 52 +1d10 (higher when charisma is buffed) fear aura from barbarian. Paralyzed creatures are an easy mark for death attack once you factor in the AC they lose from flat-footed, so he can rake in a huge amount of damage. When using spells he has a 38 DC (higher when intelligence is buffed) for his wail of the banshee, which he can cast after an area effect of Mordekainen's disjunction to render all spell resistance (except from monk) nearly useless. His flaws are his dispellability coupled with the fact that he probably cannot stand toe to toe with a level 40 mage spamming spells at him.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:01 AM - Feb 09, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>WhiZard wrote:</strong><hr/>Rather than posting what I might consider a \"best build\" I would recommend you take a look at a good build that shares many of the pros and cons of your own build. <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build301943.html\" rel=\"noreferrer\" target=\"_blank\">Dark magic permeater</a> is a high DC caster with a powerful melee option. This build can attack from invisibility with 7 APR in Tenser's form with the first three attacks having a 28 DC (higher when intelligence is buffed) versus paralysis. He deflects arrows while attacking and can always set up a DC 52 +1d10 (higher when charisma is buffed) fear aura from barbarian. Paralyzed creatures are an easy mark for death attack once you factor in the AC they lose from flat-footed, so he can rake in a huge amount of damage. When using spells he has a 38 DC (higher when intelligence is buffed) for his wail of the banshee, which he can cast after an area effect of Mordekainen's disjunction to render all spell resistance (except from monk) nearly useless. His flaws are his dispellability coupled with the fact that he probably cannot stand toe to toe with a level 40 mage spamming spells at him.</div></blockquote>\n<div align=\"left\">\n Love the build, brother! So unique! If I may ask, what gear do you equip him with? Chainmail, Chain Shirt, Shield? Or does he walk around in robes and unarmed? It's funny because your DC for Death Attack is low, mainly due to the lack of Assassin levels, but SoU and HotU, which was where you said you played it, have monsters with very weak saves. Maybe try to play it through the Aielund Saga, which has a bit better balance than regular OCs and see how well the paralysis works there. If it does, more power to you man!<br/>\n<br/>\n Another concern is AB. With Capped STR and GMW it only gets up to 41 (56 with a True Strike scroll, which is about the only way to ensure these first 3 attacks in the first flurry have maximum chance of landing). How much does Tenser's add to that? If it's the default spell, you lose 2 from Longsword, but gain AB and Attacks per round from it. I'd like to see some stats for the buffed numbers, feel free to include items too, as I'm curious to how you'd equip and play it.<br/>\n<br/>\n Kudos, bro. I'm impressed!<br/>\n<br/>\n Take it EZ!</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "7:21 AM - Feb 09, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In Tenser form he has 20 base strength (which can be upped by negative energy burst and bull's strength to 30), he has +10 AB (from Tenser causing wizard levels to emulate fighter) + 2APR, and he has a +3 longsword.  The AB thus would be 28 (BAB) + 10 (strength) + 10 (Tenser) +3 sword = 51 AB, and he still has room for a +1 from additional strength buffs (i.e. ioun stone) and up to +7 from potential AB buffs (given he has UMD this can be bless, prayer, etc.)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:49 PM - Feb 09, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>WhiZard wrote:</strong><hr/>In Tenser form he has 20 base strength (which can be upped by negative energy burst and bull's strength to 30), he has +10 AB (from Tenser causing wizard levels to emulate fighter) + 2APR, and he has a +3 longsword. The AB thus would be 28 (BAB) + 10 (strength) + 10 (Tenser) +3 sword = 51 AB, and he still has room for a +1 from additional strength buffs (i.e. ioun stone) and up to +7 from potential AB buffs (given he has UMD this can be bless, prayer, etc.)</div></blockquote>\n<div align=\"left\">\n As I suspected, AB is kind of low, but not much you can do about that. I know how to value the finesse it took to even come up with such concept, but AB and AC are way too low for a meleer. It could be worked, but not without altering the concept. If you didn't go for INT, Assassin would lose its purpose in the build. If you'd gone for more Wizard, either Barbarian or your BAB would've suffered (not to mention the whole \"fighting as an assassin\" part). Theoretically, you could go Barb 14 Wiz 6 pre-epic and settle for 27 BAB, and live without Death Attack and Tumble for the whole character life, but giving you room for the Autostill feats if worked in properly and making you less dispellable. However, that would pretty much nullify the benefit of the Assassin class....</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "6:27 PM - Feb 09, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Barbarian 15 is needed for his 52+1d10 DC fear aura (which paralyzes combatants).  The aura is an indirect AC as it prevents many melee attacks.  51 AB without items I do not think is as low as you are insisting.  A standard meleer has 40 AB + 5 weapon + 6 ability increases.  But my build can easily catch a large number of creatures flatfooted (because they are paralyzed).  Also items with spells (like the scabbard of blessing for +2AB) are common fare on many servers as they are in the Toolset.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}