{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "281",
  "name": "Wing Commander (the Aviator) Pal26 RDD10 Bard4+Sorc Variant",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/wing-commander-the-aviator-pal26-rdd10-bard4-sorc--t2293864.html",
  "author": "TyrTemplar",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "2.6K",
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "1:21 AM - Oct 22, 2012",
      "content": "<div>Slashing and Carrying out Critical Missions with Devastating Precision while Humming a Tune PvM (1-40) and PvP<br/>\n<br/>\n<strong>WING COMMANDER (Renaissance Aviator, Tactical Command)<br/>\nBy Deborah “Tyr” Templar</strong><br/>\n<blockquote><div><strong>Author’s Note:</strong> This is the Wing Commander, a dev critting Paladin/RDD with a high, all natural AB 50 (65 self-buffed, +4 Smite Evil), being a playable power build that can, with reasonable items, essentially dev. crit with impunity. The weakness with this build is that it requires an alignment change, but that change is along the Lawful to Neutral Axis, which is the easiest to make, with plenty of time in which to do so. <br/>\n<br/>\nSummary: A talented young cadet joins a military paladin order for all the right reasons, firmly believing that without law and compassion there can be no justice, and rises through the ranks quickly; granted a command (Wing Commander), the Aviator is assigned to what is a top secret mission (aka Operation Dragon Skies), thus joining an elite fighting force comprised of aviation pioneers who, like the Commander, are daring, bold and adventurous. Essential qualities to be found not in disciplined Knights but in pioneers—those who make history, such that an alignment change (“inner bard”) is to be expected along the way (going where no one has gone before with courage, honour but at the same time a zest for adventure—the love of flight and “freedom of the skies” taking hold, becoming far more important to the Commander than enforcing Code, and yet  at all times good and brave, remaining committed to the defense of the people, but doing so as an aviation pioneer, not in code enforcement. Should a player be uninterested/unable to make an alignment change for whatever reason, a sorcerer variant will follow as included in the original post, and found along with the other combos here: <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build277359.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 77359.html</a> .\n</div></blockquote>\n<strong>Concept:</strong><br/>\nIt is said that Leonardo Da Vinci invented a “flying machine” in medieval/Renaissance times, his flight theories based on the study of birds, which centuries later led to the development of an actual glider for human use, among other civil and military inventions, including: the tank, gun powder missile, ballista, and the parachute. Initially, Da Vinci’s flying machine was based on an idea of human-powered wings; although this idea was dropped by him in favor of another based on gliding techniques, what if, instead, his earlier ideas had worked, such that humans could in fact have flapping wings–could early medieval air force flyers, capable of carrying out bombing (fire) missions, and critical extraction exercises, have been the result?<br/>\n<br/>\n<strong>WING COMMANDER (Renaissance Aviator, Tactical Command)<br/>\nPaladin(26), Red Dragon Disciple(10), Bard(4)</strong><br/>\n<br/>\n<strong>I Attributes</strong>:<br/>\n<br/>\nSTR: 18 (40)<br/>\nDEX: 8<br/>\nCON: 12 (14)<br/>\nWIS: 14<br/>\nINT: 12 (14)<br/>\nCHA: 8 (10)<br/>\n<br/>\nRace: Human / Alignment: LG (Start), NG (End)<br/>\n<br/>\n<strong>II Level Guide:</strong><br/>\n01: Paladin(1): Power Attack, Cleave<br/>\n02: Paladin(2): {Smite Evil}<br/>\n03: Paladin(3): Weapon Focus: Greatsword –or- Scimitar*<br/>\n04: Paladin(4): STR+1, (STR=19)<br/>\n05: Paladin(5)<br/>\n06: Paladin(6): Knockdown<br/>\n07: Paladin(7)<br/>\n08: Paladin(8): STR+1, (STR=20)<br/>\n09: Paladin(9): Blind Fight<br/>\n10: Paladin(10)<br/>\n11: Paladin(11)<br/>\n12: Paladin(12): STR+1, Improved Critical: Weapon, (STR=21)<br/>\n13: Paladin(13)<br/>\n14: Paladin(14)<br/>\n15: Paladin(15): Toughness (or, Great Fortitude)*<br/>\n16: Paladin(16): STR+1, (STR=22)<br/>\n17: Paladin(17)<br/>\n18: Paladin(18): Great Cleave<br/>\n19: Paladin(19)<br/>\n20: Paladin(20): STR+1, (STR=23)<br/>\n21: Paladin(21): Epic Weapon Focus: Weapon<br/>\n22: Paladin(22)<br/>\n23: Paladin(23): Overwhelming Critical: Weapon<br/>\n24: Paladin(24): STR+1, Great Strength I, (STR=25)<br/>\n25: Paladin(25)<br/>\n26: Paladin(26): Devastating Critical: Weapon<br/>\n<br/>\n27: Bard(1): Great Strength II, (STR=26), *Alignment Change* <strong>(Must be Non-Lawful by HERE).</strong><br/>\n28: Red Dragon Disciple(1): STR+1, (STR=27)<br/>\n29: Red Dragon Disciple(2): (STR=29)<br/>\n30: Red Dragon Disciple(3): Great Strength III, (STR=30)<br/>\n31: Red Dragon Disciple(4): (STR=32)<br/>\n32: Bard(2): STR+1, (STR=33)<br/>\n33: Red Dragon Disciple(5): Great Strength IV, (STR=34)<br/>\n34: Red Dragon Disciple(6)<br/>\n35: Red Dragon Disciple(7): (CON=14)<br/>\n36: Red Dragon Disciple(8): STR+1, Epic Prowess, (STR=35)<br/>\n37: Bard(3)<br/>\n38: Red Dragon Disciple(9): (INT=14)<br/>\n39: Red Dragon Disciple(10): Epic Fortitude Or, Improved Knockdown*, {Darkvision}, (STR=39), (CHA=10)<br/>\n40: Bard(4): STR+1, (STR=40)<br/>\n<br/>\nPvP Note: it is highly recommended you select Epic Fortitude instead of IKD; while the latter is really quite nice PvM/E (for downing huge things like Dragons, etc.), in the PvP game of dev.crit (fort save v insta-death) you will really prefer +4 to your Fort save (with option for more--i.e., Grt.Fort instead of toughness, and which if so becomes Fort 30, +1 Song: 31 (39 self-buffed) [45 vs. Spells]); the idea either way being that, with but a single item--remember: you've divine grace on top of that, too--you can pretty much dev.crit with impunity, also being immune to fear, fire, paralysis, with Paladin book giving immunity to death magic, mind-effects (protection), slow and entanglement (including movement speed decreases), too. Enjoy!<br/>\n<br/>\n**Uninterested in Dev.Crit and Prefer a Second Weapon Focus instead? <br/>\nIf for some reason uniterested in Dev.Crit and/or it's banned on your server and you prefer a second weapon focus instead, then take WF: Scimitar (medium sized, slashing weapon with the crit factor for chewing through enemies while enabling use of the Big Board/AC) and might I recommend for your second weapon focus that you pick up the Heavy Flail (large, 2-handed bludgeoning weapon with the 1.5 STR boni for the big \"crackdown\"), thus enabling the dishing of different physical damage types and in addition to the good Paladin book as well; this, by dropping cleave, great cleave for WF: heavy flail and IC: heavy flail, grabbing EWF: Heavy Flail instead of OC, and picking up Armor Skin instead of DC.<br/>\n---<br/>\n<br/>\n<strong>III Basics:</strong><br/>\na. Hitpoints: 488 (496 Aid)<br/>\n<br/>\nb. Saving Throws (Self-Buffed) [vs. Spells] <br/>\nFort: 28, +1 Song: 29 (37) [43] *Add +2 Fort if took Grt.Fort instead of Toughness (+2 Fort, -40HPs).<br/>\nWill: 18, +1 Song: 19 (27) [33]<br/>\nReflex: 15 (23) [29]<br/>\n<br/>\n [+4 Divine Grace (Aura/Eagle’s), +1 Prayer, +1 Resistance, +2 ProtectvAlignment]<br/>\n<br/>\nImmunities: Paladin (Fear, Disease), RDD (Fire, Paralysis, Sleep)<br/>\nOther: Paladin Book (Freedom, Death Ward, Protect v Alignment, Etc.), Healing.<br/>\n<br/>\n<br/>\n<strong>IV Combat Vitals:</strong><br/>\n<br/>\na. Devastating Critical (DC):  45, +1 Prayer, +2 Bull’s Strength: DC 48 <br/>\n<br/>\nb. Attack Bonus (AB):<br/>\n*Mundane Weapon: BAB: 30, AB: 49,+1 Song:  50 (Bio-Cap: AB 75, +6 Smite Evil: 81)<br/>\n*Self-Buffed AB: 65, +4 Smite Evil Bonus (Aura/Eagle’s)<br/>\n[+2 Bull’s Str, +5 Divine Favor, +1 Prayer, +1 Bless, +1 Aid, +5 Holy Sword (or  Greater Magic Weapon)]<br/>\n<br/>\nc. Damage—Comparative:<br/>\n*Mundane Greatsword: 2-12+22+2 Song, or: 2-12+24 (crit: 17-20/x2) <br/>\nSelf-Buffed: 2-12+38, +1d6 Divine v Evil, +2d6 Divine v Undead (crit: 17-20/x2) (15-20/x2 Keen), <br/>\n+26 Smite.<br/>\n<br/>\n*Mundane Scimitar: 1-6+15+2 Song, or: 1-6+17 (crit: 15-20/x2)<br/>\nSelf-Buffed: 1-6+30, +1d6 Divine v Evil, +2d6 Divine v Undead (crit: 15-20/x2) (12-20/x2 Keen), <br/>\n+26 Smite.<br/>\n<br/>\n[+2-3 Bull’s, +1 Prayer, +5 Divine Favor (Magic), +5 Holy Sword and +1d6 Divine v Evil (or +5 GMW), +2d6 Divine v Undead (Bless Weapon)]<br/>\n<br/>\n<strong>V Defense Vitals:</strong><br/>\nAC: 21, +8 Mundane Plate: 29, +1 Prayer, +2 ProtectvAlignment: 32 (+3 Mundane Tower Shield: 35)<br/>\n<br/>\n<strong>IV Spell Casting:</strong> Bard(0), Paladin(4); the Paladin book can be viewed here: <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Paladin\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Paladin</a><br/>\n<br/>\n<strong>VII Skillpoints:</strong> 182*<br/>\nDiscipline 43(58)(61 Bull’s, Prayer) , Heal 1(3), Listen 43(45), Lore 8(14), Perform 9(9), Spellcraft 28(30), Tumble 40(39), UMD 10(10)<br/>\n<br/>\nPrayer: +1 all skills / -1 all enemy skills.<br/>\n<br/>\n* Players should feel free to adjust their Commander to suit their own needs/environs, as always.<br/>\n<br/>\nEdit: remove typo(s); add option for second weapon focus in lieu of dev.crit for those preferring a second weapon focus instead of dev.crit and adjust title to reflect addition of Sorcerer Variant, which variant I finally got around to revising in light of the patch for those unable and/or uninterested in an alignment change, and which follows in the thread, below.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:09 PM - Oct 22, 2012",
      "content": "<div>Hail, Tyr.<br/>\n<br/>\nOne of my students has skipped classes, and she had 2 hours in a row, so now I am stuck here for 2 hours with nothing to do except surf the net. This is an AWESOME build, with otherworldly AB and good DC for Devcrit. That said, I need to ask you two things: <br/>\n<br/>\n1- How is changing alignments in the chaotic-lawful axl easier than good / evil? Is that a specific from where you used to play? In general, wherever I played, becoming less lawful was nothing short of impossible.<br/>\n<br/>\n2- Have you considered going for more CHA and less STR? By removing just 2 points from STR at start, you'd end up with 38 str, and 14 (16 after RDD bonus) CHA, which in turn, combined with Eagle's Splendor and Aura of Glory, and dropping Toughness, you could add either Divine Might or Divine Shield for more AC or Damage in certain situations. I would go for Divine Shield, you`d trade at least +6 AC, if you factor in gear, +9 for +1 AB and damage. I'm not considering the Smites, which would make this even better, just once a day. <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "9:55 PM - Oct 22, 2012",
      "content": "<div>Well come on over and have an ale, as I've the day off. <br/>\n<br/>\nGot Pally smiters on the mind, eh? (Yeah, happens to me, too ... LOL). That said, this ain't a Smiter, but a Dev.Critter with a high DC and everhthing speaks to that. Not some puny human, peh, but a Flying Ace--TOP DOG. No watering it down by removing STR for Charisma, no messing with the DC, AB, etc. as this be about pure air force devastating power: killing things fast, and chewing through mobs. Best defense is a strong offense always--and with a Dev.Crit DC 48 (self-buffed, 52 w. a +4 STR item), heh, wave \"bye bye\" to your enemies. You hit, you crit. They die. Simple. And with Drake Charged STR-based damage, and Pal damage buffs, different kinds, too, no worries chewing through the crit immune undeads either. The beauty of this build are the sheer synnergies here between Paladin and RDD. with the Cha (Aura/Glory) coming in on the saves---Fort 35 self-buffed (41 vs. Spells]) assuming EF, a so-called PG-Human warrior with a Paultry Dev.Crit 42 (44 with that same +4 Str. Item), well, xo what. A simple +5 ring alone takes you to 40 Fort (46 v. spells); not to mention PG/AB, Damage and IKD, eh?  Silly human; heh, oh wait, he's dead, no? HPs are important, too. Thing about Flying Aces/Figher Pilots you see they just don't fool around. Places to be, other missions to go on. Focussed! So don't be messing with the AB/damage and Dev.Crit DC set-up, eh? Quite simply, the dead don't strike back  ... So be a Flying Ace and go in for the kill, knock those  enemies down and out of the skies! Not in an evil way of course, defending the people after all ... (and very playable, too!  (Thanks, Max). <br/>\n<br/>\nAllignment Change:<br/>\n Did a write-up about Knights (Paladins) of Bahamut (Dragonborns, half-human, half-drake),basing a series around it NWN2/ECB2 actually (including a Divine Dragon, hmmm.. totally different character, and just might be making a debut here in the EXB1 soon. (This one be all about the AB/Damage set-up and of course PG/High DC Dev.crit and enjoying it with impugnity--you hit, foes die, you move on). Shouldn't \"need\" an alignment change, based on Bahamut (though the Bard as a Flying Ace, performing in the skies, etc. does make entire sense,not just build-wise but RP wise, too). Can't find it off hand but will look for it. Some interesting stuff. Anywho, Becoming LESS Lawful is EASY--you act law-LESS NOT EVIL. <br/>\n<br/>\nIn PvP dedicated worlds, it's super easy to change one's alignment (no problem at all). On RP-servers, you MUST usually act the part (only fair). Become chaotic, and act like a bard. Neglect your \"duties\" and choose dialogue options with NPCs carefully; get a reputation around town and other players. Do things a Paladin wouldn't do, but a bard would: get \"drunk\" at the local tavern, sing a song. Sleep in and don't be so quick to help the old lady find her missing pet or, if do, demand a reward. Think about the spirit of the early aviation pioneers, who did it because they thrived not only on adventure but also the very real sense of danger involved, with a \"hell be dam'd\" attitude about it, throwing caution to the wind (literally!). If the place is a stickler about it and won't allow for alignment changes where players are properly telling a story and carrying it out, then find antoher server as that's not proper RP at all. (Don't like the ones that expect Paladins to run around like zealots and blind fools either; being a slave to dogma is hardly justice, nor is playing judge, jury and executioner all at the same time either. Doesn't make for good builds, much less good RP'ing either in my view. I know some are sticklers, though: it's too bad and sorry to hear that. <br/>\n<br/>\nIf so, take a level of Sorcerer instead (as per the link to the originals, which sorcerer variant I will get to, promise). Myself,  love everything about the Paladin, the RDD and the Bard: and Bard fits the Wing Commander both build-wise AND RP wise best. Though Sorc of course works, too. <br/>\n<br/>\nSlash, Sing and CRIT (not Smite, that's Crit...on) ON!!! ~ Try</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "11:55 PM - Nov 30, 2012",
      "content": "<div><strong>WHAT FOLLOWS IS Wing Commander (the Aviator), Sorcerer Variant (Dev.Crit and Non.Dev.Crit included).</strong><br/>\n<br/>\n<strong>Author's Note</strong>: As promised, for those who want to play a Wing Commander (Renaissance Aviator) but are unable and/or uninterested in an alignment change, a socerer variant (revised in light of the patch) is now available for your playing pleasure, and which variant enjoys more skills (including Taunt) and slightly better saves in lieu of Bard song, Bard skills (i.e., Tumble), etc., albeit fewer HPs and AC (although options for more AC and HPs are included), with everything else--including sky high/PG AB/Damage, etc. and Dev.Crit DC 48!--fully in tact. What follows is the build:<br/>\n<br/>\n<strong>Wing Commander (Renaissance Aviator), Sorcerer Variant:<br/>\nPaladin(29), Red Dragon Disciple(10), Sorcerer(1)</strong><br/>\n<br/>\n<strong>I. Attributes:</strong><br/>\nSTR: 18 (40)<br/>\nDEX: 8<br/>\nCON: 10 (12)<br/>\nWIS: 14<br/>\nINT: 14 (16)<br/>\nCHA: 8 (10)<br/>\n<br/>\nHuman, Lawful Good<br/>\n<br/>\n<strong>II. Level Guide:</strong><br/>\n01: Paladin(1): Power Attack, Cleave**<br/>\n02: Paladin(2): {Smite Evil}<br/>\n03: Paladin(3): Weapon Focus: Scimitar OR Greatsword<br/>\n04: Paladin(4): STR+1, (STR=19)<br/>\n05: Paladin(5)<br/>\n06: Paladin(6): Knockdown<br/>\n07: Paladin(7)<br/>\n08: Paladin(8): STR+1, (STR=20)<br/>\n09: Paladin(9): Blind Fight<br/>\n10: Paladin(10)<br/>\n11: Paladin(11)<br/>\n12: Paladin(12): STR+1, Improved Critical: Weapon, (STR=21)<br/>\n13: Paladin(13)<br/>\n14: Paladin(14)<br/>\n15: Paladin(15): great fortitude (PvP), OR: (Your Choice PvM/E): Toughness or Expertise*<br/>\n16: Paladin(16): STR+1, (STR=22)<br/>\n17: Paladin(17)<br/>\n18: Paladin(18): Great Cleave**<br/>\n19: Paladin(19)<br/>\n20: Paladin(20): STR+1, (STR=23)<br/>\n21: Paladin(21): Epic Fortitude (PvP), OR (Your Choice PvM/E): Epic Reflexes or IKD*<br/>\n22: Paladin(22)<br/>\n23: Paladin(23): Overwhelming Critical: Weapon**<br/>\n24: Paladin(24): STR+1, Great Strength I, (STR=25)<br/>\n25: Paladin(25)<br/>\n26: Paladin(26): Devastating Critical: Weapon**<br/>\n27: Sorcerer(1): epic weapon focus: Weapon<br/>\n28: Red Dragon Disciple(1): STR+1, (STR=26)<br/>\n29: Red Dragon Disciple(2): (STR=28)<br/>\n30: Red Dragon Disciple(3): Epic Prowess<br/>\n31: Red Dragon Disciple(4): (STR=30)<br/>\n32: Red Dragon Disciple(5): STR+1, (STR=31)<br/>\n33: Red Dragon Disciple(6): Great Strength II, (STR=32)<br/>\n34: Red Dragon Disciple(7): (CON=12)<br/>\n35: Red Dragon Disciple(8)<br/>\n36: Red Dragon Disciple(9): STR+1, Great Strength III, (STR=34), (INT=16)<br/>\n37: Paladin(27)<br/>\n38: Paladin(28)<br/>\n39: Red Dragon Disciple(10): Great Strength IV, {Darkvision}, (STR=39), (CHA=10)<br/>\n40: Paladin(29): STR+1, Armor Skin, (STR=40)<br/>\n<blockquote><div>De<strong>v.Crit Alternative—NOTE:</strong><br/>\nIf you are not interested in Dev.Crit and/or it’s banned on your server, then feel free to adjust as follows: Drop Cleave, Grt.Cleave, OC and DC, and instead pick up: Expertise and Toughness, +40 HPs [458 (467 adjusted)], moving Epic Weapon Focus and Epic Prowess to where OC and DC currently are so as to pick up 2 more Grt.Str (+1 AB/Damage/Disc., or: Naked AB 50 / Self-Buffed: AB 65 +6 Taunt: 71, +4 smite bonus: 75 adjusted), and swap Epic Fort for either Epic Reflexes or IKD instead (i.e., more STR (AB/Damage, etc.), HPs and +4 Reflexes or IKD in lieu of Dev.Crit and -4 Fort, adjusted as no dev.crit). <br/>\n<br/>\n<strong>Prefer a Second Weapon Focus Instead? </strong><br/>\nAlternatively, if you prefer a second weapon focus, then take WF: scimitar (medium size, slashing weapon for its crit factor, chewing through foes quickly while enabling use of the big board/AC) and pick up Heavy Flail (large, 2-handed bludgeon weapon) enabling the delivery of different damage types (not to mention the quick take down by putting the heavy crackdown on so-called \"tough\" enemies such as the big boss or crit.immunes, whether Pale Masters or otherwise), adjusting as follows: take WF: Heavy Flail and Impr.Crit: Heavy Flail (instead of Cleave, Grt.Cleave), drop Grt.Fort for (your choice): Toughness, IKD or Expertise pre-epics, swapping Epic Fort for EWF: Heavy Flail, and move EWF: Scimitar, EP to where OC and DC currently are to pick up 2 GRT. Strength (AB/Damage); alternatively, instead of 2 more Str, since Commander already enjoys PG/Drake STR 40, why not pick up all three of i.e. Toughness, IKD and Expertise or otherwise as you prefer, since, at Naked AB 49 / Buffed AB 64, +6 Taunt: 70 (melee), +4 Smite Bonus, Commander also and already has sky-high PG AB/Damage as is. </div></blockquote>\nWe now return to our regularly scheduled program…<br/>\n<br/>\n-----<br/>\n<br/>\n<strong>III Basics:</strong><br/>\na. Hitpoints: 418 (427)<br/>\n<br/>\nb. Saving Throws (Self-Buffed) [v Spells]<br/>\nFort: 29 (37) [46]<br/>\nWill: 18 (26) [35]<br/>\nReflex: 15 (23) [32]<br/>\n<br/>\nSaving Throw bonuses: Spells: +9 (included in calculations)<br/>\nOther: Paladin Immunities, spells (fear, disease, mind-spells, death magic, paralysis, slow, entanglement, Etc.), Divine Grace (enhance with Charisma); RDD Immunities (Fire, Paralysis, Sleep).<br/>\n<br/>\n[+1 Resistance, +1 Prayer, +4 Divine Grace (Aura/Eagles), +2 Protection v Alignment]<br/>\n<br/>\n<strong>IV. Combat Vitals:</strong><br/>\na. Devastating Critical (DC): 45, +1 Prayer, +2 Bull’s Strength: DC 48<br/>\n<br/>\nb. Attack Bonus (AB)<br/>\nMundane Weapon: BAB: 30, AB: 49 (no buffs, no equipment)<br/>\nSelf-Buffed AB: 64, +6 Taunt: 70 (melee), +4 Smite Bonus: AB 74 (self-buffs only)<br/>\n<br/>\n[+2 Bull’s Str, +5 Divine Favor, +1 Prayer, +1 Bless, +1 Aid, +5 GMW (or Holy Sword), +4 Aura/Eagle’s]<br/>\n<br/>\nc. Damage (Comparative):<br/>\n*Mundane Scimitar: 1-6+15, +29 Smite (crit: 15-20/x2) (12-20/x2 keen)<br/>\nBuffed: 1-6+28, +1d6 Divine v Evil, +2d6 Divine v Undead, +29 Smite (crit: 15-20/x2) (12-20/x2 keen)<br/>\n<br/>\n*Mundane Greatsword: 2-12+22, +29 Smite (crit: 17-20/x2) <br/>\nBuffed: 2-12+36, +1d6 Divine v Evil, +2d6 Divine v Undead, +29 Smite (crit: 17-20/x2) (15-20/x2 Keen)<br/>\n<br/>\n[+2-3 Bull’s, +1 Prayer, +5 Divine Favor (Magic), +5 Holy Sword and +1d6 Divine v Evil (or +5 GMW), +2d6 Divine v Undead (Bless Weapon)]<br/>\n<br/>\n<strong>V. Defense Vitals:</strong><br/>\nAC (naked): 19, +8 mundane plate, +3 mundane Tower: 30, +1 Prayer, +2 Protectv Alignment: 33* <br/>\n*Expertise Note--add +5 AC if took Expertise, or: 38 AC (-5 ab when in Expertise Mode)<br/>\n<br/>\n<strong>VI. Spell Casting</strong>: Paladin(4), <br/>\nthe Good Paladin Book can be viewed here: <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Paladin\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Paladin</a> <br/>\n<br/>\n<strong>VII. Skillpoints:</strong> 219*<br/>\nTaunt Set: Concentration 43(44, +Prayer: 46), Discipline 43(58, +Bull’s, Prayer: 61), Lore 8(11), Spellcraft 42(45), Taunt 43(43, +Eagles/Aura, Prayer:  49), Tumble 20(19)<br/>\n<br/>\nDetection Set: Concentration 43(44, +Prayer: 46), Discipline 43(58, +Bull’s, Prayer: 61), Heal 1(3), Listen 42(44, +Prayer: 46), Lore 8(11), Spellcraft 42(45), Tumble 20(19)<br/>\n<br/>\nNote: Prayer adds +1 all-skills, -1 all enemy skills.<br/>\n<br/>\n*Players should feel free to adjust their Commander, Sorcerer Variant, to suit their own needs/preferences, as always.</div>"
    }
  ]
}