{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "027",
  "name": "Knockdown Specialist (level 20)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/knockdown-specialist-level-20-t2354777.html",
  "author": "LauraMVX",
  "avatar": "10758829_1511108032.png",
  "replies": "10",
  "views": "613",
  "posts": [
    {
      "author": "LauraMVX",
      "avatar": "10758829_1511108032.png",
      "timestamp": "1:48 PM - Nov 21, 2017",
      "content": "<div>While I like playing stealthy characters, so far I've only actually played non-rogues with stealth abilities - rangers, monks, and a trickery cleric - so I didn't know much about the main event, Sneak Attack damage. Reading around I was surprised to find out that a prone opponent is vulnerable to sneak attacks just like one who's not facing you, and wheels started turning... I wanted to try and make a front-line fighter who takes Improved Knockdown and some levels in Rogue or Assassin in order to maximize her knockdown damage, but doesn't bother with sneaking around. I wanted her to be strength-based and in full-plate, but I knew I wanted her to dual-wield so I could get as many sneak attacks in as possible when the bad guys are on the ground, so I decided to go with a double-weapon; I picked a Two-Bladed Sword for the increased crit range.<br/>\n<br/>\nThe build went through a ton of iteratons, which I imagine every build does (this is my first!) - it started off as a Blackguard, but I found myself spread too thin between the requisite 13 int, 15 dex and, unless I wanted to deal with penalties to my saves, 10 charisma; so I looked at Assassin next (I like playing bad guys!) and I knew Improved Invisibility was strong, so I wanted to work that in. I started wth some crazy concept where I took Ranger 11 and took 16 Wisdom(!) to get access to Blade Thirst and then 9 levels of Assassin; the Blade Thirst's +3 would offset the hit to strength, I reasoned, and I'd get access to some other spells like Cat's Grace. The trick was, here, that Blade Thirst applies to both sides of the Two-Bladed Sword, so I didn't need more than one cast. Anyway, it <em>worked</em>, but it didn't really <em>feel</em> right, like it was two different build concepts cut roughly in the middle and stitched together. Then I tried a Fighter 6/Monk 4/Assassin 10 (which took Monk levels exclusively for the saves), which worked okay, and I was about to post, but sat on for a few days. When I came back to it I was less keen; it couldn't take Improved Invis until level 18 or 19, and its teetering so close to Fighter 4/Monk 6 (getting Knockdown &amp; ImpKnockdown for free) that it felt like a waste; that split, however, loses too much BAB to make max attacks per round, which hurts the build concept - and with that many monk levels itd be much better to just use kamas and be a monk, which isn't really the character I had in mind.<br/>\n<br/>\nAnyway, that's when I started experimenting with taking Rogue levels instead of Assassin levels - while I lose ImpInvis, I get Crippling Strike, which seems like a great move for a front-line fighter, and I can get more levels, which means more sneak die. And, it lets me choose a non-evil alignment, which lead me to...<br/>\n<br/>\n<strong>Knockdown Specialist</strong>\n<details><summary>Spoiler</summary>Fighter 4 / Rogue 12 / Champion of Torm 4\n\nDex: 15\nInt: 13\nCha: 8\n01: Rogue(1) Ambidexterity, Luck of Heroes\n03: Fighter(2) Weapon Proficiency: Exotic, Knockdown\n05: Rogue(2)\n07: Rogue(3)\n09: Rogue(5) Blind Fight\n11: Rogue(7)\n13: Rogue(9)\n15: Champion of Torm(1) Improved Knockdown\n17: Champion of Torm(3)\n19: Rogue(11)\n\nSaves F/W/R: 16/10/18\nAC, naked/full plate: 16/23\nAB, unarmed: (melee) +23 (ranged) +19\nAB with Two-Bladed Sword: +22 / +22\nWith Two-Bladed Sword: 1-8 +8 / 1-8 +5 (crit 17-20 x2)\nSneak attack: 6d6\n\n182\nTumble(20)[22], UMD(21)[20], Discipline(19)[25], Spellcraft(9[10], Listen(21)[20], Search(19)[20], Taunt(11)[9], Spot(21)[20], Disable Trap(19)[20]\n(I haven't done the skill schedule yet because these skills are likely to change)</details>\n\nThe most similar build I could find on this site was magaiti's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/dwarven-combat-rogue-rogue-11-fighter-2-weapon-mas-t2354313.html\" rel=\"noreferrer\" target=\"_blank\">Dwarven Combat Rogue</a>, but it took Weapon Master and has a greater empasis on critical attacks, doesn't dual wield, and doesn't take Improved Knockdown, so I think its sufficiently different. It also has a will save of 4, which was one of the things I was trying to avoid with this build. I have a couple of major questions I'd like to ask that I think will bring me closer to optimizing...<br/>\n<br/>\n<strong>Human, or Dwarf?</strong><br/>\n<br/>\nThis build could take Dwarf instead of human without incurring an XP penalty, which would give her 20 more hit points, 1 more pip in fortitude, and some saves versus spells and poisons. This is how she started off, but I was worried about my Will save, so I switched to Human in order to take Luck of Heroes with the extra feat. I don't really know which is better: I'm thinking now the Dwarf's saves vs spells might offset the point in Will we'd lose anyway, although I'm starting to feel like I'm getting stuck in the 'narcissism of small differences' - what I'd really like to know is: how much should I value hit points and how much should I value will saves? Is 172 very low, hp-wise? Is 10 very low, will-wise? What should I prioritize for a meleer? And, if its a choice between Human and Dwarf and I dont need the feat, should I always pick Dwarf? (From an optimization standpoint - I probably shant play a dwarf either way, for as much as I do like dwarves, I dont like their character models in NWN :P but I'd like the build on paper to reflect the best choices, even if I never take them ingame.)<br/>\n<br/>\n<strong>Skills</strong><br/>\n<br/>\nI knew I wanted Tumble, UMD, Discipline, Listen and Spellcraft if I could afford it, but after that I was a bit lost. Search and Taunt are good, although I don't know if 10 points in taunt are worth anything. I guess Spot and Disable Trap are okay, but I mostly took them because I didn't know what else to take. I also didn't really know what to aim for with each of the stats - Tumble and Spellcraft go in increments of 5, as well as UMD's access to cross-class items, so I tried to do everything else in increments of 5, but I dont know if thats the right idea. I read WhiZard's thread 'Skills and Where to Stop', which is great, but they're all above 20! <br/>\n<br/>\nAnyway, sorry for all the questions! Thanks for reading.<br/>\n<br/>\nEdit: oh, and any other advice is appreciated! For example, if the two-bladed sword is really bad for some reason I'm not aware of and I'd just be better off with short swords &amp; saving a feat, etc...</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:26 PM - Nov 21, 2017",
      "content": "<div>The way you want to play this character is very similar to mine Laura, aggresively pushing your way forward and knockdown your opponents where they stand forcing them to be on their backside before they have a chance to react. There is also the most prudent way of casting UV + Darkness (from a wand/scroll) and then proceeding to sneak-attack all your opponents that are inside the black cloud. Your build is actually very good for your first try, and the Ftr/Rog/CoT combination is one of the best in the game. I would take Expertise earlier though as is much more useful early on. Your HP's are fine, as are your saves. The matter of weapon is one that one can change very easily anyway so it doesn't really matter what you have selected as long as there are the necessary feats to support it. Twin short-blades OR Kukri's would indeed let you take-upon a shield to better protect your character should you want it but other than that, these are minor details better left to each individual playing the build.</div>"
    },
    {
      "author": "LauraMVX",
      "avatar": "10758829_1511108032.png",
      "timestamp": "4:18 PM - Nov 21, 2017",
      "content": "<div>Ah yeah, the Royal Assassin right? That was one I was looking at when making this one - I think my first version which took assassin levels was pretty much identical, except she didn't bother with sneaking. I love that the assassin gets darkness as a spell-like ability, but yeah, I imagie UMD does the job; kind of subject to availability, though, I don't think I've encountered a wand of darkness when playing yet, but maybe playing a rogue would seed it in. <br/>\n<br/>\nI didnt find any Ftr/Rog/CoT builds at level 20 in the vault or on here, funnily enough; maybe some have been lost? or not as many people are building for level 20 as I expected :P It seems like a good mix, though. (I did find a Rog 14/Ftr 6, though, the Grim Ripper by Grimnir77, which dual-wields maces - a lot of fun - actually, Kail Pendragon suggested he make it a Rogue/Ftr/CoT in the replies)<br/>\n<br/>\nWhat would I swap Expertise with early on? The first 6 levels are pretty locked down if I want to take weapon specialization early on; I guess I could move the 4th fighter level to anywhere later and switch Expertise and Weapon Focus, and then WF and something else... Maybe something like:<br/>\n<details><summary>Spoiler</summary>01: Rogue(1) Ambidexterity, Luck of Heroes\n03: Fighter(2) Weapon Proficiency: Exotic, Knockdown\n05: Rogue(2)\n07: Rogue(4) \n09: Rogue(6) Blind Fight\n11: Rogue(8) \n13: Rogue(9 \n15: Champion of Torm(1) Improved Two-Weapon Fighting \n17: Champion of Torm(3)\n19: Rogue(11)</details>\n\nOr, with Shortswords instead of an exotic weapon:<br/>\n<details><summary>Spoiler</summary>01: Rogue(1) Ambidexterity, Luck of Heroes\n03: Fighter(2) Expertise, Knockdown\n05: Rogue(2)\n07: Rogue(3)\n09: Rogue(5) Blind Fight\n11: Rogue(7)\n13: Rogue(9)\n15: Champion of Torm(1) Toughness\n17: Champion of Torm(3)\n19: Rogue(11)</details>\n\nBut yeah, player's discretion I suppose. Thanks btw!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:00 PM - Nov 21, 2017",
      "content": "<div>Just a thought for you...<br/>\n<br/>\nWhile I understand why you'd want Knockdown, Ambi and 2W-Fighting early on, in purely AB terms, would it make more sense to get Weapon Focus before taking them? The danger is that you won't be able to hit anything so early on with the dual-wield penalties, let alone knock them down. Admittedly, it's more problematic with a two bladed weapon, because you're not carrying a shield to give you that early protection, but I'll leave it with you.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "LauraMVX",
      "avatar": "10758829_1511108032.png",
      "timestamp": "6:48 PM - Nov 21, 2017",
      "content": "<div>Hmmm, thats true; taking it before ambi/TWF works a little better with a conventional weapon, but it'd be easy to switch the level 3 knockdown with the level 6 focus; as you say, probably not knocking down much at level 3 anyway; that means I wouldn't have to delay weapon spec to level 6 to get it at the same time as weapon focus. Qua:<br/>\n<details><summary>Spoiler</summary>01: Rogue(1) Ambidexterity, Luck of Heroes\n03: Fighter(2) Weapon Proficiency: Exotic, Weapon Focus: Two-Bladed Sword\n05: Fighter(4) Weapon Specialization: Two-Bladed Sword\n07: Rogue(3)\n09: Rogue(5) Blind Fight\n11: Rogue(7)\n13: Rogue(9)\n15: Champion of Torm(1) Improved Knockdown\n17: Champion of Torm(3)\n19: Rogue(11)</details></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:23 PM - Nov 21, 2017",
      "content": "<div>I like the look of that.<br/>\n<br/>\nFor me, and this is a personal thing, having engaged in discussion with the sadly currently awol HipRedux, I'd be tempted to take Expertise at 12, shuffling Imp 2W-Fighting down to 18. I'm a two-weapon enthusiast, and it seemed counter-intuitive to delay the Improved feat, but I was swung by Hip's argument - I just wish I could remember where and what it was...I suspect it would either be in my Aielund Sword Champion or Arvoreen's Silent Sting build, both of which are dual-wielders (they're in the level 40 builds section).<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Have just checked, and the Imp2WF discussion is on the first page of the Aielund Sword Champion build, which is on the the second page of the Full Epic Builds section, if you're interested. Again, though, just a thought</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:50 AM - Nov 22, 2017",
      "content": "<div>This is a combat character right? He is meant to take out foes before they have a chance to react right? Then offence must come before defence with the sole exception of expertise. That one you take it on the 1st lvl. This is where you are the most vulnerable, many times not even having the means to buy a proper armour to defend yourself, the addition of 5 AC is godsend. If your build is blessed with many feats like this one, there is no reason to delay it. You should also change the weapon to twin short-blades, that way you can defend with a shield should the need arise. Finally, you should optimize your BAB (Base attack bonus) so that you have full-bab classes before you take many levels in 3/4 ones, such as Rogue. That way you will hit more reliably. Something like this, for example.<br/>\n<br/>\n01: Rogue(1) Expertise, Luck of Heroes<br/>\n02: Fighter(1) Weapon Focus: Short-Sword<br/>\n03: Fighter(2) Two-Weapon Fighting, Ambidexterity<br/>\n04: Fighter(3) STR+1, (STR=18)<br/>\n05: Fighter(4) Weapon Specialization: Short-Sword<br/>\n06: Rogue(2) Knockdown<br/>\n07: Rogue(3)<br/>\n08: Champion of Torm(1) STR+1, (STR=19)<br/>\n09: Champion of Torm(2) Blind Fight, Improved Knockdown<br/>\n10: Champion of Torm(3) <br/>\n11: Champion of Torm(4) Improved Critical: Short-Sword<br/>\n12: Rogue(4) STR+1, Improved Two-Weapon Fighting, (STR=20)<br/>\n13: Rogue(5)<br/>\n14: Rogue(6) <br/>\n15: Rogue(7) Iron Will <br/>\n16: Rogue(8) STR+1, (STR=21)<br/>\n17: Rogue(9)<br/>\n18: Rogue(10) Crippling Strike, Toughness*<br/>\n19: Rogue(11)<br/>\n20: Rogue(12) STR+1, (STR=22)<br/>\n<br/>\nThe only nick in his defence such a character might have is a late dump in Discipline which is easily solved with modifying a late Rogue lvl to a CoT/ Ftr one. You will lose no Sneak-attack Dice that way. You should do that preferably <span style=\"text-decoration:underline\">after</span> you attain Crippling Strike. Toughness is a wild-card, it can be anything from SF: Something, to Lightning Reflexes OR even Called Shot. But the addition of 20 HP's certainly won't hurt you.</div>"
    },
    {
      "author": "LauraMVX",
      "avatar": "10758829_1511108032.png",
      "timestamp": "11:16 AM - Nov 22, 2017",
      "content": "<div>@Stagmeister, ah thanks for pointing me there, definitely an interesitng discussion. I notice that he said that you should wait until you have 'a BAB of at least ten' before dual-wielding! If I want to dual-wield I always take it as early as possible, maybe I've been doing myself a disservice. In this rework, I've taken that approach to dual wielding.<br/>\n<br/>\n@Valerfor I had always thought that Expertise was useless early on and I was intentionally taking it as late as possible for that reason - I had thought you didn't have the AB to sacrifice at early levels. But I suppose its better to try and survive long enough to roll a 20 than to die to a horde of kobolds :P <br/>\n<br/>\nChampion of Torm has to be taken at level 9 at earliest here because of the lost BAB on level one, but I get the idea of taking the CoT levels earlier; you probably need the d10 hit die more at level 9 than at level 18, better to have your damage bloom late than your survivability etc. I had originally rushed to Crippling Strike after the fighter levels because I thought it'd have some defensive utility - reducing your opponenets strength means they're doing less damage, but delaying it for 3 levels seems okay. I feel like called shot might be overkill on top of crippling strike - how much less damage could they do with 3 strenght after a round of sneak-attacks? :P<br/>\n<br/>\nHere's the latest revision:<br/>\n<details><summary>Spoiler</summary>Rogue 12 / Fighter 4 / Champion of Torm 4\nPlayable PVM, 1-20\nStr: 17 (22)\nCon: 14\nInt: 13\n\n02: Fighter(1) Weapon Focus: Shortsword\n04: Fighter(3) STR+1, (STR=18)\n06: Rogue(2) Two Weapon Fighting\n08: Rogue(4) STR+1, (STR=19)\n10: Champion of Torm(2) Improved Critical\n12: Rogue(5) STR+1, Improved Knockdown, (STR=20)\n14: Rogue(7)\n16: Rogue(9) STR+1, (STR=21)\n18: Champion of Torm(4) Improved Two-Weapon Fighting, Toughness\n20: Rogue(12) STR+1, (STR=22)\nHP: 212\nSave bonuses: +2 reflex vs traps, +2 saves vs spells, +2 saves vs poisons\nBAB: +17\n\nDamage unarmed: +6\nAverage crit damage: 23\nAverage sneak attack damage: 21\nSkills\n\n</details>\n\nNot quite sure the right way to test her effectiveness atm, I've been using PGCC; she did well against four Fire Giants I generated in the arena, and defeated a Balor Lord quite handily after I gave her some magic weapons (+3s), but everything in the playground kicked her butt, wether she was dual wielding or using a shield or expertise or what. She didn't last two rounds! (This is with the +3s!) I don't really know what to do with that information, though... She didn't seem anywhere near as strong as the Bard/RDDs I had played around with, sneak attacks or no, but maybe thats a high bar to set :P</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:25 AM - Nov 24, 2017",
      "content": "<div>I completely disagree with taking the TWF feats so late but it's your build.<br/>\n<br/>\nAnd comparing pretty much anything to RDD's...That +4 to AC they get plus the Immunities could explain much of the outcome of your testings, although i feel it was just a matter of equipping your characters with what they should normally have at this level even in a modest magic environment. Then the gap closes significantly.<br/>\n<br/>\nOh, and i liked the reference to Berserk ;)</div>"
    },
    {
      "author": "LauraMVX",
      "avatar": "10758829_1511108032.png",
      "timestamp": "8:22 PM - Nov 24, 2017",
      "content": "<div>Well, now I dont know who to believe! The two are interchangable though, TWF/Ambidex can be taken at level three and Blind Fight/Knockdown pushed back to 6 and 9; ImpTWF and Iron Will can trade places, it could even take the place of ImpKnockdown... I'll probably choose an earlier TWF iteration when actually posting her, but will include a note about the tweak. Anyway, now to find a level 20 enviornment to play her in :P<br/>\n<br/>\nThanks so much for your help and advice, Valerfor and Stagmeister! Really appreciated!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:55 PM - Nov 24, 2017",
      "content": "<div><blockquote><div><cite>LauraMVX wrote:</cite>\nAnyway, now to find a level 20 enviornment to play her in :P\n</div></blockquote>\n\nI don't know if you've seen Aquarius' thread (L20 Spellsword) next to yours, Laura, but on the first page he lists several level 20 environments you might want to explore - and, clever soul that he is, he's even provided links to them.<br/>\n<br/>\nWherever you end up with the build, enjoy!</div>",
      "author-color": "#AA0000"
    }
  ]
}