{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "401",
  "name": "NEEDED: Level 28 Cleric (Amia)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/needed-level-28-cleric-amia-t2188586.html",
  "author": "Anatida",
  "avatar": "no_avatar.png",
  "replies": "9",
  "views": "2.2K",
  "posts": [
    {
      "author": "Anatida",
      "avatar": "no_avatar.png",
      "timestamp": "5:17 PM - Jan 09, 2012",
      "content": "<div>I made an original post here: <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/fast-as-possible-battle-priest-build-needed-till-lvl-30-t515497-10.html\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.44.forumer.com/fast- ... 97-10.html</a> But I've tried to include everything in this one, so you shouldn't need to refer to it.<br/>\n<br/>\nI play a female drow cleric of Lolth, that is the Matron Mother of a noble house of the drow city on Amia (for anyone that cares anything about the RP side). This is why I have certain limitations I have to work around. My current build is extremely weak, as I outlined in the above post. But since she is a faction leader, I will HAVE to get DM approval for a rebuild and it will HAVE to be RP appropriate. Now I can RP rationalize a great many things... so here goes <br/>\n<blockquote><div>\nWhy BG? And why in epic levels? It seems to offer nothing to the build. </div></blockquote>\nIn my previous build I actually took BG at level 11. I then abandoned the class because I realized I did not have the Cha modifiers to make it useful, and someone talked me into going epic cleric for the epic spells.\n<blockquote><div> <br/>\nWhat is your preferred weapon? Without fighter or a class that offers at least martial prof, your choices will be very limited. Warhammer is fine but the crit range is awful so we are back at PvP vs. PvM. </div></blockquote>\nI have no preferred weapon. I got stuck with the warhammer because I found one that gave bonus cleric slots, and then an underling went and found me one with good bonuses including Keen.\n<blockquote><div>\nWhy no fighter level pre-epic? You will need to be wasting a precious epic feat (clerics are feat-starved) on weapon specialization and could use that extra damage in early levels. </div></blockquote>\nOnly because I'm clueless \n<blockquote><div>\nPvP or PvM? No build can be MAXIMIZED for both, so choose one purpose and build for that. Otherwise, you will result in a compromised, all-purpose build that will never excel, never be a power build. </div></blockquote>\nPvP - While there is not a lot of PvP, Drow RP, and my char specifically, is all about political power. Most can be done by RP manuevering, but on the rare occasion that PvP is called for, I'd BETTER NOT FAIL!  \n<blockquote><div>\nIf PvP focus, what are your most principal adversaries' builds? Are there any PMs with at least 10 PM levels among them? </div></blockquote>\nPrimarily very high powered multi-class clerics. As far as I can tell, most use some kind of fighter/shifter/rogue/or bard mixture for skill dumps and added abilities. Of only slightly lower priority - Sneakers (Assassins, SDs). By PM I assume you mean Palemaster? No PMs are not a real threat as far as I know. <br/>\n<br/>\nThe following requirements and choices listed are based on server and RP requirements for this specific char/char type. I welcome any additional suggestions, as there might always be something I've overlooked.<br/>\n<br/>\nNOTES ON LEVELING PROGRESSION: Cleric is a prefered class for drow females and does not count toward XP penalties. To my knowledge xp penalties are applied per NWN default.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Requirements:</span></strong><br/>\n<strong>TOTAL LEVELS:</strong> 28<br/>\n<strong>CLASS:</strong> Cleric 17 capable of casting level 9 spells<br/>\n<strong>ALIGNMENT:</strong> CE, CN, NE<br/>\n<strong>RACE:</strong> Drow<br/>\n<strong>GENDER:</strong> Female<br/>\n<strong>RP PERSONALITY:</strong> Tempermental (she would prefer to just kill them and be done with it), easily angered (but getting better at controlling it), dark hearted, growing in the mental arts of manipulation and political manuevering because of the situation she is in. <br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Available choices</span></strong> <span style=\"color:#008000\">[Server Specific rules]</span> :<br/>\n<strong>DOMAINS:</strong> (my preferences Trickery (for improved invisibility), Drow (for GPB)) <br/>\n<span style=\"color:#008000\"><strong>Chaos -</strong> [Special Ability: Turn Outsiders]<br/>\n             [ Spells: 2 - Magic Circle against Alignment, 4 - Confusion, 6 - Word of Faith]</span><br/>\n<span style=\"color:#008000\"><strong>Drow</strong> - [Special Ability: Bonus Feat - Resist Poison]<br/>\n            [Spells: 2 - Clairaudience/Clairvoyance, 6 - Greater Dispel, 8 - Greater Planar Binding]</span><br/>\n<strong>Evil </strong>- Special Ability: Turn Outsiders - Able to turn outsiders as if they were undead<br/>\n        [Spells: 1 - Negative Energy Ray, 3 - Negative Energy Burst, 5 - Enervation, 8 - Energy Drain]<br/>\n<span style=\"color:#008000\"><strong>Darkness</strong> - [Special Ability: Shrouds of Shade - The cleric may cast a version of Darkness that lasts equal to 5 turns + the cleric's charisma modifier.]<br/>\n                 [Spells: 1 - Darkness, 8 - Mass Blindness/Deafness]</span><br/>\n<strong>Destruction</strong> - Special Ability: Able to damage constructs while using the turn ability. Constructs are not turned, but instead damaged 1d3 per Turn level, e.g. 1d3 to 40d3, to the limit of the hit dice turned.<br/>\n                    [Spells: 3 - Stinking Cloud, 6 - Acid Fog, <span style=\"color:#008000\">8 - Implosion</span>]<br/>\n<strong>Trickery</strong> - Special Ability: Bonus to hide, persuade, search, disable trap, move silently, open lock, and pick pocket checks equal to 1 + 1 per 2 cleric levels. This effect lasts for 5 turns + the cleric's charisma modifier<br/>\n               Spells: 2 - invisibility, 3 - invisibility sphere, - 5 improved invisibility <br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Additional classes I can make work RP wise:</span></strong><br/>\nFighter, Rogue, Weaponmaster (all per default NWN)<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong><span style=\"color:#008000\">ASSASSIN:</span></strong></span><br/>\n<strong>Braining Blow</strong>  - (Stun) (2 Rounds, Will)<br/>\nHead injuries are especially traumatic, and the Assassin knows this. Heavy, blunt force dealt by a pommel or leaden arrow can temporarily stun a foe, leaving them vulnerable to a follow-up strike.<br/>\n<br/>\n<strong>Shrill Strike</strong> - (Deafness) (Turn/Assassin, Fortitude)<br/>\nThe importance of the sense of hearing in combat is not lost on the Assassin. An attack upon the auditory organs leaves the ears of the Assassin's foe ringing painfully.<br/>\n<br/>\n<strong>Beshaba's Favor</strong> - (-d4 all stats) (supernatural permanent, doesn’t stack, Will)<br/>\nThe Assassin becomes adept at turning disadvantage to advantage, weakness into strength, bad luck into blessed fortune. Provided, that this misfortune falls upon the Assassin's victim.<br/>\n<br/>\n<strong>Stalker's Throat-Dart</strong> - (Silence) (1 Round/Assassin, Fortitude)<br/>\nLanding a blow to the throat is one of the most difficult attacks an Assassin can make. By no chance, it is also one of the most rewarding.<br/>\n<br/>\n<strong>Induce Amaurosis</strong> -  (Blindness) (1 Round/Assassin, Fortitude)<br/>\nThe Assassin knows that something as innocuous as a culinary spice can have more malign uses. Pepper, thrown into the eyes of the foe in the heat of battle, leaves them a bit burned.<br/>\n<br/>\n<strong>Blade of Terror</strong> - (Paralysis) (1 Round/Assassin, Will)<br/>\nThe appalling viciousness of the Assassin's assault cows the target into submission. The assassin may make a death-attack that causes overwhelming fear to the target of this ability.<br/>\n<br/>\n<strong>Bloodlet</strong> -  (Level Drain) (supernatural permanent stacks, Fortitude)<br/>\nThe Carotid and Femoral artery are prime targets for a cutting or piercing strike. An accurate slice can cause the most extreme case of profuse bleeding: untreated, such a strike is as good as a death-sentence.<br/>\n<br/>\n<strong>Kneecapper's Knife</strong> - (Knockdown) (Rounds/3 Assassin, Reflex)<br/>\nThe legs are a promising, if difficult to hit, target. They are often more lightly armored than the torso, as even the most rigid plate armor has many joints and thin parts in its metal.<br/>\n<br/>\n<strong>Murder</strong> -  (Death, Death Immunity ignored, Fortitude)<br/>\nThe most valuable and feared tool at the Assassin's disposal is not their famed agility or skill with blade or bow, but their knowledge of anatomy and flagrant disregard for the niceties of honorable combat. This attack leaves nothing about the Assassin's motives to question. A feint, a flash of steel from the shadows, or a careful shot: a strike made with the intent to bring their target down instantly, no matter the cost.<br/>\n<br/>\n<span style=\"color:#008000\">Optional Epic Feats: </span>These feats must be taken as epic bonus feats on Assassin (level 14 or 18 Assassin). They are not given freely as the feats listed below this section are.<br/>\n<br/>\nCrippling Strike<br/>\nAs per the default feat.<br/>\n<br/>\nNote: For this to function, the Assassin must have at least one rank of Sneak Attack.<br/>\n<br/>\nDefensive Roll<br/>\nAs per the default feat.<br/>\n<br/>\nImproved Evasion<br/>\nAs per the default feat.<br/>\n<br/>\n<span style=\"color:#008000\">Automatically-Given Feats:</span> These feats are gained automatically upon leveling and are usable once per day.<br/>\n<br/>\nTrue Strike<br/>\nStarting at 3rd level, an Assassin gains the ability to cast True Strike.<br/>\n<br/>\nFox's Cunning<br/>\nStarting at 4th level, an Assassin gains the ability to cast Fox's Cunning.<br/>\n<br/>\nCat's Grace<br/>\nStarting at 6th level, an Assassin gains the ability to cast Cat's Grace.<br/>\n<br/>\nClairaudience/Clairvoyance<br/>\nStarting at 8th level, an Assassin gains the ability to cast Clairaudience/Clairvoyance.<br/>\n<br/>\n<br/>\n<span style=\"color:#008000\">Spells:</span> You’ll need to learn the following spells from an NPC who’s hidden on the isle of Amia (if you meet the required Assassin levels and intelligence!):<br/>\n<br/>\nObscuring Mist <br/>\n2 Assassin levels, 11 Intelligence<br/>\nA misty vapor envelopes the assassin, granting 20% concealment for 1 turn per Assassin level.<br/>\n<br/>\nDarkness<br/>\n4 Assassin levels, 12 Intelligence <br/>\nAs per the default spell. <br/>\n<br/>\nInvisibility<br/>\n6 Assassin levels, 13 Intelligence<br/>\nAs per the default spell. <br/>\n<br/>\nImproved Invisibility <br/>\n8 Assassin levels, 14 Intelligence<br/>\nAs per the default spell. <br/>\n<br/>\nFreedom of Movement<br/>\n8 Assassin levels, 14 Intelligence<br/>\nAs per the default spell.<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong><span style=\"color:#008000\">BLACKGUARD:</span></strong></span><br/>\nBook of Vile Rituals<br/>\nAt Amia, the Blackguard may receive the Book of Vile Rituals which gives them an upgraded Epic Fiend summon. This is only given to those who show dedication and display excellent roleplay in their class.<br/>\n<br/>\n<span style=\"color:#008000\">Optional Feats:</span> These feats must be taken on a Blackguard level. They are not automatically given as the feats listed below this section are.<br/>\n<br/>\nExtra Turning<br/>\nAs per the default feat.<br/>\n<br/>\n<span style=\"color:#008000\">Automatically-Given Feats:</span> These feats are gained automatically upon leveling and are usable once per day.<br/>\n<br/>\nEagle's Splendor<br/>\nStarting at 4rd level, a Blackguard gains the ability to cast Eagle's Splendor.<br/>\n<br/>\nMagic Circle against Good<br/>\nStarting at 7th level, a Blackguard gains the ability to cast Magic Circle against Good.<br/>\n<br/>\nDivine Favor<br/>\nStarting at 10th level, a Blackguard gains the ability to cast Divine Favor.<br/>\n<br/>\n<span style=\"color:#008000\">Modified Feats:</span> These feats are modified from the default Blackguard.<br/>\n<br/>\nDark Blessing<br/>\nThe saving throw bonus is capped to Blackguard level (e.g. a level 3 Blackguard would only receive a maximum of +3 saves from Dark Blessing, no matter how high their Charisma modifier is).<br/>\n<br/>\n<span style=\"color:#008000\">Spells:</span> You’ll need to learn the following spells from an NPC who’s hidden on the isle of Amia (if you meet the required Blackguard levels and wisdom!):<br/>\n<br/>\nCorrupt Weapon <br/>\n1 Blackguard level, 11 Wisdom<br/>\nThe caster corrupts a melee weapon to strike true against good opponents, granting a +1 enhancement bonus and 2d6 negative energy damage vs. good for Turns/Level.<br/>\n<br/>\nDemon Flesh <br/>\n1 Blackguard level, 11 Wisdom<br/>\nThe caster grows the thick, leather flesh of a demon, granting a +1 natural armor bonus to Armor Class for every four caster levels (at least +1, maximum +4) for Turns/Level.<br/>\n<br/>\nAura of Despair <br/>\n3 Blackguard levels, n/a Wisdom<br/>\nThe blackguard radiates a malign aura that causes enemies within 10 feet to take a -2 penalty on all saving throws.<br/>\n<br/>\nVeil of Shadow <br/>\n3 Blackguard levels, 12 Wisdom<br/>\nSwirling wisps of darkness obscure the caster's form, granting a 20% concealment bonus for Turns/Level.<br/>\n<br/>\nDarkness <br/>\n5 Blackguard levels, 12 Wisdom<br/>\nAs per the default spell.<br/>\n<br/>\nDeeper Darkness <br/>\n6 Blackguard levels, 13 Wisdom<br/>\nAs per Darkness, but with a duration of Turns/Blackguard level. <br/>\n<br/>\nAbyssal Might <br/>\n7 Blackguard levels, 14 Wisdom<br/>\nThe caster summons evil energy from the Abyss and is imbued with its might. The caster gains a +2 enhancement bonus to Strength, Constitution, and Dexterity for Turns/Level.<br/>\n<br/>\nUnholy Sword <br/>\n8 Blackguard levels, 14 Wisdom<br/>\nThis spell transforms the caster's melee weapon into a powerful Unholy Avenger, a specially blessed weapon that, when wielded by a Blackguard, acts as a +5 unholy weapon that dispels on hit for Rounds/Level<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong><span style=\"color:#008000\">CHAMPION OF TORM [LOLTH]:</span></strong></span><br/>\nChampion of Torm are no longer considered followers of Torm on Amia. Instead, the class has been changed be more general as a Divine Champion. Along with having a free range of deity choices, they are able to be of any alignment, and to meet the prerequisites, any Weapon Focus feat may be taken; they are not restricted to melee weapons.<br/>\n<br/>\nIn addition, Divine Champions do not gain Smite Evil at level 3. In its place, they gain the Purge Infidel feat. Divine Champion levels do still stack for the damage of Smite Evil, even if they do not gain the feat anymore.<br/>\n<br/>\n<strong><span style=\"color:#008000\">Feats:</span></strong> These feats are new to the Divine Champion class.<br/>\n<br/>\nPurge Infidel<br/>\nGained at 3rd level, it gives the Divine Champion the ability to gain bonus damage equal to their class level, for the duration of their Charisma modifer. The bonus damage however, works only against creatures and people who have a different alignment than the purging Divine Champion. Against opponents with same alignment as the purger, the Purge Infidel ability does not work.<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong><span style=\"color:#008000\">SHADOWDANCER:</span></strong></span> ??might be an RP stretch??<br/>\n<br/>\n<span style=\"color:#008000\">Modified Feats:</span> These feats are modified from the default Shadowdancer.<br/>\n<br/>\n<strong>Hide in Plain Sight</strong> - This feat is gained at level 6, rather than level 1.<br/>\n<br/>\n<span style=\"color:#008000\"><strong>Shadow Jump:</strong></span> - In an effort to make the Shadowdancer PrC more appealing the following two supernatural abilities have been added to Shadowdancer’s repertoire:<br/>\n<br/>\nLesser Shadowjump: <br/>\nThis will enable you to teleport from shadow to shadow, four times per day. You must have at least 4 SD levels and received tutoring from a fellow Shadowdancer of level 10 or above. You may request the wand to use this ability from the DM’s after sufficient training with your tutor has been done.<br/>\n<br/>\nGreater Shadowjump: <br/>\nThis will enable you to teleport from shadow to shadow, ten times per day. You must have at least 10 SD levels and the wand to use this ability may be requested from the DM’s, at their discretion.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:56 PM - Jan 09, 2012",
      "content": "<div>That's a very concise description which must have taken some time to compile.  Good job.   <br/>\n<br/>\nNow there are a few more questions (believe it or not)...<br/>\n<br/>\nMost important: What are the starting stats of Drow?  Standard Elf is +2 DEX, -2 CON but I can't remember Drow.  IIRC it is similar.<br/>\n<br/>\nIs DevCrit available on Amia?  It may be tough to build a Drow battle cleric based on strength but if it is an option, worthy at least of consideration.  Except against PMs, a DevCritter is usually the best PvP power build.<br/>\n<br/>\nDoes alignment matter for your RP plan?  Lawful/chaotic or good/evil?  Have any alignment prereqs of classes been modified on Amia (other than CoT you explained)?</div>"
    },
    {
      "author": "Anatida",
      "avatar": "no_avatar.png",
      "timestamp": "6:00 PM - Jan 09, 2012",
      "content": "<div>I forgot these server specific changes:<br/>\n<br/>\n<span style=\"color:#008000\">Devastating Critical<br/>\nThis feat no longer instantly kills on a failed fortitude save. Instead, it knocks the opponent down for X rounds, along with inflicting Blind, Deafness and Silence for X turns. X is determined by the weapon's base critical hit range:<br/>\n<br/>\n• Large-sized weapon, 20 : 4 <br/>\n• Other sizes of weapons, 20 : 3<br/>\n• 19-20 : 2<br/>\n• 18-20 : 1<br/>\n<br/>\nNote that creatures using scimitars or rapiers smaller than medium size (e.g. gnome and halfling) receive the bonus for 19-20 weapons, rather than 18-20.<br/>\n<br/>\nDivine Might<br/>\nThe damage this feat gives is capped to the total amount of your cleric, paladin and blackguard levels added together (e.g. A level 4 Cleric/level 3 Monk with 20 Charisma will only receive +4 damage, rather than +5).<br/>\n<br/>\nDivine Shield<br/>\nThe AC this feat gives is capped to the total amount of your cleric, paladin and blackguard levels added together (e.g. A level 4 Cleric/level 3 Monk with 20 Charisma will only receive +4 AC, rather than +5).<br/>\n<br/>\nModified Weapons:<br/>\nThese weapons are modified from the default Bioware standard.<br/>\n<br/>\nTridents<br/>\nThey are treated as a simple, one-handed weapon with 1d8 base damage and 20/x2 critical range, ergo can be used with a shield.</span><br/>\n<br/>\n------------------------------------------------------------------------------------------------<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>Drow:</strong></span><br/>\nDrow tend toward Chaotic Evil.<br/>\n<br/>\nRacial Traits: Abilities: +2 Dexterity, -2 Constitution, +2 Intelligence, +2 Charisma; Spell Resistance = 11 + Class Level; Feat: Darkvision; Saving Throw Bonus: +2 Will Saves versus Spells and Spell-like Abilities; Spell-like Ability: Darkness; Light Sensitivity.<br/>\nFavored Class: Cleric (Female), Wizard (Male)<br/>\nRecognized Keywords: drow<br/>\nLevel Adjustment: +2<br/>\n--------------------------------------------------------------------------------------------------------<br/>\nAs I stated under Requirements above, the alignment restrictions for a cleric of lolth are:<br/>\n<strong>CE CN NE </strong><br/>\n<br/>\nI have not found any alignment requirements or restrictions beyond the NWN default.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:25 PM - Jan 09, 2012",
      "content": "<div><blockquote><div><strong>Anatida wrote:</strong><br/>\nAs I stated under Requirements above, the alignment restrictions for a cleric of lolth are:<br/>\n<strong>CE CN NE </strong></div></blockquote>\nDoh!  Missed those abbreviations *lol*<br/>\n<br/>\nThen I'd say DevCrit is out then.  Stunning can be accomplished in a manner of other ways.  Also, monk is ruled out (i.e. Lawful).<br/>\n<br/>\nI'm inclined to build a finessing DW kukri DP ftr/cleric possibly using assassin as a tertiary to insert some AC, the occasional DA and avoidance of XP penalty (otherwise rogue works).   Just off the top of my head, I'm thinking something like Cleric 15/ Ftr 10/ Assassin 3 (Clc 14/Ftr 4/Asn 2 pre-epic). I'll need to build this manually with the special Drow distribution so stay tuned.   It'll take a while to jump start my brain.</div>"
    },
    {
      "author": "Anatida",
      "avatar": "no_avatar.png",
      "timestamp": "7:38 PM - Jan 09, 2012",
      "content": "<div>Please remember there MUST be 17 cleric levels, or she cannot hold her current faction leader position</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:03 PM - Jan 09, 2012",
      "content": "<div><blockquote><div><strong>Anatida wrote:</strong>Please remember there MUST be 17 cleric levels, or she cannot hold her current faction leader position </div></blockquote>\nYeah, I realize that.  I automatically build toward max power foregoing RP considerations.  I'll let you decide whether the stature of a leadership position is worth an inferior build... so to that end, here are both...<br/>\n<br/>\n(Check the starting ability spread.  CBC has made me lazy so my math may be suspect.)<br/>\n<br/>\nAmia Battle cleric, v1<br/>\n<br/>\nCleric(15), Fighter(10), Assassin(3), Drow, any evil<br/>\n<br/>\nSTR: 8<br/>\nDEX: 18 (24)<br/>\nCON: 12<br/>\nWIS: 16 (18)<br/>\nINT: 14<br/>\nCHA: 10<br/>\n<br/>\n01: Cleric(1): Ambidexterity, Domains Trickery &amp; Drow<br/>\n02: Fighter(1): Weapon Finesse<br/>\n03: Cleric(2): Weapon Proficiency Exotic<br/>\n04: Fighter(2): DEX+1, Weapon Focus: Kukri, (DEX=19)<br/>\n05: Cleric(3)<br/>\n06: Fighter(3): Two-Weapon Fighting<br/>\n07: Cleric(4)<br/>\n08: Fighter(4): DEX+1, Weapon Specialization: Kukri, (DEX=20)<br/>\n09: Cleric(5): Extend Spell<br/>\n10: Cleric(6)<br/>\n11: Cleric(7)<br/>\n12: Cleric(8): WIS+1, Empower Spell, (WIS=17)<br/>\n13: Cleric(9)<br/>\n14: Assassin(1)<br/>\n15: Cleric(10): Improved Critical: Kukri<br/>\n16: Cleric(11): WIS+1, (WIS=18)<br/>\n17: Cleric(12)<br/>\n18: Cleric(13): Improved Two-Weapon Fighting<br/>\n19: Cleric(14)<br/>\n20: Assassin(2): DEX+1, {Uncanny Dodge I}, (DEX=21)<br/>\n21: Fighter(5): Epic Weapon Focus: Kukri<br/>\n22: Cleric(15)<br/>\n23: Fighter(6): Epic Weapon Specialization: Kukri<br/>\n24: Fighter(7): DEX+1, Blind Fight, (DEX=22)<br/>\n25: Fighter(8): Armor Skin<br/>\n26: Fighter(9)<br/>\n27: Assassin(3): Great Dexterity I, (DEX=23)<br/>\n28: Fighter(10): DEX+1, Epic Prowess, (DEX=24)<br/>\n<br/>\nHitpoints: 266<br/>\nSaves (F/W/R): 18/18/19 (23/23/24 vs. spells)<br/>\nOther save bonuses: Mind Effects: +2, Poison: +1<br/>\nBAB: 19<br/>\nAB (max, naked): 30 (melee) [AB cap: 50], 27 (ranged) <br/>\nAC (naked/mundane armor/shield only): 25/30<br/>\n<br/>\nHide 8(15), Move Silently 8(15), Spellcraft 23(25), Tumble 30(37), UMD 30(30), remaining 15<br/>\nNote: xclass to Hide &amp; Mov Sil for first 13 levels.<br/>\n<br/>\nComments:<br/>\n<br/>\nI would expect WoF at level 6, a no-save spell to be more useful than GPB. (re: Drow vs. Chaos domain)<br/>\nIn my experience, robes worked better than armor since this is a DW build.  DEX AC will cap at +13.<br/>\n<br/>\nAmia Battle cleric, v2 <br/>\n<br/>\nCleric(17), Fighter(8), Assassin(3), Drow, any evil<br/>\n<br/>\nSTR: 8<br/>\nDEX: 18 (24)<br/>\nCON: 12<br/>\nWIS: 16 (19)<br/>\nINT: 14<br/>\nCHA: 10<br/>\n<br/>\nLevels 1 thu Level 20 (same as v1, above)<br/>\n<br/>\n21: Fighter(5): Epic Weapon Focus: Kukri<br/>\n22: Cleric(15)<br/>\n23: Fighter(6): Epic Weapon Specialization: Kukri<br/>\n24: Fighter(7): WIS+1, Great Dexterity I, (DEX=22), (WIS=19)<br/>\n25: Fighter(8): Blind Fight<br/>\n26: Cleric(16)<br/>\n27: Assassin(3): Great Dexterity II, (DEX=23)<br/>\n28: Cleric(17): DEX+1, (DEX=24)<br/>\n<br/>\nHitpoints: 262<br/>\nSaves (F/W/R): 18/18/19 (24/24/25 vs. spells)<br/>\nOther save bonuses: Mind Effects: +2, Poison: +1<br/>\nBAB: 19<br/>\nAB (max, naked): 29 (melee) [AB cap: 49], 26 (ranged)<br/>\nAC (naked/mundane armor/shield only): 23/28<br/>\n<br/>\nHide 8(15), Move Silently 8(15), Spellcraft 28(30), Tumble 30(37), UMD 30(30), remaining 10<br/>\nNote: xclass to Hide &amp; Mov Sil for first 13 levels.<br/>\n<br/>\nComments:<br/>\n<br/>\nA less powerful build than v1. To gain level 9 spells and +1 saves vs. spells costs -1 AB , -2 AC and -4 HPs.<br/>\n<br/>\nFinal note:  I'll leave it to you to figure out the buffed specs since I usually confirm the math via combat testing log.  I'd expect AB to get to at least 40 or above pretty easily with full buffs in place for mundane kukris and with a 15-20 crit range, 12-20 with keen kukris.  I usually cast Extended DP first and then follow up with Empowered Bull's to get the highest damage but you may have your own casting strategy.</div>"
    },
    {
      "author": "Anatida",
      "avatar": "no_avatar.png",
      "timestamp": "8:42 PM - Jan 09, 2012",
      "content": "<div>Can't wait to go test it myself!<br/>\n<br/>\nTwo questions:<br/>\n1) Why Empowered spell instead of Maximize?<br/>\n2) Why do you need Bull's if you are using Weapon Finness?<br/>\n<br/>\nThanks</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "10:53 PM - Jan 09, 2012",
      "content": "<div><blockquote><div><strong>Anatida wrote:</strong><br/>\nTwo questions:<br/>\n1) Why Empowered spell instead of Maximize?\n</div></blockquote>\nI consider the buffing potential primarily. For offensive spells, Maximize can be more useful, mostly with arcanists.  But we are considering a melee buffer here rather than a caster.  <br/>\n<br/>\nEmpowered can boost abilities up by +7 (+3 or +4 modifier depending on odd/even pre-buff level.)  Maximize guarantees +5 (+2 or +3 modifier depending on odd/even pre-buff level).  Also, you don't need to wait as long to gain the benefits of Empowered versions which start showing up 2 caster levels before Maximized versions.  The last reason is:  my preference.   \n<blockquote><div>\n2) Why do you need Bull's if you are using Weapon Finness?\n</div></blockquote>\nDamage.  You'll still be deriving the physical damage from the STR modifier regardless.  So, since DP gives you 18 (+4) automatically, then Empowered Bull's another STR+7 (if lucky), your damage will end up being +7.  Especially for low-base value weapons like kukri (1-4), it almost triples the amount of damage possible per hit.  (In this respect, I am ignoring the magical, divine &amp; fire damage adjuncts which are characteristic of ALL cleric builds.)<br/>\n<br/>\nRemember:  Depending on boosts from items it can become EXTREMELY easy for clerics to reach the +12 ability cap.  So slot the empowered versions where the increase will be of most value, addressing either AB/AC or damage by Cat's or Bull's respectively.  In my experience it has been more useful to wear STR-boosting items for a pre-buff dexer since a dispel against the AB will have a less significant effect on the overall attack (AB &amp; AC will still be very good while damage will all but disappear).  <br/>\n<br/>\nYou may find it a bit easier to use a single kukri with shield in early going until you get enough DEX &amp; HPs to sustain attacks even with TWF feat selected.  However, once you've gotten buffs like Magic Vestment, Shield of Faith and Extended Divine Favor slotted, you should be able to drop that shield with no discernible added hardship.<br/>\n<br/>\nKeep us posted as to how the build fares under PvP conditions on your server and the kinds of PCs you are facing since it is so dependent on an individual's implementation to become successful.  And good luck to you!</div>"
    },
    {
      "author": "Anatida",
      "avatar": "no_avatar.png",
      "timestamp": "2:01 AM - Jan 10, 2012",
      "content": "<div>Awesome info. Thanks! It always amazes me how much I do NOT know. LOL</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "6:31 PM - Jun 14, 2013",
      "content": "<div>So I started playing on Amia some and was looking for builds and ran across this thread.  <br/>\n<br/>\nI wouldn't normally bump a 1.5 year old thread, but it was one of the first page of google searches for \"nwn amia build\"<br/>\n<br/>\nI'd like to point out that for cleric melee builds there are some spell changes:<br/>\n<br/>\nDivine Power - only adds AB, does NOT grant extra attacks anymore.<br/>\n<br/>\nDivine Favor - Spell progression has been changed to as follows:<br/>\n<br/>\n• CL 1 – 5 : +1 AB/damage<br/>\n• CL 6 – 10 : +2 AB/damage<br/>\n• CL 11 – 15 : +3 AB/damage<br/>\n• CL 16 – 20 : +4 AB/damage<br/>\n• CL 21+ : +5 AB/damage<br/>\n<br/>\nDarkfire - This spell has been changed to improve latency on the game server. The damage is no longer applied as an OnHit, rather a temporary damage power and is scaled according to your caster level (or CL) and applied to your weapon whence cast as follows:<br/>\n<br/>\n• CL 1 – 9 : 1d4 damage,<br/>\n• CL 10 – 14 : 1d6 damage,<br/>\n• CL 15 – 19 : 1d8 damage,<br/>\n• CL 20 – 24 : 1d10 damage,<br/>\n• CL 25+ : 1d12 damage.</div>"
    }
  ]
}