{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "272",
  "name": "Difference between pre-epic builds and epic etc",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/difference-between-pre-epic-builds-and-epic-etc-t2274151.html",
  "author": "JeyJey",
  "avatar": "10235244_1510287070.jpg",
  "replies": 7,
  "posts": [
    {
      "author": "JeyJey",
      "avatar": "no_avatar.png",
      "timestamp": "7:02 AM - Jul 21, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Greetings,<br/>\n<br/>\nI just played NWN campaign and some mods when it came out and few years later bought the expansions but didn't get to playing em properly. Right now I'm a bit confused about the difference in builds that is posted on this forum.<br/>\n<br/>\nI see pre-epic /mid epic / epic, do they only refer to the max lvl? Being 20/30/40. Or is it cause only pre epic will work on NWN OC and not epic character builds etc. What I am basicly asking is are there any restrictions or reasons not to follow a lvl 40 build instead of a lvl 20 build to finish the original campaign and keep the character to finish the other 2?<br/>\nand what are the legacy builds ?<br/>\n<br/>\nThx in advance<br/>\nNWN newbie J<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "AnotherSquarehead",
      "avatar": "no_avatar.png",
      "timestamp": "4:24 PM - Jul 21, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello, JeyJey; welcome aboard!<br/>\n<br/>\nBasically, you hit it with the maximum level associations. You could use any build anywhere, but a build made with level 40 in mind will certainly be missing much in an environment that only allows character progression to level 17, for example. Many builds are tweaked for maximum benefit in upper levels and consequently may not be great in lower levels, or might lack abilities central to the design concept at those lower levels.<br/>\n<br/>\nIn the official campaigns, most any build has a decent shot. BioWare didn't try to make it too important to build characters carefully, preferring to allow players to acquaint themselves with the game. As to continuing characters through multiple campaigns, just be aware that both the original campaign and Shadows of Undrentide were created for new characters. BioWare actually intended for the second character to go through Shadows and then through Hordes of the Underdark. Therefore, taking an OC character into SoU would be rather boring, with the character being vastly overpowered for SoU. As far as levels go, an OC character could be used for HotU (probably just being a couple of levels higher than BioWare expected), but there would be minor story inconsistencies in the second campaign (not any big deal, really).<br/>\n<br/>\nThe legacy builds were created in earlier days to highlight particulars of classes and to demonstrate combining classes for special purposes in epic building. Many were improved upon by the members of the ECB.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:36 PM - Jul 21, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'd like to agree with my friend anothersquarehead here but also add that it depends, really. Sometimes builds will take into account playability, and so be pretty strong and playable throughout, but normally that is not the case. What happens is that BAB builds up in the first 20 levels of the build, and then progresses constantly from then on. So you'll normally see builders delaying certain classes a bit in order to attain maximum possible AB. <br/>\n<br/>\nAs for the legacy builds, they're the first epic builds and also made in a previous version of the game. Nowadays, somethings have changed, so many of these are illegal in version 1.69. Dragon Shape used to require 14 levels of Druid, now it requires 18, and Epic Dodge requirements have also gone up, so now it can only be taken after lvl 27. So you'll commonly see builds that are made around those class features will be illegal by the new rules.<br/>\n<br/>\nTake it EZ, and welcome aboard!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "JeyJey",
      "avatar": "no_avatar.png",
      "timestamp": "8:22 PM - Jul 21, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thx for the swift replies seeing its an \"ancient\" game, they were very informative. I am pleasently suprised that there are still communities out there and I also perfectly understand why since I haven't seen another game out to date that brings the same DM capabilities. Also I am aware that the official campaign is easy and as most single players cookie cutter builds are not needed at all. But the builds are pretty much 50% of the game atleast and seems easier to understand the DD mechanics when I try them out with reasonings of the builder behind it to make future personal builds. I shall attempt one of the pre epic builds then to go through the OC and go from there.<br/>\n<br/>\nagain thx for the replies and welcomes.<br/>\nCu around<br/>\nJ<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:05 PM - Jul 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>JeyJey wrote:</strong>Thx for the swift replies seeing its an \"ancient\" game, they were very informative. I am pleasently suprised that there are still communities out there and I also perfectly understand why since I haven't seen another game out to date that brings the same DM capabilities. Also I am aware that the official campaign is easy and as most single players cookie cutter builds are not needed at all. But the builds are pretty much 50% of the game atleast and seems easier to understand the DD mechanics when I try them out with reasonings of the builder behind it to make future personal builds. I shall attempt one of the pre epic builds then to go through the OC and go from there.<br/>\n<br/>\nagain thx for the replies and welcomes.<br/>\nCu around<br/>\nJ</div></blockquote>\n\nWell it is an ancient game, but I have never seen such a marvelously complex game before or since this one. That's what keeps me interested. Nowadays, having done many SP campaigns and played on a few PWs, character building is what keeps the fire alive in me. Some players have more RP in them, but not me, I don't like pre-established answers when I RP. I don't like rules such as \"elves are curious\", \"dwarves are impolite\", etc.. I prefer to make characters and builds separately, I create a story for a character, then I powerbuild for him. That's what I usually do. Some people do RP choices whithin the builds (like, my paladin is a fair fighter so he doesn't have Knockdown), I don't like that. I like more complex stories than some corny interpretation of what a justice-oriented character needs to be like. Maybe these people don't realistically see these knights slicing through their enemies with fierce strikes and bathing in their blood as they extinguish the fire of life in them, and so think that knocking someone to the ground is bad, but chopping their arm off or sticking a blade up their stomach is perfectly acceptable. I'll never understand that, but regardless, I digress.<br/>\n<br/>\nAnother thing you might want to do is to check out the Game Guides forum of this guild. It will help you have a deeper understanding of what building is all about, and also understand why builders make certain choices. If you take the time to read these topics, I can assure you they'll be worth your while.<br/>\n<br/>\nFinally, about the campaigns, may I suggest that you skip the OC, as it's the most stupidly boring campaign you'll find out there, and to make matters worse, it's not at all challenging. May I suggest you play The Aielund Saga, as it's IMO THE BEST SP MODULE IN THE WHOLE NWN. It has a consistent and deep storyline, very cool henchmen characters, well-thought plots and subplots and it lacks one of the main defects of the OC. In the OC you're a \"hero\" at lvl 1, which is absurd in all accounts. At lvl 1 you are not and should NOT be a hero, you're a message boy, some poor helpless little critter-fighting adventurer who's just trying to scrape a living, and that's what the Aielund Saga paints you as. If you want details on how to download the module, take a look here:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/the-aielund-saga-t515487.html\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.44.forumer.com/the-a ... 15487.html</a>The download links are in the OP.<br/>\n<br/>\nNot only does the Aielund Saga have an INFINITELY BETTER storyline than the OC, but XP gain is relevant throughout the entire module, so you'll finish the campaign between lvls 31 and 33 (depending on quests and how many monsters you manage to kill) having started at 1, and the story takes you there, it's not like it's a repetitive story AT ALL!<br/>\n<br/>\nI hope you enjoy yourself!<br/>\n<br/>\nTake care.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "JeyJey",
      "avatar": "no_avatar.png",
      "timestamp": "4:24 PM - Jul 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I will most defenatly look into this =D thx again<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:58 AM - Jul 23, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I fully agree that the Aielund Saga is awesome, but I disagree with your opinion of the OC. It is an excellent introduction to the game for a new player. The fact that it is easy helps it fulfill that role.<br/>\nI also recomment SoU, then The Nether Scrolls as a bridge module, then HotU, and finally the Sand of Fate series. That sequence will bring your character from level 1 all the way to level 40.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:26 PM - Jul 23, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong>I fully agree that the Aielund Saga is awesome, but I disagree with your opinion of the OC. It is an excellent introduction to the game for a new player. The fact that it is easy helps it fulfill that role.<br/>\nI also recomment SoU, then The Nether Scrolls as a bridge module, then HotU, and finally the Sand of Fate series. That sequence will bring your character from level 1 all the way to level 40.</div></blockquote>\n\nSoU is infinitely better than the OC also, at lvl 1 you're an apprentice, which is great. And it is a bit more challenging than the OC. IDK what it is, but the OC really lost its value to me when I realized how weak the monsters that were supposed to be strong were. I remember thinking: Oh GOD, now I have to face Klauth, and they even give you a shortcut to get him down to near dead, but even without that, he's a WIMP on all accounts! The same happened to Aribeth, Maugrim, etc... Not to mention Aribeth casts SoV, which is BS! But, each to their own. I say that this suggested path of yours is much more challenging (even though HotU is another piece of cake and the final chapter resembles an old video game like Megaman, where you need to find a way to navigate between lamp posts with that little hand of yours).<br/>\n<br/>\nAnyway, IMO, don't do the OC, do the alternative path Empyre65 has suggested, JeyJey, as it'll be much more fulfilling.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}