{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "304",
  "name": "Unseen combo? Bard/Barbarian/Pale Master",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/unseen-combo-bard-barbarian-pale-master-t2352277.html",
  "author": "JimDandy",
  "avatar": "10235455_1510287071.png",
  "replies": "24",
  "views": "5.4K",
  "posts": [
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "9:26 PM - Apr 01, 2014",
      "content": "<div>Hello, all,<br/>\n<br/>\nI did a search on the full 40 forums and on the retired forums, and wasn't able to find any combination of these classes. Am I missing something obvious? I was thinking of Terrifying Rage, Immunity to Crit, and level 15 Bard song and level 5 spells: Bard 15, Barbarian 15, Pale Master 10.<br/>\n<br/>\nI'm playing around with it in the CBC28381.xls and finding it's a challenge to avoid XP penalties, getting a max Intimidate, timing the intimidate for Terrifying Rage, getting as high BAB as possible, and more. What are some suggestions from you epic designers!? Did I come up with something that's been already thrown out as a poor build?<br/>\n<br/>\nI'd love to see two versions of this, STR-based and DEX-based; the server I play on allows for Drow (+2 INT and +2 CHA, in addition to the +2 DEX and -2 CON). Additionally, the barbarian rage is customized to add temporary hitpoints and attack bonus, instead of boosting the abilities; this makes the rage appealing in a DEX build, is why I mention it.<br/>\n<br/>\nThanks, all. I'll update with what I come up with, soon. <br/>\n<br/>\n<br/>\n-JimDandy</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:21 AM - Apr 02, 2014",
      "content": "<div>You have some nice ideas and i like that. Not easy to discover fresh things after these many years and thousands of builds after all   <br/>\n<br/>\nBut you know why you have not seen any such builds? <br/>\n<br/>\nBecause they would not be good, not without any bonus epic feats at all, and trying to focus in three things at the same time. You would have to start with spread your abilities thin since you would need CHA too in your build.<br/>\n<br/>\nMuch better is to focus in two aspects in your build and use Bard only for the Tumble bonus and qualification for PM. There are one-two such builds that try to do that right in the ECB archives although none is optimal. One that strikes me as a good one though is this --&gt; <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build215642.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 15642.html</a><br/>\n<br/>\nOr if you want to try something slightly different but with 7th lvl spells try this --&gt; <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build205716.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 05716.html</a><br/>\n<br/>\n<br/>\nFinally, forget at all going DEX-based in such a build. You already gain tremendous amounts of AC by going with a full Tumble class claded in Plate armour and having PM bonusses, you would negate the only advantage you would have by not having Damage at all.. And even if you went DEX-based, you dont have Uncanny Dodge to protect you, neither Sneaks or any other method of doing real damage.<br/>\n<br/>\nRepeat after me, STR-based is the way to go in almost all builds until you hit a High magic world. There forget about STR at all cause the 10d12 damage properties (or more) of your weapons will take over your damage needs for good.</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "4:05 AM - Apr 02, 2014",
      "content": "<div>Thanks, I kinda knew something was up, and I didn't connect it with my own post (I was reading later on, about focusing on a couple of things, not a lot). I thank you for the links and advice. If you don't mind, I'd like a melee build recommendation for a drow, where the ability scores +'s in DEX, INT, and CHA make a difference so that the +2 level adjustment is worth it. Personally, I always had a thing for a barbarian drow (my RP character), but would love to hear your thoughts. I see you've been posting a lot of builds recently, so I bet your info is real fresh in mind <br/>\n<br/>\nThanks!<br/>\n<br/>\n<br/>\n-JimDandy</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:07 PM - Apr 02, 2014",
      "content": "<div>Bonuses to both DEX &amp; INT would make a fitting Assassin, other than that Wizards or Sorcerers are welcome too. Holy or (Unholy) builds can get some benefits from the added CHA there too. A (Bard/ BG/ RDD) would benefit from that for example but like i said at first, Assassins are where you will get the most out of it, DEX would advance your AB while INT would make your Death attacks harder to resist. Does this +2 lvl adjustment includes the famous Drow spell resistance too? Or is it only for the stat bonusses? Better include the spell resistance or else it is hardly worth it from a power-gaming point of view. <br/>\n<br/>\nBut if i were you, i would play my Barbarian and be proud for him, maybe here is the chance to make a proper \"Ryld Argith\", to do that trust on your stat enchancements and start with maximum strength. Something along the lines of STR 18 DEX 12 CON 12 INT 16 WIS 08 CHA 10 (Including the stat bonuses) and simply go cleave some heads from their shoulders, the difference would only be 1 AB anyway, nothing to prevent you from doing this if you have a strong character concept   <br/>\n<br/>\nAm i right that you want this for Arelith perhaps? This is the server i most frequently hear about Drows. Sadly Arelith will prevent you from getting the most out of a full STR Barbarian cause they disable Devastating Critical, but you can always terrorize those Priestesses with your Terrifying Rage! Just remember, a <strong>Fun Barbarian</strong> is always a <strong>full Strength</strong> one, just trust in your innate DR and don't stray from pumping that Strength of yours, higher and higher. With your enhanced Intelligence you can take all Barbarian skills too, so don't forget about Taunt &amp; Listen, because Drow continuous search ability goes well with the last &amp; Taunt can give you extra situational AB.</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "6:45 PM - Apr 02, 2014",
      "content": "<div>I love Ryld, I had always gone by one of the fantasy pictures (the moon one on google images of his name) and used that for the longest time for inspiration and in my signature. Thank you for adding that to the discussion!! I didn't even know his name, dude/dudette.<br/>\n<br/>\nGreat advice, I'll trust my barbarian build and the DR. Debating pure barbarian vs. bard 1-4/RDD 10 for tumble and more strength (opinion?). The spell resistance is there (the server is <a class=\"postlink\" href=\"http://www.dormaeglin.com\" rel=\"noreferrer\" target=\"_blank\">http://www.dormaeglin.com</a>, I've been a longtime fan and player of it, always come back to the great people there), and some Darkness and Faery Fire, too. Not sure how strong they are at higher levels, the documentation is not clear to me.<br/>\n<br/>\nAs far as Dev. Crit, it's also disabled where I play, but that's OK. I still like taking all the feats up to, and including, Overwhelming Critical, anyways!  I guess my remaining question becomes (the thread is derailed from the topic by this point, lol); how much does Listen help you when you have Blind Fight, and can you do without the BF feat with a superior Listen skill/Spot skill? Terrifying Rage is a must - I'll insist on ESF: Intimidate for it, too. Thanks for making me excited about my barbarian again; Cofaen Bah'Ruz will come back! I'd love to toss in IKD and ID, too - I'll have the INT for it, and a Two-hander; I am considering a Scythe for the weapon, but am open for any Two-hander. I might help the server get custom content so people can use Falchion and Maul, and get the weapon focus, weapon specialization, Weapon of Choice, etc. feats to go with them - that was my proudest achievement for making for my own PW project back in the hayday (it never really did see much light of day, due to perfection complex, hahah!)<br/>\n<br/>\nSweet discussion! I'm very happy from reading all of this! <br/>\n<br/>\nThanks,<br/>\n<br/>\n<br/>\n-JimDandy</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:00 PM - Apr 02, 2014",
      "content": "<div>He he, i love your excitement!<br/>\n<br/>\nIf you don't have problems with your Barbarian being multi-classed then you have two options to make him super powerful. Actually there are more but these two you will immediately understand why. First is Barbarian 28/ Bard 2/ RDD 10 and the second one is Barbarian 26/ Bard 4/ PM 10. Awesome fun both of these builds, although with the treatment pure Barbarians have in some servers actually going pure or almost pure with token lvls of FTR for EWS is also good. Lot's of options really! I can't make further recommendations till i learn more about the server rules regarding these prestige classes or Barbarians in general but these three options( Pure, RDD, PM) are guaranteed to work like a charm  <br/>\n<br/>\nAnd as far as weapons go, really it's up to the individual but as a general rule i always recommend a 2-hander for natural Strengths of 30 or more. And since we don't care about Devastating critical in that case, then i say if it crits, then you better feel the hit! So Greataxe/ Halberd or Scythe for me, nothing less!</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "7:25 PM - Apr 02, 2014",
      "content": "<div>Haha, sweet  I also came across this intriguing build on the old forums, that had neat things going for it. <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build256086.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 56086.html</a><br/>\n<br/>\nThe only changes to Barbarians on Dor is the Raging, as follows (and, lol, if you can make sense of the Damage Resistance formula, PLEASE enlighten me, hahaha):<br/>\narbarian Rage Previous bonuses to str and con replaced by:<br/>\n+1 ab and damage for each 2 str the rage previously gave.<br/>\n+1 temp hp per level for each 2 con the rage previously gave.<br/>\n+1 fort save for each 2 con the rage previously gave.<br/>\nand additionally:<br/>\nDR of 3/- +2((barb-1)/6)+2/3 of Epic DR feats DR.<br/>\nMovement increase of (barb lvl/4)* previous str increase/2 %.<br/>\nNo ac penalty.<br/>\nTaking the feat mighty rage changes all rage uses to the new bonus.<br/>\n<br/>\nThe barbarian I have in mind needs a ton of DR (the 3 epic ones), and Mighty rage (I think that has to be level 20 or 21). After that, I don't know how many levels I really need. Terrifying Rage is character level based, as I understand it, with the focus coming from the Intimidate skill, once you have the feat taken, at a Barbarian level in epics (I presume).<br/>\n<br/>\nI'll always go two-hander, even though the build I just linked is a tank. I like the crippling strike, skills, and sneak attack features. Not sure how they will end up measuring against a RDD or PM version (I am kinda reluctant to try the PM because of character concept, and tbh it's a stretch to go RDD, too - but this is all for fun *shrug*). What do you think would be the main differences? Between the 3 mentioned approaches so far? I have looked at a lot of other barbarian builds, and I'm not sure others appeal to me; other than pure barbarian where it's rather straight forward with awesome DR, HPs, and whatnot. FWIW, I'm doing a half-ogre Barbarian 28/ Bard 2/ RDD 10 now, because I wanted to see what it was like, with a greataxe, great cleave route, and additional +2 STR and +2 CON applied after character creation (-2 INT extra, too, IIRC). It is so much fun... and I'm just level 14 barbarian, not multi yet. Just love not dying!<br/>\n<br/>\nFYI: only the Shifter and Pale Master PRCs are changed (though feats of some classes are altered, too, but unrelated, I think):<br/>\nPale Master<br/>\nEvery other level from 1 to 10 and all levels over 10 count towards casterlevel of arcane spells, though only for purpose of duration and effect, not spellpenetration.<br/>\n<br/>\nThanks for your time</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:58 PM - Apr 02, 2014",
      "content": "<div>Those are some great rules man, it seems you are playing in a strong server where things like PM's have even get a boost. The inclusion of PM lvls for duration and caster lvl is nothing short of amazing!<br/>\n<br/>\nAs far as Barbarian Rage goes here is how it works, at least as i understand it. I will take as base a pure Barbarian with EDR 3 &amp; Mighty Rage.<br/>\n<br/>\nFrom your Mighty &amp; Terrifying Rage you will get the following:<br/>\n<br/>\n1)  +6 AB/ +6 dmg<br/>\n<br/>\n2)  +240 temporary hp's<br/>\n<br/>\n3)  +6 Fortitude save<br/>\n<br/>\n4)  No AC penalty at all<br/>\n<br/>\n5)  +30% Movement Speed<br/>\n<br/>\n6)   DR: 21/-<br/>\n<br/>\nAnd they leave you with 3 lvls of freedom that you can take something else without affecting these bonusses, as benefits stop at 37th Barbarian lvl. Of course you would loose The last Epic Barbarian bonus feat, but something like (Barbarian 37/ FTR 1/ ROG 2) would give you the above plus Heavy Armour for free plus UMD plus Evasion plus +4 AC from full tumble Ranks, and would take back your lost Epic feat from the FTR bonus one provided you take all these lvls at Epics.<br/>\n<br/>\nThe build you linked is also a good one, that's why i said there are many possibilities</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "8:04 PM - Apr 02, 2014",
      "content": "<div>OK, sweet - I would have thought that 1) would be +8 AB/ +8 dmg, though (I thought this came from Mighty, not Greater \"Taking the feat mighty rage changes all rage uses to the new bonus.\"). I think that means your rages are all Mighty Rages...?<br/>\n<br/>\nIn any case, totally psyched to play more! Building in a sheet a CBC sheet at work, right now. Hey, I'm waiting for the developers and for testing to get done, shut up <br/>\n<br/>\nThanks a lot for all this. I am edumucated now, and can make intelligument decisions!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:18 PM - Apr 02, 2014",
      "content": "<div>When i said Mighty-Terrifying Rage i also meant Greater too. I went with a pure Barbarian with EDR 3 and the Mighty Rage feat for my calculations. The DR won't go up more from lvl 37 and onwards. The formula is Barb lvl -1/6 so it's 6*6=36 lvls but you need 37 becase of the -1 there. You were partly right to think that would be +7/+7 (14/2) if those bonuses were stacking actually to their fullest but NwN engine limits them to the +12 ENCH Value so it is +6/+6. Except if your server takes the real values as its base , then its even more awesome and yes you do take +7/+7 and actually all the bonuses go up one notch, including the temporary hp's to 280 and Fortitude save at +7 more!<br/>\n<br/>\nHave fun!</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "8:23 PM - Apr 02, 2014",
      "content": "<div>Hehe, I'll watch out for that and come back to this thread  And I'll totally have fun!<br/>\n<br/>\n-JD</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:50 AM - Apr 03, 2014",
      "content": "<div>It was mentioned earlier in this thread that you would not have Uncanny Dodge, but Barbarians DO get Uncanny Dodge. Strength-based is still better, though.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "2:38 AM - Apr 03, 2014",
      "content": "<div>Valerfor, I saw you mentioned two builds that I would really like to see laid out for a Newb like me   The Barbarian 28/ Bard 2/ RDD 10 and the second one is Barbarian 26/ Bard 4/ PM 10. I would like to see all the rage I could get with SF/ESF: Intimidate. Dev. crit would be good but really don't need it. The server I play on has nerfed it so that it does double damage instead of death. I would like to PvP with these builds so a good AB and AC would be great. Now for another thought, I know you said you prefer Str. over Dex. but what about a raging Dex build with epic dodge??? Not sure if that would even work...but I am a Newb as I stated before. Thanks for you time.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:24 AM - Apr 03, 2014",
      "content": "<div>Among the requirements for Epic Dodge, you must have Defensive Roll (Rogue 10[or 13, 16, 19, 24, 28, 32, 36, or 40] or Shadow Dancer 5) and Improved Evasion (Monk 9, Rogue [numbers listed before], or SD 10). That would turn this into a whole other build.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:15 PM - Apr 03, 2014",
      "content": "<div>Be patient Camp, although these builds are already stored in my Vault, they are constantly evolved in order to get better and better, the final little improvements are those that are taking the most time</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "5:50 PM - Apr 03, 2014",
      "content": "<div>The tricky parts is, to me, when I have to make a decision to change something in a vanilla build I like, to conform to custom rules on the PW. But that's how I learned a lot, too. Now, tt makes it easier to recognize what I can ditch from a build and replace with what I like.<br/>\n<br/>\nThe build I posted about originally is really not what we're talking about anymore (topic name), so (personally, as the OP) I don't care what comes up. It's nice to chat and learn a few things from others' perspective. <br/>\n<br/>\n-JimDandy</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:48 PM - Apr 03, 2014",
      "content": "<div><blockquote><div><strong>JimDandy wrote:</strong>It's nice to chat and learn a few things from others' perspective</div></blockquote> <br/>\n<br/>\n+1</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "1:53 AM - Apr 04, 2014",
      "content": "<div>LOL, Np, Just eager    Yeah I figure the ED would be a total diff. build was just a thought I threw out there while I was typing.    Thinking and typing at the same time, my mind tends to wonder...my bad.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "1:58 AM - Apr 04, 2014",
      "content": "<div>I was PvPing last night and saw a Dragon shape with terrifying rage that stunned my toon... I did only have 33 will, but looked and saw that his DC was 47... *shakes head*</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:36 AM - Apr 04, 2014",
      "content": "<div>That DC is nothing before the DC's both \"DEAD-EYES BERSERKER\" &amp; \"THE DRAGON PROPHET\" can inflict to their opponents, better your foes look for a will save DC that exceeds 60 in game   <br/>\n<br/>\nAlso both of them are immune to paralysis...<br/>\n<br/>\n<br/>\nTHE DRAGON PROPHET =&gt; <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/the-dragon-prophet-barbarian-28-bard-2-rdd-10-t2352408.html\" rel=\"noreferrer\" target=\"_blank\">the-dragon-prophet-barbarian-28-bard-2-rdd-10-t2352408.html</a><br/>\n<br/>\nDEAD-EYES BERSERKER =&gt; <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/dead-eyes-berserker-barbarian-24-pm-12-bard-4-t2352387.html\" rel=\"noreferrer\" target=\"_blank\">dead-eyes-berserker-barbarian-24-pm-12-bard-4-t2352387.html</a><br/>\n<br/>\nHave fun!</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "8:16 AM - Apr 05, 2014",
      "content": "<div>Currently playing with a setup of Barbarian, Fighter, and Rogue. The saves from CoT aren't worth it for me, I like more feats (bonus fighter feat at level 1 FTR, and includes Heavy armor, so that's like 2 bonus feats, plus weapon spec, well... it's nice). Too many immunities available for mind resistance, tbh. Clarity potions, FTW!  It's a bit imbalanced, IMHO, but such are things <br/>\n<br/>\nWill start something in the CBC sheet around 10 or 13 levels rogue, max 10 level fighter (probably 4-6, honestly, with 4th in epic for weapon spec and epic weapon spec in the same level IIRC), and barbarian for all the levels in between. That might be as much as 26 barbarian levels. I want to get Crippling Strike, most of all, but kinda want it early so might go 13 levels rogue (which ends on 7d6 sneak attack, and 7x6 is 42 and we all know the meaning of life is 42... zomg, it's a sign!). OK, I'm tired and babbling. Mostly making notes out loud and seeing if there's anything I'm missing. Posting tonight or tomorrow.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:20 PM - Apr 05, 2014",
      "content": "<div>Certainly wait to see your combo Jim   <br/>\n<br/>\nBarbarians/ Fightrs/ Rogues, can combine some really neat features together and have also a good amount of skill points! A Barbarian 20/ Ftr 4/ Rogue 16 was the very first character i level to forty in WoG. STR-based of course, with Terrifying Rage, Crippling strike, EWS, Improved Evasion &amp; slippery mind, full plate &amp; 8d6 sneak attack plus UMD.</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "2:28 AM - Apr 06, 2014",
      "content": "<div>Ran into a hick-up... short of it is, I'm starting my own server, Alventyr, again. Will be some time to get it up and running, but I'm pysched about it. Hope to see more stuff in that House Rules thread, btw. I will be implementing the best from it.<br/>\n<br/>\nDo you have the build for that Barbarian 20/ Ftr 4/ Rogue 16?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:18 AM - Apr 07, 2014",
      "content": "<div>Unfortunately i don't anymore Jim, but i can make one for sure if you like. I have instead another build that focuses on Dmg Reduction with a Barbarian and has 14 Epic feats, but little Rogue, mainly for UMD, Evasion &amp; full Tumble. That Barbarian has close to 750 hp's and DR of 17. Different concept, you know. Would you be interested in this instead?</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "3:59 AM - Jul 20, 2014",
      "content": "<div>Sorry, I completely forgot to follow-up on this. Yea, I'd be interested in that build, for sure! :) Perhaps we can try to recreate the Barbarian 20/ Ftr 4/ Rogue 16 sometime, too. Anyway, bring it on!<br/>\n<br/>\n I decided to join a different server, btw, now with Devastating Critical, so I'll be looking to implement that into the build. Though, I gotta say there's a lot I like about your Lord of the Hunt without Dev. Crit. in it. I don't have time nor the energy to do my own server - that's just wishful thinking these days. I'd rather play, and have NWN in my life, than not at all by trying to do too much and failing.<br/>\n<br/>\n I'll put together another build tonight and post here in this thread, I don't think anything I make now will be unique enough for its own thread.<br/>\n<br/>\n<br/>\n -JimDandy<br/>\n  </div>"
    }
  ]
}