{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "483",
  "name": "To rogue or to assassin? (arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/to-rogue-or-to-assassin-arelith-t2186757.html",
  "author": "DeadZombie",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "1.7K",
  "posts": [
    {
      "author": "DeadZombie",
      "avatar": "no_avatar.png",
      "timestamp": "12:23 AM - Jan 03, 2012",
      "content": "<div>I played pvp servers pretty regularly and rogue was always the obvious choice over assassin. But since switching to more of an rp oriented server which would fair better with a level 30 cap and low magic items?<br/>\n<br/>\nRogue<br/>\nEpic dodge<br/>\nWill do more dmg via more sneaks.<br/>\nCrippling strike<br/>\nNo need for PRC token.<br/>\n<br/>\nAssassin<br/>\nPotential 1 hit finish with high death attack DC<br/>\nAssassin spells<br/>\nThe title of assassin</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:30 AM - Jan 03, 2012",
      "content": "<div>I would say rogue is most practical on any abbreviated server because DA DC will always be too low to be a reliable attack (too few assassin levels) and in PvP relies on INT boost to a great extent (tough to boost 2 abilities on low-magic).  BTW, DA paralyzes for X rounds.  It is not DevCrit so requires as many rounds as it takes to reduce the prone foe's HPs down to zero or expires though it can be spammed.  <br/>\n<br/>\nWith the possibility of dueling against crit/sneak-immunes (dunno whether PM is viable or nerfed on Arelith, though), sneaks/DAs can be problematic so a secondary class like cleric or ranger may be needed to assure damage.  I use Assassin mainly to either avoid XP penalty, with BG builds or just plain RP, but the trade-off can be expensive.  On the bright side, though, UMD potential is a wash.<br/>\n<br/>\nRogue<br/>\nNo skill prereqs<br/>\nHighest skill tally available (few x-classed)<br/>\nUber trapper/locksmith<br/>\nCan align as neutral (anti-smite)<br/>\n<br/>\nAssassin<br/>\nWithout a DEX class like monk or bard, will come in very late (level 14 or later)<br/>\nForced to either be sneaker or wasting prereq points<br/>\nBecomes a neon sign for smiters<br/>\n<br/>\nNaturally, this is a view of a non-Arelith specialist.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:39 AM - Jan 03, 2012",
      "content": "<div><blockquote><div><strong>DeadZombie wrote:</strong>I played pvp servers pretty regularly and rogue was always the obvious choice over assassin. But since switching to more of an rp oriented server which would fair better with a level 30 cap and low magic items?</div></blockquote>\nAre you looking for a pvp build, a pvm build or a \"rp oriented\" build?<br/>\n<br/>\nI thought exalted sorc clones still ruled pvp, especially so in low magic environments, and that they may be contested by quick SR monks and AAs and even SDs if TS is nerfed. But I admit that pvp in not my cup of tea.<br/>\nThe level of magic items, area set up and the specific monster spawns and bosses are important in defining what classes are strongest in pvm. Both rogue and assassin are good and versatile classes that have a lot to offer. If you find it difficult to choose between them, you could build with both, and get ED, CS, DA, unlimited trap handling, assn spells and a high SA damage.<br/>\nIf your main concern is rp, you don't need a build at all. All you need is an avatar that can act as what(ever) you want your rp to reflect.</div>",
      "author-color": "#AA0000"
    }
  ]
}