{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "160",
  "name": "Request BUILD Nwn1  | Fighter/Wizard",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/request-build-nwn1-fighter-wizard-t2354538.html",
  "author": "Loco",
  "avatar": "10577588_1510287072.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Loco",
      "avatar": "no_avatar.png",
      "timestamp": "3:10 PM - May 17, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi everyone!<br/>\n I had this idea, but i don't know how stupid is. I Play in a High Magic Server, RPG/Oriented. [Lvl Cap <strong>1-40</strong>]<br/>\n I'd like to play a Warrior Mage, call <strong>Enchants Swords</strong>.<br/>\n What do you think? Is Possible? I Like two weapon fight, two shortsword maybe. <br/>\n Can u help me with the Build? Is competitive in Pvp? I'm totally noob, sorry. <br/>\n<br/>\n Thanks to all who help me, nice forum and community very helpful. Sorry for my English.<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:25 PM - May 17, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome to the Guild, Loco! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n BTW, your English is fine.<br/>\n<br/>\n What you are looking for is called a \"spellsword\".  I suppose dual-wielding is better that S/S anyway because you need not invest into AutoStill (or any still spells) just for the shield's sake.  Wear robes and use your buffs to protect you.  Easy-peasy.<br/>\n<br/>\n I suggest you pay a visit to NeverwinterVault and get a copy of the legacy archive so suggestions will make more sense.  Full instructions have been written <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354480/How-and-Where-to-Access-Legacy-ECB-Archives\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#FF0000\">here</span></a></strong> and contains the linkage you will need.  All that is needed is a browser with Javascript enabled and you will be able to tap back into all the builds before the current ECB Guild was formed.  There are a few thousand listed. We have around 200 more complete builds within these haunts to add to the library.  If you have any problems finding builds at all, let us know.<br/>\n<br/>\n One build I noticed that may suit your interest is <em>Strav's</em> <strong>Arcane Blade of Torm</strong> (Fighter 6/Wizard 26/CoT 8).  It is set up for a 2-blade sword but can easily be adjusted for just about any sort of light weapons like your shorties.  You'll even free up at least one feat by virtue of not needing exotic proficiency.  Check it out to decide if it contains the aspects you desire.<br/>\n<br/>\n Spellswords are essentially a compromise between an all-out melee build and a high-level spellcaster so no, they tend not to be so good for PvP since both ends of the spectrum (WM and high-level mage) will dominate your toon rather easily and your spell penetration will suffer some.  This mix is used more for thematic reasons and is well-balanced rather than overpowering.  But the idea is to have fun with your own ideas so I say persue what you like and have a ball, eh?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Loco",
      "avatar": "no_avatar.png",
      "timestamp": "7:08 PM - May 19, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi <strong>HipRedux</strong>!<br/>\n Thank you for your fast reply! :)<br/>\n U know, i was looking for the archive with all builds, and not find him! :)<br/>\n Very grateful for the link. <br/>\n<strong>Arcane Blade of Torm </strong><span style=\"color:#000000\">nice build!<br/>\n If someone in the forum want to help out, I'd like to see if you can even build something else. <strong>Thank U!</strong> :)</span><br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:04 AM - May 20, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Loco wrote:</strong><hr/><strong>Arcane Blade of Torm </strong><span style=\"color:#000000\">nice build!<br/>\n If someone in the forum want to help out, I'd like to see if you can even build something else. </span><br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Exactly what do like and dislike about that build?  We'll need a clearer picture of what you have planned before we begin tossing out random ideas that may have little relevance and waste time.<br/>\n<br/>\n I think you should understand that high-magic worlds typically nerf most of the advantages of spellcasting classes.  Creature skins usually contain high Spell Resistance, high saves and immunities to spell schools or spell levels which makes all but the highest level spellcasters ineffective.  Just as one example, Greater Magic Weapon will be worthless because enhancements will be higher than +5.  Out of the 3 damage shields, usually there will be Damage Resistance versus acid and fire to neutralize them.  Perhaps only Death Armor will have some merit but since the amount of magical damage is relatively low it has limited advantage.  Tenser is also gimped because most creatures will either have DR on their skin or prebuff with Stoneskin or its ilk... i.e. Tensers's sword won't do damage.<br/>\n<br/>\n Have you talked to any of the server's members or DMs to see if spellcasters have much success there?  Spellswords seem to work well on mid- and lower magic realms quite well but struggle mightily as the enhancements become more exotic and elevated.<br/>\n<br/>\n To get a better idea of what sort of information is important when submitting a request, check <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515448/Build-request-guidelines\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#FF0000\">Kail's guidelines</span></a><span style=\"color:#FF0000\">. </span></strong> You've already provided some information.  All that is needed is to fill in the blanks.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}