{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "456",
  "name": "Combat+magic cleric (Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/combat-magic-cleric-arelith-t2279946.html",
  "author": "Hafen",
  "avatar": "no_avatar.png",
  "replies": 8,
  "posts": [
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "12:32 PM - Aug 13, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">So after time i feel times of my old cleric are gone, and i should start out new story, not weighted with past troubles chasing my old cleric along. <br/>\n<br/>\nMy original cleric was supposed to go both ways, fight and magic, but in time i found out hard to set it up. but with introducing gifts and return of subraces, I feel this is time to try it.<br/>\n<br/>\nSo for the begining, in test i took elf, drow subrace (+2 ECL, +2 char, +2 int, 11SR+lvl, darkness), +2 str, +2 wis gifts.<br/>\n<br/>\nI wanted to start with 12 dex (for the purpose of +1AC), this is perhaps bad move because i loose 2 str points, because i need 14 int (to get lots of skills).<br/>\n<br/>\nAfter all her/his (not sure if to go with male or female this time) stats counts (in brackets finall)<br/>\n<br/>\nSTR 14 (18)<br/>\nDEX 12<br/>\nCON 10<br/>\nINT 14<br/>\nWIS 20 (23)<br/>\nCHAR 10<br/>\n<br/>\nI want strong spells, so:<br/>\n<strong>spell </strong>focus evocation<br/>\n<strong>greater </strong>spell focus evocation<br/>\n<strong>epic </strong>spell focus evocation<br/>\n<br/>\nAlso, I wish to have second spell focus if possible to gain few additional cookies from it (i will list them in the end):<br/>\n<strong>spell</strong> focus X<br/>\n<strong>Gspe</strong> focus X<br/>\n<strong>Espe</strong> focus X<br/>\n<br/>\nBecause i want several fighter levels and rogue, it means lowering spell penetration. So feats are a must:<br/>\nspell penetration<br/>\ngreater spell penetration<br/>\n+ extended spell<br/>\n<br/>\nCombat feats:<br/>\nweapon foc<br/>\nepic weapon foc<br/>\narmor skin<br/>\nblind fight<br/>\n<br/>\nLevel progresion:<br/>\n1) extended<br/>\n3)spell foc<br/>\n6)greater foc<br/>\n9)spell foc<br/>\n12) greater spell foc<br/>\n15)spell penetration<br/>\n16) first fighter level - blind fight<br/>\n17)FR (2)weapon foc<br/>\n18)FR (3)greater spell penetration (can be taken with fighter!)<br/>\n19)FR (4) weapon specialization OR expertise <br/>\n20) cleric<br/>\n21) cleric epic spell foc<br/>\n22) cleric<br/>\n23)cleric <br/>\n24) bard -epic weapon foc OR epic spell foc, skill dumb into UMD to get 15 and tumble<br/>\n25) bard <br/>\n26) bard (3), now skills should be: 30 discipline, 30 spell craft, 15 umd, 30 tumble, 25+ concentration<br/>\n27) cleric spell focus or epic weapon spec<br/>\n28) cleric (21st)<br/>\n29) cleric <br/>\n30) cleric - hell ball, armor skin<br/>\n<br/>\nBase attack: 21<br/>\nAC in mundane/magic vestment: 30AC full plate + tower shield 40AC with vestments<br/>\n<br/>\n<br/>\nNow my questions:<br/>\n<strong>Is here some better way to distribute abilities?</strong> I can put +1/+1 abilities on every item beside weapon and helm (+3 deflection). So right now i count with +4 con, +7 str, +7 wis (total 30). <br/>\n<strong>Is here some way how to squeeze great ruin in and keep current feats? </strong>I was toying with it for almost hour and found out it requires \"epic cleric\" feat and also very high skill spellcraft.<br/>\n<strong>What should be the second spell focus feat?</strong><br/>\n<strong>What domains to take?</strong><br/>\n<br/>\n<strong>Special epic spells from spell focuses:</strong><br/>\nSpell Focus: Abjuration<br/>\n        Each Spell Focus in Abjuration grants a cumulative +2 to Dispelling Rolls,<br/>\n        With Spell Focus: Abjuration, the Shield spell protects against Isaac's Lesser Missile Storm as well as Magic Missile. With Greater Spell Focus, this protection extends also to Isaac's Greater Missile Storm.<br/>\n        With Epic Spell Focus: Abjuration, the -ward and -ward teleport Commands become available. The character may use one or the other of these, once per rest. -ward creates a large visible symbol on the floor, which lasts for a long time and inflicts brief paralysis on enemies who fail a Will Save upon passing over it. -ward teleport, while it lasts, prevents any PC from teleporting out of the area in question through any means, and prevents them from being -yoinked elsewhere whilst the remain in the area. It also prevents travel to any portals within the area. <br/>\n<br/>\nSpell Focus: Conjuration<br/>\n        Greater Spell Focus: Conjuration causes a caster to summon a creature one \"level\" higher than normal when using the Summon Creature I-VIII spells, in the same way as the bonus provided by the Cleric's Animal Domain. Note that Animal Domain and Greater Spell Focus: Conjuration do not stack in this respect.<br/>\n        Epic Spell Focus: Conjuration enables the -yoink command. Once per rest, a character may send -yoink as a tell to another PC, which will cause them to enter a dialogue telling them that your PC is attempting to summon them. If they accept, they are transported instantly to your location. <br/>\n<br/>\nSpell Focus: Divination<br/>\n        Spell Focus: Divination allows a character using the *looks* command to see whether a character is \"attuned\" to Life, Death, Fire, Water, Earth, or Air. This information is displayed even if the target is disguised. <br/>\n        With Epic Spell Focus: Divination, the -scry command becomes available. Once per rest, with the Clairaudience/Clairvoyance spell active, the character may send -scry as a tell to another PC (or type -scry [START OF TARGET'S NAME]). This permits the character to spy on their target for roughly one minute. It is possible to protect against this, but means of doing so are considered Find Out In Game information. <br/>\n<br/>\nSpell Focus: Evocation<br/>\n        Epic Spell Focus: Evocation drastically improves both Spell: Greater Ruin and Spell: Hellball, to several times their normal effectiveness. Without this focus, their power is equivalent to Vanilla NWN. <br/>\n<br/>\nSpell Focus: Necromancy<br/>\n        Greater Spell Focus: Necromancy turns Summoned Undead (from any Spell, Class Ability or Feat except Epic Spell: Mummy Dust) into Henchmen. Your character may therefore use such an ability twice (or two such abilities once), and have two undead at the same time. You may also have a normally summoned creature in addition to those two.<br/>\n        Epic Spell Focus: Necromancy means that all abilities which summon undead summon two, with one casting. <br/>\n<br/>\nTransmutation allows teleporting (which can be done with items), enchanting lowers price of items and ilusion allows to send copy of character to someone with message.<br/>\n<br/>\n<br/>\nMy idea is strong magic (DC on implosion about 39) combined with still effective combat, if target proved to be resistent to the spells with high saves. Spell breach wand followed with harm spell and finishing blow works quite well.<br/>\nUnlike last time, i play to put more focus upon role playing chaotic evil aligment, which means no helping to non drow, contrary, instead healing wounded random met kobold increase his wound...which is going to mean this character is hated, thus must be the most efficient to defend himself/herself.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:57 AM - Aug 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here are my suggestions. Somebody else will probably come along and offer better or more complete suggestions.<br/>\nDrop Bard from the build, making do without UMD and with only 15 points cross-trained into Tumble. The 3 additional levels of Cleric will make you a more powerful caster and will give you another Cleric bonus feat for Great Ruin.<br/>\nWait until level 27 to take the 4th level of Fighter for two reasons. You cannot take Epic Weapon Spec on a Cleric level, so this way you get Weapon Spec and Epic Weapon Spec at the same time. Also, this change would cost you the 4th attack, which you will get back with Divine Power at the same AB as your first attack, instead of -15.<br/>\nDivine power will raise your STR to 18, so only put one +1 into STR, and all 6 remaining +1s into WIS, ending with STR 15 and WIS 26. Either that, or put all 7 into WIS and use the Cleric 26 bonus feat for Great WIS to end with WIS 28. This will make you a more powerful caster.<br/>\n<br/>\nAnother idea would be to go pure Cleric. You would lose the Fighter feats, which would mean that in order to keep Blind Fight and Weapon Focus, you would have to lose the second line of Spell Focus feats, but then you would free another feat to take Empower Spell, but probably not until epic levels. This would also grant you yet another Cleric Bonus feat, so you could take both Greater Ruin and Great Wisdom.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "11:14 AM - Aug 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Greetings.<br/>\n<br/>\n<br/>\nThe only point of bard levels is tumble+umd.<br/>\n<br/>\n15 umd allows me to use timestop scrolls, and mainly, spell breach wands which allows me to strip negative energy protection from anyone and kill him with harm. Also it gives huge edge over other clerics who cannot use it or lack this wand.<br/>\n<br/>\nBut i see your point with fourth attack. I would definatly go 26-27 cleric +3 bard (for discipline and umd) evo-abju-necro focus but I am afraid what to do when someone survives my implosions and death spells?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:06 PM - Aug 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You could always be a DEX-based Cleric / Monk / Rogue, for example. Then you would have Wisdom to increase your AC, a better choice of weapons, 30% speed bonus, full Tumble and UMD, and could grab Zen Archery. You'd need to give up one of the SF lines, but that wouldn't matter much. This would also mean you'd be able to attack the targets when they approached you, which with Cleric buffs means death. Called shot would also be wise to slow your targets.<br/>\n<br/>\nCleric 24 Monk 3 Rogue 3 would do the trick, you'd be undispellable, lose the Cleric 27 Bonus Feat and get FULL UMD and Tumble.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "12:48 PM - Aug 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Not bad. It even caught my eye. <br/>\n<br/>\nBut i cannot as cleric pick up the main deity (lloth) with lawfull aligment. I am limited upon CN, NE, CE. So unfortunetly monk is not viable option for me. I could go with different god but I do not want to rp it and dm would lower my rp rating...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "FinneousPJ",
      "avatar": "no_avatar.png",
      "timestamp": "1:03 PM - Aug 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What's the point of taking 3 Bard levels in succession anyway?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:05 PM - Aug 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>FinneousPJ wrote:</strong>What's the point of taking 3 Bard levels in succession anyway?</div></blockquote>\n\nServer-specific limitation, it's a rule on Arelith.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:06 PM - Aug 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Hafen wrote:</strong>Not bad. It even caught my eye. <br/>\n<br/>\nBut i cannot as cleric pick up the main deity (lloth) with lawfull aligment. I am limited upon CN, NE, CE. So unfortunetly monk is not viable option for me. I could go with different god but I do not want to rp it and dm would lower my rp rating...</div></blockquote>\n\nOK, too bad, though, cuz Cleric / Monk is THE BEST COMBO in the game<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "10:40 PM - Aug 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have decided to slip into heavy magic based cleric 27/3 bard.<br/>\n15 UMD, 30 tumble, 30 discipline, 30 concentration, 33 (+2int mod) spellcraft.<br/>\n<br/>\nEpic spell foc:<br/>\nabjuration - paralizing circle, preventing area from scrying, preventing from teleporting<br/>\nevocation - for maximum DC on evo spells + improving great ruin hellball<br/>\n<br/>\nGreater spell foc:<br/>\nnecro - getting three summons at once (two undeads, elemental), improving death spells<br/>\n<br/>\nAlso craft wands. <br/>\n<br/>\n<br/>\nFull plate, tower shield, armor skin. 37 wisdom with gears  <br/>\n<br/>\nWhat would survive implosion, for it would be awaiting harm.<br/>\n<br/>\nThe only thing i need to figure out is to set abilities. 14 int is needed, 20 base wis required. I will keep str low and go for constituon instead, but i still have to be able to carry own wands, armour, shield and other cookies. <br/>\n<br/>\nHow to set these abilities points? In addition to usuall elf creation I can have: +2 char, +2 int from subrace, and two gifts +2 to other stats (not cumulative with each other, each costs +1 ecl beside con gift, which is whorth of +0.5 ecl).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}