{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "144",
  "name": "Lvl 20 unarmed build: 20 monk vs 16 monk/4 fighter",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/lvl-20-unarmed-build-20-monk-vs-16-monk-4-fighter-t2354566.html",
  "author": "samurainostalgique",
  "avatar": "no_avatar.png",
  "replies": "4",
  "views": "4.1K",
  "posts": [
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "2:52 AM - Jul 28, 2016",
      "content": "<div>I'm currently playing on a server where 20 is the max level. It's a medium magic world with +5 items, and it's possible to reach the +12 cap for attributes. A strength based monk can still achieve a pretty good AC in this server. What I'd like to ask you about is whether or not such an unarmed monk should stay pure, or multiclass into a fighter. The way I see it, after 16 lvl, the only worthwhile things you get from the monk class are empty body and perfect self. Perfect self is good, but its best effect, mind effects immunity, can be replicated with potions of clarity, which you can buy as much as you want of in this server. But on the other hand, perfect self has the advantage that it can't be dispelled or run out in the middle of a fight. That being said, not all ennemies use mind affecting effects. Empty body is also quite good, but it doesn't last that long. On the other hand, with 4 fighter levels, you get weapon specialization and one more attack per round and those are always useful. What do you think about it.</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:43 AM - Jul 28, 2016",
      "content": "<div>Greetings and salutations from the ECB community!  So glad you were able to make some time to visit us. <img class=\"img-emoji\" src=\"emoji/11.gif\"/><br/>\n<br/>\n Let's see.  These are some common break points when MCing with monk.  Naturally, they are cumulative.<br/>\n<br/>\n Monk 1: MC cheese dump for cleave, evasion, tumble and stealth skills, if applicable, and sometimes discipline dump in DEX build<br/>\n Monk 3: Speed and mind saves<br/>\n Monk 6:  KD/IKD  (this is probably the #1 most popular split next to the cheese dump)<br/>\n Monk 9:  ImpEvasion and combo with rogue or SD for Epic Dodge (not a factor in STR build)<br/>\n Monk 12: SR that is impossible to lower starts here along with another speed boost.<br/>\n<br/>\n The last one is real important for PvP, somewhat for PvM if the enemies are trying to breach your defenses.  Compare a toon who wears jewelry which endows SR 32.  A Dru 30 casts Nature's Balance which averages a -12 SR negation.  Result:  Toon now has SR 20 while the spell breach lasts.  The Monk 12 has Diamond Soul SR of 22 when encountering the same druid.  Result of encounter: Monk now has SR 22 after spell has been cast.  A monk 16 would have a permanent SR 26 that will even stand up to Mords.<br/>\n<br/>\n Personally, I find more value in Mnk/CoT than Mnk/Ftr in a pre-epic build since all you get is the +2 damage while the CoT affords +saves every other level and, for what it's worth, smite evil, though 1 less feat (though you could go Mnk/Ftr/CoT and get the both of all advantages).<br/>\n<br/>\n But I would go Mnk 12/CoT 8 for +4 saves and +1 BAB (or Mnk12/Ftr2/CoT6 or Mnk12/Ftr4/CoT4 with lower saves).  After Diamond Soul, monk goodies suffer from diminishing returns.  Each monk AC takes 6 levels of monk.  That's a pretty expensive way to accrue AC IMO. <br/>\n<br/>\n I hope this was what you were looking for.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:56 AM - Jul 28, 2016",
      "content": "<div>He wants to fight unarmed, so Monk 16 is needed for that d20 damage, and unarmed is not a weapon, so Weapon Focus: Unarmed Strike will not qualify for CoT. Also, Monk gets +1 AC every 5 levels, not 6.<br/>\n<br/>\n For unarmed, I'd go Monk 16 / Fighter 4.  Hip's advice is spot-on if you want to use kamas. In a low-magic environment, unarmed does more damage than dual kamas because of the d20 damage vs only d6 for kamas, but in a higher-magic environment, the dual kamas do more damage because of more attacks and the extra damage from the enhancements (+7 gloves just give +7 to attack, but no extra damage, while +7 kamas give +7 to both attack and damage). A +5 environment is right on the cusp, so you could go either way.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "10:58 AM - Jul 28, 2016",
      "content": "<div>Thanks for the answers! Indeed, I was going for at least 16 levels of monk for that 1d20 of unarmed damage. I chose unarmed mainly for aesthetics and roleplay reasons, but I think it should be on par with kamas in this world.</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:43 PM - Jul 28, 2016",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong><hr/>He wants to fight unarmed, so Monk 16 is needed for that d20 damage, and unarmed is not a weapon, so Weapon Focus: Unarmed Strike will not qualify for CoT. Also, Monk gets +1 AC every 5 levels, not 6.<br/>\n  </div></blockquote>\n<div align=\"left\">Doh!  That's right.  You need a sacrificial WF feat, probably WF: kama, to get CoT for an unarmed.  And thanks for correcting my bad counting, Empyre.  I think the basic cognitive functions are the first to erode, assuming they were there in the first place.<br/>\n<br/>\n @OP: So, seeing as how one of the goals of this question turns out to be highest damage, then, yes... Mnk 16/Ftr 4 matches the requirements better than Mnk 20.  Perfect Self is really only worthwhile in an extremely low magic environment without some means of protecting against fear aura and not even +1 weapon enhancements, which, as you have stated, is NOT the case.  And Empty Body is a 2x/day concealment that last for 2 turns with a Mnk20.<br/>\n<br/>\n BTW, samurainostalgique... when you get the opportunity, why not stop by and <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/forums/60564/Introductions\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#0000FF\">introduce</span></a></strong> yourself to us better?  Playing experience, hobbies, joys &amp; pet peaves... that sort of thing.  But be forewarned.  Henceforward, I will be referring to you as \"Sam\" because I can almost guarantee that I will butcher your ID whenever I try to type it. <img class=\"img-emoji\" src=\"emoji/7.gif\"/></div></div>"
    }
  ]
}