{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "019",
  "name": "Help with Arelith Halfling Rogue",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/help-with-arelith-halfling-rogue-t2354720.html",
  "author": "MaaterOfNotAlot",
  "avatar": "no_avatar.png",
  "replies": "22",
  "views": "2.1K",
  "posts": [
    {
      "author": "MaaterOfNotAlot",
      "avatar": "no_avatar.png",
      "timestamp": "10:56 AM - Jul 15, 2017",
      "content": "<div>Hey everyone!<br/>\n<br/>\n I'm looking to join up on the Arelith server. I played there a year ago, but stopped due to getting occupied with other things. I didnt even play long. I believe my character was level 7 or so.<br/>\n<br/>\n Anyway, I have always been horrible at building and preplanning builds for NWN. I just don't know where to begin when it comes to feats, skill allocation, when to level a certain class, etc.<br/>\n<br/>\n I know I want to play a Halfling Rogue, with a bit of Monk for APR and bonus AC. I'll stick with dual wielding kamas. Possibly Fighter as well, though I'm open to an alternate third class. Really I have no intention of range weapons.<br/>\n<br/>\n Playstyle would be your run of the mill Rogue: Opening locks, stealthing around, removing traps, setting traps to assist in combat(if its even viable, but I do like the idea of setting my own traps.) <br/>\n<br/>\n The problem is, I have been told Discipline is a must have skill. None of the builds I've found contain it, so I'm not sure how to go about including it into a build. <br/>\n<br/>\n I don't plan on using any of the server's subraces. I will however select the +2 DEX gift and possibly the +2 INT gift. <br/>\n<br/>\n Arelith caps at level 30. <br/>\n<br/>\n Classes must be taken 3 consecutive times before leveling into a new class. <br/>\n<br/>\n EXAMPLE: Rogue would need to be at level 3 before being able to level into Monk; Monk at level 3 before leveling back into Rogue, or another class.<br/>\n<br/>\n<br/>\n I'm just a newb when it comes to this. All of my googling and searching on builds has always brought me to these forums. So I figured, I'll come to the pros.<br/>\n<br/>\n Thanks!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:16 PM - Jul 15, 2017",
      "content": "<div>Hello there MaaterOfNotAlot - and welcome!<br/>\n<br/>\n I've a couple of thoughts, a couple of questions and a couple of observations, if you don't mind?<br/>\n<br/>\n So, if you're going for dual-wielding kamas, you'll need the 2-weapon fighting, ambidexterity and improved 2-weapon fighting feats (assuming you'll be trying for the maximum number of attacks per round - always helpful with a Dexterity-based build, which I'm assuming this is). The Fighter class would be useful in that regard because of the sheer volume of bonus feats it attracts. However, you could get them for free if you take 9 levels of Ranger (as long as you stay in robes or light armour, which I guess you'd be doing anyway, else you'd lose the Monk speed and AC among other things) so my first thought would be a Rogue/ Monk/ Ranger build with a minimum of either 10 levels of Rogue and 9 of Monk and Ranger: or 13 of Rogue, 6 of Monk and 9 of Ranger. Either of these will also enable you to get Epic Dodge - the Dexer's best friend. A third way, which would keep a lot of bonus feats and help with your saves would be the Champion of Torm prestige class, but I may be muddying the waters here.<br/>\n<br/>\n So, what do you think about the Rogue/ Monk/ Ranger concept? We can start getting into the practicalities once we've sorted that out.<br/>\n<br/>\n Oh, and does the taking of 3 consecutive levels in one class apply throughout the build, or just the first time you take the class?<br/>\n<br/>\n Good to have you on board!<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "MaaterOfNotAlot",
      "avatar": "no_avatar.png",
      "timestamp": "5:37 PM - Jul 15, 2017",
      "content": "<div>Thanks for the response.<br/>\n<br/>\n The leveling system is just for the first time you take that class, not throughout the entire build. <br/>\n<br/>\n The ranger build does seem interesting. I even looked into adding ranger to mix things up a bit. Id probably go for the second option.<br/>\n<br/>\n And yes, I would be staying in light armor.<br/>\n<br/>\n Thanks<br/>\n<br/>\n EDIT: I should also add, I will primarily be PvE, though I would like to remain viable in PvP if the situation were ever to occur.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:00 AM - Jul 16, 2017",
      "content": "<div>When you dual-wield, the off-hand weapon needs to be one size smaller than you are, or you will lose 2 AB. For most races, the kama qualifies because it is small and they are medium, but for a Halfling (or Gnome) the kama is the same size category as they are (small). Only a tiny off-hand weapon will avoid that penalty. Arelith has a lot of customizations, so maybe they changed that for kamas, like they did for katanas for medium-sized races.<br/>\n<br/>\n About 5 years ago, I made a build similar to what you want, but it is Human and has no Discipline. Perhaps it could be adapted for your needs.<br/>\nSpoiler [+]<br/>\n<br/>\n Arelith Kama Chameleon (Rogue 16 / Monk 6 / Fighter 8)<br/>\n Human, Any Lawful<br/>\n Playable 1 - 30<br/>\n Only legal on Arelith with gifts for DEX +2 and INT +2.<br/>\n<br/>\n Abilities:<br/>\n STR: 14<br/>\n DEX: 18 (26)<br/>\n CON: 12<br/>\n WIS: 10<br/>\n INT: 16<br/>\n CHA: 10<br/>\n<br/>\n Leveling Guide:<br/>\n Human: (Quick to Master)<br/>\n 01: Rogue(1): Blind Fight, Dodge<br/>\n 02: Rogue(2): {Evasion}<br/>\n 03: Rogue(3): Weapon Finesse, {Uncanny Dodge I}<br/>\n 04: Monk(1): DEX+1, {Cleave, Improved Unarmed Strike, Stunning Fist}, (DEX=19)<br/>\n 05: Monk(2): {Deflect Arrows}<br/>\n 06: Monk(3): Weapon Focus: Kama<br/>\n 07: Rogue(4)<br/>\n 08: Fighter(1): DEX+1, Mobility, (DEX=20)<br/>\n 09: Fighter(2): Two-Weapon Fighting, Ambidexterity<br/>\n 10: Fighter(3)<br/>\n 11: Fighter(4): Weapon Specialization: Kama<br/>\n 12: Rogue(5): DEX+1, Improved Two-Weapon Fighting, (DEX=21)<br/>\n 13: Rogue(6)<br/>\n 14: Rogue(7)<br/>\n 15: Rogue(8): Stealthy<br/>\n 16: Rogue(9): DEX+1, (DEX=22)<br/>\n 17: Rogue(10): Improved Evasion<br/>\n 18: Rogue(11): Improved Critical: Kama<br/>\n 19: Rogue(12)<br/>\n 20: Monk(4): DEX+1, (DEX=23)<br/>\n 21: Monk(5): Epic Weapon Focus: Kama<br/>\n 22: Rogue(13): Defensive Roll<br/>\n 23: Fighter(5)<br/>\n 24: Fighter(6): DEX+1, Great Dexterity I, Epic Weapon Specialization: Kama, (DEX=25)<br/>\n 25: Rogue(14)<br/>\n 26: Monk(6): {Knockdown, Improved Knockdown}<br/>\n 27: Rogue(15): Epic Dodge<br/>\n 28: Fighter(7): DEX+1, (DEX=26)<br/>\n 29: Fighter(8): Epic Prowess<br/>\n 30: Rogue(16): Armor Skin, Crippling Strike<br/>\n<br/>\n Stats:<br/>\n Hitpoints: 254<br/>\n Skillpoints: 324<br/>\n Saving Throws (Fortitude/Will/Reflex): 18/14/26<br/>\n Saving Throw bonuses: Mind Effects: +2, Traps: +3<br/>\n BAB: 21<br/>\n AB (max, naked): 33 (melee), 30 (ranged)<br/>\n AC (naked/mundane armor/shield only): 27/30<br/>\n Spell Casting: <br/>\n Alignment Changes: 0<br/>\n<br/>\n Skills:<br/>\n Disable Trap 32(37), Heal 20(20), Hide 33(43), Listen 33(33), Lore 19(22), Move Silently 33(43), Open Lock 33(41), Search 33(36), Set Trap 33(43), Tumble 30(38), UMD 25(25)<br/>\n<br/>\n 01: Disable Trap(4), Heal(4), Hide(4), Listen(4), Lore(4), Move Silently(4), Open Lock(4), Search(4), Set Trap(4), Tumble(4), UMD(4), Save(4)<br/>\n 02: Disable Trap(1), Heal(1), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Search(1), Set Trap(1), Tumble(1), UMD(1), Save(6)<br/>\n 03: Disable Trap(1), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Search(1), Set Trap(1), Tumble(1), Save(10)<br/>\n 04: Hide(1), Listen(1), Move Silently(1), Tumble(1), Save(14)<br/>\n 05: Hide(1), Listen(1), Move Silently(1), Tumble(1), Save(18)<br/>\n 06: Hide(1), Listen(1), Move Silently(1), Tumble(1), Save(22)<br/>\n 07: Disable Trap(4), Hide(1), Listen(1), Move Silently(1), Open Lock(4), Search(4), Set Trap(4), Tumble(1), UMD(5), Save(9)<br/>\n 08: Save(15)<br/>\n 09: Save(21)<br/>\n 10: Save(27)<br/>\n 11: Save(33)<br/>\n 12: Disable Trap(5), Hide(5), Listen(5), Move Silently(5), Open Lock(5), Search(5), Set Trap(5), Tumble(5), UMD(5)<br/>\n 13: Disable Trap(1), Heal(5), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Search(1), Set Trap(1)<br/>\n 14: Disable Trap(1), Heal(5), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Search(1), Set Trap(1)<br/>\n 15: Disable Trap(1), Heal(3), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Search(1), Set Trap(1), Tumble(2)<br/>\n 16: Disable Trap(1), Heal(1), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Search(1), Set Trap(1), Tumble(2), UMD(2)<br/>\n 17: Disable Trap(1), Heal(1), Hide(1), Listen(1), Move Silently(1), Open Lock(1), Search(1), Set Trap(1), Tumble(1), UMD(3)<br/>\n 18: Disable Trap(1), Hide(1), Listen(1), Lore(5), Move Silently(1), Open Lock(1), Search(1), Set Trap(1)<br/>\n 19: Disable Trap(1), Hide(1), Listen(1), Lore(2), Move Silently(1), Open Lock(1), Search(1), Set Trap(1), Tumble(2), UMD(1)<br/>\n 20: Hide(1), Listen(1), Move Silently(1), Tumble(1), Save(4)<br/>\n 21: Hide(1), Listen(1), Move Silently(1), Tumble(1), Save(8)<br/>\n 22: Disable Trap(3), Hide(1), Listen(1), Move Silently(1), Open Lock(3), Search(3), Set Trap(3), Tumble(1), UMD(4)<br/>\n 23: Lore(3), Save(3)<br/>\n 24: Save(9)<br/>\n 25: Disable Trap(3), Hide(3), Listen(3), Move Silently(3), Open Lock(3), Search(3), Set Trap(3)<br/>\n 26: Hide(1), Listen(1), Lore(1), Move Silently(1), Tumble(4)<br/>\n 27: Disable Trap(1), Hide(1), Listen(1), Lore(1), Move Silently(1), Open Lock(2), Search(2), Set Trap(2), Tumble(1)<br/>\n 28: Lore(3), Save(3)<br/>\n 29: Save(9)<br/>\n 30: Disable Trap(3), Hide(3), Listen(3), Move Silently(3), Open Lock(3), Search(3), Set Trap(3)</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "MaaterOfNotAlot",
      "avatar": "no_avatar.png",
      "timestamp": "6:32 AM - Jul 16, 2017",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong><hr/>When you dual-wield, the off-hand weapon needs to be one size smaller than you are, or you will lose 2 AB. For most races, the kama qualifies because it is small and they are medium, but for a Halfling (or Gnome) the kama is the same size category as they are (small). Only a tiny off-hand weapon will avoid that penalty. Arelith has a lot of customizations, so maybe they changed that for kamas, like they did for katanas for medium-sized races.<br/>\n<br/>\n About 5 years ago, I made a build similar to what you want, but it is Human and has no Discipline. Perhaps it could be adapted for your needs.<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">I do like this build, and honestly it was the build I came across initially, but being a complete newb at all of this building stuff, I had no idea how to accomodate for being a Halfling. I downloaded the Character Builder spreadsheet, but I really don't know how to level, as in, when should I level into a different class, what skills to take, how many points to save, etc. I know how to use the thing though lol<br/>\n<br/>\n I have no clue if Arelith has any changes regarding the off hand weapons and AB penalties. Would this build be suitable for an Elf? I'd be content with an Elf for the racial abilities and +2 to Dex(-2 Con hurts but could be made up for.) I wasn't looking for Halfling for any specific reason other than the +2 Dex and RP purposes, but an Elf would suit that as well.</div></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:40 AM - Jul 16, 2017",
      "content": "<div><blockquote><div><strong>MaaterOfNotAlot wrote:</strong><hr/><div align=\"left\">\n I have no clue if Arelith has any changes regarding the off hand weapons and AB penalties. Would this build be suitable for an Elf? I'd be content with an Elf for the racial abilities and +2 to Dex(-2 Con hurts but could be made up for.) I wasn't looking for Halfling for any specific reason other than the +2 Dex and RP purposes, but an Elf would suit that as well.</div>\n</div></blockquote>\n<div align=\"left\">Elf is viable, but you'd lose 1 feat (maybe Stealthy or Mobility?) and 33 skill points (maybe from Heal and Lore?). Your starting stats would also look different - perhaps dropping STR to 12 and WIS and CHA to 8? That would enable you to keep DEX at 18, INT at 16 and CON at 12.<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Sorry, you'll also get hit for an xp penalty - perhaps not as big a problem in PWs than in SP<br/>\n<br/>\n<strong><em>EDIT 2:</em></strong> I've just looked more closely at Empyre's build, and the starting stats include the gifts - whereas the ones I cite above would be before adding any gifts. Obviously, this gives you more scope! For example you could start with STR 14, DEX 16, CON 14, WIS 10, INT 14, CHA 8,then add +2 to DEX (and, INT should you wish, which might be good, as you're already losing 33 skill points)</div></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "MaaterOfNotAlot",
      "avatar": "no_avatar.png",
      "timestamp": "11:21 PM - Jul 16, 2017",
      "content": "<div>Thanks for the feedback. <br/>\n<br/>\n Stag, I do like the sound of Rogue, Ranger, Monk. Would be different. I do like Empyre's build too, but I think I'd like to run with your idea. Id probably go the 13 levels in rogue route.<br/>\n<br/>\n I could go either Halfling or Elf(wanting the +2 Dex, and will take the Dex gift for a total of +4.) I like the halfling more for the small stature, though elves do have their advantages. Whether or not I'll suffer an offhand penalty or not still isnt known though. Though I would like to be in groups the majority of my time, so if there is a penalty, hopefully it won't be a big deal.<br/>\n<br/>\n Skills that I'm after are Disable/Set Trap, Open Locks, Hiding, Move Silently, Tumble(for ED), Search, UMD, Discipline(since everyone advises it should be maxed), and perhaps listen(or spot) and heal.  Obviously its a lot of skills, so I dont know how doable it would be. Heal could be dropped in favor of potions if need be.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:09 PM - Jul 17, 2017",
      "content": "<div>Ah, thank you, but I suspect you're not going to like what comes next...<br/>\n<br/>\n I've been bouncing a few permutations around, and with only 30 levels to play with things all got a bit cramped, and in my best-case scenario either Monk 6 (Knockdown/ Improved Knockdown) came ridiculously late, or Ranger 9 did (Improved 2-Weapon Fighting), or Epic Dodge got delayed to level 30. So I looked at dropping Monk down to 3 levels. Then I realized I could get improvements by dropping both Monk and Ranger and replace them with CoT. Specifically, a halfling Rogue 16/ CoT 14 build.<br/>\n<br/>\n What CoT brings to the table (with 10 levels taken pre-epic) is enough bonus feats to cover the losses and bring more. Thus, rather than just the 7 general feats, you'd now have 5 more bonuses to play with, meaning you can take (in no particular order atm): Exotic Weapon Proficiency (so you can take kukris, for no AB penalty), Weapon Focus (in kukri, not surprisingly), Weapon Finesse, Ambidexterity, 2-weapon Fighting, Improved 2-weapon Fighting, Improved Critical (kukri), Blind Fighting, Knockdown, Improved Knockdown, Dodge and one other (maybe Toughness, Iron Will, Mobility or Stealthy). There's also a CoT bonus feat in epic levels, so you can get Epic Weapon Focus, Epic Dodge, Epic Prowess, Armor Skin and Great Dexterity 1. And, of course, with CoT you'll be getting a (much needed in some cases) boost of 7 to all your Saves.<br/>\n<br/>\n By only using the two classes, and going for 16 levels of Rogue, you can also get Crippling Strike as the Rogue bonus feat at that level.<br/>\n<br/>\n As for the skills, by my reckoning you'd have 279 to play with. That should be enough to max Tumble, Hide, Move Silently, UMD, Search, and either Spot or Listen. At the same time, there's still enough to get all you need in Disable and Set Trap, as well as Open Locks. After all that, you'll still have 24 points left. Now, there has been much debate over the years about whether Dex-based characters should bother with Discipline (there's a debate on that very subject in the General Discussions sub-forum here if you fancy a read). In this instance, I would be much more inclined to cross-class 12 points in Spellcraft (meaning, coincidentally, exactly the 24 points remaining) for a modified +3 save versus Spells.<br/>\n<br/>\n I think this would be an improvement, but it's your build, so over to you...<br/>\n<br/>\n Cheers<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Sorry, meant to mention, this was all based on starting stats (including taking gifts in Dex and Int) of STR 12, DEX 20, CON 14, WIS 10, INT 16, CHA 8, and finishing with 28 in DEX.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "MaaterOfNotAlot",
      "avatar": "no_avatar.png",
      "timestamp": "5:35 PM - Jul 17, 2017",
      "content": "<div>I actually might be interested in that. Monk was really only being taken for the additional AC and APR. Fighter for, I assume, the feats. As I said, Empyre's build was initially the one I was looking at before even posting here. But I'm no NWN pro by any means.<br/>\n<br/>\n After mulling it over, Discipline may not be overly required since my main objective is to provide DPS in groups. As long as the tank is doing their job, I shouldn't have to worry about special attacks much. Mainly I was looking at it for those nights when I'm forced to solo. <br/>\n<br/>\n If you don't mind, I'd like to see what you came up with as far as the progression goes. From the looks of it, it looks like it could suit me nicely.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:48 PM - Jul 17, 2017",
      "content": "<div>I don't mind at all! Be aware of a couple of things, though, if you would. First, I ain't no expert myself - still more player than builder, and only been doing that for 2 and a half years - so I hope the great and good will knock me into line should I stray too far. Second, I've never played in a PW, let alone Arelith, so some of this will be guesswork, and you should correct any mistakes I make, please. Third (yes, I lied about it being a couple), I construct with pencil and paper rather than the clever stuff others use, so there may well be some human error to take into account.<br/>\n<br/>\n With those warnings, this is where I'm currently at with the build. (Oh, and equally, I input everything directly onto this site - no cut and paste for me, so until/unless you approve of where we're going, this isn't going to look anything like as professional as, for example, Empyre's above build.) At the moment I have Rogue 1-10 then CoT 1-10 pre-epic, then R11, CoT11, R12, CoT12, R13, Cot 13, R14, R15, CoT14, R16.<br/>\n<br/>\n The order of the feats is WProf:Exotic (L1), WFinesse (L3), WFocus:kukri (L6), Blind Fight (L9), Knockdown and 2-weapon Fighting (L12), Ambidexterity (L14), Imp Crit:kukri (L15), Imp Knockdown (L16), Dodge and Iron Will (L18), Imp 2-weapon Fighting (L20). Then in epic: Epic WFocus:kukri (L21), Armor Skin (L24), Epic Dodge (L27), Epic Prowess (L29), and Great Dex I (L30). For the Rogue bonus feats, I'd have Imp Evasion at L10, Def Roll at L25, and Crippling Strike at L30.<br/>\n<br/>\n I haven't done a full skills schedule yet, but for the skills themselves I'd go for: Disable Trap 21 (26), Hide 33 (46), Move Silently 33 (44), Open Lock 30 (39), Search 30 (33), Set Trap 14 (25), Spellcraft 12 (15), Spot 33 (33), Tumble 30 (39), UMD 31 (30). There are reasons for this distribution (and, please gods, let my trapping stuff be accurate) that we can go into later if need be.<br/>\n<br/>\n By my reckoning, your Saves would be: Fort 25, Will 21, Ref 36 - +3 vs Spells, +2 vs Fear-type spells. Your naked AC would be 22, +1 dodge against current enemy (clothed stuff I can do later). And, with a BAB of 22, the AB is a max of 36/31/26/21: dual-wielding kukris - 34/29/24/18 - 34/29.<br/>\n<br/>\n So, is this an idea we can flesh out, or...<br/>\n<br/>\n Cheers <img class=\"img-emoji\" src=\"emoji/11.gif\"/><br/>\n<br/>\n<em><strong>EDIT:</strong></em> Again, I should have mentioned that the stats I used were those cited in my previous post, and that all stat increases go to Dex. Sorry.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:26 AM - Jul 18, 2017",
      "content": "<div>With that Rogue / CoT idea, if you replace those 14 CoT levels with 14 Fighter levels, you would get 2 more feats (Fighter 1 and Fighter 12), and those feats could be Weapon Spec and Epic Weapon Spec, for +6 damage.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:19 AM - Jul 18, 2017",
      "content": "<div>You're dead right Empyre. And it would make pre-epic levelling much more player-friendly.<br/>\n<br/>\n What I was looking at with CoT was i) the fairly rotten saves (other than Reflex, but particularly Will), and ii) that this was likely to be more of a combat support character, so I focused on stealth, sneak attacks (8d6 - sorry, didn't mention that before) and trapping in terms of combat impact. For party-play, with a tank up front and a caster behind, this should be a great flanker and mob controller, while also being able to keep enemy mages busy with resisting KDs and particularly sneaks while the party's own mage drills on them.<br/>\n<br/>\n Taking Fighter instead of CoT would, of course, also allow you to play evil, should you wish.<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:25 PM - Jul 19, 2017",
      "content": "<div>Why not get the best from two worlds and take both: Fighter4/CoT10 and get the extra feats from fighter and still some saves boost from CoT? With this spread you also get the  WS and EWS.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:50 PM - Jul 19, 2017",
      "content": "<div>Oh, cobblers. Mick don't say much these days, but when he does...<br/>\n<br/>\n Sorry, MaaterOfNotALot, lost sight of the wood, what with all these trees in the way. Right, I reckon I can have something halfway decent for you to look at tomorrow (real life will keep interrupting, the selfish swine), if that's ok?<br/>\n<br/>\n Cheers (and thanks, Mick. Actually, I wouldn't be surprised if Empyre wasn't hinting at this as well, but I'd gone into dumbass mode.)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:08 AM - Jul 20, 2017",
      "content": "<div>Nope, I derped, too. That will work fine because CoT can take Epic Weapon Spec, but not its prerequisite Weapon Spec.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:00 PM - Jul 22, 2017",
      "content": "<div>Hi, MaaterOfNotAlot. Haven't heard back from you, but on the assumption that you'd like to carry on, here's what I've come up with.<br/>\n<br/>\n Arelith Kukri Killer (Rogue 16 / Fighter 4 / CoT 10)<br/>\n Halfling, any non-evil<br/>\n Arelith levels 1-30 (with +2 DEX and +2 INT)<br/>\n<br/>\n STR 12<br/>\n DEX 20 (28)<br/>\n CON 14<br/>\n WIS 10<br/>\n INT 16<br/>\n CHA 8<br/>\n<br/>\n LEVELLING<br/>\n<br/>\n 1. Rogue 1: Weapon Proficiency: Exotic<br/>\n 2. Rogue 2<br/>\n 3. Rogue 3: Weapon Finesse<br/>\n 4. Fighter 1: DEX+1 (21) / Weapon Focus: Kukri<br/>\n 5. Fighter 2: Blind Fight<br/>\n 6. Fighter 3: Knockdown<br/>\n 7. Rogue 4<br/>\n 8. Fighter 4: DEX+1 (22) / Weapon Specialization: Kukri<br/>\n 9. Rogue 5: Dodge<br/>\n 10. Rogue 6<br/>\n 11. CoT 1<br/>\n 12. CoT 2: DEX+1 (23) / 2-Weapon Fighting / Ambidexterity<br/>\n 13. CoT 3<br/>\n 14. CoT 4: Improved Knockdown<br/>\n 15. Rogue 7: Improved Critical: Kukri<br/>\n 16. Rogue 8: DEX+1 (24)<br/>\n 17. Rogue 9<br/>\n 18. Rogue 10: Iron Will / Improved Evasion<br/>\n 19. CoT 5<br/>\n 20. CoT 6: DEX+1 (25) / Improved 2-Weapon Fighting<br/>\n 21. Rogue 11: Epic Weapon Focus: Kukri<br/>\n 22. CoT 7<br/>\n 23. CoT 8: Epic Weapon Specialization: Kukri<br/>\n 24. Rogue 12: DEX+1 (26) / Armor Skin<br/>\n 25. Rogue 13: Defensive Roll<br/>\n 26. CoT 9<br/>\n 27. Rogue 14: Epic Dodge<br/>\n 28. Rogue 15: DEX+1 (27)<br/>\n 29. CoT 10: Epic Prowess<br/>\n 30. Rogue 16: Great Dex I (DEX 28) / Crippling Strike<br/>\n<br/>\n STATISTICS<br/>\n<br/>\n Hit Points: 296<br/>\n AC: (naked / plate armour / + large shield) 28 / 26 / 28 (+1 Dodge)<br/>\n Saves: Fortitude 25, Will 22, Reflex 33 (+3 vs Spells, +2 vs Fear)<br/>\n BAB: 22<br/>\n AB: melee (max) - 36/31/26/21. Dual-wield (Kukri) - 34/29/24/19 - 34/29 (6 APR)<br/>\n AB: ranged - 33, 34 with thrown weapons<br/>\n Sneak Attack: 8d6<br/>\n Skill Points: 279. Disable Trap 21 (26), Hide 33 (46), Move Silently 33 (44), Open Lock 30 (39), Search 30 (33), Set Trap 14 (25), Spellcraft 12 (15), Spot 33 (33), Tumble 30 (39), UMD 31 (30)<br/>\n<br/>\n SKILLS SCHEDULE<br/>\n<br/>\n 1. D trap 4, Hide 4, M silent 4, O lock 4, Search 4, S trap 4, Spell 2, Spot 4, Tumble 4, UMD 4 (Save 4)<br/>\n 2. D trap 1, Hide 1, M silent 1, O lock 1, Search 1, S trap 1, Spot 1, Tumble 1, UMD 1 (Save 6)<br/>\n 3. D trap 1, Hide 1, M silent 1, O lock 1, Search 1, S trap 1, Spell 1, Spot 1, UMD 1 (Save 7)<br/>\n 4. (Save 12)<br/>\n 5. Spell 1 (Save 15)<br/>\n 6. (Save 20)<br/>\n 7. D trap 2, Hide 4, M silent 4, O lock 4, Search 4, S trap 2, Spell 1, Spot 4, Tumble 5<br/>\n 8. (Save 5)<br/>\n 9. Hide 2, M silent 2, O lock 1, Search 2, Spell 1, Spot 2, UMD 5<br/>\n 10. D trap 3, Hide 1, M silent 1, O lock 2, Search 1, S trap 2, Spot 1<br/>\n 11. Spell 1, Spot 1 (Save 2)<br/>\n 12. Spot 1 (Save 6)<br/>\n 13. Spell 1, Spot 1 (Save 8)<br/>\n 14. Spot 1 (Save 12)<br/>\n 15. Hide 5, M silent 5, Search 2, Spot 1, Tumble 5, UMD 5<br/>\n 16. Hide 1, M silent 1, O lock 3, Search 4, Spot 1 (Save 1)<br/>\n 17. Hide 1, M silent 1, Spell 2, Spot 1, Tumble 5<br/>\n 18. D trap 1, Hide 1, M silent 1, Search 1, S trap 1, Spot 1, UMD 5<br/>\n 19. Spell 1, Spot 1 (Save 2)<br/>\n 20. Spot 1 (Save 6)<br/>\n 21. D trap 2, Hide 3, M silent 3, O lock 4, Search 1, S trap 1, Spell 1, Spot 1<br/>\n 22. Spot 1 (Save 4)<br/>\n 23. Spot 1 (Save 8)<br/>\n 24. D trap 1, Hide 3, M silent 3, Search 1, Spot 1, Tumble 5, UMD 5<br/>\n 25. D trap 2, Hide 1, M silent 1, O lock 3, Search 1, S trap 2, Spot 1<br/>\n 26. Spot 1 (Save 4)<br/>\n 27. D trap 3, Hide 2, M silent 2, Search 2, Spot 1, Tumble 5<br/>\n 28. Hide 1, M silent 1, O lock 3, Spot 1, UMD 5<br/>\n 29. Spot 1 (Save 4)<br/>\n 30. Hide 2, M silent 2, O lock 5, Search 5, Spot 1<br/>\n<br/>\n How does it look? Hope I haven't made any glaring errors (or even non-glaring ones)<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "cilginat",
      "avatar": "10758838_1513291018.jpg",
      "timestamp": "6:48 PM - Dec 21, 2017",
      "content": "<div>Cool build :D Personally I'd drop spot for discipline, and take ESC: Discipline as well by pushing CoT 6 to level 21 and taking improved 2 weapon fighting instead of iron will. Also as far as I know rouges can't take exotic weapons at level one.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:48 PM - Dec 21, 2017",
      "content": "<div>Thank you! You're right about exotic weapons, so I'd now put Dodge in at L1, keep WFinesse at 3, move exotic to 4, WFocus at 5, Blind Fight at 6 and KD at 9.<br/>\n<br/>\nI'm not sure how Discipline would help here (and as a traditional STR meleer it's my go-to skill), as the build is a stealthy bugger and a bit more of a support player - flanking and trapping - thus less likely to be the target of knockdowns and taunts. The Iron Will is predominantly taken because the thing a meleer is most likely to succumb to is a will save, so I always try to mitigate that if I can. Spot was taken so other sneaky bastards could be found and dealt with while scouting, thus taking some pressure off the tank.<br/>\n<br/>\nBut hey, you can tweak as you like!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Thorsson",
      "avatar": "10758835_1513245773.jpg",
      "timestamp": "8:38 PM - Dec 21, 2017",
      "content": "<div>I'd agree with you SM normally; however, on Arelith Discipline appears to be very highly rated (Taunt is countered by Concentration), so I'm guessing that there is a reason. Also Will Saves don't appear popular so I'm guessing that there's something to boost them.<br/>\n<br/>\nI wonder whether you really need 30 levels of Open Lock, given that you can \"take 20\", but I don't yet know what Arelith locks are like.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:40 PM - Dec 21, 2017",
      "content": "<div>Fair enough, Thorsson - and I'll admit Iron Will is rather \"me\", unless there's a compelling reason not to take it - others have got frustrated with me before, knuckle-runner that I am (or at least, tend to play). Oh, and on that note, I have seen your Death Becomes Thee build, but I'm in no way qualified to comment on it, I'm afraid, having never even played an arcanist - so it's nothing personal!<br/>\n<br/>\nAs far as Open Locks is concerned, again, I was merely thinking in support role terms. If I was looking to invest in Disc, that would probably be where I'd look first. It's difficult sometimes when you don't know the environment.<br/>\n<br/>\n(Incidentally: having noted your avatar with delight, I've been playing me some BG of late - it's Xmas! - and Boo is an automatic companion choice - even if I do get landed with Minsc at the same time)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "cilginat",
      "avatar": "10758838_1513291018.jpg",
      "timestamp": "9:50 PM - Dec 21, 2017",
      "content": "<div>On Arelith KD is very popular that's the reason for discipline, but no need for it if you have a friend that can tank and you don't intend to do any pvp.</div>"
    },
    {
      "author": "Thorsson",
      "avatar": "10758835_1513245773.jpg",
      "timestamp": "10:44 PM - Dec 21, 2017",
      "content": "<div>(Evil, meet my sword! SWORD! MEET! EVIL!<br/>\n<br/>\nWhere would Boo be without Minsc? It's like Tom without Jerry or Trump without Twitter.)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:21 PM - Dec 21, 2017",
      "content": "<div>Ha - indeed! Alas, I think it may throw us all off course if we keep exchanging Minsc quotes, as at least Valerfor and I did back in 2014/5 (though please come back with any we forgot - they're mostly in the Non-shooty, non-magcky elves build I requested back then). And I refer you to my strapline for my commitment to our Rasheman friend. There are many times I have taken - and will continue to take - Minsc over and above potentially \"better\" comrades, purely because he's, well, Minsc.<br/>\n<br/>\nIt's a shame in many respects than NwN doesn't have a comparable character. Maybe Deekin comes closest.<br/>\n<br/>\nOh hells, I can't resist it - \"Look, Boo - squirrels! throw nuts, Boo, throw nuts!\"</div>",
      "author-color": "#AA0000"
    }
  ]
}