{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "676",
  "name": "Purple Dragon Knight challenge in a level 20 build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/purple-dragon-knight-challenge-in-a-level-20-build-t2355367.html",
  "author": "SnorriHT",
  "avatar": "10759176_1572007808.png",
  "replies": 10,
  "posts": [
    {
      "author": "SnorriHT",
      "avatar": "no_avatar.png",
      "timestamp": "4:15 AM - Feb 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">G'day All,<br/>\n<br/>\nLike many I am attracted by the imagery of a Purple Dragon Knight (PDK), but recoil at the lacklustre feats the PDK provides compared to other classes. <br/>\n<br/>\nI believe a playable build can be produced, but I am not a good character builder. However I know many of you here have great knowledge and understanding of the nuances of character building. I salute you all :-)<br/>\n<br/>\nIf you make a PDK build, I will run it on the City of Melnibone Persistent World (levels 1-40, low magic server )<br/>\n<br/>\nLow Magic = magic items, potions and scrolls are rare or expensive, except for \"Cure X\" potions (i.e. cure light wounds) which are discounted. <br/>\n - Plenty of \"magic mushrooms\" can be gathered which provides free, fast cast healing for low level characters. <br/>\n- Fighter NPC henchman available up to level 40<br/>\n- Magic item level is up to +5<br/>\n- Spell component gold costs (~ 80 to 280 gp cost approx) for Stoneskin, Greater Stoneskin, Premonition, True Seeing, Raise Dead and Resurrection spells<br/>\n- (Addition) Devastating Critical is not available on the City of Melnibone server. <br/>\n- The hardcore rules for Use Magic Device (UMD) and Scrolls are enforced, are as per below:<br/>\n<br/>\n<em>\"The special check for using a scroll at hardcore difficulty or higher does not apply to scrolls with no class limitations, to characters with at least one bard, sorcerer, or wizard level, nor to characters who have the spell in question prepared (ready to cast). It does apply to all other characters who have at least one level in rogue, shadowdancer, or assassin, even if that character has a class that is allowed to use the scroll normally\". (<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Use_magic_device\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Use_magic_device</a>)</em><br/>\n<br/>\nThe PDK challenge details are:<br/>\n<br/>\n1. Must include a minimum of 5 levels of PDK in a level 40 build<br/>\n2. No restriction on class, race or alignment<br/>\n3. Must have a minimum 16 BaB by level 20<br/>\n4. This is a PvM build<br/>\n5. (Addition)<em> Taking a level of PDK on the PW will allow the player to purchase a discounted cloak with the Toughness Feat and universal saving throws (starting at +1)</em><br/>\n6. (Addition)<em> Note many of the bosses are immune to Sneak Attack, Critical Hits and have Spell Resistance</em><br/>\n<br/>\nI would then appreciate community comments, suggestions and a fun discussion. <br/>\n<br/>\nI'll then choose what I believe is the popular choice and play it.<br/>\n<br/>\nThanks in advance for your ideas and your time :-)<br/>\n<br/>\n<span style=\"font-size:50%;line-height:normal\">Edits</span><br/>\n<span style=\"font-size:50%;line-height:normal\">1. changed cap from level 20 to level 40 and adjusted required PDK levels to 5)</span><br/>\n<span style=\"font-size:50%;line-height:normal\">2. Clarified the discounted item</span><br/>\n<span style=\"font-size:50%;line-height:normal\">3. Additional information about the City of Melnibone Server</span><br/>\n<span style=\"font-size:50%;line-height:normal\">4 Fixed up formatting and added additional requested information</span><br/>\n<span style=\"font-size:50%;line-height:normal\">Removed  5. You may extend the build up to level 30, if those extra levels bring some game changing extra feats</span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:05 AM - Feb 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have a question :<br/>\n<br/>\nDoes CoM have Horses and the Ride Feat?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SnorriHT",
      "avatar": "no_avatar.png",
      "timestamp": "6:50 AM - Feb 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Webshaman, good point! The skill points in Ride and the Mounted Combat feat would currently be of no value to the build. However the builder may be receptive to modifying the feat server side. I will follow up :-)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SnorriHT",
      "avatar": "no_avatar.png",
      "timestamp": "5:33 AM - Feb 22, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"19234\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19234&amp;sid=81b24e2701908aa1d3287a92acec1938#p19234\">↑</a><div class=\"responsive-hide\">Feb 21, 2020</div></cite>I have a question :<br/>\n<br/>\nDoes CoM have Horses and the Ride Feat?</div></blockquote>\nNo, but the Builder has added an item that compensates for the Mounted Combat feat (please see update 1).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:05 AM - Feb 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This thread reminded me of a PDK build written by Valerfor.<br/>\n<br/>\nWhen I was searching for it I found WhiZard's level 20 PDK build which was a fascinating read. <br/>\nIt looks like WhiZard knew the mechanics of the PDK fear ability very well.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-harper-knight-ftr-30-pdk-5-hs-5-t2354260.html#p649\" rel=\"noreferrer\" target=\"_blank\">The Harper Knight</a> Fighter 30 / PDK 5 / HS 5<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/purple-singing-arrow-bard-8-pdk-3-arcane-archer-9-t2352738.html#p621\" rel=\"noreferrer\" target=\"_blank\">Purple Singing Arrow</a> Bard 8 / PDK 3 / AA 9<br/>\n<br/>\nMuch kudos to anyone who can make a decent PDK build.<br/>\nI am not yet ready to step up to the plate I am afraid but I hope these give you some good ideas!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "6:21 AM - Feb 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Making a decent PDK build is fairly easy but it's not really in the spirit of this challenge. Just add PDK levels to an already powerful class (such as cleric) and let the powerful class make up for the wasted potential of choosing PDK. PDK gives an extremely temporary +4 AB, +4 AC for party members, and a once per day Fear (that can also affect the PDK). The helmet alone isn't really enough to make up for choosing PDK since you could just replace Mounted Combat with Toughness and pick a better class. At least HS has some uses that can't be replaced with another class, unless there are custom server changes PDK is almost always useless. The only reason I ever make vanilla PDKs is to find out the race of boss mobs for future ranger builds, and that is a very niche use.<br/>\n<br/>\nIn order to make a detailed build I would need to know more about your server, but I can give you some rough ideas. These are level 30 continuations of the level 20 builds I would make, if they were built for maximum power at level 30 I would make some tweaks. All of the builds below would be improved by dropping PDK.<br/>\n<br/>\nBard24/PDK4/Figh2 (Bard16/PDK4 @20) is a support character with 9/- Physical DR and undispellable bard buffs. If there are Perform boosting items on your server that let characters use a level 25 Bard Song then change it to a Bard26/PDK4. There are plenty of level 20/30 bard builds that are better than this build in general, but the +4 AC from Heroic Shield means that this is one of the few PDK builds that has any real advantage over non-PDK variants.<br/>\nAB (Assuming +12 STR): 21 (BAB) + 8 (STR) + 4 (Feats) + 5 (GMW) + 2 (War Cry) + 2 (Bard Song) = +42 (+5 Curse Song, +4 PDK, +6 Taunt)<br/>\n<br/>\nCler24/Monk2/PDK4 (Cler15/Monk1/PDK4 @20) is just a knock-off Cler/Monk/Figh, but due to being a battle cleric it should be able to fight most opponents you face. It only has 15 BAB at level 20 but that's a conscious decision to make the most of Divine Power. The bonus AB from PDK is completely useless here due to cleric buffs, Cler24/Monk2/Figh4 is a far better choice.<br/>\nAB (Assuming +12 STR): 20 (BAB) + 9 (STR) + 4 (Feats) + 1 (Aid) + 2 (Battletide) + 1 (Bless) + 5 (Divine Favor) + 5 (Divine Power) + 5 (GMW) + 1 (Prayer) = +53<br/>\n<br/>\nPal24/PDK4/Rog2 (Pal15/PDK4/Rog1 @20) is a knock-off Pal/Figh/Rog, it should do well despite the PDK levels. Even in environments without horses this build is able to summon one so you might be able to actually make use of Mounted Combat. The fear immunity is nice too, although you will miss out on the joy of accidentally fearing yourself and getting killed by enemies that make the save. In the test build I maxed STR but personally I would lower STR and raise CHA in order to improve Divine Might and Divine Shield.<br/>\nAB (Assuming +12 STR): 24 (BAB) + 12 (STR) + 4 (Feats) + 1 (Aid) + 1 (Bless) + 5 (Bless) + 5 (GMW) + 1 (Prayer) = +53 (+4 PDK, +6 Taunt) [+51 with higher CHA]<br/>\n<br/>\nRog16/Figh10/PDK4 (Rog12/Figh4/PDK4 @20) is worse than a Rog19/Figh10/SD1, but a DEXer with Crippling Strike, Epic Dodge, Set Trap, and UMD should at least be useful in a party.<br/>\nAB (Assuming +12 DEX): 22 (BAB) + 14 (DEX) + 4 (Feats) + 1 (Size) = +41 (+4 PDK)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:42 AM - Feb 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm going to disagree with Yunim here on this, but only due to specific conditions :<br/>\n<blockquote><div><strong>Mounted Combat</strong><br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://vignette.wikia.nocookie.net/nwn/images/4/4c/Ife_x3_mcombat.png/revision/latest?cb=20080927001319\" /><br/>\n<strong>Type of feat:</strong> general <br/>\n<strong>Prerequisite:</strong> ride 1 rank<br/>\n<strong>Required for:</strong> mounted archery<br/>\n<strong>Specifics:</strong> While mounted, once per round you will attempt a ride check to increase your armor class by 1 point for every 5 of the check result.<br/>\n<strong>Use:</strong> automatic <br/>\nNotesEdit\n<ul>\n<li>Added in the 1.69 patch.</li>\n<li>The bonus (a dodge bonus) is only +1 for every 5 of the check result <span style=\"text-decoration:underline\">over 10</span> (but there is no penalty if the check result is under 10).</li>\n<li>This feat only affects player characters in modules that make use of an OnHeartbeat event script that was introduced in version 1.69. That is, a player gains no benefit from selecting this feat in a module that does not support horses (such as the official campaigns).</li>\n<li><em>This feat is disabled or modified on some servers as the effects can be considered overpowered. Common modifications include reducing the bonus by the armor class bonus from tumble (possibly resulting in a penalty), and reducing the ride check by the dexterity modifier (since that modifier has already contributed to armor class).</em> </li>\n</ul>\n</div></blockquote>\n\nAnd this is why.<br/>\n<br/>\nIt is really the ONLY thing that PDK can bring to a build, other than the 1/BAB and no XP penalty (Prestige Class).  As Yunim has pointed out, the buffs, etc are very short lived and basically useless because of that.  If in a modified environment where these buffs have been modified accordingly, PDK can be a viable Prestige Class - especially due to this Mounted Combat feat combined with Ride skill ranks for AC, along with the benefits of whatever modifications have been made to the other abilities.<br/>\n<br/>\nThis can either relieve the need to take lots of Tumble (and lower your BAB because Tumble is a non 1/BAB skill - though one can cross class it if one has the skill points to burn) or combine nicely with it, depending on how the Mod builder decides to roll with it.<br/>\n<br/>\nEspecially in a level 20 limit, the AC bonus can really make a difference.<br/>\n<br/>\nOf course, unless Riding is going to be allowed indoors, it will probably be only situational AC - outdoors only.<br/>\n<br/>\nSo get a Behir to ride :D<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SnorriHT",
      "avatar": "no_avatar.png",
      "timestamp": "9:54 AM - Feb 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you all! <br/>\n<br/>\nThe Harper Knight, The Purple Singing Arrow, Rog/Ftr/PDK and the Pal/PDK/Rog are all builds I'm going to investigate further. Those four would be suitable for the City of Melnibone. Especially the Purple Singing Arrow as ammunition for \"Missile specialists\" is discounted.<br/>\n<br/>\nI've also been crunching a few builds in the CBC and a Level 20 restriction is not going to cut it, so I think I need to plan for 30 or 40.<br/>\n<br/>\nHmm...food for thought :-)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:43 PM - Feb 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Personally I don't think that Mounted Combat justifies choosing PDK in vanilla NWN, you can always get Mounted Combat and then pick a better class. For example, if you replace PDK4 with Figh4 you get 2/3 feats and the chance to take WS/EWS. All of the builds posted in this thread are powerful despite being PDKs rather than because they are PDKs, which is why I'm not sure if they're in the spirit of this challenge.<br/>\n<br/>\nWith your new criteria I'm not sure if you're looking for a level 40 build that can be modified to work on your PW or a level 20 build that can be continued in another environment. In general optimising for the level cap gives the best results, but that depends on how easy it is to reach max level on your server. If you can't decide on a specific level you can just build so that it's decent at multiple levels (eg 20, 30, and 40).<br/>\n<br/>\nFor example:<br/>\nBard6/PDK4/AA10 &gt; Bard7/PDK4/AA19 &gt; Bard8/PDK5/AA27 or Bard7/PDK4/AA9 &gt; Bard11/PDK4/AA15 &gt; Bard16/PDK5/AA19<br/>\nPal15/PDK4/Rog1 &gt; Pal24/PDK4/Rog2 &gt; Pal32/PDK5/Rog3<br/>\nRog12/Figh4/PDK4 &gt; Rog16/Figh10/PDK4 &gt; Rog25/Figh10/PDK5<br/>\nAll of these builds would need tweaking if they were optimised for a specific level cap, but you get the idea of how to manage specific levels within the overall build.<br/>\n<br/>\nTo make a full build guide I would need more information about your server.<br/>\nWhat is the level cap on CoM?<br/>\nDo you want to play an optimal build at the level cap or a build that is optimised for specific levels?<br/>\nIs the server like vanilla NWN or are there any custom changes we should be aware of?<br/>\nIs Dev Crit worth taking?<br/>\nYou said that CoM is a low magic world, what sort of items are available near the level cap? +3EB/+3AC? Is permahaste available?<br/>\nWill you be able to get +12 to abilities via items? How many abilities are you able to buff at once (eg 2x +12 abilities)?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:01 PM - Feb 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Personally I don't think that Mounted Combat justifies choosing PDK in vanilla NWN</div></blockquote>\n\nI did say that it would only apply under specific conditions.<br/>\n<br/>\nAnd I also concur that there are much better Classes that one can take instead of PDK.  The OP was however interested in taking PDK.  This is why I asked if the environment was accommodating to PDK.<br/>\n<br/>\nPDK needs more luv.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "9:33 PM - Feb 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I definitely agree with that, vanilla PDK is extremely underwhelming. Even a small change like increasing the duration of the PDK abilities would make it viable. Making Final Stand scale with level would be nice too, 40d10 (220 average) temporary HP and an increased duration would make it useful even at epic levels.<br/>\n<br/>\nCurrently builds with PDK5 are limited to:<br/>\n3x +1 AB (1 round duration)<br/>\n2x +1 AB (10 round duration)<br/>\n1x +2 AB vs race (10 round duration)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}