{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "149",
  "name": "Parry: Can this be a useful skill?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/parry-can-this-be-a-useful-skill-t2355347.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 7,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:00 AM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong>Parry: Can this be a useful skill?</strong><br/>\n<br/>\nI want to bring up this discussion because it has been troubling me and am keen to get your thoughts/opinions on this matter.<br/>\n<br/>\n<strong>Background:</strong><br/>\nI have been told numerous times parry is a bad skill, often with vehement certainty. As a consequence I have never built with it.<br/>\n<br/>\nHowever when I read the description on the NWN Wiki, not the bugged in game description, but the way it actually works in combat<br/>\n<br/>\n(and I expect some to laugh at me, and I'm fine with that, I am only interested in the search for the truth of the matter)<br/>\n<br/>\n... on paper it doesn't look too bad, if you have an absolute surfeit of skill points.<br/>\n<br/>\nThis is the relevant descriptor (please note I have ignored the in-game description, as this is incorrect):<br/>\n<blockquote><div>Notes\n<ul>\n<li>Parry is a combat mode, so cannot be used at the same time as other combat modes.</li>\n<li>Parry applies only in melee combat; it does not function if either the attacker or defender is using a ranged weapon.</li>\n<li>This skill was reduced from its original (pre-release) state and is considerably less effective than it may sound. Parry can only deflect the first attack in each of the three flurries in a round (for example, parrying an opponent with 5 attacks per round will only attempt to block the first, third, and fifth attacks).</li>\n<li>Riposte attacks are made with the character's normal (descending) attack bonus, not at full bonus each time. Thus if a character has an attack schedule of +16/+11/+6 and successfully ripostes two attacks, the riposte attacks will be at +16 then +11, not at +16 each time.</li>\n<li>The parry skill applies to both the attack roll and the critical hit confirmation roll.</li>\n<li>Automatic hits (natural 20 attack rolls) cannot be parried.</li>\n</ul>\n</div></blockquote>\n<strong>What might be useful from what I read</strong><br/>\n- deflect up to three attacks / round (one attack / flurry)<br/>\n- add up to three attacks / round (one attack / flurry)<br/>\n- possibly reduce critical hits (noted the comment 'the parry skill applies to both the attack roll and the critical hit confirmation roll')<br/>\n<br/>\n<br/>\n<br/>\n<strong>What are the obvious problems I can see on paper</strong><br/>\n- melee combat only<br/>\n- unable to use power attack/expertise/improved expertise<br/>\n- skill penalties from armor/shields (ie full plate (-8) and tower shield (-10) that is immediately -18 to parry)<br/>\n- if one's AC is 20 higher than your Parry skill, the ability is only useful for Ripostes, as a natural 20 cannot be parried or blocked with AC.<br/>\n- dexterity based skill<br/>\n<br/>\n<strong>What might be the best way to utilise the Parry Skill, build wise</strong><br/>\nThis is what I am most interested in. The way I can see it being useful is:<br/>\n<br/>\n1. Equip Medium (Chain Shirt -2) or Light Armor/Robes (-1 to no penalties) to minimise skill penalties<br/>\n2. Have enough dexterity to make sure there is enough Dex AC to compensate. Chain Shirt (4+4), Leather Armor (2+6), Padded (1+8) have ACs which can compete with Full Plate (8+1).<br/>\n3. Obtain Uncanny Dodge I (Rogue 3, Barb 2, Assassin 2, Shadowdancer 2) to protect the extra Dex AC<br/>\n4. Have lots of skill points. Human, some favorable classes such as Rogue, Int 14 or 16. <br/>\n5. Have lots of feats, so one can fit in Skill focus: Parry (+3), Improved Parry (+4), Epic Skill Focus: Parry (+10) -&gt; total +17 to Parry<br/>\n<br/>\nFor a damage dealer<br/>\n6. Equip a two handed weapon and go Strength, such as a Fighter/Bard/RDD or a Fighter/Rogue/WM, you can do up to 8 attacks / round if you are hasted.  (I like this idea)<br/>\n7. Another option might be a Str based Monk with high Parry, trouble is you cannot use Flurry of Blows. A ITWF Kama with Haste Monk with BAB 26+ could do up to 12 attacks / round. This idea I like less.<br/>\n<br/>\nFor a defensive build<br/>\n8. Go dexterity based, get Epic Dodge from various means, you can remove 4 attacks / round. Parry attempts are used first before Epic Dodge is used. <br/>\n<br/>\n<strong>How high to go with Parry</strong><br/>\nI was thinking as high as possible.<br/>\n<br/>\nBase Max Parry Ranks are 43. Feats can add 17 (as described) = 60. Add dexterity modifier. For a Dex 14 base character, this is between 2 to 8. So 62-68.<br/>\n<br/>\nOne can add gloves:<br/>\n- Gloves of Swordplay (+3)<br/>\n- Greater Gloves of Swordplay (+6)<br/>\n- Epic Gloves of Swordplay (+30) -&gt; 92-98 parry score, modified.<br/>\n<br/>\nBard song can also add more.<br/>\n<br/>\n<strong>In practice</strong><br/>\nI want to see if I can make a parry based build viable. <br/>\n<br/>\nI want to go with the str two hander, go human Fighter/Rogue/Weapon Master for piles of skill points and plenty of AB/Damage for Riposte Attacks. <br/>\n<br/>\n<strong>Sample build:</strong><br/>\n<br/>\n<br/>\n<strong>The Glorious Duelmaster</strong><br/>\nHere is a sample build I made, it has all the great stuff we want, like AB 47, cleave/great cleave, dev crit, essentially 500hp, UMD/tumble 40, crossclass spellcraft but also a modified parry score of 62, 269 skill points, plenty of skill dumps throughout its lifetime.<br/>\n<br/>\nIf I am reading the NWN Wiki correctly, this guy can do 8 attacks / round with haste from UMD, add more attacks from devastating critical/great cleave and you have a bit of a monster here. <br/>\n<br/>\nIf I am reading the Wiki Correctly and everything works as expected in game. <br/>\n<br/>\nIts weakness is of course magic which the only protection will be UMD and killing those damn mages with dev crit, and the saves, which I could only partially mitigate with the Epic Fortitude feat, with the build being so feat starved. Archers will be a problem too.<br/>\n<details><summary>Spoiler</summary>Rogue(6), Fighter(12), Weapon Master(22), Human\nSTR: 16 (28)\nCON: 15 (16)\nINT: 14\n\n01: Rogue(1): Expertise, Improved Parry\n03: Fighter(2): Dodge, Mobility\n05: Fighter(4): Weapon Specialization: Greatsword\n07: Fighter(6): Whirlwind Attack\n09: Weapon Master(1): Improved Critical: Greatsword, Weapon of Choice: Greatsword\n11: Fighter(7)\n13: Rogue(3): {Uncanny Dodge I}\n15: Weapon Master(4): Skill Focus: Parry\n17: Weapon Master(6)\n19: Fighter(9)\n21: Weapon Master(8): Epic Skill Focus: Parry\n23: Weapon Master(10)\n25: Weapon Master(11)\n27: Weapon Master(13): Great Cleave, Armor Skin\n29: Weapon Master(14)\n31: Weapon Master(16): Overwhelming Critical: Greatsword\n33: Weapon Master(17): Great Strength II, (STR=25)\n35: Weapon Master(19): Devastating Critical: Greatsword\n37: Rogue(6)\n39: Weapon Master(22): Great Strength III, Epic Prowess, (STR=27)\n\nSkillpoints: 269\nSaving Throw bonuses: Spells: +4, Traps: +1\nAB (max, naked): 47 (melee), 32 (ranged)\nSpell Casting: \n\n\n01: Disable Trap(1), Intimidate(4), Open Lock(1), Parry(4), Search(4), Set Trap(1), Spot(4), Tumble(4), UMD(4), Save(17), \n03: Discipline(1), Parry(1), Spellcraft(3), Save(13), \n05: Discipline(1), Parry(1), Save(19), \n07: Discipline(1), Parry(1), Save(25), \n09: Discipline(2), Spot(1), Save(8), \n11: Discipline(1), Parry(3), Save(12), \n13: Parry(1), Search(2), Spellcraft(5), Spot(3), Tumble(5), UMD(5), \n15: Discipline(1), Spot(1), Save(5), \n17: Discipline(1), Spot(1), Save(11), \n19: Discipline(1), Parry(6), Save(12), \n21: Discipline(2), Spot(1), Save(8), \n23: Discipline(1), Spellcraft(5), Spot(1), Save(4), \n25: Discipline(1), Spot(2), Save(6), \n27: Discipline(1), Spot(1), Save(12), \n29: Discipline(2), Spot(1), Save(2), \n31: Spot(1), Save(9), \n33: Spellcraft(5), Spot(2), Save(3), \n35: Spot(1), Save(11), \n37: Parry(5), Set Trap(7), Spot(1), Tumble(10), UMD(3), \n39: Discipline(4), Spot(1), </details>\n\nAnyway, food for thought. <br/>\n<br/>\nThis is something that looks interesting to playtest, I am keen to hear from players with practical experience with parry, although I am less keen to hear from those who just invested 43 ranks whilst going full plate and tower (-18 to parry), as this doesn't seem to be a useful way to utilise the skill to its potential, if what is described in the Wiki and what I understand of the parry skill is correct. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "5:05 AM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have never played with this, but from what I've read, it sacrifices your normal attacks, Right? Instead of one's normal attacks, you go into parry mode...then if you make the dc by 10 or more, then and only then do you get a \"riposte\" attack....and you'd only have a maximum of 3 possible chances of that per round...?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:58 AM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes that is what I thought Gkorjax, nothing is documented though about losing attacks in the Wiki at least. I'll have to just play test it in a module and see<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "6:31 AM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Parry can sometimes be useful as a defence but it's borderline useless for offence. Building around riposte attacks is a bad idea in my opinion, you would be better off making a high AB char that permanently stays in IExp. With your specific build you are limited to 3 APR instead of potentially 5 APR, and even then that 3 APR depends on your Parry skill being higher than your opponents AB.<br/>\n<br/>\nThere are some cases where a Parry tank can be useful, but that depends on your opponents and the availability of Parry gear in your environment. Being able to block up to 3 attacks per round means that in some cases it can even be better than Epic Dodge. If your Parry skill is lower than your AC with IExp then you would probably be better off ignoring Parry entirely.<br/>\n<br/>\nNot sure if this is mentioned in the wiki, but Epic Dodge and Parry will both trigger for the same attack so it's not possible to stop 4 attacks per round by combining them.<br/>\n<br/>\nEdit: I did some testing and sometimes Epic Dodge and Parry work together properly. So the combination can potentially stop 4 attacks per round, but it's not reliable.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "6:38 AM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Gkorjax is correct, one loses all your attacks in parry mode.<br/>\n<br/>\nNot only that, but the Parry's dont occur every flurry as described.<br/>\nIt is still seriously bugged.<br/>\n<br/>\nThis playtesting of a level 21 rogue/fighter/WM in the PGCC module.<br/>\nHe has some gloves with +parry 30 equipped.<br/>\nGreatsword +1 and Scale Mail +2. <br/>\nAlso has ESF: Parry, Skill Focus: Parry and Improved Parry (+17).<br/>\nHis modified parry score is 71. <br/>\n<br/>\nHe is facing a level 21 fighter from the module. <br/>\n<br/>\nHis parry score should be high enough to parry and riposte attack every incoming attack at him in this module except one attack on the first flurry<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202002/10759084_8679a95a8169c942a399ec157b7e9a10_t.jpg\" />\n</dl>\n</span><br/>\nThis is the attack log of that fighter:<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202002/10759084_c66a9a657af4398b943106a1835bcbd1_t.jpg\" />\n</dl>\n</span><br/>\nThe first flurry I understand. My character parries and lands a Riposte Attack. The second attack can't be parried and the fighter lands an attack.<br/>\nThe second flurry I also understand, the fighter rolls a 1 and auto-misses.<br/>\nThe third flurry I don't get. the fighter gets to attack me without any parry attempts, what soever.. <br/>\n<br/>\nThe fourth flurry I dont get. The fighter gets two unopposed attacks.<br/>\nThen the Riposte Attack occurs with the next flurry.<br/>\n<br/>\nTo me it looks like the Parry mechanism is not even in sync with the flurry's that occur in game meaning it doesn't even try to parry an attack every flurry consistently.<br/>\n<br/>\nIt was good to examine all this in detail and understand why Parry is seriously bugged, and why it is not worth building with it. .<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "7:03 AM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You're reading the logs wrong. The fighter has 4 attacks per round, split into +34/+29 / +24 / +19, ignoring the Power Attack decrease.<br/>\n<br/>\nFirst flurry: You parry first and get critted on the second attack.<br/>\nSecond flurry: Miss<br/>\nThird flurry: Parried<br/>\nFourth flurry: Miss and hit, it appears that Parry only works on the first attack even if it's an automiss.<br/>\nFifth flurry: Rolls a 20, no Parry attempt.<br/>\nSixth flurry: Rolls a 20, no Parry attempt.<br/>\n<br/>\nI always assumed that Parry works on the first successful attack but it appears that it actually works on just the first attack in the flurry. That would also explain why sometimes it works with Epic Dodge and sometimes it doesn't, it depends on which attack in the flurry triggers Epic Dodge. So this reinforces the idea that Parry can be useful as a defensive method, although there are usually better methods available.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:23 PM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh bugger. I got confused by the 20 rolls, what luck.<br/>\n<br/>\nOk offensive parry builds -&gt; <strong>trash can</strong>. [I thought Parry Mode would at least allow one to attack normally, nothing in the descriptor saying you give up all the attacks in your round]<br/>\n<br/>\nDefensive parry builds. -&gt; maybe viable, maybe other methods are better.<br/>\n<br/>\nI am keen to see what they look like. Have you got any samples or links to any I can look at Yunim?<br/>\n<br/>\nAlso. If you parry an attack, can you do damage shield damage? Perhaps a damage shield build with a high parry score might be something *interesting*, whether its worth investing 60+ skill points from skill ranks and feats is a different question<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "5:16 PM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As an example build, think of a DR tank that also has high Parry. Rog13/DD26/X is my go to DR tank, with X usually being Figh1, Rang1, or SD1. In a +5 AC environment this tank will have around 65ish AC, so even in IExp that's a max of 75ish AC. In comparison the Parry skill would be 74 + items, so with just +30 Parry gloves it will have over 100 Parry. Parry only works in 1v1 melee fights so it won't be effective for all bosses and you would have to kill any minions as quickly as possible. If you reduce the boss fights to a 1v1 then in addition to Epic Dodge and 27/- DR you will also be blocking another 2 or 3 attacks per round.<br/>\n<br/>\nNormally AC tanking is better against high AB foes, but if it's possible to have a higher Parry than AC then Parry can be useful. So it depends on both the items that are available and the opponents that you will be fighting. I currently play on Blackstone Keep where AC tanking is not really viable in high end PvM (at least not without support). Parry can potentially be useful there, although I've only ever partied with one person who used a DR/Parry tank which is what taught me that it's not a completely useless skill.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}