{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "501",
  "name": "Please help with balancing (Cleric/FTR/Rogue, Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/please-help-with-balancing-cleric-ftr-rogue-arelit-t515516.html",
  "author": "Hafen",
  "avatar": "no_avatar.png",
  "replies": 0,
  "posts": [
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "5:03 PM - Oct 16, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I wish to set up my build somewhere at medium range between pvp and pvm. The main goal in pvp is \"to survive\". Level cap is 30, with limits 3 lvls in each class (and when taken first time, you need to go three in a row). The race of character is drow female (cleric is fav class). Class preference is cleric, all other just to gain AC, feats or AB. In melee primary focus on one hand and tower shield. The weapon morningstar.  Maximum item enhanncment +3 (but i can get easily many items with +1 str +1 wis and +2 skill) until i use magic (with that i can get up to +5). I would prefer semi-casting type of build.<br/>\n<br/>\nThe background of character is following: she's noble, highed ranked daughter of matron, and will be assigned  [if all goes well] as military commander. For now i reached level 9th. The purpose of character is not purely pvp, she will mostly rely on soldiers and mages of her house to melee but I need her able to defend herself, many characters of lesser races (kobolds, goblins...) will try to mock her around in caverns. Choice of weapon is done this way because every drow priestess i ever met wears katana, so i wanna be different, and also morningstars and maces are symbols of domminance in drow units.<br/>\n<br/>\nWhat i need is to balance all (on future levels) in order to get it working and find some easier progress. I took fighters levels to get feats and AB, and i am thinking of rogue to get tumble (also sneaks would be fitting her personallity well) for AC. I dont need to bother with question of how expansive gear is, she will get the best possible due to her position.<br/>\n<br/>\nSo here is she:<br/>\n<br/>\nSarinil'raere (cleric 7/Fighter 2), chaotic evil<br/>\nCurrent stats<br/>\nSTR 16<br/>\nDEX 12<br/>\nCON 12<br/>\nINT 12<br/>\nWIS 18 (<strong>23</strong> as final)<br/>\nCHAr 10<br/>\n<br/>\nMagic resistence (11+lvl) 20<br/>\n<br/>\nTaken feats:<br/>\nSpell penetration<br/>\nGreater spell penetration<br/>\nWeapon focus: morningstar<br/>\nWeapon proficiency (exotic) (no, i did not want to take this feat, but other drow would laugh at her she cant use whip:/) <br/>\nBlind fight <br/>\n<br/>\nMy idea looks like: <br/>\n<br/>\ncleric 23 fighter 4 rogue 3<br/>\n<br/>\n<strong>Skills:</strong> Concentration 30, Spellcraft 30, discipline 20, tumble 20 6 points free(?) <br/>\n<br/>\n<strong>Feats on epic level:</strong> epic weapon f. morningstar, armor skin, automatic quicken I and II, epic spell penet.<br/>\n<strong>Feats on pre epic level:</strong> weapon f. morningstar, blind fight, quicken spell, spell focus - evocation, extended spell, spell pent., greater spell penet.<br/>\n<br/>\n<strong>Base At. Bonus:</strong> 21<br/>\n<strong>Spell resistence:</strong> 41<br/>\n<strong> AC/ with mundane full platemail and tower shield</strong>: 31<br/>\n<strong>Saves: </strong>for 20 ref 12 will 22<br/>\n<br/>\nDC for spells: 10+6(Wis)+1(buff for wis) +5 (wis from items)+X ....(DC 31 for 9th circle, 34 for 9th circle and evo spell school)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}