{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "369",
  "name": "Quintessential Arcane Archer",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/quintessential-arcane-archer-t2346980.html",
  "author": "ArcaneMaster67",
  "avatar": "10235235_1549015559.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "ArcaneMaster67",
      "avatar": "no_avatar.png",
      "timestamp": "4:07 AM - Dec 09, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">It's been some time since I've asked for help with a build, so here it is..<br/>\nLevel 40 PvM Quintessential Arcane Archer. I play on a non PvP Role-play server with the following restrictions; Minimum 5 levels in any one class and no dual prestige classes allowed. My first thoughts were Wizard6/Ranger10/Arcane Archer24. Six levels of Wizard for the Haste spell and other buffs, Ten levels of Ranger for 3 Favored Enemies (preferably Critical resistant races, but any RP choice will work) and Improved Two-Weapon Fighting for use of the Double Bladed Sword (purely for RP but not required). Twenty-four levels of Arcane Archer should net me +12 Enchant Arrows. I do see many choices with the level spread. I could drop Wizard one level, meet the server requirement and net +14 Enchant Arrows. Or, one less Ranger level still allows for Imp Two-Weapon but I loose a Favored Enemy. Any ideas, comments or suggestions would be appreciated.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "4:50 AM - Dec 09, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Lots of things to consider, so I will just offer one note: +3 damage for the three favored enemy races for ranger level 10 probably isn't as good as +6 against all targets from WS+EWS with fighter. And, the extra feats fighter would net you would allow a good deal more flexibility and help you avoid choices like Toughness or Called Shot or Weapon Finesse, etc. Obviously, the ranger levels are working with a role-play concept you have, but there is something of a trade-off in terms of effectiveness versus fighter when there aren't lots of ranger levels. IMO, of course. Personally, I tend to like rogue as my third class for AAs, but fighter is worth consideration if you are looking at a full-AB progression third class.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:34 PM - Dec 09, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I agree with Zork here. I'm hardly an AA expert, but I know that archers work best with Sneak Attack damage. You don't have STR, so your alternative source of damage is either Sneak Attack or some magical enhancement. Wizard 6 is not that ideal. I'd go for at least 7 so you can at least EXTEND Haste. A non-extended Haste lasts for only 6 rounds, an extended one at 7 lasts 14. You can't stop to recast, and with a non-damage archer, you'll need to at least once every battle. <br/>\n<br/>\nI'd consider lowering AA levels a bit and fitting more Wizard levels to have a worthy spellbook. You can't have much, but I'd say a good spread for a versatile archer is Wizard 10 / Rogue 13 / AA 17 if you really want Haste, or Rogue 13 / Wizard 1 / AA 27 if you don't. By having Rogue levels, you can cast from Scrolls, and the Wizard spells at level 1 can be all True Strike, so you really don't need to be able to cast Haste, but if you do, which is perfectly understandable, you should at least 10 Wizard for the extra feats (which can be 2 Great Intelligences). Pre-epic spread should be Rogue 8 Wizard 2 AA 10 for the best BAB.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:57 AM - Dec 10, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A quintessential Arcane Archer is IMO an archer with <strong>MANY</strong> AA levels. That will provide an excellent AB and enough damage to stop worrying about depending on SA damage.<br/>\n<br/>\nThere is much to choose from, but I will suggest a Fighter/Bard/AA or a Monk/Wizard/AA build. There are several ways to build with these classes.<br/>\nFighter/Bard gives extra feats and extra damage from EWS, the bard skillset, bardsong and spells, depending on how high you want to take the bard levels. Eg: Something like a dexterity based Half-elf Fighter 5/Bard 8/AA 27.<br/>\nMonk/Wizard gives monk speed for kiting (you mentioned haste), evasion and tumble, and a pet for RP purposes. I'd keep wizard levels low to give room for Monk and AA levels with a priority on AA. Eg: Dexterity based Elf Monk 9/Wizard 2/AA29, or something along these lines.<br/>\n<br/>\nYou will find many more ways to build an AA if you use our <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/buildsearch/\" rel=\"noreferrer\" target=\"_blank\">build search engine</a>. And you can read about the principles of AA character builds in my <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/enchanted-arrows-magic-and-archery-an-arcane-archer-guide-t2183611.html\" rel=\"noreferrer\" target=\"_blank\">AA guide</a>.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}