{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "153",
  "name": "The Wild Heart - focused Rakhasa/Dragon shifter (28 dru, 2 mnk, 10 shifter)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-wild-heart-focused-rakhasa-dragon-shifter-28-d-t2355079.html",
  "author": "Goshozal",
  "avatar": "10759152_1569536705.png",
  "replies": 13,
  "posts": [
    {
      "author": "Goshozal",
      "avatar": "no_avatar.png",
      "timestamp": "8:23 AM - Jun 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Long time lurker here. Waaaaaaay back in the days of live NWN1 I used to play on Bastions of War. I've always enjoyed NWN1 and I found this site when I downloaded it from GOG and went looking for builds and mods.<br/>\n<br/>\nThanks to this site I found out about the Aielund saga and played it. I powered through it with a Blood and Faith build, then decided it would be a good testing ground for an old love of mine: the shifter. While the quirks of many forms are fun to toy with and have their useful moments, I always wanted to see how much raw power I could manage. In my experiences with the shifter, its never a pure offensive juggernaut, but it has some natural tendencies to be a solid defensive contender. Since no shape equals the dragon, that became a big factor in this build, but I wanted something more well-rounded than trying to maximize dragon melee. I also always liked the Rakshasa shape's immunity bonus. I wanted to see if I could get his AC and Ice storm CL up nice and high, so I could have a shifter that had good defensive options and last-resort melee capability.<br/>\n<br/>\nI've read up a lot on shifter builds, and I was grateful to find info here about Dragon and Rakshasa builds. I searched for something similar to this one and found some proposed discussions, but as far as I know this is the only full-fledged guide of its kind. After much studying and effort, this is about the best I can come up with given the natural limitations and challenges to shifter builds. I'm curious to see what you all think.<br/>\n<br/>\n<strong>The Wild Heart</strong> - 28 Druid / 2 Monk / 10 Shifter<br/>\n<br/>\nRace: Human<br/>\nAlignment: Lawful Neutral (restricted due to Monk/Druid)<br/>\nPlayability: 1-40 PvM (SoU, HotU, Aielund tested), unsure about PvP<br/>\n<br/>\nStats:<br/>\nSTR 8<br/>\nDEX 10<br/>\nCON 14<br/>\nINT 14<br/>\nWIS 18 (32)<br/>\nCHA 8<br/>\n<br/>\nBasic Stats:<br/>\n<br/>\nHP: 400<br/>\n<br/>\nSkill points: 301<br/>\n<br/>\nYou have some flexibility with skills. I personally never found use for animal empathy. Concentration, Spellcraft, Discipline, Tumble are your big ones. In the Aielund environment I added in Heal, Lore, and Persuade.<br/>\n<br/>\nConcentration 43 (45)<br/>\nDiscipline 42 (41)<br/>\nHeal 43 (54)<br/>\nLore 43 (45)<br/>\nPersuade 43 (42)<br/>\nSpellcraft 43 (45)<br/>\nTumble 40 (40)<br/>\n4 points left... Appraise 2<br/>\n<br/>\nSaving throws F/R/W = 24 / 16 / 33 (+9 bonus to spell saves from Spellcraft)<br/>\n<br/>\nNaked AC = 31 (11 unbuffed wisdom bonus, 8 tumble, 2 armor skin, 10 base AC)<br/>\nAC, naked, self-buffed, Imp. Expertise = <strong>54</strong> (+ 5 Barkskin, +6 from Owl's Wisdom, + 2 from Aura of Vitality, + 10 from Expertise)<br/>\nRakshasa, naked, self-buffed, Imp. Expertise = 27 (shape base per Zelle), + 17 (Wis) + 10 (Exp) + 5 (Bark) + 2 (AS) + 8 (Tumble) + 2 (AoV) = <strong>71</strong> AC<br/>\nDragon, naked, self-buffed, Imp. Expertise = 43 (shape base per Zelle) -2 (size), + 17 + 10 + 5 + 2 + 8 + 2 (as above) = <strong>85</strong> AC<br/>\n<br/>\nThese AC values are to my best knowledge (knowing the char sheet lies). It's unclear to me if the bonuses from dragon DEX, the haste bonus of 4 (not counted above), and the supposed +20 dodge bonus from dragon shape stack. Feel free to correct me on my AC calculations.<br/>\n<br/>\nBAB 25<br/>\nAB: (unarmed) 25/22/19/16/13<br/>\nAB: (Rakshasa, self-buffed with STR and AoV) 39/34/29<br/>\nAB: (Dragon, self buffed with STR and AoV) 49/46/43/40/37<br/>\n<br/>\nWith itemization it's possible to STR cap your dragon for an impressive 2-16 + 25 damage and 51 AB. You only have 2 uses of Stunning Fist, but it has a nasty DC at 47.<br/>\nEven the Rakshasa shape's melee can't be completely discounted, since it merges weapon properties. In Aielund I was using the divine scimitar, so my rakshasa had +1d10 fire, +2d10 divine and onhit: kill evil DC 14.<br/>\n<br/>\nOffensively, you have full druid spells with a +17 wis modifier thanks to Owls' wisdom. That's a 36 DC on Storm of Vengeance or a 35 DC finger of death. Between stonehold and SoV you can really lock down crowds of opponents. Your buffs are undispellable except for Mords. In Rakshasa shape, your maxed Ice Storm deals 66 cold and 18 bludgeoning damage, with infinite casts, no saving throw, and has a CL of 34 for spell penetration purposes. Your dragon breath weapons are a horrifying 22d10 (fire), 22d8 (lightning), or 22d6(acid) with a DC of 34.<br/>\n<br/>\nLeveling: <br/>\n<br/>\n1: Druid (Expertise, Alertness)<br/>\n2: Druid<br/>\n3: Druid (Improved Expertise)<br/>\n4: Druid (+1 WIS, 19)<br/>\n5: Druid<br/>\n6: Druid (Blind Fight)<br/>\n7: Druid<br/>\n8: Druid (+1 WIS, 20)<br/>\n9: Druid (Knockdown)<br/>\n10: Druid<br/>\n11: Druid<br/>\n12: Druid (+1 Wis, 21, Maximize Spell) *if you don't care to abuse the maximize ice storm rak bug, use extend spell<br/>\n13: Druid <br/>\n14: Druid<br/>\n15: Druid (Spell Penetration)<br/>\n16: Druid (+1 Wis, 22)<br/>\n17: Druid<br/>\n18: Druid (Greater Spell Penetration)<br/>\n19: Druid<br/>\n20: Druid (+1 Wis, 23)<br/>\n21: Druid (Great Wisdom 1, 24)<br/>\n22: Monk (skill dump discipline and tumble to 25)<br/>\n23: Druid<br/>\n24: Shifter (+1 Wis, 25, Great Wis 2, 26)<br/>\n25: Shifter<br/>\n26: Shifter<br/>\n27: Shifter (Great Wis 3, 27)<br/>\n28: Shifter (+1 Wis, 28)<br/>\n29: Shifter<br/>\n30: Shifter (Great Wis 4, 29)<br/>\n31: Shifter<br/>\n32: Shifter (+1 Wis, 30)<br/>\n33: Shifter (Outsider Shape) * shifter level 10 is the only chance to take outsider shape<br/>\n34: Druid<br/>\n35: Druid (Druid 24 bonus feat: Dragon Shape)<br/>\n36: Druid (+1 Wis, 31, Armor Skin)<br/>\n37: Druid<br/>\n38: Druid<br/>\n39: Monk (skill dump tumble and discipline, Epic Prowess)<br/>\n40: Druid (Druid 28 bonus feat: Epic Spell Penetration)<br/>\n<br/>\nSkills:<br/>\n<br/>\n1-21: take concentration, heal, lore, spellcraft, persuade (or pick your alternatives) and save the rest.<br/>\n22: get discipline and tumble to 25.<br/>\n23-28: take concentration, heal, lore, spellcraft (except on shifter levels), persuade and save the rest.<br/>\n39: get discipline to 42 and tumble to 40.<br/>\n40: you'll probably have a couple spare points. I picked appraise. I guess you could finally put a couple in animal empathy to be a druid who only talks to squirrels.<br/>\n<br/>\nNote: I avoided spot/listen/search because of the mechanics of the True Seeing spell and some shapes. If you care to use it, listen is a class skill for shifters and monks. I'd drop persuade.<br/>\n<br/>\nThis build experiences significant changes as it levels. For the first half of its life, you're a pure caster druid. Str and dex are low, so if you want to melee you'll need to use your shapes. But you've got an animal companion, summoned pets, etc. to help along with your spells. I took improved expertise early to boost low level survivability, though the build has a respectable 10 hp per level as well. I basically played a disabler and buffed my pets/party members, occasionally shifting into dire bear or water elemental to spam knockdowns.<br/>\n<br/>\nAt 22 the monk level gives a nice big bump to AC with the wisdom bonus and 5 AC from tumble. Your shapes get a minor boost to viability at this point from the big AC upgrade, though they begin to lack AB as time wears on.<br/>\n<br/>\nThe shifter levels are a little rough. You really don't gain much from the various shapes, since they're not leveled for epic levels. You've pretty much got to lean on your druid spells and group your way through these levels. It turns around a bit at 33 with the sudden gain of Rakshasa. Suddenly in Rak form you're immune to most magic, have a solid AC, and can wear down just about anything with ice storms. At 35 you turn the final corner, you're a nearly max AC with capabilities to do very large damage either as fire, lightning, cold, or acid, with a respectable melee option.<br/>\n<br/>\nIf I could add just one more feat, I'd pick Extend Spell. I have debated with myself over that one many times. With 28 levels of druid, you have a respectable duration on most buffs. The big bonus of extend would be for Aura of Vitality, and I just couldn't justify weakening the build's already moderate melee abilities (dropping KD or BF) for extra duration on that spell alone, especially considering that in the level 8 spell slots you've got 1 max ice storm, premonitions, and finger of deaths competing for spots. You could argue using empower instead of maximize since level 7 spells are in less demand, then grabbing extend at the expense of one of the spell penetration feats and using the 2nd druid bonus feat on wisdom. This gets slightly complicated since it delays your dragon shape, but otherwise is perfectly doable. With the mechanics of items and shifting, you want to make sure that you keep buffs up since they really help. Doubling duration a +4 bonus to STR/DEX/CON is a significant gain.<br/>\n<br/>\nLike all shifters, this build's performance varies with the itemization environment. In low magic worlds, the AC numbers this build can make are godlike. Combine that with True seeing, immunity to sneak attacks, and the damage reduction of dragon shape and you're a main tank. As items get stronger, your \"natural\" power decreases and shifters suffer from the mechanics of merging properties with shifts. Notably dragon shape only merges armor, while Rakshasa shape does merge all items. Your ideal armor for a dragon has at least 3 STR, haste, and the best +armor bonus you can muster.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:41 AM - Jun 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello there Goshozal, and welcome aboard!<br/>\n<br/>\nYou've clearly put the hard miles in with this build, which is brilliant, and it's presented excellently, so kudos all round!<br/>\n<br/>\nNow, I know absolutely nothing about Shifters and Druids (thought I'd 'fess up before someone grasses on me), so I thought I'd have a look other builds with all 3 of these classes for compare and contrast purposes. There are a couple in Hip's ECB Guild Filter and 24 in the ECB Legacy Archive. You can find these by going to the Rules and Tools forum in the threads \"ECB Guild Filter\" and \"How and Where to Access Legacy ECB Archives\". In the case of the latter, just click on the word \"Greyhawk\" in Mick Dagger's final post there. It would be really helpful if you could cast your eyes over them and tell folk how your build differs from or improves on them. Otherwise we're just in danger of replicating builds, or even coming up with inferior ones (the amount of builds I've been quite proud of then checked the Archives and ended up throwing in the bin is frankly ridiculous). I'm certainly not saying you've done that, btw - just please let us know how yours stands out.<br/>\n<br/>\nOthers may well be along with more constructive comments about the build itself, I just wanted to welcome you and applaud what you've done here.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Goshozal",
      "avatar": "no_avatar.png",
      "timestamp": "11:28 AM - Jun 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah. I had searched the forums only, I wasn't aware of the greyhawk search engine. I was wondering why there weren't more shifter builds posted on this forum. Oh well. It is very similar to a couple of builds on the Greyhawk database. The main differences are the level spread and some choices on feats. Most of the Rak builds try to include spell pen, most of the dragon builds include KD/BF and other melee feats. The \"invincible dragon\" build is the most similar to mine, but he trades the spell pen line entirely for 2 more Wis (1 ac, 1 spell DC) and imp crit:unarmed. That level spread is also quite different. Mine is played more like a straight up casting druid who gains shifting/monk levels in the epic phase. His is all over the place, notably suffering -3AB due to being 10/1/9 dru/mnk/shift at 20...<br/>\n<br/>\nThank you for pointing me to the database. If nothing else I've seen that my ability to min/max is closely mirrored by other shots folks have taken at a similar build. He beat me by one AC but my BAB is 3 points higher. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:34 AM - Jun 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Brilliant! Thanks for this, Goshozal - that's exactly what we need!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:46 PM - Jun 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">We have not had a new dragon build in quite some time.  <br/>\nI am not a Dragon expert Goshozal, but I like the possible versatility that this one offers!<br/>\nThe documentation is good, and it is valuable that you can tell from your own experience how it performs at different stages.<br/>\n<br/>\nI only want to add one question since you have taken Improved Expertise: Several mods and PWs have disabled casting in Expertise mode. Do you know if that also affects the Ice storm attacks from the Rak (and the breath weapon of the Dragon)?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Goshozal",
      "avatar": "no_avatar.png",
      "timestamp": "4:29 PM - Jun 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Mick. To answer your question, I have not played a mod with the disabled expertise casting. However, I would imagine that Rakshasa is affected, since the ice storm that it casts is a spell. The game client treats it exactly like a typical spell, even though it is derived from shapeshifting. I would not imagine that dragon breath is treated the same way. It is not a spell, but a spell-like ability. It cannot be interrupted, for example, while Rak ice storm can.<br/>\n<br/>\nThe good news is that the loss of Imp Expertise is a blow, but doesn't totally break the build. Assuming that you drop those feats, you can pick up toughness and another feat of your choice (Empower for spellbook management comes to mind). At max level, a naked, self-buffed Rakshasa is still going to have 61 AC (62 with the dodge feat that Raks get). That's before  you consider haste (66) and item AC bonus. Your best item magic bonus becomes a deflection modifier, so in a moderate magic world we can say +5 for (71). That's on par or better than a full plate wearer who's geared for AC. The only real problems arise in environments with high magic, because eventually the stacking AC bonuses on armor, shield, natural, deflection, etc. outclass the inherent bonuses of the shapes and monk AC.<br/>\n<br/>\nAfter looking at this build versus other builds on the database Stag linked, I stand by my lineup with only a few small changes:<br/>\n<br/>\nAt 15 take extend spell<br/>\nat 18 take spell pen<br/>\nat 21 take greater spell pen<br/>\nat 35 (druid level 24 bonus feat) take great wisdom<br/>\nat 36 take Dragon shape<br/>\nat 39 take Armor Skin<br/>\n<br/>\nThis effectively delays dragon by 1 level and exchanges epic prowess for extend spell. I think that 1 ab is not so severe a loss in a build that already doesn't emphasize melee. You go from a max dragon AB of 51 down to 50. In exchange you make many buffs last a great deal longer for the majority of the character's life, which really helps.<br/>\n<br/>\nThe other reason I stand by this build is playability, at least in the limited worlds that I have tried it. Many of the other builds on the database botch rule of 4 (and AB) or try to pack in shifter levels and get Rakshasa at 24. The big problem with that is that you're getting Rak shape when you're a 13 druid/10 shifter/1 monk. You only have 2 level 7 spells per day, your buffs are weak, your animal companion is level 13, and your big offensive spells (stonehold, harm, fire storm, SoV, FoD) are nearly non-existent. You gain Rak form, which has a respectable 47 AC self-buffed, but your ice storms hit for a whopping 31 damage on average. You can't max them yet. With one more level you can take that Max ice storm for a more respectable 54 damage total, but you pay a huge price to get that early access.<br/>\n<br/>\nIf you just go full druid to begin with, at level 24 you're taking your first shifter level. But you have a full druid spellbook, enhanced druid elemental shapes 3x/day (water elemental has 51 AC naked, self-buffed, with 31 AB and 5 APR without haste), you have max level summons and a level 22 animal companion with +5 enhancement to its attacks. Your buffs are not yet beyond dispel, but they're very resilient. You have 34 SR. It's just way more playable as a leveling character, even if you are facing down a long road of shifter levels before you get Rak shape. When you finally DO get there, you'll have much better stats and a 72-point ice storm that you can max as soon as you get it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:09 PM - Jun 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Don't know if this helps or hinders, but I do recall that the EE edition nerfs empower on Rak Ice Storms And that's all I know.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:01 PM - Jun 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for posting. Your build looks really interesting and you've tested it in three different campaigns. I have not played Druids or Shifter before so I've learned something by reading your post. <br/>\n<br/>\nI take it you are essentially taking 10 Shifter levels for the immunity to critical hits, and for the Rakashasa? Given you stated the shapes provided are not useful until you get to Rakashasa. Just trying to understand it better as a non-Druid player. Apologies for my lack of understanding and believe me, this is not an 'elite' question<br/>\n<br/>\nI noted in the Invincible Dragon thread there was really heated discussion (never say a build is invincible! that certainly triggered a response!) about whether Champion of Torm is better to take than Shifter, because Greater Wisdom is a CoT bonus feat and you can pump your Wisdom further with this and get an even higher AC than any shifter build would. The saves are nice obviously. I obviously have no idea if this is good. if you take four levels before 20 and take the bonus feats for some of your combat abilities, perhaps you can get 6 attacks on your dragon rather than 5? Then the rest of the CoT bonus feats when you are an epic character up to lvl 10 could be greater wisdom? <br/>\n<br/>\nNot that this is the focus of your build, as it seems you want to cast a lot of spells (which is totally fine, versatility is probably better than specialisation), Do you think CoT would make your dragon form better in combat? Would it hamper your other abilities significantly?<br/>\n<br/>\nAnyway once again, really interesting build and thanks for contributing.<br/>\n<br/>\n<strong>Addendum: </strong>I noted Maximillian Kane has posted on a D28/M2/CoT10 build <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build316635.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 16635.html</a> - I'll have a read through it as well<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Goshozal",
      "avatar": "no_avatar.png",
      "timestamp": "3:54 AM - Jun 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you guys for being so nice. It's a new post on an old forum that I always have been interested in, and it's fun to explore peoples' opinions and questions. It would have been easy to respond to this build with \"oh hey that's been fleshed out in the database you didn't know about, bye.\" But as a new poster I appreciate how welcoming you all are.<br/>\n<br/>\nYou are essentially correct, Orion, that it's taking 10 levels of shifter for access to Rakshasa. The other shifter shapes are pre-epic at 10 or lower shifter levels. You'd have to get shifter 13 before they get some buffs, maxing out at shifter 17. Even maxed at shifter 17, they are... mediocre. With a 20+ druid your good old water elemental form totally outclasses all the shifter shapes in melee stats AND he's fire immune, crit/sneak immune, and mind effect immune. The shifter shapes have some neat niche abilities (immunities, special attacks like the mindflayer blast) but those are limited in power by shifter levels, don't count druid levels, and will never be comparable Rak shape or Dragon shape's powers regardless. You can't take Rak form (or any of the epic shifter forms aside from dragon) without Shifter 10 at a minimum. There's no immunity to crits on the Rak or Dragon (other than the AC values that you can achieve). There ARE shifter shapes which can become crit immune, but those are undead (typically they focus on creating a ridiculous Risen Lord... just watch out for clerics!)<br/>\n<br/>\nThe other benefit to the 10 levels of shifter is that dragon breath has a penalty in druid builds with less than 10 levels of shifter. Hitting that minimum number yields a 4dice and 4DC bonus compared to pure druid dragons. That doesn't seem so bad until you consider that dragon breath factors shifter AND druid levels into its power and DC calculations, so you're \"losing\" another 10 levels in that as well. In my test run below you're actually losing 14 levels on top of the penalty.<br/>\n<br/>\nYour questions about CoT are interesting, indeed. You'd lose Rakshasa entirely, but you could do a couple of neat things with CoT levels. You could get dragon earlier, and potentially have a stronger melee presence in dragon shape with all the feats. Your dragon breath will suffer, though, without shifter 10.<br/>\n<br/>\nTaking 4 levels of CoT pre-20 yields 16 BAB and 2 pre-20 bonus feats. You could also do Druid 12/CoT 8 for 1 more AB but you risk the playability issues due to poor druid spell progression AND you can't pick more wisdom up pre-20. I dropped Max spell, the spell pen line, and picked up toughness, weapon focus: scimitar (required for CoT; you can't CoT off of WF: unarmed), then added called shot and imp crit: unarmed. According to Zelle, Imp:Crit unarmed is the ONLY unarmed feat that works with shifter shapes; weapon focus and EWF are a nonstarter, which hurts. I started picking up extra WIS at 21. Got 30 wis and dragon shape by 30. There's really no reason to go past druid 24 in this build: you don't need the levels for ice storm power, and the druid bonus feat at 28 can be replaced with a CoT bonus feat, more hp and higher saves. At Druid 24 you have a maxed out spellbook, dispell immunity, and max bonus on owl's wisdom (+12). I also grabbed AS and Epic prowess for the dragon, gaining a total of +4 Wis from CoT feats.<br/>\n<br/>\nAt 40, I had: Druid 24 / Monk 2 / CoT 14<br/>\n<br/>\nWis of 36 unbuffed<br/>\n468 HP<br/>\nNaked AC of 33<br/>\nSaves F/R/W 33/26/41 (+9 Spellcraft)<br/>\n6 APR unarmed<br/>\n<br/>\nWith owl's wisdom, barkskin, STR, and extended AoV:<br/>\n<br/>\n548 HP<br/>\n46 AC (56 with Exp)<br/>\n<br/>\nIn Dragon Shape:<br/>\n<br/>\n1008 HP (!)<br/>\n43 (base) -2 (penalty) +2 (AS) + 19 (Wis) + 5 (Bark) + 8 (Tumble) + 2 (AoV) = <strong>77 AC</strong>. With haste, Expertise, and a +5 item you could hit <strong>96 AC</strong>.<br/>\n26 (BAB) + 23 (dragon with STR and AoV) +1 (EP) = 50 AB (could be 52 with max STR). According to Zelle's, theres a hidden -2 penalty to dragon AB due to size. This would be 48 AB with a cap of 50.<br/>\nSaves F/R/W 44/41/47 (!)<br/>\n<br/>\nI also picked up Extra Stunning attacks due to an odd number of feats, increasing the number of stunning fists/day to 5 with a DC of 49. It's also worth noting that a base WIS of 36 gives you a nice number of spells/day as a druid. That's 6/day for everything from level 6 and up. Your SoV DC would be 38, versus the 36 DC on my build. If you went all-out on Wisdom you could drop prowess and extra stunning to get 2 more wis for 1 AC and 1 DC to spells, losing the extra stuns and 1 AB.<br/>\n<br/>\nUnfortunately, without shifter you're looking at a fire dragon breath of only 8d10 with a DC of 23. If you kept 28 druid levels, you'd lose 2 to all saves and 8 HP to raise that to 12d10 with a DC of 25.<br/>\n<br/>\nSo here's the thing. Dragon shape's melee power is naturally good due to the stats that it confers. The mechanics of shifting prevents it from gaining much from other feats (per Zelle, WF and EWF don't work). My Rak/Dragon shifter build has a max AB of 50 (no EP, loses the +1AB of this build). With Zelle's penalty that's 48. But this build, for all its effort to increase WIS, gains:<br/>\n<br/>\nHP (toughness, CoT levels)<br/>\n+7 all saves (CoT)<br/>\n+2 AC (more wis at 40)<br/>\n+2 AB (as above)<br/>\n<br/>\nWhile it loses:<br/>\n<br/>\nRak form (immunity 8 and lower spells, notably IGMS and horrid wilting) with infinite ice storms at CL 34<br/>\n4 SR (36 vs 40 SR from buffs)<br/>\n14d10 damage and 12 DC on fire breath<br/>\n<br/>\nIf the bonuses to dragon OFFENSIVE power were better, I think you'd have a good tradeoff. As it is, I personally would still pick my build.<br/>\n<br/>\nAddendum: One thing I've noticed is that dragon AB calculations can't be correct. I'm not sure if it's faulty implementation by the game, or what. Aside from the \"hidden\" -2 penalty per Zelle, the dragon claws are supposed to have a +6 enhancement. That's not reflected on the char sheet AB, which simply totals BAB with the dragon STR bonus and applicable feats. But the char sheet doesn't show the penalty either... so actual AB may be 4 points higher for all dragons? I dunno.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:28 AM - Jun 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Two things:<br/>\nNever trust the character sheet.  If you want to see how things work, read the combat log.<br/>\nThe -2 to AB is caused by the creature size of the Dragon shape.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:16 AM - Jun 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Goshozal wrote:</cite>[text shortened]<br/>\n<br/>\nSo here's the thing. Dragon shape's melee power is naturally good due to the stats that it confers. The mechanics of shifting prevents it from gaining much from other feats (per Zelle, WF and EWF don't work). My Rak/Dragon shifter build has a max AB of 50 (no EP, loses the +1AB of this build). With Zelle's penalty that's 48. But this build, for all its effort to increase WIS, gains:<br/>\n<br/>\nHP (toughness, CoT levels)<br/>\n+7 all saves (CoT)<br/>\n+2 AC (more wis at 40)<br/>\n+2 AB (as above)<br/>\n<br/>\nWhile it loses:<br/>\n<br/>\nRak form (immunity 8 and lower spells, notably IGMS and horrid wilting) with infinite ice storms at CL 34<br/>\n4 SR (36 vs 40 SR from buffs)<br/>\n14d10 damage and 12 DC on fire breath<br/>\n<br/>\nIf the bonuses to dragon OFFENSIVE power were better, I think you'd have a good tradeoff. As it is, I personally would still pick my build.<br/>\n<br/>\nAddendum: One thing I've noticed is that dragon AB calculations can't be correct. I'm not sure if it's faulty implementation by the game, or what. Aside from the \"hidden\" -2 penalty per Zelle, the dragon claws are supposed to have a +6 enhancement. That's not reflected on the char sheet AB, which simply totals BAB with the dragon STR bonus and applicable feats. But the char sheet doesn't show the penalty either... so actual AB may be 4 points higher for all dragons? I dunno.\n</div></blockquote>\nThanks so much for your analysis which was very detailed and appears very carefully considered. It sounds like you gain a lot of offensive power from the Rak form and buff to Dragon Breath. HP, +2 AC and +2AB and 6APR sounds good but I agree the Buff to Dragon Breath sounds like it more than compensates for it, allow you to be a very effective dragon. To be honest, if I were a dragon I wanna be using that ability effectively. Like I mean its pretty demoralising to breath fire and it just tickles them? <br/>\n<br/>\nRak form sounds super strong!<br/>\n<br/>\n+7 to saves is pretty significant (its like a 35% increased chance for your hero to avoid certain effects, traps and spells of comparable range), but did you actually ever encounter problems with saves in Aielund with your build when you were shapeshifted?  Like you mentioned some of the forms have quite significant immunities that make this not super important?<br/>\n<br/>\nI can kind of of imagine you fighting the ending boss in Act 4 pt 3 as a dragon with ridiculous AC without needing any healing or regeneration, toe-to-toe, mano a mano by the way!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Goshozal",
      "avatar": "no_avatar.png",
      "timestamp": "8:10 AM - Jun 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's a PvM campaign, so saves are not tested as roughly as in a PvP or PW setting. But no, I never had much trouble. Probably the only memorable rough time was against the dracolich in the underworld. His fear aura was nasty, and I ended up tossing on a guiding light belt to manage that fight. I could have used a mind-immune form but I fought it in caster mode.<br/>\n<br/>\nYou're correct about the end boss... I had just gotten dragon but I was so tanky it was a bit of overkill. I ended up toe-to-toe against the giant bebilith while Robert worked his way through the Epic Warding on the boss himself. I never had to heal. Nellise just kind of cheered us on.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:51 AM - Jun 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Goshozal wrote:</cite>\nIt's a PvM campaign, so saves are not tested as roughly as in a PvP or PW setting. But no, I never had much trouble. Probably the only memorable rough time was against the dracolich in the underworld. His fear aura was nasty, and I ended up tossing on a guiding light belt to manage that fight. I could have used a mind-immune form but I fought it in caster mode.<br/>\n<br/>\nYou're correct about the end boss... I had just gotten dragon but I was so tanky it was a bit of overkill. I ended up toe-to-toe against the giant bebilith while Robert worked his way through the Epic Warding on the boss himself. I never had to heal. Nellise just kind of cheered us on.\n</div></blockquote>\n\nThis forum totally needs a screenshot of giant dragon vs giant spider! :) mark it as a spoiler though<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "palswim",
      "avatar": "10759152_1569536705.png",
      "timestamp": "10:00 PM - Sep 25, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Goshozal wrote:</cite>At 22 the monk level gives a nice big bump to AC with the wisdom bonus and 5 AC from tumble. Your shapes get a minor boost to viability at this point from the big AC upgrade, though they begin to lack AB as time wears on.</div></blockquote>\nI am finding that the Aielund Saga seems to block the Monk AC bonus from Wisdom. Without shifting, the Character Sheet includes the Monk AC bonus. But, whenever I shift as a level 1 or 2 Monk, the Character Sheet matches the AC of the character without the Monk AC bonus.<br/>\n<blockquote><div><cite>Mick Dagger wrote:</cite>Never trust the character sheet.  If you want to see how things work, read the combat log.</div></blockquote>\nPerhaps the Character Sheet is lying, but I also see an \"AC Decreased\" status when I shift as well.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/hakpak/aielund-hakpack-v301\" rel=\"noreferrer\" target=\"_blank\">The Aielund Saga uses the Enhanced Magic System</a>, which has very little in the way of documentation, and I found that if I overrode the <em>x2_s2_gwildshp.ncs</em> file with the version from the base game, the Monk AC bonus returned as I would expect (and reflected on the Character Sheet).<br/>\n<br/>\nI tested with a 5 Druid/3 Shifter, and then leveled that character with varying combinations of classes to see if the active blocking of the Monk AC bonus happened only with lower levels or certain combinations, but I could not find any configuration that would remove the block.<br/>\n<br/>\nSo, <em class=\"mention\">@Goshozal</em>, you played through the Aielund Saga without seeing this block, or dealing with this block, or finding that the block lifted in your circumstances?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}