{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "424",
  "name": "Armored Monk build(in work)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/armored-monk-build-in-work-t2297444.html",
  "author": "JollyBaboon",
  "avatar": "10235235_1549015559.jpg",
  "replies": 6,
  "posts": [
    {
      "author": "JollyBaboon",
      "avatar": "no_avatar.png",
      "timestamp": "11:06 PM - Nov 12, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Good day, all. I've got a unique idea for a build, but I just can't hammer out the details. I thought I'd ask for the help of people who know a lot about character builds. My idea is a heavy armor and tower shield wearing Monk with an ability focus in Str and Con.<br/>\n<br/>\nI got the idea playing a Dwarven Defender one day, and while they are great for taking on physical threats, mages just tear them up. Fingers of death, hold person, all manner of Bigby's hand-fetishes, horrid wilting, ice storm... heck, even a normal fireball will do significant damage to those angry, little dwarves. True, high fortitude saves and loads of HP help keep them alive longer than other classes, but it's a losing battle nonetheless.<br/>\nSo, there's two things you can do to make yourself immune to spells: Mantles and spell resistance. Naturally, having full plate armor and a large shield pretty much rules out mantles, and while clerics do have a spell resistance spell, it can be dispelled and it caps out low against epic level customers. What's a guy to do, then? Go monk. The class' natural spell resistance cannot be lowered, and if the right number of boosting feats are taken, the resistance goes high enough that no spell that checks against resistance will pierce through.<br/>\n<br/>\nProblem solved? Not for me. My idea of a tank isn't a guy in a robe who has low HP to the point where if he's not dodging, he's dying. Put some armor on that guy! So I tried making a Monk/DD, but to get spell resistance up to a reasonable level (62+) you got to have a lot of Monk, and a lot of epic feats dedicated to improving SR. That just doesn't mix with enough DD levels to contribute much. The combination just isn't viable for my purposes.<br/>\n<br/>\nSo, I went full Monk. Focused in Con to give a boost to HP and to qualify for epic damage reduction. Three feats will give the character 9/- DR, as opposed to 6/- from TEN levels of DD. Unfortunately, having 22 Con (21 for the epic DR feats, 22 for 40 more HP at max level) means skimping on other abilities. Raising Wis won't add AC due to armor, and raising Dex above 12 won't do anything for full plate armor. So I figured why not buff Str and let him hit back a little harder.<br/>\nAfter some tweaking, this happened:<br/>\n<br/>\nArmored Monk - Fighter(1), Monk(39)<br/>\nHuman - Human gives Strong Soul and a few skillpoints for listen, but Dwarf could give +2 to Con. Both avoid XP penalties.<br/>\nLawful Neutral - Lawful for Monk, Neutral to avoid Smite Good/Evil and spells that buff against good/evil.<br/>\nPvM, but perhaps PvP<br/>\n<br/>\nABILITIES(ending)<br/>\nSTR: 16 (22)<br/>\nDEX: 12<br/>\nCON: 18 (22)<br/>\nWIS: 8<br/>\nINT: 8<br/>\nCHA: 8<br/>\n<br/>\nBASIC STATS<br/>\nHitpoints: ~520<br/>\nSkillpoints: 164<br/>\n<br/>\nSaving Throws (Fortitude/Reflex/Will): 33/25/24<br/>\nSaving Throw bonuses: +2 vs mind-affecting, +1 vs Death magic<br/>\n<br/>\nBAB: 25<br/>\nAB:+31/+26/+21 (mundane weapon and tower shield)<br/>\nAC (naked/mundane full plate armor and tower shield): 26/30<br/>\n<br/>\nSKILLS<br/>\nConcentration: 43 (52)<br/>\nDiscipline: 43 (52)<br/>\nListen: 38 (37) - Leftover points went here<br/>\nTumble: 40 (23)<br/>\n<br/>\nLEVELING GUIDE<br/>\n01: Fighter(1): Luck of Heroes, Strong Soul, Blind-Fight<br/>\n02: Monk(1):<br/>\n03: Monk(2): Toughness<br/>\n04: Monk(3): Con+1, Con 19<br/>\n05: Monk(4):<br/>\n06: Monk(5): Great Fortitude<br/>\n07: Monk(6): <br/>\n08: Monk(7): Con+1, Con 20<br/>\n09: Monk(8): Iron Will<br/>\n10: Monk(9): <br/>\n11: Monk(10): <br/>\n12: Monk(11): Lightning Reflexes, Con+1, Con 21<br/>\n13: Monk(12): <br/>\n14: Monk(13): <br/>\n15: Monk(14): Skill Focus: Concentration*<br/>\n16: Monk(15): Con+1, Con 22<br/>\n17: Monk(16): <br/>\n18: Monk(17): Skill Focus: Discipline*<br/>\n19: Monk(18): <br/>\n20: Monk(19): Str+1, Str 17<br/>\n21: Monk(20): Epic Damage Reduction 1<br/>\n22: Monk(21): <br/>\n23: Monk(22): <br/>\n24: Monk(23): Epic Damage Reduction 2, Str+1, Str 18<br/>\n25: Monk(24): <br/>\n26: Monk(25): Epic Damage Reduction 3<br/>\n27: Monk(26): Improved Spell Resistance 1<br/>\n28: Monk(27): Str+1, Str 19<br/>\n29: Monk(28): <br/>\n30: Monk(29): Improved Spell Resistance 2<br/>\n31: Monk(30): Improved Spell Resistance 3<br/>\n32: Monk(31): Str+1, Str 20<br/>\n33: Monk(32): Improved Spell Resistance 4<br/>\n34: Monk(33): <br/>\n35: Monk(34): <br/>\n36: Monk(35): Improved Spell Resistance 5, Improved Spell Resistance 6, Str +1, Str 21<br/>\n37: Monk(36): <br/>\n38: Monk(37): <br/>\n39: Monk(38): Improved Spell Resistance 7<br/>\n40: Monk(39): Str+1, Str 22<br/>\n* = Feats taken that could be easily changed<br/>\n<br/>\nSpell Resistance: 63<br/>\nDamage Reduction: 9/-, 20/+1<br/>\n<br/>\nOne level of Fighter gave me all the armor feats, shield proficiency, and simple/martial weapons proficiency. In addition to the SR and DR, we have cleave, immunity to poisons and diseases, empty body (50% concealment) 2/day, improved evasion, improved knockdown, immunity to mind-affecting spells and effects, and wholeness of body (78 HP heal) 1/day. Stunning Fist and Quivering Palm are next to useless with a low Wis, and the rest of the monk abilities are disabled by the armor/shield.<br/>\n<br/>\nThe SR, immunities, and reasonably high saving throws should keep most magic away, and shrugging off nine damage with every physical hit is nice. I am worried about the AC and HP though. I'm thinking of sacrificing some points of Str for more Con, and thus more HP. Making the character a dwarf instead of a human would help the HP count as well. The AC is pretty much my only worry, as there's not much I can do but hope for some monk-only AC/Haste items.<br/>\n<br/>\nHow could I improve this build while still keeping the basic \"Armored Anti-spellcaster\" vibe?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:26 AM - Nov 13, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It looks like you're making a decoy build. A decoy's role is to draw aggro (get the enemy to attack him) and let his party mates do the attacking with impunity. There is not much that can be done without completely changing the build, especially losing the armor.<br/>\n<br/>\nHere's a better decoy, with better AC, better saves (including +6 against spells), better AB, and more attacks per round, but with no EDR, less health, 5 less SR, and he loses the Armored-Monk cool factor. I dropped the EDR to get better AC, thinking that it is better to not get hit than to be able to take a hit. Also, his AB is now good enough that he should be able to hit the mobs, so he is more of a tank.<br/>\n<br/>\nDecoy Monk (Monk 30 / Fighter 10)<br/>\nDwarf, Lawful Neutral<br/>\nPlayable 1 - 40, PvM<br/>\n<br/>\nAbilities:<br/>\nSTR: 10<br/>\nDEX: 18 (28)<br/>\nCON: 14<br/>\nWIS: 12<br/>\nINT: 12<br/>\nCHA: 6<br/>\n<br/>\nLeveling Guide:<br/>\nDwarf: (Darkvision, Defensive Training vs. Giants, Stonecunning, Hardiness vs. Poison, Hardiness vs. Spells, Offensive Training vs. Goblinoids, Offensive Training vs. Orcs, Skill Affinity: Lore)<br/>\n01: Monk(1): Luck of Heroes, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n02: Monk(2): {Deflect Arrows}<br/>\n03: Fighter(1): Weapon Finesse, Weapon Focus: Unarmed<br/>\n04: Fighter(2): DEX+1, Blind Fight, (DEX=19)<br/>\n05: Monk(3)<br/>\n06: Monk(4): Iron Will<br/>\n07: Monk(5)<br/>\n08: Monk(6): DEX+1, {Knockdown, Improved Knockdown}, (DEX=20)<br/>\n09: Fighter(3): Lightning Reflexes<br/>\n10: Fighter(4): Weapon Specialization: Unarmed<br/>\n11: Monk(7)<br/>\n12: Monk(8): DEX+1, Great Fortitude, (DEX=21)<br/>\n13: Monk(9): {Improved Evasion}<br/>\n14: Monk(10)<br/>\n15: Monk(11): Resist Energy: Acid<br/>\n16: Monk(12): DEX+1, (DEX=22)<br/>\n17: Monk(13)<br/>\n18: Monk(14): Resist Energy: Fire<br/>\n19: Monk(15)<br/>\n20: Monk(16): DEX+1, (DEX=23)<br/>\n21: Monk(17): Improved Spell Resistance I<br/>\n22: Monk(18)<br/>\n23: Fighter(5)<br/>\n24: Monk(19): DEX+1, Improved Spell Resistance II, (DEX=24)<br/>\n25: Monk(20)<br/>\n26: Fighter(6): Epic Weapon Focus: Unarmed<br/>\n27: Monk(21): Improved Spell Resistance III<br/>\n28: Fighter(7): DEX+1, (DEX=25)<br/>\n29: Fighter(8): Armor Skin<br/>\n30: Monk(22): Improved Spell Resistance IV<br/>\n31: Fighter(9)<br/>\n32: Monk(23): DEX+1, (DEX=26)<br/>\n33: Monk(24): Improved Spell Resistance V<br/>\n34: Fighter(10): Epic Weapon Specialization: Unarmed<br/>\n35: Monk(25): Improved Spell Resistance VI<br/>\n36: Monk(26): DEX+1, Improved Spell Resistance VII, (DEX=27)<br/>\n37: Monk(27)<br/>\n38: Monk(28)<br/>\n39: Monk(29): Improved Spell Resistance VIII<br/>\n40: Monk(30): DEX+1, Improved Spell Resistance IX, (DEX=28)<br/>\n<br/>\nStats:<br/>\nHitpoints: 420<br/>\nSkillpoints: 195<br/>\nSaving Throws (Fortitude/Will/Reflex): 29/25/33<br/>\nSaving Throw bonuses: Spells: +6, Mind Effects: +2, Poison: +2<br/>\nSpell Resistance: 58<br/>\nBAB: 26<br/>\nAB (max, naked): 38 (melee), 35 (ranged)<br/>\nAC (naked/mundane armor/shield only): 36/36<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nSkills:<br/>\nConcentration 43(45), Discipline 43(43), Listen 31(32), Spellcraft 19(20), Tumble 40(49)<br/>\n<br/>\n01: Concentration(4), Discipline(4), Listen(4), Spellcraft(2), Tumble(4)<br/>\n02: Concentration(1), Discipline(1), Tumble(1), Save(2)<br/>\n03: Concentration(1), Discipline(1), Spellcraft(1), Save(1)<br/>\n04: Concentration(1), Discipline(1), Save(2)<br/>\n05: Concentration(1), Discipline(1), Spellcraft(1), Tumble(3)<br/>\n06: Concentration(1), Discipline(1), Listen(2), Tumble(1)<br/>\n07: Concentration(1), Discipline(1), Listen(2), Tumble(1)<br/>\n08: Concentration(1), Discipline(1), Listen(2), Tumble(1)<br/>\n09: Concentration(1), Discipline(1), Save(1)<br/>\n10: Concentration(1), Discipline(1), Spellcraft(1)<br/>\n11: Concentration(1), Discipline(1), Tumble(3)<br/>\n12: Concentration(1), Discipline(1), Spellcraft(1), Tumble(1)<br/>\n13: Concentration(1), Discipline(1), Spellcraft(1), Tumble(1)<br/>\n14: Concentration(1), Discipline(1), Spellcraft(1), Tumble(1)<br/>\n15: Concentration(1), Discipline(1), Spellcraft(1), Tumble(1)<br/>\n16: Concentration(1), Discipline(1), Listen(2), Tumble(1)<br/>\n17: Concentration(1), Discipline(1), Listen(2), Tumble(1)<br/>\n18: Concentration(1), Discipline(1), Listen(2), Tumble(1)<br/>\n19: Concentration(1), Discipline(1), Spellcraft(1), Tumble(1)<br/>\n20: Concentration(1), Discipline(1), Spellcraft(1), Tumble(1)<br/>\n21: Concentration(1), Discipline(1), Save(3)<br/>\n22: Concentration(1), Discipline(1), Spellcraft(1), Tumble(2), Save(2)<br/>\n23: Concentration(1), Discipline(1), Save(3)<br/>\n24: Concentration(1), Discipline(1), Spellcraft(1), Tumble(2), Save(2)<br/>\n25: Concentration(1), Discipline(1), Spellcraft(1), Tumble(1), Save(2)<br/>\n26: Concentration(1), Discipline(1), Listen(2), Tumble(1)<br/>\n27: Concentration(1), Discipline(1), Spellcraft(1), Tumble(1)<br/>\n28: Concentration(1), Discipline(1)<br/>\n29: Concentration(1), Discipline(1), Spellcraft(1)<br/>\n30: Concentration(1), Discipline(1), Tumble(3)<br/>\n31: Concentration(1), Discipline(1)<br/>\n32: Concentration(1), Discipline(1), Spellcraft(1), Tumble(2)<br/>\n33: Concentration(1), Discipline(1), Spellcraft(1), Tumble(1)<br/>\n34: Concentration(1), Discipline(1)<br/>\n35: Concentration(1), Discipline(1), Spellcraft(1), Tumble(2)<br/>\n36: Concentration(1), Discipline(1), Listen(2), Tumble(1)<br/>\n37: Concentration(1), Discipline(1), Listen(2), Tumble(1)<br/>\n38: Concentration(1), Discipline(1), Listen(3)<br/>\n39: Concentration(1), Discipline(1), Listen(3)<br/>\n40: Concentration(1), Discipline(1), Listen(3)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:39 AM - Nov 13, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>JollyBaboon wrote:</strong>//My idea is a heavy armor and tower shield wearing Monk with an ability focus in Str and Con.<br/>\n// So, there's two things you can do to make yourself immune to spells: Mantles and spell resistance. <br/>\n// What's a guy to do, then? Go monk. The class' natural spell resistance cannot be lowered, and if the right number of boosting feats are taken, the resistance goes high enough that no spell that checks against resistance will pierce through.</div></blockquote>You will need SR 67 to be sure to resist spells from a lvl 40 caster with epic spell penetration. That takes 39 or 40 levels of monk and ISR9. That means there will not be room for much else.<br/>\n<blockquote><div>Problem solved? Not for me. My idea of a tank isn't a guy in a robe who has low HP to the point where if he's not dodging, he's dying. Put some armor on that guy!</div></blockquote>In most cases a high level monk in robes with focus in dex and with some wis will get a much higher AC than what full plate and tower can provide. A dexer will need uncanny dodge (eg. from 2 levels of SD) and do even better with epic dodge (with 5 levels of SD).<br/>\n<blockquote><div>So, I went full Monk. Focused in Con to give a boost to HP and to qualify for epic damage reduction. Three feats will give the character 9/- DR, as opposed to 6/- from TEN levels of DD. Unfortunately, having 22 Con (21 for the epic DR feats, 22 for 40 more HP at max level) means skimping on other abilities.</div></blockquote>The con/EDR investment takes focus away from full DR (the main intention of your build). It also leaves no room for a reasonable AB, the low AB is a main weakness of your build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "JollyBaboon",
      "avatar": "no_avatar.png",
      "timestamp": "3:51 PM - Nov 13, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you both for your suggestions!<br/>\n<br/>\nEmpyre, a decoy build is exactly what I was going for! I only took points in Str so that if I was caught solo or with a less than DPS focused build ally I'd still be able to stand a chance. I was hoping to keep the armor on the monk, but that build did inspire me a bit. I could lose listen completely and cross-class spellcraft to get better save vs spells instead. Also I completely forgot about Resist Energy! Forget the skill focus feats, having a bit of resistance built right in is so much better.<br/>\n<br/>\nNow that I think about it, is having a fortitude save +8 or higher the only prereq for the RE feats? I'd like to think I would have taken them if I saw them on the list, but maybe I just overlooked them.<br/>\n<br/>\nMick (love the name by the way), you basically voiced all the concerns I had coming up with builds focusing on a monk. I've never really delved too deep into the monk class before, and I noticed the vast majority of characters with monk levels were either adding a few levels to another class for the (impressive) built in feats, or focusing on Dex/Wis. I thought that was due to a lack of creativity and imagination, but I see I was very, VERY incorrect on that theory when I worked with one. The class basically forces you down a slim few general builds, since deterring from those sacrifices so much. Those forced build paths result in powerful characters, don't get me wrong, but I was aiming for something... different in a monk. Turns out being different when you're a monk means being handicapped drastically.<br/>\n67 SR was the magic number for my early builds, but like you pointed out, there's little wiggle room for that. So I figured sacrificing a bit of SR for more room was a good enough trade, considering the HP and saving throws were a nice catch all and that the spellcaster still has to see if his d20 roll goes the right way to even have a hope of breaking through. I traded magic immunity for near magic immunity and a lot more room to work, and I think that was a good trade overall.\n<blockquote><div>The con/EDR investment takes focus away from full DR (the main intention of your build). It also leaves no room for a reasonable AB, the low AB is a main weakness of your build.</div></blockquote>\nI imagine you meant full SR, and that's what it boils down to with the trade I mentioned. AB was the major sacrifice that I tried to remedy by pumping extra points into Str, and it didn't help it as much as I was hoping. I think I might just sacrifice Str (and AB) altogether and just pump Con the whole way, making the character less of a tank and more of a wall. (It's only dangerous if he falls on you!) Basically that means the build itself absolutely needs backup in order to win even minor battles, but I think that's okay as a PvM build. At the very least, the character is memorable for being the only monk to ever embrace armor. Who doesn't want to adventure with a unique party member like that, right?<br/>\n<br/>\nI hope to get a lot of fun out of this guy, but I probably won't publish the build; it's most likely not going to be helpful to anyone except as a teaching tool to demonstrate why having monks with armor is less than ideal no matter what. Still, thank you guys for your advice, it was exactly what I was hoping for.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:37 AM - Nov 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>is having a fortitude save +8 or higher the only prereq for the RE feats?</div></blockquote>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Main_Page\" rel=\"noreferrer\" target=\"_blank\">The NWN Wiki</a> is a great resource for questions like that. The answer in this case is yes, +8 Fortitude save is all you need for Resist Energy, but you need to have it before the level on which you taker the feat, not just reaching it when you want to take the feat.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:14 AM - Nov 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">These one-trick-pony builds never appealed to me, but if it has some RP value or cuteness factor for you, then go with it, I guess.<br/>\n<br/>\nDefinitely only for PvM with poor mage AI environments.  All any PvP mage need to do is erect recipro shields, stack a few empowered Evard's on you, polymorph into Red Dragon or Iron Golem, cast Epic Warding on their new shape and spank your monk inside the tentacle field which, btw, will only save vs. the paralyzation, not the bludgeoning.  Since your toon will be hitting only on 20's with the crap AB progression, you will be lucky to last more than a few rounds...  so much for tanking.  You are going to need at least 5 feats of Epic Energy Resistance just to cut the acid damage in half (vs. a high-level mage, that is)... which is w-a-a-y beyond the scope of this toon.   Pre-epic RE is pretty much a waste of feats with a paltry compensation.  And even EER  won't help against Death Armor or Elemental Shield either (unless you are pulling feats out of your sleeve somehow)... so much for walling.  Against any decent mage, you'll need CoT levels in there to keep up with the DCs of epic-focused schools.<br/>\n<br/>\nThere is a reason monk designs don't use armor or non-monk weapons.  All it does is neutralize the most powerful abilities a monk has.  You lose all the closing speed, the AB progression and the non-conditional AC all for the sake of SR godliness.  As has been mentioned already, you'll achieve a higher AC rating with DEX+WIS than armor+shield.... easily... and be able to tumble away from lots of AoOs besides.<br/>\n<br/>\nNow, if the mage AIs are inept enough, just build a speedy KD specialist, even a taunter.  No damage needs to be absorbed or resisted against a prone mage.  <br/>\n<br/>\nI'd be interested to analyze those other builds that you feel are not doing what you would like, to see if they could be improved with some adjustments.  Perhaps your success or failure is due more on how you are playing the build than the build itself?  Quality builds were not designed to be effective indiscriminately in everyone's hands.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:20 PM - Dec 05, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>JollyBaboon wrote:</strong> At the very least, the character is memorable for being the only monk to ever embrace armor. Who doesn't want to adventure with a unique party member like that, right?</div></blockquote>\nThere are some strong armored builds with monk out there like <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build191493.html#page1\" rel=\"noreferrer\" target=\"_blank\">this</a> one. Note that here monk is a minor class that adds some features to a weaponmaster build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}