{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "190",
  "name": "Monk/blackguard build (desined for Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/monk-blackguard-build-desined-for-arelith-t2354487.html",
  "author": "blastmaster",
  "avatar": "no_avatar.png",
  "replies": "1",
  "views": "1.0K",
  "posts": [
    {
      "author": "blastmaster",
      "avatar": "no_avatar.png",
      "timestamp": "9:59 PM - Dec 30, 2015",
      "content": "<div><span style=\"color:#000000\">Hello, community. I need your advice on building monk/blackguard character for Arelith server.<br/>\n A little bit about myself: i'm familiar with NWN and basic rules of building characters for PvM (like OC campaingn and both expansions), but this time i'd like to try something new (to play on PW server).<br/>\n This will be my first roleplaying attemp so any advices from more experienced players would be helpful.<br/>\n Some information  for character:</span><br/>\n 1) PvM or PvP - mostly for PvM<br/>\n 2) Level cap - 30 lvl (and 3 cosiquent  levels for any class that would be taken next)<br/>\n 3) Class preference - monk and blackguard (for the third class i think of cleric or rogue (not sure about the last)<br/>\n 4) Melee preference - fists combined with monk IKD <br/>\n 5) Max. item enchantment is +3<br/>\n 6) Spellcasting - blackguard spells<br/>\n I'd like to utilize blackguard Dark blessing ability - so no penalty to charisma<br/>\n<br/>\n Um... that's all<br/>\n Thanks for your future replies.<br/>\n<br/>\n P.S<br/>\n I applogize if this message seems impolite or illiterate (my native laguage is not english)<span style=\"color:#212121\">I apologize if the letter seem impolite</span><span style=\"color:#212121\">I apologize if the letter seem impolite</span><span style=\"color:#212121\">I apologize if the letter seem impolite</span><span style=\"color:#212121\">I apologize if the letter seem impolite</span></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:59 AM - Dec 31, 2015",
      "content": "<div>Fisting will nerf some of your most potent divine buffs, specifically GWM &amp; Darkfire.  That means unless you find +5 gloves, you won't be able to penetrate Stoneskin.  Since you have indicated +3 as the highest weapon enhancement you'll be limited.  Some divine buffs (like Divine Favor, Battletide) will pass through but you are talking only a few points of magical damage.  On the positive side, you'll be able to buff up STR, WIS, DEX &amp; CHA with Empowered spells by around +6 (mod +3) which help with damage, your DB saves and Divine Might/Shield boost and duration should you decide to elect that path.<br/>\n<br/>\n With Monk, I expect a WIS build to be the path of least resistance.  Ability spread something like Str14(18) - Dex10- Wis15(18) - Int12 - Cha14 for Mnk12/Clc15/BG3. It really spreads abilities thin though a cleric can overcome most of those deficiencies.  However, those buffs are transitive with only 15 levels so expect to get dispelled fairly easily when those type are roaming around.  This split gets monk to the SR feat and stops there.  You'll be able to max Disc, Hide, Mv Sil, 30 ranks to Tumble and SpCrft but that's about all.<br/>\n<br/>\n I enjoy playing an SF monk myself, mainly for giggles, but it can tough once you begin facing high DRs (which I am sure you will in any PvP you attempt).  Your stun DC will be good, but so what?  You need to do lots of damage those two rounds, not just a few pecks while they are prone.  Not to mention dealing with damage shields.  Not pretty.<br/>\n It will work but TBH I don't like it without a kama for the reasons mentioned above.  You'll have plenty of AC and good stealth but damage could be so much better.  It just seems like a forced fit to me, not optimized enough for my taste.<br/>\n<br/>\n As an alternative, I've noticed some monk/BG/assassin builds that look like they would be worth investigating if you are interested.   Combining sneaks with DA seems worth considering.</div>"
    }
  ]
}