{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "557",
  "name": "The Mountain Mystic : Druid 18/Wizard 21/Monk 1",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-mountain-mystic-druid-18-wizard-21-monk-1-t2355519.html",
  "author": "TheSquid",
  "avatar": "10759318_1592552655.jpg",
  "replies": 19,
  "posts": [
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "1:46 PM - Jul 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">EDIT: made some final changes after playtesting, posted <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-wood-witch-druid-18-wizard-21-monk-1-t2355561.html\" rel=\"noreferrer\" target=\"_blank\">the final build (Wood Witch)</a> in the level 40 section.<br/>\n<br/>\nI wanted to try to build a character with full Druid and arcane spellbooks. Given this premise, I figured I'd try to get both Dragon Shape and Epic Warding (the greed). I found no characters with these properties using the epic character search engine, and the only builds I found which get both DS and EW are variations of \"Puff the magic Dragon\", which are illegal nowadays. <br/>\nSo this might be something new, or it more likely has been tried and never posted because it's bad.<br/>\n<br/>\nSo, our requirements mean we have to go Druid 18 and Wizard or Sorcerer 21. This leaves one free level, which must be taken at level 40. I don't want no druid paladin, so I went with Wizard as the arcane class. For the last level I think the strongest contenders are Druid 19 for an extra elemental shape/day and several spell slots, Monk for evasion, wisdom AC and UBAB in dragon shape, tumble and discipline; and Rogue for tumble, UMD and trap skills. I chose Rogue in the end, can be persuaded otherwise. <br/>\n<br/>\nI went with wisdom 32/ intelligence 20, so that resting with capped WIS gives an extra level 9 Druid slot. This means that the DC on Wizard spells will be bad and you should aim to use the no-save ones. Luckily, these includes such diverse items as Time Stop, IGMS, and Mord; and a Druid is very happy to have those. The casting power on Druid is good (DC on conjuration spells is 3 less than max), but you have few slots. And   finally, Wizard does get some nice conjuration spells too, for crazy crowd control against low saves mobs. <br/>\n<br/>\nAnother synergy when levelling is damage shields coupled with the high AB/ low AC of bear and earth elemental form. You can play like an animal spellsword!<br/>\n<br/>\nRace-wise, I considered human, gnome and dwarf. Gnome is nice and gives no xp penalty, but you will never be able to carry any loot with 6 strength. This might be the best choice depending on how the animal companion inventory is implemented though. <span style=\"text-decoration:line-through\">I went with dwarf for the extra con and the weirdness of it, hence the name (this, and the fact that I plan to use earth elemental much more than most druids).</span><br/>\nI will probably play this on World of Greyhawk, so <span style=\"text-decoration:line-through\">xp penalty is not so important and</span> one can make very good use of craft wand and scribe scroll.  Edit: I reverted to Human, the extra feat is nice and all dwarven (and gnomish) goodies are lost when shapeshifted anyway.<br/>\n<br/>\nOverall I think this is an interesting concept , might be good or bad I cannot tell. I will definitely playtest this after hearing the experts' thoughts. <br/>\n<details><summary>Spoiler</summary>\n\n\n</details>\n<details><summary>Spoiler</summary>\n\n</details>\n<br/>\nEdit: apparently I cannot use tapatalk on mobile. I will keep editing this post with the rest of my explanations and the actual build. <br/>\nEdit: added the actual build :)<br/>\nEdit : changed the build following advice by Mick Dagger, webshaman1, Ten Pura, and Orion. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:19 PM - Jul 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am not a specialist on dragon shape. But I believe that monk is better than rogue here. The best reason for rogue is UMD. So my question is if you need UMD when you already have access to monk items and arcane spell casting. <br/>\nLike you already stated, monk offers UBAB with more attacks per round and much better AC.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "9:09 PM - Jul 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote: <a data-post-id=\"21365\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21365&amp;sid=c2f112bc9a07b7481eb069a02d409be8#p21365\">↑</a><div class=\"responsive-hide\">Jul 26, 2020</div></cite>I am not a specialist on dragon shape. But I believe that monk is better than rogue here. The best reason for rogue is UMD. So my question is if you need UMD when you already have access to monk items and arcane spell casting. <br/>\nLike you already stated, monk offers UBAB with more attacks per round and much better AC.</div></blockquote>\nThanks for your reply!<br/>\nI agree that the best reason for rogue is UMD, and I admit that my main idea was to be able to use alignment- and class-restricted items. As this is relevant only for level 40 gameplay, I figured that would give you a lot more options in your choice of epic gear.<br/>\nOn the other hand, 17 AC is a lot... I will think about this, but luckily can wait until the very end before making the choice anyway (the only restriction is to be Lawful Neutral if one plans to become a monk).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:13 PM - Jul 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've done a shit fuck ton of work and investigation into Puff the Mighty Dragon.<br/>\n<blockquote><div>Puff the Mighty Dragon<br/>\n<br/>\nDragon Shape Prerequisite: <br/>\n21st level (is this Druid or character? It's character level), wisdom 30+, either wild shape 6x/day (requires 18 Druid) or greater wildshape IV<br/>\n<br/>\nEpic Spells Prerequisites:<br/>\nLevel 21 (is this class level or character level - it seems to be class level? It IS class level!)<br/>\n    mummy dust      (feat) (spellcraft 15)<br/>\n    dragon knight   (feat) (spellcraft 22)<br/>\n    greater ruin    (feat) (spellcraft 25)<br/>\n    epic mage armor (feat) (spellcraft 26)<br/>\n    hellball        (feat) (spellcraft 32)<br/>\n    epic warding    (feat) (spellcraft 34) <br/>\n<br/>\nI got around to retyping what I lost yesterday. Here is probably our last vesion of Puff the Magic Dragon.<br/>\nIntroducing, Puff the Magic Dragon version 4.0.<br/>\n<br/>\nEnds at 21 druid/ 2 monk/ 17 wizard (should this be 18 Druid, 1 Mk, 21 Wiz)<br/>\n<br/>\n18 druid required for wildshape x6 prereq. for Dragon Shape<br/>\n<br/>\nGoing 15 druid gets access to level 8 spells and allows Puff to extend aura of vitality 2 times per day. Youll have all wizard spells, and be able to cast them at full strength. If you want to be a dragon you can, but if you dont want too, then you can firebrand or IGMS or Vampiric Touch, or whatever else you want to do. Plus, going 23 wizard levels makes you able to penetrate almost everyones spell resistance, except most notably, pure monks. Thats what Creeping Doom is for though. Creeping Doom has no save and it has no spell resistance. It is the one spell that monks have absolutely zero chance to resist. You can cast that and then shift into dragon form. Monks will be forced to run away because you have more hit points than they do. Even if monks stay and fight, youll kill them because they wont be able to hit you with an AC so high.<br/>\n<br/>\nThe whole point to SBully and my thread about Puff the Magic Dragon was to show how to make a dragon who is immune to devastating critical. Getting 100% immunity to devastating critical can be achieved by making a palemaster dragon. There is another way to achieve immunity to devastating critical, or near immunity. You can get near 100% immunity to devastating critical by having an AC so high that the chances of someone killing you with devastating critical are practically zero. Being a monk will give you the extra AC that you need to become 99.9% immune to devastating critical.<br/>\n<br/>\nSo without further ado, let me introduce our latest improvements on Puff the Magic Dragon. Puff should be a green dragon, but if you choose to play a red or blue dragon you can.<br/>\n<br/>\nStart the game as a human lawful neutral wizard. Choose general magic as your preferred school. Take your levels in the following order to get the best base attack possible while timing your levels so you can get all the appropriate feats.<br/>\n<br/>\n*1 Wizard<br/>\n*17 Druid<br/>\n*17 wizard<br/>\n*1 druid<br/>\n*3 wizard<br/>\n*1 monk<br/>\n<br/>\nStart____Ending Stats<br/>\n8 Str 8<br/>\n8 Dex 8<br/>\n9 Con 9 (start with 9 con. Ill explain why later)<br/>\n17 Int 20<br/>\n18 Wis 30<br/>\n8 Cha 8<br/>\n<br/>\nChoose the following feats:<br/>\nLevel____Feat<br/>\n1   Extend Spell<br/>\n1   Knockdown (human bonus feat)<br/>\n4   Spell Penetration  <br/>\n6   Empower Spell<br/>\n9   Maximise Spell<br/>\n12  Greater Spell Penetration (wizard bonus feat)<br/>\n15  Toughness<br/>\n18  Improved Critical: Unarmed Strike<br/>\n18  Still Spell<br/>\n21  Great Wisdom I<br/>\n24  Great Wisdom II<br/>\n24  Great Intelligence I (wizard bonus feat)<br/>\n27  Great Wisdom III<br/>\n29  Great Intelligence II (wizard bonus feat)<br/>\n30  Craft Wand<br/>\n33  Epic Spell Penetration<br/>\n36  Dragon Shape (take last level 18 Druid here!)<br/>\n39  Epic Spell: Epic Warding<br/>\n  <br/>\n<br/>\nMake sure you bump wisdom at levels: 4, 8, 12, 16, 20, 24, 28, 32, 36.<br/>\nMake sure you bump intelligence at level: 40.<br/>\n<br/>\nYou'll notice we timed the wizard levels perfectly so we end up with the pre-requisites to choose the epic spells; 19 intelligence, ability to cast level 9 spells, epic wizard, and the appropriate spellcraft ranks.<br/>\n<br/>\nMax out Animal Empthy and Spellcraft at level 39.<br/>\nMax everything else at level 40<br/>\n<br/>\nFinal skills look like this in human form:<br/>\n42 Animal Empathy<br/>\n43 Concentration<br/>\n43 Discipline<br/>\n43 Hide<br/>\n10 Lore<br/>\n43 Move Silently<br/>\n42 Spellcraft<br/>\n43 Tumble<br/>\n<br/>\nRemember, if you want to make Puff a pick pocketing dragon, just switch some points around. You have a ton of skill points to put where you want. For PvP, the above point distribution works best. For Roleplaying, we suggest you make Puff a pick pocketing dragon and a lock picking dragon. Or perhaps you want a armor crafting dragon. Many possibilities there.<br/>\n<br/>\nThat is very impressive in itself, but I checked my skills in dragon form. Check these out. This includes buffs like mass camouflage, one with the land, etc.<br/>\n<br/>\nFinal skills in dragon form:<br/>\n45 Animal Empathy<br/>\n58 Concentration<br/>\n66 Discipline<br/>\n84 Hide<br/>\n64 Move Silently<br/>\n47 Spellcraft<br/>\n60 Tumble<br/>\n<br/>\nWith Hide at 84 and Move Silently at 64 most PCs just wont be able to see you unless they have true seeing no matter what. Furthermore, with 47 spellcraft youre getting +9 to all your spell saves. Youll never fail a save against a spell unless you roll a 1.<br/>\n<br/>\nNotice in our list of feats that Puff gets Hellball, Greater Ruin, Epic Mage Armor, and Epic Warding. Sound familiar? It should. That was what we did with our first version of Puff. We went Palemaster doing that, but the attack bonus was lower than this version. Also the first version of Puff only had 7 levels of wizard. The wizard spells therefore, could only realistically be used as defensive buffs. With this version of Puff you are a very powerful wizard with access to maximized IGMS if you desire.<br/>\n<br/>\nRemember how I talked about starting with 9 constitution. Ill explain why now. You have access to three spells that will raise your constitution a total of 11 points.<br/>\nMaximized Endurance = +5<br/>\nExtended Aura of Vitality = +4<br/>\nExtended Blood Frenzy = +2 (Youd have 86 AC if you dont cast this, but 85 is okay)<br/>\n<br/>\nWith these three spells, in human form you can finish at 20 constitution. This will give you enough hit points to run around in human form if you desire. In fact, with such a high wisdom AC bonus from the monk levels, youll be on par with most other pure casting classes in terms of hit points and AC. So this way you are a much more dynamic character. Dont rely solely on the wizard spells though. The druid can cast harm and heal, so people better think twice before they mess with you, in human or dragon form.<br/>\n<br/>\nHit point calculation in human form.<br/>\n15 levels druid x 7 hit points = +105<br/>\n23 levels wizard x 3 hit points = +69<br/>\n2 levels of monk x 7 hit points = +14<br/>\nToughness = +40<br/>\nYour constitution modifier after buffing goes from a -1 to +5 so that represents a total of +6 swing. Therefore con bonus = +240<br/>\n----<br/>\nTOTAL = 468 hit points in human form. That is certainly enough considering you have access to heal. You shouldnt have a problem in human form.<br/>\n<br/>\nObviously the true power of Puff comes from being a dragon, but I wanted to show that you have the robustness in this build to play human if you desire.<br/>\n<br/>\nHit point calculation in dragon form.<br/>\n15 levels druid x 7 hit points = +105<br/>\n23 levels wizard x 3 hit points = +69<br/>\n2 levels of monk x 7 hit points = +14<br/>\nToughness = +40<br/>\nShifting will give you +440 permanent hit points by changing constitution to 32.<br/>\nShifting also gives you +100 temporary hit points.<br/>\nMaximized Endurance = +80<br/>\nExtended Aura of Vitality = +80<br/>\nExtended Blood Frenzy = +40<br/>\n-----<br/>\nTOTAL = 968 hit points in dragon form. The key is to make sure your dragon has more than 960. This version does. If you have more than 960 hit points it will take 5 maximized IGMS to kill you instead of 4. So this version is on par with the other versions, though he doesnt break the one thousand mark.<br/>\n<br/>\nThere are several other reasons why you become super powerful in dragon form.<br/>\n<br/>\n<br/>\nFirst, monks have evasion. Puff has very high saving throws. After you figure in the +9 from spellcraft, its impossible for Puff to fail a save against a spell unless he rolls a 1. Therefore you are 95% immune to spells that have a reflex save. That is practically all of the good evocation spells. That leaves very few spells left that can hurt you, the most notable being Isaacs Greater Missile Storm, and Ice Storm.<br/>\n<br/>\nMonks also get deflect arrows at level 2. You can ignore the first ranged attack each round. This comes in really handy. Since Puff has improved invisibility and is already ignoring half the attacks, an automatic miss for the first ranged attack is a really nice compliment because arcane archers are probably the only class who can hit Puff without rolling a 20.<br/>\n<br/>\nGoing monk also gives you an improved attack schedule. Your attacks are made at -3 while other PCs who are not monk suffer -5 for each successive attack. Puff tries to knock people down with every hit because when you knock them down you get a bonus because they are prone, and Puff gets a +8 to his attack roll for trying to knock people down. You should end up with the following attack schedule: +52/+49/+46/+43/+40. Thats not bad at all. Its not super high, or super low, its average. Besides knocking people down, Puff excels at using his monk ability stunning fist. With a DC of 46 many monsters will find themselves held for 3 rounds while Puff shreds their bodies with his massive claws and bites off their heads with his giant mouth.<br/>\n<br/>\nSBully and I like our druid/cleric/monk version of Puff, but that one is vulnerable to getting dispelled and losing his attack bonus on his claws. With the palemaster version or this new improved version you have epic warding. With 23 levels of wizard you are much harder to dispel, and epic warding is very tough to dispel while premonition, stoneskin, and greater stoneskin automatically are dispelled with a spell breach spell. Epic Warding also grants Puff +20 claws.<br/>\n<br/>\nDEVASTATING CRITICAL DISCUSSION<br/>\n<br/>\nYour AC after you buff will be 85. It has been notably pointed out that if Puff is caught flat footed he loses some of his AC. This will make him vulnerable to devastating critical. The plan is simple to ensure this doesnt happen. Make sure you cast a level 4 spell called Improved Invisibility and a level 8 wizard spell called Greater Sanctuary. They both last for 230 rounds.<br/>\n<br/>\nThe list of characters who can see Puff the Magic Dragon before he comes out of Greater Sanctuary and before he loses Invisibility is reserved exclusively to the casting classes because they have access to True Seeing. Since melee types are the ones who get devastating critical, it is going to be near impossible without magical items to get a high enough attack bonus to hit Puff and get True Seeing. The only way to get true seeing is to multi-class into a spell-casting class. This in turn is going to lower your attack bonus and youre not going to be able to hit Puff if you do this. Mages are the only ones who can see Puff. Generally speaking nobody else is going to see Puff until Puff wants them too. Casting Improved Invisibility combined with Greater Sanctuary makes Puff invisible and ensures that the arcane archers and the weapon masters dont catch Puff flat-footed. Any other class will never get an attack bonus high enough to hit Puff on anything except a 20.<br/>\n<br/>\nIt is possible to die from devastating critical. You are not immune like the Palemaster. Here is what would have to happen. Puffs enemies have a 50% chance to miss due to his concealment. Enemies will have to roll a 20 to hit him. After they roll a 20 they have to roll another 20 to score a critical hit. After this Puff has to roll a 1 on his fortitude save. If all this happens then Puff will die from devastating critical.<br/>\n<br/>\nThe math is simple. 1/20 (first hit) * 1/20 (critical threat) * 1/20 (Puff fails fort save) * 1/2 (50% miss chance from improved invis) = 1 out of 16000 attacks will kill Puff with Devastating Critical. Breaking out a calculator. That means Puff is 99.99375 % immune to devastating critical. Thats good enough for me. If its not for you, then play the Palemaster version. The odds are more likely someone will find you resting and kill you than kill you with devastating critical.<br/>\n<br/>\nEnd of Devastating Critical Discussion.<br/>\n<br/>\nWe are all waiting for an official ruling from Jay about damage reduction and creatures. We may never get one though. Until Bioware rules it a bug, this is a valid build and SBully and I intend to go forth with it. Weve heard the arguments for and against giving creatures attacks an innate enhancement bonus from casting spells. We believe the manual is very clear. We also believe that it is POSSIBLE that Bioware or the Live Team INTENTIONALLY left creatures unchanged when they removed the stoneskin/ greater stoneskin/ premonition bug a while back. If this is ruled a bug, then SBully and I will modify our version of Puff some. Until that happens we probably wont be modifying him anymore. We promised to deliver our final product, and this is the culmination of both our efforts.<br/>\n<br/>\nWho can defeat Puff? Very few, if any. You are the ultimate tank with almost 1000 hit points, an AC of 85, all the immunities you have from being a dragon, and damage reduction of 50/+20 from epic warding.<br/>\n<br/>\nYou are every bit the spell caster that you can be with access to level 8 druid spells and level 9 wizard spells.<br/>\n<br/>\nThanks and enjoy your gaming experience as always.</div></blockquote>\n\nAs such, it works best with Monk - the reason being, Rogue does NOTHING to hold AC in the case of being flatfooted.<br/>\n<br/>\nIt does get you UMD, but to be honest, with both Druid spells and Wizard spells (and at full spellcasting level of 9th an lower), the only thing that is missing is the golden goal of level 25 to resist Greater Dispel.<br/>\n<br/>\nAnd to put it to the test, I levelled this Puff on WoG to level 40.<br/>\n<br/>\nIF it can keep the buffs, it is THE MIGHTEST DRAGON there is.  Hands down.<br/>\n<br/>\nProblem is, on WoG, you will get dispelled.  So you are left with the conundrum - Epic Mage Armor, which gets you a few AC points (which, to be honest, you do not need, as your AC is high enough anyway) OR Epic Warding (which gives you level of Mage rounds of 50/+20 warding, but most important, +20 DR piercing for those bosses that hide behind Epic Warding).<br/>\n<br/>\nMy experience has shown, that when it comes to it, GDL's World Ender, changed to have Rogue levels for both Uncanny dodge AND UMD, is far, far better than Puff.  <br/>\n<br/>\nHowever, if one is in an environment where Dispel cheese is not a problem, then Puff EE (yeah, I know...bad) is THE KING OF DRAGONS.<br/>\n<br/>\nYMMV<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "10:58 PM - Jul 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks <em class=\"mention\">@webshaman1</em> for your reply! Good to see that someone had actually updated Puff to the new Dragon Shape rules. If I understand your point correctly, you would also recommend Monk instead of Rogue in this kind of build. At the same time, you recommend playing another flavour of Dragon build on WoG due to everyone casting dispels at you all the time, is that correct? I can totally relate to that, and I am really happy with my CL 32 Dragon druid at the moment :) But he cannot cast EW and maul those pesky mages!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:34 AM - Jul 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, Monk also has the Synergy with Wis AC (which one cannot loose, btw not even when flatfooted) PLUS FoB AND Monk BAB.<br/>\n<br/>\nAnd these all work superbly in Dragon form!<br/>\n<br/>\nIt's silly OP.<br/>\n<br/>\nThis - <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-world-ender-druid-32-fighter-2-monk-6-t2355416.html\" rel=\"noreferrer\" target=\"_blank\">the-world-ender-druid-32-fighter-2-monk-6-t2355416.html</a> is GDL's World Ender.  I added 3 levels of Rogue instead of Fighter and 1 level of Druid (Monk 6 is just too good!).<br/>\n<br/>\nThat got the build Uncanny Dodge (so not loosing that Dex AC) UMD (extremely important on WoG, because Dragons can only absorb Helm/Armor/Shield, and KD stuff is normally either Footwear or a Helm).<br/>\n<br/>\nI found that my Dragon, despite having an AC that was through the Roof, kept getting KDed (a 20 always hits) and as a result floored more often than not by many of the Bosses where I play (yeah, those bastages spam IKD when they need a 20 to hit!).<br/>\n<br/>\nMy Puffy, otoh, has a real problem doing the Bosses, because they really like to Mord's alot.  Which strips buffs right off.  Then one is faced with either A) Trying to fight it out anyway, knowing it is going to be a 20s hunt, which is not very fun or B) Run away and try to recast all those buffs - only to get them dispelled again. Meh.<br/>\n<br/>\nATM, the only reason that the World Ender is not ROFLStomping everything is because I need a Shield that protects against Death Magic (I have a Helm of KD immunity, Armor that prevents Level/Stat loss).  Turns out many Mages spam Finger of Death (like, Sorcerers with many, many many spells) and eventually you roll a 1 after your buffs have been Dispelled/Breached/Morded off.  It has happened everytime now, so I need that shield!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "10:05 AM - Jul 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As Web mentioned with Druid/Wizard/Monk, you won't miss UMD in most environments. You've got divine scrolls from Druid, arcane scrolls/wands from Wizard and Monk robes/gear built in.<br/>\nGoing with Wizard over Sorcerer has the added advantage of more Skill Points from the higher INT. Outside of CHA based skills, I don't see a downside to this.<br/>\nStill, soaking a Mord's would be highly unpleasant on this build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:31 PM - Jul 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In TheSquid's environment (WoG) at least, there is something very special for Druid builds that is only available to Rogues or UMDers - a Thieves's Hood.<br/>\nOnly helmet/armor/shield slots transfer to dragon shape form. <br/>\nA Thieves's Hood supplies knockdown immunity that will transfer from the helmet slot.<br/>\nKnockdown immunity from boots such as Boots of Sure Footing will not transfer.<br/>\nAs Web has mentioned, I definitely noticed getting knocked down, even in Dragon Form, when I forgot to equip my knockdown immunity helmet before shifting.<br/>\nIt was especially bad in Bear and Elemental Form to not have knockdown immunity.<br/>\nAn alternative could be maximizing discipline with the Monk class which with the ultra high strength and huge size provides a high degree of resistance, although one might still be vulnerable to repeated Bigby's 6.<br/>\nEither way I suspect the intention is to get that last level of Monk or Rogue at level 40 so there is a long journey before one decides on that last class level.<br/>\n<br/>\nOne other thought was 194hp is not a lot.<br/>\nDid you want to start with Con 12 and put Int to 16?<br/>\nYou could drop heavy armor proficiency for toughness, you won't have a lot of strength anyway to wear full plate.<br/>\nYou'd gain 120hp which would help with survivability with spellcasting. <br/>\nThe Toughness will also transfer to your shifted forms which is nice although not really a reason to get it.<br/>\n<br/>\nAnother question is if spell penetration feats are useful here with a CL 18 druid / CL 21 wizard. There is Natures balance and Mord to lower spell resistance I guess, maybe it is not essential but I do not know the answer to this.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "2:28 PM - Jul 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks all for your replies. <br/>\nI have changed the last level to Monk as it really gives a lot. I updated starting stats to CON 12 and INT 16 as Orion suggested, added Toughness and lost Heavy armors and Epic Prowess. The loss of UMD matters even less since heavy spellsword armor is out, and it should be <em>a lot </em>easier to level. <br/>\nNow I don't even know what to do with all these skillpoints, so I cross-classed Tumble, Search and Spot to aid with the leveling. Another option might be to dump full Hide&amp;Move Silently at 40. But again, maybe it is wise to not get everything at level 40, at least if I am the one trying to play this.<br/>\nConcerning Spell penetration feats, I figured you can live without them: as a Druid meleeing is most of the time an option anyway, at level 35 you can cast Mord, before that you can use Breaches, and you can always do invisibility/Nature's Balance if absolutely necessary (a lucky roll is -12 SR). <br/>\n<details><summary>Spoiler</summary>\n\n</details>\n\nI will make this guy a witch instead, and give her a spin on WoG. Thanks for the suggestions!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:39 PM - Jul 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think with the 300+ skill points you could:<br/>\n- max animal empathy, I don't have a lot of experience using AE but that seems great to me<br/>\n- put set trap to modified 11 (to be able to set all deadly traps except gas) with a One with the Land scroll or modified 15 without One with the Land<br/>\n- a few points in lore, heal or craft trap is always nice, no more than 10 ranks though<br/>\n<br/>\nWould be great to hear how you go with play testing. I haven't been brave enough to play a Druid / Wizard with the dispel spamming in the environment you are playing in. <br/>\nLooking forward to how you go, I will certainly learn a lot reading your progress.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:58 PM - Jul 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Animal Empathy on WoG is really, really good.  As a result, all my Druids and Rangers max this skill.<br/>\n<br/>\nPlaying Druid/Wizard is really, really hard on WoG.  It took me a long time to level to 40, and believe me, that is normally not the case with most other builds.<br/>\n<br/>\nThe fact that the 1 level of Monk comes late (in order to do a Tumble dump and Discipline dump), means that one is basically reliant on other players, summons, animal companions, familiar, and anything that one can grab with AE.  Obviously, one goes Druid first for the AB progression.  And in fact, getting to level 20 or so is not hard.  It is after that that the grueling grind starts.<br/>\n<br/>\nClever use of Shapes, plus buffs from Wizard normally works well - beware of dispels, however.<br/>\n<br/>\nGood luck, and post back your progress!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "4:38 PM - Aug 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Updates!<br/>\nAgatha is now level 12 on WoG, and she is rocking it. I can share some impressions which are more relevant to the generic 8 STR pure Druid than to this build in particular.<br/>\n<br/>\n0. I am basically not metagaming, as I don't know the PW enough to do that. So I visited no shops other than in BK for instance, and am trying to do level-appropriate areas. I died an embarrassing number of times. <br/>\n1. Druid summons are very strong (buffed on WoG). In the early levels, the only thing you have to do is avoid enemies, and companion+summon will kill everything easily.<br/>\n2. As I guess all casters, you have a nice power spike every second level with the new spells, which is very pleasant. My buffs got dispelled a couple of times so far, but until they don't life is easy. This will obviously not last.<br/>\n3. Feats: I did some shuffling around, and took Craft Wand (buffed on WoG) at level 9. It is a major game changer. I got myself a 50-charge Call Lightning wand and <em>cruised</em> through a certain mausoleum in the countryside. Now I added an Ice Storm and a Summon Creature 4 wand to my arsenal, and as a result I have no money and no equipment except what I could loot, but boy is it worth it. On the other hand, I have still not Extended anything, an just started Empowering Bull's Strength. If I knew better how to get fast money on WoG, I would say by all means take Craft Wand at 6, it's amazing. You can convert a 6d6 casting of Call Lightning into 50 10d6 casts, for a meager 22k gold.<br/>\n4. No Monk levels mean wildshape is quite meh. It looks useful for actually dealing damage while summons are tanking, but I am enjoying blowing stuff up with lightnings more if I manage to not get targeted. Maybe had I gotten Knockdown earlier instead of Extend Spell?<br/>\n5. Skills: I still don't know if I like the investment in Animal Empathy, it has been borderline useful, mostly used in combat (hoping for the best) to remove an enemy from the fight. I imagine it can be more useful later though. Open Lock and Disable trap are obviously really good value, have not found any traps yet (or succeeded in recovering one) so Set Traps has not done much. I like cross-classed Search and Tumble.<br/>\n<br/>\nThe near future looks quite happy with the increasing number of slots to cast some Freedoms and Stoneholds (still not used it). Then I am very keen on getting some Wizard-only wands (Haste, Lesser Spell Breach and Improved Invisibilty I am thinking), as well as starting to scribe Heal scrolls. And then the hard times will begin, I imagine, with the low caster level and no Monk...<br/>\n<br/>\nupdates will (hopefully) follow!<br/>\n<br/>\nps. I accept suggestions as to where to go next.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:09 PM - Aug 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the update, I enjoyed reading it. Looking forward to future updates<br/>\nAt level 12 solo you could try Dragon Cult or Against the Giants<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "1:10 PM - Aug 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Agatha's journey continues!<br/>\n<br/>\nShe has now attained level 24 (ie Wizard 7), which means in the near future she will be able to use LSB and II wands (finally!).<br/>\nLife is good, with all the druid spells plus flame weapon and protection from evil. She will now start looking for spellsword equipment since level 5 Wizard spells approach.<br/>\nStill never shapeshifting, and it is working very well.<br/>\nShe has a bag full of Heal, Harm, Summon IX scrolls, as well as a wand of Haste and the ever-good wand of Call Lightning.<br/>\nShe has defeated such enemies as  [edited], [edited], [edited] and [edited], with no great difficulties except against the one that shall not be named.\n<details><summary>Spoiler</summary>Jarl, Volte, Manscorpion King, Waquinos, and one that shall not be named even here :)\n</details>\nOnly two deaths in the last 6 or so levels (one by flatfootedness and one by not knowing I was in a higher-level area).<br/>\n<br/>\nWater Elemental Princess rocks, it looks much better than the Earth version I was mainly using with my other Druid character. She deals 3d20+16 damage per hit (is this intended I wonder?), and her Drown ability has taken out several strong enemies. Harm is also very strong despite being nerfed on WoG.<br/>\nAgatha is getting dispelled every fight (as expected), but via some baiting with summons, invisibility potions, and above all <em>not being shapeshifted</em> she (almost) always managed to rebuff and kill everyone.<br/>\nLooking forward to seeing the new powerspike of level 4 Wizard spells in action!<br/>\n<br/>\nOne more comment: this build is feeling very nice to play as it scales smoothly and every level brings some new goodies. I had not thought about it, but the double spellbook means you get new spells at levels 3,5,7,9,11,13,15,17,19,21,22,24,26,28,30,32, and 35! On top of Dragon Shape at 33 and Epic Warding at 39, not to mention the level 40 Monk1 powerspike. For me personally this means that I am enjoying the journey a lot :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:56 PM - Aug 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">AE is great - but getting those beasts to do anything is not.  One desperately aches for a cattle prod!<br/>\n<br/>\nOne thing that actually may be useful is Craft Potion as Shifted Forms can use standard potions.  Unfortunately, they cannot use wands.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "12:27 PM - Aug 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It is time for yet another update, for those who might care.<br/>\nAgatha has finally achieved level 33 and dragonhood (and at the same time knighthood, yay), by completing the Great Northern Crusade. As <em class=\"mention\">@webshaman1</em> and everyone else predicted, it got harder as all mobs are spamming Greater Dispelling and all bosses have a couple Mord prepared (exaggerating but not so much). Two more dirtnaps because of that, I will need to be more careful. Other notable bosses taken down (all without Dragon Shape!) are\n<details><summary>Spoiler</summary>Snurre, Trok, Emeraxis, Zhay, Dragotha, Haas.\n</details>\nShoutout to <em class=\"mention\">@Orion</em> for suggesting 11 ranks in Set Traps, I tried it out in [edited] and laid out a beautiful green carpet; only to then pull the wrong enemy onto it :(. It looks potentially very powerful on a character such as this as a complement to her many abilities. I'll have to restock before trying again...<br/>\nThe WoG nerf on Harm (capped at 250) is really felt now, as bosses and even some mobs have 700+ hp. Still deals more damage than Max IGMS I guess, but the melee range is very dangerous. One choice which is maybe not obvious and which I am very happy about in this build is the Illusion magic school, as opposed to the maybe more common Necromancy. Illusion lets us cast Divination spells, which include Premonition (only relevant for scrolls, as Druids can cast it anyway) and especially True Strike; this is essential to reliably hit the touch attacks on Harm (and Slay Living). <br/>\nIt still feels very good to be able to spam Breaches and Improved Invisibility as a Druid. Only few enemies with innate high spell resistance (such as dragons) can withstand Breach into Druid DC combos. <br/>\n<br/>\nSpeaking of SR enemies, I plan to visit some Monks now; I'll first need to come up with a strategy though. It will probably involve out-punching them as a dragon.<br/>\n<details><summary>Spoiler</summary>Leo's is amazing for a solo Druid, it makes life so many times easier!\n</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:40 PM - Aug 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice to hear about your progress!<br/>\n<br/>\nGo go, Agatha, go!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "6:13 PM - Sep 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ok, Agatha is at the end of her solitary journey. She has killed\n<details><summary>Spoiler</summary>Rary, WDK, AoO and Lolth\n</details>\nthe latter two at level 40.<br/>\nI learned very late that on WoG you can Tenser's Transformation and then turn into a dragon (does not work in vanilla NWN), which is insane. <br/>\nThe build feels very strong throughout, and it is extremely flexible in what it can do. <br/>\nAfter playtesting I would make some modifications to the build I posted, swapping SF/GSF/ESF with spell penetration, still spell and epic prowess. Oh, and change the name to Wood Witch, I think.<br/>\n<em class=\"mention\">@Stagmeister</em> , can I post an updated version of this build directly to the level 40 section?<br/>\nThanks everyone, especially <em class=\"mention\">@Orion</em> and <em class=\"mention\">@webshaman1</em> , for the support in this journey (this was in fact my first level 40 character, not to mention the second that got past level 20, on WoG).<br/>\nCheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:24 PM - Sep 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well done! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:09 PM - Sep 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>TheSquid wrote: <a data-post-id=\"21771\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21771&amp;sid=93df22a3fbc0770d8f2666b90e03bdbb#p21771\">↑</a><div class=\"responsive-hide\">Sep 02, 2020</div></cite>Ok, Agatha is at the end of her solitary journey. She has killed\n<details><summary>Spoiler</summary>Rary, WDK, AoO and Lolth\n</details>\nthe latter two at level 40.<br/>\nI learned very late that on WoG you can Tenser's Transformation and then turn into a dragon (does not work in vanilla NWN), which is insane. <br/>\nThe build feels very strong throughout, and it is extremely flexible in what it can do. <br/>\nAfter playtesting I would make some modifications to the build I posted, swapping SF/GSF/ESF with spell penetration, still spell and epic prowess. Oh, and change the name to Wood Witch, I think.<br/>\n<em class=\"mention\">@Stagmeister</em> , can I post an updated version of this build directly to the level 40 section?<br/>\nThanks everyone, especially <em class=\"mention\">@Orion</em> and <em class=\"mention\">@webshaman1</em> , for the support in this journey (this was in fact my first level 40 character, not to mention the second that got past level 20, on WoG).<br/>\nCheers!</div></blockquote>\nIndeed you can Squid - and many congratulations! I'd be tempted to link it to this thread so folk can see Agatha's development from conception to completion - often it's the discussion that helps others come to better understanding.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}