{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "238",
  "name": "Best Offense is a good Defense, or is it the opposite?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/best-offense-is-a-good-defense-or-is-it-the-opposi-t2354326.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:56 PM - Sep 24, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">As per topic tittle, what matters more for you and your playstyle? Have a 40 AB 700 hp's DR 21/ - front line warrior, eating up all the heat of battle and still standing at the end of the day OR do you prefer an unparallel offense - a rampaging 50 AB weapon master with a greataxe, that kills before he is killed? I am interested in your personal preferences and not if the one or the other is better ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:54 PM - Sep 24, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I enjoy playing the heavy hitter - live and die by the sword so to speak.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "7:11 AM - Sep 26, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have had fun with both. I just got my rogue 10 / fighter 4 / DD 26 to level 40 on WoG and had a great time with him. With 22 CON and EDR III, he was pretty hard to hurt at the end there. Of course, he wasn't purely defensive (not a dexer) and, as part of a duo team, he could rely on BlackCobra's cleric for great buffs and added offensive power when needed. And that toon was not purely a power build since WoG isn't an arena or level 40 PvE server and there is little point to builds that sacrifice effectiveness during 90% of the build's playable life in order to get better goodies at the tail end.<br/>\n<br/>\n At the same time, my gf (who doesn't get a chance to play much but duos with me along as arcane backup) was saying that it was almost too easy to play one of my WM (scythe-wielding strengther) builds. By the early epics, most bosses were going down in two or three rounds. But, our tactics were different there, since wading into a group of hard-hitting baddies wasn't going to turn out as well.<br/>\n<br/>\n Overall, it depends much on the environment and on whether the toon is for soloing or for party play. The other factor is the particular opponents I am fighting. Can they be singulated? Are they too tough to take down in a hurry? A 700 hp spell-immune golem with 40/+7 DR isn't going down quickly in my +5 weapon environment, so I had better have a solid AC or be able to take some damage. I am a cautious soloist, so I tend to go defensive on those builds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "8:28 AM - Sep 26, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>MrZork wrote:</strong><hr/>Overall, it depends much on the environment and on whether the toon is for soloing or for party play. The other factor is the particular opponents I am fighting. </div></blockquote>\n<div align=\"left\"> </div>\n\n Excellent point here.....<br/>\n I myself am all roleplay so for me it would depend on how each character is seen in my mind's eye... is he a rugged ole dwarven fighter well he'll probably be able to take quite a lickin... the crafty gnome he'd probably be smarter and harder to hit..the ancient elf who has had a long lifetime to perfect killing blows.. the haughty prince or lowly peasant might both end up living life piously (pal and or Mon) so could go either way.<br/>\n<br/>\n All in all It depends on the character it's environment and how the character will be played.<br/>\n At least that's my opinion.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "6:08 PM - Sep 29, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">WM, 50+ AB, Dev. Crit., Vorpal weapon and loot my opponent's remains after 3-4 rounds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:13 AM - Oct 01, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice topic, val!<br/>\n<br/>\n I personally prefer the sturdy dwarf. Why? Because they can both achieve the same thing, only difference is how long it takes, but the dwarf will have protection against more things:<br/>\n - IGMS - more HP means it takes more IGMSs to kill you<br/>\n - Insta-death spell - Humungous fort save<br/>\n - sneak-immune - no sneaks on you so with a Ring of Power you take no damage from dexers<br/>\n - combo with belt - You can equip a belt of DR if your world has them and just be all but immune to one damage type.<br/>\n - is more effective against crit-immune monsters, which on WoG is a very important thing. :D<br/>\n<br/>\n Take it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}