{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "147",
  "name": "The Baelnorn: Fighter 20 / Bard 4 / Pale Master 16",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-baelnorn-fighter-20-bard-4-pale-master-16-t2355232.html",
  "author": "grizzled_dwarflord",
  "avatar": "10758933_1548854436.jpg",
  "replies": "5",
  "views": "5.8K",
  "posts": [
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "7:26 AM - Nov 12, 2019",
      "content": "<div> Hail my brethren, below are two stylish Palemaster eviscerators.  There are countless versions of classes like these, but I'm hoping these ones have enough style and substance to merit inclusion in the Halls of Heroes.<br/>\n<br/>\n<strong>The Baelnorn</strong><br/>\n<strong> </strong><br/>\nRace: Elf (or Drow)<br/>\nClasses: Fighter20/Bard4/Pale Master 16<br/>\nAlignment: Non-Good/Non-Lawful<br/>\n<em>Playable:</em> 1-40, PvM, Low to Mid Magic<br/>\n <br/>\n<strong>Attributes</strong><br/>\nStr17 (32)<br/>\nInt14<br/>\nWis8<br/>\nDex15<br/>\nCon12<br/>\nChr8<br/>\n <br/>\n<strong>Level Guide</strong><br/>\n1 Fighter 1, Power Attack, Cleave<br/>\n2 Bard1<br/>\n3 Fighter 2, Ambidexterity, Two-Weapon Fighting<br/>\n4 Fighter 3, Str18<br/>\n5 Fighter 4, Exotics<br/>\n6 Fighter 5, WF: Two-bladed sword (or Kukris, builder’s choice)<br/>\n7 Fighter6, WS: Two-bladed sword<br/>\n8 Bard2, Str19<br/>\n9 Fighter 7, Knockdown<br/>\n10 Fighter 8, Blindfighting<br/>\n11 Fighter 9<br/>\n12 Fighter10, Improved TWF, Improved Knockdown, Str20<br/>\n13 Fighter11<br/>\n14 Fighter12, Improved Crit: Two-bladed sword<br/>\n15 Fighter13, Toughness<br/>\n16 Bard 3 , Str21<br/>\n17 Pale Master 1<br/>\n18 Pale Master 2, Great Cleave<br/>\n19 Pale Master 3<br/>\n20 Pale Master 4, Str22<br/>\n21 Pale Master 5, Great Str I<br/>\n22 Pale Master 6<br/>\n23 Pale Master 7<br/>\n24 Pale Master 8, Great Str II, Str25<br/>\n25 Pale Master 9<br/>\n26 Pale Master 10<br/>\n27 Fighter 14, Overwhelming Crit, Dev Crit: Two-bladed sword<br/>\n28 Pale Master 11, Str26<br/>\n29 Pale Master 12<br/>\n30 Pale Master 13, Great Str III, Epic ER: Acid<br/>\n31 Pale Master 14<br/>\n32 Pale Master 15, Str28<br/>\n33 Pale Master 16, Epic Mage Armor (or Epic Spell of Choice), Great Str IV<br/>\n34 Fighter 15<br/>\n35 Fighter 16, Epic WF: Two-bladed sword<br/>\n36 Fighter 17, Epic WS: Two-bladed sword, Str30<br/>\n37 Bard 4<br/>\n38 Fighter18, Epic Prowess<br/>\n39 Fighter 19, Great Str V<br/>\n40 Fighter 20, Armor Skin, Str32<br/>\n <br/>\n<strong>Combat Vitals</strong>\n<ul>\n<li>Dualwield AB: 40/35/30/25/40/35</li>\n<li>AB: 42/37/32/27</li>\n<li>Crit Range: 17-20/x2</li>\n<li>Dev Crit DC: 41 raw (47 max)</li>\n<li>AC: 39 in mundane plate (59 in EMA mode)</li>\n<li>HP: 423</li>\n<li>Immunities: Stun, Paralyzation, Criticals, Sneak Attacks</li>\n<li>Acid Resistance: 10/-</li>\n<li>Deathless Touch DC: 20, 3x day</li>\n</ul>\n <br/>\n<strong>Skill Set </strong><em>(180 skill points)</em>\n<ul>\n<li>Listen: 11 (13)</li>\n<li>Lore: 4 (10)</li>\n<li>Open Lock: 1</li>\n<li>Perform: 10 (9)</li>\n<li>Search: 1 (5)</li>\n<li>Spot: 1 (3)</li>\n<li>Spellcraft: 38 (40)</li>\n<li>Taunt: 40</li>\n<li>Tumble: 40</li>\n<li>UMD: 31 (30)</li>\n</ul>\n <br/>\n<strong>Saves</strong>\n<ul>\n<li>Fort: 24 (32 vs spells)</li>\n<li>Will: 20 (28 vs spells)</li>\n<li>Reflex: 20 (28 vs spells)</li>\n</ul>\n <br/>\n<strong>Advantages</strong>\n<ul>\n<li>Dualwielding Devastation</li>\n<li>Crit and Sneak Immune</li>\n<li>Solid Dev Crit DC</li>\n<li>High AC and Resistances (can achieve 59 AC without items)</li>\n<li>Competitive AB</li>\n<li>Matures early</li>\n<li>Variety of Undead Summons for Bigby &amp; Isaacs Sponging</li>\n<li>Vampire Rogue Summons for dealing with Traps &amp; Locks</li>\n<li>Keen Senses</li>\n<li>Use Magic Device</li>\n</ul>\n <br/>\n<strong>Disadvantages</strong>\n<ul>\n<li>20% xp penalty throughout lifetime (<em>doesn't bother me because I enjoy a slow burn</em>)</li>\n<li>With exception of PM epic spells and your occasional Bard Song, no self-buffing</li>\n</ul>\n <br/>\n <br/>\n<strong>Commentary</strong><br/>\n <br/>\n<em>In elven legend, the Baelnorn were elves who chose a path of Prime-bound duty beyond death. These undead defenders unswervingly protected their clan and its holdings for centuries. The majority of baelnorn were spellcasters, and they maintained their mental and magical abilities in this state, though exceptions occurred. Unlike liches, Baelnorn are willing undead, and are hardly considered corruptions as liches are.  Indeed, they even maintained their good alignments when they achieved their undead state. This Baelnorn, while not a caster, is more of an eviscerator….</em><br/>\n <br/>\nAnd yet another Pale Master warrior for the annals of legend.  Their number is legion, but for good reason.  However, this one has a bit more of an RP slant to it.  But don’t let that fool you, for this pointy ear grabs both Dev Crit and Crit Immunity by Level 27.<br/>\n <br/>\nSimply put, this is like an Elven Version of the <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build303254.html\" rel=\"noreferrer\" target=\"_blank\">The Charnel Lord</a>.  Offered here are both a Dev Crit and Non-Dev Crit version.   Both are very balanced melee warriors.  While there is a grim pleasure gained by going Dev Crit in a build that is immune to it, the non-dev crit version might actually be more fun and is bit more versatile.  The non-dev crit version gains Improved Disarm (for situational AB boost), and also picks up an extra 2 Epic Spells to make him virtually indestructible for a short period of time, a few better summons (<em>Skeletal Blackguard and Lich</em>)<br/>\n <br/>\nIn both builds, Elf must be taken to achieve maximum Baelnorn-ness, though it is possible to achieve similar stat spreads with Dwarf or Half-orc.  The goal obviously was to have a dualwielding dev critter that compensated AC with PM levels.<br/>\n <br/>\nIn pre-epic, one will notice that Bard is taken at unusual levels (13 and 16).  This is to maximize the bard skill set since there is large break between the 3<sup>rd</sup> Bard level and the last Bard level.<br/>\n <br/>\nTwo-bladed sword is taken for style.  While it offers better base damage over the character’s career, Kukri is a worthwhile choice since it offers better threat range, and a chance to increase AB and AC by going sword and board.  Epic Mage Armor is taken because of the return one gets for the investment.  Assuming low to mid magic, Epic Mage Armor allows you to not have to worry about Natural AC, Deflection AC, Armor AC, and the Dodge AC will stack.  This frees your character to wear other items that offer resistances.  But mileage, of course, will vary depending on your environment, so feel free to choose whatever Epic Spell that tickles your fancy.  In the non-dev crit version, you get 3, so much more freedom there.<br/>\n <br/>\nFor skill point distribution, on Bard Levels you want to maximize Tumble and UMD and Taunt.  Make sure to get Perform to 10 to activate your Bard Songs as you go.  On Fighter levels you basically bank unless you need to cross class a point into Search, Open Lock and Spot (I tend to do this for most characters when it’s not a class skill, and then find ways to raise it situationally).  On PM levels you want to hit Spellcraft every chance you get.  Keen senses, while still useful early on, tend to go to waste in a build like this.<br/>\n <br/>\nThis build was playtested in the Pretty Good Character Creator and is currently being live tested from the ground up at <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/\" rel=\"noreferrer\" target=\"_blank\">The World of Greyhawk Action Server</a>.  Now all I need is a bad-ass picture.  Cheers!<br/>\n<br/>\nBelow is the non-dev crit version:<br/>\n <br/>\n <br/>\n<strong>The Baelnorn </strong><em>(non-dev crit version)</em><br/>\n<strong> </strong><br/>\nRace: Elf<br/>\nClasses: Fighter14/Bard4/Palemaster22<br/>\nAlignment: Non-Good/Non-Lawful<br/>\n<em>Playable:</em> 1-40, PvM, Low to Mid Magic<br/>\n <br/>\n<strong>Attributes</strong><br/>\nStr17 (32)<br/>\nInt14<br/>\nWis8<br/>\nDex15<br/>\nCon12<br/>\nChr8<br/>\n <br/>\n<strong>Level Guide</strong><br/>\n1 Fighter 1, Power Attack, Cleave<br/>\n2 Bard1<br/>\n3 Fighter 2, Ambidexterity, Two-Weapon Fighting<br/>\n4 Fighter 3, Str18<br/>\n5 Fighter 4, Exotics<br/>\n6 Fighter 5, WF: Two-bladed sword<br/>\n7 Fighter6, WS: Two-bladed sword<br/>\n8 Bard2, Str19<br/>\n9 Fighter 7, Knockdown<br/>\n10 Fighter 8, Blindfighting<br/>\n11 Fighter 9<br/>\n12 Fighter10, Improved TWF, Improved Knockdown, Str20<br/>\n13 Fighter11<br/>\n14 Fighter12, Improved Crit: Two-bladed sword<br/>\n15 Fighter13, Disarm<br/>\n16 Bard 3 , Str21<br/>\n17 Pale Master 1<br/>\n18 Palemaster 2, Improved Disarm<br/>\n19 Pale Master 3<br/>\n20 Pale Master 4, Str22<br/>\n21 Fighter 14, Epic WF, Epic WS: Two Blade Sword<br/>\n22 Pale Master 5<br/>\n23 Pale Master 6<br/>\n24 Pale Master 7, Epic Prowess, Str23<br/>\n25 Pale Master 8<br/>\n26 Pale Master 9<br/>\n27 Palemaster 10, Great Str I<br/>\n28 Pale Master 11, Str25<br/>\n29 Pale Master 12<br/>\n30 Pale Master 13, Great Str II, Epic ER: Acid<br/>\n31 Pale Master 14<br/>\n32 Pale Master 15, Str27<br/>\n33 Pale Master 16, Epic Mage Armor (<em>or Epic Spell of Choice</em>), Great Str III<br/>\n34 Pale Master17<br/>\n35 Pale Master 18<br/>\n36 Pale Master19,  Epic Warding, Greater Str IV, Str31<br/>\n37 Bard 4<br/>\n38 Pale Master 20<br/>\n39 Pale Master 21, Great Str V<br/>\n40 Pale Master 22, Greater Ruin, Str32<br/>\n <br/>\n<strong>Combat Vitals</strong>\n<ul>\n<li>Dualwield AB: 40/35/30/25/40/35</li>\n<li>AB: 42/37/32/27</li>\n<li>AC: 39 in mundane plate</li>\n<li>HP: 364</li>\n<li>Immunities: Stun, Paralyzation, Criticals, Sneak Attacks</li>\n<li>Acid Resistance: 10/-</li>\n<li>Deathless Touch DC: 20, 3x day</li>\n</ul>\n <br/>\n<strong>Skill Set </strong><em>(180 skill points)</em>\n<ul>\n<li>Listen: 11 (13)</li>\n<li>Lore: 4 (10)</li>\n<li>Open Lock: 1</li>\n<li>Perform: 10 (9)</li>\n<li>Search: 1 (5)</li>\n<li>Spot: 1 (3)</li>\n<li>Spellcraft: 38 (40)</li>\n<li>Taunt: 40</li>\n<li>Tumble: 40</li>\n<li>UMD: 31 (30)</li>\n</ul>\n <br/>\n<strong>Saves</strong>\n<ul>\n<li>Fort: 24 (32 vs spells)</li>\n<li>Will: 20 (28 vs spells)</li>\n<li>Reflex: 20 (28 vs spells)</li>\n</ul>\n <br/>\n<strong>Advantages</strong>\n<ul>\n<li>Crit and Sneak Immune</li>\n<li>High AC and Resistances</li>\n<li>Competitive AB</li>\n<li>IKD and Improved Disarm</li>\n<li>Variety of Undead Summons for Bigby &amp; Isaacs Sponging</li>\n<li>Vampire Rogue Summons for dealing with Traps &amp; Locks</li>\n<li>Keen Senses</li>\n<li>Greater Ruin: 35d6 Positive Energy</li>\n<li>Epic Warding: 20 Round 50-/+20 with up to 1000 Points soaking</li>\n<li>Use Magic Device</li>\n</ul>\n <br/>\n <br/>\n<strong>Disadvantages</strong>\n<ul>\n<li>20% xp penalty throughout lifetime</li>\n<li>With exception of UMD, PM epic spells and your occasional Bard Song, no self-buffing</li>\n</ul>\n <br/>\n<strong>Servants of the Baelnorn:</strong>\n<ul>\n<li>PM Level 4-5: Ghoul</li>\n<li>PM Level 6: Shadow</li>\n<li>PM Level 7: Ghast</li>\n<li>PM Level 8: Wight</li>\n<li>PM Level 9: Wraith</li>\n<li>PM Level 9: Mummy Warrior</li>\n<li>PM Level 10: Spectre</li>\n<li>PM Level 12: Vampire Rogue</li>\n<li>PM Level 14: Greater Bodak</li>\n<li>PM Level 16: Ghoul King</li>\n<li>PM Level 18: Vampire Mage</li>\n<li>PM Level 20: Skeletal Blackguard</li>\n<li>PM Level 22: Lich</li>\n</ul>\n <br/>\n <br/>\n <br/>\n </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:18 AM - Nov 12, 2019",
      "content": "<div>Hail, Oh Grizzled One, and thanks for these! As an inveterate non-caster, I'm actually tempted to dabble with one here (don't tell anyone, eh?). Just one question. Is there a particular reason not to include Discipline in the build(s)? Unless I'm misreading PM, it's not immune to KD or Disarm, and, other than failing a will save, my worst nightmares as a meleer are spending time on my arse and/or being weaponless. I confess, I'd be tempted to drop Taunt for it - though I appreciate that would be tough in the non-Dev Crit version.<br/>\n<br/>\nGood to have the Dwarflord back on the map!<br/>\n<br/>\n<em>\"Astrolabe whirls, astrolabe twirls. Astrolabe whirls, astrolabe twirls...\"</em></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "10:26 AM - Nov 12, 2019",
      "content": "<div>Good question.  I stopped investing in Discipline years ago.  I just found ways to mitigate it in the environments I play (usually some kind of KD-immunity boots).  Concentration, meh.  If you're opponent wants to taunt this build they do so at their own risk since they'll be flatfooted and you're bringing the pain.  Now if you're in PvP, that's a different story... but I have never built for PvP.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:45 AM - Nov 12, 2019",
      "content": "<div>Hi GDL!<br/>\n<br/>\nGreat to see a Pale Master build from you again!<br/>\n<br/>\nI studied quite a few Pale Master builds when I was learning how to build with the pale master class, and the pale master builds I learnt the most from were yours, both your bard/pale master and wizard/pale master builds. <br/>\n<br/>\nI do not believe I have ever seen a dual wielding dev-critting fighter pale master so this is certainly unique, and I believe a very worth candidate for the level 40 section<br/>\nThere are lots of things I like in both builds both big and small. Big things like the overall AB (ie base 42 AB) / HP (400+) / Tank / Skills balance which is very nice. Small things like taking Bard(2) at level 8, for example, which allows a skill dump for UMD 10 modified, UMD 10 being a level where access to equippable items / usable spells becomes quite valuable, its fine attention to detail demonstrated there.<br/>\n<br/>\nIf I was playing the first build I would make a small adjustment to drop Armor Skin and fit both Epic Mage Armor and Epic Warding, I think its just nice to have both spells, one for general usage for a minimum +5 AC and the other for situational short-term extreme tank-ability.<br/>\n<blockquote><div>30 Pale Master 13, Great Str III, Epic ER: Acid<br/>\n31 Pale Master 14<br/>\n32 Fighter 15<br/>\n33 Pale Master 15, Epic Mage Armor (or Epic Spell of Choice), Str28 <br/>\n34 Pale Master 16, Epic Warding<br/>\n35 Fighter 16, Epic WF: Two-bladed sword<br/>\n36 Fighter 17, Great Str IV , Str30<br/>\n37 Bard 4<br/>\n38 Fighter18, Epic WS: Two-bladed sword<br/>\n39 Fighter 19, Great Str V<br/>\n40 Fighter 20, Epic Prowess, Str32</div></blockquote>\nThere are other minor changes I might make in terms of personal preference which I have listed here<br/>\n<details><summary>Spoiler</summary>With the first build, if I am using a two bladed sword being a large weapon (and this is very much a personal preference thing) I would very much like to have improved disarm but the cost would be dropping toughness and improved knockdown which is pretty significant. Overall the difference between the two is small. I am definitely biased towards taking Improved Disarm in large weapon wielders, I just like the feat, and pale masters definitely benefit from more AB, even if it is situational against tiny and small weapon users.\nWith the second build, given you are not going devastating critical, I wonder if it could be made stronger by dropping power attack and cleave, and rearranging feats to take two of toughness, luck of heroes, resist energy (of your choice, just not acid), expertise or called shot\n</details>\n\nStag brings up an interesting comment about discipline. <br/>\n<br/>\nDiscipline protects against knockdown, disarm, called shot and 'sap' (a NPC only ability similar to stunning fist). In practice knockdown is the most important. One option is to use knockdown immune items (usually boots, sometimes helmets).<br/>\n<br/>\nTo prevent a knockdown attempt either your AC exceeds your opponents attack roll (except when they roll a 20), or if they hit the discipline score will need to equal or exceed your opponents attack roll + size modifiers + improved knockdown modifier. <br/>\n<br/>\nI'm attempting a bit of math here. If I make any errors feel free to point em out.<br/>\n<br/>\nWith a Discipline Score of 43, a Str of 32 (Str modifier 11), the modified discipline score without items is 54. A similar sized enemy attempting improved knockdown (+4 bonus) with an AB of 50 is going to have a knockdown discipline check of 51 to 71, and succeed with the knockdown attempt rolling a 4 or more (succeeding 85% of the time). Capping one's strength to 44 will lead to a modified discipline score of 60, and that same opponent will succeed with the knockdown attempt when rolling a 10 or more (ie succeeding 55% of the time). Therefore in practice knockdown immunity is going to be necessary. Even a fighter RDD with base Str 42 capped at 54 and maxed discipline will have a modified 65 discipline score, and that same opponent will succeed on an improved knockdown attempt with a roll of 16 or more (25% chance)<br/>\n<br/>\nIn a PW such as WoG, where disarming opponents are not frequent (in fact I am not sure any exist) one could get away without discipline, but if they were to exist, discipline would be helpful for large weapon wielders. The same enemy attempting improved disarm with a large weapon against this build (two bladed sword version) would create a disarm discipline check of 43-63 (50 +1d20 -4 from ID -4 against large weapon), which the enemy would need to roll a 13 or more (40% chance) to disarm you, 19 or more with capped strength (10% chance). <br/>\n<br/>\nThe situation is very different for the dual kukri version of this build, kukri's being tiny weapons, the same large weapon wielding opponent would have +8 AB (12 AB difference compared to a two bladed sword) when attacking you, the disarm discipline check being 59-79, and your opponent succeeding with disarm all the time without str capped, succeeding with a roll of 2 (ie 95% success) or more with str capped. Even a tiny weapon wielding fighter RDD that opponent will succeed with a roll of 8 or more (65% success) with a fighter RDD capped str 54 given in the example. <br/>\n<br/>\nAnyway bit of a diversion, I very much wanted to understand the mechanics of discipline which is part of the reason why I've posted my math. glad to see you active here again GDL! Hope to have many a build discussion with you!</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:25 PM - Nov 12, 2019",
      "content": "<div>I shouted in joy, and wept in dismay!<br/>\n<br/>\nGDL is back, and posts a whammy of a build!  I'm lovin' it!<br/>\n<br/>\nBut it's a mamby-pamby elf!!!!! *wails*  GDL, NOOOOOOOOOO!<br/>\n<br/>\nMoradin the Soul Forger is pulling out his beard at the loss of his favorite Grizzled One!<br/>\n<br/>\nThat aside, I really like everything about this build!<br/>\n<br/>\n@Orion2019 - The Remorhaz can (and does) Disarm (see Frosties, final confrontation with the Frost Giant Jarl).  Even Monks with fists! (just a slight joke here...get it?  Dis-arm?!).<br/>\n<br/>\nRegarding Discipline - don't forget one can have Epic Skill Focus in Discipline to boost it, and there are items that can boost that even further.  Especially on WoG, where there are some pretty nice boosts available, not to mention the ability to put socket skill boosts on items (now, before anyone jumps on me boot first - I know the socket gem limit for skills has been pretty much nuked to oblivion, BUT one can put multiple gems of the same skill on <em>different </em>socket items and they will add together up to the limit of +50!).<br/>\n<br/>\nWhy is this important?<br/>\n<br/>\nWell, being able to basically ignore KD attempts without needing an item immunity obviously frees up an item slot.  And since this is mostly (not always) Boots, that means that the Dodge AC from that item slot is now available (which is pretty nice!).<br/>\n<br/>\nBack to the Build(s) - going with the Dev Crit version of Baelnorn.<br/>\n<br/>\nIt is soooo hard to choose between double-sword and kukri!<br/>\n<br/>\nI mean, sure, Kukri adds the advantage of being able to go Sword and Board for that lovely AC boost when it is needed, without sacrificing anything in terms of fighting ability (one gets a slight boost in AB, tbh).<br/>\n<br/>\nBut two-hander double-sword gives a lot of advantages here!  1.5x str, only has to be weapon buffed once, and even more important, as a socket item only has to have gems for one weapon!<br/>\n<br/>\nAdmittedly, the Kukri's have a crit threat range that is just...OP.<br/>\n<br/>\nBoth items on WoG are meh magical items in the wild - unless one either makes them (re: socket gems) OR gets fantastically lucky with drops (which, I have never gotten yet).<br/>\n<br/>\nI have gotten a socket gem double sword.  No socket Kukri's, however.<br/>\n<br/>\nI do want to mention the same thing as Orion did regarding EMA and EW - which are just too good to pass up!  Especially a Baelnorn, which is a type of Lich, meaning it should have massive magical protections (which the actual creature does).<br/>\n<br/>\nI am wondering at the possibility to include meta-magic feats to take advantage of another of the PMs abilities - advancing spellcasting ability (albeit not as it should).  Bard is a tough one to combine with PM in this regard, but with Bard level 4 afterwards, that at least opens up the possibility of getting some higher level spells - some meta-magic feats would help this as well.</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "4:49 PM - Nov 12, 2019",
      "content": "<div>@Webshaman, PM spell progression won't work for a Bard in this instance with an 8 Charisma.  Also, while I do agree that Epic Warding is the best defensive buff around, I don't consider it a must have in a build that's already prime on defense.  However, in the non-dev crit version I do recommend Epic Warding.  Both actually get Epic Mage Armor at 33rd level.<br/>\n<br/>\n@Orion, I believe I alluded to it earlier, but I just don't invest points in Discipline.  I think it's a waste of a skill, a waste of skill points, and a total waste of a feat if one were to get an ESF in it.  It's liberating once you divorce yourself from it.  Believe me, I was married to that whore for many years ere I decided it was time for her to go.  Once done, the court awards you 43 skill points that you can wherever and whenever you want.<br/>\n<br/>\nThere are things that Disarm on WoG (King Snurre among others, some places in the deep, and Desert) but it's fairly infrequent and there are always ways to mitigate it.  If I know or suspect an NPC using Disarm, I usually start off with my thrown down weapon.  The Rhemorraz doesn't technically use the Disarm feat so there's no skill check against it (that's a matter of your weapon becoming so hot you are forced to drop it, which makes me think that RDD10 should provide immunity but that's another matter).  But there aren't mobs using such a feat.  Knockdown is much more frequent, and can usually be found among Giants, Dragons, named NPCs, etc.  The built-in defense against knockdown is high AC.  The opponent (who I believe you gave a 50 AB) is already going to be at a -4 to make that hit, which is effectively raising your AC even higher.  We're now at a 63 with no items on the build.  Assuming I have something minor granting +2 shield AC (from Rings or Bracers, and a modest set of +3 Dodging Boots, the AC is now 64 (39 base, +20EMA, +5 other sources).  His 50 AB is reduced to a 46 on his first KD.  He needs an 18 or higher to hit.  Every swing after, until the next round, is going to require a natural 20.   And that doesn't even account for any concealment that we may have UMD'ed prior to the battle (Dust of Disappearance, Improved Invis, etc).  Even if he had Blindfighting, his first swing, if rolls an 18 or higher, has a 25% to miss.  So I like my chances... I don't like his.  <br/>\n<br/>\nBut the point is taken.  If no immunities are available in your environment, then you'll likely want to move on to either another build, or drop Taunt and pump discipline.  But the best immunity is already built in: High AC, and they can't knock you down if you splattered their guts in a devastating attack, or if they in turned are knocked down by you.<br/>\n<br/>\nRegarding dropping PA and Cleave in the non-dev crit version, I think that is fine.  That's a preference thing.  I enjoy these feats early in builds because I get a good return in my investment.  Power Attack is a poor man's Open Lock, and Cleave is just an extra attack, which is another chance at landing a critical.  But Toughness would be the obvious choice.  Your second feat is a little harder to pick (but I wouldn't pick up an Energy Resistance). Or, as a way to mitigate loss of Discipline, pick up both Expertise and Improved Expertise.  Now you they're going to need a 20.  All the time.  That's actually a worthwhile investment, particularly for party play, as the Baelnorn would then be able to tank indefinitely (until the bad guy mages come out).<br/>\n<br/>\nPhew!  So much fun!  I haven't discussed builds in years.    The finer points, the nuances, the nerd mechanics, pre-epic vs post-epic, the curvature of the spine!  I probably need to get out more.</div>"
    }
  ]
}