{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "002",
  "name": "Is Smite worth it?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/is-smite-worth-it-t2356340.html",
  "author": "Pan Draconis",
  "avatar": "10759307_1674117984.jpg",
  "replies": "7",
  "views": "104",
  "posts": [
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "8:58 PM - May 26, 2025",
      "content": "<div>I’ve been thinking about a pure smiter build for now — one that fully leverages all the buffs from the paladin (spells and divine feats), with solid base stats to stay effective even without relying on Smite. Something like a Paladin 26 / CoT 14 with around 40 AB unbuffed.<br/>\n<br/>\nThe question I’m asking myself is: is Smite actually worth using in PvM? The limitations of the feat make me hesitant — three uses per day max, and only against specific alignments.<br/>\n<br/>\nDo any players with experience using this kind of build have thoughts on this?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:50 PM - May 26, 2025",
      "content": "<div>It's an interesting question, which Hip explored in his <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-plight-of-smite-smite-evil-variants-t2303707.html\" rel=\"noreferrer\" target=\"_blank\">Plight of Smite</a> builds back in 2012, and I pursued in my <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/short-term-godhood-vs-reliable-hitting-the-problem-t2355048.html\" rel=\"noreferrer\" target=\"_blank\">Godhood vs Reliable Hitting</a> discussion from 2019.<br/>\n<br/>\nUnfortunately, I still don't really have an answer that satisfies me, which remains one of the reasons why I remain hesitant over Pallies. I know Web has demonstrated the power potential recently - and it's undeniable, but still...<br/>\n<br/>\nThose who have more constructive input will come along soon, I have no doubt.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:06 PM - May 26, 2025",
      "content": "<div>Is Smite worth it?<br/>\n<br/>\nAnd my answer to this is :<br/>\n<br/>\n<strong><em>It totally depends on the environment you are playing in!</em></strong><br/>\n<br/>\nNothing more, nothing less.<br/>\n<br/>\nI will demonstrate why :<br/>\n<br/>\nYou are in an environment where few things are evil (for a Good Smiter, just replace Evil with Good) - Smite will be next to useless.  Seeing as Smite normally has limited uses per rest, if your environment also limits rest, then Smite will certainly not be worth the cost under these two circumstances.<br/>\n<br/>\nHowever, if you are in an environment where there are lots of evil things to encounter, especially endboss types, Smite grows in usefulness.  The higher the levels/the more hps, etc said encounters have, the more interesting Smite becomes.  If you are also in the same environment and not limited by rest restrictions, Smite will be very potent, if not totally OP, dependingly.<br/>\n<br/>\nI see Smite as an \"all in\" ability, either you are all in, and go the full nine yards (Great Smite X, 3x before resting), with a high Cha to take advantage of the damage or you don't really need Smite at all.  I would, however, suggest building your Smiter with enough ability to wade through m0bs without having to utilize those precious Smites.<br/>\n<br/>\nLet us take an environment that I know well - the online Persistent World (re: PW) The World of Greyhawk.  I won't bore you with tedious details, or indepth breakdowns of this or that, endbosses, etc.<br/>\n<br/>\nSimply this - it is an environment where one can really lean on Smite reliably, for the most part.  Especially since Smite is one of the very few abilities that can go above the limits (AB in this case).  It totally ignores the +20 AB limit.  That means if you can get your Smiter to that AB limit (and I won't bore you with ways to do this - the ways are legion), then that Smite is GOING to hit (unless, like me, you are absolutely cursed with rolling 1s OR your opponent has Epic Dodge and/or Displacement, etc, some sort of ability to avoid damage/being hit).  And if it is against something that can be critted...and your Smiter is built for critting...whooboy.  <br/>\n<br/>\n<strong><em>THAT'S ALOT OF DAMAGE!!!!!</em></strong><br/>\n<br/>\nMore than enough to probably put the thing down for good.<br/>\n<br/>\nEven against encounters that are not crittable, the damage done is monstrous...and is often enough by itself to end the encounter swiftly (the case that Stag is referencing above was against a crit immune, but it was still enough to defeat it in one round, despite it having 50% DR vs the damage I was doing).<br/>\n<br/>\nIt has been my enjoyable experience in that environment to play my Smiter (I went with the Pally/Cot/HS build - it performs extraordinarily well in the environment where I play it).  It easily gets through m0bs, it has all the tools, skills, etc necessary to do that, and against endbosses, performs very, very well (being that there are few non-evil ones in the environment where I play it).  Against crittable endbosses...all I can say is YOWSA!!!! <span class=\"text-emoji\">😵</span><span class=\"text-emoji\">🤗</span><br/>\n<br/>\nOn a side note - it can however, be a major \"downer\", meaning that yeah, you slogged your way all through whatever m0bs, lackeys, etc to this point, only to smack the living (perhaps unliving) crud out of whatever is the focus of your Smite in one short go...truly anti-climatic, and I will say, for me personally, that it did get boring after the initial \"Oh HELLLSSS YEAH\".  After 1 billion times X it becomes rather \"Meh\".  I suppose I am \"lucky\" I am so unlucky with rolling 1s...adds some \"spice\" to things?<br/>\n<br/>\nNah.  Fuggin' 1s, man!  I have often had the enraging misfortune to roll 3 1s in a row when Great Smiting...and yes, it hurts your teeth.<br/>\n<br/>\nI can't imagine something like this in an environment that is not rest limited...that seems kinda broken to me.  What would the point be?  <br/>\n<br/>\nWhere was I?  Oh yeah, Smite.  As long as the environment is fortuitous, yes.  If not, no.</div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "1:48 AM - May 27, 2025",
      "content": "<div>What Stag &amp; Web said.  It can be a pain to invest in CHA with PAL/COT (or BG), but I don't recall facing an undead enemy that was not evil and many times, 3 Smites will take out most of the undead/evil bosses.<br/>\n<br/>\nOf course, wasting a Smite because the enemy is neutral sucks big time, so I rarely take Great Smite, but use the Epic Bonus Feats on EWF/EP/AS &amp; (depending on the build) OC/DC or Great Wisdom, putting the Epic Feats into Great Charisma.  That CHA investment pays off with Divine Might and (for Big Bosses), that \"once per rest\" COT Divine Wrath if you go COT.<br/>\n<br/>\nHarper Scout in Epic will also net you 2 Great Charismas plus Eagle's (which I believe stacks with Pally's casting of it).<br/>\n<br/>\nPAL25/COT/10/HS5?</div>"
    },
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "7:24 PM - May 27, 2025",
      "content": "<div>Your answers are what we’d call in French “réponses de Normands” — “Norman answers”, meaning “maybe yes, maybe no.”<br/>\n<br/>\nOr as we say: “ptet bin qu’oui, ptet bin qu’non” — “maybe yes, maybe no.” <span class=\"text-emoji\">😂</span><br/>\n<br/>\nMore seriously though, this makes me want to create a Smite Evil build and do a run of the Lord of Terror module!</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:32 PM - May 27, 2025",
      "content": "<div>Well, you asked about Smite.<br/>\n<br/>\nWhat did you expect from an ability that is dependent upon Alignment?<br/>\n<br/>\nAlso, it is an ability that is extremely limited - meaning that at best, one will get 3x uses of it before having to rest.<br/>\n<br/>\nIt's also a strangely cumulative ability, that increases with each extra boost, all the way up to Great Smite X, which is just O_o ZOMG.<br/>\n<br/>\nThere is nothing like it, not really. </div>"
    },
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "7:37 PM - May 27, 2025",
      "content": "<div>Indeed. Smite is truly unique compared to everything else you can do in NWN. I was joking, but your answers actually addressed my question perfectly.<br/>\n<br/>\nSo LoT seems like the perfect place to explore builds like this.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:31 AM - May 28, 2025",
      "content": "<div>If I recall correctly, the LoT module ends at about lvl 27. It is a great hack'n slash module where a paladin will thrive, but you will not have an end game with a high number of Great smites.</div>",
      "author-color": "#AA0000"
    }
  ]
}