{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "164",
  "name": "Advice for Assassin 26 / Wizard 5 / Ranger 9",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/advice-for-assassin-26-wizard-5-ranger-9-t2354520.html",
  "author": "Scawt",
  "avatar": "10577588_1510287072.jpg",
  "replies": 13,
  "posts": [
    {
      "author": "Scawt",
      "avatar": "no_avatar.png",
      "timestamp": "3:22 AM - Mar 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi guys,<br/>\n<br/>\n I recently started reading these forums after rediscovering NWN, and I've had build fever ever since. When I was younger I mainly played fighter-heavy builds, that usually went Weapon Master and utilised Crit-stacking. Thus since I've come back I've been trying to avoid making any builds like this. I've been perusing (mainly) the level 40 builds, and I haven't yet come across a build that's quite like this, but I apologise anyway if I'm asking a question which has already been answered.<br/>\n<br/>\n The original design goal of this character was to be a Drow assassin which utilised the Darkness/Ultravision combo as a backup when assassination wasn't viable or had failed. I tried to stay away from using Rogue, because I figured that ultimately I would end up taking as few levels as possible in Assassin and pumping Rogue for the bonus feats, which goes against what I had originally intended on doing.<br/>\n<br/>\n 5 levels in Wizard gave me access to level 3 spells, which meant that I had access to Knock and Find Traps (which was important, because I intended on playing a Rogue-like SP module with this build and I wasn't going to be able to do anything until level 7 at the earliest without these spells), but it also allows me access to extended Darkness and Ultravision, as well as other handy level 2 buffs like Flame Weapon and Cat's Grace, etc. I ultimately decided on 5 levels because I felt like it was the most ideal breakpoint for what I wanted to achieve. There was nothing particularly appealing about level 4 spells, and beyond that I figured I would be better off making a Wizard rather than an Assassin.<br/>\n<br/>\n Originally I had planned on only taking a single level of Ranger as a Hide/Move Silently dump to meet the Assassin requirements, as well as taking advantage of the free dual wielding feats. Again, I was trying to stay away from Rogue, so I didn't have a whole lot of options. I considered Pale Master, as I would already qualify for the class and that would be pretty cool from a RP point of view, but ultimately decided against it as I'm not really sold on the usefulness of a Pale Master and what kind of level investment would be required, but that being said I'm not familiar with key CL breakpoints for Wizards. Anyway, I ended up deciding on 9 levels of ranger for (A) access to improved two weapon fighting, but more importantly (B) this pushed me to +16 BAB, allowing four attacks per round, plus two off-hand attacks, meaning that with haste I would breach the 7 attacks per round threshold, allowing triple opening death attacks.<br/>\n<br/>\n The remainder of the levels are simply dumped into Assassin, with no particular goals in mind as of yet.<br/>\n<br/>\n So my quesitons are: <br/>\n 1. Is it worth taking any points in Wisdom? I'm not personally sold on the usefulness of Ranger spells, so I was planning on leaving my WIS at 8. <br/>\n 2. Should I take more levels in Wizard? I'm kind of hesitant to do this because I'll be losing skill points in what already feels like a character with scacely enough skill points as it is.<br/>\n 3. How important are taking initiative feats? I've read that their real only use is for Assassin builds, but do I really want to spend four feats on these? <br/>\n 4. By not taking any levels in Rogues I understand that I won't be able to discover epic traps. This isn't really too concerning because I don't know if this character will even make it to epic levels, as I don't play on any servers and don't really intend to. Should I be more concerned about this?<br/>\n 5. Any general recommendations? Anything important that I'm missing? Any tips of any kind?<br/>\n<br/>\n Thanks guys<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:09 AM - Mar 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Scawt, and welcome!<br/>\n<br/>\n I'm not so hot at the building stuff yet - you know more than I do currently - but while you're awaiting the input from the great and good (and not wanting you to feel ignored!) may I commend to you Mick Dagger's Assassin Guide in the Game Guides section of this forum? Oh, and if you're interested in the traps side of things, HipRedux's guide to them is also well worth a visit.<br/>\n<br/>\n I, too, don't use a server - indeed, have only discovered Aielund and Sands of Fate this year, but I'm rubbish at playing evil characters. However, I did still find Mick's guide both informative and constructive.<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "5:40 AM - Mar 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Let me start by saying that I am by no means an expert but I am not sold on having wizard in the build at all.<br/>\n<br/>\n If HiPS is not nerfed where you play I would take shadowdancer and go with the infinite Stealth -&gt; Death Attack<br/>\n<br/>\n Not 100% but I'm pretty sure the initiative feats are irrelevant if you are attacking from stealth.<br/>\n<br/>\n You could consider Mick's<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2350791/KamaShinobi-Monk-9-Assassin-26-SD-5#.Vvyahfl96M8\" rel=\"noreferrer\" target=\"_blank\"> Kama Shinobi</a> which is a dex based Assassin 26, Monk 9, SD 5<br/>\n<br/>\n or Max's <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354417/Subtle-Death-Ranger-15-Assassin-23-Shadowdancer-2#.VvybXvl96M8\" rel=\"noreferrer\" target=\"_blank\">Subtle Death</a> which is a str based Assassin 23, Ranger 15, SD 2<br/>\n<br/>\n There are also a couple more builds floating round in the Level 40 section.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Scawt",
      "avatar": "no_avatar.png",
      "timestamp": "8:25 AM - Mar 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>Hi Scawt, and welcome!<br/>\n<br/>\n I'm not so hot at the building stuff yet - you know more than I do currently - but while you're awaiting the input from the great and good (and not wanting you to feel ignored!) may I commend to you Mick Dagger's Assassin Guide in the Game Guides section of this forum? Oh, and if you're interested in the traps side of things, HipRedux's guide to them is also well worth a visit.<br/>\n<br/>\n I, too, don't use a server - indeed, have only discovered Aielund and Sands of Fate this year, but I'm rubbish at playing evil characters. However, I did still find Mick's guide both informative and constructive.<br/>\n<br/>\n Cheers</div></blockquote>\n<div align=\"left\">That was a very insightful read, thanks for the recommendation.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Scawt",
      "avatar": "no_avatar.png",
      "timestamp": "8:28 AM - Mar 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Kalistez wrote:</strong><hr/>Let me start by saying that I am by no means an expert but I am not sold on having wizard in the build at all.<br/>\n<br/>\n If HiPS is not nerfed where you play I would take shadowdancer and go with the infinite Stealth -&gt; Death Attack<br/>\n<br/>\n Not 100% but I'm pretty sure the initiative feats are irrelevant if you are attacking from stealth.<br/>\n<br/>\n You could consider Mick's<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2350791/KamaShinobi-Monk-9-Assassin-26-SD-5#.Vvyahfl96M8\" rel=\"noreferrer\" target=\"_blank\"> Kama Shinobi</a> which is a dex based Assassin 26, Monk 9, SD 5<br/>\n<br/>\n or Max's <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354417/Subtle-Death-Ranger-15-Assassin-23-Shadowdancer-2#.VvybXvl96M8\" rel=\"noreferrer\" target=\"_blank\">Subtle Death</a> which is a str based Assassin 23, Ranger 15, SD 2<br/>\n<br/>\n There are also a couple more builds floating round in the Level 40 section.</div></blockquote>\n<div align=\"left\">Fair point, I could drop Wizard to put SD in there for HIPS. I guess I'm not very keen on that kind of abusive playstyle though. I know that in 3.5 D&amp;D Assassin's get HIPS, so it's not like they didn't intend for Assassin's to utilise it. I guess I prefer the idea of casting ultravision and darkness to achieve constant death attacks.<br/>\n<br/>\n I re-read the NWN Wiki about initiative and I think you're right. It's not going to be relevant to attacking a flat footed target.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "9:52 AM - Mar 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You are probably better off abusing UMD for your Darkness and Ultravision needs than taking Wiz, as the spells will be short duration, even when extended.  If going the Dex route you could always take 5 levels of fighter for WS/EWS<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:46 AM - Apr 09, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">My two centavos...<br/>\n<br/>\n The only reason to take ranger is for the companion and low DEX requirement.  I consider that strategy counter-productive.  The WIS element confuses the issue even more since ranger class requires at least 11 at create if you want to hit the ground running AB-wise to qualify for AB 1 feats, an unnecessary restriction for a DW design and ability spread.  All the wiz familiars are better than ranger companions because they can be possessed and some have extremely useful special abilities.  Wiz gets high-level summons which puts all the ranger companions to shame.  There aren't enough FEs at ranger 9 to compensate for the lost WS/EWS of fighter.<br/>\n<br/>\n Now, if this is intended to be a stealth toon, DEX should be high.  To trigger as many DAs (i.e. DC) as possible, INT should be high.  So there is your synergy to balance. <br/>\n<br/>\n To cast arcane reliably without AutoStill (most likely beyond the scope of this combo), the toon will be wearing robes.  That brings us back to DEX investment again as your primary ability and AC.  And that also means Weapon Finesse a must.  Let's assume martial proficiency if you use fighter.  Then select dagger, handaxe, light hammer, mace, shortsword or sickle as weapon of choice.  A DEX build is also a ranged attack build so you will be able to DA well even when switched to bow.<br/>\n<br/>\n Yes, UMD is there but mainly for equipment and divine buffs (if available).  UMD buffs will all be short-lived and easily dispelled.<br/>\n<br/>\n Next, you will need at least Wiz 15 to max your weapon buffs and that means INT 18 to cast all spells that a level 15 Wiz has access to.  That leaves 25 levels to split between assassin and fighter.<br/>\n<br/>\n To get Finesse, WF/EWF, WS/EWF requires at least 4 levels of fighter and possibly more depending on how often you want to dump to discipline.  That means no more than 21 levels of assassin.  But you probably want some access to special attacks like KD/IKD or Expertise, also ImpCrit so may need more fighter levels.  I'd figure Fighter 6, at minimum. Now we are down to Asn 19.  So you can stick with the Level 19 DA bump or stop at Asn 18 and boost Wiz to 16 for more slots and slightly better dispel resistance.  Without alllocating, it is looking like Wiz 16/Ftr 6/Asn 18 at this point. Naturally, you can sacrifice wiz levels to gain more assassin prowess or fighter bonus but it will gimp your buffs (GMW, Flame Weapon, damage shields, etc.).  I didn't run a BAB tally so the APR is still up for grabs at this split.<br/>\n<br/>\n Your wiz will want at least Empower to boost Cat (AC and AB) and Bull (dmg) and Extend for Darkness (a boon for all DAs), the 3 damage shields and mantles.<br/>\n<br/>\n The tricky part is in deciding race.  Halfling would be the race of choice in this build but will limit your weapon alternatives and will likely cause an XP penalty.  Elf will help with detection but at the cost of a feat and skills.  Human 40 more skill points.  Take your pick.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:25 AM - Apr 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I will advice against trying to put too many levels of other classes in an assassin build.<br/>\n You want as many assassin levels as possible for two reasons:<br/>\n The assassin levels form the backbone of your Death attack DC. Intelligence also helps, but the share number of assassin levels is the main contributor.<br/>\n The second reason is that assassin has Great dexterity as epic bonus feat. Dedicated builds can have Great dex X and a total naked dex close to 40, and still have room for the essential epic combat feats. That makes warrior-like AB achievable.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:22 AM - Apr 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ahhh... I see where you guys are going with an assassin.  Essentially, an evil rogue without ED and epic traps.<br/>\n<br/>\n Never realized the class got Grt Dex like an AA (hmm... did I just hear a bell go ding?) because I never use it for anything else than a dump class that avoids XP penalty. Too bad the Darkness is so limited.  But the issue still remains exactly the same as a high-level rogue... how do you dent undead, constructs, elementals, dragons, ooze, etc.?  That's why a mitigator with damage shields and even offensive spellcasting power has merit.  Weaker assassin but stronger PvM influence especially with the extended Darkness.<br/>\n<br/>\n But, yes, to commit to a dedicated all-or-nothing assassin, then definitely shoot for Asn 30 and screw the INT synergy.  Maybe Ftr 8 and SD 2 to round it out, if HiPS doesn't cause bad dreams. Else, Ftr 10 will give the most bang with 6 bonus.  Who ever heard of an assassin dragging a badger or dire rat around while preparing for a stealth attack anyway?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:24 PM - Apr 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/> But the issue still remains exactly the same as a high-level rogue... how do you dent undead, constructs, elementals, dragons, ooze, etc.?  That's why a mitigator with damage shields and even offensive spellcasting power has merit.  Weaker assassin but stronger PvM influence especially with the extended Darkness.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Assassin has UMD and can use magic from scrolls and items, just like rogues can. Traps are there for alternative damage, eg holy traps vs tough undead. Assassins can also set epic traps.<br/>\n You can use mace as a blunt finessable weapon(s) in case of piercing resistance. You can buff the weapon with GMW, and Flame weapon scrolls. You can cast damage shields from scrolls.<br/>\n And if that doesn't satisfy, then you can use fighter for WS and EWS, and even build the assassin strength based for more reliable damage.<br/>\n On the other hand, for practical purposes, you do have 10-15 levels to spend as you please, for things like Ranger10/SD2, Rogue13/SD1 or some caster combo, but don't expect much offensive spellcasting power.<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:24 PM - Apr 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here is a build with Wizard that I found on my hard-drive.<br/>\nSpoiler [+]<br/>\n<br/>\n<span style=\"color:#000000\">Wizard(10), Pale Master(2), Assassin(28), Halfling</span><br/>\n<span style=\"color:#000000\">STR: 10</span><br/>\n<span style=\"color:#000000\">DEX: 18 (36)</span><br/>\n<span style=\"color:#000000\">CON: 14</span><br/>\n<span style=\"color:#000000\">WIS: 8</span><br/>\n<span style=\"color:#000000\">INT: 16</span><br/>\n<span style=\"color:#000000\">CHA: 8</span><span style=\"color:#000000\"> </span><br/>\n<br/>\n<span style=\"color:#000000\">01: Wizard(1): Ambidexterity, {Scribe Scroll}</span><br/>\n<span style=\"color:#000000\">02: Wizard(2)</span><br/>\n<span style=\"color:#000000\">03: Wizard(3): Weapon Finesse</span><br/>\n<span style=\"color:#000000\">04: Wizard(4): DEX+1, (DEX=19)</span><br/>\n<span style=\"color:#000000\">05: Pale Master(1)</span><br/>\n<span style=\"color:#000000\">06: Assassin(1): Weapon Focus: Dagger</span><br/>\n<span style=\"color:#000000\">07: Assassin(2): {Uncanny Dodge I}</span><br/>\n<span style=\"color:#000000\">08: Assassin(3): DEX+1, (DEX=20)</span><br/>\n<span style=\"color:#000000\">09: Wizard(5): Two-Weapon Fighting, Extend Spell</span><br/>\n<span style=\"color:#000000\">10: Wizard(6)</span><br/>\n<span style=\"color:#000000\">11: Assassin(4)</span><br/>\n<span style=\"color:#000000\">12: Assassin(5): DEX+1, Blind Fight, (DEX=21)</span><br/>\n<span style=\"color:#000000\">13: Assassin(6)</span><br/>\n<span style=\"color:#000000\">14: Wizard(7)</span><br/>\n<span style=\"color:#000000\">15: Wizard(8): Knockdown</span><br/>\n<span style=\"color:#000000\">16: Assassin(7): DEX+1, (DEX=22)</span><br/>\n<span style=\"color:#000000\">17: Assassin(8)</span><br/>\n<span style=\"color:#000000\">18: Wizard(9): Improved Two-Weapon Fighting</span><br/>\n<span style=\"color:#000000\">19: Wizard(10): Empower Spell,  or Craft Wand</span><br/>\n<span style=\"color:#000000\">20: Pale Master(2): DEX+1, (DEX=23)</span><br/>\n<span style=\"color:#000000\">21: Assassin(9): Epic Weapon Focus: Dagger</span><br/>\n<span style=\"color:#000000\">22: Assassin(10)</span><br/>\n<span style=\"color:#000000\">23: Assassin(11)</span><br/>\n<span style=\"color:#000000\">24: Assassin(12): DEX+1, Epic Prowess, (DEX=24)</span><br/>\n<span style=\"color:#000000\">25: Assassin(13)</span><br/>\n<span style=\"color:#000000\">26: Assassin(14): Great Dexterity I, (DEX=25)</span><br/>\n<span style=\"color:#000000\">27: Assassin(15): Great Dexterity II, (DEX=26)</span><br/>\n<span style=\"color:#000000\">28: Assassin(16): DEX+1, (DEX=27)</span><br/>\n<span style=\"color:#000000\">29: Assassin(17)</span><br/>\n<span style=\"color:#000000\">30: Assassin(18): Armor Skin, Great Dexterity III, (DEX=28)</span><br/>\n<span style=\"color:#000000\">31: Assassin(19)</span><br/>\n<span style=\"color:#000000\">32: Assassin(20): DEX+1, (DEX=29)</span><br/>\n<span style=\"color:#000000\">33: Assassin(21): Great Dexterity IV, (DEX=30)</span><br/>\n<span style=\"color:#000000\">34: Assassin(22): Great Dexterity V, (DEX=31)</span><br/>\n<span style=\"color:#000000\">35: Assassin(23)</span><br/>\n<span style=\"color:#000000\">36: Assassin(24): DEX+1, Great Dexterity VI, (DEX=33)</span><br/>\n<span style=\"color:#000000\">37: Assassin(25)</span><br/>\n<span style=\"color:#000000\">38: Assassin(26): Great Dexterity VII, (DEX=34)</span><br/>\n<span style=\"color:#000000\">39: Assassin(27): Great Dexterity VIII, (DEX=35)</span><br/>\n<span style=\"color:#000000\">40: Assassin(28): DEX+1, (DEX=36)</span><span style=\"color:#000000\"> </span><br/>\n<br/>\n<span style=\"color:#000000\">Hitpoints: 300</span><br/>\n<span style=\"color:#000000\">Saving Throws (Fortitude/Will/Reflex): 21/22/33</span><br/>\n<span style=\"color:#000000\">Saving Throw bonuses: Traps: +2, Poison: +6, Fear: +2</span><br/>\n<span style=\"color:#000000\">BAB: 22</span><span style=\"color:#000000\">AB (mundane): 40 (melee), 38 (ranged)</span><br/>\n<span style=\"color:#000000\">AC (naked): 36</span><br/>\n<span style=\"color:#000000\">Spell Casting: Wizard(6)</span><br/>\n<span style=\"color:#000000\">Alignment Changes: 0 <br/>\n<br/>\n Skillpoints: 271</span><br/>\n<span style=\"color:#000000\">Disable Trap 23(26), Hide 43(60), Move Silently 43(62), Open Lock 1(14), Search 18(21), Set Trap 1(16), Spot 43(46), Tumble 40(53), UMD 41(40), remaining skillpoints 18</span><br/>\n<span style=\"color:#000000\">Note to self [[Might take some Spellcraft here]]</span><span style=\"color:#000000\"> </span><br/>\n<br/>\n Skillchart:<br/>\n<span style=\"color:#000000\">01: Save(20), </span><br/>\n<span style=\"color:#000000\">02: Save(25), </span><br/>\n<span style=\"color:#000000\">03: Save(30), </span><br/>\n<span style=\"color:#000000\">04: Save(35), </span><br/>\n<span style=\"color:#000000\">05: Hide(8), Move Silently(8), Save(24), </span><br/>\n<span style=\"color:#000000\">06: Disable Trap(1), Hide(1), Move Silently(1), Open Lock(1), Search(4), Spot(9), Tumble(8), UMD(6), </span><br/>\n<span style=\"color:#000000\">07: Hide(1), Move Silently(1), Spot(1), Tumble(2), Save(2), </span><br/>\n<span style=\"color:#000000\">08: Hide(1), Move Silently(1), Spot(1), Tumble(1), UMD(5), </span><br/>\n<span style=\"color:#000000\">09: Save(5), </span><br/>\n<span style=\"color:#000000\">10: Save(10), </span><br/>\n<span style=\"color:#000000\">11: Disable Trap(4), Hide(3), Move Silently(3), Set Trap(1), Spot(3), Tumble(3), </span><br/>\n<span style=\"color:#000000\">12: Hide(1), Move Silently(1), Search(2), Spot(1), Tumble(1), Save(1), </span><br/>\n<span style=\"color:#000000\">13: Hide(1), Move Silently(1), Spot(1), UMD(5), </span><br/>\n<span style=\"color:#000000\">14: Save(5), </span><br/>\n<span style=\"color:#000000\">15: Save(10), </span><br/>\n<span style=\"color:#000000\">16: Disable Trap(4), Hide(3), Move Silently(3), Search(3), Spot(3), Save(1), </span><br/>\n<span style=\"color:#000000\">17: Hide(1), Move Silently(1), Spot(1), Tumble(5), </span><br/>\n<span style=\"color:#000000\">18: Save(5), </span><br/>\n<span style=\"color:#000000\">19: Save(10), </span><br/>\n<span style=\"color:#000000\">20: Hide(3), Move Silently(3), Save(9), </span><br/>\n<span style=\"color:#000000\">21: Disable Trap(4), Hide(1), Move Silently(1), Spot(4), Save(6), </span><br/>\n<span style=\"color:#000000\">22: Hide(1), Move Silently(1), Spot(1), Tumble(5), Save(5), </span><br/>\n<span style=\"color:#000000\">23: Hide(1), Move Silently(1), UMD(10), </span><br/>\n<span style=\"color:#000000\">24: Hide(1), Move Silently(1), Search(3), Spot(2), </span><br/>\n<span style=\"color:#000000\">25: Hide(1), Move Silently(1), Search(4), Spot(1), </span><br/>\n<span style=\"color:#000000\">26: Hide(1), Move Silently(1), Search(2), Spot(1), Save(2), </span><br/>\n<span style=\"color:#000000\">27: Hide(1), Move Silently(1), Spot(1), Tumble(5), Save(1), </span><br/>\n<span style=\"color:#000000\">28: Hide(1), Move Silently(1), Spot(1), UMD(5), </span><br/>\n<span style=\"color:#000000\">29: Disable Trap(4), Hide(1), Move Silently(1), Spot(1), </span><br/>\n<span style=\"color:#000000\">30: Disable Trap(4), Hide(1), Move Silently(1), Spot(1), </span><br/>\n<span style=\"color:#000000\">31: Disable Trap(2), Hide(1), Move Silently(1), Spot(1), Save(2), </span><br/>\n<span style=\"color:#000000\">32: Hide(1), Move Silently(1), Spot(1), Tumble(5), Save(1), </span><br/>\n<span style=\"color:#000000\">33: Hide(1), Move Silently(1), Spot(1), UMD(5), </span><br/>\n<span style=\"color:#000000\">34: Hide(1), Move Silently(1), Spot(1), Save(4), </span><br/>\n<span style=\"color:#000000\">35: Hide(1), Move Silently(1), Spot(1), Save(8), </span><br/>\n<span style=\"color:#000000\">36: Hide(1), Move Silently(1), Spot(1), Save(12), </span><br/>\n<span style=\"color:#000000\">37: Hide(1), Move Silently(1), Spot(1), Tumble(5), Save(11), </span><br/>\n<span style=\"color:#000000\">38: Hide(1), Move Silently(1), Spot(1), UMD(5), Save(10), </span><br/>\n<span style=\"color:#000000\">39: Hide(1), Move Silently(1), Spot(1), Save(14), </span><br/>\n<span style=\"color:#000000\">40: Hide(1), Move Silently(1), Spot(1), Save(18),<br/>\n</span><br/>\n<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Scawt",
      "avatar": "no_avatar.png",
      "timestamp": "9:27 AM - Apr 13, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I had looked into using a few levels of PM which is pretty cool thematically as well as practically.<br/>\n<br/>\n I guess I'm sold on the idea of dropping the Ranger levels as the mediocre compromise between high BAB, access to hide/MS and the free dual wielding feats. Seems like Fighter is a preferable option and doesn't cost inordinate amounts of additional skill points.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:05 PM - Apr 13, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Beware that fighter must cross class the stealth skills. Unless your third class has both stealth skills as class skills, you will not be able to start taking assassin levels before level 14.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "10:55 PM - Apr 13, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>Beware that fighter must cross class the stealth skills. Unless your third class has both stealth skills as class skills, you will not be able to start taking assassin levels before level 14.</div></blockquote>\n<div align=\"left\">Yup.  That's exactly what happened with a divine Asn dexer I've been toying with (built but not played yet).  Fortunately, the higher-than-normal INT (in my case, INT 16) is not wasted by virtue of the DA DC.  The choice comes down to detection vs. traps for the most part.  The cross-classing is expensive but not unmanageable. </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}