{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "864",
  "name": "Sorcerer for SoU/HotU playthrough",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/sorcerer-for-sou-hotu-playthrough-t2355059.html",
  "author": "WelshAviary",
  "avatar": "10404082_1510287071.jpg",
  "replies": 1,
  "posts": [
    {
      "author": "WelshAviary",
      "avatar": "no_avatar.png",
      "timestamp": "1:13 PM - May 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello everyone, <br/>\n<br/>\nRecently someone at neverwinter vault recommended me this site for character builds, and I have to admit that I never heard about this forum before. Most of my build searches and discussions were on GameFAQs and BioWare forums, but as time passed those communities grew smaller and inactive. I'm glad that I found a forum like this still being maintained by someone like you guys who love this game, and even tho I don't have much free time, I hope I can contribute to it from time to time. Since this is my first time being here I hope I'm posting in the right place, so forgive me if I'm posting in the wrong subforum.<br/>\n<br/>\nAnyways, I'm looking for a full sorcerer build that I can play through SoU and HotU more as a pure spellcaster than a melee build. The maximum level which can be achieved in HotU I believe is 30.<br/>\n<br/>\nI haven't played in a long time (especially as a sorcerer) so I hope you guys can help me choose the correct stats, skills, feats and spells on each level.<br/>\n<br/>\nI'm also wondering is it possible to solo through the SoU with a sorcerer without any henchman? I feel like having henchman + familiar + summon will reduce my XP gain heavily and I'd rather be able to prepare myself well for HotU by gaining as much levels as possible, so any tips on soloing SoU would be appreciated.<br/>\n<br/>\nAny recommendations?<br/>\n<br/>\nThanks in forward.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:23 PM - May 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Welsh Aviary, and welcome aboard!<br/>\n<br/>\nAfraid I don't profess to being an expert on users of the sorcerous arts, but until such time as one who is comes along, you could have a look at Mick Dagger's <strong>Exalted Sorceress Minor</strong> (Sorcerer 28/ Paladin 1/ Monk 1) in the Level 30 sub-forum. If you feel a bit rusty with the class, you could also have a read of my own \"Shh, Tell No One\" thread in this Build Request sub-forum, which effectively is a master class from mostly Mick and Valerfor in how to build a sorcerer from the ground up.<br/>\n<br/>\nAs far as henchies are concerned, the AI in the Original Campaign and Expansions is sucky at best, so feel free to solo it. The only exception I sometimes make is for Deekin (the Bard/ RDD kobold available in both SoU and HotU), and that's more for the fact that he's fun to have around than anything else.<br/>\n<br/>\nSorry this is more of a holding reply than anything, but I just wanted to say hello.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}