{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "975",
  "name": "High Damage Cleric or Favoured soul of Shaundakul",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/high-damage-cleric-or-favoured-soul-of-shaundakul-t2354878.html",
  "author": "Lucas1980",
  "avatar": "no_avatar.png",
  "replies": "1",
  "views": "253",
  "posts": [
    {
      "author": "Lucas1980",
      "avatar": "no_avatar.png",
      "timestamp": "5:02 PM - May 09, 2018",
      "content": "<div>Hi guys, I'm in search of a build for this roleplay pg Idea.<br/>\nThe pg will be played on a 30level cap server, with long long time to reach it, so he must be character playable from 1 to 30lev.<br/>\nThe idea is a globetrotting boy, cleric or favoured soul of shaundakul, who goes around with his faithful big sword. <br/>\nThe character must have at most three classes (3base class or 2base class +1PC) compatible with each other, it's for a roleplay server.<br/>\n<br/>\nI wish I could have as many  skill points as possible (2-3 per level) to spend on roleplay skills.<br/>\nAt a technical level I just have a good damage output and a good AC.<br/>\n<br/>\nHelp me! ^_^<br/>\n</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:28 PM - May 11, 2018",
      "content": "<div>Cleric of the God of Winds eh?<br/>\n<br/>\nWell, Clerics do not need much help to be effective so something simple will work fine. <br/>\nTry Cleric 24/ Fighter 6 (Cleric 16/ Fighter 4 pre-epic), strength-based and you shall be fine. <br/>\nI am assuming Arelith server that's why I avoided single dips in other classes.<br/>\n<br/>\nMake sure you take spell focus/greater spell focus in evocation pre-epic, then follow-up with epic spell focus. Take extent &amp; empower spell as well. <br/>\nThe rest of your feats should be weapon focus in greatsword, improved critical, blind-fight, knockdown, weapon specialization, power attack &amp; cleave.<br/>\nIn epic levels, you should also take epic prowess, epic weapon focus, epic weapon specialization, armour skin &amp; great wisdom I.<br/>\n<br/>\nAttributes (Starting/Final):<br/>\nStr: 16(20), Dex: 8, Con: 14, Int: 12, Wis: 16(20), Cha: 8</div>"
    }
  ]
}