{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "280",
  "name": "25 Ranger 15 pally?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/25-ranger-15-pally-t2354318.html",
  "author": "campgod",
  "avatar": "10235447_1565972826.jpg",
  "replies": 9,
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "8:51 PM - Sep 15, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello everyone, back again with another thought. Please tell how this should be made. I really like rangers and someone I play with said I should check out a lvl split of 25/15 any thought on that?<br/>\n Lvl 40 for PvP. Playability isnt a issue as one can lvl to 40 pretty fast. I am open to any weapon,race or play style. So just let your imagination run wild. Thank you for your time. Going Duel class for a slight AB increase.<br/>\n I did find this one but if anyone has another view on the 25Ranger 15Pally I would like to see it. <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build276571.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 76571.html</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:41 PM - Sep 15, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's a tough call man,<br/>\n<br/>\n This is one of the builds that you wish you had even a couple levels more to round things up, too bad we don't have that option. Between Ranger &amp; Paladin there is a WIS synergy but nothing else and Ranger needs as many levels as you can get to work properly. Thankfully for you the Favored Enemies in a PvP arena are significantly fewer and you can perhaps afford to have only 5-6 of them. The build you linked from Tyr is good but i would change the weapon style and all because this build has no good AC for an arena fight. In fact let me re-shape it to a Ranger 23/ Rogue 2/ Paladin 15, take first level as a Ranger for more skill points, mix Paladin there as you see fit, take the two levels of Rogue only in Epics to keep your BAB to the highest. With your Ranger bonus feat take an additional FE and take Bane of Enemies (BoE) with a general feat. Starting with (STR 17  DEX 09  CON 12  INT 14  WIS 14  CHA 08) you need three Great STR to finish on a STR 30. Final attributes should be (STR 30  DEX 09  CON 12  INT 14  WIS 14  CHA 08) and your AC should be way higher.<br/>\n<br/>\n Pre-epic feats: Heavy armour Proficiency (Free from Paladin), Blind Fight,Knockdown/ Improved Knockdown, WP: Exotic (to get the good forging bonses), WF, IC, Expertise, Toughness.<br/>\n<br/>\n Epic feats: FE VI (Ranger bonus), Great STR III, EWF, EP, Armour Skin, BoE.<br/>\n<br/>\n For weapons i recommend either a Katana/ Dwarven Waraxe or a Scythe, all the damage from BoE gets multiplied on criticals as well.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "10:41 PM - Sep 15, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Valerfor! I will give that a try and see what happens. I'll let you know. KD and Imp KD don't really do much for the PvP part so do you think maybe bumping up saves with Great Fort and Iron will?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:48 PM - Sep 15, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Save boosters are always a nice alternative and i would recommend you to take Great Fortitude &amp; Luck of Heroes if you want to buff more your fortitude save.<br/>\n<br/>\n Have fun!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "2:11 AM - Sep 16, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I lalso ike valerfors suggestions. <br/>\n However the rp'r in me is screaming shadowdancer for some reason. Start as ranger as suggested then by a chance encounter of some sort this child of the forest is brought up by pallys. after awhile (the 15 pally lvls with a few ranger mixed in) he/she feels the draw of nature calling blah blah blah after some adventuring said character was a shadow among the woods striking down all evil and then fading away like they were never there at all. <br/>\n I know you lose the skill set of the rogue in exchange for hips the bigger lose (besides umd) is probably the feat swap to get sd in the first place.<br/>\n Just a thought.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:57 AM - Sep 16, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Another very nice option since you do have some available feats is to take Extend Spell, this is very crucial for Paladin's spells and especially Divine Favor because an extended version of it will probably last you for the entire fight (20 rounds), so probably take Great Fortitude &amp; Extend Spell.<br/>\n<br/>\n Darknight's suggestion is also cool if you have the skills to take advantage of HiPS, which you will probably have with 14 INT. You will need Dodge &amp; Mobility for qualifying though.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "4:13 AM - Sep 16, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Valerfor wrote:</strong><hr/>Darknight's suggestion is also cool if you have the skills to take advantage of HiPS, which you will probably have with 14 INT. You will need Dodge &amp; Mobility for qualifying though.</div></blockquote>\n<div align=\"left\"> </div>\n\n  It's the dex attribute needing to be 13  the ints already good. so you'd need to drop starting str to 15 (I think) to get it (dex up from 9) .<br/>\n Other than that it's an ok idea. <br/>\n I have a really bad habit of rp-Itis valerfors rogue idea is probably better for pvp.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:34 AM - Sep 16, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Not a bad habbit at all darknight,<br/>\n<br/>\n I have build and played up to level 25-30 lot's of builds that were pure rp or just fun myself and i never regret it ;)<br/>\n<br/>\n<br/>\n Here is another idea for ya campgod, instead of going Ranger 23/ Rogue OR SD 2/ Paladin 15, you can also try Ranger 23/ Monk 1/ Paladin 16. Reason for that is that the 16th Paladin level gives you another second level spell slot that can be used for another extended DF (those +5/+5 bonuses are huge!), plus Monk gives you free cleave as well and also fits better due to the lawful theme of the build. Rogue it's probably still better though but we are talking about micro-details here, whatever you choose i hope you enjoy it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "12:56 AM - Sep 17, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Some great ideas from you both! What is great about the server I play on, is I can lvl to 40 and then switch it all up and re-lvl. Well to lvl 1 that is and can not change my starting stats... I am guessing If I try the Monk route just throw it in at lvl 39 or 40? thanks to you both!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:47 AM - Sep 17, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yup, as long as it is between 37th-40th lvl it does not matter, Monk will give you full ranks in  tumble and evasion/cleave.<br/>\n<br/>\n Have fun!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}