{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "010",
  "name": "Creating and optimizing builds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/creating-and-optimizing-builds-t2355499.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 0,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:44 PM - Jun 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><span style=\"font-size:150%;line-height:normal\"><strong>Creating and optimizing builds</strong></span><br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_ff9c2a402a0109dcfbc409cfdf82b5f7.jpg\" />\n</dl>\n</span><span style=\"font-size:50%;line-height:normal\">Image Source: <a class=\"postlink\" href=\"https://aerroscape.deviantart.com/art/Rungholt-539881786\" rel=\"noreferrer\" target=\"_blank\">https://aerroscape.deviantart.com/art/R ... -539881786</a></span><br/>\n<br/>\nI've probably written about 100 different build and build drafts in the ECB over the last 12 months for PvM. The creative juices are slowing down in terms of creating new builds, not surprising given the amount I have explored. <br/>\n<br/>\nI think it is worthwhile to share the creative process I use when designing new builds, as it might help someone. <br/>\n<br/>\nI would also be delighted to hear about how other ECB guild members design builds of their own, whether it be spontaneous, structured, or a bit of both, as I might learn something. <br/>\n<br/>\nPlease note my build design methods are not intended for PvP, although some of the concepts could be shared.<br/>\n<br/>\n<br/>\n<strong>The Tools</strong><br/>\nI use the <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/other/tool/characterbuildcalculator-cbc\" rel=\"noreferrer\" target=\"_blank\">Character Builder Calculator Spreadsheet</a> to create my builds. For someone new to building, if you have a copy of Microsoft Excel that will open it, I would highly recommend this, because the DnD 3.0 rules are pretty complex and this is a brilliant tool. Kamiryn is still active and has been working to keep this up to date, I have noted he last updated this in March this year after feedback from Aquarius_233 and others from the ECB guild.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://neverwintervault.org/sites/neverwintervault.org/files/project/1431/images/1120481179fullres.jpg\" /><br/>\n<span style=\"font-size:50%;line-height:normal\">Source: <a class=\"postlink\" href=\"https://neverwintervault.org/sites/neverwintervault.org/files/project/1431/images/1120481179fullres.jpg\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/sites/neve ... ullres.jpg</a></span><br/>\n<br/>\nOther methods include writing the build out on paper, and/or using a character creation module (such as <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/pretty-good-character-creator-customizer-pgc3-powered-igipe\" rel=\"noreferrer\" target=\"_blank\">Pretty Good Character Creator</a>) to design the build. <br/>\n<br/>\nThe most important tool however, is the imagination, because like the picture conveys, there are yet many builds yet undiscovered waiting to be explored, and the sky is the limit in terms of possibilities.<br/>\n<br/>\n<strong>The Core </strong><br/>\nEvery build wants something that makes it special. I call this 'the core' of the build. It is something that makes the build unique and different to other build designs. <br/>\n<br/>\nMaximillan Kane <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/a-complete-guide-to-the-basics-of-character-buildi-t515440.html\" rel=\"noreferrer\" target=\"_blank\">in his guide</a> to building has a similar starting point, which he calls 'The Character Concept'.<br/>\n<br/>\nI view it like the 'flash of inspiration' that one has when they come up with a good idea, the so called 'light bulb' moment. \"I think a build with x and y might be awesome in z environment\" is a common starting point for all the builds I have designed. Or a role playing build around a  character, like <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/i-m-the-batman-m19-r5-sd16-draft-batman-build-for--t2355086.html#p15181\" rel=\"noreferrer\" target=\"_blank\">Batman</a>, <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/strange-craze-sorcerer-22-bg-11-monk-7-t2354683.html#p1072\" rel=\"noreferrer\" target=\"_blank\">Doctor Strange</a> or <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20906#p20906\" rel=\"noreferrer\" target=\"_blank\">Darth Vader</a>.<br/>\n<br/>\nIt could be mechanic related ie. Fighter/Rogue, Sorcerer/Paladin or a <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/double-devastating-edr-iii-juggernaut-half-elven-f-t2355336.html#p18865\" rel=\"noreferrer\" target=\"_blank\">dual melee and ranged 40+ AB dev crit Fighter/Bard/AA</a>. It could also be role-playing related, as discussed. <br/>\n<br/>\nThis is the part of the build that makes it special, and is something that I believe one avoids changing, because without it, it is a different build. Hence this part of the build is the 'core' of the build, and should avoid being altered significantly.<br/>\n<br/>\nThe environment is important to consider. A devastating critical weapon master scimitar build might be incredible against critical hit vulnerable opponents but has its power substantially reduced against critical immune enemies such as Undead, Pale Masters or Constructs particularly if they are hard hitting or have devastating critical themselves, also some environments have reduced the power of devastating critical (ie <a class=\"postlink\" href=\"https://soulforge.world/tiki/tiki-index.php?page=Feat+Changes\" rel=\"noreferrer\" target=\"_blank\">Soulforge</a>) or even disabled it completely (ie Aielund). A low AC high HP high damage reduction damage shield (Mestil's Acid Sheath / Elemental Shield) build might have some of the highest damage outputs possible in the game against melee mobs without dispels or breaches and be amazing, but could struggle against ranged enemies, spellcasters or elemental (acid/fire) immune enemies where the damage shields will do little or no damage.<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_631044e478ee70e2264d809b15f39217.jpg\" /></dl>\n</span><span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://i.ytimg.com/vi/tlaNr6raCpQ/maxresdefault.jpg\" rel=\"noreferrer\" target=\"_blank\">https://i.ytimg.com/vi/tlaNr6raCpQ/maxresdefault.jpg</a></span><br/>\n<br/>\n<br/>\n<strong>The Additions</strong><br/>\nOnce one has the 'core' of the build, one adds features to enhance it. <br/>\n<br/>\nIt could be a third class, different races, weapon choice, feat choices, avoiding experience penalties or something else. It could be to enhance a strength, protect a weakness or add an extra feature. <br/>\n<br/>\nA Fighter/Rogue might have low saves, and adding Champion of Torm, Paladin or Blackguard could help increase the saves. Or one could boost AB even further by taking Weapon Master. <br/>\n<br/>\nA Sorcerer/Paladin might have low AB, and adding Red Dragon Disciple 10 could boost Str and AB. One might add Monk or Rogue to add evasion to take advantage the boosted reflex save. Or one could make it a half-elf Cha 30-&gt;42 Sorcerer/Paladin, add Arcane Archer and Divine Might, <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-divine-spell-bow-sorcerer-26-paladin-4-arcane--t2355216-s10.html#p20741\" rel=\"noreferrer\" target=\"_blank\">to add a divine damage ranged attack with useful ranged AB with minimal dexterity investment</a>.  <br/>\n<br/>\n<strong>The Attributes</strong><br/>\nThe Core and Additions will determine what attributes are important and what are unimportant to the build. <br/>\n<br/>\nI call these 'primary', 'secondary' and 'dump' attributes (or stats).<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_cd510a09cb301758b6ad38480e7bd209_t.jpg\" />\n</dl>\n</span><span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://www.wallpapers13.com/wp-content/uploads/2017/03/Hero-Zhao-Yun-skin-computer-images-video-game-King-of-Glory-HD-Wallpaper-1920x1080-1280x960.jpg\" rel=\"noreferrer\" target=\"_blank\">https://www.wallpapers13.com/wp-content ... 80x960.jpg</a></span><br/>\n<br/>\n<strong>Primary Attribute</strong><br/>\nThe primary attribute is intended to be the highest attribute in the build. For a melee character, this is the attribute which determines melee AB, either Strength or Dexterity with the Weapon Finesse feat. For a ranged character, this is the attribute which determines ranged AB, either Dexterity or Wisdom with the Zen Archery feat. For a spellcaster, this is either the relevant spellcasting attribute Wisdom (Cleric/Druid), Intelligence (Wizard) or Charisma (Sorcerer), or the Constitution statistic for 'tank' caster builds. <br/>\n<br/>\nOne will try to boost the primary attribute as high as possible, within the limitation of other features which make the build enjoyable to play. This means focusing attribute increases on the primary attribute as much as possible (such as the attribute increases every 4 levels or Great Attribute feats in epic levels, for example).<br/>\n<br/>\n<strong>Secondary Attribute(s)</strong><br/>\nOther attributes which are important but not the primary attribute I call 'secondary attributes'. The class combinations and intended playstyle determine what is secondary. <br/>\n<br/>\nFor a strength based melee fighter wearing Full Plate not interested in ranged attacks, I choose constitution and intelligence. For a dexterity based melee rogue wearing robes trying to do a lot of sneak damage, strength, constitution and intelligence. For a strength based paladin wearing full plate, using divine might and divine shield, strength, constitution, wisdom, intelligence and charisma. For a wisdom based caster and dragon shape Druid/Monk, intelligence and constitution. For a wisdom based cleric zen archer avoiding melee with summons, intelligence might be the only secondary attribute of interest. For a constitution based Wizard/Pale master, this would be the intelligence statistic (at least 19).<br/>\n<br/>\nDifferent class mixes require more secondary attributes than others. Such class mixes are called Multiple Attribute Dependant builds or M.A.D builds. Classes which have 4 or more important attributes include Paladin, Blackguard, Weapon Master, Str/Dex/Cha based Clerics, some Dwarven Defenders.<br/>\n<br/>\nIntelligence is a very common secondary attribute because it determines the number of skill points available, access to feats such as improved knockdown and expertise, and wizard spellcasting. <br/>\n<br/>\nConstitution is also a common secondary attribute for any melee based build, as it determines base hitpoints, and the fortitude save (which is a very important save, as it helps against death magic, devastating critical, implosion and petrify). <br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_03f10b12ac76d154960fe703220822dc.jpg\" />\n</dl>\n</span><br/>\n<span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://c4.wallpaperflare.com/wallpaper/329/171/757/fantasy-art-magic-warrior-sword-wallpaper-preview.jpg\" rel=\"noreferrer\" target=\"_blank\">https://c4.wallpaperflare.com/wallpaper ... review.jpg</a></span><br/>\n<br/>\n<br/>\n<strong>'Dump' Attribute</strong><br/>\nThe 'Dump' attributes is the attribute that is not raised at all to allow other attributes to be raised much higher. A strength fighter/rogue in full plate might 'dump' Dexterity, Wisdom and Charisma, setting the starting score at 8 for these three stats, allowing a starting Str 18 Con 12 Int 14 or Str 16 Con 16 Int 16. A strength based paladin with divine might who wants some skills, or have improved knockdown as a feat, might not have that luxury, only being able to 'dump' dexterity, and often will have a starting Str 15 Con 12 Int 14 Wis 14 Cha 14, as an example. Dumping attributes do introduce weaknesses, for example, putting Wisdom to 8 will mean the Will score and listen, spot or heal skills have a -1 penalty, however I find there are often ways to manage this, including taking feats for saves (ie Iron Will), buffs (ie. Clarity potions / Prot v Evil scrolls), and this allows another important attribute to be stronger.<br/>\n<br/>\n<strong>Starting attributes</strong><br/>\nOnce one is aware of the primary, secondary and dump attributes, one can design the starting attributes, and a few examples have been given in the text.<br/>\n<br/>\n<strong>The Leveling Order</strong><br/>\n<strong>Pre-epic split</strong><br/>\nWhat amounts of classes I want pre-epic determines what features are available early on in the build, the saves of the build (generally the more classes taken pre-epic, the higher the ending saves) and the ending BAB of the build.<br/>\n<br/>\nI determine the builds ending base attack bonus (BAB) with the pre-epic split, which is important for all builds apart from pure arcane spellcasters (ie wizards and sorcerers). The BAB is important, because it determines the number of attacks one has / round. There are important BAB cut offs to remember. A BAB of 26+ at level 40 (or 16+ at level 20) will have 4 attacks / round, a BAB of 21-25 at level 40 (or 11-15 at level 20) will have 3 attacks / round, and 20 or less will have 2 attacks / round. Monks have slightly different cut offs, with a BAB of 26+ for 6 attacks / round, 23-25 for 5 attacks / round, 20-22 for 4 attacks / round, and 19 or less for 3 attacks / round.<br/>\n<br/>\nAt level 40, fighter/rogue/shadowdancer might have a BAB of 29 with a fighter 16/rogue 4 pre-epic split, a BAB of 28 with a fighter 15/rogue 4/sd 1 split, or BAB of 26 with a rogue 16/fighter 4 or rogue 12 / fighter 7 / sd 1 pre-epic split. <br/>\n<br/>\n<strong>Epic levels</strong><br/>\nFollowing the pre-epic split, I think whether I want any remaining levels in epics of a specific class for extra features and skill dumps. Taking SD 1 in early epics ie level 21 or 22 is common to get HIPS while maximising possible BAB. One or more rogue levels in epics allows UMD and tumble, and other rogue skills to have significant skill points invested in them. A key level to remember for classes with tumble, is level 37, which is Tumble 40. +8 tumble AC can be quite significant. A late fighter level could be valuable to maximise or near maximise the discipline skill, or for bonus combat feats to take Epic Weapon Specialization or Epic Weapon Focus. <br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_700b46a860d53a20c26cd959f5cc2af3_t.jpg\" />\n</dl>\n</span><span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://img4.goodfon.com/wallpaper/nbig/4/6a/warrior-cemetery-cross-tombstones-night-scythe-sickle-sword.jpg\" rel=\"noreferrer\" target=\"_blank\">https://img4.goodfon.com/wallpaper/nbig ... -sword.jpg</a></span><br/>\n<br/>\n<strong>Class amounts</strong><br/>\nAccess to level 9 spells, epic spells and 'undispellability' are important considerations for spellcasters. For Wizards, Clerics and Druids level 9 spells are accessed with 17 levels, for sorcerers 18 levels. Epic spells (with some exceptions, such as dragon shape) are accessible with 21+ levels and 'undispellability' (which means only Mordenkainen's Disjunction, Lesser Spell Breach, Greater Spell Breach can remove spell 'buffs') is obtained with 24+ levels.<br/>\n<br/>\nBonus feats should also be considered when determining class amounts. One example might be Sorcerer 24 has access to level 9 spells, epic spells and 'undispellability', but Sorcerer 26 gets a bonus feat. One other consideration is spell penetration of maximum toolset spell resistance of 32, which is more important for clerics and bards, and less important for druids, wizards and sorcerers who have spells which can lower spell resistance (ie Mord's, Nature's balance), although more spell penetration is nice in those classes to avoid having to use a round to lower spell resistance of enemies and certain enemies such as Monks cannot have their spell resistance reduced.<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_50c35f4259f65c64f6517dc3146e05f8_t.jpg\" />\n</dl>\n</span><span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://i.pinimg.com/originals/ca/1f/76/ca1f763aab51b067dd5637376c8825fc.jpg\" rel=\"noreferrer\" target=\"_blank\">https://i.pinimg.com/originals/ca/1f/76 ... 8825fc.jpg</a></span><br/>\n<br/>\nSome other features are important to consider such as Monk 20 for mind immunity, Rogue 3, for evasion/uncanny dodge, Bard 16 for level 16 Bard/Curse song, but for the sake of brevity I will not discuss this further.<br/>\n<br/>\n<strong>Exp penalties</strong><br/>\nStandard classes need to be within 1 level of each other otherwise experience penalties will apply. The exception being if it is the race's favored class. A human, half-elf, dwarf or halfling fighter/rogue can take levels of either class whenever they wish without having experience penalties, whereas a Half-Orc or Elven fighter/rogue will have to be more careful if they wish to avoid them. <br/>\n<br/>\nPrestige classes (ie. RDD, Blackguard, Arcane Archer) do not incur multiclass penalties.<br/>\n<br/>\nMinimizing exp penalties is very important in single player modules where there is a finite amount of resources, but less important in persistent worlds where monsters can respawn.<br/>\n<br/>\n<strong>Level 1</strong><br/>\nCommonly I put the class which gets the most skill points at level 1. This is because level 1 gains four times as many skill points as usual. For a fighter/rogue, I usually want rogue at level 1 rather than fighter. A rogue gets four times as many skill points than a fighter does at level 1, so taking rogue rather than fighter at level 1 adds 24 skill points to the build, which is half a skill.<br/>\n<br/>\nLess commonly I put a class which does not require one of my 'dump' attributes to be 11. This might be a high fighter, low bard, fighter/bard/RDD. Taking Bard at level 1 would grant me an extra 8 skill points but my starting charisma would have to be 11.  Instead of taking bard at level 1 I could take fighter at level 1, to allow me to put starting charisma at 8 to invest attributes elsewhere. <br/>\n<br/>\nOne other consideration is the first level sets the build's identity. Taking rogue at level 1 sets the build's identity as a rogue, whereas taking fighter at level 1 sets it as a fighter. This is important for some, but for those who are purely focused on sheer power, it is less important.<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_e51a4dd8904e5ed3b89f51c2e407d60b_t.jpg\" />\n</dl>\n</span><span style=\"font-size:75%;line-height:normal\"><em>Playtesting the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20788#p20788\" rel=\"noreferrer\" target=\"_blank\">Sword of the Dracolich</a> build against a Dracolich on the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/\" rel=\"noreferrer\" target=\"_blank\">World of Greyhawk Persistent World Server</a>. </em></span><br/>\n<span style=\"font-size:75%;line-height:normal\"><em>My character is hitting him with my flame weapon'ed keen edge'ed greatsword with RDD boosted strength. </em></span><br/>\n<span style=\"font-size:75%;line-height:normal\"><em>The Dracolich is hitting himself or herself with my character's Mestil's Acid Sheath, extended Death Armor and Elemental Shield wand buffs.</em></span><br/>\n<br/>\n<br/>\n<strong>Playability</strong><br/>\nI think playing a build from 1-40 should be enjoyable. Certain features enhance playability. A sorcerer/paladin greatly benefits from taking the majority of his or her sorcerer levels as soon as possible within the limits of the intended pre-epic split, as the spells are very powerful examples being summon creature, flame weapon, improved invisibility, stoneskin, mestil's acid sheath and Bigby's forceful hand. However one might take a single level of paladin early on to access armor / martial weapons and a bonus to saves. Fighter 1-4 provides weapon specialisation and 3 bonus combat feats. Red Dragon Disciple 4 provides a huge +4 to strength and +1 AC, as well as skill dumps in search spot and spellcraft, and usually taking RDD 1-4 consecutively, whenever it is taken in a build is a good idea. Rogue levels provide extra sneak attack damage, making a dexterity based rogue more powerful with early rogue levels. Cleric levels I believe should be taken as soon as practical as it is a powerful class. <br/>\n<br/>\n<strong>Skill dumps</strong><br/>\nCertain levels are important for skill dumps. This is because the system seems to work in intervals of 5. <br/>\n<br/>\nTumble is a common skill dump and gains +1 AC every 5 ranks invested. It is usually best at levels 2, 7, 12, 17, 22, 27, 32, 37 to take tumble classes as a result. <br/>\n<br/>\nUMD is another common skill dump. For a build with Cha 8, for the purpose of equipping items, it is best at level 3, 8, 13, 18, 23, 28, 33 and 38, although later on in the build one may have access to equipment which raises the charisma score or UMD skill, also spellcasting failure from scrolls should be considered (ie UMD modified 33 at level 31 in a Cha 8 build allows for no failure from spellcasting from scrolls). <br/>\n<br/>\nIf one is trying to skill both skills, one might take the Rogue level at level 8 rather than level 7, to skill dump both tumble 10 and UMD modified 10, as an example, to allow the character to equip more magical items (ie. Boots of the Sun Soul). <br/>\n<br/>\nSpellcraft also uses the modified statistic, and gains +1 to saves against spells in intervals of modified 5. For a build with Int 14, relevant skill dumps might be at level 1 (3 ranks), 5, 10, 15, 20, 25, 30, 35, 40.<br/>\n<br/>\n<strong>Feats</strong><br/>\nCertain feats can only be taken with certain classes, an example being Curse Song with a Bard 1+ level, Divine Might with a Paladin 3+ level, Craft Wand on a Wizard/Sorc 5+ level, or Epic Mage Armor with a Wizard 21+ level. If one wishes to use a general feat to take those feats, then it is important the class that has access to it takes a level at the level which the feat is taken. For example, Bard 1 could be taken at level 1 or 3 to get the Curse Song feat, but the Curse Song feat cannot be taken on a Fighter level at level 3. This is important with certain builds. For example, a Fighter/Bard/Pale Master with 16 Pale Master levels who wants both Epic Spell: Epic Mage Armor and Epic Spell: Epic Warding, will want either the level 15 and/or the 16 pale master level to be taken on levels with epic general feats available (ie possibly level 33, 36 or 39), otherwise getting both feats will not be possible without adding more Pale Master levels.<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_34c82ea19d22d3957cc769136800cc5d_t.jpg\" />\n</dl>\n</span><span style=\"font-size:75%;line-height:normal\"><em>Playtesting the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/greatsword-kensai-monk-35-fighter-4-rogue-1-t2355451.html#p20517\" rel=\"noreferrer\" target=\"_blank\">Greatsword Kensai</a> build (Sakata Gintoki) with Aquarius_233's Fighter / RDD (Vudash Lurken) on the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/\" rel=\"noreferrer\" target=\"_blank\">World of Greyhawk Persistent World Server</a>. This is considered one of the most difficult bosses on the server. </em></span><br/>\n<span style=\"font-size:75%;line-height:normal\"><em>I </em><em>am tanking WDK as my AC is higher than Vudash's  at the time, with +7 Monk AC, +7 Wis AC +6 Dex AC +8 Tumble AC and +5 Expertise AC, plus 50% concealment with Empty Body for 30+ rounds, also I can run away with my Monk Speed to heal.</em></span><br/>\n<br/>\n<strong>The Order of Feats</strong><br/>\nCertain feats must be taken in a certain order. <br/>\n<br/>\nFor example Dodge must be taken before Mobility, Mobility before Spring Attack, Spring Attack and Expertise before Whirlwind Attack, Whirlwind Attack, Weapon Focus in a Melee Weapon and 4 ranks of intimidate before a level of Weapon Master can be taken. Devastating critical, Epic Dodge also have some complex requirements. <br/>\n<br/>\nCertain feats provide 'more value' the earlier they are taken. Weapon focus feats are a good example, the extra +1 AB can make a significant difference with difficult early levels when a build has not obtained its power. Expertise is another example, in a challenging environment, if opponents can only hit a character on 20s and never critical hit a character, this provides significant survivability with low HP at early levels, at the cost of a reduced chance to hit (which may or may not matter depending on the situation). <br/>\n<br/>\nKnockdown is usually best taken around 6-9, because opponents will usually get one attack onto you during the knockdown attempt, by the time one reaches level 6, opponents having two or more attacks / round are more frequent, and knockdown will remove one or more attacks from the enemy per round. Plus if you have two or more attacks / round these attacks will be more likely to hit due to opponents being on the ground. Blind Fight I find helpful as soon as possible. <br/>\n<br/>\nSpell Focus: Necromancy and Greater Spell Focus: Necromancy are more useful when one has access to necromancy spells such as Finger of Death (Wiz/Sorc 7), Horrid Wilting (Wiz/Sorc 8) or Wail of the Banshee (Wiz/Sorc 9), so this can be taken later in the build. <br/>\n<br/>\nOther feats must be taken in epic levels, such as epic weapon focus, epic prowess and armor skin. Some have onerous requirements plus pre-requisite feats that can only be met in epic levels. Examples being Str 25+ and a lot of feats for devastating critical, Wis 30+ / (wild shape 6x/day or greater wildshape IV) for dragon shape and Tumble 30 / Dex 25+ for epic dodge.<br/>\n<br/>\nI see if there are any 'spare feats' and fill them. In terms of priorities, boosting the Fortitude and Will saves are my usual highest priority, if it is required, certain builds such as Sorcerer/Paladins may not need boosting of saves. At level 1 one can take Luck of Heroes for +1 to all saves, or Strong Soul for +1 to Fort/Will and +1 to death magic. Other levels I like to take Great Fortitude, Iron Will, Epic Fortitude, Epic Will. <br/>\n<br/>\nCertain builds such as Paladin and CoT builds may not need these save boosting feats. If this is not necessary, then other good 'fillers' include Toughness for more HP, Skill Focus/Epic Skill Focus feats, Resist Energy/Epic Energy Resistance feats.<br/>\n<br/>\n<strong>Mundane Attack Bonus</strong><br/>\nThis is relevant for non-spellcasters.<br/>\n<br/>\nWith the class levels and the appropriate AB boosting feats inputed (ie Weapon Focus, Epic Weapon Focus, Epic Prowess, Great Attribute feats), the mundane attack bonus is then calculated. If the mundane AB is between 40 and 45 for a combat build I tend to be happy with the AB for PvM. For a spellsword I tend to be ok with anything above 37+ (more is obviously better) although a class such as Cleric with huge AB boosting spells which can hit the +20 AB cap can manage with an AB around 35. Once this is known I adjust the starting attributes up or down to get the AB I want. If I don't get the AB I want despite this, I have to look at whether there is anything else I can do to boost AB up, or whether I should abandon the build concept.<br/>\n<br/>\nIn terms of maximums, a pure human fighter who focuses on maximal strength will have a mundane AB of 46, a human fighter / RDD focusing on maximal strength mundane AB up to 50, a human fighter / high weaponmaster up to mundane AB 53, a elf dex focused high arcane archer over mundane 60 AB. However whether that amount of AB is necessary for a fun PvM build is questionable. I think most module designers will try to allow for a number of different warrior and support types to be able to hit enemies, this is because if the AC is so high that only weapon masters and arcane archers can hit enemies regularly, then only weapon masters and arcane archers will be the only viable class, making it a fairly homogenous environment. <br/>\n<br/>\nValerfor looked up a number of prominent monsters in the Default Toolset, <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/attack-bonus-ab-goals-t2355144.html#p16442\" rel=\"noreferrer\" target=\"_blank\">the highest identifiable AC being 49</a> (meaning an AB of 39 could hit it half the time), although it should be noted module designers will customize the AC of boss monsters to what they wish. <br/>\n<br/>\n<strong>Hit points</strong><br/>\nThere are certain base HP goals I wish to reach assuming max rolls, if possible. This is 400+hp for melee combat characters and around 300hp for spellcasters, rogues and bards. One can compromise a little to fit in other features, but in challenging environments one may have to compromise the equipment one equips to boost HP up. I chose these numbers based <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/toughness-called-shot-why-all-the-love-t515384.html#p1272\" rel=\"noreferrer\" target=\"_blank\">on comments from Hip and Kail</a>. <br/>\n<br/>\n<strong>Saves</strong><br/>\nI like to have a fortitude and will save mid-20s or higher, although this may not always be possible depending on how many other features I put in the build. Frontline melee characters I like high 20s for the fort save plus spellcraft bonuses as in a challenging environment they are most likely going to tank death magic, devastating critical, implosion and petrify for parties but this is not a hard and fast rule.<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_c9f75715db0fb43c36df8471c9584483_t.jpg\" />\n</dl>\n</span><span style=\"font-size:75%;line-height:normal\"><em>Playtesting the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/greatsword-kensai-monk-35-fighter-4-rogue-1-t2355451.html#p20517\" rel=\"noreferrer\" target=\"_blank\">Greatsword Kensai</a> build on the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/\" rel=\"noreferrer\" target=\"_blank\">World of Greyhawk Persistent World Server</a>. This is another very difficult boss on the server.</em></span><br/>\n<span style=\"font-size:75%;line-height:normal\"><em>Fortunately my character has high spell resistance, improved evasion and high monk speed, however it was hard to damage him despite having 42 strength until I figured out an unusual strategy to beat him. </em></span><br/>\n<span style=\"font-size:75%;line-height:normal\"><em>In PvM builds it helps to have a versatile skill set to solve a diverse set of challenges.</em></span><br/>\n<br/>\n<strong>Skills</strong><br/>\nA certain number of skill points are required for certain feats, for example Epic Spell: Epic Mage Armor requires 26 ranks of spellcraft, Epic Dodge requires 30 ranks of tumble, Epic Spell: Epic Warding requires 34 ranks of spellcraft.<br/>\n<br/>\nCasters generally will benefit from having concentration maximized or near maximized to ensure their spells are not interrupted. Likewise, meleers will benefit from high discipline to prevent being knocked down or disarmed.<br/>\n<br/>\nIt is usually always beneficial to have some investment in Tumble, as the extra AC is helpful (between +4-8 AC depending if it is a class skill or not) along with avoiding some attacks of opportunity. <br/>\n<br/>\nSpellcraft is very favorable to invest in, for bonuses to saves against spells (+4 if crossclassed, +9 or more if class) and to recognise certain spells. A will save of 19 at level 40 without any equipment or spell buffs might sound low, but if there are +9 saves against spells from modified spellcraft 45, this becomes an effective will save of 28, which sounds very viable to play.<br/>\n<br/>\nA detection skill is useful to have, such as Spot or Listen, although spells or items which provide True Seeing can make such skills less relevant.<br/>\n<br/>\nSome points in search are very handy to have to detect secret doors and traps. Missing secret doors can lead to missing some great content in modules played. <br/>\n<br/>\nA few points on set trap and disable trap 1 (to retrieve unused traps) provides excellent value, along with a single rank in open lock which combined with a +10 lockpick might open a few DC 30-35 locks depending on the dex score of the character. Optional skills such as Lore, Heal, Appraise, Persuade and Craft Trap could be considered. <br/>\n<br/>\nCertain classes have special skills. Bards have Perform, which one will want to meet Bard Song requirements. Barbarians, Paladins, Blackguards and Bards have the Taunt skill, which can effectively lower AC of opponents by 6 (effective AB increase by 6) which if it can be used safely (it makes one flatfooted, losing AC when using it) can be very effective against some opponents. Rangers and Druids have Animal Empathy, which can be useful in certain situations to dominate enemy animals. Stealth is valuable for Monks and Rogues, and uses up over 80 skill points if one wishes to use this effectively. <br/>\n<br/>\nAs a result skill points can get used up very quickly in a lot of builds. Some exceptions include some Wizards and Druid builds who can have more skill points than they need.<br/>\n<br/>\nIf one assumes 43 points in one of Concentration/Discipline, 40 in Tumble, 36-43 in spellcraft and 43 to invest in a mixture of other skills, then an average 4 skill points / level could be considered optimal. Average 5 skill points / level for taunt builds and 6 skill points / level for stealth builds. Classes get differing amounts of skill points and the Int score should be then adjusted to achieve a happy balance of skill points, unless one is deciding to sacrifice skill points for other features. Compromises can be made, for example 25 ranks in Taunt might be surprisingly successful against certain opponents that you want the taunt to succeed against (ie. high AC warriors and rogues) and less successful against other opponents who you might not use the taunt against (ie low AC wizards and sorcerers). <br/>\n<br/>\nOne final note. Skills are nice to have, however are not always essential for powerful builds. They can certainly enhance their power and fun factor, but are not a substitute for enough AB, damage, HP or caster levels in a build. Powerful builds can manage with only 86 odd skill points, invested in either concentration or discipline, and tumble / spellcraft or other skills but it is obviously better to have more skill points than less.<br/>\n<br/>\n<blockquote><div><em><span style=\"font-size:150%;line-height:normal\">Rule 0: When in doubt, make the choices that are fun for you. Power is good and fine, but in the end you are playing the build and what feels right to you is going to be more enjoyable and, because it meshes with your playstyle, easier to play.</span></em><br/>\n<br/>\n- Mithdradates, in <a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/general247382.html\" rel=\"noreferrer\" target=\"_blank\">Building a Character: Advice</a>, July 2006</div></blockquote>\n<strong>Review</strong><br/>\nBy now the build has been created. It is time to review what has been created. <br/>\n<br/>\nThere are then useful questions one can then ask of the build. Here are an example set of questions I might ask myself when creating a build.<br/>\n<br/>\n1. What makes the build special (the core concept) and is it still present?<br/>\n2. How might this character die? What changes to the build might be needed to prevent these events occuring, or are certain items, scrolls or potions going to be needed?<br/>\n3. How might this character function in solo play? How might this character function in a party and how many roles can it have (tank, damage dealer, buffer, traps, detection, locks)?<br/>\n4. Is it fun to play? What would make it more fun to play?<br/>\n5. Are there role-playing elements I can introduce to give the build a personality, a story to tell?<br/>\n6. How might this build function at low levels, mid levels, high levels?<br/>\n7. How might this build work in low, mid and high magic environments? PvM or PvP? Bioware campaigns? Custom modules like Aielund or Sands of Fate? Persistent worlds like Arelith, Blackstone Keep and World of Greyhawk?<br/>\n8. Are there other similar builds already out there? Can I borrow ideas from them? How is my build different to their build? (<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/buildsearch/index.html\" rel=\"noreferrer\" target=\"_blank\">Epic Character Build Search</a>. <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/other/tool/ecb-guild-build-archive-v2\" rel=\"noreferrer\" target=\"_blank\">ECB Guild Build Archive v2</a>, Google Search can be useful search engines)<br/>\n<br/>\nBy asking these questions of the build, one can identify possible modifications, to further improve the build before playtesting.<br/>\n<br/>\n<strong>Playtesting</strong><br/>\nPlaytesting is the final step. As one playtests one may find a certain feature might want to be obtained sooner rather than later in terms of playability or a feature added (ie more AC needed, so a sword and shield used instead of a two handed weapon), hence changes can be made. Therefore it is important to playtest all builds before finalizing them. <br/>\n<br/>\n<strong>Other resources:</strong><br/>\nMaximillan Kane's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/a-complete-guide-to-the-basics-of-character-buildi-t515440.html\" rel=\"noreferrer\" target=\"_blank\">A Complete Guide to the Basics of Character Building</a><br/>\nMithdradates <a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/general247382.html\" rel=\"noreferrer\" target=\"_blank\">Building a character: Advice</a><br/>\nOrion's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/nwn-character-class-guides-an-attempt-at-a-compreh-t2355107.html\" rel=\"noreferrer\" target=\"_blank\">NWN Character Class Guides: An attempt at a comprehensive list of what is available</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}