{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "968",
  "name": "Need Help with a build for an Arelith Beginner",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/need-help-with-a-build-for-an-arelith-beginner-t2354894.html",
  "author": "TychoVelius",
  "avatar": "10758924_1537379651.jpg",
  "replies": "7",
  "views": "1.2K",
  "posts": [
    {
      "author": "TychoVelius",
      "avatar": "10758924_1537379651.jpg",
      "timestamp": "4:06 AM - Jun 12, 2018",
      "content": "<div>1) PvM <br/>\n<br/>\n2) Level cap - 30<br/>\n<br/>\n3) Race preference - Human, Wild Elf, or Wood Elf<br/>\n<br/>\n4) Class preference - Fighter and Druid came to mind, but I think Druid tends to be best with more levels, sooo.... Also, no RDD. It takes special permission, and I hate it.<br/>\n<br/>\n5) Melee preference - Two-handed sustained damage<br/>\n<br/>\n6) Range preference - Probably Zen, based on other factors. If I do ranged combat.<br/>\n<br/>\n7) Weapon preference - Greatsword or Halberd, because reach.<br/>\n<br/>\n8) Maximum item enhancement - This is the information I was able to dredge up. <a class=\"postlink\" href=\"http://wiki.arelith.com/Enchantment_basin\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Enchantment_basin</a><br/>\n<br/>\n9) Spellcasting - I don't know enough about Arelith to really have a strong idea here. My thought is that since they cap certain buffs, I should probably want a bit more of a mix of offense and buff spells. I'd like an elemental or naturalistic focus.<br/>\n<br/>\n10) Custom factors - Arelith, and everything that entails.<br/>\n<br/>\n<br/>\nLooking for a woodsy reach fighter with some spellcasting for versatility. Playable from 3+, since Arelith does at least start you at 3, it just takes hours to get to 4.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:23 AM - Jun 12, 2018",
      "content": "<div>Hey man, did you look at out sub-forum for 30th level builds yet? With just a glance I spotted seven different builds there with the \"Arelith\" keyword in front of them. And if you actually use the search function you will find a lot more threads with builds in them for that PW. If you want something out of the box though, we will be glad to help you.<br/>\n<br/>\n<strong>level 30 builds</strong> =&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/mid-epic-level-30-builds-f7/\" rel=\"noreferrer\" target=\"_blank\">mid-epic-level-30-builds-f7/</a></div>"
    },
    {
      "author": "TychoVelius",
      "avatar": "10758924_1537379651.jpg",
      "timestamp": "4:30 AM - Jun 12, 2018",
      "content": "<div>I did look there, nothing seemed quite what I was looking for. I might be interpreting builds wrong, or I might be too picky, or I might be looking for an archetype that doesn't really play well in NWN, but searching didn't bring me anything that seemed to fit the concept.</div>"
    },
    {
      "author": "TychoVelius",
      "avatar": "10758924_1537379651.jpg",
      "timestamp": "4:52 AM - Jun 12, 2018",
      "content": "<div>Barbarian is an acceptable substitute for Fighter. Might fit the theme better, as well.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:21 AM - Jun 12, 2018",
      "content": "<div>What exactly is not to your style in this build?<br/>\n<br/>\nArelith Weapon-Master =&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/arelith-sword-master-fighter-10-rogue-4-weapon-mas-t2354396.html#p785\" rel=\"noreferrer\" target=\"_blank\">arelith-sword-master-fighter-10-rogue-4 ... .html#p785</a><br/>\n<br/>\nHe is a human, with big, sustained damage, a fighter-weapon-master (the ideal form of a fighter) and you can change his weapon to whatever you like, take a greatsword and you will hit even harder. He even has UMD so he can use magical scrolls &amp; other devices. More than that, rogue also provide him with evasion &amp; full tumble for better armour class. Making him a barbarian is more a matter of how you present him rather that of the build. This build has absolutely top-notch AB &amp; Damage, it is designed specifically for that. Perhaps if you could explain us better why this isn't to your liking then we should be able to help you more.</div>"
    },
    {
      "author": "TychoVelius",
      "avatar": "10758924_1537379651.jpg",
      "timestamp": "5:28 AM - Jun 12, 2018",
      "content": "<div>Ah, I was overlooking UMD as a casting alternative.<br/>\n<br/>\nYeah, that should work.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:49 AM - Jun 12, 2018",
      "content": "<div>Glad you like it!<br/>\n<br/>\nThis character armed with a halberd will be devastating to his opponents (X4 criticals).</div>"
    },
    {
      "author": "TychoVelius",
      "avatar": "10758924_1537379651.jpg",
      "timestamp": "5:55 AM - Jun 12, 2018",
      "content": "<div>Could do spear and shield as well, if I'm reading the Arelith changes right, just gives up the bonus strength damage for two-handing, and the +2 AB for the same.<br/>\n<br/>\nDecent tradeoff.<br/>\n<br/>\nWith a build lined up, any suggestions on getting started in Arelith? Skal or Cordor? It's possible it's just supposed to be this slow, and I'm not used to it.</div>"
    }
  ]
}