{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "284",
  "name": "Dragon Rider (the Mighty Blade) Barbarian 28 RDD 10 Bard 2",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/dragon-rider-the-mighty-blade-barbarian-28-rdd-10--t2292943.html",
  "author": "TyrTemplar",
  "avatar": "no_avatar.png",
  "replies": "4",
  "views": "3.2K",
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "12:14 PM - Oct 16, 2012",
      "content": "<div><strong>DRAGON RIDER, the Mighty Blade:<br/>\nBy Deborah “Tyr” Templar</strong><br/>\n<blockquote><div>Author’s Note—Revisions and History: <br/>\nThis build is a revised version in light of the patch, etc. of my Dragon Rider, the Mighty Blade. Originally posted in the ECB here: <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build266094.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 66094.html</a>  ,  this character formed part of a series (subsequently modified for the ECB2 (NWN2) and which in turn became the “Terracotta Soldier”, as discussed here: <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/terracotta-soldier-dragon-blade-barbarian-28-rdd-10-bard-2-t2292942.html\" rel=\"noreferrer\" target=\"_blank\">terracotta-soldier-dragon-blade-barbarian-28-rdd-10-bard-2-t2292942.html</a> </div></blockquote>\n\nDragon Blades were an elite fighting force, comprised of plane warriors who actually rode and fought on dragons; the pair, rider and dragon, were dedicated to the preservation and defense of the native planes, many of whom took part in the Dragon Wars. It is said the bond between dragon and his/her rider is a strong and magical one. It is also said that, in time, the bond grows between a rider and his/her dragon, such that they begin to “see” and “think” as one, and that each of the pair eventually take on many characteristics of the other. It is widely believed all Dragon Blades (and their dragons) died out during the time of the dragon wars.<br/>\n<br/>\nThey are wrong: a few survived. <br/>\n<br/>\n<strong>DRAGON RIDER, the Mighty Blade:<br/>\nBarbarian(28), Red Dragon Disciple(10), Bard(2)</strong><br/>\n<br/>\nRace: Half-Orc (dark-vision)<br/>\nAlignment: Any Non-Lawful (Theme: Chaotic Good, Chaotic Neutral, or Chaotic Evil)<br/>\n<strong><br/>\nI. Attributes: </strong><br/>\nSTR: 18 (34)<br/>\nDEX: 8<br/>\nCON: 16 (21)<br/>\nWIS: 8<br/>\nINT: 14 (16)<br/>\nCHA: 6 (8)<br/>\n<br/>\n<strong>II. Level Guide:</strong><br/>\n01: Barbarian(1): Armor Proficiency Heavy<br/>\n02: Barbarian(2): {Uncanny Dodge I}<br/>\n03: Barbarian(3): Weapon Focus<br/>\n04: Barbarian(4): STR+1, (STR=19)<br/>\n05: Barbarian(5)<br/>\n06: Barbarian(6): Knockdown<br/>\n07: Barbarian(7)<br/>\n08: Barbarian(8): STR+1, (STR=20)<br/>\n09: Barbarian(9): Blind Fight<br/>\n10: Barbarian(10)<br/>\n11: Barbarian(11)<br/>\n12: Barbarian(12): STR+1, improved knockdown, (STR=21)<br/>\n13: Barbarian(13)<br/>\n14: Barbarian(14)<br/>\n15: Barbarian(15): improved critical<br/>\n16: Barbarian(16): STR+1, (STR=22)<br/>\n17: Barbarian(17)<br/>\n18: Barbarian(18): skill focus: intimidate<br/>\n19: Barbarian(19)<br/>\n20: Barbarian(20): STR+1, (STR=23)<br/>\n21: Bard(1): Epic Weapon Focus<br/>\n22: Red Dragon Disciple(1)<br/>\n23: Red Dragon Disciple(2): (STR=25)<br/>\n24: Barbarian(21): CON+1, Terrifying Rage, (CON=17)<br/>\n25: Red Dragon Disciple(3)<br/>\n26: Red Dragon Disciple(4): (STR=27)<br/>\n27: Red Dragon Disciple(5): Epic Prowess<br/>\n28: Red Dragon Disciple(6): CON+1, (CON=18)<br/>\n29: Red Dragon Disciple(7): (CON=20)<br/>\n30: Red Dragon Disciple(8): Epic Skill Focus: Intimidate<br/>\n31: Red Dragon Disciple(9): (INT=16)<br/>\n32: Red Dragon Disciple(10): CON+1, (STR=31), (CON=21), (CHA=8)<br/>\n33: Barbarian(22): Mighty Rage<br/>\n34: Barbarian(23)<br/>\n35: Barbarian(24): Epic Damage Reduction I<br/>\n36: Barbarian(25): STR+1, Great Strength I, (STR=33)<br/>\n37: Barbarian(26)<br/>\n38: Barbarian(27)<br/>\n39: Bard(2): Epic Damage Reduction II<br/>\n40: Barbarian(28): STR+1, Epic Damage Reduction III, (STR=34)<br/>\n<br/>\n<strong><br/>\nIII. Basics: </strong><br/>\na. Hitpoints: 632 (+240 Mighty+Greater Rage, or: 872) <br/>\n<br/>\nb. Saving Throws<br/>\nFort: 27 (+6 Mighty/Grt Rage, or: 33)<br/>\nWill: 15 (+7 Mighty/Grt Rage, +1 Song: or, 23)<br/>\nReflex: 15 (Uncanny Dodge)<br/>\n<br/>\nSaving Throw bonuses: <br/>\nTraps: +5 (Uncanny Dodge) / *Spells: +5 if train spellcraft (see skillset, below). <br/>\n<br/>\nOther:<br/>\nTerrifying Rage, Barbarian Speed, DR 15/-<br/>\nRDD Immunities (Fire, Paralysis, Sleep), Darkvision, UMD<br/>\n<br/>\n<br/>\n[u<strong>]IV. Combat Vitals</strong>:<br/>\n<br/>\na. Terrifying Rage (DC): 55 (+1d10), or: 56-65<br/>\n<br/>\nb. Attack Bonus (mundane weapon)<br/>\nMundane Weapon: BAB: 30, AB: 46, +1 Song: 47 (no buffs, singing only)<br/>\n+6 Mighty Rage/Greater Rage*<br/>\n---<br/>\nAB 53, +6 Taunt: 59 (lowers enemy AC, effectively raising your AB) (Self-Buffs ONLY)<br/>\nBio-Cap AB: (assuming +20 weaponry or UMD i.e. Truestrike): AB +72, +6 Taunt, or: AB +78 <br/>\n<br/>\n*Rage Note: +4 AB Mighty Rage (+8 str) and +3 AB Grt.Rage alone (+6 str): together, w. nothing more, readily hits Bioware’s +12 ability-cap.<br/>\n<br/>\nc. Damage (illustrative): <br/>\nMundane Scimitar:  1-6+12, +1 Song, +6 Mighty/Grt.Rage, OR: 1-6+19 (crit: 15-20/x2) <br/>\nAssuming +5 Keen Scimitar:  1-6+24 (crit: 12-20/x2)<br/>\n<br/>\n<strong>V. Defense Vitals:</strong><br/>\n21 AC (naked)<br/>\n+8 mundane plate<br/>\n+3 mundane tower shield<br/>\n--<br/>\nAC 32 (-2 raging, but offset by TR); does not include any magical equipment or UMD.<br/>\n<br/>\nOther:<br/>\nEpic Damage Reduction 15/- <br/>\nTerrifying Rage (TR): enemies can’t hit you when they’re terrified.   <br/>\n<br/>\n<strong>VI. Spell Casting:</strong><br/>\nBard(0); UMD, including BARD TOYS!<br/>\n<br/>\n<strong>VII. Skillpoints: </strong>247*<br/>\nDiscipline 41(53), Intimidate 43(55), Listen 41(40), Lore 8(13)*, Perform 7(6), Taunt 41(40), Tumble 40(39), UMD 26(25)<br/>\n<br/>\n*Note: As always, players should feel free to adjust for their own needs/environs.<br/>\n<br/>\n<br/>\n***Prefer your Dragon Rider with Dev.Crit (instead of EDR III / DR 15-) instead? Then see the Soldier, <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/terracotta-soldier-dragon-blade-barbarian-28-rdd-10-bard-2-t2292942.html\" rel=\"noreferrer\" target=\"_blank\">terracotta-soldier-dragon-blade-barbarian-28-rdd-10-bard-2-t2292942.html</a> . <br/>\n<br/>\nSlash, Shrug, and RAGE ON! ~ Tyr</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:26 PM - Oct 16, 2012",
      "content": "<div>I actually saw this build when I was building my HOOD, which has the same class spread of this one. Cool build, the only thing I would think about is: I would maybe consider dropping Taunt to have more UMD. Or you could go Human and get 1 more feat, which you could use to get Expertise at the cost of 2 STR. <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "12:02 PM - Oct 18, 2012",
      "content": "<div>Thanks, Max. <br/>\n<br/>\nYeah, strong raging barbarians are cool, I think so, too, and look especially good killing things with the very stylish dragon wings!   <br/>\n<br/>\nUMD: As a bard, entitled to use arcane items and bard toys, needing UMD for things like monk gear (and potentially some obscure cleric items, etc.). COULD drop some taunt so as to raise your UMD up to 35- but then, I do rather like my Taunt, too (a concentration check v your taunt skill, lowering target's AC so as to effectively raise your AB +6 and doesn't count towards Bio-Cap either, which is nice). That said, players should feel free to adjust to suit, depending of course on the availability of gear, etc. <br/>\n<br/>\nHuman: As to going human, you \"could\" (net you a feat i.e. expertise along with more skills--290 skillpoints in fact, in which case: Discipline 41(52), Intimidate 43(56), Listen 43(42), Lore 8(13), Perform 6(6), Taunt 42(42), Tumble 40(39), UMD 40(40) and Spellcraft 27(30) for +6 Save v Spells, too). Would come at the cost of 2 STR (-1 AB/damage—i.e., Naked AB 46 (45+1 Song, add +6 Raging: 52 instead of the current AB 47 (53 Raging), though. (But which, dare I admit, and can't believe that I who LOVE my AB/damage set-ups am about to admit) won't really make much difference with this set-up (especially not in a low magic setting, where can EZ-ily get away with that, so not really a problem in turn.  If so, STR: 17 (32), DEX: 9, CON: 16 (21), WIS: 8, INT: 14 (16), CHA: 8 (10), take Armor Skin instead of what in turn would be an extraneous STR in terms of level-up/epic levels if go human of it, so more AC plus the Expertise option in trade, along with the skills. (Yes, a viable option in turn, I agree).  <br/>\n<br/>\n<strong>Big Barbarians swing Big Weapons Always</strong>--What I don’t personally like about that option, though (apart from loving my AB: i.e., you hit, you damage), is how it would affect damage. I know, I gave this guy a scimmy for illustrative purposes, but in reality, really liking the Big Knife or Big Axe on this guy, especially with all that STR (which comes on a 2-hander at 1.5, all of it doubling on a crit as well). <br/>\n<br/>\nAt 34 STR, self-cap to 46 for e.g., that’s:<br/>\nMundane Greatsword: 2-12+ 18 STR +1 Song, OR: 2-12+19 (crit: 17-20/x2)<br/>\nMundane GrtSword (Raging+Song—i.e. STR self-cap: 46): 2-12+28 (crit: 17-20/x2)<br/>\nAssuming +5 Keen Grt.Sword (Raging+Song): 2-12+33 (crit: 15-20/x2)<br/>\n<br/>\nThar be damage! <br/>\n<br/>\nOf course, weapons are a matter of personal choice, with the scimmy allowing for a Tower Shield (if it's more AC one wants, can go that route instead, and why it's there as an option); honestly, though, with all that AB/STR damage, DR 15/- Soak and over 600 HPs (872 Raging), really, this guy needs not \"defense\" (he can handle it) but the Big Knife/Big Axe ... killing things is what Barbarians (especially non dev.crit RDD STR charged Barbarians) do best, and this ensures he does so quickly (the dead don't strike back, no?). Not to mention 2-handed weapon just looks right on Barbarian. Just does (build-wise and RP-wise). And with a very good/High AB 47 (53 Raging), … well, you hit, you damage. And with the Big Knife/Big Axe, things die fast. Far more humane to take 'em out quickly: why prolong their suffering, yes?  <br/>\n<br/>\nBest defense is a strong Offense—i.e., AB/Damage set-up. How we do things up North anyway...(and just looks right, just does). Players are free to suit to taste of course, and always should feel free to do so. If want more skills and/or want to play as a human, Max' is a viable option, especially in a i.e. low magic setting where -1 ab isn't going to make any real difference (that said, I like my AB/damage, always did!).<br/>\n<br/>\nAppreciate the comment, Max, and thanks. <br/>\n<br/>\nRage ON! ~ Tyr</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:28 PM - Oct 18, 2012",
      "content": "<div>I presume because you're such an experienced player that you know of the Expertise / Taunt combo and how to use it. That is why I suggested this tweak. Just in case, if you or any other person who sees this build and wonders how it works, there is a somewhat detaled explanation in the thread of my Holy Weapon Master with Cheese. Here's the link:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/holy-weapon-master-with-cheese-paladin-26-wm-13-monk-1-t515397.html\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.44.forumer.com/holy- ... 15397.html</a><br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "4:48 PM - Nov 17, 2012",
      "content": "<div>Max, pretending there's not another build in the Dragon Rider's thread (why is there another build in my thread?! I know, you didn't want to type the whole Taunt \"trick\" out, but you know the rules and why they are there, as I know you don't mean to be suggesting or implying that I drop RDD or something to add a little cheese er monk, as that would completely break and destroy the build!! ... (I feel a rage coming on). That said, can't help but notice that sometimes you like to make things \"complicated\" -- something I notice a lot of from say those who enjoy arcane and/or cleric class. Interestingly enough, my sister is a huge Cleric fan (loves the wizard and rogue class, too); and she also likes \"complicated\" when I think about it, too.<br/>\n<br/>\nMyself, I enjoy all classes as you know, but really do rather enjoy melee/melee classes best (seeing the melee in just about everything!). And when it comes to melee proper, simple is always best: you hit, you damage, things die. Keep it simple. <br/>\n<strong><br/>\nMelee: you hit, you damage. Simple is best (no gimmicks, no tricks). </strong><br/>\nThe Dragon Rider is (and always was) about pure rash H&amp;S power, not gimmicks/exploits. WIth a high AB as here you hit, you damage. Simple. Combined with EDR III (stacks with Barb's, DR 15/-), not to mention over 630 HPs (872 Raging!), very good Fort 33, along with a very good defense (for a melee--i.e., heavy plate proficiency, combine with Bard and RDD-AC, don't need either expertise nor the taunt \"trick\". Not saying that tricks/exploits/etc. aren't sometimes fun, as they can be, but not so if it means giving up hard AB (STR) -or- EDR III for it; neither need it nor is it worth it.). Rather, the Dragon Rider is a front-line warrior, a very strong (powerful) melee warrior and a tanker on top of it all, too; not to mention that nothing (lest it be fear-immune) is going to make their WILL SAVE as against the Rider's TR DC 56-65, ... sitting ducks. <br/>\n<br/>\nBenefits in terms of PvP are obvious. In terms of PvM/E, means you part the sea er clear a path straight to the \"Big Boss\", all those pesky minions get out of your way, you take them out on your way to the \"boss\" and take him out once you get there, without concerning yourself with all those pesky minions along the way. Why \"negotiate\" with underlings when you can take your \"message\" straight to the \"boss,\" I say.   <br/>\n<br/>\n<strong>Race: Half-Orc vs. Human</strong><br/>\nJust to add: Half-Orc works best in this build, being in its natural class (Barbarian), thus perfectly at home here, and is nice (makes for a very strong combination of course in turn). But human would work alright, could do it if really want, as said (not exactly like players wanting to play a Dragon Rider only having their heart set on going human of it are going to miss a couple STR (AB/Damage) -OR- a DR 3/- which would be the trade, low magic especially). Still, I really like power, no such thing as too much AB, etc. when it comes to melee either, and Half-Orc just works beautifully. [besides, lots of humans around here, apart from more skills (which Dragon Rider does not with this INT need, not feat-starved by any means either), don't always make for the best choice, as Half-Orc in its natural home here shows. Not that Dragon Riders have anything against humans, even although they are a bit puny ain't they?   ].<br/>\n<br/>\nOr, in the words of Thaxll'ssyllia (Joined: 05 Oct 2005, From: You really don't want to know...), who said when this character was first posted so very long ago:\n\t<blockquote><div>\nNice, I didn't know a nasty hack &amp; slash powerdude was your style Deb, but I do like it, a lot of rash power.\n</div></blockquote>\n<strong>Terrifying Rage--Note: Save against Fear, but Paralysis Effect?!? (1.69)</strong><br/>\nMeantime, as to Barbarian's Terrifying Rage, just a quick word on that on account of the Patch 1.69. Used to be (and still is) a saving throw vs fear (against a DC equal to the Barbarian's intimidate skill +1d10, or in the Rider's case, TR DC 56-65 as said); however, the effect that gets applied is no longer fear but paralysis, such that enemies no longer \"flee\" but rather respond like a deer caught in the head lights so to speak--i.e., paralyzed. Makes it easier to kill, as don't have to run after them (and what I always thought Barbarian speed boost was for, heh), so that's cool, but yet it does raise some very interesting questions, least of which being post-patch effects on RDDs which, although immune to many things, fear is not one of them, but paralysis is. Similarly, seems to have an odd effect against things that are supposedly fear immune, which likewise raises a bunch of questions in turn. Seems some more testing is in order, so as to get to the bottom of this. (Oh, Bioware: why is it every time something's \"fixed\", only wind up giving us here at the ECB yet more work to do as in testing the stuff you \"broke\" to supposedly fix something else ... I feel a mighty rage coming on .... LOL). <br/>\n<br/>\nSlash and Rage ON! ~ Tyr</div>"
    }
  ]
}