{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "604",
  "name": "Help needed adjusting a Paladin/CoT/Rogue build for single player modules to level 40",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/help-needed-adjusting-a-paladin-cot-rogue-build-fo-t2355472.html",
  "author": "Sarthrovar",
  "avatar": "10759190_1575525433.jpg",
  "replies": 9,
  "posts": [
    {
      "author": "Sarthrovar",
      "avatar": "no_avatar.png",
      "timestamp": "11:57 PM - May 22, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Modules planned for playthrough:<br/>\nSoU -&gt; Shadohaunt -&gt; HoTU -&gt; Sands of Fate<br/>\nI've never played through Sands of Fate so I'm unsure what the final level is but it looks to be 40.<br/>\n<br/>\nBuild concept is a Divine melee warrior (Paladin + CoT) that can use UMD to get access to other magic items; and Tumble for extra AC.<br/>\n<br/>\n1) PvM <br/>\n2) Level cap - 40 (or whatever the end of Sands of Fate given the above set of modules)<br/>\n3) Human<br/>\n4) Class preference - Paladin 23 / CoT 14 / Rogue 2 + 1 (leaning towards Paladin 24, but also considering Rogue 3)<br/>\nThe <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17758#p17758\" rel=\"noreferrer\" target=\"_blank\">Harper General</a> was my original inspiration but want something that also gets UMD to make use of some of the more extravagant gear that shows up in HoTU.<br/>\nUsing rogue for UMD to avoid alignment conflicts with bard or assassin.<br/>\n<br/>\n5) Melee preference - sword + shield. Currently conflicted between longsword and scimitar.<br/>\n6) Range preference - N/A (this is a low dex character that will focus on melee)<br/>\n7) Weapon preference - Longsword or Scimitar (need help here, Scimitar has greater threat range but Longsword seems more fun from what I can remember of SoU and HoTU)<br/>\n8) Maximum item enhancement - If memory serves, HoTU has a weapon forge that allows up to +10 enhancement; not sure what SoF allows.<br/>\n9) Spellcasting - Primarily paladin self-buff spells; UMD + scrolls and items for situational use - was thinking there were sequencer robes in HoTU that could be used to store additional defensive buffs.<br/>\n10) Custom factors - none that I remember; but have never played through Sands of Fate<br/>\n<br/>\nThe variant of the above build that I had in mind as a starting point :<br/>\nPaladin (24), CoT(14), Rogue(2), Human<br/>\nAlignment: Lawful good<br/>\n<br/>\nSTR: 15 (26)<br/>\nDEX: 8<br/>\nCON: 14<br/>\nWIS: 14<br/>\nINT: 12<br/>\nCHA: 14 (20)<br/>\n<br/>\n01: Paladin(1): Power Attack, Weapon Focus: Longsword<br/>\n02: Paladin(2): {Smite Evil}<br/>\n03: Paladin(3): Knockdown<br/>\n04: Paladin(4): STR+1, (STR=16)<br/>\n05: Paladin(5)<br/>\n06: Paladin(6): Extend Spell<br/>\n07: Paladin(7)<br/>\n08: Paladin(8): STR+1, (STR=17)<br/>\n09: Paladin(9): Divine Might<br/>\n10: Paladin(10)<br/>\n11: Paladin(11)<br/>\n12: Paladin(12): STR+1, Divine Shield, (STR=18)<br/>\n13: Paladin(13)<br/>\n14: Paladin(14)<br/>\n15: Paladin(15): Blind Fight<br/>\n16: Champion of Torm(1): STR+1, (STR=19)<br/>\n17: Champion of Torm(2): Improved Critical: Longsword<br/>\n18: Champion of Torm(3): Cleave<br/>\n19: Champion of Torm(4): Great Cleave<br/>\n20: Champion of Torm(5): STR+1, (STR=20)<br/>\n21: Champion of Torm(6): Great Charisma I, Epic Weapon Focus: Longsword, (CHA=15)<br/>\n22: Rogue(1)<br/>\n23: Paladin(16)<br/>\n24: Champion of Torm(7): STR+1, Great Strength I, (STR=22)<br/>\n25: Champion of Torm(8): Epic Prowess<br/>\n26: Champion of Torm(9)<br/>\n27: Paladin(17): Great Charisma II, (CHA=16)<br/>\n28: Champion of Torm(10): STR+1, Armor Skin, (STR=23)<br/>\n29: Paladin(18)<br/>\n30: Paladin(19): Great Strength II, (STR=24)<br/>\n31: Paladin(20)<br/>\n32: Paladin(21): STR+1, (STR=25)<br/>\n33: Champion of Torm(11): Great Strength III, (STR=26)<br/>\n34: Paladin(22)<br/>\n35: Champion of Torm(12)<br/>\n36: Champion of Torm(13): CHA+1, Great Charisma III, (CHA=18)<br/>\n37: Rogue(2):<br/>\n38: Champion of Torm(14): Overwhelming Critical<br/>\n39: Paladin(23): Great Charisma IV, Devastating Critical, (CHA=19)<br/>\n40: Paladin(24): CHA+1, (CHA=20)<br/>\n<br/>\nSkills 184:<br/>\nDisc 43 (51), Taunt 43 (48), Tumble 40 (39), <br/>\nUMD 27 (32), Listen 31 (35) -- need help on this split<br/>\n<br/>\n<strong>HELP specifically for</strong>:\n<ol>\n<li>What should that last level be? Paladin brings it to 24 for undispellable, CoT would get better Divine Wrath, Rogue would get more sneak attack, uncanny dodge, and 6 extra skill points.</li>\n<li>To get Dev Crit or not? This is a relatively low strength build that only gets access to Dev Crit late; is it still worth it? Are there other bonus feats that should be taken instead? Not taking Dev Crit probably also frees up Cleave and Great Cleave for other selections as well - maybe Toughness and something else. Dropping Dev Crit could potentially allow for picking up exotic weapons and switching to Bastard Sword or Katana.</li>\n<li>Scimitar vs Longsword? This may tie into the question above about Dev Crit; Scimitar has better threat range but lower damage (1d6 compared to longsword 1d8); the forge in HoTU probably makes either choice usable. I went with longsword as the baseline because I remember more themed longswords in SoU and HoTU than scimitars.</li>\n<li>Skill split between Listen and UMD; are there any targets that I should aim for for equipping items in HoTU or SoF? If I recall correctly there weren't many (any?) enemies that used stealth in the original campaigns but I'm unsure on SoF. I was thinking 34 UMD is needed for level 9 scrolls. The base CHA modifier will give +5; if capped CHA with items/self-buffs then it would be +11.</li>\n<li>Should those last 2 points in CHA go to STR instead? I was thinking CHA improves UMD modifier, Taunt modifier, Divine Shield (+1 dodge ac) and Divine Might (+1 dmg) and duration, Divine Wrath duration, and +1 all saves from Divine Grace; STR would add Disc modifier, +1 AB, +1 dmg, and +1 DC to Dev Crit.</li>\n<li>Is it worth putting any points into Search given the modules being played? I was thinking HoTU had some hidden doors with Search checks.</li>\n</ol><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "3:46 AM - May 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I cannot speak to what items/weapons are available in the modules as I have not played the original modules in a lifetime and I have never played Sands of Fate.<br/>\n<br/>\nWhat I can speak to is mechanical build advantages and the limitations of Module play vs. Persistent worlds.<br/>\n<br/>\nFor this build, the single strongest mechanical component, outside of immediate class advantages, is Devastating Critical.  Given the nature of module play, taking Devastating Critical just prior to level 40 really devalues the level of investment required to get there.<br/>\n<br/>\nPersonally, I would pull all Charisma enhancement, Epic Prowess and Armour skin out of the early epic level build (unless a class bonus feat requires a selection) and focus on pulling in Great Strength, Overwhelming Critical and Devastating Critical in the early epic levels.  As early as you can get it.<br/>\n<br/>\nYou have access to Divine Shield/Might early, an extra round(s) pales in mechanical advantage/power compared to Devastating Critical.<br/>\n<br/>\nI’ll also add, this is a strong build, one of the mechanically strongest offence/defence balanced builds possible.  It will decimate the the Original Campaigns ... it will cut through them like butter.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "3:49 AM - May 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">For your questions, sorry answering on an iPad which makes screen space and switching painful so will update in stages.<br/>\n<br/>\n1. Divine Wrath is a once per day ability, I would discard it over the other two options.  On a persistent world with level 40 play, the strongest mechanical advantage would be 24 paladin for dispels resistance.  On a module however, the strongest mechanical advantage is the rogue level.  It is the strongest not for the reasons you listed but because it allows an additional rogue level dip during the build to take advantage of UMD and tumble as the build progresses rather than right at the end of the build when the module finishes.  Uncanny Dodge would be a strong mechanical advantage on a Dex build, but on a heavy Armor, strength build it sits in the “nice to have if nothing else offers much” category.<br/>\n2. Dev Crit is absolutely worth getting, it is possibly the strongest feat in the game.  It is considered game breaking on most persistent worlds.  With a deep CoT build, you have feats to spare so not even a feat starved approach.  On a deep CoT/Paladin build all the “save” feats become much less interesting.  You need to adjust your build to pull it back as far as possible into your early epics.  I would shift EVERY feat that is not direct path to DevCrit out to later in the build and focus on getting the Great Strength as early as possible to net Overwhelming Critical and DevCrit.  Then prioritise Epic Weapon Focus &gt; Armour Skin &gt; Weapon Prowess &gt; Great Charisma.  <br/>\n<br/>\nThe only downside here is that a Paladin build has lots of stat requirements, DevCrit shines with a deep Strength commitment.  You have the possibility of a deep Strength commitment here using CoT but it comes at a Charisma tradeoff.  So the other option would be to drop Divine Shield/Might (or keep it and live with the lower duration), leave your Charisma at 14 and double down on Great Strength and +Strength to max out your Dev Crit capability (I would probably take the +6 Strength and keep the Divine Feats).<br/>\n<br/>\n3. All things remaining equal Scimitar for DevCrit.  However, you really need someone with module knowledge to lean in.  This build, regardless of weapon selection will utterly decimate module play, likely to the level of boredom.  Having a decent weapon selection/progression is likely worth dipping into another weapon if there are better module options.<br/>\n4. Drop your Con by 2 and bump your Int by 2.  A Paladin/CoT build has lots of damage/save mitigation opportunities and the extra Skill Points are worth more than the Extra HP in my opinion.   However, remember that a Paladin should be able to cap Charisma (+12) pretty easily/quickly netting Aura of Glory and Eagle’s Splendour for +9 whilst still capping Str and likely Con.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:30 AM - May 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">SoU has a Holy Avenger longssword, and HotU has an even better talking longsword with vampiric regeneration, which is really nice to have.  You will spend most of the third chapter of Sands of Fate at level 40.  SoF has several checks for Spot and Search, so I would drop Taunt and Listen for those, but some people value Taunt more than I do.<br/>\n<br/>\nIf you boost STR instead of CHA at levels 21 and 27, you can get Overwhelming Crit at level 25 and Dev Crit at level 28, postponing Epic Prowess and Armor Skin until later.  This would leave you with STR 28 and CHA 18, which might be a better compromise.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:25 AM - May 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like the class split, great synergy with the saves + evasion. I don't see much point in changing it, although I must confess I rarely use Divine Wrath, that might be a reason to go for CoT 15 if this is desirable. I agree with Zanithar usually I prefer Str over Cha for my melee paladins in terms of power. With CoT 14 your saves will be fabulous I'm sure, I'd probably take points away from Cha into Str.<br/>\n<br/>\nUMD you will want at modified 5 intervals (ie 30, 35, 40 etc), the exception being having no failure using up to lvl 9 scrolls, this is obtained at lvl 33. The amount of UMD depends on the value of the magical items you want to use. The higher the magic environment, the higher the UMD modified that is desirable. UMD 40 modified for example should cover all items up to value of 1 million, although I would be tempted to go further, those familiar with the environments can comment in a more expert fashion, I do recall at least +9 weapons being available in HoTU. There is a table in the NWN Wiki to help. I also got the data and prepared a summary of enchantment + value using one of the character creation modules called PGCC, you can see a +10 longsword has a value over 1 million GP so UMD 45-50 might even be attractive. Hip wrote a miniguide to UMD which is <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/a-mini-guide-to-designing-with-the-umd-skill-t2354638.html\" rel=\"noreferrer\" target=\"_blank\">here</a>. <br/>\n<details><summary>Spoiler</summary><table class=\"post_content_table\"><tbody><tr><td>Maximum item value</td>\n<td>Class emulation DC</td>\n<td>Race emulation DC</td>\n<td>Alignment emulation DC</td>\n</tr>\n<tr><td><strong>1,000</strong></td>\n<td>1</td>\n<td>5</td>\n<td>10</td>\n</tr>\n<tr><td><strong>4,800</strong></td>\n<td>5</td>\n<td>10</td>\n<td>15</td>\n</tr>\n<tr><td><strong>20,000</strong></td>\n<td>10</td>\n<td>15</td>\n<td>20</td>\n</tr>\n<tr><td><strong>100,000</strong></td>\n<td>15</td>\n<td>20</td>\n<td>25</td>\n</tr>\n<tr><td><strong>300,000</strong></td>\n<td>20</td>\n<td>25</td>\n<td>30</td>\n</tr>\n<tr><td><strong>600,000</strong></td>\n<td>25</td>\n<td>30</td>\n<td>35</td>\n</tr>\n<tr><td><strong>1,000,000</strong></td>\n<td>30</td>\n<td>35</td>\n<td>40</td>\n</tr>\n<tr><td><strong>1,400,000</strong></td>\n<td>35</td>\n<td>40</td>\n<td>45</td>\n</tr>\n<tr><td><strong>1,800,000</strong></td>\n<td>40</td>\n<td>45</td>\n<td>50</td>\n</tr>\n<tr><td><strong>2,200,000</strong></td>\n<td>45</td>\n<td>50</td>\n<td>55</td>\n</tr>\n<tr><td><strong>2,500,000</strong></td>\n<td>50</td>\n<td>55</td>\n<td>60</td>\n</tr>\n<tr><td><strong>3,000,000</strong></td>\n<td>55</td>\n<td>60</td>\n<td>65</td>\n</tr>\n<tr><td><strong>5,000,000</strong></td>\n<td>60</td>\n<td>65</td>\n<td>70</td>\n</tr>\n<tr><td><strong>6,000,000</strong></td>\n<td>70</td>\n<td>75</td>\n<td>80</td>\n</tr>\n<tr><td><strong>9,000,000</strong></td>\n<td>80</td>\n<td>85</td>\n<td>90</td>\n</tr>\n<tr><td><strong>9,000,000+</strong></td>\n<td>impossible</td>\n<td>impossible</td>\n<td>impossible</td>\n</tr>\n</tbody></table></details>\n<details><summary>Spoiler</summary>\n</details>\n\nAs for weapon choice that just depends on what is available, Empyre has made some good suggestions already. I honestly cannot remember, it has been over 12 months, but I *think* there was quite a good longsword in HoTU I wielded to victory!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:37 PM - May 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello and welcome aboard, Sarthrovar!<br/>\n<br/>\nA few little tips about SoF for you (I'll put them in a spoiler in case you don't want to know).<br/>\n<br/>\n<details><summary>Spoiler</summary>\nIf you begin the modules at Normal difficulty or below, you get to take all your gear and loot from HotU. If you go one up from Normal, then you only get the gear you have equipped. And if you go on hardest difficulty you go without anything. So it's worth starting at Normal - you can always adjust it once you're in play. Second, you'll want some serious fire resistance for your character for the first module - particularly if you're planning on travelling in armour, helm and shield - as you will cook in the heat of the desert and take constant fire damage. Third, it's worth getting some acid damage put on your weapon by Rizolver in HotU for dealing with the desert folk. Also worth taking some ranged ammo with fire or cold damage for assorted slimes. EDIT: Oh, almost forgot, there are a fair amount of nasty traps in SoF, so I'd say some Search and Disable Traps would be worthwhile. On that basis I'd probably go for the extra level of Rogue, for both the extra skills and ease of levelling. Either that or buy a lens of detection when in HotU.\n</details>\n\nAs for the build itself, you receive some wise counsel from others above, and I'm not qualified to pontificate on pallies.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:31 PM - May 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As HotU has a Forge, going Scimitar is pretty much a given imo.<br/>\n<br/>\nEven a mamby pamby Scimi in the OC (I really do not remember if a Scimi of Speed is available), with Pally buffs on it, it will do fine.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:17 PM - May 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">About those traps:\n<details><summary>Spoiler</summary>\nSoU gives you a Lens of Detection and HotU gives you the Merchant's Compass.  Each of those gives you Find Traps 3/day.\nThere is a room in the catacombs (or was it the crypts?) in SoF Ch 3 that is full of traps and an effect that permanently disables those Find Traps devices.  When you find yourself in that room, re-load you last saved game and avoid that room.  There is no benefit from going in there.</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Sarthrovar",
      "avatar": "no_avatar.png",
      "timestamp": "12:10 AM - May 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Many thanks for all the suggestions!<br/>\n<br/>\nDefinitely going to make the changes to pick up Dev Crit sooner by prioritizing strength; will also swap 2 points of Con for 2 points of Int for more skills. I'm also going to make the changes to pick up the extra rogue level pre-epic to help smooth out leveling (comes with the added benefit of getting evasion much sooner) and switch around the skills based on the comments about Spot and Search in SoF and the SoF traps. Going to stick with longsword since there are more options while leveling (the build should be strong enough that the extra crit chance of scim is probably not needed - but scim would be better for PW play; but this is a module run). I did some quick testing with the UMD thresholds and 35 seemed ok to end at; the 10 UMD at level 7 is enough to wear up to +3 Sun Soul boots to help get an extra AC boost early. Swapped Listen for Spot for SoF feedback; dropped Taunt for some Open Lock and Disable Trap skills. I'll wait and see how it goes to see if I need to swap more CHA for STR.<br/>\n<br/>\nPaladin (23), CoT(14), Rogue(3)<br/>\nHuman, Lawful Good<br/>\n<br/>\nSTR: 15 (28)<br/>\nDEX: 8<br/>\nCON: 12<br/>\nWIS: 14<br/>\nINT: 14<br/>\nCHA: 14 (18)<br/>\n<br/>\n01: Paladin(1): Power Attack, Weapon Focus: Longsword<br/>\n02: Paladin(2): {Smite Evil}<br/>\n03: Paladin(3): Knockdown<br/>\n04: Paladin(4): STR+1, (STR=16)<br/>\n05: Paladin(5)<br/>\n06: Paladin(6): Extend Spell<br/>\n07: Rogue(1): {Sneak attack 1d6}<br/>\n08: Paladin(7): STR+1, (STR=17)<br/>\n09: Paladin(8): Divine Might<br/>\n10: Paladin(9)<br/>\n11: Paladin(10)<br/>\n12: Paladin(11): STR+1, Divine Shield, (STR=18)<br/>\n13: Paladin(12)<br/>\n14: Paladin(13)<br/>\n15: Paladin(14): Blind Fight<br/>\n16: Champion of Torm(1): STR+1, (STR=19)<br/>\n17: Champion of Torm(2): Improved Critical: Longsword<br/>\n18: Champion of Torm(3): Cleave<br/>\n19: Champion of Torm(4): Great Cleave<br/>\n20: Champion of Torm(5): STR+1, (STR=20)<br/>\n21: Champion of Torm(6): Great Strength I, Epic Weapon Focus: Longsword, (STR=21)<br/>\n22: Rogue(2): {evasion}<br/>\n23: Paladin(15)<br/>\n24: Champion of Torm(7): STR+1, Great Strength II, (STR=23)<br/>\n25: Champion of Torm(8): Overwhelming Critical<br/>\n26: Champion of Torm(9)<br/>\n27: Paladin(16): Great Strength III, (STR=24)<br/>\n28: Champion of Torm(10): STR+1, Devastating Critical, (STR=25)<br/>\n29: Champion of Torm(11)<br/>\n30: Champion of Torm(12): Great Charisma I, (CHA=15)<br/>\n31: Champion of Torm(13)<br/>\n32: Champion of Torm(14): STR+1, Epic Prowess, (STR=26)<br/>\n33: Paladin(17): Great Charisma II, (CHA=16)<br/>\n34: Paladin(18)<br/>\n35: Paladin(19)<br/>\n36: Paladin(20): STR+1, Great Strength IV, (STR=28)<br/>\n37: Paladin(21)<br/>\n38: Paladin(22)<br/>\n39: Rogue(3): {uncanny dodge I, sneak attack 2d6}, Great Charisma III, (CHA=17)<br/>\n40: Paladin(23): CHA+1, Armor Skin, (CHA=18)<br/>\n<br/>\nSkills (233):<br/>\nDisc 43 (52)<br/>\nTumble 40 (39)<br/>\nUMD 35 (39)<br/>\nSpot 35 (37)<br/>\nSearch 33 (35)<br/>\nDisable Trap 27 (29)<br/>\nOpen Lock 20 (19)<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "1:11 AM - May 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Remember that Skill levels are modded levels.  You have a 30 Charisma for +10 UMD (capped).  So, if 35 UMD is your target, 25 actual Invested skill Points is enough.  Not that having extra is bad,but if you have another spot to put them,it offers some flexibility.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}