{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "555",
  "name": "Siblings builds request for a high magic server",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/siblings-builds-request-for-a-high-magic-server-t2355559.html",
  "author": "Kuyav",
  "avatar": "10759265_1610890056.png",
  "replies": 10,
  "posts": [
    {
      "author": "Kuyav",
      "avatar": "10759265_1610890056.png",
      "timestamp": "1:21 PM - Sep 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi everyone!<br/>\n<br/>\nHope all are well.<br/>\n<br/>\nSome time ago (like 15-18 years) my sister and I played together on one of the first Nordock servers as drows. We were in one of two biggest families in the whole Underdark with the most amazing ppl we could possibly play as teens. Not only we have learned how to live in an online rpg society, but also we were shown how a drow family looks like with the whole hierarchy, intrigue and all the good stuff. <br/>\nAs those were our first rpg characters ever we decided to start easy and play as siblings who were best friends (yeah, I know). <br/>\nWherever we went we always went together. Even DMs created a special events to separate us so other could save another some time to time. <br/>\nSo long story short the server, ppl and everything was amazing. Of course, nothing last forever and server went down coz at some point there was no one interested in playing at some point.<br/>\n<br/>\nI came back to NWN +/- 2 years ago and was playing campaing, found a new Nordock and couple others server so I stayed till today. My sister on the other hand didn't play ANY game in last 10 years. So for her's birthday last month I decided to buy her NWN: EE and convinced her to start playing again. Of course she was happy as hell and even proposed that we could continue our adventure as those drow siblings. In a heartbeat I started to think how will I write my toons history. What happend with him when he got separated from his family, and why. Was there a giant earthquake that destroyed the city they lived in, or was there a great war with other family/surface ppl? And what skills and feats he gain during all those years... In other words what classes he will have. And then it came up to me... I need a build(s)!<br/>\n<br/>\nAnd that is why I am here... My sister knows nothing about making decent builds and I only know where to search or where to ask for one, hehe.<br/>\nSo here I am, asking you to recommend not one, but two builds that will support each other. My sister was a high priest so she definatelly had a cleric class. I was her scout and muscles so If I'm not mistaken I was a fighter mixed with ranger or rogue fighting with bow and two short swords. The build was aweful, but it was fun.<br/>\n<br/>\nOf course I prepared a build request template (below). For my sister I think it's gonna be easy as all she said she wants is \"A powerful cleric build that will be able to save your pity butt every time you come up with one of your great ideas like putting an invisibility spell on yourself and then go sneaky on that dragon and his shiny treasure.\" In my defence, I did it JUST once, I was new to the whole D&amp;D stuff and freakin' DM told me that \"only your imagination holds you from doing something that will last in memory forever.\"<br/>\n<br/>\nAs for myself? Not sure what will suit me best. I'm torn between a bow focused sneaky assassin with hips and monk speed or a two weapon figting silent killer. <br/>\nI know I will need a high AB because the server we will play on has it's bosses, and raids so there are mobs with even 85 AC.<br/>\n<br/>\nAnd I think that's all. Thank you all for reading and for any propositions. Will appreciate everything!<br/>\n<br/>\nThanks!<br/>\n<br/>\n<br/>\n1) PvM or PvP -Both PvM please with a high AB for my toon and a decent tank build for my sister<br/>\n<br/>\n2) Level cap - 40<br/>\n<br/>\n3) Race preference - Elf/Drow stats below:\n<ul>\n<li>Ability Bonus: Charisma +2</li>\n<li>Ability Bonus: Intelligence +2</li>\n<li>Darkvision</li>\n<li>Saving Throw Bonus: Specific: Will +2</li>\n<li>Skill Bonus: Hide +2</li>\n<li>Skill Bonus: Move Silently +2</li>\n<li>Abilities from the unique item:</li>\n<li>Cast Spell: Darkness (5) 1 Use Per Day</li>\n<li>Cast Spell: Light (1) 1 Use Per Day</li>\n<li>Must be Elf. </li>\n<li>Light Sensitive.</li>\n<li>Favored Class - Male: Wizard, Female: Cleric.</li>\n<li>Can only be evil</li>\n<li>Spell Resistance: Base (at Level 1): 10, Max(at Level 40): 50.</li>\n</ul>\n<br/>\n4) Class preference - For my sister cleric, for me something fast, sneaky and deadly.<br/>\n<br/>\n5) Melee preference - fine with everything<br/>\n<br/>\n6) Range preference - fine with everything<br/>\n<br/>\n7) Weapon preference - My sister - whip or anything she could \"reprimand \"me with. As for myself - bow or shortswords but can go with anything.<br/>\n<br/>\n8) Maximum item enhancement - +5. +6 if lucky.<br/>\n<br/>\n9) Spellcasting - For my sister we think a support cleric that will be able to buff us will be most efficient. Maybe some necromancy as well? I would like to be a non-magic character if possible.<br/>\n<br/>\n10) Custom factors - Server is using PRC and it's a high magic server.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:21 PM - Sep 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">For your own character, may I be so bold to suggest two of my own builds for you to have a look at. They are both evil elven builds.<br/>\nOne is the <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build295415.html\" rel=\"noreferrer\" target=\"_blank\">Deathshadow</a><br/>\nThe other is the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/kama-shinobi-monk-9-assassin-26-sd-5-t2350791.html\" rel=\"noreferrer\" target=\"_blank\">Kama Shinobi</a><br/>\nThey can be a bit slow to level to start with since they are dexers,  but once they get Death Attack and HIPS, they become the killers you may be looking for.<br/>\n<br/>\nI have little to no experience with PRC, so I don't know if that will affect the builds in any way.<br/>\nNWN EE has nerfed the Death Attack paralysis to one paralysing attempt per attack rather than to be triggered by the whole flurry af attacks. But the DA damage works as before.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kuyav",
      "avatar": "10759265_1610890056.png",
      "timestamp": "3:12 PM - Sep 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Mick,<br/>\n<br/>\nI'm a silent fan of your, Stag's and Max's builds so it's an honor having an advice from you.<br/>\n<br/>\nBoth builds are absolutely smashing. Thank you. I think I will go with Kama Shinobi that does not exist but with shortsword or something else istead of kama because the whole server is fighting with kamas. It's like there is no other weapon *_*<br/>\n<br/>\n So now I just need a good elf/drow cleric build for my sister that will go with your Shinobi.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:23 PM - Sep 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, Mick's (and probably the others) build(s) use(s) Kamas because with the Monk class, kamas can be used with FoB and Monk Ubab.<br/>\n<br/>\nWhich makes them superior to shortswords (which cannot be used with FoB and Monk Ubab).<br/>\n<br/>\nFor Monks in a high magic environment, there really isn't any other weapon.  Fists start to fall behind at a certain magic level due to how Gloves work.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:47 PM - Sep 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you are dead set on not using kamas, then you might be better off with a Rogue / Fighter / SD.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kuyav",
      "avatar": "10759265_1610890056.png",
      "timestamp": "2:38 PM - Sep 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"21790\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21790&amp;sid=aecb5093b2d7bc6f9d664715c376e37c#p21790\">↑</a><div class=\"responsive-hide\">Sep 03, 2020</div></cite>Well, Mick's (and probably the others) build(s) use(s) Kamas because with the Monk class, kamas can be used with FoB and Monk Ubab.<br/>\n<br/>\nWhich makes them superior to shortswords (which cannot be used with FoB and Monk Ubab).<br/>\n<br/>\nFor Monks in a high magic environment, there really isn't any other weapon.  Fists start to fall behind at a certain magic level due to how Gloves worOk, now </div></blockquote>\nOk, now I understand. Thank you :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kuyav",
      "avatar": "10759265_1610890056.png",
      "timestamp": "2:39 PM - Sep 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote: <a data-post-id=\"21793\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21793&amp;sid=aecb5093b2d7bc6f9d664715c376e37c#p21793\">↑</a><div class=\"responsive-hide\">Sep 03, 2020</div></cite>If you are dead set on not using kamas, then you might be better off with a Rogue / Fighter / SD.</div></blockquote>\nWill have that in mind for future builds. Appreciate the advice!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:38 PM - Sep 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What PW is this?<br/>\n<br/>\nI love playing with the PRC!<br/>\n<br/>\nI will say this - none of the builds here will be all that helpful in a high magic environment where the PRC is in use.<br/>\n<br/>\nThe PRC introduces a bazillion different things!  Classes, Prestige Classes, Races, Magic, Magic Systems, Psionics, oodles of new Feats, etc!<br/>\n<br/>\nI think I recall a website that was doing PRC Class builds, but I do not know if it is still in use today.<br/>\n<br/>\nMy favorite was (and still is) always Wizard/Eldritch Knight/Archmage as an Avariel Elf.  And then grab some of the new Epic Spells (Garden of Stone is awesome in conjunction with Mass Penguin!).  Too bad the really good defensive epic spells were toned down.  One could get immune to all Physical Damage (that has been toned down to 75% I think).  Real Teleportation, Mass Teleportation, Scying, oh my!  Oh, and Contingency spell.  Marvelous.<br/>\n<br/>\nAnother, of course, is Wiz/Cleric/Mystic Theurge.  Full Caster levels in both Wiz and Cleric?  Hell yeah!<br/>\n<br/>\nAnd the PnP Shifter is just light years ahead of the Bioware version.  And then there is the mega-omg-demi-lich for true OPness.<br/>\n<br/>\nI really miss playing with the PRC.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "6:47 PM - Sep 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You're making me want to play with the PRC now. I've only ever loaded it up locally to mess around, but never played on a PW with it. Sounds awesome!<br/>\n<br/>\nI believe there was a PRC forum on the old Bioware site. Maybe it is archived?<br/>\n<br/>\nSent from my SM-G955U using Tapatalk<br/>\n<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:44 PM - Sep 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">PRC has a reputation for being overpowered, unbalanced etc. If the module creator is able to balance that out, I guess that it can work after all. But a closer knowledge of the PRC hak will be very helpful if you want to make a powerbuild for such an environment.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:03 PM - Sep 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The PRC comes with a huge amount of switches, which one can pretty much personalize it as one sees fit.<br/>\n<br/>\nAs I had the PRC implemented into my PW (The Playground) way back when, I made a lot of use of those switches.<br/>\n<br/>\nIt is important to curtail the PRC to do what one wants, and to leave out the stuff that one does not want (or feels is too OP, unbalanced, whatever).<br/>\n<br/>\nThe biggest problem with the PRC is getting the AI to use it - in my case, I used Jassper's AI to help with this.  Still, it was an imperfect solution because some stuff just could not be used by the AI (which was kind of sad because some unusable stuff should be turned back on the Players).<br/>\n<br/>\nStill, this is probably not the ideal place to discuss this topic.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}