{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "402",
  "name": "Monk\\Shadowdancer",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/monk-shadowdancer-t2332547.html",
  "author": "Tyris2222",
  "avatar": "10235244_1510287070.jpg",
  "replies": 1,
  "posts": [
    {
      "author": "Tyris2222",
      "avatar": "no_avatar.png",
      "timestamp": "8:13 PM - May 14, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Looking for help with a build, 29 level, with 6 levels of Shadowdancer and the rest either all monk or a combination with another class.  Locked into the 6 shadowdancer as HIPS is given at 6th level.  For survivability I'm thinking it will need to be a dex build and to me a monk is unarmed, not kama wielding.  The biggest question is to go all monk or mix with another class to punch it up a bit.  Obvious choice would be rogue and thats fine.  What would you recommend as the split with regards to monk\\rogue?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:25 PM - May 14, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That depends on how AB works in your server. If you don't need it much, then sure, Rogue will give you some juicy skill points. I can say that at least Monk 16 is advisable because that's when you get the highest unarmed damage. As for the 29th level cap, it just leaves 7 levels to be meddled with. I'd say with 7 levels, Rogue isn't going to cut it. Your best bet would be Fighter for some extra feats. Fighter 4 Monk 12 SD 4 pre-epic, then SD 2 for earliest possible HiPS (without jeopardizing BAB, that is), then Fighter for the bonus feats (EWF and EWS) as soon as possible. Don't forget to get WS with the Fighter bonus feat at level 4 to qualify for EWS. This also nets you a full attack schedule, although 26 BAB isn't exactly high. You can go Fighter 6 Monk 17 DS 6 or some combination.<br/>\n<br/>\nI'd go Elf and live with the XP penalty for more DEX, but I don't know the server, so it's a wild guess. You can also consider going Assassin for Death Attack, but they'll only be paralyzed on a natural 1.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}