{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "045",
  "name": "Role-Based Concept: The Detective/Investigator. [Lvl 20].",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/role-based-concept-the-detective-investigator-lvl--t2354750.html",
  "author": "UselessPoint",
  "avatar": "no_avatar.png",
  "replies": "1",
  "views": "171",
  "posts": [
    {
      "author": "UselessPoint",
      "avatar": "no_avatar.png",
      "timestamp": "6:49 PM - Oct 04, 2017",
      "content": "<div>Hello to everyone! As alwyas, this forum is amazing, not just for the builds you can find, but also for the ideas and concept that you can imagine with the tools we're given (the class of nwn).<br/>\n<br/>\nSo, i was trying to brainstorm an idea, the concept of an investigator, sort of Sherlock holmes \"ante-litteram\" and i was wondering how to do it.<br/>\n<br/>\nPersonally, my ideas go towards two sure classes: Ranger, and Rogue, for the bonuses and high skill you can have. Rogue is full of skills, and ranger got some nifty roleplaying tools, like trackless step, some very nice spell like camouflage and one with the land, and an animal companions like an Hawk, or Wolf, or Rat, that can be posed as a sort of \"sniffing\" hound that can help you in your investigation.<br/>\nPerhaps adding weird abilities like the monk's many immunities, and such.<br/>\n<br/>\nSo, since it is a strange concept, i'd like to know your ideas. Not necessarily based on the classes i've mentioned.<br/>\n<br/>\nInspirations: Sherlock Holmes, Dale Cooper from Twin Peaks, and much more<br/>\n<br/>\nThanks to everyone for the attention and for any insight you can give me!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:14 PM - Oct 04, 2017",
      "content": "<div>Hello Point,<br/>\n<br/>\nThis is a 20th level build right? Too bad, since a (Ranger 26/ Rogue 14) with BoE &amp; ED and over 400 skill points, sprang to mind immediately when i saw it...<br/>\n<br/>\nBut i guess these concepts work far better in a level 20 environment with role-playing support.<br/>\n<br/>\nFor that, a Ranger 12/ Fighter 4/ Rogue 4 will be my first guess if that character eventually needs to fight. Or you can go full circle and base that on Mage with a splash of Rogue/Ranger in there for the additional skills &amp; abilities.</div>"
    }
  ]
}