{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "020",
  "name": "Divine power",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/divine-power-t2356198.html",
  "author": "Vinleboiteux",
  "avatar": "10759636_1701929568.jpeg",
  "replies": "6",
  "views": "750",
  "posts": [
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "2:32 PM - Jan 07, 2024",
      "content": "<div>Hey everyone,<br/>\n<br/>\nMore noob questions.<br/>\n<br/>\nSo divine power grants Bab equal to your characters level right ? So lets say im cleric 10 monk 1 cot 1 i will get the BAB of a level 12 fighter right ? Not just cleric levels?<br/>\n<br/>\nOn the same note, the extra attacks per round are for character level or cleric levels ? Do they appear on character sheet ? <br/>\n<br/>\nThanks everyone :)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:42 PM - Jan 07, 2024",
      "content": "<div>See if this helps - it's from Max's Guide to the Cleric Class, and puts the merits of Divine Power as clearly as I've seen.<br/>\n<br/>\n[url=<a class=\"postlink\" href=\"http://THE\" rel=\"noreferrer\" target=\"_blank\">http://THE</a> BEST SPELL IN THE GAME: DIVINE POWER:  * This spell gives you, as an AB enhancement, whatever amount you lack to acheive the BAB of a Fighter of the same level. So if at level 20 you have 13 BAB, where a pure Fighter would have 20, Divine Power will give you a +7 AB enhancement. It's sick, I know. Not only that, but whenever that same fighter would have one more attack per round than your poor little self, this spell will also give you an EXTRA ATTACK PER ROUND AT FULL BAB (which makes a Cleric with DP better than a Fighter of the same level). And as a minor property but still very good for DEX-based toons, it sets your Strength to 18 if it's any lower. If it's higher it remains as is.  Now the above is also very common knowledge within the ECB, but perhaps what I'm about to demonstrate next isn't. For the sake of simplicity, let's assume that you go straight Cleric for the first 20 levels, and draw conclusions based on the observation of how Divine Power works.  Fighter-types gain an extra attack at levels 6, 11 and 16. So from levels 6-10, they have 2 APR (Attacks Per Round), from 11-15 they have 3 APR and from 16 on 4 APR.  Clerics and all +3/4 per level BAB classes gain an extra attack at levels 8 and 15 so from levels 8-14 they have 2 APR and from 15 on they have 3 APR.  By cross-examining these two charts, we can see that Clerics get Divine Power at level 7 (not considering Strength domain here), so at level 7 they get an extra attack per round. At level 8, Clerics gain another attack per round, so Divine Power no longer gives you an extra attack until level 11, when fighter-types gain the third attack per round. Then from 11-14 it goes back to giving you an extra attack per round, but at 15, Clerics gain their third attack per round so DP won't give you an extra attack till you reach level 16, when Fighters reach their fourth attack per round (which pure Clerics can't acheive with BAB), so from that level on, DP will always give you an extra attack per round.  However, to make things simpler, I will state the following: IN MOST CASES, Divine Power gives you an extra attack from level 11 on. Peroid. Now why would I do that? Simple, I explained the whole mechanism so you would understand, but there are a few things that weren't taken into account. The first one is that at level 7, Divine Power only lasts 7 Rounds, which is VERY LITTLE, and all your other buffs are at a lousy +2 each (except Shield of Faith, which is at +3), so I generally don't bother using DP till level 9, when you can extend it for an 18 round duration and also your other buffs have increased to +3. Secondly, you're likely to have taken another non-full BAB class for skill dumps by then, save few exceptions. If you go, say Cleric 14 Wizard 1 (like my Magical Master build), you won't reach level 15 being a Cleric 15, so you won't gain that extra attack till level 16, when Fighter-types get their fourth attack and DP will forever grant you that juicy extra attack at full BAB.  If you have a full attack schedule, attained with pre-epic BAB 16 or higher, then you don't get that extra attack at full BAB, so a Cleric should NEVER EVER EVER try to go over 15 pre-epic BAB. EVER!]Divine Power[/url]</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "2:51 PM - Jan 07, 2024",
      "content": "<div>Yeah I read it. Seem to imply its from character levels though not explicitly said. I totally could have missed it too. Does that mean the extra attacks don’t show up on character sheet ? Cuz I don’t see them on my cleric 10 monk1 cot 1 char</div>"
    },
    {
      "author": "HarperDaniels",
      "avatar": "no_avatar.png",
      "timestamp": "11:50 AM - Apr 08, 2024",
      "content": "<div>Thanks for the info, I also want to know it. I appreciate you for answering, you made my day. </div>"
    },
    {
      "author": "MasonJones",
      "avatar": "no_avatar.png",
      "timestamp": "3:01 PM - Jun 13, 2024",
      "content": "<div>Thanks for the link. </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:59 PM - Jun 13, 2024",
      "content": "<div><blockquote><div><cite>Vinleboiteux wrote: <div class=\"responsive-hide\">Jan 07, 2024</div></cite>Yeah I read it. Seem to imply its from character levels though not explicitly said. I totally could have missed it too. Does that mean the extra attacks don’t show up on character sheet ? Cuz I don’t see them on my cleric 10 monk1 cot 1 char</div></blockquote>\nNo, the extra attacks do not show up on the character sheet (which often lies).</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:02 PM - Jun 13, 2024",
      "content": "<div>And to clear up the level quandry, this - <blockquote><div>Base attack bonus improves to that of a fighter of the same <em>character</em> level; caster level is ignored for this aspect of the spell. For example, this spell grants any level 14 character the base attack bonus of a level 14 fighter (i.e. +14/+9/+4), regardless of that character's classes and class levels.</div></blockquote>\n<br/>\nFrom - <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Divine_power\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Divine_power</a><br/>\n<br/>\nBasically, this means that the BAB gain is based on ALL levels of the Character, not just the Cleric levels.<br/>\n<br/>\nAnd yes, DP is broken as all getout!  So abuse the holy (unholy) heck out of it!</div>"
    }
  ]
}