{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "084",
  "name": "Aielund Sequencers, Subraces & R6025 Runtime Errors",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/aielund-sequencers-subraces-r6025-runtime-errors-t2355743.html",
  "author": "Guest",
  "avatar": "guest.png",
  "replies": 14,
  "posts": [
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "10:32 AM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong>1. Sequencers</strong><br/>\n<br/>\nI don't know if this is the right forum for this but I am having trouble using sequencers in Aielund. I had no problem with them in Swordflight. I can't figure out if I am doing something wrong or if they are bugged.<br/>\n<br/>\nI have bought two sequencer items so far and neither have worked. Specifically, I have a Robes of the Archmagi and a Female Sorcerer's Outfit. I cast Improved Invisibility (from a scroll) and Cat's Grace (memorized) on both during testing. When I \"used\" the sequencer items, the spell didn't cast though the animation of using them happened. Then, after resting and trying to use the sequencer items again, the game reported that no spell was stored. I also tried clearing the sequencer items first, then casting Improved Invisibility on them, then using them but that didn't work. I just ended up wasting the scroll and having to reload. I tested with Cat's Grace as a memorized spell to see if Aielund didn't allow spells to be cast from scrolls onto sequencers but Cat's Grace also failed.<br/>\n<br/>\nI know that you have to target the piece of equipment specifically with the spell - as I said, I had no problems using sequencer items in Swordflight. I tried casting Improved Invisibility on the robes while wearing them and again while they were in my inventory. Neither method worked.<br/>\n<br/>\nSo my main question is whether this is a bug specific to Aielund - do sequencers not work in Aielund? For reference, I'm using NWN Diamond Edition patch 1.69 and I have the latest version of Aielund installed with all the haks, etc installed as well. If others have been able to use sequencers successfully in Aielund, then am I doing something wrong?<br/>\n<br/>\nCould this be an issue caused because I have both rogue and wizard levels? Is the UMD messing with the natural wizard ability to cast spells to make the sequencers fail?<br/>\n<br/>\n<strong>2. Subraces</strong><br/>\n<br/>\nI am trying to play an Air Genasi. So far, my character is just a human with a fancy tag - none of the subrace attributes have kicked in. The official walkthrough for Aielund said that subraces can be used in Act 4 so I'm hoping the subrace attributes will kick in then. I'm currently in Act3. The strange thing is that I always get an error message from Shayan's Subrace Engine that I'm using an unrecognized subrace. Is that just an error message I will continue to get throughout Act3?<br/>\n<br/>\n<strong>3. R6025 Runtime Error</strong><br/>\n<br/>\nMy game started crashing somewhere in Chapter 2, after when I went to Felbourne Swamp. It usually crashes when I try to pick up an item but sometimes when I unequip an item. I did research online and couldn't figure this issue out. I have attached a screenshot for reference. Restarting my computer seems to be the best solution. Has anyone else had such problems while playing Aielund? Did you find a solution?<br/>\n<br/>\n<br/>\nI will be grateful for any help people can provide for the above three issues. Thank you.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:38 PM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I don't know about the sequencers, nor the subrace problem, but that runtime error for C++ is probably based on the version of the M$ C++ library that is installed on your PC.<br/>\n<br/>\nI suspect that your C++ version is not the correct version for 1.69<br/>\n<br/>\nSpeaking of which, why are you playing the 1.69 version when you can get NWN EE really cheap?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:23 PM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Afraid I know nothing about the technical stuff, nor indeed sub-races. As to sequencers, I recently asked about them in <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/first-of-the-order-wizard-35-fighter-1-cot-4-now-w-t2355698-s20.html\" rel=\"noreferrer\" target=\"_blank\">this</a> thread, which Max kindly answered (it's in the last few posts), though it might be of no use to you. As to whether it's Aielund-specific, it might be covered in the info on Aielund's EMS (how the system of magic differs from vanilla in the campaign). You can find all the changes on page 13 of the Aielund Saga thread in the Modules forum.<br/>\n<br/>\nOthers with greater knowledge of matters arcane - which is virtually everyone else here - might be of more assistance.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "2:06 PM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"24781\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24781&amp;sid=0522a6626934b53969afe76697ed2c89#p24781\">↑</a><div class=\"responsive-hide\">Jun 28, 2021</div></cite>I don't know about the sequencers, nor the subrace problem, but that runtime error for C++ is probably based on the version of the M$ C++ library that is installed on your PC.<br/>\n<br/>\nI suspect that your C++ version is not the correct version for 1.69<br/>\n<br/>\nSpeaking of which, why are you playing the 1.69 version when you can get NWN EE really cheap?</div></blockquote>\n1. Which is the correct version of C++ for 1.69?<br/>\n<br/>\nThe versions I have installed are Microsoft Visual C++ redistributable from 2005 through 2015. I wouldn't know how to find out if the versions I have are wrong and, if they are wrong, where to find the right versions.<br/>\n<br/>\n2. I have always played the Diamond version (it's the CD I own). I usually regret spending money on upgrades so I would need a good reason to do so. Last I checked (before today), the EE was very expensive (I don't remember the exact price but it was more than I was willing to pay for a game I already owned) but I suppose that was several years ago. There's currently a sale on it for $5.99, which is definitely within my budget. Can you \"sell\" it to me, so to speak? Tell me why I should buy the new version.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "2:10 PM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"24782\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24782&amp;sid=0522a6626934b53969afe76697ed2c89#p24782\">↑</a><div class=\"responsive-hide\">Jun 28, 2021</div></cite>Afraid I know nothing about the technical stuff, nor indeed sub-races. As to sequencers, I recently asked about them in <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/first-of-the-order-wizard-35-fighter-1-cot-4-now-w-t2355698-s20.html\" rel=\"noreferrer\" target=\"_blank\">this</a> thread, which Max kindly answered (it's in the last few posts), though it might be of no use to you. As to whether it's Aielund-specific, it might be covered in the info on Aielund's EMS (how the system of magic differs from vanilla in the campaign). You can find all the changes on page 13 of the Aielund Saga thread in the Modules forum.<br/>\n<br/>\nOthers with greater knowledge of matters arcane - which is virtually everyone else here - might be of more assistance.<br/>\n<br/>\nCheers</div></blockquote>\n1. Thank you for the tip. I took a look at Max's comments but couldn't find the information I needed.<br/>\n<br/>\n2. I frequently review the EMS Changes file. I checked the file for info on subraces and on sequencers before I posted here but I couldn't find the information there, either. I'll go check out page 13 of the Aielund Saga thread.<br/>\n<br/>\nThanks for your comment.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:17 PM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Why buy EE?<br/>\n<br/>\nBesides the fact that it is \"ooohhh, shiny!\", it brings with it a rather large amount of fixes, changes, patches, etc.  The UI changes are amazing, and the graphical changes are very nice (especially how the metal now gleams like metal, how water and shadows are now real and not pre-generated, and of course keyholing, which is just amazing).<br/>\n<br/>\nAnd of course it will run on all modern systems, resolutions, etc as well as having the multiplayer online stuff.<br/>\n<br/>\nThere is a lot more under the hood, and for those of us (like me) who play almost exclusively MP Online, some amazing support changes that have breathed new life into an old game (like CEP Weapon Feats et al).<br/>\n<br/>\nBut here is the major selling point (if you love monks, like I do) - they fixed Circle Kick so that one is not left just standing there.  Yep.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "4:51 PM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">OK, I bought it since it was on sale for a very good deal on GOG.com. Do you happen to know if save files transfer from one edition to the other? I'm assuming they don't so I'm thinking to just complete my current playthrough (at least) before trying to figure out EE.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:24 PM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"24785\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24785&amp;sid=0522a6626934b53969afe76697ed2c89#p24785\">↑</a><div class=\"responsive-hide\">Jun 28, 2021</div></cite>Why buy EE?<br/>\n<br/>\nBesides the fact that it is \"ooohhh, shiny!\", it brings with it a rather large amount of fixes, changes, patches, etc.  The UI changes are amazing, and the graphical changes are very nice (especially how the metal now gleams like metal, how water and shadows are now real and not pre-generated, and of course keyholing, which is just amazing).<br/>\n<br/>\nAnd of course it will run on all modern systems, resolutions, etc as well as having the multiplayer online stuff.<br/>\n<br/>\nThere is a lot more under the hood, and for those of us (like me) who play almost exclusively MP Online, some amazing support changes that have breathed new life into an old game (like CEP Weapon Feats et al).<br/>\n<br/>\nBut here is the major selling point (if you love monks, like I do) - they fixed Circle Kick so that one is not left just standing there.  Yep.</div></blockquote>\nWhoa, whoa, whoa, Web - you didn't expect that to pass without comment, did you?<br/>\n<br/>\nEE nerfed Death Attack for Assassins, Flurry of Blows for your (and my) beloved Monks, and cheerfully threw the additional DwD 5 benefit of effective immunity to sneaks to Uncanny Dodge 2 without a backward glance.<br/>\n<br/>\nIt might be pretty, but it ain't all good!<br/>\n<br/>\nSo there. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "7:26 PM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you don't mind, what did EE do to Flurry of Blows? I love monks as much as anyone, probably.<br/>\nI don't think I ever managed to play a dwarven defender but I guess if I do, it'll be in EE <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\nI don't play evil classes so the Assassin nerf doesn't affect me.<br/>\n<br/>\n(On the topic of nerfs, the Enhanced Magic System [EMS] used in Aielund frustrates me from time to time with both lack of documentation and nerfs done because the EMS guy felt that they were justified [in the world of EMS, he alone is king and God lol]. A lot of EMS changes are seemingly just a change from 3.0 rules to 3.5 rules, many of which can be found in NWN2.)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:35 PM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>unifiedworld wrote: <a data-post-id=\"24788\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24788&amp;sid=0522a6626934b53969afe76697ed2c89#p24788\">↑</a><div class=\"responsive-hide\">Jun 28, 2021</div></cite>If you don't mind, what did EE do to Flurry of Blows? I love monks as much as anyone, probably.<br/>\nI don't think I ever managed to play a dwarven defender but I guess if I do, it'll be in EE <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\nI don't play evil classes so the Assassin nerf doesn't affect me.<br/>\n<br/>\n(On the topic of nerfs, the Enhanced Magic System [EMS] used in Aielund frustrates me from time to time with both lack of documentation and nerfs done because the EMS guy felt that they were justified [in the world of EMS, he alone is king and God lol]. A lot of EMS changes are seemingly just a change from 3.0 rules to 3.5 rules, many of which can be found in NWN2.)</div></blockquote>\nApologies - it's Stunning Fist, not FoB, that's been changed, my bad. The duration is now 1 round rather than 3. Still, can be a huge difference if you're unarmed and have many Monk levels.<br/>\n<br/>\nAs a btw, I believe you can turn off Aielund's EMS and revert to vanilla, but again we wander into my two weakest areas - tech stuff and casting stuff.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "8:38 PM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The problem for me is that Aielund was designed and balanced with EMS in mind so it doesn't seem right to turn it off. To be fair, there are a lot of good aspects to EMS as well as bad - the worst aspect is that the documentation is so poor, however.<br/>\n<br/>\nHonestly, if I could figure out how to get sequencers to work, that would be more valuable than turning off EMS. (Alternately, if I could get confirmation that sequencers just don't work in Aielund Saga, then I won't need to worry about them.)<br/>\n<br/>\nBut yeah, I can't turn off EMS because I would feel that I was cheating.<br/>\n<br/>\nAbout Stunning Fist - it's an excellent feat for monks with high Wisdom. I have a monk/druid (shapeshifter) build that happily uses Stunning Fist when there is a need.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:44 PM - Jun 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I had the same  problem with sequencers when I played Aielund under 1.69. They worked with every other module where I tried them. I have no explanation why they didn't work. <br/>\nI have not tried sequencers in Aielund with EE yet. But someone must have done so by now.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "12:01 AM - Jun 29, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Mick! Now I know that they just don't work under 1.69. They probably worked with a previous patch. This is very helpful.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "9:58 AM - Jun 29, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Without pouring over the scripts that perform the modifications in EMS, I can't put my finger on \"where\" the issue with sequencers is happening, but I'm very certain that's the source of the issue you experienced.<br/>\nEE now features Aielund and I expect that both issues are resolved by the transition.<br/>\nIn addition to the improvements to the engine noted by Web, pathfinding was significantly improved and several scripting functions were added. Any module using these new scripting functions will not work in 1.69.<br/>\nAs for your saves, they should all transfer, but you'll have to manually copy the save files and the modules over.<br/>\nHope you enjoy EE! I know I certainly have.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unifiedworld",
      "avatar": "guest.png",
      "timestamp": "10:42 AM - Jun 29, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><em class=\"mention\">@Ten Pura</em> Thanks very much for your input and assistance. I'll have to give EE a try then.<br/>\n<br/>\nUpdate: I downloaded EE, copied my save files, haks and other necessary files to my Documents folder. I was able to load my saved game. However, the sequencer still doesn't work. I cast Greater Stoneskin on it, then selected Use: Sequencer through the radial menu. Again, the animation happened but no spell was cast. After I rested and tried to \"Use: Sequencer\" again, it said \"No spell stored\" and failed.<br/>\n<br/>\nNow, perhaps if I start over from scratch in EE, the problem with sequencers may not occur. In any case, for me the problem persists. Moreover, the issue with the subrace error message also persists. I don't know what the deal is with that.<br/>\n<br/>\nUpdate2: No runtime errors so far while playing with EE. I'm glad I bought it. The cosmetic upgrade is significant and the program runs very smoothly compared to Diamond Edition. I would also like to look into playing in the fabled World of Greyhawk persistent server, since I can actually connect to multiplayer now! However, I had better at least finish Aielund (and maybe Swordflight) first, instead of cutting the adventure short as I seem prone to do.<br/>\n<br/>\nAbout sequencers, I'm not really worried. To be honest, there aren't even any good scrolls around (no Shadow Shield, Mind Blank, Protection from Negative Energy, Protection from Spells, Lesser Mind Blank). Improved Invisibility's duration is nerfed in EMS to 1 round/level so it's not even worth memorizing imo (Displacement is better since it's one spell slot lower and the duration is identical - it just misses out on the Invisible effect). Premonition, Stoneskin and True Seeing are available on items anyway, as uses per day or as a constant property in the case of True Seeing. So even if sequencers did work, I wouldn't have much to do with them that I can't already do with my other items.<br/>\n<br/>\nUpdate3: No runtime errors anymore. I assume they are gone. I just started Act4 and I'm using the built-in system in EE, that is, I just picked Aielund out of their existing menu and imported my character from the end of Act 3. I actually deleted all the hak, erf, tlk, etc files that were in my Documents folder and it's still working just fine. It will be interesting to try out sequencers again in this format - I don't have any in my inventory so I will need to find one I can buy to test out. About subraces, I am curious if anyone knows how they work. I'm not getting the subrace error anymore, as of starting Act 4, but my subrace attributes haven't kicked in, either. It's going to be a small issue when I get to higher levels (since I'm playing a wizard-multiclassing Air Genasi who will need the +2 racial intelligence bonus to cast 8th and 9th level spells!) but I'm hoping it will be resolved before then.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}