{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "012",
  "name": "Unravelling the World of NWN Traps: A Primer",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/unravelling-the-world-of-nwn-traps-a-primer-t2176824.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": "11",
  "views": "18.6K",
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:51 PM - Nov 27, 2011",
      "content": "<div><strong>Overview</strong><br/>\n<br/>\nScope of this guide is: Vanilla v1.69 rule set (unless otherwise noted).  It addresses the potential and limitations of detecting traps, controlling their effects and setting traps in PvM and PvP environments.  An brief glimpse of trap crafting has also been included as an adjunct to trapping skills.<br/>\n<br/>\nVeteran players will find much of this information rudimentary but it has been prepared to attend to a wide range of readers, so please bear with the presentation.  Hopefully, somewhere in this pile of facts and figures every player may learn a new tidbit.  Corrections, suggestions and/or additions by contributors will be duly credited.  My basic math skills are adequate on most days, but there is no guarantee this was compiled on one of those days. <br/>\n<br/>\n<span style=\"color:#FF00FF\"><strong><span style=\"font-size:100%;line-height:normal\">CONTENTS</span></strong> <br/>\n<br/>\nTHE BASICS: Skill Classes, DCs, Skills of the Trapper, \"Take 20\"<br/>\nSkill Level Build Targets<br/>\nActions vs. Stealth/Invisibility/Sanctuary<br/>\nPvM vs. PvP<br/>\nExploring the Limits of PvP Trapping<br/>\nClass-specific Trap Proficiency in PvP<br/>\nThe Fly In The Ointment<br/>\nTrapping Topics and Strategies </span><br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>THE BASICS</strong></span><br/>\n<br/>\n<strong>Skill Classes </strong><br/>\n<br/>\nPrimary:  rogue (all trap skills) <br/>\nSecondary:  assassin (all trap skills), ranger (Search and Set Trap only)<br/>\nTertiary:  red dragon disciple (Search only), shadowdancer (Search only) <br/>\n<br/>\nAll other classes are limited to cross-classing the main trap-related skills.  Maximum achievable levels for \"other\" classes are limited to approximately 40-50 ranks with investment in Skill Foci and applicable abilities (21 base + 13 foci + DEX/INT ability modifier).   Epic traps require 45 modified ranks (65 base - Take20) to set them and 48 modified ranks (58 + 10 recover - Take20) to recover them once they have been detected (See details of Search).  <strong>Recovery is the only method available for non-rogues to dispose of a trap with disarm DC over 35.</strong><br/>\n <br/>\nSkill enhancement classes:  cleric (Divine Trickery), bard (Bard Song)<br/>\n<br/>\nThe cleric Trickery Domain can enhance the Search and Disable Trap skills (+20, max.).  <br/>\nThe bard song can enhance Search, Disable Trap and Set Trap skills (+19, max.).<br/>\n<br/>\nNote:  Craft Trap, a universal class skill, is considered a non-essential skill for an aspiring trapper within this context.<br/>\n<br/>\n<strong>DCs</strong><br/>\n<br/>\nTo get a glimpse of the default DCs for traps used in NWN, either reference the <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Set_trap#Notes\" rel=\"noreferrer\" target=\"_blank\">handy table found in the NWN Wiki</a> or pull up your current version of traps.2da to determine the applicable DC so you can estimate the minimum skill level your toon will need to handle each type and version.<br/>\n<br/>\nThere are 4 categories of DC for each trap.<br/>\n<br/>\nFirst is the Save DC (if applicable... not all traps allow a save!).  Generally, the save DC will increase gradually with the strength of the trap but there are exceptions like Spike traps.  All classes and levels of characters are subject to the Save DCs.  Reflex is the most common type among traps.  Perhaps coincidently, trap evasion feats address the reflex type saves but ignore all others.   Holy traps are the single exception that allows no saves.<br/>\n<br/>\nNext is the Detect DC.  The Search skill is checked against this DC.  All classes and levels of characters are subject to the Detect DCs. (See details of Search)<br/>\n<br/>\nThird is the Disarm DC against which the Disable Trap skill is checked.  (DC subcategories based on the Disarm DC are detailed in the the Disable Trap skill section.)  Only those characters with training in Disable Trap skill need be concerned with Disarm DCs.<br/>\n<br/>\nFinally, the fourth category, Set DC, checks the Set Trap skill to determine if the trap will set successfully, fail or explode (during combat only).  Only those characters with training in Set Trap skill need be directly concerned with Set DCs (Disarmers may find it useful to know the Set Trap skill level of the original trap setter).<br/>\n<br/>\n<strong>Skills of the Trapper</strong><br/>\n<br/>\nSearch  <br/>\n• No training needed (i.e. no ranks need to be selected during creation or level-up to gain proficiency).<br/>\n• Proficiency increased by INT modifier, Skill Focus, Epic Skill Focus, Cleric Trickery Domain &amp; Bard Song (lvl 6, min.).<br/>\n• d20 dice roll every 6 secs (1x/round) or every 3 secs (2x/round) during active detect mode.<br/>\n• Effective detect radius is 3 meters, 6 meters during active detect mode.<br/>\n• Only rogues can detect a trap with DC higher than 35 (i.e. certain non-epic traps, epic traps and those set by PCs with<br/>\n an elevated Set Trap skill).<br/>\n• Elves and dwarves are granted a racial bonus to Search.<br/>\n<br/>\nExample #1:<br/>\nA default deadly gas trap has been placed in the nearby area by the designer.  For a human to spot it quickly, a modified Search skill of 21 is required (Detect DC 22 - 1 = 21).  To spot it eventually, a modified Search skill of only 2 is required (Detect DC 22 - 20 = 2).  <br/>\n<br/>\nExample #2:<br/>\nA level 40 fighter with 12 DEX who has gained some proficiency setting traps by cross-classing the skill to 21 (but without any Disable Trap training), buys a Minor Fire Trap and a potion of Cat's Grace.  After removing his heavy armor &amp; downing the potion, he sets the trap and waits.  Only rogues will be able to detect his fire trap.  Detect DC = 14 + skill (21 + 1 base DEX + 1-2 DEX, Cat's potion) = 37-38<br/>\n<br/>\nDisable Trap<br/>\n• Training required (i.e. at least 1 rank needs to be selected during creation or level-up to gain proficiency).<br/>\n• Proficiency increased by INT modifier, Skill Focus, Epic Skill Focus, Cleric Trickery Domain &amp; Bard Song (lvl 6, min.).<br/>\n• Once a trap is located, there are optional actions available, each with its own DC based on the Disarm DC.  <br/>\n- - - - - Assess (Disarm DC - 7)  <br/>\n- - - - - Flag (Disarm DC - 5) <br/>\n- - - - - Disarm (Disarm DC) <br/>\n- - - - - Recover (Disarm DC + 10)<br/>\n• +2 synergy with 5 allocated ranks of Set Trap skill<br/>\n• Take 20 automatically adds 20 to the skill check but does not count against the skill cap (non-combat only).<br/>\n<br/>\nSet Trap<br/>\n• Training required (i.e. at least 1 rank needs to be selected during creation or level-up to gain proficiency).<br/>\n• Proficiency increased by DEX modifier, Skill Focus, Epic Skill Focus &amp; Bard Song (lvl 6, min.).<br/>\n• +2 synergy with 5 allocated ranks of Disable Trap skill<br/>\n• Take 20 automatically adds 20 to the skill check but does not count against the skill cap (non-combat only).<br/>\n• The skill level influences the resultant DC to detect and disarm it<br/>\n<br/>\nCraft Trap<br/>\n• No training needed (i.e. no ranks need to be selected during creation or level-up to gain proficiency).<br/>\n• Proficiency increased by INT modifier, Skill Focus, Epic Skill Focus &amp; Bard Song (lvl 6, min.).<br/>\n• Uses standard d20 skill check dice roll (unlike the Take 20 for Disable Trap and Set Trap).<br/>\n• Neither Acid Blob (acid dmg + paralysis) nor any Epic traps can be crafted.<br/>\n• Crafting DCs are the same as the DCs for Set Trap except Strong Gas Trap is DC 40 (rather than 45).<br/>\n• Craft Trap is the only crafting skill/feat that does not require gold... only the innate cost of the components if they cannot be found in-game.<br/>\n<br/>\nComponent Tags (for training purposes only)<br/>\n<br/>\nnw_it_msmlmisc11 - - - Quartz Crystal <br/>\nnw_it_msmlmisc13 - - - Skeleton's Knuckle <br/>\nx1_wmgrenade001 - - - Acid Flask <br/>\nx1_wmgrenade002 - - - Alchemist’s Fire <br/>\nx1_wmgrenade003 - - - Caltrops <br/>\nx1_wmgrenade004 - - - Choking Powder <br/>\nx1_wmgrenade005 - - - Holy Water <br/>\nx1_wmgrenade006 - - - Tanglefoot Bag <br/>\nx1_wmgrenade007 - - - Thunderstone <br/>\nx1_it_msmlmisc01 - - - Coldstone <br/>\n<br/>\n<strong>\"Take 20\" (Disable Trap, Set Trap)</strong><br/>\n<br/>\nA significant trap management proficiency can be achieved with minimal skill investment with the application of Take 20, a \"free\" skill bonus for all classes to utilize that bypasses the standard skill check dice roll.<br/>\n<br/>\nEspecially useful for classes forced to cross-class trap skills (i.e. all classes except rogue &amp; assassin), 1 rank (2 skill points) invested in Set Trap will allow that character, at minimum, to set all traps of DC 21 or lower.  The native DEX level of the trap setter will also impact the effectiveness, raising or lowering that potential.  So, for example,  Minor Electrical/Fire and Average Sonic/Holy traps can be set with a single \"training\" rank.<br/>\n<br/>\nIn the same respect, 2 ranks (4 skill points) invested in Disable Trap will allow that character to disarm at least several versions (even some Strong ones!).  Note: A single rank will provide a similar level of proficiency if the synergy is in effect.  The native INT level will also impact the effectiveness.<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>Skill Level Build Targets</strong></span><br/>\n<br/>\n<strong>Search</strong><br/>\n<br/>\nModified skill ranks needed to:<br/>\n<br/>\nDETECT non-epic traps, all classes<br/>\nEventual: 22 - 20 = 2 <br/>\nImmediate: 22 - 1 = 21 <br/>\n<br/>\nDETECT epic traps, rogue only<br/>\nEventual: 43 - 20 = 23 <br/>\nImmediate: 43 - 1 = 42 <br/>\n<br/>\n<strong>Disable Trap</strong> <span style=\"color:#008080\">(See Notes 1 &amp; 2)</span><br/>\n<br/>\nModified Skill Ranks Needed To:<br/>\n<br/>\nASSESS non-epic traps, all classes<br/>\n36 - 7 - 20 = 9 (7 w/synergy); XCL<br/>\n<br/>\nASSESS epic traps, all classes<br/>\n58 - 7 - 20 = 31 (29 w/synergy); XCL<br/>\n<br/>\nFLAG non-epic traps, all classes<br/>\n36 - 5 - 20 = 11 (9 w/synergy); XCL<br/>\n<br/>\nFLAG epic traps, all classes<br/>\n58 - 5 - 20 = 33 (31 w/synergy); XCL<br/>\n<br/>\nDISARM traps DC &lt; 36, all classes <span style=\"color:#008080\">(See Note 3)</span><br/>\n31 - 20 = 11 (9 w/synergy); XCL<br/>\n<br/>\nDISARM traps DC 36, rogue only<br/>\n36 - 20 = 16 (14 w/synergy)<br/>\n<br/>\nDISARM traps, epic, rogue only<br/>\n58 - 20 = 38 (36 w/synergy)<br/>\n<br/>\nRECOVER traps DC &lt; 36, all classes <span style=\"color:#008080\">(See Note 3)</span><br/>\n31 + 10 - 20 = 21 (19 w/synergy); XCL<br/>\n<br/>\nRECOVER traps DC 36, all classes <br/>\n36 + 10 - 20 = 26 (24 w/synergy); XCL<br/>\n<br/>\nRECOVER traps, epic, all classes <br/>\n58 + 10 - 20 = 48 (46 w/synergy); XCL, only w/foci &amp; modified INT &gt;/= 34 <span style=\"color:#008080\">(See Note 4)</span><br/>\n<br/>\n<strong>Set Trap</strong><br/>\n<br/>\nModified Skill Ranks Needed To:<br/>\n<br/>\nSET non-epic traps (except gas)<br/>\n35 - 20 = 15 (13 w/synergy); XCL<br/>\n<br/>\nSET gas traps<br/>\n45 - 20 = 25 (23 w/synergy); XCL<br/>\n<br/>\nSET epic traps<br/>\n65 - 20 = 45 (43 w/synergy); XCL, only w/foci &amp; modified DEX &gt;/= 28<br/>\n<br/>\n<span style=\"color:#008080\">Notes (Skill Level Build Targets):<br/>\n<br/>\n1. \"XCL\" means: \"Skill level achievable by cross-classing\"<br/>\n<br/>\n2.  The term \"non-epic\" means: all versions of traps other than epic ones (i.e. minor, average, strong &amp; deadly).<br/>\n<br/>\n3.  Since the highest possible disarm DC within the 1-35 range for vanilla traps is 31, only that DC need be considered. <br/>\n<br/>\n4.  For non-rogue classes: although it IS theoretically possible to succeed in the DC check to recover an epic trap, in vanilla it is NOT possible to detect it. <br/>\n</span><br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>Trapping Actions vs. Stealth/Invisibility/Sanctuary</strong></span><br/>\n<br/>\nDisable Trap:  All actions (Assess, Flag, Disarm, Recover) can be completed while in stealth mode, invisible or in sanctuary without cancelling any of those effects.<br/>\n<br/>\nSet Trap:  As the trap setting completes (with an audible confirmation \"click\") any of the above-mentioned hiding effects immediately end.  The concealment granted by Improved Invisibility persists although the invisibility effect itself cancels.  Although setting the trap is treated as a hostile action when it evaluates hiding effects, an unlimited number of traps can be set in close proximity to any neutral NPC without altering the reputation of the trap setter or changing the faction of the NPC.  See the Strategy section for a related exploit description.<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>PvM vs. PvP</strong></span><br/>\n<br/>\nBecause traps can be easily customized by a designer, predicting static DCs can be problematic in some environments.  However, dynamic DCs (those set by a PC) commonly range far higher, since even if static traps have been increased by the designer, they will never approach the resultant DC of a skilled trap setter.  <br/>\n<br/>\nStatic DC vs. Dynamic DC, an example:<br/>\n<br/>\nA designer places a customized Minor Electrical trap with a Disarm DC of 35 (default + 9).  In a nearby area, a PC with DEX 18 and 6 ranks in Set Trap successfully places a Minor Electrical trap.  PC to set it:  6, base +  4, DEX + Take 20 vs. DC 20.  Resultant Disarm DC:  26, base DC + skill (6,base + 4,DEX) = 36.  Therefore, the version the designer placed can be detected and disarmed by all classes with adequate skill.  The version set by the PC can be detected by any class but disarmed only by a rogue even though they both assess as the same trap.  However, with high enough Disable Trap skill, other classes can still recover the PC version.<br/>\n<br/>\nIf you suspect an environment may have customized the trap DCs, keep checking your game log.  In many cases, there may have been a consistent bias applied to the default DCs.  In those cases, simply determine the offset (or percentage) adjustment and allocate more or fewer trap skill points accordingly.   Sometimes, only certain areas of an environment have been modified, so keep on your toes and stash a few extra skill points just in case the DC convention changes.<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>Exploring the Limits of PvP Trapping</strong></span><br/>\n<br/>\nIn practice, a proficient trap setter can set traps that are impossible to disarm by even the most proficient rogue disarmer (or any multiclass combo, for that matter).  <br/>\n<br/>\nWith exalted DEX, skill foci, maxed skill ranks and capped skill boost via items, Disarm DCs will reach levels over 180.  Disable Trap/Disarm maximum skill check with Take 20 will never even reach 150, therefore the trap setter will always hold an advantage in PvP.   Be aware that both the cleric Divine Trickery and Bard Song skill boosts count towards the +50 skill cap so, in high-magic environments where caps are easy to reach, the trap handling benefit of multiclassing to either of these classes is negated. <br/>\n<br/>\nSample calculation:<br/>\n<br/>\nSet Trap, Halfling or Elf <br/>\n43 (maxed Set Trap) + 13 (skill foci)+ 13 (DEX 36) +2 (synergy) + 6 (ability cap) + 50 (skill cap) = 127<br/>\n<br/>\nFor epic traps, disarm DC = 58  + 127 = 185 (TRUE value)<br/>\n<br/>\nDisarm (of Disable Trap)<br/>\n43 (maxed Disable Trap) + 13 (skill foci)+ 12 (INT 34) + 2 (synergy) + 6(ability cap) + 50 (skill cap) = 126<br/>\nDisarm attempt = 126 + Take 20 = 146 skill check vs. 185 DC<br/>\n<br/>\nException:  A skill level of 127 can be reached with either a rogue/RDD or assassin/RDD.  That possibility has been ignored in the prior calculation due to the dubious feasibility of such a build (a bard or sorc max INT build).<br/>\n<br/>\nIn the game log, the actual DC for values over 127 are displayed as a regression.  However, the actual in-game skill check uses the TRUE value established by the trap setting procedure (Disarm DC + Set Trap skill level).<br/>\n<br/>\nSo, for example, using the epic DC limit calculated above, a DC of 185 would be displayed on the screen as 57 and the skill for the disarm attempt (using the maxed Disable skill from above) would be: 20 + 126 vs. DC 57 (The game uses the value zero to hold one of the DC values, so a DC of 128 would be displayed as 0 on the screen.) and the disarm attempt would fail.<br/>\n<br/>\nTrap Trivia: Lowest Disarm DC Possible for PC-set Epic trap: 45 + 58 = DC 103 (PC to set: 45 + Take20)<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>Class-specific Trap Proficiency in PvP</strong></span><br/>\n<br/>\nAny class can set a trap impossible to disarm by any character except rogue<br/>\n<br/>\nExample:<br/>\n<br/>\nA Level 17 pure barbarian, DEX 14/INT 10 with 5 ranks in Disable Trap and 10 ranks in Set Trap sets a Minor Frost trap (default disarm DC 22).  Now, only a rogue can disarm it.<br/>\n  <br/>\nTo set trap, DC 15: 10 + 2,DEX + 2,synergy + Take20 = 34 skill check. <br/>\nThe resultant Disarm DC: 22 + 14 = 36.  <br/>\n<br/>\nIn addition, this same barb can disarm all vanilla (PvM) traps with DC of 27 or lower.<br/>\n<br/>\nAny class can set a trap impossible to detect by any character except rogue<br/>\n<br/>\nExample:<br/>\n<br/>\nA Level 40 pure barbarian, DEX 10/INT 14 with maxed Set Trap skill (21 ranks), 11 ranks in Disable Trap and <br/>\nSkill Focus: Set Trap sets a Minor Frost trap (default disarm DC 22).  <br/>\nNow, only a rogue can detect it.<br/>\n<br/>\nDetect DC, Minor Frost = 10 + skill (21 + 2,synergy + 3,SkF:Set Trap) = 36.<br/>\n<br/>\nIn addition, this same barb can disarm all vanilla (PvM) traps with DC of 35 or lower<br/>\n(11 + 2,INT + 2,synergy + Take20). <br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>The Fly In The Ointment: Find Traps</strong></span>  <br/>\n<br/>\nIn vanilla NWN, Find Traps will locate and disarm all traps within a 10-meter radius around the caster regardless of the trap disarm DC.  (Testing assures that at least a disarm DC of 125 will be disarmed per this spell so I am intentionally making the extrapolation that there is no DC limitation at all.)  Traps flagged as plot are immune to Find Traps.<br/>\n<br/>\nWhat this implies is that any low-level caster that has access to either the spell in the spellbook or a scroll (or other spell-casting item like Lens of Detection) can disarm all traps, including epic ones, regardless of the skill of the trap setter who set it.  UMD users are also afforded the same ability since the caster level of the spell (per scroll or other item) has no effect on its effectiveness to disarm the most powerful traps with the highest DCs.<br/>\n<br/>\nFor this reason, Find Traps has been nerfed on PvP servers that have recognized how unbalancing it is for aspiring trap specialists.  Essentially, it biases the game in favor of all classes that have access to the spell while neutralizing the proficiency of a trapper... so accordingly, on servers attempting to rebalance the spell, the effect of Find Traps has been limited to only locating traps in an area around the caster... like an auto-success Search check.<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>Trapping Topics and Strategies</strong></span><br/>\n<br/>\n<strong>The Wizard &amp; Familiar</strong><br/>\n<br/>\nA bit odd that a topic like this would appear in a guide dedicated to trapping skills?  Perhaps, but consider the source. <br/>\n<br/>\nAs beneficial as a pixie is to have around, many of its skills can be easily replaced with a few cross-classed skill allocations to the trap skills.  Even without Find Traps spell, a wizard can disarm and/or recover most traps.  Trap setting is a significant boost to the already-vast repertoire of the arcanist.  A sorcerer can also benefit from allocating a few points into trapping skills but it is much easier managed by an arcanist spellcaster based on INT, the main skill point-enhancing ability.  Sorcerers seldom set base INT higher than 14 (per Expertise) so skill points can become strained too much to diversify into trapping.<br/>\n<br/>\nWhat this tactic does is open up other possibilities for familiars without losing trap management potential.  Something to think about for those of you wizards tired of listening to that constant twinkling sound and the cutesy-wootsey pixie jargon.<br/>\n<br/>\n<strong>Killing Field</strong><br/>\n<br/>\nSetting a dense field of traps is one of the most effective and potentially game-unbalanced methods of controlling mobs and bosses.  There are a few tenets to make the strategy even more effective.  <br/>\n<br/>\n1.  Stack traps.  Create multiple-trigger zones that will queue several damage effects in a short period of time.  In this example of a stacked configuration...<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i1132.photobucket.com/albums/m573/HipMaestro/trapstack.png\"/><br/>\n<br/>\n...notice that the lightest green areas contain 4 separate triggers, the semi-light green areas 2 triggers and the standard green (in the far corners), a single trigger.<br/>\n<br/>\n2. Keep the enemy moving.  Avoid using traps that paralyze or stun or any spell effect that holds hostiles in one place like Blindness or Darkness.  Use those for controlling flanking positions to prevent enemies from approaching by undesirable routes.  Killing fields work most efficiently against tightly packed mobs.<br/>\n<br/>\n3. Diversify.  Use traps of mixed save types.  Most traps allow REFLEX saves, but a few focus on FORTITUDE (like Frost traps) or WILL (sonic).  Naturally, if you are aware of resistance or immunities of the intended enemies, you would bias your selection based on those factors.<br/>\n<br/>\n4. Beware of the limitations of REFLEX traps.  Reflex feats (i.e. Uncanny Dodge, Evasion, etc) will practically neutralize the damage from traps with that category save.  In those cases, Tangle reflex traps are the best value since the slow effect is unaffected.<br/>\n<br/>\n5.  Kite.  IMHO the best trapper is a ranged attacker, including a ranged spellcaster.  Mobs will characteristically rush to close the large space between the range attacker and themselves and in so doing fall prey to the full effect of the killing field.   <br/>\n<br/>\nThis is also effective in PvP against speedy foes (like hasted monks) who will miss the Search checks until they are in the middle of the field when it is too late to back out, that is if they even have the ability to detect the traps in the first place (i.e. non-rogue monk build).<br/>\n<br/>\n6.  Preemptive defense.  Upon entering a new area IMMEDIATELY set up a killing field.  It creates a safe-zone for any toon (&amp; party) where it will be assured to be able to control mobs of attackers that may be in close proximity but just outside of the current perception range.  In environments where hostiles have been scripted to pursue PCs THROUGH transition areas, place a killing field near the transition on the entry side to trap foes as they attempt to pursue through the transition.<br/>\n<br/>\n7.  Temporary trap kit caches.  Killing fields can serve as a holding place for untriggered preset trap kits until leaving the area.  But be wary of auto-respawns randomly tripping traps you may have wanted to save for later use when your PC has moved well outside that zone.  Also, skilled disarmers may decide to help themselves to the handy cache when you are out exploring elswehere.   It can become an expensive habit!  <br/>\n<br/>\n<strong>Turncoat Exploit </strong><br/>\n<br/>\nIn those situations where a convo (or specific action) could change the faction of an NPC and even others in the nearby proximity, preset traps prior to the convo.  Set a killing field right up to the feet of the neutral NPC.  In those cases where the NPC is set to move to PC, the trap field will need to be set outside of the perception range of the NPC, then allow them to move into it.  If the NPC remains neutral, either recover the traps or leave them there as a temporary cache (lugging trap kits can become a heavy job).<br/>\n<br/>\nTypically, this exploit would exemplify an evil or traitorous action, so use at your own discretion.<br/>\n <br/>\n<strong>Demilich Taming</strong><br/>\n<br/>\nThe demilich is one of toughest foes for most classes.  But with some degree of trap-setting skill, a breeze.  <br/>\n<br/>\nBy creating a killing field specifically designed to eliminate undead, a demilich can be easily destroyed in a round or 2 without placing the PC in jeopardy.  Personally, I prefer to stack 3 or 4 Deadly Holy traps (no save) in a tight zone, with 2 Deadly Tangle (reflex) on the leading field border where the enemy is expected to enter.  Either take a few swats at the floating head in melee range or shoot a few range shots (range spells won't work), then gradually retreat behind the field.<br/>\n<br/>\nIn general, any version Holy trap, stacked, is excellent against undead.  Double the stack for non-undead due to the reduced damage factor.<br/>\n<br/>\n<strong>Skill Mastery vs. True Seers in Tight Quarters</strong><br/>\n<br/>\nAgainst True Seers it is difficult to approach foes without being spotted and become engaged in combat.  Being thrust into a small, confined areas with several foes is an even tougher situation for a trapper. Skill Mastery provides the ability to set traps with a Take 20 in combat mode so there is always a guarantee of Set Trap success.<br/>\n<br/>\nTested against a mob of various color ancient dragons in a square room with no escape (2 of them I made with a permahasted skin just for a hoot ).  Upon perception and attack, set a Deadly Tangle, retreated and set 2 more (Tangle traps seem to work better than Sonic traps against dragons).  Then began setting as many Holy traps as possible alternating occasionally with another Deadly Tangle if they begin to flank always backing away from the onslaught  (very tough in enclosed areas).<br/>\n<br/>\nFor these kinds of battles, dexers work best and in general, the best combat trappers are always dexers with Epic Dodge and some concealment (Improved Invisibility or Self-Concealment).<br/>\n<br/>\n<strong>Traps are True Seeing</strong><br/>\n<br/>\nIf your toon has no access to spells or items that reveal hidden, invisible foes or those in sanctuary, set a field of any version Holy trap.  The enemy's position will be revealed.  <br/>\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - -<br/>\nHip's favorite trapper:  Naked Rogue/Wizard/Palemaster slinger<br/>\n<br/>\n<span style=\"font-size:200%;line-height:normal\">Have fun, fellow trapmasters!!</span></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:44 AM - Feb 12, 2016",
      "content": "<div><span style=\"font-size:150%;line-height:normal\"><strong>Example of Vertical Stacking<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i1132.photobucket.com/albums/m573/HipMaestro/trap-stacking_zpshz8nys0b.png\"/></strong></span><br/>\n<br/>\n<strong>Single Player</strong> needs no special technique to accomplish this since the pausing of the trap queue allows veritably an infinite number of traps to be stacked one-on-top-of-another at just about any distance from the trapsetter.  Notice how bright green the first stack of about 6 traps appears in the photo.  The thicker the stack, the brighter the green tint appears (and also notice how one trap was set slightly to the right of the original target icon).  The toon has begun setting an overlapping vertical stack next to the first stack after walking far away on the screen and repeating the movement limitation technique a new stack without pausing the game (simulating an on-line situation).<br/>\n<br/>\n<strong>Server play </strong>is another matter, however, and takes practice and coordination to stack many.  By lowering movement speed as much as possible, the trapper will have sufficient time to queue several traps at the same x-y coordinate. Here are a few pointers to accomplish that: <ul><li>Remove all haste gear or dispel any haste spell currently effecting the trapper.</li> <li>Keep several pieces of mundane heavy armor in a magic bag to extract when encumbrance is what you need.</li> <li>Use a single page of inventory to display the trap kits planned for use.  I recommend at least 10.  (If you are very quick and precise, 10 is about the max that can be stacked.)</li> <li>Trigger Stealth mode.  (Stealth will only break when the first trap is set.)</li> <li>Trigger Detect mode.  (This step will not work for elven trappers.)</li> <li>Adjust the camera angle to locate a spot as far away on the screen as possible.  This will be your x-y target where all traps will stack.</li> <li>With the inventory open, activate trap setting for a trap in a corner of the page and then quickly target the spot you want.  Use whatever sequence is most comfortable.  Left-right. Top-bottom.  Whatever works for you.</li> <li>Once the first target icon begins to pulse, the clock is ticking so keep queuing the trap setting on each trap AT THE SAME ICON LOCATION until the trapper slowly reaches the destination and then stop trying to set new ones else you might cancel the entire queue.</li> </ul>\n If you are very accurate (that's not me, for certain), a single bright green square the size of a single trap will result.  If you are off slightly, it doesn't matter that much.  The difference in trigger times will be so slight and results must register in the same round anyway.  Hasted creatures entering the trigger area tend to trigger everything in a wider spacing faster than non-hasted ones.<br/>\n<br/>\n About a half-dozen traps are relatively easy to stack this way.  Larger maps provide opportunity to increase the thickness, smaller maps reduce it.<br/>\n<br/>\nImplications of Vertical Stacking<br/>\n First off, several Minor traps will seldom do the same damage of a single Strong or Deadly because the DC is too pedestrian.  Yes, you will get a roll on each Minor trigger but it can be tough to get high damage using this technique unless EXTREMELY lucky.<br/>\n<br/>\n Next, vertical stacks of identical traps waste the special effects, like stun.  Special effects do not stack.  This is a great reason to mix up trap types and save types, Fort/Reflex/Will and maybe throw a no-save Holy into the mix, undead targets around or not.<br/>\n<br/>\n Finally, it is harder to conserve traps using this method.  When a creature (or a tight group of them) triggers a vertical stack, every trigger is rolled essentially simultaneously.  If you were to stack say, 10 deadly fire traps and killed a trespasser, did you REALLY need that many to trigger at once?  By spreading triggers out slightly, perhaps a few thin vertical stacks side by side, you can kill and still have a chance to recover some of the untriggered ones.  If the environment is flush with gold, naturally, economics won't enter the equation.  But in MOST challenging worlds, traps are not just passed out like compliments.  If your trapper's inventory is comprised mainly of recovered traps, you will appreciate the economy of choosing a precise number of traps to design a cost-effective field and which pattern is most efficient.<br/>\n<br/>\n<br/>\n  </div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:09 AM - Dec 13, 2019",
      "content": "<div>I've been learning about trapping and realised I missed Hip's section on vertical stacking, which BlackCobra showed me how to do it in a server environment, which is very handy when you have a whole bunch of weak traps in your inventory.<br/>\n<br/>\nI thought I'd put up a few screenshots of how to do it.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201912/10759084_cd3df63c814f384b8e493a92d7c2bd28_t.jpg\"/><br/>\nStep 1: place multiple traps in your inventory. Move yourself a reasonable distance away from the traps. Slow down your movement speed. Here I have used stealth to slow down movement speed. Then set as many traps as you need in the location you want. Right click the trap then bottom right (numpad 3). <br/>\n<br/>\nI didn't want to stack more than 5-6 traps, but if you wanted to stack more then stealth+detect+encumbrance will assist<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201912/10759084_fbdf7eb2340bcae035f5aa8beeac5840_t.jpg\"/><br/>\nStep 2: here a bed of traps has been set<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201912/10759084_4fcc65194ed074c6b1f5ca290c9b6f2f_t.jpg\"/><br/>\nStep 3: let the floodgates through into your bed of traps <br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201912/10759084_62663135a4356fa5c8f9e48ad7e27f46_t.jpg\"/>Comment: the traps in this situation were very weak but I managed to take out a few with the traps. The rest I had to rely on my own prowess and other abilities by fighting at the choke point. I did find these guys tough at the level I am at. If I had stronger traps I'm sure I would have done better. Perhaps a tangle trap or two. There are better trappers than me who are active in the forum, I'm still learning all this stuff. I'm sure they might have some valuable comments to make.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:39 AM - Dec 13, 2019",
      "content": "<div>Fantastic Guide!<br/>\n<br/>\nJust one little annoyance - please change the text from blue at the top to like, green (or fuchsia, or something else).<br/>\n<br/>\nIt kills my eyes.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:17 PM - Dec 13, 2019",
      "content": "<div>How's pink for you, Web?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "12:51 PM - Dec 13, 2019",
      "content": "<div><blockquote><div><cite>Orion2019 wrote: <div class=\"responsive-hide\">Dec 13, 2019</div></cite> I managed to take out a few with the traps. The rest I had to rely on my own prowess and other abilities by fighting at the choke point.</div></blockquote>\nIf I have 1 -2 large critters I'm after I'll stack em like you did, but if I dont want to waste traps, a green stripe works better as they trigger one trap at a time.  Or place a stack at the door then a stripe from the door so they get a large initial burst then one trap at a time until they perish.<br/>\n<br/>\n3 fire giants and 2 ogres in a hall in UM have fallen to this more times then I can count..  and pushed many a 2nd level toon to level 8 in the process.   hehe... of course this may be why one of the giants was changed to an adept from a warrior....  <br/>\n<br/>\nAnd obviously it goes without saying... if you use an area affect trap... its best to not be in the area   :)</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:11 PM - Dec 13, 2019",
      "content": "<div>My thanks for changing the color.<br/>\n<br/>\nThat sort of blue just weirds my eyes out, and everything goes blurry.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:26 PM - Dec 13, 2019",
      "content": "<div>Brandy does that to me.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:40 PM - Dec 13, 2019",
      "content": "<div>Yeah, like that! :D</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:30 PM - Dec 13, 2019",
      "content": "<div><blockquote><div><cite>conlaoch wrote: <div class=\"responsive-hide\">Dec 13, 2019</div></cite>If I have 1 -2 large critters I'm after I'll stack em like you did, but if I dont want to waste traps, a green stripe works better as they trigger one trap at a time.  Or place a stack at the door then a stripe from the door so they get a large initial burst then one trap at a time until they perish.</div></blockquote>\nThis works well unless they can heal themselves. It is rather frustrating to see a creature down to to \"near death\" after stepping on your trap, only to heal up before continuing down the \"green stripe\".</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "3:14 PM - Dec 13, 2019",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote: <div class=\"responsive-hide\">Dec 13, 2019</div></cite><span style=\"font-size:75%;line-height:normal\">orks well unless they can heal themselves. It is rather frustrating to see a creature down to to \"near death\" after stepping on your trap, only to heal up before continuing down the \"green stripe\".</span></div></blockquote>\nYeah.. have had that happen once or twice.  and your right.. its annoying</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "6:42 PM - Dec 13, 2019",
      "content": "<div>Glad to read all of your discussions, its very enlightening and has improved my gameplay.<br/>\n<br/>\nHalf of that mob were clerics who could heal themselves, so by pure luck I actually did the right thing by stacking the traps.<br/>\n<br/>\nI must admit I could have focused on stacking the damage traps in a few areas, and spreading out the stun traps (ie sonic / frost etc) at the choke point where I wanted to fight, I think in retrospect that would have been better, but being a fighter and cleric mob, I dont think I actually had any stun traps which targeted the reflex save.</div>"
    }
  ]
}