{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Preepic - Level 20 Builds",
  "forum_id": "004",
  "id": "000",
  "name": "Divine Bomber: Bard8/ AA9/ BG3",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/divine-bomber-bard8-aa9-bg3-t2350273.html",
  "author": "Noctem",
  "avatar": "10235235_1549015559.jpg",
  "replies": 23,
  "posts": [
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:03 PM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">This keen archer pierces stoneskins and premonition even with a mundane bow, and can land 6 heavy-damage missiles each round. Few, if any can resist the divine loaded missiles.<br/>\n<br/>\nBard(8), Arcane Archer(9), Blackguard(3)<br/>\nElf: Neutral evil or chaotic evil alignment<br/>\nPvM 1-20, PvP 18-20<br/>\n<br/>\nSTR: 13<br/>\nDEX: 16<br/>\nCON: 8<br/>\nWIS: 8<br/>\nINT: 12<br/>\nCHA: 17 (22)<br/>\n<br/>\n01: Bard(1): Point Blank Shot<br/>\n02: Bard(2)<br/>\n03: Bard(3): Rapid Shot<br/>\n04: Bard(4): CHA+1, (CHA=18)<br/>\n05: Bard(5)<br/>\n06: Bard(6): Weapon Focus: Longbow<br/>\n07: Bard(7)<br/>\n08: Bard(8): CHA+1, (CHA=19)<br/>\n09: Arcane Archer(1): Blind Fight<br/>\n10: Arcane Archer(2)<br/>\n11: Arcane Archer(3)<br/>\n12: Arcane Archer(4): CHA+1, Power Attack, (CHA=20)<br/>\n13: Arcane Archer(5)<br/>\n14: Arcane Archer(6)<br/>\n15: Arcane Archer(7): Cleave<br/>\n16: Blackguard(1): CHA+1, (CHA=21)<br/>\n17: Blackguard(2):<br/>\n18: Blackguard(3): Divine Might<br/>\n19: Arcane Archer(8)<br/>\n20: Arcane Archer(9): CHA+1, (CHA=22)<br/>\n<br/>\nHitpoints: 130<br/>\nSaving Throws (Fortitude/Will/Reflex): 16/15/22<br/>\nSaving Throw bonuses: Spells: +2, Mind Effects: +2<br/>\n<br/>\nBAB: 18<br/>\nAB (mundane longbow): +27<br/>\n<span style=\"color:#000000\">AB, melee: +19</span><br/>\nAB buffs: Bard song +2, Cat's grace +2<br/>\nEnchant Arrow V: pierces stoneskins and premonition<br/>\n6 attacks per round with Rapid Shot and Haste<br/>\n<br/>\nDamage self buffed: 17-29.<br/>\nDamage with capped strength and charisma: 27- 34: Does 81-102 damage on a critical hit.<br/>\nBase damage longbow: 1-8. Enchant Arrow: 5. Mighty: 3-6 self buffed strength, 7 with capped strength. Divine Might: 6-8 self buffed charisma, 12 with capped charisma (Divine damage). Bard song: 2<br/>\n<br/>\nAC (naked/mundane armor): 15/21<br/>\nSpell Casting: Bard level3 spells. Bards can use all arcane scrolls.<br/>\nAlignment Changes: 0<br/>\n<br/>\nSkillpoints: 109<br/>\nHide 23(26), Move Silently 23(26), Perform 11(17), Spellcraft 9(10), Spot 22(23), Tumble 10(13), UMD 11(17)<br/>\n<br/>\n<br/>\n01: Hide(4), Move Silently(4), Spellcraft(4), Tumble(4), UMD(2), Save(2),<br/>\n02: Hide(1), Move Silently(1), Perform(3), Tumble(1), Save(1),<br/>\n03: Hide(1), Move Silently(1), Perform(3), Tumble(1),<br/>\n04: Tumble(1), UMD(4),<br/>\n05: Hide(1), Move Silently(1), Tumble(1), Save(2),<br/>\n06: Perform(2), Spellcraft(5),<br/>\n07: Tumble(2), Save(3),<br/>\n08: Perform(3), UMD(5),<br/>\n09: Spot(5),<br/>\n10: Spot(5),<br/>\n11: Hide(1), Move Silently(1), Spot(3),<br/>\n12: Hide(2), Move Silently(2), Spot(1),<br/>\n13: Hide(2), Move Silently(2), Spot(1),<br/>\n14: Hide(2), Move Silently(2), Spot(1),<br/>\n15: Hide(2), Move Silently(2), Spot(1),<br/>\n16: Save(3),<br/>\n17: Save(6),<br/>\n18: Save(9),<br/>\n19: Hide(5), Move Silently(5), Spot(4),<br/>\n20: Hide(2), Move Silently(2), Spot(1),<br/>\n<br/>\nStrengths:<br/>\nThis character can virtually bomb a target with divine loaded missiles. Enchant Arrow V gives a +5 enchantment, piercing stoneskins and premonition, which makes it a very quick mage-killer. The AB is quite good despite the modest dexterity, and can be buffed further.<br/>\nThe saves are very good.<br/>\nThe character has stealth for tactical positioning and can spot hiding creatures.<br/>\nBards can use all arcane scrolls.<br/>\n<br/>\nWeaknesses:<br/>\nThe AC is only medium and the hitpoints are low. The character is fragile early in its career. The Ghostly visage spell will help with survival once you get it. You can summon animals that can serve as meat-shields through your early levels. Don't be afraid to use scrolls and potions.<br/>\n<br/>\nItems:<br/>\nYou want items to help cap charisma at 34 (+12 froms items and eagle's splendor).<br/>\nYou want mighty bows to benefit from your stacking strength buffs.<br/>\n<br/>\nTweaks:<br/>\nSome may prefer to take the Listen skill instead of Spot. Amplify will give a nice boost to Listen. Clairaudience/clairvoyance will boost both Listen and Spot<br/>\nEdit 1: It is possible to take BG earlier and get Divine Might at level 12 or 15. To do that you have to delay Blind Fight and/or Rapid shot. The Enchant Arrow progression will also be temporarily stalled at EA I or II.<br/>\nEdit 2: Called Shot and Improved Critical Longbow are alternatives to Blind Fight. Called Shot will help making soloing a bit easier since you can use it to effectively slow down your target. Improved Critical makes you crit more often for more heavy damage. Blind Fight helps you hit concealed creatures and helps when blinded, in darkness or when fighting invisible creatures.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:55 PM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is an amazing piece of work Mick, truly optimized.<br/>\n<br/>\nA lvl 20 version of \"The Archer Laureate\", in these levels he will be devastating!<br/>\n<br/>\nClearly a weapon for the skillful though as with no DS or a battery of hp's he doesn't forgives mistakes in his play.<br/>\n<br/>\nI like him very much!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:30 AM - Feb 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The only thing I have to say about this build is that it's very good, but would be better with Called Shot. HOW do you get it in there, though? Blind Fight is the only one feat I can see you dropping, but even so, it's not such an easy decision... Improved Critical would be nice as well, but there just aren't enough feats.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:08 AM - Feb 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Cleave does not work for ranged weapons, so that's something that could be dropped.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:03 AM - Feb 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The build is feat starved:<br/>\nYou need PBS and WF for AA.<br/>\nYou need PA for DM and Cleave.<br/>\nYou need Cleave for BG.<br/>\nThat leaves 3 feat slots: <br/>\n1) Divine might is what this build is about<br/>\n2) Rapid shot <br/>\n3) Blind fight<br/>\n<br/>\nI can see why you want Called shot in, but that is only one of many means to survive as archer.<br/>\nAs far as I can see this character works best in a party or with a meatshield type henchman if single player.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:55 PM - Feb 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I agree, Mick, but you should leave that as a viable tweak for soloing in place of Blind Fight listed further down below.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:47 PM - Feb 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong>I agree, Mick, but you should leave that as a viable tweak for soloing...</div></blockquote>\nDone, just added it as a tweak.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:15 PM - Feb 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Mick Dagger wrote:</strong>Perform 11(17), UMD 11(17)</div></blockquote>\nIf anybody wonders why I let these skills end at 17 and not 15:  <br/>\n<br/>\n<details><summary>Spoiler</summary>At level 8 when I add the last ranks, Cha is 19 with a modifier of +4. At that time the modified ranks are 15 for both skills. Later charisma reaches 22 with a modifier of +6. But by spending these 4 skill points I let the character use the level 8 bard song and better magical equipment already at level 8 rather than waiting until level 20 when charisma maxes out.\n</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:36 PM - Feb 21, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hehe, <br/>\n<br/>\nHigh tech, skill maneuvering.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Jack Bauer",
      "avatar": "no_avatar.png",
      "timestamp": "3:39 AM - Sep 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Was wondering what this build would look like if taken to 30? Would possibly picking up one more bard class skill level to get curse song be worth it? Or should I funnel all the extra 10 points into AA? Sorry to bump an old thread.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:31 AM - Sep 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">We bump old topics all the time around here and I am one of the main offenders.  I'm not sure whether Mick would change pre-epic around knowing that there would be 10 epic levels to play with... but he might.<br/>\n<br/>\n I think you could do all you are considering plus perhaps even a bit more.  The only downside is that the build is so feat-starved due to all the no-bonus classes (well AA gets bonus... eventually), that you'll need to take those pre-epic feats after 20.  No way around it really.<br/>\n<br/>\n First, I'd continue to bump CHA.  That part is easy.<br/>\n<br/>\n What you could do is take 3 more bard levels at 24, 27 and 30 to get Curse Song (or Called Shot), Lingering Song (or ImpCrit) and Epic Prowess in whatever order you find of most benefit.  At Level 21 you could take a 4th level of BG to get Divine Shield and d6 sneak damage.  That leaves 6 more levels of AA.  AA 14 will give you a chance to take EWF and at AA15 you will be able to enchant arrows at +8.  That still won't penetrate Epic Warding but that feat shouldn't exist on a Level 30 server, unless they reduced the prereq to get it.   You'll also have access to Imp Invis for concealment along with a fortified bard song to help out with AC.<br/>\n<br/>\n Another alternative is to just ignore DivShld and Lingering song for Great CHA x2.  More damage.  Slight boost to saves.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:38 PM - Sep 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have not done this for level 30 yet. Maybe I will look into it. Pumping charisma is key. And I am not quite sure if there will be one or two more bard levels.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Jack Bauer",
      "avatar": "no_avatar.png",
      "timestamp": "10:48 AM - Oct 17, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am currently sitting 18, I have located a helmet that lets me cast divine shield on myself. So I was considering taking arcane archer 19(9) and skill dumping into hide / spot / move silently. Taking another point in black guard at 20(4) for the sneak attack, and another bard level at 21(8) for Curse Song / skill dump in Tumble. From there I assume I would continue taking arcane archer levels 22(10), 23(11), 24(12) to take Epic Prowess. Followed by AA 25(13) 26(14) Imp crit, 27(15) EWF, AA28(16), AA29(17) Bard(9) Skill dump in tumble and ??? Feat.<br/>\n<br/>\n Very sorry if this is hard to understand, I am leveling incredibly slow on my server and am trying to create my character perfectly and make him ideal for pvp. Given my low health I assume my best bet to survive will be to blow people down in a couple hits. Just trying to beat around what the final build should be, but I feel if I slim the bard levels as much as possible I'll have the best impact? I am really unsure, so that's why I came to the pros to try and add some insight to my terrible attempt to continue this build onto level 30. So I am sorry, please bare with me.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:53 AM - Oct 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You're right.  It is somewhat difficult to follow but no worries.  Let's work it through step-by-step...<br/>\n<br/>\n First off, I'm assuming this is not Arelith since your plan is apparently in conflict with the 3-class minimum by shrugging off BG3 at Level 18.  I think that would be a mistake even with the Divine Shield helmet.  Keep in mind that the main impetus of the build lies on DAMAGE, not AC, nor AB.  So, though more AC would certainly be a benefit, those precious Turn Undead attempts would be drained by using the shield instead of the might.  Divine Shield would be a luxury more than an optimization in this case. <br/>\n<br/>\n I see a lot of value in ImpCrit because, as is typical for AA's exalted AB, you'll be hitting a lot and the threat roll will almost certainly produce many opportunities for crits except against PMs and Shifter Undead shapes, of course.  A level 8 Curse Song would be mostly defensive (Bard 9 is the same song as Bard 8) and would force your toon into closer range (i.e. melee) in order to implement its benefit... which is fine for a PBS attack, but be advised that one of the key advantages of an AA is to eliminate all the counter attacks by pulling adversaries as your toon displaces.<br/>\n<br/>\n However, I am thinking Called Leg shots would perhaps be an even better fit for PvP unless the server has made a feat customization to prevent the 20% movement penalty or the arm's AB reduction vs. PCs.  It would also fall into the same category with the crit advantages in that the AA is one class that has enough of an AB to absorb the feat's attack penalty like a WM would have, perhaps even more so.<br/>\n<br/>\n Understand that any recommendation I offer evolves from the way I play all my AAs, predominantly artillery using summons to temporarily deflect and buy some time for more unabated hits.  For a PBS style, a different strategy applies since you'd need to play more defensively with the constant threat of opposed counter-attacks looming around you.  That's where the Divine Shield would come into play (and Curse Song to a lesser degree).<br/>\n<br/>\n So, in brief, in order to glean a last tumble dump, you could reach (again, assuming you didn't avoid the BG3 Divine Might during pre-epic) is Brd9/BG3/AA18 for the +9 enchantment and bonus feat at AA18.  You'll get 2 AA bonus feats, one at AA14 and the other AA18.  At both I'd take Great DEX.  The DCs of the special attacks like imbue, are based on the DEX modifier so you can never have too much. Ability bumps at Lvl 24/28 I would go with CHA.  That leaves 4 general feats to allocate.  EWF should be automatic.  That leaves 3.  My own preference for a confirmed stealth bomber would be ESkF: Hide and ESkF: MvSil to thwart your epic listener and spotter PCs.  That leaves 1 general.  I am inclined towards Called Shot for the reasons already expressed but ImpCrit would be a close 2nd if you are uncomfortable with using leg and arm shots in the heat of battle.  An AA is hardly pressured to take Epic Prowess with its intrinsic nasty AB.  EWF should be more than enough to hit everything in sight (and even those around corners with seekers).   Just figuring roughly off of Mick's pre-epic build, the final AB should be 44 without prowess.  That's a respectable AB even for a Level 40 toon and should be plenty for your Level 30 environs.<br/>\n<br/>\n IMO the d6 sneak damage is not worth investing into.  Unless you decide to morph this into a PBS Taunt build, another level of BG serves no purpose.  Bard can dump to Discipline should you decide to go that route (again only a value with a PBS tactic), which is not currently part of Mick's original plan anyway.<br/>\n<br/>\n Hopefully, I haven't confused the issue more than before the reply.  Where's Mick when you need him to translate and capsulize? <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />  This Level 30 discussion should have been posted in the Request forum but I have no way to separate out the replies into a new topic therein.  Your indulgence would be appreciated unitl the issue is consummated.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Jack Bauer",
      "avatar": "no_avatar.png",
      "timestamp": "5:18 AM - Oct 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am sorry for the confusion, I am 18 and I have taken the third blackguard level for divine might, the mention of the helmet was only to say that perhaps I should consider not taking divine protection at level 21 and consider taking something else more aimed towards pvp. Also I am playing on Arelith for clarification.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:02 AM - Oct 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">No worries.  My comprehension drops rapidly when I rush through this stuff.<br/>\n<br/>\n I only see either Brd9/BG3/AA18 (for the reasons already mentioned) or Brd11/BG3/AA16 as possible optimizations that expand on Mick's original intent.  The Brd11 version will net a few more skill dumps and net points but lower the AB/dmg from +9 to +8 plus -1AB from less DEX.  You'll also miss one AA bonus feat.  On the positive side, Song 11 will effectively increase the AB by 2 along with a few more song opportunities.  You'll also gain access to ImpInvis, War Cry and the other Level 4 bard spells (the dire spider is also a handy meat shield for an AA). In this case, I'd take the Epic Prowess for the one AA bonus instead of Grt DEX since you'll miss out on the matching DEX boost without the AA18 bonus.<br/>\n<br/>\n The only real problem with going more bard is that all your spell buffs will be easily dispelled so am not confident in how much PvP benefit can be gleaned when facing mages who will certainly dispel as soon as your toon comes within perception range (and they will also be buffed with True Seeing so your stealth will be useless vs. those types).<br/>\n<br/>\n Brd9/BG3/AA18 is probably as optimal as you are going to get IMHO.  Just hope that your first shot does enough damage to break their concentration before being Time-stopped, Bigby'd or mind-controlled by a high mage.  Mick's design does about the best one can expect to increase your chances to do exactly that.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:42 PM - Oct 19, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/> Where's Mick when you need him to translate and capsulize? <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /> <br/>\n  </div></blockquote>\n<div align=\"left\">I've been busy with RL.<br/>\n No need to apology. Your recommendations and the Ba9/BG3/AA18 split are in line with the idea of the original build.<br/>\n<br/>\n Mick<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "disturbed",
      "avatar": "10323029_1537924356.jpg",
      "timestamp": "7:15 AM - Sep 20, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just curious with this build...<br/>\n<br/>\nWhat armor type do you go for?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:31 AM - Sep 20, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>disturbed wrote:</cite>\nJust curious with this build...<br/>\n<br/>\nWhat armor type do you go for?\n</div></blockquote>\n\nFor the best AC you <em>can</em> play in full plate. But that is taxing on your stealth skills and makes spell casting difficult. I choose chain shirt/ scale mail or lighter armor depending on how high dexterity I can get with items and buffs. <br/>\nFor comparison the AC gain in mundane full plate is 9 (8 from the armor itself and 1 from dexterity). The armor check penalty is -8 to stealth skills. The arcane spell failure is 45%.<br/>\nA chain shirt can give 8 AC, 4 from the armor itself and 4 from dexterity. You need to buff dexterity to 18 for that with a +2 dexterity item or by casting cat's grace on yourself. The armor check penalty is only -2 and arcane spell failure is now 20 %.<br/>\nIf you can buff your dexterity to 22, you will also get 8 AC from leather armor, 2 from the armor itself and 6 from dexterity. You no longer have any armor check penalty, and arcane spell failure is reduced to 10%.<br/>\nIf you buff dexterity to 26, you will get 9 AC from padded armor, 1 from the armor itself and 8 from dexterity. The arcane spell failure is now only 5%.<br/>\nIf you cap dexterity, you get dexterity 28. If you wear robes or other clothing, your dexterity AC is 9. There is no longer any arcane spell failure.<br/>\n<br/>\nWhen downgrading the armor to lighter types, you also reduce the risk of becoming encumbered. <br/>\n<br/>\nAs you can see there are several benefits from downgrading to lighter armor types with higher dexterity. The downside is that you don't have access to uncanny dodge with this build, so you will lose the dexterity based AC when flat-footed and when flanked.<br/>\n<br/>\nLast, but not least: Another important factor is what magical properties that are available on the different armors where you play. If there is a super \"must-have\" armor, you probably pick that one.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Noctem",
      "avatar": "10759073_1554507612.jpg",
      "timestamp": "3:34 PM - Sep 23, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hola <em class=\"mention\">@Mick Dagger</em>  -- did you ever build this guy out to lvl 40? I'm planning to run this build through the Miller mods (shadowlords, etc.) but would like to keep playing him after I'm done with those. This seems right up my playstyle alley and I'd like to explore it further without being left to my own devices, which inevitably cock everything up when it comes to building/leveling. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:49 PM - Sep 23, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You could try Eastern Promises build <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/black-arrow-strike-the-heart-with-evil-bard-10-bla-t2354997.html\" rel=\"noreferrer\" target=\"_blank\">Black Arrow</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Noctem",
      "avatar": "10759073_1554507612.jpg",
      "timestamp": "2:10 AM - Sep 24, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Muchas gracias, Mick. I stumbled on <em class=\"mention\">@EasternPromises</em>' build shortly after writing my initial post. I'm glad to see your endorsement of it, since that was about the closest I could find too. Looks like I've got some sharpshooting to do!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Jenova91",
      "avatar": "no_avatar.png",
      "timestamp": "1:59 PM - Mar 30, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Mike Daggers ! I Summone you ! Haha<br/>\n<br/>\nI love the build concept, iam playing on a pvp/rp faction server, nothing is changed except the lvl max is 24, (not high magic serveur, would say +5 max and only with a lot of crafting).<br/>\n<br/>\nHow would push your build to lvl 24 ? <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Noctem",
      "avatar": "10759073_1554507612.jpg",
      "timestamp": "3:07 PM - Mar 30, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><em class=\"mention\">@Jenova91</em> <br/>\nSee <em class=\"mention\">@Mick Dagger</em> 's response to my post -- there's a build called the Black Arrow, by <em class=\"mention\">@EasternPromises</em> , which takes this idea up to 40. I'm not any good at building/theorycrafting, but you could check that one out to see if you can optimize it for L24 play.  Link below: <br/>\n<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/black-arrow-strike-the-heart-with-evil-bard-10-bla-t2354997.html\" rel=\"noreferrer\" target=\"_blank\">The Black Arrow (AA,Bard,BG), by EasternPromises</a><br/>\n<br/>\nAlso, what a great Necro of this old thread! I love that it keeps getting revived, and that people are still playing this  game. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}