{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "299",
  "name": "Toughness & Called Shot - why all the love?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/toughness-called-shot-why-all-the-love-t515384.html",
  "author": "Shahadet",
  "avatar": "10235244_1510287070.jpg",
  "replies": 8,
  "posts": [
    {
      "author": "Shahadet",
      "avatar": "no_avatar.png",
      "timestamp": "12:48 AM - Jul 27, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">This is primarily directed towards Kail and HipMaestro, since they've been helping me with my weirdo Shifter requests, BUT:<br/>\n<br/>\n- many of the builds you guys suggest have Called Shot and Toughness in them.  Why is that? <br/>\n<br/>\n=&gt; Toughness gives you +1 HP per level.  So at 22nd level, that's +22 hitpoints.  Which isn't horrible, but with only a handful of feats to choose from (for non-fighter builds), why pick this?<br/>\n<br/>\n=&gt; Called shot gives a cumulative -2 to hit.  Which sounds cool - but it wears off in 4 rounds, so again, if feats are scarce, why pick this?  <br/>\n<br/>\nI'm asking because I've never used either of these feats before, so I'm wondering how useful they are to other players?<br/>\n<br/>\nThanks!<br/>\n-S<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:46 AM - Jul 27, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Shahadet wrote:</strong>This is primarily directed towards Kail and HipMaestro, since they've been helping me with my weirdo Shifter requests, BUT:<br/>\n- many of the builds you guys suggest have Called Shot and Toughness in them.  Why is that? \n</div></blockquote>\nLet's take them one-at-a-time...\n<blockquote><div>\n=&gt; Toughness gives you +1 HP per level.  So at 22nd level, that's +22 hitpoints.  Which isn't horrible, but with only a handful of feats to choose from (for non-fighter builds), why pick this?</div></blockquote>\nI can't speak for Kail, but I set certain minimums from experience to increase my chance to sustain my PCs chances of survival. One of these tenets are melee HPs.  I use a different set of minimums for casters.  For melee and to some extent even archers, the minimum base HPs recommended at Lvl 20 is 200.  At 40, 400 HPs.  I will always manipulate whatever I can to assure that level minimum.  It's not love, though.  It's a necessity for my play style. <br/>\n<br/>\nNow, shifter is a unique situation besides that.  CON is often overwritten so it helps little setting CON to high levels other than the Fort save boost.  But the Toughness HPs will be amended for all forms regardless of their CON rating.  So it is one of the few feats that work for all forms.  By all means, if you are comfortable with Level 22 PC wandering around with 198 HPs, pick another feat.  You are not alone in devaluing the benefit of Toughness so should go with your own instinct first and other recommendations last.\n<blockquote><div>\n=&gt; Called shot gives a cumulative -2 to hit.  Which sounds cool - but it wears off in 4 rounds, so again, if feats are scarce, why pick this?  \n</div></blockquote>\nEspecially in situations where there are many APR like the unarmed forms that use the monk progression, arm called shots can be spammed so fast that your flanking enemies won't be able to hit you if YOUR PC can keep making contact.  In melee, the faster the attack the more value to arm shots.  With a fast-attacking PC I can drop the enemy AB by around -8AB and keep them there until dead.  It's like stacking another 8 AC onto your PC and that ain't bad.<br/>\n<br/>\nAs far as I am concerned, called leg shots are the staple of any serious archer.  All mine use it.  It is the first shot against any enemy and if I miss the check, I keep shooting until it lands. A high AB archer can slow entire mobs down to the point where kiting is not necessary and the more leg shots that land in succession the more you can drop their Dex AC.  Again, hitting fast and hitting often are the keys to getting the most out of called shots.  The use of leg shots in melee is essentially just to help escape an overpowering foe.  I seldom use the called leg shot within melee range.\n<blockquote><div>\nI'm asking because I've never used either of these feats before, so I'm wondering how useful they are to other players?\n</div></blockquote>\nThen you should... immediately.  Develop your combat diversity so that building is much more effective and versatile. Called shots, like other combat modes and attacks need to be practiced before the real benefit reveals itself.  A case in point for me, is Whirlwind.  I always hated that attack.  It reads and sounds like a really devastating attack until you find your character locked in position to get pummeled to death and so I renamed it \"Whirling Suicide\".  Then, playing in another setting I decided I was godly enough that the foes wouldn't be able to hit me much even if it locked so I tried again.  I found that if you time the beginning of the attack just right, it never locks up.  But it took hours of practice before I could gain any benefit from it. Today I am comfortable enough with it to use if it is there. <br/>\n<br/>\nExperience is the best teacher so use the recommendations and then adjust them to your own liking.<br/>\n<br/>\nI am interested to hear how Kail uses Called Shots myself.  I'm sure we play on different PWs so it could be a quite different take. *ring, ring*<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "3:56 PM - Jul 27, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Shahadet wrote:</strong>This is primarily directed towards Kail and HipMaestro, since they've been helping me with my weirdo Shifter requests, BUT:<br/>\n<br/>\n- many of the builds you guys suggest have Called Shot and Toughness in them.  Why is that? <br/>\n<br/>\n=&gt; Toughness gives you +1 HP per level.  So at 22nd level, that's +22 hitpoints.  Which isn't horrible, but with only a handful of feats to choose from (for non-fighter builds), why pick this?</div></blockquote>In general Toughness is not a bad feat (eventually equivalent to 2 epic feats) to have although it's not high on my priorities. It's a good way to bring HPs up to a desired mark (at lvl 40 for me it's 400 HPs for those involved regularly in melee without being absolute melee specialists, 300 for casters, 500 for dedicated meleers). <br/>\n<br/>\nIn the specific case of my suggestions for your build request, I had indeed a spare feat slot which is not badly spent on toughness but could be used for a save boosting feat or WF: ranged weapon or to grab both scribe scroll and craft wand. Not being a full fledged and optimized build it was just put in as a possible choice.<br/>\n<br/>\n<blockquote><div>=&gt; Called shot gives a cumulative -2 to hit.  Which sounds cool - but it wears off in 4 rounds, so again, if feats are scarce, why pick this?  </div></blockquote>Archery wise, called shot is basically a must. Called shot leg will make your enemies crawl, which buys you time to kill them before they make contact with you or force you to reposition. In melee builds, it's not a bad feat but not one of primary importance either. BF and KD/IKD come before Called Shot for me for example and many builds of mine do not have any called shot.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "shia luck",
      "avatar": "no_avatar.png",
      "timestamp": "11:49 PM - Aug 23, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I suppose I am echoing but, Called shot for archers is a must. Called shot:leg is THE thing, Just like Knockdown is for meleererers (sp? *grin*). What, i think, most people don't get about archer AB is you need that for the called shot DC, so to keep high discipline ftrs at bay... lots of AA makes a huge difference to this ability.  <br/>\n<br/>\nToughness, I am not a fan. There's nearly always something else that's better, with some tweaking. But if you have a feat slot spare then is silly to give it up. There's definitly an argument for being able to survive two IGMS at whatever level you happen to be at tho sooooo . <br/>\n<br/>\nHave fun<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:56 AM - Aug 24, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I will echo too on what Hip and Shia said. I'm not one to go: \"all my melee builds need to have this much HP at least\". In fact I don't think i have EVER done that. My Magical Master build has 228 HP at lvl 40. I've leveled it MANY times from 1-40 and did ok. Currently lvl 27 on WoG. I don't like Toughness: just like shia. I think there is nearly always something better to get, but if you can spare the feat then what the hell...<br/>\n<br/>\nAs for archers' Called shot, enough has been said, but what Hip said about meleers is SO TRUE. If you take an unarmed Cleric / Monk, for example, you will probably have VERY HIGH AC and AB. Called Shot with 7 attacks per round, even if expiring in 4 rounds is GODLY. You simply won't get hit. The only thing you need to worry about when using is being able to hit frequently. You can even win a hard battle by crippling your foe's attack. Fighting Earth Elementals can be very tough without proper gear, since they have DR, are immune to criticals and can pack a punch, but their AC is worthless. When they hit you you take 40 damage (80 on criticals), when you hit them you do 5. You can use Called Shot on them and reduce their AB so much so fast that you will manage to kill them before they can kill you even if doing only 5 Divine Favor damage a hit. In PvP, I suppose the equivalent would be a dex-based monk fighting a dwarven defender. You just need to know in which situation each feat works best. Now you know Called Shot's possible applications and combat tactics.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:37 AM - Aug 24, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Another reason Toughness pops up in many of my human builds is that until you can reach the prereq BABs for weapon focus &amp; other combat feats (not referring so much to spell casting builds in this case) there just aren't many feats that will be of much help. Unless you front load fighter-type classes it takes a while to reach those BABs. If you have high enough INT you can sneak Expertise in early on and Blind Fight is another early one with great advantage.  DEX builds have loads of useful feats to select from at low levels levels rather than choosing Toughness. But if you are at all feat-starved, like trying to qualify for WM, Toughness just gets in the way.  I never take it in epic levels unless I have everything else I need by that point.  For high-CON, reciprocal-damage builds, though, it can be a boon if you need to soak lots of HPs.<br/>\n<br/>\nAs for the Epic Toughness feat... now THAT one is totally worthless IMO.  Great CON x 2 is much superior to build your fort saves up.<br/>\n<br/>\nBut I still stick to my minimum because I want those full heals to heal up to at least 400 HPs or I have to spend too many rounds and too many heals to achieve the same goal... destruction.  I'll leave it to Max to walk on the wild side dodging IGMS.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MiniQuinny",
      "avatar": "no_avatar.png",
      "timestamp": "11:32 PM - Aug 28, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have a quick quote from one of Hip's builds..<br/>\n\"01: Clc 1 - Toughness, Blind Fight, Domains Strength &amp; War\"<br/>\n<br/>\nIf touphness addes 1hp per level, surely.. 1hp, is a wasted feat. I beleive the spell \"Viture\" offer the same, without required a potentially required feat.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:45 AM - Aug 29, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>MiniQuinny wrote:</strong>I have a quick quote from one of Hip's builds..<br/>\n\"01: Clc 1 - Toughness, Blind Fight, Domains Strength &amp; War\"<br/>\n<br/>\nIf touphness addes 1hp per level, surely.. 1hp, is a wasted feat. I beleive the spell \"Viture\" offer the same, without required a potentially required feat.</div></blockquote>\nYou've interpreted Virtue incorrectly.  Virtue temporarily (1 turn/level) adds a single point to the HP total. So for a Level 40 character having 400 HPs, after casting Virtue would have 401 HPs.  Toughness permanently adds 1 point per character level.  Toughness HPs cannot be dispelled even with Mordenkainen's Disjunction as will Endurance, Virtue or any other HP- or CON-buffing spell.  Toughness is essentially two Great CON feats in a single feat except doesn't yield +1 to fort saves like 2 CON would so saves epic feats for what is most important.   For polymorph forms which override CON it is one of easiest methods to increase the total HPs of a form without the need for pre-buffing (like Endurance).<br/>\n<br/>\nAlso, keep in mind that some classes like Wiz &amp; Sorc only have 4 HD.  Which means that single point per level from Toughness bestows 20% more HPs to each level and 20% more overall HPs for a pure build.  Naturally, a class like barb would benefit the least from Toughness. <br/>\n<br/>\nBut in MOST cases, Toughness is inserted in builds that are not feat-starved as a placeholder for another more player-specific feat.  It is one of the easiest to swap because there are no prereqs involved.  It leaves it up to the individual to decide if those additional 40 HPs (or 30 HPs on a level 30 cap server) means the difference between surviving or not.  Some players enjoy living on the edge of survival and prefer electing a more \"offensive\" feat than a defensive one.  I have chosen to reach certain minimum HPs for different types of builds and will use Toughness to help achieve that level.  If I can' t, by experience, I know what to expect... drinking heals more often and therefore fewer rounds attacking.  It really comes down to a personal preference and there is no hard-and-fast rule.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:35 PM - Sep 01, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>I'll leave it to Max to walk on the wild side dodging IGMS.</div></blockquote>\n\nI don't dodge IGMS, I just don't let them magey types cast it!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}