{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "297",
  "name": "Differences between single and multi-player for building.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/differences-between-single-and-multi-player-for-bu-t515443.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": "2",
  "views": "589",
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:54 PM - Sep 05, 2011",
      "content": "<div>Hip and I are having a discussion about playstyle and the importance of dispellability in a build. I have come to a conclusion that it may be just the different types of games we play that take us to such different opinions on that matter. You know when you know something consciously but you kind of don't really GET it till you experience something?? Kinda like when you know that smoking gives you cancer and makes you impotent, but you don't really try to stop till you get diagnosed with something? I think this is what is happening with Hip in this case. The same happened to me about 4 years ago. Avado used to try to explain this to me, but I didn't get it. I have been for a good portion of my building career, a single player mode player. For the last 4 years, I have migrated to online play in internet servers, and it's a whole new different thing. I will list some of the differences that I can remember here, but if I forget something you can hopefully pitch in with whatever I didn't mention. I'll try to be as generic as possible to try to include all servers:<br/>\n<br/>\n1- You can't pause in multi-player, not even modules played in multiplayer.<br/>\n<br/>\n2- There are several different types of servers: Action, PvP, RP, etc.., while modules generally are about finishing a plot quest and then the module is over.<br/>\n<br/>\n3- There are INFINITE customizations on servers. Each have their own set of rules, buffing up some spells or abilities and nerfing others. Some modules have many custom items or monsters, but not nearly as much as the servers.<br/>\n<br/>\n4- When playing on a server, you need to respect that server's rules. Some RP servers have SEVERE restrictions to multi-classing. Some Brazillian ones would go as far as to tell you you cannot multi-class unless you have a story backgroud justifying that level of a different class to a DM and you can only do so with his/her approval (never played on those, but heard of them). Some servers don't allow you to farm (A.K.A return to an area you know you can handle and have handled in the past for more XP). Some go as far as deleting your character if you infringe their rules without even telling you. Some don't have a lvl 40 cap, They have what is known as Hacker levels, which will give you one extra stat point each. There is a brazillian server that has characters of lvl 312. LOL I'm not joking.<br/>\n<br/>\n5- In online servers, there are custom tilesets, monsters, enhanced abilities, and all other forms of customization in an attempt to balance the server and create a good environment according to the admin's NWN views and opinions. Those are not so common in SP mode, although Aielund Saga does have them.<br/>\n<br/>\n6- In online play, as a general rule, there is no PLOT, so you can choose where to go and which kind of enemies to fight. This differs a lot from, say, NWN OC, when you knew your final boss-things would be those Old Ones or something (lizards) so you could pick a favored enemy in a ranger build to be good against them. In an online server, my toons go wherever I want them to go, and they complete whatever quests I want to accept. If I don't want to finish a quest, I simply don't take it. In RP servers, you can't be that loose, but I play mostly action.<br/>\n<br/>\n7- Each server has a different degree of customization and item enhancement. Some will have high magic, others low, others mid. Some will be filled with immunities, in others they simply don't exist, some will be balanced for party play, others for single play. There could be places where EMA and EW are useless, and others where they're godly. In an environment where you can cap your dodge AC, you don't need epic mage armor, in an environment with lots of bonus damage, Epic Warding loses its value.<br/>\n<br/>\n8- Each type of world favors a certain type of character. A non-UMD meleer cannot be made to work in a low magic server, where self-buffers would have the upper hand. On a server with powerful items, that same non-UMD meleer could do incredibly well.<br/>\n<br/>\nThat's all I can think of for now. The discussion I'm trying to raise and to avoid derailing Hip's build topic any further is that your builds should be maleable. They should always be tweaked according to where you play and how you play. I say this because my builds are all played differently according to where I have played them. Some places just require slight changes, others radical ones. You need to be able to tweak your builds to better suit the environment where you play.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "10:08 PM - Sep 06, 2011",
      "content": "<div>In on-line, even your best, most impermeable build doesn't stand a chance against the lag monster!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:37 PM - Sep 06, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong>In on-line, even your best, most impermeable build doesn't stand a chance against the lag monster!</div></blockquote>\n\nLOL! Right on!</div>"
    }
  ]
}