{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "672",
  "name": "Arelith Drow/Elf Stealthy Stabby.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-drow-elf-stealthy-stabby-t2355377.html",
  "author": "Kastelholm",
  "avatar": "no_avatar.png",
  "replies": "10",
  "views": "301",
  "posts": [
    {
      "author": "Kastelholm",
      "avatar": "no_avatar.png",
      "timestamp": "5:10 PM - Mar 02, 2020",
      "content": "<div>I've recently returned to NWN:EE after a year or year and a half away, left due to a Private Shard demanding money and DMs pretty much harassing me 'till breaking down to crap.<br/>\nDecided to give the game another chance and tried Arelith and am having lots of fun thus far. Sadly my friends dont play as much as me and thus to make sure I'm not leaving them all too far behind I decided to reroll \"something\".<br/>\n<br/>\nSo what I'm looking for is a stealthy (super stealthy) type assassin character without the assassin class, as I'm new I cant pick that one yet.<br/>\nRace is either Drow so I get to explore somewhere new or any elf so I can explore elsewhere. As fighting veterans with mega runic &amp; enchanted gear, scythe weapon masters and spellswords and everyone pretty much have a pet I'd want to do burst focused damage and if that doesn't work a safe way to gtfo. Defence vs knockdowns and crits would be nice as well. Any class goes as long as it's as stealthy and stabby as possible. I'd even throw in pale master but not sure how that would fit. <br/>\n<br/>\nIdeas?</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "8:36 PM - Mar 02, 2020",
      "content": "<div>24 Rogue / 6 Fighter or 19 Rogue / 5 Shadow Dancer / 6 Fighter would be the conventional stealth/stab builds.<br/>\n<br/>\nPersonally I would go 17 Shadow Dancer / 7 Rogue / 6 Fighter.<br/>\n<br/>\nFrom a PvP perspective, none are “great”.  Stealth works poorly in PvP in general and Arelith is no exception.  A Dex build nets Epic Dodge but lacks damage (sneak damage helps).<br/>\n<br/>\nLet me know if any are of interest and I’ll modify for the race of your choice.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Kastelholm",
      "avatar": "no_avatar.png",
      "timestamp": "8:49 PM - Mar 02, 2020",
      "content": "<div><blockquote><div><cite>Zanithar wrote: <div class=\"responsive-hide\">Mar 02, 2020</div></cite>\nFrom a PvP perspective, none are “great”.  Stealth works poorly in PvP in general and Arelith is no exception.  A Dex build nets Epic Dodge but lacks damage (sneak damage helps).<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div></blockquote>\nWhy is this?</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:09 PM - Mar 02, 2020",
      "content": "<div>Because you get one attack, (assuming you even get one).  Any decent PvP build/class will then decimate you.  You will not kill them in that one attack, but they will kill you before you can flee.<br/>\n<br/>\nYou simply do not have the offensive power alone to take any decent PvP build.<br/>\n<br/>\nThere are divine rogue builds that can hold up in PvP for a bit using Epic Dodge coupled with Divine Shield but unless you can keep sneak attacks engaged you will fall after your Divine Shield drops.<br/>\n<br/>\nA 24 Rogue / 6 Fighter build is probably your best bet.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:36 PM - Mar 02, 2020",
      "content": "<div>A Sneak Rogue is a Dex rogue.  A Dex rogue relies on Epic Dodge and Dex AC defensively and sneak attacks as well as grenades (on Arelith) offensively.  Sneak attacks have a flat footed/flanked requirement, grenades can help with this.<br/>\n<br/>\nRogues are excellent support PvP builds but will not succeed against a decent Arcane or Melee PvP.<br/>\n<br/>\nA WM will use Truestrike to knockdown and will likely kill you before you stand up.  If you live you will stand up, use your prayer to survive and attempt to run and hide.  If you run and hide, you are now moving slower, the WM will likely find you and kill you.  You will not kill him.<br/>\n<br/>\nA Mage will IGMS you and you will die.  They will see you if you sneak :)<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Kastelholm",
      "avatar": "no_avatar.png",
      "timestamp": "9:40 PM - Mar 02, 2020",
      "content": "<div>Ah bollocks, lets cancel that as a survival tactic then.<br/>\nWhat would you suggest instead of stealth as a survival build vs all them weapon masters and greater missile showers?</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:37 PM - Mar 02, 2020",
      "content": "<div>Well, survival is different then compete.  Greater Sanctuary is the survival mechanism of choice.  Alternatively lots of HP and/or Crit/Sneak immunity.<br/>\n<br/>\nIf you want a solid PvP/PVE build on Arelith:<br/>\n<br/>\nSorcerer 26/27 BG 3<br/>\nDruid 30 (Monolith EDR III build)<br/>\nHealer 30 Protection/War Domain<br/>\nBG 16 / PDK 10 / Ro 4<br/>\n<br/>\nSolid PVP less PVE:<br/>\nWM/Fi/Ro (Fight Fire with Fire)<br/>\nWizard 26 / Specialist 4 (they are pretty PVE solid)<br/>\nBarbarian 16 / PDK 10 / Ro 4<br/>\n<br/>\nPersonally though, I would just take the occasional hit and play something you like.<br/>\n<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "7:13 AM - Mar 04, 2020",
      "content": "<div>I don't know Arelith. At all. I used to play Capture the flag with a stealth build(Rogue/SDCoT) and also had decent success in my other main server where PvP could be chosen away.<br/>\n<br/>\nWhy doesn't it work? If True Seeing isn't modified to what it should be, then I understand. But I was never hit by Truestrike. It lasts 6 secs, just run and hide, hit him again. HiPS is superb, no matter their detection (unless they're elf).<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "2:45 AM - Mar 05, 2020",
      "content": "<div>Double post.</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "2:46 AM - Mar 05, 2020",
      "content": "<div>There are more spot/listen bonuses than MS/Hide bonuses, essentially you gimp your combat build if you want to effectively sneak/hide.<br/>\n<br/>\nIt is hard to answer to something as nebulous as “the changes that should have been made” but ... probably not then ...  Truesight has been managed differently on Arelith but is well balanced amongst the other massive customisations.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "6:03 AM - Mar 05, 2020",
      "content": "<div><br/>\n<blockquote><div><cite>Zanithar wrote:</cite>There are more spot/listen bonuses than MS/Hide bonuses, essentially you gimp your combat build if you want to effectively sneak/hide.\n</div></blockquote>\n\nThat explains it. HiPS can still be exploited for insta-stealth, but you'll never surprise anyone. I wouldn't go stealth for PvP in this case. It is true that it is hard to balance it.<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    }
  ]
}