{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "564",
  "name": "Bard/Fighter?/RDD - Build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bard-fighter-rdd-build-t2355539.html",
  "author": "JaqAtaq2",
  "avatar": "no_avatar.png",
  "replies": "25",
  "views": "2.1K",
  "posts": [
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "5:59 PM - Aug 15, 2020",
      "content": "<div>Hello elite NWN character builders, <br/>\nI'm a big fan of the Baldur's Gate series. Now that the Enhanced Edition of NWN came out, I thought I'd give it a try. In BG I really enjoyed playing as a blade. I like being able to buff up to near invincibility and then deal out heaps and heaps of damage very quickly. I also like to double wield, just because it's cool. Now I've read a little about character creation in NWN and I feel attracted to a Bard 16/Fighter 14/RDD 10 Build. I plan to use it just for the official campaign (OC, SoU, HotU), so I think I will only be able to get it to about level 30 max in this setting. Racewise I prefer human or half-elf. Alignment-wise I usually enjoy playing good guys (not lawful but rather chaotic).<br/>\n<br/>\nNow my questions: \n<ul>\n<li>For the starting stats I see a lot of builds sacrificing dexterity or constitution to get lots of STR. Is it worth it? Wouldn't I get more stat points overall if I start fairly leveled (Like everything 14, except Wisdom 8)</li>\n<li>Are there any items that make up weak stats in the OC/Expansions? Like the Dexterity-Gloves in BG?</li>\n<li>Is dual wielding worth the costs? How do I get the most damage per round: double Scimitars or should I rather go for a 2-handed weapon like a greatsword or a scythe? </li>\n<li>I like being able to cast some spells as it makes the character more versatile and fun. I don't mind taking off armor before big fights. How much spellcasting makes sense in a build like this? What are especially good spells? In BG I mostly used spells for buffing, but some AoE debuffing or damage spells are also nice. You could even get to cast Time Stops regularly with a simulacrum using a scroll. Are there similar tricks in NWN?</li>\n<li>I'm not a big fan of ranged attacks. I find it more fun to be able to get close to the enemy and hurt with lots of damage quickly. Are there good items that enhance speed in the OC and expansions? Like the boots of speed in BG.</li>\n</ul>\n\nI'm sure I'm there have to be some builds here that would fit my profile. I have been trying to find them but get overwhelmed by the possibilities. As a newbie I find it hard to weigh pros and cons of the different builds. <br/>\n<br/>\nI liked some aspects of these builds: <br/>\n<a class=\"postlink\" href=\"https://steamcommunity.com/groups/NWN-Players/discussions/1/2789318172125666238/\" rel=\"noreferrer\" target=\"_blank\">https://steamcommunity.com/groups/NWN-P ... 125666238/</a> <br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build195827.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 95827.html</a><br/>\nDraconic Swordsman v.1/v.2<br/>\n<br/>\nAll of them have low Dex and would not work with dual wielding. Others sacrifice CHA for STR and end up with little or no spells, so none of them are a perfect fit. Any ideas? </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:31 PM - Aug 15, 2020",
      "content": "<div>Hail and welcome JaqAtaq!<br/>\n<br/>\nWhile I can't help you with spell nonsense, I can say that, other than that minor detail, we start from the same place. When I first came here some 5.5 years ago I came from Baldur's Gate looking for a similar build as you. I got an absolute beauty from the combined talents of Empyre and Valerfor. Rather than simply re-hash what was written then - which also covers some of the other questions you raise - I'll just link you to it. It's a long thread, but page 1 should cover most of what you're looking for. <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/non-shooty-non-magicky-elves-you-know-you-re-out-t-t2354345.html#.VuMvM0DOEqg\" rel=\"noreferrer\" target=\"_blank\">Non-shooty non-magicky</a><br/>\n<br/>\nHope it's of some use. Have a look and come back to us with your thoughts.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "7:33 PM - Aug 15, 2020",
      "content": "<div>Trank you very much Stagmeister! I read the thread and the build sounds very nice.  Although I would really like to have more access to spells than just level 2. I’ve looked around and found this build I find pretty fascinating: <br/>\n<br/>\nTendorizing Tenor<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build215245.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 15245.html</a><br/>\n<br/>\nWhat do you make of it?</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:45 AM - Aug 16, 2020",
      "content": "<div>I want to caution you against playing the OC, SoU, and HotU with a single character.  Both the OC and SoU are meant to start at level 1, and HotU is intended to follow SoU.  Instead, play the OC followed by the Mines of Twin Summit series to get all the way to level 40, and then play Sou, HotU, and the Sands of Fate series to get all the way to level 40 again.  This RDD build would be great for SoF, and while it would also work in MotS, use a different build for MotS (an unarmed Monk build or a Weapon Master build are good choices).  Using the same build all the time would get monotonous.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "1:38 PM - Aug 16, 2020",
      "content": "<div>Thank you for this advice! I thought OC, SoU and HotU would be loosely related and were meant to be played one after the other. Makes sense to play different builds if both OC and SoU are meant for a level 1 character. That was really helpful for me. <br/>\nWhat do you think of the \"Tendorizing Tenor\"-build (aside the hilarious name). I was thinking of specializing in double Scimitars instead of lots of different weapons. </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:53 PM - Aug 16, 2020",
      "content": "<div>On the Tendorizing Tenor build, I have great respect for the principles...however, there are issues. No Blind Fighting, Knockdown/IKD not taken until epic levels (same for Curse Song in the initial build). There is a way to get them in pre-epic, and that is to only use one weapon type. Not only does that give you all 3 feats pre-epic (as well as Curse Song if you follow the second levelling guide) - replacing a Weapon Focus, Weapon Specialization, and Improved Critical in the other weapon - it also frees up EWF, EWS, OC, and DC in the second weapon in epic levels, meaning you can take a further 4 Great Strengths, thereby improving both your AB and damage by 2.<br/>\n<br/>\nIt does, of course, have a downside - and that is losing one damage type, either slashing or bludgeoning, so any enemy with a resistance to one type or the other will be harder to handle (for example, Undead and Constructs are more vulnerable to bludgeoning damage and have a resistance to slashing/piercing).<br/>\n<br/>\nOn balance, I think the benefits of taking only one weapon type outweigh its downside. However, I wouldn't go for scimitar, because it's a medium-sized weapon, and dual-wielding them gives you a -4 AB on each hand, rather than the -2 dual-wielding with a small or tiny weapon gives you. The smart choice would be short-swords, but there is a case for handaxes. Another alternative would be to sacrifice Improved KD, take Exotic Weapon Proficiency, then focus in kukris.<br/>\n<br/>\nJust my thoughts!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:04 PM - Aug 16, 2020",
      "content": "<div>Oh, sorry, meant to mention this, too...<br/>\n<br/>\nThe OC will get you to around level 17/18. SoU/HotU will take you to around level 28. If you want to take advantage of the full level 40 build, you might want to look at some modules that enable that. Mines of Twin Summit will take you forward from the end of the OC up to level 40. Sands of Fate will get you there from the end of HotU. Both of these sets of modules (and access to them) can be found in our Modules forum, if you're interested.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:29 PM - Aug 16, 2020",
      "content": "<div>Here is a build that would be very strong in the OC and Mines of Twin Summit.  I recommend that you p[lay that first because the OC is great for teaching new payers how to play the game.  Long before you finish that, I will have a dual-shortsword RDD ready for SoU, HotU, and Sands of Fate, but I have to go to work now.<br/>\n<br/>\nSinging Swordsman (Fighter 14 / Bard 10 / Weapon Master 16):\n<details><summary>Spoiler</summary>\nSinging Swordsman (Fighter 14 / Bard 10 / Weapon Master 16)\nPlayable 1 - 40\n\nSTR: 16 (32)\nCON: 14\nINT: 14\n\nHuman: (Quick to Master)\n02: Bard(1)\n04: Fighter(3): STR+1, (STR=17)\n06: Fighter(5): Blind Fight\n08: Fighter(6): STR+1, Spring Attack, (STR=18)\n10: Fighter(8): Whirlwind Attack\n12: Bard(3): STR+1, Knockdown, (STR=19)\n14: Weapon Master(3)\n16: Weapon Master(5): STR+1, (STR=20)\n18: Weapon Master(6): Great Cleave\n20: Fighter(9): STR+1, (STR=21)\n22: Bard(5)\n24: Bard(6): STR+1, Great Strength I, (STR=23)\n26: Fighter(13)\n28: Fighter(14): STR+1, Devastating Critical: Longsword, (STR=25)\n30: Weapon Master(9): Great Strength III, (STR=26)\n32: Bard(8): STR+1, (STR=27)\n34: Weapon Master(12)\n36: Weapon Master(14): STR+1, Great Strength V, (STR=30)\n38: Weapon Master(15)\n40: Bard(10): STR+1, (STR=32)\nStats:\nSkillpoints: 235\nSaving Throw bonuses: Spells: +9\nAB (max, naked): 47 (melee), 32 (ranged)\nSpell Casting: Bard(0)\n\nDiscipline 43(54), Intimidate 4(4), Listen 42(41), Lore 9(21), Perform 15(15), Spellcraft 43(45), Tumble 40(42), UMD 35(35)\n01: Discipline(4), Lore(4), Save(12)\n03: Discipline(1), Lore(2), Save(2)\n05: Discipline(1), Save(10)\n07: Discipline(1), Listen(5), Perform(5), Tumble(5), UMD(5)\n09: Discipline(1), Intimidate(2)\n11: Discipline(1), Listen(4), Save(4)\n13: Discipline(1), Listen(1), Save(3)\n15: Discipline(1), Listen(1), Save(9)\n17: Spellcraft(5), Tumble(5), UMD(10)\n19: Discipline(1), Listen(1), Lore(3)\n21: Discipline(1), Save(8)\n23: Discipline(2), Save(3)\n25: Discipline(1), Save(5)\n27: Discipline(1), Spellcraft(5), Tumble(5), UMD(5)\n29: Discipline(1), Listen(5), Save(3)\n31: Discipline(1), Save(11)\n33: Discipline(2), Listen(3)\n35: Discipline(1), Listen(1), Save(5)\n37: Discipline(1), Spellcraft(10), Tumble(5)\n39: Discipline(1), Listen(1), Save(4)\n</details>\nCopy-and-paste the build into the Notes tab in your in-game journal.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "2:22 AM - Aug 17, 2020",
      "content": "<div>Very good recommendations, Stagmeister. I will think about using a smaller weapon in the offhand. I've read lots of talk about \"dev-crit\" and scimitars getting good criticals, that's why I was thinking about this weapon. Do you know of a damage per round comparison for dual-wield, 2-handed-weapon and sword-and-shield style? What difference would the \"dev-crit\" tactic imply? <br/>\nSounds like a good plan to play MotS and/or SoF to get the builds to level 40. <br/>\nThank you very much for the singing swordsman build Empyre65, I'm looking forward to your dual-shortsword RDD! Meanwhile I will try my luck in the OC and see how it goes. I will keep you posted. <br/>\nThanks again for all the help!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:04 AM - Aug 17, 2020",
      "content": "<div>Here's the dual-shortsword RDD, a tweaked version of a build I made for the Aielund Saga (which is another must-play campaign, taking you from level 1 to level 36.  It is so good!):<br/>\n<br/>\nDraco Twinblade (Fighter 20 / Bard 10 / Red Dragon Disciple 10):\n<details><summary>Spoiler</summary>\nDraco Twinblade (Fighter 20 / Bard 10 / Red Dragon Disciple 10)\nPlayable 1 - 40, PvM\n\nSTR: 16 (40)\nCON: 12 (14)\nINT: 14 (16)\n\nHuman: (Quick to Master)\n02: Bard(1)\n04: Fighter(3): STR+1, (STR=17)\n06: Fighter(5): Knockdown\n08: Fighter(6): DEX+1, Two-Weapon Fighting, (DEX=15)\n10: Red Dragon Disciple(2): (STR=19)\n12: Bard(3): STR+1, Improved Two-Weapon Fighting, (STR=20)\n14: Fighter(7)\n16: Red Dragon Disciple(5): STR+1, (STR=23)\n18: Red Dragon Disciple(6): Great Cleave\n20: Red Dragon Disciple(8): STR+1, (STR=24)\n22: Red Dragon Disciple(10): {Darkvision}, (STR=29), (CHA=12)\n24: Fighter(9): STR+1, Great Strength II, (STR=31)\n26: Fighter(11)\n28: Fighter(12): STR+1, Devastating Critical: Shortsword, (STR=33)\n30: Fighter(14): Great Strength IV, Epic Weapon Focus: Shortsword, (STR=34)\n32: Bard(7): STR+1, (STR=35)\n34: Fighter(17)\n36: Bard(8): STR+1, Great Strength VI, (STR=38)\n38: Fighter(19)\n40: Bard(10): STR+1, (STR=40)\nStats:\nSkillpoints: 254\nSaving Throw bonuses: Spells: +6\nAB (max, naked): 46 (melee), 30 (ranged)\nSpell Casting: Bard(2)\n\nDiscipline 43(58), Lore 41(54), Perform 14(15), Search 25(28), Spellcraft 27(30), Spot 25(25), Tumble 40(42), UMD 39(40)\n01: Discipline(4), Lore(4), Save(12)\n03: Discipline(1), Lore(1), Save(4)\n05: Discipline(1), Lore(1), Save(10)\n07: Discipline(1), Perform(3), Tumble(5), UMD(5), Save(7)\n09: Discipline(1), Search(2), Spot(12), Save(1)\n11: Discipline(1), Spot(1), Save(7)\n13: Discipline(1), Search(2), Spot(2)\n15: Discipline(1), Save(8)\n17: Discipline(1), Tumble(5), UMD(5)\n19: Discipline(1), Search(3), Spot(1)\n21: Discipline(1), Search(3), Spot(1)\n23: Discipline(2), Lore(1), Tumble(5)\n25: Discipline(1), Save(8)\n27: Discipline(1), Perform(2), Spellcraft(4), Tumble(5), UMD(9)\n29: Discipline(1), Save(8)\n31: Discipline(1), Save(18)\n33: Discipline(1), Lore(5)\n35: Discipline(1), Lore(1), Save(4)\n37: Discipline(1), Tumble(2), UMD(5)\n39: Discipline(1), Lore(5)\n</details></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "12:38 PM - Aug 17, 2020",
      "content": "<div>Thank you Empyre65 for this great build, it looks pretty awesome. I see you go the shortsword route and get dev-crits by level 28. If I wanted to wield a big weapon in one hand and a small one in the other I would have to sacrifice some feats to do it effectively, right? Also, I would like to take more bard-levels to get to perform 30 and be able to use both type of songs effectively, and I'd like to use at least level 4 spells (Improved Invisibility and War Cry). Level 5 and 6 seem to have less valuable buffing spells, Dirge and Energy Buffer sound interesting, though. </div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:50 PM - Aug 17, 2020",
      "content": "<div>Each thing you mention is possible, but you can't have all of them in the same build.  The build I made is meant to be a warrior, but a caster.  You would have to take off your heavy armor to cast.  If you want to be a casing RDD, Cleric / Bard / RDD would be a better choice.  Look up Blood and Faith for a fantastic example.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "8:12 PM - Aug 17, 2020",
      "content": "<div>I was thinking of focusing on defensive buffing spells like improved invisibility, so there would not be a problem to be taking off the armor before a big fight. “Can’t have them all in the same build” sounds like a challenge to me <span class=\"text-emoji\">😉</span></div>"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "8:13 PM - Aug 17, 2020",
      "content": "<div>Also I don’t like clerics for RP purposes.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:14 AM - Aug 18, 2020",
      "content": "<div>If you drop Dev Crit, you can take 4 more Bard in epic levels, and if you also drop dual-wielding (going longsword-and-shield instead), you can take 4 more Bard pre-epic, too, at the cost of 1 AB.  Dropping dual-0wielding would also allow you to divert 2 points from DEX to CHA, for more casting.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "3:11 PM - Aug 18, 2020",
      "content": "<div>Hmmmm, I’ve been doing some math. I reckon being a human I could take 23 feats with my intended class distribution. I was thinking about these feats: <br/>\n<br/>\n1. Luck of Heroes <br/>\n2. Weapon Focus: Scimitar (for keening)<br/>\n3. Weapon Specialization: Sc<br/>\n4. Power Attack<br/>\n5. Blind Fight<br/>\n6. Knockdown<br/>\n7. Cleave<br/>\n8. Curse song<br/>\n9. improved KD (+7BAB)<br/>\n10. Improved critical (+8 BAB)<br/>\n11. Ambidexterity (Dex. 15)<br/>\n12. Two-weapon-fighting<br/>\n13. Weapon Proficiency Exotic (Kukri)<br/>\n14. Improved 2WF (+9 BAB)<br/>\n15. Great cleave<br/>\n16. Lingering song<br/>\n17. overwhelming crit (lvl 21, 23 STR) <br/>\n18. Great Strength (1) (or Push saves?)<br/>\n19. dev crit (25 Str) <br/>\n20. Extend/Still Spell (1 level higher) <br/>\n21. Epic Weapon Focus<br/>\n22. Epic Weapon Specialization <br/>\n23. Toughness (or epic prowess? Or armor skin?)<br/>\n<br/>\nI see it’s not possible to get two weapon specializations maxed. I could drop the kukris and just take the penalties that come from wielding a larger weapon in my off hand. With the specialization and buffs they should not matter that much. Also I would have one more feat to be used for whatever. <br/>\n<br/>\nMy stats would go like this:<br/>\nSTR 14 (+8 RDD, +9 LVL +1 GS) = 32<br/>\nDEX 14 (+1 LVL) = 15<br/>\nCON 14 (+2 RDD) = 16<br/>\nWIS 8<br/>\nINT 14 (+2 RDD) = 16<br/>\nCHA 14 (+2 RDD) = 16<br/>\n<br/>\nSkill point wise I thought about this general idea: <br/>\nDiscipline (Max)<br/>\nPerform (30)<br/>\nSpellcraft (40)<br/>\nTaunt (Max)<br/>\nUMD (15-20)<br/>\nPersuade (Whats left)<br/>\nLore (8)<br/>\n<br/>\nWhat do you think?</div>"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "3:12 PM - Aug 18, 2020",
      "content": "<div>Or I could double wield a smaller weapon. Just doesn’t look as cool as two scimitars...</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:26 PM - Aug 18, 2020",
      "content": "<div>There is a reason I chose specifically a shortsword, besides the smaller dual-wielding penalty.  In early HotU, you encounter a talking longsword.  In your first conversation, you have an opportunity to tell him you don't need a longsword, and he will offer to change to another weapon: a dagger, shortsword, or greatsword.  Not only is it fun to have a talking sword, but he has Vampiric Regeneration (+4, IIRC), which is really nice to have.<br/>\n<br/>\nIt looks like you are taking several pre-epic feats in epic levels, a sign that you are trying to cram too much into the build.  I recommend that you drop dual wielding, using a (talking) longsword and shield.  Leave your DEX at 12, and spend the 2 points to raise your starting STR to 15.  Use all your level +1s on STR.  Also, drop the Exotic Weapons.  All of this should allow you to take 2 or maybe 4 more Great Strength feats, and you can have both Epic Prowess and Armor Skin, rather than having to choose one.<br/>\n<br/>\nSince you are waiting until epic levels to take Lingering Song, you might as well take <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Lasting_inspiration\" rel=\"noreferrer\" target=\"_blank\">Lasting Inspiration</a> instead, for an even longer song, unless you will not be meeting the Bard 20 requirement.<br/>\n<br/>\nLuck of Heroes is really nice to have if you have feats to spare, but it doesn't belong in such a feat-starved build.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "1:16 PM - Aug 19, 2020",
      "content": "<div>I like the idea of a talking short sword. Also, Regeneration sounds very nice. I've tried to put everything together in the builder-excel file to see what comes out. Please go easy on me, it's the first time I use this sheet and I'm not familiar with many intricacies of the rules. I already know the build takes some time to get off the ground and I'll be fighting with just one hand until at least level 15. But well... good things come for those who wait. I could not take lasting inspiration because I only take 16 bard levels. With the pre-epic feats I take at epic levels: I think it's just Still Spell and Lingering Song. I could take two Great Strengths instead, but I think being able to cast war cry and have longer song effects are more beneficial overall. The spell capabilities go up pretty late anyway, so it would not make sense to take it earlier. <br/>\n<br/>\nHere is the Singing Spell-slinging Shortsworddrake (V. 0.1): <br/>\n<details><summary>Spoiler</summary>\n\n\nDEX: 14 (15)\nWIS: 8\nCHA: 14 (16)\nHuman: (Quick to Master)\n02: Fighter(1): Weapon Focus: Shortsword\n04: Fighter(2): DEX+1, Knockdown, (DEX=15)\n06: Fighter(3): Cleave\n08: Bard(5): STR+1, (STR=15)\n10: Fighter(4): Weapon Specialization: Shortsword\n12: Fighter(6): STR+1, Improved Critical: Shortsword, Improved Knockdown, (STR=16)\n14: Red Dragon Disciple(2): (STR=18)\n16: Red Dragon Disciple(4): STR+1, (STR=21)\n18: Red Dragon Disciple(6): Two-Weapon Fighting\n20: Red Dragon Disciple(8): STR+1, (STR=22)\n22: Red Dragon Disciple(10): {Darkvision}, (STR=26), (CHA=16)\n24: Bard(8): STR+1, Lingering Song, (STR=27)\n26: Fighter(8): Great Cleave\n28: Fighter(10): STR+1, Devastating Critical: Shortsword, (STR=28)\n30: Fighter(12): Epic Weapon Focus: Shortsword, Epic Weapon Specialization: Shortsword\n32: Bard(9): STR+1, (STR=29)\n34: Bard(11)\n36: Bard(13): STR+1, Epic Prowess, (STR=30)\n38: Bard(15)\n40: Bard(16): STR+1, (STR=32)\nHitpoints: 440\nSaving Throws (Fortitude/Will/Reflex): 27/23/22\nBAB: 26\nAC (naked/mundane items only): 26/36\nAlignment Changes: 0\nDiscipline 43(54), Lore 8(27), Perform 31(34), Persuade 35(38), Pick Pocket 10(12), Spellcraft 42(45), Taunt 42(45), Tumble 41(43), UMD 20(23)\n\n02: Discipline(1), Save(4), \n04: Discipline(1), \n06: Discipline(1), Save(4), \n08: Discipline(1), Lore(1), Perform(1), Spellcraft(3), UMD(1), \n10: Discipline(1), Save(3), \n12: Discipline(1), Save(11), \n14: Discipline(1), Persuade(1), Spellcraft(1), Save(3), \n16: Discipline(1), Persuade(1), Spellcraft(1), Save(7), \n18: Discipline(1), Persuade(1), Spellcraft(1), Save(11), \n20: Discipline(1), Persuade(1), Spellcraft(1), Save(15), \n22: Discipline(1), Persuade(1), Spellcraft(1), Save(20), \n24: Discipline(1), Perform(3), Persuade(1), Spellcraft(1), Taunt(1), Tumble(1), UMD(3), \n26: Discipline(1), \n28: Discipline(1), \n30: Discipline(1), Save(10), \n32: Discipline(1), Perform(3), Persuade(1), Spellcraft(7), Taunt(8), Tumble(8), \n34: Discipline(1), Perform(2), Persuade(1), Spellcraft(1), Taunt(1), Tumble(1), \n36: Discipline(1), Perform(1), Persuade(1), Spellcraft(1), Taunt(1), Tumble(1), \n38: Discipline(1), Perform(1), Persuade(1), Pick Pocket(2), Spellcraft(1), Taunt(1), Tumble(1), \n40: Discipline(1), Perform(1), Persuade(1), Pick Pocket(7), Spellcraft(1), Taunt(1), Tumble(1), \n</details></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:46 PM - Aug 19, 2020",
      "content": "<div>Drop LoH at first level (unless you are playing in an environment where fail on a 1 is turned off) and replace with Blindfight.  Fit Cleave where Blindfight is, and Great Cleave where Cleave is.<br/>\n<br/>\nNow you can fit an Epic feat in where Great Cleave is.<br/>\n<br/>\nYummy.</div>"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "4:29 PM - Aug 19, 2020",
      "content": "<div>You are right, I should drop LoH as Empyre65 already suggested. I guess 1 save more or less won't make much of a difference in the long run. What Epic feat would you recommend? </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:37 PM - Aug 19, 2020",
      "content": "<div>Well, if I am seeing things correctly, you could then take OC, then Dev Crit 1 level early, right?<br/>\n<br/>\nAnd so forth.<br/>\n<br/>\nThat will leave you with one \"extra feat\" open.  <br/>\n<br/>\nToughness or Great Dex?</div>"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "4:47 PM - Aug 19, 2020",
      "content": "<div>Toughness would get me 480 HP, what would Great Dex get me? AC Bonus? </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:26 PM - Aug 19, 2020",
      "content": "<div>Yeah, that is about it.  I'd go for the Toughness myself.</div>"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "11:18 PM - Aug 19, 2020",
      "content": "<div>I think +40 HP beats a little AC upgrade, too. Any thoughts on the build?</div>"
    },
    {
      "author": "JaqAtaq2",
      "avatar": "no_avatar.png",
      "timestamp": "6:13 PM - Aug 21, 2020",
      "content": "<div>Hey there, sorry to bother again. I tried optimizing the build. If I take Bard 4/Fighter 12/RDD 4 pre-Epic I can get more feats pre-epic and basically be two-weapon-fighting by level 20. BAB goes up from 26 to 28, along with AB by two points to 43. Sadly it means I'll only be able to do the more bardy stuff quite late in the game. I lose 4 Skill points, but that doesn't seem too much. The saves are slightly worse, too. What level progression would you recommend to balance the build? </div>"
    }
  ]
}