{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "016",
  "name": "Arelith Barbarian/Fighter/WM Kensai",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-barbarian-fighter-wm-kensai-t2354798.html",
  "author": "StreI0k",
  "avatar": "no_avatar.png",
  "replies": "7",
  "views": "1.3K",
  "posts": [
    {
      "author": "StreI0k",
      "avatar": "no_avatar.png",
      "timestamp": "10:29 AM - Dec 16, 2017",
      "content": "<div>Hello! I wanted to make a character around the path of Kensai but so far i can't seem to figure out what would be a good build.<br/>\n<br/>\nI'd love to know if there is a way to make a somewhat viable build around this concept or if it is just better to stick with something.<br/>\n<br/>\nSo far i thought about  it being Human, Dwarf or Duergar but if something else is a better option, i am welcoming to the idea.<br/>\n<br/>\nBarbarian 15  /  Fighter 8  /  WM 7 <br/>\nSeems to be the most balanced way of distributing levels without missing too much, maybe a few less in fighter and more into barbarian?<br/>\n<br/>\nSkills: I thought about dumping into Discipline, Intimidate, Spellcraft, Taunt and Tumble.<br/>\nThough i feel that Listen might be needed too. <br/>\n(Having Hide/MS would be wonderful but it's too much more so being a cross-class, so i was thinking about being a Duergar with Invisibility gift to spice it up)<br/>\n<br/>\nFeats: Can't miss the most important stuff like a Terrifing or Thundering rage, Blind Fight, Knockdown and I/Disarm.<br/>\nThe thing is that i am going to be pretty feat starved with all the WM prereq. (I don't know how important it would be to have EDR so i didn't mind skipping it, probably an awful idea)<br/>\n<br/>\nWeapon: Two-handed for the rage progresion, if not sword and board to compensate for the low AC.<br/>\nDo you guys know if the Dwarven Axe with the -Twohanded command works with the barbarian rage progresion of Arelith?<br/>\n<br/>\nArmor: No idea if it is better to use full plate or pumping DEX to 14 and utilizing a breastplate, i am pretty sure that the barbarian drinking bonus favors more full plate.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:19 AM - Dec 16, 2017",
      "content": "<div>Hello Strel0k,<br/>\n<br/>\nIf a kensai is what you're looking for, have you checked out Valerfor's Arelith Sword Master (Fighter 10/ Rogue 4/ Weapon Master 16)? It's the 2nd build in the Mid Epic - Level 30 - Builds sub-forum.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "StreI0k",
      "avatar": "no_avatar.png",
      "timestamp": "12:40 PM - Dec 16, 2017",
      "content": "<div>Hello Stagmeister, I really like that build and i am already making a character based on it but it's not exactly what i've in mind here.<br/>\n<br/>\nMostly for RP reasons, I want to ditch the UMD Skill and rogue/bard levels (even if it cripples my AC a bit).<br/>\nTo persue the \"Kensai Path\" built into Arelith that makes it impossible to cast spells for your character, but instead grants you bonuses like AC, an extra attack and saves against spells.<br/>\n<br/>\nI want to make it a heavy hitter and the combination of Barbarian's rages with Fighter's WS/EWS, Weapon Master critical hits, plus the Kensai bonuses seemed fun to make a glass cannon. <br/>\n<br/>\nMaybe there is a better build to do it or just min/maxing this idea? I really need a hand because i am not familiar enough with all the mechanics of NWN to do it on my own, thanks a lot and sorry for being a hassle.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:03 PM - Dec 16, 2017",
      "content": "<div> Monk then, if you can't cast spells (in order to get the extra benefits) then replace rogue with a monk. And you still retain full tumble ranks &amp; evasion. Otherwise, Barbarians with just 15 levels are risky because there are not enough levels in Arelith. Barbarians at 15th level have few uses of their greater rage ability.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:06 PM - Dec 16, 2017",
      "content": "<div>Alternatively, you could always use fighter/ cot/ wm combo, pure martial &amp; with the most feats. Something like fighter 8/ wm 7/ cot 15 or similar.</div>"
    },
    {
      "author": "cilginat",
      "avatar": "10758838_1513291018.jpg",
      "timestamp": "2:11 PM - Jan 03, 2018",
      "content": "<div>Here is the build for an alt I'm building. In Arelith half-orcs get ambi dexterity for free so I decided to make a double axe using one.<br/>\n<table class=\"post_content_table\"><tbody><tr><td>1</td>\n<td>Barb 1</td>\n<td>Exotic Wep Prof</td>\n<td></td>\n</tr>\n<tr><td>2</td>\n<td>Barb 2</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>3</td>\n<td>Barb 3</td>\n<td>Focus: Double Axe</td>\n<td></td>\n</tr>\n<tr><td>4</td>\n<td>Barb 4</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>5</td>\n<td>F 1</td>\n<td></td>\n<td>Two Weapon Fighting</td>\n</tr>\n<tr><td>6</td>\n<td>F 2</td>\n<td>Dodge</td>\n<td>Blind Fight</td>\n</tr>\n<tr><td>7</td>\n<td>F 3</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>8</td>\n<td>F 4</td>\n<td></td>\n<td>Wep Spec</td>\n</tr>\n<tr><td>9</td>\n<td>F 5</td>\n<td>Imp TWF</td>\n<td></td>\n</tr>\n<tr><td>10</td>\n<td>F 6</td>\n<td></td>\n<td>Expertise</td>\n</tr>\n<tr><td>11</td>\n<td>F 7</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>12</td>\n<td>F 8</td>\n<td>Spring Attack</td>\n<td>Mobility</td>\n</tr>\n<tr><td>13</td>\n<td>WM 1</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>14</td>\n<td>WM 2</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>15</td>\n<td>WM 3</td>\n<td>Whirlwind Attack</td>\n<td></td>\n</tr>\n<tr><td>16</td>\n<td>WM 4</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>17</td>\n<td>WM 5</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>18</td>\n<td>WM 6</td>\n<td>Improved Critical</td>\n<td></td>\n</tr>\n<tr><td>19</td>\n<td>WM 7</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>20</td>\n<td>Barb 5</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>21</td>\n<td>Barb 6</td>\n<td>Epic Wep Focus</td>\n<td></td>\n</tr>\n<tr><td>22</td>\n<td>FTR 9</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>23</td>\n<td>FTR 10</td>\n<td></td>\n<td>Epic Weapon Spec</td>\n</tr>\n<tr><td>24</td>\n<td>Barb 7</td>\n<td>Epic Prowess</td>\n<td></td>\n</tr>\n<tr><td>25</td>\n<td>Barb 8</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>26</td>\n<td>Barb 9</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>27</td>\n<td>Barb 10</td>\n<td>Knock Down or Armor Skin</td>\n<td></td>\n</tr>\n<tr><td>28</td>\n<td>Barb 11</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>29</td>\n<td>Barb 12</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>30</td>\n<td>Barb 13</td>\n<td>ESF:Discipline or Another combat feat or STR (?) </td>\n</tr>\n</tbody></table>\n\nAs you can see I'm not sure about the epic feats. I'll post the stats once I get home, have fun.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:14 PM - Jan 03, 2018",
      "content": "<div>Unless I'm mistaken, you need to take Whirlwind Attack before taking a leavel in Weapon Master. You could solve that by taking Imp 2-Weapon Fighting later. I'd also be reluctant to leave Knockdown to so late in the build, but everything becomes pretty cramped and hard to manage. I understand that you want to make the most of having ambidexterity gifted to you, and the use of double-axe, but if you went for something that doesn't require exotic proficiency (for example hand axes, shortswords, maces) you could take KD earlier and still take Armor Skin. You'd also be able to go sword and shield at earlier levels until your AB can better handle dual-wielding and your AC can be improved by various other means. Of course, if you'd prefer more powah, you could just ignore ambi and go for large flail or greatsword<br/>\n<br/>\nIt also seems a shame to invest in 13 levels of Barb and then fail to get to at least 15 for the potential of Terrifying Rage, but a guess that's one of the problems with only 30 levels.<br/>\n<br/>\nEqually, I'm afraid your saves are likely to be fairly sucky unless you're raging, and the way you've arrayed the classes means you'll be pretty restricted in how often you rage until late on in the build. I'll confess, my temptation would be to sacrifice WM and go for something like Barb 16/ Fighter 4/ CoT 10, but it ain't my build!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "cilginat",
      "avatar": "10758838_1513291018.jpg",
      "timestamp": "4:29 PM - Jan 03, 2018",
      "content": "<div><em>Ooops, </em>I wrote it in a bit of hurry, you are right WM levels need to be pushed down. On arelith Rage is changed so at level  12 you get tier 4 rage which adds 2d6 to your main hand weapon. But if you equip a two handed weapon it pushes it up 3 tiers and you get 2d10 added, which applies to your both off hand and main hand attacks since a double weapon is used. The higher tiers adds +1 damage each and next tier is at 16, so 12 levels of barbarian is enough. You are right about saves tho, and I'm not sure how to fix them on the build.<br/>\n<br/>\nMore info on arelith barbarian: <a class=\"postlink\" href=\"http://wiki.arelith.com/Barbarian\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Barbarian</a></div>"
    }
  ]
}