{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "261",
  "name": "Forest Blender - Ranger 26 / Fighter 12 / Assassin 2",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/forest-blender-ranger-26-fighter-12-assassin-2-t2272872.html",
  "author": "magaiti",
  "avatar": "10235222_1510287070.jpg",
  "replies": 17,
  "posts": [
    {
      "author": "magaiti",
      "avatar": "no_avatar.png",
      "timestamp": "12:38 PM - Jul 17, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Forest Blender<br/>\n<br/>\nThis is my heavy-armored hard-hitting dual-wielding killer machine.<br/>\n<br/>\nThere are numerous STR-based Fighter-Ranger combos, splashed with Assassin, Rogue or Shadowdancer, f.e.<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build280327.html#1985544\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... ml#1985544</a><br/>\nBut mine has highest AB and ability to effectively dual-wield in heavy armor.<br/>\n<br/>\n<br/>\nPlayable 1-40 PvE, mid-high magic<br/>\n<br/>\nEquipment desired (but not necessary): Ambidexterity item (f.e. Bracers of Locking Grip)<br/>\n<br/>\n<br/>\nRanger(26), Assassin(2), Fighter(12), Human, Alignment: Any Evil<br/>\n<br/>\nSTR: 18 (34)<br/>\nDEX: 10<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\n<br/>\n01: Fighter(1): Blind Fight, Power Attack, Cleave<br/>\n02: Ranger(1): Favored Enemy I, {Dual Wield}<br/>\n03: Ranger(2): Weapon Focus<br/>\n04: Ranger(3): STR+1, (STR=19)<br/>\n05: Ranger(4)<br/>\n06: Ranger(5): Knockdown, Favored Enemy II<br/>\n07: Ranger(6)<br/>\n08: Ranger(7): STR+1, (STR=20)<br/>\n09: Ranger(8): Improved Critical<br/>\n10: Ranger(9): {Improved Two-Weapon Fighting}<br/>\n11: Ranger(10): Favored Enemy III<br/>\n12: Ranger(11): STR+1, Expertise, (STR=21)<br/>\n13: Ranger(12)<br/>\n14: Ranger(13)<br/>\n15: Ranger(14): Improved Expertise (or IKD, or Toughness)<br/>\n16: Ranger(15): STR+1, Favored Enemy IV, (STR=22)<br/>\n17: Ranger(16)<br/>\n18: Ranger(17): Great Cleave<br/>\n19: Ranger(18)<br/>\n20: Fighter(2): STR+1, Two-Weapon Fighting, (STR=23)<br/>\n21: Fighter(3): Epic Skill Focus: Discipline<br/>\n22: Assassin(1)<br/>\n23: Fighter(4): Overwhelming Critical<br/>\n24: Fighter(5): STR+1, Great Strength I, (STR=25)<br/>\n25: Fighter(6): Devastating Critical<br/>\n26: Ranger(19)<br/>\n27: Ranger(20): Great Strength II, Epic Weapon Focus, (STR=26)<br/>\n28: Ranger(21): STR+1, (STR=27)<br/>\n29: Ranger(22)<br/>\n30: Ranger(23): Great Strength III, Bane of Enemies, (STR=28)<br/>\n31: Fighter(7)<br/>\n32: Fighter(8): STR+1, Armor Skin, (STR=29)<br/>\n33: Fighter(9): Great Strength IV, (STR=30)<br/>\n34: Fighter(10): Weapon Specialization<br/>\n35: Fighter(11)<br/>\n36: Fighter(12): STR+1, Great Strength V, Epic Weapon Specialization, (STR=32)<br/>\n37: Assassin(2): {Uncanny Dodge I}<br/>\n38: Ranger(24)<br/>\n39: Ranger(25): Great Strength VI, Epic Prowess, (STR=33)<br/>\n40: Ranger(26): STR+1, Epic Toughness I (or Favored Enemy V), (STR=34)<br/>\n<br/>\nHitpoints: 492<br/>\nSkillpoints: 271<br/>\nSaving Throws (Fortitude/Reflex/Will): 26/16/15<br/>\nSaving Throw bonuses: Spells: +4, Poison: +1<br/>\nBAB: 30<br/>\nAB (max, naked): 46 (melee), 31 (ranged) { -2/-4 when dual-wielding light/medium weapons}<br/>\nAB against FEs: 48 (melee), 33 (ranged) { -2/-4 when dual-wielding light/medium weapons}<br/>\nAC (naked/mundane armor/shield only): 20/31<br/>\nAC (dual-wielding naked/mundane armor only): 20/28<br/>\nSpell Casting: None<br/>\n<br/>\nBonus damage against FEs: 6(EWS) + 6(Ranger FE bonus) +2d6(BoE) = 12 + 2d6<br/>\nAverage damage with +12 STR and +5 Longsword: 18(str) + 12 + 2d6 + 5 + 1d8 ~ 46.5<br/>\n<br/>\n<br/>\nSkills:<br/>\nDisable Trap 1<br/>\nDiscipline 43(65)<br/>\nHeal 43<br/>\nHide 8<br/>\nMove Silently 8<br/>\nOpen Lock 1<br/>\nSpellcraft 21(23)<br/>\nSpot (or Listen) 43(42)<br/>\nTumble 40<br/>\nUMD 40(39)<br/>\nremaining skillpoints: 2<br/>\n<br/>\nNotes:<br/>\n - TWF (taken at fighter level) and ITWF (granted at ranger lvl 9) combined with Ambidexterity item allow full dual-wielding in heavy armor.<br/>\n - Assassin is taken to provide UMD/Tumble, avoiding cross-class penalty. Rogue might be better in the end (evasion)<br/>\n - I tried to take all the good stuff as early as possible: Tumble/UMD skilldump lvl 22, DevCrit lvl 25, BoE lvl 30, EWS lvl 36.<br/>\n - No spellcasting, as default Ranger spellbook is very weak.<br/>\n - Last favored enemy is taken at level 40, so can be easily changed via relevel.<br/>\n - Weapon choice should be based on PW you intend to play. With minimal feat swapping this toon can dual-wield kukris, but if medium weapons available are much better damage-wise, go with them. S&amp;B is always a choice when your AB/AC is not good enough.<br/>\n<br/>\nPros:<br/>\n - Great damage against favored enemies.<br/>\n - Can use dual-wield or S&amp;B style.<br/>\nCons:<br/>\n - Low Reflex/Will saves<br/>\n - No spellcasting<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:01 PM - Jul 17, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually, Rangers get Twf and Ambidexterity at lvl 1 and Improved Two Weapon Fighting at lvl 9 AS LONG AS THEY WEAR LIGHT ARMOR. Now, if you lower your Strength by 2, it will give you 6 stat points, which you can use to raise your starting DEX to 15. You will lose 1 AB and damage, but that's no big deal in this build. Next, lower your starting CON score to 12, that way you will have a starting DEX of 16. With 16 STR and 16 DEX, you can wear a Studded Leather armor and, by casting a Cat's Grace spell, you'll have 2 less AC than a guy with a Full Platemail armor. Or you can leave your CON as is and have 75% chance (depending on a Cat's Grace roll) to cap your DEX modifier allowed by the armor. Now if your server has DEX items, you can wear a Leather Armor and say a Belt of Agility +6, then have freedom and, with a Cat's Grace spell, have 1 less AC than a FP wearer. I wouldn't consider DWing medium Weapons.<br/>\n<br/>\nNow, you don't actually need more than 6 Fighter levels, or even 4 if you want to take Epic Weapon Specialization (otherwise it's better to go with CoT for the saves boost, although here you'd have to drop assassin because of the alignment conflict, but Rogue will do the same for ya).<br/>\n<br/>\nSo, you could go Ranger 32, Assassin 2 Fighter 6 and have 2 more Ranger Bonus Feats and 1 More FE, or Ranger 35 Fighter 4 Assassin 1 for 2 more FEs. FEs are good when in abundance, because if you have, say 8 FEs, you'll have +2 AB against all of them PLUS +2d6+8 damage against all of them (+12 from your STR, presuming you reduce your starting STR as I suggested and not factoring gear or weapon enhancements, and +6 from EWS), which will be FABULOUS. Not to mention that if you have more FEs, you'll hardly be in a place where there won't be any creatures that fit at least in one of your FE groups. That fact alone makes Devcrit VERY redundant, Imagine the sick damage output on a critical hit that this guy would do, and even more so with 6 attacks per round. In the Ranger 35 alternative, you would have 8 FE groups just from the multiples of 5 Bonus FEs. If you go straight Ranger, you can take BoE at lvl 21, then start taking Fighter levels for epic feats, taking the 4th Fighter level on a General feat level so you can take both WS and EWS. You won't have Tumble AC for a long time, but you'll kill things so fast that you won't need it that much.<br/>\n<br/>\nLet me sketch up an alternative so you can see more clearly what I'm talking about. I'll get back to you on this.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:49 PM - Jul 17, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Now, here is how I imagined this guy could be. In a way, he's close to TyrTemplar's build, but IMO a bit better because of the Light Armor usage and earlier BoE. Plus, she uses Fighter levels to attain pre-epic feats, while I use them to free up feats in epics, and therefore have more Great Strengths. <br/>\n<br/>\nI hadn't noticed that you didn't put Wisdom in, but to have access to the TWF feats, you will need the Cat's Grace spell (and a couple of DEX items, most likely):<br/>\n<br/>\nRanger(35), Fighter(4), Assassin(1), Human<br/>\n<br/>\nSTR: 16 (30)<br/>\nDEX: 14<br/>\nCON: 10<br/>\nWIS: 14<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Ranger(1): Expertise, Weapon Proficiency Exotic, Favored Enemy: Undeads, {Dual Wield}<br/>\n02: Ranger(2)<br/>\n03: Ranger(3): Knockdown<br/>\n04: Ranger(4): STR+1, (STR=17)<br/>\n05: Ranger(5): Favored Enemy: Elementals<br/>\n06: Ranger(6): Weapon Focus: Kukri<br/>\n07: Ranger(7)<br/>\n08: Ranger(8): STR+1, (STR=18)<br/>\n09: Ranger(9): Improved Critical: Kukri, {Improved Two-Weapon Fighting}<br/>\n10: Ranger(10): Favored Enemy: Constructs<br/>\n11: Ranger(11)<br/>\n12: Ranger(12): STR+1, Blind Fight, (STR=19)<br/>\n13: Ranger(13)<br/>\n14: Ranger(14)<br/>\n15: Ranger(15): Improved Knockdown, Favored Enemy: Dragons<br/>\n16: Ranger(16): STR+1, (STR=20)<br/>\n17: Ranger(17)<br/>\n18: Ranger(18): Improved Expertise<br/>\n19: Ranger(19)<br/>\n20: Ranger(20): STR+1, Favored Enemy: Outsiders, (STR=21)<br/>\n21: Ranger(21): Bane of Enemies<br/>\n22: Fighter(1): Armor Skin<br/>\n23: Fighter(2): Epic Weapon Focus: Kukri<br/>\n24: Fighter(3): STR+1, Epic Skill Focus: Discipline, (STR=22)<br/>\n25: Ranger(22)<br/>\n26: Ranger(23): Epic Prowess<br/>\n27: Fighter(4): Weapon Specialization: Kukri, Epic Weapon Specialization: Kukri<br/>\n28: Ranger(24): STR+1, (STR=23)<br/>\n29: Ranger(25): Favored Enemy: Elves<br/>\n30: Ranger(26): Great Strength I, Favored Enemy: Humans, (STR=24)<br/>\n31: Ranger(27)<br/>\n32: Ranger(28): STR+1, (STR=25)<br/>\n33: Ranger(29): Great Strength II, Favored Enemy: Dwarves, (STR=26)<br/>\n34: Ranger(30): Favored Enemy: Half-Orcs<br/>\n35: Ranger(31)<br/>\n36: Ranger(32): STR+1, Great Strength III, Favored Enemy: Halflings, (STR=28)<br/>\n37: Ranger(33)<br/>\n38: Assassin(1)<br/>\n39: Ranger(34): Great Strength IV, (STR=29)<br/>\n40: Ranger(35): STR+1, Favored Enemy: Giants, Favored Enemy: Magical Beasts, (STR=30)<br/>\n<br/>\nHitpoints: 396<br/>\nSkillpoints: 293<br/>\nSaving Throws (Fortitude/Will/Reflex): 22/18/18<br/>\nSaving Throw bonuses: <br/>\nBAB: 30<br/>\nAB (max, naked): 44 (melee), 33 (ranged)<br/>\nAC (naked/mundane armor/shield only): 22/32<br/>\nSpell Casting: Ranger(4)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 43(43), Discipline 43(63), Hide 43(45), Listen 40(42), Move Silently 43(45), Tumble 40(42), UMD 41(40)<br/>\n<br/>\nThis guy has 2 less AB than your build, but can cast all Ranger spells (Cat's Grace, Camouflage and Mass Camouflage, which STACK so you'll have +20 on HIde checks), and has 12 FEs, the main playable classes, monsters that have DR and immunity to Critical hits, and some others that you can commonly find. These are swappable, really, as it all comes down to where you'll play the build and what are the most common enemy types. Now, although he has 2 less AB, here is what his damage would be like MOST of the time:<br/>\n<br/>\n6 attacks per round on a 15-20/x2 (even more if you have, say a Wand of Keen Edge) threat Range, buffable weapons with Blade Thirst (makes them +3).<br/>\n<br/>\n1d4 Kukri damage becomes irrelevant as he will do: 2d6(BoE) +12(FEs) + 10(STR) + 6(EWS) + 1d6 (Death Attack) + 3 (Blade Thirst) PER ATTACK of damage. He will be pretty undetectable, wearing no shield and a light armor, with Camouflage and Mass Camouflage, even though his DEX score isn't all that great, except for True Seers. Factor in items and you can have +6 from capped STR, + FW wand from lvl 37 on, + any bonus damage the weapon has + GMW wands, etc... He will ABSOLUTELY OBLITERATE all his FEs, even if they are immune to criticals. It's just too much damage! And, having more FEs means that there will be less occasions in which he won't be doing bonus damage.<br/>\n<br/>\nIf you want to lower his Wisdom to 8, then you can re-increase your starting STR to 18 or raise CON and DEX a bit to be able to wear light armor. BTW, that is a very important part of this build, wearing Light Armor, otherwise you'll lose the ranger dual-wielding feats. In your character sheet, the feat is noted as Dual-wield, so you can read the description to check.<br/>\n<br/>\nOne last thing, Epic Skill Focus Discipline is droppable, so you can take Epic Prowess in its place and use that feat to take another FE for even more BoE usefulness. You can also delay BoE a bit more and take it with the Ranger Bonus Feat at Rgr 23, then rework things a bit, drop both ESF and one FE to get +1 STR modifier, but IMO BoE is sort of the core of this build, so it's best to take it as soon as possible. The effective difference is 1 AB<br/>\n<br/>\nAnyway, you lose DevCrit, Evasion, 80 HPs and 2 AB, but gain a total of 12 FEs, all Ranger spells (which are bad but can be useful to this guy) and earlier BoE damage. You say that your guy has the highest AB and damage and can dual-wield with a FP, which is true, but for that purpose you give up too much raw power. IMO it's better to leave this the way it is. and just in case, you can reach the EXACT SAME AB in this build by doing the following changes: Delay BoE to 23, drop ESF Discipline and one FE for 2 Great Strengths (+1 AB), then lower your DEX to 8 and Raise STR to 18 (+1 AB). This, however, would mean you would need to equip MANY DEX items to get your modifier to at least 4 (which is the lowest possible AC for a light armor wearer), or you can drop CON to 8, lose 40 HP and keep DEX at 10, so that with capped DEX you can wear a Leather Armor. You can replace Improved Expertise with Toughness to recover the lost HP. Or even, like I said before, drop your Wisdom, forget spells and find a way to cap DEX with only items. There are many alternatives to reach that AB.<br/>\n<br/>\nBasically, IMO you're giving up too much for not such a great benefit when you drop Ranger levels for not-needed Fighter levels and when you drop 6 Wisdom points to get your STR up higher, but each to their own.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "magaiti",
      "avatar": "no_avatar.png",
      "timestamp": "4:17 PM - Jul 17, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Bonus damage in NWN does not depend on number of FEs, but only on Ranger level, raising by 1 every 5 levels up to +9 at Ranger lvl 40.<br/>\nTherefore, there is no reason to take (32 Ranger/6 Fighter) over (30 Ranger / 8 Fighter), for example.<br/>\nBy taking 11 more ranger levels than me, you have raised your damage by 2, which is just enough to compensate for damage lost from dropping 4 strength.<br/>\n<br/>\n4-5 FEs should be enough as long as you know what enemies will give you trouble (or rather which ones you want to give trouble, which this build is about - bosses) you will fight at lvl 40. Say, Undead, Dragons and Constructs will cover most of Nordock bosses.<br/>\n<br/>\nAnd there is only so much non-FE epic feats (EWF, EP, BoE) worth taking at Ranger levels.<br/>\nIf you want 8+ FEs, you need a different build, maybe indeed dropping DevCrit for more Ranger levels. <br/>\nIn my build, DevCrit helps against all kinds of monsters not worth taking FE.<br/>\n<br/>\nI am well aware of Dual-Wield feat, and I intentionaly ignore it, because in heavy armor I will have 2 AC more and won't lose my armor bonus when flat-footed (that happens every so often in game, even if you are careful). Also, with heavy armor I won't need (m)any Dex items, thus i'll have more item slots for everything else. Dual-wield is a gimmick, not the selling point of this build. AB/AC/HP/damage per attack is.<br/>\n<br/>\nThis build is for places where 1-2 AB/damage, 2 AC and 80 HP is a big deal. When you are facing bosses, every bit counts (unless their AB is so ridiculously high it doesn't count).<br/>\nDual-wielding is for Dev-Critting quickly through weak enemies, while tough ones should be approached with Sword &amp; Board. If a monster is so tough your AС doesn't help, but for some reason it has lowish AB, then dual-wielding is again an option.<br/>\nHigh damage bonus helps greatly to overcome damage reduction you otherwise could not penetrate, like 40/+6 (with +5 being the best enhancement available).<br/>\n<br/>\nIf everything I have said about monsters I'm building this guy for sounds like a horror to you, well, that's what this build is about. This is not a meadow-hopping flower-picking kind of ranger build<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:09 PM - Jul 17, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Bonus damage in NWN does not depend on number of FEs, but only on Ranger level, raising by 1 every 5 levels up to +9 at Ranger lvl 40.\n</div></blockquote>\n\nI didn't know this, thanks for clarifying it, so it's 2d6 +8 with 35 Ranger levels, 2d6 +7 if you go for Ranger 32. I stand corrected. Perhaps you should edit the Wiki file on that, because it does say what you state here but there is no mention to what happens when you use a Ranger bonus feat to take another FE.<br/>\n<blockquote><div>Therefore, there is no reason to take (32 Ranger/6 Fighter) over (30 Ranger / 8 Fighter), for example.\n</div></blockquote>\n\nYes, there is, Caster Levels and dispellability. Even Mord's users might have problems dispelling a 32nd lvl caster, as the Breach effect won't affect Ranger spells, but that is a minor benefit, and one that doesn't apply to your build because you don't use spells.<br/>\n<blockquote><div>By taking 11 more ranger levels than me, you have raised your damage by 2, which is just enough to compensate for damage lost from dropping 4 strength.\n</div></blockquote> <br/>\n<br/>\nThe STR drop is undoable by relinquishing spellcasting like you did and dropping ESF: Discipline and one FE. And in that case, I'd have +2 damage than your build.<br/>\n<blockquote><div>4-5 FEs should be enough as long as you know what enemies will give you trouble (or rather which ones you want to give trouble, which this build is about - bosses) you will fight at lvl 40. Say, Undead, Dragons and Constructs will cover most of Nordock bosses.\n</div></blockquote>\n\nThis is a server specific thing. On WoG there are ALL KINDS OF BOSSES. Dragons, Outsiders, Drow, Giants, Humans, Dwarves, etc... So you need more FEs for sure.<br/>\n<blockquote><div>And there is only so much non-FE epic feats (EWF, EP, BoE) worth taking at Ranger levels.<br/>\nIf you want 8+ FEs, you need a different build, maybe indeed dropping DevCrit for more Ranger levels. <br/>\nIn my build, DevCrit helps against all kinds of monsters not worth taking FE.\n</div></blockquote>\n\nWell, you CAN have Devcrit in my build alternative, but IMO it wouldn't be cost-effective. Firstly because, as I mentioned, you will do a crapload of damage by default on a STR-based Ranger with WS. Drop Expertise (or Blind Fight), Weapon Proficiency Exotic (or Improved Knockdown) and Improved Expertise for Power Attack, Cleave and Great Cleave, then two FEs in Ranger bonus Feats to take Armor Skin and Epic Weapon Focus (which would delay them a bit) and use the Fighter 1 and Fighter 2 Bonus Feats for Overcrit and Devcrit. <br/>\n<blockquote><div>I am well aware of Dual-Wield feat, and I intentionaly ignore it, because in heavy armor I will have 2 AC more and won't lose my armor bonus when flat-footed (that happens every so often in game, even if you are careful). Dual-wield is a gimmick, not the selling point of this build. AB/AC/HP/damage per attack is.\n</div></blockquote>\n\nGood that you know, just checking . Still, with more FEs and hence better Listen checks against your opponents, being caugh flat-footed is unlikely at best. And if you do, there is always the 32 / 6 / 2 alternative, which will allow you to have Uncanny dodge, and therefore retain your DEX bonus when when Flat-footed, resulting in the effective loss of 1 AC DEPENDING ON EQUIPMENT. With 14 starting DEX, it caps at 26, which will give you a +8 DEX modifier, combined with a padded armor (1 Armor bonus +8 Max DEX modifier), you will match the exact AC of your build. This will also increase your Ranged AB, which can be used to pull monsters away from the pack in some servers. But it will cost you item slots.<br/>\n<blockquote><div>This build is for places where 1-2 AB/damage, 2 AC and 80 HP is a big deal. When you are facing bosses, every bit counts (unless their AB is so ridiculously high it doesn't count).<br/>\nDual-wielding is for Dev-Critting quickly through weak enemies, while tough ones should be approached with Sword &amp; Board. If a monster is so tough your AB doesn't help, but for some reason it has lowish AB, then dual-wielding is again an option.<br/>\nHigh damage bonus helps greatly to overcome damage reduction you otherwise could not penetrate, like 40/+6 (with +5 being the best enhancement available).</div></blockquote>\n\nWell, I usually carry around different \"sets\" of equipment for every different situation. You can have one \"max dex-padded-armor/shield\" kit for some situations, a \"max str-dual-wield leather armor\" set and a few extra useful items (mostly DR belts and gloves of Epic Discipline, rings of Elemental Resistance) in order to be equipped for most if not all situations. That way you can still do pretty much what you said this build is supposed to do by switching up some gear slots. <br/>\n<br/>\nStill, may I suggest that if you're going to keep your build the way it is set up, do the following alterations: Start with Ranger at lvl 1 for more skill points, Take Exotic weapon proficiency and rework your feats a bit, dropping either IKD or IE for it and delaying Weapon Focus to use Kukris for a higher threat range and so more devcritting possibility.<br/>\n<br/>\n<blockquote><div>If everything I have said about monsters I'm building this guy for sounds like a horror to you, well, that's what this build is about. This is not a meadow-hopping flower-picking kind of ranger build </div></blockquote>\n\nWell, we try our best to be neutral when building, but our in-game experiences and the characteristics of the servers we play in have a huge impact on how we look at the game. That is why you see your build as stronger than mine and vice-versa, when the truth is we're just looking at them with the eyes our experience has provided us with. Regardless, your build does make sense (except for the fact IMO you take too many Fighter levels), raising STR to the maximum possible to increase devcrit DC.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "magaiti",
      "avatar": "no_avatar.png",
      "timestamp": "6:00 PM - Jul 17, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think ranger epic bonus feats are messed up in NWN1 due to design/engine limitaitons. There was no way to differentiate the 2 feat progressions a ranger has in epics, general feats each 3 levels and FEs each 5 levels. As a result you can take any of those feats in any of those pregressions, but I suppose in PnP you can only take FE every 5 levels. Thats probably why damage bonus depends on ranger levels - its simpler to implement than counting different FE feats, and allows to keep bonus damage in check, since it was intended to only allow FE feat every 5 ranger levels.<br/>\n<br/>\nAlas, Armor Skin cannot be taken as Ranger bonus feat. I wish it could.<br/>\n<br/>\nBeing caught flat-footed can happen in combat, with no hiders involved. Every time you kill a foe and have no other in range, game will put you into flat-footed state, since \"combat is over\". However every so often other enemies are just inches away running at you and you get smacked in a fraction of a second. Your reaction time is limited by your reflexes and, um, lags, which also happen every so often.<br/>\nHeavy armor is just more lag-proof than DEX, unless you have uncanny dodge (which in my build will happen only by level 37).<br/>\n<br/>\nI have to start my build with a fighter level, if i want to start with 8 WIS.<br/>\nI admit I made the same mistake trying to improve my build at some point. \"Oh, look, I can get a few more points at 1st level if i go ranger. Oops I forgot why I have put fighter there in the first place\".<br/>\n<br/>\nThanks for the feedback!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "9:42 AM - Oct 09, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey, nice to see STR-based Rangers live on! <br/>\n<br/>\nBut no, it's not higher AB than mine (Naked AB 46 +2 Bane: 48 AB (Effective, no buffs or equipment), 4th level Ranger spells, 34 STR, and more HPs (over 500), making full use of the dual-wield kukris with bane, etc. vs. 7FEs (all playable races, PvP) -OR- in the Supernatural Hunter version, drop 1AB (2 Str) for 10FEs! Either way, crit on a 12 with keen Kukris and with all that FE/Bane, etc. thar be damage!). Rangers are all about the bane and dual-wield, no?  Still, I like the Dev.Crit angle (always did) and that's where yours differs. Might want to check out \"Devastating Baneblade\" ranger 26 / fighter 13 / rogue 1 (human) by DragonRaider69 which goes the dev.crit route. Seems to me that the Bard/RDD/FTR. Barbarian or Paladin (or FTR/WM/Bard or Rogue) excel when it comes to the Dev.Crit. (RDD strength for the DC, Paladin for the saves, etc., and/or WM for the crit threshold) but nice to see STR-based Rangers living on for sure!  <br/>\n<br/>\nLike it in theory, though, and would be happy to critique it for you, but dare I admit I haven't had time to play in a bit, my old games and so forth all saved on a different comp that crashed. Seems I've been inspired to remedy the situation and load up again; great to see the community continues, and that the love of building and playing of course continues. Yeah, NWN is great, and look forward to playing again ... (Sure there's new worlds to conquer, with updates/rules to adapt for. Sounds like fun, and yours is an interesting build/angle.<br/>\n<br/>\nCrit ON, Crit ON! <br/>\nTyr<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "3:53 AM - Aug 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>magaiti wrote:</strong><hr/></div></blockquote>\n<div align=\"left\">Minsc approves! ;) (Oh, and Boo said to say \"Squeak!\")<br/>\n<br/>\n I found a very valuable lesson from this build, namely the power of simply having the Two-weapon Fighting feat. Be it from an item or part of the character, with a high enough unbuffed AB you're good enough at it for kicking out the jams. Sometimes, that's all I want from dual wielding, ya know? <span style=\"color:#000000\">With the 9th Ranger level and Ambidexterity from an item - now that's just plain ingenious!</span> I gained more XP as a builder from this thread.<br/>\n<br/>\n Makes me wonder if there's any build that aims for full plate dual wield in this manner, but with only 9-10 levels of ranger. I know there are plenty that do it for dual-wielding in light or no armor... Might be some synergy from taking all or most of the levels in epic, for better use of the bonus feats? Please reply if you have any comments on that. :)<br/>\n<br/>\n *gets shovel and buries thread again*</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:44 PM - Aug 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The Ranger gets both Two Weapon Fighting and Ambidexterity at level 1, and also Improved Two Weapon Fighting at level 9, but he loses those benefits if he wears heavy or medium armor.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "6:23 PM - Aug 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>The Ranger gets both Two Weapon Fighting and Ambidexterity at level 1, and also Improved Two Weapon Fighting at level 9, but he loses those benefits if he wears heavy or medium armor.</div></blockquote>\n<div align=\"left\">Ah, I understood it to mean that he would lose only the Dual Wield feat when not in light armor. I see.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:07 AM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The Dual Wield feat is both Two Weapon Fighting and Ambidexterity combined, with the light-armor-only restriction, so yes, Dual Wield is what you lose.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "10:03 AM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">OK, but not losing Improved Two-Weapon Fighting, then? Just wanted to make sure I understood this correctly; seems like it's what you're specifying and how I am reading magaiti. :) I can't think of any other build approaches I'd take where it would seem really useful to do what he's doing here, but it's still a nice twist of his to do so in this build. Well, I might have gone the same Ranger leves, CoT and Heavy Armor Proficiency, and replaced Assassin with Rogue (as he mentions) and done the dual wield twist, then. I'll look around to see if it's been done or just try it with his layout, TBH - just for when I feel like playing a ranger that I feel is Minsc-ish in \"RANGER SMASH!\" department. :P I've yet to find a ranger build I want to try, which is just sad (might have something to do with my preference for STR-based elven fighters with MAD and a low hit points pool from the -2 to CON). *Makes note to try something tomorrow*<br/>\n<br/>\n There are a lot of awesome ranger builds, but I just hate it when the best ones seem to go RDD - I despise the class that's more like a <em>race</em>; feels so super cheesy. <br/>\n<br/>\n Thanks for the edumucation, Empyre65! :)<br/>\n<br/>\n -JimDandy<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:31 PM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Be thankful that there are no Frenzied Berserkers at least Jim ;)<br/>\n<br/>\n But yeah, RDD feels cheap sometimes, basically even if you try it is very hard to make a bad build when it feautures RDD inside...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:17 PM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have always assumed that a Ranger will also lose Improved Two Weapon Fighting when wearing more than light armor, but I just looked it up in <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Main_Page\" rel=\"noreferrer\" target=\"_blank\">the NNWiki</a> and it doesn't say anything about that. Even if ITWF is not lost, it would be useless without the previous feats because the penalties on the AB are -6 for the primary hand and -10 for the off-hand.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:08 PM - Aug 12, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As for two weapon fighting, I guess the important point here was to get ITWF from Ranger (9), TWF from a fighter feat and Ambidexterity from an item. That way he will be able to dual wield in full plate with no penalties, and get away with a low dex (10).<br/>\n An interesting angle!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "9:19 PM - Aug 12, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I seem to recall reading somewhere that due to the Dual Wield feat at Ranger 1, you could take the Ambidexterity feat without meeting the 15 DEX requirement. I wonder if that is true (I keep forgetting and bothering to test for it); that could let you not rely on an item, which is handy in and of itself for a STR-based Ranger or other class (say a build for 40 where the 40th level is a Ranger level for a bonus feat).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "magaiti",
      "avatar": "no_avatar.png",
      "timestamp": "2:28 PM - Aug 28, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Fighter 10 / bard 4 / RDD 26<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2352276#.U_8fuGMuE1I\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... _8fuGMuE1I</a><br/>\n IMO this build seems suitable for tweaking, if you seek a build with 9-10 Ranger levels for dual-wielding in full plate.<br/>\n Make sure to take 10-th ranger level in epics, and take EWF.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:32 PM - Aug 28, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>magaiti wrote:</strong><hr/>Fighter 10 / bard 4 / RDD 26<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2352276#.U_8fuGMuE1I\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... _8fuGMuE1I</a><br/>\n IMO this build seems suitable for tweaking, if you seek a build with 9-10 Ranger levels for dual-wielding in full plate.<br/>\n Make sure to take 10-th ranger level in epics, and take EWF.</div></blockquote>\n<div align=\"left\">A default ranger can't dual-wield in full plate.  Not even using medium armor.  The only way would be to take all the general DW feats which is pretty much wasting feats (and I'm not even certain if the two DW feat \"versions\" would conflict, never having attempted it myself).  Stick to light armor for ranger DWing unless the environment has neutralized the armor prerequisite for the ranger class.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}