{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "760",
  "name": "Ghostly Sniper (Bard 11/ SD 2/ AA 27)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ghostly-sniper-bard-11-sd-2-aa-27-t2355245.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:41 PM - Nov 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I've been mulling over Arcane Archers again, and would welcome your thoughts on this one.<br/>\n<br/>\nMy previous foray into the class was a \"Gun 'n Run\" AA/ Monk. This one is more of a sniper, picking a position, unloading elven pointy death, vanishing, relocating, unloading elven pointy...you get the idea. You may even hear a spectral song echoing in her wake and announcing her arrival.<br/>\n<br/>\nNow, the problems (as far as I see them, anyway, you'll likely find others). Two crappy saves (Fort and Will both under 20). Rubbish in melee (not that she should be indulging in such a pedestrian activity), with no Finesse or Focus. Horribly feat-starved pre-epic - and I'd particularly welcome your advice here. I have four feats competing for three places, and all have their merits. Blind Fight. Has always been a must-have in my builds so far, but with elf vision and SD's dark vision, might it be sacrificed? Improved Critical. Does what it says on the tin and hard to ignore. Rapid Shot. More shooting, and the AB can easily handle it, so can't be a bad thing, can it? Called Shot. Slow the beggars down to give a more leisurely approach to dropping them, what could go wrong? Hence my dilemma.<br/>\n<br/>\nOn the plus side: an unbuffed AB of 59 with longbow, and plenty of damage to sit with it. A naked AC of 32, which ain't too shabby. HiPS and Uncanny Dodge (SD is actually taken more for the UD than the HiPS, for once - not that I'm complaining). Ample skill points. Bard Song level 11 for a boost all around.<br/>\n<br/>\nI've yet to check out other builds of a similar nature, nor have I factored in elf \"things\" yet. I thought I'd check the concept first.<br/>\n<br/>\nAnyway, here she is...<br/>\n<br/>\n<strong>Ghostly Sniper - Bard 11/ SD 2/ AA 27</strong><br/>\nElf - any non-lawful<br/>\nPvM 1-40<br/>\n<br/>\n<strong>Stats</strong><br/>\nSTR 12<br/>\nDEX 19 (38)<br/>\nCON 10<br/>\nWIS 8<br/>\nINT 14<br/>\nCHA 11<br/>\n<br/>\nHPs: 298<br/>\nAC: (naked - not worked out anything else yet) 32<br/>\nSaves: Fortitude 19, Will 18, Reflex 40 (all +8 vs spells)<br/>\nBAB: 27<br/>\nAB: (max, ranged, mundane longbow) 59, 54, 49, 44. (max, melee) 29<br/>\nBard Song 11 and UMD (and a wee bit of spelling)<br/>\nSPs: 262. Hide 43, Listen or Spot 43, Lore 4 (15), Move Silently 43, Perform 18 (18), Spellcraft 38 (40), Tumble 40 (54), UMD 33 (33)<br/>\n<br/>\n<strong>Levelling</strong><br/>\n1 B1 - Point Blank Shot<br/>\n2 B2<br/>\n3 B3 - Dodge<br/>\n4 B4 - DEX+1 (20)<br/>\n5 B5<br/>\n6 B6 - Mobility<br/>\n7 SD1 - (HiPS)<br/>\n8 SD2 - DEX+1 (21)/ (UD I)<br/>\n9 B7 - WF: Longbow<br/>\n10 AA1<br/>\n11 AA2<br/>\n12 AA3 - DEX+1 (22)/ One of BF/ ICrit: Longbow/ RS/ CS<br/>\n13 AA4<br/>\n14 AA5<br/>\n15 AA6 - One of BF/ ICrit: Longbow/ RS/ CS<br/>\n16 AA7 - DEX+1 (23)<br/>\n17 B8<br/>\n18 AA8 - One of BF/ ICrit: Longbow/ RS/ CS<br/>\n19 AA9<br/>\n20 AA10 - DEX+1 (24)<br/>\n21 AA11 - EWF: Longbow<br/>\n22 B9<br/>\n23 AA12<br/>\n24 AA13 - DEX+1 (25)/ Great Dex I (26)<br/>\n25 AA14 - Epic Prowess<br/>\n26 AA15<br/>\n27 AA16 - Great Dex II (27)<br/>\n28 AA17 - DEX+1 (28)<br/>\n29 AA18 - Great Dex III (29)<br/>\n30 AA19 - Great Dex IV (30)<br/>\n31 AA20<br/>\n32 B10 - DEX+1 (31)<br/>\n33 AA21 - Great Dex V (32)<br/>\n34 AA22 - Great Dex VI (33)<br/>\n35 AA23<br/>\n36 AA24 - DEX+1 (34)/ Great Dex VII (35)<br/>\n37 B11<br/>\n38 AA25<br/>\n39 AA26 - Great Dex VIII (36)/ Great Dex IX (37)<br/>\n40 AA27 - DEX+1 (38)<br/>\n<br/>\nDo we think it's one worth pursuing?<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:53 PM - Nov 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"17770\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17770&amp;sid=d989719217df4611c08febe8cd1cfbcb#p17770\">↑</a><div class=\"responsive-hide\">Nov 26, 2019</div></cite>\nDo we think it's one worth pursuing?\n</div></blockquote>\nI think so<br/>\nWhat a smorgasbord of ECB building joy we have had recently. Two GDL builds, a Mick Dagger build and now a second build from Stag!<br/>\n<br/>\nI'm no AA expert (Mick Dagger has written a lovely guide on the class) but I think you almost certainly have a surplus of AB here and you could drop the AB somewhat to balance out the build including addressing some of the things you want to include in your build. <br/>\n<br/>\nWhich could be a lot, 1 AB essentially equals 2 great dexterity feats, so this is a lot of potential epic feats you could be including, say if you wanted the Base AB to be closer to 50.<br/>\n<br/>\nI'll list a few suggestions that come to mind, they are largely due to personal taste<br/>\n<details><summary>Spoiler</summary><strong>Starting stats</strong><br/><br/><br/><br/><strong>Epic feats</strong><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/></details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:49 PM - Nov 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There is nothing wrong with the concept here.<br/>\nI have even made builds with Bard 9/ SD 2/ AA 29. <br/>\nOrion is right about the high AB. You don't need that much AB for most purposes, except maybe for \"impossible\" boss fights against an extremely high AC. Enchant Arrow is not only about AB, it is also about damage, and with this kind of build it becomes the most important part of the damage. There is low strength for use with mighty bows, and even with strength items bows with more than mighty 5 may be hard to find. There is no SA, no EWS, no Bane weapon etc. Bard song adds a small bonus to damage and you may use arrows with a damage bonus, but EA is your main source of damage.<br/>\nSD indeed gives Uncanny dodge and Evasion, but don't underestimate HIPS. When I play this kind of archer, stealth and HIPS become the main means of crowd control. It is indeed a \"sniper\" build and it is fairly easy to solo.<br/>\nNow there is an option to take 10 levels of SD (Bard 8/ SD 10/ AA 22) and qualify for Epic dodge. That is a better defensive build, but The EA damage is not as good.<br/>\nCalled shot is not a main strategy with this build, but it can be useful against true seers to slow them down.<br/>\nYou are right about the saves, Fort and Wis are very bad, and there is not much you can do about it build wise. Gear and spells may offer the protection you need.<br/>\nI found one error in the build-draft: SD can not come before lvl 8 - you need 10 ranks of Hide first.<br/>\n<br/>\nPS: You struggle with 4 feats you want in 3 pre epic slots. It is possible to aim at dex 36. You can replace a Great dexterity feat with one of the feats you want in. To even off the dexterity, one option is to take Armor skin, another is to start with 1 less dexterity and spend the buy points elsewhere.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:41 PM - Nov 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Many thanks, both. I'll now go away with some damp towels for my head and try to see if I can come up with something better.<br/>\n<br/>\nMy initial thinking was that with EA not counting towards the +20 AB cap I should push it, thus allowing other types of gear to enhance other areas further without too much worry, but I will take sage counsel on this.<br/>\n<br/>\nI probably should have mentioned at the outset that - me being me - I was never looking for caster stuff here. And nor, this time, was I wanting any sort of tankiness. If I'm getting hit, I'm not playing the build properly. Hence no Toughness as a consideration - nor indeed Armour Skin. And I even contemplated dropping CON down to 8 and bumping Strength to 14. That said, I did have a look at a Bard 9/ SD 2/ AA 29, and it was a bit too scary for me - you know, just in case, spacing the Tumbles out more reasonably. Oh, and I really don't like taking pre-epic feats in epic levels (and for that I blame most of the great and the good - yes, Mick, Empyre and Valerfor, I'm looking at you).<br/>\n<br/>\nAnd apologies for misplacing SD1 - that's just me and some pencil and paper issues - I'll sort it.<br/>\n<br/>\nGood to know we may have a future here. Right, time for towels and scotch (for creative purposes only, obviously).<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}