{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "155",
  "name": "Ranger/assassin/?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ranger-assassin-t2354542.html",
  "author": "campgod",
  "avatar": "10577588_1510287072.jpg",
  "replies": 9,
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "10:39 PM - May 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello all long time no type,<br/>\n  <br/>\n Took a break but now I am back. Looking for a Ranger/Assassin something...Yes i have a thing for Ranger/Assassins.... I was looking at Val's Night-Raider and liked the lvl split. So prob something along those lines with high lvl of assassin. My thoughts are I was thinking of a range dexer with high spot and listen. Assassin at lvl 8 get HiPS so thinking most of my damage is going to be from Death attacks in and out of the shadows. I really want to be stealthy too. Would a few lvls of Sorc help? I like ranger for the FE bonuses and the two spells camouflage and one with land, which should help with the steathly part. Race, What would be better Elf or Halfling? I want to be able to see people sneaking around as well as be a good sneaker as well.<br/>\n I am planning this for PvP. I can re-lvl once i get to 40 then change some feats if need be. I know I am forgetting something, just rusty from being gone. Thanks for any ideas and your time. Good to be back.<br/>\n<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "10:42 PM - May 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just saw the advice on the a topic a few down the page about the same thing...but any advice is welcomed, ty. I really miss the old Epic character search engine, where you can put in what classes and they would pop up all that mtached it...the good old days,lol<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:48 PM - May 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi campgod!<br/>\n Let me remind you of this one: <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2296845/Night-Talon-DualWieldHiPs-Ranger10-Assassin29-SD1\" rel=\"noreferrer\" target=\"_blank\"> Night Talon </a> by Tyr Templar.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gotanp",
      "avatar": "no_avatar.png",
      "timestamp": "1:34 PM - May 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Campgod, don't also forget that on your server you get a good bonus from only going 2 classes or even 1 class. So going 10ranger/30 assassin is a good option<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "8:14 PM - May 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh i forgot about the bonuses for the 2 and 1 class. Thanks Mick, I totally forgot about this build I'll just change a few things to make it a sniper and It should be good to go. thanks you guys!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:52 PM - May 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So thinking 10 Ranger 30 Assassin. Now Halfling sounds cool...but I am guessing they can not use a longbow so is short bow will be alright or is Elf the better of the two races here so i can use a Longbow? Between I am looking up to see which will be best. Any thoughts on those races for this build? is the -2 str a big deal if I go halfling or wil the good-aim kinda make up for that?<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:10 AM - Jun 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><em>Good Aim</em> has nothing to do with bows.  That's for throwing weapons like sling, darts, etc.  <em>Small size</em> is what you should be comparing vs. elf.  For that matter, even gnome would work since there is no chance of XP penalty with that combo.  +1 AB/+1 AC for size.  Also, small size gains +4 skill checks for stealth and detection vs. medium hostiles so if sneaking is a major concern, go small.  Else, elf's <em>Keen Sense</em> can be HUGE if there are deadly and epic traps around.  Even if you can't disarm epics, you can send a sacrificial summon to trigger it, once spotted.<br/>\n<br/>\n TBH, high rogue or high assassin means you're commiting to sneak damage (or DA which is about the same thing damage-wise) so that small amount of STR damage means almost nothing.  Just like any Dexer, if you can't crit you will be relying on FEs for damage anyway.  Just set the STR to about the level where you can manage toting loot comfortably and that's about enough.  BTW, low STR doesn't affect saves but low CON (per elf) does.<br/>\n<br/>\n But except for the small stature benefits, unless you are starting with either 19 or 20 DEX, there is nothing to be gained beyond human except for those hin/elf racial goodies at the cost of a feat and 40 skill points.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:59 AM - Jun 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">With Halfling or Elf, you can get to 18 DEX with 6 fewer points spent, which you can then put in other abilities. That is still an advantage over Human, but maybe not worth the loss of a feat and 43 (not just 40) skill,points.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "1:11 AM - Jun 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good info Hip and Empyre65, Thank you.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:29 AM - Jun 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>That is still an advantage over Human, but maybe not worth the loss of a feat and 43 (not just 40) skill,points.<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Yup. The Grimoire is wrong but it still stuck in my mind for some reason. 4 at 1st rather than 1.  And I should be very aware of the skill boost because I've gotten bit more than once trying to level while shifted and in a hurry, then wondering why my skill schedule didn't match up.<br/>\n<br/>\n The other benefit of elf is the weapon proficiency that can help in an AA build to gain longbow/rapier as an arcanist without investing in Martial.  Not a factor with ranger, however.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}