{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "550",
  "name": "Druid 19 Monk 1 by fairouz33",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/druid-19-monk-1-by-fairouz33-t2355603.html",
  "author": "fairouz33",
  "avatar": "no_avatar.png",
  "replies": "0",
  "views": "77",
  "posts": [
    {
      "author": "fairouz33",
      "avatar": "no_avatar.png",
      "timestamp": "9:04 AM - Oct 20, 2020",
      "content": "<div><em>This is moved from another forum where it was posted by fairouz33 on october the 20th.</em><br/>\n<br/>\ni really appreciate this build guide for druids! <br/>\ni thought i'd share my favorite version of a zen archery druid. i have played it in a couple of the standard campaigns now with slight variations 1-30ish. will just give the 1-20 build. very playable all throughout, good power curve. not as crazy powerful as a melee buff monster cleric (melee cleric kinda ruined me from my first playthrough of the OC), but this is more fun imo.  focuses on pets/summons, buffs, and archery until you get more spell slots. then raining arrows &amp; aoe over your minions when you have empower and stuff. rapid shot, zen archery, and haste are great at 6 if you can find the monk robes or something.<br/>\n<br/>\nposting my version with just 1 monk level at 17, as i tend to not need wildshape until later when the pet AC lags behind. you do have an exp penalty after that. i have taken it earlier at 2, 7, or 12, if i want tumble and maybe monk specific AC or haste items. if i take the monk dip sooner, i'll use human and a sling instead. AC ends up higher that way too. could swap extend for silent spell for more casts of your favorite aoe also. have swapped tumble for persuade or lore, depending on the campaign\n<details><summary>Spoiler</summary>\n<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/></details>\n<em>Edit by Mick Dagger</em></div>"
    }
  ]
}