{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "625",
  "name": "Balok Bloodstring - The Lone Wolf: Ranger 20 / SD 1 / Rogue 19",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/balok-bloodstring-the-lone-wolf-ranger-20-sd-1-rog-t2355442.html",
  "author": "CZero",
  "avatar": "10759266_1585974228.jpg",
  "replies": 12,
  "posts": [
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "6:15 AM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">\"Seems people are always obsessed with doing the 'right thing.' With trying to prove they aren't an animal. If you ask me, staying alive is what separates us from the dead and that's all that matters.<br/>\nSure, as a kid I never dreamed I'd end up alone against the world with nothing but my instinct to survive. But to be honest, as a kid I never really dreamed at all.\" - Balok Bloodstring<br/>\n<br/>\nThroughout Nordock's taverns there are whispers of a dark menace in the Great Northern Forest, not far from Tobaro. Some tell tales of spirits of vengeance. Some of Drow, bent on killing anything of fairer complexion. And while the truth is certainly a lot less entertaining, it doesn't make it any less deadly. Balok Bloodstring was born a bastard to a local working woman in a brothel, his father dead before his first breath were he to listen to his mother. From the moment he could walk he was drawn to the outside, where he could be alone and answer to no one but himself. Not that he had much choice in the matter... Regardless, he grew up alone, exploring the dilapidated town on his own and avoiding the other children.<br/>\n<br/>\nSoon, he invented a game to see if he could pelt the kids with rocks and quickly hide away in some dark corner or behind a chimney if on the rooftops. At first he was merely caught and beaten senseless or chased into the woods where he'd sleep until dawn. Over time though, he began to understand the timing, the angles, the misdirection required to pull off such a feat. Before long there were tales of spirits menacing the townsfolk with rocks and rotten food.<br/>\n<br/>\nAt some age, perhaps 10, maybe 12, his birth mother died of some disease as it were. It then came as no surprise to Balok that he was suddenly without a home. He took to exploring the world around him according to his rules and at his own pace. He found that a bow and arrow suited him well and he wasn't half bad with it. In fact, the better his skill, the less chances he'd ever have to worry about sword, axes, and all those other rudimentary tools people liked to use. His talent grew with every year, as he picked off bandits, rich nobles, animals, or whatever caught his fancy that would keep food in his belly. He became skilled enough through sheer dedication and hard work, that most assumed he had to be an elf. Probably some murderous Drow. This story grew to be the dominant tale, so much so that elves and other do gooders began to seek him out and learn of who this mysterious elven rogue was. Many an adventurer died exploring into the woods hoping to either make conversation or end his life. Balok never took the time to ask which as. Whether they came in peace or they came with malintent, Balok was the one who walked away.<br/>\n<br/>\nIn the end, adventurers slowly stopped looking for this mysterious figure, though there were always a few a year that hadn't gotten the memo. Still, any time Balok was in town he never missed a chance to hear tales of \"Bloodstring\" as the mysterious figure had come to be called. Sometimes Bloodstring was an undead elven archer with a divine bow seeking revenge on the living, other times he was the leader of a Drow regiment protecting some treasure, fortress, or who knows what. Whatever the case, nobody had ever laid eyes on Bloodstring, yet the thing they all seemed to be sure of was that he wasn't some scruffy human vagabond. That's for damned sure.<br/>\n<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202004/10759266_c095b01b066176672d2516c98752c051_t.jpg\" />\n</dl>\n</span><br/>\nBalok Bloodstring<br/>\n<br/>\nThis is my first attempt at a build, so I thought I would start off with something fairly straightforward that I am hoping can be played in most any setting with relative safety.<br/>\nI'm still play testing and hoping you guys can really help me make this build shine. End game viability is certainly something I am thinking this may struggle with, but I might find it's actually in leveling.<br/>\n<br/>\nStill, the basic premise is a ranged HiPS user which utilizes sneak attacks, traps, and his range to win at all cost with pride nor nobility weighing him down.<br/>\nPure survival no matter what it takes.<br/>\n<br/>\nAnimal companion I chose was a Hawk to bring home that he's basically on his own. A panther would also be neat for this with it's stealth abilities, but makes it feel more like a ranger than what is intended. <br/>\n<br/>\nI enjoy the sneak attack aspect because I felt it matched thematically and takes advantage of the HiPS combat cycle, two arrows with 12d6 sneak a piece, twice a round if you're quick with the HiPS, seems to put out pretty decent damage. I am building this for leveling on a Mid Magic PW that caps at 40 with Nordock Module. This means+5 gear is generally abundant, and once you start doing lvl 40 dungeons you can start to get tokens for the +6 gear. After that there is very rare socketable drops where you can go beyond that, but vast majority of lvl 40 players have a mix of +5 and +6 gear from what I can tell.<br/>\n<br/>\nBuilds I used to help get to the point I'm at:<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/gloom-razor-of-the-hin-rogue-24-divine-champion-10-t2355280.html\" rel=\"noreferrer\" target=\"_blank\">Gloom Razor of the Hin</a> - by grizzled_dwarflord<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=762#p762\" rel=\"noreferrer\" target=\"_blank\">Classic Archer</a> - by Valerfor<br/>\n<br/>\n<br/>\nTitle: Balok Bloodstring - The Lone Wolf<br/>\nClass: Ranger 20 / SD 1 / Rogue 19<br/>\nModus Operandum: Get the job done. Stealthily and without harm to oneself.<br/>\nRace: Human<br/>\nAlignment: Any (Neutral in my build)<br/>\nPlayable: 1-40 PvM, Low to Mid Magic<br/>\nXP Penalty: None<br/>\n <br/>\n<strong>Attributes:</strong><br/>\nStr 11 (12)<br/>\nDex 18 (30)<br/>\nCon 10<br/>\nWis 11<br/>\nInt 14<br/>\nCha 8<br/>\n <br/>\nLevel Guide<br/>\n<br/>\n01) Ranger (01): Point Blank Shot, Rapid Shot FE: [Human or your preferred]<br/>\n02) Ranger (02):<br/>\n03) Ranger (03): Called Shot<br/>\n04) Ranger (04): Dex 19<br/>\n05) Ranger (05): FE: [Undead or your preferred]<br/>\n06) Ranger (06): WF: Long Bow<br/>\n07) Ranger (07):<br/>\n08) Ranger (08): Dex 20<br/>\n09) Ranger (09): IC: Long Bow<br/>\n10) Ranger (10): FE: [Giants or your preferred]<br/>\n11) Ranger (11):<br/>\n12) Ranger (12): Dodge, Dex 21<br/>\n13) Ranger (13):<br/>\n14) Ranger (14):<br/>\n15) Ranger (15): Mobility, FE: [4]<br/>\n16) Ranger (16): Dex 22<br/>\n17) Ranger (17):<br/>\n18) Ranger (18): Blind Fight<br/>\n19) Ranger (19):<br/>\n20) Ranger (20): Dex 23 FE: [5]<br/>\n21) Shadow Dancer (1), Great Dex I<br/>\n22) Rogue (1) <em>Sneak Attack 1d6</em><br/>\n23) Rogue (2) <em>Evasion</em><br/>\n24) Rogue (3) Dex 25, Great Dex II,  <em>Uncanny Dodge I, </em><em>Sneak Attack 2d6</em><br/>\n25) Rogue (4)<br/>\n26) Rogue (5),  <em>Sneak Attack 3d6</em><br/>\n27) Rogue (6) EWF: Longbow, <em>Uncanny Dodge II</em><br/>\n28) Rogue (7) Dex 27, <em>Sneak Attack 4d6</em><br/>\n29) Rogue (8)<br/>\n30) Rogue (9) Armor Skin, <em>Sneak Attack 5d6</em><br/>\n31) Rogue (10) Improved Evasion<br/>\n32) Rogue (11) Dex 28, <em>Uncanny Dodge III, Sneak Attack 6d6</em><br/>\n33) Rogue (12) Great Dex III<br/>\n34) Rogue (13) Defensive Roll, <em>Sneak Attack 7d6</em><br/>\n35) Rogue (14) <em>Uncanny Dodge IV</em><br/>\n36) Rogue (15) Dex 30, Epic Dodge, <em>Sneak Attack 8d6</em><br/>\n37) Rogue (16) Improved Sneak Attack<br/>\n38) Rogue (17) <em>Uncanny Dodge V, Sneak Attack 9d6 (10d6)</em><br/>\n39) Rogue (18) Improved Sneak Attack II<br/>\n40) Rogue (19) Str 12, Improved Sneak Attack III, <em>Sneak Attack 10d6 (12d6)</em><br/>\n<br/>\n <br/>\nSkills: 356 total<br/>\nAppraise 1 (3)<br/>\nDisable Trap 43 (45)<br/>\nDiscipline 23<br/>\nLore 1 (3)<br/>\nHide 43 (53)<br/>\nMove Silently 43 (53)<br/>\nOpen Lock 43 (53)<br/>\nSearch 20 (22)<br/>\nSet Trap 43 (53)<br/>\nSpell Craft 18 (20)<br/>\nTumble 43 (53)<br/>\nUMD 35 (34)<br/>\n<br/>\n<strong>Combat Statistics:</strong><br/>\nBase AB: 31/26/21/16<br/>\nBase Ranged AB: 43/38/33/28<br/>\nRanged AB with +5 bow and +12 dex: 54/49/44/39<br/>\nBase Damage 1d8 (19-20 / x3)<br/>\nSneak Damage: 12d6<br/>\nAC: 30 naked<br/>\nAC: 55 with +5 armor, boots, amulet, cloak, haste<br/>\nAC: 60 with above and +12 dex through gear (with hips and epic dodge, this should be enough at lvl 40)<br/>\nAC: 68 with sling and TS +5 (still has respectable 51/46/41/36 ab in this mode not counting +5 if against a FE)<br/>\nHP: 332<br/>\n <br/>\n<strong>Saves:</strong><br/>\nFort: 22<br/>\nReflex: 26<br/>\nWill: 16<br/>\n <br/>\n<strong>Pros:</strong><br/>\n·       A ranged HiPS user, I just like this idea. If you are patient you can survive almost any fight aside from true sight users. For those we group or run away =D<br/>\n·       Being ranged with HiPS allows you a moment to realize you've pulled aggro without having to get hit first like a melee use might need.<br/>\n·       Epic Dodge and a very respectable AC level means you should be dying very far and few between.<br/>\n·       AB is not far off an AA build from what I can tell.<br/>\n·       With even halfway decent dex gear, will be able to set Epic Traps, Deadly Traps will be a breeze.<br/>\n·       Disable all traps, Unlock Heaven itself if you wish. Wide range of skill points to use as you wish.<br/>\n·       UMD for Dodge Boots +5, Scrolls, and Wands. This opens up options for gear on PW's.<br/>\n<br/>\n<strong>Cons:</strong><br/>\n·       Saves, I think the first thing that might be worth focusing on for my build is raising the saves, unless I am not understanding how to calculate these properly?<br/>\n·       Without sneak attack let's face it, your damage isn't going to be great, but there are many ways to get Sneak Attack going through UMD use or if in a party.<br/>\n·       Spells, you have none... Ranger was only really taken for the excellent AB up to 20 along with FE giving us some free AB towards very common enemy types (I chose the ones I happen to know I'll be hunting during those portions of lvling along with some of the end game dungeons.) That being said, this ends up being a very vanilla play style with the only real interactions being when to use hips, to use rapid fire or not, and whether you should shoot the arms or legs. That's sort of the point though.<br/>\n <br/>\n<strong>Combat Strategies: </strong>(I like the way grizzled_dwarflord did this part)<br/>\n·       When solo, use traps, take your time, make the enemy fight to your specifications. You gain more xp per minute alive than you do dead.<br/>\n·       Sneak attack or don't attack. Balok couldn't care less about fighting fair or proving he can go toe to toe with anyone or anything.<br/>\n·       UMD is invaluable and almost like a cheat button. Wands and Scrolls open up an immense number of options on how you want to play and nothing is off limits for Balok. Well except... yeah, <em>nothing</em>.<br/>\n <br/>\n<strong>Notes:</strong><br/>\nI look forward to actually leveling this character. I think the grind to 20 will be about as basic as it comes, but should mechanically be sound. Once it hits Lvl 21 for hips the safety goes up, but damage likely will just slowly build from then on every 2 levels of rogue. Would love to get some feedback or other suggestion on a ranged HiPS user.<br/>\nI did search the forums but didn't find anything too similar, but apologize if that is just my own lack of ability.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "6:28 AM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'd really suggest trying to get bane of enemies...That +2 more to hit and 2d6 more damage would be good against all your favored enemies.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "6:34 AM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>gkorjax wrote: <a data-post-id=\"20396\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20396&amp;sid=380ce604cf985fed6a18f06199caed6f#p20396\">↑</a><div class=\"responsive-hide\">Apr 17, 2020</div></cite>I'd really suggest trying to get bane of enemies...That +2 more to hit and 2d6 more damage would be good against all your favored enemies.</div></blockquote>\nThanks for the input. By gaining 3 more levels of Ranger over Rogue, I'd be gaining 2d6 against only my favored enemies, but losing 2d6 sneak attack against any enemy, right? I can definitely see how that could be beneficial if I'm against my FE and can't sneak attack, but otherwise it seems situational as well.<br/>\nCan damage from bane of enemies crit? If so that's certainly better than sneak die, but seems like you could go either way and I think build would be fine.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:26 AM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You also gain a +2 \"to hit\" against FEs.<br/>\n<br/>\nYou'd lose 2d6 against <em>sneak attackable</em> enemies.  So if you took FEs that are normally sneak immune, you would get the best of both worlds - undead, constructs, elementals, etc.<br/>\n<br/>\nYou would only be losing 1 level of Rogue, btw - you can pick up BoE at Ranger level 21.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "1:09 PM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Problem with 20 Ranger is this:<br/>\n21=BoE. Do it!<br/>\n23=Feat<br/>\n25=Feat and FE increase<br/>\n26=Feat<br/>\n<br/>\nBeing this close, at least get to 21. Maybe even 22, but both Ranger 22 and Rogue 18 are \"dead\" levels. You'll just have to consider if you need the skilldump in disciplone or not. If not, might as well go Rogue for skillpoints.<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "1:13 PM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh. Drop a point of STR in startup and move to DEX. Spells ain't all that, but sure beats a point in STR. So ending WIS 13.<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "2:03 PM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hail CZero!<br/>\nI would like to suggest that you drop Set Trap by 8 ranks, Tumble by 3 ranks, and consider dropping Open Lock some. Here's why:<br/>\nSet Trap - The toughest traps are set with DC 65. On a Take 20, a modified score of 45 gets it done.<br/>\nTumble - Provides +1 AC per 5 unmodified ranks. The 43 ranks in the build are exactly as effective as 40 ranks.<br/>\nOpen Lock - While I'm not familiar with the environment, I suspect that opening a DC 73 lock is overkill.<br/>\n<br/>\nIf another Ranger level were added late in the build, spare skill ranks could be invested in Discipline, a highly desirable skill.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "4:58 PM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would go ranger 16 / rogue 4 pre epic. That 1 AB lost could be retrieved at ranger 20 if you select epic prowess instead of a favored enemy, and the early playability of the build would be much better with pre epic skill dumps, earlier evasion and uncanny dodge, and that low sneak helps a bit too. Also by delaying those ranger levels you gain skilldump levels at the epics for discipline.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "6:43 PM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>hunearo wrote:</cite>I would go ranger 16 / rogue 4 pre epic. That 1 AB lost could be retrieved at ranger 20 if you select epic prowess instead of a favored enemy, and the early playability of the build would be much better with pre epic skill dumps, earlier evasion and uncanny dodge, and that low sneak helps a bit too. Also by delaying those ranger levels you gain skilldump levels at the epics for discipline.</div></blockquote>And if you don't want spells, you can dump Wisdom.<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:59 PM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Grimnir wrote: <a data-post-id=\"20407\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20407&amp;sid=380ce604cf985fed6a18f06199caed6f#p20407\">↑</a><div class=\"responsive-hide\">Apr 17, 2020</div></cite>And if you don't want spells, you can dump Wisdom.<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk</div></blockquote>\nBut only if you take Rogue at level 1, or you need the 11. I'm sure you knew that, but just in case...<br/>\n<br/>\nAnd, as others have advised, Bane is the holy grail of ranger feats: it would seem a shame to miss it for 1 or 2 more levels of the class. I do get what you say about improved sneaks, but it might be worth thinking about Crippling Strike to replace one of them - particularly if you pursue the Bane option. Just thoughts.<br/>\n<br/>\nED, HiPS and Bane - I can feel a warm glow all over...<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "1:54 AM - Apr 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for all the comments guys. I did heavily consider taking Ranger again at 40 to do a skill dump and get discipline.<br/>\nI will incorporate the changes suggested as I agree with them; though I do want to make mention that crippling strikes won't work with ranged as far as I know, so didn't include.<br/>\nI didn't honestly know that I could take rogue first level and bypass the 11 wis requirement. If that's the case I'll definitely take rogue level 1 to fix the stats. Str is in there for carry weight and to augment the damage from composite bows. On my server you can craft +5 mighty bows fairly easy and end game gear is might +10... so strength does matter, but can be acquired through spells too of course.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "7:31 AM - Apr 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you dump WIS, there is room for Strength. It feels a waste to have both on 11. Ranger spells aren't useless, but strength might (pun intended) serve you better.<br/>\n<br/>\nCan't believe I have never posted a Ranger26/SD1/Rogue 13. But someone probably has, though. Should be sweeeet.<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:34 AM - Apr 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Rog13/Rang26/SD1 and Rog16/Rang23/SD1 work well for both PvM and PvP. Bane makes up for the lost damage against any sneak immune enemies and thanks to the Ranger spellbook it has great stealth skills.<br/>\n<br/>\nThere are a few Rog/Rang/SD builds in the archives that might be worth looking at:<br/>\nRang21/Rog17/SD2 by Mithdradates. [<a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build123420.html\" rel=\"noreferrer\" target=\"_blank\">https://world-of-greyhawk.github.io/bui ... 23420.html</a>]<br/>\nRang23/Rog16/SD1 by Maximillian Kane. [<a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build316680.html\" rel=\"noreferrer\" target=\"_blank\">https://world-of-greyhawk.github.io/bui ... 16680.html</a>]<br/>\nRang26/Rog13/SD1 by Mithdradates. [<a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build197283.html\" rel=\"noreferrer\" target=\"_blank\">https://world-of-greyhawk.github.io/bui ... 97283.html</a>]<br/>\nRog10/Rang25/SD5 by harl3quin. [<a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build208636.html\" rel=\"noreferrer\" target=\"_blank\">https://world-of-greyhawk.github.io/bui ... 08636.html</a>]<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}