{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "369",
  "name": "The Rugged Mercenary (Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-rugged-mercenary-arelith-t2347991.html",
  "author": "NiuHaka",
  "avatar": "no_avatar.png",
  "replies": "21",
  "views": "2.5K",
  "posts": [
    {
      "author": "NiuHaka",
      "avatar": "no_avatar.png",
      "timestamp": "12:41 AM - Jan 03, 2014",
      "content": "<div>I'm in need of an alt for those times when my RL friends aren't online. Arelith rules and limitations apply.<br/>\n<br/>\nI'm looking for a heavily armored Human mercenary type who wields a greatsword or a bastard sword, whichever is mechanically superior. He will have some kind of special bond with his weapon so I'm thinking greatsword would be preferable so that there is more focus on weapon damage. He may be stuck soloing sometimes so survivability while killing monsters alone would be a plus.<br/>\n<br/>\nPart of this Character's journey will be to master/conquer his weapon so some WM seems like a good class to throw in there. My best guess so far is some Fighter levels and some WM levels but i really don't know what else. Having some casting levels doesn't seem to mesh well with the concept but i could possibly be persuaded to alter the concept if the build is good. Some of the Monk feats seem great and comes with things like cleave and Imp Knockdown (a personal favorite) which frees up some options for other useful feats. Having Rogue with Sneak Attack and Knockdown could be a really good mix too and seems to fit the concept quite well.<br/>\n<br/>\nAny help would be greatly appreciated.</div>"
    },
    {
      "author": "AmanoJyaku",
      "avatar": "no_avatar.png",
      "timestamp": "9:01 PM - Jan 03, 2014",
      "content": "<div>I'm sure some of the more experienced guys will shoot me down in flames for this, but have you considered Blackguard?  I've not played on Arelith, but having a quick look at the wiki I can see they're heavily into the RP element with some leveling restrictions.  Your character could be driven to insanity, evil and even consorting with demons in his pursuit of the ultimate weapon power.  <br/>\n<br/>\nThis gives you a fair few of the things you were looking for.  Sneak attacks &amp; IKD, no real casting but with the create undead &amp; summon fiend abilities for a bit of backup when you go it alone.  You can even poison your blade, if you're into that sort of thing.  I'd originally envisioned this as culminating in the mighty Devastating Critical (your char loves his sword, right?), but seeing as that would be \"against the law\", Overwhelming will have to do.  <br/>\n<br/>\nI had a quick look for similarish builds using the search engine, and there are a few, but they're for level 40 obviously.  Didn't see this class combo on the level 30 board.<br/>\n<br/>\nGiven the WM &amp; BG requirements this is by no means a great build but I had fun seeing if I could squeeze all the feats in, and by that time it was already done, so I thought I might as well post it.  On the down side, your AC and saves really suck, not much skill points to spare, bulls strength is your only buff and your summons probably won't last very long in serious combat.<br/>\n<br/>\n<br/>\n<br/>\nFighter 10/Weapon Master 7/Blackguard 13<br/>\n<br/>\nStats<br/>\nSTR 16 (24) <br/>\nDEX 13<br/>\nCON 12 <br/>\nINT 14 <br/>\nWIS 9 <br/>\nCHA 12 <br/>\n<br/>\nLeveling<br/>\n01 Fighter 1: - Dodge, Weapon Focus: Greatsword, Mobility<br/>\n02 Fighter 2: - Expertise<br/>\n03 Fighter 3: - Power Attack<br/>\n04 Fighter 4: - Weapon Specialisation: Greatsword<br/>\n05 Fighter 5: <br/>\n06 Fighter 6: - Spring Attack, Whirlwind Attack<br/>\n07 Weaponmaster 1: - Weapon of choice: Greatsword [Ki Damage]<br/>\n08 Weaponmaster 2: <br/>\n09 Weaponmaster 3: - Cleave<br/>\n10 Weaponmaster 4: <br/>\n11 Weaponmaster 5: - [Increase Multiplier, Superior Weapon Focus]<br/>\n12 Weaponmaster 6: - Improved Critical: Greatsword<br/>\n13 Weaponmaster 7: - [Ki Critical]<br/>\n14 Blackguard 1: - [Use Poison] <br/>\n15 Blackguard 2: - Great Cleave [Bulls Strength] <br/>\n16 Blackguard 3: - [Create Undead]<br/>\n17 Blackguard 4:  <br/>\n18 Blackguard 5: - Knockdown [Summon Fiend] <br/>\n19 Fighter 7:  <br/>\n20 Fighter 8: - Improved Knockdown<br/>\n21 Fighter 9: - Epic Weapon Focus: Greatsword<br/>\n22 Fighter 10: - Epic Weapon Specialisation: Greatsword<br/>\n23 Blackguard 6: <br/>\n24 Blackguard 7: - Great Strength<br/>\n25 Blackguard 8:  <br/>\n26 Blackguard 9:  <br/>\n27 Blackguard 10: - Overwhelming Critical <br/>\n28 Blackguard 11:  <br/>\n29 Blackguard 12:  <br/>\n30 Blackguard 13: - Epic Prowess, Armour Skin<br/>\n<br/>\n<br/>\n<br/>\nSkill Points: 165<br/>\nHide 5 (for BG), Intimidate 4 (for WM), Discipline 33 and I'd cross-class 13 (15) Spellcraft and 15 Tumble for +3 to AC and saves vs spells.  Just 58 to spare.<br/>\n<br/>\nFinal stats (mundane Greatsword &amp; Fullplate)<br/>\nAC 24 <br/>\nMax HP 330<br/>\nAB +37/+32/+27/+22<br/>\n<br/>\nDamage output<br/>\n2-12 +16 (Critical 15-20 x3 +1d6) <br/>\nSneak attack +4d6<br/>\n<br/>\nFortitude  19<br/>\nReflex      10<br/>\nWill         15</div>"
    },
    {
      "author": "NiuHaka",
      "avatar": "no_avatar.png",
      "timestamp": "11:55 PM - Jan 03, 2014",
      "content": "<div>From a mechanical standpoint this build would fit pretty well. However, I'm hesitant to play a Blackguard for this character. That class seems a little too driven by an agenda to be a good mercenary type. I'll let the idea simmer in my head for a while.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:36 PM - Jan 04, 2014",
      "content": "<div>I also don't like the fact that BG requires even more feats to qualify for and that you're using 3 melee-oriented classes with no UMD.<br/>\n<br/>\nI'd just go for Rogue. There are many possible combinations to do with Rogue, but I'm thinking Fighter 10 WM 16 Rogue 4 with all Rogue levels taken in epics.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "NiuHaka",
      "avatar": "no_avatar.png",
      "timestamp": "8:33 PM - Jan 04, 2014",
      "content": "<div>I'm almost thinking the same thing but I might like a few more rogue levels early on. On Arelith i'd be playing all the way through this thing and sneak attack (amongst other things) would make the life of the character more interesting along the way. This is all coming from a layman of course.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:13 AM - Jan 05, 2014",
      "content": "<div>If you want more Rogue, how about Fighter 10 / Rogue 13 / WM 7, or Fighter 12 / Rogue 11 / WM 7? I'd build it for you, but my computer that I use for playing and building is down right now.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "NiuHaka",
      "avatar": "no_avatar.png",
      "timestamp": "7:48 AM - Jan 05, 2014",
      "content": "<div>Fighter 12 / Rogue 11 / WM 7 seems good to me actually.<br/>\nI'll get my hands dirty and see if I can come up with a good starting point that we can work from.<br/>\n<br/>\nHuman<br/>\n<br/>\nSTR: 17 (26)<br/>\nDEX: 14<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 13<br/>\nCHA: 8<br/>\n<br/>\n01: Fighter(1): Power Attack, Dodge, Weapon Focus<br/>\n02: Fighter(2): Mobility<br/>\n03: Fighter(3): Knockdown<br/>\n04: Rogue(1): STR+1, [Sneak Attack]<br/>\n05: Rogue(2): [Evasion]<br/>\n06: Rogue(3): Blind Fight [Uncanny Dodge I, Sneak Attack 2]<br/>\n07: Fighter(4): Weapon Specialization<br/>\n08: Fighter(5): STR+1<br/>\n09: Fighter(6): Expertise, Spring Attack<br/>\n10: Fighter(7)<br/>\n11: Rogue(4)<br/>\n12: Rogue(5): STR+1, Whirlwind Attack, [Sneak Attack 3]<br/>\n13: Weapon Master(1): Weapon of Choice, [KI Damage]<br/>\n14: Weapon Master(2)<br/>\n15: Weapon Master(3): Improved Critical<br/>\n16: Weapon Master(4): STR+1<br/>\n17: Rogue(6): [Uncanny Dodge II]<br/>\n18: Weapon Master(5): Thoughness, [Increased Multiplier, Superior Weapon Focus]<br/>\n19: Weapon Master(6)<br/>\n20: Weapon Master(7): STR+1, [KI, Critical]<br/>\n21: Fighter(8): Epic Weapon Focus, Epic Weapon Specialization<br/>\n22: Rogue(7): [Sneak Attack 4]<br/>\n23: Rogue(8)<br/>\n24: FIghter(9): STR+1, Epic Prowess<br/>\n25: Fighter(10): Armor Skin<br/>\n26: Rogue(9): [Sneak Attack 5]<br/>\n27: Fighter(11): Great Strength<br/>\n28: Rogue(10): STR+1, Skill Mastery<br/>\n29: Rogue(11): [Uncanny Dodge III, Sneak Attack 6]<br/>\n30: Fighter(12): Great Strength, Improved Knockdown<br/>\n<br/>\nHP: 346<br/>\nSkill Points: 198<br/>\nSaving Throws (Fortitude/Will/Reflex): 16/10/19<br/>\nBAB: 23<br/>\nAB (Melee/Unarmed/Ranged): 36/32/26<br/>\nSneak Attack: 6d6<br/>\n<br/>\nDisable Trap 32(33), Discipline 33(41), Heal 33(32), Intimidate 4(3), Open Lock 31(33), Search 32(33), UMD 32(31)<br/>\n-------------------------------------------------------------------------------------------------------------------------<br/>\n<br/>\nI'm having a hard time figuring out what skills I really want and if it would be worth it to sacrifice a bunch of these for some Spellcraft.<br/>\n<br/>\nWith my other characters I've always maxed out Tumble but it seems to me that the Mobility feat has made tumble less important for this build. I could be completely wrong about that though.<br/>\n<br/>\nNone of the feats chosen depend on Power Attack. I have neglected this feat in the past in favor of Knockdown and I have never used them at the same time. Would it benefit this build to learn to use it or should I exchange it for something like \"Luck of Heroes\"?</div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "11:35 AM - Jan 05, 2014",
      "content": "<div>Hehe. If you don't grab tumble with those rogue levels, you will be one of the few on this board who wouldn't! In terms of attacks of opportunity, it's Spring Attack that is making tumble redundant. But, what 30 ranks in tumble gives you is +6 AC. That's a big deal for any melee build  (unless the tumble AC bonus is nerfed on Arelith, I guess). And, since your build is going to do his share of soloing and won't have a shield when wielding his greatsword, it's even more important to lower the damage you are taking each round. <br/>\n<br/>\nRegarding skills, this will be very dependent on the environment and your play style. Unless sneakers are rare on Arelith (or you plan on having true sight from an item), I would trade some of that search for spot. In addition, it's a little surprising that you have taken Skill Mastery without investing in set trap. Being able to lay a mine field is a great backup plan when facing foes who are hard to hurt or who are hurting you too fast to take on directly. Of course, that is a play style thing and many players don't have the patience to set traps. <br/>\n<br/>\nBTW, unless Arelith has lots of tough locks and traps, you could trade out some of those points in open lock and disable trap to free up some skill points for other skills, like tumble and set trap. Spellcraft isn't a bad idea since your will save is going to be poor, but those 30 skill points will only buy you a +3 save by the end of your career. And, also with that in mind, you might consider Slippery Mind for your rogue feat or Improved Evasion, depending on whether you have access to mind immunity items or scrolls. When soloing, failing a will save is often death.<br/>\n<br/>\nFrom my perspective, Power Attack is of very limited value on its own. However, it is a prerequisite for Cleave, which is a very nice feat. And, that extra full-AB attack when you are swarmed is even more important when soloing.</div>"
    },
    {
      "author": "NiuHaka",
      "avatar": "no_avatar.png",
      "timestamp": "4:10 PM - Jan 05, 2014",
      "content": "<div>I like the way you think. Tumble it is. I was considering investing in set traps but i've never used them and don't know their usefulness. I do want cleave but there isn't room in there early on because of how demanding WM is and Blind Fight is pretty much mandatory where it is so if I can't find a place for cleave i'll just get rid of Power Attack I think. How would you recommend I spread those skill points?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:39 PM - Jan 05, 2014",
      "content": "<div><blockquote><div><strong>NiuHaka wrote:</strong>I like the way you think. Tumble it is. I was considering investing in set traps but i've never used them and don't know their usefulness. I do want cleave but there isn't room in there early on because of how demanding WM is and Blind Fight is pretty much mandatory where it is so if I can't find a place for cleave i'll just get rid of Power Attack I think. How would you recommend I spread those skill points?</div></blockquote>\n\nI haven't had much time lately, but I'd move expertise to much earlier, maybe in place of Dodge. That +5 AC from the beginning will give you a good edge early on in some battles. Also, you can drop Toughness for Cleave, but the usefulness of it depends on how often you will get surrounded. If you're going to solo AND plan to get surrounded so as to make use of Cleave, I recommend a 1-handed weapon. Also, I'd alter the spread to F 10 Rogue 13 WM 7 for more skill points and skill dumps.<br/>\n<br/>\nThere's more, but I don't have time now.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "9:22 PM - Jan 05, 2014",
      "content": "<div>I see what you mean that the feats are pretty tight for this toon and it will be hard to get Cleave in there. I would be tempted to trade it for Toughness, but that's a judgement call. To me, the extra 30 HP isn't worth as much as an extra full-AB attack. If you don't go for Cleave, then dropping Power Attack is a good idea. I would be tempted to take Iron Will (or Strong Soul) for a bump to will saves, but the reality is that you will really have to rely on items for that. So, maybe take KD earlier and move Expertise earlier as well so that you can take something else at at level 9. Perhaps Disarm, since you are wielding a large weapon and will have high AB and you have Mobility to mitigate the AoOs. Perhaps IKD if Arelith has plenty of enemies that are bigger than large.<br/>\n<br/>\nThe skills are hard to advise on because they depend so much on the environment. I have never played Arelith, so I really don't know the lay of the land there. And, I don't just mean the rule changes, I mean how common certain things will be as one explores the module. E.g. are there lots of DC 42 locks? Do many areas have hard-to-find hidden doors? Are the traps easy or hard to spot? Do sneaky enemy NPCs enter stealth mode? Etc. That said, what follows is how I tend to think, based on my experiences in various SP modules and places like the World of Greyhawk.<br/>\n<br/>\nDisable Trap 12(15), Discipline 33(41), Intimidate 4(3), Open Lock 8(10), Search 18(19), Set Trap 11(15), Spot 23(22), Tumble 30(32), UMD 32(31), remaining skillpoints 27<br/>\n<br/>\nMost places have items that improve lock picking and trap disarming skills, so it really matters how many tough locks and traps one is going to encounter. I like to get set trap up to 15, so that all of the useful non-epic traps are settable. Because a toon gets take 20 for attempts outside of combat, I tend to think that disable trap is fine at 15 or so and that open lock is good at 10 or 15 (there are Knock scrolls for tougher locks on containers and thieves' tools for hard locks marked as plot and un-Knock-able doors). Actually, since Arelith nerfs the Knock spell for doors, how much open lock to take will really depend on how common tough locks are and how available items that increase the skill are.<br/>\n<br/>\nIf there are lots of hidden doors and so on, search may be a bit higher. In reality, most modules seem designed so that few areas require high search skills to find those hidey holes. And, most of the hidden objects allow a search check every few seconds or every time a toon walks near the hidden object, so there is more than one chance to find it, if one suspects something is nearby. Similarly, many AI scripts allow stealthy NPCs to enter stealth with fairly marginal stealth skills, so spot doesn't have to be really maxed to uncloak them. If there are many serious stealthers, then maxing spot can be worthwhile. Another option is a Watchman's Helm (sometimes available in shops) and true sight items, though I see that the TS spell is very short duration on Arelith.<br/>\n<br/>\nUMD is another variable to consider. If reliable scroll use isn't the goal, then the real issue is how many nice class- or race-restricted items are available? For low or low-mid magic modules, I find that I can use just about everything I want to with a modified UMD skill of 20 or so. But, scrolls require higher UMD skill to use reliably. (See <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/umd-scroll-use-particularly-for-non-arcane-casters-t2344857.html\" rel=\"noreferrer\" target=\"_blank\">this post</a> for some notes about that). Using the standard Bioware implementation for UMD scroll use, your toon will need a modified UMD of 33 to cast level 9 scrolls from spells without chance of failure. 28 is needed for level 4 scrolls, like Improved Invisibility and Stoneskin. Ironically, it is usually less critical that those lows or mid-level buff spells be cast reliably, since they are typically cast before combat and a failed skill check just means a wasted scroll. Having a failed cast of Greater Sanctuary or Time Stop can be a disaster. Anyway, my point is that, depending on the items available, you can skimp on UMD, unless you are counting on scrolls for buffing.<br/>\n<br/>\nWhen fleshing this out, I left 27 skill points unallocated. If one or two of the assumptions I have made above doesn't hold for Arelith, then spend them to make up the difference. E.g., if there are lots of sneakers, then keep spot maxed. If every other enemy is a taunter, then concentration becomes worthwhile for a melee toon. Etc.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:41 PM - Jan 05, 2014",
      "content": "<div>Great advice, EZ, as usual!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:41 PM - Jan 05, 2014",
      "content": "<div>Great advice, EZ, as usual!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:27 AM - Jan 06, 2014",
      "content": "<div>If you went with DEX 13 and INT 14, you'd get a whole other skill, and not lose any AC when wearing heavy armor.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "NiuHaka",
      "avatar": "no_avatar.png",
      "timestamp": "6:47 PM - Jan 06, 2014",
      "content": "<div>Ok, i've gone through and made some changes based on the great feedback.<br/>\n<br/>\nI got rid of Power Attack because I couldn't really fit in Cleave which is a pity because cleave is, in my opinion, the bread and butter of soloing weaker mobs. I've moved Knockdown up to level 1 and Expertise to level 3 so that I could put Disarm at level 9. I admit I'm scared of using Disarm in pvp due to the potential of OOC backlash but it adds one more thing I can do in combat which is good.<br/>\n<br/>\nAs for skill points, I've gone with MrZork's recommendations and ended up with more spare skill points from moving that one point of DEX to INT. Edit: Those \"Spare\" points aren't really spare points. I just have room to adapt to the needs of the server. I'll never feel like I have enough skill points.<br/>\n<br/>\nSTR: 17 (26)<br/>\nDEX: 13<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\n01: Fighter(1): Knockdown, Dodge, Weapon Focus<br/>\n02: Fighter(2): Mobility<br/>\n03: Fighter(3): Expertise<br/>\n04: Rogue(1): STR+1, [Sneak Attack]<br/>\n05: Rogue(2): [Evasion]<br/>\n06: Rogue(3): Blind Fight [Uncanny Dodge I, Sneak Attack 2]<br/>\n07: Fighter(4): Weapon Specialization<br/>\n08: Fighter(5): STR+1<br/>\n09: Fighter(6): Disarm, Spring Attack<br/>\n10: Fighter(7)<br/>\n11: Rogue(4)<br/>\n12: Rogue(5): STR+1, Whirlwind Attack, [Sneak Attack 3]<br/>\n13: Weapon Master(1): Weapon of Choice, [KI Damage]<br/>\n14: Weapon Master(2)<br/>\n15: Weapon Master(3): Improved Critical<br/>\n16: Weapon Master(4): STR+1<br/>\n17: Rogue(6): [Uncanny Dodge II]<br/>\n18: Weapon Master(5): Iron Will, [Increased Multiplier, Superior Weapon Focus]<br/>\n19: Weapon Master(6)<br/>\n20: Weapon Master(7): STR+1, [KI, Critical]<br/>\n21: Fighter(8): Epic Weapon Focus, Epic Weapon Specialization<br/>\n22: Rogue(7): [Sneak Attack 4]<br/>\n23: Rogue(8)<br/>\n24: FIghter(9): STR+1, Epic Prowess<br/>\n25: Fighter(10): Armor Skin<br/>\n26: Rogue(9): [Sneak Attack 5]<br/>\n27: Fighter(11): Great Strength<br/>\n28: Rogue(10): STR+1, Improved Evasion<br/>\n29: Rogue(11): [Uncanny Dodge III, Sneak Attack 6]<br/>\n30: Fighter(12): Great Strength, Improved Knockdown<br/>\n<br/>\nHP: 316<br/>\nSkill Points: 231<br/>\nSaving Throws (Fortitude/Will/Reflex): 16/12/18<br/>\nBAB: 23<br/>\nAB (Melee/Unarmed/Ranged): 36/32/25<br/>\nSneak Attack: 6d6</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:52 PM - Jan 06, 2014",
      "content": "<div>There is a problem with that build, man. Disarm without Improved Disarm generates an Attack of Opportunity. I would do the following:<br/>\n<br/>\nGo Fighter 10 Rogue 13 WM 7, get rid of Disarm and replace it with IKD, then take Crippling Strike with the Rogue 13 Bonus Feat (you will lose one fighter bonus feat and gain one Rogue bonus feat). You gain more Skill Points, +1d6 Sneak Attack damage, Crippling Strike and 2 more skill dumps, you lose disarm and delay EWS. IMO an EASY trade. I would even delay improved evasion for Crippling Strike there.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "NiuHaka",
      "avatar": "no_avatar.png",
      "timestamp": "9:55 PM - Jan 06, 2014",
      "content": "<div>Ouch yeah I completely skipped the AoO even though MrZork had mentioned it. I have a lot of reservations using Disarm in pvp anyways and I think i'd go for Knockdown over disarm on mobs in just about every situation. I like your recommendation and I even like the feats and skills a bit more.<br/>\n<br/>\nWould I benefit more from Iron Will or from Toughness on level 18?<br/>\n<br/>\nI've spread the classes with skill dumps in mind and i've ended up with an extra 47 skill points to allow room for adapting to the server.<br/>\n<br/>\nI'm sure there are still some tweaks that could benefit this build but it feels like its getting close. I'm liking it very much in fact. This is feeling very much like a Rugged Mercenary (and part time treasure hunter) to me.<br/>\n<br/>\nSTR: 17 (26)<br/>\nDEX: 13<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\n01: Fighter(1): Knockdown, Dodge, Weapon Focus<br/>\n02: Fighter(2): Mobility<br/>\n03: Fighter(3): Expertise<br/>\n04: Rogue(1): STR+1, [Sneak Attack]<br/>\n05: Rogue(2): [Evasion]<br/>\n06: Rogue(3): Blind Fight [Uncanny Dodge I, Sneak Attack 2]<br/>\n07: Fighter(4): Weapon Specialization<br/>\n08: Fighter(5): STR+1<br/>\n09: Rogue(4): Improved Knockdown<br/>\n10: Fighter(6): Spring Attack<br/>\n11: Fighter(7)<br/>\n12: Rogue(5): STR+1, Whirlwind Attack, [Sneak Attack 3]<br/>\n13: Weapon Master(1): Weapon of Choice, [KI Damage]<br/>\n14: Weapon Master(2)<br/>\n15: Weapon Master(3): Improved Critical<br/>\n16: Weapon Master(4): STR+1<br/>\n17: Rogue(6): [Uncanny Dodge II]<br/>\n18: Weapon Master(5): Iron Will, [Increased Multiplier, Superior Weapon Focus]<br/>\n19: Weapon Master(6)<br/>\n20: Weapon Master(7): STR+1, [KI, Critical]<br/>\n21: Fighter(8): Epic Weapon Focus, Epic Weapon Specialization<br/>\n22: Rogue(7): [Sneak Attack 4]<br/>\n23: Rogue(8)<br/>\n24: Rogue(9): STR+1, Epic Prowess, [Sneak Attack 5]<br/>\n25: Fighter(9)<br/>\n26: Rogue(10): Crippling Strike <br/>\n27: Rogue(11): Great Strength, [Uncanny Dodge III, Sneak Attack 6]<br/>\n28: Rogue(12): STR+1<br/>\n29: Fighter(10): Armor Skin<br/>\n30: Rogue(13): Great Strength, Improved Evasion, [Sneak Attack 7]<br/>\n<br/>\nHP: 308<br/>\nSkill Points: 243<br/>\nSaving Throws (Fortitude/Will/Reflex): 16/12/18<br/>\nBAB: 23<br/>\nAB (Melee/Unarmed/Ranged): 36/32/25<br/>\nSneak Attack: 7d6<br/>\n<br/>\nDisable Trap 11(15), Discipline 32(40), Heal 33(32), Intimidate 4(3), Open Lock 9(10), Search 18(20), UMD 21(20)  ---  Extra Adaptation Points 47</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:50 PM - Jan 06, 2014",
      "content": "<div>I would swap Dodge with Expertise, and Mobility with Blind Fight. Maybe take Dodge AND Expertise both at 1 and KD at 3 when your BAB will be a bit higher, cuz attempting KDs when your BAB is low, you'll miss most of the time, which brings me to the second point here. I'd delay the first Rogue level to 7th, because at level 6 Fighter-types get their second attack per round, which makes a HUGE difference. After you have that second attack and +6 to your BAB, Sneak Attack will be much more useful. Plus, you'll have all your bread and butter combat feats at that point, including WS, KD and the whole lot.<br/>\n<br/>\nHope this helps<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "NiuHaka",
      "avatar": "no_avatar.png",
      "timestamp": "11:09 PM - Jan 06, 2014",
      "content": "<div>That does sound like a better idea. I'll try that. Also, on Arelith, I won't be doing any combat until I'm level 3 anyways. It's made very easy to get to 3 without seing a single hostile npc or pc.<br/>\n<br/>\nI have one more question. I know i started this thread saying that I wanted a Greatsword but would this build benefit more from going Scimitar or dual Scimitars? This doesn't seem like a particularly strong build (I am a layman so be gentle if i'm wrong) so any advantage would be good.<br/>\n<br/>\n[/Edit]<br/>\n<br/>\nSTR: 17 (26)<br/>\nDEX: 13<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\n01: Fighter(1): Knockdown, Expertise, Weapon Focus<br/>\n02: Fighter(2): Blind Fight<br/>\n03: Fighter(3): Dodge<br/>\n04: Fighter(4): STR+1, Weapon Specialization<br/>\n05: Fighter(5)<br/>\n06: Fighter(6): Mobility, Spring Attack<br/>\n07: Rogue(1):  [Sneak Attack]<br/>\n08: Rogue(2): STR+1, [Evasion]<br/>\n09: Rogue(3): Whirlwind Attack, [Uncanny Dodge I, Sneak Attack 2]<br/>\n10: Rogue(4)<br/>\n11: Fighter(7)<br/>\n12: Rogue(5): STR+1, Improved Knockdown, [Sneak Attack 3]<br/>\n13: Weapon Master(1): Weapon of Choice, [KI Damage]<br/>\n14: Weapon Master(2)<br/>\n15: Weapon Master(3): Improved Critical<br/>\n16: Weapon Master(4): STR+1<br/>\n17: Rogue(6): [Uncanny Dodge II]<br/>\n18: Weapon Master(5): Iron Will, [Increased Multiplier, Superior Weapon Focus]<br/>\n19: Weapon Master(6)<br/>\n20: Weapon Master(7): STR+1, [KI, Critical]<br/>\n21: Fighter(8): Epic Weapon Focus, Epic Weapon Specialization<br/>\n22: Rogue(7): [Sneak Attack 4]<br/>\n23: Rogue(8)<br/>\n24: Rogue(9): STR+1, Epic Prowess, [Sneak Attack 5]<br/>\n25: Fighter(9)<br/>\n26: Rogue(10): Crippling Strike<br/>\n27: Rogue(11): Great Strength, [Uncanny Dodge III, Sneak Attack 6]<br/>\n28: Rogue(12): STR+1<br/>\n29: Fighter(10): Armor Skin<br/>\n30: Rogue(13): Great Strength, Improved Evasion, [Sneak Attack 7]<br/>\n<br/>\nHP: 308<br/>\nSkill Points: 243<br/>\nSaving Throws (Fortitude/Will/Reflex): 16/12/18<br/>\nBAB: 23<br/>\nAB (Melee/Unarmed/Ranged): 36/32/25<br/>\nSneak Attack: 7d6<br/>\n<br/>\nDisable Trap 11(15), Discipline 32(40), Heal 33(32), Intimidate 4(3), Open Lock 9(10), Search 18(20), UMD 21(20) --- Extra Adaptation Points 47</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:45 AM - Jan 07, 2014",
      "content": "<div>It looks good to me. I would go with scimitar and shield for still-pretty-good damage and better AC.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:55 AM - Jan 07, 2014",
      "content": "<div>You can't effectively dual-wield because 1- you need 15 DEX for Improved Two Weapon Fighting and 2- a Scimitar is a medium weapon, so it means you suffer a -4 penalty if you put it in your off hand. Forget about dual-wielding and heed Empyre's advice. Scimmy + board seems the best option for a soloer.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "NiuHaka",
      "avatar": "no_avatar.png",
      "timestamp": "2:31 AM - Jan 07, 2014",
      "content": "<div>Ok that's good. I don't like the idea of dual wielding. Just wanted to make sure I made this build as good as it could be. Thanks for the help guys.</div>"
    }
  ]
}