{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "473",
  "name": "Request for a NWN 1 Original Campaign build.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/request-for-a-nwn-1-original-campaign-build-t2206962.html",
  "author": "Sillyfish",
  "avatar": "10235222_1510287070.jpg",
  "replies": 1,
  "posts": [
    {
      "author": "Sillyfish",
      "avatar": "no_avatar.png",
      "timestamp": "12:48 AM - Mar 09, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">So, I'm clueless. What I'm hoping for is a brief guide that tells me what my stats need to be at creation, my class at creation, my feats at creation and then tells me what to do, level by level until level 20. Which I believe is the cap for the OC? Oh, by the way, I have the Diamond Edition of the game if that is important.<br/>\n<br/>\nAs yet, I don't know what I want to be, but I have narrowed it down to two possible combinations. <br/>\n<br/>\nFirst, is something I've never considered or thought about. That alone interests me greatly. I don't know anything about this build or what this small forum posts means, but it sounds fun. There are two quotes below of two posts. One is a suggestion, the other is an acknowledgement.\n<blockquote><div>\nFighter/ Weapon Master<br/>\nScimitar + Shield<br/>\ndev crit<br/>\ndone</div></blockquote>\n<blockquote><div>Yeah, that's a good one. Focus strength, get a keen scimitar and end up with 10-20/x3 crits. Even before epic brings devastating critical into play that's still a ton of damage. Go dwarf, always; half-orc isn't worth it even for a strength build, and the int requirement for Weapon Master makes it even worse.<br/>\n<br/>\nAnd yes, do keep the shield and stick with a one-hander. There is no animated shield property in NWN and the AC bonus of a magic shield makes a big difference.</div></blockquote>\n\nWould this build work? I like the idea of serious criticals.<br/>\n<br/>\nThe second possible build for me is something I am more familiar with. I have some experience with D&amp;D and Sorcerer is something that ha always appealed to me. This mysterious suggestion looks extremely curious. I'm picturing some spell blasting.. ninja.. thing. I'm probably way off, but maybe you guys know. <br/>\n<blockquote><div>Sorcerer 18+/Paladin 1/Monk 1. Best build in the game bar none.</div></blockquote>\n\nSo, having said all that, I'd love to hear your guys thoughts on this. Hell, if you guys consider the above two suggestions worth putting out a build for them I would love to see both. I don't want to sound greedy, but I may just play through twice just to experience the vast difference that I imagine these builds would be.<br/>\n<br/>\nCan't wait to hear from you!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:45 AM - Mar 11, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The fastest DevCrit WM build possible MUST be half-orc.  Only suitable for SoU/HotU.  Check your feats.  DevCrit isn't available until level 21, so the OC is out.  OC will probably end no higher than level 17 for any fighter-type class combo and it must be pure solo (no henchman... ever!) or level 16 is more likely.  You can easily sub in dwarf if you don't mind waiting 3 more levels (i.e. @lvl24) for DevCrit and it will cost an AB besides.  By that time, HotU is just starting the last (3rd) module.  IMO WM class itself is a waste in the OC due to all the veritably worthless prereqs in a short campaign, especially one with lots and lots of crit-immunes like the OC.  Your decision.  Here is the DevCrit one for 28 levels if you are interested:<br/>\n<br/>\nSoU/HotU Ftr 21/WM 7, Half-Orc, Any alignment<br/>\n<br/>\nSTR: 20 (28)<br/>\nDEX: 14<br/>\nCON: 8<br/>\nWIS: 8<br/>\nINT: 13<br/>\nCHA: 6<br/>\n<br/>\n<span style=\"color:#0000FF\">01: Ftr(1): Toughness, Expertise<br/>\n02: Ftr(2): WF: Scimitar<br/>\n03: Ftr(3): Dodge<br/>\n04: Ftr(4): STR+1 (21), WS: Scimitar<br/>\n05: Ftr(5)<br/>\n06: Ftr(6): Mobility, Spring Attack<br/>\n07: Ftr(7)<br/>\n08: Ftr(8): STR+1 (22), Whirlwind Attack <br/>\n09: WM(1): Power Attack, WoC: Scimitar<br/>\n10: WM(2)<br/>\n11: WM(3)<br/>\n12: WM(4): STR+1 (23), Cleave <br/>\n13: WM(5)<br/>\n14: WM(6)</span><br/>\n15: WM(7): Imp Crit: Scimitar<br/>\n16: Ftr(9): STR+1 (24)<br/>\n17: Ftr(10): Blind Fight<br/>\n18: Ftr(11): Great Cleave<br/>\n19: Ftr(12): Knockdown<br/>\n20: Ftr(13): STR+1 (25)<br/>\n21: Ftr(14): Overwhelming Crit: Scimitar, Dev Crit: Scimitar<br/>\n22: Ftr(15)<br/>\n23: Ftr(16): EWF: Scimitar<br/>\n24: Ftr(17): STR+1 (26), EWS: Scimitar<br/>\n25: Ftr(18): Epic Prowess<br/>\n26: Ftr(19)<br/>\n27: Ftr(20): Grt Str I (27), Armor Skin <br/>\n28: Ftr(21): STR+1 (28)<br/>\n<br/>\nHP: 280<br/>\nSaves (F/W/R): 13/9/15 (15/11/17 vs. spells)<br/>\nAB (max, naked): 38 (melee), 27 (ranged)<br/>\nAC (naked/mundane armor/shield only): 17/27<br/>\n<br/>\nSkills: Discipline 31(40), Intimidate 4(2), Spellcraft 9(10), Tumble 15(17), remaining ----&gt; 6<br/>\n<br/>\nNotes:  \n<ul><li>Approx. SoU levels in <span style=\"color:#0000FF\">blue</span>[/*:m]</li>\n<li>Levels schedule is based on pure solo combat.  Deduct approx. 10% XP per party member from total (eg. w/1 henchman, level 27 max). [/*:m]</li></ul>[/list]<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}