{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "472",
  "name": "Bard-Cleric/ArcherCleric/MeleeCleric (Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bard-cleric-archercleric-meleecleric-arelith-t2209822.html",
  "author": "EliHarel",
  "avatar": "10235276_1510287070.gif",
  "replies": 17,
  "posts": [
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "9:43 PM - Mar 19, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Someone suggested this concept and ever since it really excited me, for its RP. RP aside, I want it useful. Mostly for support, too - solo'ing is boring in a RP server. Things to consider about Arelith:<br/>\n- Level 30 max.<br/>\n- A low magic server. Most items by the end will be [+1Ability Score, +1 different ability score, and +1 AC if it's an amulet/boots...]. Armor/Shield/Helmet can be crafted to +3 AC, but with Magic Vestment it's a waste and might as well put there Ability Scores.<br/>\n- The best weapons to be found are: [+3 AB, +4 Elemental] And either +6Slashing/Piercing/Bludgeoning or Keen to add on the first two.<br/>\n- If you multiclass, you must first take three consecutive levels minimum in the new class. So, by the end, you can't have: 28Sorc, 2 Paladin. And the progress of levels must be three in a row. Meaning:<br/>\nFighter<br/>\nFighter<br/>\nFighter<br/>\nRogue<br/>\nFighter<br/>\nRogue<br/>\nRogue<br/>\n<br/>\nIs a <strong>no</strong>. It has to be:<br/>\nFighter<br/>\nFighter<br/>\nFighter<br/>\nRogue<br/>\nRogue<br/>\nRogue<br/>\nFighter...<br/>\n<br/>\n- There is a \"Gift\" system that allows you to add a permanet benefit to your character for the cost of an ECL, depending on the gift. Amongst many things, the most relevant for this matter, I suppose, are the ability scores:<br/>\n+2 STR (+1 ECL)<br/>\n+2 CON (+0.5 ECL)<br/>\n+2 DEX (+1 ECL)<br/>\n+2 INT (+1 ECL)<br/>\n+2 WIS (+1 ECL)<br/>\n+2 CHA (+1 ECL)<br/>\n<br/>\nI can take three different types (and then my ECL is maxed and I can't take anymore), and I can't take twice the same things. So you can keep this in mind when making the build if you'd like. These bonuses are not considered in the +12 Max bonus, they're just part of you.<br/>\n<br/>\n- Weapon buffs: they do not stack, and you cannot use them on a weapon that already has some property. Meaning: if a weapon has as much as +1 AB, you can't cast GMW, Keen Edge, Flame Weapon, anything. And, if it's a blank weapon and you do cast one of the buffs, any other buff will override. So you can't have a weapon with both GMW and Keen Edge, or Flame Weapon.<br/>\n<br/>\n<br/>\n<br/>\nAs for my build:<br/>\nI'd prefer not to wear armor, but if you find that it's really limiting, tell me so. If you think the armor is necessary, I'd like for a comparison between with armor and without.<br/>\nSecondly, I'd prefer not to take monk.<br/>\nThirdly... I wonder if, in such a build, I should focus on CHA and eventually take<strong> Divine Shield+Might</strong> too, or just leave CHA at 15 and focus on WIS/DEX.<br/>\nThe race doesn't matter (though elf is preferred - if it's a big difference, say so).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:15 AM - Mar 20, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Not a bad idea but you will need to commit to a focus of some sort because there are several viable ways to go... though I would probably lean towards a 15/15 split or something close to that for the avant-gardism.  If you wear robes w/o shield, you'll be able to steer away from Still Spells as there is a lot of merit in the arcane/divine possibilities.  Problem is that your ability spread will be very thin so first thing to do is decide what kind of spell repertoire you are willing to settle for and plan along those lines.  IMO, though going Divine Shield/Might is a possibility, it is going to be near impossible to give up 13 points to STR and still be able to focus on DEX without this toon being very stupid (stupid meaning: INT 8!).  I will not even mention the obvious problem with feat starvation it will cause.  <br/>\n<br/>\nNow, another easier method would be to just build a basic battle cleric (like Clc 24/Bard 6, for instance) using an enhanced bard for dumps and minor singing.  But that has been done to death which is why I suggested the casting hybrid version using 15/15.  But let me warn you ahead of time, you WILL run out of quickslots!  So you need to set some guidelines as to what you would like to do with this toon.  How important is Bard Song to your purposes... just for support or more serious party help?  How skilled would you like this creature to be?    A bard can max Discipline &amp; Taunt, very rare for many cleric builds but depends on how much melee is planned.  Figure 30 pts each for Tumble &amp; Spellcraft (&amp; UMD, also, if it is worth it on your server).  Bards are also decent with rogue skills if you feel that would be worth while though a stiff investment is not required.  So, the skill set scope (and the associated INT) needs to be explicit because, as I stated, abilities will be very thin.<br/>\n<br/>\nSo, as far as the ECL adjustments go...  I've never used them myself... so, do they change the final number of build levels?  You've stated that 30 is max, but what is the actual target? 30 or 29 \"with a gift\"?  And the 0.5 one is totally confusing to me since I have no idea how one could end up with a half of a level.  But you play it enough to make this clear for the rest of us.<br/>\n<br/>\nAre cleric domains restricted on Arelith or available as standard?  Explain restrictions, if they apply, please.<br/>\n<br/>\nOh, and if elf is handled like in vanilla, you won't be able to dump without incurring a 20% XP penalty since wizard is favored for elf by default.  Then you can decide if elf is worth the penalty but the race itself would infer a DEX build of some sort unless it just for koolness value.<br/>\n<br/>\nYou have a few decisions to make, I think.  Then we can start sketching.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "6:52 AM - Mar 20, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong>Not a bad idea but you will need to commit to a focus of some sort because there are several viable ways to go... though I would probably lean towards a 15/15 split or something close to that for the avant-gardism.  If you wear robes w/o shield, you'll be able to steer away from Still Spells as there is a lot of merit in the arcane/divine possibilities.  Problem is that your ability spread will be very thin so first thing to do is decide what kind of spell repertoire you are willing to settle for and plan along those lines.</div></blockquote>\nI think 15-15 is solid and refreshening enough. The spell repertoire... well, how many options are there? They'll mostly be buffs, and by level 30 I'll have plenty of opportunities to change them with the bard, and reorganize them with the cleric. And I can wear a small shield for an additional +6 AC (+1 Shield, +5 Magic Vestment) with only 5% spell failure and a bit of decency for the character - not wearing armor, but yes to tower shield? Not elegant.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong>IMO, though going Divine Shield/Might is a possibility, it is going to be near impossible to give up 13 points to STR and still be able to focus on DEX without this toon being very stupid (stupid meaning: INT 8!).  I will not even mention the obvious problem with feat starvation it will cause. </div></blockquote>\nI'm not sure, thanks to the Gift system. Say my beginning ability scores are:<br/>\n13 STR<br/>\n14 DEX<br/>\n10 CON<br/>\n14 INT<br/>\n15 WIS<br/>\n16 CHA<br/>\n<br/>\nI can add three [+2]s, so they'll be:<br/>\n13 STR<br/>\n14 -&gt; 16 DEX<br/>\n10 CON<br/>\n14 INT<br/>\n14 -&gt; 16 WIS<br/>\n13 -&gt; 15 CHA<br/>\n<br/>\nAnd be level 30, after +7 ability scores, they'll be:<br/>\n13 STR<br/>\n16 DEX<br/>\n10 CON<br/>\n14 INT<br/>\n18 WIS<br/>\n20 CHA<br/>\n<br/>\nI have ten items to equip, with up to two different [+1] ability score bonuses on each. Considering I'll have Maximized Cat's Grace with the Bard, I distributed them +7 DEX, +5 WIS, +8 CHA. So my ability scores with bonuses by 30 will be:<br/>\n13 STR<br/>\n23 DEX<br/>\n10 CON<br/>\n14 INT<br/>\n23 WIS<br/>\n28 CHA<br/>\n<br/>\nThrow in a maximized Cat's Grace and Eagle's Splendor, I have 28 DEX and 32 CHA. Correct me if I'm wrong, but I think these are decent enough for such a mixed build? With a modifier of 11, +3 Turn undead and +6 with Extra turning, I have 20 sets a day of Divine Might/Shield for +11. Now... as you can see, the entirely built is more or less directed to this, so I need to know if these two feats are really that worth it. I suppose 20 is enough to ignore the question of \"how much\". If you tell me that it's not worth the trouble, then my ability scores will probably look completely different and I'll have 4 different feats.<br/>\n<br/>\nThis is the main issue about the build that I can't decide upon.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong>Now, another easier method would be to just build a basic battle cleric (like Clc 24/Bard 6, for instance) using an enhanced bard for dumps and minor singing.  But that has been done to death which is why I suggested the casting hybrid version using 15/15.  But let me warn you ahead of time, you WILL run out of quickslots!  </div></blockquote>\n24-6 is megh. 15-15 is much more interesting to me.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong>So you need to set some guidelines as to what you would like to do with this toon.  How important is Bard Song to your purposes... just for support or more serious party help?  How skilled would you like this creature to be?    A bard can max Discipline &amp; Taunt, very rare for many cleric builds but depends on how much melee is planned.  Figure 30 pts each for Tumble &amp; Spellcraft (&amp; UMD, also, if it is worth it on your server).  Bards are also decent with rogue skills if you feel that would be worth while though a stiff investment is not required.  So, the skill set scope (and the associated INT) needs to be explicit because, as I stated, abilities will be very thin.</div></blockquote>\nIf the Divine Might/Shield is my main issue, skills are a close second. There are so many fun stuff to choose from! But first of all...<br/>\n1. Bard Song. What's the difference when you say \"support\" and \"serious party help\"?<br/>\n2. I think human might be best, both for an extra feat and another skill?<br/>\n3. Taunt is magnificent. Another +6 AB for my entire party, and myself - where my AB is already poor as it is. I think this one's a no-brainer?<br/>\n4. 30 Tumble I think is pretty clear as well, no?<br/>\n<br/>\nBy 30 I'll have (if human with 14 INT) 195 skills points to place around. 30 to Tumble, 33 to Taunt. That leaves me another 132. Here I need your help, there are just so many. Discipline? Concentration? Spellcraft? UMD? Perform? Heal? Listen? Lore? <br/>\n(A pause about Lore... in Arelith there are different languages, and the DC to understanding a foreign language is 41. With 40 Lore, you'll 95% of the time udnerstand everything being said. This is an awesome tool for RP so I'm considering placing 23 points in Lore just for the fun - 15Bard +2 INT +23investment. So that's a very possible -23 to the overall skill distribution, palcing us at 109).<br/>\nWiki says that for 15 Bard levels you need 24 Perform. Any more perform than that is redundant? Also, can I keep in mind CHA modifier when I put points in perform? If so I can save 9 points here with a constant CHA bonus (from items) of +9 (If I decide to focus on CHA).<br/>\n<br/>\nI have to go, friend's waiting outside. So I'll just say quickly:<br/>\nECL = XP penalty. Nothing more. I can still reach 30. And domains aren't restricted.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:53 PM - Mar 20, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>EliHarel wrote:</strong><br/>\nI think 15-15 is solid and refreshening enough. The spell repertoire... well, how many options are there? </div></blockquote> Well, until you explained the gift system more closely, it would have been dicey.  Since, according to how you explain it, you can bump abilities similar to the way RDD works except that you have freedom of choice, the WIS/CHA level and corresponding spell repertoire are easier to manage.<br/>\n<br/>\nThe Divine Shield/Might will cost 3 feats in this build... Power Attack and the 2 Divine ones, pre-epic, plus the commitment to STR 13 which IMO, for a cleric, is a waste unless going to Cleave, DevCrit, etc.  which is way beyond the scope of this build.  You'll be using Divine Power for the extra attack, STR 18 and buffing with empowered Bull's &amp; AoV to get STR to the +12 ability cap.  Extended AoV (3 turns) will also be helping your party, LOTS! <br/>\n<br/>\nTherefore, I would suggest targeting access to Level 8 cleric spells so that AoV can be extended.  Besides War domain, I would recommend Plant domain for Barkskin &amp; Creeping Doom though that offensive spell is tough to manage with a party unless they play close attention to its AoE.  For Clc 15, Barkskin will stack will all others AC for +5 (including for playmates, with enough slots in Level 2).  Depending on how well you can manage your DPs, Strength domain is with considering especially with CHA pre-buffed to use the special power to attain even loftier STR levels.<br/>\n<br/>\nIMHO, Maximized Spell is more difficult to manage since it will be imposing on your Level 5 slots.  Essentially, with each higher level of slots, having adequate spell diversity among them becomes all that more difficult so I always opt for empowered versions. But it is up to you, of course, and a matter of comfort level.  With items that add slots, it can become more manageable, as well, but my build suggestions will always reflect mundane equipment allowing the player to make adjustments for the custom environment.<br/>\n<br/>\nTravel &amp; Trickery are fairly worthless domains in this build with access to Imp Inv &amp; Extended Haste via arcane.  Just beware of the conflict between Imp Inv &amp; Sanctuary and use each according to the situation.<br/>\n<br/>\nThe pre-epic feat list would be Toughness, Blind Fight, Weapon Finesse, Wpn Focus/Imp Crit, Extend Spell, Empower Spell, Lingering Song (or Curse Song).  TBH, I can't find 3 of those feats to sacrifice for the DS/DM plan.  I deem all of them essential for an adequate meleer support buffer.  Besides, DS/DM is more for the toon than the party anyway. (Actually, I would LOVE to fit in both Lingering Song &amp; Curse Song but it ain't a-gonna happen in this build in pre-epic.)   In Epic, just for reference, I chose EWF, Great DEX, Armor Skin &amp; Epic Prowess. IIRC the base melee AB @30 was 29 &amp; ranged 26. <br/>\n<br/>\nSo, bearing that in mind, my split is STR 8/DEX 15(20)/CON 8/WIS 15(18)/INT 14/CHA 15 with Brd 8/Clc 12 pre-epic for BAB 15 (3 APR + DP + Haste = 5 APR buffed).<br/>\n<br/>\nSet your gifting plan so that your in-game STR level will be base STR+12 altered by how much you mind being restricted in carrying capacity (hehehe... what are friends for if not to haul all your loot around, eh?).  So, for instance, if you chose 2 gifts of STR (8+2), your playing STR would reach 22 + song mod.  CON is another area of merit to focus gifts since Fort saves will be your lowest saves... though buffing will neutralize this problem a lot.  Adding gift(s) to WIS also would be worthwhile for a support guy because more slots and Will saves is always handy. Obviously, +1 CHA will gain access to Level 6 bard spells and extended Ethereal Visage (one my favs!  ) Except for playing RDD, I have little experience managing artificial ability haks so you would know better than I the impact in-game. <br/>\n<br/>\nBottom line is:  I would totally ignore DM/DS and save my turning for Undead and vermin mobs.   <br/>\n<br/>\nFor reference, bard song 15 is: +2AB +3Dmg +2saves +16HP +4AC +3skills.  Figure this into your final evaluation of stats.<br/>\n<br/>\nNow, skills.<br/>\n<br/>\nWith INT 14, a 15/15 build will have about 200 pts to throw around.  My choice would be (in no particular order):<br/>\n<br/>\nPerform 22 (24) (you may be able to skimp here depending on gifting/item boosts) - Your target will be 24, in any event. And yes, more skill does absolutely nothing.  Just assure the 24 and your song will reach level 15.  A little extra never hurts just in case you get cursed, though.<br/>\nTumble 30<br/>\nSpellcraft 33 (35) for +7 saves vs. spells<br/>\nTaunt 33 (35) - Figure boosting this to 38 with Empowered Cat's + song mod<br/>\nConcentration 33 (32) - Will reach at least 40 with buffs &amp; song.  Helpful against casting against all ranged attacks.<br/>\nUMD 28 (30) - ...if you can benefit from it on your server.  You'll have access to all divine &amp; arcane items without it.<br/>\n<br/>\nSo that leaves about 55 points to spare.  Normally, I would ignore the usefulness of Discipline in a DEX build like this but with the ability to easily reach the +6 modifier, it is certainly a viable way to avoid getting KD'd or disarmed.  If maxed, it would be 33 (32) plus 6 from the Emp Bull's/AoV combo + song mod (+3).  38-41 on a level 30 is nothing to sneeze at, but it is your decision.  If you do max it, you will end up with 22 remaining to pass around as you deem most useful.  I have a particular bias for trap/lock handling but they would need to be xclassed in this build, unfortunately.\n<blockquote><div><strong>EliHarel wrote:</strong> <br/>\n1. Bard Song. What's the difference when you say \"support\" and \"serious party help\"?\n</div></blockquote>\nBard 15 vs. Bard 20.  Bard 20 will get a level 20 bard song and Lasting Inspiration.  That is a \"serious\" bard, IMO. Understand, your original request did not make it clear how \"supportive' you really wanted this toon to be. I believe the 15/15 split, though less supportive (boosts from a powerful bard song can NOT be dispelled!) has a more effective combat presence and better divine capabilities. \n<blockquote><div><strong>EliHarel wrote:</strong><br/>\n2. I think human might be best, both for an extra feat and another skill?</div></blockquote>Human is always the preferred race unless there are other mitigating factors (need I list them all?).\n<blockquote><div><strong>EliHarel wrote:</strong><br/>\n3. Taunt is magnificent. Another +6 AB for my entire party, and myself - where my AB is already poor as it is. I think this one's a no-brainer?</div></blockquote>\nA typical cleric's AB is NEVER EVER poor.  In other words, base AB is insignificant. Cleric AB is one of the highest in the game except for AA's &amp; WM's.  So the +6 benefit, though certainly handy to have as a stacking source, is not the prime reason for serious taunting IMO.  It is the innate spell failure against ALL casters, whether arcane or divine.  Problem is:  most casters have intrinsically high Concentration levels so it can be a simple dice roll result that determines whether the taunt check wins or not.  Without Epic/Skill Focus feats (again, IMO), taunting is unreliable.  And you must commit to close range to attempt it.\n<blockquote><div><strong>EliHarel wrote:</strong>4. 30 Tumble I think is pretty clear as well, no?</div></blockquote>I agree. Free stackable AC is sweet. <br/>\n<br/>\nNow, my purpose was not to bias your build plans but only to describe factors which affect how it plays.  Your own experience playing on a custom server should come first in the decision-making process so if you can glean some tidbits from my expose' it has served its purpose well.<br/>\n<br/>\nUnderstand, though.  Typically, builds on the ECB strive to maximize particular aspects and are seldom intended for RP or general utility. This is why recommendations are so subject to personal bias (as should be evident from my own approach). They reflect the results of an individual's own experience which is a very subjective one.  However, basic build dynamics are objective elements that can be readily evaluated.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "11:51 PM - Mar 20, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks hips. In a sharp turn, how should one do a Divine Archer? I suppose 27 Cleric with 3 Monks at the end? It seems much more reliable where dispels are concerned and the buffs last much longer. It's easier to support since it stays at the back anyway. But it seems feat-starved too...<br/>\n<br/>\n1. Extend<br/>\n2. Zen Archery<br/>\n3. Maximize<br/>\n4. Scribe Scroll<br/>\n5. Weapon Focus<br/>\n6. Improved Critical<br/>\n7. Point Blank Shot<br/>\n8. Rapid Shot<br/>\n10. Spell Focus<br/>\n11. Greater Spell Focus<br/>\n12. Blindfight<br/>\n13. Called Shot<br/>\n<br/>\nAnd that's pre-epic.<br/>\n<br/>\nOh, and the divine archer would be an elf, keep that in mind.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:43 AM - Mar 21, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've had a lot of success with brd/AA/cleric divine archers but haven't tried to hash one out for level 30 ceiling... yet.  <span style=\"color:#0000FF\">(edit: just posted a 30-level Divine Archer build <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/abridged-divine-aa-cleric-15-bard-4-arcane-archer-11-t2210334.html\" rel=\"noreferrer\" target=\"_blank\">here</a> that should work on Arelith which you can compare your zen archer versions with.)</span>  I'll eat the XP penalty and go with elf since half-elf costs a martial feat and the early DEX boost gets the toon off to a quick start .  In the epic 40 version, DEX AB makes the most sense with the elven racial bias and special AA attack DCs.  Again, I would aim for 15 cleric &amp; WIS 18.  For my own preference, I won't try to create an archer with a caster template.  Meaning... drop the spell focus feats for a confirmed self-buffing archer or keep them and use the bow for back-up support only.  Spell focus means (to me, anyway), the toon plans to tank, not stand back and take pot shots.<br/>\n<br/>\nOnly 24 caster levels are needed to be indispellable against all except Mords so 24/6 makes more sense to me if you really want to go the monk route.  Though a monk cleric archer will gain the AC bonus, it will miss out on the sweet monk progression.  Thing is, if it is indeed intended as an archer with some spell back-up capabilities, AC should hardly ever factor into the equation, assuming it is played correctly... set up a meat shield and begin plunking with called leg shots from behind, kiting when necessary.  I have never been much of a fan of the PBS strategy.  My rationale dictates that if one wants to fight in melee range, pick up a sword (and shield if/when flanked).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "7:56 PM - Mar 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Why not replace AA with fighter? True, the AB won't be the same. However, with EWS you receive pretty much the same damage as the AA; you multiclass much less, allowing all your buffs to last longer and be lest vulnerable to dispels, and you can also take Monk instead of Bard. So instead of Cleric-Bard-AA with good attack and slightly better damage, you go 23 Cleric, 4 Fighter and 3 Monk for slightly lower AB, but same damage, more feats, much much better defense and stronger spells?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "9:58 PM - Mar 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>EliHarel wrote:</strong>Why not replace AA with fighter? True, the AB won't be the same. </div></blockquote>\nIt's way more than AB.  The cited build is a skilled archer build.  The whole idea of an optimized archer is to launch called shots that will ideally only  miss on a 1 roll.  At AB 53, that should be accomplished pretty well.  Figure on needing to beat about a maximum Discipline check of 40 on a level 30 server.  \n<blockquote><div><strong>EliHarel wrote:</strong><br/>\nHowever, with EWS you receive pretty much the same damage as the AA;\n</div></blockquote>\nEWS won't pierce DR.  If you can be sure to find/buy a +6 mighty bow, then yes, it would be a wash.\n<blockquote><div><strong>EliHarel wrote:</strong><br/>\nyou multiclass much less, \n</div></blockquote>\nThis is the first time I've read about multiclassing being a Con in a build. I will always build to take advantage of the available classes.  If your server penalizes you for each multiclass, you should state as much up front in your request.  Seems like if you are willing to eat the XP penalty, that should be enough of a Con, no?\n<blockquote><div><strong>EliHarel wrote:</strong><br/>\nallowing all your buffs to last longer and be lest vulnerable to dispels, \n</div></blockquote>\nPer round buffs will last 3 turns.  You need them to last longer than that?  Kill faster.  Use an AA. *lol*  Dispels? Granted.  That's the whole point of AA.  Even when the buffs drop, it will continue to do adequate damage.  Besides, except for mords that cut through most all caster levels, buffs are stripped in layers, so the more buffs that are up the more will continue to be active after each dispel attempt.\n<blockquote><div><strong>EliHarel wrote:</strong><br/>\nand you can also take Monk instead of Bard. \n</div></blockquote>\nBard provides more flexibility in the skill set than monk.  Tumble is hardly the issue.  It's just a side benefit. Besides the standard advantages of UMD, all arcane scrolls are available so now those threatening dispels must shred mantles before they do anything.  By the time they are shredded the enemy should be dead.  If they are particularly annoying, cast a summon on top of them and resume shooting.  Lichs are the chief problem so start out with an imbued arrow to make the process faster.<br/>\n<br/>\nAgainst mobs, the bane of a divine archer are stealth users that can force them into melee (or PBS).  Maxed Spot &amp; Listen counter that concern.<br/>\n<br/>\nA properly played archer should NEVER depend on AC or HP totals.  Now, if you want to build a divine archer tank... you are on the right track.  As I have stated many times, PBS is the bane of any true archer.  So if you are sacrificing killing power to gain defense, an optimized archer is probably not the right strategy to pursue.\n<blockquote><div><strong>EliHarel wrote:</strong><br/>\nSo instead of Cleric-Bard-AA with good attack and slightly better damage, you go 23 Cleric, 4 Fighter and 3 Monk for slightly lower AB, but same damage, more feats, much much better defense and stronger spells?</div></blockquote>\nYou're so close to indispellability, why not Cleric 24?  Seems a caster cleric should be able to assure the buffs hold as well as possible.  The fact that he can use a range weapon with some effectiveness hardly matters.  At that cleric level, spells should work just as well, probably better than archery.  Sounds like a divine range mop-up build to me rather than a dedicated archer.  BTW, the AB is not good in the cited build...  it is excellent for Level 30... and will challenge any WM AB.<br/>\n<br/>\nI'm also not sure what feats are so crucial to building an optimized archer.  What did you have in mind?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "11:55 AM - Apr 05, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Instead of just opening another thread I'll ask here again. The important stuff of Arelith is written down so I don't need to repeat it.<br/>\n<br/>\nI'm wondering about a Cleric from a different direction: Cleric-Fighter-Rogue, melee. The classes I care less about, I just want him a fun melee type. Everything I write below is merely an idea of mine, feel free to trash it.<br/>\n<br/>\n<strong>Ability Scores</strong><br/>\nHuman<br/>\nSTR 16<br/>\nDEX 8<br/>\nCON 12<br/>\nINT 14<br/>\nWIS 16<br/>\nCHA 8<br/>\n<br/>\nWith the Gift system, I can raise up to three different ability scores by a permanent 2, at the cost of +1 ECL each time. Note, the ECL affects only the XP, not the maximum level. I can't raise the same ability score three times. So I was thinking raise STR to 18, WIS to 18, INT to 16 (so many delicious skills to take as a Rogue, even with Hide/MS). <br/>\n<br/>\n<strong>Weapon</strong><br/>\nThe best format of a weapon you can receive is either:<br/>\n<br/>\nGreensteel<br/>\n+3 AB<br/>\nKeen<br/>\n+4 Elemental Damage<br/>\n<br/>\nOr:<br/>\n<br/>\nMasterly Damask<br/>\n+3 AB<br/>\n+6 Slashing/Piercing/Bludgeoning whatever.<br/>\n+4 Elemental.<br/>\n<br/>\nIn this case I was consideringt taking the Keen version with a rapier, improved critical and land myself on 12-20 critical range.<br/>\n<br/>\n<strong>Items</strong><br/>\nHere I'm a bit blind, because I've never been to the maximum level on Arelith. However, I think it's safe to assume that the final items you'll have will look something like:<br/>\n+1 Ability Score<br/>\n+1 Ability Score<br/>\n+2 Skill<br/>\nAnd either: +2 Skill or +1 AC<br/>\n<br/>\nSo that leaves, with armor, +10 to two ability scores. However, you can't rest with armor so practically, when resting, you have only +9 to WIS from the items. I have 7 ability scores to raise until level 30, so I'm thinking raise WIS to 19, so when I rest I have 28 WIS, and then put 6 more points to STR and have 24, maximum after bonuses 36.<br/>\n<br/>\n<strong>Domains</strong><br/>\nArelith is low magic, as I think you've gathered. There are no hasted items. And a potion of haste lasts for just a few rounds, so I was thinking Travel. If I take a rogue, then I don't need Trickery since I can just purchase Wands of Improved Invisibility, which last for 7 turns I think. Potions of Barkskin can also replace Plant for a few turns as well. They might be costly, but these domains offer things I can have in other ways. So alongside Travel, I was thinking STR, for more Divine Power and Stoneskin (yay!).<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSo far, these are my thoughts on the build. I'd like your opinion on this. Nothing I wrote is canon, this char doesn't exist. The main desire is a fun melee type, as I said. Beyond what I wrote, I don't know how character progression should be, what skills and feats to take, and pretty much everything else. Is the basic idea of Cleric-Fighter-Rogue is even good?<br/>\nThank you.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:00 PM - Apr 05, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Is unmodified (Tumble 30/Dex 25) Epic Dodge available on the server?  <br/>\n<br/>\nIf so, I would recommend going with a DEX halfling, DWing finessed kukris, something like Rog 13/Clc 12/Ftr 5 <br/>\n(Rog11/Clc5/Ftr4 pre-epic).  That split concentrates on gaining sneaks so to gain divine power faster, a swap with cleric is necessary, along with more levels of XP penalty.  Unfortunately, the last 8 or 9 levels would suffer a certain 20% XP penalty... no way around that prospect really, though going human could reduce the total number while lowering AB/AC tally.<br/>\n<br/>\nWith the gifting system, I suppose it is possible to achieve ED before level 30 (the earliest being at Level 27) but I will leave it to you to figure that much out.  Again, without firsthand experience using it, a human equivalent may be possible... just difficult to schedule it and obtain an evaluation without manual effort *cringing*.  You could also use a finessed rapier/shield human but lose LOTS of combat prowess if you try to dual-wield them.  The crit ranges between wpn class are identical, in any case, though it may come down to a piercing vs. slashing decision.<br/>\n<br/>\nThough cleric 15 is not possible here (my personal minimum for a level 40 build), most buffs will still reach +4 so that is not horrible and Extended Haste will be there to use.  I figure a starting split of STR8/DEX18/CON10/WIS16/INT14/CHA8 with a halfling.  Heavy plate/tower shield will naturally be beyond the capacity of this toon.  You should have somewhere in the neighborhood of 200-230 skill points to spread around by level 30 and with better than average saves.  I would ignore discipline, though... it's a DEX build after all.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "2:08 PM - Apr 05, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">No comment about the idea I posted?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:08 AM - Apr 06, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">For your idea, how about this progression?<br/>\n01 Rogue(1)<br/>\n02 Rogue(2)<br/>\n03 Rogue(3)<br/>\n04 Fighter(1) Weapon Focus<br/>\n05 Fighter(2)<br/>\n06 Fighter(3)<br/>\n07 Fighter(4) Weapon Spec.<br/>\n08 Cleric(1) <br/>\n09 Cleric(2)<br/>\n10 Cleric(3)<br/>\n11 Cleric(4)<br/>\n12 Rogue(4)<br/>\n13 Cleric(5)<br/>\n14 Cleric(6)<br/>\n15 Cleric(7)<br/>\n16 Cleric(8)<br/>\n17 Rogue(5)<br/>\n18 Cleric(9)<br/>\n19 Cleric(10)<br/>\n20 Cleric(11)<br/>\n21 Fighter (5) Epic Weapon Focus<br/>\n22 Rogue(6)<br/>\n23 Fighter(6) Epic Weapon Spec.<br/>\n24 Cleric(12)<br/>\n25 Cleric(13)<br/>\n26 Cleric(14)<br/>\n27 Rogue(7)<br/>\n28 Cleric(15)<br/>\n29 Cleric(16)<br/>\n30 Cleric(17)<br/>\n<br/>\nI'll leave the skills, weapon choice, and most of the feats up to you. This follows the three-levels-the-first-time-you-add-a-class rule and never suffers an EXP penalty, if you play as a human.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:04 PM - Apr 06, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>EliHarel wrote:</strong>No comment about the idea I posted?</div></blockquote>Why would any DP cleric need/want STR higher than 10 except to tote loot easier?  Unless a DevCrit build, which this is not.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "11:45 PM - Apr 06, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">36 STR, a modifer of 13, over 18 STR, a modifier of 4. 9 damage and AB more. Why not?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:49 PM - Apr 07, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>EliHarel wrote:</strong>36 STR, a modifer of 13, over 18 STR, a modifier of 4. 9 damage and AB more. Why not?</div></blockquote>\nDP will assure 30 (18 plus cap) so to gain 3 damage and +3 AB you will be investing in an ability that will not help you rectify your key weaknesses, reflex saves (DEX) &amp; spell DCs (WIS).  Buffed AB &amp; damage will never become an issue with ANY cleric. Also, if you are not limiting this build to a single-handed attack, AC will become a significant factor (no shield to vest). Should you prefer Cleave over KD, only STR 13 is needed.  IMO Cleave is inferior to KD/IKD anyway due to its limited applicability (flanking mobs only) and waste of an almost worthless prereq (PA), hence 10 is fine.  Besides, Cleave won't help against your main hurdles... mages &amp; lichs. But your own bias would determine which is the more comfortable route and Cleave vs. KD is a matter for another debate altogether.<br/>\n<br/>\nLike I inferred, if you are not going the DevCrit route, a STR-based DP cleric is an intentional gimping of its full potential.<br/>\n<br/>\nBesides those issues, the fact that you are proposing using rogue (your idea) in a build like this and not taking full advantage of the class features (stealth, reflex, sneaks, evasion, etc.) would lead me to believe it was inserted more as a novelty or skill dump than as a point of strength. IMHO, for what impact it may evoke, DEX is the only way to develop this combo as an optimized character (i.e. Epic Dodge).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "4:43 PM - Apr 07, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">How do I reach 30 STR with DP? To my knowledge, the raise to 18 STR from your natural STR doesn't stack with existing buffs. So for that to work, I need to take off all my STR-boosting gear (which is pretty much everything, since things only add +1 STR as I asid), wait for the Bull's Strength spell until after the DP, and wear them again after I case that spell. I'm not sure, but last time I checked this, a long time ago, it worked thus. DP didn't stack with your already existing STR buffs.<br/>\nIf this is still the case, how can I function like this in a long adventures in a PW RP world?<br/>\n<br/>\nAnd I didn't mean to give up a shield. I thought about taking a Scimitar instead, so having a natural 12-20 crit range for good damage in fights.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:37 PM - Apr 07, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>EliHarel wrote:</strong>How do I reach 30 STR with DP? To my knowledge, the raise to 18 STR from your natural STR doesn't stack with existing buffs. So for that to work, I need to take off all my STR-boosting gear (which is pretty much everything, since things only add +1 STR as I asid), wait for the Bull's Strength spell until after the DP, and wear them again after I case that spell. I'm not sure, but last time I checked this, a long time ago, it worked thus. DP didn't stack with your already existing STR buffs.<br/>\nIf this is still the case, how can I function like this in a long adventures in a PW RP world?<br/>\n<br/>\nAnd I didn't mean to give up a shield. I thought about taking a Scimitar instead, so having a natural 12-20 crit range for good damage in fights.</div></blockquote>\nMy bad for not reading your OP correctly.  Too many concepts in a single topic, I guess. I thought you were just adding the gift to raise STR to 18.  But now I see with a STR-based build you will going to 24 and are able to cap abilities with equipment on your server.  Fine.  <br/>\n<br/>\nThe thing is, DP shines best with a DEX build as it compensates most for relatively low STR.  So when you build a STR-based DP, reflex and AC will always be a problem.  A DEX variant addresses the most glaring issues.  AC will be less of an issue with sword/board set-up but the reflex problem remains.  Any plans you may have to use sneaks or stealth (the rogue portion) will become neutralized with armor/shield.  Which brings me back to the point of not understanding why one would build around STR with a rogue when AB &amp; damage from divine buffs will never be a problem.  <br/>\n<br/>\nThat's the part you will need to clarify:  Do you want to approach this build using the rogue portion seriously or just insert it as a battle cleric novelty?  If just for kicks, then all you'll need is regular rogue skill dumps being careful to keep your pre-epic BAB 15 or lower and nothing more exotic than that.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:42 PM - Apr 07, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong>If just for kicks, then all you'll need is regular rogue skill dumps being careful to keep your pre-epic BAB 15 or lower and nothing more exotic than that.</div></blockquote>\nI figured that is what he wanted, so that's the approach I used whan I made the leveling progression I suggested above.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}