{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "113",
  "name": "EE Dispel Changes",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ee-dispel-changes-t2355514.html",
  "author": "Yunim",
  "avatar": "10759176_1572007808.png",
  "replies": "11",
  "views": "1.7K",
  "posts": [
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:42 AM - Jul 14, 2020",
      "content": "<div>Recently I've been doing some testing in EE and I noticed that dispel has changed slightly. Instead of Dispeller Level + 1d20 vs Caster Level + 12, the formula seems to be DL + 1d20 vs CL + 11 (with ties dispelling the effect). As a result, 25 caster levels are now required to be immune to Greater Dispelling instead of 24.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:40 PM - Jul 14, 2020",
      "content": "<div>That *<strong>IS</strong>* interesting news!<br/>\n<br/>\nThanks for the info!</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:51 AM - Jul 15, 2020",
      "content": "<div>Its good to explore and question the basic mechanics of dispelling it is something of interest to everyone!<br/>\nIt is a well established maxim, the dispel mechanics.<br/>\n<br/>\nThere is more that could be done that I am unsure if you have done already<br/>\nFirstly to see the patch notes history to see if there is a changelog that shows it being reverted to what was intended originally. If it is in a changelog, then you are already on a winner and the wiki should be updated.<br/>\nIf it isn't in a changelog then some more details on the testing. Put it for peer review, here is a friendly environment with an experienced group of players. Afterwards the NWN Wiki talk page would be the next place to post it, it is a pity WhiZard isn't active anymore, but perhaps The_Krit, who runs the NWN wiki would be the ideal person to check the data. <br/>\n<br/>\nIf testing is needed a possible design would be two players in a character creator arena in vanilla NWN.<br/>\nI would try to avoid having the dispeller having spell focus: abjuration (or GSF/ESF) just in case it affects dispel mechanics, I am unsure if it does but the less variables for testing the better. Dispel rolls unfortunately don't show in the combat log (unless you know of a way to make it show), but the character sheet of the player affected showing a log with the effect dispelled is probably more than adequate.<br/>\n<br/>\nFrom a player perspective its always handy to have a few caster levels beyond 24 anyway for those pesky UMD users with their Mord scrolls that DM's like to put on em :)<br/>\nThe breach will still apply but some buffs like bull's strength, death ward, freedom, improved invisibility and protection versus alignment can't be breached<br/>\nI think 26 is enough for Mord scrolls which are CL 17 (havent done the math) but if this change is proven then it shifts things up by one RE 'undispellability'</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:55 AM - Jul 15, 2020",
      "content": "<div>The testing I did was already in a vanilla environment (EE v80.8193.13). I tested it with OnHit weapons (including Holy Avenger), scripted dispels, and vanilla Greater Dispelling. Any dispel that works by using the Holy Avenger item property or the hardcoded EffectDispelMagicAll and EffectDispelMagicBest functions is affected. Arcane Defense and Spell Focus don't affect vanilla dispels in any way, the only thing that matters is caster level.<br/>\n<br/>\nFor environments that use a custom dispel system there might not be any changes, it depends on whether the system uses the hardcoded dispel functions or not. When I made a custom dispel system I didn't use either of those functions so it's definitely possible that some environments won't be affected.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:14 AM - Jul 15, 2020",
      "content": "<div>Those are interesting findings for sure.<br/>\n<br/>\nI will test it out using Pretty Good Character Creator when I get a chance.<br/>\nI will use a level 23 cleric to begin with and self cast greater dispelling on myself<br/>\nThen level 24 and level 25.<br/>\n<br/>\nI would be careful using Holy Avenger and onhit weapons. They may be different mechanics from the spell. <br/>\nHoly Avenger is known to be able to remove petrification, for example.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:14 AM - Jul 15, 2020",
      "content": "<div>Hi everyone, I would like to confirm Yunim's findings, tested in Pretty Good Character Creator v43.<br/>\nI am using NWN EE v80.8193.13 (3ba0f825)<br/>\n<br/>\nFeats: Blind Fight, Combat Casting, Extend Spell, Silent Spell, Empower Spell, Weapon Focus: Morningstar, Knockdown, Extra Turning, Great Wisdom III, Sun and Healing Domains<br/>\nEquipment: Woodsman's Outfit, no other equipment.<br/>\n<br/>\nA level 23 cleric self casting greater dispelling was able to remove level 1 buffs (Prot v Evil) and cantrips (Resistance).<br/>\nA level 24 cleric self casting greater dispelling was able to remove level 1 buffs (Prot v Evil) and cantrips (Resistance).<br/>\nA level 25 cleric self casting greater dispelling was unable to remove level 1 buffs (Prot v Evil) and cantrips (Resistance) on over 100 greater dispelling attempts (I cast more than 100 greater dispelling spells, but the log ran out of space.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_44773472b435534bbcdadde531b1fdf0_t.jpg\"/><br/>\n<span style=\"font-size:75%;line-height:normal\">Buffs are dispellable at level 23</span><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_7eb910473e786cc8de33197a6b7fea7c_t.jpg\"/><br/>\n<span style=\"font-size:75%;line-height:normal\">Buffs are dispellable at level 24</span><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_dfda17492988c601d3108e7b930f8bd7_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">Buffs are not dispellable at level 25 over &gt;100 greater dispelling attempts</span><br/>\n<br/>\nIf my assumption was not correct and level 25 buffs were dispellable with a 20 roll (5% chance), there would be a less than 0.0035% chance of both buffs remaining with these findings over &gt;100 greater dispelling attempts ie (1-0.05)^200.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_bfaeede2fa397c81dbd411fd0b98c1b8_t.jpg\"/><br/>\n<span style=\"font-size:75%;line-height:normal\">This is a log of the greater dispelling attempts at level 25</span><br/>\n<br/>\nAnyway this is a discovery that is worthy of recognition, have a gold award on me. <br/>\nThe NWN wiki should be updated that the greater dispelling DC has probably been corrected to the intended 1d20 + dispel's caster level  vs.  11 + creator's effective level as tested in NWN EE v80.8193.13.<br/>\nI might leave a message in the NWN: Talk Section and hope The_Krit notices it.<br/>\n<br/>\nI am wondering if this has always been the case now, and it would also be reasonable to also test this in NWN Diamond (v1.69), however I do not have a copy of this.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:27 AM - Jul 15, 2020",
      "content": "<div>Holy Avenger and OnHit: Dispel do work differently, but they're similar enough that I'm confident this new formula (with CL 10) also applies to the HA dispel.<br/>\nI'll summarise what I've found below, although this might only be accurate for vanilla EE (v80.8193.13).<br/>\n<br/>\nAfter doing some more testing with dispel and HA, it seems that either the wiki is wrong or EE has changed a quite a few functions. The HA wiki page says that HA dispels petrification and extraordinary effects like Aura Of Fear or Turn Undead. Although HA can dispel magical petrification, I haven't seen it dispel any extraordinary effects (including extraordinary petrification). Both Aura Of Fear and Turn Undead are magical effects and thus can be removed with a dispel spell (tested and confirmed in PGC3).<br/>\n[<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Holy_avenger#Notes\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Holy_avenger#Notes</a>]<br/>\n<br/>\nEvery effect has a caster level and a subtype, which are both are relevant to dispels.<br/>\n<br/>\nThe caster level is a non-negative integer, (usually) ranging from 0 to 509. Effect caster level is different to caster level in the usual sense, although for most actual spells they do match up. For example, the polymorph effect of Dragon Shape has a caster level of 10 regardless of how many Druid or Shifter levels the user has. At the extreme end, some spell-like abilities such as an Assassin's Improved Invisibility have a caster level of 509 due to a quirk in NWN. A CL 499 dispel does not dispel an Assassin's Improved Invisibility but a CL 500 dispel does. Note that the 509 CL only affects dispelling the effect, the duration of the effect is still 1 Turn per Assassin level.<br/>\n[<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Talk:Sequencer#Sequencing_Feats\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Talk:Sequen ... cing_Feats</a>]<br/>\n<br/>\nThe subtype is an integer and can be one of four categories: Error (0), Magical (8), Supernatural (16), Extraordinary (24).<br/>\n[<a class=\"postlink\" href=\"https://nwnlexicon.com/index.php?title=Subtype\" rel=\"noreferrer\" target=\"_blank\">https://nwnlexicon.com/index.php?title=Subtype</a>]<br/>\n\"Error\" is my label for the first subtype, there isn't an official name for it. Most combat feat effects (CS Arm, CS Leg, Crippling Strike, KD/IKD, Taunt) have a subtype of 0. Despite this, in practice they actually work like either supernatural or extraordinary effects. There is no way to create an effect with a subtype of 0 via the toolset, although it might be possible using third party programs like NWNX.<br/>\n\"Magical\" effects can be dispelled, are removed by resting, and are removed by death. \"Supernatural\" effects can not be dispelled, are not removed by resting, and are removed by death. \"Extraordinary\" effects can not be dispelled, are removed by resting, and are removed by death. All effects created in the toolset are magical by default, although they can be changed to supernatural or extraordinary effects. Despite the toolset description claiming otherwise, EffectTurned is a magical effect by default rather than a supernatural effect.<br/>\nNote that some spells remove effects regardless of subtype, such as Freedom Of Movement or the Restoration spell line. For example, all AC decrease effects, including the extraordinary Barbarian Rage, are removed by the Restoration spell line.<br/>\n<br/>\nThere is one item property (HA) and four dispel spells (LD, DM, GD, MD) that can dispel effects.<br/>\nHoly Avenger is a hardcoded item property, as far as I'm aware there's no way to restrict or alter how it works.<br/>\nThe dispel spells all use a function (\"spellsDispelMagic\" from \"x0_i0_spells\") that uses the hardcoded functions \"EffectDispelMagicAll\" and \"EffectDispelMagicBest\" to dispel effects. The restrictions of not dispelling petrified creatures or creatures flagged as dispel-immune comes from \"spellsDispelMagic\", not the hardcoded dispel functions.<br/>\nIn my tests I applied a permanent magical petrification effect (CL 0) and dispelled it with both HA and a CL 1 EffectDispelMagicAll effect. I was unable to remove supernatural or extraordinary petrification effects (CL 0) with either HA or a CL 40 EffectDispelMagicAll effect. So the HA dispel is identical to a CL 10 EffectDispelMagicAll effect.<br/>\nTheoretically, if the restrictions in \"spellsDispelMagic\" are removed then there would be no difference between the dispel effect of Holy Avenger and the dispel effect of OnHit: Dispel Magic Level 10.<br/>\n<br/>\nThe hardcoded dispel functions will only work on magical effects, they don't work on error, supernatural, or extraordinary effects.<br/>\nWhen attempting to dispel a magical effect with the hardcoded functions the check is Dispel Level + 1d20 vs Effect Caster Level + 11, with ties resulting in the effect being dispelled.<br/>\nHoly Avenger dispel is effectively a special case of a CL 10 EffectDispelMagicAll, with the same formula and subtype restrictions applying.<br/>\nSo Lesser Dispel (CL 5 max) requires 15 CL for immunity, Dispel Magic and Holy Avenger (CL 10 max / CL 10) require 20 CL for immunity, and Greater Dispelling (CL 15 max) requires 25 CL for immunity.<br/>\n<br/>\nEdit: I recently did some more testing with dispel. Holy Avenger only dispels magical effects and it only triggers a dispel attempt when the attack does physical damage to the target (elemental damage won't work). There is a slight inaccuracy in the post, permanent supernatural effects can not be removed by resting but temporary supernatural effects can be removed by resting. As a result there's no real difference between temporary extraordinary effects and temporary supernatural effects with regards to removing them. Everything else has been double checked, including the dispel formula and the inaccurate toolset description of EffectTurned.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:55 PM - Jul 15, 2020",
      "content": "<div>This is some ingame testing on World of Greyhawk persistent world EE server to show greater dispelling can remove buffs at sorcerer caster level 24, to further support Yunim's discovery.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_6499e31e93cc0fdc87d984bd45acc7cd_t.jpg\"/></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:03 PM - Jul 15, 2020",
      "content": "<div>Fix the damn Holy Avenger...Just fix it. I can't stand by &amp; see this glorious weapon becoming the ridicule it has become anymore...<br/>\n<br/>\nIf you do (not happening, of course), then make it that it can't be UMD'ed. <br/>\n<br/>\nGonna play with a real one (Carsomyr) tonight, just to remember how it was, I think I have a saved game on Watcher's Keep red dragon...</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:42 PM - Jul 15, 2020",
      "content": "<div>Yeah, I really would like to see Holy Avenger Dispel fixed.  I understand why it was nerfed (damn UMD users!  It is all your fault!), but it should be linked to level of the Paladin (+CoT) for Dispel.<br/>\n<br/>\nThat would fix it imo.<br/>\n<br/>\nThen one could UMD it, get the +5 bonus, and divine damage vs evil, but the Dispel would be...really shitty.<br/>\n<br/>\nPut the Avenger back in the Holy Paladin, fer cryin' out loud!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:56 AM - Jul 16, 2020",
      "content": "<div>That Holy Avenger nerf is why I stayed with 1.68 for years, and i could because I was playing single-player only.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "3:29 PM - Aug 30, 2020",
      "content": "<div>It turns out that the dispel changes have actually been in place since EE was released (v1.74), this is just the first time that I've noticed.<br/>\nFrom the EE release notes: \"Dispel Check calculation now takes a tie as a remove effect, as specified in the Player's Handbook.\"</div>"
    }
  ]
}