{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "099",
  "name": "*Cue star wars opening music* (Necromancer, help)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/cue-star-wars-opening-music-necromancer-help-t2354649.html",
  "author": "Rua Blackmist",
  "avatar": "10423421_1510287071.jpg",
  "replies": "26",
  "views": "1.1K",
  "posts": [
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "9:33 PM - Dec 07, 2016",
      "content": "<div><div align=\"center\"><em><span style=\"font-size:150%;line-height:normal\"><span style=\"color:#000080\">A (not) so long time ago in a server, far, far away.</span></span> (But, not that far away...)<br/>\n<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\"><strong>Episode IV<br/>\n A NEW ADVENTURE<br/>\n<br/>\n It is a period of constant roleplay. A certain roleplayer, after amassing a plethora of experience.<br/>\n Returns from the shadows after his second successful campaign.<br/>\n<br/>\n During the roleplay, his character made many enemies and friends alike. Constantly going on a journey of survival and fun.<br/>\n Due to recent events with his rival, our hero met a tragic end. But, it doesn't end there. Though, that journey is done a new one begins from the shadows.<br/>\n That said player character has made their way to the Nwnecbguild.forums, to gain help making a new idea he had in mind, and to deliver a lame rip off opening...</strong></span></em><br/>\n<br/>\n  </div>\n Well.. .glad we got that out of the way xD.<br/>\n Please rate :o xD<br/>\n<br/>\n<br/>\n Anyway, I came from Arelith (lv 30). I decided to try and make a necromancer (spell casting focus) and... I thought about using Cleric as one (but correct me if there is a better choice)<br/>\n Okay so let's lay it down right here ^^<br/>\n<br/>\n<em>PvM or PvP - PvM, but any help towards PvP (in the odd case I get attacked, might help)<br/>\n Level cap - 30<br/>\n Race- Human<br/>\n Class - Wizard or Cleric. -Reason? I thought the cleric might make a better necromancer due to having inflict damage spells, alongside the seemingly standard negative rays, etc. But, wizards got horrid, and kinda fit the... missiles fireballs...thing.<br/>\n -Melee Preference - None<br/>\n Range - none<br/>\n<br/>\n Skills - A high heal might help. Spot might also, against stealthed foes? Maybe<br/>\n Weapon - Always thought it would be cool to run around with a scythe (Grim Reaper style, but that's just me, not mandatory if it hinders build)<br/>\n<br/>\n Maximum item enchantment - Any of the basic stats such as STR, DEX, etc.<br/>\n<br/>\n Spell Casting? - I wanted it to be able to cast strong offensive spells (whilst remain true to the necromantic ways. Probably nothing like disease since it might be an easy resist, but negative energies, undead minions and missiles etc.)<br/>\n<br/>\n Level Constraints - 3 in a row, before moving to another class<br/>\n Class restrants? - Can't use a palemaster for this one (however, a second build with palemaster in it for if I ever unlock it would be awesome ^^)<br/>\n Classes that can be used?</em><br/>\n Arcane Archer<br/>\n Blackguard<br/>\n Champion of Torm<br/>\n Dwarven Defender<br/>\n Shadowdancer<br/>\n Weapon Master<br/>\n Others under heavy restriction or rewards.<br/>\n<br/>\n<br/>\n<em>Changes in Spells or feats?</em><br/>\n<strong>Epic Spell: Mummy Dust</strong>: Having this feat will grant access to the strongest variants of undead as per the <a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Necromancy_changes\" rel=\"noreferrer\" target=\"_blank\">undead summoning changes</a>, but the spell by itself only works as any other undead summoning spell (It does not summon the mummy warrior)Undead summoning spells no longer summon a specific creature tied to that spell, instead, all of these spells will summon creatures of power directly tied to a secondary undead caster level, henceforth UCL. <ul><li>The UCL is either your full cleric levels, <strong>or</strong> your added total of wizard, sorcerer and pale master levels.</li> <li>Once taking the feat Mummy Dust, all undead will be tier 4, not just those summoned by Mummy Dust. By itself, Mummy Dust does not summon any special creature, but will act exactly like any other undead summoning spell.</li> <li>The minions must be summoned from different spells; casting Animate Twice twice won't net you a second minion.</li> </ul><ul><li>This means, to achieve three undead you would have to cast Animate Dead, Create Undead and Mummy Dust, for example.</li> <li><strong>Spell Focus: Necromancy</strong></li> </ul><ul><li>Greater Spell Focus: Necromancy turns Summoned Undead (from any Spell, Class Ability or Feat) into Henchmen. Your character may therefore have two undead minions at the same time. Note that the undeads <strong>must</strong> be summoned from different sources; casting two times Create Undead will not result in two minions.</li> <li>Epic Spell Focus: Necromancy will allow the caster to have three summoned undead at the same time.</li> </ul><strong>Spell Focus: Abjuration</strong> <ul><li>Each Spell Focus in Abjuration grants a cumulative +2 to Dispelling Rolls, to a total of +6 with Epic Spell Focus: Abjuration. These are applied after the Level Cap imposed by individual spells (so an Epic Abjurer's Greater Dispelling caps at +26, not +20).</li> <li>With Spell Focus: Abjuration, the Shield spell protects against Isaac's Lesser Missile Storm as well as Magic Missile. With Greater Spell Focus, this protection extends also to Isaac's Greater Missile Storm.</li> </ul><ul><li>Spell Focus Conjuration</li> <li>Each Spell Focus in Conjuration grants a small bonus to the statistics of creatures summoned by the [Lesser/Greater] Planar Binding Spells, and Epic Spell: Dragon Knight.</li> <li>Greater Spell Focus: Conjuration causes a caster to summon a creature one \"level\" higher than normal when using the Summon Creature I-VIII spells, in the same way as the bonus provided by the Cleric's Animal <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Animal_domain%7CAnimal\" rel=\"noreferrer\" target=\"_blank\">Domain</a>. Note that Animal Domain and Greater Spell Focus: Conjuration <em><strong>do not</strong></em> stack in this respect. This feat will also grant <a class=\"postlink\" href=\"http://wiki.arelith.com/Warlock#Fiendish_Summons\" rel=\"noreferrer\" target=\"_blank\">Fiendish Warlocks</a> an empowered version of their final summon, and allows Summon Creature IX to summon a more powerful Ancient Elemental.</li> </ul>\n Epic Spell Focus: Evocation drastically improves both <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Greater_ruin\" rel=\"noreferrer\" target=\"_blank\">Epic Spell: Greater Ruin</a> and <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Hellball\" rel=\"noreferrer\" target=\"_blank\">Epic Spell: Hellball</a>, to several times their normal effectiveness. Without this focus, their power is equivalent to Vanilla NWN.<br/>\n<br/>\n Now, if I left anything out, let me know I wanna make sure its a grand time. Now, I'll likely want Epic Necromancy, but  I don't know if another one would be good. (Not good at feats) I'd say Conj and Greater, to increases summon level a bit for powerful summons and solo, and I suppose acid sheathe boost, but evocation might be better since I want him to be... kinda pew pew... thoughts? Am I asking to much here?<br/>\n<br/>\n  <br/>\n Edit: added additional spell focus changes as they might be important?<br/>\n<br/>\n Edit2: Just realised... spell penetration might be necessary right? Considering spells don't have that good power against saves typically to begin with.</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:30 PM - Dec 07, 2016",
      "content": "<div>I see 3 choices as a primary spellcaster focusing in necromancy:<br/>\n<br/>\n Pure Cleric or cleric hybrid: for the best non-spell alternative attack and able to equip armor/shield<br/>\n Pure Wiz or wiz hybrid: for the largest feat selection and spell defense (i.e. spellcraft rating)<br/>\n Src 27/Pal : for the highest saves (by far) and most spells per day<br/>\n<br/>\n Make a list of the necromancy spells you intend to focus upon, decide if Arelith provides a means to eccentuate them and run from there.<br/>\n<br/>\n BTW... \"maximum item enchantment\" means: the highest gear bonus you are likely to have access to on your server, like armor, shield, cloak bonus, weapon enhancement, etc.  If it's easy to cap abilities with gear, that would be helpful to decide if a self-buffer has much merit, but not much else.<br/>\n<br/>\n  </div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "12:15 AM - Dec 08, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>I see 3 choices as a primary spellcaster focusing in necromancy:<br/>\n<br/>\n Pure Cleric or cleric hybrid: for the best non-spell alternative attack and able to equip armor/shield<br/>\n Pure Wiz or wiz hybrid: for the largest feat selection and spell defense (i.e. spellcraft rating)<br/>\n Src 27/Pal : for the highest saves (by far) and most spells per day<br/>\n<br/>\n Make a list of the necromancy spells you intend to focus upon, decide if Arelith provides a means to eccentuate them and run from there.<br/>\n<br/>\n BTW... \"maximum item enchantment\" means: the highest gear bonus you are likely to have access to on your server, like armor, shield, cloak bonus, weapon enhancement, etc.  If it's easy to cap abilities with gear, that would be helpful to decide if a self-buffer has much merit, but not much else.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Alright, I'll put down a list of spells I intend to use, if necromancy and I'll even separate them by class. (Cleric and Wizard at least)<br/>\n<br/>\n Cleric:<br/>\n All inflict wounds.<br/>\n Harm<br/>\n Circle of Doom<br/>\n Summon Undead spells<br/>\n Slay living<br/>\n Destruction<br/>\n (Potentially, Energy drain) Implosion maybe although its not necromancy.<br/>\n<br/>\n Wizard:<br/>\n Negative Energy Ray<br/>\n Ray of enfeeblement<br/>\n (Death Armor, until something better)<br/>\n Ghoul Touch<br/>\n Undead summon spells<br/>\n Negative energy burst.<br/>\n Finger of Death<br/>\n Horrid<br/>\n I could go on, but essentially its trial and error on how useful these would remain (and it kinda depends on the enemies saves as well)<br/>\n<br/>\n I like the Src idea of super saves, but... I don't know, unlike a wizard you can't really learn more spells on the fly (to change them up) although not being limited to spell slots to cast spells is pretty nice as well.<br/>\n<br/>\n . I want to focus on as much necromancy as I can (but for undead foes, having versatility like fireball, etc. Is also an extreme help.) Maybe you can walk me through this? I know it would be a long explanation on your end (maybe), but could you tell the the pros and cons of each choice?<br/>\n<br/>\n<br/>\n Almost forgot! I think the highest running in might be +3, that's the highest I've seen so far anyway. (Save potentially rare artefacts) +1 on a total of like 9 or so items...if you do it yourself kinda</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:15 PM - Dec 08, 2016",
      "content": "<div>You'll want to achieve the highest DC possible for your spell attacks. <br/>\n<br/>\n DC doesn't rely on caster levels. Just spell level, your primary ability and focus feats. If you remove focus and ability from the equation as constants (regardless of which class route you choose, they all have the same potential in those two areas), you are left with spell level as the main variable.  So that means the necromancer with the greatest chance to succeed beating saves uses the highest level spells to accomplish that.<br/>\n<br/>\n Wiz/sorc use the same high-level necro spells:<br/>\n At 7 - Finger; at 8 - Wilting; at 9 - Drain and Wail<br/>\n<br/>\n Cleric high necro spells:<br/>\n At 7 - Destruction (the highest DC divine necro spell available)<br/>\n<br/>\n All these spells allow a Fort save and check SR.<br/>\n<br/>\n So, assuming Epic focus and max ability (30) for Level 30 pure caster by each:<br/>\n<br/>\n DC = 26 + spell level<br/>\n<br/>\n Level 7 spell DC = 33<br/>\n Level 8 spell DC = 34<br/>\n Level 9 spell DC = 35<br/>\n<br/>\n (Note: all these caster classes can empower their primary ability with the applicable feat, so figure an additional +3 buffed DC enhancement for all spells)<br/>\n<br/>\n Compare a few non-focused with the same build:<br/>\n<br/>\n Wiz/sorc:<br/>\n Lvl 7 Delayed FB = 27<br/>\n Lvl 8 Sunburst = 28<br/>\n Lvl 9 Weird DC = 29<br/>\n<br/>\n Cleric:<br/>\n Lvl 8 Firestorm = 28<br/>\n Lvl 9 Implosion = 32, SoV = 29<br/>\n<br/>\n You are encouraged to perform the same calculations for lower-level spells to determine the relative potency, but if the ones listed do not succeed, you can bet neither will the lessers.<br/>\n<br/>\n Likewise, epic penetration will be the same for all: d20 + 36 (or 37-56) vs. opposed SR<br/>\n<br/>\n Naturally, when you start to use your epic feats for other uses than increasing DC or penetration, these projections will drop accordingly.<br/>\n<br/>\n Bottom line:  Arcanists have higher level necro spells than a cleric does so have better chance to beat a save.  Cleric will be able to stand within close range for touch attacks better due to their armor, shield and vestment buffs.  Arcanists will be able to inflict up to 66 acid dmg per blow with Mestil shield.  Clerics can attack well with any weapons when their offensive spells exhaust.  Arcanists have access to several no-save spells.  Clerics have access to very few no-save unless invested into offensive domains.  etc., etc., etc.<br/>\n<br/>\n For a couple common Lvl 30 examples of the sort of PvP save potentials you may confront:<br/>\n<br/>\n Ftr10/CoT16/Bard4 F/W/R vs spells: 39/27/33 + d20<br/>\n Pal9/Src18/Mnk3 F/W/R vs spells: 31/30/28 + d20<br/>\n<br/>\n As far as the monster skins spawning around your server, you would know that better than I.  Hope this helps you to decide the best route to take.  Good luck!<br/>\n<br/>\n  </div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "5:16 PM - Dec 08, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>You'll want to achieve the highest DC possible for your spell attacks. <br/>\n<br/>\n DC doesn't rely on caster levels. Just spell level, your primary ability and focus feats. If you remove focus and ability from the equation as constants (regardless of which class route you choose, they all have the same potential in those two areas), you are left with spell level as the main variable.  So that means the necromancer with the greatest chance to succeed beating saves uses the highest level spells to accomplish that.<br/>\n<br/>\n Wiz/sorc use the same high-level necro spells:<br/>\n At 7 - Finger; at 8 - Wilting; at 9 - Drain and Wail<br/>\n<br/>\n Cleric high necro spells:<br/>\n At 7 - Destruction (the highest DC divine necro spell available)<br/>\n<br/>\n All these spells allow a Fort save and check SR.<br/>\n<br/>\n So, assuming Epic focus and max ability (30) for Level 30 pure caster by each:<br/>\n<br/>\n DC = 26 + spell level<br/>\n<br/>\n Level 7 spell DC = 33<br/>\n Level 8 spell DC = 34<br/>\n Level 9 spell DC = 35<br/>\n<br/>\n (Note: all these caster classes can empower their primary ability with the applicable feat, so figure an additional +3 buffed DC enhancement for all spells)<br/>\n<br/>\n Compare a few non-focused with the same build:<br/>\n<br/>\n Wiz/sorc:<br/>\n Lvl 7 Delayed FB = 27<br/>\n Lvl 8 Sunburst = 28<br/>\n Lvl 9 Weird DC = 29<br/>\n<br/>\n Cleric:<br/>\n Lvl 8 Firestorm = 28<br/>\n Lvl 9 Implosion = 32, SoV = 29<br/>\n<br/>\n You are encouraged to perform the same calculations for lower-level spells to determine the relative potency, but if the ones listed do not succeed, you can bet neither will the lessers.<br/>\n<br/>\n Likewise, epic penetration will be the same for all: d20 + 36 (or 37-56) vs. opposed SR<br/>\n<br/>\n Naturally, when you start to use your epic feats for other uses than increasing DC or penetration, these projections will drop accordingly.<br/>\n<br/>\n Bottom line:  Arcanists have higher level necro spells than a cleric does so have better chance to beat a save.  Cleric will be able to stand within close range for touch attacks better due to their armor, shield and vestment buffs.  Arcanists will be able to inflict up to 66 acid dmg per blow with Mestil shield.  Clerics can attack well with any weapons when their offensive spells exhaust.  Arcanists have access to several no-save spells.  Clerics have access to very few no-save unless invested into offensive domains.  etc., etc., etc.<br/>\n<br/>\n For a couple common Lvl 30 examples of the sort of PvP save potentials you may confront:<br/>\n<br/>\n Ftr10/CoT16/Bard4 F/W/R vs spells: 39/27/33 + d20<br/>\n Pal9/Src18/Mnk3 F/W/R vs spells: 31/30/28 + d20<br/>\n<br/>\n As far as the monster skins spawning around your server, you would know that better than I.  Hope this helps you to decide the best route to take.  Good luck!<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Alright, that was actually a bit informative. It seems if I want to do a necromancer, then an arcanist would be better for me to choose than cleric. Makes sense. ..Would you help me build it, Hipredux?<br/>\n<br/>\n<br/>\n I wouldn't know about the monster skins too much. But, it's interesting to see the differences between the cleric/wizard choices.</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:45 PM - Dec 08, 2016",
      "content": "<div>Sure.  That's what we do around here.<br/>\n<br/>\n Build a pure wizard and post it in this thread.  You can ignore the skill allocation for the time being except what you'll need to qualify for certain feats.  Wizards have plenty of skill points to pass around.<br/>\n<br/>\n Then we'll see what you've chosen, your decisions and make suggestions.  A pure level 30 wizard should be very easy to plot out for anyone.  If you have any basic questions about how things fit together, consult the <strong><a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Main_Page\" rel=\"noreferrer\" target=\"_blank\">NWNwiki</a></strong> and your server's wiki and forum for all the changes.<br/>\n<br/>\n If you haven't played on Arelith yet, it's going to be difficult to anticipate the best way to build.  Learning the monster potentials, how the designer(s) empowered them and assigned properties to their skin will tell you how well your spells will work.  I can't help with that aspect because I don't play there, but it will affect your build decisions.</div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "5:53 PM - Dec 08, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>Sure.  That's what we do around here.<br/>\n<br/>\n Build a pure wizard and post it in this thread.  You can ignore the skill allocation for the time being except what you'll need to qualify for certain feats.  Wizards have plenty of skill points to pass around.<br/>\n<br/>\n Then we'll see what you've chosen, your decisions and make suggestions.  A pure level 30 wizard should be very easy to plot out for anyone.  If you have any basic questions about how things fit together, consult the <strong><a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Main_Page\" rel=\"noreferrer\" target=\"_blank\">NWNwiki</a></strong> and your server's wiki and forum for all the changes.<br/>\n<br/>\n If you haven't played on Arelith yet, it's going to be difficult to anticipate the best way to build.  Learning the monster potentials, how the designer(s) empowered them and assigned properties to their skin will tell you how well your spells will work.  I can't help with that aspect because I don't play there, but it will affect your build decisions.</div></blockquote>\n<div align=\"left\">Only two things I do really know is A. Lots of dispells sometimes and B. High saves are probably likely as well especially if they roll 20.. xD Now, I do have a question before I put together the build (as this is posted I'm working on it :o. Is a pure wizard the best idea? I'm just curious if adding like rogue or not would help tumble and all. Is a pure wizard better in this situation?<br/>\n<br/>\n Edit I'll just make a pure wizard like you said and I guess it will be decided by then..</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:14 PM - Dec 08, 2016",
      "content": "<div>New toon builders should always build the \"pure\" version first when it comes to dedicated spellcasters.  You'll be able to set priorities easier without considering how other classes might interfere.<br/>\n<br/>\n Vets can do the multiclass compensations in their heads, for the most part, but it is still good to see firsthand the trade-offs.  Then you can decide easier if it's worth it to branch out.  Just remember that a pure mage's buffs are the most difficult to dispel and their penetration the hardest to resist.  How intent you are to depend on those elements will determine if it is a benefit or detriment to dilute the spellcasting power.</div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "7:21 PM - Dec 08, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>New toon builders should always build the \"pure\" version first when it comes to dedicated spellcasters.  You'll be able to set priorities easier without considering how other classes might interfere.<br/>\n<br/>\n Vets can do the multiclass compensations in their heads, for the most part, but it is still good to see firsthand the trade-offs.  Then you can decide easier if it's worth it to branch out.  Just remember that a pure mage's buffs are the most difficult to dispel and their penetration the hardest to resist.  How intent you are to depend on those elements will determine if it is a benefit or detriment to dilute the spellcasting power.</div></blockquote>\n<div align=\"left\">(This is going to be highly incomplete, as I don't really know when ability ups, feats, come in etc, and I'm likely throwing random.. not helpful things in... guess it will be address later<br/>\n<br/>\n<br/>\n STR 10<br/>\n Dex 12<br/>\n CON 14<br/>\n INT 18<br/>\n WIS 10<br/>\n CHA 8<br/>\n<br/>\n (all wiz)<br/>\n 1) SF Con, SF Greater CON<br/>\n 2)<br/>\n 3) Extend Spell<br/>\n 4)<br/>\n 5) Empower? (Thoughts), or Combat Casting<br/>\n 6) Sp F. Necro<br/>\n 7)<br/>\n 8)<br/>\n 9) SF Evo<br/>\n 10) SF- Greater Necro<br/>\n 11)<br/>\n 12) GSF EVO<br/>\n 13)<br/>\n 14)<br/>\n 15) Spell penetration , ???<br/>\n<br/>\n<br/>\n I'll admit this isn't the full 30 like you asked me to do. I fully apologize, but when it came to feats, besides the epic spell focuses of Conj/Necro/Evo, The improve spell pen, and epic spells such as mummy dust and hellball, ruin (which is heavily empowered with epic evo compared to vanilla counterparts.) I couldn't think of anything else to add for the next 15 or so levels.<br/>\n<br/>\n<br/>\n Maybe instead I'll explain my choices?<br/>\n<br/>\n Con and Greater SF Con. Mandatory as a spell caster if I want any hope of solo play until later (they are the shield and a level 2 instead of the boar, nets me a dire wolf with greater), plus it helps acid sheathe... I think.<br/>\n<br/>\n Necromancy focus, because... that's what this is meant to be necromancer. (and up to 3 undead minions with epic, and I think it might be useful for my necromancy spells)<br/>\n<br/>\n Evocation (for when facing undead foes more than likely, since necromancy would heal not kill)<br/>\n<br/>\n Extend for buffs probably not needed (but the longer they last, the less spell slots I need to dedicate (minus if they get dispelled.)<br/>\n<br/>\n Empower ...I thought this might boost up the power of the necro and evo spells and such (doesn't affect saving throws sadly) or Combat cast, as a few spells are 'touch' related and the -4 penalty might be a hindrance, or not. I can't really say.<br/>\n<br/>\n  </div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:47 PM - Dec 08, 2016",
      "content": "<div>For a level 30 cap server, you are limited to 7 ability bumps (every 4 levels).  Any additional enhancement of your primary ability must be made during epic levels using Great ability feats.<br/>\n<br/>\n I think the following spread is better.  You'll need at least CON 16 for any caster that is not exclusively an artillery caster or your HPs will be way too low and your Fort needs all the help it can get.<br/>\n<br/>\n STR: 8<br/>\n DEX: 12<br/>\n CON: 16<br/>\n WIS: 8<br/>\n INT: 18 (26)<br/>\n CHA: 8<br/>\n<br/>\n We'll assume a human so we'll count how many feats available and the type.<br/>\n  <br/>\n Here are the number of pre-epic feats open:<br/>\n Human: 1<br/>\n General: 7<br/>\n Bonus: 4<br/>\n -------<br/>\n Total: 12<br/>\n<br/>\n If you try to focus in 3 schools (necro/conj/evoc), that costs half of your feats - 6<br/>\n Spell pen - 1<br/>\n Expertise - 1<br/>\n Toughness (+15% HPs) - 1<br/>\n Empower - 1<br/>\n Great Fort - 1<br/>\n Skill Focus: Concentration - 1<br/>\n<br/>\n So, it's probably better to drop one of the focus schools and substitute Grtr Spell Pen and ImpExpertise.  (Extend Spell is only handy in early levels.)<br/>\n<br/>\n Now is when the worst squeeze starts...<br/>\n<br/>\n Here are the number of epic feats open:<br/>\n General: 4<br/>\n Bonus: 3<br/>\n -------<br/>\n Total: 7<br/>\n<br/>\n Considered feat allocation:<br/>\n<br/>\n Epic focus, 3 schools - 3<br/>\n Epic penetration - 1<br/>\n 2 Epic spells - 2<br/>\n Great INT x1<br/>\n<br/>\n Instead...<br/>\n  <br/>\n Epic Focus: Necro - 1<br/>\n 2 Epic spells - 2<br/>\n Epic Concentration - 1<br/>\n Great INT x3  (this effectively adds +1 to DC of ALL focus and an extra level 6 slot)<br/>\n<br/>\n Then your final ability spread would be:<br/>\n  <br/>\n STR: 8<br/>\n DEX: 12<br/>\n CON: 16<br/>\n WIS: 8<br/>\n INT: 18 (28)<br/>\n CHA: 8<br/>\n<br/>\n For gifts, if you decide to go there... I recommend INT and CON.<br/>\n<br/>\n  </div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "12:15 AM - Dec 09, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>For a level 30 cap server, you are limited to 7 ability bumps (every 4 levels).  Any additional enhancement of your primary ability must be made during epic levels using Great ability feats.<br/>\n<br/>\n I think the following spread is better.  You'll need at least CON 16 for any caster that is not exclusively an artillery caster or your HPs will be way too low and your Fort needs all the help it can get.<br/>\n<br/>\n STR: 8<br/>\n DEX: 12<br/>\n CON: 16<br/>\n WIS: 8<br/>\n INT: 18 (26)<br/>\n CHA: 8<br/>\n<br/>\n We'll assume a human so we'll count how many feats available and the type.<br/>\n  <br/>\n Here are the number of pre-epic feats open:<br/>\n Human: 1<br/>\n General: 7<br/>\n Bonus: 4<br/>\n -------<br/>\n Total: 12<br/>\n<br/>\n If you try to focus in 3 schools (necro/conj/evoc), that costs half of your feats - 6<br/>\n Spell pen - 1<br/>\n Expertise - 1<br/>\n Toughness (+15% HPs) - 1<br/>\n Empower - 1<br/>\n Great Fort - 1<br/>\n Skill Focus: Concentration - 1<br/>\n<br/>\n So, it's probably better to drop one of the focus schools and substitute Grtr Spell Pen and ImpExpertise.  (Extend Spell is only handy in early levels.)<br/>\n<br/>\n Now is when the worst squeeze starts...<br/>\n<br/>\n Here are the number of epic feats open:<br/>\n General: 4<br/>\n Bonus: 3<br/>\n -------<br/>\n Total: 7<br/>\n<br/>\n Considered feat allocation:<br/>\n<br/>\n Epic focus, 3 schools - 3<br/>\n Epic penetration - 1<br/>\n 2 Epic spells - 2<br/>\n Great INT x1<br/>\n<br/>\n Instead...<br/>\n  <br/>\n Epic Focus: Necro - 1<br/>\n 2 Epic spells - 2<br/>\n Epic Concentration - 1<br/>\n Great INT x3  (this effectively adds +1 to DC of ALL focus and an extra level 6 slot)<br/>\n<br/>\n Then your final ability spread would be:<br/>\n  <br/>\n STR: 8<br/>\n DEX: 12<br/>\n CON: 16<br/>\n WIS: 8<br/>\n INT: 18 (28)<br/>\n CHA: 8<br/>\n<br/>\n For gifts, if you decide to go there... I recommend INT and CON.<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">You don't have to assume a human ^^ I put all the information on my first post (though... now minus the scythe idea). But, I suspect my intro got in the way of that. (Which you still didn't rate <img class=\"img-emoji\" src=\"emoji/12.gif\"/> xD)<br/>\n<br/>\n Not going to lie.. the way you just put everything has me slightly confused, (though I had spell pen in there already, so wouldn't that be 5?)<br/>\n<br/>\n Anyway, three feats into Great INT x3 for a base bonus of +3 int, in intervals of +1. So, that would  mean I would have +3 more INT than normal. Which is good, but I wonder if that's really the best choice (if we are concerned about eating up feats). Base wise I suspect with gift the INT to be 20. Ability bumps I suppose brings that up to 27, the Great gives 30 (if we take three like you suggest). However, if I can get +9 (from items) and bring it up to 36 (39 with great). Isn't that essentially the same?<br/>\n<br/>\n I suppose I could do without conjuration (although epic for this wouldn't be needed. Maybe I can just use higher level summon scrolls..), and whilst that doesn't give a bolstered Sheathe, it's still powerful on its own, though soloing will depend on how many scrolls I can afford at the time xD. Because Evocation would be needed to make my other spells somewhat effective right? Two epic spells could be Hellball, and Mummy Dust. If we open up the three GRT INT, they can be used for epic penetration. I was accounting on not using GRT INT, but I could be wrong. Thoughts?</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:55 AM - Dec 09, 2016",
      "content": "<div>I think you are underestimating how vital uber Concentration is to a dedicated spellcaster.  That should be priority #1 else all your plans to improve casting effectiveness becomes moot when the spell is interrupted.  And I am not even focusing on the taunting effects it can prevent.<br/>\n<br/>\n Here's how abilities translate into DC:  4 points in INT = +2 universal spell foci  (or 2 INT = +1 universal DC)<br/>\n<br/>\n That's why it only makes sense to focus into one (preferred) school in epic because what you end up doing is suppressing the other schools too much by losing INT for specific foci.   Boosting INT as high as possible also has a direct influence on better saves vs. spells via Spellcraft and spotting traps (Search) and more slots.<br/>\n<br/>\n You were throwing around a lot of hypotheticals there, but it's actually pretty straight-forward.<br/>\n<br/>\n An intrinsic INT level of 28 can be capped at 40 using a combination of item properties and buffs.  The buffs will not increase the number of slots, but the item props will.  The DC will benefit from the combination, however.<br/>\n<br/>\n I also feel ImpExpertise is essential because the AC is pretty bad (an extra +3 Tumble from a secondary dump won't make much of a dent).  Casting will break ImpExpertise mode, but until the cast is actually activated, you have +10 AC to help avoid getting manhandled.  It's somewhat of a pain to beconstantly toggling modes but that's the normal life of a spellcaster. Your toon will be limited to an AC bonus on robes, deflection on cloak and dodge AC on boots (maybe an ammy with some natural AC but usually ammies contain far more useful properties than +AC).  Bottom line: this toon will get hit A LOT without help from expertise.  I guess Epic Warding is beyond the scope of Arelith so figure on lots of buffs with Premonition and the Stoneskins.<br/>\n<br/>\n Hope some of this is sinking in.  It's pretty basic stuff as far as spellcasting goes.</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:16 AM - Dec 09, 2016",
      "content": "<div><blockquote><div><strong>Rua Blackmist wrote:</strong><hr/>You don't have to assume a human ^^ I put all the information on my first post (though... now minus the scythe idea). But, I suspect my intro got in the way of that. (Which you still didn't rate <img class=\"img-emoji\" src=\"emoji/12.gif\"/> xD)<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\"><em>\"Race- Human\"  </em>would seem to imply a definite preference.  It's usually a good starting point anyway with the extra pre-epic feat and skill points.<br/>\n<br/>\n I don't know what you were expecting in terms of rating a request description. How about \"Loud\"?  The font seems unnecessarily large even for someone suffering from glaucoma like me.<br/>\n It just reads like you played another toon somewhere (maybe Arelith?), it died and now you are planning to build a new one by considering suggestions from the guild membership.  Am I missing something?  Wouldn't be the first time.<br/>\n<br/>\n We will respond to a theme or backstory for a fully-completed and tested build if we think it is well done.  In you are into fanfic, I suppose you could post it in Ye Olde Tavern.  That's usually where we discuss non-building topics.</div></div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "1:55 AM - Dec 09, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>I think you are underestimating how vital uber Concentration is to a dedicated spellcaster.  That should be priority #1 else all your plans to improve casting effectiveness becomes moot when the spell is interrupted.  And I am not even focusing on the taunting effects it can prevent.<br/>\n<br/>\n Here's how abilities translate into DC:  4 points in INT = +2 universal spell foci  (or 2 INT = +1 universal DC)<br/>\n<br/>\n That's why it only makes sense to focus into one (preferred) school in epic because what you end up doing is suppressing the other schools too much by losing INT for specific foci.   Boosting INT as high as possible also has a direct influence on better saves vs. spells via Spellcraft and spotting traps (Search) and more slots.<br/>\n<br/>\n You were throwing around a lot of hypotheticals there, but it's actually pretty straight-forward.<br/>\n<br/>\n An intrinsic INT level of 28 can be capped at 40 using a combination of item properties and buffs.  The buffs will not increase the number of slots, but the item props will.  The DC will benefit from the combination, however.<br/>\n<br/>\n I also feel ImpExpertise is essential because the AC is pretty bad (an extra +3 Tumble from a secondary dump won't make much of a dent).  Casting will break ImpExpertise mode, but until the cast is actually activated, you have +10 AC to help avoid getting manhandled.  It's somewhat of a pain to beconstantly toggling modes but that's the normal life of a spellcaster. Your toon will be limited to an AC bonus on robes, deflection on cloak and dodge AC on boots (maybe an ammy with some natural AC but usually ammies contain far more useful properties than +AC).  Bottom line: this toon will get hit A LOT without help from expertise.  I guess Epic Warding is beyond the scope of Arelith so figure on lots of buffs with Premonition and the Stoneskins.<br/>\n<br/>\n Hope some of this is sinking in.  It's pretty basic stuff as far as spellcasting goes.</div></blockquote>\n<div align=\"left\"> I asked if the three Grt Int (feat wise) could be used for something else. That in no way is saying 'Concentration isn't worth it, scrap it' So, I don't really know where.. underestimating a practically mandatory spell caster thing... is implied... but.. maybe I typed something hinting at that? Wouldn't be the first time I suspect.<br/>\n<br/>\n As for DC it sounds like what you're saying is 36 and 40 INT (buffed) is a matter of DC as well as slots (which adding in spell focus and penetration). So, I will concede on the intellect matter. I can understand 1 GRT INT, bringing 27 to 28. But, added INT armor it goes to 37 a buff from 38-40. That's the cap as you say right? Now, I do understand that 3 great intellects as you suggest would bring it to base 30. and then added armor buffs is 39 then 1 buff is always 40-42 intellect.<br/>\n<br/>\n So, if I understand this correctly. If Casting a level 9 spell it would be DC 10+ Spell level 9+ Ability mod Intellect 40 +15 + feats if Epic +6 Epic pen +6 = 46DC I got that right? (Though, I don't understand the spell foci bit) ...Yeah, I'm starting to find out I stink at this xD<br/>\n<br/>\n IMP expertise, I've never used it to be honest, but I can understand it may have to be used. (Unfortunate casting will break it, I tend to forget toggling, but I'll have to get use to it.) But, I understand it. I'll have to get use to it, though if I can help it I'd rather not even get hit. (Hopefully using things like Finger of Death, etc as a last resort type attack.) But, having to rely on buffs was to be expected as a spell caster.<br/>\n<br/>\n So, you're saying to maybe get necromany up to epic. But, no other school would be worth focusing in due to feats correct?<br/>\n<br/>\n I know I may be over thinking things, and such but I ask you to have patience ^^' I ...guess I get off track, but I end up liking to question things and such.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  </div></div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "1:59 AM - Dec 09, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n<blockquote><div><strong>Rua Blackmist wrote:</strong><hr/>You don't have to assume a human ^^ I put all the information on my first post (though... now minus the scythe idea). But, I suspect my intro got in the way of that. (Which you still didn't rate <img class=\"img-emoji\" src=\"emoji/12.gif\"/> xD)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\"><em>\"Race- Human\"  </em>would seem to imply a definite preference.  It's usually a good starting point anyway with the extra pre-epic feat and skill points.<br/>\n<br/>\n I don't know what you were expecting in terms of rating a request description. How about \"Loud\"?  The font seems unnecessarily large even for someone suffering from glaucoma like me.<br/>\n It just reads like you played another toon somewhere (maybe Arelith?), it died and now you are planning to build a new one by considering suggestions from the guild membership.  Am I missing something?  Wouldn't be the first time.<br/>\n<br/>\n We will respond to a theme or backstory for a fully-completed and tested build if we think it is well done.  In you are into fanfic, I suppose you could post it in Ye Olde Tavern.  That's usually where we discuss non-building topics.</div>\n</div></blockquote>\n<div align=\"left\">By 'We still assume human' I assumed you didn't see that for Race I had put... human xD ...Don't judge....<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n Your last few sentences.... definitely missing something ... it was meant to get a fun little introduction to the thread, not a fanfic. I asked rate because I wanted to know if it was a good attempt or horrible. I'm guessing horrible since I have to explain it... and it being \"loud\" ^^ xD</div></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:11 AM - Dec 09, 2016",
      "content": "<div>This is just a big thank you to the two of you - Hip and Rua. Having never gone down a spellcaster route myself, I'm finding all this very educational in terms of the basics.<br/>\n<br/>\n Selfish, I know, but seriously, thanks very much! <img class=\"img-emoji\" src=\"emoji/11.gif\"/></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "2:13 AM - Dec 09, 2016",
      "content": "<div><blockquote><div><strong>Stagmeister wrote:</strong><hr/>This is just a big thank you to the two of you - Hip and Rua. Having never gone down a spellcaster route myself, I'm finding all this very educational in terms of the basics.<br/>\n<br/>\n Selfish, I know, but seriously, thanks very much! <img class=\"img-emoji\" src=\"emoji/11.gif\"/></div></blockquote>\n<div align=\"left\">I don't think it's selfish at all. If you're learning something from it than that's great. xD I'm learning a bit myself. *coughs* ^ We must nerd out and learn together <img class=\"img-emoji\" src=\"emoji/15.gif\"/></div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:39 AM - Dec 09, 2016",
      "content": "<div>(This is in response to your #13 post...)<br/>\n<br/>\n Okay, let's back up a bit, Rua.  This should be a review/repeat.  It's the spell mechanics that seem fuzzy for you.<br/>\n<br/>\n We'll consider necromancy because it will achieve the highest DC with all 3 foci.  Your best necromancy spell will be Level 9 Wail which checks SR and saves for instant death vs. Fort for 10m radius (all creatures within AoE must win checks and saves for up to 30 creatures total or die).<br/>\n<br/>\n First comes a penetration check vs. opposed Spell Resistance, the first line of target's defense.  Unless the spell casting bypasses the SR, there will be no save and the spell fails.<br/>\n<br/>\n By electing only pre-epic spell penetration (+2), we get:<br/>\n<br/>\n Penetration = d20 + caster levels + feats, or<br/>\n                    = d20 + 30 + 2, or<br/>\n                    = 33 to 52 (average 42)<br/>\n<br/>\n That means average rolls will bypass SR of 42 or less.<br/>\n<br/>\n The reason I chose a single penetration feat is to increase the low roll from 31 to 33.  SR 32 is a very popular (common) item property so it is a good idea to at least bypass that much.<br/>\n<br/>\n Assuming the spell bypasses the opposed SR, next is the DC to beat saves.<br/>\n<br/>\n Using your projected INT 40 level for fully buffed, fully equipped wizard, we get:<br/>\n<br/>\n DC = 10 + ability modifier + feats (necro) + spell level, or<br/>\n<br/>\n        = 10 + 15 + 6 + 9 = 40  vs. target's base Fort + d20<br/>\n<br/>\n Your figures were about right but you added the penetration into the DC/saves calculation.<br/>\n<br/>\n And yes, you've interpreted correctly.  <br/>\n<br/>\n Focusing hard on one school is fine since that will be your specialty, your fallback.  But when you add Great INT in all those epic slots where you would have been taking multiple spell foci, the Great INT will be increasing ALL schools DCs by +1 DC per 2 Grt INT, including your primary (necro) focus.  When you reduce the number of Grt INT to take epic spell foci in other schools, it only increases the DC for those schools and adds nothing to your primary (necro) or all other schools.  This is why increasing INT drastically will improve your DC for all spells in your repertoire in one fell swoop (which is why you'll always see arcane power builds with ridiculous primary ability levels and little else).<br/>\n<br/>\n<em>edit: BTW, don't get discouraged on one person's opinion when trying to be creative.  You happened to canvass a writer of fiction who isn't easily impressed.  Just dumb luck that.  Keep trying, though.  It's only through trials and errors that any of us stand a chance to discover something remarkable, a success worth savoring. </em></div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "3:54 AM - Dec 09, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>(This is in response to your #13 post...)<br/>\n<br/>\n Okay, let's back up a bit, Rua.  This should be a review/repeat.  It's the spell mechanics that seem fuzzy for you.<br/>\n<br/>\n We'll consider necromancy because it will achieve the highest DC with all 3 foci.  Your best necromancy spell will be Level 9 Wail which checks SR and saves for instant death vs. Fort for 10m radius (all creatures within AoE must win checks and saves for up to 30 creatures total or die).<br/>\n<br/>\n First comes a penetration check vs. opposed Spell Resistance, the first line of target's defense.  Unless the spell casting bypasses the SR, there will be no save and the spell fails.<br/>\n<br/>\n By electing only pre-epic spell penetration (+2), we get:<br/>\n<br/>\n Penetration = d20 + caster levels + feats, or<br/>\n                    = d20 + 30 + 2, or<br/>\n                    = 33 to 52 (average 42)<br/>\n<br/>\n That means average rolls will bypass SR of 42 or less.<br/>\n<br/>\n The reason I chose a single penetration feat is to increase the low roll from 31 to 33.  SR 32 is a very popular (common) item property so it is a good idea to at least bypass that much.<br/>\n<br/>\n Assuming the spell bypasses the opposed SR, next is the DC to beat saves.<br/>\n<br/>\n Using your projected INT 40 level for fully buffed, fully equipped wizard, we get:<br/>\n<br/>\n DC = 10 + ability modifier + feats (necro) + spell level, or<br/>\n<br/>\n        = 10 + 15 + 6 + 9 = 40  vs. target's base Fort + d20<br/>\n<br/>\n Your figures were about right but you added the penetration into the DC/saves calculation.<br/>\n<br/>\n And yes, you've interpreted correctly.  <br/>\n<br/>\n Focusing hard on one school is fine since that will be your specialty, your fallback.  But when you add Great INT in all those epic slots where you would have been taking multiple spell foci, the Great INT will be increasing ALL schools DCs by +1 DC per 2 Grt INT, including your primary (necro) focus.  When you reduce the number of Grt INT to take epic spell foci in other schools, it only increases the DC for those schools and adds nothing to your primary (necro) or all other schools.  This is why increasing INT drastically will improve your DC for all spells in your repertoire in one fell swoop (which is why you'll always see arcane power builds with ridiculous primary ability levels and little else).<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Alright, see.. now this I completely understand. Instead of being confused I actually can understand that. Spell penetration goes against SR, and then it goes into saves. I know SR 16 is common on (self enchanted, and racial buffs like drow, but could be higher as you said) items in Arelith, and many monks don't really go beyond 30-44 SR to begin with .<br/>\n<br/>\n Okay, now I get it completely. We just needed to tinker with the explanation a bit I guess haha ^^'. We focus on one to get improved DC for the others, multiple focuses (whilst netting +6 for each individual school) would hinder the others pretty badly. I see... by wanting to focus on two specific schools, I was really crippling myself. Not only in feats, but other spell potential. I apologise for not getting it really until now. Truth be told spell mechanics have been getting me. I didn't even know the intellect modifier was taken into account (for DC) until I was doing those figures... and still sorta got it wrong. Always thought it was 10 + spell level + SP + SF. Hence my major focus.<br/>\n<br/>\n But, now that we have figured everything out, and um cleared up the misunderstanding. Since we're only going to focus in necromancy as still planned. ...What's the plan?</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:08 AM - Dec 09, 2016",
      "content": "<div>I figure you have enough understanding now to pull together a full 1 thru 30 list.  Let's see what it looks like.  <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515321/\" rel=\"noreferrer\" target=\"_blank\">This guide</a></strong> is for complete builds but will help to get you started.<br/>\n<br/>\n On the skills, max Concentration and Spellcraft and crossclass 15 to Tumble.  You'll still have a lot of skills to play with and many alternatives.  All my wizards recover and set traps to help me save on spells, but I don't know many mages who follow that strategy. You don't need rogue or assassin levels to gain proficiency either, not with all that INT.  Otherwise, I'd try to xclass some points in Search.  Deadly electrical traps can kill a pure mage pretty easily.  Epic traps, same deal but you can't spot them without spamming Find Traps wherever you roam.<br/>\n<br/>\n If you absolutely MUST rumble (like against raks, demiliches and other spell immunes) use your Tenser or Iron Golem pre-buffed with one of the DR spells and the recipro shield of choice.</div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "4:18 AM - Dec 09, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>I figure you have enough understanding now to pull together a full 1 thru 30 list.  Let's see what it looks like.<br/>\n<br/>\n On the skills, max Concentration and Spellcraft and crossclass 15 to Tumble.  You'll still have a lot of skills to play with and many alternatives.  All my wizards recover and set traps to help me save on spells, but I don't know many mages who follow that strategy. You don't need rogue or assassin levels to gain proficiency either, not with all that INT.  Otherwise, I'd try to xclass some points in Search.  Deadly electrical traps can kill a pure mage pretty easily.  Epic traps, same deal but you can't spot them without spamming Find Traps wherever you roam.<br/>\n<br/>\n If you absolutely MUST rumble (like against raks, demiliches and other spell immunes) use your Tenser or Iron Golem pre-buffed with one of the DR spells and the recipro shield of choice.</div></blockquote>\n<div align=\"left\">Hate to ask this of you, but since I still wouldn't know how many skill points total there are to spend. Would it be okay if I made the 1-30, and you made the skill list suggestion? I mean I know I'd love to try and have heal (for medkits) and hide and move silently (if possible even though 15 levels wouldn't help all that much I suspect), but I don't really know how many skills to blow (and outside of lore, spellcraft, Concentration and heal) I don't really know which ones might benefit. I'd say spot or something, but frankly 15 wouldn't be enough for dedicated stealthers (I suspect.) But, ...I actually like your idea of recovering and set traps... certainly would be helpful... although epic traps only a rogue can disarm those right? Or is that just 'spotting'.<br/>\n<br/>\n<br/>\n Anyway, I'll get to work on the 1-30 build and let's see how I do xD I might miss some feats you mentioned or miss some slots in which they go, but I suppose that's why you're double checking ^^<br/>\n<br/>\n<br/>\n Side note: Should I make my character 'focus' in necromancy upon making it (when configuring packages) to get the extra spell slot? It would mean I couldn't use divination like... premonition etc..</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:20 PM - Dec 09, 2016",
      "content": "<div><blockquote><div><strong>Rua Blackmist wrote:</strong><hr/>\n Hate to ask this of you, but since I still wouldn't know how many skill points total there are to spend. Would it be okay if I made the 1-30, and you made the skill list suggestion? I mean I know I'd love to try and have heal (for medkits) and hide and move silently (if possible even though 15 levels wouldn't help all that much I suspect), but I don't really know how many skills to blow (and outside of lore, spellcraft, Concentration and heal) I don't really know which ones might benefit. I'd say spot or something, but frankly 15 wouldn't be enough for dedicated stealthers (I suspect.)</div></blockquote>\nYou will allocate the skills.  The total is 283.  I've already allocated 96 (Conc/Spcr/Tumb) for you and the rest is yours (187).  A pure wizard is particulary ornery to calculate skills due to the constantly increasing INT modifier, but with a total provided all you need to know is what is cross-classed and what is a class skill and you are good to go.  Once you've settled on your feat distribution and skill breakdown, I'll throw together a comprehensive leveling guide for you to begin playing.<br/>\n<br/>\n You don't need stealth.  This is a high-mage that uses Invis, ImpInvis and Grtr Sanctuary for recon.  Cross-classing 16 ranks to Listen wouldn't hurt though.  Combined with Clairvoyance and Empowered Owl's WIS, your final detection will be in the high 20's.\n<blockquote><div>But, ...I actually like your idea of recovering and set traps... certainly would be helpful... although epic traps only a rogue can disarm those right? Or is that just 'spotting'.</div></blockquote>\n The way a mage usually handles epic traps requires some knowledge of the environment to be most efficient (you can't be spamming <em>Find Traps</em> every 30 secs).  When you suspect epic traps in the vicinity, you'll cast <em>Find Traps</em> to locate them.  The spell will locate every trap regardless of the detection DC.  Then use a sacrificial summon to trigger it.  Traps on the floor you'll need to spawn them on the far side and command them to move towards your toon (just watch out the electrical's long range and chain effect).  For containers/doors, pick up a sling (or any ranged weapon), start plunking at the trapped placeable and set the summon to attack nearest.\n<blockquote><div>Anyway, I'll get to work on the 1-30 build and let's see how I do xD I might miss some feats you mentioned or miss some slots in which they go, but I suppose that's why you're double checking ^^</div></blockquote>\n You have all the feat totals broken down into pre-epic and epic already.  General feats are slotted every 3 levels.  The human gets a bonus feat at level 1 and wizard gets a bonus feat every 5 levels in pre-epic starting at level 5 and every 3 levels in epic starting at level 23.  As long as you declare all the feats you've decided on, the list will work.  Include the ability bumps every 4 levels starting at level 4 (there are 7 of them).\n<blockquote><div>Side note: Should I make my character 'focus' in necromancy upon making it (when configuring packages) to get the extra spell slot? It would mean I couldn't use divination like... premonition etc..</div></blockquote>\n I wouldn't.  Necromancers do not make very good specialists.  <em>See Invis</em> early, <em>True Seeing</em> later and Find Traps are just about irreplacable (you won't even be able to use scrolls from that school).  <br/>\n<br/>\n One final note:  I totally forgot about Craft Wand.  It's a relatively benign feat but so very helpful to high mages of all types. Here's a few examples of it's utility: <ul><li>Summon a skel into a mob and spam NEB on it to heal it while the spell drains STR and damages the mob flanking it.</li> <li>Find Traps (already discussed)</li> <li>Invis/ImpInvis for recon</li> <li>Isaac Lesser Missile Storm (Caster 13 level)</li> <li>Sacrificial summons I through IV</li> </ul> Crafting Wands allows a mage to slot only those spells where the DC and penetration matter most.  If you can purchase all the wands like these in stores, you won't need the feat.  Actually, I even use it to get gold together to buy expensive gear, charging UMDers a king's ransom for wands that would otherwise be beyond their grasp (they all love <em>Flame Weapon</em> wands).  It does cost some XP, but typically I'll do some easy runs to get the XP together before beginning to craft.  Think about it.  On servers with long dungeon crawls and limited rest, wands are just about the only way to conserve your elite spell slots.</div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "5:17 PM - Dec 09, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n<blockquote><div><strong>Rua Blackmist wrote:</strong><hr/>\n Hate to ask this of you, but since I still wouldn't know how many skill points total there are to spend. Would it be okay if I made the 1-30, and you made the skill list suggestion? I mean I know I'd love to try and have heal (for medkits) and hide and move silently (if possible even though 15 levels wouldn't help all that much I suspect), but I don't really know how many skills to blow (and outside of lore, spellcraft, Concentration and heal) I don't really know which ones might benefit. I'd say spot or something, but frankly 15 wouldn't be enough for dedicated stealthers (I suspect.)</div></blockquote>\nYou will allocate the skills.  The total is 283.  I've already allocated 96 (Conc/Spcr/Tumb) for you and the rest is yours (187).  A pure wizard is particulary ornery to calculate skills due to the constantly increasing INT modifier, but with a total provided all you need to know is what is cross-classed and what is a class skill and you are good to go.  Once you've settled on your feat distribution and skill breakdown, I'll throw together a comprehensive leveling guide for you to begin playing.<br/>\n<br/>\n You don't need stealth.  This is a high-mage that uses Invis, ImpInvis and Grtr Sanctuary for recon.  Cross-classing 16 ranks to Listen wouldn't hurt though.  Combined with Clairvoyance and Empowered Owl's WIS, your final detection will be in the high 20's.\n<blockquote><div>But, ...I actually like your idea of recovering and set traps... certainly would be helpful... although epic traps only a rogue can disarm those right? Or is that just 'spotting'.</div></blockquote>\n The way a mage usually handles epic traps requires some knowledge of the environment to be most efficient (you can't be spamming <em>Find Traps</em> every 30 secs).  When you suspect epic traps in the vicinity, you'll cast <em>Find Traps</em> to locate them.  The spell will locate every trap regardless of the detection DC.  Then use a sacrificial summon to trigger it.  Traps on the floor you'll need to spawn them on the far side and command them to move towards your toon (just watch out the electrical's long range and chain effect).  For containers/doors, pick up a sling (or any ranged weapon), start plunking at the trapped placeable and set the summon to attack nearest.\n<blockquote><div>Anyway, I'll get to work on the 1-30 build and let's see how I do xD I might miss some feats you mentioned or miss some slots in which they go, but I suppose that's why you're double checking ^^</div></blockquote>\n You have all the feat totals broken down into pre-epic and epic already.  General feats are slotted every 3 levels.  The human gets a bonus feat at level 1 and wizard gets a bonus feat every 5 levels in pre-epic starting at level 5 and every 3 levels in epic starting at level 23.  As long as you declare all the feats you've decided on, the list will work.  Include the ability bumps every 4 levels starting at level 4 (there are 7 of them).\n<blockquote><div>Side note: Should I make my character 'focus' in necromancy upon making it (when configuring packages) to get the extra spell slot? It would mean I couldn't use divination like... premonition etc..</div></blockquote>\n I wouldn't.  Necromancers do not make very good specialists.  <em>See Invis</em> early, <em>True Seeing</em> later and Find Traps are just about irreplacable (you won't even be able to use scrolls from that school).  <br/>\n<br/>\n One final note:  I totally forgot about Craft Wand.  It's a relatively benign feat but so very helpful to high mages of all types. Here's a few examples of it's utility: <ul><li>Summon a skel into a mob and spam NEB on it to heal it while the spell drains STR and damages the mob flanking it.</li> <li>Find Traps (already discussed)</li> <li>Invis/ImpInvis for recon</li> <li>Isaac Lesser Missile Storm (Caster 13 level)</li> <li>Sacrificial summons I through IV</li> </ul> Crafting Wands allows a mage to slot only those spells where the DC and penetration matter most.  If you can purchase all the wands like these in stores, you won't need the feat.  Actually, I even use it to get gold together to buy expensive gear, charging UMDers a king's ransom for wands that would otherwise be beyond their grasp (they all love <em>Flame Weapon</em> wands).  It does cost some XP, but typically I'll do some easy runs to get the XP together before beginning to craft.  Think about it.  On servers with long dungeon crawls and limited rest, wands are just about the only way to conserve your elite spell slots.<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">\n<br/>\n (This build is based off your recommended spread, so I didn't have 13 dex to spring for dodge. Not sure it would help much considering though.)<br/>\n STR: 8<br/>\n DEX: 12<br/>\n CON: 16<br/>\n WIS: 8<br/>\n INT: 18 (26)<br/>\n CHA: 8<br/>\n<br/>\n Wizard 30, Human<br/>\n 1wiz) Expertise, Toughness<br/>\n 2)<br/>\n 3) Imp. Expertise.<br/>\n 4)<br/>\n 5) SF: Necromancy<br/>\n 6) Craft Wand<br/>\n 7)<br/>\n 8)<br/>\n 9) Emp. Spell<br/>\n 10) GSF: Necromancy<br/>\n 11)<br/>\n 12) Iron Will<br/>\n 13)<br/>\n 14)<br/>\n 15)Lightning Reflexes, Spell Pen.<br/>\n 16)<br/>\n 17)<br/>\n 18) Arc. Defense Necro, or Grt. Fort<br/>\n 19)<br/>\n 20)GTR Spell Pen.  (I might be bad at feat picking after all xD)<br/>\n 21) G. Int.<br/>\n 22)<br/>\n 23)ES: Mummy dust<br/>\n 24)G. Int 2<br/>\n 25)<br/>\n 26) G.Int 3<br/>\n 27) ESF: Concentration<br/>\n 28)<br/>\n 29)ES: Hellball<br/>\n 30)ESF: Necromancy<br/>\n<br/>\n These feats I might have gotten wrong so let me know. Otherwise, this is the skill set I came up with.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n I did some testing on NWN for a test run of what it was)<br/>\n I got 314 skill points<br/>\n (33) Concentration, (33) Heal, (15) Lore, (33) Spellcraft, (16) tumble, (16) set trap, (16) disable trap,  (16) listen, (16) discipline (40 left over)<br/>\n<br/>\n  </div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:10 PM - Dec 09, 2016",
      "content": "<div>Very good job, Rua!  You are definitely getting the hang of it now.  I have a few suggestions and the reasons for them.<br/>\nSpoiler [+]<br/>\n<br/>\n Wizard(30), Human, Any alignment<br/>\n<br/>\n STR: 8<br/>\n DEX: 12<br/>\n CON: 16<br/>\n WIS: 8<br/>\n INT: 18 (28)<br/>\n CHA: 8<br/>\n<br/>\n 01: Wiz(1): Toughness, Expertise, {Scribe Scroll}<br/>\n 02: Wiz(2)<br/>\n 03: Wiz(3): ImpExpertise<br/>\n 04: Wiz(4): INT+1 (19)<br/>\n 05: Wiz(5): SF: Necromancy<br/>\n 06: Wiz(6): Extend Spell<br/>\n 07: Wiz(7)<br/>\n 08: Wiz(8): INT+1 (20)<br/>\n 09: Wiz(9): Empower Spell<br/>\n 10: Wiz(10): Spell Penetration<br/>\n 11: Wiz(11)<br/>\n 12: Wiz(12): INT+1 (21), SkF: Concentration<br/>\n 13: Wiz(13)<br/>\n 14: Wiz(14)<br/>\n 15: Wiz(15): Great Fort, GSF: Necromancy<br/>\n 16: Wiz(16): INT+1 (22)<br/>\n 17: Wiz(17)<br/>\n 18: Wiz(18): Lightning Reflexes<br/>\n 19: Wiz(19)<br/>\n 20: Wiz(20): INT+1 (23), Craft Wand<br/>\n 21: Wiz(21): ESF: Necromancy<br/>\n 22: Wiz(22)    <br/>\n 23: Wiz(23): Grt INT (24)<br/>\n 24: Wiz(24): INT+1 (25), Mummy Dust<br/>\n 25: Wiz(25)<br/>\n 26: Wiz(26): Grt INT (26)<br/>\n 27: Wiz(27): ESkF: Concentration<br/>\n 28: Wiz(28): INT+1 (27)<br/>\n 29: Wiz(29): Hellball<br/>\n 30: Wiz(30): Grt INT (28)<br/>\n<br/>\n HP, max: 240<br/>\n Saves F/W/R: 16/16/14 (24/24/22 vs spells)<br/>\n BAB: 15<br/>\n AB (max, naked): 14 (melee), 16 (ranged)<br/>\n AC (naked/mundane armor/shield only): 14/14<br/>\n<br/>\n Skills: 280 - Concentration 33(49), Disable Trap 15(26), Heal 33(32), Listen 16(15), Lore 15(24),<br/>\n Open Lock 13(14), Search 12(21), Set Trap 12(15), Spellcraft 33(42), Tumble 15(16)<br/>\n<br/>\n Penetration: 33-52 vs SR + d20<br/>\n DC Necro: 25 + spell lvl<br/>\n DC schools except necro: 19 + spell lvl<br/>\n Spells/day (0-9): 4/7/6/6/6/6/5/5/5/5<br/>\n<br/>\n<br/>\n<br/>\n These are my reasons for the slight changes to your listing...<br/>\n<br/>\n<strong>Feats</strong><br/>\n I decided Extend would be important for the following spells: Resistance, Darkness, Death Armor/Element shield/Mestil sheath, Haste (if permahaste not available), Tenser, Spell mantles, Grtr Sanctuary.  Not necessarily at Wiz30, but earlier on, very handy.<br/>\n<br/>\n Your Will save is not terrible so opted out of Iron Will for SkF: Conc.<br/>\n<br/>\n Craft Wand can be postponed until late pre-epic.  Dunno how Arelith has implemented Craft Wand, but most servers give either higher caster level or more charges with higher class level.  Until that point, it can be somewhat inefficient to craft wands because the item created is limited.  You should check to see how Arelith does wand crafting.<br/>\n<br/>\n I lost 2-3 skill points for taking ESF earlier than your list.  It doesn't seem to matter, though.  <br/>\n<br/>\n<strong>Skills:</strong> ranks allocated (modified ranks)<br/>\n<br/>\n I will address only the modified ranks from here on, unless otherwise noted...<br/>\n<br/>\n You absolutely need decent Search or will be triggering traps, especially when hasted.  21 points will locate all non-epic traps the moment they enter your toon's perception range (roll of 1).<br/>\n<br/>\n Disable Trap 26 will allow you to recover all traps except epic.  However, if your server has customized the DCs, you may only be able to disarm some of the highest ones.<br/>\n<br/>\n Set Trap 15 will allow you to set all traps except epic ones.<br/>\n<br/>\n Open Lock 14 will allow you open all locks with DC of 34 and lower.  Buffed with Emp Cat figure DC 37 and lower.<br/>\n<br/>\n Tumble 15 (base ranks allocated).  Always allocate to Tumble in increments of 5.<br/>\n<br/>\n Spellcraft 42.  With Emp Fox buff, will increase saves vs. spells by +1/+1/+1.<br/>\n<br/>\n There's no doubt about it.  This is a hittable wizard without EMA.  You can boost it by 3 with Emp Cat and another 10 in ImpExpertise mode, but it has no PM levels to help the AC.  Just remember to pre-buff with Emp Endure for the 90 more HP and set your recipro shield.<br/>\n<br/>\n Discipline 16 serves no significant benefit.  There's only so much that can be done to protect against KD.  Try to spam NEB from range whenever you can to reduce enemy AB and damage before getting too familiar.  You'll have some decent summons so plan on jumping in, cast a quick death spell, then jump back out and let your summon take the damage.  I feel the concentration level should provide reliable casting performance in most situations.  For a level 30 server, 49 is high.<br/>\n<br/>\n You need not agree with all my suggestions.  There may be other factors that could make other skills highly-desirable.  Where I last played, I allocated LOTS to Appraise skill because without it, the elite gear was just too expensive to even consider.  That's just one example of a personal bias changing things up a bit.  Needless to say, I had to relinquish other skills potential making that decision but that's the sort of thing only the player can decide.<br/>\n<br/>\n  </div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "8:46 PM - Dec 09, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>Very good job, Rua!  You are definitely getting the hang of it now.  I have a few suggestions and the reasons for them.<br/>\nSpoiler [+]<br/>\n<br/>\n Wizard(30), Human, Any alignment<br/>\n<br/>\n STR: 8<br/>\n DEX: 12<br/>\n CON: 16<br/>\n WIS: 8<br/>\n INT: 18 (28)<br/>\n CHA: 8<br/>\n<br/>\n 01: Wiz(1): Toughness, Expertise, {Scribe Scroll}<br/>\n 02: Wiz(2)<br/>\n 03: Wiz(3): ImpExpertise<br/>\n 04: Wiz(4): INT+1 (19)<br/>\n 05: Wiz(5): SF: Necromancy<br/>\n 06: Wiz(6): Extend Spell<br/>\n 07: Wiz(7)<br/>\n 08: Wiz(8): INT+1 (20)<br/>\n 09: Wiz(9): Empower Spell<br/>\n 10: Wiz(10): Spell Penetration<br/>\n 11: Wiz(11)<br/>\n 12: Wiz(12): INT+1 (21), SkF: Concentration<br/>\n 13: Wiz(13)<br/>\n 14: Wiz(14)<br/>\n 15: Wiz(15): Great Fort, GSF: Necromancy<br/>\n 16: Wiz(16): INT+1 (22)<br/>\n 17: Wiz(17)<br/>\n 18: Wiz(18): Lightning Reflexes<br/>\n 19: Wiz(19)<br/>\n 20: Wiz(20): INT+1 (23), Craft Wand<br/>\n 21: Wiz(21): ESF: Necromancy<br/>\n 22: Wiz(22)    <br/>\n 23: Wiz(23): Grt INT (24)<br/>\n 24: Wiz(24): INT+1 (25), Mummy Dust<br/>\n 25: Wiz(25)<br/>\n 26: Wiz(26): Grt INT (26)<br/>\n 27: Wiz(27): ESkF: Concentration<br/>\n 28: Wiz(28): INT+1 (27)<br/>\n 29: Wiz(29): Hellball<br/>\n 30: Wiz(30): Grt INT (28)<br/>\n<br/>\n HP, max: 240<br/>\n Saves F/W/R: 16/16/14 (24/24/22 vs spells)<br/>\n BAB: 15<br/>\n AB (max, naked): 14 (melee), 16 (ranged)<br/>\n AC (naked/mundane armor/shield only): 14/14<br/>\n<br/>\n Skills: 280 - Concentration 33(49), Disable Trap 15(26), Heal 33(32), Listen 16(15), Lore 15(24),<br/>\n Open Lock 13(14), Search 12(21), Set Trap 12(15), Spellcraft 33(42), Tumble 15(16)<br/>\n<br/>\n Penetration: 33-52 vs SR + d20<br/>\n DC Necro: 25 + spell lvl<br/>\n DC schools except necro: 19 + spell lvl<br/>\n Spells/day (0-9): 4/7/6/6/6/6/5/5/5/5<br/>\n<br/>\n<br/>\n<br/>\n These are my reasons for the slight changes to your listing...<br/>\n<br/>\n<strong>Feats</strong><br/>\n I decided Extend would be important for the following spells: Resistance, Darkness, Death Armor/Element shield/Mestil sheath, Haste (if permahaste not available), Tenser, Spell mantles, Grtr Sanctuary.  Not necessarily at Wiz30, but earlier on, very handy.<br/>\n<br/>\n Your Will save is not terrible so opted out of Iron Will for SkF: Conc.<br/>\n<br/>\n Craft Wand can be postponed until late pre-epic.  Dunno how Arelith has implemented Craft Wand, but most servers give either higher caster level or more charges with higher class level.  Until that point, it can be somewhat inefficient to craft wands because the item created is limited.  You should check to see how Arelith does wand crafting.<br/>\n<br/>\n I lost 2-3 skill points for taking ESF earlier than your list.  It doesn't seem to matter, though.  <br/>\n<br/>\n<strong>Skills:</strong> ranks allocated (modified ranks)<br/>\n<br/>\n I will address only the modified ranks from here on, unless otherwise noted...<br/>\n<br/>\n You absolutely need decent Search or will be triggering traps, especially when hasted.  21 points will locate all non-epic traps the moment they enter your toon's perception range (roll of 1).<br/>\n<br/>\n Disable Trap 26 will allow you to recover all traps except epic.  However, if your server has customized the DCs, you may only be able to disarm some of the highest ones.<br/>\n<br/>\n Set Trap 15 will allow you to set all traps except epic ones.<br/>\n<br/>\n Open Lock 14 will allow you open all locks with DC of 34 and lower.  Buffed with Emp Cat figure DC 37 and lower.<br/>\n<br/>\n Tumble 15 (base ranks allocated).  Always allocate to Tumble in increments of 5.<br/>\n<br/>\n Spellcraft 42.  With Emp Fox buff, will increase saves vs. spells by +1/+1/+1.<br/>\n<br/>\n There's no doubt about it.  This is a hittable wizard without EMA.  You can boost it by 3 with Emp Cat and another 10 in ImpExpertise mode, but it has no PM levels to help the AC.  Just remember to pre-buff with Emp Endure for the 90 more HP and set your recipro shield.<br/>\n<br/>\n Discipline 16 serves no significant benefit.  There's only so much that can be done to protect against KD.  Try to spam NEB from range whenever you can to reduce enemy AB and damage before getting too familiar.  You'll have some decent summons so plan on jumping in, cast a quick death spell, then jump back out and let your summon take the damage.  I feel the concentration level should provide reliable casting performance in most situations.  For a level 30 server, 49 is high.<br/>\n<br/>\n You need not agree with all my suggestions.  There may be other factors that could make other skills highly-desirable.  Where I last played, I allocated LOTS to Appraise skill because without it, the elite gear was just too expensive to even consider.  That's just one example of a personal bias changing things up a bit.  Needless to say, I had to relinquish other skills potential making that decision but that's the sort of thing only the player can decide.<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Thank you, I appreciate your suggestions. I think you lost a few SP  because I was calculating the gift into my gain (and I dumped everything at lv 30 to see how many overall skill points I had to work with.)<br/>\n<br/>\n For my first build I ever attempted. I think it did rather well. Considering you only changed a few slight things and not the overall build. I'll have to agree on discipline... 16 might cut it for low levels, but in the high end? It's likely not going to help one bit.<br/>\n<br/>\n I think I might op to put some in appraise, I'll have to see when it eventually reaches that point. ^^ But, I appreciate your help.<br/>\n<br/>\n  </div></div>"
    },
    {
      "author": "Zeraxium",
      "avatar": "no_avatar.png",
      "timestamp": "10:03 PM - Dec 09, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>Very good job, Rua!  You are definitely getting the hang of it now.  I have a few suggestions and the reasons for them.<br/>\nSpoiler [+]<br/>\n<br/>\n Wizard(30), Human, Any alignment<br/>\n<br/>\n STR: 8<br/>\n DEX: 12<br/>\n CON: 16<br/>\n WIS: 8<br/>\n INT: 18 (28)<br/>\n CHA: 8<br/>\n<br/>\n 01: Wiz(1): Toughness, Expertise, {Scribe Scroll}<br/>\n 02: Wiz(2)<br/>\n 03: Wiz(3): ImpExpertise<br/>\n 04: Wiz(4): INT+1 (19)<br/>\n 05: Wiz(5): SF: Necromancy<br/>\n 06: Wiz(6): Extend Spell<br/>\n 07: Wiz(7)<br/>\n 08: Wiz(8): INT+1 (20)<br/>\n 09: Wiz(9): Empower Spell<br/>\n 10: Wiz(10): Spell Penetration<br/>\n 11: Wiz(11)<br/>\n 12: Wiz(12): INT+1 (21), SkF: Concentration<br/>\n 13: Wiz(13)<br/>\n 14: Wiz(14)<br/>\n 15: Wiz(15): Great Fort, GSF: Necromancy<br/>\n 16: Wiz(16): INT+1 (22)<br/>\n 17: Wiz(17)<br/>\n 18: Wiz(18): Lightning Reflexes<br/>\n 19: Wiz(19)<br/>\n 20: Wiz(20): INT+1 (23), Craft Wand<br/>\n 21: Wiz(21): ESF: Necromancy<br/>\n 22: Wiz(22)    <br/>\n 23: Wiz(23): Grt INT (24)<br/>\n 24: Wiz(24): INT+1 (25), Mummy Dust<br/>\n 25: Wiz(25)<br/>\n 26: Wiz(26): Grt INT (26)<br/>\n 27: Wiz(27): ESkF: Concentration<br/>\n 28: Wiz(28): INT+1 (27)<br/>\n 29: Wiz(29): Hellball<br/>\n 30: Wiz(30): Grt INT (28)<br/>\n<br/>\n HP, max: 240<br/>\n Saves F/W/R: 16/16/14 (24/24/22 vs spells)<br/>\n BAB: 15<br/>\n AB (max, naked): 14 (melee), 16 (ranged)<br/>\n AC (naked/mundane armor/shield only): 14/14<br/>\n<br/>\n Skills: 280 - Concentration 33(49), Disable Trap 15(26), Heal 33(32), Listen 16(15), Lore 15(24),<br/>\n Open Lock 13(14), Search 12(21), Set Trap 12(15), Spellcraft 33(42), Tumble 15(16)<br/>\n<br/>\n Penetration: 33-52 vs SR + d20<br/>\n DC Necro: 25 + spell lvl<br/>\n DC schools except necro: 19 + spell lvl<br/>\n Spells/day (0-9): 4/7/6/6/6/6/5/5/5/5<br/>\n<br/>\n<br/>\n<br/>\n These are my reasons for the slight changes to your listing...<br/>\n<br/>\n<strong>Feats</strong><br/>\n I decided Extend would be important for the following spells: Resistance, Darkness, Death Armor/Element shield/Mestil sheath, Haste (if permahaste not available), Tenser, Spell mantles, Grtr Sanctuary.  Not necessarily at Wiz30, but earlier on, very handy.<br/>\n<br/>\n Your Will save is not terrible so opted out of Iron Will for SkF: Conc.<br/>\n<br/>\n Craft Wand can be postponed until late pre-epic.  Dunno how Arelith has implemented Craft Wand, but most servers give either higher caster level or more charges with higher class level.  Until that point, it can be somewhat inefficient to craft wands because the item created is limited.  You should check to see how Arelith does wand crafting.<br/>\n<br/>\n I lost 2-3 skill points for taking ESF earlier than your list.  It doesn't seem to matter, though.  <br/>\n<br/>\n<strong>Skills:</strong> ranks allocated (modified ranks)<br/>\n<br/>\n I will address only the modified ranks from here on, unless otherwise noted...<br/>\n<br/>\n You absolutely need decent Search or will be triggering traps, especially when hasted.  21 points will locate all non-epic traps the moment they enter your toon's perception range (roll of 1).<br/>\n<br/>\n Disable Trap 26 will allow you to recover all traps except epic.  However, if your server has customized the DCs, you may only be able to disarm some of the highest ones.<br/>\n<br/>\n Set Trap 15 will allow you to set all traps except epic ones.<br/>\n<br/>\n Open Lock 14 will allow you open all locks with DC of 34 and lower.  Buffed with Emp Cat figure DC 37 and lower.<br/>\n<br/>\n Tumble 15 (base ranks allocated).  Always allocate to Tumble in increments of 5.<br/>\n<br/>\n Spellcraft 42.  With Emp Fox buff, will increase saves vs. spells by +1/+1/+1.<br/>\n<br/>\n There's no doubt about it.  This is a hittable wizard without EMA.  You can boost it by 3 with Emp Cat and another 10 in ImpExpertise mode, but it has no PM levels to help the AC.  Just remember to pre-buff with Emp Endure for the 90 more HP and set your recipro shield.<br/>\n<br/>\n Discipline 16 serves no significant benefit.  There's only so much that can be done to protect against KD.  Try to spam NEB from range whenever you can to reduce enemy AB and damage before getting too familiar.  You'll have some decent summons so plan on jumping in, cast a quick death spell, then jump back out and let your summon take the damage.  I feel the concentration level should provide reliable casting performance in most situations.  For a level 30 server, 49 is high.<br/>\n<br/>\n You need not agree with all my suggestions.  There may be other factors that could make other skills highly-desirable.  Where I last played, I allocated LOTS to Appraise skill because without it, the elite gear was just too expensive to even consider.  That's just one example of a personal bias changing things up a bit.  Needless to say, I had to relinquish other skills potential making that decision but that's the sort of thing only the player can decide.<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Apologies for this question. But, I wondered if Disable trap, pick lock, and such was even necessary? ... If I recall correctly... you get a familiar.. . one of which.. I believe was a ..pixie? Fey? type thing? That was a rogue... couldn't they be used to see/disable/open stuff? ..If they stay full rogue.. they could deal with epics and such, no? (Sorry for english)</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:41 AM - Dec 10, 2016",
      "content": "<div><blockquote><div><strong>Zeraxium wrote:</strong><hr/>\n Apologies for this question. But, I wondered if Disable trap, pick lock, and such was even necessary? ... If I recall correctly... you get a familiar.. . one of which.. I believe was a ..pixie? Fey? type thing? That was a rogue... couldn't they be used to see/disable/open stuff? ..If they stay full rogue.. they could deal with epics and such, no? (Sorry for english)</div></blockquote>\n A pixie cannot recover or set traps even when possessed.  It also cannot use lockpicks.  At a Level of at least Disable Trap 38 to disarm epics, its skill will never progress far enough to deal with those on a Level 30 cap server.  The rogue familiar leveling package increases DEX rather than INT so even a buff of Emp Fox won't help enough.<br/>\n<br/>\n However, it's not a bad way to trigger epic traps accidentally while scouting (that's a real safe way to perform recon), only costing a few HPs in the process.  It would need over 25 modified ranks in Search to Spot them which is probably beyond the scope of a Level 30 familiar.  The only limitation is that it can only be used once a day in a sacrificial role (twice, if rested while already summoned).  There are also situations when the process of summoning a familiar might alert the enemy to your presence if doing recon while invisible or using GrtrSanctuary (familiars cannot open containers or grab loot).<br/>\n<br/>\n You need not apologize, mate.  Questions are the only way to find answers. <img class=\"img-emoji\" src=\"emoji/11.gif\"/> </div>"
    }
  ]
}