{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "610",
  "name": "Build Help Monk(20),Fighter(10),CoT(10)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/build-help-monk-20-fighter-10-cot-10-t2355462.html",
  "author": "eburro6416",
  "avatar": "10404082_1510287071.jpg",
  "replies": 24,
  "posts": [
    {
      "author": "eburro6416",
      "avatar": "no_avatar.png",
      "timestamp": "4:53 AM - May 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Okay so I finally made it to lvl 40 with this build in WoG. Ive never posted a finished build on here before so I apologize for anything wrong. I appreciate constructive thoughts. <br/>\n<br/>\nI don't really have a name for the build sorry.<br/>\n<br/>\nHuman, Lawful Good<br/>\nPvM Playable 1-40<br/>\n<br/>\nAbilities(Ending)<br/>\nSTR:10<br/>\nDex:17(26)<br/>\nCon:8<br/>\nInt:13<br/>\nWis:16(22)<br/>\nCha:8<br/>\n<br/>\nBasic Stats:<br/>\n<br/>\nSaves<br/>\nSavings Throws(Fort/Will/Reflex): 36/36/36<br/>\nFully buffed (42/42/42)<br/>\nMonk Immunities<br/>\n<br/>\nAB<br/>\nBAB: 28<br/>\nAB: 37 (Melee)<br/>\n<br/>\nAC<br/>\nAC(Naked/Fullplate and Tower Shield) 38/32<br/>\nAC(Buffed and +5 Gear) 74, 79(With expertise), 80-84(With Shield Modifier AC)<br/>\n<br/>\nSkills<br/>\nConcentration 43, Discipline 43, Heal 43(49), Listen 40(46), Tumble 43(51)<br/>\n<br/>\n<br/>\nLeveling Guide:<br/>\nFighter(1):LoH,Expertise,Toughness<br/>\nFighter(2):Weapon Finesse<br/>\nFighter(3): Ambidexterity<br/>\nFighter(4): Dex +1, Two Weapon Fighting<br/>\nFighter(5):<br/>\nFighter(6):Blind Fight, G Fort<br/>\nMonk(1):(Cleave, Imp Unarmed Strike, Stunning Fist, Weapon Prof (Monk), Flurry of Blows, Evasion, Monk AC<br/>\nFighter(7): Dex +1<br/>\nFighter(8): Weapon Focus Kama, Weapon Spec Kama<br/>\nFighter(9):<br/>\nMonk(2): (Deflect Arrows)<br/>\nMonk(3): Dex +1, Improved Two Weapon Fighting (Monk Speed,Still Mind)<br/>\nMonk(4):<br/>\nMonk(5):(Purity Of Body)<br/>\nMonk(6):Improved Crit (Kama), (Knockdown, Improved Knockdown)<br/>\nCoT(1):Dex +1, (Lay on Hands)<br/>\nMonk(7): (Wholeness of Body)<br/>\nCot(2): Dodge, Mobility, (Sacred Defense)<br/>\nMonk(8):<br/>\nCoT(3):Dex +1, <br/>\nCoT(4):EWF Kama, EWS Kama<br/>\nMonk(9): (Improved Evasion)<br/>\nCoT(5):(Divine Wrath)<br/>\nCoT(6): Dex +1, Armor Skin, Epic Prowess<br/>\nCoT(7):<br/>\nCoT(8):Great Wis I<br/>\nMonk(10):Epic Fortitude<br/>\nCoT(9):Dex +1<br/>\nCoT(10):Great Wis II<br/>\nFighter(10):Great Wis III, Spring Attack<br/>\nMonk(11): (Diamond Body)<br/>\nMonk(12): Dex +1, (Diamond Soul)<br/>\nMonk(13):Epic Will<br/>\nMonk(14):<br/>\nMonk(15):(Quivering Palm)<br/>\nMonk(16): Great Wis IV<br/>\nMonk(17):<br/>\nMonk(18):(Empty Body)<br/>\nMonk(19):Great Wis V<br/>\nMonk(20):Wis +1, (Perfect Self)<br/>\n<br/>\nSkills:<br/>\n(1):Concentration 4, Discipline 4, Heal 4<br/>\n(2):Concentration 1, Discipline 1, Heal 1, Save 5<br/>\n(3):Concentration 1, Discipline 1, Heal 1, Save 6<br/>\n(4):Concentration 1, Discipline 1, Heal 1, Save 7<br/>\n(5):Concentration 1, Discipline 1, Heal 1, Save 8<br/>\n(6):Concentration 1, Discipline 1, Heal 1, Save 9<br/>\n(7):Concentration 1, Discipline 1, Heal 1, Listen 2, Tumble 10<br/>\n(8):Concentration 1, Discipline 1, Heal 1, Save 1<br/>\n(9):Concentration 1, Discipline 1, Heal 1, Save 2<br/>\n(10):Concentration 1, Discipline 1, Heal 1, Save 3<br/>\n(11):Concentration 1, Discipline 1, Heal 1, Listen 2, Save 4<br/>\n(12):Concentration 1, Discipline 1, Heal 1, Listen 2, Tumble 5<br/>\n(13):Concentration 1, Discipline 1, Heal 1, Listen 2, Save 1<br/>\n(14):Concentration 1, Discipline 1, Heal 1, Listen 2, Save 2<br/>\n(15):Concentration 1, Discipline 1, Heal 1, Listen 2, Save 3<br/>\n(16): Discipline 1, Heal 1, Save 5<br/>\n(17): Concentration 2, Discipline 1, Heal 1, Listen 2, Tumble 5<br/>\n(18): Discipline 1, Heal 1<br/>\n(19):Concentration 2, Discipline 1, Heal 1, Listen 2<br/>\n(20): Discipline 1, Heal 1, Save 4<br/>\n(21): Discipline 1, Heal 1, Save 6<br/>\n(22): Concentration 3, Discipline 1, Heal 1, Listen 2, Tumble 5<br/>\n(23): Discipline 1, Heal 1, Save 2<br/>\n(24): Discipline 1, Heal 1, Save 4<br/>\n(25): Discipline 1, Heal 1, Save 6<br/>\n(26): Discipline 1, Heal 1, Save 8<br/>\n(27): Concentration 5, Discipline 1, Heal 1, Listen 2, Tumble 5<br/>\n(28): Discipline 1, Heal 1, Save 2<br/>\n(29): Discipline 1, Heal 1, Save 4<br/>\n(30): Concentration 3, Discipline 1, Heal 1, Save 3<br/>\n(31):Concentration 1, Discipline 1, Heal 1, Listen 2, Save 4<br/>\n(32):Concentration 1, Discipline 1, Heal 1, Listen 2, Tumble 5<br/>\n(33):Concentration 1, Discipline 1, Heal 1, Listen 2, Save 1<br/>\n(34):Concentration 1, Discipline 1, Heal 1, Listen 2, Save 2<br/>\n(35):Concentration 1, Discipline 1, Heal 1, Listen 2, Save 3<br/>\n(36):Concentration 1, Discipline 1, Heal 1, Listen 2, Save 4<br/>\n(37):Concentration 1, Discipline 1, Heal 1, Listen 2, Tumble 5<br/>\n(38):Concentration 1, Discipline 1, Heal 1, Listen 2, Save 1<br/>\n(39):Concentration 1, Discipline 1, Heal 1, Listen 2, Save 2<br/>\n(40):Concentration 1, Discipline 1, Heal 1, Listen 2, Tumble 3<br/>\n<br/>\nI got the level progression from Stagmeister's Crimson Nun of Pain build. This one is STR based and uses Ranger instead of Fighter and gets access to Dev Crit.<br/>\nI wanted to have as much AC and as much AB as I could possibly get while dual wielding two kamas. My build is able to achieve the 10 attacks per round as well but loses the damage Dev Crit provides. I want to min max this build as much as I can so I am always up to changing things as long as I stay dex based.<br/>\n<br/>\nFirst build so thank you all!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "9:00 AM - May 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Why are you increasing WIS? I get that two of them come from CoT, but why not stick to DEX on the other?<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "The Flying Rodent",
      "avatar": "no_avatar.png",
      "timestamp": "9:57 AM - May 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I agree with Grimnir. There is little incentive to focus on Wisdom as a Monk, unless you plan on using Zen Archery or Stunning Fist a lot. Focusing on Dexterity would grant you the same AC and a little more AB, which will probably be the main thing that determines the effectiveness of this build. <br/>\n<br/>\nI'd also be tempted to scale Wisdom back to 14 and use the 4 points on Con or Str, but that's personal preference.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "The Flying Rodent",
      "avatar": "no_avatar.png",
      "timestamp": "10:18 AM - May 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And I guess I have some questions regarding feat choice as well:<br/>\n<br/>\n- I notice a lot of save boosting feats, such as Great Fortitude and Epic Will. Are they necessary on WoG? (I've personally never played there) If not, it might be worth picking up some more Dexterity.<br/>\n<br/>\n- Dodge will at least grant you +1 AC vs the target fighting you head on, but Mobility and Spring Attack do basically nothing for the build, given that you're taking Tumble Skill and don't plan on taking Shadowdancer or Weapon Master levels. Maybe they could be replaced with something else as well?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:24 PM - May 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This looks like a Dex based Robe wearin' Wis pumped Monkey.<br/>\n<br/>\nWith no way to tie down the Dex AC (no Uncanny Dodge), I can see why Wis has been taken here.<br/>\n<br/>\nHowever, it really looks like AB is suffering here, and for no real purpose that I can discern.  Taking 8 levels of Monk pre-epic lowers the AB by 2 (I can honestly see taking 4, to get the Kamas w/o burning up a feat, but I don't really see a purpose for taking 8).<br/>\n<br/>\nSince WoG has spamming effects that force lots of saves, you will eventually roll a 1 and fail, regardless of saves.  So immunities is where it's at.  It is the only thing that will save you.<br/>\n<br/>\nI would drop all the save boosters for other, more meaningful feats.<br/>\n<br/>\nThis build will have major problems dishing out damage on WoG, where DR is a standard feature on most m0bs, not to mention Bosses.  Hitting at high levels will also start to become a problem, as the AB is a tick low for this type of build.  It will basically be a 20 hunting build.<br/>\n<br/>\nIt's got some good elements that just need to be re-applied differently to be optimized for WoG play IMO.  I personally would go \"all in\" on Dex here.  Drop 4 levels of Monk pre-epic and move them to Epic.  That will automatically get this build 1 AB.  The Dex will get a lot more as well.<br/>\n<br/>\nAs Kamas on WoG are very unexciting (best standard drop are Dragon Claws, +3, 1d6 fire, keen), this build will be hunting for that precious Kama no kama drop or socket kama w/gems (custom kama).<br/>\n<br/>\nI personally have mostly given up on Kamas on WoG - one can get by a little (mostly m0bs) but Bosses laugh at your kamas.  Even a woodpecker build has problems on WoG at the upper end of the spectrum.<br/>\n<br/>\nFighting Kama<br/>\n<br/>\nMonk25/Fighter8/Weaponmaster7 (Monk 12/Fighter 9/WM 19) - this build I abandoned as it performs subpar on WoG.  It is great against m0bs, but Bosses wreck it, fast.  Even after tweaking, it just looses out to all fist options (which is what I go with primarily on WoG now).<br/>\n<br/>\nAs already suggested, Spring Attack and Dodge can go - one can get Dodge on some boots (with KD immune) and Spring Attack and Mobility will not be necessary with enough Tumble.  Invest in more Dex or...yeah, more Dex.<br/>\n<br/>\nUnfortunately, this build has no way to \"tie down\" that Dex bonus to AC.  It is a major problem with this build, and is one I ran into with a similar type build (kama quisinart - Fighting Kama above) - once this build hits a wall of opponents, it gets wrecked on WoG as AC plummets.  A class with Uncanny Dodge or another way to avoid being flatfooted (Barb/Rog/Ass or DD) would really go a long way here to helping that out.<br/>\n<br/>\nThe more I play on WoG, the more I see two paths - either the AC Junkie that really needs to protect all sources of AC (and this AC needs to be insanely high, like 80+ at a minimum as most End Bosses on WoG can easily hit anything in the 70s) OR a DR, immunity based Regen Wall of Pain that cannot be critted.<br/>\n<br/>\nAs I have both types of builds on WoG at level 40, I can attest to the later.  Nightshade (Monk 34/SD5/Ass1) is an exception, but even it reaches limits unless supremely optimized (which, while possible on WoG, is very, very difficult to achieve).<br/>\n<br/>\nAs for Kamas, they are basically useless on WoG for End boss hunting.  I once used to party up with a Monk/Pally based character who had a Legendary Holy Avenger Kama on WoG - and even that character was struggling vs End Bosses O_o<br/>\n<br/>\nM0bs had no chance against her, however.<br/>\n<br/>\nIF one can party up with a high level Bard, that can change things drastically.<br/>\n<br/>\nSo here is what I would suggest - move 4 levels of Monk to post Epic (+1 AB).  Drop the whole Dodge/Mobility/Spring Attack and get Zen Archery (one can get a sweet shortbow that is really nice for a Monk!  Or Xbows, if that is your thing) so that one has the travel and range thing out of the way.  The Disarm feats might be a viable option here.  Disarm on WoG (esp. Improved Disarm) is a very underappreciated feat imo.  Kamas are tiny, so they are not optimal for this feat, but it should still work.<br/>\n<br/>\nI would personally drop all the save boosting feats as well and invest in other, more useful feats (like perhaps some skill focuses SF:Concentration, etc).  WoG m0bs and Bosses love to Taunt.  As a Kama wielder, one wants to also lock down that Discipline (vs Disarm).<br/>\n<br/>\nI would suggest changing the alignment to Lawful Evil - there are very good reasons for this.  Evil on WoG seems to get the best access to advantageous items if they do not have UMD (UMD users on WoG are \"teh chizz\" - ultimate builds, really).  There are very good items on WoG especially for this type of build that all require one to be evil to use.<br/>\n<br/>\nThat's my $.02<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:56 PM - May 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><em class=\"mention\">@webshaman1</em> ,<br/>\n<br/>\nSince this build's DEX is higher than WIS, and you are suggesting boosting DEX more instead of WIS, why are you suggesting Zen Archery?<br/>\n<br/>\nYou said that kamas are meh on WOG, but how are Monk gloves on WOG?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:00 PM - May 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What I meant is if the build keeps the Wis bonus, then of course Zen Archery would be an option - it has so many feat options due to Fighter/CoT.<br/>\n<br/>\nI personally would go all in with Dex in the build posted.<br/>\n<br/>\nWell, Monk Gloves can be good, but basically it is the full Fist damage (1~20) and bludgeoning.  Gloves are readily available, and go up to +5 Attack AB (which is better than Kamas).  And they have various bonuses to Wis or Dex, or Str on them.  Plus extra damage through either energy and/or damage type (i.e. Extra Bludgeoning +1d6, etc).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:10 PM - May 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">My thoughts:<br/>\n- nice build, you got it to 40 on WoG! congrats! <br/>\n- the 6-10 APR with EWS is awesome, the saves are great. Mind immunity comes late at lvl 40 so the will save isn't totally wasted if your clarity gets dispelled. <br/>\n- 50% undispellable concealment for 20 rounds is pretty awesome (Empty Body x2/day) sounds awesome<br/>\n- lightning fast speed around the vast maps of WoG is fabulous with high tumble and excellent tactical capabilities during battle<br/>\n<br/>\nTweaks might be: <br/>\n- add a few points to Base AB aiming for 38-40 (increasing dex at the cost of wisdom for example) if you can<br/>\n- if you have an excess of combat feats, you could lower fighter to 6 and increase total CoT levels to 14 for better saves<br/>\n- I would drop some points from heal and put them into search for secret door and trap detection (maybe 5-10 crossclassed skill points), <br/>\n- Tumble doesn't have to be 43 it can be 40 for maximal AC bonus (+8), take your last monk level at 37 for mind immunity and a rapid push to 40<br/>\n- Con 8 is slightly low for a meleer (160[monk20]+200[fighter10cot10] -40[con 8] +40[toughness] = 360 max) but some players prefer that, I like 400-500 base HP on my meleers so its a bit more forgiving<br/>\n- wish it had UMD, uncanny dodge, epic dodge but that is a different build<br/>\n- I would try to get one crossclassed point in open lock, set trap and disable trap as a dexer, these can be handy skills<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:30 AM - May 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hail eburro6416, and many congratulations on your first build - the gods know it ain't easy!<br/>\n<br/>\nYou receive many words of wise counsel above, and I hope you don't mind me adding a couple of things...<br/>\n<br/>\nYou say (very flatteringly), that your levelling came from my  build <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/crimson-nun-of-pain-monk-20-ranger-10-cot-10-t2354449.html\" rel=\"noreferrer\" target=\"_blank\">Crimson Nun of Pain</a> (which was my second, I think), and a lot of that was down to the advice I was given at the time, and some of that was based on the classes I took (Ranger rather than Fighter) and being strength-based, otherwise I may well have gone in different directions. For example, I'd have had to take the potential Dex penalty from the lack of UD into account - so I can see how you try to counter-balance that with a higher Wis ranking (which strangely enough might have been better with Ranger, for the spell buffs). I might also have been tempted to take the first Monk level at L2 rather than waiting until 7, to get both the Kama proficiency nice and early as well as an early bump to AC from Tumble (though I still wouldn't be wearing robes until more Monk levels were taken). With Fighter in there instead of Ranger, I'd also be looking at taking feats like WS and Blind Fight earlier than the dual-wielding feats, but that may well just be me.<br/>\n<br/>\nThe other issue with Fighter over Ranger here is about skill points. You get less of them, so can't grab enough for Hide and Move Silently. While I understand Taunt is prevalent on WoG, so is pretty well everyone sneaking you. So (and this is with no experience of the PW) I might be tempted to drop Heal and Concentration for the stealth skills (though dropping Discipline is a potentially viable thought in a Dex build, too).<br/>\n<br/>\nJust thoughts. Once you've got the whole thing finalized to your satisfaction, and you feel it's as optimized as you can get it, let me, Mick or Empyre know, and we can move it to the Level 40s section.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eburro6416",
      "avatar": "no_avatar.png",
      "timestamp": "2:19 AM - May 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>The Flying Rodent wrote: <a data-post-id=\"20639\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20639&amp;sid=2537a53c1cb70b5d934983bfd83b2abe#p20639\">↑</a><div class=\"responsive-hide\">May 08, 2020</div></cite>I agree with Grimnir. There is little incentive to focus on Wisdom as a Monk, unless you plan on using Zen Archery or Stunning Fist a lot. Focusing on Dexterity would grant you the same AC and a little more AB, which will probably be the main thing that determines the effectiveness of this build. <br/>\n<br/>\nI'd also be tempted to scale Wisdom back to 14 and use the 4 points on Con or Str, but that's personal preference.</div></blockquote>\nMy plan was to have as high dex and wisdom as I could get for AC for both stats. But focusing more on Dex makes more sense for this build. If I put more points into Str, what feats would that open up?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eburro6416",
      "avatar": "no_avatar.png",
      "timestamp": "2:21 AM - May 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>The Flying Rodent wrote: <a data-post-id=\"20640\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20640&amp;sid=d622e7a2a2045c5660b9999c4c6661d8#p20640\">↑</a><div class=\"responsive-hide\">May 08, 2020</div></cite>And I guess I have some questions regarding feat choice as well:<br/>\n<br/>\n- I notice a lot of save boosting feats, such as Great Fortitude and Epic Will. Are they necessary on WoG? (I've personally never played there) If not, it might be worth picking up some more Dexterity.<br/>\n<br/>\n- Dodge will at least grant you +1 AC vs the target fighting you head on, but Mobility and Spring Attack do basically nothing for the build, given that you're taking Tumble Skill and don't plan on taking Shadowdancer or Weapon Master levels. Maybe they could be replaced with something else as well?</div></blockquote>\nIm honestly not sure which feats to take. In WoG, theres a lot of stuff that can kill you if your save isn't high enough that's why I chose those. And as for Mobility and Spring attack, they were filler feats.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eburro6416",
      "avatar": "no_avatar.png",
      "timestamp": "2:31 AM - May 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"20641\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20641&amp;sid=d622e7a2a2045c5660b9999c4c6661d8#p20641\">↑</a><div class=\"responsive-hide\">May 08, 2020</div></cite>This looks like a Dex based Robe wearin' Wis pumped Monkey.<br/>\n<br/>\nWith no way to tie down the Dex AC (no Uncanny Dodge), I can see why Wis has been taken here.<br/>\n<br/>\nHowever, it really looks like AB is suffering here, and for no real purpose that I can discern.  Taking 8 levels of Monk pre-epic lowers the AB by 2 (I can honestly see taking 4, to get the Kamas w/o burning up a feat, but I don't really see a purpose for taking 8).<br/>\n<br/>\nSince WoG has spamming effects that force lots of saves, you will eventually roll a 1 and fail, regardless of saves.  So immunities is where it's at.  It is the only thing that will save you.<br/>\n<br/>\nI would drop all the save boosters for other, more meaningful feats.<br/>\n<br/>\nThis build will have major problems dishing out damage on WoG, where DR is a standard feature on most m0bs, not to mention Bosses.  Hitting at high levels will also start to become a problem, as the AB is a tick low for this type of build.  It will basically be a 20 hunting build.<br/>\n<br/>\nIt's got some good elements that just need to be re-applied differently to be optimized for WoG play IMO.  I personally would go \"all in\" on Dex here.  Drop 4 levels of Monk pre-epic and move them to Epic.  That will automatically get this build 1 AB.  The Dex will get a lot more as well.<br/>\n<br/>\nAs Kamas on WoG are very unexciting (best standard drop are Dragon Claws, +3, 1d6 fire, keen), this build will be hunting for that precious Kama no kama drop or socket kama w/gems (custom kama).<br/>\n<br/>\nI personally have mostly given up on Kamas on WoG - one can get by a little (mostly m0bs) but Bosses laugh at your kamas.  Even a woodpecker build has problems on WoG at the upper end of the spectrum.<br/>\n<br/>\nFighting Kama<br/>\n<br/>\nMonk25/Fighter8/Weaponmaster7 (Monk 12/Fighter 9/WM 19) - this build I abandoned as it performs subpar on WoG.  It is great against m0bs, but Bosses wreck it, fast.  Even after tweaking, it just looses out to all fist options (which is what I go with primarily on WoG now).<br/>\n<br/>\nAs already suggested, Spring Attack and Dodge can go - one can get Dodge on some boots (with KD immune) and Spring Attack and Mobility will not be necessary with enough Tumble.  Invest in more Dex or...yeah, more Dex.<br/>\n<br/>\nUnfortunately, this build has no way to \"tie down\" that Dex bonus to AC.  It is a major problem with this build, and is one I ran into with a similar type build (kama quisinart - Fighting Kama above) - once this build hits a wall of opponents, it gets wrecked on WoG as AC plummets.  A class with Uncanny Dodge or another way to avoid being flatfooted (Barb/Rog/Ass or DD) would really go a long way here to helping that out.<br/>\n<br/>\nThe more I play on WoG, the more I see two paths - either the AC Junkie that really needs to protect all sources of AC (and this AC needs to be insanely high, like 80+ at a minimum as most End Bosses on WoG can easily hit anything in the 70s) OR a DR, immunity based Regen Wall of Pain that cannot be critted.<br/>\n<br/>\nAs I have both types of builds on WoG at level 40, I can attest to the later.  Nightshade (Monk 34/SD5/Ass1) is an exception, but even it reaches limits unless supremely optimized (which, while possible on WoG, is very, very difficult to achieve).<br/>\n<br/>\nAs for Kamas, they are basically useless on WoG for End boss hunting.  I once used to party up with a Monk/Pally based character who had a Legendary Holy Avenger Kama on WoG - and even that character was struggling vs End Bosses O_o<br/>\n<br/>\nM0bs had no chance against her, however.<br/>\n<br/>\nIF one can party up with a high level Bard, that can change things drastically.<br/>\n<br/>\nSo here is what I would suggest - move 4 levels of Monk to post Epic (+1 AB).  Drop the whole Dodge/Mobility/Spring Attack and get Zen Archery (one can get a sweet shortbow that is really nice for a Monk!  Or Xbows, if that is your thing) so that one has the travel and range thing out of the way.  The Disarm feats might be a viable option here.  Disarm on WoG (esp. Improved Disarm) is a very underappreciated feat imo.  Kamas are tiny, so they are not optimal for this feat, but it should still work.<br/>\n<br/>\nI would personally drop all the save boosting feats as well and invest in other, more useful feats (like perhaps some skill focuses SF:Concentration, etc).  WoG m0bs and Bosses love to Taunt.  As a Kama wielder, one wants to also lock down that Discipline (vs Disarm).<br/>\n<br/>\nI would suggest changing the alignment to Lawful Evil - there are very good reasons for this.  Evil on WoG seems to get the best access to advantageous items if they do not have UMD (UMD users on WoG are \"teh chizz\" - ultimate builds, really).  There are very good items on WoG especially for this type of build that all require one to be evil to use.<br/>\n<br/>\nThat's my $.02</div></blockquote>\nI just followed the level progression of the Crimson Nun of Pain. If I only take 4 monk pre epic, what would be good for the other 4 and where?<br/>\n<br/>\nWhat would be considered more meaningful feats?<br/>\n<br/>\nI was able to get my hands on both a 6 and 4 socketed kamas which I put divine and positive energy damage on both. I feel like my damage is doing okay atm but not super sure.<br/>\n<br/>\nWould it be worth it to remove either fighter or CoT for a class with access to uncanny dodge? I would like to be able to dish out and take as much as possible.<br/>\n<br/>\nIm not too worried about damage later as one of my party members is running with a high lvl bard.<br/>\n<br/>\nJust saw some of the feat suggestions for skills.. noted.. thank you!<br/>\n<br/>\nIs there a way to change my alignment without the help of a DM?<br/>\n<br/>\nThank you for all of the helpful suggestions!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eburro6416",
      "avatar": "no_avatar.png",
      "timestamp": "2:35 AM - May 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion wrote: <a data-post-id=\"20644\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20644&amp;sid=d622e7a2a2045c5660b9999c4c6661d8#p20644\">↑</a><div class=\"responsive-hide\">May 08, 2020</div></cite>My thoughts:<br/>\n- nice build, you got it to 40 on WoG! congrats! <br/>\n- the 6-10 APR with EWS is awesome, the saves are great. Mind immunity comes late at lvl 40 so the will save isn't totally wasted if your clarity gets dispelled. <br/>\n- 50% undispellable concealment for 20 rounds is pretty awesome (Empty Body x2/day) sounds awesome<br/>\n- lightning fast speed around the vast maps of WoG is fabulous with high tumble and excellent tactical capabilities during battle<br/>\n<br/>\nTweaks might be: <br/>\n- add a few points to Base AB aiming for 38-40 (increasing dex at the cost of wisdom for example) if you can<br/>\n- if you have an excess of combat feats, you could lower fighter to 6 and increase total CoT levels to 14 for better saves<br/>\n- I would drop some points from heal and put them into search for secret door and trap detection (maybe 5-10 crossclassed skill points), <br/>\n- Tumble doesn't have to be 43 it can be 40 for maximal AC bonus (+8), take your last monk level at 37 for mind immunity and a rapid push to 40<br/>\n- Con 8 is slightly low for a meleer (160[monk20]+200[fighter10cot10] -40[con 8] +40[toughness] = 360 max) but some players prefer that, I like 400-500 base HP on my meleers so its a bit more forgiving<br/>\n- wish it had UMD, uncanny dodge, epic dodge but that is a different build<br/>\n- I would try to get one crossclassed point in open lock, set trap and disable trap as a dexer, these can be handy skills</div></blockquote>\nAs stated in one of my replies, if I want to min max this build, would it be worth it to just get a class that has access to uncanny dodge? I also did not know that 8 was the max tumble AC! And i thought about having a few points in those Dex skills but wasnt super sure. Will consider.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eburro6416",
      "avatar": "no_avatar.png",
      "timestamp": "2:37 AM - May 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"20645\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20645&amp;sid=d622e7a2a2045c5660b9999c4c6661d8#p20645\">↑</a><div class=\"responsive-hide\">May 09, 2020</div></cite>Hail eburro6416, and many congratulations on your first build - the gods know it ain't easy!<br/>\n<br/>\nYou receive many words of wise counsel above, and I hope you don't mind me adding a couple of things...<br/>\n<br/>\nYou say (very flatteringly), that your levelling came from my  build <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/crimson-nun-of-pain-monk-20-ranger-10-cot-10-t2354449.html\" rel=\"noreferrer\" target=\"_blank\">Crimson Nun of Pain</a> (which was my second, I think), and a lot of that was down to the advice I was given at the time, and some of that was based on the classes I took (Ranger rather than Fighter) and being strength-based, otherwise I may well have gone in different directions. For example, I'd have had to take the potential Dex penalty from the lack of UD into account - so I can see how you try to counter-balance that with a higher Wis ranking (which strangely enough might have been better with Ranger, for the spell buffs). I might also have been tempted to take the first Monk level at L2 rather than waiting until 7, to get both the Kama proficiency nice and early as well as an early bump to AC from Tumble (though I still wouldn't be wearing robes until more Monk levels were taken). With Fighter in there instead of Ranger, I'd also be looking at taking feats like WS and Blind Fight earlier than the dual-wielding feats, but that may well just be me.<br/>\n<br/>\nThe other issue with Fighter over Ranger here is about skill points. You get less of them, so can't grab enough for Hide and Move Silently. While I understand Taunt is prevalent on WoG, so is pretty well everyone sneaking you. So (and this is with no experience of the PW) I might be tempted to drop Heal and Concentration for the stealth skills (though dropping Discipline is a potentially viable thought in a Dex build, too).<br/>\n<br/>\nJust thoughts. Once you've got the whole thing finalized to your satisfaction, and you feel it's as optimized as you can get it, let me, Mick or Empyre know, and we can move it to the Level 40s section.<br/>\n<br/>\nCheers</div></blockquote>\nThank you for the advice. I will be doing some tweaking and see what I can come up with!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:49 AM - May 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There's a few builds you can search for in the <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/buildsearch/index.html\" rel=\"noreferrer\" target=\"_blank\">ECB Archives</a><br/>\nDPA put up a search engine for newer builds <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/other/tool/ecb-guild-build-archive-v2\" rel=\"noreferrer\" target=\"_blank\">here</a> <br/>\nReading through what others have done has given me quite a few ideas<br/>\n<br/>\nEmpyre's <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build302381.html\" rel=\"noreferrer\" target=\"_blank\">Stealthy Dervish</a> or Kail Pendragon's <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build231800.html\" rel=\"noreferrer\" target=\"_blank\">Monastic Commando</a> might be good reads for UMD variants<br/>\nAn uncanny dodge class such as rogue combined with the 6-10 apr of Monk doesn't necessarily weaken the build, you are multiplying the sneak attack damage when you knock them down or flank them by an order of 6-10 (ie the 10d6 sneak damage in Monastic Commando is 60d6 to 100d6 sneak damage / round), plus you can disable/retrieve/detect traps, open locks, get crippling strike, epic dodge is a very powerful ability when you get it. Uncanny dodge 1.74+ means dont always expect flanking sneaks to work against barbarians, rogues and assassins<br/>\nMick's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/kama-shinobi-monk-9-assassin-26-sd-5-t2350791.html\" rel=\"noreferrer\" target=\"_blank\">Kama Shinobi</a> also comes to mind as well. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:01 AM - May 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"20643\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20643&amp;sid=d622e7a2a2045c5660b9999c4c6661d8#p20643\">↑</a><div class=\"responsive-hide\">May 08, 2020</div></cite>What I meant is if the build keeps the Wis bonus, then of course Zen Archery would be an option - it has so many feat options due to Fighter/CoT.<br/>\n<br/>\nI personally would go all in with Dex in the build posted.<br/>\n<br/>\nWell, Monk Gloves can be good, but basically it is the full Fist damage (1~20) and bludgeoning.  Gloves are readily available, and go up to +5 Attack AB (which is better than Kamas).  And they have various bonuses to Wis or Dex, or Str on them.  Plus extra damage through either energy and/or damage type (i.e. Extra Bludgeoning +1d6, etc).</div></blockquote>\nEven if he kept the DEX and WIS as-is, the DEX is higher than the WIS, so Zen Archery would have no effect because the DEX would be used because it is higher.  Zen Archery does not stack the WIS bonus with the DEX bonus.  It simply lets the WIS be used for archery instead of DEX if it is higher than the DEX.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:18 AM - May 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here's something completely different, taking advantage of those nifty Monk gloves that Webshaman mentioned.  It has better AB than your build, and better AC than you might expect from a STR-based build.  It does lots of blunt damage, and it has Dev Crit, too.<br/>\n<br/>\nOrder of the Wyrm (Monk 25 / Sorcerer 1 / RDD 14):\n<details><summary>Spoiler</summary>\nOrder of the Wyrm 21 (Monk 25 / Sorcerer 1 / Red Dragon Disciple 14)\nPlayable 1 - 40, PvM, optimized for WoG\nAbilities:\nDEX: 14\nWIS: 14\nCHA: 8 (10)\nLeveling Guide:\n01: Monk(1): Luck of Heros, Power Attack, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}\n03: Monk(3): Weapon Focus: Unarmed\n05: Monk(5)\n07: Monk(7)\n09: Monk(9): Great Cleave, {Improved Evasion}\n11: Monk(11)\n13: Monk(13)\n15: Monk(15): Great Fortitude\n17: Monk(16)\n19: Red Dragon Disciple(2): (STR=22)\n21: Red Dragon Disciple(4): Epic Weapon Focus: Unarmed, (STR=25)\n23: Red Dragon Disciple(6)\n25: Red Dragon Disciple(8)\n27: Red Dragon Disciple(10): Devastating Critical: Unarmed, {Darkvision}, (STR=30), (CHA=10)\n29: Monk(18)\n31: Monk(20)\n33: Monk(22): Great Strength II, (STR=34)\n35: Monk(23)\n37: Monk(25): Armor Skin\n39: Red Dragon Disciple(13): Great Strength IV, (STR=37)\n\nHitpoints: 496\nSaving Throws (Fortitude/Will/Reflex): 29/28/24\nBAB: 24\nAC (naked/mundane armor/shield only): 33/33\nAlignment Changes: 0\nStunning Fist DC: 32\nSkills:\n\n02: Discipline(1), Listen(1), Lore(1), Tumble(1), Save(5)\n04: Discipline(1), Listen(1), Lore(1), Tumble(1), Save(7)\n06: Discipline(1), Listen(1), Tumble(1), Save(10)\n08: Discipline(1), Listen(1), Tumble(1), Save(14)\n10: Discipline(1), Listen(1), Tumble(1), Save(18)\n12: Discipline(1), Listen(1), Tumble(1), Save(22)\n14: Discipline(1), Listen(1), Tumble(1), Save(26)\n16: Spellcraft(19), Save(12)\n18: Discipline(1), Search(13)\n20: Discipline(1), Search(2)\n22: Concentration(1), Discipline(1), Search(1)\n24: Concentration(2), Discipline(1)\n26: Discipline(1), Save(2)\n28: Discipline(1), Tumble(10)\n30: Concentration(5), Discipline(1)\n32: Discipline(1), Tumble(5)\n34: Discipline(1), Spellcraft(5)\n36: Discipline(1), Tumble(1), Save(6)\n38: Discipline(1), Spellcraft(13)\n40: Discipline(1), Listen(3)</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:46 PM - May 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A good point about Dex being higher than Wis - I missed that.  About the only reason to have the Wis is for Stunning Fist, which was recently nerfed in duration (but can still be useful).  Oh, and Wis based AC cannot be lost.<br/>\n<br/>\nAs for saves on WoG - Immunity &gt; Saves.  Meaning that spammed effects (which WoG is chock full of) will eventually result in a 1 (and due to the fact that WoG has autofail on a 1 turned on) this will mean that all the saves in the world will not offer protection.<br/>\n<br/>\nImmunity, however, does.<br/>\n<br/>\nMonks are notorious for having lots of immunities.  With just a few items, Monks on WoG are basically immune to everything with the exception of Petrification.  This is why I suggested dropping the save feats.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:52 PM - May 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have a character that is basically running Order of the Wyrm, but as Half-Orc, with the EDR feats thrown in (start Con 16).<br/>\n<br/>\nIron Mahk Titan.<br/>\n<br/>\nIt's pretty good - alot of fun to just wade in and slaughter stuff with impunity.<br/>\n<br/>\nAC is a tick low, however.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eburro6416",
      "avatar": "no_avatar.png",
      "timestamp": "6:49 AM - May 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If im going to make edits to level progression, what determines good levels for certain classes? For example, when is it better to take my monk levels and when is it best to add in my CoT levels. I don't quite understand yet the level placement of certain classes and how it benefits that character overall.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:13 AM - May 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As to when to take levels there are a number of factors:<br/>\n<br/>\nLevel 1:<br/>\n- skill points / lvl are multiplied by 4<br/>\n- pre-requisite stats. <br/>\n- identity. <br/>\n<br/>\nBAB:<br/>\n- identify your optimal pre-epic split to maximise both BAB, attacks / round and playability.<br/>\n<br/>\nOther levels:<br/>\n- skill dumps (including late skill dumps) <br/>\n- playability. <br/>\n- bonus feats. <br/>\n- pre-requisites, <br/>\n<br/>\nExamples:\n<details><summary>Spoiler</summary>-  a fighter rogue would get 32 skill points +int modifierx4 at level 1, where as a fighter at level 1 gets 8 skill points +int modifier, so one can lose a lot of skill points by not taking rogue at level 1\n- the character's primary identity in the module is set at level 1, so a rogue level at level 1 will always be called a rogue etc etc in dialogue\n- a sorcerer 25 / paladin 15 might want a pre-epic split of sorc 8 paladin 12 for BAB 26 and 4 attacks / round. taking a sorc 12 paladin 8 split pre-epic would lose 2 BAB and end up with 3 attacks / round \n- tumble adds +1 AC every 5 ranks unmodified. UMD allows more equipment to be equipped in intervals of 5 modified by Cha score.  So a character with a Cha score of 8 might take a monk level at level 7 for Tumble 10, but a rogue level at level 8 for Tumble 10 and UMD 10 modified to equip more equipment, use more items etc. \n- so a sorcerer / paladin spellsword in the example will probably want the sorc levels quickly for buffs like bulls, improved invisibility, flame weapon, summons etc. But an early paladin level or two will boost saves substantially, provide disease/fear immunity, so this is not a bad thing either.\n- a fighter level in epic levels allows for epic weapon specialization to be taken, whether as a general epic feat or bonus feat</details>\n<br/>\nThere is likely more to it, maybe some of the other members can add to what I have written<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eburro6416",
      "avatar": "no_avatar.png",
      "timestamp": "7:28 AM - May 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion wrote: <a data-post-id=\"20667\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=20667&amp;sid=5970cfa36692a4b021a51da9f183c137#p20667\">↑</a><div class=\"responsive-hide\">May 12, 2020</div></cite>As to when to take levels there are a number of factors:<br/>\n<br/>\nLevel 1:<br/>\n- skill points / lvl are multiplied by 4<br/>\n- pre-requisite stats. <br/>\n- identity. <br/>\n<br/>\nBAB:<br/>\n- identify your optimal pre-epic split to maximise both BAB, attacks / round and playability.<br/>\n<br/>\nOther levels:<br/>\n- skill dumps (including late skill dumps) <br/>\n- playability. <br/>\n- bonus feats. <br/>\n- pre-requisites, <br/>\n<br/>\nExamples:\n<details><summary>Spoiler</summary>-  a fighter rogue would get 32 skill points +int modifierx4 at level 1, where as a fighter at level 1 gets 8 skill points +int modifier, so one can lose a lot of skill points by not taking rogue at level 1\n- the character's primary identity in the module is set at level 1, so a rogue level at level 1 will always be called a rogue etc etc in dialogue\n- a sorcerer 25 / paladin 15 might want a pre-epic split of sorc 8 paladin 12 for BAB 26 and 4 attacks / round. taking a sorc 12 paladin 8 split pre-epic would lose 2 BAB and end up with 3 attacks / round \n- tumble adds +1 AC every 5 ranks unmodified. UMD allows more equipment to be equipped in intervals of 5 modified by Cha score.  So a character with a Cha score of 8 might take a monk level at level 7 for Tumble 10, but a rogue level at level 8 for Tumble 10 and UMD 10 modified to equip more equipment, use more items etc. \n- so a sorcerer / paladin spellsword in the example will probably want the sorc levels quickly for buffs like bulls, improved invisibility, flame weapon, summons etc. But an early paladin level or two will boost saves substantially, provide disease/fear immunity, so this is not a bad thing either.\n- a fighter level in epic levels allows for epic weapon specialization to be taken, whether as a general epic feat or bonus feat</details>\n<br/>\nThere is likely more to it, maybe some of the other members can add to what I have written</div></blockquote>\nWow that is a lot.. you also spoke earlier about possibly getting base AB to around 38. How? I was doing some editing but was only able to raise it from 28 to 29.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:52 AM - May 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would have meant the base melee AB which is the character, using mundane equipment, no enchantments or buffs<br/>\n- which is BAB + base Str modifier (or base Dex with weapon finesse) + feats (ie +4 from EWF/WF/EP) + size modifier (ie. halfling/gnome gets +1 AB)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:20 PM - May 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was afraid that this would happen.  BAB is Base Attack Bonus, but base AB is also base Attack Bonus, leading to confusion.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:49 PM - May 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just to add a little to Empyre and Orion's answers...<br/>\n<br/>\nYou might want to check out Orion's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/maximising-ab-in-builds-a-guide-t2355202.html\" rel=\"noreferrer\" target=\"_blank\">AB Guide</a> , which gives an in-depth analysis of the Attack Bonus.<br/>\n<br/>\nAs far as the Base Attack Bonus is concerned, that's entirely dependent on the classes you take in pre-epic levels and how many of each you take. Essentially, every level you take in a weapon-based class will give you +1 BAB (these include Fighter, Barbarian, Ranger, CoT, DwD, Paladin, Blackguard, Weapon Master, AA, and PDK). Those classes that give more \"variety\" (Bard, Rogue, RDD, SD, Cleric, Druid, Monk, Assassin, Shifter, and HS) will not add any BAB at their 1st, 5th, 9th, 13th, and 17th levels (hence what has become known as the Rule of Four, as three out of each four levels taken will get +1 BAB). Finally, those, classes that (on their own) want little to do with weapons (Sorcerer, Wizard, Pale Master) get +1 BAB every second level you take in the class. In epic levels, everyone - regardless of class - gets +1BAB on every odd level of the build. So the maximum BAB can be is 30, and its minimum is 20.<br/>\n<br/>\nIgnoring the Monk class, which is a special case and doesn't need going into just here, the most attacks per round a melee build can achieve (without Haste and single-handed) is 4, and you need a BAB of 16+ pre-epic in order to achieve that.<br/>\n<br/>\nHope that makes sense and helps a bit.<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: As has just been pointed out to me, it's actually possible to go as low as a minimum BAB of 19, should you really be searching for the bottom of the BAB barrel (thanks, Orion!)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}