{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Preepic - Level 20 Builds",
  "forum_id": "004",
  "id": "010",
  "name": "Shifter build?!",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/shifter-build-t2354909.html",
  "author": "Schmitty531",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "4.8K",
  "posts": [
    {
      "author": "Schmitty531",
      "avatar": "no_avatar.png",
      "timestamp": "4:51 AM - Jun 30, 2018",
      "content": "<div>I’m looking to make a pre epic shifter build and don’t know the first thing about optimised building! Can anyone give me a good combo for best results using shifts, if there is such a thing? Thank y’all so much!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:46 AM - Jul 01, 2018",
      "content": "<div>Hi Schmitty,<br/>\n<br/>\nMay I ask first, what your intentions are before helping you with a shifter? If you look at the shifter in pure power value (if such a thing exists, so to speak) then he isn't very strong pre-epic, but he is certainly playable. If you want to explore the various forms then he can be quite entertaining as well, but if you want something powerful that also has shapes, then a high-level Druid is your best bet. It gets even stronger if you add a level of Monk. Druids have access to the various animal shapes and later to all elemental shapes as well, reaching their climax with the use of \"shapechange\" spell that they can cast.<br/>\n<br/>\nSo, to summarize, Druids can be more powerful but they have limited number of forms &amp; shapers can have many forms but they are \"slightly\" weaker. You tell us what you prefer (and where you are going to play him) and then we can proceed from there, alright?</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:09 AM - Jul 04, 2018",
      "content": "<div>Please post build requests in the build requests forum.</div>",
      "author-color": "#AA0000"
    }
  ]
}