{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "066",
  "name": "WHIRLWIND OF STEEL  (MONK 25/ FTR 8/ WM 7)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/whirlwind-of-steel-monk-25-ftr-8-wm-7-t2350043.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": 27,
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:33 AM - Feb 15, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Kensai means \"Sword Saint\" in Japanese and it is the title that only the masters of the sword, those that are devoted in all their life to sharpen thir skills with it, eventually get.<br/>\n<br/>\nThey are often well educated - religious persons too, studying a lot and trying to improve in all of their aspects.<br/>\n<br/>\nAnd when the time for battle has come nothing is to be feared more than the naked blade of a Kensai...<br/>\n<br/>\n<br/>\n* This is an RP character of short i made for my avatar Doji Seo while i was playing on WoG. It is primarily designed to be very effective against any type of opponents and to be extremly playable from start to finish, virtually having no weaknesses.<br/>\n<br/>\nBut most of all, i wanted a character that would bring a smile on my face every single time i was playing her. Bringing in the concept of a Kensai i can imagine nothing less than a Katana or a Greatsword (Odachi or NoDachi as it is called) to be acceptable<br/>\n<br/>\nand of course suh a character could not have low saves or only a few skills, she should have many options to choose from (remember the strive for excellence).<br/>\n<br/>\nThe closest character i have found is the one made by Camiryn back then, named also \"Kensai\" but even that had too few Monk levels for what i wanted.<br/>\n<br/>\nWhat i wanted was the \"perfect self\" class feauture - resembling the heightened state such blademasters get before a fight, i wanted the best possible ammount of SR i could squize in, and lastly i wanted to reflect things like extreme focus on paper and in play.<br/>\n<br/>\nThus a character that is almost impossible to knockdown/disarm was born, versed in a variaty of skills, with strong saves, that transcends the mundane boundaries and elevates into something else, something better.<br/>\n<br/>\nAlmost impossible to watch, Dodji Seo darted from enemy to enemy cleaving her way to forty in the fastest of ways, huge criticals, dazzling speed, knockdown after critical after whirlwind attacks, she eliminated all in her path in a race to ascension.<br/>\n<br/>\nAnd she always brought a smile to my face.<br/>\n<br/>\n<br/>\n** Whilst this is an RP character the same build can be optimized far from it. You can gain as much as 3 more AB with the same build and 4 extra damage/ attack simply by changing her starting stats. <br/>\n<br/>\nIf you wish you can trnasform her into the cousin of Hulk (half-Orc) forget the save booster prer-epic and take the glorious farm implement (scythe), get rid of the ESF in Discipline and take an additional great strength and then unleash some monster<br/>\n<br/>\n that crits for plus 300 easily while you still have all the rest bonusses. AC will be reduced only by 1, fortitude by 2 and you will loose some hp's. By all means do that if you want, this build purpose from the start was to be extremely flexible and there are <br/>\n<br/>\nenough feats &amp; skills to accommodate to your individual needs.<br/>\n<br/>\n<br/>\n<strong>WHIRLWIND OF STEEL</strong><br/>\n<br/>\n<strong>(Monk 25/ Fighter 8/ Wm 7)</strong><br/>\n<br/>\n<br/>\n RACE: Human<br/>\n<br/>\n ALIGNMENT: Lawful Any<br/>\n<br/>\n PLAYABILITY: PvM 1-40<br/>\n<br/>\n STARTING STATS:<br/>\n STR  - 15<br/>\n DEX -  14<br/>\n CON - 14<br/>\n INT  - 14<br/>\n WIS - 12<br/>\n CHA - 08<br/>\n<br/>\n ENDING STATS:<br/>\n STR  -  30<br/>\n DEX  -  14<br/>\n CON  - 14<br/>\n INT   - 14<br/>\n WIS  - 12<br/>\n CHA  - 08<br/>\n<br/>\n Hit Points: 470<br/>\n<br/>\n Skill Points: 271<br/>\n<br/>\n Concentration: 43 (45)<br/>\n Discipline: 43 (63)<br/>\n Tumble: 40 (41)<br/>\n Spellcraft: 19 (20)<br/>\n Intimidate: 4 (3)<br/>\n Heal: 13 (14)<br/>\n Hide: 43 (45)<br/>\n Move Silently: 43 (45)<br/>\n<br/>\n Saving Throws (Fort/Ref/Will): 26/ 24/ 20  --&gt;  30/ 28/ 24  Vs spells &amp; (mind effects immunity) &amp; (Improved evasion)<br/>\n<br/>\n Naked AC: 28  (mundane clothes) &amp; (expertise)<br/>\n<br/>\n SR: 35<br/>\n<br/>\n BAB: 28<br/>\n<br/>\n AB: +43/ +38/ +33/ +28  (NoDachi)<br/>\n<br/>\n DMG: 2d6 +21 / 15-20 x 3  (NoDachi)<br/>\n<br/>\n 2/Day Empty Body for 25 Rounds each<br/>\n<br/>\n<br/>\nLEVELING GUIDE:<br/>\n<br/>\n01) Monk (01): Dodge, Mobility<br/>\n02) Fighter (01): WF: NoDachi<br/>\n03) Fighter (02): Blind Fighting, Expertise<br/>\n04) Monk (02): <br/>\n05) Fighter (03): <br/>\n06) Fighter (04): Spring Attack, WS: NoDachi<br/>\n07) Monk (03): <br/>\n08) Monk (04): <br/>\n09) Monk (05): Whirlwind Attack<br/>\n10) Weapon Master (01): <br/>\n11) Weapon Master (02): <br/>\n12) Weapon Master (03): Improved Critical: NoDachi<br/>\n13) Weapon Master (04): <br/>\n14) Weapon Master (05): <br/>\n15) Weapon Master (06): Toughness<br/>\n16) Weapon Master (07): <br/>\n17) Monk (06): <br/>\n18) Monk (07): Great Fortitude<br/>\n19) Monk (08): <br/>\n20) Fighter (05): <br/>\n21) Fighter (06): EWF: NoDachi, EWS: NoDachi<br/>\n22) Monk (09): <br/>\n23) Fighter (07):<br/>\n24) Fighter (08): ESF: Discipline, Epic Prowess<br/>\n25) Monk (10): <br/>\n26) Monk (11): <br/>\n27) Monk (12): Great Strength I<br/>\n28) Monk (13): <br/>\n29) Monk (14): <br/>\n30) Monk (15): Great Strength II<br/>\n31) Monk (16): <br/>\n32) Monk (17): <br/>\n33) Monk (18): Great Strength III<br/>\n34) Monk (19): <br/>\n35) Monk (20): <br/>\n36) Monk (21): Great Strength IV<br/>\n37) Monk (22): <br/>\n38) Monk (23): <br/>\n39) Monk (24): Great Strength V<br/>\n40) Monk (25): Armor Skin<br/>\n<br/>\n<br/>\n SPECIAL NOTES: <br/>\n<br/>\n 80% Speed (multiplied by haste)<br/>\n<br/>\n Spell Resistance 35<br/>\n<br/>\n Extreme Discipline skill<br/>\n<br/>\n Wholeness of body 50 hp/day<br/>\n<br/>\n Immune to disease &amp; Poisons<br/>\n<br/>\n Immune to fear, charm, daze, stun, confusion, domination, bigby's VI, sleep, bane and lots of other harmful effects<br/>\n<br/>\n Twice a day etherealness for 25 Rounds each (undispellable 50% concealment)<br/>\n<br/>\n Damage reduction 20/+1<br/>\n<br/>\n Stunning fist 25/ day – DC 31<br/>\n<br/>\n Even unarmed she hits for 1d20 +10 with as many as 7 attacks per round and with a 39 AB<br/>\n<br/>\n<br/>\n COMBAT OPTIONS: Improved Knockdown, Expertise, Cleave, Whirlwind Attack<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:29 AM - Feb 15, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Valerfor, I can tell from your avatar that you must be into sword saints   <br/>\nThis build reminds me of an old <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/fighter-monk-weaponmaster-t515488.html\" rel=\"noreferrer\" target=\"_blank\">thread</a> I started on the M/F/WM combo. I was trying out a dev crit build and never thought of taking as many as 25 monk levels. Compared with what I ended up with, you give up the WM AB bonus and epic feats.<br/>\nIt is interesting to see what all that monk brings to the build, even though it is not quite optimized power wise like you say.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:55 PM - Feb 15, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Totally missed that thread Mick, although i am acquinted with Ko' di 's Blademaster.<br/>\n<br/>\nLet me put my 2 coppers into what i think for the Monk/ WM/ FTR combo's here instead, since it is relevant.<br/>\n<br/>\n<br/>\nHaving only 6 levels of Monk does no good man except on special cases, unlike the FTR/WM/RG combo the Monk investment requires more levels to pay off. What do you typically take with 6 Monk levels?<br/>\n<br/>\nCleave, Evasion and IKD, and you are able to wear the Sun Soul boots and use special gloves in case they have a special buff into them like we have on WoG for example. And kamas of course eh.<br/>\n<br/>\nWhat 5 levels of Rogue gives you instead? UMD which means you can use all these and much much more, evasion, and 3d6 of sneak attack, and trappfinding.<br/>\n<br/>\nNow IKD from Monk could be really useful if we could put a 10 in INT and be done with it, but we cannot. We need 13 INT &amp; DEX just for the requirements. So the chances are that we usually can and will take IKD ourselves anyway.<br/>\n<br/>\n<br/>\nInstead of taking the minimum levels of Monk to make a Blademaster, the strength of the class when it is used in this combo, is revealed when we use many more levels, more Monk gives us more special abilities.<br/>\n<br/>\nHaving 9 levels already gives you Improved Evasion which is good but hardly what we really need. Taking 13 levels we become immune to poisons and take some early spell resistance but we are not there yet.<br/>\n<br/>\nTaking 18 levels you can dublicate the improved Invisibility twice a day and it is undispellable. Now taking twenty levels you get the Mind - effects Immunity which is a really nice ability. Now that's special!<br/>\n<br/>\n<br/>\nSo what is the optimal split in case we powergame as much as possible and we wanted to be something different from the rogue combo's ?<br/>\n<br/>\nLet me tell you the answer since i have Dodji's Build in no less than six different alterations. Monk 20/ Fighter 4/ WM 16. That's it. With this spread you can have something distinguished and with really good AB.<br/>\n<br/>\nIs it worth it though? Probably if you play in a server that you spend much time close to forty. For ease of play and constant performance though Monk 25/ WM 7/ FTR 8 would be my choice every time.<br/>\n<br/>\nWhat else that combo give us you ask? More speed which is really nice to have since you can escape time stops, taunts, can IKD mages before they know you are there e.t.c and more AC as well, +5 AC to be specific.<br/>\n<br/>\nThat is why i have settled with that split in case of my blademaster. Having +5 AC, All Monk special abilities, some good 35 SR, and a really nice 80% speed buff is definitely worth it for me.<br/>\n<br/>\nAll of these matter in low to medium magical environment such as \"WoG\", \"Kharindale\" or \"The North\" for example.<br/>\n<br/>\n<br/>\nPower wise as you said the build isn't optimized although you can change that easily still maintaining the same build.<br/>\n<br/>\nStart with STR (18) DEX (14) CON (10) INT (14) WIS (08) CHA (08) and replace the ESF in Discipline with another GR. STR feat. There, 45 AB whilst still Human with zero exp penalties.<br/>\n<br/>\nMonk don't get a negative AC for starting with 08 WIS, so AC is down by 1 only. AB is 2 more and DMG is plus 3.<br/>\n<br/>\n<br/>\nAs an answer to your thread i would say that either Monk 10/12 or Monk 20/25 would be my final choices depending on the environment and my necessities for more AB.<br/>\n<br/>\nAnd the point is that having only a handful of Monk levels isn't worth the trouble unless you like Kama's, i would go with Rogue is such cases.<br/>\n<br/>\n<br/>\nThanks for your input and suggestions man!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:00 PM - Feb 15, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey man!<br/>\n<br/>\nWell, I disagree that 20 levels for the Mind Effects immunities are worth the investment (it's 14 levels you're investing, man!). I understand your thought process, but I don't think it applies to my playstyle. I'd probably be more inclined to go for a Kama-wielding Monk 9 / WM 19 / Fighter 12 or Monk 6 / WM 22 / Fighter 12 (the bad thing here being waiting till level 37 to get IKD). I don't know what a NoDachi is, so I can't say anything about that, but I can say this: you could drop Great Fortitude and Fighter for CoT levels. You'd lose 6 damage, which is hardly a problem for this build, but you'd gain +1 Fort, +4 Will and +4 Reflex and 2 feats, which could be taken in pre-epics or epics, in pre-epics you could take Disarm / Improved Disarm and in epics you could add two Great Strengths by rearranging things a bit.<br/>\n<br/>\nI'm saying this because I think CoT is a better fit RP-wise for a sword saint (champion of a god or a cause x just a plain warrior) and it does give you some nice boosts that are about 50-50 with the Fighter's WS / EWS contribution to the build. Without Fighter you'd need to rearrange your feats and levels and delay WM a little, but I think it'd be worth the trade.<br/>\n<br/>\nOther than that, another nice speedy truck !<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:49 PM - Feb 15, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">\"Points to the other 738 builds with farm implement masters\"   <br/>\n<br/>\n<br/>\nWhat is a Nodachi, hmm well it is an O-Dachi as it is called normally cause NoDachi is a game terminology since Morrowind heh.<br/>\n<br/>\n\"O\" stands for \"Great\" and the rest means blade or sword. It is basically a Japanese Zweihander hehe.<br/>\n<br/>\n<br/>\nThanks for the suggestion man, a good one although i find it hard to loose the EWS since she lready has good saves, a valuable suggestion though for those that may want to squize every last drop of AB from the build and go for half-orc!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:28 PM - Mar 24, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This should probably be moved to the unfinished section until a skill schedule is provided PLUS the fact that it is designed for some custom environment which is never stated in a description which explains just about everything else.  It's my guess that the full list of ECB community members, today and back through legacy years, who have had seen a Nodachi laying around or wielded during their play episodes are as follows:<br/>\n -begin list-<br/>\n Valerfor<br/>\n -end list-<br/>\n<br/>\n I suppose one could retain the oriental combat theme with a katana but some rejuggling would be needed (either toughness or great fort would go) and new stats composed to reflect a valid AD&amp;D 3.0 weapon.  Naturally this toon will lose the monk progression going that route.  What's wrong with this picture?   Oh, that's right.  Valerfor plays NWN2 a lot, too, right?  Maybe this build was destined for that ECB guild?  Dunno, but here in our humble little NWN1 community I suspect there will be few \"takers\".<br/>\n<br/>\n Please get in the habit of transcribing your skill selection list into the completed and tested build sections so others choosing to brave your build advice do not need to repeat that effort.  Thanks, mate!<br/>\n<br/>\n ---&gt; BTW, you can easily eliminate all that obtrusive white space if you paste your formatted text (prolly MSWord if I had to guess) to Notepad first and then copy from there into this editor.  The display would be infinitely more readable.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:56 PM - Mar 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The \"Whirlwind of Steel\", whoa, this brings back memories... One of my first commissions in the guild and one build i really loved back in the day. For a naturally agressive player like myself having all impportant factors in one build was a godsend. Natural (32) Strength plus a Greatsword plus weapon master's criticals plus insane speed boost from monk meant serious business and i played this build in both Aielund saga &amp; WoG with great success. Sure having a natural AB of (only?) 44 may seem a bit low -for a weapon master- but in general i never had problem with that, never in modules or PW's anyway. I would not do PvP with this character thought, there are others more suited to this task...<br/>\n<br/>\n Now to proceed and clear some misunderstandings here...<br/>\n A Dai-Katana OR a ZweiHander OR an O-Dachi is the same very thing as your beloved and known to all of you <strong>Greatsword</strong>. Or else you would have seen a feat for exotic weapons somewhere in there. Now some of the modules or PW's incorporate the famous CEP 2.3 in them and allow for visual modifications of the swords as to look like a katana or anything else but the weapon is the same in every factional way and the build works flawlessly with that.<br/>\n<br/>\n I hope that helped, and no-i do not play- Nwn2 since it shares very little to the Original game that i loved.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:13 AM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@ Valerfor: Loved? Past tense? Have you fallen out with the game? That would be a very sad loss.<br/>\n<br/>\n Regardless, hope you are keeping well!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:58 AM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, thanks for stumbling back this way for a bit, Valerfor... and for clearing up the mystery.  I wasn't sure whether this Nodachi was just a kama that had been resculpted with a new blueprint or a new weapon altogether.  So, then Flurry of Blows does not apply for the greatsword alias.  Okie doke! ;)<br/>\n<br/>\n Yeah, as part of gleaning stats from the builds here on Forumer I am forced to inspect each with more than a quick glance so you will likely see comments from me on other of your builds during the process, which, honestly, I wish was over by now for over 200 builds.  It is very intensive work but for a good purpose, is my intent.<br/>\n<br/>\n Apologies for the NWN2 reference.  I think I must have been thinking of TyrTemplar who has also been on sabatical since I returned to finish the build locator.  Good to see you if only for a limited time.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:56 PM - Nov 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@ Valerfor - following some discussion in the MTS thread, I wondered whether there was a feasible or worthwhile way to get Dev Crit with the Whirlwind of Steel?<br/>\n<br/>\nWithout playing with the starting figures, I thought perhaps losing Toughness and Great Fortitude for Power Attack and Great Cleave pre-epic, then ESkF:Discipline and EWS:Greatsword (NoDachi) for Overwhelming and Devastating Critical? With some juggling about of the sequencing of epic feats, I think that would allow for DevCrit at level 33.<br/>\n<br/>\nBut would it be worth it, do you think?<br/>\n<br/>\nThanks<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:25 PM - Nov 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So you chose the more rp-oriented character and not the more optimized one eh Stag?<br/>\nShe will do well though, and this one flourishes earlier than \"Raigeki\" as well as attains higher SR.<br/>\n<br/>\nWhat i think about Devastating Critical in this build? <br/>\nIt is absolutewly worth it, since we have a No-Dachi (Greatsword) in this case and it is much more likely (13-20 Vs 19-20) to occur than with Unarmed strikes.<br/>\n<br/>\nStart with (Str 16/ Dex 14/ Con 14/ Int 14/ Wis 10/ Cha 08) and replace the ESF: Discipline wth another Great Strength. Now replace Two of these with Overwhelming &amp; Devastating Critical. Pre-epic you need to replace Toughness and Great Fortitude with Power Attack and Great Cleave. That's it!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:33 AM - Nov 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, having thoroughly enjoyed my time in MTS with the Whirlwind, I'm now going to take her original iteration into Aielund for a runaround. However, me being me, I can't help but muse over a change or two...<br/>\n<br/>\nI wonder whether - given the excellent katanas available in Aielund - whether specializing in that weapon might be a nice idea. I appreciate that I'd be doing it without a shield, to protect Monk goodies, and I'd need WProf:Exotic, but I could push Blind Fight back to 15 and drop either Toughness or Great Fort, neither of which would be too much of a strain, I believe.<br/>\n<br/>\nNow, in terms of skills, Taunt is heavily used in Aielund, so I'll want to keep Concentration, but I might sacrifice one of the stealth skills for Listen. If so, and one of Hide or Move Silently seems pointless without the other, I'm not quite sure what to do with the other. Lore might be a practical option, or some cross-classed Search or Persuade points.<br/>\n<br/>\nAny thoughts?<br/>\n<br/>\nCheers<br/>\n<br/>\n<strong><em>EDIT: </em></strong>Oh, and because Aielund ends at around level 36 or 37, I'm tempted to bring Armor Skin up alongside Epic Prowess, losing ESkFocus in Discipline. Admittedly, I'll end up -2 STR, but that might be liveable with.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:37 AM - Nov 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am gonna do something better than just giving you advice on how to modify the \"Whirlwind of Steel\" for Aielund Stag, I am gonna sit tonight and make you a version specifically for playing there and end it at level 36, optimizing it's power for that range instead.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:27 AM - Nov 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">First to address the issue of Greatsword Vs Katana OR in general Two-Hander Vs One-Hander for this build.<br/>\n<br/>\nI will be the first to admit that Blackened Skies-Burning Earth (please correct me if i am wrong) is a wonderful weapon and the exotic nature of the Katana as a weapon fits even more to the theme of \"Whirlwind of Steel\" than the No-Dachi (Greatsword). And considering that Aielund itself forbids the use of Dev-Critical feat you certainly have the necessary feats available to take \"Exotic Weapons\" and use it. However, that would be a flat-out downgrade to your damage as Kensai. You see, even though Katanas in Aielund are somewhat more powerful than other weapons, they still can't compare to the multiplication by 1.5 times of your entire (enhanced in the game) strength. Having said that, if you want to use a Katana as your Kensai's weapon of choise, you can surely take it, there are available feats for that, i am just here to note the differences and warn you of the outcome. And do not forget that the No-Dachi (Greatsword) has better base damage, does not require an extra feat and even has better reach in-game (proven by Hip). That being said i am sure you will do fine in Aielund either way Stag ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:36 AM - Nov 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here is your Aielund Kensai, Human of course.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/NqpJGIU.png\" /><br/>\n<br/>\n<strong>WHIRLWIND OF STEEL</strong><br/>\n<br/>\n<strong>Monk</strong> <strong>21</strong>/ <strong>Ftr</strong> <strong>8</strong>/ <strong>Wm</strong> <strong>7</strong><br/>\n<br/>\nRACE: Human<br/>\nALIGNMENT: Lawful Any<br/>\nPLAYABILITY: PvM 1-36<br/>\n<br/>\nThis Character is specifically made for use in Aielund Saga<br/>\n<br/>\nSTARTING/ ENDING STATS:<br/>\nSTR -  17 (<strong>30</strong>)<br/>\nDEX -  14<br/>\nCON - 14<br/>\nINT -   13<br/>\nWIS -  08<br/>\nCHA - 08<br/>\n<br/>\nHit Points: 426<br/>\n<br/>\nSkill Points: 204<br/>\n<br/>\nConcentration: 39 (41)<br/>\nDiscipline: 39 (49)<br/>\nTumble: 35 (35)<br/>\nSpellcraft: 14 (15) cc<br/>\nIntimidate: 4 (3) cc<br/>\nHeal: 16 (15)<br/>\nListen: 39 (38)<br/>\n<br/>\nSaving Throws (Fort/Ref/Will): 26/ 24/ 18 → <br/>\n<br/>\nSaving Throws (Fort/Ref/Will): 29/ 27/ 21 (saves Vs spells)<br/>\n<br/>\n<br/>\nNaked AC: 25 (Mundane clothes)<br/>\n<br/>\nSR: 31 (Cannot be Reduced)<br/>\n<br/>\n<br/>\nBAB: 26 (Four Attacks w/Greatsword)<br/>\n<br/>\nAB: +42/ +37/ +32/ +27 (Greatsword)<br/>\n<br/>\nDMG: 2d6 +21/ 15-20 x3 (Greatsword)<br/>\n<br/>\n<br/>\n2/Day Empty Body for 21 Rounds each<br/>\n<br/>\nMind effects Immunity, Improved Evasion, Poison &amp; Disease Immunity, DR: 20/ +1<br/>\n<br/>\nLEVELING GUIDE:<br/>\n01) Monk (01): Dodge, Mobility, <em>Evasion</em>, <em>Cleave</em><br/>\n02) Fighter (01): WF: Greatsword<br/>\n03) Fighter (02): Blind Fighting, Expertise<br/>\n04) Monk (02): <em>Deflect Arrows</em><br/>\n05) Fighter (03): <br/>\n06) Fighter (04): Spring Attack, WS: Greatsword<br/>\n07) Monk (03): <br/>\n08) Monk (04): <br/>\n09) Monk (05): Whirlwind Attack<br/>\n10) Weapon Master (01): <br/>\n11) Weapon Master (02): <br/>\n12) Weapon Master (03): Improved Critical: Greatsword<br/>\n13) Weapon Master (04): <br/>\n14) Weapon Master (05): <br/>\n15) Weapon Master (06): Great Fortitude<br/>\n16) Weapon Master (07): <br/>\n17) Monk (06): <em>Improved Knockdown</em><br/>\n18) Monk (07): Toughness<br/>\n19) Monk (08): <br/>\n20) Fighter (05): <br/>\n21) Fighter (06): EWF: Greatsword, EWS: Greatsword<br/>\n22) Monk (09): <em>Improved Evasion</em><br/>\n23) Fighter (07):<br/>\n24) Fighter (08): Armour Skin, Epic Prowess<br/>\n25) Monk (10): <br/>\n26) Monk (11): <br/>\n27) Monk (12): Great Strength I<br/>\n28) Monk (13): <br/>\n29) Monk (14): <br/>\n30) Monk (15): Great Strength II<br/>\n31) Monk (16): <br/>\n32) Monk (17): <br/>\n33) Monk (18): Great Strength III, <em>Empty Body 2/Day</em><br/>\n34) Monk (19): <br/>\n35) Monk (20): <em>Mind-Effects Immunity</em><br/>\n36) Monk (21): Great Strength IV<br/>\n<br/>\nSPECIAL NOTES: <br/>\nWholeness of body 42 hp/day, +70% Speed (multiplied by haste)<br/>\n<br/>\nStunning fist 21/ day – DC 28 (33)<br/>\n<br/>\n<strong>Combat Options</strong>: Improved Knockdown, Expertise, Whirlwind Attack, Empty Body<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:42 AM - Nov 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And because i know how much you like Dwarves, i could not resist the temptation of doing a Sentry of Clangeddin Silverbeard ;)<br/>\n<br/>\nPlease forgive her the Sword, she is meant to wield a GreatAxe but for the pose she went with the more elegant option...<br/>\n<br/>\nBut man.......look at those X4 criticals with the Axe!<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/IgujbEJ.jpg\" /><br/>\n<strong>WHIRLWIND OF STEEL</strong><br/>\n<br/>\n<strong>Monk</strong> <strong>21</strong>/ <strong>Ftr</strong> <strong>8</strong>/ <strong>Wm</strong> <strong>7</strong><br/>\n<br/>\nRACE: Dwarf<br/>\nALIGNMENT: Lawful Any<br/>\nPLAYABILITY: PvM 1-36<br/>\n<br/>\nThis Character is specifically made for use in Aielund Saga<br/>\n<br/>\nSTARTING/ ENDING STATS:<br/>\nSTR -  17 (<strong>30</strong>)<br/>\nDEX -  14<br/>\nCON - 16<br/>\nINT -   13<br/>\nWIS -  08<br/>\nCHA - 06<br/>\n<br/>\n<br/>\nHit Points: 466<br/>\n<br/>\nSkill Points: 161<br/>\n<br/>\nConcentration: 39 (41)<br/>\nDiscipline: 39 (49)<br/>\nTumble: 35 (35)<br/>\n<br/>\nIntimidate: 4 (3) cc<br/>\nHeal: 5 (4)<br/>\nListen: 39 (38)<br/>\n<br/>\nSaving Throws (Fort/Ref/Will): 25/ 24/ 18 → <br/>\n<br/>\nSaving Throws (Fort/Ref/Will): 27/ 26/ 20 (saves Vs spells)<br/>\n<br/>\n<br/>\nNaked AC: 25 (Mundane clothes)<br/>\n<br/>\nSR: 31 (Cannot be Reduced)<br/>\n<br/>\n<br/>\nBAB: 26 (Four Attacks w/GreatAxe)<br/>\n<br/>\nAB: +42/ +37/ +32/ +27 (GreatAxe)<br/>\n<br/>\nDMG: 1d12 +21/ 17-20 x4 (GreatAxe)<br/>\n<br/>\n<br/>\n2/Day Empty Body for 21 Rounds each<br/>\n<br/>\nMind effects Immunity, Improved Evasion, Poison &amp; Disease Immunity, DR: 20/ +1<br/>\n<br/>\nLEVELING GUIDE:<br/>\n01) Monk (01): Dodge, <em>Evasion</em>, <em>Cleave</em><br/>\n02) Fighter (01): WF: GreatAxe<br/>\n03) Fighter (02): Blind Fighting, Expertise<br/>\n04) Monk (02): <em>Deflect Arrows</em><br/>\n05) Fighter (03): <br/>\n06) Fighter (04): Mobility, WS: GreatAxe<br/>\n07) Monk (03): <br/>\n08) Monk (04): <br/>\n09) Monk (05): Spring Attack<br/>\n10) Monk (06): <em>Improved Knockdown</em><br/>\n11) Monk (07): <br/>\n12) Fighter (05): Whirlwind Attack<br/>\n13) Weapon Master (01): <br/>\n14) Weapon Master (02): <br/>\n15) Weapon Master (03): Improved Critical: GreatAxe<br/>\n16) Weapon Master (04): <br/>\n17) Monk (08):<br/>\n18) Weapon Master (05): Toughness<br/>\n19) Weapon Master (06): <br/>\n20) Weapon Master (07): <br/>\n21) Fighter (06): EWF: GreatAxe, EWS: GreatAxe<br/>\n22) Monk (09): <em>Improved Evasion</em><br/>\n23) Fighter (07):<br/>\n24) Fighter (08): Armour Skin, Epic Prowess<br/>\n25) Monk (10): <br/>\n26) Monk (11): <br/>\n27) Monk (12): Great Strength I<br/>\n28) Monk (13): <br/>\n29) Monk (14): <br/>\n30) Monk (15): Great Strength II<br/>\n31) Monk (16): <br/>\n32) Monk (17): <br/>\n33) Monk (18): Great Strength III, <em>Empty Body 2/Day</em><br/>\n34) Monk (19): <br/>\n35) Monk (20): <em>Mind-Effects Immunity</em><br/>\n36) Monk (21): Great Strength IV<br/>\n<br/>\nSPECIAL NOTES: <br/>\nWholeness of body 42 hp/day, +70% Speed (multiplied by haste)<br/>\n<br/>\nStunning fist 21/ day – DC 28 (33)<br/>\n<br/>\n<strong>Combat Options</strong>: Improved Knockdown, Expertise, Whirlwind Attack, Empty Body<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:50 AM - Nov 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Both builds are somewhat more powerful &amp; more optimized than the Original, but that is just a derivative of the starting design, proving that this build can be adjusted for many different occasions, be it with-or-without Dev-Crit, Human or Dwarf, Axe or Sword. Anyway, i hope you like them ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:08 PM - Nov 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Both excellent - many thanks, Valerfor!<br/>\n<br/>\nI think I'll stick with human this time - maybe try the dwarven version next time I have a go at Sands of Fate.<br/>\n<br/>\nBecause I have reached 37 levels in Aielund before, I'll hedge my bets a little on the skills, taking 5 points less in Heal and saving them in case I get a chance for another Tumble bump.<br/>\n<br/>\nInterestingly, Aielund is one of the few environments when you can actually pick up a No-Dachi as well as a Greatsword!<br/>\n<br/>\nRight, off to reboot Ren!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "lilapocalypse59",
      "avatar": "10759080_1556398926.jpg",
      "timestamp": "12:03 AM - Apr 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello, I was just wondering if there was a skill schedule for the Human kensai build? Im not confident enough in myself to know the best layout for the skills so pardon for asking lol<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:22 AM - Apr 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>lilapocalypse59 wrote:</cite>\nHello, I was just wondering if there was a skill schedule for the Human kensai build? Im not confident enough in myself to know the best layout for the skills so pardon for asking lol\n</div></blockquote>\nHi lilapocalypse59 (may I just call you lil from now on, it's so much easier on the keyboard, please?)<br/>\n<br/>\nUnfortunately (but happily), there are several variants of the build in this thread, so before any furnishing can be given, are you talking about the initial build or the Aielund-specific one?<br/>\n<br/>\nEssentially, though - and in either case - maximize your Discipline on every level (so 4 at level 1 and 1 every next level), because all 3 of these classes have that as a skill. Only take Concentration when either Fighter or Monk classes are being taken, and only take Tumble, Hide and Move Silently when taking a Monk class (it may be better to think of Tumble as bundles of 5 ranks each time you take it). You will need to cross-class Intimidate and Spellcraft, because neither are available to Fighter or Monk as class skills, and you need the Intimidate ranks before you can take WM. That means you can take only 2 ranks in the skill at level 1 rather than the usual 4, then you can drop the other 2 in (excluding levels 3, 4 and 5) before starting your WM levels. Similarly, Spellcraft is only available on alternate levels, and costs 2 points for every one you allocate. Heal is only there for niceness - if you're struggling, take it later.<br/>\n<br/>\nI hope this makes a bit of sense at least.<br/>\n<br/>\nAnd welcome aboard, lil!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "lilapocalypse59",
      "avatar": "10759080_1556398926.jpg",
      "timestamp": "9:01 PM - Apr 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the help, and yes you may call me lil. I meant the Aielund specific human kensai. I love the saga but never completed it and wanted to play it again and beat it this time with a new build, and I love kensais :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:18 AM - Apr 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You haven't completed Aielund yet? You have to redeem yourself then by indulging in a full-course Aielund playthrough with your favourite weapon-master!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "lilapocalypse59",
      "avatar": "10759080_1556398926.jpg",
      "timestamp": "10:26 AM - Apr 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah Im level 10 with your human kensai build currently. Figuring out the skills as I go but I think Ive got it down.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Commiades",
      "avatar": "10759504_1633655887.jpg",
      "timestamp": "9:15 AM - Oct 17, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm planning a halfling version of this using a Scimitar for Aielund. With CEP you can craft a scimitar to look like a katana, and Scimitar has the lovely broad Crit range..<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Commiades",
      "avatar": "10759504_1633655887.jpg",
      "timestamp": "3:39 AM - Oct 18, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">How big a loss is no Uncanny Dodge for such a build? I was in Act Two of Aielund and my character was not enjoying the attention of multiple assassins when visiting their guild. She held up despite it, and Whirlwind proved handy against some illusions.<br/>\n<br/>\nSent from my Pixel 3 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:32 AM - Oct 18, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you are using Whirlwind Attack vs multiple opponents, you cannot be flanked.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Commiades",
      "avatar": "10759504_1633655887.jpg",
      "timestamp": "5:13 AM - Oct 18, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's handy to know. The fight against the assassins was in a doorway and my character was getting all the attention. I'll remember whirlwind in future.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "9:43 AM - Jun 11, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I wish I had seen this thread two weeks ago.  I got the bright idea to build a \"Sohei\" (Warrior Monk) and M25/FTR8/WM7 popped into my mind immediately.  Mine is less powerful because he's wielding a naginata (halberd, which I read was a favored weapon of soheis) and I'm building for Dev Crit.<br/>\n<br/>\nCurrently in HOTU at FTR 5/MON 6/WM 5.  My LVL 20 split will be MON 8/WM 7/ FTR 5.  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}