{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "019",
  "name": "Enchanted arrows, magic and archery - an Arcane Archer guide",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/enchanted-arrows-magic-and-archery-an-arcane-arche-t2183611.html",
  "author": "Mick Dagger",
  "avatar": "10235235_1549015559.jpg",
  "replies": 9,
  "posts": [
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:55 PM - Dec 19, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><span style=\"font-size:200%;line-height:normal\">The Arcane Archer</span><br/>\n<br/>\n The arcane archer class is two elf myths rolled into one package. One of these myths is the racial prowess with magic of the elven people. The other is their prowess with archery.<br/>\n Different arcane archers have different focus on archery and magic. They come in all shades from virtually pure archers, via characters with a limited arsenal of arcane spells to full-blown arcane casters where archery only has a limited function as back up weapon.<br/>\n Adhering to the elven myths or stereotypes can certainly lead to interesting roleplay, but from a character builder’s perspective, the prestige class is primarily a collection of some very interesting features, one of them being the ability to get the highest AB in the game.<br/>\n All arcane archers have an arcane caster class in addition to the AA prestige class. Even if you have only one level in that caster class and stats so low that you can not cast a single spell, you still have access to magic from arcane scrolls and can use other arcane caster gear. One caster class and the AA prestige class leaves room for a third class in the build. If you browse the builds in our archive, you will find every legal class represented in one way or the other, even the divine caster classes. That serves as a proof of the diversity of build ideas centred on the AA class.<br/>\n On the other hand, flexibility might seem somehow limited by the fact that two of the three classes already are taken. E.g., you cannot have both fighter and rogue for uncanny dodge, evasion and epic weapon specialization, or cleric and monk for divine buffs, zen archery, wisdom based AC and speed in an AA build. For the same reason one will never be able to combine AA with shifter.<br/>\n However, the power of the AA class more than outweighs this inconvenience.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">What it takes to become an AA</span><br/>\n To qualify for this prestige class, your character will need the following:<br/>\n Base Attack Bonus: +6<br/>\n Feats: Weapon focus in longbow or shortbow, Point blank shot<br/>\n Race: Elf or Half-elf<br/>\n Arcane spell caster: One or more levels in Bard, Sorcerer or Wizard<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">What the AA class brings to the build</span><br/>\n As a prestige class, you can have maximum 30 levels in the AA class. You can take 10 of them pre epic.<br/>\n Hit Die: d8<br/>\n Proficiencies: Armor (Light, Medium), Shields, Weapons (Martial, Simple)<br/>\n Full pre epic BAB progression (warrior type)<br/>\n Skill points: 4 + intelligence modifier<br/>\n Class skills: Craft armor, Craft trap, Craft weapon, Heal, Hide, Listen, Lore, Move silently, Spot<br/>\n Primary saving throws: Fortitude, Reflex<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Special abilities &amp; feats:</span><br/>\n<br/>\n<strong>Enchant Arrow</strong><br/>\n From a character-builders perspective, this feat is the single most important reason to take the AA class! Enchant Arrow gives access to the best AB bonus in the game as well as a high damage bonus.<br/>\n At AA level 1, the bow attack of the AA gets a +1 enchantment bonus, adding +1 to both AB and damage. For every 2 levels of AA past 1st, the enchantment goes up by +1 ending at +15 for a level 29 AA.<table class=\"post_content_table\"><tbody><tr><td>AA level</td><td>1</td><td>3</td><td>5</td><td>7</td><td>9</td><td>11</td><td>13</td><td>15</td><td>17</td><td>19</td><td>21</td><td>23</td><td>25</td><td>27</td><td>29</td></tr><tr><td>EA bonus</td><td>+1</td><td>+2</td><td>+3</td><td>+4</td><td>+5</td><td>+6</td><td>+7</td><td>+8</td><td>+9</td><td>+10</td><td>+11</td><td>+12</td><td>+13</td><td>+14</td><td>+15</td></tr></tbody></table>\n\n The EA bonus stacks with the attack bonus on the bow and with the damage bonus on a given arrow type.<br/>\n Damage reduction penetration uses the higher of EA bonus and bow AB bonus. From this follows that at 9 AA levels your arrows will have a +5 enchantment, enough to pierce stoneskin and premonition, even with a mundane bow.<br/>\n The EA bonus does not count towards the +20 attack bonus cap.<br/>\n Use: Automatic<br/>\n<br/>\n<strong>Special attacks:</strong><br/>\n Imbue Arrow<br/>\n At AA level 2, the character gains the ability to summon a magical arrow 3 times a day and fire it at an enemy. It explodes as a fireball spell, doing fire damage to everyone in the area of effect.<br/>\n The fireball damage is 10d6 plus 1d6 for every 2 AA levels above 10. There is a reflex saving throw for half damage. DC: 10 + AA level + dexterity modifier<br/>\n The arrow has a ranged touch attack that inflicts piercing and magical damage to one target.<br/>\n The fireball occurs even if the arrow misses.<br/>\n Use: Selected<br/>\n<br/>\n Seeker Arrow<br/>\n At AA level 4 the character gains the ability to launch an arrow 1x/day that cannot miss its target. At AA level 6 this ability can be used 2x/day. The arrow inflicts piercing and magical damage.<br/>\n Use: Selected<br/>\n<br/>\n Hail of Arrows<br/>\n At AA level 8 the AA can 1x/day launch arrows at multiple targets in a single attack.<br/>\n The archer can attack a maximum of 1 target for every Arcane Archer level he has. Targets are chosen based on distance from the archer, with closer targets given preference. The range of this feat is the current area. It will also attack invisible creatures.<br/>\n Each arrow makes a ranged touch attack, dealing piercing and magical damage<br/>\n Use: Selected<br/>\n<br/>\n Arrow of Death<br/>\n At AA level 10, the character can enchant an arrow 1x/day that forces a target, if damaged by the arrow, to make a Fortitude save vs. DC: 20 or be slain. The arrow makes a ranged touch attack and inflicts piercing and magical damage.<br/>\n Use: Selected<br/>\n<br/>\n Formula for the ranged touch attacks: d20 + BAB + AB increase + weapon AB (item property) + dexterity modifier.<br/>\n Zen archery does not count. AB bonus from EA does not count.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Epic AA</span><br/>\n Bonus feats: The epic arcane archer gains a bonus feat at levels 14, 18, 22, 26, and 30.<br/>\n Epic bonus feats: blinding speed, devastating critical (longbow, shortbow), epic prowess, epic reflexes, epic toughness, epic weapon focus (longbow, shortbow), great dexterity, improved combat casting, overwhelming critical (longbow, shortbow)<br/>\n<br/>\n Edit: EA table<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:58 PM - Dec 19, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong><span style=\"font-size:150%;line-height:normal\">Races</span></strong><br/>\n<br/>\n<strong>Elf </strong><br/>\nElves get a racial dexterity bonus, racial weapon proficiency with bows, keen senses and slightly better racial skill bonuses<br/>\nElves suffer a racial constitution penalty, and are more prone to multiclass xp penalties with only wizard as favoured class.<br/>\n<br/>\n<strong>Half elf</strong><br/>\nHalf elves get no xp penalty when multiclassing two base classes (favoured class - any)<br/>\nThey have no racial proficiency with bows.<br/>\n<br/>\nOther races<br/>\nA known bug/exploit/cheat let you pick the AA class also with other races. The spell Tensers Transformation (Bioware version) transforms your race temporarily to elf. If you have access to that spell and cast it before you level up; any race can qualify for AA. You may not be able to play your character if enforce legal characters is active, and you risk being kicked from servers if you try this exploit/cheat.<br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">The different caster classes</span></strong><br/>\n<br/>\n<strong>Bard</strong><br/>\nBard has medium (3/4) BAB progression. As pure single class, bard will qualify much earlier for AA than wizard and sorcerer, because of the AB requirement. A Bard/AA can have BAB +17, and 4 attacks per round at level 20 whereas a pure sorcerer/AA or wizard/AA can get no more than BAB +14 and 3 attacks per round. This gives the bard builds greater flexibility when deciding what third class to take (if any), and when to add it.<br/>\nBecause of this BAB advantage, bard/AA builds often have more caster levels than wizard and sorcerer builds do. Therefore, the spell caster abilities often become important. Many of the bard spells are great for a “fighter mage”.<br/>\nBard has a superb selection of class skills: appraise, bluff, concentration, craft armor, craft trap, craft weapon, discipline, heal, hide, listen, lore, move silently, parry, perform, persuade, pick pocket, spellcraft, taunt, tumble and UMD<br/>\nThe Bard song is useful since it adds AB and damage to attacks even at low levels.<br/>\nBard can qualify for the RDD prestige class, which can be useful especially in strength-based builds.<br/>\nThe bard’s spell casting has charisma as primary ability. Here is not much synergy, unless you want to multiclass with divine classes that use charisma based feats.<br/>\nBard has an alignment restriction, and lawful characters cannot take the class. That can cause problems if you want to take levels in monk or paladin.<br/>\n<br/>\n<strong>Wizard</strong><br/>\nWizard is the favoured class of elves and gives no xp penalty when elves multiclass with other base classes. Wizard has no alignment restrictions. <br/>\nWizard spell casting has intelligence as primary ability. Higher intelligence also gives extra skill points to play with. Here is synergy if you want to invest into intelligence in the first place, to be able to get more skills.<br/>\nThe wizard and sorcerer spells are powerful and serve a wide range of purposes. Access to these spells adds versatility to any build.<br/>\nWizards can learn far more spells than sorcerers do. This is especially important at low levels, when the sorcerer’s spell selection is very limited and because multiclassed casters like the arcane archer often have a limited number of caster levels. Wizards also get access to the spells one level earlier than sorcerers do. A wide spell selection is valuable if you want to take the craft wand feat. Wizards get metamagic bonus feats pre epic, and scribe scroll as free feat at first level.<br/>\nWizards follow the lowest AB progression table. This can hurt if you take many levels of wizard pre epic. <br/>\nWizards get a Familiar. It is quite strong early on, but will be too weak for combat in a high-level multiclassed build. The familiar can have useful skills, like the rogue skills of the pixie.<br/>\n<br/>\n<strong>Wizard specialist</strong><br/>\nThe specialist wizard gets one more spell slot at each spell level, but he will not be able to cast spells from the opposite school. Many AA builds have illusion as speciality.<br/>\n<br/>\n<strong>Sorcerer</strong><br/>\nSorcerer spell casting has charisma as primary ability. That does not give much synergy. The sorcerer has a very limited number of known spells, especially at low levels, which is often the case with AA builds.<br/>\nSorcerer has no alignment restrictions.<br/>\nSorcerers can qualify for the RDD prestige class.<br/>\nSorcerers follow the lowest AB progression table. This can be a problem if you take many levels of sorcerer pre epic. <br/>\nSorcerers get a Familiar, just as wizards do.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:05 AM - Dec 20, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong><span style=\"font-size:150%;line-height:normal\">Arcane archer and AB </span></strong><br/>\n<br/>\n<strong>The flexibility granted by Enchant Arrow</strong><br/>\nThe Enchant Arrow feat adds +1 to AB and damage at level 1 and at every second level thereafter. If you max that bonus, taking 29 levels of AA, you can add +15 to both AB and damage. This is more than twice the max AB bonus you can get with the superior weapon focus of  the Weaponmaster class. Taking many levels of AA let you build a character with an extremely high AB, hitting with every arrow, and still hitting your target, when everybody else hit nothing but air.<br/>\n<br/>\nA pure fighter type archer (e.g. ranger) will typically have the following ranged AB at level 40 with a mundane bow:<br/>\nBAB: +30<br/>\nWF, EWF and EP: +4<br/>\nDexterity 30: +10<br/>\n<strong>Total AB: +44/+39/+34/+29</strong><br/>\n<br/>\nA dexterity based AA (e.g. Fighter 10/Wizard 1/AA 29) will look like this:<br/>\nBAB: +29<br/>\nWF, EWF, EP: +4<br/>\nDexterity 30: +10<br/>\nEA: +15<br/>\n<strong>Total AB: +58/+53/+48/+43</strong><br/>\n<br/>\nMost modules and PWs are balanced to let level 40 characters with a (naked) AB above +40 hit bosses on a regular basis. In a balanced module, available weapons and other equipment will have item properties that maintain that balance.<br/>\nAs you can see from the example above, the EA feat can add far more AB than you will need in such an environment. If you aim at an AB in the mid/high 40s, you will have a lot of flexibility, allowing for several different build ideas, since you have the luxury of not having to build for a maxed AB all the time. <br/>\n<br/>\nNow imagine an archer build with dexterity as low as 14, e.g. a fighter 8/ bard 8/AA 24 with 4 levels of bard pre epic:<br/>\nBAB: +29<br/>\nWF, EWF, EP: +4<br/>\nDexterity 14: +2<br/>\nEA: +12<br/>\n<strong>Total AB: +47/+42/+37/+32</strong><br/>\nThis is still better than the pure fighter type archer above that has dexterity 30.<br/>\nThis demonstrates that it is possible to build AAs with a low dexterity that still have more than adequate AB.<br/>\n<br/>\nSome builds take advantage of this and focus on building up strength instead of dexterity.  The idea behind a strength-based archer can be: 1) added ranged damage with the mighty property 2) to qualify for the devastating critical feat 3) a strong melee presence.<br/>\nOther builds focus on building up charisma. The idea is usually to take a third class that has turn undead and utilize the divine might feat for extra damage and/or the divine shield feat for better armor, and (if paladin or blackguard) get a huge save bonus from charisma.<br/>\n<br/>\n<strong>Other sources of AB</strong><br/>\nBard song adds to AB and damage. Both the curse song and the taunt skill will also help by lowering the AC of your target.<br/>\nThe spell War cry adds +2 to AB<br/>\nThe spell True strike will add a brief, +20 AB boost.<br/>\nDivine spells like DP, DF, Bless, Aid, Prayer etc. will work with ranged attacks. Spells like GMW, Flame weapon, Keen edge and Darkfire will not.<br/>\n<br/>\n<strong>Zen archery</strong><br/>\nA high wisdom gives access to high level spells, a higher spell DC and more spell slots for clerics and druids. It adds to monk AC and the DC for stunning fist and quivering palm. Zen archery secures the best ranged AB in wisdom based builds and with many base class levels (and correspondingly less AA levels), the Zen-archery feat becomes increasingly important to secure an adequate ranged AB. Zen archery has no effect on the AB of the special attacks that operate with a ranged touch attack.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Damage from ranged attacks </span></strong><br/>\n<br/>\nA mundane shortbow inflicts 1d6 HP piercing damage per hit. For a longbow that will be 1d8.<br/>\nThey will threat a critical hit on a 20 roll with an x3 multiplier.<br/>\nThe feat improved critical will increase the threat range to 19-20/x3<br/>\nThe item property massive critical and the feat overwhelming critical will add to critical hit damage.<br/>\nThe mighty property on bows allows for a given strength bonus to damage. E.g. a standard +3 composite bow has a mighty property of +5 that will let you add your strength modifier to damage up to a max of 5.<br/>\nBoth sneak attack and death attack work with ranged weapons if within 30 feet of the target.<br/>\nBard song adds 1-3 piercing damage<br/>\nWeapon specialization adds +2 damage, and epic weapon specialization adds another +4 damage for a total of +6.<br/>\nThe bard spell War cry adds +2 to damage<br/>\nThe cleric and paladin spell Divine favour adds 1-5 magic damage based on caster level<br/>\nThe feat Divine might adds temporary divine damage equal to the charisma modifier.<br/>\nThe Enchant arrow feat adds 1-15 piercing damage based on AA level.<br/>\nArrows can have bonus damage as an item property.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:08 AM - Dec 20, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong><span style=\"font-size:150%;line-height:normal\">Feats for archers</span></strong><br/>\n<br/>\n<strong>Required feats to qualify for AA: </strong><br/>\nPoint blank shot: Negates the -4 AB penalty for using ranged weapons in melee and gains +1 to AB and damage with ranged weapons when the target is within 15 feet range.<br/>\nWeapon focus (bow): Gives +1 AB with the weapon<br/>\n<br/>\n<strong>Recommended archery/combat related feats:</strong><br/>\nRapid shot: Grants one extra attack /round at max BAB, at the cost of a -2 AB penalty to all attacks.<br/>\nImproved critical (bow): Doubles the critical threat range.<br/>\nCalled shot: Makes cumulative disabling attacks against an opponent’s arm to reduce his AB or against his leg to slow him down and lower his dexterity.<br/>\nBlind fight: Works when blinded or against invisible/concealed creatures. The character gets to re-roll his miss chance percentile one time to see if it actually hits. That drastically reduces the effect of the opponents’ concealment. Furthermore, invisible creatures get no bonus to hit the character in melee. <br/>\nWeapon specialization (bow): Adds +2 damage to all shots with a given type of bow. Recommended in any AA with fighter class.<br/>\nZen archery: Use the wisdom modifier to determine the AB of ranged attacks (if better than dexterity). A must for wisdom-based archer builds. <br/>\nDivine might: Spends a turn undead attempt, temporarily adding the charisma bonus to weapon damage (as divine damage). Only recommended in builds focusing heavily on charisma.<br/>\nWeapon finesse: The feat let the character use his dexterity modifier for his melee attack roll instead of strength. It works with tiny and small weapons plus the rapier. This will improve the melee AB of any dexterity build. The ranged AB of a dexterity-based AA will always be better, but firing your bow in melee causes attacks of opportunity against you and prevents you from carrying a shield for extra protection. You may want this feat depending on your play style.<br/>\n<br/>\n<strong>Caster class related feats:</strong><br/>\nCraft wand: Grants virtually unlimited supply of low level spells<br/>\nEmpower spell: Gives more punch to your Cat’s and Bull’s<br/>\nExtend spell: Doubles the duration of your buffs etc.<br/>\nCurse song: Weakens your opponents. A good option for bard AA if you get close to your enemies on a regular basis<br/>\nLingering song: Makes your songs last 50% longer.<br/>\n<br/>\n<strong>Recommended epic feats:</strong><br/>\nArmor skin: +2 to AC<br/>\nEpic dodge: The character avoids the first attack each round.<br/>\nEpic prowess: +1 to AB with all weapons<br/>\nEpic weapon focus (bow): +2 to AB with your bow<br/>\nEpic weapon specialization (bow): +4 to damage with your bow<br/>\nGreat dexterity (or other modifiers): Helps meet stat requirements for epic feats, and helps improve AB, AC etc.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Useful skills for archers</span></strong><br/>\n<br/>\nDiscipline: If you plan to fight point blank, you may want discipline to help avoid knock down and disarm attempts.<br/>\nHide, Move silently: Stealth will buy you the element of surprise and let you position yourself strategically for crowd control. Stealth is especially good with dexterity-based builds.<br/>\nListen, Spot: These scouting skills will help you find hidden creatures.<br/>\nSearch: Let you discover and avoid traps.<br/>\nSet trap, Disable trap: Trap skills can supplement archery quite well. Traps can be used for crowd control, by dealing damage and by disabling your opponents. Traps also add alternative damage types, a resource vs. creatures with specific resistances or vulnerabilities. <br/>\nSpellcraft: The most important aspect of this skill for most AAs is that it gives bonus to saves vs. spells. <br/>\nTaunt: Reduces enemy AC and induces increased chance of spell failure.<br/>\nTumble: Helps avoid attacks of opportunity for moving past enemies and gives bonus to AC.<br/>\nUMD: Makes class, race, or alignment restricted items available for your character.<br/>\nPerform: Required for bard song.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:12 AM - Dec 20, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong><span style=\"font-size:150%;line-height:normal\">Archery tactics</span></strong><br/>\n<br/>\n<strong>AOO </strong><br/>\nIf you play on hardcore dnd difficulty or harder, firing a ranged weapon in melee will provoke an attack of opportunity. The extra damage you suffer from AOOs makes close combat difficult for archers, especially when enemies swarm you.<br/>\nRunning past enemies within melee range also provokes AOOs. You can avoid that with the spring attack feat or with a high enough tumble skill to beat a tumble check with DC 15.<br/>\nYou will avoid both sources of AOO if you stay out of melee range altogether.<br/>\n<br/>\n<strong>Crowd control</strong><br/>\nYou can use different crowd control tactics to prevent enemies from swarming your character. <br/>\n<br/>\n<strong>Party:</strong><br/>\nIn multiplayer games, you can join a party where you have tanks that will attract the crowd. In single player modules, you often have the opportunity to hire henchmen that will serve the same purpose. Summoned creatures, animal companions, familiars and charmed animals will also be able to fill the same role at low levels.<br/>\n<br/>\n<strong>Speed:</strong><br/>\nIf you can outrun your enemies, you will be able to keep the distance and avoid melee range. If you are fast enough to run around them in circles, you can hoard them in a limited area and attack them with Imbue arrow or AOE spells.<br/>\nYou can get higher speed from different sources. <br/>\nMonks get 10% extra speed every third level. Monk/wizard/AA builds are popular for that reason.<br/>\nBarbarians get a 10% speed bonus at level 1.<br/>\nThe spells Expeditious retreat, Haste and Mass haste all add 50 % to your speed. They will not have a cumulative effect and are capped at 50% speed bonus. <br/>\nIf you have the monk speed feat, you will be able to break this 50% speed cap on spells and get an extreme cumulative effect from Mass haste and Expeditious retreat.<br/>\nThe Slow spell will slow down a group of enemies within a 10 meter radius.<br/>\nThe blinding speed feat works like the Haste spell and lasts 10 rounds.<br/>\nCalled shot is a feat that your character can use to slow down enemies. A successful called shot against the enemy’s feet will slow him down 20% for 4 rounds. Multiple hits will have a cumulative effect, virtually stopping your target.<br/>\nIf you ride a horse you will get a 50% speed bonus. It will not stack with the monk or barbarian speed bonus.<br/>\n<br/>\n<strong>Kiting:</strong><br/>\nThis is in a way related to speed. You shoot while you run. You can use your keyboard keys (WASD) to run while you point and shoot with your mouse. This way you can shoot without stopping to aim. <br/>\nA speed advantage is of course beneficial, but this tactic works well against creatures that move with the  same speed as your character.<br/>\n<br/>\n<strong>Stealth:</strong><br/>\nIf you can hide and reposition yourself, you can always keep the distance from your opponents.<br/>\nCorner hiding is just what it says, running round the nearest corner and press hide the moment you are out of sight.<br/>\nYou can achieve the same effect if you have cast darkness and press hide when you have entered the dark area.<br/>\nIf you have HIPS, you do not have to run anywhere. You just abort your attack*, press hide and choose the best place for your next attack.<br/>\nPotions of invisibility or other means of casting invisibility will have a similar effect.<br/>\n*When I play HIPS builds, I usually place the attack icon from the radial menu on the F1 hotkey. Pressing that hotkey while attacking, aborts the attack. I have hide on F2. Pressing F1 and F2 in quick succession disengages from combat and hides in plain sight.<br/>\n<br/>\n<strong>Area of effect spells:</strong><br/>\nThere are several arcane spells that can trap, disable or slow groups of creatures in an area: Color spray, Grease, Cloud of bewilderment, Web, Slow, Stinking cloud, Confusion, Evard’s black tentacles, Fear, Acid fog, Great thunderclap, Prismatic spray, and Time stop.<br/>\nThese spells give tactical options for crowd control. They can be supplemented with AOE attack spells once you have pinned down your opponents, or the spells may give you time to use your bow and pick them one by one.<br/>\nYou may start your attack from stealth by casting e.g. Web, and then use your imbue arrow attack to wear the mob down. <br/>\nThere are also several single target spells that you can cast to pin down a single opponent, e.g. the Bigby series.<br/>\n<br/>\n<strong>Traps:</strong><br/>\nDifferent standard traps deal different kind of damage to either single creatures or groups of opponents. <br/>\nSome traps have special effects causing paralysis, stun or slow. Some even drain strength, dexterity, constitution or levels from their targets.<br/>\nIf you can lure a group of opponents into a minefield of traps, your traps may kill them all, or there may only be a couple of stragglers left for you to pick with your bow.<br/>\nAcid blob and frost traps can paralyze single creatures. Sonic traps can stun groups of creatures. Tangle traps will slow groups. Negative traps will drain strength or levels from single creatures. Gas traps will create a poison cloud and drain dexterity or constitution from poisoned victims.<br/>\nSeveral of these effects are well suited for crowd control.<br/>\n<br/>\n<strong>Point blank archery:</strong><br/>\nMelee fighting with a bow is not for the faint-hearted. Your Point blank shot feat will give you +1 to AB and damage, but even so your situation is significantly worse than that of the average meat-shield. With a bow in your hands, you have no shield to improve your AC and you suffer attacks of opportunity against you every round. Your hitpoints are usually lower than that of a normal melee build. To have any chance at all to survive against these odds, you will need a very good defence. <br/>\nYou must build to get a high AC, taking PM levels if necessary and try to max tumble. As a caster, you will have access to Improved invisibility for 50% concealment. If you have a dexterity build, you may benefit from Epic dodge. You may even want to try a build with high constitution and the Epic damage reduction feats. Finally yet importantly, you want to grab the best defensive gear you can get your hands on.<br/>\nGenerally this strategy is better suited for normal difficulty level or easier.<br/>\n<br/>\n<strong>Choke points and obstacles:</strong><br/>\nIt is a common tactics to use doorways, stairways and other choke points where only one melee fighting creature can get to you at the time to gain crowd control. You fight your enemies one by one and take much less damage in the process.<br/>\nWith an archer you can do this even better. If the first creature in line is a relatively weak creature, just ignore it and let it try to hit you. It will not harm you as much as the stronger ones waiting in line. What you do is attack the dangerous ones with ranged attacks when they stand there in line waiting for turn, while you use the weaker creature that stands first in line as a “shield”.<br/>\nSome doorways are closed by bars rather than a door. It is often possible to shoot through those bars while the enemy are unable to pass through.<br/>\nSometimes an area is divided by lakes and rivers. A bridge may be closed by a locked gate. Sometimes the terrain is divided by higher and lower ground. Or you may end up on a rooftop or a balcony, separated from the other parts of the area. Ranged attackers may be able to attack creatures on the other side of those obstacles.<br/>\nExploiting bad path finding is in a way related to this. Sometimes you experience that a creature chasing you get stuck on an object or a non passable part of the area. This then becomes a free kill for a ranged attacker.<br/>\n<br/>\n<br/>\n<strong>Resorting to regular melee fighting:</strong><br/>\nThe normal AA has far better AB and damage potential with a bow than with melee weapons, and will also try to avoid melee for the reasons given above. If you become swarmed and cornered, a shield will grant you valuable extra AC, and a melee weapon will prevent AOOs against you. The dexterity-based character will benefit from weapon finesse. As caster, you have access to GMW, Keen edge and Flame weapon to improve your attacks, either as prepared spells or on scrolls.<br/>\nStrength based, dual-purpose arcane archers are built to handle melee well, and will readily switch to a melee weapon when the opponents approach.<br/>\n<br/>\nEdit: Added \"Choke points and obstacles\" and \"Kiting\"<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:18 AM - Dec 20, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Use this link to search for <a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/buildsearch/index.html\" rel=\"noreferrer\" target=\"_blank\">Arcane archer builds</a><br/>\n<br/>\nYou will find more info on the AA class at <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Arcane_archer\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:40 AM - Dec 20, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A great addition to the ECB guides, Mick.  Kudos!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:18 AM - Dec 20, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Awesome guide!<br/>\n<br/>\nThe Mobility feat will help protect you from AOOs by giving you +4 AC against AOO.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "calespurmarksman",
      "avatar": "10758934_1530764018.jpg",
      "timestamp": "6:21 AM - Jul 05, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey, Mick!<br/>\n<br/>\nThank you so much for this comprehensive guide on the AA. I play almost exclusively archer builds, and always on the look-out for guides from experienced players and builders.<br/>\n<br/>\nI'm new to the forums, and have never played on multiplayer a servers - only the modules - so I would like to know what you think of a tactic I thought of below.<br/>\n<br/>\nThis was actually inspired by HipMaestro's Melee Mage build, which I read about on these forums. As you said, the AA, if using a bow in hand-to-hand, will AOO'ed a lot... So why not use it to your advantage? Throw on a Greater Stoneskin and Mestil's Acid sheath, and let the melees kill themselves on your shields while they AOO, and you take no damage and stick them full of arrows :)<br/>\n<br/>\nAlso, what is your favourite base class for multiclassing into AA?<br/>\n<br/>\nThanks in advance for the advice!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:15 PM - Jul 06, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>calespurmarksman wrote:</cite>\nHey, Mick!<br/>\n<br/>\nThank you so much for this comprehensive guide on the AA. I play almost exclusively archer builds, and always on the look-out for guides from experienced players and builders. </div></blockquote>\nYou're welcome calespurmarksman, I hope you find the info useful.\n<blockquote><div>\nI'm new to the forums, and have never played on multiplayer a servers - only the modules - so I would like to know what you think of a tactic I thought of below.<br/>\n<br/>\nThis was actually inspired by HipMaestro's Melee Mage build, which I read about on these forums. As you said, the AA, if using a bow in hand-to-hand, will AOO'ed a lot... So why not use it to your advantage? Throw on a Greater Stoneskin and Mestil's Acid sheath, and let the melees kill themselves on your shields while they AOO, and you take no damage and stick them full of arrows :) </div></blockquote>\nI have used the damage shield tactics extensively with mages, but not with Arcane archers. I will give you credit for the idea. Maybe it will add to survivability, even if the shields are weaker at lower caster levels (which is most often the case with archer builds). If you test it, feel free to post your experiences here. \n<blockquote><div>\nAlso, what is your favourite base class for multiclassing into AA?\n</div></blockquote>\nMy favourite arcane class for AA is Bard. But I also use specialist Wizard (often illusionist) a lot to avoid alignment restrictions, and for elves to avoid XP penalties.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}