{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "123",
  "name": "HELP! Can't connect to previously Blue but now greyed out PW's on Port 8193",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/help-can-t-connect-to-previously-blue-but-now-grey-t2355346.html",
  "author": "Asturonethoriusaline",
  "avatar": "no_avatar.png",
  "replies": "50",
  "views": "947",
  "posts": [
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "11:07 AM - Feb 09, 2020",
      "content": "<div>Background:<br/>\n<br/>\nI have been busy due to things happening in life, so havent been playing as often.<br/>\n<br/>\nSo yesterday, when I clicked on the JOIN INTERNET multi player game button to to play on PW's like Blackstone, etc, about 3/5's, of the previously blue colored PW's(colored blue on the PW list(Means that playable, can connect, etc), are now colored gray(nonplayable, can't connect, etc.<br/>\n<br/>\nI checked today, and still having the same problem.<br/>\n<br/>\nAnd not only that, but the ones that are colored grey, not playable, cant connect, are some of the most popular ones, and ones that I have toons on.<br/>\n<br/>\nPW's like Blackstone Keep, Dawn of Heroes, PW's that have 15 to 45+ on out of about 96 to 250, etc.<br/>\n<br/>\nAnd they are the same port 8193.<br/>\n<br/>\nNow the only PW that I have toons on, that I can connect to, and play is Arkhalia, fortunately one of the better PW's.<br/>\n<br/>\nThe others available to connect to, play, etc, typically 1 online out of 20 ro 40, level 20,30 max, dont look like, dont seem like they would be good, not popular, etc.<br/>\n<br/>\nI dont know why I could play these PW's before, and not now.<br/>\n<br/>\nI havent changed anything, so should still be able to connect, play them.<br/>\n<br/>\nAnd I dont think PW's like Arelith, Blackstone, Forgotten Realms Cormyr, etc, popular PW's, would have ALL closed down.<br/>\n<br/>\nI am playing Neverwinter Nights EE on my LG K20 Android Phone, Snapdragon, 32GB, NWN EE is at 6 80 GB. Have a 128 GB, SD card, that is also has a attached accelerator for better performance, speed, etc. Have 2 GB, left over.<br/>\n<br/>\nGame, and the PW's worked fine as long as PW's used  NWN Sync to download the needed files to play(Why I can't play World of Greyhawk(also one of those port 8193 PW's that used to be blue, but now greyed out), because it doesnt use NWN Sync to download its files(Even dowloaded ALL the different CEP files, and still didnt work.)<br/>\n<br/>\nSo what is going on? Why is this happening? And are any of you able to still play on Blackstone Keep, etc, on Port 8193? <br/>\n<br/>\nCan anybody please help.<br/>\n<br/>\nThanks in advance for any help.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:13 AM - Feb 09, 2020",
      "content": "<div>Well, it could be the version number that is causing this phenomenon. <br/>\n<br/>\nSince BD is still patching NWN:EE (and has recently), it could be that your version is an older version.<br/>\n<br/>\nTry patching it.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "11:36 AM - Feb 09, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10759110&amp;sid=d18d74f37f2928b02b4d7842ba1fcb84\">webshaman1</a> wrote: <div class=\"responsive-hide\">Feb 09, 2020</div></cite>Well, it could be the version number that is causing this phenomenon. <br/>\n<br/>\nSince BD is still patching NWN:EE (and has recently), it could be that your version is an older version.<br/>\n<br/>\nTry patching it.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk</div></blockquote>\n\nHow recently?<br/>\n<br/>\nAs far as I am aware(or not aware), NWN EE 1st version came out on the PC. <br/>\n<br/>\nThen 1 to 4 times it was patched, updated.<br/>\n<br/>\nThe NWN EE, came out for ANDROID smart phones, and tablets on GOOGLE PLAY STORE.<br/>\n<br/>\nTo my knowledge or lack thereof, that version of NWN EE, has not been patched, updated, because if it was, GOOGLE PLAY STORE would have put out a UPDATE.<br/>\n<br/>\nRight Now, after reading what you said, I went into GOOGLE PLAY, went to MY APPS AND GAMES, where all the apps and games are both updated and not updated.<br/>\n<br/>\nI then went to the List of apps, games, that have a update available. NWN EE not there.<br/>\n<br/>\nNWN EE is on the GOOGLE PLAY current, updated, apps and games list <br/>\n<br/>\nThen I went into my settings, went to the NWN EE app page. <br/>\n<br/>\nThere is NO OPTION at BOTH GOOGLE PLAY and at NWN EE app page in SETTINGS, to UPDATE, PATCH.<br/>\n<br/>\nSo because of that, I am pretty sure its the current version.<br/>\n<br/>\nBut if its not, then the current, updated, patched version is only available on PC and not available to Android users, unless there is a way to BYPASS GOOGE PLAY, and go into the Android files system to download, patch, update NWN EE, without messing up your android device.<br/>\n<br/>\nThe only thing I can possibly think of that might or night not have caused this, is I found a app that used to partially move NWN EE from my Android Smart Phone's 32 GB of internal memory storage, to the 128 GB, SD card.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "11:51 AM - Feb 09, 2020",
      "content": "<div>Moved NWN EE back from 128 gb SD card to 32 GB internal storage memory, and still same problem, so that wasnt it.<br/>\n<br/>\nWhen click on 1 of the greyed out PW's like Blackstone Keep, etc, that cant connect to, then click on SERVER DETAILS, the Port Server 8193 of all these PW's that cant connect to anymore, is colored red.<br/>\n<br/>\nIn the PW's that can connect to and play, like Arkhalia, the Port Server is NOT 8193, colored Red, but is instead Port Server 8186, and NOT colored red.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:55 PM - Feb 09, 2020",
      "content": "<div>The only advice I can give is to make sure the NWN EE is up to date with the latest patch with whatever platform you are using. There was a recent patch perhaps very early this year or late last year which prevents connection with server versions which are different and I had that problem until the PWs also updated to my version. <br/>\n<br/>\nIs single player still ok for you?<br/>\n<br/>\nThere maybe other forums who might have more information on how to manage the issue as we are very character building focused although I'm sure all of us will try to help you if we can. <br/>\n<br/>\nThis might include Beamdog Technical Support, the PW specific forums for the PWs you play and NWN Reddit has an excellent group of people you can also ask for help, some of whom are very tech savvy, Beamdog also has a community manager who checks that forum as well. I think its important to mention the patch number/date, the platform you are using.<br/>\n<br/>\nHope that helps</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "5:47 PM - Feb 09, 2020",
      "content": "<div>This is definitely a version problem, I had a similar issue while waiting for 1.79 to be released on GOG. I'm currently using version 8193.5 on desktop and have no issues connecting to BSK. I believe that Beamdog has released 8193.6 but it's not available on GOG yet so I don't have access to it.<br/>\nIf you're currently on 8193.4 or before, update your version. If you're currently on 8193.6, try reverting to 8193.5.<br/>\n<br/>\nI don't play on mobile but I had a quick google and it looks like Beamdog are still working on the android update with no clear ETA. [<a class=\"postlink\" href=\"https://forums.beamdog.com/discussion/comment/1112846/#Comment_1112846\" rel=\"noreferrer\" target=\"_blank\">https://forums.beamdog.com/discussion/c ... nt_1112846</a>]<br/>\nSo unfortunately this problem will remain until they release a new android patch.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "10:17 PM - Feb 09, 2020",
      "content": "<div>Thanks for your reply guys. It looks like either I have to wait for a Google play update to the Android version of NWN EE, or I might have already updated to the new version, and the new version not compatible with 8193's, like BSK, and so would have to revert to the original version that worked with 8193, BSK, by uninstalling, then reinstalling, then not updating.<br/>\n<br/>\nThe problem with that, is I dont know if that would cause PW toons to be lost, and. I would have to spend hours, doing multiple NWN Sync downloads of PW files. And even if did all that, that might not fix the problem.<br/>\n<br/>\nLooks like I'll just have to wait for a update patch, an or for the PW's to catch up.<br/>\n<br/>\nIn the mean time at least Arkhalia PW works on 8186, and I have resumed playing on that, and its one of the better PW's on NWN EE.<br/>\n<br/>\nThere are also about 25 to 75 seemingly bad looking, non popular, etc, PW's on NWN EE, on 8186, that I could still play.<br/>\n<br/>\nSo guess I just have to play the wait and see what happens game.<br/>\n<br/>\nThanks for your help guys.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "10:29 PM - Feb 09, 2020",
      "content": "<div>Also I think it might probably be a new update.<br/>\n<br/>\nI noticed a difference in the game, in the interface.  In the past, the menu buttons, always showed up on the right edge of the screen. And the 8193 PW's like BSK, worked with that.<br/>\n<br/>\nNow the menu buttons show up on the bottom of the screen, just above, the quickbar slots.<br/>\n<br/>\nAnd it replaces the text feedback windows.<br/>\n<br/>\nNow have to click a button to minimze the menu buttons on bottom of screen, in order for the feedback, text windows to show up.<br/>\n<br/>\nThat smacks of a new version update, since I didnt change the layout.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "10:15 AM - Mar 05, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10759176&amp;sid=d18d74f37f2928b02b4d7842ba1fcb84\">Yunim</a> wrote: <div class=\"responsive-hide\">Feb 09, 2020</div></cite>This is definitely a version problem, I had a similar issue while waiting for 1.79 to be released on GOG. I'm currently using version 8193.5 on desktop and have no issues connecting to BSK. I believe that Beamdog has released 8193.6 but it's not available on GOG yet so I don't have access to it.<br/>\nIf you're currently on 8193.4 or before, update your version. If you're currently on 8193.6, try reverting to 8193.5.<br/>\n<br/>\nI don't play on mobile but I had a quick google and it looks like Beamdog are still working on the android update with no clear ETA. [<a class=\"postlink\" href=\"https://forums.beamdog.com/discussion/comment/1112846/#Comment_1112846\" rel=\"noreferrer\" target=\"_blank\">https://forums.beamdog.com/discussion/c ... nt_1112846</a>]<br/>\nSo unfortunately this problem will remain until they release a new android patch.</div></blockquote>\n\nI tried updating, but their is no updating.<br/>\n<br/>\nI tried reverting, by completely uninstalling it, and reinstalling it, and NOT updating the reinstall.<br/>\n<br/>\nNothing I have tried works.<br/>\n<br/>\nGuess I will just have to wait.<br/>\n<br/>\nPart of the reason why I started playing a lot of the PW's with NWN Sync, is that I couldnt figure out how to install, play community, user, hall of fame, vault, etc, modules.<br/>\n<br/>\nSo I turned to PW's as a alternative to Mod's, OC.<br/>\n<br/>\nBut then I couldnt play PW's like WOG(World of Greyhawk), because they didnt have NWN Sync, and no way to use either the NWN store or Google play to install the PW(Same problem as installing Mods(No way to install mods via store or Google Play.)<br/>\n<br/>\nNow I will have to wait, and in the meantime only play Arkhalia(PW).<br/>\n<br/>\nBut a alternative has come up.<br/>\n<br/>\nI was learning how to install, play emulator games for NES, SNES, Sega, Playstation, PSP.<br/>\n<br/>\nTo do that, I had to learn how to download files, not using google play, to do that. Then had to learn how to extract the downloaded files, and then how to self install, create the right folders, put the files in the right folders, etc.<br/>\n<br/>\nI learned how to do that right, can play those emulated games.<br/>\n<br/>\nBecause of what I learned from doing that, I figured out how to force NWN EE to be installed on my SD card, and not on my internal memory where Google Play installs it <br/>\n<br/>\nPutting the game on my 128 GB SD card, really freed up some space(10 GB), on my internal memory.<br/>\n<br/>\nAnd so because of that I figured out how to download, extract, install the NWN Mods, without using the NWN store or Google play, or even the official Beamdog, user, officially suggested, recommended way of connecting phone to computer, and using computer to install mods(Didnt have a computer, and even if I had had a computer, not sure I could have figured out how to install the mods via the computer connected to phone the official recommended way.<br/>\n<br/>\nWhat I learned to do:<br/>\n<br/>\nStep 1: Click on file download link.<br/>\n<br/>\nStep 2: that starts the download to phone. Wait for download to finish downloading <br/>\n<br/>\nStep 3. Download a app from Google play that extracts .RAR, . ZIP, and .EXE, etc files.<br/>\n<br/>\nStep 4: Using the Extractor Google Play App, extract the downloaded files.<br/>\n<br/>\nStep 5: Step 4 is done by:<br/>\n<br/>\nA. Click on phone settinga.<br/>\n<br/>\nB. Click General Tab.<br/>\n<br/>\nC. Click Storage Tab.<br/>\n<br/>\nD. Click Explore<br/>\n<br/>\nE. That goes to a directory of all the folders on phone device.<br/>\n<br/>\nF. Goto, click download folder.<br/>\n<br/>\nG. Find Find NWN Mod file<br/>\n<br/>\nH. Then find the extract folder with a similar name to the NWN mod file, in the download folder <br/>\n<br/>\nI. In the extract folder there will be TLK, HAK, Mod, etc files.<br/>\n<br/>\nJ. Click on the files, click move or copy.<br/>\n<br/>\nK. That take you to a chpice of either using your phones internal memory or SD Card.<br/>\n<br/>\nL. Use either the SD Card or the internal Memory directory wherever NWN is installed(SD card is where NWN is installed on my phone)<br/>\n<br/>\nM. Click Android folder<br/>\n<br/>\nN. Click Data<br/>\n<br/>\nO. Click Beamdog<br/>\n<br/>\nP. Click files<br/>\n<br/>\nQ. Click Data<br/>\n<br/>\nR. Click Hak, or TLK, or Mod, wherever moved, copied file go.<br/>\n<br/>\nS. Click Move, Copy. File gets moved, copied to the Hak, or Mod, or wjatever folder.<br/>\n<br/>\nT. Rinse, Repeat until all the extracted files have been moved, copied to the right places.<br/>\n<br/>\nU. Fire up NWN.<br/>\n<br/>\nV. Click on New game.<br/>\n<br/>\nW. Click other modules.<br/>\n<br/>\nX. Look for, click on WOG mod(or the mod installed)<br/>\n<br/>\nY. Click on New Character, which SHOULD quickly fire up mod if installed it right(Sometimes it doesnt work, because either installed it wrong or some other reason.<br/>\n<br/>\n<br/>\nThis is a lot easier then trying to connect phone to computer, then use computer(The official Recommended Beamdog way, that I would have a hard time with, even if I had a computer(I dont have a computer)<br/>\n<br/>\nNow I have the following mods that work just fine.<br/>\n<br/>\nEye of the Beholder.<br/>\n<br/>\nEye of the Beholder 2, Legend of Darkmoon.<br/>\n<br/>\nPool of Radiance: Ruins of Myth Drannor.<br/>\n<br/>\nPool of Radiance(Sou Edition)<br/>\n<br/>\nThe Bard's Tale, Tales of the Unknown<br/>\n<br/>\nArcanium<br/>\n<br/>\nCareenan(lev 1 to lev 35)<br/>\n<br/>\nThe Lord of Terror, A Diablo Campaign<br/>\n<br/>\nRaines World of Greyhawk(The OFFLINE SINGLE PLAYER version of the ONLINE version of WOG)<br/>\n<br/>\nDont have Aielund because its a series of Mods <br/>\n<br/>\nMost of these mods are non series, 1 single mod that takes you from either levels 1 to 13, Lev 1 to 20, Lev 1 to 30, lev 1 to 35, Lev 1 to 40, Lev 8 to 30, lev 10 to 25, Lev 15 to Lev 23, Lev 20 to Lev 30, etc.<br/>\n<br/>\nThe only exception is the Pool of Radiance Ruins of Myth Drannor Mod that is 1 mod broken into 4 mods that take you from level 1 to level 15 to lev 20(where you get to fight a dracolich)<br/>\n<br/>\nThe mods are all installed and work just fine.<br/>\n<br/>\nLooking forward to playing these mods, and Arkhalia PW, until my access to all the other PW's gets restored by Beamdog via another android update.<br/>\n<br/>\nOh BTW, now that I have Raines WOG installed, working, ready to play, is there any advice from you WOG players out there on how to play thru WOG?</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:14 AM - Mar 05, 2020",
      "content": "<div>Here is a suggested list :<br/>\n<br/>\nUse the Shadow Priest or Demolition Man. Those are very good on WoG. To make them better, get the Animal And Plant domains, and go with Lawful Neutral and Obad Hai as your god.<br/>\n<br/>\nWOG level list<br/>\n<br/>\n1. Hommlet and Moathouse<br/>\n2. Kobold lands<br/>\n3. Goblin lands<br/>\n4. Orc lands<br/>\n5. Ruskis<br/>\n6. Nulb and ToEE<br/>\n7. Public Crypts<br/>\n8. Cairn Hills upper regions (snow orcs etc.)<br/>\n9. Necromancer quest<br/>\n10. Dragon Cult<br/>\n11. Cyclops lands<br/>\n12. Inverness<br/>\n13. Gnarly bandits<br/>\n14. Hill Giant Steading<br/>\n15. Cairn Hills bandit HQ<br/>\n16. Griffon Nest<br/>\n17. Frost Giant Jarl<br/>\n18. Beholder Cave<br/>\n19. White Dragon King<br/>\n<br/>\nRevised list<br/>\n<br/>\n1- Moathouse (I always start there, because it's IMO the coolest level 1 quest - one could do Saltmarsh U1-U3 instead, also really cool!)<br/>\n2- Kobold Lands<br/>\n3- Goblin Lands<br/>\n4- Orc Lands<br/>\n5- Gnoll<br/>\n6- Ruskis<br/>\n7- Nulb and ToEE<br/>\n8- Public Crypts in GH<br/>\n6- Kron Necromancer<br/>\n7- Bandit Chief Ashald<br/>\n8- Dragon Cult Caves (Could be done before Bandit Cave if you want)<br/>\n9- Various GH Quests<br/>\n10- Carin Hills upper regions (snow orcs, etc)<br/>\n10- Dragon Cult<br/>\n11- Muddy Bird<br/>\n10- Inverness<br/>\n11- Hill Giant Steading<br/>\n13- Griffon Nest<br/>\n12- Manscorpion King<br/>\n13- Frost Giants<br/>\n14- Beholder Cave<br/>\n15- Fire Giants<br/>\n<br/>\n </div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "11:51 AM - Mar 05, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10759110&amp;sid=4bb14ae8d28c5c96df3fb0fc71135d5a\">webshaman1</a> wrote: <div class=\"responsive-hide\">Mar 05, 2020</div></cite>Here is a suggested list :<br/>\n<br/>\nUse the Shadow Priest or Demolition Man. Those are very good on WoG. To make them better, get the Animal And Plant domains, and go with Lawful Neutral and Obad Hai as your god.<br/>\n<br/>\nWOG level list<br/>\n<br/>\n1. Hommlet and Moathouse<br/>\n2. Kobold lands<br/>\n3. Goblin lands<br/>\n4. Orc lands<br/>\n5. Ruskis<br/>\n6. Nulb and ToEE<br/>\n7. Public Crypts<br/>\n8. Cairn Hills upper regions (snow orcs etc.)<br/>\n9. Necromancer quest<br/>\n10. Dragon Cult<br/>\n11. Cyclops lands<br/>\n12. Inverness<br/>\n13. Gnarly bandits<br/>\n14. Hill Giant Steading<br/>\n15. Cairn Hills bandit HQ<br/>\n16. Griffon Nest<br/>\n17. Frost Giant Jarl<br/>\n18. Beholder Cave<br/>\n19. White Dragon King<br/>\n<br/>\nRevised list<br/>\n<br/>\n1- Moathouse (I always start there, because it's IMO the coolest level 1 quest - one could do Saltmarsh U1-U3 instead, also really cool!)<br/>\n2- Kobold Lands<br/>\n3- Goblin Lands<br/>\n4- Orc Lands<br/>\n5- Gnoll<br/>\n6- Ruskis<br/>\n7- Nulb and ToEE<br/>\n8- Public Crypts in GH<br/>\n6- Kron Necromancer<br/>\n7- Bandit Chief Ashald<br/>\n8- Dragon Cult Caves (Could be done before Bandit Cave if you want)<br/>\n9- Various GH Quests<br/>\n10- Carin Hills upper regions (snow orcs, etc)<br/>\n10- Dragon Cult<br/>\n11- Muddy Bird<br/>\n10- Inverness<br/>\n11- Hill Giant Steading<br/>\n13- Griffon Nest<br/>\n12- Manscorpion King<br/>\n13- Frost Giants<br/>\n14- Beholder Cave<br/>\n15- Fire Giants<br/>\n<br/>\n </div></blockquote>\n\nThanks, this is really helpful.<br/>\n<br/>\nAltho I'm sure your suggested builds are opt.<br/>\n<br/>\nI would rather go with either:<br/>\n<br/>\nMonk 6/Druid 18/Shifter 16(Dragon at Level 30)<br/>\n<br/>\nOr<br/>\n<br/>\nMonk 6/Cleric 12/Assassin 22<br/>\n<br/>\nOr <br/>\n<br/>\nMonk 9/Cleric 26/SD 5<br/>\n<br/>\nOr<br/>\n<br/>\nMonk 9-13/Cleric 15 to 18 to 21/Rogue 10 to 13<br/>\n<br/>\nOr<br/>\n<br/>\nRanger 9/Cleric 11/Assassin 20<br/>\n<br/>\nOr <br/>\n<br/>\nRanger 9/Shadowdancer 5/Assassin 26<br/>\n<br/>\nOr<br/>\n<br/>\nBard 6 or 8/Shadowdancer 5/Assassin 27 to 29<br/>\n<br/>\nOr<br/>\n<br/>\nHuman Paladin/COT/Weaponmaster<br/>\n<br/>\nOr<br/>\n<br/>\nCleric/COT/Weaponmaster<br/>\n<br/>\nOr<br/>\n<br/>\nBard/PM/Rdd<br/>\n<br/>\nOr<br/>\n<br/>\nDragon Man<br/>\n<br/>\nDruid 18/Bard 4 t0 6 to 8/RDD 14 to 16 to 18/Druidic Dragon Form(33 rd level)(Druid 18th lev), Complete Half Dragon, when not transformed into dragon.<br/>\n<br/>\nThese combinations, character types interest me more, then the 2 builds you suggested, even tho probably not as OPTIMIZED as the 2 builds you suggested.<br/>\n<br/>\nThanks for your help.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:02 PM - Mar 05, 2020",
      "content": "<div>Oh, no, those are just builds that tend to make things easier.<br/>\n<br/>\nOne can play what one wishes.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "12:07 PM - Mar 05, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10759110&amp;sid=4bb14ae8d28c5c96df3fb0fc71135d5a\">webshaman1</a> wrote: <div class=\"responsive-hide\">Mar 05, 2020</div></cite>Oh, no, those are just builds that tend to make things easier.<br/>\n<br/>\nOne can play what one wishes.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk</div></blockquote>\n\nEven tho I can play what I want, etc, I would like some help optimizing the kind of builds I want to play, so that I get to both play what I want, and make it easier and get to eat the cake.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:06 PM - Mar 05, 2020",
      "content": "<div>If it helps, there is a releveling wand / mulligan stick sold in Hommlet, Borderkeep, Ruskis and the Adventurer's Guild in Greyhawk (possibly other places too)<br/>\nSo you can redo your build if you were not happy with it, as long as the choices you make at level 1 you are 100% certain you want<br/>\nSuch items are also available in other environments I have heard<br/>\nYou might notice for example, I rarely take weapon focus feats at level 1, for this reason, to allow the player to rechoose their focus if they wish</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "7:30 PM - Mar 05, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10759084&amp;sid=4bb14ae8d28c5c96df3fb0fc71135d5a\">Orion2019</a> wrote: <div class=\"responsive-hide\">Mar 05, 2020</div></cite>If it helps, there is a releveling wand / mulligan stick sold in Hommlet, Borderkeep, Ruskis and the Adventurer's Guild in Greyhawk (possibly other places too)<br/>\nSo you can redo your build if you were not happy with it, as long as the choices you make at level 1 you are 100% certain you want<br/>\nSuch items are also available in other environments I have heard<br/>\nYou might notice for example, I rarely take weapon focus feats at level 1, for this reason, to allow the player to rechoose their focus if they wish</div></blockquote>\n\nThanks Orion.<br/>\n<br/>\nAltho that's smart what you do at 1st lev, usually cant take weapon focus at lev 1 with non melee and even a melee monk cant. Need a +1 BAB at 1st Lev. The classes like Cleric, etc, that could benefit from a extra +1 to hit from Weapon Focus, at 1st level, cant get it, that at 1st Level, and the classes like Fighter, etc, already start with a BAB of 1, instead of zero, and so kind of either dont need the extra +1 from Weapon Focus at level 1, or need it a lot less then other classes.<br/>\n<br/>\nLevel 3, 6, is where want to take WF, if you need it for both hitting, EWF, Prestige classes, etc, and if there isnt something more important to take instead at that time.<br/>\n<br/>\nOf course you already know this.<br/>\n<br/>\nI extremely rare get level 1 wrong, bad.<br/>\n<br/>\nSame with earlier levels.<br/>\n<br/>\nUncommon that get levels 3 to 6 wrong.<br/>\n<br/>\nLevel 9 at the earliest that sometimes get wrong.<br/>\n<br/>\nLevel 12+ is where I sometimes, usually go wrong sometimes.<br/>\n<br/>\nBy level 16 to 20+ I have usually screwed up at least a little tiny bit somewhere<br/>\n<br/>\nBy, in Epic Levels, levels 25 to Lev 30,  I almost always have screwed up something.<br/>\n<br/>\nOf course thats on the 1st or 2nd try at a build. I usually get a build right or almost right eventually.<br/>\n<br/>\nSo a Releveler item would help me a lot, save me a lot of time.<br/>\n<br/>\nThanks</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "9:18 PM - Mar 05, 2020",
      "content": "<div>If he’s playing the old 1.69 version from the vault, there’s no releveling anything in there. <br/>\n<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "10:52 PM - Mar 05, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10758933&amp;sid=4bb14ae8d28c5c96df3fb0fc71135d5a\">grizzled_dwarflord</a> wrote: <div class=\"responsive-hide\">Mar 05, 2020</div></cite>If he’s playing the old 1.69 version from the vault, there’s no releveling anything in there. <br/>\n<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div></blockquote>\n\nYep Dwarflord, its the older Raines OFFLINE SINGLEPLAYER 1.69 version of WOG on the Vault.<br/>\n<br/>\nThere was a newer version of that for enhanced edition. But when I tried to install that, it didnt even show up in the other modules folder in game at first, and when it did finally show up, it didnt work.<br/>\n<br/>\nI tried everything from reinstalling CEP 2.65, the Mod, Hak files, etc, nothing worked.<br/>\n<br/>\nSo I tried the 1.69 Old version.<br/>\n<br/>\nStrange thing is that the Old Version is supposed to either be harder to install,  not be as compatible with Enhanced Edition as the newer version.<br/>\n<br/>\nBut it did better then the newer version.<br/>\n<br/>\nBut when I installed the older version, even tho I again had a error saying I was missing a Hak file, and had to again, reinstall the CEP 2.65, and the CEP 2.65 quick fix file, and the 1.69 version files again, it FINALLY worked.<br/>\n<br/>\nIt works just fine now, but the load up times for creating a new character, or loading up a saved game, is very slow.<br/>\n<br/>\nProbably because of it being the Old 1.69 version on the newer Enhanced Edition, instead of it being the newer version on enhanced edition.<br/>\n<br/>\nSo I guess no releveler for me.<br/>\n<br/>\nOh well, not that big a deal to go without a releveler.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "6:18 AM - Mar 08, 2020",
      "content": "<div>Problems<br/>\n<br/>\n1. Extremely tough<br/>\n<br/>\n2. If 1 above wasnt enough:<br/>\n<br/>\n3. Glitches, bugs, corrupted save games.<br/>\n<br/>\n4. extremely low magic<br/>\n<br/>\n5. Magic items, even basic +1 gear, is not only hard to come by, get, cost a lot.<br/>\n<br/>\n6. While XP is ok, not enough, AKA no loot, gp, money, things that can be sold for gp at least thru first 3,4, etc, beginning levels.<br/>\n<br/>\n7. Brown Bear, Animal Companion, and Summon boar, seem to either want to either stand there, do nothing, not attack, or run away, come back, run away again, come back again, back and forth, over and over, when nothing else is there except the thing that is winning, beating, killing you, because of the no help from summons. On the extremely rare times they do help, the animal companion, summon kick but.<br/>\n<br/>\n8. Can only rest once per every about 8 to 12 to 16 hours. Not only that, but even if there are absolutely no hostiles anywhere even remotely close to being remotely close, and nothing there, still get \"This is not a ok area to rest\", or \"This not a safe area to rest, etc. This makes it extremely tough at lower levels.<br/>\n<br/>\n9. No henchies(At least I cant seem to find any henchies to hire.<br/>\n<br/>\n10. A lot of the monsters at even the lowest levels have poisons, special attacks, status ailments, etc.<br/>\n<br/>\n11. And if those arent bad enough, I cant even find a key to get into the Moathouse in the Hommlet Area.<br/>\n<br/>\n12. Even the smallest things like rats, insects, bunny rabbits, badger, dogs, etc, can easily kill you at 2nd level.<br/>\n<br/>\n13. Quite annoying to watch either a rat, badger, dog, etc, kill you, while your brownbear, and badger do nothing.<br/>\n<br/>\n14. No freaking wonder why no one plays WOG SINGLE PLAYER, and almost always plays the multi player WOG PW, and does so in parties, and uses all the same best builds, etc.<br/>\n<br/>\nDoes anybody know if, and where can hire henchies, and if there is a key to Moathouse and where to find a key, if it exist.<br/>\n<br/>\nSo far during the first 2 character levels, have died about 5 times.<br/>\n<br/>\nNow I am 3rd level after a extremely hard long slog to 3rd level.<br/>\n<br/>\n4th level should be a little bit easier because of Barkskin, Cat's Grace, Bull's strength spells, as Monk 1/Druid 3.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:28 AM - Mar 08, 2020",
      "content": "<div>You need to talk to your Animal Companion/Familiar and tell it how it's supposed to perform in combat.  Summons need to be directed with the radial/voice commands.  Attack nearest and guard me, along with follow.<br/>\n<br/>\nLots of peeps play solo - WoG is how NWN should be; what you have experienced before is watered down easy mode.<br/>\n<br/>\nThere is no key for the Moathouse - either pick the lock or break the door down.  Chimes of Opening also do the trick, but may be hard to come by.<br/>\n<br/>\nGenerally, there are no Henchies - but there are, perhaps, some individuals that one may come across that will help out.<br/>\n<br/>\nWoG is ALWAYS a steep learning curve, followed by meta-info.  Once one has those down pat, it's pretty much smooth sailing from there on in.<br/>\n<br/>\nA very good tip is not to rush in and start swinging.  That will get you dirtnapped faster than anything else.  It is much smarter to move slowly and attract the attention of 1 (one) opponent with a little *plink* of a thrown object or shot, and lure it somewhere empty where it can be defeated rather easily and with little difficulty.  Rinse, repeat.<br/>\n<br/>\nOnly drop AoEs if they will wipe ALL of the effected enemies - otherwise, you will get swarmed and dirtnapped.<br/>\n<br/>\nSolo on WoG is a learned patience game for the most part.  It will require one to really learn the ins and outs of NWN, usage of resources (like potions, scrolls, and wands, etc) and abilities/feats/spells.<br/>\n<br/>\nTHIS.IS.WOG!</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "6:39 AM - Mar 08, 2020",
      "content": "<div>Looks like he's playing the old 1.69 version.  That's an older version.  However, most of the nuts and bolts are in place.  For resting, make sure you keep a bedroll in your inventory or it will double your timer.  Normally the times between rest cycles is 8 hours, which equals 16 minutes of real time (2 minutes per hour iirc).  <br/>\n<br/>\nAlso, if you see a message, \"This is not a safe place to rest\", that means somewhere in that area there is a safe place to rest.  As opposed to the message, \"You may not rest at this time\" which means you can't rest period in that area.<br/>\n<br/>\nYou animal companion will work smarter for you if you engage in a dialogue and adjust their behavior.  I typically choose an option like, \"I want you to fight for me to your death\" kind of option.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:43 AM - Mar 08, 2020",
      "content": "<div>One other thing about Summons - if your character is invis/sanc the summons will NOT attack unless attacked - even if directed to attack.<br/>\n<br/>\nAnd sometimes, it still will not do anything even if attacked and damaged.<br/>\n<br/>\nYour character will often need to initiate combat (breaking invis/sanc) to get your summons to start attacking.  Once it does, your character may again go invis/sanc and be somewhat safe.<br/>\n<br/>\nNote that under Sanc, your character may not be safe at all - not sure why, but that's how it is.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "7:02 AM - Mar 08, 2020",
      "content": "<div><blockquote><div><cite>grizzled_dwarflord wrote: <div class=\"responsive-hide\">Mar 08, 2020</div></cite>Looks like he's playing the old 1.69 version.  That's an older version.  However, most of the nuts and bolts are in place.  For resting, make sure you keep a bedroll in your inventory or it will double your timer.  Normally the times between rest cycles is 8 hours, which equals 16 minutes of real time (2 minutes per hour iirc).  <br/>\n<br/>\nAlso, if you see a message, \"This is not a safe place to rest\", that means somewhere in that area there is a safe place to rest.  As opposed to the message, \"You may not rest at this time\" which means you can't rest period in that area.<br/>\n<br/>\nYou animal companion will work smarter for you if you engage in a dialogue and adjust their behavior.  I typically choose an option like, \"I want you to fight for me to your death\" kind of option.</div></blockquote>\n\nUsually in most mods, PW's my animal companions just attack whatever I am fighting, and sometimes they attack potential hostiles, before I fight. I sometimes have to catch up to them. And often they finish the fight before I get to join in.<br/>\n<br/>\nI usually almost never ever have to worry about companions, henchies, summons doing nothing but watching my character get beat.<br/>\n<br/>\nSometimes I have to ask the companion, henchie, summon to STAY CLOSE, Guard Me.<br/>\n<br/>\nBut even after asking companion, summon to STAY CLOSE, GUARD ME, they still did NOTHING most of the time to the point where I wonder if its a bug or something.<br/>\n<br/>\nI'll try doing it over and over and over and see if doing what you guys are suggesting finally works, gets the companion, summons to fight the hostiles.<br/>\n<br/>\nThe using a Brown Bear companion, And a Summoned Boar, has been extremely effective.<br/>\n<br/>\nSo it would probably also be extremely effective on WOG as well, provided I can get the Companion, Summons, to do their job right.<br/>\n<br/>\nYep your right that I am using the 1.69 version of WOG(The newer NON 1 69 version wont, doesnt seem to work with NWN EE on my Android phone)<br/>\n<br/>\nI do use a Bedroll for the reasons you named.<br/>\n<br/>\nHow long is the bedroll good for? Do it ever wear out? Do you ever have to replace it, buy another one?.<br/>\n<br/>\nSo far I still have the Bedroll I started the game with.<br/>\n<br/>\nThanks for the help guys.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:10 AM - Mar 08, 2020",
      "content": "<div>WoG AI is much more...robust, than the stand AI (you may have noticed already ;) ).<br/>\n<br/>\nOne of the side effects of that is how Animal Companions and Familiars (and summons to some extent) act.<br/>\n<br/>\nSo when you summon your AC (animal companion) or Fam (familiar), be sure to first speak with it before going into combat (where you most likely will not be able to speak with it because of combat) and give it directions (like what GDL has mentioned).<br/>\n<br/>\nSummons don't have that because one often summons them in or just before combat - so one has to use the radial or voice commands.<br/>\n<br/>\nYour bedroll will not get used up or disappear.  Food will, however, and you need food in order to rest.<br/>\n<br/>\nIf you go into the desert, you will need your canteen.  Be sure to fill it at any oasis and there are places in an oasis where you can drink.  Do so.  You will notice that you get thirsty when you get a malus to str - so drink from your canteen (or at an oasis) to remove it.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:27 AM - Mar 08, 2020",
      "content": "<div>Hail Asturonethoriusaline<br/>\nGreat to hear you are trying out the WoG single player module<br/>\nIt was designed as a challenging but fun mid magic (up to +5-6) party server<br/>\nPlaying solo as a result should push the boundaries of your skill level<br/>\nJust remember if you are finding it hard, it is because you are being challenged but you are also learning whilst doing it.<br/>\n<br/>\n<strong>Animal companion:</strong><br/>\nI faced the same problem as you playing my druid. The default behaviour is to fight but only it is safe. Unfortunately the encounters are generally, very unsafe. I found it best to ask my animal companion to \"Fight to the death\". You can do this by speaking to your companion outside of combat. Later on you must be prepared to receive damage for your animal companion, as your companion will have terrible AC compared to the enemies out there.<br/>\n<br/>\n<strong>\"Extremely tough\":</strong><br/>\nIf you feel this way I would suggest starting with an 'easy' build, once you have learnt how to play well, you can upgrade your skill level to that of <em class=\"mention\">@Aquarius 233</em> and play a Bard-orcerer and kill Lloth / Althea / Vaine etc solo . <br/>\nClose to pure cleric is what I would recommend, and keep leveling cleric to undispellability (24) before any significant investment in a multiclass. <br/>\nAnimal domain is good to use for empowered summons, until you get to epic levels, then it tends to fall off<br/>\n<br/>\nThe other thing that would help is to consider strategies.<br/>\nA good starting strategy is to pull single enemies with a ranged weapon away from all that enemies's friends<br/>\nThen attempt to defeat that enemy. This is called \"Pull and Slay\" (or Run away), a phrase that WebShaman has coined.<br/>\n<br/>\nMaximillan Kane wrote a guide to <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/playing-better-the-importance-of-knowledge-and-int-t2354384.html\" rel=\"noreferrer\" target=\"_blank\">playing better</a>, I found it helpful when I started WoG some 10-12 months ago<br/>\nIn terms of playing better if I get defeated by the server/module I like to look at the combat log.<br/>\nIt tells me what happened and why I died. It might be that my weak fortitude save was targeted and I died to a death spell that I wasn't aware of, or my AC wasn't high enough to melee and the opponent critically hit me as a result.<br/>\n<br/>\nI can see you started at the Moathouse, but if it helps, I am of the opinion Ruskis is easier to level a low level character up in.<br/>\nIt may be worth trying Ruskis at some stage to contrast and compare. if you can try it on single player, do try to remember what Shipwreck asks you to do because it won't be listed in the quest log, its the way DM Nocturne designed that area at the time. <br/>\n<br/>\nSingle player has the advantage of being able to pause the game over the server, feel free to utilise this for the time being.<br/>\n<br/>\nThats probably enough from me at least, the others have given you some advice too I'm sure you can make the transition </div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "7:51 PM - Mar 08, 2020",
      "content": "<div><blockquote><div><cite>Orion2019 wrote: <div class=\"responsive-hide\">Mar 08, 2020</div></cite>If you feel this way I would suggest starting with an 'easy' build, once you have learnt how to play well, you can upgrade your skill level to that of <em class=\"mention\">@Aquarius 233</em> and play a Bard-orcerer and kill Lloth / Althea / Vaine etc solo .  </div></blockquote>\nI don't feel that experienced, I need to grow more and more, especially with dexters, casters and rogues (never ever played with them). by the way, thank you for the team up in Ruskis as it teached me how to play casters at low levels ;)<br/>\n<br/>\nHey Asturonethoriusaline!<br/>\nI have read your comments and your impressions, and I sure felt the same way when tried WoG for the very first time. In addition, I didn't play a PW ever, so I totally felt lost: at this point, the most important things to have is the will (and stubborness), and help from more seasoned players. You have both of them, and so I think you will perform well.<br/>\n<br/>\nI can add (to the many advices up there) some little notes, in the hope that they can help:\n<ul>\n<li>Don't be afraid to die, you can always learn something from dying;</li>\n<li>if you did not begin as a druid/wiz/sorcerer/cleric, but you plan to play as one, you have to buy the book of summons. this item (which appears automatically in your inventory if you choose one of these classes at lv 1) will let you change the summon for each \"summon creatures\" spell, based on the level.</li>\nforget about the boars, or badgers, get the \"black bear\" for lv 1 summon, and \"brown bear\" for lv 2. Those can greatly help at lowest levels.<li>use powerful builds at least in your first adventure, e.g. bard/fighter/RDD, cleric with UMD who can help you levelling faster and have defensive/offensive abilities.</li>\n<li>(if you have UMD) Play with the enchanced edition, so wands of magic missile cost less and can be bought from shops at lv 1/2.</li>\n<li>read the combat log.</li>\n<li>if you can access to damage reduction/items with damage resistance properties, or other immunity items don't sell them unless you have already an item.</li>\n<li>if you play bards/wiz/sorcerers, evaluate to take \"craft wand\" to save spells and be able to use that \"haste\" or \"invisibility\" spell when you need it.</li>\n<li>think about mapping the areas, it is very useful.</li>\n</ul>\n\nIf you want to ask something \"spoilerous\", write me a PM and I will be happy to help ;)<br/>\n<br/>\nEdit: the loading time is slow also for me, I think this happens because WoG is very big!</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "11:00 PM - Mar 08, 2020",
      "content": "<div>Thanks for all the help, you all. Especially the part on how to get the animal companions, summons back on track.<br/>\n<br/>\nI'm now at lev 3, almost to level 4, in the moathouse, and my Animal Companion, Summon, druid is back to at least semi kicking butt. It's still semi hard and semi harder then other mods, PW's. But within it being harder, I am semi relatively, semi kicking butt within that hardness.<br/>\n<br/>\nNow I only have the occasional tough fight, or close call, and had 1 fight where I almost got killed.<br/>\n<br/>\nBut most fights are at least a lot relatively easier, and I kick butt in most to a lot of battles.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "11:35 PM - Mar 08, 2020",
      "content": "<div><blockquote><div><cite>Aquarius 233 wrote: <div class=\"responsive-hide\">Mar 08, 2020</div></cite><blockquote><div><cite>Orion2019 wrote: <div class=\"responsive-hide\">Mar 08, 2020</div></cite>If you feel this way I would suggest starting with an 'easy' build, once you have learnt how to play well, you can upgrade your skill level to that of <em class=\"mention\">@Aquarius 233</em> and play a Bard-orcerer and kill Lloth / Althea / Vaine etc solo .  </div></blockquote>\nI don't feel that experienced, I need to grow more and more, especially with dexters, casters and rogues (never ever played with them). by the way, thank you for the team up in Ruskis as it teached me how to play casters at low levels ;)<br/>\n<br/>\nHey Asturonethoriusaline!<br/>\nI have read your comments and your impressions, and I sure felt the same way when tried WoG for the very first time. In addition, I didn't play a PW ever, so I totally felt lost: at this point, the most important things to have is the will (and stubborness), and help from more seasoned players. You have both of them, and so I think you will perform well.<br/>\n<br/>\nI can add (to the many advices up there) some little notes, in the hope that they can help:\n<ul>\n<li>Don't be afraid to die, you can always learn something from dying;</li>\n<li>if you did not begin as a druid/wiz/sorcerer/cleric, but you plan to play as one, you have to buy the book of summons. this item (which appears automatically in your inventory if you choose one of these classes at lv 1) will let you change the summon for each \"summon creatures\" spell, based on the level.</li>\nforget about the boars, or badgers, get the \"black bear\" for lv 1 summon, and \"brown bear\" for lv 2. Those can greatly help at lowest levels.<li>use powerful builds at least in your first adventure, e.g. bard/fighter/RDD, cleric with UMD who can help you levelling faster and have defensive/offensive abilities.</li>\n<li>(if you have UMD) Play with the enchanced edition, so wands of magic missile cost less and can be bought from shops at lv 1/2.</li>\n<li>read the combat log.</li>\n<li>if you can access to damage reduction/items with damage resistance properties, or other immunity items don't sell them unless you have already an item.</li>\n<li>if you play bards/wiz/sorcerers, evaluate to take \"craft wand\" to save spells and be able to use that \"haste\" or \"invisibility\" spell when you need it.</li>\n<li>think about mapping the areas, it is very useful.</li>\n</ul>\n\nIf you want to ask something \"spoilerous\", write me a PM and I will be happy to help ;)<br/>\n<br/>\nEdit: the loading time is slow also for me, I think this happens because WoG is very big!</div></blockquote>\n\nHey thanks for the help.<br/>\n<br/>\nI'm building a Monk/Druid/Shifter: Monk 6/Druid 18/Shifter 16(Dragon at 30th level) Pre Epic: Monk 4/Druid 6/Shifter 10(10th lev shifter at 16th lev(Mind Flayer, Medusae, etc)<br/>\n<br/>\nCurrently at 3rd level: Monk 1/Druid 2. Almost 4th level Monk 1/Druid 3)<br/>\n<br/>\nStarted as Druid 1. Lv 2: Monk. Lv 3: Druid. Lv 4: Druid.<br/>\n<br/>\nSo I did get the druid summoning book. I guess I misunderstood what the book was. I thought it was a way to be able to continue summoning, when either your summon duration ran out and summon disappeared, an or when summon spells ran out.<br/>\n<br/>\nI'll be sure to use the black bear, and brown bear summons in place of badger, boar.<br/>\n<br/>\n2 brown bears is pretty good.<br/>\n<br/>\nIt would be nice to get magic items, but right now, I dont have enough money to get even 1 minor +1 item, and might probably not get 1 anytime soon as not getting gold, magic items to sell generally.<br/>\n<br/>\nThe 1 exception is that I got 150 gp, and a Tower Shield +1 that had to crawl back to the trading post with, to sell for about 250 to 500 gp.<br/>\n<br/>\nRight now I have 250 gp. Used to have 900 gp, but spent a lot of that on: 7 cure light potions, 3 cure moderate potions, 7 bless potions, 10 things of food(the past difficulty of WOG was burning thru my gold like crazy, thru having to buy food, bless, cure potions. And dying 5 times costed 500 xp, and about 125 to 250 gp.<br/>\n<br/>\nAnd that's on top of the starting 1000 gp(Which is quite generous comparatively), but spent most of that on starting equipment, supplies, etc, so had about 125 gp to 250 gp to 333 gp left over out of the starting GP.<br/>\n<br/>\nI'm sure that now that I am starting to kick butt now, and as I do the moathouse that I'll eventually get more gp, and magic items to use, sell, and that I won't have to burn gp on consumables just to survive.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:44 AM - Mar 09, 2020",
      "content": "<div>I'm going to be interested in later, when you look back at your starting experiences with hindsight.<br/>\n<br/>\nWhy don't we have a \"remind me later\" bot?</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "3:08 AM - Mar 09, 2020",
      "content": "<div>Druids might be the easiest class to level on WoG (pre-epic) because all of their summons are at one level higher (like a Cleric with Animal Domain). So already at Level 1 and 2 you can summon a juggernaut.  Combined with your Animal Companion and whomever you Empathy, the only thing you need to do is hug trees while your animal army chomps down on bad guys.  Make sure to grab a Branch of Giving when you can afford it because it is a buff wand for your Animal Companion.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "3:23 AM - Mar 09, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10758933&amp;sid=28eebc82525c660b4cd1cc6ba495031a\">grizzled_dwarflord</a> wrote: <div class=\"responsive-hide\">Mar 09, 2020</div></cite>Druids might be the easiest class to level on WoG (pre-epic) because all of their summons are at one level higher (like a Cleric with Animal Domain). So already at Level 1 and 2 you can summon a juggernaut.  Combined with your Animal Companion and whomever you Empathy, the only thing you need to do is hug trees while your animal army chomps down on bad guys.  Make sure to grab a Branch of Giving when you can afford it because it is a buff wand for your Animal Companion.</div></blockquote>\n\nThanks, I didnt know that summons functioned at 1 level higher. <br/>\n<br/>\nI knew animal armies worked great at other mods, PW's.<br/>\n<br/>\nThe only problem was getting the animals to stop doing nothing.<br/>\n<br/>\nI thought I just had to summon the animal army, since that is all I had to do on other Mods, PW's.<br/>\n<br/>\nAnd if that didnt work, all I had to do was click stay closer, guard me.<br/>\n<br/>\nI didnt know that you had to click on the fight until you die option, to get the animals to fight like they usually do at other mods, PW's.<br/>\n<br/>\nI clicked the fight until you die thing, and used the radial menu to click the guard me option.<br/>\n<br/>\nNow the animal companion, summon, kick butt.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:56 AM - Mar 09, 2020",
      "content": "<div>The Animal Domain (which Druids have naturally) have always pumped the Summons up 1 level - to the limit of Summons IX.<br/>\n<br/>\nOn WoG, there is a level beyond IX - it is like a Summons X if there had been one.  You can then summon Elemental Princes (Princesses).  These Summons are far stronger than anything else (with the exception of Epic Mummy and Dragon Warrior, epic summons).<br/>\n<br/>\nI want to know where \"hug tree\" is on the radial!  Dammit!<br/>\n<br/>\nOr is it one of them thar CEP voice commands?  I gots ta know!</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "7:56 AM - Mar 09, 2020",
      "content": "<div>Lubash the Ogre went down a split second after going hostile, when my Brown Bear, Earth Elemental, both attacked and hit him with a collective 1,2,3 times, and down he went(Timber.......Crash), without me even getting to attack even once.<br/>\n<br/>\nHere are my book of summon settings:<br/>\n<br/>\nLev 1: <br/>\n<br/>\nSmall Minor Air Elemental<br/>\n<br/>\n(These things took a level 1,2,3 party if you wanted to take down the Air Elemental without anyone in the party getting injured, hurt, dead, etc, in Atari's Temple of Elemental Evil game. Encountered them on either level 2, 3 of the Temple of Elemental Evil, usually near to the Gnoll Cultist.)<br/>\n<br/>\nLev 2. <br/>\n<br/>\nEarth Elemental<br/>\n<br/>\n(Not Small, but not greater earth elemental.)<br/>\n<br/>\nCould also select Gelatinous Cube(Which is HUGE, and is darn near invulnerable to most monsters levels 1+ to 7+. Problem is that it doesn't do much damage, altho it usually kills almost anything, everything, but usually the summon time runs out shortly after a battle, because of how much time it takes to do enough damage to finally kill what it is fighting.<br/>\n<br/>\nAlso because Cube is so big, it has a hard time going down narrower passageways.<br/>\n<br/>\nLevel 3.<br/>\n<br/>\nGriffin or Black Pudding. Pudding hard to kill like Gelatinous Cube, but like the Cube, doesnt do much damage, takes a long time to kill foes.<br/>\n<br/>\nI'll get Griffin soon, as I will reach lev 5 very soon, take druid lev 4, get 1 more lev 2 spell slot and be able to have 1. Barkskin, 2. Bull's Str 3. Lev 2 Summon.(Bumped to Lev 3 summon, Griffin by Summoning Book), instead of just Barkskin, Bull's Str.<br/>\n<br/>\nIf I am overlooking a summon form, I should be using instead of what I am using, please let me know and why I should use that summon form, creature, over what summon form, creature I am using now.<br/>\n<br/>\nWonder what the lev 3 summon forms, creatures, animals, etc, bumped up to lev 4 will be?</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "8:48 AM - Mar 09, 2020",
      "content": "<div>There's some hidden gems in the first 4 tiers.  I won't spoil all the secrets of the chef, but one example is I tend to use the Invisible Stalker as my 4th level Summons.  Not for battle or anything, but because of his abilities to open locked doors and chests.  I'll even Craft Wands of Summons IV so I have the freedom to choose a different familiar than a pixie, or not having to worry about crossclassing skill points for Open Lock, etc.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "9:44 AM - Mar 09, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10758933&amp;sid=e85aeecd7fae12bb202e9f92b888fdc0\">grizzled_dwarflord</a> wrote: <div class=\"responsive-hide\">Mar 09, 2020</div></cite>There's some hidden gems in the first 4 tiers.  I won't spoil all the secrets of the chef, but one example is I tend to use the Invisible Stalker as my 4th level Summons.  Not for battle or anything, but because of his abilities to open locked doors and chests.  I'll even Craft Wands of Summons IV so I have the freedom to choose a different familiar than a pixie, or not having to worry about crossclassing skill points for Open Lock, etc.</div></blockquote>\n\nThat's pretty awesome. And a invisible stalker's combat ability in addition to what you said, is nothing to Snide at. Not saying the stalker is a Bad A$$, but the stalker is no wimpy pushover either.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "4:11 PM - Mar 10, 2020",
      "content": "<div>Ok finished Moathouse.<br/>\n<br/>\nGaror Beastfriend<br/>\n<br/>\nHuman<br/>\n<br/>\nMonk 1/Druid 5/Shifter 1<br/>\n<br/>\nAbout to go up a level. Going to take a Monk level for a mini Tumble Dump to have it go from a Tumble 5 to Tumble 10 for a AC bump and for against AOE's(Attacks of Opportunity), and to get deflect arrows, and because Shifter lev 2 doesnt give you anything except closer to Shifter lev 3, which gives Greater Wild Shape 2, which allows you to become a Gargoyle, etc.<br/>\n<br/>\nStr 10<br/>\n<br/>\nDex 14<br/>\n<br/>\nCon 8<br/>\n<br/>\nWis 19(20 when lev up 1 level to lv 8(at 7th lv, almost lv 8)<br/>\n<br/>\nInt 14<br/>\n<br/>\nCha 8<br/>\n<br/>\nFeats<br/>\n<br/>\nAlertness, Expertise, Point Blank Shot, Zen Archery.<br/>\n<br/>\nLv 9: Extend<br/>\n<br/>\n12: Improved Expertise or Improved Critical Unarmed Strike<br/>\n<br/>\n15: Improved Expertise or Improved Critical Unarmed Strike<br/>\n<br/>\n18: Blindfight<br/>\n<br/>\nAC 26<br/>\n<br/>\nAnimal Summon Level, can summon a Basilisk<br/>\n<br/>\nAnimal Companion Brown Bear.<br/>\n<br/>\nWild Shape into a Brown Bear.<br/>\n<br/>\nGreater Wildshape 1:  into a Wrymling Dragon.<br/>\n<br/>\nGear:<br/>\n<br/>\nDruid Armor: Armor Bonus +5, max dex bonus 2, magical armor bonus +2.<br/>\n<br/>\nLarge Shield.<br/>\n<br/>\nScimitar<br/>\n<br/>\nCrossbow.<br/>\n<br/>\nAmulet of Natural Armor +1<br/>\n<br/>\nRing of Protection +1<br/>\n<br/>\nRing of Freedom of Movement.<br/>\n<br/>\nBuffs: Barkskin, Bull's Str.<br/>\n<br/>\nTemple of Elemental Evil, here I come.<br/>\n<br/>\nStill need to get a magical weapon. The fact that I am almost level 8, and only minor +1 AC gear, and NO, Zilch, None, NADA, etc, magical weapons, not even a +1, is NUTS, talk about EXTREME LOW MAGIC.<br/>\n<br/>\nIt's a good thing that this build doesnt depend on gear, or would be SUNK now.<br/>\n<br/>\nNo wonder why to play druids, clerics, wizards, characters not dependent on magical gear, magical armor, magical weapons, magical AC items.<br/>\n<br/>\nMaybe, Hopefully, this is just Hommlet, and that the rest of the world mod, not like that.<br/>\n<br/>\nMaybe the other towns, cities have better gear. Hopefully.<br/>\n<br/>\nOn the brightside, I do have 18,000 gp to spend<br/>\n<br/>\nGood Luck on finding anything worthwhile that would help me that I dont already have, that I could spend that 18k on.<br/>\n<br/>\nHope I can get a +1 Scimitar, +1 Kama soon.<br/>\n<br/>\nStill NUTTY that no +1 weapons yet.<br/>\n<br/>\nOh well, on to the Temple of Elemental Evil.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "4:23 PM - Mar 10, 2020",
      "content": "<div><blockquote><div><cite>Asturonethoriusaline wrote: <div class=\"responsive-hide\">Mar 10, 2020</div></cite>Ok finished Moathouse.<br/>\n<br/>\nGaror Beastfriend<br/>\n<br/>\nHuman<br/>\n<br/>\nMonk 1/Druid 5/Shifter 1<br/>\n<br/>\nAbout to go up a level. Going to take a Monk level for a mini Tumble Dump to have it go from a Tumble 5 to Tumble 10 for a AC bump and for against AOE's(Attacks of Opportunity), and to get deflect arrows, and because Shifter lev 2 doesnt give you anything except closer to Shifter lev 3, which gives Greater Wild Shape 2, which allows you to become a Gargoyle, etc.<br/>\n<br/>\nStr 10<br/>\n<br/>\nDex 14<br/>\n<br/>\nCon 8<br/>\n<br/>\nWis 19(20 when lev up 1 level to lv 8(at 7th lv, almost lv 8)<br/>\n<br/>\nInt 14<br/>\n<br/>\nCha 8<br/>\n<br/>\nFeats<br/>\n<br/>\nAlertness, Expertise, Point Blank Shot, Zen Archery.<br/>\n<br/>\nLv 9: Extend<br/>\n<br/>\n12: Improved Expertise or Improved Critical Unarmed Strike<br/>\n<br/>\n15: Improved Expertise or Improved Critical Unarmed Strike<br/>\n<br/>\n18: Blindfight<br/>\n<br/>\nAC 26<br/>\n<br/>\nAnimal Summon Level, can summon a Basilisk<br/>\n<br/>\nAnimal Companion Brown Bear.<br/>\n<br/>\nWild Shape into a Brown Bear.<br/>\n<br/>\nGreater Wildshape 1:  into a Wrymling Dragon.<br/>\n<br/>\nGear:<br/>\n<br/>\nDruid Armor: Armor Bonus +5, max dex bonus 2, magical armor bonus +2.<br/>\n<br/>\nLarge Shield.<br/>\n<br/>\nScimitar<br/>\n<br/>\nCrossbow.<br/>\n<br/>\nAmulet of Natural Armor +1<br/>\n<br/>\nRing of Protection +1<br/>\n<br/>\nRing of Freedom of Movement.<br/>\n<br/>\nBuffs: Barkskin, Bull's Str.<br/>\n<br/>\nTemple of Elemental Evil, here I come.<br/>\n<br/>\nStill need to get a magical weapon. The fact that I am almost level 8, and only minor +1 AC gear, and NO, Zilch, None, NADA, etc, magical weapons, not even a +1, is NUTS, talk about EXTREME LOW MAGIC.<br/>\n<br/>\nIt's a good thing that this build doesnt depend on gear, or would be SUNK now.<br/>\n<br/>\nNo wonder why to play druids, clerics, wizards, characters not dependent on magical gear, magical armor, magical weapons, magical AC items.<br/>\n<br/>\nMaybe, Hopefully, this is just Hommlet, and that the rest of the world mod, not like that.<br/>\n<br/>\nMaybe the other towns, cities have better gear. Hopefully.<br/>\n<br/>\nOn the brightside, I do have 18,000 gp to spend<br/>\n<br/>\nGood Luck on finding anything worthwhile that would help me that I dont already have, that I could spend that 18k on.<br/>\n<br/>\nHope I can get a +1 Scimitar, +1 Kama soon.<br/>\n<br/>\nStill NUTTY that no +1 weapons yet.<br/>\n<br/>\nOh well, on to the Temple of Elemental Evil.</div></blockquote>\n\nMaybe the town of Nulb, on the way to the Temple of Elemental Evil, has some +1+ an or better magic weapons to buy.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:25 PM - Mar 10, 2020",
      "content": "<div>The lack of magic items is purely on your side.<br/>\n<br/>\nAs you get more knowledge of the Server, you will see what I mean.<br/>\n<br/>\nAfter doing the Moathouse, you should be swimming in riches.  Time to find a suitable merchant that will satisfy your magical needs and desires - there are some pretty near to Hommlet...</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "7:37 PM - Mar 10, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10759110&amp;sid=e85aeecd7fae12bb202e9f92b888fdc0\">webshaman1</a> wrote: <div class=\"responsive-hide\">Mar 10, 2020</div></cite>The lack of magic items is purely on your side.<br/>\n<br/>\nAs you get more knowledge of the Server, you will see what I mean.<br/>\n<br/>\nAfter doing the Moathouse, you should be swimming in riches.  Time to find a suitable merchant that will satisfy your magical needs and desires - there are some pretty near to Hommlet...</div></blockquote>\n\nI dont know that I'd call about 18k, SWIMMING in riches.<br/>\n<br/>\nUsually by Lev 7,8, you usually are supposed to get at least about 33k to 43k gold according to D&amp;D's wealth by level system, if I remember right, and according to even the harder, hardest PW's like BSK, etc.<br/>\n<br/>\nThat's in addition to having, getting at least basic + 1 gear.<br/>\n<br/>\nRight now, I am short of that, at about 18k + a +2 suit of armor, +1 Amulet, +1 Ring. I do have a Ring of Freedom of Movement that is quite pricey, that I did not buy, but rather found in the moathouse, that is too valuable to sell(because of the making you darn near immune to things that stop your movement), but is probably not as needed as other stuff, and would rather have other stuff.<br/>\n<br/>\nSo I could technically probably sell the ring, and I would then technically have the 33k to 43k + the  +1 items and +2 items, etc.<br/>\n<br/>\nBut I probably should have 33k, to 43k and the +2 magic armor, +1 Amulet, ×1 Ring of Prot, Ring of Freedom of Movenmenr.<br/>\n<br/>\nSo I am probably about 13k to 17k short.<br/>\n<br/>\nI also spent about 1.5 to 3k on potions like 15 Cure Moderate, 15 Cure Lights, 15 Blesses, etc, consumables, respawning,etc.<br/>\n<br/>\nBut I probably could just go back into the Moathouse, and just Farm, Kill, Loot Larreth over and over again, and would probably have about 15k to 33k to 50k in addition to the 18k that I have now.<br/>\n<br/>\nBut if I did that, that would probably be semi somewhat lame, and I probably shouldnt have to do that.<br/>\n<br/>\nI'll make do, <br/>\n<br/>\nBut 18,000 GP, and what I got isnt SWIMMING in riches.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:35 PM - Mar 10, 2020",
      "content": "<div>If you are level 7-8 I would go to Borderkeep or Nulb/Temple of Elemental Evil and start those questlines<br/>\n<br/>\nIt also helps to know how much you are selling things for to particular merchants<br/>\nCertain merchants do not give you much in terms of gold (ie they are what is called \"shrewd businessmen and businesswomen\"), others are much more reasonable or even to the extent of being generous<br/>\nWhen you get the words \"Merchants reaction is favourable/unfavourable/neutral\" I actually ignore this and actually calculate how much money they will actually sell things to me with items in my inventory with a good comparitor item.<br/>\n<br/>\nA good comparitor item is one that is approximately 100gp in value, and this is what I have been taught by others on the server:<br/>\n<br/>\n1 copper necklace<br/>\n2 moonstones<br/>\n10 sea gems<br/>\n1 mundane heavy crossbow<br/>\n5 cure light wounds potions<br/>\n1 mundane scale mail / chain shirt<br/>\n<br/>\nAll are equal in value and can be used as the comparitor. I think there is more, for example, tower shield, I also think 5 caltrops (but I have to confirm) and I think there is another large weapon too but these are heavy and large to lug around, I would just carry 5 CLW pots, 1 copper necklace or 2 moonstones its simple to remember, and use this as the measure of what merchants actually pay you for what you sell.<br/>\n<br/>\nYou can use this with merchants to see how much they offer you and convert it to a percentage of the items actual value<br/>\nSo if a merchant offers me 50 gold for a heavy crossbow from the bandits outside hommlet, he is offering me 50% of the items actual value<br/>\nAround 60+ I consider very reasonable, the highest possible I could actually get was 85<br/>\nFor very valuable items especially if they are light (ie the ring you mentioned) you will want maximal reward, for lesser but heavy items (ie mundane full plate or tower +1) you can sell at a 30-50% rate with a clear conscience <br/>\n<br/>\nHope that helps</div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "12:26 AM - Mar 11, 2020",
      "content": "<div><em class=\"mention\">@Orion2019</em> has shrewd advice. As a frequent wizard player, I off-load heavy loot (armors, heavy weapons) at almost any merchant. Light weight, but valuable items, I'll retain to get a good price.<br/>\n<br/>\nUsing an item (like the 5x Cure Light Wounds potions) to gauge a merchant's pricing is highly advisable. I normally do this with an item I don't intend to sell or will always have in my inventory, and I do it with every merchant I come across. If the module justifies it, I even keep a written log of which merchant offered which price.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:04 AM - Mar 11, 2020",
      "content": "<div>I normally do the Moathouse solo, so...YMMV.<br/>\n<br/>\nFact is, if one does everything in the Moathouse, one should be sitting on ~ 30k of gold.<br/>\n<br/>\nOne can take Orion's advice and sell at merchants that are more forgiving - I look for a more different attribute when selecting merchants, but then, that is just my preference (and I know the server well, so I can afford to do this).<br/>\n<details><summary>Spoiler</summary>There are 6 Merchants in Hommlet - some are *locked* behind class/religion.\n</details>\nYou will find that right outside of Hommlet, there are...challenges.  I would suggest one investigate them.  At the level that your character is at, they should not be too difficult.<br/>\n<br/>\nI would also suggest <a class=\"postlink\" href=\"http://greyhawkonline.com/ghmaps/\" rel=\"noreferrer\" target=\"_blank\">http://greyhawkonline.com/ghmaps/</a> for your navigation needs.<br/>\n<br/>\nI think after you get your \"PW legs\", you will return to this thread and see the humor in it.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "8:38 AM - Mar 12, 2020",
      "content": "<div>FINALLY found some decent magical gear, and magical +1, +2 weapons.<br/>\n<br/>\nWas beginning to wonder if Wog had any magical weapons, even a lowly +1 dagger, etc.<br/>\n<br/>\nI had shopped at 4 merchants in Hommlet. No magical weapons.<br/>\n<br/>\nThen went to Nulb, and shopped at Mother Screngs, and Otis the Smith merchants. Still no magic weapons.<br/>\n<br/>\nCouldnt either figure out or get into the black market at Nulb, that may or may not have had magic weapons.<br/>\n<br/>\nAlso wondered if it was just the 1.69 version of the mod, that there was bugs, glitches, prevent8ng finding, getting, buying +1 weapons, etc, as I tried to go to Verbonc, but the area was not finished.<br/>\n<br/>\nThen I went all the way from Hommlet to the City of Greyhawk area, and FINALLY found decent magical gear, magic weapons(even a +2 Scimitar).<br/>\n<br/>\nMy personal record for length of time, and highest level without at least a +1 magical weapon, even if only a +1 dagger, was level 9 in a Darksun game, where you made a character tree of 10 to 100 characters(Thats how tough the game was(most of the characters died as gladiatorial slaves in the Arena).<br/>\n<br/>\nAt the time I finally found a magical weapon, my character was 8th level, almost 9th level.<br/>\n<br/>\nSo I almost tied my record in the Darksun game.<br/>\n<br/>\nIt shouldnt take 8 levels to find, get a magical weapon.<br/>\n<br/>\nI know some of you, think that's on me, and on my lack of knowledge about the PW.<br/>\n<br/>\nAnd perhaps that's right. But even if that's right a mod, PW, should still provide magic weapons, that are easy enough to find, buy, by 8th level, provided the player at least tries, isnt lazy, isnt silly, semi earns it, etc, even if the player lacks knowledge about the PW.<br/>\n<br/>\nThis is the 1st Mid, PW, out of All the many ones, I have played, that has had me not find, get, buy, etc, a magical weapon until 8th level.<br/>\n<br/>\nHeck even BSK with a reputation as a challenging PW, like unto Wog, can easily find, get, buy a magical weapon by levels 1 to 4.<br/>\n<br/>\nBut as crazy as it is, was, not finding a magic weapon until 8th level is, was, it is, was what it is, was.<br/>\n<br/>\nMoving on.<br/>\n<br/>\nFinished getting gear, spending gold. 5k gp left.<br/>\n<br/>\nOn my way to Temple of Elemental Evil.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:48 AM - Mar 12, 2020",
      "content": "<div>Hail Asturonethoriusaline<br/>\nAt least on the PW server If you have a weapon focus, you can find at least three +1 weapons and one +2 weapon from a Moathouse run, if not perhaps one +1 weapon and one +2 weapon, it was designed for parties in mind which is the explanation for the number of weapons.<br/>\nYou may find <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/\" rel=\"noreferrer\" target=\"_blank\">this forum</a> helpful as well</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "9:15 AM - Mar 12, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10759084&amp;sid=4687c6b30a7979e6c66b1fe7bf6a3dde\">Orion2019</a> wrote: <div class=\"responsive-hide\">Mar 12, 2020</div></cite>Hail Asturonethoriusaline<br/>\nAt least on the PW server If you have a weapon focus, you can find at least three +1 weapons and one +2 weapon from a Moathouse run, if not perhaps one +1 weapon and one +2 weapon, it was designed for parties in mind which is the explanation for the number of weapons.<br/>\nYou may find <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/\" rel=\"noreferrer\" target=\"_blank\">this forum</a> helpful as well</div></blockquote>\n\nI did the Moathouse.<br/>\n<br/>\nThere might have been some areas I might have missed, etc.<br/>\n<br/>\nBut I killed, looted the following:<br/>\n<br/>\n1. Frogs, Spiders(Outside the Moathouse<br/>\n<br/>\n2. Lizard<br/>\n<br/>\n3. Rats<br/>\n<br/>\n4. Brigands.<br/>\n<br/>\n5. 1st level of Moathouse<br/>\n<br/>\n6. Looted all corpses, chest, barrels, bookstacks, etc <br/>\n<br/>\n7. Green Slime<br/>\n<br/>\n8. Lubash<br/>\n<br/>\n9. Ghouls<br/>\n<br/>\n10. Undead.<br/>\n<br/>\n11. Gnolls.<br/>\n<br/>\n12. Octugyh(or however you spell it(big thing with tentacles)<br/>\n<br/>\n13. Bugbears<br/>\n<br/>\n14. More Brigands<br/>\n<br/>\n15. Larreth<br/>\n<br/>\n16 2nd level<br/>\n<br/>\n17. 3rd level.<br/>\n<br/>\n18. Catacombs<br/>\n<br/>\n19. All chest, corpses, barrels, graves, bookshelves.<br/>\n<br/>\nOnly place that found magic weapons was Larreth.<br/>\n<br/>\nA. No magic weapons 1st time killing Larreth.<br/>\n<br/>\nB. Only a +1 magical staff the 2nd time killing Larreth.<br/>\n<br/>\nC. A +1 staff, +1 sickle the 3rd time killing Larreth.<br/>\n<br/>\nNote, <br/>\n<br/>\nI didnt fight Larreth again, until AFTER i had gotten to 8th level, and had found magic weapons in the city of Greyhawk Area.<br/>\n<br/>\nI needed some gold to be able to buy both the Amulet of Wisdom and the +2 Scimitar, and the Helmet of Wisdom, so I decided to Kill Larreth 2 more times to get enough gold to buy the amulet of wisdom, and the +2 scimitars, and the Helmet of Wisdom in the Geyhawk area. That's when, how I found a +1 staff, +1 sickle, killing Larreth. I didnt get any magical weapons the first time killing Larreth, which was just probably bad luck, bad drop, and that if I had had good luck, and a good drop the first time killing Larreth, I probably would have gotten magical weapons the first time killing Larreth, before level 8.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:09 PM - Mar 12, 2020",
      "content": "<div>First of all, massive spoilers in this thread!!!!!!<br/>\n<br/>\nPlease fix.<br/>\n<br/>\nYou are ABSOLUTELY right - for the unknowing, hapless newbie, there is a dearth of magical items available <em>in beginning shops!</em><br/>\n<br/>\nAs you found out, you had to travel to GH City to find a merchant who sells such (and they are mostly paltry +1 to +2 in nature).<br/>\n<br/>\nThis is mostly due to the nature of the Server - low to mid magic at the highest levels.  So think of it like this :<br/>\n<br/>\nLevels 1 - 10 +1~+2<br/>\nLevels 11 - 20 +3~+4<br/>\nLevels 21 to 30 +5<br/>\nLevels 30+ +5~+6<br/>\n<br/>\nNote this is a rough estimate.<br/>\n<br/>\nSo beginning areas really should not have any magical items like +1 etc.  They have expendables like potions, wands, scrolls, instead.  This really means that being decked out in full plate with a shield makes you a pretty massive, impenetrable tank!  At least in beginning areas. Equivalent AC from other sources have the same effect.<br/>\n<br/>\nThis is why I mentioned you will look back on this later, after you get to know the Server, and see the humor in your post.  I think all newbies (me included) go through this type of \"item shock\" - because we have been \"trained\" by the OCs and other Mods, PWs, etc that have high magic environments that we come to depend on this.<br/>\n<br/>\nThus, we unlearn (or fail to learn) how to utilize character abilities, armor, potions, scrolls, wands, etc to their full extent, especially at beginning levels when we are really squishy (though WoG also has some rude surprises for high levels as well).<br/>\n<br/>\nWoG cures you of this deficit. <br/>\n<br/>\nAlso, many (a lot) of PWs frown on, and even prohibit, luring individual monsters from a group away and slaying them.  On WoG, it is almost a solo players only remedy. <br/>\n<br/>\nI will say this - when (if) you master WoG, you will find on many PWs that the challenge is gone.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "12:50 PM - Mar 12, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10759110&amp;sid=4687c6b30a7979e6c66b1fe7bf6a3dde\">webshaman1</a> wrote: <div class=\"responsive-hide\">Mar 12, 2020</div></cite>First of all, massive spoilers in this thread!!!!!!<br/>\n<br/>\nPlease fix.<br/>\n<br/>\nYou are ABSOLUTELY right - for the unknowing, hapless newbie, there is a dearth of magical items available <em>in beginning shops!</em><br/>\n<br/>\nAs you found out, you had to travel to GH City to find a merchant who sells such (and they are mostly paltry +1 to +2 in nature).<br/>\n<br/>\nThis is mostly due to the nature of the Server - low to mid magic at the highest levels.  So think of it like this :<br/>\n<br/>\nLevels 1 - 10 +1~+2<br/>\nLevels 11 - 20 +3~+4<br/>\nLevels 21 to 30 +5<br/>\nLevels 30+ +5~+6<br/>\n<br/>\nNote this is a rough estimate.<br/>\n<br/>\nSo beginning areas really should not have any magical items like +1 etc.  They have expendables like potions, wands, scrolls, instead.  This really means that being decked out in full plate with a shield makes you a pretty massive, impenetrable tank!  At least in beginning areas. Equivalent AC from other sources have the same effect.<br/>\n<br/>\nThis is why I mentioned you will look back on this later, after you get to know the Server, and see the humor in your post.  I think all newbies (me included) go through this type of \"item shock\" - because we have been \"trained\" by the OCs and other Mods, PWs, etc that have high magic environments that we come to depend on this.<br/>\n<br/>\nThus, we unlearn (or fail to learn) how to utilize character abilities, armor, potions, scrolls, wands, etc to their full extent, especially at beginning levels when we are really squishy (though WoG also has some rude surprises for high levels as well).<br/>\n<br/>\nWoG cures you of this deficit. <br/>\n<br/>\nAlso, many (a lot) of PWs frown on, and even prohibit, luring individual monsters from a group away and slaying them.  On WoG, it is almost a solo players only remedy. <br/>\n<br/>\nI will say this - when (if) you master WoG, you will find on many PWs that the challenge is gone.</div></blockquote>\n\nBSK, is comparable to Wog. Yes it is higher magic, up to +7,+8,+9 items at 40th level.<br/>\n<br/>\nYeah you can buy +1 items in beginning shops, but the selection is not good, and the items are still quite pricey, and you have to EARN the gold to buy the items.<br/>\n<br/>\nAnd even tho higher magic, you have to play well, because if you dont, the PW does a extremely good job throwing CHALLENGING stuff at you.<br/>\n<br/>\nArkhalia is another one. It even says that even tho it has high magic items, that without a minimum AB of 65 to 70, and OPTIMIZED builds at levels 30 to 40, your toast.<br/>\n<br/>\nThe PW has +1 items in beginning shops, but again you have to EARN the gold to buy them, and again the selection isnt good. And to find, get, buy better items, you have to go thru tough areas, dungeons, an or get to cities, towns, a long ways away, that are quite hard to get to.(Example Dener, you have to get thru Umber Hulks, and hordes of intellect devourers, just to get to Dener and either have a better selection of +1,+2 items, an or have a limited selection of +3,+4,+5 items.)<br/>\n<br/>\nThen there are Mods like:<br/>\n<br/>\nLord of Terror, Diablo Campaign<br/>\n<br/>\nEye of the Beholder<br/>\n<br/>\nPools of Radiance, Ruins of Myth Drannor.<br/>\n<br/>\nThose PW's, Mods are quite comparable to Wog, difficulty wise, with the exception being magic gear.<br/>\n<br/>\nBut other then those that I named and maybe a couple others, etc, your right that a lot, most PW's, Mods, are pretty easy, comparatively to WOG.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:38 PM - Mar 12, 2020",
      "content": "<div>Been there.<br/>\n<br/>\nDone all that.<br/>\n<br/>\nPlayed Eye of the Beholder as it was first released. Very well done Mod, I might add.<br/>\n<br/>\nPools of Radiance, Ruins of Myth Drannor - played them as well (and I also played the boxed versions, way back then from Pools of Radiance). Ruins of Myth Drannor I played as well in its UbiSoft form (what a piece of crud!)<br/>\n<br/>\nI have been playing NWN since it came out, I have run PWs, created my own, and been playing D&amp;D since '80.<br/>\n<br/>\nAnd despite everything you have posted, you will find out that WoG is quite the challenge solo.  Even parties tend to bite off more than they can chew and end up TPKed.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "4:15 PM - Mar 12, 2020",
      "content": "<div>I haven't played on WoG but I do play on BSK, and in my opinion it's not really a challenging server. Other than the high end PvM boss runs (which are designed for parties), pretty much everything can be soloed by a decent build without even using forged gear. If you do have access to forged gear or mules then even mediocre builds can solo to level 40, although depending on how mediocre the build is they might struggle with a few areas.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "4:20 PM - Mar 12, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10759110&amp;sid=4687c6b30a7979e6c66b1fe7bf6a3dde\">webshaman1</a> wrote: <div class=\"responsive-hide\">Mar 12, 2020</div></cite>Been there.<br/>\n<br/>\nDone all that.<br/>\n<br/>\nPlayed Eye of the Beholder as it was first released. Very well done Mod, I might add.<br/>\n<br/>\nPools of Radiance, Ruins of Myth Drannor - played them as well (and I also played the boxed versions, way back then from Pools of Radiance). Ruins of Myth Drannor I played as well in its UbiSoft form (what a piece of crud!)<br/>\n<br/>\nI have been playing NWN since it came out, I have run PWs, created my own, and been playing D&amp;D since '80.<br/>\n<br/>\nAnd despite everything you have posted, you will find out that WoG is quite the challenge solo.  Even parties tend to bite off more than they can chew and end up TPKed.</div></blockquote>\n\nThat's nice about your background.<br/>\n<br/>\nI never said that WOG wasnt tough. I just saying WOG isnt the TOUGHEST Mod, PW.<br/>\n<br/>\nIt is ONE of the TOUGHEST tho.<br/>\n<br/>\nAlso despite you having that nice background, that would seem to give you the credibility to seemingly say that there is nothing wrong with a Mod, PW like WOG not getting a magical weapon, even a +1 dagger, until 8th lev, that it is wrong to not get a magical weapon until level 8, whether in WOG or any other Mod, PW.<br/>\n<br/>\nAnd btw my background is:<br/>\n<br/>\nI have played D&amp;D since 1983.<br/>\n<br/>\nI have DM'ed for about 13 to 23 years.<br/>\n<br/>\nI have created my own gameworld.<br/>\n<br/>\nCreated my own game system that is based off a D100, percentile system that is different then the D100, Percentile system game system.<br/>\n<br/>\nWas a admin, helped run the Knights of Camelot MUD(Multi User Dungeon(A text version of a online D&amp;D like game)<br/>\n<br/>\nHave played in both the Pen and Paper, computer games:<br/>\n<br/>\nRod of Seven Parts<br/>\n<br/>\nTomb of Horror<br/>\n<br/>\nNight Below<br/>\n<br/>\nDragon Mountain<br/>\n<br/>\nWhite Plume Mountain<br/>\n<br/>\nUndermountain<br/>\n<br/>\nImmortal Rules.<br/>\n<br/>\nLevel 60+ games.<br/>\n<br/>\nAnd I have DM ed those games<br/>\n<br/>\nAnd not just home games, but have DM ed those games at Conventions<br/>\n<br/>\nHave a D&amp;D character that is Bard 20/Mage 20, Cleric 20, Rogue 20, and a 80th level character.<br/>\n<br/>\nFought/Won:<br/>\n<br/>\nPrismatic Dragon(about 20th level)<br/>\n<br/>\nAstral Dreadnought(25th level)<br/>\n<br/>\n2000 Death Slaad(level 9)<br/>\n<br/>\nStorm Giants<br/>\n<br/>\nTerrasque(Level 18, (Lost a arm, leg, hand)<br/>\n<br/>\nForgotten Realms, and Greyhawk Deities.<br/>\n<br/>\nCthulu monsters.<br/>\n<br/>\nOld Elder Ones from the immortal rules campaign.<br/>\n<br/>\nA 3000 power point, Psionics, Immortal character(What fought the Cthulu monsters, Gods, Ancient Old Elder First Ones(Each had about 1000 to 3000 Powerpoints each.<br/>\n<br/>\n<br/>\nFirst got NWN in 2003.<br/>\n<br/>\nBeat the OC's<br/>\n<br/>\nHave beat mods, and 1 PW.<br/>\n<br/>\nPlayed beat:<br/>\n<br/>\n Tunnels of Doom.<br/>\n<br/>\nUltima <br/>\n<br/>\nFinal Fantasy<br/>\n<br/>\nBaldur's Gate<br/>\n<br/>\nBaldur's gate 2<br/>\n<br/>\nIcewind Dale 1 and 2<br/>\n<br/>\nPlanescape Torment.<br/>\n<br/>\nPool of Radiance<br/>\n<br/>\nPools of Darkness<br/>\n<br/>\nPools of Radiance Ruins of Myth Drannor.<br/>\n<br/>\nCurse of the Azure Bonds<br/>\n<br/>\nSecret of the Silver Blades.<br/>\n<br/>\nBard's Tale<br/>\n<br/>\nDungeon Master<br/>\n<br/>\nEye of Beholder<br/>\n<br/>\nMany more, cant remember everything.<br/>\n<br/>\nYou are more experienced then me in some of these areas, and I am more experienced in some of these areas.<br/>\n<br/>\nI am not posting this to get into a measuring contest.<br/>\n<br/>\nBut you put your background up to seemingly try to back up what you said.<br/>\n<br/>\nAnd so I am putting up my background, not to measure, compare, etc.<br/>\n<br/>\nBut to show that I really do have a pretty darn good idea of what is tough and what is not tough, and a good idea of, and what is balanced and what is not balanced.<br/>\n<br/>\nSo when I tell you that not getting even a +1 dagger or any magic weapon until 8th level is not right, and is wrong, and that the game should have +1 magic weapons available that you can get between levels 2,3,4, etc, and certainly before level 8, regardless whether your new, lack knowledge about the PW, etc, that I am right, and know what I am talking about.<br/>\n<br/>\nThe 3rd Edition of D&amp;D was designed in such a way that if you dont get magic weapons, before level 8, YOUR SUPPOSED TO BE SCREWED, unless your a Cleric, Druid, Wizard, Spell Caster, Psionicist, Pyschic Warrior, Soul Knife, Monk.etc<br/>\n<br/>\nNon Spellcaster Melee types are SUPPOSED TO BE SCREWED, if they dont have magic weapons, gear before level 8.<br/>\n<br/>\nFortunately I was playing a Monk/Druid/Shifter.<br/>\n<br/>\nBut what is done, happened, is what was done, happened.<br/>\n<br/>\nIt is what it is.<br/>\n<br/>\nTemple of Elemental Evil awaits.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:38 PM - Mar 12, 2020",
      "content": "<div><blockquote><div><cite>Asturonethoriusaline wrote: <div class=\"responsive-hide\">Mar 12, 2020</div></cite>Non Spellcaster Melee types are SUPPOSED TO BE SCREWED, if they dont have magic weapons, gear before level 8.<br/>\n<br/>\nFortunately I was playing a Monk/Druid/Shifter.</div></blockquote>\nThere is <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/introductions-f12/\" rel=\"noreferrer\" target=\"_blank\">a forum to introduce yourself</a>, if desired try to keep such discussion there.<br/>\n<br/>\nThere is also a <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/world-of-greyhawk-t2274876-s210.html#p17824\" rel=\"noreferrer\" target=\"_blank\">WoG thread</a> too, at 212 posts long there might be a lot of content there you might be interested in reading there.<br/>\n<br/>\nI agree with you regarding magic weapons that for melee warriors without spell casting a +1 weapon before level 8 is a very noble goal.<br/>\n<br/>\nI am not 100% about the single player module, however I believe you will have \"weapon focus\" chests scripted into it, at least that is the way it is on the persistent world, and I am sure they were introduced a long time ago.<br/>\n<br/>\nThese are chest which check the person or party opening the chest for weapon focuses and randomly generate an appropriate magic weapon based on the number of weapon focuses.<br/>\n<br/>\nSo if your druid had Weapon Focus: Scimitar, then a +1 scimitar would have spawned in one of the weapon focus chests (there *could* be more than one in Moathouse). I suspect your druid/shifter/monk would have no reason to take weapon focus feats and therefore your magic weapon yield was much lower as a result.<br/>\n<br/>\nBut if you played a pure fighter with a weapon focus, those chests would have provided you a level appropriate magic weapon.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "3:45 AM - Aug 10, 2020",
      "content": "<div>Update:<br/>\n<br/>\nI had a smart phone problem, so got a tablet. I then tried to move my SD card and all my NVWN stuff to the tablet.<br/>\n<br/>\nThe tablet wouldnt take the SD unless I formatted it wiping content.<br/>\n<br/>\nSo put the contents of the SD card on a laptop PC.<br/>\n<br/>\nThen formatted the SD card. Then the Tablet used the SD card. Then tried to put the NWN stuff on the PC laptop back onto the SD card in, on the tablet.<br/>\n<br/>\nThat didnt work, so the NWN stuff is on PC with no way to put it on a SD card to be used on either Tablet or Smartphone.<br/>\n<br/>\nThen found out that even tho all the other Beamdog games run on the tablet like Icewind Dale, etc. NWN is not working on the Tablet.<br/>\n<br/>\nSo I got smart phone working again, and put NWN back on Smartphone, but cant get the NWN stuff back from PC.<br/>\n<br/>\nSo have to start over.<br/>\n<br/>\nOne good silver lining thing:<br/>\n<br/>\nGot access back to all the PW's that wete greyed out, that used to be blue, but then got greyed out, and are now working again.<br/>\n<br/>\nAlso can reinstall the CEP, and the single player mods like Raines WOG.<br/>\n<br/>\nAlso just bought a XBox One, and I can put NWN on it.<br/>\n<br/>\nBut question is it worth it to put NWN on the XBox One, when have it on my Smartphone.<br/>\n<br/>\nAlso if put it on Xbox, would I be able to play the PW's, mods like WOG on the Xbox, thru Xbox live??<br/>\n<br/>\nAt the very least I can play the mods, PW's on my smartphone.</div>"
    }
  ]
}