{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "506",
  "name": "18 Rogue/ 9 Cleric/ 3 Monk ARELITH",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/18-rogue-9-cleric-3-monk-arelith-t515499.html",
  "author": "NwnwhiteBoy",
  "avatar": "no_avatar.png",
  "replies": "67",
  "views": "4.5K",
  "posts": [
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "8:56 AM - Oct 05, 2011",
      "content": "<div>Came up with this idea for a ranged Assassin type, It's been made fore the RP server Arelith which has some of its on rules. I know there is a MASSIVE XP penalty but, doesn't really bother me that much.. I don't think...<br/>\n<span style=\"color:#FF0000\">Arelith building rules:</span> 1) <span style=\"color:#FF40FF\"><strong>Server cap is level 30.</strong></span><br/>\n2) When taking a class for the first time must have at least 3 levels of it in a row, after that class has 3 levels in it you can dump sigular levels of that class anywhere, also you cant finish with less than 3    levels in a class. <br/>\n3) Hip's has been disabled. <br/>\n4) Prestige Class Requirements. The following is a list of Prestige Classes and the RPRating requirements needed to acquire them. In addition to the mechanical requirements, players will also need DM approval and possibly the completion of a DM quest before levels in the class can be taken.<br/>\nMechanical requirements listed (e.g. BAB or skills) are valid for basic values, which don't include bonuses from ability modifiers or items. Modifiers to abilities from subraces are valid for feats and other requirements after subrace selection. (On level 1 you will have only modifiers from your base race.)<br/>\nTo apply for a Prestige Class token, please contact DMs in game, via the DM channel.<br/>\nNotes<br/>\nAnyone wishing to take multiple prestige classes needs an RPRating of at least 20.<br/>\nGetting a prestige class token from a DM does not mean you have to use it right away. Letting the DMs know you want a token before you can mechanically take the class gives them time to pull together a quest for your character and discuss their approval of your concept.<br/>\n<br/>\nMy current RPR is 10 so if you need to know if I can get multiple PC. And note that Arelith has very slow levelling, so the character can not be useless while you are levelling.<br/>\n<br/>\nAlso if you want to know any spell changes: <a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Groups_of_spells\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Spell_changes#Groups_of_spells</a> There are stacking things for weapons and such as well as individual spell changes incase needed.<br/>\n<br/>\n<br/>\nRogue(18), Cleric(9), Monk(3), Elf<br/>\n<br/>\nSTR: 8<br/>\nDEX: 20 (26)<br/>\nCON: 6<br/>\nWIS: 16<br/>\nINT: 12 (13)<br/>\nCHA: 8<br/>\n<br/>\nElf: (Hardiness vs. Enchantments, Keen Sense, Low-light Vision, Skill Affinity: Listen, Skill Affinity: Search, Skill Affinity: Spot, Sleeplessness)<br/>\n01: Rogue(1): Weapon Focus: Longbow<br/>\n02: Rogue(2): {Evasion}<br/>\n03: Rogue(3): Point Blank Shot, {Uncanny Dodge I}<br/>\n04: Rogue(4): INT+1, (INT=13)<br/>\n05: Rogue(5)<br/>\n06: Rogue(6): Dodge<br/>\n07: Rogue(7)<br/>\n08: Monk(1): DEX+1, {Cleave, Improved Unarmed Strike, Stunning Fist}, (DEX=21)<br/>\n09: Monk(2): Mobility, {Deflect Arrows}<br/>\n10: Monk(3)<br/>\n11: Cleric(1): Domain Trickery, Domain War<br/>\n12: Cleric(2): DEX+1, Rapid Shot, (DEX=22)<br/>\n13: Cleric(3)<br/>\n14: Cleric(4)<br/>\n15: Cleric(5): Expertise<br/>\n16: Cleric(6): DEX+1, (DEX=23)<br/>\n17: Cleric(7)<br/>\n18: Cleric(8): Improved Expertise<br/>\n19: Cleric(9)<br/>\n20: Rogue(8): DEX+1, (DEX=24)<br/>\n21: Rogue(9): Epic Skill Focus: Hide<br/>\n22: Rogue(10): Defensive Roll<br/>\n23: Rogue(11)<br/>\n24: Rogue(12): DEX+1, Epic Skill Focus: Move Silently, (DEX=25)<br/>\n25: Rogue(13): Improved Evasion<br/>\n26: Rogue(14)<br/>\n27: Rogue(15): Improved Sneak Attack I<br/>\n28: Rogue(16): DEX+1, Epic Dodge, (DEX=26)<br/>\n29: Rogue(17)<br/>\n30: Rogue(18): Improved Sneak Attack II<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nHitpoints: 144<br/>\nSkillpoints: 231<br/>\nSaving Throws (Fortitude/Will/Reflex): 14/19/25<br/>\nSaving Throw bonuses: Spells: +4, Mind Effects: +4, Traps: +4<br/>\nBAB: 19<br/>\nAB (max, naked): 18 (melee), 28 (ranged)<br/>\nAC (naked/mundane armor/shield only): 27/28<br/>\nSpell Casting: Cleric(5)<br/>\nAlignment Changes: 0<br/>\n<br/>\nBluff 33(32), Heal 27(30), Hide 33(51), Move Silently 33(51), Set Trap 12(20), Spellcraft 19(20), Spot 21(26), Tumble 32(40), UMD 21(20)<br/>\n<br/>\n<br/>\n01: Bluff(4), Heal(1), Hide(4), Move Silently(4), Spot(4), Tumble(4), UMD(4), Save(11), <br/>\n02: Bluff(1), Heal(1), Hide(1), Move Silently(1), Spot(1), Tumble(1), UMD(1), Save(13), <br/>\n03: Bluff(1), Heal(1), Hide(1), Move Silently(1), Spot(1), Tumble(1), UMD(1), Save(15), <br/>\n04: Bluff(1), Heal(1), Hide(1), Move Silently(1), Spot(1), Tumble(1), UMD(1), Save(17), <br/>\n05: Bluff(1), Heal(1), Hide(1), Move Silently(1), Spot(1), Tumble(1), UMD(1), Save(19), <br/>\n06: Bluff(1), Heal(1), Hide(1), Move Silently(1), Spot(1), Tumble(1), UMD(1), Save(21), <br/>\n07: Bluff(1), Heal(1), Hide(1), Move Silently(1), Spot(1), Tumble(1), UMD(1), Save(23), <br/>\n08: Heal(1), Hide(1), Move Silently(1), Tumble(1), Save(24), <br/>\n09: Heal(1), Hide(1), Move Silently(1), Tumble(1), Save(25), <br/>\n10: Heal(1), Hide(1), Move Silently(1), Tumble(1), Save(26), <br/>\n11: Heal(1), Spellcraft(11), Save(17), <br/>\n12: Heal(1), Spellcraft(2), Save(17), <br/>\n13: Heal(1), Spellcraft(1), Save(18), <br/>\n14: Heal(1), Spellcraft(1), Save(19), <br/>\n15: Heal(1), Spellcraft(1), Save(20), <br/>\n16: Heal(1), Spellcraft(1), Save(21), <br/>\n17: Heal(1), Spellcraft(1), Save(22), <br/>\n18: Heal(1), Spellcraft(1), Save(23), <br/>\n19: Save(26), <br/>\n20: Bluff(4), Hide(10), Move Silently(10), Spot(1), Tumble(9), UMD(1), <br/>\n21: Bluff(2), Heal(1), Hide(1), Move Silently(1), Set Trap(1), Spot(1), Tumble(1), UMD(1), <br/>\n22: Bluff(2), Heal(1), Hide(1), Move Silently(1), Set Trap(1), Spot(1), Tumble(1), UMD(1), <br/>\n23: Bluff(2), Heal(1), Hide(1), Move Silently(1), Set Trap(1), Spot(1), Tumble(1), UMD(1), <br/>\n24: Bluff(2), Heal(1), Hide(1), Move Silently(1), Set Trap(1), Spot(1), Tumble(1), UMD(1), <br/>\n25: Bluff(2), Heal(1), Hide(1), Move Silently(1), Set Trap(1), Spot(1), Tumble(1), UMD(1), <br/>\n26: Bluff(2), Heal(1), Hide(1), Move Silently(1), Set Trap(1), Spot(1), Tumble(1), UMD(1), <br/>\n27: Bluff(2), Heal(1), Hide(1), Move Silently(1), Set Trap(1), Spot(1), Tumble(1), UMD(1), <br/>\n28: Bluff(2), Heal(1), Hide(1), Move Silently(1), Set Trap(1), Spot(1), Tumble(1), UMD(1), <br/>\n29: Bluff(2), Heal(1), Hide(1), Move Silently(1), Set Trap(1), Spot(1), Tumble(1), UMD(1), <br/>\n30: Bluff(1), Hide(1), Move Silently(1), Set Trap(3), Spot(1), Tumble(1), UMD(1),<br/>\n<br/>\n<br/>\n<br/>\nThis is what I'v come up with, please feed back. <br/>\nThanks for looking.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "9:45 AM - Oct 05, 2011",
      "content": "<div>Forgot to add, Weapon is Longbow, and will be in robes, of course.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:51 AM - Oct 05, 2011",
      "content": "<div><blockquote><div><strong>NwnwhiteBoy wrote:</strong>Rogue(18), Cleric(9), Monk(3), Elf<br/>\n<br/>\nSTR: 8<br/>\nDEX: 20 (26)<br/>\nCON: 6<br/>\nWIS: 16<br/>\nINT: 12 (13)<br/>\nCHA: 8<br/>\n<br/>\nThis is what I'v come up with, please feed back. <br/>\nThanks for looking.</div></blockquote>\n\n1) Start with dex 19, int 13 and free up 2 ability points to spend at con, str or wherever you want. Take dex instead of int at lvl 4.<br/>\n2) Take class split rogue 16/ cleric 11/monk 3. You only need rogue 16 for epic dodge. With wis 16 you can go for level 6 spells with more cleric levels.<br/>\n3) take travel domain and get a boost to kiting speed with extended haste combined with monk speed (in robes).</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:05 PM - Oct 05, 2011",
      "content": "<div>You need Rogue 13 for ED mick, lvl 10 and 13 give 2 bonus feats. Now I think the best spread here would be Rogue 13 Cleric 12 Monk 5. The actual best spread would be Cleric 15 Rogue 13 Monk 2, but that is undoable for server rules as he needs at least 3 lvls of each class. Like I said in my guide, any build with less than 15 Cleric levels is not taking full advantage of the class, but I guess for lvl 30 cap there can be an exception...</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:43 PM - Oct 05, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong>You need Rogue 13 for ED mick</div></blockquote>\nHe takes def roll on rogue 10, improved evasion on rogue 13 and ED on rogue 16. You are right - he could take ED on a general feat if he would give up something else, like ISA.<br/>\nTaking Great wis (instead of the second ISA?) opens up for more cleric levels with higher level cleric spells. Cleric level 13 or 14 seems to be the max in this build with a wis of 17.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:51 PM - Oct 05, 2011",
      "content": "<div>On pre epic feat selection:<br/>\nWF Longbow, PBS, Rapid shot are all relevant to archery.<br/>\nI miss Blind fight, Called shot, Extend spell and Improved critical Longbow. I would even consider weapon finesse and toughness before dodge, movbility and the expertise feats if I had room for it.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "10:12 PM - Oct 05, 2011",
      "content": "<div><blockquote><div><strong>Mick Dagger wrote:</strong>On pre epic feat selection:<br/>\nWF Longbow, PBS, Rapid shot are all relevant to archery.<br/>\nI miss Blind fight, Called shot, Extend spell and Improved critical Longbow. I would even consider weapon finesse and toughness before dodge, movbility and the expertise feats if I had room for it.</div></blockquote>\nWell, this is being designed as a melee bowyer and therefore not subject to the same constraints as a normal archer i.e. value in Called Shot and less value in Blind Fight for a typical range toon.  I see a major problem doing that with a DEX build and no discipline.  IKD is going to be a problem.<br/>\n<br/>\nNow, though it states \"ranged\" it is really not ranged, strategically, by design.  If it were, there would be little benefit to all the dodge-type feats (including ED!) since a range attacker never (well, hardly ever) needs to concern itself with being flanked or caught flat-footed.  Not with leg shots and decent trap manipulation. So in this case, Blind Fight is a must (as is PBS) and the expertise feats are wasted while equipping a bow.  There isn't enough casting power to warrant expertise for THIS cleric unless trying to buff while in combat, a recipe for failure.  Offensive spells will be pitiful and not worth changing over to expertise to cast them.<br/>\n<br/>\nWith all that in mind, I am at a loss to understand the benefit of monk in this build at all.  Cleave is worthless with a bow. Evasion will be accrued by rogue.  Monk progression only works with kamas and unarmed.  So gaining +3 WIS AC &amp; +10% move speed is not worth mucking up a build which would be far superior just as Clc 17/Rog 13 or some similar split...  IMHO, naturally.<br/>\n<br/>\nAdd to that the missing Extend and Imp Crit feats mentioned and it could be made more effective than initially conceived.  Personally, I would dump elf unless it is some sort of RP value and use halfling to get the +AB &amp; +AC and other assassin-like racial boni and just take shortbow focus.  Perhaps there are some \"killer\" longbows available?  Dunno about that but seems elf adds little if anything.  The only detriment of significance of shortbow vs. longbow is that the shortie will be easier to disarm while in PBS range. <br/>\n<br/>\nthen again, perhaps there is something basic in the conceptualization that I am missing here.  It wouldn't be the first time.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "11:08 PM - Oct 05, 2011",
      "content": "<div>Slow leveling and a 40% XP penalty doesn't bother you much? It seems odd. I don't see cleric here doing much good in the build. I also see no EWF, nor EP which would help a lot AB wise (+3 AB is BIG). I see also no Crippling Strike, while ISA is selected twice.<br/>\n<br/>\nAnyhow, for a ranged non PrC \"assassin\" build I'd go with Rogue/FTR halfling slinger and I would keep some melee presence (WF/EWF short sword eg). Rogue 16/FTR 14 or somesuch should work fine. Epic Dodger of course.<br/>\n<br/>\nA Ranger with BoE and FE selected among the main humanoid races would work well too. Throw in some FTR and rogue to round it off (and depending on race possibly accept a XP penalty), maybe Ranger 21-23/FTR 4-6/Rogue 3. <br/>\n<br/>\nOr Monk 20/Rogue 10, which gets ED, uber speed (sweet kiting), mind immunity and undispellable concealment when things get hard not to mention a melee backup with monk attack progression, FoB, SF and a nice base damage output (1d20 at monk 16).<br/>\n<br/>\nJust a couple of ideas...</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "6:03 AM - Oct 06, 2011",
      "content": "<div>Wow, there are a tone of things I didn't think of, but I will try explain my thoughts as I was building this to see if what I was thinking was wrong <br/>\nFor Cleric it was for after looking over another post I discovered the cleric spell Divine power, thought this would boost AB and give extra attack?  Also I thought getting level 6 spells on cleric was no point because I thought non were any good...(unless you want heal or harm.) Also the Travel Domain I thought would be a waste because you can get Haste wands from other players and can brew pots of them as well.<br/>\nfor the expertise I thought because I'm going in close up having a +5 or 10 AC might be handy.. but I realize now that it will kill my chances at hitting anything!! longbow, well that's just because it does more damage.. and elf there is sort of some rp to it.<br/>\nMonk has the reason that i can get gloves boots belts and other equips with +1 DEX and WIS on them and you can get pots that increase WIS as well as Owls Wisdom. giving me more AC.. I don't know if this makes it pointless still but that was my thought on it.<br/>\nand epic dodge I thought would also help me out with the KD problem, because of missing the first attack the rest might not hit me much? maybe? extended spell Is seeming like a BIG loss!! so shell look more into that. and also the ability scores seems like such a stupid thing to miss on my part!<br/>\nAlso.. I have just realized it needs to be pretty strong between 13-20 because that is where most people are up to in level I believe.<br/>\n<br/>\nThanks for the input I this all has helped a a lot so far!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:10 PM - Oct 06, 2011",
      "content": "<div><blockquote><div><strong>NwnwhiteBoy wrote:</strong>Wow, there are a tone of things I didn't think of, but I will try explain my thoughts as I was building this to see if what I was thinking was wrong \n</div></blockquote>\nGet your pencil ready, there'll be a ton more! \n<blockquote><div>\nFor Cleric it was for after looking over another post I discovered the cleric spell Divine power, thought this would boost AB and give extra attack?  Also I thought getting level 6 spells on cleric was no point because I thought non were any good...(unless you want heal or harm.) Also the Travel Domain I thought would be a waste because you can get Haste wands from other players and can brew pots of them as well.</div></blockquote>\nDivine Power is surely a main benefit of the cleric casting repertoire.  Harm (neg energy against all non-undead) and Heal (pos energy against all undead) are serious boss killers and well worth having seeing as how neither allow a saving throw.  But Haste via items is extremely limited.  Duration is limited to 1 turn (10 rounds).  If that is satisfactory for your needs, then you can forgo the Travel domain.  Selecting that domain, however, allows a cleric to become hasted for a much longer duration.  For example, a level 15 cleric's haste spell would last 3 turns with an Extend Spell slot (level 6, btw  )... triple the duration from wands/potions/scrolls, a source which is ALWAYS easy to dispel.\n<blockquote><div>\nfor the expertise I thought because I'm going in close up having a +5 or 10 AC might be handy.. but I realize now that it will kill my chances at hitting anything!! \n</div></blockquote>\nGood.  You are catching on!  Besides, expertise/imp expertise are not selectable with any range weapon, like a bow, xbow, sling, darts, etc.  so you would need to swap out the bow during combat and go unarmed or with melee weapon.  Bad idea IMO.\n<blockquote><div>\nlongbow, well that's just because it does more damage.. and elf there is sort of some rp to it.\n</div></blockquote>\nWith cleric buffs especially, the 2 points base damage means very little.  You will be getting magical and divine damage from the buffs(both will critx3, btw).  What is more important is what kind of enhancements are available on them on your server.  For example, a shortbow with permahaste would be an automatic choice vs. a longbow with 2d6 acid damage/massive criticals.  Unfortunately, unless you have played a server a lot you wouldn't know what is available.  Also, the seeming puny damage of a sling is offset by its bludgeoning damage, a damage type that is least resisted and excellent against undead.  If you are set on elf, then that is what it must be as limiting as it may be to the build.\n<blockquote><div>\nMonk has the reason that i can get gloves boots belts and other equips with +1 DEX and WIS on them\n</div></blockquote>\nThat's what your rogue UMD is for! \n<blockquote><div>\n and you can get pots that increase WIS as well as Owls Wisdom. giving me more AC.. I don't know if this makes it pointless still but that was my thought on it.\n</div></blockquote>\nNot a bad idea.  Your cleric can cast Owl's itself (even empowered Owl's +3 WIS max with the feat!) so no need for pots.  But using an entire class to glean only a bit of AC will weaken your main class(es) too much IMO.  A typical cleric build is feat-starved so a class like fighter or CoT would help to grab some of the more important ones.  In this case, with only 3 monk levels and a bow, you'll be gaining no useful feat support from the class.\n<blockquote><div>\nand epic dodge I thought would also help me out with the KD problem, because of missing the first attack the rest might not hit me much? maybe? \n</div></blockquote>\nYes.  That's true.  But for a typical hasted fighter, that is 20% of the attacks.  What about those other 80%?  As soon as you are hit, you'll be laying prone since without a significant discipline investment you will lose all checks unless the attacker rolls a 1.  And the same goes for disarm (same check, I mean). High discipline (or extremely high AC) is the only reliable way to counter KD/IKD on every APR.  But a DEX build is not the best to reach adequate Disc level, though with DP, you'll be able to get your check number pretty high if the base skill could be maxed.  For example (not suggesting that it is a good idea in this build), if you took the 3 monk levels last you could reach a discipline check of at least 37 while DP was active... probably not bad for a level 30 server.\n<blockquote><div>\nextended spell Is seeming like a BIG loss!! so shell look more into that.\n</div></blockquote>\nExtend Spell makes all those round/level spells manageable even at relatively low caster levels.  It also neutralizes the benefits of items containing those same short-duration spells which can never be extended. The lower the caster level, the more important is Extend Spell.  Finally, all metamagic feats (like Extend Spell, Still Spell, Empower Spell, etc.) provide a certain amount of handy spell book management.\n<blockquote><div>\nAlso.. I have just realized it needs to be pretty strong between 13-20 because that is where most people are up to in level I believe.\n</div></blockquote>\nThat's also good to know from a building perspective.  It could affect how long you have to delay dumps and feat selection if that is the case.<br/>\n<br/>\nStay tuned.  This is a community filled with experienced folks who have played on diverse environments, enough to keep you pointed in the right direction!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:26 AM - Oct 07, 2011",
      "content": "<div>OK now, so much needs to be said in so little time. I am exhausted so I will be brief.<br/>\n<br/>\n@ NWN Whiteboy<br/>\n<br/>\n<br/>\n9 Cleric levels only is HORRIBLE! You need to aim for 15, but with the enormous restrictions from your server, not even that is possible. It's not that the next spell levels will bring you more buffs, its that THE ONES YOU ALREADY HAVE WILL CONTINUE TO GROW UNTIL CLERIC 15. As an example, you have the following buffs:<br/>\n<br/>\nDivine Favor, Magic Vestment, Shield of Faith, Greater Magic Weapon.<br/>\n<br/>\nALL OF THESE BUFFS GAIN INCREASES at Cleric 12. Now since you are a Cleric, your combat prowess comes from your buffs, without them you are worthless. So a buffed 12th level Cleric will have +2 AC and +2 AB compared to your build. If you go Cleric 15, it's +4 AB and +4 AC compared to yours. We're talking buffed, of course. <br/>\n<br/>\nRead my guide, mate, so you can understand better.<br/>\n<br/>\nNow if you want Epic Dodge in this class combo, the best spread in Arelith rules is Cleric 12 Rogue 13 Monk 5. That way you can take all 3 Monk levels in a row and still have 2 extra skill dumps later on. I'd go Cleric 12 Rogue 4 Monk 4 pre-epic and forget about spellcraft. <br/>\n<br/>\nDEX-heavy Cleric / Monks have TONS OF AC, so forget about Discipline. Take Trickery and Travel (+4 buffed AC from Haste), +50% concealment from Improved Invisibility.<br/>\n<br/>\nFinally, Epic Dodge is best for '1 on 1 situations, while concealment is for when you're surrounded. If you think you can let go of Rogue, then you can make a much stronger more cleric-heavy toon. A cleric 16 Monk 9 SD 5 would be much more powerful because of Cleric buff increases and HiPS, plus you can still take Epic Dodge as long as you take SD or Monk 9 on that last level. The only things you forfeit is Sneak Attack and UMD.<br/>\n<br/>\nI`m too tired to continue now, sorry. Hopw you find the info useful.<br/>\n<br/>\nLater!</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "1:41 AM - Oct 07, 2011",
      "content": "<div>To further explore the <strong>Monk 20/Rogue 10</strong> idea consider a halfling with Str 10 Dex 18 Con 14 Int 12 Wis 14 Cha 8, getting PBS, RS, WF: thrown weapon (shuriken/dart/sling), Called Shot, Blind Fight, Weapon Finesse, IC preepic with a Monk 12/Rogue 8 split and then EWF, AS (or EP), Great Dex, Epic Dodge and Defensive Roll in epic with all ability increases given to Dex. Start as a rogue for UMD immediately and extra skillpoints. Skillpoints spent on Set/Disable Trap, Tumble, UMD, Search, MS, Hide. Ends with a 33 ranged AB, 29 melee if AS is selected in epic +1 if instead EP is taken, AC is 33 or 31 if EP is selected instead of AS, HP 280, all useful skills are in, you get +60% speed (which \"stacks\" with haste in a peculiar way as can be seen <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Talk:Monk\" rel=\"noreferrer\" target=\"_blank\">here</a> under \"Formula\" heading), mind immunity, a 2x/day and 20 rounds long undispellable concealment effect, a useful 30 SR, an always handy +5d6 SA, Epic Dodge, obviously Improved Evasion, a not bad melee option with 20 SFs a day, etc. and no XP penalty.<br/>\n<br/>\nIt can be played as a ninja like \"assassin\" if desired.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "1:46 AM - Oct 07, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nNow if you want Epic Dodge in this class combo, the best spread in Arelith rules is Cleric 12 Rogue 13 Monk 5. That way you can take all 3 Monk levels in a row and still have 2 extra skill dumps later on.</div></blockquote>What for? ED comes at lvl 27 if not 30 so no need for a secondary tumble class dump and discipline in a dex build is kinda meh (and you yourself say to forget about it). The extra AC (+1) is worth lvl 7 spells, extra caster levels and extra spell slots?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:55 AM - Oct 07, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong> A cleric 16 Monk 9 SD 5 would be much more powerful because of Cleric buff increases and HiPS, plus you can still take Epic Dodge as long as you take SD or Monk 9 on that last level. The only things you forfeit is Sneak Attack and UMD.\n</div></blockquote>\nAccording to the OP, HiPS has been nerfed on Arelith.\n<blockquote><div><strong>NwnwhiteBoy wrote:</strong>(3) Hip's has been disabled. </div></blockquote>\nDon't think he was referring to me, although I am not moving as fast as I was 10 years ago.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:02 AM - Oct 07, 2011",
      "content": "<div><blockquote><div><strong>KailPendragon wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nNow if you want Epic Dodge in this class combo, the best spread in Arelith rules is Cleric 12 Rogue 13 Monk 5. That way you can take all 3 Monk levels in a row and still have 2 extra skill dumps later on.</div></blockquote>What for? ED comes at lvl 27 if not 30 so no need for a secondary tumble class dump and discipline in a dex build is kinda meh (and you yourself say to forget about it). The extra AC (+1) is worth lvl 7 spells, extra caster levels and extra spell slots?</div></blockquote>\n\nHe needs 3 monk levels straight for the way the server works. What are you suggesting? Cleric 13 Monk 4 Rogue 13 or Cleric 14 Monk 3 Rogue 13? Either is fine, but Level 7 spells also mean 17 Wisdom, whereas this one can live with just 16 and still be pretty effective. I'd go for 15 Cleric, but the way Arelith is scripted, he can't with this class combo without dropping ED. Between Cleric 14 and Cleric 12, not much difference IMO. But you can puzzle yourself into squeezing the extra Wisdom for more spells. If you manage to do it without hurting the build, then it's a good alternative.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:04 AM - Oct 07, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong> A cleric 16 Monk 9 SD 5 would be much more powerful because of Cleric buff increases and HiPS, plus you can still take Epic Dodge as long as you take SD or Monk 9 on that last level. The only things you forfeit is Sneak Attack and UMD.\n</div></blockquote>\nAccording to the OP, HiPS has been nerfed on Arelith.\n<blockquote><div><strong>NwnwhiteBoy wrote:</strong>(3) Hip's has been disabled. </div></blockquote>\nDon't think he was referring to me, although I am not moving as fast as I was 10 years ago. </div></blockquote>\n\nLOL, good one mate! I am just too tired to notice that. Sorry for the Brain Fart!! <br/>\n<br/>\nNow still a pretty good combo without HiPS, but no style points..</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "2:58 AM - Oct 07, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><blockquote><div><strong>KailPendragon wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nNow if you want Epic Dodge in this class combo, the best spread in Arelith rules is Cleric 12 Rogue 13 Monk 5. That way you can take all 3 Monk levels in a row and still have 2 extra skill dumps later on.</div></blockquote>What for? ED comes at lvl 27 if not 30 so no need for a secondary tumble class dump and discipline in a dex build is kinda meh (and you yourself say to forget about it). The extra AC (+1) is worth lvl 7 spells, extra caster levels and extra spell slots?</div></blockquote>\n\nHe needs 3 monk levels straight for the way the server works. What are you suggesting? Cleric 13 Monk 4 Rogue 13 or Cleric 14 Monk 3 Rogue 13? Either is fine, but Level 7 spells also mean 17 Wisdom, whereas this one can live with just 16 and still be pretty effective. I'd go for 15 Cleric, but the way Arelith is scripted, he can't with this class combo without dropping ED. Between Cleric 14 and Cleric 12, not much difference IMO. But you can puzzle yourself into squeezing the extra Wisdom for more spells. If you manage to do it without hurting the build, then it's a good alternative.</div></blockquote>I was suggesting Cleric 14/Monk 3 and since you haven't posted the build I can't say about where to get the extra Wis from. Between Cleric 14 and 12 there is this difference:     <br/>\n<br/>\nDestruction<br/>\nGreater restoration<br/>\nRegenerate<br/>\nResurrection<br/>\nSummon creature VII<br/>\nWord of faith <br/>\n<br/>\nand one extra spell at lvl 2/4/6 and 3 lvl 7 spells. I fail to see how all this can be considered \"not much difference\". Resurrection alone, with scribe scroll especially, is worth it in party play. A 8/18/12/16/12/8 or 10/18/10/16/12/8 starting ability split (halfling or elf) and using one Great Ability feat gives the possibility to end at Dex 25 and Wis 17. Human would require a further sacrifice in ability scores.<br/>\n<br/>\nThat said, I'm no big fan of dexer clerics in lvl 30 cap. Dexer clerics work well in a lvl 40 cap.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "7:12 AM - Oct 07, 2011",
      "content": "<div>:O Thank you all for your help!!! this is fantastic!<br/>\nFrom what I'v read here, correct me if I'm wrong, would a 15-15 split be best? by the sounds of things level 15 Cleric is amazing for just the spells and the buff upgrades so it will be a shame to miss out on them, and rogue at level 15 I get another attack per round and I am still able to get epic dodge if I take the level progression as level 27 being rouge level 13 and then 2 levels of Cleric and a last skill dump in Rogue at 30 and then getting 8d6 sneak attack as a sweet bonus at the end also. That would work wouldn't it? And for feats as I have been informed, expertise and improved expertise are a waste in this, so there are the meta magic feats I need and Scribe scroll. Also because I wont be needing 13 INT for expertise I have an extra ability point for WIS if I take 19 DEX instead of 20 and then I could put the extra point I get into CON, or STR and add one in that in my level progression either giving me for damage and carry capability and more HP. (think the ability point thing works out as I have said but not completely sure, not have excel on this pc so can't be sure.)<br/>\nFor weapon selection, don't know about items you can get of enemies in the hells and so on but bows are the same for long and short only difference is if it long or a short bow, I think the best bow is something like, +1 DEX, 4 mighty, and 1d10 massive criticals (Massive criticals might be better than that not to sure but it's about there.) I think AC is better option for the KD problem, at least for this 15,15 split idea I had.. Because neither classes have it as a class feat. Also even thought that slinger build is tasty looking, There are some very nice RP choices involving a bowmen I believe. And I'm not completely unwilling to drop Rogue, so the heavy Cleric, Monk build option might be good, even if I can get some Assassin or rogue or even bard for the reason of UMD and bluff bluff dump (maybe even some preform, for the *disguise* feature in Arelith which used preform and bluff to determine how good you are at it. Not sure about if they add together though soo.) So, maybe 15 Cleric, 12 Monk, 3 (UMD+Bluff drop)?</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "7:17 AM - Oct 07, 2011",
      "content": "<div>Oh, something that might make things fantastic, that if forgot about before. <a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Spell_Focuses\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Spell_changes#Spell_Focuses</a></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "2:44 PM - Oct 07, 2011",
      "content": "<div>Is Epic Dodge really worth it in this build?<br/>\n<br/>\nI'd say Cleric15(+)/Monk?/Rogue? with Zen Archery would trump it? You'd get better ability scores with a lower DEX and much better buffing and casting with WIS all the way. Your AC will not suffer, and certainly not your AB. Well unbuffed it will be a point or 2 down, but buffed? Yep. <br/>\n<br/>\n*Ninja-edit* It also opens up Crippling Strike with rogue 10. I'm a wee bit rusty so I might way off here.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:50 PM - Oct 07, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong> <blockquote><div><strong>NwnwhiteBoy wrote:</strong>(3) Hip's has been disabled. </div></blockquote>\nDon't think he was referring to me, although I am not moving as fast as I was 10 years ago.</div></blockquote>\nROFLMAO<br/>\nHe didn't disable your hips then?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:35 PM - Oct 07, 2011",
      "content": "<div><blockquote><div><strong>Grimnir wrote:</strong>Is Epic Dodge really worth it in this build?\n</div></blockquote>\nJust by the \"nature\" of the OP's intent, I'm assuming he wants to spend the majority of his fighting career with this toon within PBS range.  That makes it subject to all the typical melee type factors like needing Blind Fight and maxing Tumble while wearing robes.  At least that is what I have been gleaning thus far.  A typical range attacker would almost never use/need ED, not if played correctly.  And with traps, yet?<br/>\n<br/>\nThere isn't room in the original build (30 levels cap) to focus in anything more than a single weapon so swapping out to unarmed or kamas will result a vast drop in attack and would at least necessitate electing finesse.<br/>\n<br/>\nMy own preference is to play a range attacker as pure artillery with leg shots and summons if available (Grease scrolls help also).  Never felt PBS was worth any more than just sucking up a feat for Rapid Shot.  But that all is just a matter of combat style.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "5:29 PM - Oct 07, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>Grimnir wrote:</strong>Is Epic Dodge really worth it in this build?\n</div></blockquote>\nJust by the \"nature\" of the OP's intent, I'm assuming he wants to spend the majority of his fighting career with this toon within PBS range.  That makes it subject to all the typical melee type factors like needing Blind Fight and maxing Tumble while wearing robes.  At least that is what I have been gleaning thus far.  A typical range attacker would almost never use/need ED, not if played correctly.  And with traps, yet?<br/>\n<br/>\nThere isn't room in the original build (30 levels cap) to focus in anything more than a single weapon so swapping out to unarmed or kamas will result a vast drop in attack and would at least necessitate electing finesse.<br/>\n<br/>\nMy own preference is to play a range attacker as pure artillery with leg shots and summons if available (Grease scrolls help also).  Never felt PBS was worth any more than just sucking up a feat for Rapid Shot.  But that all is just a matter of combat style.</div></blockquote>\nWell, I am aware of that, but I didn't suggest any other changes, really. Just drop Epic dodge for Zen archery to get more (15+) Cleric levels. He'd still be using robes, he'd just have lower DEX and higher WIS. Wis is giving the same benfits as DEX, except better WILLsave and lower REFsave and mush more spells. WIS bonus to AC is always functional too, flatfooted, touch, prone, whatever.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "7:01 PM - Oct 07, 2011",
      "content": "<div><blockquote><div><strong>Grimnir wrote:</strong>WIS bonus to AC is always functional too, flatfooted, <strong>touch</strong>, prone, whatever.</div></blockquote>Not touch: all natural armor AC (both normal natural armor aC and natural armor AC enhancements) is ignored by touch attacks. Monk level based and wis based AC is natural armor AC, same as AS, RDD's AC and PM's AC. Ammys give natural armor AC enhancement, same as barkskin and MA, EMA natural armor component and Shadow shield.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "11:34 PM - Oct 07, 2011",
      "content": "<div><blockquote><div><strong>KailPendragon wrote:</strong>Not touch: all natural armor AC (both normal natural armor aC and natural armor AC enhancements) is ignored by touch attacks. Monk level based and wis based AC is natural armor AC, same as AS, RDD's AC and PM's AC. Ammys give natural armor AC enhancement, same as barkskin and MA, EMA natural armor component and Shadow shield.</div></blockquote>\nThen that's a bug, it's supposed to. Admittedly never tested it in NwN, but it works as it should in the sequel, which has a lot of the same coding.<br/>\n<strong>*EDIT*</strong><br/>\n<blockquote><div>AC Bonus (Ex): When unarmored and unencumbered, the monk adds her Wisdom bonus (if any) to her AC. In addition, a monk gains a +1 bonus to AC at 5th level. This bonus increases by 1 for every five monk levels thereafter (+2 at 10th, +3 at 15th, and +4 at 20th level).<br/>\n<br/>\nThese bonuses to AC apply even against touch attacks or when the monk is flat-footed. She loses these bonuses when she is immobilized or helpless, when she wears any armor, when she carries a shield, or when she carries a medium or heavy load. </div></blockquote>\n\nFrom the 3.0 ruleset.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "12:56 AM - Oct 08, 2011",
      "content": "<div>Rather than a bug I see it as BW's implementation. As you know, NWN is not 3.0, but rather something based on it, which implies the existence of differences.<br/>\n<br/>\nAnyhow, in NWN those ACs I mentioned are all natural AC (normal or enhancement) and as such, in NWN, do not apply vs touch attacks.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "4:48 AM - Oct 08, 2011",
      "content": "<div>I did think about using a WIS build, but I decided against it for 1) The DEX based skills (Hide, MS, Tumble, ect) would suffer and I was going for max stealth.<br/>\n2) when fighting against spell caster, the reflex save will save me from things such as fire ball and so on. (This has saved me many, many times on another toon hence why I counted it in on my decision.)<br/>\nThis is why I decided against using a WIS build, however if you can remedy these reasons in some way, I will most willing to explore further in to Zen archery and a WIS base. <br/>\nAlso, ED I felt was important because I will be \"Up in their grill.\"  lol</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:10 AM - Oct 08, 2011",
      "content": "<div>With Emp Cat's and Trickery, I can't imagine how DEX would be an issue in this build as far as reflex &amp; stealth is concerned. The fact that WIS AC is permanent has a lot of merit in any monk/cleric build.  I support Grim's suggestion about going the zen route as a cleric (although he probably didn't realize it  ).<br/>\n<br/>\nAs far as saves go, that's what Spellcraft ranks, Prayer &amp; Battletide are used for.  I wouldn't be concerned about fireballs or most elemental spells with all the protective buffs available to cleric.  I would worry most about IGMS &amp; Bigby's and get as many cleric levels as possible so that Spell Resistance (extended, Lvl 7 slot) has some \"bite\", Clc 15 = SR 27, Clc 24 = SR 36.<br/>\n<br/>\nDunno. Kail's Monk 20/Rog 10 is looking better and better if you really want to explore the ED route.  Better assassin, but less damage.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "6:41 AM - Oct 09, 2011",
      "content": "<div>What I meant, is wouldn't my MS, Hide, and Tumble final ranks be lower by about 5? Because of the DEX score not being added on..</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "11:12 AM - Oct 09, 2011",
      "content": "<div><blockquote><div><strong>NwnwhiteBoy wrote:</strong>What I meant, is wouldn't my MS, Hide, and Tumble final ranks be lower by about 5? Because of the DEX score not being added on..</div></blockquote>\nthat doesn't matter at for tumble, you'll just need to pass 15 with armor, and the rest is for Ac and that counts base ranks. Stealth is the only thing that will suffer. If it matters at all, you got Darkness and Ultravision which is the poor mans HiPS.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "11:23 AM - Oct 09, 2011",
      "content": "<div>But now because of my tumble skill + DEX bonus (33+7) gives me 40 tumble which is +8 AC and with WIS base wont I loose most of that +8 AC? or will I gain more from being WIS base?</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "11:24 AM - Oct 09, 2011",
      "content": "<div>Oh, no I see my error after rereading the wiki page!!<br/>\n<br/>\nSo really, even though my final tumble is 40 I am really only getting the AC for 30 of it because the DEX score doesn't count? So at level 30 max tumble AC bonus is only +6, correct?</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "12:41 PM - Oct 09, 2011",
      "content": "<div>Also, on the topic of, Zen archery.<br/>\n<br/>\nFrom what I have gathered, Epic dodge is needed in how I want to play this build (due to the closeness I will be when attacking because of sneak attacks), and Zen archery would improve this build.<br/>\n<br/>\nBut because I want ED, Zen archery will be unattainable unless I sacrifice the +4 AB and AC from level 15 Cleric (which is VERY tasty) and this also means I will have to keep the 3 Monk levels (or add more?) to make sure my AC isn't damaged in the process.<br/>\n<br/>\nThis will mean, to make Cleric even worth anything I'll have to take 3 levels from Rogue to make Cleric level 12 and the buffs actually helpful, then if adding more Monk levels for some reason (to make monk worth it in this build? unless the Zen archery route works to make it more worth it?), which will leave me with at least 13 Rogue, so I can get ED.<br/>\n<br/>\nWhich will leave me with 12 Cleric, 5 monk, and 13 Rogue the 5th monk level giving nothing but 1 AC and better saves. But getting rid of the 2d6 Sneak attack damage and 1 DEX. And if I go 16 Cleric, 14 Rogue giving all of Cleric level 15's +'s and + dark fire upgrading, 7d6 sneak attacks and uncanny dodge IV. But missing out on level 9 spells (are they worth much to this build? I didn't think so..) but uncanny dodge isn't really worth much either? so... would a 15, 15 split be good? or not? that gives me an extra 1d6 sneak attack (8d6 now), but still gets ride of the extra feat by Rogue at 16 (+1 DEX) leaving me with 25 final DEX.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "2:05 PM - Oct 09, 2011",
      "content": "<div><blockquote><div><strong>NwnwhiteBoy wrote:</strong>Oh, no I see my error after rereading the wiki page!!<br/>\n<br/>\nSo really, even though my final tumble is 40 I am really only getting the AC for 30 of it because the DEX score doesn't count? So at level 30 max tumble AC bonus is only +6, correct?</div></blockquote>\nCorrect. Baseranks only, when determining AC.<br/>\n<br/>\n<blockquote><div><strong>NwnwhiteBoy wrote:</strong>Also, on the topic of, Zen archery.<br/>\n<br/>\nFrom what I have gathered, Epic dodge is needed in how I want to play this build (due to the closeness I will be when attacking because of sneak attacks), and Zen archery would improve this build.<br/>\n<br/>\nBut because I want ED, Zen archery will be unattainable unless I sacrifice the +4 AB and AC from level 15 Cleric (which is VERY tasty) and this also means I will have to keep the 3 Monk levels (or add more?) to make sure my AC isn't damaged in the process.</div></blockquote>\nYou get either ED and high DEX, or Zen Archery and high Wisdom. There's no use in both. Because of the stupid build rules you can't  do the optimal Cleric15/Monk2/Rogue13. I would go Cleric15/monk4/Rogue 11 I think and the Zen Archery route. If you'd rather go ED, you must decide where to stop Cleric, but go at least 12 lvls.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:26 PM - Oct 09, 2011",
      "content": "<div>Keep in mind also (OP) when comparing the value of DEX vs. WIS that your toon can still be open to AoOs, caught flat-footed and/or flanked especially when surrounded... EVEN WITH ED applied.  In those situations, all your DEX AC goes *poof* and leaves the character with rather pedestrian AC to get hit even more often.  ED &amp; concealment will minimize this eventuality, but WIS AC is permanent (unless subjected to a curse or some other ability-reducing effect).</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "2:53 PM - Oct 09, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong>Keep in mind also (OP) when comparing the value of DEX vs. WIS that your toon can still be open to AoOs, caught flat-footed and/or flanked especially when surrounded... EVEN WITH ED applied.  In those situations, all your DEX AC goes *poof* and leaves the character with rather pedestrian AC to get hit even more often.  ED &amp; concealment will minimize this eventuality, but WIS AC is permanent (unless subjected to a curse or some other ability-reducing effect).</div></blockquote>\nUncanny Dodge protects against losing DEX AC when flatfooted or when struck by invisible creatures. But not against flanking, I think, and not when prone if that should happen.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:57 PM - Oct 09, 2011",
      "content": "<div><blockquote><div><strong>Grimnir wrote:</strong><br/>\nUncanny Dodge protects against losing DEX AC when flatfooted or when struck by invisible creatures. But not against flanking, I think, and not when prone if that should happen.</div></blockquote>\nRight, Grim... as does the DwD Defensive Awareness.  Was mainly considering just the property of non feat-modified DEX in my comment.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "4:45 PM - Oct 09, 2011",
      "content": "<div>Flanking grants +2 AB and makes one open to SAs (unless one has defensive awareness or is using WWA/IWWA) but doesn't cause flatfooted status and hence the loss of dex/tumble/dodge AC. Prone induces flatfooted status instead and also +4 AB for melee attacks/-4 AB for ranged attacks vs the prone target.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:40 PM - Oct 09, 2011",
      "content": "<div>@ NWNwhiteboy<br/>\n<br/>\nYou have 3 choices for doable builds in the rules you mentioned:<br/>\n<br/>\n1- Cleric 12 Monk 5 Rogue 13: You can end at 16 WISDOM, have 15 pre-epic BAB (which would otherwise be unattainable unless you delay Monk levels to epics, but then you can't focus on Kamas to get the full attack schedule without wasting a good feat in epics with Weapon Focus.<br/>\n<br/>\n2- Cleric 13 Monk 4 Rogue 13: You get level 7 spells and must find a way to rework your starting stats or stat points to attain 17 WISDOM to be able to cast them. This build would also get more spell slots than the previous, at the cost of 1 AC from Monk 5 and a little worse stats due to your need to get +1 WISDOM, but you'd still be able to maintain 15 BAB.<br/>\n<br/>\n3- Cleric 14 Monk 3 Rogue 13: You lose 1 pre-epic BAB for more spells and also need to make way for 17 WISDOM. This way you can cast more spells, at the cost of 1 AB and AC and 1 stat point.<br/>\n<br/>\nMy PERSONAL preference is the first alternative, but not a strong feeling. Kail, on the other hand, prefers the third one. Truth is, it's entirely up to you.<br/>\n<br/>\nHere's a rough sketch:<br/>\n<br/>\nCleric(12), Monk(5), Rogue(13), Human<br/>\n<br/>\nSTR: 8<br/>\nDEX: 17 (26)<br/>\nCON: 9<br/>\nWIS: 16<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Cleric(1): Knockdown, Extend Spell, Domain Travel, Domain Trickery<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Weapon Finesse<br/>\n04: Cleric(4): DEX+1, (DEX=18)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): Two-Weapon Fighting<br/>\n07: Cleric(7)<br/>\n08: Cleric(8): DEX+1, (DEX=19)<br/>\n09: Cleric(9): Ambidexterity<br/>\n10: Cleric(10)<br/>\n11: Cleric(11)<br/>\n12: Cleric(12): DEX+1, Improved Two-Weapon Fighting, (DEX=20)<br/>\n13: Monk(1): {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n14: Monk(2): {Deflect Arrows}<br/>\n15: Monk(3): Weapon Focus: Kama<br/>\n16: Rogue(1): DEX+1, (DEX=21)<br/>\n17: Rogue(2)<br/>\n18: Rogue(3): Improved Knockdown, {Uncanny Dodge I}<br/>\n19: Rogue(4)<br/>\n20: Monk(4): DEX+1, (DEX=22)<br/>\n21: Rogue(5): Epic Weapon Focus: Kama<br/>\n22: Rogue(6)<br/>\n23: Rogue(7)<br/>\n24: Rogue(8): DEX+1, Great Dexterity I, (DEX=24)<br/>\n25: Rogue(9)<br/>\n26: Rogue(10): Improved Evasion<br/>\n27: Rogue(11): Great Dexterity II, (DEX=25)<br/>\n28: Rogue(12): DEX+1, (DEX=26)<br/>\n29: Monk(5)<br/>\n30: Rogue(13): Epic Dodge, Defensive Roll<br/>\n<br/>\nHitpoints: 184<br/>\nSkillpoints: 253<br/>\nSaving Throws (Fortitude/Will/Reflex): 17/21/25<br/>\nSaving Throw bonuses: Mind Effects: +2, Traps: +2<br/>\nBAB: 20<br/>\nAB (max, naked): 31 (melee), 28 (ranged)<br/>\nAC (naked/mundane armor/shield only): 28/28<br/>\nSpell Casting: Cleric(6)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 32(31), Hide 33(41), Listen 33(36), Move Silently 33(41), Tumble 33(41), UMD 33(32), remaining skillpoints 56</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:34 PM - Oct 09, 2011",
      "content": "<div>You only need 30 final Tumble and 31 UMD, so there's another 5 skillpoints for you to use</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "3:14 AM - Oct 10, 2011",
      "content": "<div>Okay, I like number 2,  but for the one you put up wouldn't it be better to start with Rogue? because of skill points? or is there another reason for starting with cleric? Also, I could just sub in Shortbow feats and ranged feats instead of KD and so on? (being I would like a ranged toon that is elf. (both pretty much RP reason) or am a reason you have for things?<br/>\n<br/>\nI understand human for the XP penalty though, but XP never really bothered me.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:43 AM - Oct 10, 2011",
      "content": "<div>Well, if you can survive the early levels without the Cleric goodies, sure, go ahead and start with it. I don't think a ranged toon with Epic Dodge is a good idea, since ED is most useful for meleers. If you want a ranged character, Go Cleric 24 Monk 3 Rogue 3 and be a happy zen archer. It is you who must understand what you want and why you`re doing it before you start building. If you had said you wanted a ranged elf toon,  I wouldn`t have bothered to build you something. Is there any reason for my choices? Yes, the reason is that they`re good, and Travel and Trickery domains make you a very powerful meleer, but suit yourself, do what you`d like. I advise you to read my guide in Game Guides forums so that you can understand the advice given to you by the more experienced players, cuz you don`t seem to know what you`re doing or what you want. It will help a lot. <br/>\n<br/>\nHave fun!</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "5:55 AM - Oct 10, 2011",
      "content": "<div>Okay! After reading the 2nd Cleric Guide (the one I had not gotten around to reading yet) I see why melee is MUCH BETTER!!!! and also, just a thought about word or failth (probably a waste but ) if you used that instead of darkness would extend spell make it last more rounds? (that with a duel-weilding monk sounds deadly! In my ill experienced opinion anyway.)<br/>\n<br/>\nThanks again for all the help and advice.<br/>\n<br/>\nI think I just levelled up and added more skill points into \"Clerical building!\"  (also gained the feat \"Cleric spell understanding\" and made it so next level I can take \"Cleric/Monk melee advantages\".  I shell post my remade build soon, to make sure my learning has been put to use correctly!!!</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "6:24 AM - Oct 10, 2011",
      "content": "<div>Okay, Regarding Blind Fight. It IS needed when close to the enemy? And does it mean you don't need Ultra vision, to fight in Darkness?</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "6:54 AM - Oct 10, 2011",
      "content": "<div>Okay, here is my revisited build now in melee, because it is much better! (Could be the same with Shortbow, and ranged feats instead of TWF feats?) But also could have KD and Instead of blind fight and if it were human.(Would have 2 less DEX but you could get rid of 1 or both of the epic skill focus to make it 26 DEX final). This could also be Halfling for more AB + AC (+1) but the Elf is for RP over the Halfling.<br/>\n<br/>\nHere it is!<br/>\n<br/>\n<strong>Rogue(13), Cleric(13), Monk(4), Elf</strong><br/>\n<br/>\nSTR: 8<br/>\nDEX: 19 (26)<br/>\nCON: 6<br/>\nWIS: 17<br/>\nINT: 12<br/>\nCHA: 8<br/>\n<br/>\nElf: (Hardiness vs. Enchantments, Keen Sense, Low-light Vision, Skill Affinity: Listen, Skill Affinity: Search, Skill Affinity: Spot, Sleeplessness)<br/>\n01: Rogue(1): Ambidexterity<br/>\n02: Rogue(2): {Evasion}<br/>\n03: Rogue(3): Weapon Finesse, {Uncanny Dodge I}<br/>\n04: Rogue(4): DEX+1, (DEX=20)<br/>\n05: Cleric(1): Domain Travel, Domain Trickery<br/>\n06: Cleric(2): Extend Spell<br/>\n07: Cleric(3)<br/>\n08: Cleric(4): DEX+1, (DEX=21)<br/>\n09: Cleric(5): Blind Fight<br/>\n10: Cleric(6)<br/>\n11: Cleric(7)<br/>\n12: Cleric(8): DEX+1, Two-Weapon Fighting, (DEX=22)<br/>\n13: Cleric(9)<br/>\n14: Cleric(10)<br/>\n15: Cleric(11): Improved Two-Weapon Fighting<br/>\n16: Cleric(12): DEX+1, (DEX=23)<br/>\n17: Monk(1): {Cleave, Improved Unarmed Strike, Stunning Fist}<br/>\n18: Monk(2): Weapon Focus: Kama, {Deflect Arrows}<br/>\n19: Monk(3)<br/>\n20: Monk(4): DEX+1, (DEX=24)<br/>\n21: Rogue(5): Epic Weapon Focus: Kama<br/>\n22: Cleric(13)<br/>\n23: Rogue(6)<br/>\n24: Rogue(7): DEX+1, Epic Skill Focus: Hide, (DEX=25)<br/>\n25: Rogue(8)<br/>\n26: Rogue(9)<br/>\n27: Rogue(10): Epic Skill Focus: Move Silently, Improved Evasion<br/>\n28: Rogue(11): DEX+1, (DEX=26)<br/>\n29: Rogue(12)<br/>\n30: Rogue(13): Epic Dodge, Defensive Roll<br/>\n<br/>\n<br/>\nHitpoints: 154<br/>\nSkillpoints: 203<br/>\nSaving Throws (Fortitude/Will/Reflex): 16/21/25<br/>\nSaving Throw bonuses: Mind Effects: +4, Traps: +2<br/>\nBAB: 20<br/>\nAB (max, naked): 31 (melee), 28 (ranged)<br/>\nAC (naked/mundane armor/shield only): 27/28<br/>\nSpell Casting: Cleric(7)<br/>\nAlignment Changes: 0<br/>\n<br/>\nBluff 32(31), Concentration 21(19), Hide 33(51), Move Silently 33(51), Set Trap 9(17), Spot 13(18), Tumble 30(38), UMD 33(32)<br/>\n<br/>\n<br/>\n01: Bluff(4), Hide(4), Tumble(4), UMD(4), Save(20), <br/>\n02: Bluff(1), Hide(1), Tumble(1), UMD(1), Save(25), <br/>\n03: Bluff(1), Hide(1), Tumble(1), UMD(1), Save(30), <br/>\n04: Bluff(1), Hide(1), Move Silently(4), Tumble(1), UMD(1), Save(31), <br/>\n05: Concentration(5), Save(29), <br/>\n06: Concentration(2), Save(30), <br/>\n07: Concentration(2), Save(31), <br/>\n08: Concentration(1), Save(33), <br/>\n09: Concentration(1), Save(35), <br/>\n10: Concentration(1), Save(37), <br/>\n11: Concentration(1), Save(39), <br/>\n12: Concentration(1), Save(41), <br/>\n13: Concentration(1), Save(43), <br/>\n14: Concentration(1), Save(45), <br/>\n15: Concentration(1), Save(47), <br/>\n16: Concentration(1), Save(49), <br/>\n17: Concentration(1), Hide(13), Move Silently(13), Tumble(13), Save(14), <br/>\n18: Concentration(1), Hide(1), Move Silently(1), Tumble(1), Save(15), <br/>\n19: Concentration(1), Hide(1), Move Silently(1), Tumble(1), Save(16), <br/>\n20: Hide(1), Move Silently(1), Tumble(1), Save(18), <br/>\n21: Bluff(16), Hide(1), Move Silently(1), Tumble(1), UMD(7), Save(1), <br/>\n22: Save(4), <br/>\n23: Bluff(2), Hide(2), Move Silently(4), Tumble(2), UMD(2), Save(1), <br/>\n24: Bluff(1), Hide(1), Move Silently(2), Spot(1), Tumble(1), UMD(4), <br/>\n25: Bluff(1), Hide(1), Move Silently(1), Set Trap(1), Spot(2), Tumble(1), UMD(2), <br/>\n26: Bluff(1), Hide(1), Move Silently(1), Set Trap(1), Spot(2), Tumble(1), UMD(2), <br/>\n27: Bluff(1), Hide(1), Move Silently(1), Set Trap(1), Spot(2), Tumble(1), UMD(2), <br/>\n28: Bluff(1), Hide(1), Move Silently(1), Set Trap(2), Spot(2), UMD(2), <br/>\n29: Bluff(1), Hide(1), Move Silently(1), Set Trap(2), Spot(2), UMD(2), <br/>\n30: Bluff(1), Hide(1), Move Silently(1), Set Trap(2), Spot(2), UMD(3), <br/>\n<br/>\nThis is what I'v come up with.. hope I have used all the knowledge I have gained well. (and not missed any minor bits a pieces that make a big difference :/) And hope the 17 Set trap and 18 Spot are not a waste.. Wasn't to sure if how many points I have makes much of a difference? (was reading about set trap and it said that strong are DC 25 need to roll and 8 to Succeed?)</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "7:10 AM - Oct 10, 2011",
      "content": "<div><blockquote><div><strong>NwnwhiteBoy wrote:</strong>Okay, Regarding Blind Fight. It IS needed when close to the enemy? And does it mean you don't need Ultra vision, to fight in Darkness?</div></blockquote>\nYes, you need BF. It means your miss chance in Darkness goes down, Ultravision makes it go away.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:07 PM - Oct 10, 2011",
      "content": "<div><blockquote><div><strong>Grimnir wrote:</strong><blockquote><div><strong>NwnwhiteBoy wrote:</strong>Okay, Regarding Blind Fight. It IS needed when close to the enemy? And does it mean you don't need Ultra vision, to fight in Darkness?</div></blockquote>\nYes, you need BF. It means your miss chance in Darkness goes down, Ultravision makes it go away. </div></blockquote>\n\nGrim, I normally don't fight IN darkness, I cast darkness behind me to be able to hide again in the middle of combat. I run back inside Darkness and hide then come back out and start sneaking the crap out of mobs. And if you do fight in it, like you said, you have UV as a cleric.<br/>\n<br/>\n@ NWN Whiteboy<br/>\n<br/>\nI see a problem with your build: you don't have KD. You need to worry about having ways to generate sneak attacks so you can have the extra damage. The way you've built it, the only two ways to generate sneaks are coming from stealth and attacking (which only works when you start the combat) or fighting in Darkness. I would think that you would have more damage per round if you dropped the TWF feats for KD / IKD and something else. Unless there are a lot of immune to KD monsters in your server. A KDed enemy will receive Sneak Attack damage. The build I suggested would have both IKD and the TWF feats, which is even better.<br/>\n<br/>\nThere is also another small but maybe worth looking at problem: you don't get Wisdom AC until level 16. I would relinquish a few skill points and start with Monk instead of Rogue. That way you can have +3 AC right off the bat, and also that means your UMD will be delayed a little, but when you do get it, it'll be higher across the board.<br/>\n<br/>\nAnother thing you can consider is dropping both ESF feats for Armor Skin and Epic Prowess. With Divine Trickery and a high DEX modifier, I think your stealth skills are high enough to go undetected for the most part. But I guess that depends on the server.<br/>\n<br/>\nOther than that it's a good build. 6 CON is bold, but I guess with a high AC and UMD it's of little consequence. <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "12:23 PM - Oct 10, 2011",
      "content": "<div>Brilliant I shell look through some things and work KD in there, and also the epic feats. And repost?<br/>\n<br/>\nBut sorry for my stupidity, but your last comment to Grim made it sound as if Blind fight is not needed...But it is right? ( sorry to keep asking about it AGAIN )<br/>\n<br/>\nThanks for all your help!!! Much aperciated, I have learnt a lot!!</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "1:41 PM - Oct 10, 2011",
      "content": "<div><blockquote><div><strong>NwnwhiteBoy wrote:</strong>But sorry for my stupidity, but your last comment to Grim made it sound as if Blind fight is not needed...But it is right? ( sorry to keep asking about it AGAIN )<br/>\n</div></blockquote>\nIt IS needed. Although you have Ultravision, BF helps you against all concealments, even the monk ability, SC V, ImpInvis, takes away bonuses opponents get when they attack from invis, if you actually get blinded etc.<br/>\n<br/>\nYES, Blindfight is a must.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "4:10 PM - Oct 10, 2011",
      "content": "<div>Awesome thanks for clearing that up, very much apriciated!!!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:04 PM - Oct 10, 2011",
      "content": "<div>About Blind Fight, I gotta say that's a matter of opinion. I think Blind Fight is EXCELLENT, and I always try to fit it in any of my melee builds, BUT I wouldn't call it essential, I'd call it a VERY NICE TO HAVE feat. Grim is right, It helps against all types of concealment, but to say it's a must there's a few things that need to be checked:<br/>\n<br/>\n1- Are you going to PVP?<br/>\n<br/>\n2- If so, are any spells or abilities that give concealment common among the enemies you will face? (Are there plenty of scrolls of Improved Invisibility, Ghostly Visage, Ethereal Visage for anyone with UMD to use or does one have to have it as a spell or ask a caster to burn them a scroll to have access to it?)<br/>\n<br/>\n3- If so, have the DMs nerfed any of the spells or abilities that give you concealment? (I played on a server where Improved Invisibility had been nerfed to grant 30% concealment instead of 50%)<br/>\n<br/>\n4- If not, do many of your enemies have concealment or is it a sporadic thing to find?<br/>\n<br/>\n5- Do bosses commonly have some form of concealment? Is it dispellable?<br/>\n<br/>\n6- Do you commonly get blinded or attacked by invisible creatures?<br/>\n<br/>\nIMO if you can find room to fit the feat without hurting the build, excellent, go for it, but I would think that KD and IKD for a Sneaker are more important, unless there's lots of KD immunities around. Why don't you do this: First try to fit KD and IKD or just KD into the build without removing BF. If you can't then exchange BF for KD <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "10:36 AM - Oct 11, 2011",
      "content": "<div>Okay, I'v made up this character, but when I use Haste, Flurry of blows and/or divine power it does not show my other attacks in character sheet. Is this because it does not show them? or is something not working properly?<br/>\n<br/>\nAnd is it only primary hand that haste, DP and, flurry of blows work for?</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "11:01 AM - Oct 11, 2011",
      "content": "<div><blockquote><div><strong>NwnwhiteBoy wrote:</strong>Okay, I'v made up this character, but when I use Haste, Flurry of blows and/or divine power it does not show my other attacks in character sheet. Is this because it does not show them? or is something not working properly?<br/>\n<br/>\nAnd is it only primary hand that haste, DP and, flurry of blows work for?</div></blockquote>\n It's just your sheet, just turn on combatdebugging and you'll see.<br/>\n<br/>\nHaste is giving you one attack at max AB, even with flurry turned on I think, Flurry add one extra, and divine power does. I think all the extra attacks degress at -5 and not -3 though. All attacks are main hand. I think you'll be enjoying 10 apr now, at highly varying AB.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "11:27 AM - Oct 11, 2011",
      "content": "<div>Oh, sweeT! <br/>\n<br/>\nHow do I turn on combat Debuging?</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "12:05 PM - Oct 11, 2011",
      "content": "<div><a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Console_command\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Console_command</a><br/>\n<br/>\nScroll down a little until you see Dungeon Master commands.<br/>\n<br/>\nIt's excellent help.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "1:42 AM - Oct 12, 2011",
      "content": "<div>Awesome thanks. <br/>\n<br/>\nFor KD, how important is it to get IKD? does it make a huge difference?</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "1:51 AM - Oct 12, 2011",
      "content": "<div>It makes a big difference. When attempting a KD you are considered one size bigger; so if medium you are considered large and can hence KD a huge creature. You also make the opposed checks of the target 4 points more difficult to pass, always because you ar econsidered one size bigger.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Knockdown\" rel=\"noreferrer\" target=\"_blank\">Knockdown</a><br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Improved_knockdown\" rel=\"noreferrer\" target=\"_blank\">Improved knockdown</a></div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "6:47 AM - Oct 14, 2011",
      "content": "<div>Okay, thanks. Also the was the check against KD is made is discipline check vs attack roll, correct?</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "11:07 AM - Oct 14, 2011",
      "content": "<div>Rogue(13), Cleric(13), Monk(4), Elf<br/>\n<br/>\nSTR: 8<br/>\nDEX: 19 (26)<br/>\nCON: 6<br/>\nWIS: 17<br/>\nINT: 12<br/>\nCHA: 8<br/>\n<br/>\nElf: (Hardiness vs. Enchantments, Keen Sense, Low-light Vision, Skill Affinity: Listen, Skill Affinity: Search, Skill Affinity: Spot, Sleeplessness)<br/>\n01: Rogue(1): Ambidexterity<br/>\n02: Rogue(2): {Evasion}<br/>\n03: Rogue(3): Weapon Finesse, {Uncanny Dodge I}<br/>\n04: Rogue(4): DEX+1, (DEX=20)<br/>\n05: Cleric(1): Domain Travel, Domain Trickery<br/>\n06: Cleric(2): Extend Spell<br/>\n07: Cleric(3)<br/>\n08: Cleric(4): DEX+1, (DEX=21)<br/>\n09: Cleric(5): Knockdown<br/>\n10: Cleric(6)<br/>\n11: Cleric(7)<br/>\n12: Cleric(8): DEX+1, Two-Weapon Fighting, (DEX=22)<br/>\n13: Cleric(9)<br/>\n14: Cleric(10)<br/>\n15: Cleric(11): Improved Two-Weapon Fighting<br/>\n16: Cleric(12): DEX+1, (DEX=23)<br/>\n17: Monk(1): {Cleave, Improved Unarmed Strike, Stunning Fist}<br/>\n18: Monk(2): Weapon Focus: Kama, {Deflect Arrows}<br/>\n19: Monk(3)<br/>\n20: Monk(4): DEX+1, (DEX=24)<br/>\n21: Rogue(5): Epic Weapon Focus: Kama<br/>\n22: Cleric(13)<br/>\n23: Rogue(6)<br/>\n24: Rogue(7): DEX+1, Epic Skill Focus: Hide, (DEX=25)<br/>\n25: Rogue(8)<br/>\n26: Rogue(9)<br/>\n27: Rogue(10): Epic Skill Focus: Move Silently, Improved Evasion<br/>\n28: Rogue(11): DEX+1, (DEX=26)<br/>\n29: Rogue(12)<br/>\n30: Rogue(13): Epic Dodge, Defensive Roll<br/>\n<br/>\n<br/>\nHitpoints: 154<br/>\nSkillpoints: 203<br/>\nSaving Throws (Fortitude/Will/Reflex): 16/21/25<br/>\nSaving Throw bonuses: Mind Effects: +4, Traps: +2<br/>\nBAB: 20<br/>\nAB (max, naked): 31 (melee), 28 (ranged)<br/>\nAC (naked/mundane armor/shield only): 27/28<br/>\nSpell Casting: Cleric(7)<br/>\nAlignment Changes: 0<br/>\n<br/>\nBluff 32(31), Concentration 21(19), Hide 33(51), Move Silently 33(51), Set Trap 9(17), Spot 13(18), Tumble 30(38), UMD 33(32)<br/>\n<br/>\nThis is exactly the same as before except KD has been added instead of BF, I was trying to find room for IKD, but it could not take anything out or make the race Human with out having to get rid of 2 AC/AB and ED unless I got ride of 10 Hide and MS. <br/>\n<br/>\nI figured it's a low magic server and I have TS and UMD so blinded, restoration. Correct me if thoughts are wrong. Also I don't think I'll really be KDing Giants and the like. (unless there are more things in large category than I was expecting.) If you can slip IKD in it'd be most appreciated (but keeping hide and MS in 50's and TWF feats is a must... I think)</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:01 PM - Oct 14, 2011",
      "content": "<div>You'd also need to work in your starting stats to fit IKD, as IKD requires 13 INT. It's not bad as is, but I still maintain that with Divine Trickery and a high DEX, it's better to take Armor Skin and Epic Prowess instead of the ESF: Hide and MS. But I am no Arelith expert to know whether these totals are enough to remain unseen while in stealth, so I'll leave that up to you.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "12:06 PM - Oct 14, 2011",
      "content": "<div>I was looking at that also, but I decided to keep it down as ESF, depending on how it goes and how often I get caught sneaking Stone skin and Epic powers might just slip in still!  (those bits will all depend of character play on server.)</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:25 AM - Oct 15, 2011",
      "content": "<div>It's Armor Skin, bro, Stoneskin is a spell and does a completely different thing. Basically, you get +2 AC from Armor Skin, and it always works.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "4:30 AM - Oct 15, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong>It's Armor Skin, bro, Stoneskin is a spell and does a completely different thing. Basically, you get +2 AC from Armor Skin, and it always works.</div></blockquote>To be precise, AS, as all natural armor, doesn't work vs touch attacks.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "5:14 AM - Oct 15, 2011",
      "content": "<div>My bad! I meant Armour skin!<br/>\n<br/>\nBTW, thank you all for your help whit this build!! It's much appreciated!!!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:13 AM - Oct 15, 2011",
      "content": "<div><blockquote><div><strong>KailPendragon wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong>It's Armor Skin, bro, Stoneskin is a spell and does a completely different thing. Basically, you get +2 AC from Armor Skin, and it always works.</div></blockquote>To be precise, AS, as all natural armor, doesn't work vs touch attacks.</div></blockquote>\n\nThanks for correcting me, I was thinking it wouldn't be lost when flat-footed, prone and stuff, but yeah, I knew that too, just momentarily forgot. Thanks!<br/>\n<br/>\n@ NWNwhiteboy<br/>\n<br/>\nWelcome, I am helping you openly and thoroughly because you're different from the pack. Most of these ppl are sort of lazy and just want us to give them a pre-made build to play. They fail to understand that to become a better player, you need to become a better builder and vice versa. Knowing how stuff works will help you make more intelligent decisions in game and also make better characters. We have an example right here in the guild of a good player named Conlaoch who had just never gotten the hang of playing Clerics. He tried to play simply one of the best builds of all times (Mith's Blood &amp; Faith) and failed because he didn't know how to use Cleric goodies and spells properly. No matter how good the build is, you have to know how to use it, and to know that, you have to understand the game, which will also help you out with your building. You, on the other hand, are eager to learn and it shows in your posts. I got faith in ya, mate, keep going this way and you will no doubt become a great builder someday. Don't let me down <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "6:23 AM - Oct 15, 2011",
      "content": "<div>I shell try my best to grasp the art of building!! And I am indeed VERY eager to learn!! <br/>\n<br/>\nAnd I hope I do not disappoint you!! <br/>\n<br/>\nThanks again!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:32 AM - Oct 15, 2011",
      "content": "<div><blockquote><div><strong>NwnwhiteBoy wrote:</strong><img class=\"post-image\" loading=\"lazy\" src=\"http://static.yuku.com/domain/bypass/images/yay.gif\"/> I shell try my best to grasp the art of building!! And I am indeed VERY eager to learn!! <br/>\n<br/>\nAnd I hope I do not disappoint you!! <br/>\n<br/>\nThanks again!</div></blockquote>\n\nYou could start your learning process by heeding my advice and stop trying to make builds with less than 15 Cleric levels LOL.<br/>\n<br/>\nThe only reason I suggested a build with 12 levels here in this topic is the limitations imposed by your server, otherwise in any other level 30 cap, the optimal build would be Cleric 15 Rogue 13 Monk 2<br/>\n<br/>\nI really gotta sleep.<br/>\n<br/>\nTake care, good night!</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "6:55 AM - Oct 15, 2011",
      "content": "<div>I did say I know I am breaking Cleric rules!! haha.<br/>\n<br/>\nNight.</div>"
    }
  ]
}