{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "517",
  "name": "Battle Priestess help",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/battle-priestess-help-t515406.html",
  "author": "EliHarel",
  "avatar": "no_avatar.png",
  "replies": "39",
  "views": "2.2K",
  "posts": [
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "2:47 PM - Aug 18, 2011",
      "content": "<div>This is for a relatively low-magic server. Items of +1 WIS and +1 DEX are more or less what I'll be having at epic. I'm a poor builder, and I'd like to know how this'll be.<br/>\n19 cleric, 6 monk, 5 fighter. <br/>\n<br/>\nPre-epic:<br/>\n12 Cleric, 4 Monk, 4 Fighter<br/>\n<br/>\nStarting ability scores:<br/>\n10 STR<br/>\n16 DEX<br/>\n12 CON<br/>\n14 INT<br/>\n16 WIS<br/>\n8 CHA<br/>\n<br/>\nI don't know if I should just keep raising WIS, or raise it only to 19/20 and then raise DEX.<br/>\n<br/>\nFeats:<br/>\nAmbi, TWF, ITWF<br/>\nKama: Weapon focus, Improved critical, weapon specialization, EWS<br/>\nExtend spell<br/>\nWeapon Finesse<br/>\n<br/>\nThese I understand to be the basic. Things I'm not yet sure on:<br/>\nExpertise, Improved Expertise, Armor Skin, Dodge, Maximize Spell, Empower Spell, Weapon Finesse, Epic WIS/DEX<br/>\nI'm not near my computer so I'm not sure how many feats I'll have.<br/>\n<br/>\nThe skills,<br/>\nOther than Tumble and Discipline, I'm not sure. I think I'll give up Hide and MS. Concentration? Spellcraft? Listen? Lore? Not sure.<br/>\n<br/>\nI'd appreciate advice.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:33 PM - Aug 18, 2011",
      "content": "<div>First off ----&gt; Welcome to the new ECB!<br/>\n<br/>\nKail, our illustrious admin will surely check in to offer some more official advice than my own. <br/>\n<br/>\nHere is what I would recommend for you to do in the interim:<br/>\n<br/>\nCopy all that you have here into the \"Build Request\" subforum, edit your original posting here to only point to the build request and then PM Kail (just click on his bold red name and the message option) to remove this entire topic since the build forums are intended for only fully-fledged, adequately-formatted (see the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=21&amp;t=7\" rel=\"noreferrer\" target=\"_blank\">Rules and Guidelines</a> section) character builds for evaluation.  Hopefully, you can use Kamiryn's CBC but will need Excel to use it, else formatting it properly will take some effort.<br/>\n<br/>\nWhen you repost your request, include the actual level cap on the server (very important!) and any adjustments or limitations that the server may have made to game play (i.e. spell nerfs, special cleric domains, etc.).  Even the name of the server itself wouldn't hurt since some of our community may have played there already and can offer some experienced commentary.<br/>\n<br/>\nAlso, include as much information about your preferred play style.  For instance, it appears you would prefer a dual-wield build, but how about a highly-skilled one... like a stealther (to take advantage of the DEX base)?<br/>\n<br/>\nThe more specifics you provide, the easier and faster the guild members can offer some builds to fit your needs.  Those recommended builds will then \"magically\" appear in the appropriate build subforum where they can be further discussed by all of us. Abiding by this procedure, others who may have a similar concept as yours will be able to easily find what they want in the future.<br/>\n<br/>\nOnce again, thanks for taking the time to join our little gathering and let us know a bit more about yourself with an official <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewforum.php?f=13\" rel=\"noreferrer\" target=\"_blank\">intro</a>!</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "4:07 PM - Aug 18, 2011",
      "content": "<div>Topic moved to build request forum.<br/>\n<br/>\n<br/>\nYou are giving up 17 AC by not going fullplate and shield (8 full plate, +1 dex, +3 tower shield, +5 magic vestment on shield) which you can barely recover by self buffing with empower spell and a lucky roll or maximized spell and a +1 item both Wis and Dex (which implies getting the animal or war domain to be able to buff your dex). It can be done though, if you are willing to count on your buffs that much.<br/>\n<br/>\nThat said I wouldn't get a 16 BAB preepic and I'd rather get the most out of DP by keeping BAB at 15 (and moving WS in epic on FTR 4 bonus feat). I'd also go Cleric 18/Monk 6/FTR 6 for an extra epic feat. In epic I'd get EWF, WS, EWS, EP, AS and another feat to be evaluated (ESF maybe?).<br/>\n<br/>\nDex and Wis ending on 20 (4 ability increases each). It seems your build is an elf, given the starting ability spread and that means you'll be getting minimum a 20% XP penalty. Is that acceptable on your server?</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "4:32 PM - Aug 18, 2011",
      "content": "<div>The following build is just something quickly put together keeping present the theme of a dex based, dual kama wielder battle cleric in a lvl 30 capped environment. It gets no XP penalties, aims for Cleric 15 by lvl 20 (to cap buffing spells), gets ESF: Evo to compensate for the lowish Wis when using the good evo attack spells, has a nice skillset and should perform well. Possibly use armor in the lowest levels. Take a look:<br/>\n<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\"><strong>CLERIC(18), MONK(6), FIGHTER(6)</strong></span><br/>\nHuman, any lawful<br/>\n<br/>\n<br/>\n<br/>\n<strong>ABILITIES(ending)</strong><br/>\nSTR: 10<br/>\nDEX: 16 (20)<br/>\nCON: 10<br/>\nWIS: 16 (20)<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\n<br/>\n<br/>\n<strong>BASIC STATS</strong><br/>\nHitpoints: 252<br/>\nSkillpoints: 183<br/>\n<br/>\nSaving Throws (Fortitude/Will/Reflex): 20/22/18<br/>\nSaving Throw bonuses: Spells: +6, Mind Effects: +2, Evasion<br/>\n<br/>\nBAB: 20<br/>\nAB: 28 (melee), 25 (ranged)<br/>\n<br/>\nAC (naked): 29<br/>\n<br/>\nSpeed: +20%<br/>\n<br/>\nSpell Casting: Cleric(9)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>SKILLS</strong><br/>\nConcentration 33(33), Disable Trap 1(5), Hide 33(38), Move Silently 33(38), Set Trap 10(15), Spellcraft 28(30), Tumble 30(35), remaining skillpoints 4<br/>\n<br/>\n<br/>\n<br/>\n<strong>LEVELING GUIDE</strong><br/>\nHuman: (Quick to Master)<br/>\n01: Monk(1): Ambidexterity, Two-Weapon Fighting, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n02: Cleric(1): Domain War, Domain Trickery<br/>\n03: Cleric(2): Weapon Finesse<br/>\n04: Cleric(3): WIS+1, (WIS=17)<br/>\n05: Cleric(4)<br/>\n06: Cleric(5): Extend Spell<br/>\n07: Monk(2): {Deflect Arrows}<br/>\n08: Cleric(6): WIS+1, (WIS=18)<br/>\n09: Cleric(7): Empower Spell<br/>\n10: Cleric(8)<br/>\n11: Cleric(9)<br/>\n12: Fighter(1): WIS+1, Blind Fight, Weapon Focus: Kama, (WIS=19)<br/>\n13: Fighter(2): Improved Two-Weapon Fighting<br/>\n14: Cleric(10)<br/>\n15: Cleric(11): Spell Focus: Evocation<br/>\n16: Cleric(12): WIS+1, (WIS=20)<br/>\n17: Monk(3)<br/>\n18: Cleric(13): Greater Spell Focus: Evocation<br/>\n19: Cleric(14)<br/>\n20: Cleric(15): DEX+1, (DEX=17)<br/>\n21: Fighter(3): Epic Weapon Focus: Kama<br/>\n22: Monk(4)<br/>\n23: Cleric(16)<br/>\n24: Fighter(4): DEX+1, Weapon specialization: Kama, Epic Weapon Specialization: Kama, (DEX=18)<br/>\n25: Cleric(17)<br/>\n26: Cleric(18)<br/>\n27: Monk(5): Epic Spell Focus: Evocation<br/>\n28: Fighter(5): DEX+1, (DEX=19)<br/>\n29: Fighter(6): Armor Skin<br/>\n30: Monk(6): Great Dexterity I, {Knockdown, Improved Knockdown}, (DEX=20)</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:42 PM - Aug 18, 2011",
      "content": "<div><blockquote><div><strong>KailPendragon wrote:</strong>- - clip - - <br/>\nPossibly use armor in the lowest levels.<br/>\n- - etc. --\n</div></blockquote>\nYou've lost me, Kail. <br/>\n<br/>\nIn the first reply, you seem to be advocating the use of armor to gain additional AC.  Fine, I suppose. Then, in the next post which contains a suggested build, you are advocating... what?  Eventually wearing robes by mid epic levels... ?  Confused.<br/>\n<br/>\nIMO, giving up the monk progression to wear armor is not equitable.  That progression can compensate for lower-than-desired ABs and add more APRs to boot.  But if you are going the heavy armor/shield route, the DEX-based skills will become rather pedestrian from the check penalties &amp; max DEX bonus, in which case, why blow the skill points in stealthing?  More confusion.<br/>\n<br/>\nAlso, since all the monk's benefits go *poof* wearing armor except for flurry and stunning fist (and the feat cheese, of course), why choose kama at all?  Kukris would be so much better with a standard progression attack it isn't even a debate. <br/>\n<br/>\nMaybe I just got up on the wrong side of the bed today and can't seem to interpret basic concepts right now.  It happens.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "9:52 PM - Aug 18, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>KailPendragon wrote:</strong>- - clip - - <br/>\nPossibly use armor in the lowest levels.<br/>\n- - etc. --\n</div></blockquote>\nYou've lost me, Kail. <br/>\n<br/>\nIn the first reply, you seem to be advocating the use of armor to gain additional AC.  Fine, I suppose. Then, in the next post which contains a suggested build, you are advocating... what?  Eventually wearing robes by mid epic levels... ?  Confused.</div></blockquote>Aye, my fault trying to be too concise.<br/>\n<br/>\nThere where I say that giving up full plate and shield means giving up 17 AC I am warning the OP that in order to achieve equal or better AC with robes and monk levels he will need, in this case, buffs and possibly gear to make up the difference. As I said, it is doable, although barely so.<br/>\n<br/>\nIn the build presented, I am just showing what can be done with a cleric/monk/ftr that goes the way the OP firstly imagined, that is a robe wearing dexer battle cleric dual kama wielder. As all robe wearers the lowest levels are usually better spent actually using armor until the moment comes when it becomes profitable to do without it. One that way gives up monk attack progression, FoB, Wis AC and extra speed but keeps cleave, evasion and mind save boni and considering cleric buffs, one will do actually better as an armored cleric early on than as a robed cleric.<br/>\n<blockquote><div>IMO, giving up the monk progression to wear armor is not equitable.  That progression can compensate for lower-than-desired ABs and add more APRs to boot.  But if you are going the heavy armor/shield route, the DEX-based skills will become rather pedestrian from the check penalties &amp; max DEX bonus, in which case, why blow the skill points in stealthing?  More confusion.</div></blockquote>First, I'm advocating the possibility to use heavy armor only early on, when robed AC will \"suck\" otherwise. Second, Trickery domain will help with \"roguish\" skills.<br/>\n<blockquote><div>Also, since all the monk's benefits go *poof* wearing armor except for flurry and stunning fist (and the feat cheese, of course), why choose kama at all?  Kukris would be so much better with a standard progression attack it isn't even a debate. </div></blockquote>As above, the heavy armor is for the lowest levels when monk APR are either not yet present or not enough to offset the big hit to AC.<br/>\n<blockquote><div>Maybe I just got up on the wrong side of the bed today and can't seem to interpret basic concepts right now.  It happens. </div></blockquote>No worries. I hope I made clear what I meant. We are all here to learn after all, me included</div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "11:43 AM - Aug 19, 2011",
      "content": "<div>Thanks for the swift replies. I'm a bit surprised, actually, I half expected to find 5 replies in 5 days. I don't understand several of the acronyms, though. I'd appreciate stating the full name.<br/>\n<br/>\nThe server is Arelith, RP.<br/>\nLevel cap 30.<br/>\nMy character is a Moon Elf (basic elf stats).<br/>\nIf you multiclass, you have to take three consecutive levels first. So I can't progress:<span style=\"color:#FF0000\"> 1 Monk, 9 Cleric, 2 Fighter, 3 Cleric</span>.... it'll have to be at least <span style=\"color:#0000FF\">3 Monk, 9 Cleric, 3 Fighter, 1 Monk</span> etc.<br/>\nI want a strong melee priestess that focuses on light fighting, dual-wielding, no armor. I like the feel of swiftness for martial arts, it feels cooler.<br/>\nSpell changes I think are relevant:\n<ul><li>You can't add more than one weapon-buff to the same weapon, and you can't buff magical weapons. So Darkfire and Greater Magic Weapon won't work together, nor will they work on magical weapons. So I probably won't use them.<br/>\nBless: Last rounds instead of turns.<br/>\nFreedom of movement: Doesn't protect from movement speed reduction effects, including those from armour penalty, Slow and Web spells. (Still protects you from the Bigby line of spells, Paralysis, Entangle and similar effects.)<br/>\nGreater Sanctuary: Now rounds per level/2 and it has a \"Cool down timer\" 240 seconds<br/>\nImproved invisibility: Lasts rounds instead of turns. The concealment bonus is still in turns. (Other invis spells also last rounds)<br/>\nTrue Seeing: Last rounds instead of turns.</li></ul>[/list]<br/>\n<br/>\nThe resting system works like this: you have a status (food, thirst, rest) that are maxed at 100%. You can rest only once your rest parameter is below 50%, and every full rest adds around 18%. Every 6 minutes the rest parameter drops by 2%.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:46 PM - Aug 19, 2011",
      "content": "<div><blockquote><div><strong>EliHarel wrote:</strong>My character <strong>is</strong> a Moon Elf </div></blockquote>\nWhat are her ability stats at the moment? What levels, skills and feats have you taken so far?<br/>\nWe also need that info if you already have created the character.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "4:46 PM - Aug 19, 2011",
      "content": "<div>Level 10 Cleric<br/>\n10 STR<br/>\n16 DEX<br/>\n12 CON<br/>\n14 INT<br/>\n16 WIS (now 18 at level 10)<br/>\n8 CHA<br/>\n<br/>\nDomains: War, Trickery<br/>\n<br/>\nNo skills at the moment<br/>\n<br/>\nFeats:<br/>\nExtend Spell,<br/>\nAmbidexterity,<br/>\nWeapon Finesse,<br/>\nTwo Weapon Fighting<br/>\n<br/>\nI'd like if you guys advise concerning this current build, but if there are things that you would have done different (not that I did much so far), I'd like to hear it too, because I might rebuild.</div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "9:04 PM - Aug 19, 2011",
      "content": "<div>Also  Kail,\n<ul><li>Why not take 4 Monk and 4 Fighter pre-epic for the best BAB and an additional attack? Unless I don't get it right.<br/>\nWhy Concentration? Why not Discipline?<br/>\nAnd there are 7 ability score raises until 30, not 8.</li></ul>[/list]</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "10:03 PM - Aug 19, 2011",
      "content": "<div><blockquote><div><strong>EliHarel wrote:</strong>Also  Kail,\n<ul><li>Why not take 4 Monk and 4 Fighter pre-epic for the best BAB and an additional attack? Unless I don't get it right.<br/>\nWhy Concentration? Why not Discipline?<br/>\nAnd there are 7 ability score raises until 30, not 8.</li></ul>[/list]</div></blockquote>\nYou want max of BAB 15 pre-epic to exploit Divine Power to its maximum.  BAB 16 will actually produce an inferior progression.  I never believed it either until I tried it and it works like a charm.  I'll let Kail hash out the other issues you asked.<br/>\n<br/>\n@ Kail (re: my questions above) - Yup.  It was an interpretation problem on my end.  After I thought about it a while, I was considering that you had possibly tried to just explain the deltas of armor vs. robes but it was already in public domain and I was walking the dog who offered no sympathy whatsoever.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "10:27 PM - Aug 19, 2011",
      "content": "<div><blockquote><div><strong>EliHarel wrote:</strong>Also  Kail,\n<ul><li>Why not take 4 Monk and 4 Fighter pre-epic for the best BAB and an additional attack? Unless I don't get it right.<br/>\nWhy Concentration? Why not Discipline?<br/>\nAnd there are 7 ability score raises until 30, not 8.</li></ul>[/list]</div></blockquote>4 FTR levels preepic , if coupled with 3/4 BAB classes respecting the \"rule of four\" means 16 BAB which will grant you a 4th \"natural\" attack at -15 AB. DP (Divine Power), one of the best clerical buffs, will instead add the 4th attack at full AB (not to mention the AB enhancement) which is simply HUGE.<br/>\n<br/>\nThe a bility increases are indeed 7, but you'll notice I used one feat slot for an ability increase.<br/>\n<br/>\nNow, regarding race you are looking at a \"nice\" 40% XP penalty with elf. Considering the leveling rules also human would get a 20% XP penalty here and there. Are you sure you can bite the 40% penalty? It's no small thing...<br/>\n<br/>\nAnyhow, you can turn the build I posted into elf and just rearrange the levels so that you are compliant with your server's rules. You'll lose one preepic feat and 43 skillpoints, but all the rest can remain.<br/>\n<br/>\nEven with the nerfed spells, a cleric is gonna be a force to be reckoned with. And given the low magic setting, GMW is your best shot at getting a powerful weapon, no matter the impossibility to add darkfire. You might be interested in getting scribe scroll and/or craft wand in the build for backup spells, given the rest limits.<br/>\n<br/>\nRegarding the acronyms, you can check <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=21&amp;t=72\" rel=\"noreferrer\" target=\"_blank\">this thread</a> and <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=12&amp;t=77\" rel=\"noreferrer\" target=\"_blank\">thuis one too</a>.</div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "11:58 PM - Aug 19, 2011",
      "content": "<div>I'm not following. Why does taking 15 Cleric levels pre-epic exploit DP to its fullest?</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "12:13 AM - Aug 20, 2011",
      "content": "<div><blockquote><div><strong>EliHarel wrote:</strong>I'm not following. Why does taking 15 Cleric levels pre-epic exploit DP to its fullest?</div></blockquote>It's not about 15 Clerics, it's about 15 BAB at lvl 20. Having BAB 15 at lvl 20 means you get 3 APR. <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Divine_power\" rel=\"noreferrer\" target=\"_blank\">Divine Power</a> will raise your BAB to the BAB of a FTR of the same level as your character; if that increase means you get more APR than you would get without the spell, then the extra attacks will iterate starting from max AB. So with 15 BAB (3 APR, attacks per round), you get +5 AB from DP and an extra attack (your fourth attack in the round) at full AB. With 16 BAB instead, you would get +4 AB from DP (for the same final result) and no extra attack since you already have 4 APR; the 4th attack in the round will, evidently, be made at -15 AB.<br/>\n<br/>\nA practical example of the attack progression, let's assume no WF and let's skip the STR bonus to AB:<br/>\n<br/>\nCleric 17/FTR 3, with no buffs (BAB 15): 15/10/5<br/>\nCleric 16/FTR 4, with no buffs (BAB 16): 16/11/6/1<br/>\n<br/>\nCleric 17/FTR 3, with DP active (+5 BAB): 20/15/10/20<br/>\nCleric 16/FTR 4, with DP active (+4 BAB): 20/15/10/5<br/>\n<br/>\nThe 4th attack at full AB vs -15 AB makes a HUGE difference.</div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "12:27 AM - Aug 20, 2011",
      "content": "<div>Ah, interesting. Some more questions,<br/>\n<ul><li>Isn't Expertise a good choice?<br/>\nWhat things will I use the Evocation for that I'm investing three feats in it?<br/>\nLet me get this straight... with a Human I would get another feat, less XP penalty, and one more full skill? I feel cheated, in choosing an elf!</li></ul>[/list]</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:55 AM - Aug 20, 2011",
      "content": "<div><a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=6&amp;t=96\" rel=\"noreferrer\" target=\"_blank\">Here</a> is one I posted that seems to fit the prereqs but less of a caster than Kail's.  I have neither tested it nor worked out the progressions, but that is fairly similar for most cleric builds.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "1:35 AM - Aug 20, 2011",
      "content": "<div><blockquote><div><strong>EliHarel wrote:</strong>Ah, interesting. Some more questions,<br/>\n<ul><li>Isn't Expertise a good choice?</li></ul></div></blockquote>It depends. If you wanna pump up your AC while casting and do not intend to cast defensively (which tends to imply ICC, improved combat casting) and the expertise while casting switch is set to let expertise work, then it can be. But you are enough feat starved already...<br/>\n<br/>\n<blockquote><div>What things will I use the Evocation for that I'm investing three feats in it?</div></blockquote>\n\nThese are the Evocation clerical spells which have a save (in italics dominion bonus spells):<br/>\n<br/>\nSound burst <br/>\nCall lightning<br/>\nHammer of the gods<br/>\nWall of fire <br/>\nFlame strike<br/>\nBlade barrier<br/>\nChain lightning <br/>\nEarthquake<br/>\nFire storm<br/>\nSunbeam <br/>\nImplosion <br/>\n<blockquote><div>Let me get this straight... with a Human I would get another feat, less XP penalty, and one more full skill? I feel cheated, in choosing an elf!</div></blockquote>A lot of builds work better as humans... and regarding the XP penalty, in my build there's none. Since you have those leveling restrictions you might get some levels with a 20% XP penalty as a human, depending on the leveling path.</div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "5:02 AM - Aug 21, 2011",
      "content": "<div>I ask again - is discipline not that important?<br/>\n<br/>\nAnd if I'd like to make the build more melee, what might I take instead of the three evocation focus feats?</div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "5:49 PM - Aug 22, 2011",
      "content": "<div>And another question. Is this build ideal with a fighter, or with only Cleric and Monk? As well as the other questions abvoe please.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:18 PM - Aug 22, 2011",
      "content": "<div><blockquote><div><strong>EliHarel wrote:</strong>I ask again - is discipline not that important?\n</div></blockquote>\nFor melee, of course it is.  But this is a feat- and skill-starved build so one needs to be prudent to get the most bang for their buck with the few available.<br/>\n<br/>\nSo you have 2 choices as I see it:  1) Ignore discipline entirely or 2) max it and use skill focus feats to boost it to a level where it will actually help to avoid KD/IKD, disarm &amp; called shots from high strength, high AB foes.  DEX focus just puts you in too deep a hole to dig out of it to make much use of the skill.  If you concentrate on buffs/equipment to boost STR to make discipline more effective, all you will do is choke off your AB or other boosts.  Sure, you may avoid the occasional low-level orc barbarian from taking advantage, but in the long run and at advanced levels, it won't provide much for the investment.  If you calculate the DCs it should become readily evident what percentage of saves will occur with a pedestrian base discipline.<br/>\n<br/>\nSo then ask yourself \"Which skill(s) will provide a more reliable benefit?\"... and then allocate accordingly.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:32 PM - Aug 22, 2011",
      "content": "<div><blockquote><div><strong>EliHarel wrote:</strong>I ask again - is discipline not that important?<br/>\n<br/>\nAnd if I'd like to make the build more melee, what might I take instead of the three evocation focus feats?</div></blockquote>\n\nDude, Discipline is modified by STRENGTH, your build is DEX. At level 30 you will have 33 Discipline plus your strength modifier which is shit. You really should have more than 33 AC by then, I reckon. If your AC can be much higher than your discipline, then you're better off putting those skill points somewhere else.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "8:59 PM - Aug 22, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><blockquote><div><strong>EliHarel wrote:</strong>I ask again - is discipline not that important?<br/>\n<br/>\nAnd if I'd like to make the build more melee, what might I take instead of the three evocation focus feats?</div></blockquote>\n\nDude, Discipline is modified by STRENGTH, your build is DEX. At level 30 you will have 33 Discipline plus your strength modifier which is shit. You really should have more than 33 AC by then, I reckon. If your AC can be much higher than your discipline, then you're better off putting those skill points somewhere else.</div></blockquote>Discipline gets also a D20 on top and this cleric Str modifier, buffs included is gonna be +3/+4. That means 36-37 discipline, plus 1d20. The AC needs to be significantly higher than that score<br/>\n<br/>\n10 +6 tumble +2 AS +5 dex +5 wis +1 monk +3/4 dex enhancements +3/4 wis enhancements +5 magic vestment +5 shield of faith +4 haste +1/2 natural (if from gear, given the low magic environment) or +5 natural if from spell +1/2 dodge from gear = 51-55 without barkskin, 55-58 with access to barkskin. In the worst case Ac wise, discipline gets a maximum usefulness of hits 5 points above the cleric's AC.<br/>\n<br/>\nSo the question is, is it worth the skill points invested?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:46 AM - Aug 23, 2011",
      "content": "<div><blockquote><div><strong>EliHarel wrote:</strong>I ask again - is discipline not that important?<blockquote><div><strong>KailPendragon wrote:</strong><br/>\n10 +6 tumble +2 AS +5 dex +5 wis +1 monk +3/4 dex enhancements +3/4 wis enhancements +5 magic vestment +5 shield of faith +4 haste +1/2 natural (if from gear, given the low magic environment) or +5 natural if from spell +1/2 dodge from gear = 51-55 without barkskin, 55-58 with access to barkskin. In the worst case Ac wise, discipline gets a maximum usefulness of hits 5 points above the cleric's AC.\n</div></blockquote></div></blockquote>\nPay close attention, EliHarel.  Someday maybe you'll be able to crunch the numbers as concisely as a master builder.  I still retain a few threads of hope for myself.   Meanwhile, nothing beats the 'ol pencil for finger exercise *scribbling feverishly*.  How's he do that?  Years of practice, I suspect. *g*</div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "1:54 AM - Aug 23, 2011",
      "content": "<div>Haha, that's frighteningly close to what I got when I tested it with server items - pretty much.<br/>\nTwo questions still stand. And one clarification:<br/>\n1. I don't understand the comment about the expertise. If it's a should or shouldn't.<br/>\n2. Are the fighter levels the best way for this melee build?<br/>\n3. If I don't want the evocation focuses, what other three feats should I take?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:32 PM - Aug 23, 2011",
      "content": "<div><blockquote><div><strong>EliHarel wrote:</strong>Haha, that's frighteningly close to what I got when I tested it with server items - pretty much.<br/>\nTwo questions still stand. And one clarification:<br/>\n1. I don't understand the comment about the expertise. If it's a should or shouldn't.<br/>\n2. Are the fighter levels the best way for this melee build?<br/>\n3. If I don't want the evocation focuses, what other three feats should I take?</div></blockquote>\nI don't know about the other members, but I am getting confused as to what build you are using now and what sort of level-guide you are following or intend to follow.  I find it difficult to discuss these issues without one to reference.  Kail posted one here and I assume you have resequenced it according to the Arelith server constraints.  If you would post an official looking build (skill allocation guide not really necessary at this point IMO), it would be easier to figure out how much wiggle room you have feat-wise.<br/>\n<br/>\nI think Kail's explanation of the feat choices were in regards to AoOs vs. extra AC from expertise and whether you would be planning to use defensive casting or not.  Expertise will help with AC but not against AoOs.. defensive mode will help.  However, if you would like all those benefits while casting, you'd need Combat Casting/Imp Combat Casting and Expertise.  That's 3 feats, and I'm not sure how you would ever fit them into this build.  In any case, only one combat mode can be active at a time so therein lies the issue.<br/>\n<br/>\nLet's see what you are using at this time so we can all hit the ground running to make better decisions. Eh?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:11 PM - Aug 23, 2011",
      "content": "<div>I wouldn't dwell much on it Hip, the OP seems to know very little about the game, so I am guessing he's having a hard time understanding what Kail says. I think he'd best experiment with a couple of alternatives and then start making up his own mind about what is good and what isn't.<br/>\n<br/>\nI can't speak for others, but I would NEVER EVER take Combat Casting an a build, EVER! I have in the past, precisely because I had no clue what I was doing at the time <br/>\n<br/>\nAnyway. Eli, you should try to use what Kail is telling you without understanding it. I know it sounds stupid, but by heeding his advice, you will begin to understand.<br/>\n Trust me on this. That's kinda how I learned .<br/>\n<br/>\nThere is a frenchman called Jean Piaget who studies human learning process. He says that you need to have a sufficient background of knowledge in order to understand certain new theories or as he calls them, challenges. You don't possess such background and it has been shown in your comments. But you are eager to learn, which is great, so instead of trying to lead us to the answers you require with your currently thin knowledge of the game, I suggest you let the masters, such as Kail, who have crafted at least 100 builds and published many of those, guide you towards enlightenment. Do as he says even if you don't yet understand why, and you'll save yourself A LOT of frustration of learning through trial and error. I don't mean to be rude at all, just trying to save you part of the trouble I went through before I finally reached the conclusion that I was better off following their advice . It can be hard to do, but once you do it, you'll understand EXACTLY why it's so.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "1:27 PM - Aug 25, 2011",
      "content": "<div>Oh, I understand and agree Maximilian. Then again, it'll take me over a year to reach 30. It's a lot of work and effort, so I don't want to find myself regretting anything once I reach it. I've agreed to nearly all the suggestions. The only thing I still would like to understand more is the evocation focus feats, especially since so few spells seem  to have it as a domain, and what melee-oriented feats I should take in their stead - if at all.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:30 PM - Aug 25, 2011",
      "content": "<div><blockquote><div><strong>EliHarel wrote:</strong>Oh, I understand and agree Maximilian. Then again, it'll take me over a year to reach 30. It's a lot of work and effort, so I don't want to find myself regretting anything once I reach it. I've agreed to nearly all the suggestions. The only thing I still would like to understand more is the evocation focus feats, especially since so few spells seem  to have it as a domain, and what melee-oriented feats I should take in their stead - if at all.</div></blockquote>\n\nYou won't regret anything. It's a Kail Pendragon Cleric build. Nuff said. This guy has been making VERY GOOD NWN characters since 2003. Follow his advice and you'll be very happy, I assure you. Evocation focus is for IMPLOSION. You probably don't know this, but implosion isn't affected by death magic immunities, You can kill ANYTHING instantly as long as it fails its save. As if not being affected by immunities wasn't enough, there is also the fact that it has an INNATE +3 to DC. There are no good lvl 9 cleric spells other than implosion and storm of vengeance, and you wouldn't believe how drastically these spells could improve your combat strategy, so pick between Conjuration and Evocation for a school to focus on. I would go with Evocation, which also affects Fire Storm, Hammer of the Gods, Blade Barrier and Flame Strike. Those are all nice to have and the higher their DC is, the more effective they will be.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "11:43 PM - Aug 25, 2011",
      "content": "<div>So since I'm an elf, and have one feat less, what should I give up? Blind Fight?<br/>\n<br/>\n[Grumbles,] And I still think not taking Expertise is bad...</div>"
    },
    {
      "author": "EliHarel",
      "avatar": "no_avatar.png",
      "timestamp": "1:14 AM - Aug 26, 2011",
      "content": "<div>Oh, and since I'll be having one less skill, what should I give up? Still go with Stealth, even if it won't be full?</div>"
    },
    {
      "author": "Richelieu",
      "avatar": "no_avatar.png",
      "timestamp": "7:15 PM - Sep 03, 2011",
      "content": "<div>I am not sure if this is really the right place to ask this question so sorry if it is not.<br/>\n<br/>\nReading through this thread I note that you advise 15 bab pre epic to take advantage of the Divine Power exploit. According to the nwnwiki this exploit was prevented/fixed in version 1.68. So, was it un-fixed in version 1.69?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:09 AM - Sep 04, 2011",
      "content": "<div><blockquote><div><strong>Richelieu wrote:</strong>I am not sure if this is really the right place to ask this question so sorry if it is not.<br/>\n<br/>\nReading through this thread I note that you advise 15 bab pre epic to take advantage of the Divine Power exploit. According to the nwnwiki this exploit was prevented/fixed in version 1.68. So, was it un-fixed in version 1.69?</div></blockquote>\nI don't know what the pre-v1.68 exploit was tbh.  In it's current form, it's not an exploit.  It follows the normal attack at full AB for extra attacks.  All that you are doing is moving the full AB attack up a notch by changing the progression.  Since that 4th APR  never occurs,(as it would with a BAB of 16 or higher) you permanently avoid an attack at -15 AB. <br/>\n<br/>\nIt works the same with any spell that imparts an extra attack (like Haste). <br/>\n<br/>\nYour question is not off-topic because it is crucial to getting the most out of a DP build.  But, you could have easily just referenced this build as a source, posted the question as a General Discussion topic and got the same answer.   <br/>\n<br/>\nThe disadvantage of burying useful general info in a build thread is that the same question will likely be asked over and over until it finally gets posted where others can find it easily.  No apologies are needed.  It happens.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:14 AM - Sep 04, 2011",
      "content": "<div>I happen to know the \"exploit\" that did happen and got fixed post 1.68. It has to do with DP but not directly. It's about the stacking of multiple extra attacks when you have many sources of it: DP, Haste and Rapid Shot or Flurry of Blows.<br/>\n<br/>\nPre 1.68, if your full ab was 40 (and your pre-epic BAB of 15), here is how it would look:<br/>\n<br/>\n+40/+35/+30/+40/+40/+40.<br/>\n<br/>\nAll three extra attacks would come at full BAB, well actually it'd be +38 because Rapid Shot and Flurry of Blows both take away 2 AB to work, but you get the point anyway.<br/>\n<br/>\nPost  1.69, what they did was add each extra attack at -5 from the previous one, so it became:<br/>\n<br/>\n+40/+35/+30/+40/+35/+30<br/>\n<br/>\nbasically that was an exploit with multiple extra attacks all being at full BAB, but if you get only 1 extra attack, it is at full BAB. If you have perma-haste, the extra attack from DP effectively comes at -5 from full BAB, because Haste already grants you an extra attack at full BAB.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Richelieu",
      "avatar": "no_avatar.png",
      "timestamp": "4:12 PM - Sep 05, 2011",
      "content": "<div>Ahhh okay. Makes much more sense now. <br/>\n<br/>\nHowever, If you were a fighter class with full bab your fourth attack wouldnt be at full ab would it? Still seems like kind of an exploit to me, even if it is much less of one than it used to be. I havent played played pnp d&amp;d since, well... a long time, so I dont know how Divine Power is supposed to work but I would have thought it would add the extra attack following the usual progression.<br/>\n<br/>\nAnyway, thanks for clearing that up.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:56 PM - Sep 05, 2011",
      "content": "<div><blockquote><div><strong>Richelieu wrote:</strong><br/>\nHowever, If you were a fighter class with full bab your fourth attack wouldnt be at full ab would it? Still seems like kind of an exploit to me, even if it is much less of one than it used to be. </div></blockquote>\nIt's not so much that it is a fighter type-class nuance, it's just the basic dynamic of BAB.  At 16, the 4th APR shows up in the progression by virtue of that particular BAB rather than the class used to reach that level.  Naturally, a pure fighter-type reaching BABs over 15 will get less of an advantage from DP than a multiclass that doesn't.  For that matter, depending on how you view it, an intentionally-designed low strength build can \"exploit\" the benefits of DP even more than others with the autoboost to 18 STR.<br/>\n<br/>\nInterpreting the term \"exploit\" can become an exercise in semantics when it comes to building because in many cases it can simply be \"maximizing potential\" depending on one's personal bias(es).  It is difficult to recognize what the original designers of the game intended by setting up the dynamics they did.  In a few cases, they realized the imbalance that certain interactions caused and corrected them via patches (as described by Max, above).  Further balancing attempts have been made by custom content designers to achieve what THEY personally feel is better.  I never experienced any further customizations of DP's functionality anywhere (though it's not out of the realm of possibility) so I must assume that most folks are satisfied with how it works as part of the cleric arsenal and therefore not exploitation in the majority sense.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:19 AM - Sep 08, 2011",
      "content": "<div><blockquote><div><strong>Richelieu wrote:</strong>Ahhh okay. Makes much more sense now. <br/>\n<br/>\nHowever, If you were a fighter class with full bab your fourth attack wouldnt be at full ab would it? Still seems like kind of an exploit to me, even if it is much less of one than it used to be. I havent played played pnp d&amp;d since, well... a long time, so I dont know how Divine Power is supposed to work but I would have thought it would add the extra attack following the usual progression.<br/>\n<br/>\nAnyway, thanks for clearing that up.</div></blockquote>\n\nPnP is PnP and NWN is NWN. I say this because NWN is BASED on PnP but isn't supposed to be an exact replica. For starters, it's a REAL TIME game rather than a turn based one like PnP is. Skill dumps, a very important part of building for NWN are not present in PnP. And I'm sure there are thousands of differences between these games. Both are great fun, but each to their own. Improved Initiative is almost worthless in NWN, but mages with Improved Initiative were a REAL PAIN in the arse back when I used to play PnP.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "5:23 PM - Sep 09, 2011",
      "content": "<div>\"To exploit\" does not mean that there is an \"exploit\". I use \"to exploit\" meaning \"to take advantage of\".</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "5:34 PM - Sep 09, 2011",
      "content": "<div><blockquote><div><strong>KailPendragon wrote:</strong>\"To exploit\" does not mean that there is an \"exploit\". I use \"to exploit\" meaning \"to take advantage of\".</div></blockquote>\n\nWho me??  LOL  If you were a member of the guild in 2006, you HAD to use exploits or exploit things!  Then there is Web's defender/arcane archer.  Not an exploit at all!  <br/>\n<br/>\nok, sorry about the OT.  Back to your regular scheduled exploiting-ness...</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "6:19 PM - Sep 09, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong><blockquote><div><strong>KailPendragon wrote:</strong>\"To exploit\" does not mean that there is an \"exploit\". I use \"to exploit\" meaning \"to take advantage of\".</div></blockquote>\n\nWho me??  LOL  If you were a member of the guild in 2006, you HAD to use exploits or exploit things!  Then there is Web's defender/arcane archer.  Not an exploit at all!  <br/>\n<br/>\nok, sorry about the OT.  Back to your regular scheduled exploiting-ness...</div></blockquote>I didn't say that there shoulod be no exploits, just that exploiting something does not have to be always about exploits <br/>\n<br/>\nAnd BTW have you seen my human Bard/BG/AA without the cleave feat? <br/>\n<br/>\nBack on topic now.</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "1:32 AM - Sep 10, 2011",
      "content": "<div><blockquote><div><strong>KailPendragon wrote:</strong><blockquote><div><strong>avado wrote:</strong><blockquote><div><strong>KailPendragon wrote:</strong>\"To exploit\" does not mean that there is an \"exploit\". I use \"to exploit\" meaning \"to take advantage of\".</div></blockquote>\n\nWho me??  LOL  If you were a member of the guild in 2006, you HAD to use exploits or exploit things!  Then there is Web's defender/arcane archer.  Not an exploit at all!  <br/>\n<br/>\nok, sorry about the OT.  Back to your regular scheduled exploiting-ness...</div></blockquote>I didn't say that there shoulod be no exploits, just that exploiting something does not have to be always about exploits <br/>\n<br/>\nAnd BTW have you seen my human Bard/BG/AA without the cleave feat? <br/>\n<br/>\nBack on topic now.</div></blockquote>\nYeah!  I forgot about that one!  You two are just beyond any of us mere mortals!</div>"
    }
  ]
}