{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "196",
  "name": "Monk: strength based vs dex based",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/monk-strength-based-vs-dex-based-t2354831.html",
  "author": "samurainostalgique",
  "avatar": "10235237_1517392314.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "10:48 PM - Mar 13, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Having experimented with both STR and DEX monks (though more so with DEX ones), I'm still not sure which one of the two I prefer.<br/>\n<br/>\nMaximilian Kane told he me finds STR monks to be rather bad, because of low AC. It's true that while most STR monks with at least 25 levels of monk can theoretically achieve over 60 AC at level 40 (assuming +5 items and haste), which I think is acceptable, a lot of that AC is dependant on DEX and WIS buffs from magic items and pots, which means that in reality, in many environments, AC will be much lower, as capping STR, WIS and DEX all at the same time is often impossible. <br/>\n<br/>\nThat being said, I know that Max is a bit of an AC maniac, and I do find DEX monks low damage quite annoying at times, especially against high DR monsters. Exceptions to that would be cleric/monks, who can add quite a lot of damage through buffs (but those are either more cleric than monk, or they are easy to dispel), and rogue/monks or assassin/monks (but these depend on sneak attacks to deal damage, so if you don't manage to catch the opponent flat-footed, or worse, if he's immune to critical hits, you're back to the typical dex monk damage). <br/>\nOne time, I went up against a demi-lich with an unarmed DEX based monk/fighter/rogue, not knowing about it's huge DR. I wasn't able to deal even one point of damage (though I guess that given its low AC, I could have damaged it had I taken the improved power attack feat).<br/>\nAnd of course, I can't deny the appeal of dev crit in environments where it is allowed.<br/>\n<br/>\nSo I was wondering what was the general concensus here about STR vs DEX for monks.<br/>\n<br/>\nDo you have any experience playing with both types? Which do you think is overall more powerful?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:16 PM - Mar 14, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">They are about equal &amp; yes I have played with all three styles (str-based unarmed/ dex-based unarmed/ dex-based kamas). The difference is the magic level &amp; the playing style of each player. In general up to medium magic worlds, the str-based unarmed style is better but as soon as you change to a high magic world (typical level of most modules) then dex-based unarmed becomes better because the damage is only slightly less than the str-based version although you gain epic dodge &amp; a higher armour class. In high magic worlds where they exist good kamas, the farming-implements master becomes better than any other version, not only he can match and exceed the damage of the dex-based unarmed monk but also he has the advantage of having more item slots...<br/>\n<br/>\nMy personal preference though will always be a good str-based unarmed monk, they way it should be IMO, unless I am making him a kensai. That's the way I enjoy them at least.<br/>\nYou can see one truly monstrous example of this style here, one of the few times were I go all-out (because of the theme).<br/>\n<br/>\n<span style=\"color:#990000\"><strong>One-Punch Man</strong></span> =&gt;&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/one-punch-man-monk-25-sorcerer-1-rdd-14-t2354529.html\" rel=\"noreferrer\" target=\"_blank\">one-punch-man-monk-25-sorcerer-1-rdd-14-t2354529.html</a><br/>\n<br/>\nGood luck with your monk and don't forget it's more about what <em><strong>you </strong></em>enjoy rather than what is most safe/powerful etc...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "9:16 AM - Mar 15, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In all my time on different PWs, I have tried 2 monks over time. Both unarmed, because of the gloves on my server, and both Elves, for some unknown reason. <br/>\n<br/>\nThe first one, which was good fun and quite powerful, was the one Valerfor mentions, the order of the Wyrm. I think I did her Monk26/Sorc4/RDD10. I might have relevelled later when I got more experience as player. It's quite the no-brainer, and it runs around fast, has good defenses, and quite playable. If you can do alignment shifts, I'd recommend Bard instead, but no biggie.<br/>\n<br/>\nThe other, however, is dex-based. Shadowpriest (Cleric26/monk9/SD5) is much better, in the end. And it is also very playable, going Cleric mode with weapons and armour for a long time. No Epic Dodge until 39, tho, for max output. On my PW, however, I did an easier levling, and remade him at 40. You could earn relevel tokens. That is not mainly a monk tho.<br/>\nI think a monk-heavy SD1 comboed with rogue or assassin could perform well as a dex-base without caster, but it never tempted me.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}