{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "170",
  "name": "Butt-Kicking for Goodness!",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/butt-kicking-for-goodness-t2354515.html",
  "author": "HipRedux",
  "avatar": "10404082_1510287071.jpg",
  "replies": 11,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:02 AM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Attention-grabbing headline, but for a worthy cause, I trust.<br/>\n<br/>\n I was reading Mick Dagger's Elven Kama-Shinobi (Monk 9/Assassin 26/SD 5) build and had a gripe about only evil guys and gals being Assassins ('primarily because it's a wonderful construction). Thus, I vowed to come up with a suitable build to stand on the right side of the night and match him/her.<br/>\n<br/>\n Now, I'm not saying I've failed (yet), but I could do with some assistance against the forces of Darkness. Thus far, I've established that a certain synergy does exist, in that the Monk 9 and Shadowdancer 5 should remain constant, with Ranger 26 replacing the Assassin levels. Equally, I can get Dodge, Mobility, Finesse and WF:Kama in the build pre-epic, leading to Epic Dodge in Epic. Ranger being Ranger, I don't have to worry about Ambidexterity, 2 Weapon-Fighting and its big brother, so can replace them with Blind Fighting, Imp Crit and (probably) Luck of Heroes (to help with saves).<br/>\n<br/>\n I will, of course, also get at least 2 Favoured Enemies pre-epic, but herein lies my request for assistance. While my instinct is to go Ranger 10/ Monk 9/ Shadowdancer 1 pre-epic, I'm not sure that it's any better than Ranger 9/ Monk 9/ Shadowdancer 2, Ranger 10/ Monk 6/ Shadowdancer 4, or Ranger 9/ Monk 6/ Shadowdancer 5, and my head's beginning to hurt.<br/>\n<br/>\n Also, once again taking my lead from Minsc - always a good reference point for sensible character choices -  is it the case that goodness must be <em>seen</em> to kick bad men in the evils, or should his other aphorism hold true - \"Night time, good for sneaking up on evil!\". In other words, do I not fully load Hide and Move Silently - perhaps giving room for Spellcraft and Discipline? (I can't get UMD or Trap skills either, so maybe there's room for stealth as well as the aforementioned).<br/>\n<br/>\n I'm currently, and fairly obviously, in concept development mode, but I hope and trust the forces of righteous butt-kicking will come to my aid.<br/>\n<br/>\n<em>Damn it, I tried linking to Mick's build, but failed several times. Not sure what I'm doing wrong, it's worked before...</em><br/>\n<br/>\n EDIT: I know Empyre gave me the shorthand way of doing this, but let's see if it works longhand. The link to Mick's build is: <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2350791/KamaShinobi-Monk-9-Assassin-26-SD-5#.Vvc0_TFnEqg\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... vc0_TFnEqg</a><br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:19 AM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Have you heard of the rule of 4? The 3/4 classes like Monk and SD (and some others) get +0 BAB first, then 3 levels of +1 BAB, and then +0 again, and so on. Because of this, you should have a multiple of 4 levels of each such class pre-epic. In epic levels, you get +1 BAB every other level no matter what class you take. So, in this build, you should either wait until epic levels to take SD, or take 4 levels of SD pre-epic. Ranger 10 / Monk 6 / SD 4 would work because the 9th and 10th levels of Ranger would complete the set of 4 started by Monk 5 and 6. You would wind up with a BAB of 17 at level 20, which is 1 more than enough to get your last attack.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:42 AM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Empyre, I think I must have been posting the link while you replied. I had heard of the rule of 4 before, but TBH had no idea what it meant - cheers for making it relevant to me. At least one of the options I was considering conforms to it!<br/>\n<br/>\n Apart from anything else, I need this to be a good one - I'm setting myself up against one of the best. Thank the gods of Faerun that it won't come down to one-on-one, or I may have to rely on Boo to make up for my deficiencies!<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Oh, crap. I just did a search, and now I've got to deal with Demos' Ghost Viper as well. Admittedly, different race and spread, but the jaws on that old worm-can just keep getting wider...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:44 PM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Dunno.  Maybe Kaliban99's Kama Fury ver. 2 (Ranger 25/Monk 10/SD 5) works for you.<br/>\n ED at 30 &amp; BoE at 36.  It's stealth.  This is human, however.  Elf and halfling will have an XP penalty.  But the best AB/AC/stealth combo will be halfling. Elf better for detection.  I noticed ImpInit which could be replaced, or Toughness if you run short on feats.  Not sure about the effect of losing that 40+ skills departing human, though.  No schedule shown. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\nSpoiler [+]<br/>\n<br/>\n Playable from level 1 - 40 ..PvM Build<br/>\n<br/>\n Kama Fury version 2....in which our hero rebuilds himself in a more advantageous fashion...specifically: More Ranger, more Favored Enemies, earlier Bane of Enemies, more Epic Feats, more Monk (and more Monk speed!), less redundant Shadow Dancer, same Epic Dodge and more BA.<br/>\n<br/>\n Special thanks to Grizzled Dwarflord for taking time to explain slowly (and with small words) where I went awry in my first attempt. Thanks too for Avendesora84 for his advice.<br/>\n<br/>\n Note that this particular build version is geared for a slow (normal) leveling PW, and not for a \"Get to level 40 in 1 hour!\" PW. For a fast-leveling mod, the more 'uber-l33t' build would be Ranger 26/Monk 9/SD 5.<br/>\n<br/>\n I looked through the list of builds to see if an Epic Dodge Monk/Ranger was out there, but didn't see one that quite fit what I was thinking of. My goal was a build that included these attributes:<br/>\n<br/>\n     Dexterity-based scrapper<br/>\n     Dual wielding of Kamas<br/>\n     Bane of Enemies<br/>\n     Epic Dodge<br/>\n     Flurry of Blows<br/>\n<br/>\n Kama Fury Version Two<br/>\n Classes: Ranger 25/Monk 10/SD 5<br/>\n Race: Human<br/>\n Alignment: Lawful<br/>\n<br/>\n Stats (start/finish)<br/>\n Str 12<br/>\n Dex 16/28<br/>\n Con 14<br/>\n Int 12<br/>\n Wis 14<br/>\n Cha 8<br/>\n<br/>\n 1 Ranger 1 Dodge, Wpn Finesse, FE: Undead<br/>\n 2 Monk 1<br/>\n 3 Monk 2 Wpn Focus: Kama<br/>\n 4 Monk 3<br/>\n 5 Monk 4<br/>\n 6 Monk 5 Toughness<br/>\n 7 Monk 6<br/>\n 8 Ranger 2<br/>\n 9 Ranger 3 Blind Fight<br/>\n 10 Ranger 4<br/>\n 11 Ranger 5 FE: Humans<br/>\n 12 Ranger 6 Imp. Crit: Kama<br/>\n 13 Ranger 7<br/>\n 14 Ranger 8<br/>\n 15 Ranger 9 Imp. Initiative<br/>\n 16 Monk 7<br/>\n 17 Ranger 10 FE: Dragons<br/>\n 18 Ranger 11 Mobility<br/>\n 19 Ranger 12<br/>\n 20 Monk 8<br/>\n 21 SD 1 Great Dex I<br/>\n 22 SD 2<br/>\n 23 SD 3<br/>\n 24 SD 4 Great Dex II<br/>\n 25 SD 5<br/>\n 26 Monk 9<br/>\n 27 Ranger 13 Epic Wpn Focus: Kama<br/>\n 28 Ranger 14<br/>\n 29 Ranger 15 FE: Elves<br/>\n 30 Ranger 16 Epic Dodge<br/>\n 31 Ranger 17<br/>\n 32 Ranger 18 Armor Skin<br/>\n 33 Ranger 19<br/>\n 34 Ranger 20 FE: Dwarves<br/>\n 35 Ranger 21<br/>\n 36 Ranger 22 Bane of Enemies<br/>\n 37 Ranger 23 FE: Giants<br/>\n 38 Ranger 24<br/>\n 39 Ranger 25 Epic Prowess, FE: Magical Beasts<br/>\n 40 Monk 10<br/>\n<br/>\n AC 33 HP 415 BA 28<br/>\n AB: 39/36/33/30/27/24 &amp; 39/36<br/>\n Saves: Fort 26/Reflex 29/Will 22<br/>\n Skills: Max: Tumble, Disc, Hide &amp; MS, Spellcraft: 20, Heal: 10, Dis. Trap: 20, Open Lock: 20<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:57 PM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would pick The Shadow Priest (monk 9/ cleric26/ shadowdancer 5) by Max. That build is a real butt-kicker and can have LG, LN or LE alignment.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:30 PM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>I would pick The Shadow Priest (monk 9/ cleric26/ shadowdancer 5) by Max. That build is a real butt-kicker and can have LG, LN or LE alignment.</div></blockquote>\n<div align=\"left\"><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515430/\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/515430/</a></div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:30 PM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good thoughts, all. Thank you.<br/>\n<br/>\n @ Mick: I dare say you're right, but my problem (one among my many problems) here is that I've never played a cleric, and I do like to play the builds. It's bad enough that I'm not by inclination a stealther and I'm trying to build one, but to have 2 classes I'm unfamiliar with might be pushing things a bit far.<br/>\n<br/>\n @ Hip: I've had a look at Kaliban99's Kama Fury, and it does look interesting. I'm not entirely sure that the +1AC given by Monk 10 is superior to the additional bonus feat Ranger 26 gives, but that's a minor point.<br/>\n<br/>\n I have been giving it some more thought, to refine what I'm looking for if I'm to mirror Mick's build. Obviously, it'll be more of a circus Hall of Mirrors than an exact reflection, but here's my thinking so far, including the parameters (admittedly arbitrary ones) I'm making myself work within. While I agree that Halfling would be a great choice, I fear that I have to stick with Elf, along with the same starting stats (doing a sort of \"two brothers who took a different fork in the road\" routine). Early on, I think it has to be Ranger in order to reach Imp 2-Weapon Fighting asap, as I tend not to dual-wield until I have that feat. It also fits with the idea of a slow strip for early protection - start in leathers or med armour, probably even with a shield, and end up in naught but a chiffon blouse. This naturally has implications for when SD becomes a useful option, and I'm now thinking I might leave it until Epic, and then race to get ED asap. Thus, I'm thinking maybe Ranger 16 / Monk 4 in pre-epic (which will also help with BAB. What I'll lack in AC I'll make up for in firepower. I hope.). If I understand correctly, this will mean an xp penalty, but that's something I don't think I can avoid with this construction anyway (while remaining committed to Elf, that is). Then blast in with the 5 SD levels and 4 more Monk (leaving 1 for a final Tumble dump at L37).<br/>\n<br/>\n<strong><em>EDIT:</em></strong> On reflection, perhaps 10 Monk levels and 25 Ranger would be a good idea after all. That way I can get Imp Evasion earlier as well as the +1AC, and I only really need BoE, Epic Prowess and EWF as Ranger bonus feats in epic.<br/>\n<br/>\n Does any of this sound viable, or am I wasting everyone's time?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:45 PM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">IMO, the reason Mnk 10/Rgr 25 is better than Mnk 9/Rgr 26 on slow-leveling environment is because you can get Epic Dodge much sooner.  Qualifying for ED and the final dump level do not need to coincide and force ED back so far it hardly gets used at all.  Just the access to Ki Strike means nothing at all to the build mechanics.  It is at the cost of another FE but as long as BoE is there at a reasonable point in the build, I don't think you'll miss the +1 damage as much as ED at 30..  The same rationale goes for cleric 26 as well, so choose wisely. <br/>\n<br/>\n However, if this toon is planned for Level 40+ server, stick with the minimum reqs for ED and grab the extra feat. For servers like that, you design as if your starting toon was Level 40 (which is what Kaliban pretty much echoed in his comments).  Fast-leveling environs tend to be high-magic so you can factor that into the mix as well.  On high-magic, typically ALL types of spellcasters (including self-buffers) suffer badly.<br/>\n<br/>\n Design Rule #1 never changes: Always design for the environment.<br/>\n<br/>\n That means the better you define the intended setting, the easier it is to optimize for that situation.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:29 PM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think I've got a rough map to share with you. Please clip my ear if I've got something wildly wrong. I've not got it in standard format yet (still compiling with PnP), nor have I completed a skills allocation, but it runs something like this:<br/>\n<br/>\n Elf: Ranger 25/ Monk 10/ SD 5<br/>\n LG (on principle)<br/>\n<br/>\n Level 1-6: Ranger (1-6), with feats of LoH (L1), Finesse (L3) and Blind Fighting (L6). (Throughout, the FEs depend on environment)<br/>\n Level 7: Monk (1)<br/>\n Level 8-10: Ranger (7-9), with WF:Kama (L9)<br/>\n Level 11-12: Monk (2-3), with Imp Crit:Kama (L12)<br/>\n Level 13-16: Ranger (10-13), with Dodge (L15)<br/>\n Level 17: Monk (4)<br/>\n Level 18-20: Ranger (14-16), with Mobility (L18)<br/>\n Level 21-22: SD (1-2), with GDEX I (L21)<br/>\n Level 23-24: Monk (5-6), with GDEX II (L24)<br/>\n Level 25-27: SD (3-5), with GDEX III (L27)<br/>\n Level 28-30: Monk (7-9), with ED (L30)<br/>\n Level 31-37: Ranger (17-23), with GDEX IV (L33), GDEX V (L36), and EWF and BoE at either L34 or L37<br/>\n Level 38: Monk (10)<br/>\n Level 39-40: Ranger (24-25), with GDEX VI (L39) and EProwess (L40)<br/>\n<br/>\n The stats are as Mick's build: STR10, DEX 18(34), CON12, WIS14, INT14, CHA8.<br/>\n HPs: 410<br/>\n AC: 34<br/>\n +30% speed<br/>\n BAB: 29<br/>\n AB (max): 45 (melee), 41 (ranged)<br/>\n Dual-Wield Kama: 43/40/37/34/31 (main hand) 43/38 (off-hand)<br/>\n Skills - 268: Disc 43 (43), Hide 43 (45), Move Silently 43 (45), Search 20 (22), Spellcraft 18 (20), Spot 43 (45), Tum 40 (52)<br/>\n Saves (bit low for my liking): F24/R32/W19<br/>\n<br/>\n Of course, there are choices to weigh - the main one being whether to go for ED earlier, at the expense of EWF and BoE, or the other way around. At the moment, I lean towards ED first, but I'm happy to be convinced otherwise. (I will, of course, make it look acceptable once I get your thoughts in - assuming they aren't simply \"bin it, it's crap\".)<br/>\n<br/>\n Anyway, as it stands, does it look halfway reasonable, or halfway toilet?<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, Hip, you must have posted as I was pulling the above together - I wasn't ignoring you!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "10:13 PM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I suggest moving both WF and ImpCrit as far forward as possible since a single AB can make so much more difference in the first 5 or so levels.  Mnk1 @Level 2 means you will be able to focus @Level 3 which is the best case scenario.  Blind Fight can be postponed until after IC unless there are loads of shadow types in early going and that is rare.  I would expect your toon to use chain shirt/kama/shield until the cut-over to robes, probably sometime around Level 10-16.  As an alternative, you could use your pet while sniping behind with longbow or shurikens, but without the monk progression, naturally. <br/>\n<br/>\n In any event, I'd try to get Dodge in before committing full to robed DWing, if at all possible.   You'll be immediately gaining back the monk/WIS AC you lost while singlehand attack mode.  From that point forward, no other equipment configuration will be as efficient as the one using DW in robes.<br/>\n<br/>\n Why could this possibly be trash?  During the period when Kaliban's build was posted, everyone tested their builds on their fav server or campaign before posting.  You haven't reinvented the wheel here.  You just painted it elf green instead of human... ummm... what color DO humans paint their wheels anyway?<br/>\n<br/>\n [Once you have settled on the details I may \"steal\" your IP to make and test a halfling version myself.  I won't be able to use SD on any of the PWs I've been playing but have some challenging SP content and a scalable trainer to assess the pros &amp; cons.  (Maybe even Aielund if I get the time.)]<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:43 PM - Mar 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's all good stuff, Hip, thank you.<br/>\n<br/>\n I'd originally thought about dropping a longsword into his sweaty mitt early on, but I entirely get what you say. And the quicker I can run around wearing a dress and wielding two twigs with razor-blades in them the better (it'd certainly scare the crap out of me). Take that, villainy!<br/>\n<br/>\n I'll make the changes, flesh him out, find an apt name, then post him as an unfinalized version here before running him through some mods. Then, with credits, acknowledgements and luck, to the Full Epic section.<br/>\n<br/>\n Huzzah!<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Sorry, typical me, I was drawing up a presentable schemata when two things popped into my head. First, while recognising that saves aren't exactly my strong point here, what if I lose LoH at level 1 and replace it with Finesse? I could then move Dodge to 6, Blind Fight at 12 and get a WF:Unarmed at 15. I lose 1 on all saves, but get other essentials earlier and a better option with a bludgeoning attack. Or, I could do as above but take Iron Will at 15, thus at least getting Will saves over 20. Secondly, regarding FavEnemies, I need some more knowledge. While I know that the bonuses improve each time, if (for example) I take Constructs as FE4, will it have the same bonus as if I'd taken it as FE1, or will the first FE always be better than any subsequent ones? Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:13 AM - Mar 28, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nah.  Longsword would suck because you can't finesse it.<br/>\n<br/>\n I think you are making it more complicated than it needs to be, Stagmeister.  My suggestion is to stick with developing one weapon only.  This isn't a fighter build so that is not an option.  You have bigger problems to address than slashing resistance.  You can always pick up the longbow for piercing or the sling for bludgeoning if it becomes an issue and only lose 3AB doing so.  I know some ppl like to take unarmed on all their toons in case they get disarmed.  My advice if that happens: use HiPS (or Invis pot) and pick it up again.  <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n I seldom take LoH anymore because usually have some way to buff saves (about 90% of the builds I play include bard, rog or asn).  Without UMD, my toons are like blind ducks on a dark pond. They tend to sulk.  Focusing on a particular save (like Iron Will) is an item-dependent decision.  Are there immunity to mind-affecting items?  Are clarity potions easy to find?   Reflex saves are probably the ones with the most overall value with ImpEvasion since you can avoid most all the evocation spell damage.  It can be tough to decide which save type will hang you out to dry on failure without some knowledge of which creatures are most proliferated.  On the last server I played, there were loads of high-level monks spamming Quivering Palm so to get through the area your toon needed Fort as high as possible to engage successfully.  Just one example, though.<br/>\n<br/>\n FE is easy to understand, hard to decide.  Each time you take an FE add +1 to damage.  It's cumulative.  So choosing FE 5 times means +5 damage and the damage type is the same as the weapon type (i.e. slashing for kama).  As you add to the list, every FE selected is treated the same.  Same damage now and then increases with each new FE added.  I believe FE damage crits (like WS) but don't hold me to that fact.  It's been a while since I tested a ranger so memory fades.<br/>\n<br/>\n Which race(s) to choose is the hard part because it depends on what is generally the biggest p.i.t.a to kill. That is usually environment-specific.  Some folks choose all the crit immunes.  Some choose the races that spawn as the largest mobs. Some choose the most common races like humans, elves &amp; dwarves.  Some choose the races that are most typically associated with high-level spellcasting.  It just depends on your playstyle.  I have no problem with mobs because I will pull them apart so would likely go with crit immunes or dragons.<br/>\n<br/>\n The reason it is so important to chose wisely is because BoE not only gives more damage but +2 AB.  So, races with high AC should be on the FE list.  In other words, if you are hitting certain races well enough before you get BoE, then BoE is less benificial vs. those races because it's not really needed. And that means you will need to anticipate and plan ahead which is easier said than done if you have no knowledge of the realm you are about to scout.<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}