{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "138",
  "name": "[PvM] Epic Dodge on a ranged Rogue?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pvm-epic-dodge-on-a-ranged-rogue-t2355432.html",
  "author": "Luj1",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "188",
  "posts": [
    {
      "author": "Luj1",
      "avatar": "no_avatar.png",
      "timestamp": "11:56 PM - Apr 09, 2020",
      "content": "<div>Do you guys think Epic Dodge is worth it on a ranged Rogue?<br/>\n<br/>\nThe reason I'm asking this, is that I don't think Improved Evasion and Defensive Roll are usually worth it. Your reflex save is so insane that you will rarely fail Evasion. Meanwhile, succeeding in Defensive Roll would mean you are one step away from dying anyway (which you shouldn't be). So that's potentially 3 epic feats which could be used differently. <br/>\n<br/>\nDidn't want to post in the other thread as that one is more about the early game.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:04 AM - Apr 10, 2020",
      "content": "<div>Hail Luj1<br/>\nThese are interesting thoughts<br/>\nA rogue archer does tries to stays out of the melee so Epic Dodge can be of lesser yield than a dedicated dex rogue meleer<br/>\nTheir AC is also excellent protected by uncanny dodge I and UMD (ie improved invisibility 50% concealment, premonition 30/5+) is available too in case they are hit by melee or ranged attacks<br/>\nI also agree improved evasion and defensive roll are not quite as nice as other options, crippling strike being one, slippery mind (re-roll will save) or skill mastery (setting traps in combat) being a few others<br/>\nI think Epic Dodge is a very powerful ability however. I would lean towards taking it if possible on the off chance I do have to melee with a single handed with possible shield (or dual if I have the proficiencies) <br/>\nInterested to hear what others think!</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "12:07 AM - Apr 10, 2020",
      "content": "<div><blockquote><div><cite>Luj1 wrote:</cite>Do you guys think Epic Dodge is worth it on a ranged Rogue?<br/>\n<br/>\nThe reason I'm asking this, is that I don't think Improved Evasion and Defensive Roll are usually worth it. Your reflex save is so insane that you will rarely fail Evasion. Meanwhile, succeeding in Defensive Roll would mean you are one step away from dying anyway (which you shouldn't be). So that's potentially 3 feats which could be used differently. <br/>\n<br/>\nDidn't want to post in the other thread as that one is more about the early game.</div></blockquote>\n\nEpic Dodge is one of the most powerful things in the game but worth it is a subjective thing.  In my opinion, it is the least worth it on a ranged build assuming the build has the capability of staying at / maintaining range and surviving ranged hits.<br/>\n<br/>\nThat all said, it is hard to offer useful/viable advice without understanding the module.  If everything has a ranged dev crit attack it would be very worth it for example :)<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    }
  ]
}