{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "118",
  "name": "Level 30 Melee PM - Arelith",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/level-30-melee-pm-arelith-t2354600.html",
  "author": "RandomArelithian",
  "avatar": "10577588_1510287072.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "RandomArelithian",
      "avatar": "no_avatar.png",
      "timestamp": "1:48 AM - Sep 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello! I'm looking for a level 30 Melee palemaster build, I'm decent at building myself and I'm aware that a very strong split is usually Bard/Fighter/PM but I'm not sure what the starting stats nor the levels should be of each. I'm very capable of switching stuff around to suit my own needs so just knowing the necessities and the base with a list of must-take feats is fine for me. I'd prefer to have enough skillpoints for bluff if possible as well, unless it messes too much with the base stats.<br/>\n<br/>\n Also, I can take 3 gifts that boost a base stat by 2(due to Arelith's gift system) and I'm not worried about the leveling process, but if there is a better split I'm not aware of or a better end-result I'm very open to suggestions.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:16 AM - Sep 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Another Arelith member stopping by.  Happy you decided to join our merry band of misfits.  <em><span style=\"font-size:120%;line-height:normal\"><strong><span style=\"color:#0000FF\">WELCOME to the ECB!</span></strong></span></em><br/>\n<br/>\n Bard/Ftr/PM can go in many directions.<br/>\n<br/>\n PvM or for dueling?<br/>\n<br/>\n Higher AC by finessing your weapon with DEX build.  Higher damage with a strength build and larger choice of weapons.<br/>\n You plan on self-buffing?  How about developing bard song (and curse song) to boost AB &amp; AC?<br/>\n Or perhaps no spellcasting potential at all and just use bard for skill dumps with a PM 10.<br/>\n<br/>\n Do you get crit immunity at PM 10 on Arelith or has PM been nerfed at all?<br/>\n<br/>\n My only advice without knowing more about your particular bias is to take as many fighter levels during pre-epic as reasonable to raise your BAB up.  In any case, you are going to want to max Taunt and if there are taunt threats on Arelith, Concentration.  I am guessing the gifts will either boosts your primary attack ability or help to solve qualifying for certain feats that would otherwise be a stretch to fit in (like Cleave on a DEX build without monk levels).   Another strategy might be to enable a spell repertoire to enhance combat potential with more CHA.  Though not having been privy to implementing the gift system, it seems that you will be able to spread your creation spread thinner and still be able to boost your primary attack ability.<br/>\n<br/>\n Like I indicated... many, many routes to persue.  Your ball.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "RandomArelithian",
      "avatar": "no_avatar.png",
      "timestamp": "6:23 AM - Sep 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the welcome, and sorry! I should have been more specific for the proper advice!<br/>\n<br/>\n PvP for certain.<br/>\n<br/>\n In terms of DEX or STR I don't particularly mind but I would prefer to self buff if possible - Arelith is full of magic and it seems to dominate the PVP scale and I assume if I were to build in preference for melee with low magic my weakness to mages would be even higher. (Bard and Curse song are also welcomed!)<br/>\n<br/>\n Would it be too much for you to give a few lists of types with the selected feats? I bet that's a lot of work and I feel bad just asking but I assume I'll end up experimenting with a bunch of different build paths with PM in general since it's such a broad scale.<br/>\n<br/>\n A bit irrelevent but maybe more helpful information for you could be this <a class=\"postlink\" href=\"http://wiki.arelith.com/Gifts\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Gifts</a> (perhaps for the future or just for you to know - I don't usually see a point in not taking three gifts despite the slower leveling if only because of the possible late level changes, as the ECL only lowers experience gained and doesn't affect total level)<br/>\n<br/>\n I know this probably still isn't much help, but here are the listed Pale Master changes(which are not many) <a class=\"postlink\" href=\"http://wiki.arelith.com/Pale_master\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Pale_</a><a class=\"postlink\" href=\"http://wiki.arelith.com/Pale_master\" rel=\"noreferrer\" target=\"_blank\">master</a><br/>\n<br/>\n<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:34 AM - Sep 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll leave all the Arelith-specific stuff to you to figure out but you're in luck.  I found an old SP build I played a few times lying around on my spare PC and modified it for Arelith.  I was using Full plate/tower and katana in this one.  You must unequip armor to buff up but there aren't many slots to worry about.  IIRC I used Bull for AB/dmg, Eagle for better taunt roll and Ghost Visage (nope, no Haste. that's Level 3... just use speed pots if they have them).  Damage is very good.  BTW, dunno if you know it or not but you can use your PM touch attacks while in Expertise mode. Oh, the Exotic could easily be exised if you don't want those sorts of weaponry. <br/>\n<br/>\n I guess I'd take gifts on STR &amp; CON on this build if I had to make a choice.   Maybe also INT to max a detection skill vs. stealthers.  Your choice.<br/>\n<br/>\n It was never intended as dueling build but check it anyway, choose what you like, what you don't and we'll work from there.  IIRC I reached something like 50 AC with pretty standard enhancements.<br/>\n<br/>\n Just out of curiosity what sort of classes are you planning to duel?  Methinks any high mage will rip this one to shreds because the saves aren't good enough.  You could go with CoT to circumvent that problem but lose the WS/EWS damage.  That would open other possibilities by pumping CHA a bit more, Divine Wrath could work.  'nuff speculating.  Review and respond when you get chance.<br/>\nSpoiler [+]<br/>\n<br/>\n Bard(6), Fighter(14), Pale Master(10), Any non-lawful non-good Human<br/>\n<br/>\n STR: 16 (24)<br/>\n DEX: 12<br/>\n CON: 14<br/>\n WIS: 8<br/>\n INT: 14<br/>\n CHA: 12<br/>\n<br/>\n 01: Brd(1): Blind Fight, Curse Song<br/>\n 02: Brd(2)<br/>\n 03: Brd(3): Lingering Song<br/>\n 04: Ftr(1): STR+1 (17), Wpn Prof Exotic<br/>\n 05: Ftr(2): Weapon Focus<br/>\n 06: Ftr(3): Power Attack<br/>\n 07: Ftr(4): Cleave<br/>\n 08: Ftr(5): STR+1 (18)<br/>\n 09: Ftr(6): Expertise, KD<br/>\n 10: Ftr(7)<br/>\n 11: Ftr(8): WS<br/>\n 12: PM(1): STR+1 (19), SkF: Taunt<br/>\n 13: PM(2)<br/>\n 14: PM(3)<br/>\n 15: PM(4): Lightning Reflexes<br/>\n 16: Ftr(9): STR+1 (20)<br/>\n 17: Brd(4)<br/>\n 18: Ftr(10): Great Fort, Imp Crit<br/>\n 19: Ftr(11)<br/>\n 20: Ftr(12): STR+1 (21), IKD<br/>\n 21: PM(5): EWF<br/>\n 22: Brd(5)<br/>\n 23: PM(6)<br/>\n 24: PM(7): STR+1 (22), Grt STR (23)<br/>\n 25: PM(8)<br/>\n 26: PM(9)<br/>\n 27: PM(10): Epic Prowess<br/>\n 28: Ftr(13): STR+1 (24)<br/>\n 29: Ftr(14): EWS<br/>\n 30: Brd(6): Armor Skin<br/>\n<br/>\n HP: 314<br/>\n Saves F/W/R: 22/16/17 (29/23/24 v spells)<br/>\n BAB: 22 (4 APR), 17 pre-epic<br/>\n AB (max, naked): 33 (melee), 24 (ranged)<br/>\n AC (naked/mundane armor/shield only): 25/36<br/>\n Spell Casting: Bard(2)<br/>\n<br/>\n Skills: 183 - Concentration 33(35), Discipline 33(40), Perform 11(12), Spellcraft 33(35), Taunt 33(37), Tumble 30(31), UMD 9(10), --------&gt; 1 to spare<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "RandomArelithian",
      "avatar": "no_avatar.png",
      "timestamp": "5:31 PM - Sep 21, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sorry I was side-tracked for a while but this build does look promising. I did just discover that Necromancy on Arelith was buffed again without my realization, and supposedly you can take Epic Mummy Dust with just 15 palemaster levels on NWN? The spell itself states that you need to be able to cast 9th level spells but a note on the wiki mentions you only need 15 PM which I find interesting, and apparently on Arelith you get access to these: <br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Necromancy_changes\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Spell_changes#N ... cy_changes</a><br/>\n<br/>\n Also thank you very much for your help, just posting that build alone lets me figure out a lot to the Bard/Fighter/PM staple. I might try to swap it around to be more dexterity based just in case for a chance at dodging some epic spells at least with reflex.<br/>\n<br/>\n As for your question though, to be honest the server is mostly full of wizards/clerics/standard bard/fighters and monks with a small handful of weapon masters after. There's a whole list of how many people have logged in during the last few months and what classes they are if you're interested in seeing it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:31 PM - Sep 21, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The problem with a dyed-in-the-wool bardic necromancer is that it can't get Autostill which means either robes/no shield or suffer the slings and arrows of outrageous fortunes (or rather, misfortunes) trying to cast arcane spells.  Even going wiz/sorc, Autostill is still not an option open on Arelith due to the Spellcraft prereq.  I doubt you'll achieve an AC worthy of shrugging off attacks without plate/tower.  That's one of the reasons the build I posted settled for the crit immunity and a few intrinsic touch attacks within a Level 30 constraint.<br/>\n<br/>\n A PM 15+ will end up a poorer melee candidate due to the PM levels needed in pre-epic, effectively gimping the BAB too much to be able to exact reliable damage.  I'm guessing they play those sort of builds (15+) on Arelith more like a caster than a spellsword and even less as pure melee.<br/>\n<br/>\n ...unless Arelith has somehow altered the prereqs of Autostill feats.  But I wouldn't be privy to that information.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}