{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "672",
  "name": "The Astonishing Half-Elven Prodigy (Fighter 12 / Bard 3 / Arcane Archer 25)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-astonishing-half-elven-prodigy-fighter-12-bard-t2355332.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 25,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:34 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong><span style=\"font-size:150%;line-height:normal\">The Astonishing Half-Elven Prodigy</span></strong><br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202002/10759084_7f0d95982a4391f3455e5f57b7cde2a0.jpg\" />\n</dl>\n</span><br/>\n<span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://hallofbeorn.files.wordpress.com/2013/06/blood-of-numenor.jpg\" rel=\"noreferrer\" target=\"_blank\">https://hallofbeorn.files.wordpress.com ... umenor.jpg</a></span><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>Lore:</strong><br/>\n<br/>\n<em>The half-elves understand they have to work twice as hard as their elven and human brethren for acceptance. </em><br/>\n<br/>\n<em>They understand this, having been rejected by the ageless unbending elven cultures for being 'tainted' with humanity, tolerated but discriminated against by humankind for being 'different'. </em><br/>\n<br/>\n<em>And yet, talent, even genius is not limited by race, environment or wealth...</em><br/>\n<br/>\n~~~~~<br/>\n<br/>\n<em>\"You have her eyes... and thankfully also her intellect!\" </em><br/>\n<br/>\nThe aged and frail Ser Farador carefully scribed in the dim candlelight of the hospice bed of the monastery of Rao, the peaceful one.<br/>\n<br/>\nThe great plague had devastated the land, and all of the Lord's knights were assigned to find cures, solutions. Even the retired Knight of the Realm was not immune to the illness.<br/>\n<br/>\nWith his elven wife long past many decades ago, the retired knight sought assistance from his old brothers in the monastery, yet only comfort was possible.<br/>\n<br/>\n\"Cure sometimes, relieve often, comfort always*,\" he smiled as he remembered his Cleric brethren's mantra. The healer's mantra.<br/>\n<br/>\nAnd he stared death in the eyes now, isolated away from friends fearing contagion.<br/>\n<br/>\nYet rather than isolation, misfortune, grievance, he felt peace...<br/>\n<br/>\n<em>\"I was unsure what she saw in me, to rebel against her family, to leave her secretive and glorious heritage for me, but I promised her I would do everything I could to make it work... </em><br/>\n<br/>\n<em>\"But I think I finally know what she saw in me, I don't know how, perhaps it is to do with her elven nature, but I believe what she saw, was you.\"</em><br/>\n<br/>\nSer Farador paused, remembering...<br/>\n<br/>\n<em>\"Anything and everything just came easily to you. Initially the other children would shun you, because of difference, but eventually a few came to understand, and accept... even see your prodigious gifts. Not as many as I had hoped, but some...\"</em><br/>\n<br/>\n<em>\"I hope society will finally shift and change, so the talents of many like yourself will shine bright and can be given to this world.\"</em><br/>\n<br/>\nSer Farador paused again.<br/>\n<br/>\n<em>\"The High Priest tells me I will not survive to see you return from your assignment. And I am sorry I will not see you again.\" </em><br/>\n<br/>\n<em>\"But know that you carry our love, forever and beyond. The greatest gift we could ever give you, my child...\"</em><br/>\n<br/>\nAnd Ser Farador smiled, put his quill down, and extinguished the candle, to retire...<br/>\n<br/>\n<span style=\"font-size:75%;line-height:normal\">* Cited as a 15th century folk saying, also attributed to Sir William Osler.</span><br/>\n<br/>\n<br/>\n<strong>Building notes:</strong><br/>\nStrength based arcane archer builds are something that have been explored before.<br/>\n<br/>\nLess explored are devastating critical arcane archer builds, notable builds in the ECB archives being <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build263591.html\" rel=\"noreferrer\" target=\"_blank\">The Devastator</a> by Cinnabar Din for example.<br/>\n<br/>\nThe only double devastating arcane archer (meaning with both a melee weapon and ranged weapon) build I could find was Mick Dagger's <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build303744.html\" rel=\"noreferrer\" target=\"_blank\">Devastating Specialist of Blade and Bow</a> which is a Fighter 20, Bard 5, AA 15 build. I liked Mick's build! <br/>\n<br/>\nThere were a few things I wanted to tweak playing it, so I made some adjustments which were so significant it essentially was a different build.<br/>\n<br/>\nI explored a few double devastating critical cleric ideas in the past, but based on feedback have put this on hold for a while. <br/>\n<br/>\nI have also explored half-elf builds before trying to find builds where half-elf is the most optimal. Half-elf is definitely what I would describe as the forgotten race of NWN. Here is probably the most powerful half-elf build I could possibly imagine.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>Goals:</strong><br/>\n1. Devastating critical Greatsword and Longbow<br/>\n2. Base 42+ AB with either weapon<br/>\n3. Enjoyable balance.<br/>\n<br/>\n<br/>\n<strong>Outcomes:</strong><br/>\n- Str 30, Base Melee AB 43, Base Ranged AB 46, WF/EWF/EP, WS/EWS (longbow only), Blind Fight/Knockdown/Point Blank Shot, Devastating Critical DC 40-46 (either weapon, depending whether Str is capped)<br/>\n- 418hp, Max discipline, spellcraft, near max spot, tumble 40, UMD 30 modified, Perform 9 modified, search 10 modified crossclass, crossclass points in open lock, disable trap and set trap, level 3 bard song (+1 AB, +2 DMG, +1 Fort, +1 Will), Armor Skin<br/>\n- F25 (34) W17 (28) R21 (30) -&gt; in brackets including +9 to saves against spells plus +2 against mind effects.<br/>\n<br/>\n<br/>\n<strong>Possible feat choices at level 12:</strong><br/>\n- Disarm / Improved Disarm (my favorite with a two handed weapon, for huge AB boosts against rogues)<br/>\n- Weapon Specialization Greatsword / Improved Knockdown <br/>\n- Toughness / Improved Knockdown<br/>\n- Called Shot / Toughness<br/>\n- Called Shot / Rapid Shot (with below tweak)<br/>\n<br/>\n<strong>Other tweaks:</strong><br/>\n- One could increase starting Dex to 13 and starting Str to 17 if one wishes to take Rapid Shot at level 12. Drop Armor Skin for Great Strength to still hit Str 30.<br/>\n<br/>\nHappy to hear comments / suggested tweaks, this one looks quite nice, and novel.<br/>\n<details><summary>Spoiler</summary>Fighter(12), Bard(3), Arcane Archer(25), Half-Elf\n\nDEX: 10\nWIS: 8\nCHA: 8\nHalf-Elf: (Hardiness vs. Enchantments, Low-light Vision, Partial Skill Affinity: Listen, Partial Skill Affinity: Search, Partial Skill Affinity: Spot, Sleeplessness)\n02: Fighter(2): Weapon Focus: Scimitar\n04: Fighter(4): STR+1, Weapon Specialization: Longbow, (STR=19)\n06: Fighter(6): Power Attack, Cleave\n08: Bard(1): STR+1, (STR=20)\n10: Arcane Archer(2)\n12: Fighter(8): STR+1, Improved Critical: Scimitar, Weapon Specialization: Scimitar, (STR=21)\n14: Arcane Archer(4)\n16: Arcane Archer(6): STR+1, (STR=22)\n18: Arcane Archer(8): Great Cleave\n20: Arcane Archer(10): STR+1, (STR=23)\n22: Arcane Archer(11)\n24: Arcane Archer(12): STR+1, Overwhelming Critical: Scimitar, (STR=24)\n26: Arcane Archer(14): Epic Weapon Focus: Longbow\n28: Fighter(12): STR+1, Devastating Critical: Scimitar, (STR=25)\n30: Arcane Archer(16): Overwhelming Critical: Longbow\n32: Arcane Archer(18): STR+1, Devastating Critical: Longbow, (STR=26)\n34: Arcane Archer(20)\n36: Arcane Archer(22): STR+1, Great Strength I, Epic Prowess, (STR=28)\n38: Arcane Archer(24)\n40: Bard(3): STR+1, (STR=30)\nHitpoints: 418\nSaving Throws (Fortitude/Will/Reflex): 25/17/22\nBAB: 29\nAC (naked/mundane armor/shield only): 20/31\nAlignment Changes: 0\nDisable Trap 1(3), Discipline 43(53), Open Lock 1(1), Perform 10(9), Search 7(10), Set Trap 1(1), Spellcraft 43(45), Spot 41(41), Tumble 40(40), UMD 31(30)\n\n02: Discipline(1), Save(9), \n04: Discipline(1), Save(15), \n06: Save(23), \n08: Perform(4), Spellcraft(8), Tumble(10), UMD(11), \n10: Spot(6), \n12: Discipline(8), Save(1), \n14: Save(6), \n16: Save(13), \n18: Save(25), \n20: Save(37), \n22: Save(46), \n24: Spot(6), \n26: Save(6), \n28: Discipline(1), Search(2), \n30: Search(1), Spot(1), Save(3), \n32: Spot(1), Save(13), \n34: Spot(1), Save(23), \n36: Spot(1), Save(33), \n38: Spot(1), Save(43), \n40: Discipline(12), Perform(3), Spellcraft(20), Tumble(15), UMD(5), \n</details>\nEdited after suggestions <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:44 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I will be the first to say this - I don't like this build.<br/>\n<br/>\nIt tries to do too much, imo.<br/>\n<br/>\nWhereas if it stuck to one or the other weapon, and took it to the pinnacle, it would have a vastly superior effect.  Instead, it is like a jack-of-all trades, but master of none.<br/>\n<br/>\nBut to the build itself - it does as advertised, and looks solidly put together to accomplish that.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "stephenratcliffe809",
      "avatar": "10759100_1561880327.jpg",
      "timestamp": "2:53 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, it is a half-Elf, so not being good at any one thing is a racial proficiency !<br/>\n<br/>\nSent from my SM-T810 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:33 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"18832\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18832&amp;sid=141d6a37e9b0b7ffebbc1a85bcae4609#p18832\">↑</a><div class=\"responsive-hide\">Feb 02, 2020</div></cite>I will be the first to say this - I don't like this build.<br/>\n<br/>\nIt tries to do too much, imo.<br/>\n<br/>\nWhereas if it stuck to one or the other weapon, and took it to the pinnacle, it would have a vastly superior effect.  Instead, it is like a jack-of-all trades, but master of none.<br/>\n<br/>\nBut to the build itself - it does as advertised, and looks solidly put together to accomplish that.</div></blockquote>\nConstructive and thoughtful suggestions please.<br/>\n<br/>\nGive examples to explain your reasoning and how you would make this build better.<br/>\n<br/>\nAnd please make it concise and to the point. Not a magnum opus that is too long to read.<br/>\n<br/>\nFrom my perspective, this build is versatile and enjoyable. It deals with multiple problems well, rather than specialising in dealing with some problems well and others not so well.<br/>\n<br/>\nThe dev crit ranged (and +19-27 damage, 13 from enchant arrow and 6 from WS/EWS and up to +8 from mighty) from my perspective, is great against enemies you don't want to melee against against such as devastating critical opponents, petrify using monsters (ie basilisks, medusae etc) and mages sitting in mobs (just dev crit them with their low fort save and AC, if they are crit immune such as a PM, they will still suffer with the added damage / hit). In a party situation, you can switch to ranged if you are some distance away and blast away, or if that best suits the party makeup.<br/>\n<br/>\nThe dev crit melee is great against mobs if you want to save arrows, or if you do get mobbed. Great cleave away (ranged weapons cannot use cleave or great cleave)!<br/>\n<br/>\nI chose two handed because of the high Str score (cap-able to 42), adding up to 24 damage / hit with a mundane weapon, plus the ability to improved disarm for up to +8 AB. A scimitar might be good too, but might not be as good against a mob of undead without WS/EWS. UMD provides a lot of protection (Premonition, Improved Invisibility, Haste, for example) against such mobs that the extra AC lost by not equipping a shield can be managed fine, if you want, one could always just equip singled handed and shield anyway for 3 less AB.<br/>\n<br/>\nAnd <em class=\"mention\">@stephenratcliffe809</em> that is crazy talk, even if its in jest. The build has 43 melee AB and 46 ranged AB each with devastating critical DC 40-46. I do not see how either attack is not being good at any one thing. I can only attribute such a malady to the recent Brexit event. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:36 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, for example, a dex based AA build will have a much higher AB.<br/>\n<br/>\nA RDD WM monster will have both a higher AB and Dev Crit DC (not to mention damage).<br/>\n<br/>\nLike I said - this build tries to do both, but falls inbetween. <br/>\n<br/>\nI did say that the build itself is solid, in what it does.<br/>\n<br/>\nI have played The Devastator (Cinnabar Dinn) and although it does as advertised, I found that at the highest levels, a bow Dev Crit was really fishing for 20s (if even able), and trying to go melee was...suicide.<br/>\n<br/>\nI found that the build lacked needed firepower and protection exactly when it was needed most.<br/>\n<br/>\nIn a party, where these things can be compensated for, things were not so glaringly obvious. The build performed as expected  and could fill a number of roles  which made it flexible.<br/>\n<br/>\nBut solo...things were alot different.<br/>\n<br/>\nYou have done Lolth on WoG, for instance.  I could not solo her with this build. There was not enough room to kite her and her minions  and I kept getting tangled up in melee, which resulted in getting sneaked to death.<br/>\n<br/>\nIn a party, we pretty much whacked and shot the tar out of her (high level Bardsong makes this build amazing!) and her minions.<br/>\n<br/>\nSo please do not get angry at my lack of enthusiasm for this build - for my experiences with it were mediocre, at best.<br/>\n<br/>\nWith the build I went with, it was a sword and board build, with scimi as Dev Critter - for the expanded crit range (helpful for annoying low ac mobs) - and a Keened bow helped the other a bit.<br/>\n<br/>\nBows, I found out, are not excellent crit weapons. It happens, but it is not often, and is especially not reliable enough to justify the large expenditure in feats to get it imo.<br/>\n<br/>\nThe Greatsword is much like this - but a bit more crippled in this build by lack of enough support for the Dev Crit.<br/>\n<br/>\nThe Crit Range is small, and the Dev Crit DC not that high.<br/>\n<br/>\nMeaning, fewer Dev Crit threats and a better chance to save against it.<br/>\n<br/>\nIt is like 1 fishing, but at a slower pace.<br/>\n<br/>\nTo that, the AC suffers, especially with the lack of shield.<br/>\n<br/>\nSo all those feats, spent to get two Dev Crits that <br/>\n<br/>\nA) need high rolls to threaten due to small crit range<br/>\n<br/>\nB) have lower Dev Crit DCs, so saves are easier.<br/>\n<br/>\nFor me (and this is why I don't like the build) that is too much cost for too little gain. YMMV.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:37 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"18835\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18835&amp;sid=141d6a37e9b0b7ffebbc1a85bcae4609#p18835\">↑</a><div class=\"responsive-hide\">Feb 02, 2020</div></cite>Well, for example, a dex based AA build will have a much higher AB.</div></blockquote>\nRogue 13 / Bard / AA might be interesting combining Uncanny Dodge, Sneak Attack, UMD, Epic Dodge, Weapon Finesse + Enchant Arrow. Rogue has shortbow as a weapon proficiency. I might see if I can work on a draft on a different half-elven build. <br/>\n<br/>\nOften feedback with dex AA builds is that the AB is too high, the AB bonus is imbalanced with the class, which is why I haven't invested in dexterity at all in this build. <br/>\n<blockquote><div>A RDD WM monster will have both a higher AB and Dev Crit DC (not to mention damage).</div></blockquote>\nThat build is extremely feat starved, it is tough to make a good build with it. I think such a build is definitely of interest with the huge melee AB boosts + crit range possible. I've worked through <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17665#p17665\" rel=\"noreferrer\" target=\"_blank\">a few drafts</a> to make it work which you've participated in. By going WM heavy (to get to close to 50 AB) there's major spillage of pre-epic feats into epic levels with dev crit, even without dev crit. <br/>\n<blockquote><div>I have played The Devastator (Cinnabar Dinn) and although it does as advertised, I found that at the highest levels, a bow Dev Crit was really fishing for 20s (if even able), and trying to go melee was...suicide.</div></blockquote>\nThank you for sharing the troubles with melee. A melee weapon focus, take dev crit melee + great cleave + scimitar + tower, should deal with the problem. As mentioned UMD -&gt; improved invis + premonition as well, if you need to melee. Its why I've dual dev critted here. A bow in melee against a mob will just trigger a pile of AoOs. I will make the changes.<br/>\n<blockquote><div>Bows, I found out, are not excellent crit weapons. It happens, but it is not often, and is especially not reliable enough to justify the large expenditure in feats to get it imo.<br/>\n<br/>\nThe Greatsword is much like this - but a bit more crippled in this build by lack of enough support for the Dev Crit.<br/>\n<br/>\nThe Crit Range is small, and the Dev Crit DC not that high.<br/>\n<br/>\nMeaning, fewer Dev Crit threats and a better chance to save against it.</div></blockquote>\nDev crit longbow has a poor threat range, so the melee weapon dev crit focuses come faster than the ranged ones in the build.<br/>\n<br/>\nThe overwhelming critical longbow and devastating critical longbow feats are free bonus epic feats from Arcane Archer. The other choices are great dexterity, epic reflexes or epic toughness. There essentially is <strong>no cost </strong>with obtaining dev crit bow, in a melee str dev crit AA to begin with. This is why I took it, its pretty much free and the best option here.<br/>\n<br/>\nThe Dev Crit DC fort save 40-46 or die is fine for a non-RDD build. I have playtested it in WoG where it is not nerfed. I honestly don't know why people keep bringing up this comment all the time. I think it is uneducated. <br/>\n<br/>\n<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Base_save\" rel=\"noreferrer\" target=\"_blank\">Base saves</a> at level 40 for a high save is 22, low save 16. Add a +6 modifier for +2 cons modifier and +4 epic fortitude = 26 high, 22 low. With capped strength, standard enemies are just going to die all the time unless they roll a 19-20. Sounds fine to me! I don't want to die to mobs.<br/>\n<br/>\nI don't expect module designers to allow me to dev crit bosses, and I don't design builds to dev crit bosses. But with enough AB, one will land critical hits and eventually they will roll a 1, unless they are crit immune. <br/>\n<br/>\nFinally, if there is something you don't like about a build I want to know what it is specifically, because there are things that can be adjusted, sometimes quite easily (for example, switching to scimitar and tower to deal better with mobs). This is how I think as a builder. <br/>\n<br/>\n<br/>\nDont like -&gt; ?Cause of this -&gt; Possible solutions -&gt; Costs of potential solutions -&gt; Put it together/optimise the best I can -&gt; now how does it look, does it solve the problem.<br/>\n<br/>\n<br/>\nIt is much more constructive for me.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:33 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ok.<br/>\n<br/>\nTake the build into the Rift.<br/>\n<br/>\nWhat I mean by that - Ancient Sword spiders will shrug off that Dev Crit DC pretty easy (if you even hit them, which is not easy) AND survive their massive attacks - they are really nasty.  That's not to mention all the crit immune in there (the next issue).<br/>\n<br/>\nDraggie is...you guessed it.  Crit immune.<br/>\n<br/>\nThe Stonies are easier, until you meet Trok and his wrecking crew.  They'll pretty much shrug at the Dev Crit DC and pummel you into mush with that AC.  A Scimi and Tower Shield would help alot here.  I think.<br/>\n<br/>\nThe Abyssal Bassies and Co. have tons of piercing DR.  And very high Fort.  They can tank the Dev Crit DC.  This basically means 1 fishing.  You don't really want to melee them.  They spam Petri, and you will roll a 1.  It's almost guaranteed.  Nasty little mobs.<br/>\n<br/>\nThat leaves the Dracolisk.  Without cheesing it...ouch.<br/>\n<br/>\nI normally use the Rift to test my builds for WoG, because it is easy to access, has a nice place to rest and recuperate, and has a sortiment of different damage, and build types in the opponents one has there that are a pretty good cross-cut example of most of WoG.<br/>\n<br/>\nWe will not even begin to discuss the Drow.  You have met them already, and I really assume you are aware of the dangers that they present - Warriors with 49 AB (and WMs), Sneaking EDers, high level Wizards and the Priestesses...I think you will have to lure them out, and do them on a 1v1 basis.  That will probably work well - and the Dev Crit should be pretty good against the Wiz and perhaps the Priestesses.  Not so sure about those dratted sneakers.  Perhaps.<br/>\n<br/>\nTimesinks, tho.<br/>\n<br/>\nI think there is a good reason that Cinnabar Dinn went with Scimi and Tower shield in his build - I do have another character that is also a dual-type character; A Ranger/bard/AA.  Due to the way FEs and BoEs works, she can basically use a number of different types of weapons.  She can go Two-Handed, Sword and Board, two-weapon, and bow.  She mainly sticks to bow, however.  Only in absolute emergency or in a case of cleaning up easy m0bs does she melee.<br/>\n<br/>\nWhen she does in a dangerous situation, it is mostly sword and board.  Scimi and Tower shield.  It just makes more sense.  When in danger, you want the best offense and defense that you can muster, right?<br/>\n<br/>\nWell, she got slaughtered by Lord Vayne and Lady Athea.  Just...dang PM melee build!  And then assisted by a PM Mage...bleh.  Surviving both Gr Ruins not fun, but then the melee plus magic onslaught...gah.  No crits allowed, of course.  Very difficult for her to solo.<br/>\n<br/>\nWHEN we finally get the additional feats for weapons other than those included in the game (coming in a patch soon, there is a Dev Build where one can play with this), then some of the CEP weapons will prove interesting, to say the least!  A Mercurial Two-Handed Greatsword...hmmm....might be interesting.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "7:05 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The main problem with this build is that it is mediocre at both melee and ranged as opposed to being excellent in one of those areas. It's the same reason I dislike spellswords, they can melee and they can cast but they're mediocre at both. Having said that, as as already been pointed out this succeeds in achieving what you set out to do so it's not a bad build.<br/>\n<br/>\nPersonally I would change the level layout to either Figh12/Bard2/AA26 or Figh14/Bard3/AA23 for an extra feat, but that would be better for an optimal level 40 build rather than a smooth levelling one. Your current pre-epic spread is Figh10/Bard1/AA9, you should switch to either Figh9/Bard1/AA10 or Figh9/Bard2/AA9 for better saves.<br/>\n<br/>\nIf I made this I would switch from half-elf to elf for Keen Senses and higher DEX but that would go against your no-XP-penalty policy.<br/>\n<br/>\nI would also lower your starting STR in order to increase your DEX. Your melee AB and Dev Crit DC will decrease by 1 but your ranged AB will increase by 2 or 3 and you will be able to get Rapid Shot.<br/>\n<br/>\nAs has already been suggested, you should switch from greatsword to scimitar and get EWS: Scimitar to make up for the lost damage. Currently you don't do enough melee damage to justify the lack of a shield in my opinion. Drop Improved Disarm for Rapid Shot and WS: Scimitar, then either swap Armor Skin or use your new extra feat to get EWS: Scimitar.<br/>\n<br/>\nYour skills seem good, although with only 3 Bard levels I would probably ignore Bard Song and Perform entirely.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:01 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yunim I think your suggestions are very constructive. <br/>\n<br/>\nThanks for reinforcing sword and board is the way to go. <br/>\n<br/>\nI like you looked at the pre-epic split with the saves and thanks for pointing that out a more optimal way. <br/>\n<br/>\nI am also tiring of this AB discussion. <strong>There is heaps of AB in this build. </strong><br/>\n<br/>\nMediocre is a technically incorrect word to use here to describe this build's base AB of 43 and 46. <br/>\n<blockquote><div>Define: mediocre on Google Search<br/>\nmediocre<br/>\n<em>adjective</em>\n<ol>\n<li>of only average quality; not very good.</li>\n</ol>\n</div></blockquote>\nI would not describe the AB as not being very good, so please do not use that term. <br/>\n<br/>\nThese are the references I use, Mithdradates and Mick Dagger:<br/>\n<blockquote><div>Mithdradates wrote (<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build241416.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 41416.html</a>): <br/>\nI'll echo Grim's sentiment about droping your wisdom and raising your dexterity instead. A 32 AB is pretty low, typically you can think of ABs as follows:<br/>\n&lt;=37 low<br/>\n38-40 average support character<br/>\n40-42 good support character, low warrior<br/>\n42-44 average warrior<br/>\n&gt;=45 good warrior.<br/>\n(different builders have different scales, but this should be fairly standard)</div></blockquote>\nand<br/>\n<blockquote><div>Mick Dagger wrote (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/attack-bonus-ab-goals-t2355144.html#p16433\" rel=\"noreferrer\" target=\"_blank\">attack-bonus-ab-goals-t2355144.html#p16433</a>): <br/>\nAs a general rule of thumb Mithdradates is right.<br/>\nMeaning<br/>\n      a) I agree with his AB estimates<br/>\n      b) you should always listen to Mithdradates<br/>\n<br/>\nI assume you talk about PvM and not PvP here.<br/>\nAs for spellswords; it is hard to get any better than AB +40, but try to get as close as possible.<br/>\nClerics are a spacial case, because they can easily buff the AB to the cap.<br/>\nBards have a great AB boost from the songs and taunt.<br/>\nPaladins can live with a little lower AB because of their spells. That gives room for some charisma.<br/>\nStealth characters that hit flat footed creatures generally have a lower AC to beat.<br/>\nWeaponmasters should have very high AB, not only to hit ther target. They have an extended critical threat trange and want to hit with rolls within that range, I mean what use is a range from 12 to 20 if you only are able to hit on 18 or better. They also want a high AB to be able to confirm their critical threats so they actually land critical hits.<br/>\netc.etc...<br/>\n<br/>\nIf your fighter has AB +44, it means that the 4 attacks have AB +44/+39/+34/+29.  A rogue character with AB +39 typically has 3 attacks with AB +39/+34/+29. Note that only the best attack from the fighter is better. Most module builders let 3/4 BAB builds hit some too.<br/>\n<br/>\nAt the end of the day the whole discussion boils down to how the module builder designs the creatures you have to fight. A balanced module let the fighter types hit on a regular basis, even against bosses. Against mobs you may perhaps hit even with your 4th attack, at least with a half- decent roll. The module builder must also take into account what equipment will be available, so it maintains the balance.<br/>\nHow this balance is maintained and what level of magical items are available defines the setting you want to build for. <br/>\nWhen you play a module or on a PW you will soon get a feel for how things are balanced out; if a very high AB is necessary, or if AC is more important, how important saves are and what you can achieve with available equipment.<br/>\n<br/>\nBut given all this (and more) Mithdradates is right!</div></blockquote>\nArcane Archers have their own potentials for AB which are off the charts, but that is because that is imbalanced. I believe once that AB 45+ is hit, look for more damage, look for dev crit, look for other features<br/>\n<br/>\nValerfor in fact, took the time and effort to look through the toolset as to what AC the standard creatures have:<br/>\n<blockquote><div>Valerfor wrote:<br/>\nLet me just list the AC of some of the most prominent monsters in the toolset:<br/>\n<br/>\nOrc chieftain (CR 10), HP: 120, AC: 14<br/>\nMinotaur chieftain (CR 13), HP: 250, AC: 14<br/>\nDuergar Chief (CR 13), HP: 130, AC: 20<br/>\nDuergar warrior HotU (CR 17), HP: 175, AC: 31<br/>\nDrow warrior HotU (CR 20), HP: 201, AC: 31<br/>\nOgre High Mage (CR 18), HP: 200, AC: 14<br/>\nFire Giant (CR 12), HP: 142, AC: 20<br/>\nDoom knight commander (CR 15), HP: 160, AC: 24<br/>\nAndrosphinx (CR 23), HP: 138, AC: 23<br/>\nEpic Drider Chief (CR28), HP: 208, AC: 17<br/>\nMasterius - The Lich King (CR 32), HP: 401, AC: 29<br/>\nDracolich (CR 43), HP: 590, AC: 44 (Finally!)<br/>\nElder Earth Elemental (CR 20), HP: 204, AC: 27<br/>\nHuge iron golem (CR 21), HP: 140, AC: 33<br/>\nDemonflesh Golem (CR 25), HP: 172, AC: 34<br/>\nAdamandine Golem (CR 32), HP: 220, AC: 38<br/>\nMithral Golem (CR 35), HP: 198, AC: 39<br/>\nMephistopheles (CR 50+), HP: lots, AC: 32<br/>\nMummy Lord - Summon (CR 22), HP: 143, AC: 24<br/>\nThe Epic Vrock - BG level 28 (CR 28), HP: 410, AC: 27<br/>\nAncient Red Dragon (CR 24), HP: 527, AC: 39<br/>\nDeath Slaad Lord (CR 15), HP: 112, AC: 25<br/>\nWhite Slaad (CR 25), HP: 440, AC: 40 (CR too low for what it is)<br/>\nThe Dreaded Black Slaad (CR 30), HP: 536, AC: 49 (CR too low for what it is)<br/>\n<br/>\nOf course, these numbers alone do not tell the whole story, but they do provide an indicator &amp; a context for the discussion herein.<br/>\nAnd, as always, Boss monsters should &amp; will be significantly altered from the stock variants, but then again, they are intended to be as such.</div></blockquote>\n\nRegarding WoG. Between base 40 to 45 is good enough for WoG, having played a number of builds to 40. I have spent plenty of time in the Rift to the extent that I am a bit tired of going there right now, and an AB of 40 does just fine, although I like it closer to 43, which is what I hit for the melee AB. UMD can additionally provide a powerful boost to AB. I do not believe more dexterity is helpful as a result.<br/>\n<br/>\nThe abysal basilisks I sneak up on invis and knock them down with AB boosts. I dev crit them just fine with the AB and dev crit DC in this build. I have not yet tried a ranged dev crit build against them. <br/>\n<br/>\nMore HP is valuable if any prolonged melee combat is required, and half-elf provides this over elf, in addition to the avoiding exp-penalties, making half-elf a more optimal choice here. Keen Senses I agree are missed, but this can be managed with a high Spot score and items (ie Watchman's Helm) to counteract this. Keen Senses turns the standard 1d10 spot/listen checks to 1d20 checks that are usually in detect mode. The HP is more valuable here.<br/>\n<br/>\nI believe a melee build should aim to have 400 base HP+ with max rolls. Less than this is a compromise between staying power and other features, stuff like mages with epic warding for example, should be allowed to have less HP, builds with epic dodge might also be permitted a little less HP.<br/>\n<br/>\nThese are the references I use, HipMaestro and Kail Pendragon:<br/>\n<blockquote><div><strong>HipMaestro wrote</strong> (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/toughness-called-shot-why-all-the-love-t515384.html\" rel=\"noreferrer\" target=\"_blank\">toughness-called-shot-why-all-the-love-t515384.html</a>)<br/>\n<br/>\nI can't speak for Kail, but I set certain minimums from experience to increase my chance to sustain my PCs chances of survival. One of these tenets are melee HPs. I use a different set of minimums for casters. For melee and to some extent even archers, the minimum base HPs recommended at Lvl 20 is 200. At 40, 400 HPs. I will always manipulate whatever I can to assure that level minimum. It's not love, though. It's a necessity for my play style.<br/>\n<br/>\n<br/>\n<strong>Kail Pendragon wrote:</strong> (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/toughness-called-shot-why-all-the-love-t515384.html\" rel=\"noreferrer\" target=\"_blank\">toughness-called-shot-why-all-the-love-t515384.html</a>)<br/>\n<br/>\nIn general Toughness is not a bad feat (eventually equivalent to 2 epic feats) to have although it's not high on my priorities. It's a good way to bring HPs up to a desired mark (at lvl 40 for me it's 400 HPs for those involved regularly in melee without being absolute melee specialists, 300 for casters, 500 for dedicated meleers).</div></blockquote>\n\nRegarding rapid shot. In my experience rapid shot is helpful if you can stand and shoot uninterrupted. The most likely situation this will happen is in a party, with powerful disables, or with powerful summons, or taking advantage of terrain. If these conditions are not met, then rapid shot tends not to be helpful in a build BAB 26+. It might be helpful in a 3/4 BAB build with 3 APR, to get to that 2 first attack flurry and hit and run.<br/>\n<br/>\nFinally, the offensive capabilities are fine in the build. That is not the problem with this build. I am interested in enhancing defensive capabilities if possible, which might be more HP, more saves, more AC etc etc. I've got Tumble 40, Armor Skin and going to put sword and board into the build plus UMD for more defence, there are going to be many situations where this fellow has to manfight.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:36 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've mentioned this in the PvM Duo thread but I don't judge builds on their base AB, I judge them on their self-buffed AB. I also balance AB around what a minmaxed STR Figh/WM build can achieve, and in my experience that scale has been accurate across every server I've ever played on.<br/>\n<br/>\nIn a vanilla +5 EB world a minmaxed STR Figh12/WM28 can achieve +65 AB.<br/>\nAs a result the absolute minimum AB I would accept in a vanilla +5 EB world is +50 AB, with average AB at around +55 AB and decent AB being anything above +60 AB.<br/>\nOn every server I've played on, whether +3 EB or +20 AB, this -15/-10/-5 scale works well to give a rough estimate of what AB values to aim for in PvM.<br/>\n<br/>\nCurrently your build gets +54 melee AB and +57 ranged AB in a +5 EB world, which as far as I'm concerned are both average.<br/>\n<br/>\nRegarding Rapid Shot, if you're not in a situation where you're able to stand still and attack at range then you would almost always be better off just switching to melee anyway. If you're planning on playing solo then your ranged attacks will mainly be for kiting or wearing down mobs before they enter melee range, in which case you would probably be better off just making a dedicated melee build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:58 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll let Yunim take it from here, he seems to have a firmer grasp of the fine details than I do.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:59 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is a kind of build that definitely has it's place: Handling both melee and ranged combat well.<br/>\nA sword and board warrior with AB +43, naked AC 31 (32 with any +2 dex item) and dev crit with DC 40 on the scimitar should do well in most PvM scenarios.<br/>\nAn archer with dev crit (and a reasonable AB) is only possible with a strength based arcane archer.  An AB of +46 is very good on any other ranged build, other than an AA. <br/>\nIt is not very hard to build a strength based AA with a better ranged AB than 46: Take as many AA levels as possible, don't leave dexterity at 10 and take some Great dexterity to round it off, if you can manage that. But you soon get feat starved and have to drop EWS and maybe even WS on one or both weapons. You may also want to drop some strength to free up feats and to start out with a little extra dexterity, leaving you with less melee AB, less damage and a lower DC. No matter how, you soon end up with something else unless you weight things carefully.<br/>\nCinnabar Dinn's Devastator ended up with a ranged AB of 52, (I think). It is worth studying his build to see how he went about to get there. He writes that he was pleased with how his build performed on WoG.<br/>\n<br/>\nA specialized build will most of the time be better at what it can do than a build with more than one focus. But it is important to ask oneself what is \"good enough\" where you play. And versatility is also a resource in many situations, offering different approaches when facing a challenge.<br/>\nThe AB bonus from Enchant arrow makes it possible to build arcane archers with a different focus than dexterity or wisdom and still end up with a very good AB.<br/>\nThat's what Orion is working on here.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:07 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As for your build<br/>\nStarting out with Str 18 and dex 10, I would have given melee combat feats and WF, WS and IC on the scimitar priority early on. You only need two ranged feats to qualify for AA, and you don't need them at once.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "11:44 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As I said in my first post I don't think that this is bad build, just an average one.<br/>\n<br/>\nI've been doing some testing recently with ranged Dev Crit builds and in comparison to the AB a dedicated ranged Dev Crit build can reach this is pretty low. In a +5 AB/EB world a Cler15/Bard2/AA23 can reach +74 AB with a longbow and a Cler29/Bard1/RDD10 can reach +67 AB with a heavy crossbow. Even with that AB difference the RDD lands more criticals per round on average than the AA unless the opponent has 77 AC or more, due to the increased threat range. Both of these builds are minmaxed for AB rather than Dev Crit DC and playable variants would have 3 or 4 less AB, but this is what you're up against when comparing AB values.<br/>\n<br/>\nI just made a quick test Cler26/Figh4/CoT10 build with dual Dev Crit that has +63 melee AB and +60 ranged AB in a +5 AB/EB environment. That is what I would consider decent AB for this kind of build. Having said that, it is a completely different build that has its own problems and honestly I wouldn't recommend playing it.<br/>\n<br/>\nThis build can penetrate X/+13 DR thanks to AA levels, has a decent skill selection, and does decent damage even without Dev Crit, the main downside is the AB.<br/>\nIn conclusion, average doesn't mean bad, it means average.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:50 PM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Yunim wrote: <a data-post-id=\"18845\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18845&amp;sid=dda7b0624e4ec14fb267a2c5afc576a2#p18845\">↑</a><div class=\"responsive-hide\">Feb 02, 2020</div></cite>I've mentioned this in the PvM Duo thread but I don't judge builds on their base AB, I judge them on their self-buffed AB. I also balance AB around what a minmaxed STR Figh/WM build can achieve, and in my experience that scale has been accurate across every server I've ever played on.<br/>\n<br/>\nIn a vanilla +5 EB world a minmaxed STR Figh12/WM28 can achieve +65 AB.<br/>\nAs a result the absolute minimum AB I would accept in a vanilla +5 EB world is +50 AB, with average AB at around +55 AB and decent AB being anything above +60 AB.<br/>\nOn every server I've played on, whether +3 EB or +20 AB, this -15/-10/-5 scale works well to give a rough estimate of what AB values to aim for in PvM.<br/>\n<br/>\nCurrently your build gets +54 melee AB and +57 ranged AB in a +5 EB world, which as far as I'm concerned are both average.<br/>\n<br/>\nRegarding Rapid Shot, if you're not in a situation where you're able to stand still and attack at range then you would almost always be better off just switching to melee anyway. If you're planning on playing solo then your ranged attacks will mainly be for kiting or wearing down mobs before they enter melee range, in which case you would probably be better off just making a dedicated melee build.</div></blockquote>\nThe only reason why this AB discussion is continuing is clearly not to assist the original poster, but to defend the reputations and feelings of those who have expressed views.<br/>\nI have already advised I am tiring of hearing about AB in this build yet this commentary continues. I have written <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/maximising-ab-in-builds-a-guide-t2355202.html\" rel=\"noreferrer\" target=\"_blank\">a guide on maximising AB in builds</a> in this forum, I understand extremely well how its done. You are not assisting me by talking to me about AB. There already has been a lengthy discussion about this which I want concluded to examine about other ways the build can be improved.<br/>\n<br/>\nThis is a forum where we communicate ideas, if you are serious about communicating, there has to be a common language. I encourage this language to be learnt. For the ECB traditionally that has been the Base AB statistic with mundane equipment. The advantage of the Base AB statistic, when communicated, is that it allows others to quickly understand where the AB sits compared with other builds. The reader can make further adjustments based on the class (ie cleric, bard get huge boosts to AB) and environment. I would encourage this continues, unless the moderators suggest a better way. <br/>\n<br/>\nSelf-buffed AB can be mentioned afterwards. This is not a statistic I particularly read, I know from knowledge of the game that BAB Cleric with 38 base AB is going to hit things ok in a low-mid magic environment with all the buffs available to it which allow it to hit the +20 AB cap, but players who don't know the class will certainly appreciate such information being shared. <br/>\n<br/>\nSelf-buffing with UMD/sequencers varies between different environments, and only those who know the environment can tell you how far that self-buffing can go. I can tell you straight away, in WoG, with UMD, with PnP Tensors + Divine Power (which is a strategy I rarely use honestly), this build can hit the +20 AB cap with either weapon, meaning a buffed AB of 69 melee and 72 ranged with both stats capped (also achievable with UMD). <br/>\n<br/>\nValerfor has done research on AC of enemies. The highest AC an enemy has in the standard toolkit from what he could find, is the Dreaded Black Slaad which has 49 AC. A 39 base AB build (ie a 3/4 BAB class) would be able to hit such an enemy regularly even with mundane equipment, with +5 equipment plus stat boosts plus flanking bonuses, such an enemy is being hit regularly by that 39 AB build 10 levels earlier. He even looked at the ending boss AC of some of the popular single player modules (Diablo, Lord of Terror and Rhoan, The Sun God) and I don't want to post any spoilers, but that same 39 AB build is going to do fine.<br/>\n<br/>\nEven if you ignore Mithdradates/Mick Dagger/Valerfor's advice, the benchmark for AB should be the pure fighter. A min-maxed pure strength human or dwarf melee fighter can hit base 46 AB (see the Yardstick thread), a player might want to take a few epic general feats or invest in other statistics and drop the AB down for enjoyment, and that is fine. The build draft I wrote hits 43 AB melee and 46 AB ranged which compared to a pure min-maxed fighter is comparable, its good enough. High Weapon master, Full BAB Class &amp; RDD, and Arcane Archer are the only potential classes that can exceed that min-maxed fighter by a significant amount but these classes are somewhat imbalanced. <br/>\n<br/>\nThere is a very myopic min-max culture of building commentary surrounding AB which stifles creativity and versatility and I would argue reason. Valerfor described the extreme AB focus as the 'hypermodern' approach to building, and I am inclined to agree. Just because you can get more AB doesn't mean you have to get more AB, or that a build is necessarily more powerful with that extra AB.  <br/>\n<br/>\nI believe versatility, the ability to solve multiple problems well, is more valuable and enjoyable than specialism, the ability to solve some problems extremely well, but others poorly.<br/>\n<br/>\nA smart module creator or DM will create unusual challenges to push players. A melee weapon master 28 with 53 AB and dev crit might do well in certain circumstances. But place that same melee weapon master against a horde of 20 rust monsters? Or 20 medusae spamming petrify gaze? Or a high level melee/mage mob who are scripted to arrive and attack you from the rear so you can't simply pull and slay? Maybe a series of towers filled with archers and mages which your weapon master can't reach easily? This is where versatility is far more useful than specialism. In fact for the soloist, versatility is much more valuable compared with a party, where specialism can be more valuable. <br/>\n<br/>\nAnyway I have supplied all the references to all these great builders and what their opinions are on what a good AB is, I would encourage you treat these individuals with the respect they deserve from the years of working on building whilst being under the scrutiny of peer review and actually read what they have written. If I build well at all, it is because I stand on their shoulders and can see further as a result.<br/>\n<br/>\nFinally, one more reference. Mithdradates's advice on writing builds.<br/>\n<blockquote><div>Cinnabar Din wrote: (<a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/general247382.html\" rel=\"noreferrer\" target=\"_blank\">https://world-of-greyhawk.github.io/bui ... 47382.html</a>)<br/>\n<br/>\nTaken from a post by Mithdradates, I thought this was excellent advice on planning/creating a build:<br/>\n<br/>\n<br/>\nRule 0: When in doubt, make the choices that are fun for you. Power is good and fine, but in the end you are playing the build and what feels right to you is going to be more enjoyable and, because it meshes with your playstyle, easier to play.<br/>\n<br/>\nRule 1: Know your environment. Know what equipment and immunity items are available to your character and opposition before you build your character. If you can get an immunity to critical hits item, then a palemaster is less appealing. If immunity to mind spells is common, don't specialize in enchantment spells. If true seeing items are common, shadowdancers become less attactive, etc. Also be aware of potential imbalances in your setting before you play. If you're planning to play on a PW where true seeing has been changed to not automatically identify hidden creatures and shadowdancers have not been banned, either play a shadowdancer or find another server.<br/>\n<br/>\nRule 2: Break down your build into a list of must haves and nice to haves. The must haves are the things that define your build, it could be feat like devastating critical or it could be requirement like an AB of 44+ to hit the monsters reliably on your server. The nice to haves are things that would help your character survive but aren't necessary, e.g. improved knockdown (probably a must have for a rogue build, but a nice to have for most melee builds). Work out what you would need to fit in your must haves. If you find you need to min/max to get those in, you're being too ambitious, you're over extending your build and you're suffering in other places. Once you have put in your must haves, try to fit in as many nice to haves as you can.<br/>\n<br/>\nRule 3: Be critical of your build. Once, you've fleshed out your build ask yourself if I was going to take down this build how would I do it? What is its weakness, does it have low hitpoints, low saves, low AC? Against what AC is it going to have trouble hitting, and how common are those enemies? What SR is going to mess up my casting and how high does an opponent's saves have to be to avoid my finger of death? Once you've figured out your weaknesses, modify your build as much as possible to minimize those weaknesses. This is where knowing the immunity items available in your setting can be handy. You should be your build's worst enemy.<br/>\n<br/>\nRule 4: Test your build. You can calculate most things by hand, but there is nothing like building it in an editor to see weak spots and potential calculation errors you might have made. Sometimes this can reveal places where you can change the order that you level up to make your build more playable.<br/>\n<br/>\nThere is a lot more to say, but that should be enough to get you started.</div></blockquote>\nI have achieved what is essential in the build (Base AB 40+ both weapons, 400 base HP), nice (Base AB 42+ dev crit both weapons) and now I'm looking at polishing it off ie fun stuff, making it diverse, making it interesting, adding lore and character to the build, making it new and novel rather than rehashing the same old tired fighter/rdd or weapon master stuff. Mick has already pointed out playability is enhanced by taking the scimitar feats earlier than archery and this is excellent advice, perhaps there is more advice to come. <br/>\n<br/>\nWhy aren't we talking about the fortitude saves or the lack of evasion by the way? What is this builds worst enemy, as Mithdradates asks? What is actually going to take this guy down? And how can this guy be built to defend him/herself against such enemies? These are questions I am much more interested in.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "1:23 AM - Feb 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Believe me, you don't need to convert me to the joys of balanced builds. The main thing I dislike about the ECB guild is how much it focuses on minmaxing so it feels weird to be on this side of the argument. Most of the builds I see online or even post myself (here or on the BSK forum) are so minmaxed that I wouldn't play them.<br/>\n<br/>\nAfter reading the PvM Duo thread and this thread, it appears that I have severely overestimated both the AC values and the magic level of WoG. I already knew that some immunity items were on the server but if sequencers are available then it's obviously a higher magic world than I expected. That would also explain why AB I normally consider bad is acceptable for experienced WoG players like webshaman1, I would need to adjust the Figh/WM AB for more than just +5 EB.<br/>\n<br/>\nRegarding toolset AC, a Prismatic Dragon is a CR 37 mob that has 70 AC unbuffed and 85 AC after it uses Deflecting Force. This is higher than most (possibly all) toolset mobs, but is closer to what I would expect a level 40 boss to have. Very few PWs use toolset monsters at high levels because they just don't scale properly against what a level 30+ character can do. If I was expecting to fight vanilla black slaads at level 40 then I would probably stop playing and find a more challenging server.<br/>\n<br/>\nI use a minmaxed STR Figh/WM as the benchmark because that is what I consider the most generic DPS build. Changing that to a pure Fighter wouldn't change anything except moving my scale from -15/-10/-5 to -8/-3/+3. Builders would still need to balance their world around what a STR WM could do so ultimately it doesn't matter.<br/>\n<br/>\nMoving back on topic, I've mentioned the changes that I would make to this build in my first post and you've already responded to those with your edit. Even with 12 Fighter levels there is very little room in this build for any feat changes unless you're willing to drop G STR 2 or EWS as Mick Dagger has pointed out.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:31 AM - Feb 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would suggest leaving WoG out of the build discussion.<br/>\n<br/>\nWe could have another thread on it discussing environment - it might be interesting to discuss different environments and how the affect builds.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:41 AM - Feb 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Yunim wrote: <a data-post-id=\"18858\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18858&amp;sid=dda7b0624e4ec14fb267a2c5afc576a2#p18858\">↑</a><div class=\"responsive-hide\">Feb 03, 2020</div></cite>Believe me, you don't need to convert me to the joys of balanced builds. The main thing I dislike about the ECB guild is how much it focuses on minmaxing so it feels weird to be on this side of the argument. Most of the builds I see online or even post myself (here or on the BSK forum) are so minmaxed that I wouldn't play them.</div></blockquote>\nI think you need to be clear on what is min-maxing and what is optimising before you use these terms.<br/>\nBecause the guild is about optimising and not min-maxing.<br/>\nOptimising is making the build the 'best' it can be, and this includes balancing the build appropriately, which there has been some great discussion about. What is best is highly subjective, and depends on environment, and also factors such as fun. There are general guidelines but no hard and fast rules a build has to be 'x' and 'y'<br/>\nMin-maxing is sacrificing balance for a single feature (for example, highest possible DC spell casting, or highest HP possible, or highest sneak attack possible). Sometimes this is good, sometimes this is great even, sometimes it is bad. Sometimes it is a fun exercise, for example there was a <a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build240052.html\" rel=\"noreferrer\" target=\"_blank\">highest possible AB contest</a>. But have a look at Mick Dagger's builds, Stagmeister's builds, Empyre65's builds, Grizzled_Dwarflord's builds -&gt; they tend to have very enjoyable balance, which is crafted through feedback from others.<br/>\nBSK has a very interesting balance, having worked with Cornflower with a few builds and learnt from him what suits his environment best. I understand there are many weapons that can be made eventually with +20 attack bonus on them whilst other properties remain more mid-magic. <br/>\n<br/>\nI would encourage that you post builds that you would be prepared to play.  I post a lot of build draft ideas, and I challenge you to be creative, think outside the box, look at what has and hasn't been done, like this build has done. I encourage you to consider where general guidelines can be broken, for example in this circumstance, half-elf is a fine choice, normally half-elf is not a great choice at all. It is only by challenging the norm that new and creative builds can grow and prosper. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:28 AM - Feb 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I experiment with minmaxed builds regularly, mainly in damage calcs, but I would never play one on an actual server. I prefer having higher HP, better saves, and better skills more than having a few more points of AB or better damage.<br/>\nAs an example, I usually only use G STR or G DEX feats as filler. There are some exceptions, but in general I would rather have EER, ESF, or epic save feats than +1 or +2 AB. As a result most of my builds have what I consider average AB, especially PvP builds that can make up for it with other abilities. Many builds on the ECB opt for that extra +1 or +2 AB at the cost of flexibility or survivability. You might call it optimising but personally I consider it minmaxing if it's taken too far.<br/>\n<br/>\nAs for posting builds I would play, most of them are just variants of builds that have already been posted on the ECB. There are only so many ways you can make a decent Monk/AA, there's no point in posting my own version that has slightly different feats or level progression. Some of the builds I play haven't been posted on the ECB before, but in general most of the builds I consider good, or at least variants of them, have been posted before. I also don't think there's any point in posting a unique build if it's straight up worse than a more common build. I sometimes make weird yet effective builds but I almost never make unique builds for the sake of making unique builds. Especially not if they're worse than a more generic build. NWN is a very old game. Excluding server-specific builds I think that most decent builds have been tried before, although not all of them are posted online in forums like the ECB. That's not to say that there aren't new and unique builds that can be good, it's just that generic builds are usually best.<br/>\nThe classics are classics for a reason.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:06 AM - Feb 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I normally mess around until I find a build that, together with everything else, can solo a server without problem.<br/>\n<br/>\nProblem means, for me, not having to jump through hoops, or perform difficult things to accomplish my goal.<br/>\n<br/>\nI have tried lots of builds, both from here and from other sources.<br/>\n<br/>\nI have yet to really like any of them, they all seem to fall short of what I am looking for.<br/>\n<br/>\nSo, I end up eventually making my own.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:13 PM - Feb 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Going back to the build<br/>\n- I think it looks good, enjoyable to play, enough balance, enough skill points etc. <br/>\n- I will have a look at Cinnabar Din's Devastator to see if there are any further things to adjust before I start play testing it<br/>\n- There maybe further adjustments to make when play testing if there are problem encounters<br/>\n- Thanks to everyone for reading the build and making suggestions<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "4:36 AM - Feb 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Wait, I could have sworn I was looking at this the other day and Webshaman liked it. Well, that's the build I'm looking for anyway. Was there another AA longbow and scimitar build somewhere else that you made recently, Orion that you liked, Webshaman.?<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:42 AM - Feb 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Like, and really like, are two different creatures.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "4:46 AM - Feb 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was sure there was a thread recently where you were the first to comment but the comment was the antithesis of your one above.<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:04 AM - Feb 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And yes, there is another build that he made (uses scimi) that I really like.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "6:00 AM - Feb 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Web likes the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/double-devastating-edr-iii-juggernaut-fighter-20-b-t2355336.html\" rel=\"noreferrer\" target=\"_blank\">Double Devastating EDR III Juggernaut</a> better :)<br/>\nWith over 500 base HP, EDR III, double dev crit melee and ranged, both base ABs 40+ and UMD fair enough :)<br/>\nThe saves are its weakness. UMD helps with this. Once one learns how to manage low saves well with UMD it tends to be not a problem PvM solo.<br/>\nParty it would be a monster with all the buffs.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}