{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "400",
  "name": "Request: Arelith wizard",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/request-arelith-wizard-t2334680.html",
  "author": "Angua",
  "avatar": "10235244_1510287070.jpg",
  "replies": 8,
  "posts": [
    {
      "author": "Angua",
      "avatar": "no_avatar.png",
      "timestamp": "2:26 PM - Jun 04, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello! <br/>\nI have wanted to create a character that relies on spellcasting for a while. I have tinkered with a few combinations, so far.<br/>\nWizard (30), Wizard(27)/Bard(3), Wizard(27)/Rogue(3), Wizard (24)/Bard(3)/PM(3)<br/>\nWhat can you recommend? This is for the ARELITH-server, so quite a few specifics apply. For one, with the combination of PM, your dragon knight-feat is a dracolich, which is both a bit more powerful and amazingly cool. <br/>\n\"Boons\" are avaliable, giving you +2 to any stat post-creation. You can get 3 of these boons, but one ability cannot be given more than +2. The server is low-magic, making spellcasters very powerful. Epic Warding is unavaliable. RDD, PDK and Shifter are all unavaliable. When taking a new class, 3 levels of said class must follow. When these 3 first levels are met, one can mix as crazily as one wishes. Eg:<br/>\n1: Rogue<br/>\n2: Rogue<br/>\n3: Rogue<br/>\n4: Fighter<br/>\n5: Fighter<br/>\n6: Fighter<br/>\n7: Rogue<br/>\n8: Fighter<br/>\n9: Rogue<br/>\nect.<br/>\n<br/>\nWhat is particular about spellcasters is the many benefits that come from Spell Focus.<br/>\nHere is the full list of changes: <br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Spell_changes</a><br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Feat_changes\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Feat_changes</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:25 PM - Jun 04, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">OK, so you want a wizard with spell focus, and apparently PM levels with the Dragon Knight feat, but I presume you wouldn't be interested in losing caster levels for penetrating SR to go as far as getting PM 10 for critical hit immunity, right? Or would you?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:53 PM - Jun 04, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, this is a sketch of a very powerful Wizard / PM / Rogue.<br/>\n<br/>\nBard is a bad idea cuz it gives you nothing that Rogue doesn't give you, but Rogue gives Evasion, which is good for a caster with nice saves vs spells. I made him a generalist, but you can also go with Illusion (since it's a gnome favored class) and gain an extra spell per day. He is 5% dispellable, but he has +2 AC for that from Bone Skin, which I consider a good trade.<br/>\n<br/>\nHe has Hide and Move Silently as a backup plan, so you can use a Darkness spell to get out of combat mode and Hide. He also has the Dracolich summon, which you said you really wanted. He can penetrate SR with his caster levels and ESP, but he is not meant to fight in melee. No Blind Fight, no Epic Mage Armor (although you can tweak it in by getting rid of Epic Spell Penetration), no Armor proficiencies, etc... He should have OK AC with the correct equipment, but nothing to write home about. What's remarkable are his DCs. Low-willed enemies will have a hard time fighting this guy. One Mass Charm and they're yours to command! <br/>\n<br/>\nAnyway, here is the draft of the Arelith Necro-enchanter:<br/>\n<br/>\nWizard(23), Pale Master(4), Rogue(3), Gnome<br/>\n<br/>\nSTR: 8<br/>\nDEX: 14<br/>\nCON: 16<br/>\nWIS: 8<br/>\nINT: 18 (26)<br/>\nCHA: 8<br/>\n<br/>\nGnome: (Defensive Training vs. Giants, Hardiness vs. Enchantments, Low-light Vision, Offensive Training vs. Goblinoids, Offensive Training vs. Reptilians, Skill Affinity: Concentration, Skill Affinity: Listen, Small Stature, Spell Focus: Illusion)<br/>\n01: Wizard(1): Extend Spell, {Scribe Scroll}<br/>\n02: Wizard(2)<br/>\n03: Wizard(3): Spell Focus: Necromancy<br/>\n04: Wizard(4): INT+1, (INT=19)<br/>\n05: Wizard(5): Greater Spell Focus: Necromancy<br/>\n06: Wizard(6): Empower Spell<br/>\n07: Wizard(7)<br/>\n08: Wizard(8): INT+1, (INT=20)<br/>\n09: Wizard(9): Still Spell<br/>\n10: Wizard(10): Maximize Spell<br/>\n11: Wizard(11)<br/>\n12: Wizard(12): INT+1, Spell Penetration, (INT=21)<br/>\n13: Wizard(13)<br/>\n14: Wizard(14)<br/>\n15: Wizard(15): Spell Focus: Enchantment, Greater Spell Penetration<br/>\n16: Wizard(16): INT+1, (INT=22)<br/>\n17: Wizard(17)<br/>\n18: Pale Master(1): Greater Spell Focus: Enchantment<br/>\n19: Pale Master(2)<br/>\n20: Pale Master(3): INT+1, {Darkvision}, (INT=23)<br/>\n21: Wizard(18): Armor Skin<br/>\n22: Wizard(19)<br/>\n23: Wizard(20): Epic Spell Focus: Necromancy<br/>\n24: Wizard(21): INT+1, Epic Spell: Dragon Knight, (INT=24)<br/>\n25: Wizard(22)<br/>\n26: Rogue(1)<br/>\n27: Rogue(2): Great Intelligence I, {Evasion}, (INT=25)<br/>\n28: Rogue(3): INT+1, {Uncanny Dodge I}, (INT=26)<br/>\n29: Wizard(23): Epic Spell Focus: Enchantment<br/>\n30: Pale Master(4): Epic Spell Penetration<br/>\n<br/>\nHitpoints: 224<br/>\nSkillpoints: 264<br/>\nSaving Throws (Fortitude/Will/Reflex): 16/17/13<br/>\nSaving Throw bonuses: Spells: +8, Mind Effects: +2<br/>\nBAB: 14<br/>\nAB (max, naked): 14 (melee), 17 (ranged)<br/>\nAC (naked/mundane armor/shield only): 25/28<br/>\nSpell Casting: Wizard(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 33(38), Heal 4(3), Hide 33(35), Listen 33(34), Lore 33(41), Move Silently 33(35), Open Lock 1(3), Spellcraft 33(41), Tumble 30(32), UMD 31(30)<br/>\n<br/>\n01: Concentration(4), Lore(4), Spellcraft(4), Save(12), <br/>\n02: Concentration(1), Lore(1), Spellcraft(1), Save(15), <br/>\n03: Concentration(1), Lore(1), Spellcraft(1), Save(18), <br/>\n04: Concentration(1), Lore(1), Spellcraft(1), Save(21), <br/>\n05: Concentration(1), Lore(1), Spellcraft(1), Save(24), <br/>\n06: Concentration(1), Lore(1), Spellcraft(1), Save(27), <br/>\n07: Concentration(1), Lore(1), Spellcraft(1), Save(30), <br/>\n08: Concentration(1), Lore(1), Spellcraft(1), Save(34), <br/>\n09: Concentration(1), Spellcraft(1), Save(39), <br/>\n10: Concentration(1), Spellcraft(1), Save(44), <br/>\n11: Concentration(1), Spellcraft(1), Save(49), <br/>\n12: Concentration(1), Spellcraft(1), Save(54), <br/>\n13: Concentration(1), Spellcraft(1), Save(59), <br/>\n14: Concentration(1), Spellcraft(1), Save(64), <br/>\n15: Concentration(1), Spellcraft(1), Save(69), <br/>\n16: Concentration(1), Spellcraft(1), Save(75), <br/>\n17: Concentration(1), Spellcraft(1), Save(81), <br/>\n18: Concentration(1), Hide(21), Listen(21), Move Silently(21), Spellcraft(1), Save(24), <br/>\n19: Concentration(1), Hide(1), Listen(1), Move Silently(1), Spellcraft(1), Save(27), <br/>\n20: Concentration(1), Hide(1), Listen(1), Move Silently(1), Spellcraft(1), Save(30), <br/>\n21: Concentration(1), Spellcraft(1), Save(36), <br/>\n22: Concentration(1), Spellcraft(1), Save(42), <br/>\n23: Concentration(1), Spellcraft(1), Save(48), <br/>\n24: Concentration(1), Spellcraft(1), Save(55), <br/>\n25: Concentration(1), Spellcraft(1), Save(62), <br/>\n26: Hide(6), Listen(6), Move Silently(6), Open Lock(1), Tumble(29), UMD(29), <br/>\n27: Hide(1), Listen(1), Lore(10), Move Silently(1), Tumble(1), UMD(1), <br/>\n28: Heal(2), Hide(1), Listen(1), Lore(10), Move Silently(1), UMD(1), <br/>\n29: Concentration(4), Heal(1), Lore(1), Spellcraft(4), <br/>\n30: Concentration(1), Heal(1), Hide(2), Listen(2), Lore(1), Move Silently(2), Spellcraft(1), <br/>\n<br/>\nSo, is this what you were looking for? <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Angua",
      "avatar": "no_avatar.png",
      "timestamp": "7:19 PM - Jun 04, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A very interesting build! I thank you for the time you put into it.<br/>\nHowever! I know very little of spellcaster builds (Hence, my asking ), but:<br/>\n<br/>\n- One of the constraints was that it had to be a human.<br/>\n- Dracolich is not a requirement - I was just hoping for something not entirely cookie-cutter. Give me a few \"picks\", perhaps. I would rather be a full-out efficient spellcaster, than something wildly untraditional.<br/>\n- You will -rarely- encounter monks, so SR 32 is the only thing that you need to beat. Does that not make Spell Penetration somewhat redundant? Or does it merely compensate for the lack of caster levels?<br/>\n- Given that the server is low magic, you will not find items that require more than 15 points in UMD.<br/>\n- You are missing a LOT of potential in the spell focus, greater spell focus and epic spell focus areas. I was hoping for greater focus in abj. and epic focus in evo. I would prefer these over focus in necromancy (Depending on your arguement for this focus). It is an RP server, so insta-death abilities upon other players are less fun than, say.. Turning them into stone. Epic focus in enchantment is the least desirable from a purely \"Arelith additions\" perspective, as it only allows the enchantment of better items, that I can procure through other players.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:45 PM - Jun 04, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>- One of the constraints was that it had to be a human.</div></blockquote>\n\nAll you gotta do is change the race. You'll get one extra feat and lose two points in CON while gaining two in STR.<br/>\n<blockquote><div>- Dracolich is not a requirement - I was just hoping for something not entirely cookie-cutter. Give me a few \"picks\", perhaps. I would rather be a full-out efficient spellcaster, than something wildly untraditional.</div></blockquote>\n\nWhat makes you think that this is not a full-out efficient spellcaster? The Dracolich was a choice that can be tweaked out of the build. If you get rid of it, just put something else in its place. Epic Mage Armor sounds great to me. If you get rid of both this and the Epic Spell Penetration, you can up your INT modifier by 1 with two more Great Intelligence feats.<br/>\n<blockquote><div>- You will -rarely- encounter monks, so SR 32 is the only thing that you need to beat. Does that not make Spell Penetration somewhat redundant? Or does it merely compensate for the lack of caster levels?</div></blockquote>\n\nSR 32 is the cap of Bioware Toolset as well. With 23 Caster levels, you'd penetrate it 55% of the time with a level 1 spell. How would you feel if one of your 8th level spells got resisted? The SP line of feats makes it so that only your level 1 and level 2 spells can be resisted. One lesser Spell Breach and BOOM, all your spells now affect the target. This is to avoid having to use Breach spells and scrolls to be able to cast on something. So yes, it is to \"compensate\" the lack of caster levels.<br/>\n<blockquote><div>- Given that the server is low magic, you will not find items that require more than 15 points in UMD.</div></blockquote>\n\nGreat, then this means you have extra skill points available!<br/>\n<blockquote><div>- You are missing a LOT of potential in the spell focus, greater spell focus and epic spell focus areas. I was hoping for greater focus in abj. and epic focus in evo. I would prefer these over focus in necromancy (Depending on your arguement for this focus). It is an RP server, so insta-death abilities upon other players are less fun than, say.. Turning them into stone. Whilst Conj. makes leveling easier, this is not necessary.</div></blockquote>\n\nWell, I thought that RP-wise, a Dracolich summoner with PM levels should be more of a master of the Dark Arts. If you want, change the focus, no biggie, especially if there are immunities around. I'm curious, however, as to why you prefer evocation spells... They are subject to Evasion and Improved Evasion (they do half damage against anyone with IE and if they succeed the save, NO DAMAGE). But, these aren't at all forged in stone. If you say that you don't know much about casters, then I suggest you try to learn a bit before delving deeper into using one. Necromancy and Enchantment are, IMO, the two best schools to focus on. Why? Because they each attack one of the two most common weak saves for NWN characters. Necromancy attacks the Fortitude saves, while Enchantment attacks Will. <br/>\n<br/>\nSneakers and meleers in general have a weak Will save.<br/>\n<br/>\nCasters normally have a weak fortitude save.<br/>\n<br/>\nFor everything else, you have IGMSs and other \"tools\"<br/>\n<br/>\nHow nice would it be in a party PvP to take control over their most powerful warrior and make him attack them? This is what this build can do.<br/>\n<br/>\nBUT, if you want to change the schools, then go ahead, I just hope you know what you're doing.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Angua",
      "avatar": "no_avatar.png",
      "timestamp": "8:29 PM - Jun 04, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I didn't mean to offend you - I am well aware that you are the expert, where as I am fairly new to this.<br/>\nI was hoping you could offer me a less \"sinister\" alternative, in case my wizard turns to the side of good, or neutral.<br/>\nNecromancy holds great ramifications within an RP setting, and is not something that should be taken lightly.<br/>\nI was thinking that with more wizard levels, perhaps there would be a few additional feats to specialize in another spellschool.<br/>\nNote that abjuration, for instance, makes you immune to missile storms and adds to your dispel-checks.<br/>\n<br/>\nEdit: I also am not fully able to see the use for enchantment, as holding seems to be what it is good for. At least, in a PvP scenario.<br/>\nEdit Edit: I am also puzzled by the ammount of metamagics. Perhaps I do not really grasp how to play a wizard. Is there any sort of.. Guide one can read?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:26 PM - Jun 04, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Angua wrote:</strong>I didn't mean to offend you - I am well aware that you are the expert, where as I am fairly new to this.<br/>\nI was hoping you could offer me a less \"sinister\" alternative, in case my wizard turns to the side of good, or neutral.<br/>\nNecromancy holds great ramifications within an RP setting, and is not something that should be taken lightly.<br/>\nI was thinking that with more wizard levels, perhaps there would be a few additional feats to specialize in another spellschool.<br/>\nNote that abjuration, for instance, makes you immune to missile storms and adds to your dispel-checks.<br/>\n<br/>\nEdit: I also am not fully able to see the use for enchantment, as holding seems to be what it is good for. At least, in a PvP scenario.</div></blockquote>\n\nMaybe it's the fact that English isn't my first language, but I wasn't offended at all by your comments. Why did you get that feeling?<br/>\n<br/>\nI just wanted to point out that there is a reason behind my choices in this build, and that, due to the fact that you aren't as experienced as I am, you may not be seeing something that I intended. On the other hand, you know Arelith better than I do, so that also makes a difference. For example: I wasn't aware that SF: Abjuration makes you immune to IGMSs (nor would I take the time to read through the rules unless I was going to play there myself). That is gamebreaking!!! The solution to this problem is simple: since you don't like Necromancy, get rid of it for Abjuration swap 3 feats for 3 feats.<br/>\n<br/>\nNow, PM without the Dracolich and the Necromancy focus makes little sense. The way I had set it up, it made sense, now I don't think it would. You can swap these levels for Fighter levels and get some \"free\" feats. Fighter 1 and 2 could be Expertise and Improved Expertise (they work until you cast your first spell unless Arelith has modified it as well). Then the third feat can be used for Armor Skin, which frees up a general feat. Get rid of the Dracolich and now you have either +2 INT (+1 Modifier)or 2 Epic Spells of your choice. The order in which you take these feats is also very tweakable, just adjust it to your preferences. The only thing you need to be wary about is the fact that you can't swap the Great INT feat that is taken on a Rogue level (I think it's lvl 27) for any metamagic feats. You probably won't be able to take Fighter at level 30 either, unless you decide to take two Great Intelligence feats instead of Epic Spells. Great Intelligence is a general feat, Epic spells aren't.<br/>\n<br/>\nSo, the Spell Penetration line of feats can be swapped for a focus on another school (Illusion? I read somewhere that Illusion gives you access to a custom epic spell). Anyway, it's hard for me to understand the specifics of Arelith since I don't play there myself, but everything that you have pointed out so far is server-specific, which is hardly my area of expertise.<br/>\n<br/>\nLast but not least, the enchantment spells. Arelith may have modified these as well, but as far as I know, it mostly dazes the enemies in PvP, EXCEPT for one spell, which allows you to take control over the ones that fail the save and their associates. That spell is Mass Charm (a level 8 spell, which means you can have extended versions of it at lvl 9). The rest of them yes, they just daze / hold people. Still very useful, but much less so. Imagine having a strong Fighter under your control, to use at will? You CAN, again, unless they have changed that in Arelith.<br/>\n<br/>\nWizards get a Bonus Feat every 3 levels after 20, which means that you can get ONE MORE bonus feat by going Wizard 26/ Rogue 4. If you go Wizard 23 Fighter 4 Rogue 3 you get better saves and 3 Bonus Feats instead of 1. The use of Improved Expertise is simple. You activate that and cast Greater Sanctuary. Then you have all the time in the world to buff up, run or do whatever you want. With 10 more AC (and EMA if you tweak it into the build), they will probably not be able to hit you.<br/>\n<br/>\nAnd please, don't think that you've offended me in any way. I'm a direct person, and I tend to be taken as a brute, especially by foreigners. Here in Brazil we are culturally more informal than in the US, Canada, the UK, or pretty much anywhere else I've been to. I apologize if it seemed to you that I was upset because of your comments. That was clearly not my intention.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Angua",
      "avatar": "no_avatar.png",
      "timestamp": "10:53 PM - Jun 04, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, it wasn't that bad. I thought maybe you didn't like your build questioned. It can be very difficult to determine a tone through written text.<br/>\nYour post has helped me a great deal in understanding the class. I made the wizard you suggested, and fell partly in love with the Wail of the Banshee and Bigby's crushing hand-spells. <br/>\nI have just a few additional questions:<br/>\nWould focus in evocation help Bigby's any? From what I read, it would only affect the DC of the stun effect, but not the actual hit/miss equation.<br/>\nWhat is the chance that this spell can be missed? The equation seems to favor the caster, but I could be wrong. <br/>\ncaster: d20 + ability modifier + caster level + 12 + 4 vs.<br/>\ntarget: d20 + strength modifier + BAB + size modifier.<br/>\nAre the spell resist feats needed with 27 wizard / 3 rogue?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:20 AM - Jun 05, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Angua wrote:</strong>Oh, it wasn't that bad. I thought maybe you didn't like your build questioned. It can be very difficult to determine a tone through written text.<br/>\nYour post has helped me a great deal in understanding the class. I made the wizard you suggested, and fell partly in love with the Wail of the Banshee and Bigby's crushing hand-spells. <br/>\nI have just a few additional questions:<br/>\nWould focus in evocation help Bigby's any? From what I read, it would only affect the DC of the stun effect, but not the actual hit/miss equation.<br/>\nWhat is the chance that this spell can be missed? The equation seems to favor the caster, but I could be wrong. <br/>\ncaster: d20 + ability modifier + caster level + 12 + 4 vs.<br/>\ntarget: d20 + strength modifier + BAB + size modifier.<br/>\nAre the spell resist feats needed with 27 wizard / 3 rogue?</div></blockquote>\n\nLet me try to enlighten you as to how to use a Wizard properly. Wizards are VERSATILE CASTERS. They have ALL THE SPELLS in the game at their disposal, except if they focus on a certain school. However, they have to memorize spells before facing enemies, so knowing what you're up against is PARAMOUNT for you to be successful. <br/>\n<br/>\nPvM - As examples to the above statement, if you're fighting hordes of undeads, then you should have many spells that are good vs undead prepared (Undeath to Death, etc). Mass Heal scrolls also work wonders. If you're fighting Fire Giants, you should get rid of all fire-based spells (except Flame Weapon) in favor of cold ones (Ice Storm, Cone of Cold, etc..). That's for an EVOCATION Wizard. For this Wizard, if they are mostly warrior-types, then you should use charming spells and have them attack each other. There is a boss where I play who has a low will save. You can charm him and make him kill his minions, then release him and deal with him alone. <br/>\n<br/>\nPvP - Similarly to the above, knowing what you'll be facing can help tremendously. If you're facing casters, then having some Mordenkainen's Disjunction scrolls will help you dispel them and a Wail of the Banshee can be tremendous. However, if you're fighting Dwarven Fighters, that same Wail of the Banshee is a TERRIBLE spell choice, because Fortitude is their strong save, and you should avoid attacking an enemy's strong save.<br/>\n<br/>\nSo, basically, you gotta ask yourself a few questions:<br/>\n<br/>\n1- Who am I facing?<br/>\n<br/>\n2- What is his / her weak save?<br/>\n<br/>\n3- What spells do I have from my FAVORED SCHOOLS (the ones you have focus on) that attack that save?<br/>\n<br/>\n4- What is their strong save?<br/>\n<br/>\nMemorize as many spells that attack the weak save of your enemies and get rid of the ones that attack their strong save, and then you can and go out there and kick some butt. If you don't know beforehand, or if you're facing several types of enemies, divide your existing spell slots between spells that attack the Fortitude save, spells that attack the Will save and a few no-save spells (counting you don't have focus in evocation here, if you do, then a few damage spells are an option) to deal with the remaining situations. The problem is that this slims down the effectiveness of your casting, because you won't have enough spells for more than one or two encounters, whereas if you know beforehand, you can have multiple copies of the same spells spread through all spell levels and just wreak havoc all day long.<br/>\n<br/>\nIf you know you're going to face Undeads, for example your spellbook should have as many copies as possible of the following spells: lvl 3 Fireball (many undeads are vulnerable to fire), lvl 4 stilled Fireball, lvl 5 Firebrand or Empowered Fireball, Lvl 6 Undeath to Death, lvl 7 Stilled Undeath to Death, lvl 8 Inferno and lvl 9 Meteor Swarm and Maximized Undeath to Death. If the same undeads are immune to fire, you should re-shape your spells to account for that.<br/>\n<br/>\nA Wizard is effective as a chameleon, and information about his enemies helps him fulfill his role as a killing machine. Knowing what saves to attack is key to playing wizards properly. And, if you don't have a spell for a specific enemy, generally, IGMS will do. Also, you should know which spells to carry in scrolls and which ones to memorize (you can scribe scrolls by default as a mage and you should ABUSE this, even if it takes you longer to level to maximum). Here is a rough list of spells to use with scrolls: Protection from Elements (this lasts 24 hours regardless of caster level), Lesser Spell Breach, Greater Spell Breach, Spell Mantle, Greater Spell Mantle, Time Stop (you should have one or two memorized just in case, but a scroll can help you a lot), Mordenkainen's Disjunction and the Bigby hands (lvl 5, lvl 6, lvl 7 and lvl 9). I personally dislike the lvl 8 Bigby, so I don't use it.<br/>\n<br/>\nAs to your question about Wizard 27 / Rogue 3, I honestly don't understand why you'd even consider that spread after the explanation I gave you about the benefits of Fighter over Wizard. If you want, just get rid of the Penetration feats and make scrolls of Greater Spell Breach and Mordenkainen's Disjunction to use on spell-resistant enemies. That will slow your casting a bit, as you'll need to start the combat using a scroll (and the effects can be countered by Greater Restoration, so you may even need multiple copies of the spell), but that's better than just relinquishing the Fighter bonus feats for 3 more caster levels and 1 metamagic feat. Trust me on this one, bro, go Fighter and get Expertise, Improved Expertise and Armor Skin with the three Bonus Feats.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}