{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "097",
  "name": "Arelith Archer build request",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-archer-build-request-t2354646.html",
  "author": "FoodEater",
  "avatar": "10235235_1549015559.jpg",
  "replies": 19,
  "posts": [
    {
      "author": "FoodEater",
      "avatar": "no_avatar.png",
      "timestamp": "10:54 PM - Dec 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Greetings. <br/>\n Im creating an archer to Arelith and I would ask for some help. <br/>\n I was thinking about Bard/monk/arcane archer, does that make any sense?<br/>\n Bard song, monk speed and arcane archer's powerful attack.<br/>\n<br/>\n The level cap is 30 in Arelith. I would use longbow, obviously..<br/>\n<br/>\n Any help about this build would be appreciated.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:30 PM - Dec 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Does Arelith use the standard alignment class restrictions?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:46 AM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I remember reading in a post here quite a while back that Arelith allows a Bard to be lawful, and I read more recently that they have gotten rid of the EXP penalty for multiclassing.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "FoodEater",
      "avatar": "no_avatar.png",
      "timestamp": "6:12 AM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, I just confirmed It is possible to start with monk, and then switch to bard later. Unfortunately, I cant choose path of Kensai which would allow me permanent haste..<br/>\n I have an archer already in Arelith (thanks to the Empyre65:s build I used) which is bard/fighter/aa. Im thinking would monk be better instead of fighter...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:50 AM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>I remember reading in a post here quite a while back that Arelith allows a Bard to be lawful, and I read more recently that they have gotten rid of the EXP penalty for multiclassing.</div></blockquote>\n<div align=\"left\">I do recall the multiclass deal, Empyre.  The lawful bard?  So many quasi-AD&amp;D servers popping up, it's hard to keep track of which world uses what.<br/>\n<br/>\n Even with the distorted alignment system, I still wouldn't dilute what would be a decent build just for the sake of 10% move speed.  None of the monk feats but evasion have much use and no -3 progression... so what's the point?  Bard dumps to discipline, tumble and spellcraft so a better secondary class than monk.  Discipline would be handy to max to avoid opposed called shots from other archers or slingers.  This could be made into a stealther but would require higher starting INT.  Rogue/AAs make better stealthers than bard/AAs anyway.<br/>\n<br/>\n IMO, an elven Str 8/Dex 19(28)/Con 12/Wis 8/Int 14/Cha 13(14) brd 11/aa 19 in robes is the best way to go.  I'd skip curse song for lingering song since I don't advise spending quality time within melee range, take extend for haste and darkness (who needs speed when you can blind them?) and at least one maxed detection skill.  Buffs easily dispelled but the song boosts will stick.  Should be able to hover around 50-ish AB and 6 APR hasted in RS mode naked with a mundane longbow and a +10 arrow enchantment.<br/>\n<br/>\n The only tertiary I might consider is rogue for Uncanny Dodge with all the DEX AC investment but that would gimp some of the AA power.  If played properly, it will never get flanked or caught off-foot, especially with ImpInvis's 50% concealment.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:54 AM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>FoodEater wrote:</strong><hr/>Yes, I just confirmed It is possible to start with monk, and then switch to bard later. Unfortunately, I cant choose path of Kensai which would allow me permanent haste..<br/>\n I have an archer already in Arelith (thanks to the Empyre65:s build I used) which is bard/fighter/aa. Im thinking would monk be better instead of fighter...</div></blockquote>\n<div align=\"left\">What do you need with permahaste when you can cast haste that lasts 22 rounds a few times each day and for 11 rounds a few more?<br/>\n<br/>\n What PRECISELY about monk levels makes you think this is a useful choice?</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "FoodEater",
      "avatar": "no_avatar.png",
      "timestamp": "3:48 PM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've lived in a knowledge that monk's get attackspeeds aswell, not just the running speed.<br/>\n Thats why I was only wondering is it so, well to be honest. Im very glad of your opinions and sounds like you know a littlebit more about this game than I do<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:53 PM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>FoodEater wrote:</strong><hr/>I've lived in a knowledge that monk's get attackspeeds aswell, not just the running speed.<br/>\n Thats why I was only wondering is it so, well to be honest.<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Ahhh... now I see.  Hadn't realized your interpretation.<br/>\n<br/>\n No.  The monk attack progression, the one with extra (\"faster\") attacks, only works with unarmed attacks (hence the term \"UBAB\" or Unarmed Base Attack Bonus) or with a kama.<br/>\n<br/>\n So, in the case of a ranged weapon, the most that is gained from a monk level is melee-related feats and the slight move speed @monk 3.  Unless going into Zen Archery, the WIS AC will not factor in either (divine Zen monks are very dangerous, however).  The problem an AA has going the Zen route is that all of its special attacks like Imbued Arrows are dependent on the DEX modifier to establish a reliable DC.  Also, AA's bonus feats offer Great DEX boosts but no Great Wisdom, which should be an indicator how the prestige class was intended to exploit its advantages.<br/>\n<br/>\n In the case of Arelith's 30 cap servers, you cannot cheese a single bard qualifier skill dump so the commitment of 3+ levels is significant since every 2 levels of AA nets an additional AB, the highest attack potential of any class including WM or RDD.  In addition, those AB boosts are accompanied by DR penetration and damage.  It can really add up with many levels of AA.  So, by sticking to just a bard/AA, you can glean significant bonuses from both classes, dump to all the combat skills and need not sacrifice anything.  Fighter levels add a few more feats and up to +6 piercing damage.  But every 2 levels of fighter costs one of those AA +AB/+1dmg/+DR penetration boosts.  Some like to go the fighter route so they have enough feats to finesse and focus in rapier/shield.  IMO, if the PBS attack won't hit, the finessed rapier certainly won't.<br/>\n<br/>\n With the Darkness exploit from bard's spell repertoire, an AA will never lose their DEX AC and never get exposed to AoOs except vs. True Seers and those will not be pure warriors except on item property-flushed high-magic servers.<br/>\n<br/>\n If you'd like an example of a viable bardic AA build, I'd be glad to post it for your examination.  Let me know.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "FoodEater",
      "avatar": "no_avatar.png",
      "timestamp": "5:55 PM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the post, Im currently creating an bard/aa build and I came across a problem which I didnt find information as a quick search, is that<br/>\n Do I need spell focus (conjuration) as a feat? Do I gain any significant spells with it? what about greater spell focus?<br/>\n And also, I took weapon finesse as a feat becouse I come across many situation where shield/melee is handy due to shield's AC in this build..<br/>\n<br/>\n What about skills, how much I need <strong>Search</strong> skill to detect most of the traps?<br/>\n What about open lock and disable trap? How much is needed to open common traps and locks when my INT modifier is at 14/2?<br/>\n You previously told that <strong>disable traps</strong> skill rank 11, is enough for DC&lt;36 traps. <strong>Open lock</strong> 15 will open locks DC&lt;35. Is that all needed with this build?<br/>\n Also I noticed there is this spell called \"Find traps\", which I could use in places where are traps so I could save the skills from Search to something else.<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:03 PM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just noticed this post on my way out the door so answers may not be as complete as I would have liked. Nonetheless...<br/>\n<br/>\n Are you planning to morph this into a rogue skills build?  You hadn't indicated that before and would require higher INT at the cost of AB and AC.<br/>\n<br/>\n<em>Find Traps</em> even locates epic traps.  Arelith has implemented a common change that does not automatically disarm them.  So what you do is use a sacrificial summon to attack the trapped container or walk across the trapped ground. <br/>\n<br/>\n Your DEX will so high, a single point in Open Lock will open DCs around 30 plus whatever lockpicks are available.<br/>\n<br/>\n I wouldn't try to make a serious caster out of this combo.  DCs will be horrible and limited to Level 4 spells max.<br/>\n<br/>\n Sure.  You can try finessing a rapier with a shield but understand the moment you swap out the longbow, your AB will drop around 13 points (AB 32 instead of AB 45). Not to mention how pitiful your damage will be without enhanced arrows.  Basically you'll just stand there praying to roll 20's to hit anything for a few points of damage each time plus whatever OnHit may be present.  And it's DR penetration will be limited by the rapier's enhancement.  I'm guess they don't have any +10 weapons on Arelith.<br/>\n<br/>\n Disable level is: skill ranks + INT modifier + Set Trap synergy + Take20. <br/>\n<br/>\n So, assuming at least 5 ranks in Set Trap, allocating 7 ranks in Disable Traps will disarm DCs of 7 + 2 + 2 + 20 = 31.  That's enough to disarm every trap that any non-rogue can (DC&lt;36).  That includes deadly blob, splash, frost, holy, negative, sonic and tangle; strong fire and spike; and average electrical and gas.  Not bad for a measely 7 ranks (14 xclassed).<br/>\n<br/>\n With INT 14, no Search ranks need to be assigned but you'll need a LOT of patience because you'll only spot traps on a roll of 20, rerolling every 6 secs.  To spot them in half that time, allot 10 ranks.  To spot them the moment they come within perception range, you'd need Search 19 + INT 14.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "FoodEater",
      "avatar": "no_avatar.png",
      "timestamp": "7:23 PM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Okay, so I'll go without the weapon finesse.<br/>\n And no, im not going to assign rogue to this build.<br/>\n Im going to test that new version in tester server and see what I got.<br/>\n Much appreciated for your help!<br/>\n<br/>\n By the way, is it smart to take one rogue class level at the end (lets say 29th level) and boost the skill points to open lock, disable trap etc. to get them as class points?<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:27 PM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually, your design is very close to the one I threw together except you can't take AA until BAB +7.  That's a minimum of Bard 10 before AA.<br/>\nSpoiler [+]<br/>\n<br/>\n 30 Cap Bardic AA: Bard 11/Arcane Archer 19, Any non-lawful Elf<br/>\n<br/>\n STR: 8<br/>\n DEX: 19 (28)<br/>\n CON: 12<br/>\n WIS: 8<br/>\n INT: 14<br/>\n CHA: 13 (14)<br/>\n<br/>\n 01: Brd(1): PBS<br/>\n 02: Brd(2)<br/>\n 03: Brd(3): WF: Longbow<br/>\n 04: Brd(4): DEX+1 (20)<br/>\n 05: Brd(5)<br/>\n 06: Brd(6): Rapid Shot (-2 AB)<br/>\n 07: Brd(7)<br/>\n 08: Brd(8): CHA+1 (14)<br/>\n 09: Brd(9): Lingering Song<br/>\n 10: Brd(10) [BAB +7]<br/>\n 11: AA(1)<br/>\n 12: AA(2): DEX+1 (21), ImpCrit: Longbow<br/>\n 13: AA(3)<br/>\n 14: AA(4)<br/>\n 15: AA(5): Extend Spell<br/>\n 16: AA(6): DEX+1 (22)<br/>\n 17: AA(7)<br/>\n 18: AA(8): Called Shot (up to +8AC with arm shots)<br/>\n 19: AA(9)<br/>\n 20: AA(10): DEX+1 (23)<br/>\n 21: AA(11): EWF: Longbow<br/>\n 22: AA(12)<br/>\n 23: AA(13)<br/>\n 24: AA(14): DEX+1 (24), Armor Skin, Grt DEX (25)<br/>\n 25: AA(15)<br/>\n 26: AA(16)<br/>\n 27: AA(17): Grt DEX (26)<br/>\n 28: AA(18): DEX+1 (27), Grt DEX (28)<br/>\n 29: AA(19)<br/>\n 30: Brd(11): Epic Prowess<br/>\n<br/>\n HP, max: 248<br/>\n Saves F/W/R: 16/14/28 (23/21/35 vs spells)<br/>\n Add'l saves: Mind Effects: +2<br/>\n BAB: 22 (4 APR, 5 APR hasted, 6 APR hasted RS -2 AB mode)<br/>\n AB (max, naked): 22 (melee) [32 w/wpn finesse], 45 (ranged)<br/>\n AC (naked/mundane armor/shield only): 27/30 (+2 song 11, +8AC max arm shots)<br/>\n<br/>\n Skills: 198 - Concentration 33(34), Discipline 33(32), Listen 33(34), Perform 16(18), Spellcraft 33(35), Tumble 30(39), UMD 18(20), remaining ----&gt; 2<br/>\n<br/>\n Song 11: +2AB, +2AC, +2dmg,+1 univ saves, +8HP, +2 skills (15 rounds x 11 songs/day)<br/>\n<br/>\n Buffs, naked: Cat DEX +2AB/+2AC/+2 reflex, Bull STR +2 discipline, Owl WIS +2 will, Mage Armor +4AC, Haste +4AC, War Cry +2AB/+2dmg, ImpInvis 50% conceal<br/>\n<br/>\n<br/>\n<br/>\n Besides leg shots controlling mob move speed not blessed with freedom (or \"legless\" *lol*), called arm shots can drastically change encounters by boosting your AC way up if you have high enough AB which an AA certainly has.  Incidentally, that AC stacks with all other sources since it is a reciprocal AC.<br/>\n<br/>\n I allocated the skills as I feel would be most effective for the way I play an AA, pure death artillery: Discipline in there to shrug off opposed called shots, Listen as the one detection skill (that's vs. stealthers btw) and the rest are more or less automatic.  The UMD allocation was plenty for casting all divine magic by scroll, rod or wand but more a convenience than a necessity.<br/>\n<br/>\n I don't think the Dodge feat will get much use expect vs. other ranged attackers.  The rest should never get close enough to threaten you so the feat is worthless in those cases.<br/>\n<br/>\n By \"when you can blind them\" means via <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Darkness_%28spell%29\" rel=\"noreferrer\" target=\"_blank\"><strong>Darkness</strong></a>.  It's still a no-save/no-SR spell on Arelith so can be exploited mercilessly there just like everywhere else. That will be your chief mob-control spell.  It won't work in PvP, however.  All they have to do is hold down the shift key (or is it the Tab key?) and can see your toon.<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:49 PM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, AA actually requires BAB +6, so bard 8 is enough.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:59 PM - Dec 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Quite right, Mick and thanks for the correction.  I've got DwD on the brain for some reason.  Why is anybody's guess. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:17 AM - Dec 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It'll be because it's Arelith, and somewhere in your head you were building a gnomish Bard / AA / DwD, obviously<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "FoodEater",
      "avatar": "no_avatar.png",
      "timestamp": "9:23 PM - Dec 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the replies. Did you count that in Arelith you can choose gifts when starting a character<br/>\n Its possible to choose +2 dex, +2 constitution and +2 charisma, so would take 13 to charisma in start and still get level 5 spells.<br/>\n<br/>\n Also, is it smart to take rogue class at 29th level to boost Open lock, Move silently, Search, disable traps etc. skills?<br/>\n And.. Instead of called shot arm and extended spell, I would take dodge and mobility..<br/>\n But then again, if I sacrifice dodge and mobility, I could take extended spell and called shot... which could be even better<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:20 AM - Dec 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, I realize there is a gift system that trades off starting abilities for leveling-up speed but have no way to quantify that (CBC designs with NWN's version of default AD&amp;D 3.0).  That's your responsibility to make those sorts of decisions.<br/>\n<br/>\n Back to the rogue skills deal again... <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n We build mainly power builds here or, at least, that's our main focus.  You are free to juggle them around and morph them into a utility build, but that is your own choice.  Just be aware of the consequences when you go that route.  It's easy to itemize.<br/>\n<br/>\n BTW, how could you take a rogue tertiary level at 29 when it would conflict with the 3-consecutive class rule?   Confusing.<br/>\n<br/>\n The rest of your deliberation centers on how you plan to play your archer.  I already stated that I play pure artillery which means I prevent moving within melee range against enemies 100% of the time, so that's what I design.  In that case, neither Dodge nor Mobility would have much relevance. <br/>\n<br/>\n However, a PBS archer likes to wade into the fray and hope that their DEX AC is not compromised on a regular basis.  I've never had much success with PBS types because it flies in the face of an archer's strengths. I suppose a bard/AA/DwD5 may serve that sort of playstyle but I've never played one to confirm its effectiveness because the places I play are not alignment-blind like Arelith is.  It wouldn't get to use its stance but could never get flanked.  That's one step better than Uncanny Dodge.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:53 AM - Dec 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">An AA must be an Elf (or Half-Elf) and a DD must be a Dwarf, so no build can have both, unless that is something else that Arelith has changed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:22 AM - Dec 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Interbreeding maybe? I blame Stagmeister for planting the seed in my mind. Now I'm missing the obvious stuff. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /> <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:52 PM - Dec 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n The rest of your deliberation centers on how you plan to play your archer. <br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">May I suggest the <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2183611/Enchanted-arrows-magic-and-archery-an-Arcane-Archer-guide#.WEbP0k2Qy70\" rel=\"noreferrer\" target=\"_blank\">Arcane Archer guide</a> by Mick Dagger, which has a sub-section on Archery tactics.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}