{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "066",
  "name": "No-Critical Melee Tank/DPS. Level 20 Cap. Low magic server.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/no-critical-melee-tank-dps-level-20-cap-low-magic--t2354707.html",
  "author": "UselessPoint",
  "avatar": "10235235_1549015559.jpg",
  "replies": 7,
  "posts": [
    {
      "author": "UselessPoint",
      "avatar": "no_avatar.png",
      "timestamp": "5:48 PM - May 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello again to every user on this forum! <br/>\n<br/>\n First, a thanks, since this is a very useful resource, and again, it gave me a lot of amazing ideas and glimpse to create many characters.<br/>\n<br/>\n This time i come with another Weird Request.<br/>\n<br/>\n<br/>\n Premise: I play on a Ravenloft Italian Server with low magic (max+3 items). Also, there are very difficult high level monster, like lots of magic resistance or crit immunity. Also, rest is limited, only 1 rest every 1 game hour, and only in certain areas.<br/>\n<br/>\n So, with this premise, if it was possible to build a melee that doesn't rely on critical hits.<br/>\n How would you build it?<br/>\n Considering the fact that there are lots of undead, would the Paladin be a good choice (Holy sword, GMW, blessed weapons, the +3 sound damage buff which i can't remember the name).<br/>\n Also consider that Darkfire doesn't last 1 hour per level, but, i think, 1 turn per level.<br/>\n Also, Red Dragon Disciple need permission from DM.<br/>\n<br/>\n So, how would you build something from this scratches?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:29 PM - May 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Feels a bit weird saying this, but hello there Useless!<br/>\n<br/>\n A quick question, if I may - what's the final level you can expect to reach on Ravenloft? It's not somewhere I've been before (I seem to recall Mick Dagger saying something about it, but I could be wrong), so it would help to know whether you're looking at a full L40 build or something different.<br/>\n<br/>\n My own tendencies are for melee builds, but I've never taken a pally. It always seemed a bit \"fragile\" to me: brilliant for short periods, then vulnerable. I might be tempted (first thought) by a Bard/CoT/Fighter. Some decent synergy between Bard and CoT with CHA (for Divine Wrath, Bard song and suchlike) and some early Fighter levels would help with BAB and the number of feats that open up (not least WS). Cleric would also be a good choice (but you'd want to keep your pre-epic BAB at 15 or below, or you'd end up nerfing your own build). Anyway, I'm rambling now. That first question is the one to focus on for now - that and whether you're looking for a STR or DEX based build (or possibly CHA) and whether you have a racial preference.<br/>\n<br/>\n Oh, and if you're not looking for crits, park WM at the door.<br/>\n<br/>\n Not terribly helpful, I know, but no one wants taking down a path they're not happy with.<br/>\n<br/>\n Cheers <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UselessPoint",
      "avatar": "no_avatar.png",
      "timestamp": "7:01 PM - May 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, actually i've no idea about dex or str, but i was looking for a sort of brainstorming about melee and damage possibilities, so i suppose it would move the possibility towards STR or CHA (in case divine might, or similar).<br/>\n<br/>\n Btw, i put in the post, that the cap level is 20<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:22 PM - May 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Umm, you didn't put the cap in the OP, but thanks for the clarification mate!<br/>\n<br/>\n Level 20 might well point to a two rather three class build, or maybe not. The reason I asked about Strength and Dex is that a Dex build will traditionally have a better natural AC, and thereby defences, but will mostly be pecking at foes. Conversely, a Strength build will hit a lot harder, but will be more vulnerable to being hit back. So you'd have to compensate for the respective deficiencies with gear (boosting either the Dexer's damage or the Strengther's -? - resilience to it)<br/>\n<br/>\n If you fancy STR and CHA as your main stats, and with no racial preference, I might think about something on the Fighter 6 or 4 / Bard (or Rogue) 4 or 6 / CoT 10 lines. With a level 20 cap, I'd probably go for 6 in Fighter and 4 in Bard, so you'd still have a BAB of 19, an extra bonus feat, more HPs and a still halfway decent song. But that's just me.<br/>\n<br/>\n Thoughts?<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Apologies - you put the level cap in the title - mea culpa.<br/>\n<br/>\n<strong><em>EDIT 2:</em></strong> Have just been having a look around, and wondered whether Valerfor's <strong>Knight Templar</strong> - Paladin 17 / Monk 1 / Fighter 2 might appeal to you? There are 2 versions on the thread, which, naturally enough, can be found on the Pre-Epic: Level 20 sub-forum. Shows what I know about pallys, 'cos this one's fierce...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:28 AM - May 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If your resting restriction is 1 in-world hour, that is only 2 minutes real-time, so I recommend a Cleric 18 / Fighter 2.<br/>\n<br/>\n If the resting restriction is 1 real-time hour (30 in-world hours), then any kind of caster is out of consideration. Here's some brainstorming ideas for that scenario: Monk 16 / Fighter 4 (6 attacks per round of d20 blunt damage, but lowish AB), Fighter 10 / DD 10 (or Fighter 6 / Rogue 4 / DD 10, giving up 1 BAB for +2 Dodge AC), Fighter 6 / Ranger 10 / Rogue 4 (with undead as favored enemies, but suffering an EXP,penalty).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UselessPoint",
      "avatar": "no_avatar.png",
      "timestamp": "9:40 AM - May 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for all the replies, the resting time is about once every 10 minutes of real times.<br/>\n<br/>\n But i was thinking this, how could you maximize damage with a hit, without considering critical?<br/>\n<br/>\n -Strenght Bonuses<br/>\n -Magical Weapons.<br/>\n -Feats (weapon specialization, divine might.)<br/>\n -Number of attack per round, which rises the Dps, but not the damage for each hit, so monster with heavy damage reduction might give you problems.<br/>\n<br/>\n So, i was thinking about spells, and feats.<br/>\n<br/>\n About feats, if i'm not mistaken, the only feats that give you damage are weapon specialization, and divine might. so that consider cleric/paladin, and fighter.<br/>\n<br/>\n Now, about spell, there aren't many spells which gives you bonus damage on attack.<br/>\n They are:<br/>\n -Blessed Weapon<br/>\n -Divine Favor<br/>\n -Deafening Clang<br/>\n -Bless, Prayers, etc.<br/>\n -Flame Weapon<br/>\n -Darkfire<br/>\n -Holy Sword<br/>\n -Great Magical Weapon<br/>\n -Tenser Transformation<br/>\n -Bard Song<br/>\n<br/>\n So, about these spell, would there some chance to combine them in some way with the feats, like combining divine might, flame weapon, divine power, extended divine favor and similar with some funky Paladin/sorcerer/fighter, or Sorcerer/Cleric, or even more weird.<br/>\n<br/>\n I know it may seem strange, i'm just trying to visualize and conceptualize something different.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:58 PM - May 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A Paladin with all his buffs ON and a buffed Charisma plus Divine Might is a sight to behold. Even a pure one is terribly effective Vs undead and his innate immunity to fear makes him all the more suitable for \"Undead slaying\" so to speak.<br/>\n<br/>\n That being said, if you want to maximize your concept of \"damage per hit\" you really need a two-handed weapon and as much strength as you can attain. A good example of this, that doesn't need a lot (at all, actually) of micro-management is a classic Half-Orc Ranger 15/ Fighter 4/ insert tumble class 1, with 19/24 natural strength by level 20. You get 10 straight damage from your strength alone then another 4 Vs Undead from Ranger favored enemy bonuses and you finally add the last 2 points from specialization. Of course, since you have such high AB you will want to use Power attack as well, rising the total to 2d6+21 before we even consider any kind of magical enhancements. He will have four attacks plus cleave of course for maximum damage dealing.<br/>\n<br/>\n Sometimes, simple is best.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:07 PM - May 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello UP!<br/>\n If the rest intervals are 10 min real time, self buffers like cleric, bard and druid are my choices in low magic mods. I might also look at arcane casters. In a low magic mod, shifters can also shine with their versatility, but I don't know if shifters, other than werecreatures are part of the Ravenloft lore.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}