{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "819",
  "name": "So Assasin DPS, where do I go?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/so-assasin-dps-where-do-i-go-t2355153.html",
  "author": "Cornflower",
  "avatar": "10759006_1545641562.jpg",
  "replies": 12,
  "posts": [
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "4:18 PM - Sep 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Someone told me \"Oh, the best DPS build, or at least top three, is the 6 fighter/7 weapon master/27 assasain strength build with a scythe\".<br/>\n<br/>\nNow, I'm sure it's good, but I don't really think I should try to build it from the ground myself. I checked the lvl40 forums, but the closest thing I found was this:<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=8&amp;t=2354412&amp;p=801&amp;hilit=assassin+weapon+master+fighter#p801\" rel=\"noreferrer\" target=\"_blank\">viewtopic.php?f=8&amp;t=2354412&amp;p=801&amp;hilit ... ghter#p801</a><br/>\nAlso, I would hesitate to make something other than what Valerfor created, without good reason.<br/>\n<br/>\nSo, if I could get some help (again), I would be grateful. I have a toon that I've grown tired of, and I'm thinking I should try something new and I've NEVER played an assassin before. So, do I go with the unnamed contributor for 27 assassin, or follow in the Master's footsteps with 21 assassin?<br/>\n<br/>\nOh, side note: You get d6 acid damage per every three level assassin on Blackstone, which might explain the 27 assassin, compare to Valefor's 21 assassin. Also, I'm not very good at sneaking, I prefer to walk up to someone and trip them, then hit them while they're lying down. Not very sportsmanlike, but effective...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "4:23 PM - Sep 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, someone else said: Nah, go Ranger 21, Paladin 1, Assasin 18. Now, I'm really confused.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "4:40 PM - Sep 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Assassin is one of those classes where either you just do a little for skill dumps, or as much as possible, for increasing the death attack.<br/>\nFor a strength based assassin, the use poison feat may be valuable, depending upon your server. Others would suggest just forgo assassin and use rogue. These arguments have merit.<br/>\n<br/>\nYour world seems to give even more reason to go all out with assassin. The build of Valefor's that you link, you could go scythe instead of Greataxe, you'd just have to get that weapon proficiency exotic in, probably early, rearrange some fights, probably take blind fight later in place of Iron will.  That's an approach I would consider. Or drop great fortitude. This of course opens up the little can of beans of what one would do with the corresponding epic feat (i.e. either epic will, or epic fortitude).<br/>\n<br/>\n<br/>\nI just can't stand the way scythes look, or from the real life perspective of how bad they are as a weapon, especially as portrayed in fantasy.<br/>\n<br/>\nBtw, the strength based assassin could be considered more of an advanced users assassin....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:48 PM - Sep 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Cornflower wrote:</cite>\nOh, someone else said: Nah, go Ranger 21, Paladin 1, Assasin 18. Now, I'm really confused.\n</div></blockquote>\nI'm confused equally, to be honest.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:31 PM - Sep 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">With assassis it is either minor class instead of rogue to avoid an xp penalty, or major class to pile up as many levels as you can for a high Death attack DC.<br/>\n...Unless you have a very specific reason to break that rule. 9 levels for Improved invisibility may be such a reason. <br/>\nOn BSK you also get that damage bonus with increasing levels.<br/>\nAs for strength based assassin being the choice of veteran assassin players...<br/>\nThere are pros and cons. I still love my dexers. But I see where you're coming from.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "4:48 AM - Sep 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was just commenting that getting those sweet paralyzations is going to be more difficult for someone sneaking around in full plate, especially if one is not familiar with the idea...for someone who has never played an assassin, I just think dexer assassin would be generally considered the ...more traditional route.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "1:06 PM - Sep 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll probably not be able to get any paralyzations in. All the bosses at Blackstone have crazy high saves, so most every DC-based ability is more or less worthless.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "1:19 PM - Sep 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>gkorjax wrote:</cite>\nAssassin is one of those classes where either you just do a little for skill dumps, or as much as possible, for increasing the death attack.<br/>\nFor a strength based assassin, the use poison feat may be valuable, depending upon your server. Others would suggest just forgo assassin and use rogue. These arguments have merit.<br/>\n</div></blockquote>\n\nThis would argue for the Assassin 27 build then.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "8:49 AM - Sep 10, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So, <em class=\"mention\">@Valerfor</em> , any comments on the main question, do I use your build, or is there some kind of meaning in going Assassin 27 instead, to get those extra 2d6 acid damage and occasionally more death attack damage?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:12 AM - Sep 10, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Honest opinion?<br/>\nI think that following the (ftr 6/wm 7/ ass 27) build is worse, for bsk, at least. Do that build in cbc &amp; you will get at least 1ab lower, not to mention that you will have to sacrifice an epic general feat to get ews on that 7th ftr level. If you want max dps, drop the save boosters &amp; even armor skin (since you go all-out), start with 18 str &amp; get to 34 str. That's how you get 46ab out of it. <br/>\n<br/>\nDeath attack dc, we know it plays very small role in bsk (due to constant true sight &amp; high-saves) of the monsters there, otherwise, i would advice going for the higher assassin levels, but i optimize for the environment.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "9:39 PM - Sep 10, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">OK. I always want your honest opinion. I'll just build both in cbc, but I usually go with your advice regardless. I'm gonna start a fan-club with myself as chairman. Valerfor for president!<br/>\nThank you!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:44 AM - Sep 11, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Haha, thanks for the vote of confidence man!<br/>\n<br/>\nIronically, &amp; I'll again be totally honest, even if it is against me, I think that the build that your friend told you about the BSK assassin, might be better than mine but for the wrong environment, it's better in low-medium PWs because it has a much higher death attack DC. <br/>\n<br/>\nWe all continuously learn Cornflower, even today.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "3:09 PM - Sep 11, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've been trying out your assassin build. It's awesome. I actually modified it a bit, removed the saves (since I can Forge those in game, I can add +2 universal to every item I have equipped) and added DevCrit instead (which now is modified in BSK to give double the damage). I was also extremely lucky and managed to make an uber Dwarven WarAxe. So, now I hit for around 60 points. When I sneak/knockdown I get around 100ish, but the DevCrit gives 250-500 per hit. I hit once for 505 points. That was kinda nice. In game I have AC65, so it's not quite a glass jaw dps either.<br/>\n<br/>\nTo sum it up, your build with the extreme axe I was lucky to make (well, buy for 17 million then forge) is so overpowered. It's great fun! Later today I'm gonna take on one of the high-end raid areas where I've never dared to set my foot alone.<br/>\n<br/>\nI checked out the other build, but it's very feat-starved and hence it's not easy to get DevCrit or Exotic weapon on it. I vote Valerfor regardless.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}