{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "478",
  "name": "Fast as possible! Battle priest build needed Till lvl 30.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/fast-as-possible-battle-priest-build-needed-till-l-t515497.html",
  "author": "W1shM4k3r",
  "avatar": "no_avatar.png",
  "replies": 18,
  "posts": [
    {
      "author": "W1shM4k3r",
      "avatar": "no_avatar.png",
      "timestamp": "6:10 PM - Sep 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Heya!<br/>\nI seek a nice Battle priest build It must have the lvl 9 spells the important stuff for the race are here:<br/>\n<br/>\nRacial Traits: Abilities: +2 Dexterity, -2 Constitution, +2 Intelligence, +2 Charisma; Spell Resistance = 11 + Class Level; Feat: Darkvision; Saving Throw Bonus: +2 Will Saves versus Spells and Spell-like Abilities; Spell-like Ability: Darkness; Light Sensitivity.<br/>\nFavored Class: Cleric (Female), Wizard (Male)<br/>\nLevel Adjustment: +2<br/>\n<br/>\nI would like to have it for PvP and PvM... PvP more than PvM<br/>\nI dont know what is the best.. STR or DEX based.. <br/>\nI was thinking of Cleric/BG<br/>\nAbout Blackguard stuff there are some modifies:<br/>\n<span style=\"font-size:85%;line-height:normal\">Feats:<br/>\nThese feats are gained automatically upon leveling and are usable once per day.<br/>\n<br/>\nEagle's Splendor<br/>\nStarting at 4rd level, a Blackguard gains the ability to cast Eagle's Splendor.<br/>\n<br/>\nMagic Circle against Good<br/>\nStarting at 7th level, a Blackguard gains the ability to cast Magic Circle against Good.<br/>\n<br/>\nDivine Favor<br/>\nStarting at 10th level, a Blackguard gains the ability to cast Divine Favor.<br/>\n<br/>\n<br/>\nModified Feats:<br/>\nThese feats are modified from the default Blackguard.<br/>\n<br/>\nDark Blessing<br/>\nThe saving throw bonus is capped to Blackguard level (e.g. a level 3 Blackguard would only receive a maximum of +3 saves from Dark Blessing, no matter how high their Charisma modifier is).<br/>\n<br/>\n<br/>\nSpells:<br/>\n<br/>\nCorrupt Weapon <br/>\n1 Blackguard level, 11 Wisdom<br/>\nThe caster corrupts a melee weapon to strike true against good opponents, granting a +1 enhancement bonus and 2d6 negative energy damage vs. good for Turns/Level.<br/>\n<br/>\nDemon Flesh <br/>\n1 Blackguard level, 11 Wisdom<br/>\nThe caster grows the thick, leather flesh of a demon, granting a +1 natural armor bonus to Armor Class for every four caster levels (at least +1, maximum +4) for Turns/Level.<br/>\n<br/>\nAura of Despair <br/>\n3 Blackguard levels, n/a Wisdom<br/>\nThe blackguard radiates a malign aura that causes enemies within 10 feet to take a -2 penalty on all saving throws.<br/>\n<br/>\nVeil of Shadow <br/>\n3 Blackguard levels, 12 Wisdom<br/>\nSwirling wisps of darkness obscure the caster's form, granting a 20% concealment bonus for Turns/Level.<br/>\n<br/>\nDarkness <br/>\n5 Blackguard levels, 12 Wisdom<br/>\nAs per the default spell.<br/>\n<br/>\nDeeper Darkness <br/>\n6 Blackguard levels, 13 Wisdom<br/>\nAs per Darkness, but with a duration of Turns/Blackguard level. <br/>\n<br/>\nAbyssal Might <br/>\n7 Blackguard levels, 14 Wisdom<br/>\nThe caster summons evil energy from the Abyss and is imbued with its might. The caster gains a +2 enhancement bonus to Strength, Constitution, and Dexterity for Turns/Level.<br/>\n<br/>\nUnholy Sword <br/>\n8 Blackguard levels, 14 Wisdom<br/>\nThis spell transforms the caster's melee weapon into a powerful Unholy Avenger, a specially blessed weapon that, when wielded by a Blackguard, acts as a +5 unholy weapon that dispels on hit for Rounds/Level.<br/>\n</span><br/>\n<br/>\nAbout what weapon i dont know what would fit a drow  <br/>\nIt doesnt have to be a Blackguard but if there is a nice build with it its oke!<br/>\nSame With UMD etc...<br/>\n<br/>\nif it has Divine Might and Shield im oke with it too.. so long it beats any high AC or AB Enemy!<br/>\n<br/>\nI really would like this build fast as possible! it is really appreciated and thank thank thank you!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "6:22 PM - Sep 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You have 30 levels, and you want lv 9 spells AND black guard?  <br/>\n<br/>\nIf you go with black guard before level 20, yes you will have a higher AB, but you gimp the cleric and generally (i say that cuz most have no idea how to play a cleric regardless) will make it harder to play the character early on.   ANd after level 20, every black guard level takes away from the power of the build's spell side, so you should have a STRONG reason to give up cleric for black guard levels.  <br/>\n<br/>\nbtw, the race seems like a terrible choice for a Cleric!  With a cleric, you are looking for +wisdom modifiers and/OR strength modifier (think Half orc, which is what I used almost exclusively for cleric builds my last few years of playing).  The dex wont help you.  The charisma does nothing at all for you (turning is next to useless in nwn ESPECIALLY if you want black guard levels).. well for divine might/shield, but not a good reason to take the race imo.<br/>\n<br/>\nIn all, I dont understand the black guard at all (i never have - though i did make a few).  When you build a character, you want to mix classes that give you something that the other classes dont give.  A cleric IS a battle priest already.  <br/>\n<br/>\nWIth the adding of Drow, are there other classes/prc added?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "W1shM4k3r",
      "avatar": "no_avatar.png",
      "timestamp": "6:25 PM - Sep 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I know but its for RP server and i need a Drow Cleric.. Hmm if you say that Cleric is already a battle priest... can you find/send the build... what feats.. skills.. abilities etc.. thanks! i know im not good at this.. thats why i ask you all!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "9:08 PM - Sep 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">How are you planning to PvP... spells or melee?  Pick one.<br/>\n<br/>\nDevCrit build?<br/>\n<br/>\nFiguring on going PvP vs. any PM multiclass (i.e. DevCrit worthless against PM builds)?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "W1shM4k3r",
      "avatar": "no_avatar.png",
      "timestamp": "9:12 PM - Sep 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There are not many PM builds... if you can do Dev crit build it would be nice! Exotic weapons are oke for that... <br/>\nWell it would be good to have lvl 8 spells of Cleric and melee fighting.. Hmm maybe with the Domain it actully Must Contain Trickery.. its for RP purpose..<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "9:16 PM - Sep 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you are doing it for RP there is always the RECOMMEND button.  When i said cleric IS battle priest, it is exactly that.  Please do a little reading (it isnt hard as both Max and I have guides posted in this forum).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "9:23 PM - Sep 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I agree with avado that the chosen race sux for any kind of battle cleric.  You are starting off in a hole right off the bat. <br/>\n<br/>\nMaybe something along the lines of a self-buffing dual-kukri DevCrit Clc/Ftr (WS/EWS) or Clc/CoT (better saves) or Clc/Ftr/CoT (both).<br/>\n<br/>\nXP penalty an issue?<br/>\n<br/>\nIs this one of those 3-level-in-sequence minimum multiclass servers?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "12:35 AM - Oct 01, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If drow is available, what else is?  <br/>\n<br/>\nI know you TRIED to help us by giving us info on BG, but not enough.   This is why it is important to learn to build (if you want to play nwn).  Cuz honestly, I could tout out a build in 10 minutes (slow typer) and it would \"fit the bill\", but would be complete and utter garbage!  If you have no idea what you want, then you would never know the difference.  Battle priest is so broad a subject... <br/>\n<br/>\nI would guess that, since you havent realized that a cleric IS a battle priest, to go 30 cleric. NIce and easy to level (no worries bout dumps, etc).  Take wisdom to 19 and pour all rest in Str (get it as high as you can.. why i played Half orcs, and usually started with 20 str/16 wisdom).  <br/>\n<br/>\nFeats..  weapn foc (and epic), extend spell..<br/>\n<br/>\ndomains.. trickery<br/>\n<br/>\nthe rest... up to you.  <br/>\n<br/>\nThat is the uberest build in nwn!  no wait.. nevermind.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:54 AM - Oct 01, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you are going DEX, Cleric Monk is the way to go. That way you can take advantage of the fact that Monks add Wisdom to AC and have a unique attack progression / many other goodies with robes, which is what a dexer should wear. I would advise something like Cleric 16 Monk 6 CoT 8 two weapon fighter with Kamas, lots of feats, high saves and 10 attacks per round. you can trash strength and the little charisma bonus can be helpful with Divine Wrath, but it's actually worthless, really, as Clerics already cap AB as is, save it for when you get dispelled. The bonus feats from CoT also mean you can increase your Wisdom via Great Wisdom feats, rather than stat increases, although you will have to be without lvl 7 and 8 spells for a little while until you reach the epics.<br/>\n<br/>\nGo Cleric 15 Monk 4 CoT 1 pre-epic (starting with Monk for more skill points, then CoT from  21-28 (with Monk at 22 for Skill Dumps), then round out the build with 1 Monk and 1 Cleric at 29 and 30 (order doesn't really matter).<br/>\n<br/>\nCoT means Champion of Torm, in case you don't know this either.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "6:04 AM - Oct 01, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would consider a Cleric/FTR/Rogue Zen Archer with trickery and travel domains (the latter adds some nice terrain control spells too) and of course the ranged combat feats in addition to focus in evocation to grant some extra power to casting. Enemy is handled via terrain control (do not forget traps!), ranged combat, summons, domination, spells that cause disability and direct damage or save or death spells. GS to get out of trouble. Craft wand/Scribe scroll for backup not interruptable spells.  <br/>\n<br/>\nCleric 24/FTR 4/Rogue 2 (Cleric 16/Rogue 1/FTR 3 preepic), Str 11, Dex 14 (12 +2 drow), Con 12 (14 -2 drow), Wis 17 (ending on 24), Int 14 (12 +2 drow), Cha 10 (8 +2 drow) pumping only wis and getting the following feats (presented here in a more or less random order): Blind Fight, Weapon Focus (Sling), Called Shot, Zen Archery, Point Blank Shot, Rapid Shot, Scribe Scroll, Spell Focus: Evocation, Greater Spell Focus: Evocation,  Epic Weapon Focus (Sling), Weapon Specialization (Sling), Epic Weapon Specialization (Sling), Epic Prowess, Armor Skin, Epic Spell Focus: Evocation and as said Domain Trickery and Travel. Mundane (ranged) AB sits at 31, plate and tower AC at 30, Hit points at 274 and skillpoints are spent on tumble, concentration, umd, spellcraft and trap skills. Sling is chosen because of the possibility to use it with tower shield (huge self buffed ac boost, +8 ac at cleric level 15, worth more than the extra crit multiplier and base damage of longbow or the extra crit range and base damage of X-bow and besides it's blunt damage). Female of course to minimize the levels with a XP penalty. Getting craft wand in would allow spamming HotG and daze effects around, among the rest. Wouldn't know what to drop though.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:25 AM - Oct 01, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Was just about to sit down to hash out a DevCritter but Kail's is just too dern sweet.   I love those roads less traveled and he even made it indispellable.  I resign! *lol*<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:08 PM - Oct 01, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>I would consider a Cleric/FTR/Rogue Zen Archer with trickery and travel domains (the latter adds some nice terrain control spells too) and of course the ranged combat feats in addition to focus in evocation to grant some extra power to casting. Enemy is handled via terrain control (do not forget traps!), ranged combat, summons, domination, spells that cause disability and direct damage or save or death spells. GS to get out of trouble. Craft wand/Scribe scroll for backup not interruptable spells. <br/>\n<br/>\nCleric 24/FTR 4/Rogue 2 (Cleric 16/Rogue 1/FTR 3 preepic), Str 11, Dex 14 (12 +2 drow), Con 12 (14 -2 drow), Wis 17 (ending on 24), Int 14 (12 +2 drow), Cha 10 (8 +2 drow) pumping only wis and getting the following feats (presented here in a more or less random order): Blind Fight, Weapon Focus (Sling), Called Shot, Zen Archery, Point Blank Shot, Rapid Shot, Scribe Scroll, Spell Focus: Evocation, Greater Spell Focus: Evocation, Epic Weapon Focus (Sling), Weapon Specialization (Sling), Epic Weapon Specialization (Sling), Epic Prowess, Armor Skin, Epic Spell Focus: Evocation and as said Domain Trickery and Travel. Mundane (ranged) AB sits at 31, plate and tower AC at 30, Hit points at 274 and skillpoints are spent on tumble, concentration, umd, spellcraft and trap skills. Sling is chosen because of the possibility to use it with tower shield (huge self buffed ac boost, +8 ac at cleric level 15, worth more than the extra crit multiplier and base damage of longbow or the extra crit range and base damage of X-bow and besides it's blunt damage). Female of course to minimize the levels with a XP penalty. Getting craft wand in would allow spamming HotG and daze effects around, among the rest. Wouldn't know what to drop though.</div></blockquote>\n\nBlind Fight, definitely, in that case drop Blind Fight. I would say that this doesn't seem to be much in line with the OP's intended request, or at least my interpretation of his intent. I read battle priestess and I think immediately of a meleer, which is why I suggested the Cleric Monk CoT combo. This one would be much more effective in casting, but the attack damage would be really low (I doubt they have the same modifications that WOG has), so you'd have to rely on summons, spells and traps to do some damage.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "4:39 PM - Oct 01, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\n<br/>\nBlind Fight, definitely, in that case drop Blind Fight. </div></blockquote>A possibility, although I'm not keen on dropping BF in a combat build. A matter of personal choice in the end. <br/>\n<blockquote><div>I would say that this doesn't seem to be much in line with the OP's intended request, or at least my interpretation of his intent. I read battle priestess and I think immediately of a meleer, which is why I suggested the Cleric Monk CoT combo.</div></blockquote>My suggestion is to be seen as an alternative to the more often traveled road... consider it an interesting, yet effective, detour.<br/>\n<blockquote><div>This one would be much more effective in casting, but the attack damage would be really low (I doubt they have the same modifications that WOG has), so you'd have to rely on summons, spells and traps to do some damage.</div></blockquote>EWS is in and all clerical buffs apply but GMW (which may well not be an issue if a +5 or better sling, better if with mighty property, is available) and Darkfire (and this is the big loss). Diminished damage hence but delivered at range and complemented by called shot, traps, terrain control, summons, spells (with a nice DC), umd, etc. Having haste in the spellbook means easier kiting among the rest... look at the whole of the build and at what makes up for the inability to use darkfire. <br/>\n<br/>\nOf course it's no typical battle priestess, but it's also one not giving up much on casting power either. A different build, for someone looking for something different.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "9:00 PM - Oct 01, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll make it 3 with a kukri DW DevCrit build.<br/>\n<br/>\nCleric(18), Fighter(4), Champion of Torm(8), Drow<br/>\n<br/>\nSTR: 16 (25)<br/>\nDEX: 16<br/>\nCON: 10<br/>\nWIS: 16 (18)<br/>\nINT: 10<br/>\nCHA: 10<br/>\n<br/>\nPre-epic Clc 17/Ftr 3 - You'll need to pick between Blind Fight &amp; Imp TWF.  PvM Blind Fight has more value than an extra APR and depending on how your PvP opponent buffs, you may still wish you had BF.<br/>\n<br/>\nEpic Clc 1/Ftr 1/CoT 8 - Take 2 Grt Wis, WS/EWS, DevCrit @ Level 30<br/>\n<br/>\nLotsa CONs, though. <br/>\nNo Extended or Empowered spells so you'll need to get any encounter completed within a few turns or be forced to rebuff during combat (ALWAYS an inefficient strategy) if you have spares slotted.  No focus, so offensive spells will be... well... pitiful.<br/>\nEasily dispelled. <br/>\nHigh level spells (7,8) are delayed until Grt Wis feats are selected.<br/>\nSeriously skill starved.  Max Discipline and then a choice between 3 other skills... either max Spellcraft (for +6 saves vs. spells), max Conc (vs. taunters &amp;/or combat casting) or xclass to Tumble for +3 AC.  Spellcraft would be my last choice with the good CoT saves, so it comes down to Conc checks vs. AC.<br/>\nIf permahaste is available I would be tempted to take War domain for the CON &amp; STR boost unless your server prohibits it for some reason.<br/>\n<br/>\nBut this toon will Crit... lots.   Even w/o critting, damage per round should be very good regardless.  Better would be a DW kukri Clc/WM of some sort but simply not possible within 30 levels. <br/>\n<br/>\nI still like the slinger build idea better, though.  It seems like a fun build to play around with and can use those summons to a great advantage (A Greater Mummy is extremely bullet-proof).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "W1shM4k3r",
      "avatar": "no_avatar.png",
      "timestamp": "10:03 AM - Oct 22, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Anatida",
      "avatar": "no_avatar.png",
      "timestamp": "7:45 AM - Jan 07, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Interesting I stumble on this topic, because I know the poster's exact reasoning, and I'm in the same fix. *waves to the fellow drowsie*<br/>\n<br/>\nPerhaps using the Drow race for a Cleric build is a bad place to start power-building wise. However, we both play on the same RP server, and we play in the awesome drow society there. Drow are ruled by the females, and more specifically by the clerics of Lolth. So we are both looking for decent cleric builds that will allow us to hold our high positions in the RP society, and yet not die in a single blow from an enemy (Both PvM and PvP, but PvP is SUPER important because of my char's status in society).<br/>\n<br/>\nAnother VERY important point is that a Drow can actually only have 28 levels, because it is ECL adjusted +2 on a level 30 max server.<br/>\n<br/>\nMy absolute MUST HAVES - Drow Cleric 17 with level 9 spells.<br/>\n<br/>\nAs Cleric is a preferred class, there will be no xp penalty with a 2nd class, but there will be with a third.<br/>\n<br/>\nI began with a Drow/BG build myself, and yea I stink at char building. Sure I can see a lot of errors I made, and I would love to rebuild her either partly or from the ground up. But I honestly cannot come up with an idea that will improve much on this ending scenario. I hope someone here can! To try to salvage the char, I've planned out my last 7 levels to hopefully fix her huge deficits. It seems I spent entirely too much focus on her casting ability, and even that is not powerful enough to keep her standing in a battle.<br/>\n<br/>\nSo here is how she stands at level 21:<br/>\n<br/>\nCleric 20/BG 1<br/>\n<br/>\nStr - 14 (18 with items)<br/>\nDex - 11 (13 with items)<br/>\nCon - 14<br/>\nInt - 14<br/>\nWis - 19 (30 with items)<br/>\nChar - 13<br/>\n<br/>\nSaves: F/R/W 17/9/22<br/>\nAC: 10 naked/ 31 with her current items/42 tower shield &amp; fully buffed<br/>\nAB: 19/14/9<br/>\nBA: 16<br/>\nSR: 11 + level<br/>\nDomains: Trickery &amp; Drow (Special Ability: Bonus Feat - Resist Poison/ Spells: 2 - Clairaudience/Clairvoyance, 6 - Greater Dispel, 8 - Greater Planar Binding)<br/>\nFeats: Power Attack, Cleave, Great Cleave, Combat Casting, Epic Prowess, Extend spell, Maximize spell, Scribe Scroll<br/>\n<br/>\nSkills:<br/>\nconcentration - 26<br/>\ndiscipline - 10<br/>\nspellcraft - 26<br/>\n<br/>\nGoing forward:<br/>\n22: Fighter - (dump Discpline) - Weapon focus<br/>\n23: Fighter   --                       -  Epic Weapon focus<br/>\n24: Cleric -       Str +1            - Spell focus: Evocation<br/>\n25: Fighter<br/>\n26: Fighter --                         - Weapon Specialization<br/>\n27: Fighter --                         - Improved Critical<br/>\n28: Fighter -     Str +1            - Epic Weapon Specialization<br/>\n<br/>\nEnding with:<br/>\n<br/>\nCleric 21/BG 1/Fighter 6<br/>\n<br/>\nStr - 16 (20 with current items items &amp; can add a couple more)<br/>\nDex - 11 (13 with items)<br/>\nCon - 14<br/>\nInt - 14<br/>\nWis - 19 (30 with items)<br/>\nChar - 13<br/>\n<br/>\nSaves: F/R/W 21/13/26<br/>\nAC: same<br/>\nAB: (empty handed) 25/20/15 -- (with weapon of choice) 32/27/22<br/>\nBAB 19<br/>\n<br/>\nSkills: (14 left over sk pts, who knows)<br/>\nconcentration - 26<br/>\ndiscipline - 30<br/>\nspellcraft - 26<br/>\n<br/>\nHer weapon of choice is a War hammer that has EB +4 / Cold 1d6 dmg / Keen / Mass Crit 1d8 dmg<br/>\n<br/>\nWhat concerns me is the AB and AC still seem very low when compared to others I might face on the server. At what point does the cleric become un-dispellable? That is a goal I'd like to reach. :p<br/>\n<br/>\nIdeas?<br/>\n<br/>\nBlessings,<br/>\n~Anatida<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:15 PM - Jan 07, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Anatida wrote:</strong>Interesting I stumble on this topic, because I know the poster's exact reasoning, and I'm in the same fix. *waves to the fellow drowsie*... <span style=\"color:#0000FF\">-clip- etc... etc...</span></div></blockquote>\nProbably a new topic would serve better.  You can easily link this one for reference if you feel it will help you build yours and can avoid repeating information.  When/if you do, be very explicit about any build constraints and customizations of your server so that suggestions will include those considerations.  A link to the server page is not useful.  Most of us are too busy to be perusing all the server pages so state a synopsis that applies specifically to what you are seeking.<br/>\n<br/>\nWhen/if you repost, you can copy and answer these questions:\n<ul><li>Why BG?  And why in epic levels? It seems to offer nothing to the build.[/*:m]</li>\n<li>Do you want to build a smiter?  Maybe that's the reason for BG.  Dunno.[/*:m]</li>\n<li>What is your preferred weapon?  Without fighter or a class that offers at least martial prof, your choices will be very limited. Warhammer is fine but the crit range is awful so we are back at PvP vs. PvM.[/*:m]</li>\n<li>Why no fighter level pre-epic?  You will need to be wasting a precious epic feat (clerics are feat-starved) on weapon specialization and could use that extra damage in early levels.[/*:m]</li>\n<li>PvP or PvM?  No build can be MAXIMIZED for both, so choose one purpose and build for that.  Otherwise, you will result in a compromised, all-purpose build that will never excel, never be a power build.[/*:m]</li>\n<li>If PvP focus, what are your most principal adversaries' builds?  Are there any PMs with at least 10 PM levels among them?[/*:m]</li>\n<li>Are you actually looking for a level 28 build?  I understand how ECL works as far as vanilla is concerned but am clueless to understand how other servers have customized its usage.  Be very specific as to what you want.  If it is a level 28 build, state that.[/*:m]</li>\n<li>Why would there automatically be a penalty on a tertiary class? If there is a favored class, then as long as one of the other classes is a prestige class there can never be a penalty.  OR... if the non-prestige secondary &amp; tertiary are kept with 1 level of each other there would be no penalty either.  Please clarify what you mean here.  If your server has special rules for XP penalty, state them.[/*:m]</li></ul>[/list]<br/>\nThose are the questions I have at this point.  Other members may have more.<br/>\n<br/>\nNow, a few general comments on assessing your current build design:<br/>\n<br/>\nI doubt you will be able to gain anything very useful without a rebuild.  At least I cannot see much merit in the path you have chosen so far.  So... if it were me, I would plan to trash the current build.  However, if you have reached some significant RP milestone, you may be stuck.  Dunno.  Your choice.<br/>\n<br/>\nRestate the drow specifics like biases, features, etc.  (I'm too lazy to hunt them down myself, sry.)<br/>\n<br/>\nAt first glance (without hashing out a build myself, that is), it appears your starting ability spread is too thin.  If you are intending a DP buffer, you can go with a DEX build and gain significant AC for PvP.<br/>\n<br/>\nI would consider a tertiary tumble class like monk or rogue so you can class tumble to +6AC (even with only 28 levels, it's possible) and other benefits like freebie feats &amp; AB progression (monk) or UMD/sneaks (rogue).<br/>\n<br/>\nSkills: If you are going to use Discipline skill... MAX it or don't use it at all.  I also find any allocation to concentration a waste in a battle (non-caster) cleric unless you fear the threat of taunts and are planning on regular offensive casting in melee range. No tumble AC? Hmmm.<br/>\n<br/>\nAny buffer becomes immune to all dispels except Mords at caster level 24, immune up to Dispel Magic at caster level 19 and up to Lesser dispels at caster level 14.  On a level 30 server I would expect a battle cleric could NOT achieve immunity to Greater Dispels, not without biasing the build towards casting... and THAT is not a battle cleric. Typically, Cleric 15 will achive the maximum buff capacity and then any other levels are used to achieve additional spells, like your Cleric 17 prereq, but add no relevant combat prowess to the build.  Each level up to 24 WILL add a slight bit to avoiding dispels, however.  If it is a personal choice to use all spells, you will be sacrificing power for the sake of your own preference.<br/>\n<br/>\nOne thing to consider would be a UMD tertiary and the use of mantles to protect against dispels but not breaches.  Mantles can eventually be stripped, though, and availability of scrolls may be an issue on your server.  Or you could just make a deal with one of your wiz pals to trade you some for Neg Energy Protect scrolls.    An option worth considering when concerned about dispels.<br/>\n<br/>\nAs I suggested in the opening, your request would be better addressed unburied beneath a similar request like this one.  <br/>\n<br/>\nThe guild has LOTS of room for everybody!  <br/>\n<br/>\nOh, BTW... WELCOME to the new ECB!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Anatida",
      "avatar": "no_avatar.png",
      "timestamp": "5:37 PM - Jan 07, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks HipMaestro! I will work up that info and post a new topic.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "johnbonmovi",
      "avatar": "no_avatar.png",
      "timestamp": "1:35 PM - Jan 31, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A suggestion for this build on endgame play, you may want to consider simply doing cleric/ftr/rog on arelith for access to high end UMD, arelith has made certain spells wandable that are stupid not to take advantage of, namely true strike is wanded on arelith along with improved invisibility.  For a dedicated meleer it might be better to take strength and travel domains because of the access to a second level of divine powers, with extend or silent casting you can get many levels of divine powers.  This is useful for leveling because arelith has a restrictive rest system that limits how many times a day you may rest.  Also on discipline, arelith allows quite high skill gains if you spam enchant gear, for instance on a battle cleric you can enchant 10 of 11 slots with +1 str, +1 con, +2 discp, +2 spellcraft.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}