{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "121",
  "name": "PW Etiquette",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pw-etiquette-t2355536.html",
  "author": "wildleaf",
  "avatar": "10747696_1523894257.png",
  "replies": 10,
  "posts": [
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "4:19 PM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello everyone, I just wanted to start a thread to talk acceptable behavior when playing on different PWs. <br/>\n<br/>\nRecently a player joined a PW I play on and he was having a tough time. Instead of asking for help or pointers they started spamming the shout channel with their complaints. Here's an example of one of about a dozen messages they shouted: <br/>\n<details><summary>Spoiler</summary>\"DUDE my Toon is a ULTIMATE BAD AZZ 25 25 25 AC at 2nd Level with a Brown Bear and a SUMMON and a Henchie, do you have a y clue how awesomy bad azz good that is, how much better then the toon that handled WOG. But yet despite that, it still died to Kobolds. Post on the forums dude that a toon BETTER then the toon that oonly died 1,2,3,4 ti.mes, reached 18th lev defeated the temple of Elemental Evil on WOG, World of Greyhawk, the toughest PW, that the toon better then that toon at level 2 comparison that was, is better with a 25 AC at level 2, died 2 times to lousy kobolds here. They would say WTF, that PW must be tougher than WOG then. My toon is a basic simple Monk/Cleric/Druid A BEST that can get 25AC at level 2, A Brown Bear Animal Companiin, A SUMMON, and A Henchie, such a aweso.e b3st of the best out of level 2 toons should NOT die even once to kobols let alone 2 time, thats proof if how extremely tough tougher th3n WOG this PW is at level 1,2. TO TOUGH. Either tone it down or make it 15 to 100 gold to respawn instead of 500 gold to respawn at level 2 thats rediculous and burn tbru 2500 like it is nothing, and then level 2 toon can't earn gd, get exp, le el up, etc. because NOT ENOUGH GOLD TO PAY THE RESPAWN COST OF DYING. So because of that level 2 toon is SCREWED, and no way to get UNSCREWED, as thats how reiculously tough this PW is on level 2 toons. WOG wasnt even close to being this hard.\"</details>\n\nThis is obviously unacceptable, and trust me when I say that this player was relentless in ignoring input from other players and continuing to spam the server. Please, don't act like this player. <br/>\n<br/>\nNow, I wanted to outline a few important takeaways from using this forum and playing in online worlds, and hopefully we can flesh these points out together. <br/>\n<br/>\n1) All builds will not work on all servers. <br/>\n<br/>\n2) Ask for help, don't demand other players to bow to your whim. <br/>\n<br/>\n3) Learn the rules on the PW you wish to play on. There is almost always a placard describing changes or a website for you to peruse. Don't jump in with a 1-40 plan without studying these changes, or you will often find yourself disappointed.<br/>\n<br/>\n4) Don't complain or demand changes to other people's server's. Sure, you can be angry about a certain rule, but never take it out on others. Server owners have spent thousands of hours tweaking their worlds, and they know what works and what doesn't. If you wish to offer suggestions, do it through the proper channels, and never demand a change be made. You attract more flies with honey than vinegar. <br/>\n<br/>\n5) Don't be condescending. If you believe you come from \"the greatest PW\", you're wrong. They're all equally great and they are what lend us the huge variety of play that we enjoy. Relish what we have now, because it won't be here forever. <br/>\n<br/>\n6) Be kind. Give that new player your last set of hasted boots. Make friends. Help people achieve their goals. Guide people when they ask for help, never tell them how to play if they don't ask. <br/>\n<br/>\nSo, obviously this isn't polished (so help me out guys!), but these are my thoughts after seeing what happened last night. I've played this game since the original release, andI'm extremely grateful that it's experiencing this brief revival. I don't want to see it wasted. <br/>\n<br/>\nThanks everyone and have fun!<br/>\n<br/>\nSent from my SM-G955U using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:57 PM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have both been the Owner of a PW (which my team and I created) and I have DMed on several PWs (and was on the Staff).<br/>\n<br/>\nCases like you point out happen occassionally - you should have been around for the Golden days of NWN PWs online!  We'd get griefers like that all the time.<br/>\n<br/>\nMost are kids - yeah, it is true.  Some are just griefers, and back then were using scripts and god 2das to crash servers and just cause mischief.<br/>\n<br/>\nI think the Golden Rules apply everywhere (imo).<br/>\n<br/>\n1. Respect others.<br/>\n2. Have fun, but not at the expense of others.<br/>\n<br/>\nThat was basically the premise of my PW way back when, The Playground.  I feel that these two Golden Rules, if followed, basically will lead to everyone having their cake and eating it, too.<br/>\n<br/>\nFor hardcore RP PWs, there will be a lot of rules to follow beyond that, of course.  But I think those two rules are basic common sense and work if abided by.<br/>\n<br/>\nAs for the player build monk/cleric/druid, I seriously doubt that it was stomping on everything.  Not only does it get an XP penalty, but one, or both, spellcasters are definitely subject to dispel spam (which is pretty nasty on WoG).  I rather suspect that it is a Dragon build - but a Dragon build doesn't stomp on everything on WoG - especially not the major Bosses (nor many of their m0bs).<br/>\n<br/>\nAn AC of 25 at 2nd level is not anywhere near the apex, btw.  And since the build does not have any Uncanny Dodge, is seriously in danger of loosing Dex and Dodge AC (flatfooted).  And although the summons is rather good for that level, it is hardly a massive, undamageable tank.  The Animal Companion at that level also suffers from squishy.  The henchie mentioned is nice, but they are not available all over the place, and will not stand a chance against some of the more higher level areas.<br/>\n<br/>\nIt is pretty funny that the build in question is getting owned by kobolds!  Though there are some kobolds on WoG that would make the player scream as well, they are not for beginning levels.<br/>\n<br/>\nBut I digress here.<br/>\n<br/>\nWhat PW was this on?  And what is up with those kobolds?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "5:12 PM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yup I've been around since the beginning, but I mostly just lurk. I don't really enjoy party play either so if I'm ever on your PW I'd probably keep my distance. <br/>\n<br/>\nThe server was ADOH, levels 1-25 are basically a cakewalk and most players achieve mid 20s in an afternoon or two. The kobolds are just trash mobs, I literally don't understand how one could have so much trouble with them unless they are a beginner. <br/>\n<br/>\nSent from my SM-G955U using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:13 PM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, my PW is no longer active.<br/>\n<br/>\nIt \"suffered\" like most did in the twilight years, and I did not have the time anymore to maintain it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "6:34 PM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I meant \"on any PW you're currently playing\" :P<br/>\n<br/>\nSent from my SM-G955U using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "7:10 PM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Who can even type all that into a shout channel?  I can barely say good morning. <br/>\n<br/>\nIt does remind of the old days. Little brats would show up all the time and spam the channels with their gibberish. DMs would have to boot/ban cd key because they were just that damn annoying. Please, if anyone sees this kind of behavior please report it to their admins so they can take action. And having that player’s log-in id helps(not character name). <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "10:26 PM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have their login, they post on the forum too. That's one of the things that threw me.. I can barely get one sentence into shout, and this person has written a novella! Crazy<br/>\n<br/>\nSent from my SM-G955U using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:16 PM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Does he use macros or something?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:24 AM - Aug 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote: <a data-post-id=\"21554\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21554&amp;sid=61f924fdd82efcf37318b2ea476aa5f5#p21554\">↑</a><div class=\"responsive-hide\">Aug 14, 2020</div></cite>Does he use macros or something?</div></blockquote>\nYeah, Macro-mouth!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:30 AM - Aug 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Are we not all getting a wee bit sidetracked from the OP here?<br/>\n<br/>\nI'm afraid the purpose of this guild is not to tell DMs and admins of PWs how to run their own environments - although the Dwarflord is completely right that such behaviour should be reported/sanctioned.<br/>\n<br/>\nDoes it not rather all come down to how we treat each other? In that respect, both Wildleaf and Web's points are worthy (imo). If it helps at all, Wildleaf, recast your eyes over Kail's initial <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/forum-rules-t515323.html\" rel=\"noreferrer\" target=\"_blank\">Forum Rules</a> which we try to adhere to here. I would think much can be transposed into PWs.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:09 AM - Aug 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>I'm afraid the purpose of this guild is not to tell DMs and admins of PWs how to run their own environments</div></blockquote>\n\nTo this, I heartily agree.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}