{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "042",
  "name": "Recommended build for first on WOG",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/recommended-build-for-first-on-wog-t2356070.html",
  "author": "BluntAxe",
  "avatar": "10759579_1725807854.jpg",
  "replies": 40,
  "posts": [
    {
      "author": "BluntAxe",
      "avatar": "10759579_1725807854.jpg",
      "timestamp": "6:40 PM - Mar 03, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I have gotten bored with my usual PWs and have decided to try WOG as it has been recommend by so many here over the years. Having read a lot of what has been written here and in the WOG board I am somewhat confused as to what build to try first. I do expect to take a few dirt maps as I explore but I don't want to invest time in a build that is basically pants.<br/>\n<br/>\nWhat builds would you guys recommend to try first?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:50 PM - Mar 03, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ok.<br/>\n<br/>\nFirst of all, a few questions, if I may?<br/>\n<br/>\nWhat Class/Role do you prefer to play?<br/>\n<br/>\nDo you want a survivor, that can explore/go anywhere, or a powerhouse that can overcome any challenge, even solo?<br/>\n<br/>\nHow much NWN and D&amp;D knowledge and experience do you posses? If I name a build (from the ECB, for example), can you yourself locate it and adapt it to WoG?  Or will you need a complete build breakdown, level for level?<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:50 PM - Mar 03, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good to see one of the longest-serving, and certainly most dedicated (don't tell him I said that, eh), WoG player around coming to proffer advice!<br/>\n<br/>\nI seem to recall GDL tests his builds on WoG, and Max has certainly done so, which gives some decent starting-off points. That said, unless otherwise specified, the majority of the finalized builds here should be relatively easy to adapt to the WoG environment. I do know that WoG has some of its own modifications and so on, but others will know them better than I.<br/>\n<br/>\nOh, and to add to Web's questions, are you planning to travel in party or to attempt solo?<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BluntAxe",
      "avatar": "10759579_1725807854.jpg",
      "timestamp": "10:51 PM - Mar 03, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you for your responses and to answer your questions:<br/>\n<br/>\nSolo explorer with no preference to class (will and have played all) - have played for 20 years on and off but not a power builder.<br/>\n<br/>\nJust a question to the experienced players of WOG, what would be your choice of build if you had to explore the place for the first time?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:22 AM - Mar 04, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would  recommend The Gloom Razor - <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/gloom-razor-of-the-hin-rogue-24-divine-champion-10-t2355280.html\" rel=\"noreferrer\" target=\"_blank\">gloom-razor-of-the-hin-rogue-24-divine- ... 55280.html</a> by <strong>grizzled_dwarflord</strong> for a WoG first time explorer. It covers all the bases (skills, AB, AC, offensive, defensive) without having to rely on meta-knowledge of items and places to survive imo.<br/>\n<blockquote><div>There is a footnote in the annals of halfling history that reference an ancient line of warlike halflings.  Chief amongst them were the Gloom Razors, divine warrior scouts who were unmatched in combat.  Dauntless, fearless, these Hin Warlords were the premier knights of the Gloom Brigade, for they dwelt in the Gloaming, the twilight, but this is just a footnote in the old Hin annals, and likely nothing more than the fancy musings of a halfling historian deep in his cups….<br/>\n <br/>\n<br/>\nIMG_0160.JPG (82.01KiB)<br/>\n<br/>\n<br/>\nPeerless in combat and virtually unhittable, the Gloom Razor launches a terrifying assault from darkness, with 6 attacks per round, 12d6 sneak per blade, coupled with Epic Weapon Specialization, Crippling Strike, Improved Knockdown and/or Called Shot to shred your opponent to bits. <br/>\n <br/>\nTitle: Gloom Razor of the Hin<br/>\nAKA: The Shire Wraith<br/>\nClass: Rogue 24 / Fighter 6 / Divine Champion 10<br/>\nProfession: Commando-Hitman-Mechanic<br/>\nRace: Halfling<br/>\nAlignment: Any Non-Evil<br/>\nPlayable: 1-40 PvM, Low to Mid Magic<br/>\nXP Penalty: None<br/>\n <br/>\nAttributes<br/>\nStr 12<br/>\nInt 14<br/>\nWis 8<br/>\nDex 20 (32)<br/>\nCon 10<br/>\nChr 8<br/>\n <br/>\nLevel Guide<br/>\n1. Rogue 1, Ambidexterity<br/>\n2. Fighter 1, Weapon Finesse<br/>\n3. Rogue 2, Exotic Weaponry*<br/>\n4. Fighter 2, WF: Kukris, Dex 21<br/>\n5. Fighter 3<br/>\n6. Fighter 4, WS: Kukris, Two Weapon Fighting<br/>\n7. Rogue 3<br/>\n8. Rogue 4, Dex22<br/>\n9. Divine Champion 1, Blindfighting<br/>\n10. Divine Champion 2, Improved TWF<br/>\n11. Divine Champion 3<br/>\n12. Rogue 5, Knockdown, Dex 23<br/>\n13. Divine Champion 4, Improved Knockdown<br/>\n14. Divine Champion 5<br/>\n15. Rogue 6, Iron Will<br/>\n16. Fighter 5, Dex 24<br/>\n17. Rogue 7<br/>\n18. Rogue 8, Toughness<br/>\n19. Divine Champion 6, Called Shot<br/>\n20. Divine Champion 7, Dex 25<br/>\n21. Rogue 9, Great Dex I<br/>\n22. Rogue 10, Improved Evasion<br/>\n23. Rogue 11<br/>\n24. Rogue 12, Great Dex II, Dex 28<br/>\n25. Rogue 13, Defensive Roll<br/>\n26. Rogue 14<br/>\n27. Rogue 15, Epic Dodge<br/>\n28. Rogue 16, Crippling Strike, Dex 29<br/>\n29. Divine Champion 8, EWF: Kukris<br/>\n30. Fighter 6, EWS: Kukris, Epic Prowess<br/>\n31. Rogue 17<br/>\n32. Rogue 18, Dex 30<br/>\n33. Rogue 19, Self Conceal I, Self Conceal II<br/>\n34. Rogue 20<br/>\n35. Rogue 21<br/>\n36. Divine Champion 9, Self Conceal III, Dex31<br/>\n37. Rogue 22<br/>\n38. Rogue 23<br/>\n39. Divine Champion 10, Self Conceal IV, Armor Skin<br/>\n40. Rogue 24, Self Conceal V, Dex 32<br/>\n <br/>\nCombat Vitals<br/>\nBase Melee AB: 44/39/34/29<br/>\nDual-wielding: 42/37/32/27/42/37<br/>\nBase Damage 1d4+7 (18-20x2)<br/>\nSneak Damage: 12d6<br/>\nRanged AB: 41 (42 with sling)<br/>\nAC: 32 in just mundane britches<br/>\nAC with +5 gear &amp; shield: 65<br/>\nHP: 344<br/>\n <br/>\nSaves<br/>\nFort: 27 (31)<br/>\nReflex: 39 (43)<br/>\nWill: 22 (26)<br/>\n <br/>\nSkills: 334<br/>\nDiscipline: 42 (43)<br/>\nUMD: 31 (30)<br/>\nTumble: 40<br/>\nHide: 43 (54)<br/>\nMove Silently: 43 (56)<br/>\nSpellcraft: 18 (20)<br/>\nSearch: 10 (12)<br/>\nOpen Lock: 10 (21)<br/>\nSet Trap: 30 (43)<br/>\nDisable Trap 40 (44)<br/>\nLore: 5 (7)<br/>\nAppraise: 4 (6)<br/>\n <br/>\nStrengths<br/>\n·       Epic Dodge and Undispellable Self Concealment 50%<br/>\n·       High AC<br/>\n·       Very Good AB for Dual-wielder with high rogue levels<br/>\n·       With a small bump to Dex, can eventually set Epic Traps<br/>\n·       Disable all traps<br/>\n·       UMD for Wand and Scroll Casting<br/>\n·       Versatile Offensive Toolkit – can launch 12d6 sneak with Crippling Strike, and can supplement it with Called Shot or IKD 6 times per round.<br/>\n·       The build matures early and often<br/>\n <br/>\nWeaknesses<br/>\n·       Fort Save, while respectable, still susceptible to Dev Crit (if the enemy can connect)<br/>\n·       Will Save.  While pretty respectable for a finesse build, can still be a concern<br/>\n·       Beware of IGMS trebuchets<br/>\n·       No HiPS safety blanket<br/>\n <br/>\nCombat Strategies<br/>\n·       From a stealthed position, launch an IKD on your opponent.  If successful, begin to land Called Shot: Arm attacks, combined with Crippling Strike, and when your opponent gets back on his feet, if he gets back on his feet, he will have jello arms.  You’ll be able to knock down again, which he will be more susceptible since his strength will be lowered.<br/>\n·       Mine the combat field with traps to disable and weaken your opponent<br/>\n·       Never fight fair<br/>\n <br/>\nSneak Attack Generation<br/>\n·       From your initial Stealth position<br/>\n·       Source of Invisibility (Potion, Wand, Item, Scroll)<br/>\n·       Corner Stealth – running behind a corner or object that interrupts line of sight and then re-enter stealth mode<br/>\n·       Flanking – allowing a party member to tank<br/>\n·       More Flanking – use scroll or wand (or item) casting to create summons to give you flanking opportunities<br/>\n·       Improved Knockdown – every flurry is a sneak on a knock-downed opponent<br/>\n <br/>\nSimilar Builds:<br/>\n·       Halfling Commando by Xylophone: This is a slinger with no SC V or dual-wielding and significantly lower melee AB<br/>\n <br/>\n·       Drowkiller: Human and much lower AB and lower saves<br/>\n <br/>\n·       Martial Rogue:  Less Sneak, much lower AB, no dual-wielding or SC V<br/>\n <br/>\n·       Shadow Sword: A TyrTemplar special, but lacks Crippling Strike, over 80 skill points less, no IKD or Called Shot, and doesn’t use sexy kukris<br/>\n <br/>\n·       And then Mick Dagger’s well-considered Halfling Champion: Similar, but lacks SC V and Crippling Strike, less skill points, and doesn’t get Epic Dodge until Lvl 32.  In it’s favor it gets 1 higher AB, 1 higher AC, and more HP.  But still a much different build since he focuses on Discipline to go toe to toe with strength builds.<br/>\n <br/>\n·       And then there is my own slew of Fighter/Rogue/CoT’s: Death’s Rival, The Last Great Bounty Hunter, and the Incredible Fighting Rogue of War, but they’re all Dwarves, so… I won’t bother posting links for those.<br/>\n <br/>\nBuilder’s Commentary<br/>\nWhile I hesitate to call anything the “quintessential” build of something, this is fairly close to being one to represent the halfling rogue warrior clan.  There are many varied combinations of these classes – a testament to the versatility of this combo – but somehow this one manages to be different.  Of course, when you play this game long enough at some point you feel like you’re “jumping the shark” when building any kind of class combo anymore.  Many (me included) will often argue the value and investment of something like Self Concealment V since it is such a huge investment – 5 feats – and coming at the expense of other things that you would like to see your Rogue have (Epic Will, Slippery Mind, Epic Fort, Great Dex’s, Improved Sneaks or Epic Skill Foci).  Indeed, I remade this same character and removed the SC feats and achieved an unbuffed dualwielding AB of 44, which is outstanding for no WM or RDD levels while still retaining 24 Rogue levels. <br/>\n <br/>\nBut there is still something sexy about SC V.  It’s baked in.  It’s permanent.  There’s no mitigation for it (save Blindfighting).  If the enemy’s first attack is an IKD, and he lands the hit, Epic Dodge makes it miss.  His second attack is now coming at 5 lower AB, which is like adding 5 to your AC.  Assuming he can still land that, Self Concealment takes over and now his hit is half as likely to miss.  Epic Dodge, coupled with high AC and SC feats, makes you nigh untouchable. <br/>\n <br/>\nKukri’s were taken because they’re far sexier than daggers, and they can be keened and have a higher crit range.  However, Improved Crit is not taken because of the diminishing return on that investment.  Still, you could drop Called Shot, or Iron Will, if you feel you must have it.  I don’t think it adds much in a build like this.<br/>\n <br/>\nI rarely take Called Shot in a non-archer build, but it works in this one.  It’s a nice tool to have for both ranged and melee tactics, especially of the enemy is either to large to knockdown or has immunity/discipline resistance. <br/>\n <br/>\nWhile I invested points in Discipline, you may find yourself not needing it and rely on Epic Dodge and Concealment (and KD Immunity) to avoid the best attack sequence from your enemies.  If you’re swarmed by more than two opponents with such attacks, you may reconsider that decision though.  Just know that enemies with Disarm/Improved Disarm may have a leg up on you, especially if they’re using medium or large weapons.<br/>\n <br/>\nSpellcraft was cross-classed (yes, you have that many skill points) to help out in the saves department (+4 extra against spells).<br/>\n <br/>\nFinally, there is something satisfying in how well the build matures.  It gradually and consistently becomes stronger, faster, better, and never seems to lack.  In fact, there is a sweet spot from Level 27 to Level 33 where, in a span of 6 levels, he grabs Epic Dodge, Crippling Strike, EWF, EWS, Epic Prowess, and SC I and SC II.  I do miss the days when one could take Epic Dodge at Level 21, but those days are gone.  Level 27 is as early as one can get it, and really should be the target one shoots for when building an Epic Dodger. </div></blockquote>\nI myself have played the build to level 40 on WoG, and I know that GDL has tested it there.  The most important part of the build, imo (besides having ALL the skills and abilities necessary to survive on WoG all in a level 1-40 playable package) is the level 27 to 33 \"explosion\" of abilities built into the build that comes exactly when one will be needing them most!<br/>\nAll in all, a most enjoyable, incredible build, from the master builder himself, a known player of WoG.<br/>\nIt will not disappoint.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BluntAxe",
      "avatar": "10759579_1725807854.jpg",
      "timestamp": "10:40 AM - Mar 04, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you - I will start with that!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:44 AM - Mar 04, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would also recommend The Village of Hommlet as a starting point.  It was recently \"enhanced\" by DM_Wise, and is really, really good for a first time Player.<br/>\n<br/>\nEnjoy!<br/>\n<br/>\nPS : If you have and problems, questions, need aid, etc, just ask!  And please keep us posted on your progress!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:33 AM - Mar 06, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So I took my Gloomy out for a spin, just to make sure that with all the changes having been done to WoG, that the build still performs as it used to...<br/>\n<br/>\nYUP!<br/>\n<br/>\nWow, I had forgotten just how <em>sick </em>the build is!<br/>\n<br/>\nTook her up to have tea with some stonies (Stone Giants).  Took them all on at once! (which is just asking for it - it's like bursting into a Bandito's bar and pissing on their boots) &gt;.&lt;<br/>\n<br/>\nShe mopped the floor with'em! O_o<br/>\n<br/>\nNow, this area had been changed, and is a lot <em>moar </em>challenging than it used to be - new foes (Cloppy Warpriests, eldar riftlords - both with multiple rez castings), and of course swarm AI.<br/>\n<br/>\nWhich means I ended up killing Trok, the Chieftain of the Stone Giants a total of 5 times (because rez) all the while fending off 10 Trokkie Bodyguards, an assortment of cloppy and lord casters, many stonies and an enraged thorned dragon!<br/>\n<br/>\nAnd only used 1 Heal.<br/>\n<br/>\nSo yeah, Gloomrazor is still \"teh mega Chizz\" on WoG.<br/>\n<br/>\nGood building, GDL!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BluntAxe",
      "avatar": "10759579_1725807854.jpg",
      "timestamp": "11:06 AM - Mar 06, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"27910\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=27910&amp;sid=5c91bfefdd26ce6576caf1a5ea76d55e#p27910\">↑</a><div class=\"responsive-hide\">Mar 06, 2023</div></cite>So yeah, Gloomrazor is still \"teh mega Chizz\" on WoG.<br/>\n<br/>\nGood building, GDL!</div></blockquote>\nHere comes halfling death!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BluntAxe",
      "avatar": "10759579_1725807854.jpg",
      "timestamp": "1:08 AM - Mar 08, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Cuthbert Biggleswade is born and exploring Homlett - can't work out the best place to start adventuring though<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:41 AM - Mar 08, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hommlet -&gt;Moathouse (swamps)-&gt;Nulb-&gt;Toee<br/>\n<br/>\nShould get you to around lvl 10 or so...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "11:26 PM - Mar 08, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just for us mere mortals who struggle with dex builds, what is your preferred strategy for undead/constructs and anything else with pesky sneak/crit immunities. lots of scrolls of flame weapon? not always available in shops. I found this build unstoppable in Aielund until the end of act 3, at which point as soon as he stepped out of the shadows he got squashed. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:34 AM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I used to struggle in much the same way, <em class=\"mention\">@Dingpot</em> , so here's one that got me through it: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/halfling-champion-rogue-20-fighter-6-cot-14-t2354370.html\" rel=\"noreferrer\" target=\"_blank\">Halfling Champion</a>, it's from Mick and is seriously a joy to play. The other I'd recommend is unsurprisingly the aforementioned build from the Dwarflord and is the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/gloom-razor-of-the-hin-rogue-24-divine-champion-10-t2355280.html\" rel=\"noreferrer\" target=\"_blank\">Gloom Razor</a>. Both are halflings and Fighter/ Rogue/ CoTs, which go together like gin and tonic or whiskey (not the good stuff) and ginger. Just remember that a DEX meleer is very different from a STR one, and should be played as such. Much as I enjoy doing so, wading in like a loon can be hopelessly optimistic.<br/>\n<br/>\nHope these help!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:44 AM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What lvl were you then, Dingpot?<br/>\n<br/>\nIn any regards, all Dexers tend to have to rely on elemental damage to carry them through against crit/sa immunes.  You can also try boosting str to get more damage per hit.<br/>\n<br/>\nYou'll basically have to chip them to death.<br/>\n<br/>\nSome builds incorporate other abilities into them - like ranger Bane of enemies, Fighter WS (and ews), and Divine Might from Cleric, Pally, BG...another way is to go Monk (like my Nightshade) which has d20 damage, especially in an environment that limits elemental damage.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:35 PM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"27927\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=27927&amp;sid=c58ec77e851e29778afab777896bd80c#p27927\">↑</a><div class=\"responsive-hide\">Mar 09, 2023</div></cite>What lvl were you then, Dingpot?</div></blockquote>\nHope Dingpot will forgive me sticking my big mouth in, but generally you should be hitting around level 24 by the end of Act 3. Alas, Aielund does fall into ye olde \"let's rob all his gear and cash\" trope at the beginning of Act 4, and it takes a while to acquire some decent stuff again (and there are no merchants for a goodly time anyway). One thing it does do is cure you of thinking you're a god of destruction pretty damn fast.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:38 PM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hmmm...a few more levels until \"goody time\" feat-wise as well.<br/>\n<br/>\nPerhaps Skelie fingers for making Traps?<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:21 PM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Give Aielund a whirl sometime, Webby - should you ever take a holiday from WoG. It's a good yarn, with decent companions with good AI, and you'll reach the end of Act 4 (Part 3) at around level 36/7. I think you'd enjoy it for its own sake - probably less so if you decide to simply blast through solo. You might not necessarily find it as challenging as WoG, but as one continuous story it's hard to beat.<br/>\n<br/>\nJust a thought.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:57 PM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Why would I want to forsake WoG for a subpar wannabe? Aielund is not a challenge for me (I was going to play it a long time ago, but with the PrC, but the work involved back then was too extensive to be worth it). I was not particularly impressed back then...most SP stuff is just too easy.  IF I play SP stuff (which I mostly don't, these days), then it is for the story, etc. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:48 PM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Playing on a PW has another rhythm to it compared with SP modules. You cannot pause gameplay with your space bar, and you cannot reload if you mess up. <br/>\nOn the other hand, once you know the PW with it's areas,  things become quite predictable,  at least until a DM shows up and starts messing with you. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\nI once played an early version of Aielund act 1 with a group of roleplayers in multiplayer, led by a DM. We had a lot of fun. I played an autistic wizard. But my real RP character was his familiar. I changed it on every lvl up, pretending it was some kind of shifter.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:58 PM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, like when DM Myst spawned in 10 epic drow mages (each with a casting of epic ruin!), 2 ancient red dragons (3 altogether, it's the endboss in that area) that do 100+ per hit (200+ on a crit!) and a horde of slobbering ancient fire giant warriors for me to play with...solo! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\nI actually survived that! (Nightshade FTW!!!!).  Weak kneed, but triumphant!<br/>\n<br/>\nI doubt one will have that happen in Aeilund.  In fact, that has been the hardest thing I have encountered to date on WoG.<br/>\n<br/>\nAnd yeah, like Mick said, without pause or reloading (and no save-scumming, either).<br/>\n<blockquote><div>once you know the PW with it's areas,  things become quite predictable</div></blockquote>\n\nWell, mostly true (until a builder changes/adds new areas/content) but the same thing is true for a SP mod, btw.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "10:33 PM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"27928\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=27928&amp;sid=af8fd64018301f31b43896d34fd5dc1d#p27928\">↑</a><div class=\"responsive-hide\">Mar 09, 2023</div></cite><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"27927\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=27927&amp;sid=af8fd64018301f31b43896d34fd5dc1d#p27927\">↑</a><div class=\"responsive-hide\">Mar 09, 2023</div></cite>What lvl were you then, Dingpot?</div></blockquote>\nHope Dingpot will forgive me sticking my big mouth in, but generally you should be hitting around level 24 by the end of Act 3. Alas, Aielund does fall into ye olde \"let's rob all his gear and cash\" trope at the beginning of Act 4, and it takes a while to acquire some decent stuff again (and there are no merchants for a goodly time anyway). One thing it does do is cure you of thinking you're a god of destruction pretty damn fast.</div></blockquote>\nIIRC I was around 23/24. At the time I was on quite a steep learning curve, there are options I have since discovered to customise weapons with some elemental damage so I may go back again at some point. I find SP mods good for my level of skill to test out builds and get the hang of them, especially the dex builds where I'm very much with Stagmeister. I still struggle to explore WOG properly as I keep dying before I get more than 2 maps away from the nearest town. I got my level 24 citadel build as far as a Remorhaz once which then did for me and sent me back to a temple. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:07 PM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, the remorhaz.<br/>\n<br/>\nYeah, that's a real beast.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "11:28 PM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">On the subject of dex builds with solo play in mind, rogue fighter COT seems the obvious choice and being a Dwarf fan, what does everyone think about another GDL build, namely Death's Rival, which interestingly incorporates EDR <br/>\n<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build213875.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/builds/data/build213875.html</a><br/>\n<br/>\nnot sure i've done that link correctly but hopefully will let you find it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:30 PM - Mar 09, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As GDL plays regularly on WoG, and tests his builds there as well, it probably will perform as expected.<br/>\n<br/>\nNamely, superb.<br/>\n<br/>\nI will say this, though - I have never played it, and wouldn't on WoG.<br/>\n<br/>\nThe AB is too low.<br/>\n<br/>\nIt does have survivability (epic dodge and epic damage reduction), but I think it just sacrifices too much for defense for an environment like WoG, where higher AB is necessary.<br/>\n<br/>\nAs for it \"out performing\" a dedicated melee-er, that is a bit too much hubris imo.  Certainly I have some dedicated melee-ers that would pound it into the dirt, but I digress.  In an environment like WoG, where having a 6o+ AB is a solid melee-er, this build seems a bit low to me.<br/>\n<br/>\nBut for survivability, yeah, this is a good, solid build, no doubt about it.<br/>\n<br/>\nAs GDL also mentions that he plays this often in a party, I rather suspect that the AB deficit is easy to get around (buffs, ect), so there is that.  And also, most SP environments are not as demanding as WoG, so there is that as well.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "1:10 PM - Mar 10, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If I recall, GDL did a remake of Death's Rival and updated it after the 1.69 changes.   If I run across it I'll post a link.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:34 PM - Mar 10, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>conlaoch wrote: <a data-post-id=\"27938\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=27938&amp;sid=af8fd64018301f31b43896d34fd5dc1d#p27938\">↑</a><div class=\"responsive-hide\">Mar 10, 2023</div></cite>If I recall, GDL did a remake of Death's Rival and updated it after the 1.69 changes.   If I run across it I'll post a link.</div></blockquote>\nI think the linked version of Death's Rival is already 1.69 compliant, but it would be interesting to see how the Dwarflord could improve on this one (though I confess I'd prefer to see Blind Fight come earlier, and I tend to not take the dual-wielding feats until I can make decent use of them, but that's probably just me).<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "4:17 PM - Mar 10, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I might have been mistaken...  <br/>\nI did find a thread where both Stag and GDL gave improved versions of <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-last-great-bounty-hunter-a-slight-re-tooling-t2355986.html\" rel=\"noreferrer\" target=\"_blank\">The Last Great Bounty Hunter</a> though...<br/>\n<br/>\nI thought at one time there was also a remake of the Stygian Knight, but I was unable to find it<br/>\n<br/>\nFound the remake of the Stygian Knight, it was in a thread on the WoG site.  So for those that are interested in seeing it...<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/stygian-knight-t2558.html\" rel=\"noreferrer\" target=\"_blank\">Stygian Knight</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:16 PM - Mar 11, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I do like that one, Con - thanks for posting the link (and indeed for getting GDL to upgrade his build in the first place). It's a shame I can't access the Dwarlord's linked Glaive of the Hidden Mists - a STR-based type going heavy on SD is a proper left-field concept!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:45 PM - Mar 11, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have a toon on WoG based on the Glaive of the Hidden Mists.<br/>\n<br/>\nIt's counter intuitive, but a lot of fun!  Who doesn't like sneaking in Full Plate?<br/>\n<br/>\nYou want the build posted here?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:17 PM - Mar 11, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"27942\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=27942&amp;sid=af8fd64018301f31b43896d34fd5dc1d#p27942\">↑</a><div class=\"responsive-hide\">Mar 11, 2023</div></cite>I have a toon on WoG based on the Glaive of the Hidden Mists.<br/>\n<br/>\nIt's counter intuitive, but a lot of fun!  Who doesn't like sneaking in Full Plate?<br/>\n<br/>\nYou want the build posted here?</div></blockquote>\nOh, that would be great if you could, Webby!<br/>\n<br/>\nThank you<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:12 PM - Mar 11, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As you command, o master!<br/>\n<blockquote><div><strong>The Twilight Queen: Glaive of the Hidden Mist</strong> <br/>\n<br/>\nFighter12/Bard3/SD25<br/>\nRace: Human (or Dwarf)<br/>\nAlignment: Any non-lawful<br/>\nPlayable: 1-40 PvM, mid-magic<br/>\n(and all environments where Shadowdancers have been altered)<br/>\n<br/>\n<strong>Attributes</strong><br/>\nStr17 (30)<br/>\nInt14<br/>\nWis8<br/>\nDex13<br/>\nCon14<br/>\nChr8<br/>\n<br/>\n<strong>Level Guide</strong><br/>\n1 Fighter1, WF: Halberd, Power Attack, Cleave<br/>\n2 Fighter2, Dodge<br/>\n3 Fighter3, Mobility<br/>\n4 Fighter4, WS: Halberd, Str18<br/>\n5 Fighter5<br/>\n6 Fighter6, Blindfighting, Stealthy<br/>\n7 Bard1<br/>\n8 SD1, Str19<br/>\n9 SD2, SF: Hide<br/>\n10 SD3<br/>\n11 SD4<br/>\n12 SD5, SF: Move Silently, Str20<br/>\n13 SD6<br/>\n14 SD7<br/>\n15 SD8, Improved Crit: Halberd<br/>\n16 Fighter7, Str21<br/>\n17 SD9<br/>\n18 SD10, Iron Will (<em>or Toughness</em>)<br/>\n19 Fighter8, Great Cleave<br/>\n20 Fighter9, Str22<br/>\n21 Fighter10, EWF: Halberd, EWS: Halberd<br/>\n22 Bard2<br/>\n23 SD11<br/>\n24 SD12, Great Str I, Str24<br/>\n25 SD13, ESF: Hide<br/>\n26 Fighter11<br/>\n27 SD14, Overwhelming Crit: Halberd<br/>\n28 Fighter12, Dev Crit: Halberd, Str25<br/>\n29 SD15<br/>\n30 SD16, ESF: Move Silently, Great Str II<br/>\n31 SD17<br/>\n32 SD18, Str27<br/>\n33 SD19, Epic Shadowlord, Armor Skin<br/>\n34 SD20<br/>\n35 SD21<br/>\n36 SD22, Epic Prowess, ESF: Taunt, Str28<br/>\n37 SD23<br/>\n38 SD24<br/>\n39 SD25, ESF: Discipline, Great Str III<br/>\n40 Bard3, Str30<br/>\n<br/>\n<strong>Combat Vitals</strong><br/>\nAB: 40/35/30/25<br/>\nDamage: 1d10+21 (19-20/x3)<br/>\nAC: 29<br/>\nHP: 418<br/>\n<br/>\n<strong>Saves</strong><br/>\nFort 22 (31)<br/>\nWill: 19 (28)<br/>\nReflex: 23 (32)<br/>\n<br/>\n<strong>Skills</strong>: 323<br/>\nDiscipline: 43 (63)<br/>\nHide: 43 (59)<br/>\nMove Silently: 43 (59)<br/>\nTumble: 40<br/>\nUMD: 36 (35)<br/>\nTaunt: 42 (51)<br/>\nSpellcraft: 43 (45)<br/>\nSearch: 1<br/>\n<br/>\n<br/>\n<strong>Special</strong><br/>\nStealth Score in Full Plate, no buffs: 51/51<br/>\nShadow Evade(x3): 16/+6 DR, 20% Concealment, +4AC<br/>\nShadow Daze(x1): DC36 (42 buffed)<br/>\nDev Crit DC: 40 (46 max)<br/>\nEpic Shadowlord Summons<br/>\nHiPS<br/>\nImproved Evasion<br/>\nSlippery Mind<br/>\nDefensive Roll<br/>\nUMD for Scroll Casting<br/>\nHigh Taunt score <br/>\nDoes 2 damage types<br/>\nNear KD/Disarm/Called Shot Immunity<br/>\nEnough Feats/Skills to Customize/Tailor for PW<br/>\n<br/>\n<br/>\n<strong>Weaknesses</strong><br/>\nMediocre Base Saves, but holds own against spells<br/>\nMediocre Hit Points<br/>\n<br/>\n<strong>Commentary</strong><br/>\nI�m not sure if there is an actual niche for this kind of build, so I thought I�d post it anyway. This build is for all those PWs out there that have made happy adjustments to the Shadowdancer class. I�ve played in several now where Shadow Evade has been given some actual use, and the duration is based on level, or have given Shadowdaze more teeth, or have altered the Shadowlord summons, and so on. Even if HiPS has been changed, given a cool-down period, or nerfed outright, this kind of character can still enjoy success. To explain the goal of this kind of character, it�s simply to maximize the utilities of the Shadowdancer class while still maintaining a healthy melee presence. <br/>\n<br/>\nBasically, we wanted an assassin-like character, except instead of using Death Attack, we use Dev Crit. We maximize SD levels to give us the most out of Shadow Evade and to grab that great DR it grants at higher levels, as well as that juicy Shadowdaze DC. Even in Full Plate this character will have the same steath score as if he were naked and dex-based with a 26 Dex. We use the the SD bonus feats in a way one not normally sees SD feats used�for Epic Skill Focus feats. With 5 of those coming in Epic levels, there is lots of room for customization. Hide and Move Silently are a must, and the 3rd I nodded to the Epic Summons, and then I choose Taunt and Discipline because those things are important to me and my playstyle. I can easily see someone giving those up for Listen/Spot or UMD/Search, etc�.<br/>\n<br/>\nI�ve done this kind of character before, such as in The Assassin King or the Zhentarim Field Agent, in which Strength-based stealthers launch from the shadows to lay waste with their sneak attacks. Since it hasn�t been done this way, I thought I�d post the full-blooded SD version. I�ve done other versions that were also quite fun, and did a Halfling version (had to swap Rogue for Bard) that got an even better Stealth score. Dwarf also works well with this, but you have to give up 43 skill points. The non-Dev Crit version got a slightly better AB and finished with Improved Expertise and Improved Disarm, which may be a nice option if Dev Crit is banned on your server. If Shadowdancers haven�t been given incentives to go deeper into levels on your PW, then this build may not be for you, though would still be playable and unique.<br/>\n<br/>\nHalberd was chosen for coolness factor, though admittedly Greatsword would be better for crit efficiency. What�s nice about the Halberd is that it does to damage types, and 1.69 finally got that 2 damage type bug fixed. Comments and flames welcome. Cheers.</div></blockquote><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:25 PM - Mar 11, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This heavy investment in SD makes me wonder what changes to the class there are on WoG.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:29 PM - Mar 11, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Shadow evade and the summons have been buffed, considerably, and depends on the lvl of the SD.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:36 PM - Mar 11, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That 18/+7 dr, and +7 Dodge AC modifier for a lvl 30 SD would last 30 rounds (x3/day)!<br/>\n<br/>\nAs WoG is a +5 (+6 exceptions exist), that is astoundingly good!<br/>\n<br/>\nAs this build \"only\" goes to SD 25, that is still a 16/+6 dr and a +6 Dodge AC modifier.<br/>\n<br/>\nNote that WoG does have a cooldown timer for HiPS of 6 seconds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:57 AM - Mar 12, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Many thanks, Webster! I confess, I'd probably lose Stealthy for Knockdown, but that's just me (you know what late converts are like - I was never concerned with taking KD until about 3 or 4 years ago). In any case, it's a damn fine build regardless of environment, but I concede that it will flourish more in a WoG-type one.<br/>\n<br/>\nThanks for dropping it in!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "11:20 AM - Mar 13, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"27941\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=27941&amp;sid=f6fc01d5fcd39fd0b2c08f2bb0e05dd0#p27941\">↑</a><div class=\"responsive-hide\">Mar 11, 2023</div></cite>I do like that one, Con - thanks for posting the link (and indeed for getting GDL to upgrade his build in the first place). It's a shame I can't access the Dwarlord's linked Glaive of the Hidden Mists - a STR-based type going heavy on SD is a proper left-field concept!<br/>\n<br/>\nCheers</div></blockquote>\nAsk and you shall receive Stag...<br/>\n<br/>\nI actually when looking for that GDL build and it looks like someone cut and pasted the build into the top of this ECB thread...<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-twilight-queen-rework-lvl-30-amia-rules-t2354743.html\" rel=\"noreferrer\" target=\"_blank\">Glaive of the Hidden Mist (pasted into top of this thread)</a><br/>\n<br/>\nCan you pull it out and put it as a lvl 40 build?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:15 PM - Mar 13, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Con!<br/>\n<br/>\nI'll see what I can do - though we all know the tecky side is hardly my forte. If push comes to shove, I'll input the build myself - making sure to include a credit for GDL in the title (much as Demos did when he posted Mith's Blood and Faith).<br/>\n<br/>\nWhile I'm at it, I'll see what the differences are with Web's version (above), if any.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:06 PM - Mar 13, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There are no differences - both are directly pulled from GDL's original build.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:18 PM - Mar 13, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thinking about it, I know the Dwarflord still pops in here for a look-see, so perhaps we could persuade him to post the Glaive himself? What say you <em class=\"mention\">@grizzled_dwarflord</em> ? Go on, you know you want to...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "2:35 PM - Mar 13, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You mean this? <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build301725.html\" rel=\"noreferrer\" target=\"_blank\">The Twilight Queen</a><br/>\n<br/>\nYes, one could drop Stealthy or Iron Will, depending on environment and items.  I liked to get that Stealth as high as possible since there are many NPCs in my environments that sport high Spot or Listen.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:30 PM - Mar 13, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>grizzled_dwarflord wrote: <a data-post-id=\"27957\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=27957&amp;sid=4da02f4e4d7a51cf9e6c55370d2429b1#p27957\">↑</a><div class=\"responsive-hide\">Mar 13, 2023</div></cite>You mean this? <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build301725.html\" rel=\"noreferrer\" target=\"_blank\">The Twilight Queen</a><br/>\n<br/>\nYes, one could drop Stealthy or Iron Will, depending on environment and items.  I liked to get that Stealth as high as possible since there are many NPCs in my environments that sport high Spot or Listen.</div></blockquote>\nThat's the very chap, thank you!<br/>\n<br/>\nJust a couple of questions, if you don't mind?<br/>\n<br/>\nFirst, would you be happy to have this posted in the 40s forum here - and if so would you prefer to do it, or should I do a transcript (much as Demos did with Mith's Blood and Faith)?<br/>\n<br/>\nSecond, with the Dwarf option would you simply let the CON jump to 16, or leave it at 14 and bump STR to a starting 18 (giving one free epic general feat) and popping the extra stat point somewhere else (like DEX)?<br/>\n<br/>\nEDIT: Kindly ignore the second question, please, as there would only be 2 extra stat points, not 4. I are a niddiot.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}