{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "425",
  "name": "Bard/BG/RDD",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bard-bg-rdd-t2299720.html",
  "author": "10235387",
  "avatar": "no_avatar.png",
  "replies": "5",
  "views": "1.2K",
  "posts": [
    {
      "author": "10235387",
      "avatar": "no_avatar.png",
      "timestamp": "2:06 AM - Nov 28, 2012",
      "content": "<div>In the middle of taking him through the OC - he's Bard(5) RDD(4) BG(2).  Pardon me for not using the standard format but I haven't been marking down my changes as I've leveled up.<br/>\n<br/>\nSTR - 14 (18, from RDD)<br/>\nDEX - 8<br/>\nCON - 14<br/>\nINT - 14<br/>\nWIS - 10<br/>\nCHA - 16 (18, from level up)<br/>\n<br/>\nFeats - <br/>\nArmor (Light*, Medium*, Heavy)<br/>\nArtist*<br/>\nBard Song*<br/>\nBardic Knowledge* <br/>\nBull's Strength - BG level 2<br/>\nCleave<br/>\nDark Blessing<br/>\nDraconic Armor<br/>\nDragon Breath<br/>\nHit Die Increase<br/>\nKnockdown<br/>\nMount Actions*<br/>\nPower Attack<br/>\nQuick to Master*<br/>\nShield Proficiency*<br/>\nSmite Good<br/>\nUse Poison<br/>\nToughness<br/>\nWeapon Proficiency (Simple*, Martial)<br/>\n<br/>\nSpells: <br/>\nCantrips: Cure Minor Wounds, Daze, Flare, Light, Resistance<br/>\nLVL1: Mage Armor, Magic Weapon, Protection from Alignment, Balagarn's Iron Horn<br/>\nLVL2: Cat's Grace, Ghostly Visage, Eagle's Splendor<br/>\n<br/>\nCurrently using Ravager Halberd +1 - trying to decide on taking WF in Great Axe and hope to run across Axe of the Culling, or WF Halberd as their seem to be some great choices.<br/>\n<br/>\nI will definitely go BD8/BG4/RDD8 to get BAB 16, but after that I need some guidance.  I'm a melee-er and usually go Cleric or Monk/Cleric and spend 5 minutes buffing before opening doors.  I'm hoping that with a high level Bard and Lasting Inspiration I won't need to cast 5,000,000 spells to get a decent AB.  I've looked at some of the BD26/BG4/RDD10 builds, but am not sophisticated enough how to make the best melee character out of the mix.<br/>\n<br/>\nAlso - is Bard Song/Curse Song dispellable?<br/>\n<br/>\nAlso - if it matters, I'm in CH.2 doing Mutamin's challenge.  I plan on goiing from the OC and will take two tracks - the first one, after I get BG4 I will RP him back to Good, then do the Aribeth series.  With the other, I'll take him from the OC to HOTU, then - even though I have NEVER played evil characters throughout a whole module - <br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tI will betray the Seer, get the fully powered Drow Robe, then supplant Mephistopeles and go through the user module for characters who chose the evil ending to HOTU (just because I've heard so much about it - I'm a natural Dudley Doo-rite).</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:48 AM - Nov 28, 2012",
      "content": "<div>HotU is made for characters who have finished SoU, not the OC. It is best to plan out your build before you start playing, and you can do this if you start your second track in SoU.<br/>\n<br/>\nI never play evil, so I have no experience with BG, so I can't help you with the build. I tried playing an evil character in the OC once, with a Rogue 8 / Fighter 12 build, but I didn't even finish the Peninsula District in Chapter One because I just couldn't stomach being so evil.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "10235387",
      "avatar": "no_avatar.png",
      "timestamp": "3:49 PM - Nov 28, 2012",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong>HotU is made for characters who have finished SoU, not the OC. It is best to plan out your build before you start playing, and you can do this if you start your second track in SoU.</div></blockquote>\n\nI know - I just don't like SOU.  One of my greatest playing experiences, however, was a PAL/COT I started in SOU, took through HOTU and then some high-level user modules. PAL(10)COT(20) and a nearly perfect avatar of good!<br/>\n<br/>\nFor this phase of my NWN experience, however, I'm experimenting with \"redeemed\" characters - start them good, have them fall then come back to the light.  Ultimately, I'm going to do a PAL/BG/COT so that I can actually use Aribeth's sword.  Previously, I've used too many BG levels so I'm tryingba level 4 BG to get the feel.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:32 PM - Nov 28, 2012",
      "content": "<div>On a tangent, if you haven't played the Sands of Fate series, you should because you would enjoy it. It is perfect for a character who has finished HotU, and it will take your character all the way to level 40. I also highly recommend The Aielund Saga, which starts at level 1 and goes to about level 36. Both series can easily be found in the Vault.<br/>\nOne of these days, I have got to try that Aribeth series. Would a Neutral Good Bard / Fighter / RDD work alright there? How about a Lawful Good Rogue / Monk / Fighter?</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "10235387",
      "avatar": "no_avatar.png",
      "timestamp": "6:11 PM - Nov 28, 2012",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong>On a tangent, if you haven't played the Sands of Fate series, you should because you would enjoy it. It is perfect for a character who has finished HotU, and it will take your character all the way to level 40. I also highly recommend The Aielund Saga, which starts at level 1 and goes to about level 36. Both series can easily be found in the Vault.<br/>\nOne of these days, I have got to try that Aribeth series. Would a Neutral Good Bard / Fighter / RDD work alright there? How about a Lawful Good Rogue / Monk / Fighter?</div></blockquote>\n\nI've done the first 2 of Sands of Fate - never finished the 3rd part.<br/>\n<br/>\nAny good character will do well in the Aribeth series.</div>"
    },
    {
      "author": "10235387",
      "avatar": "no_avatar.png",
      "timestamp": "8:54 PM - Dec 19, 2012",
      "content": "<div>OK, so I've taken him through the OC (Bard 8/BG 4/RDD 6) and am preparing for HOTU.  I will do the next 4 levels as RDD, then Bard from there on out, unless someone can give me a better reason for delaying RDD 9 and 10?</div>"
    }
  ]
}