{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "766",
  "name": "'The Master' (Rogue 7 / Fighter 8 / Weapon Master 25)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-master-rogue-7-fighter-8-weapon-master-25-t2355235.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:29 AM - Nov 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong>The 'Master' (Rogue 7 / Fighter 8 / Weapon Master 25)</strong><br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201912/10759084_8e140561d8f2777398910f14ad4bd1fd.jpg\" />\n</dl>\n</span><br/>\nI've edited this post to reflect I've play tested this build to level 9 on World of Greyhawk. <br/>\n<br/>\nIt is really enjoyable right from the beginning. The rogue skills are great, the fighter combat prowess fantastic, and when enough weapon master is invested the build will become truly lethal (with 49 base AB, crit 15-20/x3, devastating critical if you wish).<br/>\n<br/>\nStuff like opening locks (or locking doors to slow down enemy advances), retrieving and storing a whole bunch of traps then setting them for boss fights, sneak attacking opponents with a greatsword one by one as they go around corners, detecting them with high listen skills and keen senses - all of it together is really enjoyable. Uncanny dodge / evasion / UMD / 8 tumble AC is great on top of the fighter/weapon master combat prowess and grants a lot of flexibility in terms of armor choice (ie medium armor is viable with uncanny dodge and a high dex score)<br/>\n<br/>\nIn terms of pure optimisation, human or dwarf are probably the best classes, human for the +43 skill points and extra feat (which I would choose toughness for +40hp), dwarf gets +40hp +1 fort and a pile of dwarven goodies, but one could choose pretty much any race and make this build work. The smaller races (halfling / gnome) I would try to get improved knockdown by dropping one great strength, the spare feat could be toughness, epic skill focus or epic energy resistance or called shot.<br/>\n<br/>\nThose who don't like devastating critical - this build is still delightful. <br/>\n<br/>\nBy dropping power attack/cleave/great cleave, one can take improved knockdown and two further feats, such as disarm/improved disarm for large weapon users, two great strengths, two of toughness + epic skill focus/epic energy resistance, and replace the overwhelming/devastating critical feats for epic toughness feats for +40 hp (unfortunately you don't have much choice in that matter with the weapon master bonus feats).<br/>\n<br/>\nI'm playing this as an elf right now, with 410+hp it is a very reasonable melee'r. As mentioned Human is probably most optimal with around 490hp from the extra cons and toughness feat +over 300 skill points, but keen senses I just find very enjoyable to use with all the detection skills in the build. Human could probably make adjustments to the skill points to invest a little less in open lock and more into stealth skills, adding another string this builds bow. Or into craft trap. Or crossclass skill dump it into spellcraft.<br/>\n<br/>\nAnyway I plan to play test this a bit more before I finalise the build and post it in the 40s section<br/>\n<br/>\nAnd this is kind of the coolest elven portrait I could find that kind of fits the build I was trying to make, the blue magic around her hands is UMD :)<br/>\n<br/>\n<br/>\n<strong>Original post</strong><br/>\n<br/>\nFighter / Rogue / Weapon Master is a very famous combination.<br/>\n<br/>\nI wanted to make a high AB Elven Warrior with a very high number of skill points that could do all the roguish stuff a party needs combined with the delightful Keen Senses feat, and access to module specific elven goodies (module makers definitely favour elves - WoG has a few elf specials for example).<br/>\n<br/>\nI also wanted to dodge multi-class exp penalties where possible. Although in persistent worlds (WoG), where I play test the builds I make, this is less of an issue, I find the challenge of creating a build which minimises such penalties enjoyable in itself. Theres no real reason for it but I still do it. <br/>\n<br/>\n20% exp penalties are limited to two levels -&gt; level 20 and 21. Other levels will level up normally.<br/>\n<br/>\nAnyway managed to make a 49 Base AB dev critter with almost 280 skill points.<br/>\n<br/>\nIf you don't like dev crit or its disabled, then drop power attack/cleave/great cleave, add two epic toughness feats and rearrange feats and add three more options from disarm, improved disarm, toughness, called shot<br/>\n<br/>\nHuman would allow me to have about 320 skill points (allowing the build to set epic traps, and having a few extra search points), avoid multiclass penalties (which are already minimal) but I want those keen senses and elven goodies :)<br/>\n<br/>\nThe will save sucks so chug those clarities or use UMD for lesser mind blank / mind blank / use a lesser belt of guiding light etc etc -&gt; if you are playing solo you will want to be doing this anyway, usually failing a will save as a solo character in a challenging environment = death, and encounter enough of those baddies with a fear aura, eventually you will roll a 1. <br/>\n<br/>\nIf you are in a party with a wizard, well all is good :) Enjoy that mind blank spell, it is delightful.<br/>\n<br/>\nAs for the weapon you can choose any simple or martial melee weapon you like, I chose Greatsword because I like the crit range, being able to keen it and seeing big numbers with a two handed with x3 modifier. One handed weapon wielders will be able to tank more effectively by being able to use a tower shield further boosted by expertise, which with Base 49 AB could always be active if desired. <br/>\n<br/>\nAnd the name of the build is a dual meaning - both a Weapon Master, and a master of skills (well sort of - you know, amulet of the master has all those skills...)<br/>\n<details><summary>Spoiler</summary>Rogue(7), Fighter(8), Weapon Master(25), Elf\n\nDEX: 14\nWIS: 8\nCHA: 8\nElf: (Hardiness vs. Enchantments, Keen Sense, Low-light Vision, Skill Affinity: Listen, Skill Affinity: Search, Skill Affinity: Spot, Sleeplessness)\n02: Fighter(1): Weapon Focus: Greatsword\n04: Fighter(2): STR+1, Mobility, (STR=17)\n06: Fighter(3): Spring Attack\n08: Rogue(4): STR+1, (STR=18)\n10: Weapon Master(1): Weapon of Choice: Greatsword\n12: Weapon Master(3): STR+1, Knockdown, (STR=19)\n14: Weapon Master(5)\n16: Weapon Master(7): STR+1, (STR=20)\n18: Weapon Master(9): Blind Fight\n20: Fighter(6): STR+1, Power Attack, (STR=21)\n22: Rogue(5)\n24: Weapon Master(13): STR+1, Great Cleave, Epic Weapon Focus: Greatsword, (STR=22)\n26: Weapon Master(15)\n28: Weapon Master(17): STR+1, (STR=24)\n30: Fighter(7): Epic Weapon Specialization: Greatsword\n32: Weapon Master(19): STR+1, Overwhelming Critical: Greatsword, (STR=25)\n34: Weapon Master(21)\n36: Weapon Master(23): STR+1, Great Strength III, (STR=28)\n38: Weapon Master(25): Epic Prowess\n40: Fighter(8): STR+1, Improved Knockdown, (STR=30)\nHitpoints: 412\nSaving Throws (Fortitude/Will/Reflex): 20/15/25\nBAB: 29\nAC (naked/mundane armor/shield only): 22/32\nAlignment Changes: 0\n\n\n01: Disable Trap(4), Listen(4), Open Lock(4), Search(4), Set Trap(4), Spellcraft(1), UMD(4), Save(18), \n03: Disable Trap(2), Listen(2), Open Lock(2), Search(2), Set Trap(2), Tumble(5), UMD(2), Save(12), \n05: Disable Trap(2), Listen(2), Open Lock(2), Search(2), Set Trap(2), UMD(2), Save(14), \n07: Discipline(1), Save(21), \n09: Discipline(2), Save(8), \n11: Discipline(1), Listen(1), Save(13), \n13: Discipline(1), Listen(1), Save(19), \n15: Discipline(1), Save(26), \n17: Discipline(1), Save(34), \n19: Discipline(1), Save(42), \n21: Discipline(1), Save(50), \n23: Discipline(2), Listen(1), Save(2), \n25: Discipline(1), Save(10), \n27: Discipline(1), Save(18), \n29: Disable Trap(7), Listen(2), Open Lock(7), Search(2), Tumble(5), UMD(6), \n31: Discipline(1), Listen(7), \n33: Discipline(1), Listen(1), Save(5), \n35: Discipline(1), Listen(1), Save(11), \n37: Listen(1), Save(19), \n39: Disable Trap(10), Listen(1), Open Lock(10), Tumble(10), UMD(3), </details>\n<strong>Edit (stealth version, 16/1/2020):</strong><br/>\nI've been asked to make an elven stealth version of this build.<br/>\nThis is the best I came up with, I took ESF: Hide and Move Silently, dropped two great strengths in exchange. Ending base Str 28, Base AB 48. <br/>\nIdeally one will want to boost dexterity (through items, or spells such as Cats Grace or Greater Cats Grace) to equip either chain shirt, leather armor or padded depending how high one can get dexterity up to.<br/>\n<details><summary>Spoiler</summary>Rogue(7), Fighter(8), Weapon Master(25), Elf\n\nDEX: 14\nWIS: 8\nCHA: 8\nElf: (Hardiness vs. Enchantments, Keen Sense, Low-light Vision, Skill Affinity: Listen, Skill Affinity: Search, Skill Affinity: Spot, Sleeplessness)\n02: Fighter(1): Weapon Focus: Greatsword\n04: Fighter(2): STR+1, Mobility, (STR=17)\n06: Fighter(3): Spring Attack\n08: Rogue(4): STR+1, (STR=18)\n10: Weapon Master(1): Weapon of Choice: Greatsword\n12: Weapon Master(3): STR+1, Knockdown, (STR=19)\n14: Weapon Master(5)\n16: Weapon Master(7): STR+1, (STR=20)\n18: Weapon Master(9): Blind Fight\n20: Fighter(6): STR+1, Power Attack, (STR=21)\n22: Weapon Master(11)\n24: Weapon Master(13): STR+1, Great Cleave, Epic Weapon Focus: Greatsword, (STR=22)\n26: Weapon Master(15)\n28: Weapon Master(17): STR+1, (STR=23)\n30: Fighter(7): Epic Weapon Specialization: Greatsword\n32: Weapon Master(19): STR+1, Overwhelming Critical: Greatsword, (STR=24)\n34: Weapon Master(21)\n36: Weapon Master(23): STR+1, Epic Skill Focus: Move Silently, (STR=26)\n38: Weapon Master(25): Epic Prowess\n40: Fighter(8): STR+1, Improved Knockdown, (STR=28)\nHitpoints: 412\nSaving Throws (Fortitude/Will/Reflex): 20/15/25\nBAB: 29\nAC (naked/mundane armor/shield only): 22/32\nAlignment Changes: 0\nCraft Trap 8(11), Disable Trap 6(11), Discipline 43(52), Hide 42(54), Intimidate 4(3), Listen 42(43), Move Silently 42(54), Open Lock 1(3), Search 5(10), Set Trap 11(15), Tumble 40(42), UMD 31(30)\n\n02: Craft Trap(1), Discipline(5), Save(6), \n04: Craft Trap(1), Discipline(2), Save(4), \n06: Discipline(2), Save(5), \n08: Hide(3), Intimidate(4), Listen(2), Move Silently(3), Set Trap(3), Tumble(2), UMD(3), \n10: Discipline(1), Listen(2), Save(5), \n12: Discipline(1), Listen(1), Save(11), \n14: Discipline(1), Listen(1), Save(17), \n16: Discipline(1), Listen(1), Save(23), \n18: Discipline(1), Save(30), \n20: Discipline(1), Save(38), \n22: Discipline(2), Listen(1), Save(2), \n24: Discipline(1), Listen(1), Save(8), \n26: Discipline(1), Save(16), \n28: Discipline(1), Save(24), \n30: Discipline(2), Save(3), \n32: Discipline(1), Listen(4), \n34: Discipline(1), Listen(1), Save(6), \n36: Listen(1), Save(13), \n38: Listen(1), Save(21), \n40: Discipline(5), \n</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:17 AM - Nov 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Mkay.<br/>\n<br/>\nTitle says \"R9/F6/WM25\" but your build is actually \"R7/F8/WM25\".<br/>\n<br/>\nAnyway you can get 3 more levels of WM in there, somehow, for that topped off AB?<br/>\n<br/>\nMaybe R5/F7/WM28?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:42 PM - Nov 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Web, forgot to change the title. When I started the post it was Rogue 9 Fighter 6 WM 25 with a bunch of rogue levels at the end, but I thought the build overall would be better served with the current split as the epic fighter levels allow access to epic weapon specialization, for those crit and sneak immune opponents who need a good thwacking.<br/>\n<br/>\nGoes to show there are lots of possible combos possible. Heh I spent quite a bit of time exploring a whole bunch of options<br/>\n<br/>\nRo5 F7 WM 28 can work, provided one drops the improved knockdown feat at the end, and goes with a pre-epic F6 Ro4 WM 10 split which will net Base 50 AB and one epic toughness feat at the cost of one fighter feat and about 12 skill points.<br/>\n<br/>\nThere will be 20% multiclass exp penalties from level 20 onwards, there would be no rogue skill dumps from either level 8 (for the described exp penalties) or level 20 (with exp penalties from level 8) to level 39<br/>\n<br/>\nRo6 F6 WM 28 can work also with the same pre-epic split, with only exp penalties from level 20 to level 22 and dropping epic weapon specialization<br/>\n<br/>\nAnother option to increase AB further is to keep the current class split, have a starting Str of 17, drop Cons to 10, Dex to 13 and drop epic weapon specialization for a great strength feat. This nets an ending Base AB of 50 at the cost of EWS. Or one could additionally drop Dev Crit, cleave and great cleave and take two great strengths for an ending Base AB of 51.<br/>\n<br/>\nAnyway I thought long and hard about balance per se, and I think once the AB is that high, other features are valuable. <br/>\n<br/>\nMithdradates set the bar for a low warrior at 40 and a good warrior at 45+, and 49 is pretty decent given there is close to 280 skill points available in addition to dump into rogue, I thought increasing it further would come at costs that I wanted to avoid<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}