{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "018",
  "name": "Playing Better - The Importance of Knowledge and Intelligent Decision-making",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/playing-better-the-importance-of-knowledge-and-int-t2354384.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": "7",
  "views": "7.9K",
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:00 AM - Feb 16, 2015",
      "content": "<div>Hail, mighty ECBers!<br/>\n<br/>\n I’m writing this article in the hopes that I can share some of my playing experience with some of you guys, mainly newer members, who are still learning the game and the building techniques. The topic of discussion will be playing better, but before, let me give you a summary of my NWN experience so you can have a better understanding of the evolutionary process that I had to go through to get to where I’m at today. It was a long, fun and eye-opening road!<br/>\n<br/>\n Neverwinter Nights and I go WAAAAY back. As many people, I began playing the game doing the OC, Killing those blasted Old Ones with the help of Grimgnaw and sometimes Daelan Red Tiger, occasionally Tomi and Linu too. I used to hang out with all of them, one at a time, just to do all the quests and get maximum experience. Then when SoU and HotU were released and epic levels were introduced, I rushed to the store to get my copy. I played them frantically, especially HotU, because I’d had plenty of low level experience and I wanted to try out the new stuff. I still remember how proud I was when my then-severely-gimped Magical Master build (at the time Wizard 20 / Cleric 20) with a Robe of Balpheron and Rizolvir-enhanced Staff and a very-low-but-that-I-thought-was-huge 65 AC was just destroying everything with his summoned Elder Elemental. I was so proud of my powerful character that as soon as I found the ECB existed, I posted it, and it got DESTROYED by the elders. I got severely heckled and with good reason, because it sucked so badly back then. But I didn’t understand, after all, my MOST POWERFUL TOON WHO SOLOED MEPHISTOPHELES could not be gimped! I couldn’t have been more wrong. Then I heard Kail Pendragon say how he had a Druid with 81 AC and I thought he was lying, cuz it was impossible!!! Or was it? I now have a Dragon that can reach pretty much 82 AC, maybe more, with the correct item set about 87 with Expertise. But, that’s going too far ahead in the timeline. Before that, many things happened.<br/>\n<br/>\n I went on to play in Aielund, which was probably the first ever challenging experience I had as a NWN player. During my OC days, I would see a group of 20 monsters and fearlessly charge at them, and just go out for a coffee while my toon was done with them. And it didn’t even take that long. I had no moves, didn’t need to shortcut any spells, I just buffed a summoned creature and watched it tear everything apart. It was pathetic. In the Underdark, that battle with the Drow army, I cast ACID FOG (LOL) and Wall of Fire many times at the door and just waited for the enemies to die, while I took care of the other enemies that came from the sides. In Aielund, I had to be more careful, but I could still charge in, albeit with Expertise turned on, and attempt a KD, etc.. I used to just spam KDs, not knowing anything about the attack flurries and how they were divided. I had learned more about building toons in the ECB than about how to play them, and it didn’t help that I didn’t have a lot of time to play, but I had time to build toons at work. I became a good builder and an average player.<br/>\n<br/>\n Then after finishing Aielund with 3 separate toons (Holy Weapon Master with Cheese, Champion of the Wilderness and Magical Master) I decided to play in a Brazilian PW named Amnesia. The place was really high magic (there were +12 items with many immunities) and at that time I had a firm grasp on the concepts of building, so my powerbuilds excelled there. The other Brazilian guys were impressed because Max had 10 attacks per round, and they wanted me to make them builds, and stuff. But I didn’t need to do much, I cast a spell here and there, buffed up (and NEVER got dispelled) and just wrecked everything, including a Black Dragon boss that was feared by many, and I soloed it easily. I got bored with the lack of balance in that server, and I had heard a lot about WoG on the ECB, so in 2006, I started to play on WoG.<br/>\n<br/>\n It was an EYE-OPENING experience, which deserves the capital letters I used. Even in Amnesia and Aielund, I was never dissuaded from just blasting and rushing in like a mindless fool against any number of enemies. I had powerful builds and the monsters weren’t as powerful, so I just trashed everything. That habit I had acquired made me die so much! Even with my knowingly powerful toons, to the point where I had to review my playstyle. I went from a rush-in freak to a strategy-trier. If I died at a certain encounter, I would think of alternative ways to beat it and then I would try them out and adjust accordingly until I finally did it. What I learned by experimenting, was to USE my own builds appropriately. I learned more than anything, to PLAY NEVERWINTER NIGHTS properly. Now I’m even trying to test myself to see if I can level some really gimped builds on WoG, and so far I haven’t failed. Xanos Messarmos has reached level 16 and blossomed into quite a powerful fighter. Soon, his Sorcerer levels will start going up and his self-buffing capacity will grow tenfold! (and he will no longer say: “TASTE MY POWER” then cast a Ray of Frost and die like the SoU henchman did LOL). But those first 16 levels were PAINFUL!<br/>\n<br/>\n Nowadays, I can say that I am a pretty good NWN player and a very good NWN builder, but I’m sure there are still lots of new tricks I can learn out there. I will try to summarize the changes I made to my playstyle along this process, but without being too specific, so you can see how WoG turned the blind left-clicker that I was when I arrived into a competent strategist capable of beating every major boss in the server solo, some even with some not-so-optimal builds (concept builds). There are many things that I used to do that are ill advised to say the least in a challenging environment and many things that I didn’t know about that are VITAL for survival in the same environment. Here are a few tips that, if followed, will make you a better NWN player. Let’s start with the simple stuff and then move on to more complex ones:<br/>\n<br/>\n 1- DO NOT RUSH IN! If you see a group of monsters, resist the single-player-induced temptation to just blast through the door and go toe-to-toe with 10 enemies at a time. On balanced environments, that approach generally ends with you taking a dirtnap. However, this does not constitute a recommendation to NEVER rush in. Sometimes, rushing in IS the best option. But there is a HUGE difference between blindly rushing in as a general procedure and rushing in strategically in situations where it’s appropriate. Don’t rush in unless there is a reason to do so. If you don’t know the area, just don’t do it.<br/>\n<br/>\n 2- ALWAYS HAVE A RANGED WEAPON! Yes, even your 8-Dexterity Fighter / Bard / RDD NEEDS to have a bow. Swapping weapons is one of the very first and most important skills you learn. What a bow does for you is it allows you to choose where a certain battle will take place, rather than let the enemy do it. You can lure a group of enemies to a door to fight them 2 at a time instead of 10 at once. And if the AI has been enhanced, you can use a bow to pull enemies away from the pack and kill them 1 by 1 instead of all together. You can also use a bow to lure enemies into traps that you set. No character EVER should live without a bow, even a mage, although they normally use a crossbow. Generally bows are better because they have more than 1 attack per round, whereas crossbows normally have only 1, and you’re not going to take Rapid Reload with a mage, are you? But most mages don't have bow proficiencies, so they stick to the crossbow more for the lack of options than by choice.<br/>\n<br/>\n 3- USE CONSUMABLES! Especially early on, buffing with potions, scrolls and even miscellaneous items is a VITAL skill to learn with a melee toon, and some toons have use for this skill even in the high epic levels! My level 40 Champion of the Wilderness still drinks his Cat’s Grace, Aid and Bless potions before he shifts into Dragon Shape! I would go as far as to say that it’s better to have many items to buff with than it is to have a powerful armor, for example. Because if you can buff yourself properly, you can use the buffs to acquire better gear killing bosses. If you have an item, you’ll still fail the quest if you can’t hit the boss. Buy potions, don’t be afraid to blow your gold. As a general rule, it’s better to be broke, alive and ready for the next adventure than it is to be rich and dead. Here are a few items you should consider not only keeping if you find them, but also buying if you can:<br/>\n<br/>\n - Potions: Bless, Aid, Barkskin, Bull’s Strength, Cat’s Grace, Owl’s Wisdom, Endurance, Invisibility, etc.<br/>\n<br/>\n - Scrolls: Remove Blindness, Improved Invisibility, Stoneskin, Flame Weapon, Mage Armor, Shield, True Strike. Whatever you find, if it’s useful, keep it. The only scrolls that you can sell without a heavy conscience are the ones of spells that require a save, but even those can be used in desperate situations. There is always a chance of autofail!<br/>\n<br/>\n - Miscellaneous Items: Brooch of Shielding (makes you immune to Magic Missiles even if your Deflection modifier is higher than +4), Rod of the Ghost (gives mild DR and Concealment bonuses. Could be useful), Scabbard of Blessing, Ioun Stones, Dusts of Disappearance etc.. Some of these you might even consider having more than 1 in your inventory. Having them will not kill you, but not having them can, so the more the merrier!<br/>\n<br/>\n 4- KEEP SITUATIONAL ITEMS! One of the most common mistakes that novice players make is that they sell TOO MUCH loot. They don’t think they’ll need an item, sell it, and then die because they didn’t have the item. Yes, I know you are used to playing with your +10 Strength belt against Mephistopheles and just destroying him, but in challenging environments, having the right gear on is more important than numbers in your character sheet. Sometimes, the only way to kill a certain mage boss is to be immune to Death Spells with some toons. If your fortitude is low, that mage WILL KILL YOU every time, and if you buff with Death Ward, they will dispel you. They can’t dispel a Belt of Guiding Light. You may like your Strength belt, but it’s a Mage, so you don’t need that much AB to hit them and it’s more important to not be killed than it is to do damage, because you need to be alive to do damage. If you’re dead, all the STR in the world will be worthless! Here’s a list of very important situational items that you need to have in your inventory and equip in certain situations:<br/>\n<br/>\n - Death Immunity items<br/>\n<br/>\n - Freedom items<br/>\n<br/>\n - Elemental Damage Resistance (Fire, Cold, Acid, Sonic, Electric) items<br/>\n<br/>\n - Physical Damage Resistance (Bludgeoning, Slashing, Piercing) items<br/>\n<br/>\n - Skill-enhancing items (Search to find Secret Doors, Persuade to get certain quests, Lore to ID items, Thieves’ Tools to open locks, etc..)<br/>\n<br/>\n - Ability-enhancing items (mostly for your casting stat if you are a Paladin, Ranger or Battle Cleric, but also for Open Lock attempts where you need a couple of extra points you can put on some DEX gear, etc.). About your casting stat, let me tell you what I do with my paladins, for example. As you know they have VERY FEW spells per day, so they need to strive to make the most out of their spellbooks and the best way to do so is to have Wisdom gear as backup. You equip it before you rest, memorize long-term buffs such as Extended Bless, Extended Aid, GMW, Death Ward and Freedom with the extra spell slots that you gain from the Wisdom increase. Then you rest, buff up, and swap back to your battle gear. You’ll still need to have Bless and Aid potions, but for as long as you can stay without getting dispelled, you’ll be much stronger. I do this for ALL my fighter/caster toons. And I have MANY!<br/>\n<br/>\n - Equippable items with miscellaneous properties, such as a ring of Flesh to Stone should be kept. You never know when you’ll need to unstone a friend.<br/>\n<br/>\n - Rods of damage spells such as the Rod of Thunder and Lightning. It may not seem very useful for a fighter to keep such item, but if you have UMD, keep it. One day, it may come in handy, and if it doesn’t, well, it didn’t hurt to have it as an option anyway!<br/>\n<br/>\n 5- LEARN THE ATTACK SCHEDULE FOR EACH OF YOUR TOONS! This is a bit more advanced, and as of now we are delving deeper into NWN plays, so it’ll get more and more complex. So, what’s an attack schedule? Each round is divided in 3 flurries of 2 seconds each and attacks are divided evenly among them (or at least as evenly as possible). As you progress in levels and gain new attacks, they will be added to the subsequent flurry that has the fewer attacks. Here is how it works:<br/>\n<br/>\n 1 attack: 1-0-0 (that’s why your level 1-5 toon attacks once and then seems to stand in front of the enemy forever before he attacks again, he’s actually waiting for the other two flurries to end)<br/>\n 2 attacks: 1-1-0<br/>\n 3 attacks: 1-1-1<br/>\n 4 attacks: 2-1-1<br/>\n 5 attacks: 2-2-1<br/>\n 6 attacks: 2-2-2<br/>\n 7 attacks: 3-2-2<br/>\n 8 attacks: 3-3-2<br/>\n 9 attacks: 3-3-3<br/>\n 10 attacks: 4-3-3<br/>\n 11 attacks: 4-4-3<br/>\n 12 attacks: 4-4-4<br/>\n<br/>\n Recently, my Xanos Messarmos build had 21 AB at a certain point, which was a good number for his level, but he was really weak because despite the high-ish number, he only had two attacks per round, and that made him quite gimpy because he couldn’t take advantage of Knockdown much. Yes, he took advantage of the part where he didn’t get damaged, but then after he successfully KDed an opponent, he only had one extra attack to apply the bonus of attacking a prone target on. Then Xanos gained one level and became quite the beast, because he simultaneously gained a BAB point, RDD 10 boni (+4 STR, +2 CHA +1 Natural AC, Fire and Sleep immunity) AND the third attack per round. So now he can dish out a lot of damage because once he KDs someone he still has two attacks to hit them while they’re prone, with a Greatsword and 34 STR (at lvl 16 lol) and soon he’ll be even more efficient when he gets Haste and Tenser’s Transformation to complement his melee prowess.<br/>\n<br/>\n So, why is this important? Because if you know your attack schedule, you can use your combat feats more efficiently. Here’s how:<br/>\n<br/>\n - Only attempt KDs on the first two attacks. If you are a typical meleer, you should have 4 attacks per round after level 16. That means a 2-1-1 schedule. So your first two attacks are generally your highest AB attacks. However, if you are Hasted, you gain an extra attack, which then pushes your lowest attack into the second flurry (2-2-1). The last 1 is the Haste attack, because the game resolves all normal attacks first and then resolves extra attacks. So then you can attempt KDs on the first two attacks of each round (twice on the first flurry) and on the last one as well (once in the third flurry). Same goes for Disarm attempts, Called Shots.<br/>\n<br/>\n - Activating a combat mode such as Expertise only resolves after the current round is over, so there is no such thing as a last-minute expertise to save your ass. If you click on expertise too late, it will only start on the following round, and if you click too early, you’ll still need to wait until the next round for it to take effect.<br/>\n<br/>\n - Casting spells IN THE MIDDLE OF A ROUND (first or second flurry) will cause your character to STOP ATTACKING FOR THE REMAINDER OF THE ROUND AND BECOME FLAT-FOOTED. For non-Uncanny-Dodge DEX casters, this means certain death. Only cast a spell when you are in melee range when your character has begun to dish out the attacks of the last flurry in each round. Easier if you have few attacks per round, more challenging if you have more attacks per round. I got really good at this playing my 8-str Cleric / Monks. I time my spells perfectly nowadays just because I always know which flurry I’m on. The times I don’t pay attention it’s because the combat is too easy, as in those situations anything will work and there is no risk involved. But against a tough opponent, a mistake normally means death, so keeping track of the flurries WILL SAVE YOUR LIFE!<br/>\n<br/>\n 6- KNOW WHICH SPELLS TO CAST IN WHICH SITUATION! So, you think that because you are a Wizard with ESF: Necromancy, you should only use Necromancy spells? That’s not how it works! Sometimes you’ll get a MUCH BETTER result with another spell from another school. ESF: Necromancy adds 6 to DCs of Necromancy spells, but the difference between an enemy’s weak save and his strong save can be potentially higher, so you need to consider not only your focus, but what is likely the weak save for that enemy type. For example: You are a caster Cleric with ESF: Evocation and you’re fighting a group of Meleers. Which of the three spells do you use? Implosion, Storm of Vengeance or Hammer of the Gods?<br/>\n<br/>\n Well, one thing is for sure. It’s NOT Implosion! You may even implode a couple of them, but the area of effect of the spell is not so large and Fortitude is their strong save, so in this case Hammer of the Gods or Storm of Vengeance are the best spells to use here. SoV is an option because of the large area and because these melee enemies will likely have a low DEX score, and therefore a low Reflex save. Hammer of the gods also attacks one of their likely weak saves: Will. Although it’s a level 4 spell, it’s evocation, so your ESF adds +6 to the DC, so it’s like a level 10 spell of another school (basically, better than SoV by 1 point). Either spell is fine, Implosion, the highest-level one in which you have a focus, is not. There are better situations for your implosions; save them for those.<br/>\n<br/>\n 7- THE TAUNT / EXPERTISE COMBO: I know I said I wasn’t going to get too specific, but this combo was my discovery, or at least I was the first one to mention it in the ECB forums, so I’m going to talk about it. Taunting is an action during which you become flat-footed. Being flat-footed means your Dodge AC goes away, as well as your DEX AC unless you have Uncanny Dodge. But, for a typical meleer, that’s not an issue, as they generally have low Dodge AC and a lowish DEX score as well. However, if you are a Paladin and you think that casting a Divine Shield will save your ass when you’re taunting, it won’t. It’s a waste of rounds as Divine Shield gives Dodge AC, and the flat-footed state denies all Dodge modifiers.<br/>\n<br/>\n Alternatively, if you attempt a Taunt while fighting in Expertise, you can have 5 AC FOR FREE while doing it, because since Expertise AC is not Dodge, it still applies! Same goes for Improved Expertise for +10 AC (my Valen Shadowbreath build has this combo hehe)! But, there is a catch! The combo is tricky to learn to use properly, and it will require quick-thinking and fast-clicking. Unlike spells, which automatically cancel the current attack action and replace it with the spell cast, the attack action takes precedence over the Taunt action, so in order to Taunt an enemy after being engaged in combat (only way to be in Expertise is if you are fighting), you’ll need to MANUALLY CANCEL the attack action. Here’s how it works:<br/>\n<br/>\n You attack your target with Expertise on, then select Taunt and click on the target. Once you have selected Taunt and clicked on the target, on the action queue at the top left of your screen, you’ll see a sword icon (that indicates you’re fighting) and to the right of it the Taunt icon (ready to take effect as soon as the combat action is over). You then click on the sword icon to stop attacking and your toon will immediately begin Taunting. If you click to attack again, it will cancel the Taunt action and will resume fighting, so wait until the Taunt resolves and then you’ll get a message saying: “Taunt: Success” and right afterwards “Expertise Mode Deactivated”. This means that for the whole duration of the Taunt, Expertise mode was up; it only stopped working when the Taunt was resolved. But, when your toon finishes Taunting, he/she will stop attacking, so you’ll need to re-engage the opponent by attacking them again. The faster you can do this, the more efficient you’ll be in combat!<br/>\n<br/>\n However, if you successfully Taunt your opponent and you have Expertise as well, you get to choose how you want to fight them. If you’re getting hit a lot, you may want to continue fighting in Expertise mode for +1 AB and +5 AC or if not you may want to just get the full Taunt bonus of +6 AB (provided that your Taunt roll was 6 units higher than your opponent’s Concentration check, which for some enemy types, will ALWAYS work, for others, not necessarily). This combo gives you the option to just get a much higher chance of hitting or a higher AC and a mild AB increase.<br/>\n<br/>\n So, all you need to do is to be able to “Activate Expertise”, “Attack”, “Taunt”, “Select Target”, “Stop Attacking”, “Wait for Resolution”, “Resume Attacking” (or “Re-activate Expertise” and “Resume Attacking”) in under 3 seconds lol. Can you do it? It takes practice, but it’s doable, trust me!<br/>\n<br/>\n - The CHEESY use of Taunt. I unfortunately discovered something that is likely a bug or at least an implementation problem of the D&amp;D rules for a PC game. But to be honest this is not cheesier than watching an enemy suicide into a mage’s damage shields, so I guess I just need to live with the fact that NWN is an old game and the AI is kind of dumb and some things just can’t be solved. Here’s the trick:<br/>\n<br/>\n Remember I told you that if you select attack in the middle of a Taunt action, it will get cancelled? Well, what I didn’t tell you was that if you do that, THE NEXT TIME YOU ATTEMPT TO TAUNT AN ENEMY, THE TAUNT WILL RESOLVE INSTANTLY! So, you can use that to your advantage. If you have a tough fight ahead of you, you can start taunting a near-dead easy minion and attack him before the Taunt finishes, killing him, then when the tough enemy comes, directly Taunt him and you’ll instantly get the message of Success or Failure. Being flat-footed against a tough enemy is not desirable, so this can be very useful. Cheesy, but effective! LOL<br/>\n<br/>\n 8- IF YOU’RE A TRAP-SETTER, USE THE PROPER TECHNIQUE FOR SETTING TRAPS! If you use traps, and set them one in each spot, you’re doing it wrong. That approach gives the enemy time to heal. You don’t want them to heal, you want them to die! So in order to achieve this, you’ll need to master a technique for laying the GREEN CARPET OF DEATH! First, move as far away as you can from the spot where you want to set the traps, but without moving out of range. You can check this by clicking on a trap and seeing if the cursor is GOLDEN (in range) or GRAY (out of range). Adjust your range accordingly and move to the next step. The next step is to organize your traps in your inventory (you should have them in bags, so get them out and put them on an empty inventory tab so they are easily accessible). In few cases you may be able to set more than one tab full of traps, but mostly one tab should be enough. After your traps are all in place in your inventory, you do 3 things with the objective of reducing your movement speed to buy you precious time to set more traps on the same spot: Activate Stealth Mode, Activate Detect Mode, and if necessary, MAKE YOURSELF HEAVILY ENCUMBERED! Have a couple of full plates on a Bag of Holding for that sole purpose. Then take a deep breath and start clicking like a maniac on each trap and selecting the same target for all of them. That spot will become unavailable for new traps as soon as you are done setting the first trap, so you have until then to set as many traps as you manage to on that area. While your toon is slowly moving to the target, you’re clicking on new traps and targeting them until all have been selected or if you aren’t fast enough until the first trap is set. I’ve been able to set 15 traps on the same spot. Then, the final touch is to snipe the most powerful enemy of the place and running back to the other side of the carpet. When the enemy steps on the trap, they will instantly drop dead!<br/>\n<br/>\n As I said, I don’t want to get too specific, so I will not go any deeper, but there are many other good techniques that you can add to your book. Using Animal Empathy, Summon Creature and Animal Companion to create your own little low-level army to get past those TOUGH low-levels for a Druid. The use of Darkness as the poor man’s HiPS, or just to avoid being seen by many enemies at once, or to apply Sneak Attack damage to your attacks. Using Evard’s Black Tentacles and summons to bait enemy casters into wasting dispels before showing yourself to them. Using Damage Shields / Epic Warding (and Shapechange Iron Golem if you need to be immune to Criticals) to kill hard-hitting high-level bosses, approaching invisible, killing the caster, then going invisible again to avoid getting swarmed on, then pull enemies one by one, etc.. These are just a few other examples of things that you should learn how to do if you don’t already know. And each build has some unique cool features that you can learn to apply in-game. The possibilities are endless!<br/>\n<br/>\n I hope this article gives you a glimpse of what a good NWN player is and what you need to do to become one. I find the fact that this game allows such intricate techniques to be fascinating, and I hope you do too. Thanks for reading. I hope you find this information useful!<br/>\n<br/>\n Take it EZ!</div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "8:20 AM - Feb 16, 2015",
      "content": "<div>Thanks!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:52 AM - Feb 17, 2015",
      "content": "<div>Very insightful, well done!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:01 PM - Feb 17, 2015",
      "content": "<div>Very good!  I am a veteran player, but I still learn new things here.<br/>\n<br/>\n If I can suggest one more paragraph, it would be something about the power of stealth, especially combined with HIPS or  Invisibility spells and potions. A related theme is the (ab)use of the Darkness spell when you have True seeing or Ultravision.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:56 PM - Feb 17, 2015",
      "content": "<div><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>Very good! I am a veteran player, but I still learn new things here.<br/>\n<br/>\n If I can suggest one more paragraph, it would be something about the power of stealth, especially combined with HIPS or Invisibility spells and potions. A related theme is the (ab)use of the Darkness spell when you have True seeing or Ultravision.</div></blockquote>\n<div align=\"left\">Thanks, Mick, Val and Theo!<br/>\n<br/>\n You know, funny you say that. I just asked my friend Black Cobra, who likes to play stealthers more than I do (I'm more about the raw power than the tactical advantage, or maybe I like to have both lol) to write something about Stealther playing to complement this. I have played them, but by no means extensively, so I thought someone else should do it. Why don't you? I know you are a Rogue-Assassin-SD guy (like that Cleric 8 Monk 2 Assassin 30 build you made: \"I don't fight, I kill!\") Feel free to add it on! We can do this two ways: you can just type it here as a reply or you can PM me the text and I'll add it to the OP with credits to you, of course. Your call, bro! But I did mention the Darkness thing in the final paragraph, although not extensively.<br/>\n<br/>\n Take it EZ!</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:17 PM - Mar 16, 2016",
      "content": "<div>Your trap comments for the most part are spot-on, Max.  The only warning about the thick-stack technique is that it can be economically-unsound unless you know what to stack.  I have full details in my trapper guide but, in a nutshell, only the pure damage types stack economically.  That means if you stack 6 deadly fire traps and only 4 are needed to kill an enemy (or tightly packed mob), your toon just wasted 2 of them, so understanding the resistances, saves and total HP range of the enemy is just as important as the best location to set them.   Unless you have unlimited resources, trapping can become expensive.  Yes, even crafting ones that use many components per trap is not cheap.  The \"other\" traps, those with secondary effects like stun or slow, are poorly-suited for layered, homogeneous stacking because only one trap of the stack need trip to cause that effect and the other effects are wasted.  Tangle traps, sonics, frost, negative are a few of these.  Also, a minor fire trap stack, 10-thick is nowhere as effective in practice as a single deadly due to the difference in DC. <br/>\n<br/>\n But IMO the single-most important factor in building a toon that matches one's own playstyle is familiarity.  Perhaps \"orientation\" would be a better word.  Before spending time developing what appears to be a kick-ass build on paper, learn the environment.  Sometimes a player can get an accurate snapshot by simply reading discussions what others have documented about their own experience playing on a server (or through a module) but don't count on it.  Playstyles vary greatly so what worked well for one player may not feel comfortable or be efficient for another.  Having fun shouldn't need to be work and concentration retraining your own tendencies. For that reason, I recommend highly to make one basic, all-purpose, defensive toon, nothing pretty just sound, to sample the new world.  I recommend throwing a level or 2 of rogue into any introductory build.  Your \"learner\" should be able to understand the biases designed into the content, the method of encounters, CR scaling, important skills, etc. within less than 10 levels on most servers (Level 8 always seemed a convenient level for me to start planning in earnest).  After the orientation period, then start to consider your own \"ideal\" build to cope with the new challenges layed before you.<br/>\n<br/>\n I'm a long-term server-hopper from over 10 years of partying and soloing on most of the popular PWs with diverse magic enhancement levels (well, at the time they were popular but many have faded into oblivion as support ebbed) and it can become a daunting task to adjust to all the new customizations on-the-fly.  So, take it from one who has already traveled that path many times... save yourself the toon rebuilding time and effort and learn what makes the new world tick before setting your watch.  Hope this advice helps to streamline your gaming experience. ;)<br/>\n<br/>\n Game on!</div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "11:30 AM - Apr 16, 2018",
      "content": "<div>Thank you very much for this one, too.<br/>\n<br/>\nOn my way to become a \"better\" player, I will keep this guide in mind.</div>"
    },
    {
      "author": "JodieBarton",
      "avatar": "no_avatar.png",
      "timestamp": "11:39 AM - Nov 16, 2018",
      "content": "<div>Cool! <span class=\"text-emoji\">👍</span></div>"
    }
  ]
}