{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "229",
  "name": "The Plight of Smite: Smite Evil Variants",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-plight-of-smite-smite-evil-variants-t2303707.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:17 PM - Dec 18, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Why Smite?  \n<ul><li>An AB bonus that does not count towards the AB cap.  [/*:m]</li>\n<li>Opportunity for overwhelming damage via Great Smiting that will penetrate the highest DR barrier.  [/*:m]</li>\n<li>Potential for one-hit kills without saves (ala DevCrit).[/*:m]</li></ul>[/list]<br/>\nWhy not Smite?  \n<ul><li>Alignment-specific benefits.  [/*:m]</li>\n<li>Requires careful descretion to become a reliable attack.  [/*:m]</li>\n<li>Limited to 3 attacks per day maximum.[/*:m]</li></ul>[/list]<br/>\nSample Builds<br/>\n<br/>\nFirst, a template for achieving the highest possible damage with a single hit, White Knight of Smackdown.  Though it can be played successfully it is extremely difficult to level under normal circumstances, requiring party support most of the way.<br/>\n<br/>\nIn parallel, a more playable smite build, the Punic Champion... a design that has been derived from the damage template.<br/>\n<br/>\nFinally, as an example of how diverse the smiting focus can become, the Draconic Smiter.  Though the damage potential has been severely attenuated, the major weaknesses of the previous builds, specifically AC and standing HPs, are resolved independently of items you may find or forge.  <br/>\n<br/>\nNow, on to the builds themselves... <br/>\n<br/>\n<strong>White Knight of Smackdown (Pal 13/CoT 22/WM 5)</strong><br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tTemplate for Optimum Smite Damage<br/>\n<br/>\nThis build was intended to focus on a single aspect of smiting.... damage potential.  The other component, independent AB bonus, can greatly enhance the capacity to hit high-AC evil opponents.  Attaining lofty AB levels is not the focus of this submission, however.<br/>\n<br/>\nOrigins<br/>\n<br/>\nThe quest for the highest possible smite damage originated in the former ECB, almost 10 years ago.  While investigating whether the ceiling had been reached in the available builds, the general methodology was revealed.  Therefore, I decided to create my own template, incorporating many of the designs that had already been devised, to discover the optimal split.  Ignoring every possible playability consideration... the ultimate Smite crit potential build began to take shape.<br/>\n<br/>\nMaximum damage per hit vs. maximum damage per round. \"Per hit\" focuses on penetrating through DR while \"per round\" dwells more on dealing high percentage of crits.  In Pal/CoT/WM, the difference comes down to WM 5 vs. WM 7.  The additional 2 levels of WM cost 2 smite (10 on crit) toward the maximum damage per hit, but vastly extends the crit possibilities in a round (See the Punic Champion for an example of this principle).  For scythe, Ki Critical approximately doubles the proportion of crits.<br/>\n<br/>\nTBH, the Smite Evil attack itself seems handicapped by its nature, at least for PvP.  All the opponent needs to do to foil any smiter is build a neutral toon (or creature) and all smite attempts are negated.  Versus assassins and blackguards, it can be especially effective but worthless against all other classes that adjust alignment accordingly.  Smite can be useful against undead and other evil crit-immunes.  Drow and driders are a few suitable targets to practice on.  A player committing to use smite (good or evil) as a primary attack is forced to learn the alignments of all the creatures to make smiting useful.  Even if the default alignments are memorized, many environments radically adjust creature characteristics, so it could potentially become a never-ending experiment.  There is some merit to be gained, though, as the party member who excels in destroying evil bosses quickly.  <br/>\n<br/>\nFor those of you who revel in seeing those huge damage numbers go flying off the screen and the screams of agony from the force of your oppressive blow, here is my own version of the ultimate damage smiter.  Most high-smite builds are similar and mine is no exception, merely optimized for damage the best I know how to do. My intent was to provide an example of just how much damage can be accrued with a barely playable design, portrayed clearly enough to be used as a starting point for your own builds that focus on Smite Evil. In this build, each Great Smite selected enables an additional 35 damage (175 on crit).  So get out your pencil and eraser!<br/>\n<br/>\nAt the end of the analysis I have proposed a few easy adjustments that will immediately increase playability by yielding some of the damage exploitation.  <br/>\n<br/>\nPROs/CONs - Not applicable.  This is a template build.  Check the Analysis and then use at your own risk.<br/>\n<br/>\n<strong>Paladin(13), Champion of Torm(22), Weapon Master(5), Elf, LG only</strong><br/>\n<br/>\nSTR: 13<br/>\nDEX: 13<br/>\nCON: 6<br/>\nWIS: 12 (13)<br/>\nINT: 13<br/>\nCHA: 17 (28)<br/>\n<br/>\n01: Pal01 - Weapon Prof Exotic<br/>\n02: Pal02<br/>\n<strong>03</strong>: Pal03 - Weapon Focus: Scythe<br/>\n04: Pal04 - CHA+1 (18)<br/>\n05: Pal05<br/>\n<strong>06</strong>: Pal06 - Dodge<br/>\n07: Pal07<br/>\n08: CoT01 - CHA+1 (19)<br/>\n<strong>09</strong>: CoT02 - Expertise, Power Attack<br/>\n10: CoT03<br/>\n11: CoT04 - Mobility<br/>\n<strong>12</strong>: Pal08 - CHA+1 (20), Divine Might<br/>\n13: CoT05<br/>\n14: CoT06 - Imp Power Attack<br/>\n<strong>15</strong>: CoT07 - Spring Attack<br/>\n16: Pal09 - CHA+1 (21)<br/>\n17: Pal10<br/>\n<strong>18</strong>: Pal11 - Whirlwind Attack<br/>\n19: Pal12<br/>\n20: WM01 - CHA+1 (22), WoC: Scythe <br/>\n<strong>21</strong>: WM02 - Grt CHA I (23)<br/>\n22: WM03<br/>\n23: WM04<br/>\n<strong>24</strong>: WM05 - CHA+1 (24), Grt CHA II (25)<br/>\n25: CoT08 - Great Smite I<br/>\n26: CoT09<br/>\n<strong>27</strong>: CoT10 - Great Smite II, Great Smite III<br/>\n28: CoT11 - CHA+1 (26)<br/>\n29: CoT12<br/>\n<strong>30</strong>: CoT13 - Great Smite IV<br/>\n31: CoT14 - Great Smite V<br/>\n32: CoT15 - CHA+1 (27)<br/>\n<strong>33</strong>: CoT16 - Great Smite VI<br/>\n34: CoT17<br/>\n35: CoT18 - Great Smite VII<br/>\n<strong>36</strong>: CoT19 - CHA+1 (28), Great Smite VIII<br/>\n37: CoT20<br/>\n38: CoT21<br/>\n<strong>39</strong>: CoT22 - Great Smite IX, Great Smite X<br/>\n40: Pal13 - WIS+1 (13)<br/>\n<br/>\nHP: 320<br/>\nSaves (F/W/R): 41/37/42 (45/42/46 buffed vs. evil)<br/>\nOther save boni: Mind Effects: +2<br/>\nBAB: 30<br/>\nAB (max, naked): 33 (melee), 31 (ranged)<br/>\nAC (naked/mundane armor/shield only): 14/25<br/>\n<br/>\nSKILLS (129) - Discipline 43(44), Heal 5(6), Intimidate 4(13), Taunt 43(52), Tumble 15(16) [20(21) w/o Taunt]<br/>\n<br/>\n<strong>ANALYSIS</strong><br/>\n<br/>\nRace<br/>\nOnly Elf will enable qualifying both for Weapon Master and Great Smite X.  Halfling would work in the split as well, but be unable to hold a scythe.<br/>\n<br/>\nClass Split<br/>\nThe CoT's Divine Wrath enhancement of +9 and 15/+3 DR was chosen as a metric.  WM 5 needed for crit multiplier.  WM 7 would make crits easier to come by, but a drain on per hit damage as the lost 2 levels of either CoT or pally towards smite.  Pally 13 was thrown in as a Taunt dump and one more buffing caster level.<br/>\n<br/>\nAbility Spread<br/>\nYes, I know...  lots and lots of odd abilities staring back to beguile analysis.  Trust me. There is no other way (unless you happen to uncover your own brand of tricks... I am all ears... errr, eyes).  I opted to forego the Level 4 pally spells to retain as much benefit from CHA as possible.  The value of Holy Sword is suspect anyway (see the Remarks section towards the end of the article) and I prefer not to rely too heavily on buffs that are both short in duration and easily dispelled.  One more buff only adds to the overhead (buffing itself absorbs too much time if not hasted).<br/>\n<br/>\nFeats<br/>\nPretty straight-forward really.  Qualify for CoT at BAB +7, gain the WM crit multiplier before epic levels and incorporate as many damage-boosting feats as possible, Divine Might &amp; Imp Power Attack in particular.  Epic levels are even easier to schedule.  Insert enough Great CHA to qualify for all Great Smiting feats.  The goal of Great Smiting X forces the build to become AB feat-starved in epic levels (no EWF or EP) even with the CoT bonus each 3 levels.<br/>\n<br/>\nSkills<br/>\nTaunt has great potential in a high-CHA melee build.  Otherwise, the rest should be self-explanatory.  Spellcraft is not essential with the intrinsic saves of 22 CoT levels (cast Resistance, Prayer &amp; Protect from Alignment if you feel a boost is needed).<br/>\n<br/>\n<strong>CRUNCH</strong><br/>\n<br/>\n- Normal (non-smite) attack ignored for this evaluation<br/>\n<br/>\nBuffs: Bull's Strength, Eagle's Splendor, Aura of Glory, Aid, Bless, Deafening Clang, Divine Favor, Divine Might*, Divine Wrath*, Greater Magic Weapon, Prayer; Imp Power Attack mode; mundane scythe (unless otherwise specified)<br/>\n<br/>\n*Effects cannot be dispelled<br/>\n<br/>\nSmite AB<br/>\nIPA mode: 57, 62 (w/ability caps), 64 (w/+20 scythe)<br/>\nNormal mode: 67, 72 (w/ability caps), 74 (w/+20 scythe)<br/>\n<br/>\nDamage (per smite), mundane scythe (+20 weapon example also provided)\n<div class=\"codebox\"><p>Code: <a href=\"#\">Select all</a></p><pre><code>Smite \nBase weapon ............ 2-8 phys\n2H STR modifier .......... 6 phys, 10 phys (w/ability caps)\nEnhancement effect ....... 4 phys (GMW +4), 20 phys (w/+20 scythe)\nDivine Might ............ 13 divine, 15 divine (w/ability caps)\nDivine Wrath ............. 9 divine\nDivine Favor ............. 4 magic\nDeafening Clang .......... 3 sonic\nPrayer ................... 1 slash\nImp Power Attack ........ 10 phys\nSmite damage ........... 385 phys\nTotal .............. 437-443, 443-449 (w/ability caps), 459-465 (w/+20 scythe)\n\nSmite Crit (x5)\nBase weapon .......... 10-40 phys\n2H STR modifier ......... 30 phys, 50 phys (w/ability caps)\nEnhancement effect ...... 20 phys (GMW +4), 100 phys (w/+20 scythe)\nDivine Might ............ 65 divine, 75 divine (w/ability caps)\nDivine Wrath ............ 45 divine\nDivine Favor ............ 20 magic\nDeafening Clang ......... 15 sonic\nPrayer ................... 5 slash\nImp Power Attack ........ 50 phys\nSmite damage .......... 1925 phys\nTotal ............ 2185-2215, 2215-2245 (w/ability caps), 2295-2325 (w/+20 scythe)\n</code></pre></div>\nSimilar ECB Class Splits<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build224308.html\" rel=\"noreferrer\" target=\"_blank\">jockeb's Scyther (PAL 9/CoT 24/WM 7)</a>  Probably untested.  More of an all-purpose scyther than a smiter IMO.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build117655.html\" rel=\"noreferrer\" target=\"_blank\">Sezaru Smiter (PAL 13/CoT 22/WM 5)</a>  Untested.  Though it claims to reach Great Smiting X, it can't as designed.  Great Smiting cannot be taken on the same level where the CHA prereq is reached by a feat (re: Level 24).<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build243505.html\" rel=\"noreferrer\" target=\"_blank\">Kail's Holy Reaper (PAL 15/CoT 18/WM 7)</a>  Good damage.  Good build all around and much more playable than my demo.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build117582.html\" rel=\"noreferrer\" target=\"_blank\">cdualepp's uber-damage Smiter (PAL 17/CoT 18/WM 5)</a>  Very similar to my demo but with less damage  .<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build117703.html\" rel=\"noreferrer\" target=\"_blank\">Gray the Grayte's Holy Avenger Warrior (PAL 13/WM 7/CoT 20)</a> This is heading the right direction for an uber-smiter but definitely a broken build.  Should be totally reworked before it can analyzed or tested.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build186693.html\" rel=\"noreferrer\" target=\"_blank\">GoVols's The Smiting Knight of Vor (Paladin23/WM7/COT10)</a>  Similar concept but with scimi and only Great Smiting VIII.  Scythe requires that extra feat early on when things are tight qualifying for WM.  Inserting more CoT would remedy that problem while providing some sweet damage and other boni from Divine Wrath which gets a boost every 5 CoT levels.<br/>\n<br/>\n<strong>REMARKS</strong><br/>\n<br/>\nRelative Investment to Reach Level 4 Pally Spells (in this build)<br/>\nThe only additional spell that would factor into the damage potential is Holy Sword, at the cost of -1 CHA modifier plus 1 CoT bonus feat in trade for 14 WIS and 2 more levels of pally.  The HS spell would provide a potential of 5-30 (17 avg) divine on a crit vs. evil.  IPA (the lost feat) would provide a flat 25 more physical on crit over the standard power attack effect, for a net damage gain of 8 (25-17) over the HS damage.  The HS's +5 weapon enhancement is slightly better than the +4 GMW weapon enhancement but the relative duration is only 5% as long as GMW's.  The +1 difference gains +1AB and +5 damage on a crit.  They do not stack with any other weapon enhancement buffs.<br/>\n<br/>\nThe HS dispel property (if that is a consideration)...  is insignificant in most cases since v1.69.  It attempts a dispel on half the hits.  Holy Avenger property dispel DC = 21-30 (i.e. d20+10),  1 thru 4 rolls will always miss (vs. 14, lowest potion caster lvl, or \"2\"), as well as missing on rolls against any caster buff of 19 or higher.  It's main utility would end up being used to dispel buffs of other fighter types who are using potions or general use items, typically spell effects with extremely low caster levels.  Also, net damage (the amount passing DR effects) must be greater than 0 or even a successful dispel check won't dispel anything.  On pre-epic servers where caster levels are relatively low, the corresponding HA DC may prove effective, but this is not a pre-epic build.<br/>\n<br/>\nSmite AB<br/>\nThe AB bonus from smite evil more than cancels out the penalty from IPA.  However, if a player anticipates that the target will have an abnormally high AC rating, it may be beneficial to yield the additional 10 damage (50 on crit) for the +10 AB advantage.  The smite AB bonus is one of the few AB enhancements that do NOT count towards the +20 cap. In this build, the smite AB can reach 67 (buffed), 72 (w/ability caps) and 74 (w/ability caps &amp; +20 weapon) without turning the IPA mode on.<br/>\n<br/>\nPaladin vs. CoT split in CHA-loaded build<br/>\nPally spell buffs are quite secondary to the boosts from Divine Wrath and Divine Might, neither of which can be dispelled.  CoT's bonus feats and Sacred Defense bonus to saves overwhelms the durations and dispellability issue characteristic of using too few levels of paladin (<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "9:08 PM - Dec 18, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hip,<br/>\nYou missed a great many builds in your search, including but not limited to: GS X smite paladins, including: GrimSmiter paladin 26 / fighter 4 / champion of Torm 10 (human) by Grimnir77 and my Knight Commander -Revised) paladin 26 / fighter 4 / champion of Torm 10 (human) by TyrTemplar, which was revised for NWN2/ECB (renamed the Sword of Tyr (Celestial Smiter), since revised once again for NWN1 in light of the patch, here:  <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/sword-of-tyr-celestial-smiter-pal26-cot10-ftr4-t2294174.html\" rel=\"noreferrer\" target=\"_blank\">sword-of-tyr-celestial-smiter-pal26-cot10-ftr4-t2294174.html</a> (GS X, Naked AB 40 (melee), 400 HPs), as well as my Divine Blade (Medieval Enforcer), Pal 4/WM 22/Fighter 14 <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/medieval-enforcer-divine-blade-pal4-ftr14-wm22-t2294650.html\" rel=\"noreferrer\" target=\"_blank\">medieval-enforcer-divine-blade-pal4-ftr14-wm22-t2294650.html</a> being a revision of my earlier Medieval Enforcer paladin 5 / fighter 10 / weapon master 25 (human) by TyrTemplar (goes strength and epic WM as opposed to the charisma path thus a melee (military paladin, not a smiter), just enough for DS/DM, though, so as to be different). Darn Search engine; sometimes I've no idea why but stuff sometimes just don't come up! <br/>\n<br/>\nAs a concept build, yours are interesting and harken back to CD's build (scythe-winder, smiting Elf) and I like yours as a concept quite a lot. Those numbers are pretty awesome, but as a build, in terms of playability suffers from many issues, namely, feat starved, no HPs and no AB (you are reliant on buffs that are not only mordable, but also dispellable. In turn meaning, your AB is 33, +10 Smite: 43. Even with Div.Wrath (at 22 CoT, that's +11) it's only 54 Smite AB for a number of rounds once per day, which isn't bad but with no KD and only 3 smites to deliver. Buffs on top of that are nice, but wouldn't be PvP'ing it. When reliant on buffs, 24 caster levels is a must (want to be bullet proof against dispel; always Mord's yes, which in PvP you can bank on as well). Also, being \"immune\" to a dev.crit in terms of making your fort save v insta-death is super (YAHHH!), but doesn't protect you from the damage of the underlying crit itself and with so few HPs ...   Paladins are not clerics, Hip. They're warriors. Should have AB and HPs apart from smite only (not everything is evil in PvM/E and most things in PvP actually go out of their way to be non-evil so as to avoid smite), and shouldn't tremble at the thought of Mord's much less ordinary greater Dispelling/Dispel. Also, a sneaky BG or evil assassin with ED gets first strike, all your AC goes out the window (DS is dodge), and with low  HPs! Meantime, with ED they're guaranteed to roll first successful hit of the round (which may not be the first smite). Then, there's KD, etc..(most evil aren't just standing around making it easy for you to smite 'em into oblivion, eh? But those that do ... heh, heh.  <br/>\n<br/>\nAs to the old challenges, yeah, I remember them, too (great stuff!)--whole thing inspired a whole bunch of scythe-winding BG's as well. Too much fun!! Thing is, as cool a concept as that scythe is, it just don't fire that much, lousy crit range, even in the hands of a WM. Ah, but when it does, look out--yeah, cool concept. And managed to squeeze a bit more out of it all, too, eh? Congrats!!! Concept-wise, I like.<br/>\n<br/>\nDropping the Scythe and going for scimitar in the second one is a better choice (better crit. range so as to fire in turn, and it does); however, when it comes to the WM class, which is expensive, only worth it if go lots of it (yes, sometimes 7 only of it can be explained, but taking only 5 of it and not at least going for 7 is a waste since 2 more gives ki crit (5 gives improved crit multiplier and +1 AB, but 7 of it gives +2 threat range thus more crits), and since you paid for WM, get it, it's what you really want from WM, I mean, wasn't for the AB factor--Naked AB 37 on a WM?!!     ). BF and KD both are also important on a melee, and HPs are also just too low). Ah, but if you're traveling PvM/E with a cleric who's gonna buff you up in terms of HPs, etc. and have a fighter along who will do the KD'ing for you, fine. Then, when it's your turn to \"shine\", come up to bat and do your \"thing\" against the demi-lich (GS V outta do it, which is nice, but need more naked AB, HPs, feats, etc. if want to solo, etc. Otherwise, as a concept build, nice, too!). <br/>\n<br/>\nAs to the dragon druid with a smite twist, it's interesting, Hip. The shapes are nice and dragon is quite powerful, cleric for more versatility as well. Cool angle. Apart from the dispel factor (more so a problem PvP than it is PvM/E), it's NEAT!!! <br/>\n<br/>\nSmite ON! ~ Tyr<br/>\n<br/>\nEDIT: enjoyed the thread, Hip. Good work, as always!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:11 PM - Dec 18, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great work! <br/>\nInteresting concept builds. I like the numbers in the boxes, it's very informative.<br/>\nAnd congrats on beating the Damage Adept!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:01 AM - Dec 19, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@Tyr:  I didn't miss any Pal/CoT/WM builds.  This topic was never intended to be a general smite build thread, but rather an optimized smite build thread.  WM 7 is essential to securing the highest percentage of smite crits and that is where the power of smite lies.  WM 5 is essential to achieving the highest damage possible.  If I were you I would not expend any thought trying to dissect the damage template unless it is to make a suggestion to increase the damage output.  Now, THAT would interest me.  Smite focus is evil foe focus. Kill any evil in 3 smites or less.  Smite itself serves no other purpose.  Every other consideration is secondary, including non-smite AB.  If your toon can't sustain a few hits before landing the killing blow, choose another opponent (300-400 HPs should be just dandy unless it is a BG smiter). I think you missed the overall intent of the thread... to illuminate clearly the costs of focusing on smiting (like selecting all those wasted... err... blasted GS feats) by providing a few examples.  They say a picture is worth a thousand words.  I don't know how to clarify it any better than I have, though am open to suggestions.   <br/>\n<br/>\n@Mick:  Danke, Herr Dagger!  Better to achieve a place of distinction late in life than not at all.  NWN was only a blip on the radar in those days when the ECB was really active.  Dealing with the formatting limitations of these forums is a challenge in itself.  Glad to hear my presentation was coherent.  Maybe there's still hope for these old bones, yet?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "7:47 AM - Dec 19, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hip, I agree, that this is a damage concept build, everything optimized around that (and those be some (crit) crazy numbers alright!!): however, when listing some but not others, might give the wrong impression, eh?  Could have I suppose just set out CD's Damage Adept which everyone understands to be a damage concept build, and a cool concept it still is and was; the old challenge being what you pick up on here, yes? Out to optimize for damage, which you do in fact do, and nicely illustrate, too!! Super!<br/>\n<br/>\nSecondly, also entirely agree with you that, to get the most damage as such is to take WM 7 for ki crit so as to open up the threat range (more crits = more damage that way, oh, yes!). Your first one only goes WM 5, though, and why I thought to point that out--there being a reason to go 7 as you also say. [CD  only went 5 of it--with yours being a nice improvement right there, I agree!)]. <br/>\n<br/>\nAgain, that you beat the Damage Adept is really something. Congrats once again!!  Nicely done!  ).<br/>\n<br/>\nSmite ON! ~ Tyr<br/>\n<br/>\nEDIT: dem \"old bones\" of yours are hardly \"old\". Seasoned ... Good Job, Hip! Enjoyable post.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:11 AM - Mar 20, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As I mentioned in another build, only one build in a topic containing multiple alternatives like this one does will be able to be found with a build locator.  Since I only ever intended this topic to be used to help illuminate the consequences and considerations of building a Level 40 build around smiting, I have no problem that all but one build will be detectable by the utility being compiled (stay tuned, should be ready mid-Spring 2016). <br/>\n<br/>\n It's a good lesson to learn, though.  We should all consider our builds as part of a huge database with each build indexed as a single unique retrievable record which meets user-defined search criteria.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}