{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "287",
  "name": "Shadow Sword (Fighter4 Rogue26 CoT10) (ITWF-ED/SC-5)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/shadow-sword-fighter4-rogue26-cot10-itwf-ed-sc-5-t2297238.html",
  "author": "TyrTemplar",
  "avatar": "no_avatar.png",
  "replies": 2,
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "12:52 PM - Nov 11, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Defending against Evil and Adventuring PvM (1-40) and PvP <br/>\n<strong><br/>\nSHADOW SWORD (Military Order, Arvoreen’s Marchers: Halfling Defender)<br/>\nBy Deborah “Tyr” Templar</strong><br/>\n<br/>\n<strong>Concept – Divine-Rogue of Arvoreen (Halfling Defenders): The Art of Defense</strong><br/>\nThe Paladins of Arvoreen are a Halfling Order in Tethyr, known officially as the “Arvoreen Marchers” but also as Halfling Defenders, officially recognized by the Crown; a small but highly regarded order, Arvoreen’s Marchers are respected by humans and halflings alike. <br/>\n<br/>\nArvoreen is the Halfling God of War, whose portfolio includes Defense (Protection), Good, Duty (Law), and vigilance; his is a “Power of stern defense and aggressive watchfulness, who is always preparing for incursions into (H)alfling lands and making ready to repulse hostile creatures at the first sign of trouble.” His primary worshippers are Halfling soldiers and warriors including battle clerics and paladin-rogues, who specialize in all matters of defense.<br/>\n<br/>\nArvoreen's dogma is best captured by the phrase: “The Best Offense is a Strong Defense.” <br/>\nSource: This information is excerpted and adapted from: <a class=\"postlink\" href=\"http://nwn2.wikia.com/wiki/Arvoreen\" rel=\"noreferrer\" target=\"_blank\">http://nwn2.wikia.com/wiki/Arvoreen</a><br/>\n<br/>\n<strong>The Build—Pros and Cons:</strong><br/>\nEpic Rogue. Epic Traps. Stealth. Over 400 HPs. Really nice Saves. Excellent Defense (Epic Dodge and SC-5).  Dual Wields daggers with Fighter WS/EWS and 13d6 Sneak on both of them, meaning: with mundane daggers alone, no magic or equipment--despite full UMD/magic access, so as to be entitled to same, the Sword delivers—as in (round total): 46-64 (17-20/x2), +78d6 Sneak (make that 78d7 Sneak hasted!). Lethal! (And that's mere butter knives, not even sharpened, such that enemies quite simply don't live that long!); has a real hard warrior’s AB (Naked 44) along with KD, and can with tools open up his/her own locks, too. <br/>\n<br/>\nWithout further ado, please meet:<br/>\n<br/>\n<strong>Shadow Sword,<br/>\nFighter(4), Rogue(26), Champion of Torm(10)</strong><br/>\n<br/>\n<strong>I. Attributes:</strong><br/>\nSTR: 12<br/>\nDEX: 20 (34)<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 10<br/>\nCHA: 8<br/>\n<br/>\nHalfling: Non-Evil<br/>\n<br/>\n<strong>II. Level Guide:</strong><br/>\n01: Rogue(1): ambidexterity<br/>\n02: Fighter(1): weapon finesse<br/>\n03: Fighter(2): two-weapon fighting, weapon focus: dagger<br/>\n04: Rogue(2): DEX+1, {Evasion}, (DEX=21)<br/>\n05: Rogue(3): {Uncanny Dodge I}<br/>\n06: Fighter(3): knockdown<br/>\n07: Fighter(4): weapon specialization: dagger<br/>\n08: Rogue(4): DEX+1, (DEX=22)<br/>\n09: Rogue(5): blind fight<br/>\n10: Champion of Torm(1)<br/>\n11: Champion of Torm(2): improved two-weapon fighting<br/>\n12: Champion of Torm(3): DEX+1, Point Blank Shot (PvM/E) –OR (Your Choice): Stealthy or Grt.Fort (PvP)**, {Smite Evil}, (DEX=23)<br/>\n13: Champion of Torm(4): improved critical: dagger<br/>\n14: Rogue(6)<br/>\n15: Rogue(7): Rapid Shot (PvM/E) –OR (Your Choice): Iron Will or SF: Listen- **<br/>\n16: Rogue(8): DEX+1, (DEX=24)<br/>\n17: Rogue(9)<br/>\n18: Rogue(10): toughness, improved evasion<br/>\n19: Rogue(11)<br/>\n20: Rogue(12): DEX+1, (DEX=25)<br/>\n21: Champion of Torm(5): great dexterity I, (DEX=26)<br/>\n22: Champion of Torm(6): epic weapon focus: dagger<br/>\n23: Champion of Torm(7)<br/>\n24: Champion of Torm(8): DEX+1, great dexterity II, epic weapon specialization: dagger, (DEX=28)<br/>\n25: Rogue(13): defensive roll<br/>\n26: Rogue(14)<br/>\n27: Rogue(15): great dexterity III, (DEX=29)<br/>\n28: Rogue(16): DEX+1, epic dodge, (DEX=30)<br/>\n29: Rogue(17)<br/>\n30: Champion of Torm(9): great dexterity IV, (DEX=31)<br/>\n31: Rogue(18)<br/>\n32: Rogue(19): DEX+1, self concealment I, (DEX=32)<br/>\n33: Rogue(20): self concealment II<br/>\n34: Rogue(21)<br/>\n35: Rogue(22)<br/>\n36: Rogue(23): DEX+1, self concealment III, (DEX=33)<br/>\n37: Rogue(24): self concealment IV<br/>\n38: Rogue(25)<br/>\n39: Champion of Torm(10): self concealment V, epic prowess<br/>\n40: Rogue(26): DEX+1, (DEX=34)<br/>\n<br/>\n*** Feat Note: PBS/RS ( PvM/E)—a little ranged Support (throwing sneak-charged mighty prop. missiles—i.e., darts, throwing axes) works really good out of stealth, switching out to your daggers when/if your enemy begins to close the gap so as to strike out and finish the job (combine with EPIC TRAPs, heh; though those traps all by themselves and on their own are plenty versatile, different types/effects, whole range of damage types covered, not to mention deadly-lethal as of course are your daggers (prime weapons), too). Feel free to swap out for other feats of your own choosing should you be uninterested in same, as no, don't exactly need sneak-charged ranged support, but it's a fun thing to do. If looking to PvP your Sword, then pick up the alternate feats as per the guide (i.e., Save or Skill boosts), or otherwise as you prefer. <br/>\n<br/>\n***More Skills you say? No problem. Simply adjust your ability stats, dropping 2 STR (10), and picking up 2 INT (12), means -1 damage (-4 really, double on a crit., dual-wielding after all) but you'll pick up +43 skillpoints instead--et voila, more skills for you to do with as you need/want. Either way, enjoy. <br/>\n<br/>\nAnd now back to our regularly scheduled program …<br/>\n---<br/>\n<br/>\n<strong>III. Basics:</strong><br/>\n<br/>\na. Hitpoints: 416<br/>\n<br/>\nb. Saving Throws (v. spells):<br/>\nFort: 30 (32)<br/>\nWill: 21 (23)<br/>\nReflex: 41 (43) impr.evasion<br/>\n<br/>\nSaving Throw bonuses:  Traps: +5, Fear: +2<br/>\nOther: Stealth; ED/SC-5; UMD; Divine Wrath (+5 all-saves, +5 AB/+5 Divine Damage; Unlock w CHA).<br/>\n<br/>\n<br/>\n<strong>IV. Combat Vitals:</strong><br/>\nBAB: 27, AB (naked): Melee 44 (-2 dual wield), Range Support: 42 (-2 RS) <br/>\n<br/>\nMundane Dagger: AB 44 (-2 dual); <br/>\nDamage—Main Hand:  1-4+7 (17-20/x2), +13d6 Sneak / Off hand: 1-4+6 (17-20/x2), +13d6 Sneak<br/>\nRound Total (6 apr):  46-64 (17-20/x2), +78d6<br/>\n<br/>\n*Gear (+6 STR/DEX, +5 keen ice talons (1d6 Cold), UMD/Haste):<br/>\nSingle Wield: 52/47/42/37/52    *   Dual Wield: 50/45/40/35/52/50/45<br/>\n<br/>\nMain-Hand Damage: 1-4+15, +1d6 Cold (15-20/x2), +13d6 Sneak  <br/>\nOff-Hand Damage: 1-4+13, +1d6 Cold (15-20/x2), +13d6 Sneak<br/>\n------<br/>\nRound Totals: 108-129, +7-42 Cold (15-20/x2), +78d7 Sneak<br/>\n<br/>\nOther: Stealth; Divine Wrath; UMD; Epic Traps! (and about which trap types and damage you can read more here: <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Trap\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Trap</a> ).<br/>\n<br/>\n<br/>\n<strong>V. Defense Vitals (AC):</strong> <br/>\nAC (naked/shield only): 31/33<br/>\n<br/>\nOther: Stealth, UMD … ED/SC-5.<br/>\n<br/>\n<strong>VI. Spell Casting</strong>: UMD<br/>\n<br/>\n<strong>VII. Skillpoints</strong>: 260<br/>\n<br/>\n*Epic Trap Set: Disable Trap 1(3), Discipline 42(43), Hide 43(55+4 Sm.Stature: 59), Move Silently 43(57+4 Sm.Stature: 61), Open Lock 1(13), Search 1(1), Set Trap 33(45+Take 20: 65=Epic Traps), Spellcraft 10(10), Tumble 40(52), UMD 36(35)<br/>\n<br/>\n*Detection Set (assuming sf: listen and stealthy): Disable Trap 1(1), Discipline 41(42), Hide 43(57+4 Sm.Stature: 61), Listen 43(47+4 Sm.Stature: 51), Move Silently 43(59+4 Sm.Stature: 63), Set Trap 3(15+Take 20: 35=Deadly Traps), Spellcraft 5(5), Tumble 40(52), UMD 36(35)<br/>\n<br/>\n*As always, players should feel free to adjust their Shadow Sword to suit their own needs/environs.<br/>\n<br/>\n---<br/>\n<br/>\n<strong>Other Combos:</strong> <br/>\nWhile there are many Fighter/CoT/Rogue combinations in the guild, this build is highly unique, being the first SC5-ED/Dual-Wielding “Divine Rogue” to debut here at the ECB, according to the Pulse/Search Engine. And yet at the same time, the Sword is in keeping with the spirit of my previous character of the same name who, along with his/her companion, Shadow Shield (ED-HiPs Paladin), has been revisited in light of 1.69, and which companion you can meet here:  <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/shadow-shield-paladin26-rogue13-sd1-ed-hips-t2297237.html#p20333747\" rel=\"noreferrer\" target=\"_blank\">shadow-shield-paladin26-rogue13-sd1-ed-hips-t2297237.html#p20333747</a> (with links therein also to the original characters).<br/>\n<br/>\nEdit: fix broken link.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:15 PM - Nov 11, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">IIRC Rogues get an extra feat at 4 levels after 20, Tyr, so you could go Rogue 24 Ftr 6 CoT 10, lose 1d6 SA and a few skill points and gain an extra epic feat, which you could use for Armor Skin and +2 AC. IMO worth the trade.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "3:20 AM - Nov 12, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good to see you, Max, but no it's not worth it. Let me explain, which I'm most happy to do. <br/>\n<br/>\nFighter 4 is more than enough, opens the WS/EWS. Sometime less fighter makes for a more effective/stronger fighter (i.e., fighters can't take SC-5 as a bonus feat, lose skills and don't get sneak die either). Skills here are already the minimum in my opinion (combat-optimised of course, and while I wouldn't myself drop the STR so as to grab more skills, I well realize rogue fans out there enjoy more skills, so put that option in under the level guide so that they can get more of them, should they wish). <br/>\n<br/>\n<strong>Of Skills, Traps, and Dual-Wield benefits, etc.</strong><br/>\nIf looking to PvM/E, need a source other than sneak to deliver damage for i.e. crit/sneak immunes, and what epic traps are for, so won't be wanting to give that up. Yes, you've WS/EWS on both daggers (which is really nice on a rogue/DEX'er especially, as it's essentially equivalent to what say yer average \"Joe\" i.e typical STR-fighter delivers, only on top of that the Sword also has sneak), with UMD/magic access on top of that, thus able to enhance/bring in all sorts of wonderful other stuff (not to mention entitlement like everyone else to equipment/magic gear), too. However, traps are yet another (deadly-lethal) source of damage, and are wonderful, covering everything off (all elements, different effects), and not to be overlooked. (In PvP traps are quite nice, too. Pale Masters among other things blow-up really good like everything/everyone else does, which otherwise being \"undeads\" they're sneak/crit immune: play-tip!).<br/>\n<br/>\nMeantime, as to your daggers, you've not just one, but two so as to have say cold and acid on one set, fire and electrical on the other. Easy to cover off all the various elemental types in turn, and not to be taken lightly, especially if want to solo (mid-high magic world especially important where monsters have all sorts of elemental and DR shields, high sneak charged damage chews through DR, with ability to cover off thus all the different elemental damages when dual wield, and also where Epic traps are really quite lovely there as they are absolutely everywhere else, too). Otherwise, for PvP, will want detection (full train listen), with some traps being nice, too, such that what skills Sword has are important and put to very good (combat-optimized) use (but have no fear, can open a lock with tools, too. <br/>\n<br/>\n<strong>Of DR, first-strike and Sneak:</strong><br/>\nThat said, and regardless of scenario (PvP or PvM/E, though the former \"monsters\" tend to have far less HPs, less if any DR and immunities than the latter kind do (as in, most have none; EDR at best when it comes to the melee and so what even if they do, not exactly going to help much against high sneak-charged damage, yes, I catch your drift), with the high sneak charged daggers [13d6 on both daggers x's 6 apr as dual wielding, 7 apr hasted (UMD, etc.), along with WS/EWS also on both (only need 4 fighter for that)], wave bye bye to your foe. (And the dead don't strike back). In turn, I can see why a loss of 1d6 sneak might not sound like much (when it comes to PvP as opposed to PvM/E that is, and it's true); however, when it comes to PvM/E as said, when you add it all up, it's not just one die but actually 6 of it and for the high DR enemies is what you want. (Remember: ITWF = 6 apr dual-wield, make that 7 die hasted which is rather lovely, yes? I think so, too; beauty of ITWF, then, you know me: I like my AB/damage set-ups!). We have a nice all-natural (warrior) AB here with WS/EWS, along with our stealth, KD, etc., and I like damage (78d6 Sneak damage alone, add one more hasted? Now thar be damage!!). Why prolong anyone's suffering, I say. The Sword's not evil...heh. Also, remember first-strike advantage: when you strike, strike hard and take them out. Make that strike count (and with that 78d6 sneak alone, 78d7 hasted, along with WS/EWS on mundane \"butter knives\" alone, this the Sword most definitely does).  <br/>\n<br/>\n<strong>ED/SC-5 (best defense there is):</strong><br/>\nAs to Armor Skin, it's alright, but not worth giving up Warrior's AB (i.e. epic prowess) for it either. Already have very good AC (gear up and add dex; not really an issue for non-plate wearing DEX'ers). I like my rogues able to duel/melee, with real HPs and able to hit out of stealth, KD (generate your own sneak, one-size up, works beautifully, too, and that's in addition of course to stealth!), and in any event not so sneak/stealth dependent, etc. either, while packing a serious punch (high SA, WS/EWS both daggers as said), and what real, hard (warrior) AB also speaks to (necessary as such, and everyone knows how much I like my AB); and I especially like it with ED in combination with SC-5 (best darn defense there is). <br/>\n<br/>\nED guarantees you roll the first attack, SC-5 pretty much takes care of the rest; It's expensive in terms of feats/requirements, get all five of them and requirements of course, then again, that which is worth it usually is expensive, and yes, it's well worth it! (Can't be purged/morded, with you 24/7 so with you all day and all night, never wears out, being something you wholly and entirely own). And not exactly like, with warrior AB, all that DEX AC (uncanny dodge), super reflex (impr.evasion), 13d6 sneak (on both daggers! That's 78d6 Sneak damage alone, 78d7 sneak hasted dare I repeat again), etc. with a decent skill set (really nice set when seen from the perspective of a melee) that the Sword gave anything up for it either. Combined with ED as said (which comes in nice and early, too), seriously, no worries. <br/>\n<br/>\nWhen you have a nice AB, etc., need something to deliver...SA is super nice, and got it by the bucket loads (gotta love dual-wield, along with WS/EWS on both daggers, too; with UMD/magic access and traps for blowing up, well, everything really). Like all Dex'ers (melee in general, really) now add some gear to which, like everyone/everything else, you're equally entitled to. Meantime, ED/SC-5 is the best defense there is (AC already very good in and of itself, but ED/SC-5's ... a beautiful thing), so enjoy all that sneak-charged damage, etc. you deliver in turn. <br/>\n<br/>\nPlease know that I appreciate your question and comment (as always).<br/>\n<br/>\nSneak ON! ~ Tyr.<br/>\n<br/>\nEDIT: add note about DR and benefits of high sneak-charged damage, especially with ITWF not to mention combined effect i.e. first-strike advantage; remove typo(s).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}