{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "843",
  "name": "WoG Non Cep build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/wog-non-cep-build-t2355120.html",
  "author": "gkorjax",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "78",
  "posts": [
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "6:32 PM - Jul 27, 2019",
      "content": "<div>Hi. I wanted to know if anyone cared to have a discussion about Non Cep weapon builds. On WoG, due to the random magic item generators that are around one sometimes finds weapons that are pretty damn awesome, but non Cep. This basically means to plan a build for using such weapons, one does without weapon focus/specialization/improved crit and all other related feats. I don't care about xp penalty.Sometimes I PREFER an xp penalty. I don't like level 40 bloomers. I don't like dev crit. I don't like dying :). I'd often prefer skill points to hit points.  I'm looking at Non Cep two handers currently.<br/>\nWoG has a pretty awesome modification to Tensers Transformation.<br/>\n<br/>\nSo to get a respectable melee AB requires either (in my opinion, correct me if I'm wrong) either very high strength (RDD), Cleric divine power goodness, Extended tenser's transformations, or a combination thereof.<br/>\n<br/>\nAny thoughts on what you guys would build to lay some smack down with Mercurial Greatswords etc?<br/>\nI know a modified Panthro is an option. Trying to do some gymnastics and remove the dev crit feats for great strengths etc.<br/>\nSo is a paladin/so/rdd, with a lot of sorcerer levels, like<br/>\n<br/>\n<a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build307193.html\" rel=\"noreferrer\" target=\"_blank\">https://world-of-greyhawk.github.io/bui ... 07193.html</a><br/>\n<br/>\nAny thoughts?<br/>\n<br/>\nThanks</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:02 PM - Jul 27, 2019",
      "content": "<div>Hi gkorjax.<br/>\n<br/>\nEmpyre has his excellent <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/universal-warrior-2-fighter-18-bard-12-rdd-10-t515536.html#p217\" rel=\"noreferrer\" target=\"_blank\">Universal Warrior 2</a> to contribute to this one, which is hard to ignore. To a certain extent it's not dissimilar to the build you cite, but takes a different slant as a Fighter 18/ Bard 12/ RDD 10. Admittedly, it was constructed for Aielund, but it would seem to tick many of your boxes - no Dev Crit, plenty of skills, not a late bloomer, can use things like mauls and falchions just fine - or even d-w, according to taste.<br/>\n<br/>\nWhat do you think?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "1:38 AM - Jul 28, 2019",
      "content": "<div>Hrmm...that does look like a non magical route for what I'm looking for. I've done similar before, but never with fighter...I used to think, \"I'm not going to use up all these fighter bonus feats, might as well just go barbarian or something\"...but opening up that dual wielding route certainly is an option. I think if I went this route I'd drop either iron will or luck of heroes for expertise, and also perhaps up int to 16 to allocate enough points for taunt, and some trapping skills...hrmm</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:56 AM - Jul 28, 2019",
      "content": "<div>Always happy to nudge open non-magical doors, gkorjax! Even if they're not of my own making. It does have a wee bit of Song and Curse Song to help it along as well, which ain't ever a bad thing. And I get the Expertise/ Taunt combo for WoG in particular. As a natural meleer who hates crappy will saves, I'd be more tempted to lose LoH than Iron Will, but it's a judgement call.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    }
  ]
}