{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "917",
  "name": "Bard/Assassin/Shadowdancer idea HELP!",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bard-assassin-shadowdancer-idea-help-t2354963.html",
  "author": "Asturonethoriusaline",
  "avatar": "no_avatar.png",
  "replies": "23",
  "views": "2.2K",
  "posts": [
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "6:28 AM - Dec 26, 2018",
      "content": "<div>Hi all, I'm new here. I'm thinking of a build idea. I'm thinking of a Bard/Assassin/Shadowdancer.<br/>\n<br/>\nI need a LOT of HELP PLEASE!<br/>\n<br/>\nLevels: Thinking about Bard 7/Assassin 6/Shadowdancer 6 for a 19th level character against the OC<br/>\n<br/>\nBut maybe a different level allotment is better.<br/>\n<br/>\nRace: Elf or Halfling. Which? Why?<br/>\n<br/>\nStarting stats<br/>\n<br/>\nStr 12<br/>\n<br/>\nDex 18(stat point at 12 level to combine with either a +3 or +5 dex item for either a 22, 24 Dex)<br/>\n<br/>\nCon 12<br/>\n<br/>\nInt 12(Stat point at 8th Level to get to 13 for expertise)<br/>\n<br/>\nWis 9(stat point at 4th level to eliminate penalty)<br/>\n<br/>\nCha 13<br/>\n<br/>\nFeats(pool of idea feats. More then legal limit)<br/>\n<br/>\nDodge(start), Finesse(3rd Level), Mobility (6th level), Expertise (9th level), Whirlwind Attack, Improved Critical, Cleave<br/>\n<br/>\nWelcome, need more ideas.<br/>\n<br/>\nSkills Hide 10+, Move Silently 8+, Tumble 5+, Disable Device, Open Locks, Listen, Concentration, Spellcraft, Perform, Parry, UMD, etc<br/>\n<br/>\nBasic Concept:<br/>\n<br/>\nStrengths<br/>\n<br/>\nVery High, as high as can get AC.<br/>\n<br/>\nCan Parry attacks that get by AC<br/>\n<br/>\nAssassin poison death attacks<br/>\n<br/>\nHide in Plain Sight, Summon Shadow<br/>\n<br/>\nDarkness<br/>\n<br/>\nLots of attacks per round<br/>\n<br/>\nSpellcasting<br/>\n<br/>\nHealing<br/>\n<br/>\nUMD<br/>\n<br/>\nRanged, Melee, Ambush, Assassin, Ninja, death attacks<br/>\n<br/>\nHiding<br/>\n<br/>\nVERSATILITY<br/>\n<br/>\nWeaknesses<br/>\n<br/>\nLower HP<br/>\n<br/>\nDeferred Power<br/>\n<br/>\nLess Damage<br/>\n<br/>\nLower BAB(BUT higher total attack bonus because of Dexterity, Weapon Finesse)<br/>\n<br/>\nHordes(until get bard spells, scrolls, items, that deal with hordes)<br/>\n<br/>\nUndead.<br/>\n<br/>\nBasic idea is to have monsters uselessly waste attacks on character, as if character was a pincushin, while the character, shadow, henchman EVENTUALLY finish off enemy<br/>\n<br/>\nOr to use Bard Spells, items, scrolls, etc, to deal with hordes<br/>\n<br/>\nOr to hide, sneak up to ambush, assassinate, deathstrike<br/>\n<br/>\nSo HOW should I, others build this?<br/>\n<br/>\nCONSTRUCTIVE ideas, help, suggestions, builds, examples, etc, PLEASE!<br/>\n<br/>\nThanks for any help!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:54 AM - Dec 26, 2018",
      "content": "<div>Here is something I have thrown together that might work for you.<br/>\nIt is a dex based halfling. I have made the build to 40, but you can stop at 18 for the OC, or 28 for HotU if you want. <br/>\nThere are some skillpoints extra inlate  epic levels that can be put wherever you want.<br/>\nDual wielding is an assassin thing for more attacks per round (see my assassin guide). You may swap it for Blind fight and Improved knockdown.<br/>\n<details><summary>Spoiler</summary>\nBard(8), Assassin(30), Shadowdancer(2), Halfling\n\nDEX: 18 (38)\nWIS: 8\nCHA: 14\n01: Bard(1): Dodge\n03: Bard(3): Weapon Finesse\n05: Bard(5)\n07: Assassin(2): {Uncanny Dodge I}\n09: Assassin(3): Weapon Focus: Dagger\n11: Assassin(5)\n13: Assassin(7)\n15: Assassin(9): Ambidexterity\n17: Bard(6)\n19: Shadowdancer(2): {Darkvision, Evasion}\n21: Assassin(11): Epic Weapon Focus: Dagger\n23: Assassin(13)\n25: Assassin(15)\n27: Assassin(17): Great Dexterity II, (DEX=26)\n29: Assassin(19)\n31: Assassin(21)\n33: Assassin(23): Great Dexterity VI, (DEX=32)\n35: Assassin(25)\n37: Assassin(27)\n39: Assassin(29): Great Dexterity IX, (DEX=36)\n\nSkillpoints: 262\nSaving Throw bonuses: Spells: +2, Traps: +2, Poison: +15, Fear: +2\nAB (max, naked, mundane weapons): 43 (melee), 41 (ranged)\nAC (naked/mundane armor/shield only): 33/35\nAlignment Changes: 0\nHide 43(61), Listen 43(48), Move Silently 43(63), Open Lock 1(15), Perform 14(16), Search 19(21), Spellcraft 8(10), Tumble 40(54), UMD 29(31), remaining skillpoints 22\n\n02: Hide(1), Listen(1), Move Silently(1), Perform(3), Tumble(1), Save(1), \n04: Hide(1), Listen(1), Move Silently(1), Perform(1), Tumble(1), Save(3), \n06: Hide(1), Listen(1), Move Silently(1), Open Lock(1), Tumble(1), UMD(5), \n08: Hide(1), Listen(1), Move Silently(1), Search(5), \n10: Hide(1), Listen(1), Move Silently(1), Save(4), \n12: Hide(1), Listen(1), Move Silently(1), Tumble(5), \n14: Hide(1), Listen(1), Move Silently(1), Search(3), \n16: Hide(1), Listen(1), Move Silently(1), Save(5), \n18: Hide(1), Move Silently(1), Spellcraft(3), Save(1), \n20: Hide(1), Move Silently(1), Perform(3), Spellcraft(5), \n22: Hide(1), Listen(1), Move Silently(1), Tumble(5), \n24: Hide(1), Listen(1), Move Silently(1), UMD(5), \n26: Hide(1), Listen(1), Move Silently(1), Save(5), \n28: Hide(1), Listen(1), Move Silently(1), UMD(5), Save(1), \n30: Hide(1), Listen(1), Move Silently(1), UMD(5), Save(2), \n32: Hide(1), Listen(1), Move Silently(1), Tumble(5), Save(3), \n34: Hide(1), Listen(1), Move Silently(1), Save(9), \n36: Hide(1), Listen(1), Move Silently(1), Save(15), \n38: Hide(1), Listen(1), Move Silently(1), Save(16), \n40: Hide(1), Listen(1), Move Silently(1), Save(22), \n</details></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "4:39 PM - Dec 26, 2018",
      "content": "<div>Thanks. I like, agree with between some to almost most of your build. Why not more Shadowdancer levels, at the expense of Assassin levels?<br/>\n<br/>\nHow about get Shadowdancer to at least 4 to 7?<br/>\n<br/>\nI assume that Bard is at 8 to get 3rd level spells. But how about bard levels high enough to get 4th level spells at I think 10th level bard, for better bard spells/song?<br/>\n<br/>\nThat brings Assassin levels down to about 19 to 24 which I would think would still be pretty good.<br/>\n<br/>\nWhat about using a shortsword, rapier, instead of dagger?<br/>\n<br/>\nWhat about Whirlwind Attack, Circle Kick, to full monty your attacks per round?<br/>\n<br/>\nHow about Disarm, Improved Disarm, Knockdown, improved knockdown, Improved Critical on either dagger, shortsword, rapier?<br/>\n<br/>\nJust some of my thoughts<br/>\n<br/>\nThanks for your help, thoughts, etc.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:09 PM - Dec 26, 2018",
      "content": "<div>SD is there for HIPS. You also get evasion from the second level. But the second level is only there because it adds +1 to BAB as opposed to a 9th bard level.<br/>\nI squeeze in as many assassin levels as possible.  That gives the best Death attack DC, maxes out Death attack damage. It also provides max bonus feats for Great dex X and a final dex of 38 for a fighter like AB of +43. AC is also above par. <br/>\nAn 8/8/4 split pre epic would have gained +1 BAB, but here AB becomes more than high enough with all the Great dex feats.<br/>\nIn short: This is an assassin build.<br/>\nBard is there to qualify for assassin. <br/>\nBard + SD levels = 10 because you can only take 10 assassin levels per epic. (I think Bard8/ SD2 is better than Bard6 SD4). You just get lvl3 bard spells. Choose wisely. Perform 15 just gives you the lvl 8 Song. Nothing major, but nice to have.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "9:30 PM - Dec 26, 2018",
      "content": "<div>I think I will go with 20th level build:<br/>\n<br/>\nBard 7,8/Assassin 7,8/Shadowdancer 5<br/>\n<br/>\nI want the HIPS, uncanny dodge, the summon shadow, the Shadow Evade, and Defensive Roll from Shadowdancer.<br/>\n<br/>\nMy 40th level build would be:<br/>\n<br/>\nBard 11(get 4th, 5th level spellcasting, and bardsong gives +2 to AC)/Assassin 24(is only down 6 levels, worth trade off for what get), Shadowdancer 5<br/>\n<br/>\nHow would optimize that level allotment?</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:06 PM - Dec 26, 2018",
      "content": "<div>I am sorry, but I don't understand what you want to optimize with that level spread. To me it seems like you want too much in and end up with a weaker build.<br/>\nAssassin is best with as many levels as possible.  25 levels may be OK, but more is better.<br/>\nIf you want ED, Rogue is often better than SD. Builds with many SD lvls are rare. But you see some that aim at ED and SCV. <br/>\nIn the build I posted here, Bard works as a stepping stone for Assassin and SD.<br/>\nMore serious Bard builds often have 16, 20, 24 or 26 bard levels. The songs are main focus, Skills are also important. Magic plays a part in Bard builds, but even so, spells are not a #1 priority. <br/>\nIn a build with priority on Bard, I prefer Rogue over Assasin.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "11:27 PM - Dec 26, 2018",
      "content": "<div>Now that I think of it, 3 more bard levels, from 8 to 11 only gives you 1 more spells level from 4th to 5th level spells, and +2 AC.<br/>\n<br/>\n3 more Assassin Levels from 24 to 27 equals 2,3,4 more Great Dexterity epic feats which about equals, maybe even exceeds getting 1 more spell level, +2 AC from song.<br/>\n<br/>\nBut I am not giving up my HIPS, uncanny dodge, evasion, summon shadow, shadow evade, defensive roll from 5 levels of shadowdancer.<br/>\n<br/>\nAnd 5 levels of rogue is not better then 5 levels of shadowdancer. Yes rogue gets a couple, few, some of the same things as shadowdancer, but still the rogue does not get summon shadow, shadow evade, HIPS.<br/>\n<br/>\nAnd going from 27 to 30 level in Assassin , and 1,2 more great dexterity feats, is not worth losing summon shadow, shadow evade, defensive Roll by only going with 2 levels of Shadowdancer, 3 levels less then Shadowdancer 5.<br/>\n<br/>\nSo after thinking about it<br/>\n<br/>\n40th level build<br/>\n<br/>\nBard 8(4th level spells, improved bard song)<br/>\n<br/>\nAssassin 27<br/>\n<br/>\nShadowdancer 5<br/>\n<br/>\nAlso you dont have to go with the absolute maxed out full monty. When you do that, the build is not as well rounded, less versatile, can have a, or more weaknesses, less complementary, synergistical, cooperative, interchangeable, abilities that work well with other abilities.<br/>\n<br/>\nThere are many times that I used a too narrow, too optimized, too full montied character against itself, as a DM, by throwing things at its weaknesses that it couldnt deal with, mitigate, etc.<br/>\n<br/>\nOn the flip side you dont want to be too WATERED down.<br/>\n<br/>\nNeither Bard 11/Assassin 24/Shadowdancer 5<br/>\n<br/>\nOr <br/>\n<br/>\nBard 8/Assassin 27/shadowdancer 5<br/>\n<br/>\nNeither of those 2 builds Level allotment wise is too watered down, and instead is, are still semi optimized, semi narrow, semi almost full monty, semi focused, semi synergistical<br/>\n<br/>\nAnd both builds have good enough versatility, that they can deal with, mitigate some build weakness, that they might not be able to deal with if were more narrow, focused, etc.<br/>\n<br/>\nFor example, the summon shadow, combined with summon monster spell combined with henchman, helps deal with Hordes, helps take the HEAT off you, so that can survive longer, etc.<br/>\n<br/>\nAnd thats just the summon shadow.<br/>\n<br/>\nShadow Evade adds +3 to +4 to +5 to AC, combine that with +2 to AC from bard, and your AC goes from the 53 you listed to 60, 7 points better.<br/>\n<br/>\nDefensive Roll adds a lot to your AC(+5 to +15 on average depending on what roll to your AC<br/>\n<br/>\nNow your AC goes from 53 to 60 to 65 to 75 AC.<br/>\n<br/>\nI know \"Dont care about AC, because Ambush, Assassinate, Insta Kill IF undetected\".<br/>\n<br/>\nBut what happens IF that doesnt work?<br/>\n<br/>\nYour going to want a high AC like 75.<br/>\n<br/>\nSo gaining 3 to 6 levels of Assassin to Assassin 27 to 30 from 24, and being able to \"KILL EVEN MORE ON TOP OF THE KILL MORE YOU ARE A LITTLE TINY BIT SLIGHTLY BETTER\"  is not going to make up for losing 3 shadowdancer levels, 3 bard levels, and what lose in losing a spell level, +2 to AC song, Shadow evade + to AC, Defensive Roll to AC, Summon Shadow.<br/>\n<br/>\nIts like you deal 1 zillion damage, way more then enough, and now you want to deal 100 more damage instead of getting nice shiny things that augment, complement, synergize, give you versatility, etc.<br/>\n<br/>\nIts also like if you had a 100 AC, almost impossible to be hit, and you want to add 25 to 50 more to 100 AC for 125 to 150 AC by adding 3 to 6 more levels of a certain class, instead of adding versatility, etc.<br/>\n<br/>\nWhen is enough, enough?<br/>\n<br/>\nWhen can you diversify, add versatility, etc?<br/>\n<br/>\nI know there are builds that are WATERED down too much, and that that is a legit concern, and that you dont want to WATER down the build, but I am not WATERING down the build.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:57 AM - Dec 27, 2018",
      "content": "<div>Asturonethoriusaline, now I start to like this thread!<br/>\nYou address several important things here: <br/>\nWhen to max and when not to.<br/>\nVersatility vs single focus.<br/>\nWhat do the different classes bring to the table, and what is the optimal balance between them?<br/>\nHow can one class cover the weaknesses of another class in the build?<br/>\nWhere does one want to go with a build, sometimes one has to prioritize.<br/>\nI have also added:<br/>\nWill a build idea be better met if one picks other classes?<br/>\n<br/>\nYou have suggested 11/24/5 and 8/27/5 spreads. Why don't you post one or both of them so we have something more tangible to discuss.<br/>\n<br/>\nOn a side-note. Have they changed defensive roll recently and added an AC bonus? <br/>\nI know that Shadow evade has an AC bonus. At SD5 it is +1 AC for 5 rounds.<br/>\nIf you play on a PW where SD and the SD feats have been changed, things may look completely different of course.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Thorsson",
      "avatar": "10758835_1513245773.jpg",
      "timestamp": "9:45 AM - Dec 27, 2018",
      "content": "<div>Or has Defensive Roll been confused with Epic Dodge?</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "9:51 AM - Dec 27, 2018",
      "content": "<div>I'm new to the forum, but not so new to the NVWN 1 game, as I EASILY beat the OC, Shadows of, Hotu, but havent played the game in about 10 years.<br/>\n<br/>\nSince new to forum I dont know how to, not good at, posting a build in a organized, broke down way, and it takes a long time, since I am a slower typer.<br/>\n<br/>\nAlso, while I now have an idea of what level allotment I want, I dont know exactly what I want to put into the level allotment shell. I have a rough idea, but not enough to post a organized breakdown<br/>\n<br/>\nAs to your question on would the build be better met if chose another class?<br/>\n<br/>\nI was building a monk/Assassin/Shadowdancer<br/>\n<br/>\nBut I noticed that the lack of either a druid or wizard in the build made it so that couldnt buff up the character as much, liked I liked with a similar Monk/Wizard/Rogue, amd Monk/Druid/Rogue builds<br/>\n<br/>\nThe problem was couldnt have a Monk/Wizard or Druid/Assassin/Shadowdancer build.<br/>\n<br/>\nI also tried Rogue/Assassin/Shadowdancer, but again I saw buffing was needed, and couldnt get buffing with a Assassin/Shadowdancer build, unless either did a Bard or Wizard or Sorcerer Shadowdancer/Assassin build.<br/>\n<br/>\nAlso the bard was showing up prominently in the Bard/RDD/PM builds<br/>\n<br/>\nAnd Bard is a better choice then Druid, Wizard, because can sing buff, spell buff, can heal, can wear armor, shields, ok weaponry, better base attack, almost as good as the monk, offers good skill point allotment, and is similar, offers similar enough synergy to the Assassin/Shadowdancer classes<br/>\n<br/>\nSo by going with a bard/Assassin/Shadowdancer it is like going with.either a rogue, or Monk, wixard, shadowdancer, Assassin, all rolled into 1. <br/>\n<br/>\nBest synergy, versatility, optimization with Bard/Assassin/Shadowdancer over almost any X/Assassin/Shadowdancer combo.<br/>\n<br/>\nI thought Shadow Evade was at least a base of +2 plus the ocassional +1 per every so many SD levels<br/>\n<br/>\nBut probably misremembered it. It has been awhile. I dont play multiplayer, PW, at least not yet, or only 1 to 3 times at most.<br/>\n<br/>\nAs far as Defensive roll I thought it either was to roll a D20 to add result to AC or like Parry to roll D20 to parry a attack. At least that what I remember from my days playing this game and on PNP as a player and a DM. Probably wrong about it.<br/>\n<br/>\nBut COLLECTIVELY combined together, I think Summon Shadow at 3rd SD lv, Shadow Evade at 4th SD lv, and Defense Roll at 5th SD level, and +2 AC, 1 more spell level to go from 4th to 5th level spells, ALL combined together, in a VOLTRONIC combining to form Voltron effect is WORTH 3 to 6 levels less of Assassin.<br/>\n<br/>\nI also just think 30 levels of Assassin is just too much. Especially considering that some multiplayer/PW has a level cap at 30.<br/>\n<br/>\nBut anything less then 24 to 27 Assassin levels and miss out on a lot of great dexterity feats.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:06 PM - Dec 27, 2018",
      "content": "<div>Take a like, just because you mentioned Voltron &amp; I remembered my childhood.<br/>\nAlso, once you decide what do you want to play, after all, go and play Aielund, the best module in Neverwinter Nights. It has been updated for both diamond &amp; EE &amp; it is better than ever.<br/>\nIt makes the OC/SoU/HotU seem like toys. It goes all the way up to 37th level &amp; there you can actually use all these cool skills that your build has.<br/>\n<br/>\nGood luck.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "10:53 PM - Dec 27, 2018",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nTake a like, just because you mentioned Voltron &amp; I remembered my childhood.<br/>\nAlso, once you decide what do you want to play, after all, go and play Aielund, the best module in Neverwinter Nights. It has been updated for both diamond &amp; EE &amp; it is better than ever.<br/>\nIt makes the OC/SoU/HotU seem like toys. It goes all the way up to 37th level &amp; there you can actually use all these cool skills that your build has.<br/>\n<br/>\nGood luck.\n</div></blockquote>\n\nThanks Valerfor. Thanks for the invite. Is that Mod, Multiplayer, PW, you mention, on, available for Android 7.0 Mobile?<br/>\n<br/>\nI only see the main 3 mods, the 3 main premium mods, the 3 free mods, the 3 pay mods.<br/>\n<br/>\nUnder Multiplayer all I see is a long list.<br/>\n<br/>\nIs Aielund on that list. If not, how do I access it.<br/>\n<br/>\nIs Aielund Cooperative? Really not interested in PVP. <br/>\n<br/>\nDoes Aielund allow a Monk/Bard combo?<br/>\n<br/>\nWhat about the Favored Soul, Psychic Warrior, Soul Knife classes?</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "1:13 AM - Dec 28, 2018",
      "content": "<div>Hey all tried to do this before, but accidentally deleted, before posting.<br/>\n<br/>\nSo because I wont remember build if dont do this, I am going to post build as I play, build.<br/>\n<br/>\nSo starting over in OC<br/>\n<br/>\nIn Peninsula<br/>\n<br/>\nSwifty Rastirone<br/>\n<br/>\nHalfling NE<br/>\n<br/>\nProjected Bard 8 to 11/Assassin 24 to 27/Shadowdancer 5<br/>\n<br/>\nCurrent<br/>\n<br/>\nBard 3, about to hit 4th level<br/>\n<br/>\nAC 17(2(Leather),+4(dex)+1(shield)(19 when in combat with dodge bonus, halfling AC bonus)(21 when 17 + 4(Mage Armor)(23 when 19 +4(Mage Armor)<br/>\n<br/>\nHP 18<br/>\n<br/>\nStats<br/>\n<br/>\nStr 10<br/>\n<br/>\nDex 18<br/>\n<br/>\nCon 10<br/>\n<br/>\nInt 14<br/>\n<br/>\nWis 10<br/>\n<br/>\nCha 14<br/>\n<br/>\nSaves<br/>\n<br/>\nReflex 3,4 base for a 7, 8 total<br/>\n<br/>\nCon 1<br/>\n<br/>\nWill 2<br/>\n<br/>\nBAB about +1(+2 at 4th leve)(+3 level 5)(+4 at level 7)<br/>\n<br/>\nTotal Attack Bonus +5,6(+1,2 BAB + 4 Dex Bonus)<br/>\n<br/>\nSickle<br/>\n<br/>\nGear: About to get Amulet of Armor +1(950 gold)<br/>\n<br/>\n Will put AC at 24 if buffed, Mage Armor, in combat, otherwise at 20 when in combat, at 3rd,4th level<br/>\n<br/>\n<br/>\n<br/>\nFeats<br/>\n<br/>\nLev 1, start: Dodge<br/>\n<br/>\nLevel 3: Weapon Finesse<br/>\n<br/>\nProjected Level 6: Mobility<br/>\n<br/>\nProjected Level 9: Expertise<br/>\n<br/>\nProjected stat up at 4th lev, 8th level: Dexterity<br/>\n<br/>\nSkills(getting skills gradually to 2,3,4,5 ranks before narrowing focusing on main skills<br/>\n<br/>\nLevel 1: 24 skill points<br/>\n<br/>\nHide 4, Move Silently 3, Tumble 2,3, Listen 1,2, Perform 3, UMD 2, Concentration 1, Spellcraft 2, Heal 1, Discipline 2, Parry 2<br/>\n<br/>\nLevel 2 Hide +1(5), Move Silently +2(5), Concentration +1(2), UMD +1(3), Listen +1(2,3)<br/>\n<br/>\nLevel 3: Hide +1(6), Heal +1(2), Discipline +1(3) Perform +1(4) Tumble +1(3,4), Concentration+1(3)<br/>\n<br/>\nProjected Level 4: Hide +1(7) Move Silently +2(7), Perform +1(5), Spellcraft +1(3), Parry +1(3)<br/>\n<br/>\nProjected Level 5: Hide +1(8), Move Silently+1(8), Perform +1(6), UMD +1(4), Discipline +1(4), Tumble +1(4)<br/>\n<br/>\nProjected Level 6(Assassin Level 1)<br/>\n<br/>\nHide +1(9), Disable Device +2(2), Open Lock +2(2), Search +1(1)<br/>\n<br/>\nProjected level 7, Assassin Lev 2<br/>\n<br/>\nHide +1(10) Tumble +1(5), Search +1(2), concentration +1(4), Heal +1(3), Discipline +1(5)<br/>\n<br/>\nProjected Level 8, Shadowdancer 1<br/>\n<br/>\nParry +1(4), Concentration +1(if class Skill)(5), Search +1(if class skill)(3), Heal +1(4), UMD(If class skill +1(5), Perform +1(if class skill)(7), Discipline +1(6), Tumble +1(6)<br/>\n<br/>\nSpells<br/>\n<br/>\n0 level<br/>\n<br/>\nAll<br/>\n<br/>\n1 st level<br/>\n<br/>\nCure Light<br/>\n<br/>\nMage Armor<br/>\n<br/>\nSummon Monster 1(Dire Badger)<br/>\n<br/>\n Will update after 2,3,4 more levels, and after Peninsula, Prison Break, Devourer(Spoiler), completed</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:46 AM - Dec 28, 2018",
      "content": "<div>Let me try &amp; answer your questions one-by-one,<br/>\n<br/>\na) Aielund is a mod. It is a player-created content that you can download &amp; play it for free, like any other module(except the premium Bioware ones). <br/>\nThere is a place for these modules &amp; other cool stuff and it is called Neverwinter Nights Vault. The link is below,<br/>\nNeverwinter Nights Vault =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/</a><br/>\n<br/>\nb) Aielund &amp; any other module that exists for Neverwinter Nights, play wherever the main game plays. <br/>\nIf Beamdog made Neverwinter Nights available for smartphones or tablets then the modules will play on them too.<br/>\nWhere the main engine plays, the modules will play as well, in other words. Here is a link to our forums where we discuss Aielund, <br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-aielund-saga-t515487.html\" rel=\"noreferrer\" target=\"_blank\">the-aielund-saga-t515487.html</a><br/>\n<br/>\nc) Aielund is co-op as well, I have played it with friends and I have played it as a single player experience and both times rocked. It is not PvP but PvE (player versus environment).<br/>\nWhen you play in single player there are henchmen/henchwomen that you can take with you &amp; they are not the dumb ones that OC has but smart and resourceful.<br/>\nAnd there are plenty of them too. <br/>\n<br/>\nAielund as Max shouts in the module's thread is the greatest single player module that has ever been created for Neverwinter Nights.<br/>\nIn fact, it's so good that the author (Savant) has published a book about it. You can find it on Amazon as usual.<br/>\n<br/>\nd) Favoured Soul, Soul Knife &amp; Psychic Warrior are not in Aielund since it supports only the default classes.<br/>\nYou can add these classes with a hak-pack that it was popular back in the day (although it severely disturbed game balance) the PRC.<br/>\nMost people had problems with it though &amp; it is not easy to intergrade. <br/>\nYou can approach these classes philosophy however with the proper builds, it isn't that hard.<br/>\n<br/>\ne) Now, I don't remember if Aielund allows for conflicted alignments, we will need the help of Empyre or Mick or Stagmeister here, they have played it more times than I.<br/>\n<br/>\nFinally, if you do not know how to install those modules then don't hesitate to ask for help. <br/>\nNeverwinter Nights has an incredible amount of really good modules (Bastard of Kosigan, Diablo - the Lord of Terror, Prophet, Swordflight, etc) and I suggest that you start playing those instead.<br/>\n<br/>\nHave fun.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "7:02 AM - Dec 28, 2018",
      "content": "<div>Thanks Valerfor. I do need help installing other mods. The other mods area on, in the game, is empty. The only content is the content that came with the game, and the multiplayer, PW list.<br/>\n<br/>\nAnd all the topics, links, forums on this and Beamdog forums are about the NVWN 1 EE on either PC, Hybrids, Tablets.<br/>\n<br/>\nAnd even the Vault doesnt tell you if the mods are available on phone, and how to download install them on phone.<br/>\n<br/>\nIt does tell how to download install to PC, in a way that seems complicated, but doesnt tell how to download, install mods on phone, and if it did, it might be hard.<br/>\n<br/>\nIts not like can just goto google play and download, install mods for the game on the phone, altho wish could, wish was that easy.<br/>\n<br/>\nSo probably going to need help figuring this out.<br/>\n<br/>\nSo I would welcome any help.<br/>\n<br/>\nSo please do help, thanks.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "3:10 PM - Dec 28, 2018",
      "content": "<div>Went to the Vault again. Looked at Aielund. Went to download files section. Says need CEP, hakpacks, and the main files for each act, are in .rar extensions. If click these file download links, they will download to PC and Hybrid Tablet PC's, but they wont download to Android Smart Phones. And even if they could, probably would not be able to install as would probably would have to MANUALLY install.<br/>\n<br/>\nAnd Smartphones are usually not designed to manually install. Usually you download from google play, or Amazon, or whatever source, then it auto installs after finished downloading. <br/>\n<br/>\nThat probably cant, wont happen with CEP, HAK PACK, .rar files that are usually designed for computer.<br/>\n<br/>\nSo unless you can help me, its probably a no.<br/>\n<br/>\nToo bad, looks like a good series of mods.<br/>\n<br/>\nIf Aielund wants Mobile Smart Phone players, its probably going to want to make it so that can go to either google play, or Amazon, download the required batch of files(CEP, HAK, .RAR), in a batch program, that can download, auto install from google play, Amazon.<br/>\n<br/>\nAnd that also probably goes for the mods that dont come with the game.<br/>\n<br/>\nAnd that will probably take time, as NVWN 1 EE, came out on Android mobile smart phones, tablets, on google play about 2 months ago.<br/>\n<br/>\nAlso the mobile smart phone, tablet version of the NVWN 1 EE game does not have the DM client, Aurora, mod creator.<br/>\n<br/>\nNVWN1 EE on PC has those things, but tablet, smart phones do not<br/>\n<br/>\nSo since the game on Smart phone dont have what the PC versions have, that why the other mods section on the game launcher, is empty, and why only have the main mods that come with the game, and why cant seem to download, install, play custom, community mods like Aielund.<br/>\n<br/>\nSo probably will have to wait and or go without.<br/>\n<br/>\nAnd if there is a way, I dont see it, and will probably need some help.<br/>\n<br/>\nAnd it seems like 99% of players playing this game are on PC, Hybrid PC tablets, as there are no topics, on this and beamdog forums, and have not gotten any responses to me asking for help on, about this issue<br/>\n<br/>\nSo it looks like its the main mods, multiplayer/PW list that came with game, unless you, others can help</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:56 AM - Dec 29, 2018",
      "content": "<div>If I get it right, you are playing from your smartphone is that correct?<br/>\nWell, I searched a lot in order to find a way to help you Asturonethoriusaline and the best that I found is that page directly from Beamdog.<br/>\nHere is the quote from that page:<br/>\n\" In order to install custom content to Neverwinter Nights: Enhanced Edition on Android, you will need a way to add files onto the Android file system. <br/>\nWe suggest you use a desktop computer and a USB connector cable (data cable).\"<br/>\n<br/>\nOtherwise, the procedure is easy enough to follow, <br/>\nHere is the relevant passage again directly from Beamdog's page:<br/>\n\" Custom content downloaded to your desktop can be installed to Neverwinter Nights: Enhanced Edition on Android by dropping files into the appropriate sub-folder:<br/>\n    a) Modules should be installed to the modules folder<br/>\n    b) Hak packs should be installed to the hak folder<br/>\n    c) Talk tables should be installed to the tlk folder<br/>\n    d) Override packs should be installed to the override folder<br/>\n    e) Custom portraits should be installed to the portraits folder\"<br/>\n<br/>\nHere is the page of reference, updated on 4th of December,<br/>\nBeamblog =&gt; <a class=\"postlink\" href=\"http://blog.beamdog.com/2018/12/how-to-install-custom-content-to.html\" rel=\"noreferrer\" target=\"_blank\">http://blog.beamdog.com/2018/12/how-to- ... nt-to.html</a></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:57 AM - Dec 29, 2018",
      "content": "<div>That's all I could do man, <br/>\nI hope you find a way to experience the awesome custom content for Neverwinter Nights somehow.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "2:15 PM - Dec 30, 2018",
      "content": "<div>Hey thanks Valerfor, I might try that. Century Link says that somebody either has to die(their words), or cancel, stop their, service, etc, before we can get internet where we are. Century Link is only provider in area.<br/>\n<br/>\nBut maybe can use Mobile Wifi Hotspot to download the content to computer, then try what you say to try.<br/>\n<br/>\nSo maybe can try that some other time.<br/>\n<br/>\nI have tried, am playing Arolith from the Multiplayer PW list. They have a server with mods, DM sessions running constantly that does not require me to install anything.<br/>\n<br/>\nBut the only reason playing there is to build a Monk/Bard/Assassin, as they allow that combination, lawful bards.<br/>\n<br/>\nBut RP is enforced, the time, rest, food, and water system drain your stats, if dont rest, eat, drink water in time. And even rats are, can be tough. You level up slower, after the first 2 near free level ups. And have to get 3 bard levels before will let me take monk level at level 4. There are server errors, glitchs, fast respawn rates that caused my character to die 2 times. You lose gold(unless banked), small amount of xp, every time die, and respawn at beginning of game.<br/>\n<br/>\nThey have a bonus gift, feat like system, at character creation. I took a +2 Dexterity gift that adds +1 ECL(Makes you earn more xp to level up) And a +4 to Hide, +4 to Move Silently gift(No + to ECL), +6 to Perform(no + to ECL)<br/>\n<br/>\nAlso beginning to think healing potions are either Almost non existent, an or dont want healing potions at lower level. Can't even find healing potions for sale by merchants, and if there were, sure they would cost like 1000 to 5000 gold for 1 cure light wounds potion.<br/>\n<br/>\nBut maybe thats because almost everyone can supposedly create items, potions, etc, by spending crafting points from creation, level up, on crafting skills, and then finding the right materials, then sometimes paying gold, to make item.<br/>\n<br/>\nAlso if use any kind of magic, must have a deity, must pray to that deity occasionally and must pay at least 100 gold occassionally if want higher level spells to work.<br/>\n<br/>\nSo my Monk/Bard/Assassin projected build is:<br/>\n<br/>\nLevel 3<br/>\n<br/>\nHalfling Bard<br/>\n<br/>\n5142 Xp(amost to 6000 xp level up to level 1 monk)<br/>\n<br/>\nLE<br/>\n<br/>\nAC 17(21)<br/>\n<br/>\nHP 18<br/>\n<br/>\nSaves<br/>\n<br/>\nReflex 8<br/>\n<br/>\nWill 7<br/>\n<br/>\nCon 1,2<br/>\n<br/>\nBAB +2(+6,7)<br/>\n<br/>\nStats<br/>\n<br/>\nStr 10<br/>\n<br/>\nDex 16(18(Dex gift +2 dex)<br/>\n<br/>\nCon 10<br/>\n<br/>\nInt 12<br/>\n<br/>\nWis 16<br/>\n<br/>\nCha 12<br/>\n<br/>\nFeats<br/>\n<br/>\nDodge, Weapon Finesse<br/>\n<br/>\nSkills<br/>\n<br/>\nConcentration 2<br/>\n<br/>\nDiscipline 3<br/>\n<br/>\nHeal 1<br/>\n<br/>\nHide 6(14(+4 dex+4 gift)<br/>\n<br/>\nMove Silently 5(13 (+4 dex+ 4 gift)<br/>\n.<br/>\nPerform 3(10(+1 cha +6 gift)<br/>\n<br/>\nSpellcraft 2<br/>\n<br/>\nTumble 2,3<br/>\n<br/>\nUMD 2<br/>\n<br/>\nParry 1<br/>\n<br/>\nListen 2</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "12:14 AM - Jan 03, 2019",
      "content": "<div>Build update:<br/>\n<br/>\nSwifty Rastirone<br/>\n<br/>\nProjected: Bard 7, 8/Assassin 7, 8/ Shadowdancer 5<br/>\n<br/>\nHalfling<br/>\n<br/>\nBard 5/Assassin 1<br/>\n<br/>\nAlign: LE<br/>\n<br/>\nHp: 33<br/>\n<br/>\nBAB:3<br/>\n<br/>\nTotal AB:8<br/>\n<br/>\nAC: 21(Modified 25,26)<br/>\n<br/>\nWithout Magical gear, buffs: 10 + 2 + 4 + 1 = 17<br/>\n<br/>\nWith Magical gear buffs<br/>\n<br/>\n21=10 + Leather(2) + Dex Bonus(5) + 1(shield) + 1 Amulet of Natural Armor + 1 Ring of Protection. +1(forget where)<br/>\n<br/>\n25,26,27=10 + 2 + 5 + 1 + 1 + 1 + 1 + 2,3(Mage Armor(would be +4 but some of it doesnt stack) + 1,2 (Protection from Align) + 1 from Cat's Grace) +1,2 from potion of Barkskin<br/>\n<br/>\nIn combat: AC = 29<br/>\n<br/>\n21/23/24/25/26/27(depending on number of buff ups) +1 (dodge bonus) + 1 (halfling size bonus) = 29<br/>\n<br/>\nSaves:<br/>\n<br/>\nReflex: 12<br/>\nWill: 5<br/>\nCon: 2<br/>\n<br/>\nFeats<br/>\n<br/>\nDodge<br/>\nWeapon Finesse<br/>\nMobility<br/>\n<br/>\nSkills<br/>\n<br/>\nHide 9(14)<br/>\nMove Silently 8(13)<br/>\nPerform 6(8)<br/>\nTumble 5(10)<br/>\nConcentration 4(4)<br/>\nDiscipline 4(4)<br/>\nDisable Device 3(5)<br/>\nSpellcraft 3(5)<br/>\nUse Magic Device 3(5)<br/>\nListen 3(5)<br/>\nOpen Lock 2(7)<br/>\nHeal 2(2)<br/>\nParry 2(7)<br/>\n<br/>\nClass Abilities:<br/>\n<br/>\nBard Song(5 times)<br/>\n<br/>\nBard Spells<br/>\n<br/>\nDeath Sneak attack 1D6/and conditional Paralyzation<br/>\n<br/>\nUse Poison<br/>\n<br/>\nSpells<br/>\n<br/>\nLev 0<br/>\n<br/>\nAll<br/>\n<br/>\nLevel 1:<br/>\n<br/>\nMage Armor<br/>\n<br/>\nCure Light<br/>\n<br/>\nSummon Monster 1(Dire Badger)<br/>\n<br/>\nProtection from Alignment<br/>\n<br/>\nLevel 2<br/>\n<br/>\nCat's Grace<br/>\n<br/>\nCure Moderate Wounds<br/>\n<br/>\nSound Burst(1d8, paralyzation 2 rounds)<br/>\n<br/>\nFinished Peninsula<br/>\n<br/>\nFinished Zoo quest in Blacklake<br/>\n<br/>\nAt middle of Blacklake<br/>\n<br/>\nWorking on Hodge Estate, art object quest<br/>\n<br/>\nWorking on getting Dryad from Dryad<br/>\n<br/>\nWorking Arena Battles. Completed first fight.<br/>\n<br/>\nWhen complete black lake, will update in 2,3,4 more levels.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:38 AM - Jan 03, 2019",
      "content": "<div>I think the usual order would have you doing the Beggar's Nest before Blacklake. Blacklake might be hard than it is supposed to be for you, followed by the Beggar's Nest being \"too easy\". On the other hand, the OC does attempt to adjust for your level being \"too high\" or \"too low\", so it might work out alright anyway, except for the bosses and mini bosses.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "7:13 PM - Jan 03, 2019",
      "content": "<div>Yeah your right. Meldanenan's apprentice (Master has the Dryad cure reagent)is kicking my arse.<br/>\n<br/>\nPart of the trouble is that after using Tomi, I went with the cleric, then the bard.  The bard hangs back too much allowing the apprentice to get off its deadly ice area of effect.<br/>\n<br/>\nThe other part of problem is that altho I sneak in, death strike paralyze the apprentice wizard for 2,3 rounds, after that, despite doing damage that should interrupt doom spell, the apprentice still gets off spell over and over. Thing must have epic CONCENTRATION SKILL IGNORE DAMAGE FEAT STILL CAST SPELL FEAT.<br/>\n<br/>\nSo I'm either going to go grab Grim the Monk or red tiger, and see if that helps. Probably will.<br/>\n<br/>\nBut if doesnt will go to beggars nest next.  Then come back. Beggars nest is where I was, am going next anyways.<br/>\n<br/>\nExcept for the apprentice, and Loxar, and the Tyr Tomb Quest area, Blacklake has been a relatively piece of cake, extremely easy.<br/>\n<br/>\nAlso need to find some poison to use now that prestiged into assassin.<br/>\n<br/>\nAlso the sooner get uncanny dodge and evasion the better.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "10:09 AM - Jan 06, 2019",
      "content": "<div>Update:<br/>\n<br/>\nSwifty Rastirone<br/>\n<br/>\nHalfling<br/>\n<br/>\nLevel 8<br/>\n<br/>\nBard 5/Assassin 2/Shadowdancer 1<br/>\n<br/>\nStats<br/>\n<br/>\nStr 10<br/>\n<br/>\nDex 18(20)(24)<br/>\n<br/>\nCon 10<br/>\n<br/>\nInt 14<br/>\n<br/>\nWis 10<br/>\n<br/>\nCha 14<br/>\n<br/>\nHp 40<br/>\n<br/>\nAC 30(after all buff ups, dex bonuses, gear, in combat with dodge bonus, halfling bonus)<br/>\n<br/>\nBAB +4<br/>\n<br/>\nTotal AB(after everything stackable combined) +14<br/>\n<br/>\nFeats<br/>\n<br/>\nDodge Weapon Finesse Mobility<br/>\n<br/>\nSkills<br/>\n<br/>\nHide 10(15)<br/>\n<br/>\nMove Silently 8(15)<br/>\n<br/>\nTumble 7(12)<br/>\n<br/>\nPerform 6(8)<br/>\n<br/>\nSearch 5(7)<br/>\n<br/>\nConcentration 4(4)<br/>\n<br/>\nDiscipline 4(4)<br/>\n<br/>\nListen 4(6)<br/>\n<br/>\nSpot 3(3)<br/>\n<br/>\nHeal 3(3)<br/>\n<br/>\nSpell Craft 3(5)<br/>\n<br/>\nUse Magic Device 3(5)<br/>\n<br/>\nDisable Traps 4(6)<br/>\n<br/>\nOpen Locks 3(8)<br/>\n<br/>\nParry 2(7)<br/>\n<br/>\nLeather Armor +1(+2 + 1= 3)<br/>\n<br/>\nBoots of the Sun Soul +2<br/>\n<br/>\nLarge Shield +1(+2 +1=3)<br/>\n<br/>\nAmulet of Natural Armor +1 to AC<br/>\n<br/>\nRing of Protection +1 to AC<br/>\n<br/>\nBelt of Spell Resist 12<br/>\n<br/>\nItem of Dex +1 to dex<br/>\n<br/>\nSickle +1<br/>\n<br/>\nAll four areas including blacklake, docks, beggars nest done<br/>\n<br/>\nStarting the search, chase for Desther, Fenthick quest, section of game(spoiler)<br/>\n<br/>\nWill update in about 2,3 levels</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "9:53 PM - Jan 09, 2019",
      "content": "<div>Final Update:<br/>\n<br/>\nI got Swifty Rastirone to Level 9<br/>\n<br/>\nCompleted prelude, chapter 1, started chapter 2, in the middle of caves quest<br/>\n<br/>\nBard 5/Assassin 2/Shadowdancer 2<br/>\n<br/>\nHalfling<br/>\n<br/>\nStats <br/>\n<br/>\nStr 10<br/>\n<br/>\nDex 18(22)<br/>\n<br/>\nCon 10<br/>\n<br/>\nInt 14<br/>\n<br/>\nWis 10<br/>\n<br/>\nCha 14<br/>\n<br/>\nHp 49<br/>\n<br/>\nNE<br/>\n<br/>\nBAB 4,5<br/>\n<br/>\nTotal AB: 14,15<br/>\n<br/>\nAC in combat: 32<br/>\n<br/>\nSaves<br/>\n<br/>\nReflex 17<br/>\n<br/>\nWis 5,6<br/>\n<br/>\nCon 2,3<br/>\n<br/>\nFeats<br/>\n<br/>\nDodge Weapon Finesse Mobility Expertise<br/>\n<br/>\nSkills<br/>\n<br/>\nHide 10(16)<br/>\n<br/>\nMove Silently 8(15)<br/>\n<br/>\nTumble 7,8(13,14)<br/>\n<br/>\nSearch 7<br/>\n<br/>\nPerform 6(8)<br/>\n<br/>\nSpot 5<br/>\n<br/>\nListen 5(7)<br/>\n<br/>\nConcentration 4,5<br/>\n<br/>\nDscipline 4,5<br/>\n<br/>\nDisable Device 4(6)<br/>\n<br/>\nHeal 4<br/>\n<br/>\nSpell craft 4(6)<br/>\n<br/>\nOpen lock 3,4(9,10)<br/>\n<br/>\nParry 2,3(8,9)<br/>\n<br/>\nUMD 3,4<br/>\n<br/>\nEnding build here<br/>\n<br/>\nWhy?<br/>\n<br/>\nBecause after taking 9th level expertise, I realized the following<br/>\n<br/>\n1.Hard because many feats to do 2 weapon path.<br/>\n<br/>\n2. Bard's perform skill taking away skill points.<br/>\n<br/>\n3. Lower Hp, and lower BAB<br/>\n<br/>\nTo fix this problem I have decided to go with a Ranger/Assassin/Shadowdancer build.<br/>\n<br/>\nI will explain reasoning in another different thread since this is a thread about Bard/ Assassin/ Shadowdancer not about a Ranger/ Assassin/ shadowdancer <br/>\n<br/>\nSo done with this thread.<br/>\n<br/>\nTo see reasoning why Ranger/ Assassin/ Shadowdancer, and to help, etc, and if want then can come see the thread I will make about Ranger/Assassin/Shadowdancer.<br/>\n<br/>\nThanks for viewing, reading, helping, participating in this thread.</div>"
    }
  ]
}