{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "616",
  "name": "Mines of Twin Summits - Fighter/ Bard/ RDD, feedback wanted",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/mines-of-twin-summits-fighter-bard-rdd-feedback-wa-t2355457.html",
  "author": "Lazy Lizard",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "448",
  "posts": [
    {
      "author": "Lazy Lizard",
      "avatar": "no_avatar.png",
      "timestamp": "9:17 AM - May 03, 2020",
      "content": "<div>Hello everyone,<br/>\n<br/>\nSo far I have never played an devasting critical character but i have decided i want to give it a try. Mines of Twin Summits seems to be popular here en looks like a nice module to try one out.<br/>\n<br/>\nAfter some browsing i think that <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/panthro-the-strongest-dever-in-the-world-fighter-1-t2354901.html\" rel=\"noreferrer\" target=\"_blank\">PANTHRO: The Strongest Dever in the World! by Valerfor</a> is a nice starting point. <br/>\nSeeing that Mines of Twin Summits is made for multiple players and i want to solo it, i figure that it might be wise to take a slightly more defensive approach. Furthermore i enjoy versatile builds and some spellcasting abilities. With that in mind i was thinking about making following tweaks:<br/>\n<br/>\nRace: Human<br/>\nSTR -  18 (42) <br/>\nDEX -  8 <br/>\nCON - 12 (14) <br/>\nINT –  14 (16) <br/>\nWIS -  08 <br/>\nCHA - 12 (14) <br/>\n<br/>\nFeats:<br/>\nI think i would like to focus on Scimitar so i can use shield for extra AC. <br/>\nFor the bonus feat I was leaning towards expertise as it gives me some extra defense and combines nicely with taunt. But i was also thinking about improved knockdown and extend spell (and taking cha 14), and i am interested in opinions on the matter.<br/>\n<br/>\nSkills:<br/>\nIf i take bard at the first level i think i have more than 90 extra skill points.<br/>\nMaxing taunt en spellcraft seems like a good idea. I was also considering to max UMD. Are there any items for which this is usefull?<br/>\nThat leaves about 20 skill points i don't really know what to do with as i have no idea what is useful in Mines of Twin Summits. Persuade? Search? Listen? Pick Pocket? Something completely different? <br/>\n<br/>\nSpells:<br/>\nLevel 1 till 4 seem to contain some nice buffing and utility spells. Level 5 and 6 seem a bit underwhelming by contrast and not really worth dropping CON to 10 for, or am i missing something?<br/>\n<br/>\nOverall this seems like a quite versatile and powerful build to me, but i am very interested you all think!</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:00 AM - May 03, 2020",
      "content": "<div>A solid build and it is hard to go wrong.  Taking bard at level 1 is recommended assuming you have the charisma minimum (which you do).<br/>\n<br/>\nHuman is the most mechanically advantageous race for most builds and fits in well to your approach.<br/>\n<br/>\nScimitar is a solid modification as well actually enhancing the critical hit process and trading raw damage for a shield.<br/>\n<br/>\nThere is a solid natural breakpoint for weak casters on a bard build at level 4 spells.  You will be highly susceptible to dispels and your spell durations will be low.<br/>\n<br/>\nThe choice in how useful extend is will be tied into the module.  If there is no source of the animal/zoo buffs in the module it might be worth it but doubling rounds or turns per level and casting those spells one level higher is likely not worth the feat investment.  <br/>\n<br/>\nEven a deep bard build the worthiness of level 5/6 spells is questionable.  The worthiness of level 5 slots for extending your level 4 spells is more worth it and then level 6 for Dirge is hard not to justify a stretch for 1 extra point.  Hence the natural break point at 4.<br/>\n<br/>\nI cannot speak to what skills will be useful in that particular module but unless the module is really wonky you cannot go wrong with Taunt, UMD and a detection skill (spot and/or listen with a dip into search).  Lore and/or Appraise is also often useful in modules where coin is tight but no clue if that is the case there.<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:32 PM - May 03, 2020",
      "content": "<div>Hello and welcome, Lazy Lizard!<br/>\n<br/>\nI'm guessing you've already read this thread, but just in case, here it is: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/mines-of-twin-summits-1-2-and-3-t2354731.html\" rel=\"noreferrer\" target=\"_blank\">Mines of Twin Summit</a><br/>\n<br/>\nTo be honest, you should be fine with the Panthro build as it is, but of course you should feel free to tweak as you see fit. I'd avoid scimitar, though, if you're going for a one-hander. I know that sounds counter-intuitive, given the threat range of scimitar, it's just that there aren't many top-end scimitars in the modules (and it does end up very high magic - +10 and +12 items and weapons are available in part 3, by which point you'll be at or close to level 40). Longsword and warhammer both work fine, from personal experience, others may have advice on different weapons. I know kamas and monk gloves are present in abundance, but this is not the build for them. Greatsword and greataxe are also well-catered for, if you fancy going with a two-hander.<br/>\n<br/>\nIf you do the OC before going into MTS you should have better gear than most of that available in the first module, and will start at about level 17. That is, of course, if you're ok with playing the OC. If not, I'd advise you start off with +3 or +5 gear and weapons.<br/>\n<br/>\nI understand what you say about Expertise, but I'd go with Imp KD without hesitation. It is very much a hack and slash series of modules, and you'll need to be on the offensive most of the time. At least one detection skill (Listen, Spot) is a good idea, and Search can also be helpful. UMD is always a good thing, and for these mods particularly for the gear you'll be able to equip. I wouldn't worry overmuch about spells, but that might be my natural bias creeping in.<br/>\n<br/>\nI don't want to give away too many spoilers (be aware, there are some in the above thread), so I'll leave it at this for now (unless you want more). Enjoy your build, it should be more than capable of soloing the saga!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Lazy Lizard",
      "avatar": "no_avatar.png",
      "timestamp": "4:36 PM - May 03, 2020",
      "content": "<div>Thanks a lot for the feedback!<br/>\n<br/>\nI'll keep spellcasting limited to lvl 4 and pick Imp KD as the feat.<br/>\n<br/>\nAs for the choice of weapon, this presents a new dilemma. Longsword/ shield seems nice and safe but if i really spent most of my time on offense a greatsword also looks very tempting...  It also depends on how necessary a high AC is and how the good shields are in MTS i suppose. <br/>\n@Stagmeister if you, or anyone else with experience playing MTS, would like weigh in on this (without giving too much spoilers), i would greatly appreciate it!<br/>\n<br/>\nCheers</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:53 PM - May 03, 2020",
      "content": "<div>My first play-through was with a scimitar, and all I could find until near the end of chapter 3 were +x scimitars, with the x gradually increasing to about +8 or maybe +9.  Meanwhile, I was xeeing lots of good longswords.  For a Dev Crit build, I would choose longsword over warhammer because it has more crits.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:34 PM - May 03, 2020",
      "content": "<div>Without wishing to blow my own trumpet here, I have a build with a weapon focus in both longsword and greatsword, so you get the 1.5 damage from the two-hander, but can grab a shield and a longsword if you run into trouble. Admittedly, it sacrifices a lot of Bard levels, but it was only really intended as a meleer with a happy tune. Anyway, see what you think. <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/firewing-of-corellon-bard-8-cot-22-rdd-10-t2355058.html\" rel=\"noreferrer\" target=\"_blank\">Firewing of Corellon</a><br/>\n<br/>\nI've played her in MTS and she works just fine.<br/>\n<br/>\nEven if you don't like her, it's worth pointing out that are some spectacular greatswords available throughout MTS (and you can take the Dagger of Chaos and/or that greatsword with fire on it from the OC with you)<br/>\n<br/>\n<details><summary>Spoiler</summary>If you take the fiery one, I'd definitely do Zael's Peak before Khor's. Not only because Zael's is full of frost giants, where Khor's is fire giants, but you'll also find Avalanche there, which does cold damage - much better against the fiery ones!\n</details>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Lazy Lizard",
      "avatar": "no_avatar.png",
      "timestamp": "8:55 AM - May 05, 2020",
      "content": "<div>Thanks for the input, i do appreciate it! I would have been quite annoyed if i had specialized in scimitars, only to find out that there are no good ones in MTS, like @Empyre65 did. <br/>\n<br/>\n<br/>\n@Stagmeister that also seems like a nice build indeed, but i think i prefer the improved singing/ casting that the extra bard levels in my current build provide, so i'll stick with that. <br/>\nI have decided to go with longsword/ shield because the extra defense feels to have nice and it seems to me the it is nearly as good offensively against non crit immunes. It is off course weaker offensively against crit immunes, but you can't have it all. <br/>\n<br/>\nBut enough with the theorycrafting, while i enjoyed it, because it is now time to smash some baddies to bits! :D</div>"
    }
  ]
}