{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Bioware Legacy Builds",
  "forum_id": "008",
  "id": "000",
  "name": "RE: Reformatting of the Bioware Legacy Builds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/re-reformatting-of-the-bioware-legacy-builds-t515451.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": "0",
  "views": "4.3K",
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:41 PM - Sep 11, 2011",
      "content": "<div><strong>Hear Ye!  Hear Ye!</strong><br/>\n<br/>\nThanks to our beloved WaybackMachine, we are privileged to gaze upon epic builds that never were scrutinized by the ECB.  Well, in a round-about way, they probably were in a number of similar builds, but never directly.<br/>\n<br/>\nKudos to some degree should go to my younger blood counterparts, Bennie &amp; Tom, for their unselfish and tireless efforts to help me compile this historic build information, now formatted via Kamiryn's priceless CBC, the ultimate time-saver for us all. All the authors' original backgrounds and analytic information has been retained in as pristine condition as possible so you will miss nothing except the awesome-kewl character photos and character file downloads (the photos still appear in the cached version, so links have been provided for your convenience).<br/>\n<br/>\nBuild Notes <br/>\nThough all 26 of the original builds have been furnished in the ECB format, not all are viable builds since the advent of the latest patches:  \n<ul><li>Neither Dragon Kin nor Dragon Savant can be built today as originally designed.  [/*:m]</li>\n<li>The Infernal Warrior and Troubadour Guardian require alignment changes that may not be feasible on the server where you play.  [/*:m]</li>\n<li>The feat sequence in the Rogue Archer must be slightly modified to integrate the v1.69 Epic Dodge feat properly.  [/*:m]</li>\n<li>The Improved Sneak Attack feats of the Dark Stalker are bugged since v1.66 which requires either Rogue or Blackguard sneak attack (or an item which grants same) to benefit from the added sneak damage of Imp SA (per Demos). [/*:m]</li></ul>[/list]<br/>\nIn addition, where applicable, corrections to skill allocation have been provided without changing the integrity of any build and duly noted.  Also, the Eldritch Archer and Holy Paragon builds are based on PRC rules and can only be built and used within that custom environment.<br/>\n<br/>\nPlease! DO NOT ask me personally to justify any of the authors' reasons for how or why they built the character they did.  In some cases, I may guess correctly but that would be a truly clairvoyant effort.  Still, feel free to pose any inquiry to the guild in general because THEY are the most reliable resource still available to assess the merits of epic builds.  If you should notice any inconsistencies with the original build that may have slipped by during the conversion process... please PM me here on the forumer for corrections.<br/>\n<br/>\nI hope you all enjoy this glimpse of the past as much as I have had compiling them.  So... sit back... move that control lever back a few notches on the teleportation throttle and peruse the Bioware Legacy Builds!<br/>\n<br/>\nP.S.  For all you staunch ECB veterans who would like to help make the connection from the parents to the \"child builds\" of today, please PM me with any links to those more contemporary and improved versions you remember.  Help us to complete the evolution cycle that was started years ago!</div>"
    }
  ]
}