{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "696",
  "name": "Scott Sterling (Barbarian 29 / Ranger 1 / Fighter 10)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/scott-sterling-barbarian-29-ranger-1-fighter-10-t2355338.html",
  "author": "Yunim",
  "avatar": "10759176_1572007808.png",
  "replies": 17,
  "posts": [
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "12:39 AM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">The man. The myth. The legend. [<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/8F9jXYOH2c0\" style=\"background:url(https://i.ytimg.com/vi/8F9jXYOH2c0/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><br/>\nThe only thing this build can do is block attacks with it's face hence the inspiration for the name.<br/>\n<br/>\nThis build gets the highest fully buffed HP a PC can achieve in vanilla NWN, excluding temporary HP.<br/>\nThere is nothing good about this build other than achieving the highest HP, I do not recommend actually playing this build. Pretty much any build with EDR3 makes for a better DR tank than this. Almost any build that builds for combat will be a better offensive build than this. I really can't emphasise enough how much I advise against playing this build. If you want high HP with a character that isn't terrible just make a Dragon Shape build.<br/>\n<br/>\nThis build has 1458 HP at level 40 with +12 CON. It also has 7/- Physical DR and 5/- DR to all 5 elemental damage types, both of which can be beaten by an actual tank. In a +5 EB environment with +12 STR it has a whopping +44 AB so I hope you enjoy rolling for 20s. This build doesn't have UMD but it can use crafted divine wands from level 21 onwards. In pre-epic levels it just plays like a mediocre Barbarian but in epic levels the terrible offence will be much more noticeable. There is an XP penalty from level 21 onwards but if you're masochistic enough to actually play this build you probably won't care about that.<br/>\n<br/>\nThe level layout can't be changed at all. A Barb10/DD18/Figh12 has 12/- Physical DR but it requires an alignment change and only reaches a measly 1456 HP.<br/>\n<br/>\nDwarf and gnome are the only viable races for this build. I chose dwarf for the extra STR but it honestly doesn't matter because this build has no offensive capabilities anyway.<br/>\n<br/>\nThe only important ability is CON, the other abilities don't matter at all and can be altered.<br/>\n<br/>\nThe only pre-epic feat that is essential is Toughness, Blind Fight and Resist Energy can be replaced with anything else.<br/>\n<br/>\nSince it's just a rough build I didn't bother with a full skill progression. You can drop any of the skills since none of them affect HP at all.<br/>\n<br/>\n===<br/>\n<br/>\nClass: Barbarian 29 / Ranger 1 / Fighter 10<br/>\nRace: Dwarf<br/>\nAlignment: Any Non-Lawful<br/>\nPlayability: 1-20 PvM<br/>\n<br/>\nSTR: 16<br/>\nDEX: 8<br/>\nCON: 20 (36)<br/>\nWIS: 8<br/>\nINT: 12<br/>\nCHA: 6<br/>\n<br/>\n01: Barbarian(1): Blind Fight<br/>\n02: Barbarian(2)<br/>\n03: Barbarian(3): Resist Energy: Fire<br/>\n04: Barbarian(4): CON+1, (CON=21)<br/>\n05: Barbarian(5)<br/>\n06: Barbarian(6): Resist Energy: Cold<br/>\n07: Barbarian(7)<br/>\n08: Barbarian(8): CON+1, (CON=22)<br/>\n09: Barbarian(9): Resist Energy: Acid<br/>\n10: Barbarian(10)<br/>\n11: Barbarian(11)<br/>\n12: Barbarian(12): CON+1, Resist Energy: Electricity, (CON=23)<br/>\n13: Barbarian(13)<br/>\n14: Barbarian(14)<br/>\n15: Barbarian(15): Resist Energy: Sonic<br/>\n16: Barbarian(16): CON+1, (CON=24)<br/>\n17: Barbarian(17)<br/>\n18: Barbarian(18): Toughness<br/>\n19: Barbarian(19)<br/>\n20: Barbarian(20): CON+1, (CON=25)<br/>\n21: Ranger(1): Great Constitution I, Epic Toughness I, (CON=26)<br/>\n22: Fighter(1): Epic Toughness II<br/>\n23: Barbarian(21)<br/>\n24: Barbarian(22): CON+1, Great Constitution II, (CON=28)<br/>\n25: Barbarian(23)<br/>\n26: Barbarian(24): Epic Toughness III<br/>\n27: Barbarian(25): Great Constitution III, (CON=29)<br/>\n28: Barbarian(26): CON+1, (CON=30)<br/>\n29: Fighter(2): Epic Toughness IV<br/>\n30: Fighter(3): Great Constitution IV, (CON=31)<br/>\n31: Fighter(4): Epic Toughness V<br/>\n32: Fighter(5): CON+1, (CON=32)<br/>\n33: Fighter(6): Great Constitution V, Epic Toughness VI, (CON=33)<br/>\n34: Fighter(7)<br/>\n35: Fighter(8): Epic Toughness VII<br/>\n36: Fighter(9): CON+1, Great Constitution VI, (CON=35)<br/>\n37: Fighter(10): Epic Toughness VIII<br/>\n38: Barbarian(27)<br/>\n39: Barbarian(28): Epic Toughness IX, Epic Toughness X<br/>\n40: Barbarian(29): CON+1, (CON=36)<br/>\n<br/>\nAnimal Empathy 1(0), Disable Trap 1(2), Discipline 43(46), Open Lock 1(0), Pick Pocket 1(0), Set Trap 1(0), Spellcraft 21(22), Spot 19(18), Taunt 43(41), Tumble 20(19)<br/>\n<br/>\n===<br/>\n<br/>\nNaked Stats<br/>\nHitpoints: 1218<br/>\nSkillpoints: 195<br/>\nSaving Throws (Fortitude/Will/Reflex): 35/15/15<br/>\nSaving Throw bonuses: Spells: +6, Traps: +5, Poison: +2<br/>\nBAB: 30<br/>\nAB (max, naked): 33 (melee), 29 (ranged)<br/>\nAC (naked/mundane armor/shield only): 13/24<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nBuffed Stats (Assuming 12 STR, +12 CON, +5 EB weapons, +5 AC items, and Haste)<br/>\nAB: 30 (BAB) + 9 (STR) + 5 (EB Bonus) = +44<br/>\nAC: 10 (Base) - 1 (DEX) + 4 (Tumble) + 8 (Armor) + 3 (Shield) + 25 (AC Bonus) + 4 (Haste) = 53<br/>\nHP: 458 (Base) + 560 (CON) + 240 (Feats) = 1458<br/>\nFortitude: 22 (Base) + 19 (CON) = 41<br/>\nReflex: 16 (Base) - 1 (DEX) = 15<br/>\nWill: 16 (Base) - 1 (WIS) = 15<br/>\n<br/>\n===<br/>\n<br/>\nThere are no other Barb/Rang/Figh builds in the archives since this is a fairly unique build.<br/>\n<br/>\nBarb24/Figh16 by NolDrek. [<a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build276953.html\" rel=\"noreferrer\" target=\"_blank\">https://world-of-greyhawk.github.io/bui ... 76953.html</a>]<br/>\nWith only 1368 HP fully buffed, this build sacrifices HP to get Mighty Rage.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:20 AM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is an interesting academic exercise.<br/>\n<br/>\nIn a party, one <strong>very much appreciates</strong> a high HP tank, particularly one with a fortitude save of 35+.<br/>\nA archer, cleric or mage can simply sit in the back lines dealing a large amount of damage, and if the tank falls, cast invisibility / greater sanctuary and raise this 1200+hp monster to restart again.<br/>\nRogues can enjoy dealing massive sneak attack damage, and non-tank meleers will enjoy dishing out damage with dual wielding or two handed weapons.<br/>\n<br/>\nI can see the potential with such a build much more than you make out. Sometimes the reader might appreciate something different for a change, something different, not the most optimal but playable. <br/>\n<br/>\nAfter a while one might get sick of playing dwarven defenders or want to try the barbarian class for a change, and there is nothing wrong with that. <br/>\n<br/>\nYou should include suggestions to make the build playable in a party or solo, in case the reader does want to take the build for a play on a server.<br/>\n<br/>\nTo make this build playable, I would suggest:<br/>\n- Drop resist energy sonic and cold for knockdown and great fortitude (some additional dev crit/implosion resistance)<br/>\n- Add 4 AB by taking WF/EWF/EP in the melee weapon of your choice. Drop three epic toughness feats (-60hp) and resist energy electricity for this. <br/>\n- Drop two cons for two strength +1 AB, (-40hp).<br/>\n<br/>\nYou will then hit Base AB 38 (again I encourage you to focus on this rather than buffed AB, as this is the universal language of the ECB), which is ok because you have taunt in the build which can reduce enemy's AC by 6, potentially, at the cost of 'only' 100hp. <br/>\n<br/>\nYou then have a build which can hit things like a 3/4 BAB class, even without taunt, in most low-mid magic environments, but have the HP of 3 fighters. With such incredible staying power combined with its AB and taunt, you will then have a build who can solo ok, but will really shine in a party situation. <br/>\n<br/>\n<strong>Edit:</strong> I would also drop two crossclass points in spellcraft for 19(20) spellcraft, and put four class points into spot when you take your ranger level. You could delay your ranger level if needed to do this. You lose nothing in terms of saves against spells, except a theoretical boost of a handful of 1 point from items, +skills from bard song or fox's cunning's spells or potions, and you gain the ranks in spot skill similar to half a watchman's helm. This provides a little more detection against sneakers, who need to fail a spot/hide check (not a listen check) otherwise they will land sneak attacks. This is more likely to be life saving to you and your party than the alternative.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "12:37 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I love him.  Irrepressible scoundrel!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "12:59 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Making this an actual playable build requires completely changing it.<br/>\n<br/>\nHigh CON barbarians are nothing new, there are multiple level layouts that would work although the AB would be terrible for almost all of them. A standard Barb/RDD would be able to get EDR3, Mighty Rage, Terrifying Rage, and a passable AB while still having a high HP. A CON Barb/PM with EDR3 would have much better defences while still having high HP. A STR DD would have higher AB, damage, and DR than this build. The only role that this build could potentially fill is a DR tank, and there are much better DR tanks out there.<br/>\n<br/>\nDR is more important than HP for a DR tank.<br/>\nHere is an example Rog13/DD26/Figh1 built for the server Blackstone Keep. [<a class=\"postlink\" href=\"https://blackstonekeep.com/viewtopic.php?p=35239#p35239\" rel=\"noreferrer\" target=\"_blank\">https://blackstonekeep.com/viewtopic.php?p=35239#p35239</a>]<br/>\nIt has 960 HP when fully buffed, Epic Dodge, 27/- Physical DR, and 10/- DR to all 5 elemental types. Even excluding Epic Dodge and the increased elemental DR, it has 20 more physical DR than this build and so in prolonged fights it is better than this build.<br/>\nIf the elemental DR isn't important then the HP can be increased to 1060 HP while still keeping 27/- Physical DR and Epic Dodge.<br/>\nIf desired this build can be edited to reach 1000 HP and +39 base AB (+50 buffed AB in a +5 environment), which I consider the absolute minimum AB for any combat build.<br/>\n<br/>\n23 Spellcraft is required to reliably identify spells of all levels and that is the minimum I aim for with all of my builds. Some people might not care about that but I use logs constantly so being able to identify every spell cast is very useful.  Even with +4 Spot this build is not a spotter and will not be able to detect a proper sneaker, although if Spellcraft is only wanted for saves then it's a good idea. Any sneaker that is an actual threat to the party will not be bothered by 22 Spot, especially since this build doesn't have Keen Senses.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:40 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well... it's a bit harsh on the reader to see you post a 1200hp monster then say don't play it and there is no solution you need to make another build.<br/>\n<br/>\nThe natural human instinct is to try to figure out a way to make it playable by balancing it out a bit. Some of the readers might not have the experience or confidence to figure it out.<br/>\n<br/>\nYou could easily fit EDR III into the build for example, by dropping 3 epic toughness feats. The fort score is a strength of this build over your other one you linked, and you could make your build more dev crit and implosion resistant by adding epic fortitude.<br/>\n<br/>\nBuilds don't have to be absolute powerbuilds to be successful. A friend of mine is working on a triple panther Druid 5+ / Wizard build. Wildshape I to turn into a panther. Wizard for a panther familiar. And summon creature using a custom summon palette to summon a panther. 3 panther sneak attack army. It's a bloody awesome idea if you ask me.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:11 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That penalty shootout is just hilarious <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nThe build is downright best at what it <span style=\"text-decoration:line-through\">does</span> is.<br/>\nYou can avoid the xp penalty by taking the ranger level late, in line with what Orion suggests. But that would be less masochistic and against the spirit of the build, so I have no further suggestions.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "9:10 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Rang1 is taken at level 21 in order to get access to divine wands as soon as possible. If you don't want an XP penalty or if you want to invest heavily in Search, Set Trap, or Spot then moving Rang1 to level 40 is the best option.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "9:48 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">All of the HP numbers in this post assume +12 CON and ignore the 100 temporary HP from Dragon Shape.<br/>\n<br/>\nThe warning is there for inexperienced builders who might see that this has the most HP and decide to make it despite the fact that it's a terrible build. Experienced builders shouldn't need a warning since it's easy to see how bad it is just by looking at it.<br/>\n<br/>\nIn order to make this a playable build you would need to drop HP for STR, AB feats, and EDR3. On top of that you will probably want to add Mighty Rage or Terrifying Rage since otherwise there isn't much point in making a Barbarian. At that point not only would you be making a completely different build, but you would be better off making a generic Barb28/Figh10/Rog2 or Barb28/Bard2/RDD10 that invests in CON more than usual. A CON based Barb20/Bard4/PM16 is a very defensive build that has over 1000 HP, PM immunities, EDR3, Terrifying Rage, and high AC (although slightly lower than a proper AC tank). All three of those high HP builds are better than this one, and this is just sticking with Barbarian as the core class. There are multiple DD builds that are better DR tanks than this, whether STR, DEX, CON, WIS, or even CHA focused. To name a few, there is Dru5/Shif13/DD22, Figh12/DD26/Rog2, Pal8/BG2/DD30, Rog13/DD26/Rang1, Rog16/Figh6/DD18, and many more.<br/>\n<br/>\nI mentioned in the original post that Dragon Shape is an easy way to make a viable high HP build, although due to being shifters I would hesitate to call them great builds. All of the Dragon Shape builds below have mediocre AB, 40/+6 DR, True Seeing, and the usual dragon immunities.<br/>\nA Dru18/Wiz21/Monk1 only gets 956 HP, but with +3 DEX it can reach 89 AC (99 in IExp) which should be enough to AC tank in most low/medium magic environments.<br/>\nA Dru32/Figh6/Monk2 can get 1252 HP, with +8 DEX and one +5 AC item it can reach 83 AC (93 in IExp), which again should be enough to AC tank.<br/>\nA Dru18/DD10/Figh12 can get 1304 HP, which I think is the highest HP a Dragon Shape build can achieve. It also has 6/- Physical DR but the AC is pretty mediocre and I wouldn't recommend it over the Dru32/Figh6/Monk2.<br/>\n<br/>\nIt took me less than 5 minutes to think of these builds, although testing them to make sure the numbers are correct took slightly longer. I can't recommend playing this build when I can easily think of more than 10 builds that are better in almost every way except for HP. This isn't even a case of a mediocre build that can be improved by slightly tweaking things, it would require a complete rebuild in order to become playable.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:35 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yunim brings up Dragon Shape builds and tanking.<br/>\n<br/>\nLet me stir the pot, so to speak, by expressing a strong view. <br/>\n<br/>\nDrama provides entertainment to the masses, and I believe we need some today.<br/>\n<br/>\nBefore v1.69, Order of Jormungandr was easily the best Dragon Shape build possible, but with the increased requirements for Dragon Shape, the classic build is no longer possible. The ECB created a v1.69+ Order of Jormungandr as a result, I think it is ok, but the most glaring weakness is that all buffs are dispellable now (whereas pre v1.69 the cleric buffs were undispellable). <br/>\n<br/>\nIf anyone wants my advice on how to make a strong dragon shape build:<br/>\n- <strong>go Druid heavy (26+, preferably as close to 38 as you can)</strong>. it makes your spells stronger and difficult to dispel, it grants you multiple bonus great wisdom feats to get requirements (Wisdom 30) before level 30. All your buffs are very much valued by your teammates in a party. This includes Freedom, Death Ward, Barkskin, Spell Resistance, Stoneskin etc. Empower Spell bulls strength, Extend spell blood frenzy / aura of vitality, you will hit the Str Cap and Wisdom Cap polymorphed with ease, and possibly the constitution Cap too. All that remains is the Dexterity stat which is harder to boost. <br/>\n- <strong>Dispels, particularly Mord's, are your enemy in Dragon Shape form</strong>. If you get dispelled, you lose a lot of AB and AC, and your combat power is greatly diminished. With a high caster level, you provide Mord's resistance against UMD users, and multiclassed mages, although your buffs will still struggle to remain against a pure caster. <br/>\n- <strong>Ignore Shifter as a result</strong>. If you are serious about a strong dragon shape build, <strong>shifter is a trap</strong>. It provides versatility in shapes, but if you are focused on dragon shape, it provides nothing that Druid doesn't already give, and as a result, your spells are worse, and you lose access to either Monk or UMD or divine might. You can use Shifter if you want Risen Lord, Kobold Commando, Rakasha form for sure. There are good things about those forms, however their AB is so greatly inferior to Dragon Shape that unless you are doing a dev crit HiPSing Kobold Commando type build (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/yip-yip-you-re-dead-druid-6-shifter-7-assassin27-t2355014.html\" rel=\"noreferrer\" target=\"_blank\">like Yip, Yip You're Dead by Mick Dagger</a>) or some other shifter special like a Risen Lord tank, you will be wondering why on earth you took the class. <br/>\n- <strong>Monk cheese is good</strong>. To those who don't understand what cheese is, this is a class which provides a lot with very little investment. Monk 1 gives so much to Dragon Shape's power in terms of AC and Monk UBAB that it is difficult to take any dragon shape build that doesn't take Monk seriously. Kail Pendragon, a noted Dragon Shape builder, has written this in the past in the ECB Archives. <br/>\n- <strong>Rogue cheese is good. </strong>Your third class should be one that provides a lot with very little investment. I believe <strong>UMD is the easiest to implement and probably best here</strong>, and due to alignment restrictions Rogue is best. Druids get a lot of skill points and it is good to dump them somewhere. Rogue 1 is the minimum, Rogue 3 is nice for uncanny dodge. <br/>\n- <strong>Divine might cheese remains to be tested in my view</strong>. I have written <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17611#p17611\" rel=\"noreferrer\" target=\"_blank\">this build draft</a> to see if a Druid 37-38 / Cleric 1 / Monk 1-2 to see if Divine damage addable by Divine Might makes the build stronger. It will certainly boost damage from both zen archery. Whether it boosts dragon shape damage output remains to be seen. Purely from a Dragon Shape perspective, I believe there will be problems as Druids have no inherent way to boost charisma, therefore your ability to use Divine Might, shifted, is going to be limited to equipped items (helmet/armor/shield) and eagle's splendor potions which will be easily dispelled but can be drunk whilst polymorphed. By the way, there is no point taking Divine Shield for Dragon Shape, as the Dragon already has +20 dodge AC, and Divine Shield will not provide any more. <br/>\n- Epic Warding / DD Damage Resistance /  Pale Master / Greater Smiting Dragons / Boosting BAB by taking a full BAB class -&gt; all a waste of time in my view. Your dragon does 5-7 attacks a round, its not worth losing 4 caster levels and delaying dragon shape for that single attack at the end, even if you have Monk UBAB, which may or may not hit. Epic Warding is nice but if you want that, play a Fighter / Pale Master and you can get that whilst being Crit immune with a better AB and being able to use items in combat. Dwarven Defender damage resistance? Just level up a Dwarven Defender. You want big great smites? Level up a paladin/CoT. If the focus is about playing a strong dragon all of these are interesting, quirky, but ultimately provide little to the Dragon Shape's power, which is essentially 1. the Dragon Shape feat 2. Monk cheese and 3. the spell buffs you can provide it. <br/>\n- <strong>The only useful AB boosting feats are blind fight, knockdown/improved knockdown and epic prowess.</strong> Weapon Focus, Epic Weapon Focus, Devastating Critical all do not transfer to creature weapons which might or might not be patched by Beamdog in future. Blind fight helps with rerolls against concealment, knockdown helps get rid of dex/dodge/tumble AC, and epic prowess grants +1. <br/>\n- <strong>Play the build in a low to mid magic environment</strong>. In an environment where +20 attack is available on weapons, you are going to be <strong>extremely disappointed</strong> with dragon shape. If you go through the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/order-of-jormungandr-1-69-t2355108.html\" rel=\"noreferrer\" target=\"_blank\">Order of Jormungandr</a> v1.69 build thread, despite one of the best builders in the game's history making this build whilst admirably encouraging heavy input and criticism from guild members, Cornflower took this build on Blackstone Keep and found Dragon Shape lacked the power available to other classes. And it is extremely obvious why, those +20 attack weapons cannot be equipped polymorphed and therefore an enormous amount of power is lost when the module is balanced expecting players to have those bonuses. In contrast, take a Dragon Shape build on WoG with +5-6 enchanted weapons at most and you will find you will have a much happier time.<br/>\n- <strong>Learn druid spells</strong>. They are simply awesome. The ultimate cheese, is to walk into a mob invis/greater sanctuaried, buffed up with premonition/improved invis/knockdown immunity, drink a haste potion, then cast your SoV / Stonehold/ Grease Combo then turn into a Dragon. Between all the crazy disables (three saves / round for 30+ rounds) destroying your enemy's Dex/Tumble/Dodge AC, your Dragon Shape 50-60 strength 5-7 hits / round with sneak attack, ultra high AC and Dragon Shapes Damage Resistance +6 soak 30 + 800-900 plus HP,  unless they are immune to paralysis, stun and knockdown/grease, with SF/GSF/ESF: Conjuration and a stratospheric wisdom score, everything just gets annhilated unless someone casts an AoE dispel to get rid of that stuff, and casts Mord's on you to get rid of your buffs. <br/>\n<br/>\nThe ultimate level 40 build, as some are interested in this ultimate level 40 stuff, in my view, is a Druid 38 / Monk 1 / Rogue 1 with max discipline, spellcraft, Tumble 40, UMD 33+, some detection to keep you safe in Druid form (Dragons have True Seeing), some search and whatever else you want. You get to be essentially a 'spellsword' with 38 caster levels, Monk UBAB/Evasion, you can run around opening locks and disabling traps with ease if you want in Dragon Shape form, the discipline skill is actually useful against knockdowns with 50-60 strength, huge size, plus you get UMD for extra buffs. A more balanced build might be a Druid 36 / Monk 2 / Rogue 2 for skill dumps and abilities along the way. <br/>\n<br/>\nGreater smiting Dragon or a Epic Warding Dragon looks interesting when you look at the build without knowing the Druid class. But play such a build in game, you will understand, all that stuff is just decorative fluff, the true substance of a proper dragon shape build in v1.69+, is to go Druid extremely high with Monk and Rogue light sprinklings only. <br/>\n<br/>\nThat is all you need to know about Dragon Shape. Keep it simple. High Druid, Monk and Rogue cheese. <br/>\n<br/>\nPot stirred.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "12:39 AM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is more for PvP than PvM, but if you're fighting a mage as a dragon you will die. If your opponent is a competent mage you're dead anyway so low caster levels aren't too much of an issue. Dru24 is enough for most dragon builds although sometimes more druid levels are useful. AI mages are a lot less threatening so I can see why you would say that if it's strictly for PvM.<br/>\n<br/>\nDruid spells are nice but a dedicated dragon build can manage without them. SoV + Stonehold + Stunning Fist is definitely a nice combo against low save enemies though.<br/>\n<br/>\nDivine Might works well with Pal/Dru/Monk dragons, although they require alignment changes. You can either go Dru24/Pal13/Monk3 or Pal21/Dru18/Monk1 depending on whether you want undispellable Druid buffs or 30 BAB.<br/>\n<br/>\nDru24/Shif13/Monk3 and Dru28/Shif10/Monk2 used to be my two favourite builds but they've been nerfed pretty hard in EE since rakshasas can no longer maximize Ice Storm. If you're still playing 1.69 then I would recommend either of those over a Dru/Monk/Rog. In a 1v1 situation they can adapt to almost anything and they can tank many different types of monsters which is very useful in a party.<br/>\nFor your ultimate level 40 build, Dru36/Monk3/Rog1 is the level layout I would recommend.<br/>\nMinimising Druid levels in order to boost other aspects can work very well in low/medium magic worlds, although it depends on how common dispels are. The most common builds are probably Dru18/Cler21/Monk1, Dru18/Wiz21/Monk1, Pal21/Dru18/Monk1 (requires alignment changes), and Rang21/Dru18/Monk1. Dru24/Barb15/Monk1 (requires alignment changes) is another fun build, although it works best on servers where Terrifying Rage has been modified to be more effective. Some servers remove Monk bonuses when shifted in which case even more options open up such as Dru18/Bard6/PM16 or Cler25/Dru5/Shif10, but in general Dru/Monk/X builds are best.<br/>\nStunning dragons are another option that avoid the low damage of most stunner builds. 13x 66 DC Stunning Fists on top of dragon damage will wear down most opponents. I would recommend either Dru/Monk/CoT, Dru/Monk/Figh, or dropping Monk altogether in order to increase the DC.<br/>\n<br/>\nDragon Shape is actually one of the strongest feats on BSK because item merging has been altered on the server. All item slots merge (including gloves) and +20 AB weapons merge into +20 AB claws, although I believe that the bite attack is still +0. One of the best (on paper) PvP melee builds is a dragon, although I won't go into details because I dislike talking about PvP builds. PvM is fairly split on BSK, farming can be done by practically any offensive build but bosses require fully equipped and prepared builds. A dragon can't AC tank bosses on BSK, it can't DR tank, it's bad at healing, and the DPS is mediocre at best. Dragons will do okay when farming but they're borderline useless in high end PvM.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:21 AM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The Stonehold/SoV (and I would add Grease) needing to be used against low saves is not correct with a proper dragon build.<br/>\n<br/>\nAs discussed previously, a level 40 character's high base save is 22 and low base save is 16. <br/>\n<br/>\nThis is from Maximillan Kane's Champion of the Wilderness:<br/>\n<blockquote><div>Maximillan Kane wrote: (<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build316635.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 16635.html</a>)<br/>\nYour Spell DCs (with Owl's Insight) will be the following:<br/>\n<br/>\nGrease: 35<br/>\nExtended Grease: 36<br/>\nStonehold: 40<br/>\nExtended Stonehold: 41<br/>\nEmpowered Stonehold: 42<br/>\nStorm of Vengeance: 43<br/>\nCreeping Doom: No Save<br/>\n<br/>\nBut THE BEST THING about the Conjuration school and the one that many people easily overlook is that Grease is a Reflex Save spell, Stonehold is a Will save spell and Storm of Vengeance is a Fortitude Save spell (<strong>edit</strong> please note Max was incorrect here, and SoV is reflex). That means you will ALWAYS have a spell ready to attack your opponent's weakest save. As an example, I was fighting 3 Prismatic Dragons simultaneously on the Training Mod. Before shifting to DS, I cast 4 Extended Greases and 4 Greases around me. They COULD NOT STAND STILL to attack me, because they would always fail at least one save and get Knocked down. ALL THREE OF THEM <img class=\"post-image\" loading=\"lazy\" src=\"http://world-of-greyhawk.github.io/images/smiles/icon_biggrin.gif\" /> .<br/>\n<br/>\nToo bad Conjuration is also the school that is most affected by immunities. If your server has permanent freedom items in abundance, forget about this school and go for Evocation instead. The main problem is that the Evocation spells are mostly Reflex save spells, and therefore subject to Evasion / Improved Evasion. If those are also in abundance, get Transmutation for Drown DC or Necromancy for Finger of Death and Slay Living. I hate those insta-death spells, for real, so I don't use them much, but if nothing else will work, then what the hell...<br/>\n<br/>\nAnyway, hope you like it. <img class=\"post-image\" loading=\"lazy\" src=\"http://world-of-greyhawk.github.io/images/smiles/icon_razz.gif\" /><br/>\n<br/>\nTake it EZ!</div></blockquote>\nA druid player understands the power of his spells and will push druid high in any dragon shape build :)<br/>\n<br/>\nA druid is already an effective spellsword, no need to half-half like a wizard/fighter, just go all in, its a 3/4 BAB class but dragon has 50-60 str and with monk cheese, 5-7 APR, everything is handed to you on a platter. You get that CL up to mid to high 30s, we are talking 70 round duration extended stoneholds and 30 round duration SoVs, just delightful. If they dont have dispels, even better. You just walk all over them. If they are SR resistant cast natures balance to lower that SR down by 7d4, its better than Mords at lowering SR but its a level 8 spell and AoE. With high CLs hopefully you can just avoid using that ability all together. Mages you can cast grease at their feet, and if they don't have knockdown immunity they are just not going to stand up. Rogues just cast finger of death at those bastards, or turn into a dragon and become sneak immune. WIth UMD you get access to wands of lesser spell breach, bigby's scrolls, mord's scrolls and time stop scrolls, greater sanc + BBoD cheese, heaps of good stuff. <br/>\n<br/>\nHigh Druid - Monk Cheese - UMD cheese. Easy game, easy life. :)<br/>\n<br/>\nSurely you have heard enough from me and Yunim here? Surely others have opinions? :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "4:25 AM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You don't need to go high Druid in order to achieve high DCs, a Dru24/Pal13/Monk3 dragon can still have a 38 DC Stonehold and 41 DC SoV on top of higher AB and Divine Might.<br/>\n<br/>\nOn top of the base 22 save (assuming that your opponent is not multiclassed) there are also ability modifiers, save feats, and save increasing items. For creatures there will be even more variation since builders can set the saves of creatures directly. In PvP DC spells will only work on low saves, assuming that they work at all, even for spells that don't allow a Spellcraft bonus like Stonehold and SoV. PvM is a lot more varied, but in general I would expect level 40 non-boss mobs to have saves in the 30s and 40s. 40 DC spells will work against low saves, but they're not reliable when it comes to targetting high saves. On top of saves, Mind Spell Immunity and Paralysis Immunity will prevent Stonehold from working while Mind Spell Immunity will prevent SoV from working.<br/>\n<br/>\nA high Druid dragon with 25 BAB, capped STR, and Epic Prowess will have +55 AB inside and +57 AB outside, which is okay but not amazing in a +5 EB environment. Adding Cleric or any high BAB class will improve that further, a well built dragon can achieve over +65 AB.<br/>\n<br/>\nToolset SR is capped at 32 so that won't be much of a problem for a high level Druid, but the spell Spell Resistance can reach 52 SR. Mords is better than Nature's Balance since it doesn't have a Will save, so a Dru/Monk/Rog has an advantage over non-UMD druids when it comes to decreasing SR. Since Clerics and Druids have extremely high Will saves breaching is the only reliable method of dealing with the spell Spell Resistance.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:49 AM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Yunim wrote: <a data-post-id=\"18894\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18894&amp;sid=18600d582bcdd1c935f9bb9548593707#p18894\">↑</a><div class=\"responsive-hide\">Feb 05, 2020</div></cite>You don't need to go high Druid in order to achieve high DCs, a Dru24/Pal13/Monk3 dragon can still have a 38 DC Stonehold and 41 DC SoV on top of higher AB and Divine Might.</div></blockquote>\nYour character is going to have an effective wisdom score of 42-50 (base wisdom 30-38 + Owl's). Why on earth would you trade 10-14 caster levels and 2-3 bonus Druid feats for 2 BAB and going from 5-7 to 6-8 APR, if your character is going to have a stratospheric wisdom score.<br/>\n<br/>\nYou are a caster in the end, max out that spell penetration, caster levels etc etc, the Dragon is your trump card in the end, buff that Dragon with the best spells you have, make those buffs Mord resistant if you can so random rogues carrying Mord's scrolls can't just remove all the buffs you got.<br/>\n<br/>\nA decent module designer is going to make whatever paladin buffs you got dispelled whilst you are in Dragon form, and whatever charisma is going to be limited to whatever is equipped on your helmet/armor/shield, unless it is modded. If your AoV and Eagle's gets dispelled, you might have 5-6 casts / day of each spell perhaps, but you only have 3 uses of dragon shape / day, if you want to recast those, you have to shift back then recast dragon shape. Dragons are mind immune so the paladin fear immunity is not helpful. Paladin 13 = no no.<br/>\n<br/>\nYou could go Druid 38 / Cleric 1 / Monk 1, if you want that Divine Might but as discussed it is questionable to me whether that is better that taking UMD in the end.<br/>\n<blockquote><div>On top of the base 22 save (assuming that your opponent is not multiclassed) there are also ability modifiers, save feats, and save increasing items. For creatures there will be even more variation since builders can set the saves of creatures directly. In PvP DC spells will only work on low saves, assuming that they work at all, even for spells that don't allow a Spellcraft bonus like Stonehold and SoV. PvM is a lot more varied, but in general I would expect level 40 non-boss mobs to have saves in the 30s and 40s. 40 DC spells will work against low saves, but they're not reliable when it comes to targetting high saves. On top of saves, Mind Spell Immunity and Paralysis Immunity will prevent Stonehold from working while Mind Spell Immunity will prevent SoV from working.</div></blockquote>\nThis is why you cast SoV, Stonehold, Grease(s), maybe Entangle, add a level 9 elemental swarm/summon Creature IX, Put out a few finger of deaths (this spell you must target low saves ie Rogues) or creeping dooms, Mord or Breach some of those casters plus you pile a dragon on top of the mix. Put those high caster levels to work with a 30-70 duration massive AoE spell, sure saves might be in the 30s and 40s, but we are talking about 4-6 saves / round, over 30-70 rounds, 120 - 420 saves over that time period. Eventually the enemy is going to fail not just one save, but multiple saves even if they have a sky high score of like 50, eventually a 1 is going to be rolled. <br/>\n<br/>\nThey have to dispel that mosh pit, Mord your Dragon (and hopefully multiple castings to get rid of your buffs), then kill your 900hp +6/40- monk Dragon who might have a pile of heal pots, speed potions and invisibility potions.<br/>\n<br/>\nImmunities sure are important in this circumstance. You want to be immune against everything here. Knockdown immunity against grease. Freedom against entangle, grease and stonehold. Stun/Mind immunity against SoV. Electrical and Acid damage reduction against SoV. Death Immunity against Finger of Death/Slay Living. Physical damage reduction against Creeping Doom and Dragon Shape's claws. Then you can finally face that Dragon man-o-mano in a fair fight. This sounds like this opponent is going to be a challenge against anyone. <br/>\n<br/>\nBut a high level druid dragon will have Spell Resistance 48+, Premonition, fully capped Str/Wis/Con scores, Death Ward, Freedom, Knockdown resistance/immunity himself, Mind immunity, Prot v Elements/Energy Buffer, Acid Immunity, DR +6/40-. Sound familiar? That same ultra immune opponent sounds like a high Druid Dragon Shape if you ask me :)<br/>\n<br/>\nThe solution is pretty simple. AoE Mord's the mosh pit and Mords/Breach the Druid / Dragon. Strip every layer of protection that Druid has. The only protection the Dragon has in that circumstance, is high caster levels, which means only a mob with a high wizard/sorc is going to trouble you, or some dev crit weapon master who only a palemaster or golem / damage shield will want to face. As discussed we don't want Rogues, Bards and Assassins with Mord's scrolls just removing all the power you have to offer easily. <br/>\n<blockquote><div>A high Druid dragon with 25 BAB, capped STR, and Epic Prowess will have +55 AB inside and +57 AB outside, which is okay but not amazing in a +5 EB environment. Adding Cleric or any high BAB class will improve that further, a well built dragon can achieve over +65 AB.</div></blockquote>\nThe cleric buffs will get dispelled in v1.69+, then you have to return back to humanoid form to recast then return to DS. There are only 3 DS shapes to use / day. The ECB Order of Joruumgard v1.69 tries to recreate the old classic power build. It can work in some environments, but the counter is dispels, and one wants to raise the bar so its not just a rogue with a Mord's scroll who can strip your Dragon naked, its a high level dedicated arcane caster who has that type of power.<br/>\n<br/>\nThe AB is a limitation of all polymorph builds. Dragon Shape has the best AB of any polymorph. Add Monk UBAB it makes it better but one wishes for more. Bless and Aid pots are easy ways to add 2 AB. Adding 1-2 BAB is not worth it from a full BAB class for the 4-8 caster level loss. The AB is 'enough'. It gets the job done.<br/>\n<br/>\nCleric buffs are very nice. The old Order of Jormungandr was an undispellable cleric who could turn into a Dragon. Back then you only needed 14 Druid levels to do this. The Old OoJ by Kail Pendragon is I believe was the strongest Dragon possible. But no longer possible in v1.69. <br/>\n<br/>\nThe new one has great AB, up to 68 AB when fully buffed, and a dual divine spellbook. The weakness is dispelability. If I want to kill the new OoJ, its the same old stuff, Mord/Dispel/Breaches, strip the Dragon's buffs away then destroy. But this time you lower the bar so that clerics/druids and UMD users can strip you away, rather than dedicated arcane casters. You sacrifice defensive power for your buffs which is your defense, in exchange for AB. You simply have to drink an invis and speed pot and run in that circumstance. <br/>\n<br/>\nIf its about being a proper dragon shape tank, being able to man up, its the same old story. You gotta protect your buffs. This means high CLs.<br/>\n<br/>\nTherefore: <br/>\n- High druid. Monk cheese. UMD cheese. Strongest Dragon Tank.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:31 PM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A DC caster Dru36/Monk3/Rog1 with Dragon Shape is a solid build but it's not the universally best dragon build. Any dedicated dragon build will have a stronger dragon form than a caster druid with Dragon Shape, that alone should tell you that it's probably not the universally best dragon build. I take Dragon Shape on almost all of my caster druids since it's one of the strongest feats in the game, but compared to a proper dragon build it falls short when shifted. Even Cler25/Dru14/Monk1, while an extremely strong build, was not the universally best dragon build when it was legal.<br/>\n<br/>\nIf dispels are a concern then a Rang21/Dru18/Monk1 can potentially reach +62/+64 AB against favored enemies without Aid. A Dru18/Wiz21/Monk1 can reach an AC of 89 (99 in IExp) when fully buffed. Even when naked and using only undispellable buffs that is still 77/87 AC, which matches what a naked, self-buffed, minmaxed Dru36/Monk3/Rog1 can achieve. If you really want a high caster level and Divine Might then a Dru32/Pal5/Monk3 has +1 AB, +1 APR, Taunt, and better saves than a Dru36/Monk3/Cler1. That becomes +2 AB if you get Divine Might in pre-epic levels on the Dru36/Monk3/Cler1. The main downside being that Dru32/Pal5/Monk3 requires an alignment change which limits the availability of the build, although it can fit in both IExp and ESF: Conj which a Dru24/Pal13/Monk3 or Dru24/Pal15/Monk1 can't.<br/>\n<br/>\nBy the way there is very little benefit in going for Dru38, especially not when you are potentially sacrificing Deflect Arrows and 10% Monk Speed. At Dru36 you you get a bonus feat and both Flame Lash and Ice Storm get a damage increase. Dru32, Dru33, Dru36, Dru39, and Dru40 are the stopping points you should be aiming for if you want high caster levels on a druid build.<br/>\n<br/>\nThe main threats to dragon builds (in PvP at least) are AAs, clerics, mages, and better dragon builds. All of those builds can completely ignore your DC spells either due to immunities or ranged attacks, at which point you will have to actually fight them as a dragon. In my experience summons are barely a distraction at level 40, even on servers where summons have been significantly buffed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:49 PM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am simply stating a high Druid, monk cheese, UMD cheese makes the strongest 'Dragon tank'.<br/>\n<br/>\nThis is simply because killing a dragon in PvM in low-mid magic =<br/>\n-&gt; Mords.<br/>\n-&gt; more Mords<br/>\n-&gt; more Mords<br/>\n<br/>\nDid I say more Mords?<br/>\n<br/>\nThe dragon has to be stripped of all those defenses -&gt; Death Immunity, Freedom, Premonition, Owl's Insight, Bulls/ext Blood Frenzy/ext Aura of Vitality, Barkskin.<br/>\n<br/>\nThe dragon has only limited magical bonuses from armor/shield/helm of the caster in Vanilla low-mid magic. This means all these immunities are difficult to put onto the dragon in practice.<br/>\n<br/>\nA low druid, dragon shape is not a tank in an appropriately challenging low-mid environment. Everything will get stripped away, naked, the Dragon is vulnerable. It can be hit and critted, the Dragon loses damage and AB, the Dragon loses Fort save and HP, the Dragon loses a lot of his AC (barkskin = 5, Owl's Insight = 6 -&gt; 11 AC gone).<br/>\n<br/>\nAAs are a big problem. A higher AB dragon is not going to solve the AA problem, particularly an AA with monk speed. They need to be snuck up on with invisibility if you can, and given the finger of death if you can. Stonehold/grease/SoV them maybe. Or just walking with Greater Sanc active and Bigby them with UMD. Knockdown with the dragon can work but the challenge is getting to the AA in melee range invis. Those AAs have UMD, so Mords scrolls are in the offering against you.  If they detect you they could use those against you and simply put terrain in the way. Higher caster levels means your buffs stay attached to you much longer. <br/>\n<br/>\nMages are a problem. They have Mords, Time Stop, IGMS, etc... again a higher AB dragon is not going to solve this problem and especially one which is going to be stripped of every buff equipped in an instant.<br/>\n<br/>\nClerics are a problem. They can greater dispel you if you have less than 24 druid levels, and Mord scroll you if they have UMD (ie Cleric/Rogue). <br/>\n<br/>\n'Better' Combat Dragons are better dragons for sure if you let them wear their flimsy buffs. You use Mords against them with UMD and they will scurry back into the little gutter from which they arose.  <br/>\n<br/>\nIn terms of tanking in low-mid magic, the only defenses a Dragon has are: 1. Monk Cheese. 2. Buffs. 3. Some items bonuses, limited due to the environment. <br/>\n<br/>\nMake those buffs strong if you want a proper dragon tank with high CLs.<br/>\n<br/>\nOnce again: <br/>\nProper dragon tank = High Druid, Monk Cheese, UMD cheese. <br/>\n<br/>\nDo tell me if I am 'stirring the pot too much here' :) <br/>\nNot my intention to upset, if I am. Simply the enjoyment of an academic discussion.<br/>\n<br/>\nAnd I must say you would make an excellent debater or politician towing the party line Yunim. <br/>\nYour ability to stay rigid and unchanging whilst retaining enormous passion is impressive.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:39 PM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:32 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ummm...Breaches can remove buffs, regardless of Caster level.<br/>\n<br/>\nThat is something to keep in mind - having a Wand of Lesser Breaching is really a great tool to strip buffs without worrying about Caster level - especially Damage Shields.<br/>\n<br/>\nBefore the nerf, Puff the Mighty Dragon was the mightest Dragon of all.  v3 was AWESOME.<br/>\n<br/>\nI currently have v4 on WoG - 18 Druid, 1 Mk, 21 Wiz.  With Epic Warding, the claws get +20/, which will pierce any type of DR except, I believe EDR - including Epic Warding itself.  It is dispellable, unfortunately.<br/>\n<br/>\nBy Cdaulaup (did I spell that wrong?) and SBully.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "1:10 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If we're focusing on PvM dragon tanks then I would go for a Dru18/Wiz21/Monk1 over a Dru36/Monk3/Rog1. In PvP there are multiple dedicated dragons that have an advantage over a Dru36/Monk3/Rog1 against challenging opponents. Mords will hurt a low caster level dragon but there are still builds that have an advantage over a Dru36/Monk3/Rog1 even if we assume that all of their buffs are stripped.<br/>\n<br/>\nThe easiest way to kill dragons in PvM is with high AB or nuke spells.<br/>\nA Dru18/Wiz21/Monk1 is a better AC tank than a Dru36/Monk3/Rog1, and when tanking against high AB opponents the extra AC can make a significant difference. Even with only undispellable buffs a Dru18/Wiz21/Monk1 has AC on par with a self-buffed minmaxed Dru36/Monk3/Rog1, and the AC cap is higher for the Dru21/Wiz21/Monk1. Assuming that both builds are tanking for party members then the higher AC cap is more important than self buffing since party members can handle buffing if needed. The build also has a full mage spellbook but the low caster level prevents it from being a proper support build in addition to an AC tank.<br/>\nHigh caster levels won't help against nuke spells since SR can be breached by even a Lesser Spell Breach, and since we're assuming that UMD is common it means your SR will be gone regardless of how high your caster level is. After that it comes down to whether they run out of spells before you run out of HP, there aren't really any advantages for a specific dragon build here since most dragons have roughly 1000 HP when fully buffed.<br/>\n<br/>\nAAs, battle clerics, and other dragons can be fought in PvP. If you're fighting a mage or caster cleric you're dead regardless of your build, provided that you're facing a decent build and competent player.<br/>\nAAs can be approached by combining IExp and Deflect Arrows to get into melee range. Alternatively you can spam Ice Storm, but since we're assuming UMD is common they will likely have multiple mantles. In addition to that your unshifted form has less AC and so they will be able to hit you if you decide to cast rather than fight as a dragon. The only way for a dragon to beat an AA is to fight as a dragon, and as such a dedicated dragon will be better against AAs.<br/>\nBattle clerics are immune to your DC spells and can easily get over +65 AB self-buffed. Your unshifted form won't have enough AC to fight them so you will be forced to shift, at which point a dedicated dragon will be better.<br/>\nEven without using buffs a Pal21/Dru18/Monk1 or Rang21/Dru18/Monk1 will have an advantage over a Dru36/Monk3/Rog1 when it comes to dragon vs dragon combat. Both builds have similar defence to the Dru36/Monk3/Rog1 but the offence of both builds is higher which gives them an advantage in PvP. The Rang21/Dru18/Monk1 in particular is one of the few dragon builds that can fight a dragon vs dragon battle without rolling for 20s, although there will still be a lot of 20 rolling.<br/>\n<br/>\nNo need to worry about upsetting me, I'm quite enjoying this discussion. I personally think that in-depth discussions of general builds/archetypes are usually a lot more interesting than discussing tweaks for specfic builds, especially since we're not limited to what works in a particular server/environment. Caster druids are one of my favourite archetypes, although it's been a while since I last played once because they're pretty weak on my current server.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}