{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "212",
  "name": "Playing wih casters: tips",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/playing-wih-casters-tips-t2354665.html",
  "author": "233",
  "avatar": "10714033_1519247364.jpg",
  "replies": 20,
  "posts": [
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "11:40 PM - Feb 15, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi all!<br/>\n After a bit more than two years of playing melee builds (and never tired of that, I am still continuing..), I'm thinking about playing as sorcerer or wizard. Based on my point of view and what I have understood, it seems a radical choice as I:<br/>\n  - Can't approach my enemies in a \"melee\" way (front attack);<br/>\n  - Have to learn when to use spell, and how to save them in order to not to rely too much on rests;<br/>\n (you are free to add items to this list <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />).<br/>\n<br/>\n I would like to request to you any advice I might need in my \"new\" adventure, for example:<br/>\n  - how to build sorcerer and wizards (e.g. I have read that it's better, for wizards, to don't multiclass. For sorcerer, you can multiclass with paladin or blackguard, in order to gain a huge boost to saves): attributes, feats to consider (epic and non-epic), etc...<br/>\n  - how to play \"caster\" characters<br/>\n<br/>\n P.S.: searching in the nwn wiki, i found this page for spells: <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Recommended_spells\" rel=\"noreferrer\" target=\"_blank\">Recommended_spells</a><br/>\n<br/>\n Thank you all for your kind help!<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:44 AM - Feb 16, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Absolutely the wrong person to be first responder Aquarius (I'm assuming that, like me, that's your astrological birth sign - or you like songs about its age dawning from the 60s - equally valid), 'cause I'd hate to lose another one to the sorcerous side, or even the divine for that matter. There are few enough of us knuckle-runners left as it is - don't let those who can conjure cupcakes tempt you (it's all very Hansel and Gretel - or I'm doing too much Scotch)!<br/>\n<br/>\n Actually, to attempt some level of neutrality here, I think I made a mistake by trying a caster (albeit a divine, rather than arcane, one) too early. I wasn't ready for the change in gameplay. However, I do think that my recent adventures with a shootist (Hip's Wulgar: you can read about his activities in the Aeilund thread if you've a mind to), and indeed an assassin (Mick Dagger's Kama Shinobi - ditto her adventures) have better prepared me for the \"wait a moment\" mentality necessary. Now, I probably don't need to say any of this, but I wouldn't want your first forray into the dark arts to disappoint you, so I'm merely raising a \"careful does it\" flag, if you don't mind.<br/>\n<br/>\n And yet, as one of the old great and good might have said, I would still encourage you to ~ HIT THINGS WITH REAL WEAPONS - ON! ~ <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:15 AM - Feb 16, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think I only ever played a pure wiz one time and that must have been my first go at the Plague Campaign.  I almost always build some sort of wiz/rog.  It's a natural synergy.  The combo of high INT with rogue levels results in a highly-skilled mage with almost unlimited skill dumps.  With a human, elven or gnomish wiz/rog/HS you can even get discipline dumps if fearing KD that much.  Extended Darkness is also a natural synergy for effective sneaks without even investing in stealth skills. If you don't mind sacrificing overall DC, you can easily build an Epic Dodge wiz/rog with lots of those wiz pre-epic bonus feats.<br/>\n<br/>\nA lot depends on the environment.  If crafting is encouraged, that takes care of the long dungeon crawls because you'll use your scrolls and wands for pedestrian challenges and save the high-caster versions for bosses and their minions.  Scrolls/wands/rods have the advantage of not triggering AoOs while within melee range.<br/>\n<br/>\nI stack traps thick when I know a horde is nearby and I <span style=\"text-decoration:underline\">know</span> they are there and how bunched up because I drop an Invis pot on my pixie, posess it,  have it cast ImpInvis on my statue and perform the recon.  I usually sacrifice the pixie to register some preemptive damage before the formal attack (pixie is the only familiar that holds a weapon that can be buffed with GMW &amp; Flame Weapon).  You'd be surprised how long that twinkling moth form lasts against tough foes.  And if they immediately chase it around before it attacks, I know they can see through Invisibility... useful info for the pre-buff slot plan.  <br/>\n<br/>\nThen there is the Skel Chief-wading-into-a-mob-while-your-mage-spams-empowered-NEB-one-after-the-other exploit.  Worthless strat against undead, though.<br/>\n<br/>\nCan't help you with sorc, however.  Tried to force-fit myself into playing an exalted sorc a few times but always seemed too limited by the known list.  It's IGMS or bust IMO else go wiz.  I go wiz.<br/>\n<br/>\nHere's one to think about:  Dwarven LE Wiz25/Asn9/DwD6.  Haven't tried it yet but seems like a fun concept a first glance.  It came to me in a dream. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:49 PM - Feb 16, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Now I play the Aielund campaign with a sorcerer. It is my first time through that series of mods with a dedicated caster. The mods have the EMS hak which alters several spells. I play the mod in a party with 2 henchmen, which is very different from playing a solo mage. I have an unusual build, a So 35/HS 5, and I roleplay the character with a focus on evocation attack spells, primarily lightning and cold spells. Probably not something to recommend for beginners, but so far I have finished act 1 and 2 without any problems.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "9:11 PM - Feb 17, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you all for your answers!<br/>\n It seems that the way to wizardry and sorcery is very hard.....would it be much easier with a support bard?<br/>\n I like the idea of supporting others, but I also like to smash my enemies with weapons...because if I think that I have to:<br/>\n - know decently the spell features (eg. range)<br/>\n - apply them in every combat<br/>\n - know almost all types of enemies, in order to learn their weaknesses<br/>\n I would get mad <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n P.S.: thank you for the building hints!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:27 AM - Feb 18, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There's no doubt that effective spellcasting is the most difficult aspect of AD&amp;D to manage.  Ultimate power comes at a cost.<br/>\n<br/>\nHere's my suggestion.  <br/>\n<br/>\nI think your instincts about bard is well-founded to serve as a compromised introduction into the arcane arts.  You can focus on the song and, in parallel, toy around with some spellcasting along the way with only a CHA 16 investment.  Bard doesn't have a power level equivalent to a mage but self-buffs rather well with the occasional sound burst or ice storm thrown into the mix when an opportunity presents itself.  The unique feature of the song is that there is no DC or SR to be concerned about but the effects can be dramatic when both songs are used together.<br/>\n<br/>\nEither get Still spells or play a DEXer in robes.  Shields also effect spell success.  Consider them part of armor's casting penalty. <br/>\n<br/>\nThe rule of thumb for spellcasting is this:  The lower the magic enhancements available, the greater the advantage of even low-level spells.  Once you begin to approach the high-end item properties and the associated creature balance (high Saves/high SR skins), the advantages of magic drop off radically.  Therefore, it's wise to choose an environment where your arcane talents can bloom and not get squashed by virtue of the godly gear that warrior-types get access to that are intended to neutralize the class-specific magical advantages.<br/>\n<br/>\nCheck out builds that focus on epic bards to gain access to Lasting Inspiration.  No doubt there will many bardic themes with RDD blends.  If that prestige class has not been nerfed (on SP: hardly ever, on PW: quite often), it's a natural fit for a H&amp;S singer.  The only drawback is that epic spells will not be available unless at least PM 15 is stuffed in there somehow, but I wouldn't recommend an exotic combo like that your first time out..<br/>\n<br/>\nBTW...<br/>\n<br/>\nIt makes no difference on which class you consider.  Knowing the dangers, potentials and weaknesses of all encounters is tantamount to success in AD&amp;D. It should be automatic and one of the first aspects of the game you perfect.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "10:54 PM - Feb 20, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you Hip, for the hints!<br/>\n I will study them and try to make a decent build <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n It will be interesting to play as a support character, I like to support others, so I think that traducing this thought into D&amp;D language (and build) will be proficient for me...at least, I hope so!<br/>\n<br/>\nFor Stag: yes, Aquarius is my zodiac sign, and you can be sure that I will continue to use melee build...casters will not dominate!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:24 AM - Feb 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Top fella - and a recent happy birthday! (mine was the 12th - shared with Abraham Lincoln, and look what happened to him. That's why I don't go to the theatre any more.)<br/>\n<br/>\n More pertinently, there's no reason at all you have to play a Bard as a support character - indeed, if you just want the benefits of the song, my first ever build request resulted in an elven Fighter/Bard/RDD. If I remember correctly, it was Fighter 16, Bard 14, RDD 10 and was an awesome dual-wielder with handaxes. Had bugger all spells, but the song was great, and certainly didn't require big nasty boys or girls to front him.<br/>\n<br/>\n Bard is an exceptionally versatile class - check Hip's database of finalized builds (recently updated and available from the Rules and Tools sub-forum here) and you'll get ones who only use their song right through to those whose Charisma would make Nelson Mandela look like an orc with acne.<br/>\n<br/>\n Stay true to hitting things!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:32 AM - Feb 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Aquarius!<br/>\n<br/>\n I have a few tips myself to add and I hope that they'll be useful. Firstly, I'd check our forums under level 40 section for ideas of builds that you may want to play. I could recommend many builds, but the bad thing is we don't have a search engine for these new builds, so you'd have to find them anyway. Skim through our forums and take a look at some of our builds.<br/>\n<br/>\n There are basically 2 types of casters: dedicated casters and spellswords. With arcane classes, you can't do both. With Cleric you can cheat, but that's for another topic. Anyway, I have a Wizard 26 / Bard 4 / RDD 10 build (I believe it's called the Draconic Arcanist), which is a good example of a good spellsword. If you want a spellsword with Sorcerer, I'd recommend Mick's Spellsword of Bahamut (but I'd tweak in the divine feats lol). Spellbook management and spell choices are VERY DIFFERENT if you're playing spellswords than if you're playing a dedicated caster. For spellswords, you're looking to use no-save spells and generally avoid casting spells that require a save. You also need to worry about penetration (basically beating Spell Resistance), so you'll need to know your enemies to figure out which ones have SR that could be a problem and use Greater Spell Breach or even Mordenkainen's Disjunction so your spells will affect them.<br/>\n<br/>\n As for Dedicated casters, you will max out your casting stats and take many levels in your caster class to be able to penetrate spell resistance, and your spells will be your main bread and butter. That means you'll suck at melee combat (and ranged), so you'll need to rely on summons to protect your wimpy mage while you rain destruction upon your foes. You will also choose a school of magic to focus on, the two main ones being Evocation and Necromancy. A good example of a dedicated caster is my Boddyknock Gincke build, which is a concept build, but is as versatile and as deadly as a dedicated caster can be. He also takes advantage of Hip's well-pointed-out Rogue synergy to be able to set traps and do a lot of funky things. Playing a dedicated caster is also exponentially harder than playing a spellsword, as you'll need to know your enemies' weak save to figure out the best spell to cast in that situation. Typically, it's FORT for mages and sneakers and WILL for meleers and sneakers too. Monks don't have a weak save. You'll also need to be mindful of which foes can be a problem. Typically, mages make excellent boss killers, but because they run on limited supplies (spells per day) they tend to struggle against hordes of minions and long restless periods. Henchmen in campaigns make our life much easier, but in PWs, if you're not in a party, summons will be the way to go, although they are very sub-par in NWN.<br/>\n<br/>\n So, I hope this advice helps you get started, Feel free to ask me any questions that may arise.<br/>\n<br/>\n Take care!<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:59 AM - Feb 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><hr/>Hey Aquarius!<br/>\n<br/>\n I could recommend many builds, but the bad thing is we don't have a search engine for these new builds, so you'd have to find them anyway.  \n</div></blockquote>I suppose news travels slowly South of the border but, yes, we DO have a <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354531/\" rel=\"noreferrer\" target=\"_blank\">Search Engine for all completed builds posted within the new ECB realm</a>.  It's called a \"Filter\" though, not to confuse anyone but to reflect how it works (ie. start with around 300 builds and gradually allow only the ones the user really seeks to trickle through like making coffee).   No Portuguese version available yet, but I'm working on it. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nFor those without access to some version of Excel, and in parallel, I've furnished a comma-delimited dump of the raw data but it's up to the owner of the non-Excel spreadsheet software to manage the data as best they can (no doubt there may be some massaging needed to retrieve builds that meet a user-defined set of criteria).  The filter is updated periodically (i.e. when I am in the mood and when Stagmeister has time to back-check my horrible transcriptional skills) depending on the volume of new contributions posted within a reasonable time period.<br/>\n<br/>\nAs a matter of fact, at least one of your builds popped up within the visual tutorial I've furnished as a companion doc.  Go figure!  Just cannot escape the influence of M. Kane, eh?<br/>\n<br/>\nBTW, here are the two you've mentioned so far, snatched right off the Filter's list, just a click away...<br/>\n<br/>\n<strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515415/\" rel=\"noreferrer\" target=\"_blank\">Spellsword of Bahamut</a></strong><br/>\n<strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2344104/\" rel=\"noreferrer\" target=\"_blank\">Draconic Arcanist</a></strong><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:17 AM - Feb 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I still think it should be called Hip's Fantabulous Contrapulator - but I've been wrong about many things before.<br/>\n<br/>\n And Aquarius, be wary, you've disturbed a sleeping dragon (albeit a Brazilian one <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "9:43 PM - Feb 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am simply amazed to see that there are so many replies to this topic, full of hints to be considered! Thank you all!<br/>\n I am hungry of notions, they help me to gradually (and very slowly, due to the enormous gap between me and you all) reduce the lack of knowledge required in order to reasonably play NWN with my toons...if you have other tips that you think can help me, just contnue to post! I will study all the replies and request more clarifications....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:41 PM - Feb 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@ Stag<br/>\n Thanks for the warm welcome, brother! I never left, I was just having a two-year Siesta, which is nothing in dragon years LOL.<br/>\n<br/>\n @ Hip<br/>\n Good to see you're still up here, man! And I've also returned to WoG, and I see you're still playing there. Great stuff! We should play together one day. Carnival in Brazil is basically a dead season in terms of work, so from today until next Thursday, I'll be free.<br/>\n<br/>\n About the search engine, I remember you and BC were working on it. Good to see the result. I am confused about something, though (and I didn't read the tutorial so if it's there I apologized in advance). The APR column refers to attacks per round, correct? My Holy Weapon Master with Cheese is listed as having 5 APR, when she in fact has 4 (we don't assume perma-haste, do we?). Similarly, my Magical Master build, which has 8 APR (10 if you go for the TWF feats), and I imagine the same goes for the others, although I just skimmed through this before posting this. And one more thing: Boy, Val has a TON of builds! I thought I was the most prolific builder in the guild, but apparently I was wrong LOL!<br/>\n<br/>\n @ Aquarius<br/>\n I felt EXACTLY the same way when I first joined in 2006 (or was it 2003? I can't remember, but it was a LONG time ago). I made the effort of writing a couple of \"full guides\" for beginners, so that this gap in knowledge of the game can be reduced more quickly (or less slowly to be more truthful). Please refer to the Game Guides section of this guild and look up \"A Complete Guide to the Basics of Character Building\", which talks about what you should take under consideration when building a toon (according to our standards LOL) and what you can safely disregard. Then after reading that, you can go to \"Playing Better\", which talks about things that you should know to USE your builds better in-game. There's a lot of important info in both guides that'll set you in the right track. Then there are many specific guides about specific classes, which can help you get to know how to play each class better. I wrote guides for Clerics, Druids and Paladins, Mick wrote a guide to Arcane Archers and Assassins, and Hip graced us with many skill-and-feat specific guides. There's a lot of knowledge in our tomes. You'll be amazed at how much useful stuff you can find out here. I would start with the two guides that I told you about because they're more general and generic, then move on to the class ones, then finally the advanced mechanics ones. IMO that's the order that makes sense.<br/>\n<br/>\n Happy that our home is still alive! See you guys soon! Take it EZ! (for old times sakes :D)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:49 PM - Feb 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><hr/>\n @ Hip<br/>\n Good to see you're still up here, man! And I've also returned to WoG, and I see you're still playing there. Great stuff! We should play together one day. Carnival in Brazil is basically a dead season in terms of work, so from today until next Thursday, I'll be free.<br/>\n<br/>\n About the search engine, I remember you and BC were working on it. Good to see the result. I am confused about something, though (and I didn't read the tutorial so if it's there I apologized in advance). The APR column refers to attacks per round, correct? My Holy Weapon Master with Cheese is listed as having 5 APR, when she in fact has 4 (we don't assume perma-haste, do we?). Similarly, my Magical Master build, which has 8 APR (10 if you go for the TWF feats), and I imagine the same goes for the others, although I just skimmed through this before posting this. And one more thing: Boy, Val has a TON of builds! I thought I was the most prolific builder in the guild, but apparently I was wrong LOL! \n</div></blockquote>\nThat's what happens when someone counts the beans.  No stones are left unturned and can be inspected under a microscope.<br/>\n<br/>\nAs to your questions...  yup, the Holy Weapon Master w/Cheese should be 4 APR and it's been noted for the next revision. Thanks. The 5 APR simply means the build uses the monk progression so the Magical Master is correct.  I didn't get into figuring DW potential.  Too much extra calculating per build.  Transcribing what's there now was tedious enough so sorry for the confusion.  The APR is based solely on BAB with the one exception being monk attack.<br/>\n<br/>\nJust to quickly reveal the genesis... <br/>\n<br/>\nBC and I were planning on building an on-line SQL database that included a front end.  That would have been an interactive window where submitters would populate the fields themselves and spare the efforts of one-by-one transcriptions. Well, BC bailed for personal reasons so I decided to make <span style=\"text-decoration:underline\">something</span> available on my own while the game still has new players coming on board.  The result is the spreadsheet you see on the NWVault.  Not perfect, but better than nothing and with far more functionality than the class/author/race query the old Search Engine was able to screen.  <br/>\n<br/>\nOnce you've played around with it a bit, you may be amazed beyond just noting the greatest number of contributions from a single author.  Blame the rest of the errors on Stagmeister.  Nah! Seriously... without his assistance, the data wouldn't be anywhere near as accurate as what it is.  IIRC I gave him a complimentary cookie but if not, he will surely remind me of the oversight.<br/>\n<br/>\nAs far as WoG goes... I'm still waiting for Rhaine to load the server onto a better machine.  It seems every time I've stopped in to wander around, either the server is down or empty.  Just FYI, I still have the toon we started for a dedicated party (it may even have been for <em>Daelen</em> AFAIK), waiting in limbo, though I'm no longer sure of which one.  Does <em>Nioche</em> strike a bell with you?  My memory seems worthless to me these days.<br/>\n<br/>\nAnyhoo... apologies to Aquarius for pseudo-hijacking the thread.  Sometimes these sideways diversions are unavoidable! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:43 AM - Feb 24, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good to see you're back from your siesta, Max! :)<br/>\n<br/>\n Mick<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:09 PM - Feb 24, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n<blockquote><div>Maximillian Kane wrote:<br/>\n<br/>\n @ Hip<br/>\n<br/>\n Good to see you're still up here, man! And I've also returned to WoG, and I see you're still playing there. Great stuff! We should play together one day. Carnival in Brazil is basically a dead season in terms of work, so from today until next Thursday, I'll be free.<br/>\n<br/>\n<br/>\n About the search engine, I remember you and BC were working on it. Good to see the result. I am confused about something, though (and I didn't read the tutorial so if it's there I apologized in advance). The APR column refers to attacks per round, correct? My Holy Weapon Master with Cheese is listed as having 5 APR, when she in fact has 4 (we don't assume perma-haste, do we?). Similarly, my Magical Master build, which has 8 APR (10 if you go for the TWF feats), and I imagine the same goes for the others, although I just skimmed through this before posting this. And one more thing: Boy, Val has a TON of builds! I thought I was the most prolific builder in the guild, but apparently I was wrong LOL!<br/>\n  </div></blockquote>\n That's what happens when someone counts the beans.  No stones are left unturned and can be inspected under a microscope.<br/>\n<br/>\n As to your questions...  yup, the Holy Weapon Master w/Cheese should be 4 APR and it's been noted for the next revision. Thanks. The 5 APR simply means the build uses the monk progression so the Magical Master is correct.  I didn't get into figuring DW potential.  Too much extra calculating per build.  Transcribing what's there now was tedious enough so sorry for the confusion.  The APR is based solely on BAB with the one exception being monk attack.<br/>\n<br/>\n Just to quickly reveal the genesis...<br/>\n<br/>\n BC and I were planning on building an on-line SQL database that included a front end.  That would have been an interactive window where submitters would populate the fields themselves and spare the efforts of one-by-one transcriptions. Well, BC bailed for personal reasons so I decided to make something available on my own while the game still has new players coming on board.  The result is the spreadsheet you see on the NWVault.  Not perfect, but better than nothing and with far more functionality than the class/author/race query the old Search Engine was able to screen. <br/>\n<br/>\n Once you've played around with it a bit, you may be amazed beyond just noting the greatest number of contributions from a single author.  Blame the rest of the errors on Stagmeister.  Nah! Seriously... without his assistance, the data wouldn't be anywhere near as accurate as what it is.  IIRC I gave him a complimentary cookie but if not, he will surely remind me of the oversight.<br/>\n<br/>\n As far as WoG goes... I'm still waiting for Rhaine to load the server onto a better machine.  It seems every time I've stopped in to wander around, either the server is down or empty.  Just FYI, I still have the toon we started for a dedicated party (it may even have been for Daelen AFAIK), waiting in limbo, though I'm no longer sure of which one.  Does Nioche strike a bell with you?  My memory seems worthless to me these days.<br/>\n<br/>\n Anyhoo... apologies to Aquarius for pseudo-hijacking the thread.  Sometimes these sideways diversions are unavoidable! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /></div></blockquote>\n<div align=\"left\">Hey Hip.<br/>\n<br/>\n I'm still confused about the APR thing. The Holy Weapon Master with Cheese wields a Longsword, which effectively nullifies the attack progression from Monk, so it is indeed 4. As for the number 5 being used to signify Monk attack progression, I don't understand. Monks get 1 attack per 3 points in BAB, so techincally, a \"full BAB\" Monk would have 6 APR, 7 with FoB, 8 with FoB and Hasted. So even assuming that the Holy WM would use Monk attack progression, it'd be 6 APR, not 5. Basically, Monks gain an extra attack at BAB 3,6,9,12,15,18. I can imagine how tedious it must've been, but I figure you'll want to correct that eventually, when you muster up the patience for this. I felt a bit impatient just looking at the thing, can't imagine how much work went into compiling all that data.<br/>\n<br/>\n BC and I have been playing together again lately. You should join us! We'll probably play tonight. I'm sure he'll be happy to see what you've done with the spreadsheet. Maybe he'll even feel motivated to resume your project :D. However, as far as this being a boon to new players, I don't know how many new players would be knowledgeable enough about the game to even take advantage of so much detail. You have to be aware of things to actively search for them, but kudos for the effort to both you and Stagmeister!<br/>\n<br/>\n As for the toon, yes, it was Nioche. Unfortunately, since I haven't seen you online in ages, I've been adventuring with Daelan and he's now level 18. But, worry not. I have many toons that can be a better aid to Nioche around level 11. In fact, there are still SO MANY builds of mine that I haven't played on WoG, even after all these years. I've been planning to make a Draconic Arcanist and a few more Baldur's Gate characters.<br/>\n<br/>\n You know, what keeps me playing this game even after all these years are the builds. I just love my characters so much, their unique talents and different playstyles that associate with each of them! It's mind-boggling how a game can be so wonderfully complexe and diverse to keep a hyperactive player such as myself interested even after all these years.<br/>\n<blockquote><div>Good to see you're back from your siesta, Max! :) Mick </div></blockquote>\n\n Thanks, brother! Glad to be back!<br/>\n<br/>\n @ Aquarius<br/>\n<br/>\n Sorry for hijacking the thread too. It's what happens when old friends reunite :D<br/>\n<br/>\n Cheers, everyone!</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:03 PM - Feb 24, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><hr/>\n<div align=\"left\">Hey Hip.<br/>\n<br/>\n I'm still confused about the APR thing. The Holy Weapon Master with Cheese wields a Longsword, which effectively nullifies the attack progression from Monk, so it is indeed 4. As for the number 5 being used to signify Monk attack progression, I don't understand. \n</div>\n</div></blockquote>\nEssentially what \"5\" means is \"M\", for \"Monk Progression\".  I can't use alphabetic characters in a numeric column or it won't collate properly (i.e. greater than/less than, etc.).  So, \"5\" means \"Monk Progression\".  It follows UBAB (Monk) instead of BAB like conventional attack progressions so they cannot be compared as apples-to-apples.  In essence, any value over 4 MUST be UBAB, right?  The particulars can be gleaned from the builds themselves via the handy-dandy URL links on the far left of the worksheet.<br/>\n<br/>\nIf you decide to revisit all the finished builds using monk attacks (that would be pre-, mid-, full epic and random) yourself and furnish the corrections (it <span style=\"text-decoration:underline\">must</span> be ALL, though, for consistency's sake), I'd be happy to add the corrections to the next update.  I didn't have extra time for such nuances when struggling to transcribe the vitals seeing as how it took about 6 months of painstaking effort to get what you see displayed (even with Stagmeister's invaluable assistance, no picnic).  The current plan is to allow sufficient time to amass a significant group of finished builds (epic and/or pre-epic, makes no difference to me), include any corrections and then repost to the NWVault.   I'm estimating 6-12 months judging from the recent level of ECB activity for that to occur. <br/>\n<br/>\nThere is a related issue with shifter builds.  There really is no way to glean the actual combat potential of the shapes via a set of native stats.  The limitations exist by the filter's design and requires the user to examine the build themselves to extract that level of detail. <br/>\n<br/>\nIt's not real-time, of course, so users will need to be checking for updates either by subscribing to the project or by checking the <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354531/\" rel=\"noreferrer\" target=\"_blank\">topic here</a>, similar in fashion, to updates Kamiryn has made to the CBC in the last several months (TBH, I am not sure I have been using the latest version... probably not).  The fewer updates, the better, when it comes down to it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:39 PM - Feb 24, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n  </div></blockquote>\n<div align=\"left\">Just a quick mea culpa here. Admittedly, it took me a bit of time to realise that anything reading over 4 in the APR column essentially meant \"Monk\", but then I was looking at all the little darlings, so it wasn't too hard to discern. If I missed a few hiccups in what was, effectively, a proofread (twice, as it transpires in this case) of Hip's more systematic and thorough labours, I apologise. Of course, I paid more attention to builds I liked, so maybe that's why it got missed <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />...<br/>\n<br/>\n<em><strong>EDIT: </strong></em>Damn it, still haven't mastered the quotey dumplings!</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "11:29 PM - Feb 26, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><hr/>@ Aquarius<br/>\n I felt EXACTLY the same way when I first joined in 2006 (or was it 2003? I can't remember, but it was a LONG time ago). I made the effort of writing a couple of \"full guides\" for beginners, so that this gap in knowledge of the game can be reduced more quickly (or less slowly to be more truthful). Please refer to the Game Guides section of this guild and look up \"A Complete Guide to the Basics of Character Building\", which talks about what you should take under consideration when building a toon (according to our standards LOL) and what you can safely disregard. Then after reading that, you can go to \"Playing Better\", which talks about things that you should know to USE your builds better in-game. There's a lot of important info in both guides that'll set you in the right track. Then there are many specific guides about specific classes, which can help you get to know how to play each class better. I wrote guides for Clerics, Druids and Paladins, Mick wrote a guide to Arcane Archers and Assassins, and Hip graced us with many skill-and-feat specific guides. There's a lot of knowledge in our tomes. You'll be amazed at how much useful stuff you can find out here. I would start with the two guides that I told you about because they're more general and generic, then move on to the class ones, then finally the advanced mechanics ones. IMO that's the order that makes sense.<br/>\n<br/>\n Happy that our home is still alive! See you guys soon! Take it EZ! (for old times sakes :D)<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">\n Thank you for the useful hint! I have printed them and began to read them...I plant to slowly study them, in order to (try to) master their contents....for now, <strong>many many thank you</strong> all for writing and posting these guides!<br/>\n<br/>\n I would like to ask you: if I have to build a spellsword but with minor levels, would it be feasible to build a lv 20/30 character? Because I'm thinking that, in order to gain undispellability, I have to throw away the \"melee\" progression...<br/>\n<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:02 PM - Mar 01, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey man! The question is not whether you CAN build a Spellsword for level 20 / 30 (the answer is yes, you can), but why would you want to? What makes spellswords poweful is high level arcane spells with a moderate melee presence. They essentially address the specific situations where mages are kind of weak by giving up some spellcasting ability in exchange for melee prowess. However, many of the signature best spells in the arcane arsenal are at their disposal: Time Stop, Mordenkainen's Disjunction, IGMS, Greater Spell Mantle, Premonition, damage shields, Etc... so they can fight in melee against minions (hordes of weaklings) and cast against the tough enemies or get themselves beat up and kill them via damage shields. <br/>\n<br/>\n The whole point of making a spellsword is to take advantage of that aspect. That being said, there may be concepts where you could get an effective toon with fewer caster levels, but I would have to have more specific information to point you in the right direction. Just as an example, I have rebuilt all the OC henchmen just for fun, and my build for Nathyrra is a spellsword with only 10 Wizard levels. And she's good. Not great, good. Being a concept build, she's a bit on the weak side for a powerbuild, but I believe she's as strong as she can be within her concept. Look her build up in the spreadsheet Hip mentioned above.<br/>\n<br/>\n Take it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "3:59 PM - Mar 13, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>Here's one to think about:  Dwarven LE Wiz25/Asn9/DwD6.  Haven't tried it yet but seems like a fun concept a first glance.  It came to me in a dream. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /></div></blockquote>\n<div align=\"left\">Go for it Hip.. this one I wanna see<br/>\n<br/>\n I opened up the CBC and played for a minute or so.. but takes sooo long to get to the Asn and DwD....<br/>\n<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}