{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "128",
  "name": "Improved Disarm?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/improved-disarm-t2354330.html",
  "author": "Fist",
  "avatar": "10759110_1577099721.jpg",
  "replies": 19,
  "posts": [
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "4:57 AM - Oct 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Being a relative newbie to character building, I've been discovering things about the game that most of you have known for a decade.  My current kick is to make builds that exceed the +20 AB cap.  In reading the NWNWiki, I saw that Improved Disarm has a -4 attack penalty, while offering a +4 bonus per category of size difference.  So wielding a large weapon against a medium weapon there is no penalty to attempt disarm, against small weapons there is a +4 bonus and against tiny weapons there is a +8 bonus.  <em>.<br/>\n<br/>\n I made a meleer wielding a two-hander and he is making mince meat out of opponents with smaller weapons when using ID.  Maybe he would even without ID, but it seems like the AB bonus in those instances is too good to be true.  Meanwhile, I don't see a lot of melee builds that include the feat.  Is there some reason more melee builds don't include it (especially given that it bypasses the AB cap)?</em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:09 PM - Oct 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's a matter of feats and priority mostly, improved knockdown has priority over improved disarm for disabling mages and thieves and has to be taken first. After that you may not have the available feats for that, not everybody is a fighter/ xx/ champion of torm build anyway. But after all is said and done it is also a matter of playing style. Most people tend to play defensively, so when they have to go without the shield's armour class (wog and sinfar aside) they want to see a really good benefit for that and not just a situational AB boost.<br/>\n<br/>\n Those things, don't change the fact that iimproved disarm is an awesome feat though. Take it whenever you can.<br/>\n<br/>\n See here also, i am talking about it =&gt; <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354319/BARBARIANROGUE?page=1#.VDfoMRZIrhQ\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... DfoMRZIrhQ</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "6:35 AM - Oct 11, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks - in playing my meleer. IKD is a much more necessary feat to drop casters, etc., when leveling.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "7:16 AM - Jul 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A simple question, can a dual-wielder be disarmed of two weapons at once? What if the two weapons are of different sizes?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "7:47 AM - Jul 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">(Improved) Disarm only targets the weapon in the target's right/main hand. If you get disarmed twice in a row then you will lose both weapons, but you will only lose one weapon per Disarm.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:02 PM - Jul 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Greetings Theophilus Fist!<br/>\n<br/>\nImproved disarm is a fabulous feat for any strength two handed build (or two bladed sword/double axe/dire mace), if you can spare the feats, exactly as Valerfor writes.<br/>\nI agree it is very underrated and should be used more. In fact I believe any serious two handed strength fighter build should try to get improved disarm.<br/>\nIt makes you feel like any non-spellcaster who doesnt bring a proper (large) weapon to a fight with you is not worthy of truly battling you.<br/>\nSmack that weapon out of their hand! Show me a proper weapon :)<br/>\n<br/>\nIt is basically a free disarm attempt for anyone who is not using a large weapon, fists, or a creature weapon. Plus one gets bonus +4 and +8 AB if they are using a small or tiny weapon. That bonus AB is also added to threat rolls, so you also have an additional chance to critical hit. One gets attacks of opportunity if NPC enemies are disarmed and not wearing gloves. Ordinary fists also struggle to penetrate damage reduction unless they are a monk or are wearing monk gloves. That ghostly visage becomes very high value all of a sudden. The feat also makes one change their cognitive strategy against rogue enemies. Without improved disarm one might try to knock them down or at least attack them so they don't sneak you to death. With Improved disarm one is spamming that feat as soon as a rogue with a knife turns up. Sometimes I am hoping the disarm attempt fails so I can continue to have that sweet sweet +4-8 AB :)<br/>\n<br/>\nI agree with Valerfor that Blind Fight, Knockdown and Improved Knockdown are higher on the priority list than Improved Disarm.<br/>\nTherefore feats become a problem and I've struggled to find a way to put improved disarm into builds without bonus combat feats, ie without Fighter or CoT, it is just far too much of a compromise and there arent enough feats.<br/>\nBut in any two handed strength fighter build, I try to get it with all the bonus feats available. <br/>\n<br/>\nI think <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build303254.html\" rel=\"noreferrer\" target=\"_blank\">The Charnel Lord</a> is a nice example of very good usage of the Improved Disarm feat. Palemaster builds have amazing defensive abilities but are hard to get the AB up compared with others, the improved disarm plus large weapon helps balance the build out quite nicely, plus the extra AB helps with devastating critical attempts :)<br/>\n<br/>\nRegarding exceeding the +20 AB Cap, there was a competition in the ECB many years back to try to get the highest melee AB possible in a single attack. Improved Disarm featured, along with cheesy Druid levels for extra AB outdoors, Weapon Master 28, Paladin for Taunt and Smite Evil for extra bonus AB was also used. <br/>\n<br/>\nHere's a few posts from the ages:<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build240191.html\" rel=\"noreferrer\" target=\"_blank\">Strength Highest Possible Melee AB</a> by Mithdradates<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build239999.html\" rel=\"noreferrer\" target=\"_blank\">Dexterity Highest Possible Melee AB</a> by Grimnir77<br/>\n<br/>\nHope that helps with some insight into this feat, it is definitely one of my favorites<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:35 PM - Jul 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here is a cool little thing - if you have Circle Kick, you can do two Improved Disarms a round!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:09 PM - Jul 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I don't know whether EE has changed things here, but Disarm and ID are all but useless in many modules, where even a successful attempt nets no result because of the way the mods are scripted. I'm not denigrating the feat(s) itself, but I am suggesting it's worth knowing your prospective environment before committing to it/them.<br/>\n<br/>\nCheers<br/>\n<br/>\nOh, and nice to see Web still flying the flag for Circle Kick - alright, I'll try to build it into my next Monk, promise!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:47 PM - Jul 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually I have noted some creatures (for example, the Duergar Rogues in the Duergar Mines of Abbor-Alz in WoG who seem to be wielding a shortsword) cannot be disarmed, however in the same module, similar creatures can be disarmed (ie Duergar Wall who dual wield warhammers or light hammers in the same area - hard to say which is which visually).<br/>\n<br/>\nIt raises two questions for me:<br/>\n1. Do I get the AB bonus from the improved disarm attempt despite the creature not being disarmable<br/>\n2. What is in the toolset which makes one creature (who should be disarmable) undisarmable, while another disarmable? My guess is that one creature has a weapon listed as a 'creature' weapon, while the other has it equipped. <br/>\n<br/>\n1. is going to be just being more observant I think, 2. should be simple enough when I get time to open the toolset<br/>\n<br/>\nI also am curious as to which SP modules D/ID shouldn't be taken, so I take a build with those feats taken out :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "12:32 AM - Jul 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The AB effects of Disarm will remain even if the target can't be disarmed.<br/>\n<br/>\nThe only way to make a creature immune to Disarm is to curse their weapon. This prevents the Disarm from working at all but the AB effect will remain.<br/>\n<br/>\nI just did some testing with a few different cases.<br/>\nBy default creatures are not disarmable, which means that they can lose their weapon to Disarm but they won't drop it. To make a disarmed weapon drop the creature must be disarmable and the weapon must be droppable, which requires changing the default settings. So making Disarm work on NPCs the same way it works for PCs is a conscious choice on the part of the module's creator.<br/>\nIf the creator chooses to make the creature immune to Disarm then they have to curse the weapon in the creature's right hand, so that is also a conscious choice.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:25 PM - Jul 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In the Toolset, under the Creature catagory (the advanced tab), one can set the Creature in question to be Disarmable or not Disarmable with a check mark.<br/>\n<br/>\nThe discrepancies in this case (between the Duergar Warriors and the Duergar Rogues) come from the fact that the Duergar Warriors, etc that are Disarmable are custom creatures, whereas the non-Disarmable Duergar Rogues (with white hair) are standard Creatures from the Toolset.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:28 PM - Jul 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So the question will probably be, why not make the non-disarmable Duergar disarmable?<br/>\n<br/>\nThis is to save resources in the Mod, by using standard resources where possible.  In this case, for whatever reason, the Disarm check mark is not set.  Probably an oversight by the Designer(s) in the Mod.  I would submit a bug report on this.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:08 PM - Jul 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great pick up Web<br/>\nI was pretty tired after work so I appreciate you loading up the toolset to investigate my random musings :)<br/>\nI'll forward to DM Wise this thread<br/>\nAnd it gives a lot of insight as to why creatures cannot be disarmed beyond creature weapons, <br/>\nThanks for looking it up!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:23 PM - Jul 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The non-disarmable NPCs are why I was advised long ago to not bother with Disarm.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:53 PM - Jul 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Most designers will only mark certain creatures/NPCs undisarmable if they are using weapons that are \"too powerful\" for the PW setting.<br/>\n<br/>\nI see this type of stuff all the time in Mods that I take apart to look at things in them, or to alter them if I dislike what I am experiencing.<br/>\n<br/>\nLooking in the toolset, I see that these Duergar are equipped with two Scimitars + 5.  That may be why they are not Disarmable.<br/>\n<br/>\nDisarm is still usable (Improved Disarm, that is) if one is either using a two-handed weapon OR is sizes bigger (like a Dragon).  It will give AB according to the size difference of the weapon(s) in question.  So if the opponent is using a tiny weapon, for example, the bonus will be +8 to AB.  That is pretty nice.<br/>\n<br/>\nI'm curious about the Dragon here.  If one has Improved Disarm and goes into Dragon Shape, what bonus does one get then?  The NWN Wiki says that Creature Weapons here are of the size catagory of the Creature in question.  the NWN Wiki says that Dragons are of Huge size. This is very interesting <blockquote><div>Attempting a disarm applies a -6 penalty to the character's attack roll, and the combatant with the larger weapon gains a +4 bonus per size category of difference.</div></blockquote>\n\nSince the Creature weapon is dependent on the size of the Creature, and Dragon Shape is Huge (one catagory higher than Large), that should be a bonus of 4 size catagories vs Tiny!!!  That would be +12 -4 = +8 to AB for Improved Disarm!!!!<br/>\n<br/>\nIt could be a way to dramatically increase AB in Dragon Shape.<br/>\n<br/>\nHas anyone tried testing this?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:26 PM - Jul 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">While attempting to test this I encountered a bug with NWN EE (v80.8193.13). It seems that Knockdown and Improved Knockdown are not selectable feats on Monk levels.<br/>\nCan someone else confirm if they also experience this bug please.<br/>\n<br/>\nI tested a Human/Dragon with Improved Disarm vs a Halfling. Weapons used were Dagger (Tiny), Kama (Small), and Scimitar (Medium).<br/>\nDragon AB: +56. Dragon ID AB vs Dagger: +52. Dragon ID AB vs Scimitar: +52. Dragon ID vs Unarmed: +52.<br/>\nHuman Kama AB: +34. Human Kama ID AB vs Dagger: +34.<br/>\nHuman Scimitar AB: +35. Human Scimitar ID AB vs Dagger: +39.<br/>\n<br/>\nSo Dragon Shape users will have a -4 AB penalty when using Improved Disarm regardless of the target's weapon size.<br/>\nHowever, Dragon Shape counts as unarmed when using Improved Disarm so disarmed weapons go straight to the disarmer's inventory instead of to the ground.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:42 PM - Jul 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Yunim wrote: <a data-post-id=\"21171\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21171&amp;sid=57eb4e2762e394ed1659711f32f11c56#p21171\">↑</a><div class=\"responsive-hide\">Jul 11, 2020</div></cite>While attempting to test this I encountered a bug with NWN EE (v80.8193.13). It seems that Knockdown and Improved Knockdown are not selectable feats on Monk levels.<br/>\nCan someone else confirm if they also experience this bug please.</div></blockquote>\nNow this is only a guess, but given that Monk gets KD/IKD free at level 6, might they be working it the same way as not being able to take the DW feats on a Ranger level because they get them for free at L1 and 9?<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "9:49 PM - Jul 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think that is the reason but this is the first time I've ever encountered it. I checked the wiki and apparently this has always been the case, so it's a feature rather than a bug.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:52 AM - Jul 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Yunim wrote: <a data-post-id=\"21173\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21173&amp;sid=57eb4e2762e394ed1659711f32f11c56#p21173\">↑</a><div class=\"responsive-hide\">Jul 11, 2020</div></cite>so it's a feature rather than a bug.</div></blockquote>\nIt is.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:06 AM - Jul 12, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for testing, Yunim.<br/>\n<br/>\nToo bad Dragon creature weapons are not considered huge; I mean, they are, but they are not.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}