{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "150",
  "name": "Avenger of Klauth Bard(11), Blackguard(19), Red Dragon Disciple(10)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/avenger-of-klauth-bard-11-blackguard-19-red-dragon-t2355195.html",
  "author": "eltalstro",
  "avatar": "10758878_1582351977.jpg",
  "replies": "10",
  "views": "2.8K",
  "posts": [
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "11:38 AM - Oct 14, 2019",
      "content": "<div>Bard(11), Blackguard(19), Red Dragon Disciple(10), Human<br/>\n<br/>\nThe Avenger of Klauth was a warrior priest of the Ancient Red Dragon Klauth. In 1372 DR, upon his return from scouring The Spine of The World for dragon eggs, he was aghast to find that (impossibly) Klauth, along with all of his minions, had been slain at the hand of the one called \"The Hero of Neverwinter\". In his fury and desire for vengeance, this dark vigilante built a great bone altar to Tiamat deep within Klauth's lair and made upon it repeated human sacrifices praying to learn the true identity of the defiler. Ultimately, this identity was never established, as literally millions of different adventurers (of varying abilities) claimed to be this hero. Legend has it The Avenger of Klauth is still hunting down each one, near and far across Faerun, and exacting Klauth's terrible vengeance. <br/>\n<br/>\nI'm sure there have been plenty of these done. When I'd finished (not before), I checked for other builds and found Mick's Paragon of Pain (Ba 8, RDD 10, BG 22) which has +1 AB which is attributable to the +2 STR of his build (which is in turn attributable to this build taking OvCrit and DevCrit feats) and +1 Naked AC (attributable to 10 Dex vs 8 Dex). It also has  I went for 19 BG, 11 Ba, foregoing the bonus feat for +2 AC +1 to skills and access to improved invisibility. You could always rely on scrolls for that spell I suppose but it's reasonably expensive if you want to use it a lot. <br/>\n<br/>\nThe divine damage on the crits is nice (but only x2) and I like the level 24 access to Dev Crit with a pretty high DC. I think (possibly) it may have been Mick Dagger himself who said it's never too early to take Dev Crit or something along those lines. I also noticed Mick took ESF Taunt instead of Discipline. Is there a point where taking any more ranks of discipline becomes redundant? What I don't like is having to get the toons gears off to cast spells (who would do that in a dungeon full of demons and undead?) You also have to be very strategic about casting darkness with zero concentration.<br/>\n<br/>\nSo, after many years of this, I think I'm getting a bit better at it. Let me know what you think.<br/>\n<br/>\nSTR: 16 (38)<br/>\nDEX: 8<br/>\nCON: 14 (16)<br/>\nWIS: 8<br/>\nINT: 12 (14)<br/>\nCHA: 16 (18)<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Bard(1): Knockdown, Power Attack<br/>\n02: Bard(2)<br/>\n03: Bard(3): Cleave<br/>\n04: Bard(4): STR+1, (STR=17)<br/>\n05: Bard(5)<br/>\n06: Bard(6): Great Cleave<br/>\n07: Bard(7)<br/>\n08: Bard(8): STR+1, (STR=18)<br/>\n09: Blackguard(1): Weapon Focus: Scimitar<br/>\n10: Blackguard(2): {Smite Good}<br/>\n11: Blackguard(3)<br/>\n12: Blackguard(4): STR+1, Improved Critical: Scimitar, (STR=19)<br/>\n13: Blackguard(5)<br/>\n14: Blackguard(6)<br/>\n15: Blackguard(7): Divine Shield<br/>\n16: Blackguard(8): STR+1, (STR=20)<br/>\n17: Blackguard(9)<br/>\n18: Blackguard(10): Divine Might<br/>\n19: Red Dragon Disciple(1)<br/>\n20: Red Dragon Disciple(2): STR+1, (STR=23)<br/>\n21: Red Dragon Disciple(3): Overwhelming Critical: Scimitar<br/>\n22: Red Dragon Disciple(4): (STR=25)<br/>\n23: Bard(9)<br/>\n24: Red Dragon Disciple(5): STR+1, Devastating Critical: Scimitar, (STR=26)<br/>\n25: Red Dragon Disciple(6)<br/>\n26: Red Dragon Disciple(7): (CON=16)<br/>\n27: Red Dragon Disciple(8): Great Strength I, (STR=27)<br/>\n28: Red Dragon Disciple(9): STR+1, (STR=28), (INT=14)<br/>\n29: Red Dragon Disciple(10): {Darkvision}, (STR=32), (CHA=18)<br/>\n30: Bard(10): Great Strength II, (STR=33)<br/>\n31: Blackguard(11)<br/>\n32: Blackguard(12): STR+1, (STR=34)<br/>\n33: Blackguard(13): Great Strength III, Epic Weapon Focus: Scimitar, (STR=35)<br/>\n34: Blackguard(14)<br/>\n35: Blackguard(15)<br/>\n36: Blackguard(16): STR+1, Great Strength IV, Epic Prowess, (STR=37)<br/>\n37: Blackguard(17)<br/>\n38: Blackguard(18)<br/>\n39: Bard(11): Epic Skill Focus: Discipline<br/>\n40: Blackguard(19): STR+1, Armor Skin, (STR=38)<br/>\n<br/>\nHitpoints: 460<br/>\nSkillpoints: 212<br/>\nSaving Throws (Fortitude/Will/Reflex): 29/25/22<br/>\nSaving Throw bonuses: Spells: +6<br/>\nBAB: 27<br/>\nDev Crit DC: 44 unbuffed<br/>\nAB (max, naked): 45 (melee), 27 (ranged)<br/>\nAC (naked/mundane armor/shield only): 23/34<br/>\nSpell Casting: Bard(4)<br/>\nAlignment Changes: 0<br/>\nBardsong: Attack +2, Damage +2, Saves +1, HP +8, AC +2, Skills +2<br/>\n<br/>\nSneak Attack: 6D6<br/>\n<br/>\nDiscipline 43(67), Hide 5(4), Lore 8(21), Perform 14(18), Spellcraft 30(32), Taunt 36(40), Tumble 40(39), UMD 36(40)<br/>\n<br/>\n<br/>\n01: Discipline(4), Hide(4), Perform(4), Save(12), <br/>\n02: Discipline(1), Hide(1), Perform(1), Spellcraft(5), Tumble(5), Save(5), <br/>\n03: Discipline(1), Perform(1), Taunt(3), Save(6), <br/>\n04: Discipline(1), Perform(1), Taunt(3), Save(7), <br/>\n05: Discipline(1), Perform(1), Taunt(1), Save(10), <br/>\n06: Discipline(1), Perform(1), Save(14), <br/>\n07: Discipline(1), Perform(1), Spellcraft(5), Tumble(5), Save(8), <br/>\n08: Discipline(1), Perform(1), Taunt(2), UMD(7), Save(3), <br/>\n09: Discipline(1), Taunt(1), Save(5), <br/>\n10: Discipline(1), Taunt(1), Save(7), <br/>\n11: Discipline(1), Taunt(3), Save(7), <br/>\n12: Discipline(1), Taunt(1), Save(9), <br/>\n13: Discipline(1), Taunt(1), Save(11), <br/>\n14: Discipline(1), Taunt(1), Save(13), <br/>\n15: Discipline(1), Taunt(1), Save(15), <br/>\n16: Discipline(1), Taunt(1), Save(17), <br/>\n17: Discipline(1), Taunt(1), Save(19), <br/>\n18: Discipline(1), Lore(8), Save(14), <br/>\n19: Discipline(1), Spellcraft(5), Save(12), <br/>\n20: Discipline(1), Save(15), <br/>\n21: Discipline(1), Save(18), <br/>\n22: Discipline(1), Save(21), <br/>\n23: Discipline(1), Perform(1), Tumble(15), UMD(10), <br/>\n24: Discipline(1), Save(3), <br/>\n25: Discipline(1), Spellcraft(5), Save(1), <br/>\n26: Discipline(1), Save(4), <br/>\n27: Discipline(1), Save(7), <br/>\n28: Discipline(1), Save(10), <br/>\n29: Discipline(1), Save(14), <br/>\n30: Discipline(1), Spellcraft(5), Taunt(1), Tumble(5), UMD(9), <br/>\n31: Discipline(1), Taunt(1), Save(3), <br/>\n32: Discipline(1), Taunt(1), Save(6), <br/>\n33: Discipline(1), Taunt(1), Save(9), <br/>\n34: Discipline(1), Taunt(1), Save(12), <br/>\n35: Discipline(1), Taunt(1), Save(15), <br/>\n36: Discipline(1), Taunt(1), Save(18), <br/>\n37: Discipline(1), Taunt(1), Save(21), <br/>\n38: Discipline(1), Taunt(1), Save(24), <br/>\n39: Discipline(1), Perform(2), Spellcraft(5), Taunt(3), Tumble(10), UMD(10), <br/>\n40: Discipline(1), Taunt(4), </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:39 PM - Oct 14, 2019",
      "content": "<div>I like it, eltalstro! And kewl back-story as well (makes me sad you can't pursue the \"Hero of Neverwinter\" into Aribeth's Redemption).<br/>\n<br/>\nJust a couple of thoughts for you - more as potential alternatives than amendments, 'cause he stands up well as is. I think it's a judgement call whether to take Knockdown or Blind Fight and may be environment-specific. (Theoretically, you could take it at level 39 instead of the ESkF.) If you're concerned by lack of Concentration or a detect skill (Listen/Spot) you could probably afford to drop CON to 12 (14) and boost INT to 14 (16) - 40 hps for 43 sps. Alternatively, given that the Bard spells aren't likely to be stellar in their impact and will be easily dispelled (let alone stripping before casting, as you say - talk about a bizarre cult!), you could equally drop CHA for more INT.<br/>\n<br/>\nBut that's just fiddling around the edges. Well done!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:06 PM - Oct 14, 2019",
      "content": "<div>Just had a thought...<br/>\n<br/>\nHow about swapping ESkF for Curse Song?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "1:11 PM - Oct 14, 2019",
      "content": "<div>That's a good thought, Stag. I was puzzling over Blindfight as well. I thought about swapping it for Armour skin. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:43 PM - Oct 14, 2019",
      "content": "<div>Solid build eltastro!<br/>\n<br/>\nNice class choices, nice level split in regards to bonus feats. Nice Strength score in conjunction with a very solid base Charisma score for a Str build. <br/>\n<br/>\nThe Base AB is lovely at 45. I like the background story. Thank you for your contribution, it was great to read.<br/>\n<br/>\nI like Blind Fight in combat builds. Re-rolling against concealment is very valuable, ie that 50% concealment becomes 25% concealment etc etc... <br/>\n<br/>\nI think it would be reasonable to swap it for Armor skin, your build has Tumble 40 + RDD AC for a +12 AC bonus already, and will likely use a tower shield as well with that scimitar, unless you are going to hold a torch or holy symbol or cosmetic item etc etc (with bards you never know what they truely get up to!). Add Divine Shield you have heaps of AC already.<br/>\n<br/>\nThe main issue is Armor Skin is taken as a Blackguard bonus feat and I dont think blind fight counts as a bonus feat for blackguard so there may be a bit of shuffling to do.<br/>\n<br/>\nAny other suggestions I make are really minor nitpicks, but the purpose of the guild is for optimisation so I'll put a few suggestions below. <br/>\n<br/>\nencourage others to review my suggestions, say its good or bad I'm cool with whatever you think:<br/>\n<details><summary>Spoiler</summary>\nInt 12 vs Int 14: I like Stag's comment, 460hp is pretty solid, just depends on how much of a beefcake you need to be in the environment you are in also how many skill points you need, whether true sight is nerfed or not etc etc also how likely you are going to be able to Cap your constitution score (for up to +240 hp)\nPre-epic class split: Suggest Bard 6 RDD 4 BG 10 as the pre-epic class split, if possible. That way you get the RDD goodies faster in epic levels (ie RDD 10 at level 26 rather than 29), also you get a touch more skill points and the +4 bonus strength pre-epic too\nTaunt: as the amount of AC depends on the difference between your taunt roll and the opponents concentration roll, the higher you can get this score, the better. As to where you take the skill points from, I would suggest UMD, you can manage with a modified UMD score of 30 with the bard special stuff with arcane casting but this would apply to a low magic or mid magic environment.  in a high magic environment you will want a decent UMD score to equip that uber gear so you might take the points from spellcraft instead.\nESF Taunt vs ESF Discipline: I like both feats. Which you choose depends on the environment. Knockdown immune items in an environment where disarm is not a feature favors taunt. If there are no knockdown immune items or there are heaps of enemies with improved disarm then ESF Discipline is going to be more valuable. An RDD with 38 base strength / 50 capped strength is going to be pretty tough to beat his score ESF Discipline or not. I think either is cool\nEpic Vrock: With your blackguard levels you could take the Summon Epic Fiend feat if you wanted, not sure whether you like that feat or not. Powerwise I'm also not sure as well, been several months since I used that feat in a build\n</details></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "8:08 PM - Oct 14, 2019",
      "content": "<div>All good suggestions, Orion. I'm off to work. Couldn't sleep last night so stayed up building. Now feel like a vrock's rear end. This game is often my bane.<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:29 PM - Oct 14, 2019",
      "content": "<div>Would sir like his rump of vrock well-done, medium or rare? (Sorry, couldn't resist.)<br/>\n<br/>\nOn the feats side of things, you could still take a late Blind Fight at level 40, as, while Orion is right, it's not a Blackguard epic BF, it's still a pre-epic one, and thus available throughout - the same would be true of KD. I'm just always a little cautious of taking pre-epic feats in epic levels.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "10:50 PM - Oct 14, 2019",
      "content": "<div>Yes the pre epic in epic conundrum was why I didn't include it, Stag. It's pretty essential though and a glaring weakness now that I look at it.<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:49 PM - Oct 14, 2019",
      "content": "<div>Speaking purely as I tend to play - particularly with STR builds - I'd take Blind Fight instead of Knockdown (even as a late convert to the utility of the feat). I can get by without the one, but not the other. I'm going to go rugby now. After a red card (and speaking as a loose-head prop of many years standing), I'd sacrifice a centre, wing or even flanker to keep my front five tight. That's what you build from. Others may differ (the jessies)...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "2:04 AM - Oct 15, 2019",
      "content": "<div>It's just that the KD/SA combo is so lethal much like the All Blacks' attack. What is good though is that I have to make a choice between great or even better (also much like the ABs attack options). I'm going to take another look when I get home (at the cbc not the rugby). Building is the ultimate opportunity cost educator. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:38 AM - Oct 15, 2019",
      "content": "<div>Well you're right, of course, and that's why I wouldn't have a question about the KD/SA if it was in a Dex build. In a Str build, less so, 'cause you should just dispatch 'em in the first place - particularly when hasted - and this build can do that. (Much as those damned silver ferns just keep swiping regular human folk out of the way, with only about 18 people in the whole country - and one of them's you! Sonny Bill on the bench...for crying out loud.)<br/>\n<br/>\nI'll confess, \"opportunity cost educator\" gets all my hairs bristling, but the perverse side of me kind of likes it...<br/>\n<br/>\nIt's all very worrying</div>",
      "author-color": "#AA0000"
    }
  ]
}