{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "475",
  "name": "Druid / Monk / Rogue -un-armed combat For Arelith",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/druid-monk-rogue-un-armed-combat-for-arelith-t2196103.html",
  "author": "EvidentofEvil",
  "avatar": "10235222_1510287070.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "EvidentofEvil",
      "avatar": "no_avatar.png",
      "timestamp": "2:00 AM - Feb 02, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">This Build request is for Arelith Server 3x class Prior to swapping to new class <br/>\nI am looking for a build suggestion TO maximize the ability to survive and deal out moderate damage Un-armed *due to Druids shape shift function* This build will most likely go totem which means That Str, Dex and Con will be hit in order to add stat bonii to Wis, Int, and Cha, but as the Totem grows In *levels/power* the Base stats will raise along with it.<br/>\n<br/>\nRace is Moon elf - Moon Elves +2 DEX, -2 CON at creation. With the new GIFT at creation ability I am looking at taking things that Increase the Wis +2 and the CON +2 as well as Gift of Tongues which allows me to Learn languages faster than Average. <br/>\n<br/>\nBut basically Druid for the shifter abilites.. NOT going to go SHIFTER Prestige class, just want to be able to combat in Shifted form. Monk of course for the AC as well as Cross classing spot, And Rogue lastly for SKill dump into UMD/Tumble/ and spot <br/>\nOne last thing Level One creation will take expertise for later uses!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "EvidentofEvil",
      "avatar": "no_avatar.png",
      "timestamp": "1:50 PM - Feb 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Still looking for help with this conceptual Build Folks any suggestions as to HOW to go about building this lady?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:49 PM - Feb 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>EvidentofEvil wrote:</strong>Still looking for help with this conceptual Build Folks any suggestions as to HOW to go about building this lady?</div></blockquote>\nI wouldn't.  Not with rogue anyway.  It buys you nothing but a few sneaks and UMD.  UMD is very nice but adds no power to the build.<br/>\n<br/>\nAnother problem is XP penalty.  With the combo you are suggesting it will reach 40% for much of the build. Unless of course, elf race has been modified to favor druid, monk or rogue, then only 20%.<br/>\n<br/>\nThe ONLY reason I would consider a druid shifter (rather than a shifter shifter) is dragon shape.  All the other shapes suck, including elder elemental.  The AB is just too lame to hit regularly unless you play a druid/cleric self-buffing unarmed shape, which is a fairly exotic build.  So the only way to reach dragon shape by level 30 is via CoT.  Otherwise, elemental is about as good as you will get with a rogue tertiary.<br/>\n<br/>\nAs far as skills go, with CoT &amp; monk dumps you will be able to reach very high levels of Tumble, Listen, Spot &amp; Discipline.<br/>\n<br/>\nSo here is my recommendation, based on a vanilla elf (adjust according to Arelith guidelines):<br/>\n<br/>\nMonk(6), Druid(20), Champion of Torm(4), Elf, Lawful neutral only <br/>\n(Monk 4/Druid 16 pre-epic)<br/>\n<br/>\nSTR: 8<br/>\nDEX: 10<br/>\nCON: 10* <br/>\nWIS: 18 (30)<br/>\nINT: 16<br/>\nCHA: 8<br/>\n<br/>\n*Note: I \"threw\" all spare points in CON to help in early pre-morph levels; shapes overwrite STR/DEX/CON later on, but you have 4 pts to toss around as you prefer.<br/>\n<br/>\nDiscipline 32(31), Listen 31(43), Spellcraft 33(36), Spot 32(44), Tumble 30(30), remaining ----&gt; 65 <br/>\n<br/>\nNote: Some of the skills will get overwritten by DS except not WIS- or INT-based ones. For example, Discipline will reach at least 51 on Arelith <br/>\n<br/>\nPre-epic feats (in no particular order): WF: kama (need this for CoT), WpnFinesse (if badger or air elemental), Imp Crit:Unarmed, BlindFight, Toughness, Expertise (not sure why, but you seem to want it... maybe for dragon breath or offensive casting?), Extend Spell (or Empower Spell).  In epic, all Grt WIS and DS.<br/>\n<br/>\nLotsa great buffs like AoV, Stoneskin &amp; Owl's Insight will make your dragon shape almost impossible to kill.  Premonition to cut through enemy DR.  Unless you go PvP against DevCritters, there is never a need for elemental shape.  But it is there if you need it.<br/>\n<br/>\nStill, you could sub rogue in for CoT, gain some trap skills and UMD perhaps, but lose DS.  Your decision really.  Just remember that unarmed forms get a relatively poor merge bonus when you choose equipment.<br/>\n<br/>\nOne question 4 u though:  Why would you Xclass Spot with Monk when you can take it as a rogue skill dump?  ANY class can Xclass Spot.    Spot is also a class skill with CoT, BTW.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}