{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "231",
  "name": "Might be a dumb question...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/might-be-a-dumb-question-t2354420.html",
  "author": "campgod",
  "avatar": "no_avatar.png",
  "replies": "26",
  "views": "1.2K",
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "12:37 AM - Apr 15, 2015",
      "content": "<div>But why can't I find a Assassin CoT combo? I know one is evil and the other is non-evil but can't you just do an alignment change? On the server i play on, you can change it easily.<br/>\n<br/>\n P.S. I just realized this might not be the section to post this in...sorry. If not can someone move it? Though I would like to see a build if this combo is doable, ty.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:48 PM - Apr 15, 2015",
      "content": "<div><blockquote><div><strong>campgod wrote:</strong><hr/>But why can't I find a Assassin CoT combo? I know one is evil and the other is non-evil but can't you just do an alignment change? On the server i play on, you can change it easily.<br/>\n<br/>\n P.S. I just realized this might not be the section to post this in...sorry. If not can someone move it? Though I would like to see a build if this combo is doable, ty.</div></blockquote>\n<div align=\"left\">\n Hey CG!<br/>\n<br/>\n The reason for there not being this combo is exactly that alignment conflict, because you'd typically need to alternate between them (since you'd likely have to invest heavily in Assassin for the Death Attack DC (only reason to take Assassin instead of Rogue, which would give you Evasion as well as the same d6 of extra flanking damage)), but you'd need a few CoT levels pre-epic to build BAB and a few post-epic to get feats such as EWF and EP. That means MULTIPLE alignment shifts and the need for a 3rd class that can be useful with just a few levels and has Hide and Move Silently as class skills (otherwise you'll need at least 7 levels of the other class, as both Assassin and CoT are prestige classes). That presents a lot of challenges, not to mention the fact that there really aren't that many synergies between the classes. For example, what would CoT add to a guy that relies on approaching unseen and paralyzing opponents? Wouldn't Fighter be better for WS / EWS? Or what would Assassin add to a melee guy who has high saves and a lot of feats? Wouldn't Rogue be better for more skill points and Evasion and not requiring an alignment shift?<br/>\n<br/>\n On the other hand, it's a new concept, and you've been here for a while, so why don't you try to build this thing yourself and once you've got a build sketch you post it here for revision and tweaking?<br/>\n<br/>\n Take it EZ!</div></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:59 PM - Apr 15, 2015",
      "content": "<div>The short answer  to this is that it doesn't augment his (assassin's) powers, on the other hand a (ranger 10/ cot 10/ ass 20) might have some use.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:32 PM - Apr 15, 2015",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>The short answer  to this is that it doesn't augment his (assassin's) powers, on the other hand a (ranger 10/ cot 10/ ass 20) might have some use.</div></blockquote>\n<div align=\"left\">\n On a dual-wielder I'd go Ranger 9 CoT 10 Assassin 21, on a single weapon I'd consider Ranger 8 CoT 10 Assassin 22. Also, we might consider not going with 10 CoT, like Ranger 9 CoT 8 Assassin 23 or Ranger 8 CoT 6 Assassin 26 are acceptable spreads as well.<br/>\n<br/>\n Take it EZ!</div></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:41 PM - Apr 15, 2015",
      "content": "<div>I went with ranger 10 for a reason, 9 levels for getting itwf asap and then the 10th level comes later for a bonus epic feat.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:06 PM - Apr 15, 2015",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>The short answer  to this is that it doesn't augment his (assassin's) powers, on the other hand a (ranger 10/ cot 10/ ass 20) might have some use.</div></blockquote>\n<div align=\"left\">I'd rather play a ranger 10/ assassin 30, but there are builds that keep a high assassin level and are even better.<br/>\n Blackguard gives full BAB, sneak attacks, a boost to saves and access to divine feats. In that respect blackguard grants much of what a cot/assassin combination can offer.</div></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:12 PM - Apr 15, 2015",
      "content": "<div>I would too, basically the contradiction here happens because in order for cot to give you good resaults it takes at least 10 levels and that weakens considerably the assassin part of the build. Cot being a prestige class only worsens the situation.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:18 PM - Apr 15, 2015",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>I went with ranger 10 for a reason, 9 levels for getting itwf asap and then the 10th level comes later for a bonus epic feat.</div></blockquote>\n<div align=\"left\">\n I know, dude, but I doubt a build with 10 CoT and 20 Assassin levels would need a feat over 1 DA DC and 1 more D6 of damage, right? If you go Ranger 9 Cot 3 Assassin 8 pre-epic, you still have 4 feats to take in epics. Ranger 9 Cot 7 Assassin 4 is also a possibility for more BAB, but IMO that'd be a waste of feats.<br/>\n<br/>\n @Mick<br/>\n<br/>\n I agree 100%, dude, although I would prefer a Ranger 10 Assassin 26 Fighter 4 for more versatility.<br/>\n<br/>\n Take it EZ!</div></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:26 PM - Apr 15, 2015",
      "content": "<div>Hmmm, yeah was thinking some CoT for saves and for BAB and I have never seen one. I was also thinking Ranger with the two cause of the Duel wield with the added spells that can help an assassin. I like assassin over rogue on my server for a couple of reasons, One he gets HiPS at lvl 8 and the Imp. invisibility. Scrolls and wands are hard to come by (only made by players) and need to have UMD to use. There is a short list of spells you can put on wands and most aren't that great. 3xspell lvl+caster lvl= UMD needed. I guess I could just do a BG for the saves? But I was hoping to try something different.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:39 PM - Apr 15, 2015",
      "content": "<div><blockquote><div><strong>campgod wrote:</strong><hr/>Hmmm, yeah was thinking some CoT for saves and for BAB and I have never seen one. I was also thinking Ranger with the two cause of the Duel wield with the added spells that can help an assassin. I like assassin over rogue on my server for a couple of reasons, One he gets HiPS at lvl 8 and the Imp. invisibility. Scrolls and wands are hard to come by (only made by players) and need to have UMD to use. There is a short list of spells you can put on wands and most aren't that great. 3xspell lvl+caster lvl= UMD needed. I guess I could just do a BG for the saves? But I was hoping to try something different.</div></blockquote>\n<div align=\"left\">We are talking about regular NWN rules here, not just one server. I don't think it's proper balancing to give HiPS to Assassins at level 8 at all, but if your server does that and you're happy playing there and it's so easy to switch alignments, then by all means build one! We'll happily review him for you!</div></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:45 PM - Apr 15, 2015",
      "content": "<div>I am not sure agree with at what lvl it comes, but really you do not think assassins should get HiPS? lol. I'll see what I can do...I am really bad a making builds. Ty you all for your thoughts.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:55 PM - Apr 15, 2015",
      "content": "<div><blockquote><div><strong>campgod wrote:</strong><hr/>I am not sure agree with at what lvl it comes, but really you do not think assassins should get HiPS? lol. I'll see what I can do...I am really bad a making builds. Ty you all for your thoughts.</div></blockquote>\n<div align=\"left\">By giving Assassin HiPS you simply RUIN the SD class. Just as a reminder, you need to have 8 Hide and Move Silently for Assassin, for SD you also need Tumble, Dodge and Mobility (which requires 13 DEX), so you are basically reducing the requirements of HiPS and adding all the Assassin mojo to it. I think it kinda fits the concept, but from a gaming perspective, it really isn't balanced.<br/>\n<br/>\n As for builds, you should start by reading my Complete Guide to the Basics of Building in the Game Guides section. I would really be surprised if you were a good builder without ever having made any builds. It takes experience and trial and testing and knowledge, but it's all at your disposal here. It seems like this is a great place to get you started :D<br/>\n<br/>\n Have fun!</div></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:59 PM - Apr 15, 2015",
      "content": "<div>Take notice that this would be a hard thing to do campgod, with the limited amount of umd on your server that is. You will basically need to max-out no less than three stats, Str OR Dex, Int &amp; Cha, to have the desired results. If you decide that it's worth the effort then try something like Ranger 10/ BG 4/ Assassin 26, and see how it goes from there. Don't forget to take DS as well if you do that.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:02 AM - Apr 16, 2015",
      "content": "<div>As far as Assassins go, the 3.5 Edition does give them HiPS, so it is not unfair, rather the SD's are lacking in abilities.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "1:41 AM - Apr 16, 2015",
      "content": "<div>So could I do say Halfling with starting Stats: Str14,Dex16,Con10,Wis14,Int8,Cha14? I want to make sure I get the Str, Dex, Wis and Cha needed for all the goodies. Would Int of 8 be that harmful to the build? I do not have Excel so i can not use the calculater :(</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:41 AM - Apr 16, 2015",
      "content": "<div>A Hin is not advised here, and the reason for this is that you don't have the means for Epic Dodge, so Dexterity-based isn't that appealing in this case. Human would fare better and you could always use his bonus feat for those BG requirements and Divine Feats. Better start with Human and (Str 16, Dex 8, Con 12, Int 14, Wis 8, Cha 16) use a sword &amp; large (not tower) shield set-up, and get those feats: Weapon Focus, Improved Critical, Knockdown, Improved Knockdown, Blind Fight, Power Attack, Cleave, Divine Shield pre-epics. Then in epic levels you should get Epic Weapon Focus, Epic Prowess (bonus), Armour Skin, Great Strength IV, ESF: Hide (bonus), ESF: Move Silently (bonus), Epic Reflexes (bonus), Improved Sneak Attack (bonus) and Divine Might OR something similar. The split will be (Ranger 9/ BG 3/ Ass 8) pre-epic and final split should be (Ranger 10/ BG 4/ Assassin 26) OR similar. Now, do understand that i did that of the top off my head in literally two minutes, so there might be better ways to do this or i might made some mistakes, but in general this is a good way to start building your character. The AC &amp; Saves should be really good for a Strength-based Assassin if you max-out your Charisma (+9 to everything) and damage is guaranteed because you are Strength-based with access to umd and 30 natural strength, not to mention the 13 (14) d6's of Sneak attack &amp; IKD. Death attack's DC is a healthy 38/ 44 (with maxed INT), so you are no slouch there either.<br/>\n<br/>\n Now, if you wanted a Dexterity-based Assassin (traditional hin-ninja) you should ask Mick kindly, he is the president of shinobi around here and has made more than a couple of them already. Some say he cuts his steaks with a kusarigama that he always carries with him, so he should know better than me...<br/>\n<br/>\n Hope i helped some,</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:48 AM - Apr 16, 2015",
      "content": "<div>Hey campgod!<br/>\n<br/>\n Val's suggested spread is really optimized, with only one exception. I wouldn't take BG 4 in epics. The reason it's optimized is that you have 4 BG levels to take Divine Might and Divine Shield, (the minimum you need), Ranger 10 gives you a Bonus Feat, which, if taken in Epics (after 20) can be Epic Prowess. And Assassin 26 also gives you a bonus feat. <br/>\n<br/>\n One more thing you should do is go to the Search Engine and get an idea from the Ranger / BG / Assassin builds that are already out there. They may serve you as inspiration. You could look at the differences and similarities between them and decide what suits you best in each. I always do this. When I have an idea for a build, I look at what has been done. Sometimes what I thought about is original, but sometimes I find builds that are EXACTLY what I thought about making. Then I save those builds into my \"favorite builds from other builders\" folder. In that folder I have several masterpieces, such as Grizz's Dracolich of Autumn Twilight, Mith's Blood &amp; Faith, Mith's Hierophant of Valsharoon, Kail's Order of Jormungandr, StryderBlade's Dwarven Wall of Wonders, Val's Battle Sorceress, Mick's Spellsword of Bahamut, just to name a few.<br/>\n<br/>\n Those builds were almost exactly done the way I'd do them, and the changes I'd have made to them to suit my style (if any at all) would've been so small that they're just mere tweaks. Seeing what's been done may give you a better idea of what you should pursue.<br/>\n<br/>\n Take it EZ!<br/>\n<br/>\n EDIT: I forgot to mention the most common occurence when it comes to searching the Search Engine. I find many or at least a few builds with the class combo but that are quite sub-optimal according to my standards, which is exactly what happened with my STR-based Assassin. I did find many builds, most were DEX-based, which was out of my scope, but those were quite good, then the two STR-based builds were quite underwhelming and I was able to build something much more powerful than what was there.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:58 PM - Apr 16, 2015",
      "content": "<div><blockquote><div><strong>campgod wrote:</strong><hr/>Would Int of 8 be that harmful to the build? I do not have Excel so i can not use the calculater :(<br/>\n  </div></blockquote>\n The Assassin's Death Attack uses INT to help determine the DC, so a low INT would be bad.<br/>\n I've been using the free Open Office to run the CBC spreadsheet, and there are other free office suites to choose from, too.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "1:07 AM - Apr 17, 2015",
      "content": "<div>Great ty guys for all the info! I did try and look up a Ranger/BG/Assassin and there was only I saw and it was Dex based with only 2 lvl ranger spells and none of the Divine stuff. So I think I will try the Str route and see what happens. I was hoping to duel wield a weapon called a Sai from my server(dagger based weapon) but going str I just don't see that happening. I will try the sword/board route and maybe a duel mace setup. What do you guys think about maybe even going a two-bladed sword setup? I tried those starting stats and I can not get those. Human starts off with 11 wisdom..so i think that is messing it up?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:01 PM - Apr 17, 2015",
      "content": "<div><blockquote><div><strong>campgod wrote:</strong><hr/>Great ty guys for all the info! I did try and look up a Ranger/BG/Assassin and there was only I saw and it was Dex based with only 2 lvl ranger spells and none of the Divine stuff. So I think I will try the Str route and see what happens. I was hoping to duel wield a weapon called a Sai from my server(dagger based weapon) but going str I just don't see that happening. I will try the sword/board route and maybe a duel mace setup. What do you guys think about maybe even going a two-bladed sword setup? I tried those starting stats and I can not get those. Human starts off with 11 wisdom..so i think that is messing it up?</div></blockquote>\n<div align=\"left\">\n The problem with that setup is the low AC. Divine Shield will only help if you can cap CHA, and even then it's only 9 rounds, so unless you can figure out a way  to compensate for the lack of a shield, I would advise against it. Wisdom 11 is not because of Human, it's because of Ranger. You should get 12 Wisdom to start and take the points out from CON.</div></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "6:17 AM - May 01, 2015",
      "content": "<div>First of all i want to thank everyone for the ideas and to Valfor for pretty much laying it all out.<br/>\n<br/>\n<br/>\n Ranger(10), Blackguard(4), Assassin(26), Human<br/>\n<br/>\n  Alignment: Any Evil<br/>\n<br/>\n  Playability: 1-40 (shooting for PvP)<br/>\n<br/>\n  STR: 16 (30)<br/>\n  DEX: 8<br/>\n  CON: 12<br/>\n  WIS: 8<br/>\n  INT: 14<br/>\n  CHA: 16<br/>\n<br/>\n  Human: (Quick to Master)<br/>\n  01: Ranger(1): Power Attack, Blind Fight, Favored Enemy: Humans, {Dual Wield, Trackless step}<br/>\n  02: Ranger(2)<br/>\n  03: Ranger(3): Weapon Focus: Warhammer<br/>\n  04: Ranger(4): STR+1, (STR=17)<br/>\n  05: Ranger(5): Favored Enemy: Elves<br/>\n  06: Ranger(6): Cleave<br/>\n  07: BG(1)<br/>\n  08: BG(2): STR+1, {Smite Good, Dark Blessing}, (STR=18)<br/>\n  09: BG(3): Divine Shield {Turn Undead, Create Undead}<br/>\n  10: Ranger(7)<br/>\n  11: Ranger(8)<br/>\n  12: Ranger(9): STR+1, Lighting Reflexes, {Improved Two-Weapon Fighting}, (STR=19)<br/>\n  13: Assassin(1): {Death Attack}<br/>\n  14: Assassin(2): {Uncanny Dodge, Poision Resist}<br/>\n  15: Assassin(3): Improved Crit:Warhammer<br/>\n  16: Assassin(4): STR+1, (STR=20)<br/>\n  17: Assassin(5)<br/>\n  18: Assassin(6): Iron Will<br/>\n  19: Assassin(7)<br/>\n  20: Assassin(8): STR+1, {Hide in plain sight} (STR=21)<br/>\n  21: Ranger(10): Epic Weapon Focus: Warhammer, Epic Powers<br/>\n  22: Assassin(9)<br/>\n  23: Assassin(10)<br/>\n  24: Assassin(11): STR+1, Great Strength I, (STR=23)<br/>\n  25: Assassin(12)<br/>\n  26: Assassin(13)<br/>\n  27: Assassin(14): Great Strength II, Epic Skill Focus:Move slightly (STR=24)<br/>\n  28: Assassin(15): STR+1, (STR=25)<br/>\n  29: Assassin(16)<br/>\n  30: Assassin(17): Great Strength III, (STR=26)<br/>\n  31: Assassin(18): Improved Sneak Attack I<br/>\n  32: Assassin(19): STR+1, (STR=27)<br/>\n  33: Assassin(20): Great Strength IV, (STR=28)<br/>\n  34: Assassin(21)<br/>\n  35: Assassin(22): Epic Skill Focus: Hide<br/>\n  36: Assassin(23): STR+1, Armor Skin, (STR=29)<br/>\n  37: Assassin(24)<br/>\n  38: Assassin(25)<br/>\n  39: BG(4): Divine Might<br/>\n  40: Assassin(26): Improved Sneak Attack or Epic reflexes STR+1, , (STR=30)<br/>\n<br/>\n<br/>\n  Skills: Concentration 42, Discipline 42, Hide 43, Move slightly 43, Taunt 42, Tumble 40, UMD 41<br/>\n<br/>\n<br/>\n  Notes: At lvl 8 Assassin's receive HiPS. I chose Warhammer because on my server there is a 2H weapon (maul) that uses the same weapon focus as it, so I can go from 1H and board to a 2h<br/>\n weapon when need be. (might be able to sneak up hit them with the 2H then switch to the other if need be) I usally do not take KD or Imp KD since most have high Dis. or wear KD <br/>\n immunity armor. Not sure if i should wear Full plate or Med. armor. Heavy I receive +3 AC but -3 in MS and Hide. I know I pick Divine Might late but i really didn't need it till <br/>\n lvl 40 anyway and I wanted to take Concentration, Dis. and Taunt to 42 points for the PvP aspect of it. I lvled this guy on my server cause i couldn't get that damn character<br/>\n calulater to work...(more like i have not learned how to use it right..lol) I have +12 on my Con,Str,Cha and Int (which is cap). So any ideas or help on how to make this better?<br/>\n I do not care about playability since now i am at lvl 40 I can redo the build, well except for lvl 1. Thanks for your time.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:27 PM - May 01, 2015",
      "content": "<div>Not that bad for a 1st build, man! Much better than mine were when I first started, for sure!<br/>\n<br/>\n Now, I do see a few problems and a few good things about it, so let me give you a general overview on it.<br/>\n<br/>\n 1- the split is the best possible, but NOT if you are going for Taunt. The idea is to take BG 4 pre-epic and take Divine Shield in place of Iron Will, for example. Why would a HIPSer stand in front of an enemy long enough to Taunt them? It just doesn't make sense! Suggestion: drop Taunt and move BG 4 to level 15, taking Divine Might and Divine Shield pre-epic.<br/>\n<br/>\n 2- Improved Sneak Attack doesn't work unless you have Sneak Attack (from BG or Rogue), and BGs only get Sneak Attack at level 4, so if you weren't convinced on Taunt dropping, this is surely a very good reason.<br/>\n<br/>\n 3- Warhammers are not the best weapon for this guy, much less a 2-handed Maul, because with 26 Assassin levels, you want as many attacks in the first flurry as you can for more chances to paralyze your opponent (why else would you play an Assassin?). I'd stick with Handaxes or Maces, which can be dual-wielded with ease. That's also part of the reason you went with Ranger and not Fighter, so that you could dual-wield without the DEX investment. Handaxes also have a better threat range.<br/>\n<br/>\n 4- HIPS comes very late, so I suggest dropping Lightning Reflexes for Expertise to increase your survivability pre-epic. I'd also take it at level 1 and delay Blind Fight. <br/>\n<br/>\n 5- The not-taking of Divine Shield in epics frees up a feat, which you can use to rework your starting stats for more HP for free. Drop starting CHA to 15 and take those points and put them in CON, then swap your attribute increases around to include one CHA increase at whatever level you start using Divine Might and Divine Shield. Take Great Strength with that last feat to round up your stats.<br/>\n<br/>\n Other than these few things, the rest looks quite good. How did it feel to lose your building virginity? LOL<br/>\n<br/>\n Take it EZ!</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:33 PM - May 01, 2015",
      "content": "<div>Thanks max! It hurt and felt good...LOL.  Since my toon is lvl 40 now i can redo all but my stats and lvl 1. So I see your point for survivability but now i am 40 I could get away with it? I wasnt thinking about the size of the weapons...smaller they are the faster attacks I can get off? As far as the Improved SA i thought it works with the Assassins DA? He has 13d6, why would it let me take it then? I just looked at it in game says rogue, BG or Assassin with 8d6 DA. Now does the Imp. SA add +2 to the 13d or is that with it? I think i will try your other suggestions though and see. Thank you for your wisdom.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:37 PM - May 01, 2015",
      "content": "<div>Apparently you didn't take your time reading the wiki. It describes the bug with ISA. Read it:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Improved_sneak_attack\" rel=\"noreferrer\" target=\"_blank\">read the notes</a><br/>\n<br/>\n The thing about the weapons is not the size. It's that you can equip one weapon on the right hand as you would and one on the left hand. That is called dual-wielding, which for assassins is VERY good because you get extra attacks on the first flurry ( you have 2 normal and 3 hasted), which means higher chance of paralyzing an opponent with your Death Attack. Normally, you WOULD NEED the following feats to be able to dual-wield without a HUMUNGOUS penalty? Two-Weapon Fighting, Improved Two-Weapon Fighting and Ambidexterity (and you`d need to use a small weapon on the off-hand to prevent a higher penalty even with those feats.<br/>\n<br/>\n HOWEVER, Rangers receive all of that for free. They get Two-Weapon Fighting AND Ambidexterity combined in one feat called Dual-Wield at level 1, and they get Improved Two-Weapon Fighting at level 9, which is EXACTLY WHY we told you to go with Ranger, or at least one of the reasons Rangers and Assassins are so synergetic. The \"catch\" is that the Ranger dual-wield only works with Light armor, so that means LOW AC for you, except that you have HIPS, so you can live with it.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:40 PM - May 01, 2015",
      "content": "<div>Oh, thought they fixed it with the patch 1.69? Says if the assassin has at least one die form rogue or BG It works? yeah i have always loved rangers and assassins together just for that reason...well that and the ranger spells improve the Hide/MS.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:47 PM - May 01, 2015",
      "content": "<div>Yes, but in your original build you only got that SA die at level 39.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:50 PM - May 01, 2015",
      "content": "<div>I see, great once again ty for your time Max</div>"
    }
  ]
}