{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "024",
  "name": "Flat-foot",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/flat-foot-t2356196.html",
  "author": "darktooth",
  "avatar": "10759000_1542893921.jpg",
  "replies": "3",
  "views": "443",
  "posts": [
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "5:21 AM - Jan 01, 2024",
      "content": "<div>Scenario: A creature is caught flat-footed by an enemy archer who attacks at a rate of 5 attacks/round.<br/>\n  <br/>\na. If the creature reacts immediately, does it suffer the effects of flat-foot the whole round, or could it be as short as the enemy’s first attack only, or first flurry (first two attacks)?<br/>\n<br/>\nb. What actions does the creature have to take to cancel the flat-foot condition as quickly as possible?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:31 PM - Jan 01, 2024",
      "content": "<div>I could well be wrong here, but my understanding is that taking an action - of whatever type - negates flat-footedness. Thus, I would expect the state to last for no longer than the first flurry, assuming your PC doesn't simply continue to gawp around gormlessly.<br/>\n<br/>\nThings like Blind Fight, Defensive Awareness, Uncanny Dodge, and a detect skill should help mitigate the flat-footed state (not sure about Epic Dodge, I'm afraid. Initiative checks used to have some relevance, but not so much these days), but as to the quickest way to cancel the condition, I couldn't say, sorry.<br/>\n<br/>\nBasically, it's about having something lined up in your action queue.<br/>\n<br/>\nOthers may well be better informed, but I hope this helps a bit.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:29 PM - Jan 01, 2024",
      "content": "<div>Initiative checks determine who has the first go in an encounter. <br/>\nIf you're flat footed, you already lost the Initiative check.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HarperDaniels",
      "avatar": "no_avatar.png",
      "timestamp": "11:48 AM - May 14, 2024",
      "content": "<div>I appreciate it. Thanks for the info. I am a college student and when I talk about my book report, sometimes the collected material seems like chaos. To remove it I took help from this website <a class=\"postlink\" href=\"https://academized.com/cheap-book-report\" rel=\"noreferrer\" target=\"_blank\">https://academized.com/cheap-book-report</a> They are a writing service provider website. I have used them and the best thing I like about them is that they are so affordable and they are also written by a team of professionals. If you also need help in your work, you can also get help from them.</div>"
    }
  ]
}