{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "401",
  "name": "Arelith Unique Class: Warlock",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-unique-class-warlock-t2334581.html",
  "author": "Mage",
  "avatar": "10235244_1510287070.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "Black Mage",
      "avatar": "no_avatar.png",
      "timestamp": "2:06 PM - Jun 03, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello everyone!<br/>\n<br/>\nIt's been a while since I posted here (I tend to lurk) about a previous build for the Arelith server (again, thank you for the advice back then). Now, I'm thinking about creating another new PC and while I do sort of have a build in mind, I was hoping to ask for your much more experienced opinion about it's viability.<br/>\n<br/>\nThe level 30 Arelith server introduced a few new \"Path\" classes a while ago. By taking a path a character surrenders one or more of his abilities in exchange for something else. In the case of the Bard, by agreeing to be non-good and giving up access to Bard/Curse song they are given a magic staff with a number of abilities. There are two lines of power available (Unseelie and Fiendish) but for the most part they work the same.<br/>\n<br/>\nFull details of this class and abilities are listed <a class=\"postlink\" href=\"http://wiki.arelith.com/Warlock\" rel=\"noreferrer\" target=\"_blank\">here</a>, but as of writing this the wiki sseems to be temporarily down so I'll write the main class details here. It's a bit of a mouthful but if you have the patience to read through and offer tips, thanks a bunch.   <br/>\n<br/>\n=======================================================================<br/>\n<br/>\n<br/>\nAlignment restrictions: Non-Good<br/>\n<br/>\nHit die: d6<br/>\n<br/>\nProficiencies: As Bard<br/>\n<br/>\nSkill points: As Bard<br/>\n<br/>\nSkills: appraise, bluff, concentration, craft armor, craft trap, craft weapon, discipline, heal, hide, listen, lore, move silently, parry, perform, persuade, pick pocket, spellcraft, taunt, tumble, use magic device<br/>\n<br/>\nUnavailable feats: divine might, divine shield, extra turning, weapon specialization, Lasting Inspiration, Curse song<br/>\n<br/>\n<br/>\nPrimary saving throw(s): reflex, will<br/>\n<br/>\nBase attack bonus: +3/4 levels<br/>\n<br/>\nSpellcasting: Warlocks have access to all the spells and equipment a Bard of equal level would. Their invocations (staff spells) are also subject to arcane spell failure (But since there is a breastplate and scale mail without spell failure available from level 14 onwards, this isn't such a biggie). They come in two types, actual wizard spells and their \"elderitch blast\". All staff spells can be used an infinete amount of times between rests, normal Bard spells are still with limited uses. Warlocks are supposedly immune to disarm (a little glitchy) however the main downside is that since these spells come from an item, even when hasted they can only take one action (rather than gaining an additional attack or two spells cast)<br/>\n<br/>\n-------------------------------------------------------------------------<br/>\nLevel \tFiend Pact \t       I         Fey Pact<br/>\n1 \tEldritch Blast \t               I         Eldritch Blast<br/>\n6 \tDisplacement \t               I        Displacement<br/>\n11 \tChain Blast \t               I        Chain Blast<br/>\n14 \tAnimate Dead \t               I        Dominate Person<br/>\n17 \tWall of Fire \t               I        Mind Fog<br/>\n21 \tSphere Blast \t               I        Sphere Blast<br/>\n26 \tGate \t                       I        Dominate Monster<br/>\n<br/>\n   Eldritch Blast: Long range beam attack (overwritten ray of frost, no spell school). Make a ranged touch attack to hit. The blast will do 1d6 damage per 2 class levels (rounded up). <br/>\n<br/>\n    Displacement: As spell. The caster level is warlock/bard class level. <br/>\n<br/>\n    Chain Blast: Overwritten Chain Lightening, no spell school. As long as the Warlock keeps hitting with their ranged touch attack, their Chain Blast will hit as many targets as are within its area of effect. <br/>\n<br/>\n    Animate Dead : As spell. Warlocks with GSF necromancy may have two undead at a time alongside their normal summon <br/>\n<br/>\n    Dominate Person: As spell. <br/>\n<br/>\n    Wall of Fire: As spell. <br/>\n<br/>\n    Mind Fog: As spell. <br/>\n<br/>\n    Sphere Blast: An overwritten Scintillating sphere(?), no spell school, which automatically hits the intended location, causing a large explosion. All hostile creatures in the area are hit, though they can attempt a reflex save for half damage (Evasion works as usual). <br/>\n<br/>\n   Gate: As spell.<br/>\n<br/>\n   Dominate Monster: As spell, slight extension to duration <br/>\n<br/>\nThe base DC for domination spells is 10 + charisma modifier + half Warlock class level + Spell focus (for the non-blast spells)<br/>\n<br/>\n-------------------------------------------------------------------------------------------------------------<br/>\n<br/>\nAll three elderitch blast spells can vary in attack element and most carry an additional effect that lasts one round. By default the blast does magical damage, but this can be changed through a conversation brought up on the item. The downside? It cannot be done in combat, so your stuck with whatever element you picked until the fight ends or you can get far enough away.<br/>\n<br/>\n<br/>\n Level \tFiend Pact              I     \tFey Pact<br/>\n1 \t        Magic                     I   \tMagic<br/>\n4 \t       Fire \t                     I           Cold<br/>\n8 \t       Acid \t                     I          Electrical<br/>\n12 \t       Negative \t             I          Positive<br/>\n16 \t      Brimstone                I     \tRimestone<br/>\n20 \t      Vitriolic                   I     \tStunning<br/>\n24 \t      Unholy                     I       \tHoly<br/>\n<br/>\nOnce at level twelve a Warlock doesn't gain any additional elements, they just get their extra de-buff effect.<br/>\n<br/>\n    Brimstone: The Fire blast now blinds for one round in addition to doing damage, fortitude save negates. <br/>\n<br/>\n    Rimestone: The Cold blast now slows for one round in addition to doing damage, fortitude save negates. <br/>\n<br/>\n    Vitriolic: The Acid blast now deals -1 CON damage in addition to doing damage, fortitude save negates. <br/>\n<br/>\n    Stunning: The Lightning blast now dazes for one round in addition to doing damage, fortitude save negates. <br/>\n<br/>\n    Holy: The Positive blast now heals non-undead allies in the area of effect  as well as harming foes (A...Whopping 3d6 healing). <br/>\n<br/>\n    Unholy: The Negative blast now heals undead allies in the affected area, and drains d3 temporary levels from foes as well as damaging them (Uncertain if this has a fortitude save, but I suspect it does. Level drain stacks as usual so it is possible to drain an enemy to death. Supposedly it is possible to gain up to 100+ temp HP from this ability, but none of the players seem to know how it works ). <br/>\n<br/>\nSpell resistance works as normal against an Elderitch Blast, and the Warlock's spell penetration feats are counted but since the blast has no level or spell school Spell mantles are ignored  (as are spell immunity effects). The save DC for an Elderitch sphere blast is 10 + half class level + charisma modifier.<br/>\n<br/>\n====================================================================================<br/>\n<br/>\nSo, the Warlock class is really a jack of all trades, master of none with a heavy focus on UMD.The playerbase seems to agree that while the best class on the server for PvM (Allegedly there has been a CON-based fiend warlock who has soloed the entire server a year or so back) they are harder to use for PvP. Having made a test character and run him up to level 9 I agree, it's a fun little class but I'm more interested in if built properly it could be a destroyer of worlds in all combat.<br/>\n<br/>\nI originally considered a High CHA Unseelie Warlock 26 / 4 Blackguard build for a generalist flavour. 4 Attacks per round, 13d6 Blast, UMD, possibly stealth and using the classes seeming flexibility to pick at weaknesses (I.e: Silence-Melee rushing mages, Casting on fighters ect). That said, the seeming weakness of the holy blast and the way the domination effect can be so easily countered by PC's (lol clarity potion) does concern me.<br/>\n<br/>\nThe fiend pact seems to have less use for CHA (only Unholy seems to make much use of it, the other blast types don't appear that useful) which  is why the idea of a CON build also intrigues me.<br/>\n<br/>\nI love the RP aspect of the unseelie pact, but I just want to be able to knock heads  If I was to make a PC of this \"class\", would you have any suggestions?    <br/>\n<br/>\nP.S: Normal arelith rules still apply to this class. No-alignment deviations (Good Warlocks would lose all their levels) and when taking a new class one has to take a minimum of three levels successively (3 Rogue/3 Wizard then a Rouge level would be fine, 2 Wizard/ 1 Rogue isn't).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:05 PM - Jun 03, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, it seems to me that this new class is more caster-oriented. I'd say that for that reason, you'll need to take it in as many levels as possible.<br/>\n<br/>\n26/4 seems like a good split.<br/>\n<br/>\nHowever, I have a question, you said that Divine Shield and Divine Might are unavailable. Does that mean that you can't take those feats EVER or that you just can't take them in levels that you take the Warlock class?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Ethalox",
      "avatar": "no_avatar.png",
      "timestamp": "5:34 PM - Jun 03, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nHowever, I have a question, you said that Divine Shield and Divine Might are unavailable. Does that mean that you can't take those feats EVER or that you just can't take them in levels that you take the Warlock class?</div></blockquote>\nDivine Shield and Divine Might are both avaliable on the server.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Black Mage",
      "avatar": "no_avatar.png",
      "timestamp": "5:44 PM - Jun 03, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey!<br/>\n<br/>\nYes, most of the Warlocks I have encountered in game generally seem to aim for 20+ warlock levels (Only one I've encountered who hasn't is a 20 fiend warlock/ 10 Pale Master. Seemed like a decent anti-melee character with his immunities and unlimited Skeleton Chieftans but didn't seem as if he could really fight much else). Suppose it makes sense <br/>\n<br/>\nDivine Might and Divine Shield..Sorry, I should have mentioned them! Yep, they can be taken on non-warlock levels <br/>\n<br/>\nEdit: Ninjad!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:30 PM - Jun 03, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey, man!<br/>\n<br/>\nSo, from what I can see, you can do this in two ways.<br/>\n<br/>\nThe first one is a CHA-based Warlock 26 / Blackguard 4, with Divine Shield to provide AC and Divine Might to compensate for the lack of damage. You can start with trashed WIS and DEX, 14 INT, 12 CON, 16 STR and 16 CHA with the extra points going into STR and CHA. Take Warlock lvls, then BG lvls 10,11,12 and 15. Your pre-epic BAB will be 16 then.<br/>\n<br/>\nOr you can go for a more Melee-fighting machine by taking PM levels at lvl 19, 20, 21 and on. That would mean a final spread of 16/10/4 for critical hit immunity and also the loss of 1 BAB UNLESS you forget about Tumble and UMD in epics. That's why I dislike lvl 30 builds. This toon could be a beast at level 40 with 26 Warlock, 10 PM and 4 BG. Oh well, what can you do?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}