{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "515",
  "name": "looking for a lvl 30 sneak",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/looking-for-a-lvl-30-sneak-t515445.html",
  "author": "campgod",
  "avatar": "no_avatar.png",
  "replies": "17",
  "views": "968",
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "7:07 PM - Sep 08, 2011",
      "content": "<div>Hello, I have been looking at all your builds from the old site to this one. I have learned a lot from looking over all the builds posted over the yrs and the comments to them. I am by no means a builder myself though. I am trying to make a lvl 30 sneak build. I am looking at a Rogue/Assassian/SD build. The server I am on \"Orb of Abrogation\" it is a just starting back up so its low everything. I have to take at least 5 lvls of whatever am taking. So I was thinking at least 5 lvls of SD, the req. 11 lvls of rogue to start with pre epic if that is right? And the rest in assassian? I am up for anything though. This is a hard to lvl server and will take time to build.Taking SD I will not be allowed to take epic dodge, but I love beening able to HIPS. I will be Rping an evil toon but want to be able to kick butt as well. If anyone here can help me you have my thanks.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "7:13 PM - Sep 08, 2011",
      "content": "<div>Forgot to say am using Rapiers duel-weilding.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:11 PM - Sep 08, 2011",
      "content": "<div>Why won't you be allowed to take Epic Dodge? Is that a server thing?? Cuz normally, you could, just saying. I would let go of assassin there, mate, because if you need a Rogue 11 requirement and 5 SD, that is already 16 levels, which is far from optimized and leaves onlt 14 levels for Assassin. Death Attack DC is based on Assassin levels, and so the only real unique thing that Assassin can bring to the build would be semi-worthless with those server rules. You would need Rogue 13 and SD 5 minimum to try to optimize that build. That leaves you with 12 levels to play around with. You can go Rogue 15 SD 5 CoT 10 and have many combat feats and higher AB and saves or Rogue 13 Fighter 12 SD 5 and have even more feats, weapon specialization and epic weapon specialization to help with damage output. Personally I would go for Fighter, take 10 or 11 (if that is mandatory) before 20, then Rogue 1 to get your skills up, then SD 4 and the rest rogue till 20. Then after 20 all rogue with one SD anywhere for Defensive Roll and Fighter 12 after Epic Weapon focus for Epic Weapon Specialization. With Rogue 10 you get Improved Evasion and voila! Epic Dodge! If they don't let you, oh well... And finally, to round up the build take CRIPPLING STRIKE as your Rogue 13 Bonus Feat. I love CS, LOVE IT!!!<br/>\n<br/>\nDual wielding Rapiers is TERRIBLE. Rapier is a medium weapon, which means all your attacks will be with -4 penalty. Go for a smaller weapon for -2 standard penalty. Short Sword, Dagger, Kukri, Handaxes, Maces. I'd choose Shortsword. It's cooler.<br/>\n<br/>\nAs for starting stats, go for 16 DEX, 14 INT for skill points, some STR for damage and some CON for HP. Trash Wisdom and CHA. You could drop one feat and 30 skillpoints to be a dwarf for added sturdiness, but I wouldn't recommend that.<br/>\n<br/>\nIt wasn't clear if you have to go STRAIGHT one class for the first 11 levels, if so go FIghter, if not start with Rogue for more skill points, then Fighter 10 (or 11) then another Rogue to get the skills up and fill the requirements for SD and then SD. You can take SD as soon as lvl 8 if I misunderstood and you don't need to go 11 lvls straight with one class. Then take Rogue 2 at lvl 7 to fill in requirements. Remember to respect the rule of 4 with Rogue and SD so you don't trash your BAB. If you don't know what that is, read my guide in the General Discussion Forum. A Complete Guide to the Basics of Building.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:16 PM - Sep 08, 2011",
      "content": "<div>Thank you kane. I have seen your name on many builds, so thanks for your time. The no Epic dodge if you take SD is a server thing for some reason here. So on that note should I even take Def.roll? I just thought whatever class you take first you had to have more of that one than any other by lvl 20 or you would get dinged so how? I do not know the rule of 4 lol so I need to go need that post of yours. Didnt know about the -4 on the rapiers just thought they looked cooler and hit harder...guess size dosent count in this case lol. Thanks again for your wisdom.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:31 AM - Sep 09, 2011",
      "content": "<div>So about this 5 level minimum per class... do they need to be consecutive?  If so, you could run one of he classes into epic like 1-16 Class1/17-20 Class2 and then another Class 2 at Level 21 for the prereq of 5.  Otherwise, if the 5 minimum is embedded within pre-epic, you'll need something like either 8/12 or 12/8 to get the highest BAB unless both classes are fighter types in which case the rule of 4's doesn't apply.<br/>\n<br/>\nOnce you fulfill the 5 minimum can you dump 1 level at a time from that point forward?</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "12:49 AM - Sep 09, 2011",
      "content": "<div>The classes dont all need to be taken at once, it just needs to be there by lvl 30. I just finished reading Kane's \"guide to the basics\" and my brain is about to blow up! lol. If you guys can look at the spread I tried making to see what needs to be done here I thank you. Trying to keep in mind all the info I just read about the rule of 4 and every 3 lvls is a feat and your lvl+3 is the skill dump and....well let me know. I did lvl 1 rogue, 2-6 fighter, 7 rogue, 8-11 SD, 13 fighter 14-18 rogue, 19-20 fighter for pre-epic. Then i did 21fighter, 22 rogue, 23 SD, 24-27 rogue, 28-30 fighter.? I have no idea if this works. This what I was came up with doing this for my first time...Thanks again for any info.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:18 AM - Sep 09, 2011",
      "content": "<div><blockquote><div><strong>campgod wrote:</strong>The classes dont all need to be taken at once, it just needs to be there by lvl 30. I just finished reading Kane's \"guide to the basics\" and my brain is about to blow up! lol. If you guys can look at the spread I tried making to see what needs to be done here I thank you. Trying to keep in mind all the info I just read about the rule of 4 and every 3 lvls is a feat and your lvl+3 is the skill dump and....well let me know. I did lvl 1 rogue, 2-6 fighter, 7 rogue, 8-11 SD, 13 fighter 14-18 rogue, 19-20 fighter for pre-epic. Then i did 21fighter, 22 rogue, 23 SD, 24-27 rogue, 28-30 fighter.? I have no idea if this works. This what I was came up with doing this for my first time...Thanks again for any info.</div></blockquote>\nIf I've counted right it looks like you have Rogue 7/4 SD/8 Fighter so what happened at level 12? If it's rogue then you have decent split of Rogue 8/SD 4/ Fighter 8 for BAB of 17 and 4 APR.<br/>\n<br/>\nJust make sure when you dump that you account for the ability modifier.  For example, with CHA of 8 (-1) you should dump for UMD at 3, 8, 13, 18 or you will not make the next UMD level (1, 5, 10, 15, 20) without boosting it somehow.  Not that you need to dump at all these levels, just when you do dump, make sure you account for the penalty if one exists.  With Tumble, it doesn't matter about the ability modifier because only the allocated ranks matter for AC (though it does matter for the skill check), but that is an exception as most skills do take into account the modifier.<br/>\n<br/>\nBTW, reading Max's posts sometimes makes my head explode too but you will recover... eventually.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "2:05 AM - Sep 09, 2011",
      "content": "<div>Ok great, thank you Hip. I have seen your name in past a lot too, so thanks for your time.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:07 AM - Sep 09, 2011",
      "content": "<div>Defensive Roll is an AUTOMATIC Sd 5 feat. You're not gonna pick it, but you are gonna get it!</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "6:01 AM - Sep 09, 2011",
      "content": "<div>LOL oh, ahhh yeah just testing you. Seems like you still have it. lol. Thanks guys.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:50 PM - Sep 09, 2011",
      "content": "<div>Okay, campgod... I just hashed out a draft of what I think is a decent level 30 DWing DEX sneaker build.  Here is a brief overview:<br/>\n<br/>\nSplit: Rog 19/Ftr 6/SD 5<br/>\nAbility spread: STR 10/DEX 20(28)/CON 12/WIS 8/INT 14/CHA 8*<br/>\n* You can drop DEX to 18(26), bump STR to 14 if you'd rather have the +2 damage than the AB, AC, skill &amp; reflex boost. Sneakers live and die by sneaks however. <br/>\nRace: halfling<br/>\nHP: 244<br/>\nWeapon(s): kukri(s)<br/>\nAB @30: 35 (BAB @20: 16, 4 APR)<br/>\nAC @30: 26/28<br/>\n<br/>\n11d6 Sneaks (w/Imp SA)<br/>\n<br/>\nSkills: Hide 33(42), Mv Sil 33(44), Tumb 33(42), Disc 32(32)* - remaining 153<br/>\n* Discipline shown as maxed in this distribution but could be ignored since is still rather low with a DEX build.  Your decision.<br/>\nI'd also recommend maxing at least UMD &amp; Listen, and throw in locks &amp; traps which really don't need to be maxed.<br/>\n<br/>\nFeats (other than prereqs): Imp Crit: kukri, Blind Fight, Crippling Strike, Imp SA, Epic Dodge, Epic Prowess, WS/EWS<br/>\n<br/>\nWith human, you will get another feat &amp; 30 more skill points but be less \"sneaky\" and lucky.<br/>\n<br/>\nAlso, you could save one feat using daggers but their damage is piercing rather than slashing so if you find scrolls of Keen Edge they will be worthless (i.e. less keen, fewer crits). <br/>\n<br/>\nMost notable CONs are:  lack of combat attacks like KD &amp; Cleave, relatively low HP, lowish AC  The PROs should be just as obvious.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:12 AM - Sep 10, 2011",
      "content": "<div><blockquote><div>BTW, reading Max's posts sometimes makes my head explode too but you will recover... eventually. </div></blockquote>\n\nThanks, Hip, with friends like these.... <br/>\n<br/>\nCampgod, I realize that is a LOT of info for someone just starting, but to us it's second nature cuz we do this pretty much every week or so, we read, look at builds and comment on them. If you stick around long enough, it will be to you as well. That is just what you need to get started. Skill dumps, BAB progression, requirements and stuff are mainly the basics to building effectively. With this you can explore the classes and combos nwn offers to a very good extent. I've been here since 2006 and there is still so much I don't know or remember! Welcome to the ECB!<br/>\n<br/>\nTake Hip's advice on the UMD dumping, by delaying Rogue 1 lvl across the build, you make sure that both Tumble and UMD are up to date. They both work in multiples of 5, but Tumble uses BASE RANKS and UMD uses MODIFIED RANKS. So with negative CHA, you need to take UMD dumps one level later than level +3 (level +3 -1) to ensure maximum effectiveness. The build I used as example doesn't have UMD, that's why I didn't mention this extensively.<br/>\n<br/>\nAfter that it's a game of priorities. You need to figure out what you want and then list that in order of preference: Weapon Specialization, Epic Weapon Specialization, Crippling Strike, etc. I wont build for you, but I will give you a good leveling sequence so you can figure out the rest on your own.<br/>\n<br/>\n1- Rogue<br/>\n2- Fighter<br/>\n3- Fighter<br/>\n4- Fighter<br/>\n5- Fighter<br/>\n6- Fighter<br/>\n7- Rogue (if for anything you should normally take it at lvl 8 for the UMD dump, but here is an exception because you want HiPS as soon as humanly possible)<br/>\n8- SD<br/>\n9- SD<br/>\n10- SD<br/>\n11- SD<br/>\n12- Fighter<br/>\n13- Rogue<br/>\n14- Fighter<br/>\n15- Fighter<br/>\n16- Rogue<br/>\n17- Rogue<br/>\n18- Rogue<br/>\n19- Rogue<br/>\n20- Rogue<br/>\n<br/>\nAfter lvl 20 you play the priority game. This spread is to maximize BAB, get HiPS ASAP, then raise AB and then raise Sneak damage.<br/>\n<br/>\nAFter 20 you can get SD for Defensive roll if you fancy it, or go straight to Rogue 10 for Crippling Strike, which I think is AWESOME. Fighter can be used to help with epic combat feats (Fighter 10 for Epic Weapon Focus and 12 for Epic Weapon Specialization), this way tou can take more Great Dexterities with your regular feats and have higher AB and AC.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:17 AM - Sep 10, 2011",
      "content": "<div>Hip's alternative is more feat-starved and has lower AB, but gets more sneak damage and two more Rogue Bonus feats. Mine, Fighter 12 Rogue 13 SD 5 does 3d6 less damage, but has +1 BAB, 3 more Fighter Bonus Feats and probably a higher DEX modifier. Either is fine, really, up to you to choose, mate.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "3:25 AM - Sep 12, 2011",
      "content": "<div>Great, thanks to both you guys for your help on this. It does seem to make more sense the more I read about building and look at the other builds to see what feats people take before others and why. You guys are awesome! I hope one day I can post a build. Just seems like you guys have covered about everything you can think of to build. lol.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:53 AM - Sep 12, 2011",
      "content": "<div>Glad you're beginning to see the LEGO blocks that make a build what it is. And yes, mostly everything has been covered, but not by us, Anuis started this guild WAY BACK and there were many many people involved back then. I am one of the later elders, having joined in 2006. It used to be much more dynamic when all those people were still playing NWN. You'd post a comment and then a couple of days later there would be 5 replies. Alas, it's an old game and most have moved on. But the few of us that are still here will continue to play and build for this awesome game.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "5:48 AM - Sep 14, 2011",
      "content": "<div>Ok quick question on the weapons. Rapiers bad cause of the -4 being med. size weapons. Short swords are ok cause they are small at -2ab? What about the Kukris? They are tiny so is there any -ab for them? I do see they have a higher crit range but I would need to spend a feat to be able to use them. is this worth it or do i just go with short swords? Thank you for your time.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:21 PM - Sep 14, 2011",
      "content": "<div><blockquote><div><strong>campgod wrote:</strong>Ok quick question on the weapons. Rapiers bad cause of the -4 being med. size weapons. Short swords are ok cause they are small at -2ab? What about the Kukris? They are tiny so is there any -ab for them? I do see they have a higher crit range but I would need to spend a feat to be able to use them. is this worth it or do i just go with short swords? Thank you for your time.</div></blockquote>\nThere a few factors to consider.<br/>\n<br/>\nOne is race.  A halfling build requires a tiny weapon off-hand to avoid the additional penalties as tiny are the only weapons which qualify as <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Light_weapon\" rel=\"noreferrer\" target=\"_blank\">light weapons</a>. A medium race, like human, can achieve the same off-hand penalty status with small weapons, like shortswords, which are their version of light weapons.  So... it is the relationship of the race size to the definition of a light weapon that determines the applicable DW penalty and the resultant AB.<br/>\n<br/>\nAnother is finessing.  Besides the weapon size, a DEX build relies on Weapon Finesse for AB so weapons must then qualify on the list of <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Weapon_finesse\" rel=\"noreferrer\" target=\"_blank\">finesse-able weapons</a>  A sneak build doesn't HAVE to be a DEX finesse build to be effective but the stealth skills and AC will be markedly superior over a strength-based build.<br/>\n<br/>\nThird is the damage type.  Kukris do slashing damage like a scimi or handaxe.  Therefore, in a build that provides a means to use Keen Edge, like arcanists or UMD-users, one can gain a significant boost to the crit range.  Piercing weapons like shortswords and their ilk cannot be enhanced with Keen Edge, although magical versions may have the \"keen\" property applied.  IIRC Keen Edge stacks with the keen property but i haven't done this in a while so my memory may be fading.  I do know that WMs can achieve a 10-20 crit range with kukris with access to all the crit-altering methods mentioned.<br/>\n<br/>\nFinally, when dual-wielding, it is typically only practical to develop weapon focus  and Imp Crit on a single weapon type.  Fighters are one exception to this rule since they have sufficient feats to multifocus.  Because of this, the off-hand weapon should generally be the same as the main hand to maximize AB on both hands equally during combat.<br/>\n<br/>\nA sneaker relies on sneaks and therefore also relies on crits to do the damage.  For MOST foes, those that are sneak immune are also crit immune, so the issue is the same... how will you damage the immune creatures?  In this case, the damage type is essentially irrelevant, though bludgeoning often breaks through the resistances of creatures that are most often sneak/crit immunes.  But bludgeoning weapons have poor crit range and cannot be altered via Keen Edge.<br/>\n<br/>\nIf the environment you are playing does NOT provide Keen Edge scrolls for a UMD-user, any piercing weapon is just as effective as a slashing one.  In that case, a halfling could save the exotic feat by DWing daggers and achieve almost the same results.  A human (or any medium race) DEXer could use shortswords in the same way.<br/>\n<br/>\nNow, with all that stated, some players just like the \"look\" of a particular weapon.  For instance, a few like to DW katanas like a samurai swordsman and just eat the penalty for the sake of kewlness.  They have a horrible AB, but apparently they just don't care as long as the visual appearance is to their liking.  (Some servers have customized katanas to be finesse-able.)  <br/>\n<br/>\nBottom line: The final decision about weapon preference is yours.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:06 PM - Sep 14, 2011",
      "content": "<div><blockquote><div>IIRC Keen Edge stacks with the keen property but i haven't done this in a while so my memory may be fading. I do know that WMs can achieve a 10-20 crit range with kukris with access to all the crit-altering methods mentioned.\n</div></blockquote>\n\nIt doesn't. You're confusing Ki Critical and Improved Critical stacking with Keen Edge.<br/>\n<br/>\n10-20 threat range is attaiable as follows:<br/>\n<br/>\n18-20 Threat Range + Improved Critcal (doubles threat range) makes it 15-20 (15, 16, 17 / 18, 19, 20), + Keen property doubles the ORIGINAL RANGE again (3 NUMBERS) (either Keen Edge spell or item property, never both) makes it 12-20 (12, 13, 14 / 15, 16, 17 / 18, 19, 20), and finally Ki Critical (+2 to Threat Range) makes it 10-20.<br/>\n<br/>\nA non-keen weapon master will have 13-20 threat range, by a similar logic only removing 3 numbers (the Keen Edge effect)<br/>\n<br/>\n@ Campgod<br/>\n<br/>\n-2 is as low as it gets. There is NO WAY to reduce it beyond that (except not dual-wielding )<br/>\n<br/>\nHip raised an important point that I would've overlooked, thanks Hip. A Halfling can't dual shortswords as they would be the equivalent to a human dual-wielding Rapiers (-4 penalty). Well, there's nothing that says you can't really, just like Hip says, you can just eat the penalty, but you won't find anyone in this guild that encourages that. Here we powerbuild and optimize and -4 penalty on all attacks is hardly so, period <br/>\n<br/>\nSince we are at it, I thought I'd mention I prefer Epic Dodge to HiPS. Personal thing, though.<br/>\n<br/>\nTake it EZ!</div>"
    }
  ]
}