{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "493",
  "name": "Spellsword Request",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/spellsword-request-t515483.html",
  "author": "Xaglacion",
  "avatar": "no_avatar.png",
  "replies": "78",
  "views": "5.4K",
  "posts": [
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "11:44 PM - Sep 16, 2011",
      "content": "<div>Hey guys,<br/>\n<br/>\nI've always been ultra bad at making builds. <br/>\nAnd for a server I'm playing on, I want to play a Spellsword-Marauder kind of character,<br/>\nusing a straight sword(LongSword, BastardSword, GreatSword, etc), without a shield (because it really doesn't fit my character). Max Level is 30 on the server. I want to be focused on melee combat, and have a few spells that can buff and some that can do some damage in case I gotta fight from afar.<br/>\nI want my character to be good both in PVE and PVP.<br/>\n<br/>\nThanks in advance guys!<br/>\n<br/>\n-Xag</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "12:23 AM - Sep 17, 2011",
      "content": "<div>What kind of spells (cuz there's an obvious \"spellsword\" type, then the harder spellsword type)?<br/>\n<br/>\nYou dont want a shield, that means that, with a Tower shield (since nwn has no penalty for it) that is +3 AC and typically find +5 towers (but not necessarily), that is +8 Shield AC.  That means that your AC will ALWAYS suffer compared to a similar character WITH a tower.  That means you need some EXCELLENT offence to make up for that, and every arcane caster level makes it worse, meaning that you now need to rely on spells to get by (arcane doesnt have stellar melee spells vs divine, imo).  <br/>\n<br/>\nWith only 30 lvls, you also should consider a Tumble class to get up to +6 dodge AC.  You only need a few levels (skill dumps), so not a make or break, but it is needed if you arent using a shield.<br/>\n<br/>\nIf you are using those weapons, you must go strength, as they arent finesseable (use Dex for modifier instead).  That means even lower AC (vs a dexer) because you arent using a shield (and have no Dex bonus).  WIth a non-dexer, you MUST use full plate to make up for AC deficiency.  <br/>\n<br/>\nAll of that, AND, do you want to have trap skill to help with pvm?  <br/>\n<br/>\nThese are questions that always come to me when I think of a build idea.  We could go out and build one for you, but some of us want to move on, so we need to teach the younglings to learn to do it YOURSELF!  It only takes practice, and this topic will be of great help IF you join in.  If you just want a build, you will not be happy, i guarantee it!  <br/>\n<br/>\nLet us know.</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "1:01 AM - Sep 17, 2011",
      "content": "<div>Alright so... Spells? I have no idea what you mean by \"obvious\" and \"harder\" spellsword types <br/>\nA dex-based character would actually be awesome too, using Short Swords, or maybe rapiers...but not daggers &gt;.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:11 AM - Sep 17, 2011",
      "content": "<div>Plus you'll still need to know how to use it, which is the hardest part.<br/>\n<br/>\nAlso when you mean arcane spellsword do you mean Sorc/Wiz only or is Bard up for the grabs as well? Cuz with Bard you can go with a DevCritting Bard 16 Fighter 4 RDD 10 for a high DC, good song, lvl 6 Bard spells and stuff. <br/>\n<br/>\nThe problem I see with non divine non bard spellswords for lvl 30 environments is that you need many caster levels to have access to the best spells (Time Stop, IGMS, Mord's, Bigby hands and all that). But you only have 10 post-epic levels to take them (9 if you consider taking a class at the end for skill dumps), which means you WILL end up hurting your BAB by taking lots of caster levels pre-epic. Each 2 levels you take before 20 you LOSE 1 BAB compared to a full meleer class. Like, at level 40 cap you could make a spellsword Wizard/Sorcerer 20+ build and take only 4 Wizard/Sorcerer levels pre-epic, hence losing 2, maybe 3 BAB if you need to take another class for skill dumps, but for level 30 you need AT THE VERY LEAST 7 Wizard/Sorcerer levels before 20, losing 4 BAB AT LEAST, more if you need to make the same skill dumps. You have no direct AB buffs except for True Strike, which lasts 9 seconds. Do you see the problem there?<br/>\n<br/>\nI'll let you answer before I go any further. <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:16 AM - Sep 17, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>Alright so... Spells? I have no idea what you mean by \"obvious\" and \"harder\" spellsword types <br/>\nA dex-based character would actually be awesome too, using Short Swords, or maybe rapiers...but not daggers &gt;.</div></blockquote></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:03 AM - Sep 17, 2011",
      "content": "<div>Let's try to summarize the request, shall we?<br/>\n<br/>\nLevel 30 cap<br/>\nNo apparent leveling restrictions like minimum number of levels in each multiclass<br/>\nEither a two-handed weapon or dual-wield (i.e. NO shield)<br/>\nHeavy melee presence with a few support spells both defensive &amp; offensive<br/>\nRoguish skills not really preferred<br/>\nEither strength- or dexterity-based (doesn't matter)<br/>\nDevCrit OK?<br/>\nAny taboo classes like RDD?<br/>\nAny Race preference?<br/>\nLow-, mid- or high-magic server?  It matters.<br/>\nPvP <strong>OR</strong> PvM?<br/>\n(PvP builds are best dedicated to a specific type of foe.  If you can specify the type of build (melee, range, crit immune, high-level caster, smiter, DevCritter, etc.) that would be most problematic we MAY be able to come up with a build and strategy that addresses that need. No PvP build will dominate every build type (yes, avado, that includes cleric!  ). So choose PvM or state clearly which kind of build you would like to dominate while dueling. Any build that claims to be useful for both ALWAYS is significantly better for one of the applications.)<br/>\n<br/>\nNow... as Max already noted, you'll need to decide what kind of caster class, divine or arcane, because 30 levels is simply not enough for an arcanist to do anything much more than wear robes or fail casts.  Even with all the wizard bonus feats, you're sure to run short.  So if you don't mind depending on EMA, Epic Warding &amp; damage shields (and a \"certain\" amount of Dex) to protect you, a 30-level arcanist spellsword will work.  Otherwise, you will be a battle cleric wearing heavy armor and swinging any weapon you prefer.<br/>\n<br/>\nSo, let's try to focus in on YOUR ideas within the server limitations and please... try not to waffle in your preferences because you will be very disappointed with the whole process and the guild will keep spinning their wheels trying to satisfy the latest request revision.<br/>\n<br/>\nA well-considered request results in the best possible build recommendations.<br/>\n<br/>\nBTW, Welcome aboard!  We hope you learn a bit about building effective characters and have fun doing it!</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "2:30 AM - Sep 17, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>Alright so... Spells? I have no idea what you mean by \"obvious\" and \"harder\" spellsword types \n</div></blockquote>\nThe obvious is using cleric.  Why?  because cleric has access to melee spells (div fav, div power, battletide, etc). It also has excellent support spells for melee (SoV, Firestorm, blade barrier, harm, implode).  The harder spellsword uses wiz/sorc because as far as I recall, they dont have melee spells in abundance.  They have TONS of offensive magic, but now you have to decide if you want to cast or cut!  With 30 lvls, you now need 3 of your epic feats to Auto still spells and you need to cast lv 9 spells to get these (unattainable by bard because you cant cast lv 9 spells    ).  So, to make that sort of investment, you ab at 20 will be below 15, which hurts your offensive ability with a sword. Now, not taking a shield is utter craziness because you will be gimping your build ALOT!  I am certain you can do the arcane MANY different ways, I am just giving the extreme of a caster melee type example.<br/>\n<br/>\nI think I wrote a brief outline to what to look for in building a character somewhere on this new forum.  It may be in my introduction... i dont recall at the moment.   Building isnt rocket science.  It does take some time to get used to.  And remember, even the best of us STILL use the guides/wiki when we are looking at a class we havent used before (which means in the beginning, you use it for all 3 classes.  Soon, you are looking up just one or two classes because you know the others.)<br/>\n<br/>\nI know clerics dont pvp well.  I have seen how pvpers build pvp characters and they are crazy works of art (you build them totally different than pvm).  I always like pvm so I never worried about that sort of build.</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "2:52 AM - Sep 17, 2011",
      "content": "<div>Alright so...<br/>\n<br/>\n<strong><span style=\"color:#FF0000\">@Maximillian:</span></strong> I mean that I want more buffs than ranged attacks, since I'll be rushing into the fight. Bard works too, as long as I have enough buffs lol. And, I want to play a Divine type Spellsword. Like Cleric, or maybe Paladin, whichever works best. Thanks for the building tips btw!<br/>\n<br/>\n<strong><span style=\"color:#FF0000\">@HipMaestro:</span></strong> <br/>\n<strong>Level 30 cap:</strong> Yes<br/>\n<strong>No apparent leveling restrictions like minimum number of levels in each multiclass:</strong> Nope, and I can take any class even if I don't have the requirements<br/>\n<strong>Either a two-handed weapon or dual-wield:</strong> Yeah<br/>\n<strong>Heavy melee presence with a few support spells both defensive &amp; offensive:</strong> Exactly what I want<br/>\n<strong>Either strength- or dexterity-based</strong> I would prefer Strength Based, but Dexterity works too.<br/>\n<strong>DevCrit OK?:</strong> Yeah, if it's really worth it.<br/>\n<strong>Any taboo classes like RDD?</strong> All classes are Permitted<br/>\n<strong>Any Race preference?:</strong> Human or Elf<br/>\n<strong>Low-, mid- or high-magic server? It matters:</strong> I don't know what you mean by that, but it's the default way spells work on NWN. You can rest every few hours.<br/>\n<strong>PvP OR PvM?:</strong> PvM mostly <br/>\n<br/>\n<strong><span style=\"color:#FF0000\">@Avado:</span></strong>I want to cut!!! Cleric I think is the way to go from what I've read, since they have good support abilities. I don't mind if I need a FullPlate, that's totally fine by me. And I want to use a greatsword, or dual-wield.<br/>\n<br/>\nIf I missed anything, please tell me.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:04 AM - Sep 17, 2011",
      "content": "<div>Cleric Bard RDD then, 16/4/10 for more skill dumps and playability (and also to save up stat points with only 18 WIS needed) or 18/2/10 with less skill dumps, but gets lvl 9 spells (which also means a little lower STR score cuz u'll need at least 19 WIS). I'll leave the build itself to avado or Hip, they may do the dirty work, as I don't enjoy building for lvl 30, it just feels incomplete, kind of like sculpting a statue with no head .<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "3:11 AM - Sep 17, 2011",
      "content": "<div>Yeah, I understand what you mean, <br/>\nyou don't have the same liberty as building a level 40 character.<br/>\nAny suggestions on which domains I should take as Cleric?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:58 PM - Sep 17, 2011",
      "content": "<div>I would go with Trickery and Travel if there is no permanent haste available, if there is you can consider Strength also instead of Travel, for more levels of Divine Power. Or War also in the place of Travel as a last resort, not for Cat's Grace, but for Aura of Vitality, if your server items don't allow you to cap stats (which cap at +12 each, +6 modifier). AoV gives +4 to Strength, Constitution and Dexterity for 1 Round per level and can be extended as a lvl 8 spell. Depends mostly on the items where you play.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:01 PM - Sep 17, 2011",
      "content": "<div>Building a sorcerer or wizard based arcane spellsword is one of the more challenging tasks you can undertake as a NWN builder. You have to make a lot of compromises, and 30 levels give little room for developing both the \"spell\" and the \"sword\" part of such a build. A Melee-mage type, basicly a near-pure wizard, buffing up and meleeing mobs, and saving attack spells for the bosses is probably the wisest choice given these circumstances.<br/>\nI agree with avado that cleric seems to be the best option given your preferences. Cleric will give you much freedom to choose between different multi class options. As a minimum I would add a class with tumble as class skill for minor multiclassing. Bard or monk will also have discipline as class skill. Bard even has UMD.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:48 PM - Sep 17, 2011",
      "content": "<div>How about a road less traveled?<br/>\n<br/>\nHere's one that implements WhiZard's Expeditious Retreat/Mass Haste monk speed exploit:<br/>\n<br/>\nMonk(6), Wizard(16), Champion of Torm(8), Human, Lawful neutral (vs. smiters)<br/>\n<br/>\nSTR: 10<br/>\nDEX: 16 (24)<br/>\nCON: 12<br/>\nWIS: 12<br/>\nINT: 16 (18)<br/>\nCHA: 8<br/>\n<br/>\nHP: 252  (342 w/Emp Endurance)<br/>\nSaves (F/W/R): 22/22/28 (29/29/37 vs. spells); add at least +5 saves w/buffs<br/>\nOther save bonuses: Mind Effects: +2<br/>\nBAB: 20<br/>\nAB (max, naked): 31 (melee), 28 (ranged)<br/>\nAC (naked/mundane armor/shield only): 27/29<br/>\n<br/>\nSKILLS: 218<br/>\nConcentration 33(34), Discipline 33(33), Hide 29(36), Listen 33(34), Move Silently 29(36), Spellcraft 31(35), <br/>\nTumble 30(37)<br/>\n<br/>\nAB for DW is boosted to +37 (+57 w/TS) and 9 APR w/flurry in effect <br/>\n(gotta love that monk progression +55/+52/+49/+46/+43/+57/+52/+55/+50 when using flurried TS).  One-hand mundane kama +39 (+59).  Also, kamas can be Keen Edged so will crit on 18-20.  Limiting weapon to kamas is the only real CON IMO. UMD? Meh.  Most robes/boots are available, but no cleric scrolls.<br/>\n<br/>\nDecent combat feats like Cleave &amp; IKD.  Imp Expertise to get AC up to 55 for casting in robes, if you like.  Otherwise, buffed to 45 AC is serviceable.  For more TS slots, I'd take Silent Spell instead of Imp Expertise, however.<br/>\n<br/>\nTo use the exploit, you'll need to forgo the Illusion school for extra slots but it's worth it. *lol*  Can close so fast it is almost too hard to control.  With 10 more levels I'd be tempted to try a DevCrit version.  You should really try this one out in a trainer.  It's just plumb crazy speed for a level 30 build.   (Just make sure to unequip any perma-haste items until after spells are cast.)<br/>\n<br/>\nHaven't tried Tensor's using the exploit, but that is one reason I asked about the server magic level... Tensor's is only a +3 enhancement, best for low-mid magic.<br/>\n<br/>\nFactor in damage shields and excellent saves and it is worth a shot.  No Level 9 spells unless you rearrange start abilities to get INT to 17 and drop 2 CoT levels for Wiz 18.  Still not bad, but I like this version better with more melee prowess.<br/>\n<br/>\nJust make sure you tie this guy's laces because this one can move!</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "4:28 PM - Sep 17, 2011",
      "content": "<div>@HipMaestro<br/>\n<br/>\nI could use your build... <br/>\nBut it really doesn't fit the Spellsword style that I want to play. :\\</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "4:33 PM - Sep 17, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>Yeah, I understand what you mean, <br/>\nyou don't have the same liberty as building a level 40 character.<br/>\nAny suggestions on which domains I should take as Cleric?</div></blockquote>\nTrickery for certain.  improved invisibility is a must.<br/>\nThe other is up to you.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:37 PM - Sep 17, 2011",
      "content": "<div>@ Xaglacion<br/>\n<br/>\nwell, then you need to tell us what you want more precisely. I was under the impression that was exactly what you wanted. A high or high-ish AB build, with melee prowess and devcrit for grabs while spellcasting for support. It's not arcane, I know, but Arcane as I said is hard to do with a lvl 30 cap.<br/>\n<br/>\n@ Hip<br/>\n<br/>\nHip, make it CoT 6 Wiz 18 and drop STR and whatever else you can to grab lvl 9 spells. Time Stop is much too good to be one lvl away and not take it.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "4:46 PM - Sep 17, 2011",
      "content": "<div>I failed. I meant @HipMaestro for the build. lol<br/>\nBut yeah... Is there a way I can mix Cleric (for offensive and defensive buffs) with another class to be able to dish out a lot of Damage (PvM focused) and still survive against bosses?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:20 PM - Sep 17, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\n@ Hip<br/>\nHip, make it CoT 6 Wiz 18 and drop STR and whatever else you can to grab lvl 9 spells. Time Stop is much too good to be one lvl away and not take it.\n</div></blockquote>\nDepends what scrolls the server has available.  Timestop works just as good via scroll just like Mords does.  Besides you'd need scrolls anyway to continue spamming them.  One or 2 slotted Timestops are not catastrophic to a foe by any means.  But I agree generally.  Without adequate merchant support, I'd eat the lost AB (IIRC about -3 AB for the Wiz 18 version) to extend the spell repertoire &amp; durations a bit more.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:22 PM - Sep 17, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>@Hip<br/>\n<br/>\nI could use your build... <br/>\nBut it really doesn't fit the Spellsword style that I want to play. :\\</div></blockquote>\nIt doesn't?  Why would that be?</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "6:30 PM - Sep 17, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>Xaglacion wrote:</strong>@Hip<br/>\n<br/>\nI could use your build... <br/>\nBut it really doesn't fit the Spellsword style that I want to play. :\\</div></blockquote>\nIt doesn't?  Why would that be?</div></blockquote>\n\nWouldn't fit my character's concept. <br/>\nI want him to be some kind of warrior that jumps into battle with the badass sword,<br/>\nusing spells to support his allies and buff his melee combat abilities, and on top of that, <br/>\ncan still take a beating. A quick stealthy guy with kamas doesn't really suits me.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:40 PM - Sep 17, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>Xaglacion wrote:</strong>@Hip<br/>\n<br/>\nI could use your build... <br/>\nBut it really doesn't fit the Spellsword style that I want to play. :\\</div></blockquote>\nIt doesn't?  Why would that be?</div></blockquote>\n\nWouldn't fit my character's concept. <br/>\nI want him to be some kind of warrior that jumps into battle with the badass sword,<br/>\nusing spells to support his allies and buff his melee combat abilities, and on top of that, <br/>\ncan still take a beating. A quick stealthy guy with kamas doesn't really suits me.</div></blockquote>\n\nLOL brother. I never suggested you USE MY BUILD! I suggested you READ MY GUIDE, since you said you were interested in learning how to build. Read my guide and have fun making a Cleric 16 Bard 4 RDD 10 that suits you!<br/>\n<br/>\nAgain, lol! It takes a LOT OF WORK and patience to become a good builder, but my guide is an excellent place to start. Then to top it all off you could read my guide on clerics, as well as avado's on the General Discussion forums, those will help with the class specifics A LOT!<br/>\n<br/>\nLik I said, the ball is in your court, I have even given you a good spread to begin with, now go build something! <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "2:08 AM - Sep 18, 2011",
      "content": "<div>I was talking about HipMaestro's build lol... But fine if you don't want to help me. I am difficult. <br/>\nThanks for the tips.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:15 AM - Sep 18, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>I was talking about HipMaestro's build lol... But fine if you don't want to help me. I am difficult. <br/>\nThanks for the tips.</div></blockquote>\n\nHere in Brazil we have a saying that goes: If you truly wanna help a man, don't give him a fish because he'll eat today and be hungry again tomorrow, give him a fishing pole and teach him how to fish and he can be fed for life. That is exactly what I did, sorry that you think I'm not helping you.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "2:49 PM - Sep 18, 2011",
      "content": "<div>Let's stop the misunderstandings folks, my head is spinning already</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "4:59 PM - Sep 18, 2011",
      "content": "<div>Yeah lol <br/>\n<br/>\nSo, from what I've read, Cleric is the way to go, what about the multi-classing part? What melee class works best with Cleric to create<br/>\na support type of Spellsword? RDD with Dev Crits? <br/>\nAnd would it work with Human as race?</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "10:16 PM - Sep 18, 2011",
      "content": "<div>Well, yes and no.  You have only 30 lvls to work with.  RDD needs 10 and bard takes 1, possibly 2 for skill dump.  That leaves 18 for cleric.  Now you could do it that way.<br/>\n<br/>\nYou could also do only 4 rdd for +4 str, that would be 24cleric/bard2/rdd4.  <br/>\n<br/>\nFor 30 lvls, I personally, would go Half orc, if you are targeting dev crit.  With half orc you start with 20 str and by 20 you have 25.  You could have dev crit by 24.  Any other class, and you are now pushing lv 30 for dev crit.  <br/>\n<br/>\nJust my 2 cents</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:22 AM - Sep 19, 2011",
      "content": "<div>@the OP<br/>\nPer the description of your \"style\", you have re-defined a spellsword to become a two-hand wielder.  From my own experience, a spellsword is a sword 'n board character but you have a perfect right to make it however you like, as non-conventional as it is.  IMO the terms \"spellsword\", \"melee mage\" and \"battle cleric\" can easily become blurred based on an individual's interpretation.  A DEX build would seem to imply dodgy, stealthy, high AC PC, an option you left open.  The fact that the build I suggested can exploit the move speed is secondary to its innate value... a fast-attacking, multifaceted arcanist with substantial melee prowess that can take punishment, i.e. a DWing \"spellsword\" without a shield.  Some sort of DWing Monk/WM would be ideal but not within the Level 30 cap constraints unfortunately. <br/>\n<br/>\nIf a \"badass sword\" was a prereq, you should have stated that in your original request.  Designing a custom build is a learning experience for both the requester and the builder alike, each seeking to understand and communicate intent.  As has been already stated in several different ways, the concept can only be adequately defined by the requester.<br/>\n<br/>\nBTW, should you post an error in any reply in the future, the \"Edit\" option can easily correct the faux pas. <br/>\n<br/>\n@avado<br/>\nThat Clc24/Brd2/RDD4 Devcritter looks good to me!   Love those indispellable buffs!</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "8:28 AM - Sep 19, 2011",
      "content": "<div>hmm..  a cleric dexer, dual welding kukris!  Double darkfire..  DP and DF bonii plus battletide...  SOV, firestorm, undead goodies!!<br/>\n<br/>\num, NO, not in lv 30 environment. and not for this poster!  Just throwing it out there for the ambitious to try!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:57 PM - Sep 19, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong>hmm..  a cleric dexer, dual welding kukris!  Double darkfire..  DP and DF bonii plus battletide...  SOV, firestorm, undead goodies!!<br/>\n<br/>\num, NO, not in lv 30 environment. and not for this poster!  Just throwing it out there for the ambitious to try!</div></blockquote>\n\nI'd rather go for Kamas if that's the case, 10 APR is better than 6 even with the extra threat range, and Darkfire damage doesn't multiply on criticals, as it's dealt before the actual attack, athough the rest does. For lvl 40 I already have such a build:<br/>\n<br/>\nCleric 26 Monk 6 CoT 8 DW Kamas, Wisdom AC, IKD, +4 to all saves. <br/>\n<br/>\nFor lvl 30, however, I don't think it would translate well, as it takes 4 Great Wisdoms with the CoT bonus feats. Oh well...</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "5:37 PM - Sep 19, 2011",
      "content": "<div>Aye, kama would work better given the extra attacks and the better attack progression. Thinking of a dexer I'm always compelled to try to get ED; Cleric 17-19/Monk 1-3/SD 10 or some-such?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:41 PM - Sep 19, 2011",
      "content": "<div>For ED perhaps Cleric 16 Monk 9 SD 5. It's fun and also runs like hell with the monk speed gain. With perma-haste, it's The Flash! Or you could try a slow-walking xp-penalty Cleric 16 Monk 1 Rogue 13 and get UMD and Sneak Attack. No lvl 9 spells, I know, I wish I could fit them in either spread, but I would rather have the extra speed in the first alternative or umd and sneaks in the second than a bunch of low-dc level 9 spells. If building for 40, both would get lvl 9 spells and 26 caster levels, but I figured since you have to compromise, and to be able to attain ED you will need to become dispellable anyway, drop Cleric one or 2 more levels and move on <br/>\n<br/>\n19 Cleric -1 Monk -10 SD also works, but IMO that's a lot of levels wasted on simply requirements for ED. 9 levels just to meet the requirements. I know both my suggested alternatives \"waste\" more than 9 levels, but they gain more benefits than simply IE and DR, which IMO makes them worth the investment.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "10:40 PM - Sep 19, 2011",
      "content": "<div><blockquote><div><strong>KailPendragon wrote:</strong>Aye, kama would work better given the extra attacks and the better attack progression. Thinking of a dexer I'm always compelled to try to get ED; Cleric 17-19/Monk 1-3/SD 10 or some-such?</div></blockquote>\nIs there any other reason to go dexer?  I mean, I have done a dex cleric without ED before and well, it sucked.  ED is the DEXER feat, sort of like Dev Crit is THE strength feat.  Its a little like taking cleric without extend.. oh wait, I have done that!  Wait a minute!  There are no rules!  Just, it makes a lot more sense to do it with ED...</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "10:47 PM - Sep 19, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong><blockquote><div><strong>KailPendragon wrote:</strong>Aye, kama would work better given the extra attacks and the better attack progression. Thinking of a dexer I'm always compelled to try to get ED; Cleric 17-19/Monk 1-3/SD 10 or some-such?</div></blockquote>\nIs there any other reason to go dexer?  I mean, I have done a dex cleric without ED before and well, it sucked.  ED is the DEXER feat, sort of like Dev Crit is THE strength feat.  Its a little like taking cleric without extend.. oh wait, I have done that!  Wait a minute!  There are no rules!  Just, it makes a lot more sense to do it with ED...</div></blockquote>\nThere are some good dexer builds without ED (I can think of a dexer spellsword and a dexer assassin kama user for example), but surely ED is the signature feat for dexers.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:36 AM - Sep 20, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong><blockquote><div><strong>KailPendragon wrote:</strong>Aye, kama would work better given the extra attacks and the better attack progression. Thinking of a dexer I'm always compelled to try to get ED; Cleric 17-19/Monk 1-3/SD 10 or some-such?</div></blockquote>\nIs there any other reason to go dexer?  I mean, I have done a dex cleric without ED before and well, it sucked.  ED is the DEXER feat, sort of like Dev Crit is THE strength feat.  Its a little like taking cleric without extend.. oh wait, I have done that!  Wait a minute!  There are no rules!  Just, it makes a lot more sense to do it with ED...</div></blockquote>\n\nYeah, there are other reasons to go dexer. One of them in a Cleric Monk combo can be Monk Wisdom AC, which only works on robes, or a Ranger going Dexer for the dual-wield feats without giving up too much AC. Self Concealment for rogues or assassins comes to mind as well as just simply higher AC at the cost of damage. But yeah, ED is THE feat. It's even more so because of this last statement. Typically, dexers are harder to hit already due to higher ACs, so dodging the first attack THAT HITS in a build that doesn't get hit as often is just great, in a Cleric Monk combo, factoring in the Wisdom AC, WOW! My Shadow Priest has 32 Capped wisdom, hence 11 bonus AC. A Tower Shield would have to be +8 to be able to match that. 50% Concealment from Trickery domain, and WoG even has a bracelet that gives you +4 Shield modifier AC and +2 DEX. WOW!! Can't wait to get him to that point!!<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "11:48 PM - Sep 22, 2011",
      "content": "<div>I tried to build a character using the 24Cleric/2Bard/4RDD and I pretty much failed. lol</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:43 AM - Sep 23, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>I tried to build a character using the 24Cleric/2Bard/4RDD and I pretty much failed. lol</div></blockquote>\n\nTry 16 4 10 then, ease up on the cleric part a bit for better mojo, to me that's the best spread for lvl 30, avado as usual will disagree.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "3:18 PM - Sep 23, 2011",
      "content": "<div>What do you think the starting ability scores should be?<br/>\nBalanced or I pretty much put everything in Strength and Wisdom?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:07 PM - Sep 23, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>What do you think the starting ability scores should be?<br/>\nBalanced or I pretty much put everything in Strength and Wisdom?</div></blockquote>\n\nJust enough FINAL Wisdom to cast lvl 8 spells (18 Wisdom) and the rest in Strength. Look at Mith's Blood &amp; Faith for reference, as it's a CLASSIC build.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=7&amp;t=173\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.44.forumer.com/viewt ... ?f=7&amp;t=173</a><br/>\n<br/>\nThat one should be enough to solve pretty much all your problems, you will have to alter the pre-epic spread to Cleric 15 Bard 1 RDD 4 and end up with -1 BAB in comparison to his build, because of the lvl 30 cap. Not much you can do there. Use Mith's build as reference, and you shouldn't have any problems. Mith gets 20 Wisdom because he has 26 Cleric levels, you only have 16 so you need only 18 Wisdom.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "11:39 PM - Sep 23, 2011",
      "content": "<div>Alright, and finally, the domains. Which domains do you suggest for offensive and defensive buffs?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:50 AM - Sep 24, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>Alright, and finally, the domains. Which domains do you suggest for offensive and defensive buffs?</div></blockquote>\n\nThat's evironment dependant. Let me give you a shortlist of useful ones:<br/>\n<br/>\n- Trickery: 50% concealment from Improved Invisibility, Divine Trickery for a few skills, even if you have to cross-class Open Lock and Disable Traps, get at least 1 point in each.<br/>\n- Strength: Gives you 2 levels of Divine Power adn Stoneskin, plus a useless combat feat.<br/>\n- Plant: Gives Barkskin, which will leave your amulet stot for you to equip a periapt of Wisdom. If your world has many non-amulet items with Wisdom enhancement or if the magic cap is HUGE and you know you'll have to use an amulet of Natural Armor +9, for example, then forget about Plant.<br/>\n- Travel: Gives you Haste as a spell, which is nice for non-permanent haste servers. If your server doesn't have them, it's very useful:<br/>\n- Animal: 1 lvl higher summons, True Seeing at lvl 3, Cat's Grace at 2.<br/>\n- Magic: Mage Armor, Stoneskin and Ice Storm.<br/>\n- Healing: Heal as a lvl 5 spell, all lower healing spells auto-empowered.<br/>\n<br/>\nPick two, trickery and one more.</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "1:03 AM - Sep 24, 2011",
      "content": "<div>The serve I play on has almost no magic lol. Most monsters are Melee.<br/>\n<br/>\nAlright so, I think I'll go for Trickery and Magic. Stoneskin will be pretty useful against close combat enemies</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:06 AM - Sep 24, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>The serve I play on has almost no magic lol. Most monsters are Melee.<br/>\n<br/>\nAlright so, I think I'll go for Trickery and Magic. Stoneskin will be pretty useful against close combat enemies</div></blockquote>\n\nAlmost no magic? So it doesn't have Permanent haste? Then go Travel. If it does have permanent haste but no good natural AC enhancements, go for Plant, if not, then go for Strength for two levels of Divine Power AND stoneskin. Magic to a beast like this IMO isn't the best choice in a low magic server. The only reason I put the alternatives up was because i didn't know the kind of server you were talking about.</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "1:08 AM - Sep 24, 2011",
      "content": "<div>Would Travel and Strength be a good combo?<br/>\nOr one of them with Trickery. <br/>\nI don't know which is more useful, 50% Concealement, with Haste or Divine Power and Stoneskin.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "1:33 AM - Sep 24, 2011",
      "content": "<div>Trickery and Travel are great choices in a low magic environment.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:43 AM - Sep 24, 2011",
      "content": "<div>I agree with Kail on the choices.  <br/>\n<br/>\nIn low-magic, for me at least, Travel &amp; Trickery are automatic, unless the server has redefined domains significantly.  Stoneskin's effect is temporary.  At best, it will absorb 100 points of damage, then collapse.  The concealment of Imp Invis will last as long as the spell duration does.  IMHO, Haste is probably the single best all-purpose spell/property in the game, giving an extra cast or full AB attack per round and +4 stackable AC, not to mention the speed boost.</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "2:56 AM - Sep 24, 2011",
      "content": "<div>When I think about it, it does make sense.<br/>\nSo, for the build, is there any order for the 16Cleric/4Bard/10RDD?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:25 AM - Sep 24, 2011",
      "content": "<div>You won't be able to delay the RDD into epic like in the Mith build so try to get the highest AB possible (probably around 14, I guess).  Maybe something like clc 10/brd 2/rdd 8 or clc 12/brd 2/rdd 6 pre-epic.  You'll need to take Clc at level 1 unfortunately or get sucked into spending CHA. I'd start it something like 7 Clc/1 Brd (dump to tumble, disc &amp; UMD @Lvl 8) then start to add rdd.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:21 PM - Sep 24, 2011",
      "content": "<div>I would go differently, I'd go Cleric 15 Bard 1 RDD 4, and I'd go straight Cleric to 11 (when DP gives you an extra attack), then take Bard 1 at 12 for the skill dumps. Then 4 more Cleric for buff increases, and then 4 RDD. I nearly always consider the best alternative to go Cleric-heavy as soon as possible to increase your buffs effectiveness and your combat prowess. Not even RDD boni are more important than getting your buffs to their caps as soon as you can, just because there are SO MANY BUFFS that gain increases that there is no way you taking any other class can be more beneficial than that. What class is gonna give you +2 AB and +3 AC? Not to mention durations and support spells like Heal, Word of Faith and such. After 20, go straight for RDD 10, take Bard levels at 23, 28 and 30, last Cleric at 29.<br/>\n<br/>\nThat's what I would do. Like Mick said: More Cleric = More Power.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:06 AM - Sep 25, 2011",
      "content": "<div>With only 1 bard dump level pre-epic, what is the value in taking 3 more rather than just 1 late dump and 2 more cleric levels?  I must be missing something obvious in the need for 4 bard levels in this build.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:04 AM - Sep 25, 2011",
      "content": "<div>You aren't. Cleric 16 is taken to save up on stats, if you go for 17 or more, you'll need 1 more Wisdom at least. So Bard is taken because of the lack of choice, since RDD beyond 10 is worthless. So you can go 12 2 6 pre-epic for the extra skill dump, but regardless, you should delay the skill dump to lvl 13 so that all your buffs gain increases and go straight Cleric 12, then Bard at 13 and RDD from then on with a Bard skill dump at 17 or 18 to round it all up. Then go back to focusing on Cleric till 15. The way I suggested previously was because he could make 3 dumps on epics, 2 to attain benefits ASAP and one just to max out the main skills, like Taunt, UMD, Spellcraft and such. <br/>\n<br/>\nYou need to let the cleric part of the build flourish before you take another level of a class just to skill dump (TUmble would give +2 AC at lvl 7). Each increase in your buffs gives you +2 AB and +3 AC (GMW + DF to AB and MV (armor and shield) and SoF to AC). The exception to this \"rule\" is Cleric Monk because that 1 level of Monk will add so much to the build that it's worth delaying a bit of Cleric.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:23 AM - Sep 25, 2011",
      "content": "<div>I'd find the 1 WIS and take Cleric to 18.  No more is needed. Mith's build had enough cleric levels to remain indispellable with the extra bard levels as a luxury.  Hell, he could have gone bard 6 and it wouldn't have meant doodley squat one way or the other.  But in this one, to get the biggest bang from cleric with SoV &amp; UEF just standing there out of reach is a waste IMO.  At least at cleric 18 most dispels won't stick and that alone is worth something to a build reliant on buffs.  Let us not revisit the merits of 15 levels of cleric again.  Been there, done that.<br/>\n<br/>\nAlso, the faster you get those first 9 RDD levels in the more skill points that will be available.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:36 PM - Sep 25, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong>I'd find the 1 WIS and take Cleric to 18.  No more is needed. Mith's build had enough cleric levels to remain indispellable with the extra bard levels as a luxury.  Hell, he could have gone bard 6 and it wouldn't have meant doodley squat one way or the other.  But in this one, to get the biggest bang from cleric with SoV &amp; UEF just standing there out of reach is a waste IMO.  At least at cleric 18 most dispels won't stick and that alone is worth something to a build reliant on buffs.  Let us not revisit the merits of 15 levels of cleric again.  Been there, done that.<br/>\n<br/>\nAlso, the faster you get those first 9 RDD levels in the more skill points that will be available.</div></blockquote>\n\nUEF is worthless now. It gives LESS DEFLECTION AC than SoF (a lvl 1 spell). A few immunities, true, but not woth wasting the spell slots.<br/>\n<br/>\nSoV is good, but it all depends on DC. He says there's nearly no magic, so he probably won't manage to cap his WIS score, which will make the DC of SoV PATHETIC. With capped Wisdom and 20 final Wisdom, his DC would be 30. Now with only +4 to Wisdom (+2 modifier) it will be 26. Spending 1 stat point and 2 levels to get a spell against which most enemies will succeed most of the time is just dumb. IMO the extra Bard levels give him more playability, because having a skill dump at 12 and the next one only at 30 will make it so that he can't use Taunt effectively. The way I suggested, at least in epics it'll be feasible. Anyway, it's just a matter of preference, but IMO he won't do well with SoV without a few WIS-enhancing items to boost DC.</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "7:37 PM - Oct 13, 2011",
      "content": "<div>Hmm I've been trying different ways of making a character using all your tips,<br/>\nfor some reasons I keep messing up the feats and stuff..<br/>\n<br/>\nCan anyone make a list like.. what to take with each level please?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:50 PM - Oct 13, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>Hmm I've been trying different ways of making a character using all your tips,<br/>\nfor some reasons I keep messing up the feats and stuff..<br/>\n<br/>\nCan anyone make a list like.. what to take with each level please?</div></blockquote>\nJust post what you have so far.  Ignore the skill allocation section for the time being.  Select whichever feats you feel are most important (in your view) and leave a placeholder where ever you are confused.  Just be certain that your abilities are high enough to select the feats you have.  <br/>\n<br/>\nI am unclear which \"version\" you are at right now so it would be helpful (at least for a geezer like yurz troolie) to get a fresh view.</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "8:06 PM - Oct 13, 2011",
      "content": "<div>Well, I've been trying this:<blockquote><div><strong>Maximillian Kane wrote:</strong>I would go differently, I'd go Cleric 15 Bard 1 RDD 4, and I'd go straight Cleric to 11 (when DP gives you an extra attack), then take Bard 1 at 12 for the skill dumps. Then 4 more Cleric for buff increases, and then 4 RDD. I nearly always consider the best alternative to go Cleric-heavy as soon as possible to increase your buffs effectiveness and your combat prowess. Not even RDD boni are more important than getting your buffs to their caps as soon as you can, just because there are SO MANY BUFFS that gain increases that there is no way you taking any other class can be more beneficial than that. What class is gonna give you +2 AB and +3 AC? Not to mention durations and support spells like Heal, Word of Faith and such. After 20, go straight for RDD 10, take Bard levels at 23, 28 and 30, last Cleric at 29.</div></blockquote>\nI don't know which feats I should take, that's the problem.<br/>\n<br/>\nAnd DEX or STR really doesn't matter anymore.<br/>\nJust that if I go STR, I think I'd like Devastating Crits.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "10:45 PM - Oct 13, 2011",
      "content": "<div>I guess this is essentially what Max had in mind for a STR version:<br/>\n<br/>\nCleric(16), Bard(4), Red Dragon Disciple(10), Human<br/>\n<br/>\nSTR: 16 (30)<br/>\nDEX: 8<br/>\nCON: 12 (14)<br/>\nWIS: 16 (18)<br/>\nINT: 14 (16)<br/>\nCHA: 8 (10)<br/>\n<br/>\n01: Cleric(1): Extend Spell, Blind Fight, Domains Travel &amp; Trickery (for example)<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Weapon Focus<br/>\n04: Cleric(4): STR+1, (STR=17)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): Power Attack<br/>\n07: Cleric(7)<br/>\n08: Cleric(8): STR+1, (STR=18)<br/>\n09: Cleric(9): Cleave<br/>\n10: Cleric(10)<br/>\n11: Cleric(11)<br/>\n12: Bard(1): STR+1, Empower Spell, (STR=19)<br/>\n13: Red Dragon Disciple(1)<br/>\n14: Red Dragon Disciple(2): (STR=21)<br/>\n15: Red Dragon Disciple(3): Great Cleave<br/>\n16: Red Dragon Disciple(4): WIS+1, (STR=23), (WIS=17)<br/>\n17: Cleric(12)<br/>\n18: Cleric(13): Improved Critical<br/>\n19: Cleric(14)<br/>\n20: Cleric(15): WIS+1, (WIS=18)<br/>\n21: Red Dragon Disciple(5): Epic Weapon Focus<br/>\n22: Red Dragon Disciple(6)<br/>\n23: Bard(2)<br/>\n24: Red Dragon Disciple(7): STR+1, Overwhelming Crit, (STR=24), (CON=14)<br/>\n25: Red Dragon Disciple(8)<br/>\n26: Red Dragon Disciple(9): (INT=16)<br/>\n27: Red Dragon Disciple(10): Grt Str I, (STR=29), (CHA=10)<br/>\n28: Bard(3): STR+1, (STR=30)<br/>\n29: Cleric(16)<br/>\n30: Bard(4): Dev Crit<br/>\n<br/>\nHP: 296<br/>\nSaves (F/W/R): 20/24/12 (27/31/19 vs. spells)<br/>\nBAB: 19<br/>\nAB (max, naked): 32 (melee), 18 (ranged)<br/>\nAC (naked/mundane armor/shield only): 19/30<br/>\n<br/>\nSkillpoints: 177<br/>\nConcentration 33(35), Discipline 33(43), Lore 8(15), Spellcraft 32(35), Tumble 30(29), UMD 30(30), remaining skillpoints 11 (Perform?)<br/>\n<br/>\nI'll leave it to him to tweak it and furnish a DEX version since he loves those dexers so much.  Bleh! *lol*</div>"
    },
    {
      "author": "RookY2K",
      "avatar": "no_avatar.png",
      "timestamp": "1:02 AM - Oct 14, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong>SoV is good, but it all depends on DC. <strong>He says there's nearly no magic</strong>, so he probably won't manage to cap his WIS score, which will make the DC of SoV PATHETIC. With capped Wisdom and 20 final Wisdom, his DC would be 30. Now with only +4 to Wisdom (+2 modifier) it will be 26. Spending 1 stat point and 2 levels to get a spell against which most enemies will succeed most of the time is just dumb. IMO the extra Bard levels give him more playability, because having a skill dump at 12 and the next one only at 30 will make it so that he can't use Taunt effectively. The way I suggested, at least in epics it'll be feasible. Anyway, it's just a matter of preference, but IMO he won't do well with SoV without a few WIS-enhancing items to boost DC.</div></blockquote>\n\nBased on where he said: <br/>\n<blockquote><div><strong>Xaglacion wrote:</strong>The serve I play on has almost no magic lol. <strong>Most monsters are Melee.</strong><br/>\n<br/>\nAlright so, I think I'll go for Trickery and Magic. Stoneskin will be pretty useful against close combat enemies</div></blockquote>\n\nI don't think the OP really knows what you mean by low magic servers.  I might be wrong, but he seems to think you mean how many of the mobs use magic, not how powerful the enhancements on equipment are.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:05 AM - Oct 14, 2011",
      "content": "<div>Okay, to review quickly, as a rough guideline...<br/>\n<br/>\nLow magic environment would spawn/vend items with maximum magic enhancements of no enhancement to about +3 (like mace +2 or chain shirt +1 or mundane tower shield or natural ammy +1 or belt +2 STR or ring +3 Animal Empathy, etc)<br/>\n<br/>\nMid magic environment would spawn/vend items with maximum magic enhancements of +4 to about +7 <br/>\n<br/>\nHigh magic environments would spawn/vend items with magic enhancements of at least +8 to +10 and higher.  Very easy to reach ability, AB &amp; skill caps on high magic servers. <br/>\n<br/>\nUsually, within each of these environments the monster skins, creature weapons &amp; equipment, stats and AI have been customized to balance against the potential of any attack.  Naturally, a level 30 cap server would have less empowered versions than a level 40 cap environment or it would require a large advanced party to kill most monsters (which may be entirely the intention of some servers).<br/>\n<br/>\nAlso, it is important to keep in mind the scope of the server where you are playing when it comes to rolling dice. For example, a 40 cap server will have base save levels at least 5 points higher than a level 30 cap one.  Also, with very low magic enhancements, base saves are difficult to raise without spells or complimentary saves classes (like CoT, for instance) so spell DCs can be significantly lower and still be just as effective, even more effective, depending on item enhancements.  In the same respect, SR values will be significantly lower on abbreviated caps.   Not always, but normally.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:48 AM - Oct 14, 2011",
      "content": "<div><blockquote><div>13: Red Dragon Disciple(1)<br/>\n14: Red Dragon Disciple(2): (STR=21)<br/>\n15: Red Dragon Disciple(3): Great Cleave<br/>\n16: Red Dragon Disciple(4): WIS+1, (STR=23), (WIS=17)<br/>\n17: Cleric(12)<br/>\n18: Cleric(13): Improved Critical<br/>\n19: Cleric(14)<br/>\n20: Cleric(15): WIS+1, (WIS=18)\n</div></blockquote>\n\nI meant this ALMOST except backwards. Cleric 15 before RDD 4, other than that, you pretty much nailed it</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "4:25 AM - Oct 14, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><blockquote><div>13: Red Dragon Disciple(1)<br/>\n14: Red Dragon Disciple(2): (STR=21)<br/>\n15: Red Dragon Disciple(3): Great Cleave<br/>\n16: Red Dragon Disciple(4): WIS+1, (STR=23), (WIS=17)<br/>\n17: Cleric(12)<br/>\n18: Cleric(13): Improved Critical<br/>\n19: Cleric(14)<br/>\n20: Cleric(15): WIS+1, (WIS=18)\n</div></blockquote>\n\nI meant this ALMOST except backwards. Cleric 15 before RDD 4, other than that, you pretty much nailed it </div></blockquote>\n\nLOL  That's cuz, Max, you are an EXCELLENT student FIRST!  You studied Griz' builds, and kail's builds, and all the others and LEARNED!  I guess people miss what we mean when we say STRAIGHT cleric!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:03 AM - Oct 14, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><blockquote><div>13: Red Dragon Disciple(1)<br/>\n14: Red Dragon Disciple(2): (STR=21)<br/>\n15: Red Dragon Disciple(3): Great Cleave<br/>\n16: Red Dragon Disciple(4): WIS+1, (STR=23), (WIS=17)<br/>\n17: Cleric(12)<br/>\n18: Cleric(13): Improved Critical<br/>\n19: Cleric(14)<br/>\n20: Cleric(15): WIS+1, (WIS=18)\n</div></blockquote>\n\nI meant this ALMOST except backwards. Cleric 15 before RDD 4, other than that, you pretty much nailed it </div></blockquote>\nYah.  I always forget RDD can dump to both spellcraft AND discipline. DOH! Caught with my wings sticking together again!</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "6:13 AM - Oct 14, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong><blockquote><div>13: Red Dragon Disciple(1)<br/>\n14: Red Dragon Disciple(2): (STR=21)<br/>\n15: Red Dragon Disciple(3): Great Cleave<br/>\n16: Red Dragon Disciple(4): WIS+1, (STR=23), (WIS=17)<br/>\n17: Cleric(12)<br/>\n18: Cleric(13): Improved Critical<br/>\n19: Cleric(14)<br/>\n20: Cleric(15): WIS+1, (WIS=18)\n</div></blockquote>\n\nI meant this ALMOST except backwards. Cleric 15 before RDD 4, other than that, you pretty much nailed it </div></blockquote>\nYah.  I always forget RDD can dump to both spellcraft AND discipline. DOH! Caught with my wings sticking together again! </div></blockquote>\nIts that Hip.  But more important, clerics are generally the EASIEST class to power with.  BY delaying cleric 15 to 20, you delay the destructive ability for no real reason.  Sometimes there IS a reason, but not here.  It is technically a preference thing, so it isnt mandatory, and at lv 20, they would be the same, virtually.  It is just getting there more difficult!  LOL  That's my story and I am sticking to it</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "12:42 PM - Oct 14, 2011",
      "content": "<div>ALL RIGHT! Now that I perfectly know what a low magic server is...<br/>\nLemme tell you, I can easily get an armor that gives +12 WIS, +12 STR...<br/>\nThere are some really powerful items so yeah, it's a HIGH MAGIC server.<br/>\nMy bad for the confusion :3</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "11:42 PM - Oct 14, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>ALL RIGHT! Now that I perfectly know what a low magic server is...<br/>\nLemme tell you, I can easily get an armor that gives +12 WIS, +12 STR...<br/>\nThere are some really powerful items so yeah, it's a HIGH MAGIC server.<br/>\nMy bad for the confusion :3</div></blockquote>\n\nThat is just on the armor???  WOW!  And you were thinking it was a LOW magic server!  What on earth is your definition of High magic then???  Cuz I want to play there</div>"
    },
    {
      "author": "RookY2K",
      "avatar": "no_avatar.png",
      "timestamp": "2:26 AM - Oct 15, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong><br/>\nThat is just on the armor???  WOW!  And you were thinking it was a LOW magic server!  What on earth is your definition of High magic then???  Cuz I want to play there   </div></blockquote>\n\nHe didn't have a definition.  He didn't know what you meant by low, mid, high magic servers and assumed you were referring to how much magic the mobs used.  I caught that and brought it to everyone's attention, so Hip explained what the differences were.  Now he knows and that's why he offered the enhancements offered on certain pieces of armor.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:31 AM - Oct 15, 2011",
      "content": "<div>Seriosly, with that kind of items, maybe a Fighter 18 Bard 2 RDD 10 is better. All Cleric buffs stop at 5, while Fighters get full BAB and will get closer to the cap with the items, so perhaps a Fighter 18 Bard 2 RDD 10 is much much stronger and you can take dual-wielding feats and kukris for more juicy devcrits</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "4:09 AM - Oct 15, 2011",
      "content": "<div>When you get items like that (2 max stats on one item), you should be looking at PRC server.  I cannot see how you can keep the game balanced and enjoyable when it is the gear, and not the build, that matters.  At least with PRC, you can have a baddy (not even a boss) cast 4 greater ruins from each caster.  Or other crazy things like that.  That they keep it vanilla is beyond me!  (dont take it personally though, as I am OOOLLLLDDDD!  maybe older than Grim!)</div>"
    },
    {
      "author": "RookY2K",
      "avatar": "no_avatar.png",
      "timestamp": "9:07 AM - Oct 15, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong>When you get items like that (2 max stats on one item), you should be looking at PRC server.  I cannot see how you can keep the game balanced and enjoyable when it is the gear, and not the build, that matters.  At least with PRC, you can have a baddy (not even a boss) cast 4 greater ruins from each caster.  Or other crazy things like that.  That they keep it vanilla is beyond me!  (dont take it personally though, as I am OOOLLLLDDDD!  maybe older than Grim!)</div></blockquote>\n\nNot for nothing, but I don't think he means you get one piece of armor with two max stats on it.  I think he was actually listing, not combining, i.e. 1 piece with 12 wis, another <strong>separate</strong> piece with 12 str.  Either way, that's definitely a high magic server.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "5:32 PM - Oct 15, 2011",
      "content": "<div>The OP should specify what exactly one can expect to get gear wise, so that suggestion can be better aimed. With this I mean, how big a bonus one gets on gear/armor/weapon and of which kind (enhancement, ability boosts, DR, etc.), which kind of immunities/other properties are available and how much stuff can be combined on a single piece of gear.</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "4:01 AM - Oct 20, 2011",
      "content": "<div>Alright so... The Admin just told me that he decided to change the level cap from 30 to 60. O.O<br/>\nFor the gear, you got super powerful things, and you can even enchant your own items. I think to +6 or +7...<br/>\nBy the way, the armor example... I mean't +12 STR/WIS on the same armor lol... It even has Searing Light Lvl40 on it.<br/>\nSo yeah... A Spellsword level 60 in a High Magic Server o.o<br/>\nHow powerful can that be for PvE mostly?</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "5:54 AM - Oct 20, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>Alright so... The Admin just told me that he decided to change the level cap from 30 to 60. O.O<br/>\nFor the gear, you got super powerful things, and you can even enchant your own items. I think to +6 or +7...<br/>\nBy the way, the armor example... I mean't +12 STR/WIS on the same armor lol... It even has Searing Light Lvl40 on it.<br/>\nSo yeah... A Spellsword level 60 in a High Magic Server o.o<br/>\nHow powerful can that be for PvE mostly?</div></blockquote>\nSince Vanilla goes to 40, HOW are they implementing the lvls 40-60?  I tried to level a toon to the \"epic epic levels\" in a mod one time, but was confused.  btw, I would leave a server like that faster than i could take a breath!  Why?  Anyone who DOUBLES the level cap over night is unstable, and will probably do other insane things as well.  Besides, the balance of a server like that, who knows!  You have a guy used to lv 30, and now he wants to do lv 60?  What are boss fights going to be like?   I am not against lv 60 builds.  It is just the suddenness of the change that would put me off.  Then again, I am old school.  <br/>\n<br/>\nIn order to answer anything, we now need to know HOW he is implementing the above epic levels.<br/>\n<br/>\nOh, and regarding the armor question, I knew what you meant.  There are some who can't tell, but I have been around long enough to know when a guy doesnt have the experience to stretch about gear.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:38 PM - Oct 20, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>Alright so... The Admin just told me that he decided to change the level cap from 30 to 60. O.O<br/>\nFor the gear, you got super powerful things, and you can even enchant your own items. I think to +6 or +7...<br/>\nBy the way, the armor example... I mean't +12 STR/WIS on the same armor lol... It even has Searing Light Lvl40 on it.<br/>\nSo yeah... A Spellsword level 60 in a High Magic Server o.o<br/>\nHow powerful can that be for PvE mostly?</div></blockquote>\nOkie.  <br/>\n<br/>\nSo as with many high-magic servers, they may have raised the ability and skill caps to make toons even more uber, usually because the monsters SR, DR &amp; immunities are so prolific.  Is that the case here? Or is this server still subject to the +12 ability and +50 skill caps even with the exalted equipment available?  Also, ability caps on WIS, INT &amp; CHA (depending on the spellcaster class, of course) won't qualify for higher spell levels but just more slots and better DCs.<br/>\n<br/>\nIn addition to the caps, quite often high-magic environments may provide universal class access to items that grant unusual capabilities, too numerous to list here, but for example, weapons that spam IGMS OnHit and Crit Immune belts or jewelry (like that OnHit Searing armor that was mentioned).  The presence of such uber enhancements is so unbalancing that it is almost impossible to contrive a maximum build without full knowledge of the scope of the enhancements.<br/>\n<br/>\nSo yeah, a high-magic server can be the most difficult to build for... IMHO.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:45 PM - Oct 20, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>Xaglacion wrote:</strong>Alright so... The Admin just told me that he decided to change the level cap from 30 to 60. O.O<br/>\nFor the gear, you got super powerful things, and you can even enchant your own items. I think to +6 or +7...<br/>\nBy the way, the armor example... I mean't +12 STR/WIS on the same armor lol... It even has Searing Light Lvl40 on it.<br/>\nSo yeah... A Spellsword level 60 in a High Magic Server o.o<br/>\nHow powerful can that be for PvE mostly?</div></blockquote>\nOkie.  <br/>\n<br/>\nSo as with many high-magic servers, they may have raised the ability and skill caps to make toons even more uber, usually because the monsters SR, DR &amp; immunities are so prolific.  Is that the case here? Or is this server still subject to the +12 ability and +50 skill caps even with the exalted equipment available?  Also, ability caps on WIS, INT &amp; CHA (depending on the spellcaster class, of course) won't qualify for higher spell levels but just more slots and better DCs.<br/>\n<br/>\nIn addition to the caps, quite often high-magic environments may provide universal class access to items that grant unusual capabilities, too numerous to list here, but for example, weapons that spam IGMS OnHit and Crit Immune belts or jewelry (like that OnHit Searing armor that was mentioned).  The presence of such uber enhancements is so unbalancing that it is almost impossible to contrive a maximum build without full knowledge of the scope of the enhancements.<br/>\n<br/>\nSo yeah, a high-magic server can be the most difficult to build for... IMHO.</div></blockquote>\n\nHeh, I think it's backwards, just make any CRAP build and equip it well <br/>\n<br/>\nIf the cap is gonna change, use the Spellsword of Bahamut by Mick Dagger with my suggested tweaks of dropping the Spell Penetration feats and adding Divine Might and Divine Shield and get all extra levels of Sorcerer for more penetration and less Mord's dispellability.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "3:21 PM - Oct 23, 2011",
      "content": "<div>Oh god... So I just learned how the levels 41-60 work.<br/>\nYou gain:<br/>\n<br/>\n-&gt; 1 Ability point per 2 Legendary Levels.<br/>\n-&gt; 4+1(Natural INT) of Stat Points.<br/>\n-&gt; 1 Feat(Including the Epic ones) each 3 Levels.<br/>\n-&gt; Maximized HP every level.<br/>\n<br/>\nFor the items...<br/>\nI don't really know much about them, I know there's no item that grants immunity to critical hits.<br/>\nThe admin created a few items that are really really powerful, but offensive</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "5:13 AM - Oct 24, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong>Oh god... So I just learned how the levels 41-60 work.<br/>\nYou gain:<br/>\n<br/>\n-&gt; 1 Ability point per 2 Legendary Levels.</div></blockquote>\nHOLY CRAP\n<blockquote><div>\n-&gt; 4+1(Natural INT) of Stat Points.</div></blockquote>\nI think you mean skill points.  And that is ridiculous to have set as a GENERAL increase!\n<blockquote><div>\n-&gt; 1 Feat(Including the Epic ones) each 3 Levels.<br/>\n-&gt; Maximized HP every level.<br/>\n<br/>\nFor the items...<br/>\nI don't really know much about them, I know there's no item that grants immunity to critical hits.<br/>\nThe admin created a few items that are really really powerful, but offensive</div></blockquote>\nIf I were you, I would find another server.  The balance for this server will be ridiculous for YEARS!  Remember, this started as a lv 30 server!  This jump is absurd!   My prediction: PC's will outstripe the power of ALL bosses and mobs at a ridiculous rate so admin staff will increase the difficulty of mobs and bosses to ludicrious levels making the game almost unbearably easy then impossibly hard.  <br/>\n<br/>\nIf this is the case, the ULTIMATE build for this server is cleric/bard/pm10.  pm10 gives imm to crits.  bard lvls for skill dumps (tumble, disc).  Cleric for spell levels and durations and spells!  The downside is, the bonuses on the items will probably approach +20, which makes the cleric damage bonus spells obsolete.  The spell Divine Power becomes THE spell for you.  I would try to take as many Meta feats as I could (ext, silent, empower, max) in order to maximize spellbook management.  I would also take the domain (forgive me, i have forgotten which one gives it) with Divine Power to further EXTEND that spell.  I would want as many spell levels (COMPLETE slots devoted to the spell ONLY) of Divine power as I could at least 3).  oh wait... div power counts to +20 cap...   <br/>\n<br/>\nGood luck buddy.  WIth a server like this, the build does not matter at all.  Your gear is what counts (max said this).  Once you have +20 gear, nothing that the build does matters much.  Boring.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:41 PM - Oct 24, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong><br/>\nIf I were you, I would find another server.  The balance for this server will be ridiculous for YEARS!  Remember, this started as a lv 30 server!  This jump is absurd!   My prediction: PC's will outstripe the power of ALL bosses and mobs at a ridiculous rate so admin staff will increase the difficulty of mobs and bosses to ludicrious levels making the game almost unbearably easy then impossibly hard.\n</div></blockquote>\nDon't know if I would be that extreme in my own recommendation, avado, but the cycle you've stated is totally accurate and quite common... a sort of never-ending plight of rebalancing which never really works.  The standard post-epic server boosts described by the OP are indeed insane IMHO.\n<blockquote><div> <br/>\nThe spell Divine Power becomes THE spell for you.  I would try to take as many Meta feats as I could (ext, silent, empower, max) in order to maximize spellbook management.  I would also take the domain (forgive me, i have forgotten which one gives it)... </div></blockquote>\nPlay, dammit, play!   Strength domain. \n<blockquote><div>\nGood luck buddy.  WIth a server like this, the build does not matter at all.  Your gear is what counts (max said this).  Once you have +20 gear, nothing that the build does matters much.  Boring.</div></blockquote>\nIt becomes nothing more than an item hunt like Diablo &amp; its ilk.  Boring to me as well.  I'd pass because the build becomes secondary to waiting for the uber items to drop.</div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "2:36 AM - Nov 05, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong><blockquote><div><strong>Xaglacion wrote:</strong><br/>\nIf this is the case, the ULTIMATE build for this server is cleric/bard/pm10.  pm10 gives imm to crits.  bard lvls for skill dumps (tumble, disc).  Cleric for spell levels and durations and spells!  The downside is, the bonuses on the items will probably approach +20, which makes the cleric damage bonus spells obsolete.  The spell Divine Power becomes THE spell for you.  I would try to take as many Meta feats as I could (ext, silent, empower, max) in order to maximize spellbook management.  I would also take the domain (forgive me, i have forgotten which one gives it) with Divine Power to further EXTEND that spell.  I would want as many spell levels (COMPLETE slots devoted to the spell ONLY) of Divine power as I could at least 3).  oh wait... div power counts to +20 cap...</div></blockquote></div></blockquote>\n\nCleric/Bard/PM? What kind of build is that? O.o <br/>\nThough that actually fits the character I have right now..<br/>\nTruth is, I'm starting to get hyped on finding -the- build that would destroy a Bard/BlackGuard/PM (Strongest Character there is right now).<br/>\nHow do you think the Cleric/Bard/PM would be built?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:14 AM - Nov 05, 2011",
      "content": "<div><blockquote><div><strong>Xaglacion wrote:</strong><blockquote><div><strong>avado wrote:</strong><blockquote><div><strong>Xaglacion wrote:</strong><br/>\nIf this is the case, the ULTIMATE build for this server is cleric/bard/pm10.  pm10 gives imm to crits.  bard lvls for skill dumps (tumble, disc).  Cleric for spell levels and durations and spells!  The downside is, the bonuses on the items will probably approach +20, which makes the cleric damage bonus spells obsolete.  The spell Divine Power becomes THE spell for you.  I would try to take as many Meta feats as I could (ext, silent, empower, max) in order to maximize spellbook management.  I would also take the domain (forgive me, i have forgotten which one gives it) with Divine Power to further EXTEND that spell.  I would want as many spell levels (COMPLETE slots devoted to the spell ONLY) of Divine power as I could at least 3).  oh wait... div power counts to +20 cap...</div></blockquote></div></blockquote>\n\nCleric/Bard/PM? What kind of build is that? O.o <br/>\nThough that actually fits the character I have right now..<br/>\nTruth is, I'm starting to get hyped on finding -the- build that would destroy a Bard/BlackGuard/PM (Strongest Character there is right now).<br/>\nHow do you think the Cleric/Bard/PM would be built?</div></blockquote>\n\nLike this:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build247143.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 47143.html</a></div>"
    },
    {
      "author": "Xaglacion",
      "avatar": "no_avatar.png",
      "timestamp": "6:07 PM - Nov 05, 2011",
      "content": "<div>Holy... That is awesome O.O<br/>\nDoes it matter how I'd build from 40 to 60?</div>"
    }
  ]
}