{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "273",
  "name": "Divine Generalist: Rogue 5/Paladin 7/Champion of Torm 28",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/divine-generalist-rogue-5-paladin-7-champion-of-to-t2343426.html",
  "author": "Bru",
  "avatar": "10235496_1517392314.jpg",
  "replies": "6",
  "views": "5.6K",
  "posts": [
    {
      "author": "Bru",
      "avatar": "10235496_1517392314.jpg",
      "timestamp": "9:14 PM - Oct 06, 2013",
      "content": "<div><strong>Divine Generalist:</strong> Rogue 5/Paladin 7/Champion of Torm 28<br/>\n Human, LG<br/>\n Playable PvM, 1-40<br/>\n<br/>\n This build is a “genetically modified” version of The Generalist by Mithdradates (FTR 10/CoT 28/Rogue 2).<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build118915.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 18915.html</a><br/>\n<br/>\n The replacement of Fighter with Paladin involves the loss of Disarm / Improved Disarm, WS/EWS, 1 point of AB and Armor Skin, but you will get: divine damage from Divine Might (no more trouble against an adamantine golem), AC dodge bonus from Divine Shield, more effective AB from Taunt and further increase in saving throws from CHA gear that is not counted in the +20 cap (to which both builds are very close, especially versus spell).<br/>\n<br/>\n It must be also mentioned the build Generalist V. 2 by Mithdradates (CoT 14 / Paladin 16 / Rogue 10).<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build205816.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 05816.html</a><br/>\n<br/>\n It develops the Paladin spellcasting but abandons the ambition to be a mage-slayer (easily dispellable buffs and saving throws still good but definitely not comparable).<br/>\n<br/>\n Advantages<br/>\n High saves and Evasion.<br/>\n AB 42 and Taunt.<br/>\n Divine damage. He can bypass damage reduction.<br/>\n Devastating Critical (DC 39-45).<br/>\n Use Magic Device. He can use any scroll.<br/>\n<br/>\n Stats<br/>\n STR 16 (28)<br/>\n DEX 8<br/>\n CON 12<br/>\n INT 14<br/>\n WIS 8<br/>\n CHA 16 (20)<br/>\n<br/>\n Leveling<br/>\n 01 R1 Power Attack, Iron Will<br/>\n 02 P1<br/>\n 03 P2 Weapon Focus<br/>\n 04 P3 STR +1, (STR=17)<br/>\n 05 R2<br/>\n 06 P4 Divine Might<br/>\n 07 R3<br/>\n 08 R4 STR +1, (STR=18)<br/>\n 09 P5 Divine Shield<br/>\n 10 CoT1<br/>\n 11 CoT2 Knockdown<br/>\n 12 CoT3 Toughness, STR +1, (STR=19)<br/>\n 13 CoT4 Improved Critical<br/>\n 14 CoT5<br/>\n 15 CoT6 Blind-Fight, Improved Knockdown<br/>\n 16 CoT7 STR +1, (STR=20)<br/>\n 17 CoT8 Cleave<br/>\n 18 P6 Extra Turning, {Taunt 21}<br/>\n 19 CoT9<br/>\n 20 CoT10 Great Cleave, STR +1, (STR=21)<br/>\n 21 CoT11 Great Strength I, (STR=22)<br/>\n 22 CoT12<br/>\n 23 CoT13<br/>\n 24 CoT14 STR +1, Great Strength II, Overwhelming Critical, (STR=24)<br/>\n 25 CoT15<br/>\n 26 CoT16<br/>\n 27 CoT17 Great Strength III, (STR=25)<br/>\n 28 CoT18 STR +1, Devastating Critical, (STR=26)<br/>\n 29 CoT19<br/>\n 30 CoT20 Great Charisma I, (CHA=17)<br/>\n 31 CoT21<br/>\n 32 CoT22 CHA +1, Epic Weapon Focus, (CHA=18)<br/>\n 33 CoT23 Great Charisma II, (CHA=19)<br/>\n 34 CoT24<br/>\n 35 CoT25<br/>\n 36 CoT26 CHA+1, Great Strength IV, Epic Prowess, (CHA=20), (STR=27)<br/>\n 37 CoT27<br/>\n 38 CoT28<br/>\n 39 R5 Epic Will<br/>\n 40 P7 STR +1, (STR=28)<br/>\n<br/>\n<span style=\"color:#FF0000\"><strong>Skill Schedule</strong><br/>\n 01: Listen(4), Spellcraft(2), Tumble(4), UMD(4), Save(28),<br/>\n 02: Discipline(5), Taunt(5), Save(23),<br/>\n 03: Discipline(1), Spellcraft(1), Taunt(1), Save(24),<br/>\n 04: Discipline(1), Taunt(1), Save(27),<br/>\n 05: Listen(4), Spellcraft(1), Tumble(4), UMD(4), Save(24),<br/>\n 06: Discipline(2), Taunt(2), Save(25),<br/>\n 07: Listen(2), Spellcraft(1), Tumble(2), UMD(2), Save(28),<br/>\n 08: Listen(1), Tumble(1), UMD(1), Save(36),<br/>\n 09: Discipline(3), Spellcraft(1), Taunt(3), Save(33),<br/>\n 10: Discipline(1), Save(37),<br/>\n 11: Discipline(1), Spellcraft(1), Save(39),<br/>\n 12: Discipline(1), Save(43),<br/>\n 13: Discipline(1), Spellcraft(1), Save(45),<br/>\n 14: Discipline(1), Save(49),<br/>\n 15: Discipline(1), Spellcraft(1), Save(51),<br/>\n 16: Discipline(1), Save(55),<br/>\n 17: Discipline(1), Spellcraft(1), Save(57),<br/>\n 18: Discipline(1), Taunt(9), Save(52),<br/>\n 19: Discipline(1), Spellcraft(1), Save(54),<br/>\n 20: Discipline(1), Save(58),<br/>\n 21: Discipline(1), Spellcraft(1), Save(60),<br/>\n 22: Discipline(1), Save(64),<br/>\n 23: Discipline(1), Spellcraft(1), Save(66),<br/>\n 24: Discipline(1), Save(70),<br/>\n 25: Discipline(1), Spellcraft(1), Save(72),<br/>\n 26: Discipline(1), Save(76),<br/>\n 27: Discipline(1), Spellcraft(1), Save(78),<br/>\n 28: Discipline(1), Save(82),<br/>\n 29: Discipline(1), Spellcraft(1), Save(84),<br/>\n 30: Discipline(1), Save(88),<br/>\n 31: Discipline(1), Spellcraft(1), Save(90),<br/>\n 32: Discipline(1), Save(94),<br/>\n 33: Discipline(1), Spellcraft(1), Save(96),<br/>\n 34: Discipline(1), Save(100),<br/>\n 35: Discipline(1), Save(104),<br/>\n 36: Discipline(1), Save(108),<br/>\n 37: Discipline(1), Save(112),<br/>\n 38: Discipline(1), Save(116),<br/>\n 39: Listen(31), Tumble(29), UMD(29), Save(38),<br/>\n 40: Discipline(2), Taunt(22), Save(19),</span><br/>\n<br/>\n Skill Points: 263<br/>\n Discipline 43 (52), Listen 42 (41), Spellcraft 18 (20), Taunt 43 (48), Tumble 40, UMD 40 (45), 19 points leftover (Persuade might be a good choice for the concept and interpretation)<br/>\n<br/>\n HP (max): 460<br/>\n<br/>\n Saving Throws (against spells):<br/>\n Fortitude 43 (47)<br/>\n Reflex 41 (45) Evasion<br/>\n Will 40 (44)<br/>\n<br/>\n AC (naked/heavy armour/tower shield): 17/25/28 (Divine Shield: +5 dodge bonus)<br/>\n<br/>\n<span style=\"color:#FF0000\"><strong>BAB: 29 (4 APR)</strong></span><br/>\n AB (mundane weapon): 42 (Divine Wrath: +11, Smite Evil: +5 vs Evil, Taunt: +6 effective AB)<br/>\n<strong><span style=\"color:#FF0000\">AB, ranged: 29</span></strong><br/>\n<br/>\n Damage (no buffs)<br/>\n Mundane Greatsword: 2-12+13 (Critical: 17-20/x2) +3d6 SA<br/>\n Mundane Scimitar: 1-6+9 (Critical: 15-20/x2) +3d6 SA<br/>\n Devstating Critical DC 39<br/>\n<br/>\n Damage (+12 STR, +12 CHA, divine wrath, divine might)<br/>\n +5 keen Greatsword: 2-12+27 +22 divine (15-20/x2) +3d6 SA<br/>\n +5 keen Scimitar: 1-6+20 +22 divine (12-20/x2) +3d6 SA<br/>\n Devastating Critical DC 45<br/>\n<br/>\n<em><span style=\"color:#000000\">edit: per Hip 20160917 (corrections/additions of missing info, in</span></em><span style=\"color:#FF0000\"><strong> red</strong></span><em><span style=\"color:#000000\">) </span></em></div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "11:56 PM - Oct 06, 2013",
      "content": "<div>Looks good. I would replace iron will with strong soul, as it gives a better defense against devastating critical while typically only lowering your will by one versus mind-affecting conditions.</div>"
    },
    {
      "author": "Bru",
      "avatar": "10235496_1517392314.jpg",
      "timestamp": "9:16 PM - Oct 07, 2013",
      "content": "<div>Come to think, with Strong Soul you can reach the \"fateful\" threshold of 48 Fortitude (49 versus death magic), which is the highest DC for Implosion (10 +9 spell level +20 max WIS bonus +6 epic spell focus + 3 specific = 48)</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:59 AM - Oct 09, 2013",
      "content": "<div>Hail Bru!<br/>\n<br/>\nNow we're talking! This is quite an interesting build. I like the split between CHA and STR for it, it's very self-sufficient with UMD and Taunt. Saves are off the charts. Good work! <br/>\n<br/>\nThe way I see it, it's very playable but the spread isn't optimized, which means that with a little shuffling around, you can improve its level 40 power, provided you're willing to endure a bit of pain LOL.<br/>\n<br/>\nThere are 4 \"extra\" levels in that build that don't give you much benefit. CoT gives bonus feats every 4 levels after 10, so 14, 18, 22, 26 and 30. CoT 27 and 28 are, let's say, unnecessary (it's 2 levels for +1 to all saves). You could stop CoT at 26, and that means you'd have 2 levels \"left\" to put somewhere else. With Rogue almost the same thing happens. You get Uncanny Dodge at level 3 and +1d6 of SA damage, for 2 more levels, you gain a few Skill Points and +1d6 SA. So Rogue 3 is enough. One would argue that even 2 would be enough, given that what you want is Evasion for this build (Uncanny Dodge with 8 DEX isn't exactly useful). So, basically, you have 4, maybe 5 levels that aren't rewarding you as much as you'd want.<br/>\n<br/>\nI have a \"theory\" that the Paladin spellbook is excellent. Paladins are basically average warriors that have a couple of short duration \"GOD MODE\" uses a day. You walk around with your average AB and average AC, happily killing mobs without too much trouble. Then you see that boss, the one that requires every ounce of power you can muster, and then you shift into god mode and obliterate him. That's how I play paladins. This guy here doesn't have the ability to cast spells or the levels to make them useful. So, just as an exercise, you could consider a few different spreads and starting abilities tweaks that would allow you to use that part of the Paladin arsenal.<br/>\n<br/>\nPaladin 12 Rogue 2 CoT 26 (lose 2d6 SA, 1 to all saves, gain up to level 3 spells) - You'd need to drop 2 Strength and 2 con for 6 Wisdom, bringing it to 14 and allowing you to cast 3rd level Paladin Spells. That would grant you Divine Favor (+4 to AB and damage), GMW (+4 enhancement until you can find a better weapon), Bull's Strength, Eagle's Splendor, Bless, Aid, Prayer. If you drop one feat pre-epic (Toughness or IKD) or the Devcrit line (Cleave and Great Cleave pre-epic, more so because the DC isn't too high)), you could take Extend Spell and Expertise (which I absolutely recommend in this build (with Taunt and Expertise you can save up lots of uses of Divine Shield, which also makes Extra Turning a bit redundant).<br/>\n<br/>\nPaladin 15 Rogue 3 CoT 22 (You lose +3 to all saves, 1d6 SA and a few skill points, but gain full Paladin Spellbook).<br/>\n<br/>\nPaladin 16 Rogue 2 CoT 22 (You can have more Taunt dumps throughout the build and earlier full spellbook).<br/>\n<br/>\nIt's quite good as it is, but if you add spells to your combat strategy, you can be much more effective. Probably this is a reflex from where I play. There, mobs aren't hard to kill (and they're worth little XP), and bosses are EXTREMELY TOUGH (as an example, there is a boss around level 12 who can crit you for over 100 damage!). The real money and XP is in bosses there, so having these \"god mode\" uses can be very useful where I play. Also, it's low-mid magic, which makes weapon-buffing spells VERY USEFUL!<br/>\n<br/>\nRegardless, it's a really cool build. All I have suggested here is probably just personal preference. Kudos!<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Bru",
      "avatar": "10235496_1517392314.jpg",
      "timestamp": "10:33 PM - Oct 09, 2013",
      "content": "<div>Welcome back Maximillian Kane!<br/>\n<br/>\nin my experience I have always hated the moment when my paladin, height of his power   fully self buffed   is targeted by Mordenkainen 's Disjunction and * poof * much of its offensive power fades miserably... is one thing that makes me really sad  now it is considered that with only 12-16 paladin levels just a simple Greater Dispelling casted by a Pit Fiend or a Dracolich on duty because the drama takes place (I hope you understand something in spite of my bad English  ). The buffs in this build are not dispellable ! * Yuuu * Divine Might and Divine Shield can be used 14 times per day at level 40, 20 times with +12 CHA gear. Divine Wrath can last from 5 to 11 rounds and is the \" GOD MODE\" by definition <br/>\n<br/>\nthe changes you propose, Maximillian Kane, are interesting and I think that especially pre-epic really make a difference, but they have a cost in terms of saving throws that although it may seem irrelevant, marks the boundary between a true \"mage-slayer\" and a common \"divine warrior\".<br/>\n<br/>\nA variant that does not affect the concept of the build would be:<br/>\n-2 CoT levels<br/>\n+1 Rogue level<br/>\n+1 Paladin Level<br/>\nto have more Taunt and UMD dumps Throughout the build.<br/>\n<br/>\nThanks for the interesting ideas, see you next time!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:21 PM - Oct 09, 2013",
      "content": "<div>Hey Bru!<br/>\n<br/>\nThere's nothing wrong with your English man! Why do you keep saying that? You're writing very proficiently, and making yourself understood perfectly. Anyway...<br/>\n<br/>\nI know the feeling of getting dispelled, trust me. I've played my share of Paladins and Clerics. The NWN AI is quite defective, in a sense that if it detects you have a couple of buffs, it will attempt to dispel them. You can use that knowledge to your advantage, drink a few potions and literally WAIT to get dispelled, then after they've run out of Dispel attempts, you buff up and obliterate them. Your comments tell me that you're probably buffing at the wrong time, and therefore not making the most out of your spells, which in turn makes you think they shouldn't be bothered with. If you try out this anti-dispel strategy, I have a tendency to believe you may change your mind about the buffs. Just make sure you get dispelled a couple of times before actually buffing up for real . Don't sell those Eagle's Splendor, Bull's Strength, Endurance potions you find. Use them to get dispelled! Scrolls work as well. All your cool buffs are short duration, so use them when you need to, not at the start of each day. Even the long ones, save them for after you're dispelled a couple of times. And always rush the casters, if you get them before they buff, they're sitting ducks!<br/>\n<br/>\nAbout what you said, I'd just like to make a few comments, if you'd allow me:<br/>\n<br/>\n- Against a Pit Fiend, you really shouldn't buff. No matter the level you're at, buffing against a PF is a bit of a waste. Paladins have VERY FEW resources, you should be more stingy with them .<br/>\n<br/>\n- Dracoliches are much more dangerous to Pallies with their Harms than with their Greater Dispellings. You shouldn't buff against them either, just have a few Heal potions ready for each time you get Harmed down to 1d4 HP. Wait for them to run out and then bash them (without buffing). You can use Divine Mights to speed up the process, for sure, but you should absolutely save your buffs for enemies that you have trouble hitting. Dracoliches and their very low AC are hardly the case.<br/>\n<br/>\nIt seems that our playing experience is very different. Those weren't the kinds of bosses I was talking about. I was talking about well-conceived ones such as Lord Vayne (a certain WoG boss) for example. He's a Cleric / Bard / PM boss with AC around 70 and AB around 45-50 (I don't remember exactly) that you're supposed to face around level 25 in a party or 30 solo. Immune to Criticals, KD, Death Effects. Implosion DC of 38, full Cleric spellbook, 500 HPs, 4 Heal potions (and some Mass Heal and Heal spells), Mummy Dust epic spell at his disposal and some really cool items that he drops when dead. This toon of yours would have virtually no chance of hitting Vayne (except on 20s) and for sure 11 rounds of \"godliness\" wouldn't be enough to kill him. You'd need every little buff you can think of, not to mention scrolls, to stand a chance against Vayne, and even that it's not a given. He's killable, for sure. I have managed to kill him in one round, as a matter of fact, but that was with some of my most resourceful builds (Magical Master and Demolition Man). <br/>\n<br/>\nWell, I really have to go, but I hope you don't think I am trying to undermine your builds. It's just that IMO you're undervaluing the usefulness of the Paladin spellbook. They have nearly all the same offensive buffs as Clerics. Those are EXCELLENT spells.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:17 AM - Oct 10, 2013",
      "content": "<div>Max's sacrificial potion idea works... against anemic creature mobs, even if the AI is that predictable.  Against a group of hasted True seeing duergar monk clerics, for instance, your toon won't be able to run fast enough or far enough to \"buff for real\" because invisibility won't hide you.  If you have a pile of Greater Sanctuary scrolls handy, then it may work. That's a big \"if\", though and the whole round you are reading they are closing in a pack trying to flank your position.  But it's worth testing the waters if for no other reason than to find out what perception range the designers set on their creature blueprints.  Fortunately your mainstays are DM/DS which defy dispel attempts. <br/>\n<br/>\nAnd speaking of casting via scrolls like GS... <br/>\n<br/>\nUnless you anticipate availability of insanely expensive gear, any UMD level over 35 is wasted.  34 modified ranks is enough to cast any level 9 spells without failure so I usually set it at unbuffed 35.  A level of 45 (and that's without any CHA- or UMD skill-boosting gear on) will assure you of being able to equip class-specific items valued up to 2.2M gold, race-specific to 1.8M and alignment-specific to 1.4M.  If the gear you want to equip has those values it's definitely an uber-magic environment with lots of creatures with serious DR are going to be wandering around.  <br/>\n<br/>\nI'd combine that excess 10 ranks of UMD with the 19 other spare you've mentioned and put 13 in Disable trap and 16 in Set Trap.  You'll be able to disarm all non-epic traps, recover quite a few different powers of kits and set all non-epic traps except gas ones (they suck anyway!).   Trapping for mob control suits my plodding recon play style but you may not want to spend the time dealing with them.  But it's there, if you want to take advantage.<br/>\n<br/>\nBTW, you should get in the habit of furnishing a skill allotment sequence for those who want to try out your build without first populating a Character Build Calculator beforehand.  Consider it a courtesy.  Looks pretty nice otherwise.  Good work!</div>"
    }
  ]
}