{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "462",
  "name": "Arelith- Dragonshaper",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-dragonshaper-t2178252.html",
  "author": "CinnamonBear123",
  "avatar": "no_avatar.png",
  "replies": "8",
  "views": "3.7K",
  "posts": [
    {
      "author": "CinnamonBear123",
      "avatar": "no_avatar.png",
      "timestamp": "10:49 PM - Dec 01, 2011",
      "content": "<div>Hey, I'm requesting a dragon shaper build. I know its possobile on Arelith, even though I have heard its not. I've seen it, and not the shape change spell, the feat. Rather basic request, just in general a good dragonshaper. Druid levels are great on Arelith aswell for totem druids, I know the Dragonshaper player has druid levels for totem druid, anyways..</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:51 AM - Dec 02, 2011",
      "content": "<div>Just off the top of my gray head &amp; untested:  Druid 18/Monk 6/CoT 6<br/>\n<br/>\nStart w/STR 14, WIS 18 &amp; INT 14, Human. All abilities bump to WIS (naturally)<br/>\n<br/>\n1-3 Monk, 4-18 Druid, 19-20 Monk, 21-26 CoT, 27-28 Druid, 29 Monk, 30 Druid (dragon form)<br/>\n<br/>\nTake any melee weapon focus (except unarmed) in pre-epic to qualify for CoT.<br/>\n<br/>\nKey feats for dragon shape: Imp Crit unarmed, Expertise/Imp Expertise for breath weapon, Power attack/great Cleave<br/>\nThrow in toughness, blind fight &amp; whatever.  Not sure how disarm works with dragon form... it's an option.  So is called shot. Or perhaps some metamagic feat.  Up to you. <br/>\n<br/>\nEpic feats: 5 Grt WIS, Epic prowess or armor skin, DS @ Lvl 30<br/>\n<br/>\n219 skill points: 28 spellcraft, 30 tumble, 32 discipline, 33 concentration (96 left)<br/>\n<br/>\nIf you have to take at least 10 levels in CoT on Arelith or some other nonsense you will lose the monk synergy which sux for DS, but hopefully this will work for you.</div>"
    },
    {
      "author": "CinnamonBear123",
      "avatar": "no_avatar.png",
      "timestamp": "2:39 AM - Dec 02, 2011",
      "content": "<div>Okay, really good. Except, is there any way to switch around lvls or feats to fit in Construct Shape?</div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "7:00 AM - Dec 02, 2011",
      "content": "<div>I have no real expertise at druid builds, but I know that adding Construct Shape can put you into a significantly different kind of build, since that feat requires at least ten levels of shifter. That requirement will mean giving up a third class option. Most people would choose to keep monk, for the AC bump as well as the unarmed attack progression, tumble, KD/IKD, saves, etc. But, losing a class like CoT means you are suddenly tight on feats and that means looking at a primarily shifter build (at the loss of druid, mostly), in order to get the epic bonus feats. <br/>\n<br/>\nThe good news, by my rough testing, is that it's still possible to get to 30 WIS and get constructs and dragons by level 30 in a Dr/Sh/M build. Trying the same outline as HipMaestro used, I come up with: <br/>\n<br/>\n1-3 Monk<br/>\n4-8 Druid<br/>\n9-17 Shifter<br/>\n18-19 Monk<br/>\n20-28 Shifter<br/>\n29 Monk<br/>\n30 Shifter<br/>\n<br/>\nAll epic feats are Great Wisdom until level 30. You end up with better dragon breath, though much less buffing potential. And, looking at it, this guy looks like a very late bloomer in terms of versatility, since he gets both epic shape feats at level 30 but no great toys to play with before that.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:31 PM - Dec 02, 2011",
      "content": "<div>Good job, MrZ!  Completely forgot about the shifter bonus feats to get to WIS 30.<br/>\n<br/>\nBut the trade-off, IMO is not an equitable one over the druid version.  Alertness is completely worthless in a relatively feat-starved build.  And I would terribly miss buffing my dragon form with Greater Stoneskin, Owl's Insight, Energy Buffer &amp; AoV.  The CoT +3 saves is also nothing to sneeze at on a level 30 build.  For a level 40 build, the druid shifter option makes more sense to me because really, 5 levels of druid are essentially wasted.   Not sure what the OP finds more attractive about Construct over Dragon, though... fear of DevCrit or Level-drain? <br/>\n<br/>\nNature's Balance is an awesome spell when the druid is in offensive casting mode (i.e. SoV SR &amp; others).<br/>\n<br/>\nThe main down-side I see is missing the breath weapon boost without shifter 10. <br/>\n<br/>\nAlso, OP, if you hadn't realized it, slightly OT... Shield special properties can be merged into DS without losing the monk attack progression so be wary of finding/buying any that are available on your server(s).</div>"
    },
    {
      "author": "johnbonmovi",
      "avatar": "no_avatar.png",
      "timestamp": "1:22 PM - Jan 31, 2012",
      "content": "<div>The problem with these suggestions is the OP left out some important information about arelith, namely the fact that all prestige classes require DM approval, and it is DM staff policy to not approve druid cot levels.  Shifter is also an almost impossible class to earn approval for, the only way to get dragonshape is pure druid dumping everything into wisdom and epic wis feats, or to take a \"starting gift\" of +2 wisdom.</div>"
    },
    {
      "author": "Templar",
      "avatar": "10235261_1528181864.jpg",
      "timestamp": "6:46 AM - Jun 30, 2012",
      "content": "<div><blockquote><div><strong>johnbonmovi wrote:</strong>The problem with these suggestions is the OP left out some important information about arelith, namely the fact that all prestige classes require DM approval, and it is DM staff policy to not approve druid cot levels.  Shifter is also an almost impossible class to earn approval for, the only way to get dragonshape is pure druid dumping everything into wisdom and epic wis feats, or to take a \"starting gift\" of +2 wisdom.</div></blockquote>\n<br/>\nwho did you hear that its dm staff policy to not approve druid COT levels? Because the only reason they won't is because your not RP'ing the classes correctly or couldn't complete the COT quest. COT is relatively simple if your rp'ing it accurately and not doing it simply for the power build concept.</div>"
    },
    {
      "author": "johnbonmovi",
      "avatar": "no_avatar.png",
      "timestamp": "5:27 PM - Jul 16, 2012",
      "content": "<div>No you are absolutely wrong Templar, they simply will not approve a COT-DRUID-MONK because this build is considered to be only for powerbuilding by many people on the staff.  You will never get it approved and if you do once a DM sees you dragonshape they will delevel you and remove the COT token.  There are currently 0 dragonshapers with any COT levels on arelith.</div>"
    },
    {
      "author": "johnbonmovi",
      "avatar": "no_avatar.png",
      "timestamp": "5:32 PM - Jul 16, 2012",
      "content": "<div>As an addendum I know this because I was friends several years ago with cot-druid-monks on arelith who, upon the update to the current item system were all forcibly releveled without COT tokens.</div>"
    }
  ]
}