{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "691",
  "name": "Cleric 11/12/13,/,ShadowD 4/5,/,Assass 23,24,25",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/cleric-11-12-13-shadowd-4-5-assass-23-24-25-t2355348.html",
  "author": "Asturonethoriusaline",
  "avatar": "no_avatar.png",
  "replies": "13",
  "views": "220",
  "posts": [
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "11:22 AM - Feb 10, 2020",
      "content": "<div>Wiloren Swift Ristarone<br/>\n<br/>\nHuman<br/>\n<br/>\nCleric 11/12/13 / Shadowdancer 4/5 / Assassin 23/24/25<br/>\n<br/>\nCleric Domains: <br/>\n<br/>\nMagic: gives access to Mage Armor, Stoneskin, Acid Arrow, Icestorm.<br/>\n<br/>\nWar: Gives access to Cats grace<br/>\n<br/>\nWhy Cleric: for synergistical buffs up to level 6,7 spells, that combined with good AB progression.<br/>\n<br/>\nCon: Cant take Assassin level until level 8, instead of level 5,6, because of cross class skilling skill points into Tumble, Hide, Move Silent, etc.<br/>\n<br/>\nMitigated by a 14 Int, and extra 1 skillpoint per level for being human.<br/>\n<br/>\nShadowdancer: 4/5<br/>\n<br/>\nWhy?<br/>\n<br/>\n1. For Summon Shadow that I can easily buff up good.<br/>\n<br/>\n2. For HIPS early<br/>\n<br/>\n3. For Shadow Evade<br/>\n<br/>\n4. For Defensive Roll.<br/>\n<br/>\nAssassin 23/24/25/26<br/>\n<br/>\nWhy?<br/>\n<br/>\n1. Coolness<br/>\n<br/>\n2. Death Attack<br/>\n<br/>\n3. Poison use<br/>\n<br/>\n4. All the other cool Assassin special abilities that synergize with, and make use of the cleric, shadowdancer abilities.<br/>\n<br/>\nStats:<br/>\n<br/>\nStr 10<br/>\n<br/>\nDex 17(18 at 4th level)<br/>\n<br/>\nCon 10<br/>\n<br/>\nInt 14<br/>\n<br/>\nWis 13(14 at 8th lev, for 4th lev cleric spells at 8th lev)<br/>\n<br/>\nLevel: 3<br/>\n<br/>\nHp: 24<br/>\n<br/>\nBAB: 2<br/>\n<br/>\nAB: 5+ depending on buffs, gear.<br/>\n<br/>\nAC: Naked: 13/14+(lev 4), depending on buffs. Chainshirt + Large Shield: 20/22+ depending on buffs/23+: Amulet of Nat Armor +1+ bluffs.<br/>\n<br/>\nFeats:<br/>\n<br/>\nDodge, Mobility(Extra Human feat) Weapon Finesse(3rd level)<br/>\n<br/>\nSkills:<br/>\n<br/>\n1st level:<br/>\n<br/>\nConcentration: 4 ranks<br/>\n<br/>\nSpellcraft: 4 ranks<br/>\n<br/>\nTumble 2(Cross Class(Shadowdancer, Assassin)<br/>\n<br/>\nHide 2<br/>\n<br/>\nMove Silently 2<br/>\n<br/>\nCurrent:<br/>\n<br/>\nConcentration 5<br/>\n<br/>\nSpellcraft 5<br/>\n<br/>\nHeal: 1 or 2(just for stabilizing, using healing med kits)<br/>\n<br/>\nHide:3<br/>\n<br/>\nMove Silently: 3<br/>\n<br/>\nLevel Progression:<br/>\n<br/>\nLevel 4:<br/>\n<br/>\nCleric<br/>\n<br/>\n+1 Dex(18),  Concentration Rank 5, Spell Craft Rank 5, Hide 4, Move Silently 4, Tumble 4 bank any left over points<br/>\n<br/>\nLevel 5:<br/>\n<br/>\nCleric<br/>\n<br/>\nConcentration rank 5, Spellcraft 5, Hide 5, Move Silently 5, Tumble 5, bank unused points<br/>\n<br/>\nLev 6:<br/>\n<br/>\nCleric<br/>\n<br/>\nFeat: Choices: Combat Casting, Expertise, Knockdown, Blind Fight.<br/>\n<br/>\nEither Expertise or Knockdown, leaning towards Expertise<br/>\n<br/>\nSkills:<br/>\n<br/>\nHide 6, Move Silently 6, Tumble 5(temporarily stopping at 5 because thats the minimum for SD, Assassin. Also it cost 2 to get 1 as cross class. Will resume once start taking SD, Assassin Levels to take, spend as a class skill) Concentration 5, Spellcraft 5, bank unused points<br/>\n<br/>\nLev 7<br/>\n<br/>\nHide 7, Move Silently 7, Tumble 5, Concentration 6, Spell Craft 5<br/>\n<br/>\nLev 8.<br/>\n<br/>\n+1 Wis(14)(for 4th level Cleric Spells)<br/>\n<br/>\nHide 8, Move Silently 8, Tumble 5, Spell Craft 5, Concentration 7.<br/>\n<br/>\nLevel 9:<br/>\n<br/>\nAssassin Lev 1<br/>\n<br/>\nFeat: Choices: Combat Casting, Knockdown, Extend, Blind Fight<br/>\n<br/>\nLeaning towards Knockdown.<br/>\n<br/>\nKnockdown<br/>\n<br/>\nClass Abilities: Poison Use, Death Attack 1D6<br/>\n<br/>\nSkills:<br/>\n<br/>\n6 + 2(int mod) = 8<br/>\n<br/>\nHide 9, Move Silently 10 or Move Silently 9, Hide 10(whatever minimum for SD next level for HIPS next level), Disable Device 1,2, Open Lock 1,2, Use Magic Device 2,3<br/>\n<br/>\nLevel 10<br/>\n<br/>\nShadowdancer lev 1<br/>\n<br/>\nHIPS<br/>\n<br/>\nSkills<br/>\n<br/>\n6 +2(int mod)=8<br/>\n<br/>\nHide 10, Move Silently 10, Use Magic Device 3, Disable Device 2, Open Lock 2, Search 2, Listen or Spot 2<br/>\n<br/>\nLev 11<br/>\n<br/>\nAssassin Lev 2<br/>\n<br/>\nPoison Save<br/>\n<br/>\nGhostly Visage<br/>\n<br/>\nHide 11, Move Silently 10, Use Magic Device 3, Disable Device 4, Open Lock 3, Search 4, Listen or Spot 3, <br/>\n<br/>\nLev 12<br/>\n<br/>\nShadowdancer 2<br/>\n<br/>\n+1 Wisdom(15)(For getting 5th lev Cleric Spells before lev 16<br/>\n<br/>\nFeat Choices: Improved Crit Rapier, Weapon Focus Rapier, Improved Knockdown<br/>\n<br/>\nImproved Crit Rapier<br/>\n<br/>\nSkills<br/>\n<br/>\nHide 11, Move Silently 11 Use Magic Device 5, Disable Device 5, Open Lock 5, Search 5, Tumble 5, Listen or Spot 5<br/>\n<br/>\nLev 13<br/>\n<br/>\nAssassin 3<br/>\n<br/>\nHide 12, Listen 11, Tumble 10(Skill Dump +5), Disable Device 6, Search 6, Open Lock 5, Listen or Spot 5, Use Magic Device 5.<br/>\n<br/>\nLevel 14<br/>\n<br/>\nCleric 9<br/>\n<br/>\n5th lev Spells.<br/>\n<br/>\nSkills<br/>\n<br/>\n5 points<br/>\n<br/>\nConcentration 10(Skill Dump)<br/>\n<br/>\nLev 15<br/>\n<br/>\nCleric 10<br/>\n<br/>\nFeat choices: IF didnt take Improved Crit, take it here. Otherwise Weapon Focus or Improved Knockdown or Blind Fight.<br/>\n<br/>\nImproved Knockdown.<br/>\n<br/>\nSkills<br/>\n<br/>\nSpellcraft 10(Skill Dump)<br/>\n<br/>\nLev 16:<br/>\n<br/>\nCleric Lev 11.<br/>\n<br/>\n+1 Wis(16 for 6th lev spells)<br/>\n<br/>\nSkills<br/>\n<br/>\nConcentration 13, Spellcraft 13<br/>\n<br/>\nMight probably be last Cleric Level.<br/>\n<br/>\nLevel 17<br/>\n<br/>\nSD 3<br/>\n<br/>\nDisable Device 10, Search 10<br/>\n<br/>\nLevel 18<br/>\n<br/>\nAssassin 4<br/>\n<br/>\nFeat Choices<br/>\n<br/>\nWeapon Focus Rapier, Combat Casting, Extend, Blind Fight.<br/>\n<br/>\nExtend<br/>\n<br/>\nSkills<br/>\n<br/>\nUse Magic Device 10, Open Lock 10<br/>\n<br/>\nLev 19<br/>\n<br/>\nSD 4<br/>\n<br/>\nSkills<br/>\n<br/>\nTumble 15, Listen or Spot 10<br/>\n<br/>\nLevel 20<br/>\n<br/>\nDex +1(19)<br/>\n<br/>\nStart putting 1, or 2 points into each of skills, each level or every other level at worst.<br/>\n<br/>\nPrimary Skills should be about 25, 30, 35 by  lev 40<br/>\n<br/>\nSecondary skills should be about 20, 25, 30 by level 40.<br/>\n<br/>\nThird category of skills should be about 15, 20, 25 by lev 40.<br/>\n<br/>\n4th category of skills should be about 5, 10, 15 by level 40<br/>\n<br/>\n5th category of skills should be about 3 to 5 to 7 by lev 40 <br/>\n<br/>\nPrimary Skiils: 25, 30, 35 by lev 40<br/>\n<br/>\nHide, Move Silently, Disable Device, Tumble<br/>\n<br/>\nSecondary Skills: 20, 25, 30 by lev 40<br/>\n<br/>\nDisable Device, Open Lock, Search, Concentration, Use Magic Device, Spell Craft<br/>\n<br/>\nThird Type of Skills: 15, 20, 25 by lev 40<br/>\n<br/>\nSearch, Use Magic Device, Spell Craft, Listen or Spot<br/>\n<br/>\n4th type of Skills, about 7 to 12 to 17<br/>\n<br/>\nListen or Spot, Heal<br/>\n<br/>\n5th type of Skills, about 3 to 5 to 7 to 9 by level 40<br/>\n<br/>\nHeal<br/>\n<br/>\nLevel 21<br/>\n<br/>\nSD 5<br/>\n<br/>\nEither Blind Fight, or Weapon Focus Rapier<br/>\n<br/>\nLevel 22<br/>\n<br/>\nAssassin levels the rest of way to level 40.<br/>\n<br/>\nLev 24<br/>\n<br/>\nBlind Fight or Weapon Focus Rapier or Epic feat like Great Dex, Armored Skin<br/>\n<br/>\nLev 27<br/>\n<br/>\nGreat Dex or Armored Skin or Epic Weapon Focus Rapier, or Improved Expertise, or Combat Casting, or Epic Prowess<br/>\n<br/>\nSame for each feat level rest of way.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nOk I havent been playing for a while due to life.<br/>\n<br/>\nSo because of that, I wasnt able to complete the last unfinished Ranger, Cleric, Assassin build, I posted.<br/>\n<br/>\nSo I came up with this idea, which I think can be the most OPTIMIZED of the X/SD/Assassin builds.<br/>\n<br/>\nMonk/SD/Assassin lacks the spellcasting buffs.<br/>\n<br/>\nBard/SD/Assassin has the spellcasting, bard song buffs, but lacks the ranger/Cleric/monk,/SD/Assassin BAB, AB progression. Ranger has the AB, even spells, but not the right spells, and the spells come later.<br/>\n<br/>\nCleric/SD/Ass, gives good AB, BAB, early spellcasting, GOOD BUFFS.<br/>\n<br/>\nThat combination is probably the best, OPTIMIZED, but it does have the CON of lack of skill points, and cross classing, and not being able to take SD, Assassin until later, instead of earlier at lev 6.<br/>\n<br/>\nFortunately that is mitigated by playing a human, having a 14 int, for extra skill points. Also taking SD, Assassin at levels 9, 10, instead of earlier at lev 6, is not that bad. And taking 8 levs of cleric to start can be good.<br/>\n<br/>\nI took the magic domain, and War domains for the wizardly buffing spells: Mage Armor, Cats Grace, Stoneskin for BEST OVERALL SPELL BUFFING PACKAGE IN THE GAME. <br/>\n<br/>\nThis combination is great at both, going alone, and in a party as a support, healer, trap disabler, lock opener, scout, flanker, artillery(Ice Storm, Melfs Acid Arrow, decent damage spells), Party Buffer, semi back up tank(has decent AB, AC), death attacker, turn undead, etc, great at finding a way to deal with most stuff, good summoning package.<br/>\n<br/>\nPre Epic Split is:<br/>\n<br/>\nCleric 11, /,Shadowdancer 4,/, Assassin 5<br/>\n<br/>\nOverall Split of Cleric 11, SD 5, Assassin 24.<br/>\n<br/>\nWhere I need Help:<br/>\n<br/>\nNeed Help with Epic Feat Selection at what, which Epic levels.<br/>\n<br/>\nOn Arkhalia PW, a balance between Epic Action and non enforced, but semi encouraged roleplay.<br/>\n<br/>\nEquipment goes up to + 8.<br/>\n<br/>\nMust have a minimum AB of 55 to 60 to 65 for non spellcasters, to survive at levels 35 to 40.(what the PW recommends)<br/>\n<br/>\nSo might need help getting to at least 50 AB with this build.<br/>\n<br/>\nAlso I am not the best planner, and not good at putting everything that took at what, which levels, as far as stats, HP, BAB, AB, Saves, AC, Feats, Skills, etc, in a Organized way.<br/>\n<br/>\nSo if someone could help me do that, that sure would be appreciated.<br/>\n<br/>\nAfter I get help, and as I get help, and as I make decisions, and progress the build on Arkhalia PW, I will update this, and try to post a organizing post of this build(again I might need help doing that, and crunching the numbers, etc.<br/>\n<br/>\nThanks for any help.<br/>\n<br/>\nAsturonethoriusaline(Mike for short)</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:48 PM - Feb 10, 2020",
      "content": "<div>Greetings Asturonethoriusaline!<br/>\n<br/>\nUnfortunately I dont know Arkhalia that well but I hope some of the feedback is helpful<br/>\n<br/>\nPlanning: <br/>\n- I recommend having a look at the CBC Excel Spreadsheet (<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/other/tool/characterbuildcalculator-cbc\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... ulator-cbc</a>), I use this to plan my builds, and quite a few here do. I know quite a few of the builders here do it by hand, those builders do have quite an indepth knowledge of the NWN rules. <br/>\n- There is a specific format many of the builders use, it might be good to have a look at that to make it easier to communicate to us if you don't have Microsoft Excel or another program that can use the spreadsheet<br/>\n<br/>\nClass distribution:<br/>\n- Dex Cleric / Shadowdancer / Assassin sounds quite nice. <br/>\n- I suspect Cleric / Shadowdancer / Rogue would be more powerful, as this grants you many more skill points as well as evasion and epic dodge. It all depends if Assassin has been changed much from Vanilla NWN. If it is pretty similar then Rogue will probably be more useful.<br/>\n- I would suggest trying to get to Cleric 15+, spells like Divine Favor, Greater Magic Weapon hit their peak at that level.<br/>\n- SD 5 sounds good<br/>\n- That leaves Rogue/Assassin and how many levels you invest in that depends. In general you will want to stop when you get a bonus feat and/or an odd level, for example Rogue 13 or Rogue 19.<br/>\n<br/>\nPre-Epic:<br/>\n- I would suggest a Cleric 12 / SD 4 / Assassin 4 pre-epic split to maximise the amount of BAB.<br/>\n<br/>\nThat might be enough to get you started for now, if theres anything else specific to work on further let us know. </div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "1:49 PM - Feb 10, 2020",
      "content": "<div><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10759084&amp;sid=fedc0a8446c54a7e96c29ec1a8404083\">Orion2019</a> wrote: <div class=\"responsive-hide\">Feb 10, 2020</div></cite>Greetings Asturonethoriusaline!<br/>\n<br/>\nUnfortunately I dont know Arkhalia that well but I hope some of the feedback is helpful<br/>\n<br/>\nPlanning: <br/>\n- I recommend having a look at the CBC Excel Spreadsheet (<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/other/tool/characterbuildcalculator-cbc\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... ulator-cbc</a>), I use this to plan my builds, and quite a few here do. I know quite a few of the builders here do it by hand, those builders do have quite an indepth knowledge of the NWN rules. <br/>\n- There is a specific format many of the builders use, it might be good to have a look at that to make it easier to communicate to us if you don't have Microsoft Excel or another program that can use the spreadsheet<br/>\n<br/>\nClass distribution:<br/>\n- Dex Cleric / Shadowdancer / Assassin sounds quite nice. <br/>\n- I suspect Cleric / Shadowdancer / Rogue would be more powerful, as this grants you many more skill points as well as evasion and epic dodge. It all depends if Assassin has been changed much from Vanilla NWN. If it is pretty similar then Rogue will probably be more useful.<br/>\n- I would suggest trying to get to Cleric 15+, spells like Divine Favor, Greater Magic Weapon hit their peak at that level.<br/>\n- SD 5 sounds good<br/>\n- That leaves Rogue/Assassin and how many levels you invest in that depends. In general you will want to stop when you get a bonus feat and/or an odd level, for example Rogue 13 or Rogue 19.<br/>\n<br/>\nPre-Epic:<br/>\n- I would suggest a Cleric 12 / SD 4 / Assassin 4 pre-epic split to maximise the amount of BAB.<br/>\n<br/>\nThat might be enough to get you started for now, if theres anything else specific to work on further let us know. </div></blockquote>\n\nThanks Orion for the help, suggestions.<br/>\n<br/>\nAs to why I will go Assassin over rogue:<br/>\n<br/>\nAssassin gets 6 skill points + int mod. Thats ONLY 2 less then rogue.<br/>\n<br/>\nAnd you get Ghostly Visage, Uncanny Dodge, Death Attack.<br/>\n<br/>\nThe death attack paralyzes opponents, except for undead.<br/>\n<br/>\nThe plan is to use Hide in Plain Site(HIPS), and Ghostly Visage, Shadow Evade to sneak up to foes, hit them with say a 5 to 20 D6 Death Attack that 1. Does about 50 to 100 to 150 damage, then with a high Death Attack DC, they get paralyzed, where you can either disengage, HIPS, then Death attack them again, paralyze them again, do another 50 to 100 to 150 to 200 damage. Rinae, Repeat over and over. Or you can just finish them off after the first, second death attack paralyzation.<br/>\n<br/>\nAnd if the paralyzation doesnt work, you still can HIPS, get at least the sneak attack damage.<br/>\n<br/>\nAnd you can use poison, to inlict stat damage to weaken their str, con, dex, AB, AC, etc.<br/>\n<br/>\nAbout the only thing Assassin may not get is Evasion. Assassins may or may not get it, I dint know.<br/>\n<br/>\nBut even if dont get Evasion, toon has high Dex save to evade anyways, an or the toon can just kill or paralyze the source that would seem to make Evasion seem like it necessary. And the toon can disable traps, making Evasion less needed.<br/>\n<br/>\nI think trading Evasion for Death Attack, Ghostly Visage, Poison use, etc, is a FAIR trade off.<br/>\n<br/>\nAs to the splits, if going to go with Assassin, the death attack DC needs to be as high as possible. <br/>\n<br/>\nA Assassin needs to have at least about 22,23,24 levels at minimum.<br/>\n<br/>\nA Cleric 11/ SD 5, Assassin 24, accomplishes that. Also there are Assassin Specific either abilities or Epic Feats, etc, that a Assassin only gets at about level 22,23,24.<br/>\n<br/>\nMick Dagger a credible poster here is kind of a expert at, on Assassins, and he recommends an Assassin level minimum of about 22,23,24, and as high as go up to level 30 depend on if there is room, IF the Assassin part is the Primary of the toon.<br/>\n<br/>\nWhy Cleric 11? Because Cleric 11 is the ABSOLUTE MINIMUM level for, to get 6th level spells like Blade Barrier, and Absolute mininum for buffs according to experts here is about level 11,12, if Cleric is NOT your primary, and is instead your secondary or third.<br/>\n<br/>\nAlso Cleric Level 11 lets me mazimize Assassin as much as possible at level 24..<br/>\n<br/>\nIf I go Cleric Level 15/SD 5, that would only allow 20 levels of Assassin, which would probably not be enough Assassin levels.<br/>\n<br/>\nIf going to take only 20 levels or less, your right that Rogue would probably be better then Assassin.<br/>\n<br/>\nYeah a Cleric 11/ SD 4/Assassin 5 is semi sub optimal for Pre Epic, for Post Epic BAB, AB, but that is only about 1,2,3, about + or - 1 point, difference to BAB, AB, and thats not that bad.<br/>\n<br/>\nHowever, if Assassin can get its special things by, on Assassin level 23, instead of level 24, then that would leave enough room for a Cleric 12/SD 5/Assassin 23 post Epic, and a 12/4/4 pre epic split. I might need Mick Dagger's or others help here on that.<br/>\n<br/>\nNow if go with Rogue, instead of Assassin, then a Cleric 15/SD 5/Rogue 20, would work just fine.<br/>\n<br/>\nAlso I think that Cleric/SD/Assassin build can also take epic dodge, BUT they just have to take the right feats to qualify. At least thats what I remember reading in the WIKI, but I could be wrong there.<br/>\n<br/>\nWhere I need the most help is which epic feats to get and when to take them.<br/>\n<br/>\nThanks.<br/>\n<br/>\nMike.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "2:21 PM - Feb 10, 2020",
      "content": "<div>Also I am using a LG K20 32 GB(128 gb SD card), Android, Qualcomm, Snapdragon Smart Phone to play this game on.<br/>\n<br/>\nAs such, I dont have the ability to use, do a microsoft excel spreadsheat, to do a organization of the toon info, using the link that Orion posted.<br/>\n<br/>\nSo if anybody knows of a work around for dealing with that, posting a organized version of the toon here using my Smart Phone, that sure would be appreciated.<br/>\n<br/>\nThanks.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:25 PM - Feb 10, 2020",
      "content": "<div>If you want to go assassin heavy, can a Cleric 8 SD 4 Assassin 8 pre-epic split work for what you need? <br/>\nYou will get an extra BAB than C11/SD4/Assassin5<br/>\nThen get Cleric 11 in epic levels, and added side effect of late spellcraft dumps for saves vs spells.<br/>\n<br/>\nEpic Feats I believe are straight forward in your case.<br/>\n<br/>\nThese would be feats like:<br/>\n- AB boosts (Epic Weapon Focus, Epic Prowess, Great Dexterity Feats)<br/>\n- Stealth feats (Epic Skill Focus: Hide, Epic Skill Focus: Move Silently)<br/>\n- Feats to boost saves, ones that may be attractive would be Epic Fortitude or Epic Will<br/>\n- Armor skin is nice to boost AC. <br/>\n<br/>\nThere are lots of choices and some you may prioritise over others. As to what to pick, I would need to know the ending HP / AB / Saves /Skill ranks before I can be more specific. The CBC can assist you with giving you this information very rapidly and reasonably accurately.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:40 PM - Feb 10, 2020",
      "content": "<div>Actually I wonder if your build is possible,<br/>\nThis is because the requirements for Assassin include Hide/Move Silently 8<br/>\nSD requirements include Hide 10/MS 8.<br/>\n<br/>\nCleric does not have Hide or Move Silently has class skills.<br/>\nThe earliest you can get Hide/Move Silently 8 is level 14 as a result in normal NWN by crossclassing those skills.<br/>\n<br/>\nThis is unless Arkhalia has some other modifications for example giving Cleric these skills as class skills, or lowering the requirements to qualify for assassin/SD.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "3:00 PM - Feb 10, 2020",
      "content": "<div>No your probably right then. I miscalculated. I thought that the earliest, that could take Assassin was level 9.<br/>\n<br/>\nThats because at level 3, my Hide, etc is at 3, so I think I assumed class crossing would give me 1 rank point per level, instead of being able to put more then that in per level, after starting out at 2, instead of 4.<br/>\n<br/>\nSo I figured I would reach Hide, etc, 8, by, on lev 8, then be able to take assassin lev 9.<br/>\n<br/>\nSo I would have to go cleric for 1st 14 levels, then take Assassin lev 1 at lev 15.<br/>\n<br/>\nMy split would have to be Cleric 14/SD 2/Assassin 4, as Pre Epic Split.<br/>\n<br/>\nAnd Cleric 14/SD 4(sac Defensive Roll that get at SD 5)/Assassin 22.<br/>\n<br/>\nI hope thats wrong, because I sure like your idea of Cleric 8/SD 4/Assassin 8 as Pre Epic Split, and Cleric 11/SD 5/Assassin 24 post Epic.<br/>\n<br/>\nThanks for the heads up on, about that.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:04 PM - Feb 10, 2020",
      "content": "<div>A cleric / rogue / SD build is still in the offering, if that is still of interest to you</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "3:26 PM - Feb 10, 2020",
      "content": "<div>Question, what are the druid buff spells like?<br/>\n<br/>\nAlso does Druid get Hide, Move Silently as class skills?<br/>\n<br/>\nAlso with a druid, can you choose domains, like Cleric?<br/>\n<br/>\nNo to the Cleric, SD, Rogue<br/>\n<br/>\nEither Cleric, SD, Assassin<br/>\n<br/>\nOr Druid, SD, Assassin<br/>\n<br/>\nOr Ranger, SD, Assassin<br/>\n<br/>\nOr Bard, SD, Assassin<br/>\n<br/>\nOr Monk, SD, Assassin.<br/>\n<br/>\nReally want Cleric, SD, Assassin to work.<br/>\n<br/>\nBut if not then if Druid, SD, Assassin is workable, like unto the cleric, SD, Assassin, then that would be ok.<br/>\n<br/>\nBut if that not workable then<br/>\n<br/>\nRanger, SD, Assassin.<br/>\n<br/>\nSo for now, either Cleric, SD, Assassin<br/>\n<br/>\nOr<br/>\n<br/>\nDruid, SD, Assassin(But only IF the spell buffs are good, and only if have hide, move silently as class skills, and dont have to cross class. Also druid gets 4 skill points + int mod, which is pretty good.)</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "4:27 PM - Feb 10, 2020",
      "content": "<div>With Cleric there are better options than Assassin.<br/>\nDex based Cleric/SD/Rogue and Cleric/SD/Monk can get Epic dodge. Cleric/SD/Assassin <em>can</em> also get ED, but only if you take 10 levels of SD, and that leaves little room for Assassin.<br/>\nMy recommendations are Cleric 26/ Rogue 13/ SD 1 or Cleric 26/ Monk 9/ SD 5.<br/>\n<br/>\nIf you are bent on Assassin for the Death attack paralysis, beware that it has been nerfed with NWN EE. <br/>\nIf you still want Assassin, Monk 9/ SD 5/ As 26 and Rogue 13/ SD 1/ As 26 are solid Assassin builds with ED.<br/>\nIf you still want Cleric for the buffs, remember that you have to cross-class the stealth skills and will need 13 levels of Cleric before you can pick Assassin. <br/>\nI would suggest the following class split; Cleric 15/ Assassin 24/ SD 1, where SD is there for HIPS and nothing more.<br/>\nIf you stop at Cleric 13, 14 or 15 pre epic, your best BAB at lvl 20 will be 14. You cannot stop at Cleric 12 because you need Cleric 13 before you can go with Assassin and you don't want Cleric 16 if you are serious about improving the Death attack DC.<br/>\n<br/>\nI am not saying that Cleric/Assassin is a bad idea, after all it is a Cleric build, but there are better Cleric builds and there are better Assassin builds.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "4:34 PM - Feb 10, 2020",
      "content": "<div>Ok I looked at the Wiki again. Just so you know Orion, Shadowdancers get Evasion at level 3, so if you go with SD/Assassin, instead of SD/Rogue, you will still get Evasion.<br/>\n<br/>\nEpic Dodge, still not sure about if can get it or not.<br/>\n<br/>\nDruid has to cross class into SD/Assassin, same as Cleric.<br/>\n<br/>\nAnd the buffs are not as good as the Cleric.<br/>\n<br/>\nAlso according to the Wiki the absolute minimum level for the epic Assassin Bonus ability, and epic bonus feat, is lev 22.<br/>\n<br/>\nSo a pre epic split of Cleric of 14/SD 2(3 if get Evasion before lev 20), Assassin 4(3, if going to go SD 3, and get Evasion before lev 20.)<br/>\n<br/>\nAnd a Cleric 14/SD 4/Assassin 22, would still just barely be optimal, viable.<br/>\n<br/>\nThe only problem is do I have the patience to wait 14 levels, and not be able to take Assassin until  level 15.<br/>\n<br/>\nNot sure.<br/>\n<br/>\nThinking of just going with:<br/>\n<br/>\nRanger 9(Spells, Animal Companion, Summoning, Some Buffing Spells, Improved 2 weapon fighting, Favored Enemy, Good BAB, AB, HP, Skill points, Hide, etc.<br/>\n<br/>\nShadowdancer 5(HIPS, Shadow Evade, Evasion, Defensive Roll, Shadow companion)<br/>\n<br/>\nAssassin 26(Poison use, save, Death Attack, Darkness, Ghostly Visage, Invisibility, Uncanny Dodge, high death attack DC, Epic Assassin, 2 Epic Assassin Abilities, 2 Epic Assassin Bonus Feats at level 22 and level 26<br/>\n<br/>\nHigher Dex, can take Weapon Finesse at level 1, instead of level 3. Dont have to wait until level 15 to take Assassin.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "4:54 PM - Feb 10, 2020",
      "content": "<div>Ok I looked at the Wiki again. Just so you know Orion, Shadowdancers get Evasion at level 3, so if you go with SD/Assassin, instead of SD/Rogue, you will still get Evasion.<br/>\n<br/>\nEpic Dodge, still not sure about if can get it or not.<br/>\n<br/>\nDruid has to cross class into SD/Assassin, same as Cleric.<br/>\n<br/>\nAnd the buffs are not as good as the Cleric.<br/>\n<br/>\nAlso according to the Wiki the absolute minimum level for the epic Assassin Bonus ability, and epic bonus feat, is lev 22.<br/>\n<br/>\nSo a pre epic split of Cleric of 14/SD 2(3 if get Evasion before lev 20), Assassin 4(3, if going to go SD 3, and get Evasion before lev 20.)<br/>\n<br/>\nAnd a Cleric 14/SD 4/Assassin 22, would still just barely be optimal, viable.<br/>\n<br/>\nThe only problem is do I have the patience to wait 14 levels, and not be able to take Assassin until  level 15.<br/>\n<br/>\nNot sure.<br/>\n<br/>\nThinking of just going with:<br/>\n<br/>\nRanger 9(Spells, Animal Companion, Summoning, Some Buffing Spells, Improved 2 weapon fighting, Favored Enemy, Good BAB, AB, HP, Skill points, Hide, etc.<br/>\n<br/>\nShadowdancer 5(HIPS, Shadow Evade, Evasion, Defensive Roll, Shadow companion)<br/>\n<br/>\nAssassin 26(Poison use, save, Death Attack, Darkness, Ghostly Visage, Invisibility, Uncanny Dodge, high death attack DC, Epic Assassin, 2 Epic Assassin Abilities, 2 Epic Assassin Bonus Feats at level 22 and level 26<br/>\n<br/>\nHigher Dex, can take Weapon Finesse at level 1, instead of level 3. Dont have to wait until level 15 to take Assassin.<br/>\n<br/>\nAlso just saw Mick Dagger's post.<br/>\n<br/>\nYet another reason to scrap the Cleric/SD/Assassin idea.<br/>\n<br/>\nBack to the drawing board.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "5:43 PM - Feb 10, 2020",
      "content": "<div>As has already been noted here, with the EE Death Attack changes a rogue is better than an assassin in almost all ways. For example, a Rog13/Cler26/SD1 would work better than a Cler/Ass/SD and would be able to pick up Epic Dodge while keeping undispellable cleric buffs. If you're sticking with Cler/Ass/SD then a Cler15/Ass23/SD2 gets +20 AB from cleric buffs, level 8 cleric spells, HiPS, and Evasion. You will be constantly managing your buffs due to the low duration but it could work for you, depending on what you want from the build. Cler14/Ass4/SD2 is the best pre-epic spread, which you have already pointed out in one of your earlier posts.<br/>\n<br/>\nFor high assassin builds that also get Epic Dodge I would recommend a Monk9/Ass26/SD5, Rang7/Ass23/SD10, Rang9/Ass21/SD10, or Rog13/Ass26/SD1.<br/>\n<br/>\nDruids can get up to +24Hide/+4MS from buffs, not including Vine Mine and the +4 Hide/MS bonus from being outside. However for AB buffs, which an assassin heavy build will definitely want, you will need to be a Cleric.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "4:06 AM - Feb 12, 2020",
      "content": "<div>Thanks for all the help comments. As Yunim has said a Assassin heavy build with lots of levels CRYS out for AB, AC, Buffs to AB, AC.<br/>\n<br/>\nAnd a cleric with the Magic, War Domains would be the BEST at doing that.<br/>\n<br/>\nThe problem is that going Cleric, SD, Ass, is NOT Optimally viable, doable, and is only doable if go with a Cleric 14/SD2/Ass 4, pre epic split, and Cleric 14,15/SD 2,4/Ass 22,23, and cant take Assassin until 14,15th lev.<br/>\n<br/>\nSo I went back to the drawing board.<br/>\n<br/>\nIn doing so I found out that Assassin on Arkhalia gets HIPS at 8th level, which is a game changer.<br/>\n<br/>\nAs nice as Shadowdancer is, its now not as necessary because can use Monk, Assassin, to get Evasion, HIPS.<br/>\n<br/>\nBecause of that can now go Monk/Cleric/Ass.<br/>\n<br/>\nNow doing that on any other PW, without SD, would cause no HIPS, but on Arkhalia, 6 levels of monk, gives cleave, Evasion, Knockdown, Improved Knockdown(No need to spend valuable feat slots on them), makes it so that can take assassin at 6th lev. 12 levels of Cleric provides 6th lev spells, buffs, 22 levels of Assassin.<br/>\n<br/>\nOnly thing that miss out on is: Shadow Evade, Summon Shadow Companion, Defensive Roll, Epic Dodge.<br/>\n<br/>\nBut for giving up those things, for what get, thats a fair trade off in my book.<br/>\n<br/>\nSo thats what I am going to do.<br/>\n<br/>\nGona post that build in another thread, and welcome help with that build.<br/>\n<br/>\nThanks for the help here.</div>"
    }
  ]
}