{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "414",
  "name": "Casting Bard",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/casting-bard-t2328542.html",
  "author": "Tyris2222",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "561",
  "posts": [
    {
      "author": "Tyris2222",
      "avatar": "no_avatar.png",
      "timestamp": "4:33 PM - Apr 11, 2013",
      "content": "<div>Would like help with Casting bard with very good song\\perform skills.  This would be a 30 level build. Non-evil.  Could have a mix of Rogue\\Fighter\\Dragon\\AA as a secondary class, if recommended.  Possible weapon would be Katana if can afford the exotic feat, but this can go if it hinders other priorities. Maybe dex based as to not wearing armor?<br/>\n<br/>\nPriorities<br/>\n1. Bard Song\\Curse Song<br/>\n2. Offensive Casting<br/>\n3. Archery\\Melee Presence<br/>\n<br/>\nProbably Human, this is subrace that is applied after creation.<br/>\n<br/>\nDurpari<br/>\n<br/>\nThe Durpari are the relatively short, dark-skinned inhabitants of Durpar, Estagund, Veldorn, and Var the Golden. They are considered skilled traders and are a warm and friendly people. The Durpari have dwelt along the shores of the Golden Water since before the rise of the Imaskari empire. The fall of Imaskar precipitated the fall of the Durpari kingdoms and two millennia of barbarism. During this period, the Mulan of Mulhorand often slaughtered or enslaved the Durpari tribes. In –623 DR, the first Durpari kingdoms after the fall of Imaskar arose along the shores of the Golden Water, as Mulan influence over the region ebbed in the face of the burgeoning threat from Narfell and Raumathar. With the exception of Estagund, which was briefly conquered by the armies of Dambrath during the reign of Reinhar I in 551 DR, the Durpari have remained independent ever since, trading among themselves and with their neighbors.<br/>\n<br/>\nThe Durpari speak a language of the same name—derived from a mixture of Draconic, Mulhorandi, and Rauric—and employ the Thorass alphabet brought back from the west.<br/>\n<br/>\nThe Durpari venerate a small pantheon of deities known collectively as the Adama, and thought to include Selûne, Oghma, Gond, Torm, and Waukeen.<br/>\n<br/>\nCredit: The Forgotten Realms Wiki.<br/>\n<br/>\nRacial traits: +2 Charisma, -1 Strength, -1 Constitution, Bonus Feat: Artist<br/>\nFavored Class: Bard<br/>\n<br/>\nAny help greatly appreciated.</div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "5:58 AM - Apr 14, 2013",
      "content": "<div>Are those racial modifiers built in to the 2da (the score is displayed white) or are they bonuses/penalties on the skin (score shows green/red).  In the former case it would make qualifying for feats harder with the strength/constitution penalties.  If the latter than the charisma bonus wouldn't count toward taking feats.<br/>\n<br/>\nThat said, I would recommend a large number of levels of bard (solely to improve spells, especially wounding whispers).  If you schedule the 20th bard level on a general feat you can even take lasting inspiration.  Bard 20/RDD 10 (take 12 bard/ 8 RDD pre-epic) is a simple build that carries this out while qualifying for devasting critical to boost a melee presence.  For a ranged presence try 20 bard/1 cleric/9 AA, this one is slightly feat starved but uses charisma for divine might/shield as well as the song and spells, and dexterity for AC and AB.  There is no uncanny dodge  with either, though.</div>"
    },
    {
      "author": "Tyris2222",
      "avatar": "no_avatar.png",
      "timestamp": "4:09 PM - Apr 15, 2013",
      "content": "<div>They are built in, after login, so are white.  Would you mess with enchantment focuses?  Or any feats to get perform higher?</div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "9:39 PM - Apr 16, 2013",
      "content": "<div>Bards tend to have low DCs anyway so a focus tends not to matter.  For perform you already can, from ranks and charisma modifier alone, have enough for a level 19 song.  The level 20 song is not worth the effort (it is additionally one skill point bonus to each skill and 2 HP).  Thing is, without any feat investment, when you use the level 19 bard song on yourself alone, you can then return to your party and your perform would be high enough to give them the level 20 song, (or your enemies the level 20 curse song).</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "12:01 AM - Apr 17, 2013",
      "content": "<div>To add, the bard has very few offensive spells to begin with (Ice Storm, a few mind spells), so they are barely passable as an \"offensive\" caster.  <br/>\n<br/>\nAlso, to re-iterate what others have said, once you get the +5AC/-5AC from lvl 16 Bard/Curse song, the rest generally isn't worth getting.  I've only found the need to get perform skill focuses on servers that have modified bard song or added bard items that need perform &gt;43+CHA.</div>"
    },
    {
      "author": "Tyris2222",
      "avatar": "no_avatar.png",
      "timestamp": "3:15 PM - Apr 17, 2013",
      "content": "<div><blockquote><div><strong>Dante2377 wrote:</strong>To add, the bard has very few offensive spells to begin with (Ice Storm, a few mind spells), so they are barely passable as an \"offensive\" caster.  <br/>\n<br/>\nAlso, to re-iterate what others have said, once you get the +5AC/-5AC from lvl 16 Bard/Curse song, the rest generally isn't worth getting.  I've only found the need to get perform skill focuses on servers that have modified bard song or added bard items that need perform &gt;43+CHA.</div></blockquote>\n<br/>\nYes, offensive with regards to mass destruction is minimal, the enchantment school has Hold &amp; Charm  both person and monster so would be more of a crowd control issue, probably more effective early when spell resistance is not an issue.  Maybe better to not worry about that and use feats for more of a melee presence?</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "7:43 PM - Apr 17, 2013",
      "content": "<div>I've always found a Bard (i.e. someone who is primarily a Bard, not something else with a few levels of bard thrown in for skill dumps or a prestige class pre-req) most effective as a buffer (both self and party) and meleer, since your lvl 16+ bard/curse song is effectively adding +7 AB and AC (assuming you weren't near ab and dodge caps) as well as a mean wounding whispers and 50% conceal with Imp Invis and Displacement (which only has verbal component, so can be recast in armor/shield mid-battle).<br/>\n<br/>\nBut part of that might also be my preferred play-style..</div>"
    }
  ]
}