{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "196",
  "name": "Crimson Nun of Pain (Monk 20 / Ranger 10 / CoT 10)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/crimson-nun-of-pain-monk-20-ranger-10-cot-10-t2354449.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "27",
  "views": "9.4K",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:52 PM - Jun 14, 2015",
      "content": "<div>This little darling started from a simple request in the Unfinalized Buils section, and the collected wisdom of Empyre, Mick, Max and Valerfor have turned it into something I, if not they, am pleased to present to the Guild. I would not like to dismiss the influence of <strong>Tyr Templar's Green Beret </strong>(STR version), which can be found in the legacy archives (Monk 16 / Ranger 10 / CoT 14).<br/>\n<br/>\n Her build and mine differ in several aspects, hence the viability of posting this one. While 'tis true that Tyr's build has +1AB in dual-wield and another WF in Unarmed, this dear lady achieves Empty Body and Perfect Self, together with +3AC, 10% higher speed and increased Stunning Attacks and FoBs - let alone being immune to mind effects of spells. I also lose a tad on saves, but gain +4 SR and achieve DR of 20/+1. I also gain Expertise and Armour Skin, as well as the Knockdown twins being taken pre-epic. This is not to say this is a better build, merely one that can live long enough to reach epic levels, let alone enjoy their journey there. As ever, with me, this is about getting to level 40, not so much what you do when you're there ('cause if you don't know by then, you're playing the wrong game).<br/>\n<br/>\n I've done bits of editing here and there, but , if nothing else, I hope the discussion about the build is helpful for relative newbies. Essentially, this is the full story of her development...<br/>\n<br/>\n Bet the name made you look, though!<br/>\n ---------------------------------------------------------<br/>\n<br/>\n Hello All, only me pestering everyone again. This time it's about my favourite single class - the Monk. I'm aware that I haven't played one for way too long (big hat-tip to Empyre for his Order of the Wyrm and Valerfor for the Ultimate Iron Fist, btw), and I thought I'd try to build my own with a bit of a twist, so I reckoned I'd bounce the concept around you guys before I go and make a hash of it.<br/>\n<br/>\n My thinking was actually triggered by considering the implications of the dual-wield/improved 2 weapon fighting Ranger feats (ie, only when in light armour) and how to counter the downside of that. Then it struck me that Monk AC improves as a matter of course, as well as getting the Evasions for free, so how about a Monk-Ranger? Then I thought, if I'm weaponising the character, how about some Fighter, so I can specialise?<br/>\n<br/>\n So, where I'm currently at is 9 or 10 levels of Ranger, 5 or 6 of Fighter and the rest in Monk (wouldn't a female one be a Nun?). Does this sound reasonable? And, if it does, and given that I'll be dual-wielding, does it have to be Kama, or could I use shortswords without penalty? Oh, and I'm looking to make the character human.<br/>\n<br/>\n Thanks in advance<br/>\n<br/>\n<strong><em>EDIT</em></strong> - Oh, sorry, one more thing, and it's about WIS. I'm a little stumped: if WIS is supposed to give great benefits to the Monk AC, why do I see a stat of 8 in Valerfor's Iron Fist (DEX of 12)? Admittedly, his Grand Master of Flowers has 14 (ditto for DEX), but Empyre's two Order of the Wyrm builds have WIS 10 (Kama build) and 8 (Unarmed), both with 14 DEX, which further throws me! I see that Valerfor's Shock Trooper has 14 for both WIS and DEX, but then I noticed all 3 of Big V's builds are Half-Orcs, so I don't know what I can apply from any of them. I know that WIS would help with Ranger spells, but as I'm not looking to cast any, the point is moot at best. As ever, I'm looking at a STR-based build, so DEX would really only be for AC purposes, much as WIS would be, so I'm baffled as to which I should boost.<br/>\n<br/>\n I'm very, very confused, so any guidance would be appreciated!<br/>\n<br/>\n<strong>CRIMSON NUN OF PAIN (Monk 20 / Ranger 10 / Champion of Torm 10)</strong><br/>\n<br/>\n Human - Female (the name's a clue) - Lawful, Good or Neutral<br/>\n Level 1-40, PvM<br/>\n<br/>\n STR 17 (34)<br/>\n DEX 10<br/>\n CON 12<br/>\n INT 13<br/>\n WIS 14<br/>\n CHA 8<br/>\n<br/>\n Hit Points: 440<br/>\n Saves: Fortitude 35, Reflex 28, Will 26<br/>\n Immune to disease, poison, mind-affecting spells<br/>\n SR 30, DR 20/+1, Speed +60%<br/>\n AC: naked - 26; f/plate - 20; f/plate + t/shield - 23<br/>\n<strong><span style=\"color:#FF0000\">AC, medium armor: 10 + 8tum +2AS +5arm = 25 (28 w/tower)<br/>\n [Note: None of the classes in this combo qualify for any heavier than medium armor.  Wearing armor with/without shield will neutralize monk speed, WIS AC, monk AC and monk attack progression (-3BAB)  for both 1H+DW even while using monk weaponry.]</span></strong><br/>\n<br/>\n Skill Points: 238. Concentration 26 (27), Discipline 43 (55), Hide 43 (43), Listen 43 (45), Move Silently 43 (43), Tumble 40 (40)<br/>\n<br/>\n BAB: 28<br/>\n AB (max): 44 melee, 29 ranged; (dual-wielding Kamas): +42/+39/+36/+33/+30/+27 (main hand) +42/+37 (off hand)<br/>\n DevCrit AB: 42 (I think, given 10+50%cha level+STR modifier)<br/>\n Damage (Kama): 1d6+12/19-20x2<br/>\n<br/>\n Levelling Guide<br/>\n<br/>\n 1. Ranger 1 - Luck of Heroes / Expertise / (Dual-Wield / Favoured Enemy I / Trackless Step)<br/>\n 2. Ranger 2<br/>\n 3. Ranger 3 - Blind Fight<br/>\n 4. Ranger 4 - STR+1 (18)<br/>\n 5. Ranger 5 - (Favoured Enemy II)<br/>\n 6. Ranger 6 - Power Attack / (Animal Companion)<br/>\n 7. Monk 1 - (AC Bonus / Cleave / Evasion / Flurry of Blows / Improved Unarmed Strike / Stunning Fist)<br/>\n 8. Ranger 7 - STR+1 (19)<br/>\n 9. Ranger 8 - Weapon Focus: Kama<br/>\n 10. Ranger 9 - (Improved 2-Weapon Fighting)<br/>\n 11. Monk 2 - (Deflect Arrows)<br/>\n 12. Monk 3 - Improved Critical: Kama / STR+1 (20) / (Monk Speed +10% / Still Mind)<br/>\n 13. Monk 4<br/>\n 14. Monk 5 - (Purity of Body / AC+1)<br/>\n 15. Monk 6 - Toughness / (Knockdown / Improved Knockdown / Speed +20%)<br/>\n 16. CoT 1 - STR+1 (21) / (Lay on Hands)<br/>\n 17. CoT 2 - Great Cleave / (Sacred Defence +1)<br/>\n 18. Monk 7 - Great Fortitude / (Wholeness of Body)<br/>\n 19. CoT 3 - (Smite Evil)<br/>\n 20. Monk 8 - STR+1 (22)<br/>\n 21. CoT 4 - Great Strength I (23) / Epic Weapon Focus: Kama / (Sacred Defence +1)<br/>\n 22. Monk 9 - (Improved Evasion / Speed +30%)<br/>\n 23. CoT 5 - (Divine Wrath +3 5/1)<br/>\n 24. CoT 6 - Great Strength II / Overwhelming Critical: Kama / STR+1 (25) / (Sacred Defence +1)<br/>\n 25. CoT 7<br/>\n 26. CoT 8 - Devastating Critical: Kama / (Sacred Defence +1)<br/>\n 27. Monk 10 - Great Strength III (26) / (AC+1 / Ki Strike 1)<br/>\n 28. Monk 11 - STR+1 (27) / (Diamond Body)<br/>\n 29. Monk 12 - (Diamond Soul / Speed +40%)<br/>\n 30. CoT 9 - Great Strength IV (28)<br/>\n 31. CoT 10 - Armor Skin / (Sacred Defence +1 / Divine Wrath +5 5/1)<br/>\n 32. Monk 13 - STR+1 (29) / (Ki Strike 2)<br/>\n 33. Monk 14 - Great Strength V (30)<br/>\n 34. Monk 15 - (Speed +50% / AC+1 / Quivering Palm)<br/>\n 35. Monk 16 - (Ki Strike 3)<br/>\n 36. Monk 17 - Great Strength VI / STR+1 (32)<br/>\n 37. Monk 18 - (Speed +60% / Empty Body)<br/>\n 38. Monk 19<br/>\n 39. Monk 20 - Great Strength VII (33) / (Perfect Self)<br/>\n 40. Ranger 10 - Epic Prowess / STR+1 (34)<br/>\n<br/>\n Skills Distribution<br/>\n<br/>\n 1. Concentration 4, Discipline 4, Hide 4, Listen 4, Move Silently 4 (Save 4)<br/>\n 2. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 5)<br/>\n 3. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 6)<br/>\n 4. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 7)<br/>\n 5. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 8)<br/>\n 6. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 9)<br/>\n 7. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1, Tumble 10<br/>\n 8. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 1)<br/>\n 9. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 2)<br/>\n 10. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 3)<br/>\n 11. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 4)<br/>\n 12. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1, Tumble 5<br/>\n 13. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 1)<br/>\n 14. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 2)<br/>\n 15. Concentration 1, Discipline 1, Hide 1, Listen 1, Move Silently 1 (Save 3)<br/>\n 16. Discipline 1 (Save 6)<br/>\n 17. Discipline 1 (Save 9)<br/>\n 18. Discipline 1, Hide 3, Listen 3, Move Silently 3, Tumble 5<br/>\n 19. Discipline 1 (Save3)<br/>\n 20. Concentration 2, Discipline 1, Hide 2, Listen 2, Move Silently 2<br/>\n 21. Discipline 1 (Save 3)<br/>\n 22. Discipline 1, Hide 1, Listen 1, Move Silently 1, Tumble 5<br/>\n 23. Discipline 1 (Save 3)<br/>\n 24. Discipline 1 (Save 6)<br/>\n 25. Discipline 1 (Save 9)<br/>\n 26. Discipline 1 (Save 12)<br/>\n 27. Discipline 1, Hide 4, Listen 4, Move Silently 4, Tumble 5<br/>\n 28. Discipline 1, Hide 2, Listen 1, Move Silently 2<br/>\n 29. Discipline 1, Hide 2, Listen 1, Move Silently 2<br/>\n 30. Discipline 1 (Save 3)<br/>\n 31. Discipline 1 (Save 6)<br/>\n 32. Discipline 1, Hide 2, Listen 2, Move Silently 2, Tumble 5<br/>\n 33. Discipline 1, Hide 1, Listen 3, Move Silently 1<br/>\n 34. Discipline 1, Hide 2, Listen 1, Move Silently 2<br/>\n 35. Discipline 1, Hide 1, Listen 2, Move Silently 1, Tumble 1<br/>\n 36. Discipline 1, Hide 1, Listen 1, Move Silently 1, Tumble 2<br/>\n 37. Discipline 1, Hide 1, Listen 1, Move Silently 1, Tumble 2<br/>\n 38. Concentration 2, Discipline 1, Hide 1, Listen 1, Move Silently 1<br/>\n 39. Concentration 2, Discipline 1, Hide 1, Listen 1, Move Silently 1<br/>\n 40. Concentration 2, Discipline 1, Hide 1, Listen 1, Move Silently 1<br/>\n<br/>\n The discussion that follows shows how she came to be a halfway decent build...<br/>\n<br/>\n Oh, and I've just now made the amendments re when I can take DevCrit according to Mick's knowledge - which, unsurprisingly, surpassed mine.<br/>\n<br/>\n<em><span style=\"color:#000000\">edit: per Hip 20160910 (corrections/additions of missing info, in</span></em><span style=\"color:#FF0000\"><strong> red</strong></span><em><span style=\"color:#000000\">) </span></em></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:27 PM - Jun 14, 2015",
      "content": "<div>First, check the search engine: <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/buildsearch/\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhawk/buildsearch/</a> You might find exactly what you are looking for there. You might like this CoT 14 / Ranger 10 / Monk 16: <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build272542.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 72542.html</a><br/>\n<br/>\n With any Monk build, high Wisdom is better than low, but there are only so many points to spend, so something had to give. With Ranger in your build, Wisdom is preferable to Dexterity.<br/>\n<br/>\n If you use any weapon other than kamas, you lose the Monk attack progression. With dual kamas, you get 6 attacks with your main hand, and 2 with your off hand. With Haste and Flurry of Blows, you can have 10 attacks per round. With any other weapon, you will have only 4 attacks with the main hand, and no Flurry of Blows.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:47 PM - Jun 14, 2015",
      "content": "<div>It is a matter of min/maxing, you see by getting your Dexterity from 14 to 8 you lose three AC while by doing this with Wisdom you lose only two AC because there is no negative Wisdom-to-AC modifier for Monks. Furthermore, some class combinations that take WM with Monks simply can't have their Dexterity lowered so we do that with Wisdom in order to get some more points. Regardless though, the best Monks should always have 14's in both Wisdom &amp; Dexterity if you do not care so much about maximum AB's, more often-than-not the difference will just be, a single point. I second Empyre's proposal of COT as a third class, as not only they bring another safety factor (good saves) in the build but also eliminbate the exp penalty that a third main-class would bring to the table. You do not really need that ews when you have 30+ Strength already. About Tyr's build however, he is so close to the two best Monk feautures and he doesn't get them...Change split to Monk 20/ CoT 10/ Ranger 10 and everything will be better, mind-effects immunity alone deserves the loss of one CoT feat and +2 to saves. You will also get another point of AC (Monk 20) and 2x 20 rounds of undispellable 50% concealment (Monk 18)  for that.<br/>\n<br/>\n Good luck with your project,</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:01 PM - Jun 15, 2015",
      "content": "<div>Everything else seems to have been said, but I'd like to add a bit more fire to the mix.<br/>\n<br/>\n There's another alternative that you didn't consider and that deserves a mention. A build with these classes that focuses on Ranger levels rather than Monk. Ranger 26 Monk 10 Fighter 4 is a very good split. This kind of character still gets Evasion, Improved Evasion, Monk AC, all Ranger spells (provided you take 14 Wisdom) and Bane of Enemies whilst having Weapon Specialization and Epic Weapon Specialization in his Kamas (it's just better for a Monk / Ranger to wield Kamas, not only do they have the extra attacks per round, but also their secondary attacks come at -3 from one another rather than -5 for all other classes and / or weapons). This guy will be a monster at dealing damage, will not have such low AC due to Monk Wisdom AC AND will run faster than any other non-Monk toons, meaning you can engage anyone and disengage at will.<br/>\n<br/>\n Just thought I'd throw it out there.<br/>\n<br/>\n Take it EZ!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:29 PM - Jun 15, 2015",
      "content": "<div>Thanks All, greatly appreciated.<br/>\n<br/>\n I'm quite heartened that, having looked at Tyr's build, I had similar thoughts as Valerfor - perhaps I <strong><em>am</em></strong> learning after all!<br/>\n<br/>\n I did, of course, still have some questions (about the viability of dropping Extra Stunning Attacks for Lightning Reflexes and the merits of Armor Skin versus Epic Prowess, for example) in a Monk20/CoT10/Rgr10 build, but then Max comes along and opens a whole new door. So it looks like I'm going to have to sit down with a lot of paper and some damp towels and work out at least two different builds to see which fits me best.<br/>\n<br/>\n Having never played Ranger before, and only encountered CoT when I did the Mazzy build, please bear with me for assorted dumb questions to follow...<br/>\n<br/>\n (Oh, I've now read your Playing Better Guide, Max - thanks for the pointer. It's pleasing to see that my tendency to hoard gear and potions isn't so bad after all! ~Pack-rat you is - you going to hell~ <em>Cespenar</em>)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:05 PM - Jun 16, 2015",
      "content": "<div>Right then, time for a first draft. (Now lead post - cheers Hip)<br/>\n<br/>\n A few things first, though, if I may. 1) I've gone for a Monk 20 / Ranger 10 / CoT 10 - this is primarily because, having played (and thoroughly enjoyed) Monk many times, I'm more aware of the class's foibles and strengths (I think), so I may be less likely to screw it up. The Ranger 26 / Monk 10 / Fighter 4 is one I could return to at another time. 2) I've gone for WF etc in Kama only - this is because I'm trying to keep the build simple (again, less chance of going horribly wrong), and the original concept was for dual-wielding (much as I love unarmed combat, and the fist still won't be too shabby if bludgeoning is required). 3) In Skills, I've gone for some Concentration, but am quite happy to change that to Hide &amp; Move Silently if you think that would be better. 4) I still struggle with Damage and AB calculations, so these may be awry - sorry. Damage, in particular, seems low to me here, but maybe it's right and I've gone wrong somewhere.<br/>\n<br/>\n Any comments and corrections gratefully received! <strong>(As they were - hence the build at the lead post)</strong><br/>\n<br/>\n<br/>\n<em>edit: Build moved to <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354449/\" rel=\"noreferrer\" target=\"_blank\">lead post</a></strong> per HipMaestro 20160908</em><br/>\n<br/>\n<strong>One thing I dearly love about this Guild is that I/we can follow a build's progress from concept to reality (for want of a better word). Whether this is a build for you or not, the support, assistance, challenges and development are gifts beyond measure. We have<em> good</em> people here (even the Evil ones), let us never forget that.</strong><br/>\n  </div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:22 PM - Jun 19, 2015",
      "content": "<div>Ok, after looking at this again, I have many suggestions. Here we go:<br/>\n<br/>\n 1- start straight Ranger 6, then take Monk at 7. The reason for this is that you get your Animal Companion at 6, and since Monk and Ranger get the same skill points per level. You'll be down 1 AC from Tumble from levels 2-6, no biggie.<br/>\n<br/>\n 2- take 2 more monk pre-epic, save one CoT bonus feat for epics. <br/>\n<br/>\n 3- I don't think CoT bonus feats can be used to take save-enhancing feats. At 14 I believe you need to swap Iron will with something combat-related.<br/>\n<br/>\n 4- don't take Toughness at level 1. It's retroactive, so you can take it later.<br/>\n<br/>\n I have to work now, I'll continue later.<br/>\n<br/>\n Cya!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:54 PM - Jun 19, 2015",
      "content": "<div>Many thanks, Max - you've set me thinking (which is worrying in itself).<br/>\n<br/>\n If I take all Ranger from 1-6, then 1 Monk, it seems that I'd be as well taking Ranger 7-9 next - given that I won't be dual-wielding 'til I get Imp 2-Weapon Fighting anyway, nor will I be abandoning armour until the Monk element is up to speed. I could then take Monk 2-6 and a couple of CoTs at levels 16 and 17, followed by alternating Monk and CoT up to level 23, with CoT 6 coming at level 24. This would mean I could still get EWF, OwCrit and Dev Crit all in by this point. I could also bring the final level of Ranger forward to level 30 and use the bonus feat for another Favoured Enemy, and take the final 2 levels of CoT at 39 and 40 so the Monk could be her 'perfect self' for longer.<br/>\n<br/>\n Oh, and I could drop GFortitude altogether (the save is reasonable enough without it), bring WF in at level 1, take Iron Will at level 3 (Lightning Reflexes at level 9), make the CoT bonus feat Power Attack at level 17, and take Toughness at 15, with GCleave at 18 and Imp Crit left where it is at 12.<br/>\n<br/>\n Would these changes make for a better split?<br/>\n<br/>\n (PS - I would have done this as an edit, but I wanted to check with you guys first.)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:41 PM - Jun 19, 2015",
      "content": "<div><blockquote><div><strong>Stagmeister wrote:</strong><hr/>\n<strong>CRIMSON NUN OF PAIN</strong><br/>\n  </div></blockquote>\n<div align=\"left\">WTF... My eyes hurt when I try to imagine what that creature looks like. And I don't know if that is a good thing, but probably not.<br/>\n<br/>\n As for your build:<br/>\n First of all, let me tell you that you have made sigificant progress with your building skills. I spot some finesse here. You save Cot 6 and Ranger 10 for epic levels so you can take epic combat feats. You free up general epic feats for Great strength and take the combat feats with CoT and Ranger bonus feats.<br/>\n But here is still room for improvement. Max gives some good advice with taking Ranger 6 asap, postpone 2 more CoT levels to epic and take Toughness later.<br/>\n I can confirm that Iron will can not be taken as a CoT bonus feat. In my opinion, you don't really need it at all, since the character already has good saves and later gets Diamond soul and Perfect self. I would also remove Lightning reflexes since you get Improved evasion. I would keep Great fortitude to improve survivability in a Dev crit environment.<br/>\n That gives you enough feat slots to delay CoT 4 to epic and pick one more pre epic feat.<br/>\n I would take Ranger directly to 9 levels, only paused by a monk level at character level 7 for a tumble dump. Then I would have gone directly to monk 8 at level 17, with monk 6 and Improved KD at level15, and build tumble gradually to 20 at level 17. The 3 pre epic CoT levels can come from level 18-20 with her Great cleavage from the Cot 2 bonus feat at level 19.<br/>\n<br/>\n Now to that last pre epic feat. I would take Expertise, and I would take it at level 1. To be able to do that, I would start with Strength 17 and Intelligence 13.<br/>\n If you take Great strength with all 7 general epic feats, you still end up with str 34. And now you have an extra epic combat feat from CoT 4, enough for EWF, O crit, Dev crit, AS and EP. Take CoT from lvl 21 to 29, except for Monk at lvl 22 and 27 for skill dumps. Then take the last Ranger level at level 30. And you have taken all your bonus combat feats by then.<br/>\n<br/>\n I would have taken pre epic feats in this order: LoH, Expertise, FE1, Blind F, FE2, PA, WF: Kama; IC: Kama, G Fortitude, Toughness, G Cleave. And the epic combat feats in this order: EWF: Kama, O crit, D crit, AS, EP.<br/>\n<br/>\n If you take Int 13 like I suggest, you get one more skill. My choice with this character is: Concentration 26 (27), Discipline 43 (55), Hide 43 (43), Listen 43 (45), Move silently 43 (43), Tumble 40 (40)<br/>\n<br/>\n  Edit:<em> 15: Monk 6, 16: CoT 1, 17: Monk 7, 18: CoT 2, 19: Monk 8, 20: CoT 3 is probably better with G Cleave 1 level earlier and more frequent skill dumps. </em></div></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:28 PM - Jun 19, 2015",
      "content": "<div>Am i the only one that the name remind me the nurses scene from Sillent Hill?<br/>\n<br/>\n As for the build i concur with what the gents before me said, but what's more important is the fact that those are nit-picks show how much you have progressed Stag. And it is a powerful build with 9 attacks (hasted), 43 AB with Monk progression, Dev Crit and some impressive saves, well done!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:07 PM - Jun 19, 2015",
      "content": "<div>That's brilliant, Mick - thank you. I think I was getting closer in my reply to Max, and you've confirmed that - which is good. I got the GFort / IWill / LRef stuff wrong, and am happy to change them accordingly and bring in Expertise - although I'm still unclear as to why to take that earlier than WF? As to PA, I confess that I delayed it primarily because I was regarding it only as a necessary step towards Dev Crit rather than as of any particular merit in its own right (my bad).<br/>\n<br/>\n As to the Epic levels, in my reply to Max I was trying to take better advantage of Monk, hence my delaying of the final 2 levels of CoT to 39 and 40 (with skills dump in Concentration), but if you think it's better this way round, fair-dos, I bow to greater knowledge.<br/>\n<br/>\n I do like what you say about Int 13 and Str 17, and will edit appropriately.<br/>\n<br/>\n I can't pretend to be much good at the stealthy stuff, but this build seems to yearn for it, so thanks for the inclusion of Hide and Move Silently. Actually, at the outset I was wondering about a Monk / Ranger / Assassin build, but I wanted to play it too, and I'm really not good with playing Evil - I even changed alignment before I could reach Assassin 1 in Valerfor's Shadow Avenger, which I was playing specifically to have a good run in The Gods Themselves. Never mind.<br/>\n<br/>\n Oh, and the name - probably more suited to a different sort of 'specialized' website!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:21 PM - Jun 19, 2015",
      "content": "<div>Sorry, Valerfor - missed your post, and it would hardly be appropriate not to reply having spat my dummy out yesterday!  Thanks very much for the feedback - I'm off to do the edit now (well, soon).</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:56 PM - Jun 19, 2015",
      "content": "<div>You ask why not take WF earlier. You need at least 1 monk level for WP: monk to be able to take WF: kama.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:10 PM - Jun 19, 2015",
      "content": "<div>A very fair point! Glad I picked your post up before I did my edit, which I'm going to do now (oh, and I've remembered that CoT doesn't have Conc  a class skill as well, which will also save me some embarrassment). You might notice in the edit that I've gone for Ow and Dev Crit before EWS - my thinking being that foes that are crit-able are more likely to be around earlier, so let's use it while we can. I've also tried some compromising on the class split by taking CoT 9 and 10 at 30 and 31, dropping Ranger 10 - and thereby Epic Prowess - to L40. I did this with defence in mind - both Monk and CoT (taking both Armor Skin and the final Sacred Defence at L31). Hope you don't mind too much.<br/>\n<br/>\n Cheers.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:44 PM - Jun 19, 2015",
      "content": "<div>I don't mind at all. What you suggest should work all right, except for one thing. The strength will not be high enough for O crit at lvl 21 if you start with str 17.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:05 PM - Jun 19, 2015",
      "content": "<div>Surely it will with GStr I taken at the same level? The edit's up there now, together with the skills split. One thing I did remember when editing was that I'd lose another BAB point with 8 Monk levels pre-epic (to be fair, that would still have applied with 6 - but at least I noticed it!)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:58 AM - Jun 21, 2015",
      "content": "<div>Looks perfect now, Stag! I would only change the one little thing, but that's personal preference more than an improvement. I would go Ranger 6 then Monk 6 to get IKD ASAP, then use the last 2 Monk levels for skill dumps. That might delay Improved Critical and Great Cleave a bit, but these feats are worth delaying for earlier KD IMO. Not to mention at Ranger 6 you get your secon attack per round as well as the aforementioned Animal Companion.<br/>\n<br/>\n KUDOS!<br/>\n<br/>\n Take it EZ!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:58 AM - Jun 21, 2015",
      "content": "<div>Many thanks, Max - 'twas your trigger that sent things the right way, followed by Mick's input.<br/>\n<br/>\n I get what you say about Ranger 6 then Monk 6, and it's probably very sensible. My problem is that I'm used to the OC now, and I've only (successfully) tried Knockdown once (against the boss Vampire in HotU), and that was only 'cos I was Last Chance Salooning it, so I've always been somewhat reticent in taking both the Knockdowns. It has been explained to me many times (thanks Valerfor!) how important and beneficial these feats are, so I do include them, but that's probably why I'm leaving the split as is in this particular build. I know, I know, I should be playing in other environments - and I will, promise.<br/>\n<br/>\n Oh, and just to let you know, I'm currently taking the optimum WM build you showed me about a month ago for a spin around SoU (which is lower magic than the OC, I believe, at least until Undrentide itself), and am having a lovely time with him so far - admittedly only at straight Fighter L9 so far, just leaving the Ao Camp. I was worried about only taking Disc sps, but it seems to be working ok for now. Looking forward to getting into WM - hopefully before petrification!<br/>\n<br/>\n Thanks again</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:45 PM - Jun 21, 2015",
      "content": "<div>I understand you and I know from memory that KD and IKD are not necessary in SoU and HotU, but part of learning the game is learning to use the builds you play. For now that's OK, but just left-clicking all the builds you play means that basically you're not enjoying the build's full potential and resourcefulness. When you start getting used to KDing (properly, by knowing your flurries and using them only on the highest attacks each round), you'll come to see that they are two of the best tools of a melee combatant. You avoid getting hit and targeted by spells when you successfully KD your enemies. But, it's hard to see that when you're surrounded by 15 enemies who chain-miss you all the time <span class=\"text-emoji\">😂</span>.<br/>\n<br/>\n Take it EZ!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:48 PM - Jun 22, 2015",
      "content": "<div><blockquote><div><strong>Stagmeister wrote:</strong><hr/>Surely it will with GStr I taken at the same level?</div></blockquote>\n<div align=\"left\">If I remember correctly a great strength feat taken at the same level up will not help qualify. What is strange is that a regular stat increase at the same level up does. I suggest that you test build the character in a trainer mod.</div></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:12 PM - Jun 23, 2015",
      "content": "<div>Thanks Mick - will see what I can do. If you're right (and my suspicion is that you are, based on past performance), I'll do EWF at 21, OwCrit at 24 and DevCrit at 26. Do you know of any good trainer mods, btw, 'cos I'm still running on pen and paper here?<br/>\n<br/>\n  As ever, much appreciated.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:49 PM - Jun 23, 2015",
      "content": "<div>I use Pretty good character creator to test if my builds are legal. There you can level up (or down again) to any level instantly, get the gold you want and create almost any possible item to equip your character with. You can change the looks of your character,  weapon, clothing and so on. There is also an arena where you can test your builds vs different monters and builds. You will find the mod at Neverwinter Vault.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:05 AM - Jun 24, 2015",
      "content": "<div>There are many.<br/>\n<br/>\n I use the Halls of Advanced Training, but there are others. Can anyone pitch in?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:08 AM - Jun 24, 2015",
      "content": "<div>That sounds very handy - and it might save me from various dumb postings in future (though I wouldn't put money on it), and by association, save you from having to correct me so much!<br/>\n<br/>\n Cheers.<br/>\n<br/>\n Btw, have just read your AA Guide - excellent, thank you. (This may be a spoiler alert for future comedic posts ;-))<br/>\n<br/>\n<em><strong>EDIT</strong></em> - Sorry, just had a thought, and it actually has relevance to this build. I've confessed before to not being a good 'stealthy' player - and I can't find anything in Guides section to help, so does anyone have any tips on how to be a good sneaky character? (I don't ask for much, do I?)<br/>\n<br/>\n And just picked up your post too, Max. Thanks also.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:13 PM - Sep 08, 2016",
      "content": "<div>Had forgotten about this dear lady, stumbled upon her while looking for something else. I believe she's ready for moving to the Full Epic forum, but, Thick Jack Clot that I am, I don't know how to do it. Given that she was built using PnP and posted directly here, would it be simplest to merely create a new thread and input it all again by hand, or is there something clever (but easy) I could do instead?<br/>\n<br/>\n Just when I think I'm getting better, I discover more untapped dumb-assery.<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:47 PM - Sep 08, 2016",
      "content": "<div>No worries, mate.  Just a few steps and it's there.<br/>\n<br/>\n 1. Post your DevCrit DC.<br/>\n 2. Compare and contrast to TyrTemplar's STR version of the Green Beret (she decided to also sneak a DEX version into a single topic *tsk* *tsk*).   I suspect that's the one Empyre cited from the now-defunct ComCast server.  There appears to be a significant difference in AB without examining it further in more detail.  Post just the title, class split, author and differences for any builds where there is no way to link them directly.  Don't concern yourself with her proposed variants. Just deal with the build she posted as it reads today.<br/>\n 3. Retitle your topic to match your build's name and class combo.<br/>\n 4. Copy the build into the lead post while removing the same from the 5th reply.  Modify the comments ever-so-slightly in both posts to make it clear that the posted build is a product of the guild input rather than just a first draft. DON'T use the spoiler format. duh. A statement in the comments of #5 explaining that it was moved is probably appropriate to avoid the comments occurring in between from appearing to be lodged from a time warp though the commenters may actually use such methods to gain advantage.<img class=\"img-emoji\" src=\"emoji/8.gif\"/><br/>\n<br/>\n When it looks complete, I'll be sure it gets moved. No need to duplicate information and lose the insights along the way.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:12 PM - Sep 08, 2016",
      "content": "<div>Thanks a lot - will do. It just seemed like a waste of everyone's effort to leave her languishing here!<br/>\n<br/>\n But food first...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:39 PM - Sep 08, 2016",
      "content": "<div>Did the Dev Crit calculation (I think)). Did the compare and contrast stuff. Retitled with name and build combo. Copy wouldn't paste. Now it looks crappier than before! It's me, I'm sure, but aaargh!<br/>\n  </div>",
      "author-color": "#AA0000"
    }
  ],
  "author-color": "#AA0000"
}