{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "926",
  "name": "Ranger/Weapon Master?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ranger-weapon-master-t2354950.html",
  "author": "campgod",
  "avatar": "10235447_1565972826.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "6:58 PM - Nov 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello, I was thinking about a Ranger/Weapon Master.<br/>\n1)I would like it to be for PvP though I do have to lvl it. I can re-lvl him once he hits 40 so play-ability isnt a must.<br/>\n2)Race: doesn't matter to me, just whatever helps the build the best. <br/>\n3)Class: Ranger/Weapon Master sounds cool. Server does give a +2 AC bonus for just having 2 classes, but if it makes a better toon would consider a 3rd, maybe SD for cheese HiPS?<br/>\n4)Melee preference: I was thinking since Rangers seem to like to duel, go with a Double-axe or something? or even would entertain a bow? <br/>\n <br/>\nI know having a WM sucks up feats, so not sure how doable it is to have all that I want. BoE would be cool, but if not at least I would pick some of the Races for PvP.<br/>\nI would like to see a heavy sided Ranger and a heavy sided WM if possible. Thank you guys a head of time for your thoughts and ideas.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "7:05 PM - Nov 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I built a couple 8f these guys, they have some problems, but hit like a damn truck. Do a quick search.<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:13 PM - Nov 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There is this <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/robin-hood-wildwood-warrior-ranger9-ftr12-wm19-t2302002.html\" rel=\"noreferrer\" target=\"_blank\">Robin Hood</a> by Tyr here in our lvl 40 section. An interesting build, even if it is a a bit low on AC.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "8:01 PM - Nov 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That Robin Hood looks to have nice AB. I also did a search and cant find any of your builds Grimnir...I must be doing it wrong lol.<br/>\nI did find Demos's Ghost Viper which looked cool. Lower AB then the Hood one unless the BoE covers that?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:32 PM - Nov 12, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You will have to take into account the magic level of your server campgod, if the magic level is high then the best choice would be an insane number of attacks over everything else (attacks that hit, that is). That makes ranger/monk/wm the best choice because of the 10 attacks/round thing. There was a build from gdl \"praying mantis\" if I remember correctly that did this. Otherwise, either dual-kukris or scyther is the best, kill them before they kill you builds. Safer would be a scimitar sword &amp; board style wm, but that one would have a significantly lower amount of dmg output that the rest of choices and probably would lose to the other ones since if you invest on defense then you must go all-out to be really good. Drow fencer would do well in mid-to-high level PW's for example as he has ED &amp; high AC &amp; the magic enchantments would take care of his dmg problems.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}