{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "032",
  "name": "Monk/fighter/rogue build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/monk-fighter-rogue-build-t2354748.html",
  "author": "samurainostalgique",
  "avatar": "no_avatar.png",
  "replies": 19,
  "posts": [
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "4:23 PM - Oct 02, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello,<br/>\n<br/>\nI'm currently playing on a french RP PW called Baldur's Gate Nights. It's still a beta, but I'm quite enthusiastic about it.<br/>\n<br/>\nI'm playing as a monk/fighter and planning to take rogue levels later on. However, the admin wants to modify the module's hak to make taunt a fighter class skill. I figure taunt would be tremendously useful for a low AB toon like this one, so I'm going to reroll the character to take it.<br/>\n<br/>\nAnd so I would like some advice as to how to build him.<br/>\nI've already thought about a build, and would like to know what ecbguilders think about it.<br/>\n<br/>\nA few informations about the PW to better understand some of the choices I made, and the constraints of this build:<br/>\n<br/>\n-This is a full epic level 40 PW with +6 items. It starts at level 6, but I'm already level 13, and will probably get back the xp I've got now.<br/>\n<br/>\n-There are a few restrictions about multiclassing here: monks, paladins, clerics and druids can't multiclass with other base classes, but only with prestige classes (granted the prestige class doesn't require another base class). There is an exception for monks though: they can also multiclass into fighter and/or rogue. However, monk has to be the first class. You cannot start as a rogue at level 1 and become a monk. Also, you need to have at least 5 levels in each class.<br/>\n<br/>\n-You can't buy scrolls or potions of invisibility, nor scrolls of true seeing, and lots of other scrolls for that matter, from npcs. Thus, stealth skills are very useful here. However, the admin plans to add a few mobs with true seeing.<br/>\n<br/>\n-As said above, the fighter class is going to be modified to have taunt as a class skill<br/>\n<br/>\n-All the classes that gained 2 skillpoints per level, such as fighter, have been modified to give 4 skill points instead.<br/>\n<br/>\n-From a roleplaying point of view, PCs that have less than 10 in any given ability are considered to be extremely handicaped in that particular ability. For example, a PC with less than 10 intelligence would not even be able to make correct sentences, and would sound like the low intelligence PCs from the old fallout games. Since I don't want to roleplay such a handicap, I want to have at least 10 in every ability, even in charisma.<br/>\n<br/>\n-I care more about PvM than PvP, though I may duel other PCs from time to time.<br/>\n<br/>\n-Since the concept of this character is a master monk, I prefer to have at least 20 monk levels for the \"perfect self\" feat. I also want to fight unarmed.<br/>\n<br/>\n-I know this build will have an xp penalty, but I'm willing to endure it. I care more about the end result than the time it takes me to achieve it.<br/>\n<br/>\n- Though I've started as a human, I could also start over as an elf for the extra dexterity. But that's a difficult choice to make in a build with so many interesting class skills.<br/>\n<br/>\nSo, I've come up with this build:<br/>\n<br/>\nMonk(21), Fighter(6), Rogue(13), Human<br/>\n<br/>\nSTR: 10<br/>\nDEX: 16 (28)<br/>\nCON: 12<br/>\nWIS: 14<br/>\nINT: 14<br/>\nCHA: 10<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Monk(1): Blind Fight, Expertise<br/>\n02: Fighter(1): Weapon Finesse<br/>\n03: Fighter(2): Weapon Focus: Unarmed, Improved Expertise<br/>\n04: Monk(2): DEX+1 (DEX=17)<br/>\n05: Monk(3)<br/>\n06: Monk(4): Toughness<br/>\n07: Monk(5):<br/>\n08: Monk(6): DEX+1 (DEX=18)<br/>\n09: Monk(7): Called shot<br/>\n10: Monk(8)<br/>\n11: Monk(9)<br/>\n12: Monk(10): Improved critical: Unarmed DEX+1 (DEX=19)<br/>\n13: Monk(11)<br/>\n14: Monk(12)<br/>\n15: Monk(13): Disarm<br/>\n16: Monk(14): DEX+1, (DEX=20)<br/>\n17: Monk(15): <br/>\n18: Monk(16): Improved Disarm<br/>\n19: Fighter(3)<br/>\n20: Fighter(4): Weapon Specialization: Unarmed DEX+1, (DEX=21)<br/>\n21: Monk(17): Epic Weapon Focus: Unarmed<br/>\n22: Monk(18)<br/>\n23: Monk(19)<br/>\n24: Fighter(5): Epic Weapon Specialization: Unarmed, DEX+1 (DEX=22)<br/>\n25: Monk(20)<br/>\n26: Monk(21)<br/>\n27: Rogue(1): Armor Skin<br/>\n28: Rogue(2): DEX+1, (DEX=23)<br/>\n29: Rogue(3)<br/>\n30: Rogue(4): Epic Skill Focus: Taunt<br/>\n31: Rogue(5)<br/>\n32: Rogue(6): DEX+1, (DEX=24)<br/>\n33: Rogue(7): Great Dexterity I (DEX=25)<br/>\n34: Rogue(8)<br/>\n35: Rogue(9)<br/>\n36: Rogue(10): Defensive Roll, Epic Dodge, DEX+1 (DEX=26)<br/>\n37: Rogue(11)<br/>\n38: Rogue(12)<br/>\n39: Rogue(13): Great Dexterity II, Crippling Strike (DEX=27)<br/>\n40: Fighter(6): Epic Prowess, DEX+1, (DEX=28)<br/>\n<br/>\nHP:386<br/>\nSaves (F/R/W): 25/30/23<br/>\nBAB:26<br/>\nAB(max, naked): 39 (melee) 36 (ranged)<br/>\nAC (Naked): 33<br/>\n<br/>\nSKILLS (323)<br/>\n<br/>\nDisable Trap 32(41), Hide 42(51), Taunt 43(53), Move Silently 42(51),<br/>\nSearch 42(44), Set Trap 42(51), Tumble 40(49), UMD 40<br/>\n<br/>\nI'm concerned though about the low AB and the lack of discipline and concentration (the admin plans to add mobs that taunt PCs). I've thought about abandonning either stealth or traps for a more dedicated meleer, maybe an elf to have a little more AB and AC, but these skills add so much that it's very difficult to part with either of them.<br/>\n<br/>\nWhat do you think about it?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:11 PM - Oct 02, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Samurai.<br/>\n<br/>\nAfraid I'm not in a position to give a proper analysis atm, just a couple of things, if you don't mind?<br/>\n<br/>\nHow wedded are you to Human or Elf? Halfling could bring you some great results here - particularly if you're not too concerned with xp penalties.<br/>\n<br/>\nSecond, I can't recall the exact figures (I'll check them later, if no one else has come back to you), but I'm positive you don't need to take so many points in trapping skills to deal with and set all deadlies, if not epics. Equally, I reckon you're overpowered in Search. If we're lucky, with some astute pruning we should be able to get you a good wallop of Concentration or Listen (I wouldn't worry overmuch about Discipline in a build like this one).<br/>\n<br/>\nThird (ok, so I lied about \"a couple of things\"), I'm sure we can increase the AB by some juggling - and we might well be able to get Epic Dodge in earlier to soothe some of your AC questions - again, afraid I've little time at the moment, but let me mull - unless one of the great and good comes along in the meantime.<br/>\n<br/>\nFinally (and I'm assuming you want to employ the Expertise-Taunt trick with the build, hence the inclusion of the two Expertise feats, so I won't be questioning them), several of your feats will require a decent AB to work properly at later levels, which you don't really have at the moment - I'm thinking most particularly about the Disarm feats, but Called Shot comes to mind as well. And perhaps Toughness is vulnerable, too, if something else proves more helpful.<br/>\n<br/>\nI do like the principle behind it, and I'm guessing it would only take a few tweaks to bump it up somewhat.<br/>\n<br/>\nSorry, have to go now. Be in touch later.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:19 PM - Oct 02, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Seems like Tyr's \"Death Dealer\" modified to your needs, which is fine. With the restrictions you have set upon yourself, can't get much more out of it anyway.<br/>\n<br/>\nAn AB of 39 is enough for a Monk's attack progression and a role-playing character in general. Plus, you have a high \"Taunt\" skill for tough opponents, right?<br/>\n<br/>\nIf you want Concentration or Discipline (first will be more useful given your high armour class) then you can reduce \"Set Traps\" to 6 (15) and UMD to 35 (35). That will give you 41 skill points which you can spend there instead. I doubt UMD more than 35 will be necessary in a medium-magic PW anyway.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:58 PM - Oct 02, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ha! I'll get back in my box and shut the lid now.<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "11:21 PM - Oct 02, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><em class=\"mention\">@Stagmeister</em> <br/>\nWell I'm not exactly wedded to either human or elf, but since halfling monks only get 2d6 damage unarmed compared to medium size monks' 1d20, I'm thinking such a toon might have more problems dealing with sneak-immune ennemies, not to mention the inability to knockdown taller foes (though I reckon that with his low ab, he will have problems knocking them down later on anyway).<br/>\n<br/>\nWhich feats would you advise me to take instead of disarm and called shot? I've been considering replacing them myself for dodge and maybe some saving throw increasing feats. I don't think replacing toughness would be a good choice though. This character doesn't have that many hitpoints for a meleer.<br/>\n<br/>\n<em class=\"mention\">@Valerfor</em> <br/>\nReducing set traps to 6 (15), that would mean that I only get to set deadly traps, and only when not in combat. But I suppose I have to sacrifice something at some point. Perhaps skill mastery would be a better investment than crippling strike?<br/>\n<br/>\nOne alternative I've thought about is sacrificing epic skill focus: taunt to get one more great dexterity, allowing me to start with only 15 dexterity, dropping constitution to 10, and increasing intelligence to 16 for the skill points for concentration, but that might be too heavy of a price to pay for one more skill, especially since I would only have 43 points in taunt then, and I don't know yet how much will be needed. For now, I've been facing only low concentration mobs, but that might change when the module is completed.<br/>\n<br/>\nI've tried searching for the build you're talking about, but I can't seem to find it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:42 AM - Oct 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ha ha, another with Kail's skill syndrome, for some people skill points are never enough!<br/>\n<br/>\nNo, don't replace crippling strike with skill mastery. This character with his/her 8 attacks/round is ideal for that feat.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "2:53 PM - Oct 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\nHa ha, another with Kail's skill syndrome, for some people skill points are never enough!<br/>\n<br/>\nNo, don't replace crippling strike with skill mastery. This character with his/her 8 attacks/round is ideal for that feat.\n</div></blockquote>\n\nWhat can I say, adding rogue into the mix adds too many interesting skills <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nIn the end I'll probably do without discipline and concentration. As you and Stagmeister both pointed out, discipline isn't that great for this build given the high AC, epic dodge, and low strength. And while concentration might prove useful later against some mobs, I think being able to set epic traps outside of combat, and deadly traps while in combat will probably be more useful in general. And if I ever have to duel a dedicated PC taunter, his skill is probably going to be too high for me to have reasonable chances to resist even with a maxxed concentration anyway.<br/>\n<br/>\nI do need to rearrange my skill points a bit, as I have noticed that I have more points in set traps than needed for epic traps, but not enough disable traps to actually recover epic traps! I also forgot to take synergy bonuses from disable traps and set traps into account.<br/>\n<br/>\nSo in the end, his skills should look like that:<br/>\n<br/>\nSKILLS (323)<br/>\n<br/>\nDisable Trap 37(48), Hide 42(51), Taunt 43(53), Move Silently 42(51),<br/>\nSearch 40(42), Set Trap 37(48), Tumble 40(49), UMD 35, Spellcraft 3 (5)<br/>\n<br/>\n<br/>\nDo you think, as Stagmeister said, that I should ditch called shot and the disarm feats for something else? I've been thinking about replacing them with dodge, skill focus: taunt, and great fortitude.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:34 PM - Oct 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thing is, you are so \"by the book\" correct in your choices that i am hesitant to point out any changes and i will explain why...<br/>\n<br/>\nImproved Disarm is \"Ideal\" for an unarmed character, since you take full advantage of the feat, in theory at least.<br/>\nCalled Shot is a good feat to use when IKD does not work (immunities or other) so that is good also.<br/>\n<br/>\nNow if we knew more things about your PW then i could say with certainty that for example, your AB isn't good enough for this feat or the other, or that you don't need a measly +2 to your fortitude save. But as it is i can't do that because i know next to nothing about the enemies you are going to face. That's why i said that \"By the Book\" you are very correct in your choices, especially so if you like and use those combat feats, because having them only isn't enough...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "4:20 PM - Oct 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\nThing is, you are so \"by the book\" correct in your choices that i am hesitant to point out any changes and i will explain why...<br/>\n<br/>\nImproved Disarm is \"Ideal\" for an unarmed character, since you take full advantage of the feat, in theory at least.<br/>\nCalled Shot is a good feat to use when IKD does not work (immunities or other) so that is good also.<br/>\n<br/>\nNow if we knew more things about your PW then i could say with certainty that for example, your AB isn't good enough for this feat or the other, or that you don't need a measly +2 to your fortitude save. But as it is i can't do that because i know next to nothing about the enemies you are going to face. That's why i said that \"By the Book\" you are very correct in your choices, especially so if you like and use those combat feats, because having them only isn't enough...\n</div></blockquote>\n\nI understand. For now I'm under the impression that most ennemies in this PW don't have super high discipline, so I think I'll keep these feats. <br/>\n<br/>\nI made another mistake while calculating my skill points: for some reason, I assumed disable traps was a dex based skill, when it's actually intelligence based. So I'll lower my set traps skill to 34(45), increase my disable traps skill to 40(44), and use intelligence increasing gear to make up for the 4 missing skill points to recover the traps. Not that it's really important but I figured someone might wonder about that <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nAnyway, thank you for your advices.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "11:52 PM - Oct 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I don't know how I came up with 323 skill points, but doing the maths again, I've found out that I actually have 353 skill points to spend!<br/>\n<br/>\nSo now comes another tough choice: going with a more balanced build, staying human and spending the 30 extra points to get spellcraft to 18(20) or going for a more offensive build, becoming elf, sacrificing 2 points of constitution, called shot, ignoring spellcraft completely, and lowering set traps a bit, becoming dependant on dexterity increasing items to set epic traps, all of that in order to gain 2 points of dexterity.<br/>\n<br/>\nAt the moment, human seems like the better choice to me, especially since I don't seem to have too much trouble hitting things for now, and called shots to the legs can sometimes be used to lower ennemy AC anyway, but I have yet to see the high level content on this PW.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:17 AM - Oct 04, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Human also avoids a chunk of the Exp penalties that build has, so is a solid choice i think.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:41 AM - Oct 04, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sorry I haven't come back to you earlier, Samurai, but as hoped, one of the great and good did indeed come along, so that's alright.<br/>\n<br/>\nOn the feats side, I confess that I hadn't fully read the build - or, at least, some of it didn't go in. I suspect I saw a Dex Monk so thought Kama, and was looking to dual-wield you. Mea culpa - apologies.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "3:19 PM - Oct 05, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've had a change of heart, and I'm planning to drop this character's charisma to 8 and roleplay him as socially inept.<br/>\n<br/>\nWith that said, I'm not sure where I'm going to spend the 2 extra attribute points. I could go for constitution, and bring it to 14, but I'm wondering if strength might be more important on a build like that, for additional damage. Maybe I should do it the other way around, and give him 14 strength and 10 constitution? Or maybe a balance of the two, 12 STR and 12 CON<br/>\n<br/>\nAt first glance I'd say CON, as 386 naked HP is not that much for a meleer, but I'd like to hear someone else's take on it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:38 PM - Oct 05, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's true, Samurai, but then, neither is 426 HP (although I can certainly see breaking the 400 point barrier can feel important). Given that you'll be doing a lot of trapping, I reckon you'd be better served by 12/12 STR/CON split. A lot will depend on your own play-style, but for me, in a melee build, anything less than 12 in STR unnerves me. Another thought might be to also drop WIS to 13 - I reckon your natural AC and Will save are good enough - and start with a DEX of 17, which would enable you either take an extra Great Dex (at the expense, I'd guess, of either Epic Prowess or the Taunt focus), or free up one of those Great Dex slots for something else. Just thoughts, feel free to ignore...<br/>\n<br/>\nOh, and this has very little bearing, I imagine, but I seem to recall Hip (also a skills demon - and particularly UMD) saying that a nett UMD of 33 is adequate for casting all scrolls without failure, and that any more is unnecessary as Monks will be wearing Monk gear anyway, so will be unlikely to require items requiring more.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "5:51 PM - Oct 05, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nThat's true, Samurai, but then, neither is 426 HP (although I can certainly see breaking the 400 point barrier can feel important). Given that you'll be doing a lot of trapping, I reckon you'd be better served by 12/12 STR/CON split. A lot will depend on your own play-style, but for me, in a melee build, anything less than 12 in STR unnerves me. Another thought might be to also drop WIS to 13 - I reckon your natural AC and Will save are good enough - and start with a DEX of 17, which would enable you either take an extra Great Dex (at the expense, I'd guess, of either Epic Prowess or the Taunt focus), or free up one of those Great Dex slots for something else. Just thoughts, feel free to ignore...<br/>\n<br/>\nOh, and this has very little bearing, I imagine, but I seem to recall Hip (also a skills demon - and particularly UMD) saying that a nett UMD of 33 is adequate for casting all scrolls without failure, and that any more is unnecessary as Monks will be wearing Monk gear anyway, so will be unlikely to require items requiring more.<br/>\n<br/>\nCheers\n</div></blockquote>\nWell, about lowering wisdom, one alternative I've been considering is to drop it to 10, and bring up both STR and CON to 14. That way, I'll break the 400 HP barrier and still have a respectable STR score, and maybe losing these 2 points of AC won't be that bad given this toon's AC. As for will saves, they won't be that good, but a character with \"perfect self\" has much less need for high will saves anyway, as he will be immune to most things that require it.<br/>\n<br/>\nWhat do you think about it?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:17 PM - Oct 05, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Speaking purely personally, I'm delighted with the idea. It's one I was loath to put in front of you because it chimes so well with my play-style, which I wouldn't want to press on anyone else.<br/>\n<br/>\nI don't know whether you've had a scout about the Full Epic sub-forum, but the discussions around my Arvoreen's Silent Sting build there (I think it's still on the first page) might be of interest, even though it's a D-W halfling - but it has the same class split (though I used CoT rather than Fighter to avoid xp penalties) as yours and has a fair bit of discussion and info on trapping, skills allocation and suchlike.<br/>\n<br/>\nYou watch, Valerfor will come along any minute with a better idea!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "8:25 PM - Oct 05, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nSpeaking purely personally, I'm delighted with the idea. It's one I was loath to put in front of you because it chimes so well with my play-style, which I wouldn't want to press on anyone else.<br/>\n<br/>\nI don't know whether you've had a scout about the Full Epic sub-forum, but the discussions around my Arvoreen's Silent Sting build there (I think it's still on the first page) might be of interest, even though it's a D-W halfling - but it has the same class split (though I used CoT rather than Fighter to avoid xp penalties) as yours and has a fair bit of discussion and info on trapping, skills allocation and suchlike.<br/>\n<br/>\nYou watch, Valerfor will come along any minute with a better idea!<br/>\n<br/>\nCheers\n</div></blockquote>\n\nI didn't see that build before. I must say it's very helpful to me. I've realized that I've been focusing on traps too much. Discipline and spot (I personally prefer it to listen since they can't catch you flat-footed when you've spotted them) are more important to me in the end, and by going for a skill allocation similar to yours (though of course slightly different) I'll be able to max them (as well as taunt of course, which is an essential part of this build), and still get a very \"roguey\" character.<br/>\n<br/>\nI think I'll go with 10 WIS and 14 STR and CON too. I'll still have 33 naked AC (I had forgotten to take into account metal skin when I said the first version had 33 AC) which, with epic dodge, should be enough.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:28 PM - Oct 05, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>samurainostalgique wrote:</cite>\n<blockquote><div><cite>Stagmeister wrote:</cite>\nSpeaking purely personally, I'm delighted with the idea. It's one I was loath to put in front of you because it chimes so well with my play-style, which I wouldn't want to press on anyone else.<br/>\n<br/>\nI don't know whether you've had a scout about the Full Epic sub-forum, but the discussions around my Arvoreen's Silent Sting build there (I think it's still on the first page) might be of interest, even though it's a D-W halfling - but it has the same class split (though I used CoT rather than Fighter to avoid xp penalties) as yours and has a fair bit of discussion and info on trapping, skills allocation and suchlike.<br/>\n<br/>\nYou watch, Valerfor will come along any minute with a better idea!<br/>\n<br/>\nCheers\n</div></blockquote>\n\nI didn't see that build before. I must say it's very helpful to me. I've realized that I've been focusing on traps too much. Discipline and spot (I personally prefer it to listen since they can't catch you flat-footed when you've spotted them) are more important to me in the end, and by going for a skill allocation similar to yours (though of course slightly different) I'll be able to max them (as well as taunt of course, which is an essential part of this build), and still get a very \"roguey\" character.<br/>\n<br/>\nI think I'll go with 10 WIS and 14 STR and CON too. I'll still have 33 naked AC (I had forgotten to take into account metal skin when I said the first version had 33 AC) which, with epic dodge, should be enough.\n</div></blockquote>\n\nPleased to have been some help! And you're right, of course,  your build is more \"roguey\", while mine is more \"monky\". And again, play-style is a personal factor when it comes to things like Spot and Listen, Discipline and Concentration (although the environment in which you're playing also factors in there - if enemies don't taunt, leave Conc at home with its knitting), and so on. I'm still learning lots, which is one of the reasons all the builds I post always include full disclosure of the discussions that led to the final version.<br/>\n<br/>\nTalking of which, after you've given your build a good testing, why not post it in the Full Epic sub-forum? It just seems to me that we get a lot of great builds constructed here in the Unfinalized Builds/Build Requests arena that never seem to make it into the pantheon. It doesn't have to be the best of the best ('cos there ain't no such thing anyway), but I'd guess that the Full Epic one is where people will look for builds first - and it's certainly what the Guild Filter spreadsheet uses.<br/>\n<br/>\nSorry, I digress. Enjoy!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "8:56 AM - Oct 06, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well the thing is, this build was made with some specific modifications in mind (mainly taunt as a fighter class skill), so it would have to be modified for vanilla NWN.<br/>\n<br/>\nBasically, you'd have 3 choices:<br/>\n1. Keeping the fighter levels and ditching taunt (and thus the epic skill focus and probably also the expertise feats)<br/>\n2. Replacing the fighter levels by blackguard or paladin levels (the former comes with no xp penalty), giving up WS and EWS+ 2 pre-epic feats<br/>\n3. Keeping the fighter levels, and cross-classing taunt; but obviously it will only be effective if you're facing mostly low concentration ennemies.<br/>\n<br/>\nAlso, without the rules of this specific PW, you'd want to start as a rogue of course, for more skillpoints. But since fighters, paladins and blackguards in vanilla NWN only gain 2 skillpoints per level, you'd still end up with exactly the same amount of skillpoints.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "8:24 PM - Oct 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was wondering, if I had to adapt this build for PVP duels, what modifications would I need to make? I'm thinking that I'd probably replace called shot by great fortitude , and two great dexterity by epic fortitude and epic skill focus: discipline, to resist dev crits and knockdowns.<br/>\n<br/>\nMaybe I'd also give him a 14 in wisdom instead of strength. It seems to me that it's difficult to have enough AC for duels with high AB characters such as clerics and weapon masters.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}