{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "003",
  "name": "The Farmer (Ranger 26/ Monk 10/ Fighter 4)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-farmer-ranger-26-monk-10-fighter-4-t2354922.html",
  "author": "webshaman1",
  "avatar": "10404082_1510287071.jpg",
  "replies": 28,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:21 PM - Jul 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">It's been a while, but this build comes from Max's suggestion in the Crimson Nun of Pain thread, which I didn't take up at the time.<br/>\n<br/>\nI searched the Guild Filter and nothing terribly similar comes up (which may well be worrying), and the build does attract a 20% xp penalty from level 23 onwards. Nonetheless, I thought I'd put it up for analysis/sniping. Oh, and I've given him a bit of back-story...<br/>\n<br/>\n'He was smiling as the wagon clattered over the rise, and the shallow little valley opened out in front of him. He'd perked up once he'd left the town - never at his best in a crowd.<br/>\n<br/>\nThen he saw the farm, and the smile died on his lips. He sat silent while the wind ruffled the grass around him. He couldn't breathe, couldn't think. Then he was down from the wagon and running, land and sky jolting. Through the stubble of the fields he'd harvested not a week before. Over the smashed fence and chicken feathers crushed into the mud.<br/>\n<br/>\nHe reached the yard and stood helpless. The house was all charred, dead timbers and rubbish with nothing left standing. Burned out. He ran round the side of the blackened wreck of the barn, whimpering a little with every breath.<br/>\n<br/>\nHis wife was hanged from the big tree out back. They'd hanged her over his mother's grave and kicked down the headstone. She was shot through with arrows. Might have been a dozen, might have been more.<br/>\n<br/>\nHe felt like he'd been kicked in the guts and he bent over, hugging himself, and groaned. He couldn't see anything for the aching in his eyes and the wind stinging at them, and he clamped his arms tighter, feeling suddenly so cold nothing could warm him.<br/>\n<br/>\nHe squatted down over the churned-up sod around the tree. Wiped his nose and eyes. Followed the tracks hunched over to another battered patch of earth. Found an empty bottle trampled into the mud. Tossed it away. They had made no attempt to hide their signs. Hoof-prints all around. He guessed at about twenty. They'd come from the east and left to the west.<br/>\n<br/>\nHe got a shovel and did it quick, shinning up the tree, cutting her down and breaking the shafts off, smoothing her bloodied hair. He closed her eyes and put his hand on her cheek. Cold. He filled the hole in and dragged his mother's stone up straight again.<br/>\n<br/>\nHe wondered if he should say something, then realized he had nothing to say. He had but one thought in his head. He would find them. \"Then we'll see,\" he whispered.<br/>\n<br/>\nHe took a last look as his wagon lurched away towards the dusk. His wife. His home. His hopes. How one day can change things. All he'd worked for.<br/>\n<br/>\nAnd now, the farmer was coming...'<br/>\n<br/>\n<strong>The Farmer</strong><br/>\n<br/>\nRanger 26/ Monk 10/ Fighter 4<br/>\nHuman, any Lawful<br/>\n1-40 PvM<br/>\n<br/>\n<strong>Stats</strong><br/>\nSTR 17 (34)<br/>\nDEX 10<br/>\nCON 12<br/>\nWIS 14<br/>\nINT 13<br/>\nCHA 8<br/>\n<br/>\nHPs: 460<br/>\nAC: (robes only - not intended to wear anything else but light/medium armour until level 10) 24<br/>\nSaves: Fortitude 26, Will 22, Reflex 20 (+2 v mind spells, +4 v spells, immune to disease)<br/>\nBAB: 28<br/>\nAB: (max, melee) 44. (d-w kamas) 42/39/36/33/30/27 - 42/39 (19-20x2)<br/>\nDamage: (kama) 1-6+12/ 1-6+6<br/>\nSkills: 250. Discipline 43 (55), Hide 43 (43), Listen 43 (45), Move Silently 43 (43), Spellcraft (cc) 19 (20), Tumble 40 (40)<br/>\nDev Crit DC: 42<br/>\nSpeed +30%<br/>\n<br/>\n<strong>Levelling</strong><br/>\n<br/>\n1 Rgr1: Expertise/ Luck of Heroes (Dual-Wield/ Trackless Step/ Favoured Enemy I)<br/>\n2 Rgr2<br/>\n3 Rgr3: Blind Fighting<br/>\n4 Rgr4: STR+1 (18)<br/>\n5 Rgr5: (Favoured Enemy II)<br/>\n6 M1: Weapon Focus: Kama/ (Cleave/ Evasion/ FoB/ Imp Unarmed Strike/ Stunning Fist)<br/>\n7 Rgr6: (Animal Companion)<br/>\n8 Rgr7: STR+1 (19)<br/>\n9 Rgr8: Power Attack<br/>\n10 Rgr9: (Imp 2-Weapon Fighting)<br/>\n11 M2: (Deflect Arrows)<br/>\n12 M3: STR+1 (20)/ Imp Critical: Kama/ (Monk Speed/ Still Mind)<br/>\n13 M4<br/>\n14 M5: (Purity of Body)<br/>\n15 Rgr10: Great Cleave/ (Favoured Enemy III)<br/>\n16 Rgr11: STR+1 (21)<br/>\n17 M6: (KD/ IKD)<br/>\n18 Rgr12: Toughness<br/>\n19 Rgr13<br/>\n20 Rgr14: STR+1 (22)<br/>\n21 Rgr15: G Str I (23)/ EWF: Kama<br/>\n22 M7: (Wholeness of Body)<br/>\n23 F1: Overwhelming Critical<br/>\n24 Rgr16: STR+1 (24)/ G Str II (25)<br/>\n25 F2: Devastating Critical<br/>\n26 F3<br/>\n27 M8: G Str III (26)<br/>\n28 Rgr17: STR+1 (27)<br/>\n29 Rgr18<br/>\n30 Rgr19: G Str IV (28)<br/>\n31 Rgr20: (Favoured Enemy IV)<br/>\n32 M9: STR+1 (29)/ (Imp Evasion)<br/>\n33 F4: G Str V (30)/ Armor Skin<br/>\n34 Rgr21<br/>\n35 Rgr22<br/>\n36 Rgr23: STR+1 (31)/ G Str VI (32)/ (Bane of Enemies)<br/>\n37 M10: (Ki Strike 1)<br/>\n38 Rgr24<br/>\n39 Rgr25: G Str VII (33)/ Epic Prowess<br/>\n40 Rgr26: STR+1 (34)/ (Favoured Enemy V)<br/>\n<br/>\n<strong>Skills</strong><br/>\n<br/>\n1 Disc4, Hide4, Listen4, Move Silent4, Spell2 (Save4)<br/>\n2 Disc1, Hide1, Listen1, Move Silent1 (Save6)<br/>\n3 Disc1, Hide1, Listen1, Move Silent1, Spell1 (Save6)<br/>\n4 Disc1, Hide1, Listen1, Move Silent1 (Save8)<br/>\n5 Disc1, Hide1, Listen1, Move Silent1, Spell1 (Save8)<br/>\n6 Disc1, Hide1, Listen1, Move Silent1, Tumble5 (Save5)<br/>\n7 Disc1, Hide1, Listen1, Move Silent1, Spell1 (Save5)<br/>\n8 Disc1, Hide1, Listen1, Move Silent1 (Save7)<br/>\n9 Disc1, Hide1, Listen1, Move Silent1, Spell1 (Save7)<br/>\n10 Disc1, Hide1, Listen1, Move Silent1 (Save9)<br/>\n11 Disc1, Hide1, Listen1, Move Silent1, Spell1, Tumble5 (Save4)<br/>\n12 Disc1, Hide1, Listen1, Move Silent1, Tumble5 (Save1)<br/>\n13 Disc1, Hide1, Listen1, Move Silent1, Spell1 (Save1)<br/>\n14 Disc1, Hide1, Listen1, Move Silent1 (Save3)<br/>\n15 Disc1, Hide1, Listen1, Move Silent1, Spell1 (Save3)<br/>\n16 Disc1, Hide1, Listen1, Move Silent1 (Save5)<br/>\n17 Disc1, Hide1, Listen1, Move Silent1, Spell1, Tumble5<br/>\n18 Disc1, Hide1, Listen1, Move Silent1 (Save2)<br/>\n19 Disc1, Hide1, Listen1, Move Silent1, Spell1 (Save2)<br/>\n20 Disc1, Hide1, Listen1, Move Silent1 (Save4)<br/>\n21 Disc1, Hide1, Listen1, Move Silent1, Spell1 (Save4)<br/>\n22 Disc1, Hide1, Listen1, Move Silent1, Tumble5 (Save1)<br/>\n23 Disc1 (Save4)<br/>\n24 Disc1, Hide2, Listen2, Move Silent2 (Save3)<br/>\n25 Disc1 (Save6)<br/>\n26 Disc1 (Save9)<br/>\n27 Disc1, Hide3, Listen3, Move Silent3, Tumble5<br/>\n28 Disc1, Hide1, Listen1, Move Silent1, Spell1<br/>\n29 Disc1, Hide1, Listen1, Move Silent1 (Save2)<br/>\n30 Disc1, Hide1, Listen1, Move Silent1 (Save4)<br/>\n31 Disc1, Hide1, Listen1, Move Silent1 (Save6)<br/>\n32 Disc1, Hide1, Listen1, Move Silent1, Spell1, Tumble5 (Save1)<br/>\n33 Disc1, Spell1 (Save2)<br/>\n34 Disc1, Hide2, Listen2, Move Silent2 (Save1)<br/>\n35 Disc1, Hide1, Listen1, Move Silent1, Spell1 (Save1)<br/>\n36 Disc1, Hide1, Listen1, Move Silent1 (Save3)<br/>\n37 Disc1, Hide1, Listen1, Move Silent1, Tumble5<br/>\n38 Disc1, Hide1, Listen1, Move Silent1, Spell1<br/>\n39 Disc1, Hide1, Listen1, Move Silent1, Spell1<br/>\n40 Disc1, Hide1, Listen1, Move Silent1, Spell1<br/>\n<br/>\nWhat do you think?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:33 PM - Jul 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great story Stag!<br/>\nExtremely dangerous avenger with 9 dev crit attempts per round. And dev crit comes early too.<br/>\nBase AC is low, but becomes very good when you buff wis and dex. And you also have expertise to help you out.<br/>\n5 FEs may seem a bit narrow minded, but this guy is on a mission!<br/>\nThis is a build I may want to try.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:19 PM - Jul 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Mick - you really have no idea how much that means to me!<br/>\n<br/>\nPart of my wanting the 14 Wis was for Cat's to help compensate for the AC (the other part was people banging on about me never trying any casting, or I'd have swapped the starting Dex and Wis stats around). And with Robes of the Dark Moon and Sun Soul Boots +5 (neither of which are too hard to find), that AC pops up to 34 without other augmentations.<br/>\n<br/>\nI'll grant you the dearth of FEs, but after all, he doesn't hate everyone (yet). I confess that they were genuine perks to the build, rather than part of the design - hence my taking BoE so late (it would just seem rude not to have it) and not specifying the FEs I'd choose (although for me they'd be Undead, Constructs, Outsiders, Aberrations and Dragons probably - in whatever order)<br/>\n<br/>\nI'm also aware that it's a little inelegant between levels 6 and 11. I'd obviously wanted to take Monk at 7 rather than 6 for Tumble, but realised I couldn't take WF in kama unless it came at 6, and there's only so long before you have to pick a weapon (except in Empyre's splendid Universal Warrior - or Soldier, sorry, I forget). Then it occurred to me that I could take Monk 1 and 2 next to each other (at level 6 and 7), but I felt like I needed a friend, so Animal Companion it was! (Oh, that and charging for Imp 2-WF). Thematically, it should be boar, hawk, rat or badger, but I'll leave it to personal tastes.<br/>\n<br/>\nAnyway, I'm prattling. Still chuffed to bits with your comments, Mick. Thanks<br/>\n<br/>\n<strong><em>EDIT:</em></strong> While I'm at it - those Halls of Advanced Training and Pretty Good Character Creator modules...not so shabby after all! (Shush - tell no one!)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "10:05 PM - Jul 12, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I love this build. My main gripe with STR rangers was wearing studded leather, it felt pretty useless, but this provides an answer to that quite soundly.<br/>\n<br/>\nIf I played this I'd probably drop dev, keep monk at 6 or 7, and add more ranger levels.<br/>\n<br/>\nI'd also probably do stats like this:<br/>\n<br/>\nSTR: 18<br/>\nDEX: 8<br/>\nCON: 14<br/>\nWIS: 14<br/>\nINT: 10<br/>\nCHA: 8<br/>\n<br/>\nAlso I'd drop hide/ms.. maybe get the animal empathy going.<br/>\n<br/>\nI was actually thinking of a class split like this except with Zen Archery and wis based. Thanks for sharing your build Stag! :D<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:54 PM - Jul 12, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks wildleaf - massively appreciated.<br/>\n<br/>\nThe split was Max's idea: I tried buggering around with it (hoping to avoid the xp penalty by using 6 levels of CoT instead of 4 of Fighter), but the man's no fool. In a relatively poor natural AC unarmoured build, Monk 10 does bring 1 more (and with your suggested stats you'd be losing 1 from Dex, too - maybe the added HPs would compensate for that, but I prefer not getting hit at all), as well as level 9 giving both Imp Evasion and +10% to speed. It also bumps all saves by a further 2 from 6 to 10 levels. And the danger with only 6 levels of Monk is that you end up taking the last level very late on - for Tumble - but that means you don't get the Knockdown twins until around level 37, which is a tad late.<br/>\n<br/>\nI will say that Hide and MS were a personal preference - again thinking about not getting hit. A lot will depend on your environment: Lore, Concentration, Persuade, Search and Spot (as well as Animal Empathy) might well all prove useful. For the Farmer, I wanted him coming out of the shadows and threshing before they knew he was coming.<br/>\n<br/>\nAnd yes, in a non-Dev Crit environment, things would be different, and many new paths would open up. <br/>\n<br/>\nThanks again, mate!<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, meant to mention, dropping INT down to 10 will also mean you can't take Expertise<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "3:53 AM - Jul 16, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Looks cool Stag.  I was wondering if you needed all those Ranger levels?  If you go Ranger 21, you can get Fighter 8 and Monk 11.  I lost 1 Favored Enemy (kept Bane), but also picked up Weapon Specialization and Epic Weapon Specialization.  You can adjust the starting stats to<br/>\n<br/>\nStr 16<br/>\nDex 14<br/>\nCon 10<br/>\nWis 14<br/>\nInt 13<br/>\nCha 8<br/>\n<br/>\nThis drops your HP down to 418 (kept Toughness) but you maintain your 44 AB and AC is up 2.  I like the Specialization line especially since Kama base damage is low. Dev Crit helps, but not against Undead and many mobs that some places make crit immune when they normally are not.<br/>\n<br/>\nJust a thought!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:25 AM - Jul 16, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks a lot Demos, but don't you need at least 23 levels of Ranger for Bane? Don't Ranger bonus feats come at 23, 25 and 26 in epic levels?<br/>\n<br/>\nPlease don't get me wrong, getting immunity to poison from Monk 11 (or even the SR from Monk 12) is very appealing to a big fan of the Monk class, and this is the only time I've gone with Fighter and not taken WS - let alone EWS - but those FEs are there to compensate for the lack of \"normal\" damage against crit immunes such as undead and constructs.<br/>\n<br/>\nIt would be possible to go Ranger 23, Monk 11, Fighter 6 and get WS/EWS, but you'd lose Armor Skin (assuming maintaining a Dev Crit build - if not, many things can change, such as losing Power Attack, Great Cleave and OW Crit, as well as Dev Crit itself), and so you'd lose the 2 AC gained by bumping Dex as well as the HPs from dropping Con and (effectively) one Ranger level for a Monk one. Also, a third reason for my bumping Wis rather than Dex is that AC gained from Wis isn't affected by being caught flat-footed, so a lack of Uncanny Dodge or Defensive Awareness is less important.That all seems like a nett loss to me.<br/>\n<br/>\nUnless I'm wrong, which is entirely possible.<br/>\n<br/>\nAm currently running the Farmer through SoU/HotU/SoF - atm level 19 in HotU (going to meet Halaster shortly) - to check how things work outside the Halls of Advanced Training (as well as hopefully - finally - completing Sands of Fate for the first time). All going ok so far!<br/>\n<br/>\nBig fan of your Spear Disciple, btw!<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Of course, you could go Ranger 23/ Monk 9/ Fighter 8. That way you can have both Armor Skin and WS/EWS. However, you would lose 1AC from losing Monk 10 (so a nett gain of 1AC), 1 on Reflex and Will saves, lose 2 FEs, 8 skill points, and not get Imp Evasion until level 37. Your call!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "5:17 PM - Jul 16, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually, the only prereq for taking Bane of Enemies is Ranger 21.  Granted, fewer Favored Enemies means BoE is less useful  (Bane of Enemy?  :) ) .  Also, the build I was messing with (Ranger 21 / Monk 11 / Fighter 8) did keep Dev Crit.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:23 PM - Jul 16, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Demos wrote:</cite>\nActually, the only prereq for taking Bane of Enemies is Ranger 21.  Granted, fewer Favored Enemies means BoE is less useful  (Bane of Enemy?  :) ) .  Also, the build I was messing with (Ranger 21 / Monk 11 / Fighter 8) did keep Dev Crit.\n</div></blockquote>\nAh, so you'd be taking it as a general feat rather than a bonus one, then. That would mean a dip of one Great Strength (I'm taking all 7 of them atm), which would work with a starting Str of 16. That would leave a final strength of 32 (-1AB and damage) - which is more than compensated for by WS/EWS (+6 damage), though the Dev Crit DC would take a minor hit. And I think 3 FEs still covers the majority (if not all) of the standard crit immune enemies. I'm supposing all 8 Fighter levels would come in epic levels, to cover Ow Crit/ Dev Crit/ WS/ EWS/ Armor Skin, while taking the first 7 levels of Monk pre-epic? Thus a split of Ranger 13/ Monk 7 pre-epic, and Ranger 8/ Monk 4/ Fighter 8 in epic (which would also mean getting Imp Evasion and an additional 10% of speed at level 27, and an extra +1AC achieved 5 levels earlier at 32).<br/>\n<br/>\nYou've convinced me - it's a very good idea. Greatly appreciated, Demos! I'll edit the OP accordingly after I've done a re-jig (still a pencil and paper man, it may take a little time).<br/>\n<br/>\nCheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Ah, no, I'm afraid I can't make it fly - I don't see how to get Epic Prowess in there without a Ranger bonus feat (or another Fighter one, but that would scupper BoE altogether). You may know better, and I'd be glad to hear the answer, I promise. I might well be missing something.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:24 PM - Jul 16, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Stag!<br/>\n<br/>\nI kinda liked the story you went with there. The build itself isn't bad, although admittedly I'd do many things differently, but even sticking to the concept, it could use some improvements, for sure, at least in my book.<br/>\n<br/>\nThere are many things that you can do to optimize it without making it unplayable on one hand, but yes, harder to play on the other. Here's how:<br/>\n<br/>\nFirstly, le's have a look at the level spread. You could change it as much as you wanted to without compromising much, depending on how far you're willing to go to make it more powerful within the same concept. So, the OPTIMAL spread for this Kama-wielder would be 26 Ranger / 6 Monk / 8 Fighter. However, that comes a maybe too high a price for you in playability terms (like going pretty much your whole life without KDing an opponent until 37th level). So perhaps you could meet me halfway and go for 26 / 8 / 6, which will give you 1 epic feat without sacrificing playability that much. In terms of pre-epic spread, I'd stick to Monk 4 Ranger 16 for 1 more BAB point, which would delay KD a bit, but then you could take 21 and 22 of Monk and have KD from then on, leaving 2 levels for skill dumps at 32 / 37. The bonus feat you gained by going Fighter would net you the ability to get EWS and REALLY embrace that damage potential your character has. You'd need to drop one feat for it, though, but I think it's worth it. I'd personally select Armor Skin, since it's not going to matter much with such a low AC you'll undoubtedly have. But, on the flipside, you'll hit LIKE A TRUCK, and 10x per round hasted. Not bad in my book.<br/>\n<br/>\nThen comes the leveling order. It's MUCH better to delay that Monk 1 to allow yourself to get the Animal Companion AND the second attack per round at 6th level, so I'd move it to level 7 for sure. You can anticipate Power Attack (or any other feat, like Toughness), and take WF a bit later. It also makes no sense that you go for Ranger 9 for ITWF (good if you choose to weaken the end result for the sake of playability, otherwise, avoidable), but then start taking Monk levels one after the other, and then stop before KD/IKD just to get +1 Tumble AC for 5 levels. If you're going for it, GO FOR IT. Take Monk 6 ASAP and then lose 1 Tumble AC for a couple of levels, by level 22, it'll all be normal again. In epics, after DevCrit, you should REALLY go for BoE ASAP. Forget any skill dumps or anything and just SMASH on Ranger levels until you get that 23rd bonus feat for the goods. After that, you can round it out. You need to take a new look at your priorities.<br/>\n<br/>\nThen looking at starting stats, I noticed 13 INT, for Expertise and KD, I presume, but 10 DEX for pretty much no reason. Why not 14 INT and 9 DEX? I know you'll require DEX gear, but 43 skill points are hard to pass up. What armor are you planning to equip him with?<br/>\n<br/>\nFinally, feat-selection. I really question the need to go for devcrit on a build that does SO MUCH DAMAGE already with a weapon like a Kama. The threat range isn't the best, and even Keened it's only 18-20. Devcrit comes in place of a much more logical choice for the class combo in EWS, which gives a damage bonus on every attack. Against FEs, you'll probably do so much damage already on a crit, that it'll be devastating without Devcrit anyway.<br/>\n<br/>\n I did notice, however, that on Ranger 15 you didn't pick a Favored Enemy. I don't recall, but is EWF among the possible feats to take with a Ranger bonus feat? Wasn't it just Epic Prowess? <br/>\n<br/>\nOther than these considerations, its quite a good build. Let's see how you take this :D<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:30 AM - Jul 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Max!<br/>\n<br/>\nExcellent thoughts - which I'll hopefully take well!<br/>\n<br/>\nIt was a couple of years ago when I was looking at a Ranger 20/ Monk 10/ CoT 10 build (now the aforementioned Crimson Nun of Pain) when your good self proposed a Ranger 26/ Monk 10/ Fighter 4 variant, and it was an idea I wanted to try out when going over some old ground - maybe I didn't interrogate the split enough back then (ah, the naivety of youth, eh?). Indeed, my taking of Expertise at level 1 was meant as a tribute to you! And, much as the Crimson Nun was a Dev Crit build, I thought this should be as well, and didn't put any great thought into it.<br/>\n<br/>\nJust as a quickie, yes, EWF is available as a Ranger bonus feat in epic levels (at least, it is in the Halls of Advanced Training and on the wiki) as well as Epic Prowess. That was a decisive factor in delaying Ranger 15 until level 21 (along with wanting the KD twins pre-epic, so necessitating 6 levels of Monk before level 20).<br/>\n<br/>\nBut, and assuming maintaining Dev Crit, in epic levels the 20, 23, 25 and 26 Ranger bonus feats could encompass EWF, Epic Prowess and Bane as well as one more FE (still making 5 overall). That's assuming your preferred Ranger 16/ Monk 4 pre-epic split, btw. Now - and I'm quite open to this - taking Ranger 26/ Monk 8/ Fighter 6 allows me to grab WS/ EWS/ OW Crit/ Dev Crit. As you say, that leaves Armor Skin floating away in the breeze, and I'm not too fond of that, so really wouldn't want to drop my starting Dex stat down. If anything, as I mention above, I may be more tempted to drop 1 starting point from Strength, take 2 more in Dex and 1 in Int, then leaving a spare epic feat for AS.<br/>\n<br/>\nDoes that work for you as a compromise? With me going Ranger 26/ Monk 8/ Fighter 6. Oh, and I'll try to come up with a non-Dev Crit version as well.<br/>\n<br/>\nSee, I can take advice! Or at least listen to it...<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, forgot to include this: I meant to say that I have no problem moving Monk1 back to level 7 and taking WF:Kama at level 9 (at Monk 2), then taking the other Monk pre-epics at 12 and 17. But I'd be reluctant to delay the weapon focus until level 12.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:20 PM - Jul 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, wise old uncle Max was right (no big surprise). I've just built a Ranger 26/ Monk 8/ Fighter 6 on paper and run him through the HoAT to check its viability, and it works. Somewhat counter-intuitively, by dropping my starting Str by 1 and finishing Str by 2 (making 32), not only do I keep the same AB, but the damage rockets to 1-6+17 and 1-6+11 for the off-hand, which is +5 on both hands over my original post's. Of course, this is down to also taking WS/EWS and bumping my BAB by 1.<br/>\n<br/>\nAlso, because I lost 1 point from my starting Str, I was able to add 1 to Int (giving an extra 40 sps - I'm thinking of taking some Search and cross-classing Disable Trap atm) and 2 to Dex, which allowed me to keep the same AC despite losing 1 from not taking Monk 10 - as well as bumping the Reflex save by 1. I know - it's like magic!<br/>\n<br/>\nThe only losses are 10% of speed and Imp Evasion, and the Dev Crit DC drops to 41. Oh, and a delay in taking Ow and Dev Crit.<br/>\n<br/>\nI could post the amended version now, but I'm still pondering whether to go for WS/EWS before or after Ow/Dev Crit.<br/>\n<br/>\nThanks a lot, Max!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:47 PM - Jul 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you go for Devcrit, you should definitely go for it ASAP, because it'll be very useful. The loss in DC will be minor, because you'll most likely only devcrit low-fort types, like mages and such, but you should absolutely go for Bane of Enemies as soon as possible.<br/>\n<br/>\nSince you're feeling a bit creative with the building alternatives, why don't you, just as a learning experience, build the optimal version just for comparison?<br/>\n<br/>\n26/6/8 with as many FEs as possible, and that tweak of dropping STR to 16 and pumping INT and DEX. you'd have just enough feats to squeeze WS / EWS without losing anything. your loss would basically be only in terms of having KD / IKD before level 37. But the end result would be the same, only improved. it should be a nice exercise.<br/>\n<br/>\nas for not taking WF before 9, it's just 1 AB. Not that big of a deal.<br/>\n<br/>\nIt's nice to see you opening up to optimization. And it's all in my Complete Guide to the Basics of Building.<br/>\n<br/>\n1- optimize the spread.<br/>\n<br/>\n2- optimize the stats<br/>\n<br/>\n3- optimize the leveling order (by defining priorities, respecting the Rule of 4, knowing your classes)<br/>\n<br/>\ngo back, re-check everything and if none of the further steps interfere with the previous ones, then the build should be ready for fine-tweaking. something I always try to do is to leave my builds in the unfinished folder for later review and a new \"fresh look\" later on. That Fighter / CoT / Rogue I built for Tychovellius is still sitting there for further revision.<br/>\n<br/>\nCheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:43 PM - Jul 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Max!<br/>\n<br/>\nWhile I'll probably take the middle route for the final build here, I will go get some more paper and try the optimized split as well (the Ranger 26/ Monk 6/ Fighter 8 one) as an exercise. It's a bugger for me in two respects: in my very early days I wasn't that bothered about KD/IKD, but as time passed and wiser heads kept beating on me, I began to use it and appreciate it, so dropping it back to 37 now gives me an itch. The other thing is that, while I was building the 26/8/6 version, I found myself wondering why I was taking 4 levels of Monk pre-epic rather than just 3 (except for the +1 to Will and Reflex saves it brings over Ranger), which made me think that maybe only 6 levels of Monk was needed after all. And you know how good I am at accepting change ;).<br/>\n<br/>\nI had already settled (in the compromise option) on taking Dev Crit before WS/EWS - with BoE wedged between them (Dev at 28, Bane at 31, EWS at 36). Taking 8 levels in Fighter means I can free either EWF or Epic Prowess up to become another Ranger FE (thus 6).<br/>\n<br/>\nIn any case, I'll see what I can do.<br/>\n<br/>\nSeeing as you signed off with a Cheers, I'll sign off with a Take it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:04 PM - Jul 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Now that was interesting. <br/>\n<br/>\nI'll give the minuses that I found first. Not taking KD/IKD until level 37, losing 1 to all saves, and a fewer skill points (but only 4).<br/>\n<br/>\nOn the plus side: 1 more FE, 4 more HPs (yee-ha!), earlier Bane (level 26), earlier EWF (23), and earlier WS/EWS (30 and 32 respectively).<br/>\n<br/>\nAB and AC remained the same.<br/>\n<br/>\nIrritatingly, this actually does seem a better build - and actually very playable as well, with a few play-style modifications on my part.<br/>\n<br/>\nThere are times when learning really pisses you off. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:30 PM - Jul 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Learning can piss you off allright, especially when you're trying so hard to contest the knowledge bestowed upon you and suddenly realize you must, for the sake of reason, begrudgingly say: \"touche!\" and heartily hear: \"I told you so!\". heheh<br/>\n<br/>\nJust so you know, and I must say this for the sake of coherence, your initial build (with a few modifications) would actually be more playable on WoG than mine due to the usefulness of KD / IKD, given the hardships one faces there, but both would be incredibly hard to play, as is anything with low AC when you face hyper-powerful competition. <br/>\n<br/>\nI've always found UMD to be necessary in low AC builds, due to the inability to stand in front of enemies, and never succeeded in leveling a low AC no UMD toon on WoG. I have played Daelan Red Tiger all the way to level 15 on WoG, but after that, without having UMD items to get around, like wands of II and SS, to at least have some form of DR to combo up with a belt, I can't seem to find alternative ways of killing some enemies without blowing through all my Heal potions and having to spend the next 3 weeks restocking.<br/>\n<br/>\nWith that in mind, please allow me to ask you, just to get you brainstorming. How would you face the following encounters at the appropriate level with this build:<br/>\n<br/>\n1- At level 8-10, you'd face off against a Bugbear Chieftain. You'd have only a set of +2 items and most likely a +1 Kama or even 2 +1 ones with crappy properties, such as empty fields (+1, on hit Doom), or Imaskari Kama (+1, 1d6 Acid). I don't know his exact stats, but he has 2 (or 3, can't recall now) attacks per round and 18 AB, and something in the vicinity of 25-30 AC. He also has decent HP for the level, I'm guessing close to 100, perhaps even more.<br/>\n<br/>\n2- Around level 15-17, you'd take on the Bandit King \"Hugo the Axe\". He has low AC, like around 30, because he wears a +4 Breastplate and wields Greataxe with Dispel on hit and crits for over 100, and a +5 STR belt, which he drops on death and is the reason you'd go kill him in the first place. His AB is around 32 and he has 4 attacks per round. He also has a level 16 Mage pal and two War Troll guards who protect the mage. But you can face each of them separately. You should at this point have a set of +3 items, except for boots of dodging, which should be +2, and your only means of Hasting yourself would be a Haste potion with a Caster Level of 10 (lasts 10 rounds). It's also worth noting that Hugo's Will save is abysmal.<br/>\n<br/>\nSo, how would you tackle these two encounters with this build, given that you have no UMD to use scrolls? I'm actually curious, not trying to be an ass.<br/>\n<br/>\nTake it EZ! (to avoid copyright issues) :D<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:16 AM - Jul 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Maximillian Kane wrote:</cite>\nI'm not trying to be an ass.</div></blockquote>\n<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "1:58 PM - Jul 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Maximillian Kane wrote:</cite>\n<br/>\nSo, how would you tackle these two encounters with this build, given that you have no UMD to use scrolls?<br/>\n</div></blockquote>\nEveryone seems to forget the simple things that don't require UMD.   Tanglefoot bags to slow em down, choking powder to stun, caltrops to slow and slowly hurt,  fire flask to burn, etc.  Are they as good as Improved Invis and Stoneskin?  Nope..   but they do give you options.<br/>\n<br/>\nI also noticed in the build that although a ranger, he has no trap skills.  I'd have to put a couple points into set traps just to give me options.  Having killed the critters Max mentions in those two examples, I can tell you that being able to set even low level traps can quickly even the playing field.<br/>\n<br/>\nEven Fire giants and ogres in UnderMountain fall to 40-50 consecutively placed minor acid splash traps.  And a lvl 3 toon walks out lvl 8 with a shiny new Mirror Shield...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:00 PM - Jul 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>conlaoch wrote:</cite>\n<br/>\nTanglefoot bags to slow em down, choking powder to stun, caltrops to slow and slowly hurt,  fire flask to burn, etc.  Are they as good as Improved Invis and Stoneskin?  Nope..   but they do give you options.\n</div></blockquote>\nHey! You're giving away my secret weapons! How do I kill rats in Bracksworth? 2 bottles of Alchemists fire, one for each group of rats.<br/>\n<blockquote><div> Having killed the critters /snip/, I can tell you...\n</div></blockquote>\nIsn't that true. When you play a mod, you learn how to handle its challenges.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:38 PM - Jul 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There you go, Max - I'd do what conlaoch and Mick advise! (Thanks, both. Without your input, my opening line would have been to be where those two weren't pdq and come back later.) A little patience and taking sage counsel can work wonders!<br/>\n<br/>\nI'll also try a skills split that includes some Search, Disable and Set Traps now I've got my extra skill points. I'm thinking of sticking with the middle, compromise, build, but want to test it in \"real life\" first.<br/>\n<br/>\nCheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "8:38 PM - Jul 18, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Enjoy and let us know how he does!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:35 PM - Jul 19, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I had a closer look at the Ra26 M10 F4 build, and then how to make a Ra16 M8 F6 build. I like the first better, even if the second ends up being more powerful with EWS.<br/>\nWith the first one you get a much earlier IKD. You also get earlier Dev Crit. The weakness of the build, the low AC is best covered with regular Tumble dumps. More Monk levels improve the freedom here when you want to take monk 6 early for IKD. An early Monk 5 also adds a welcome +1 to AC. But you also want Ranger 1 for Dual wield, Ranger 6 for an animal companion and more Ranger for ITWF and spells. The build is best played where you have potions and items that improve AC, Dex and Wis.<br/>\n<br/>\nWith the second build you need more epic feats and want IKD, Bane, EWF, WS, EWS, O Crit and Dev Crit ASAP. You also want EP, AS, 6 G Str, and a FE.<br/>\nYou must take EWF and EP as Ranger bonus feats. AS, O Crit, Dev Crit, WS and EWS are available as fighter bonus feats, but you are going to take one of them on a general feat slot. The other general feat slots are for G Str.<br/>\nYou cannot get EWS before you have EWF (from a Ranger bonus feat at Ranger 20) and 4 Fighter Levels or more. And you cannot take O crit and Dev crit before you have enough strength. There is room for everything, but you cannot get everything early and at once!<br/>\nI was able to take IKD at level 27 and Dev crit at level 28. EWS came after that. Bane was pushed back to level 36. You cannot avoid a 20 % XP penalty, at least at some levels.<br/>\n<br/>\nMost of the time I would prefer to play a build with early IKD and Dev Crit, like the first one and sacrifice EWS, especially in a 9 APR strength build with Bane, and in mods where you get mid magic weapon enhancements or better.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:01 PM - Jul 19, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Mick, as ever!<br/>\n<br/>\nI'm still taking the first build round SoU/ HotU/ SoF, but I'm also trying my second version out in the OC/ MoTS for compare and contrast purposes.<br/>\n<br/>\nWithout spending an age typing out the Ranger 26/ Monk 8/ Fighter 6 in full just now (I'm a slow typist and input here direct from my pnp workings-out), I'll just say I did manage IKD at level 22, EWF at 27, Dev Crit at 28, BoE at 31 and EWS at 36.<br/>\n<br/>\nThat was with a pre-epic Ranger 16/ Monk 4 split, then in epic levels: Monk 5 and 6; Ranger 17; Fighter 1; Ranger 18, 19 and 20; Fighter 2; Ranger 21, 22 and 23; Monk 7; Fighter 3, 4, 5 and 6; Monk 8; then the final three levels of Ranger.<br/>\n<br/>\nWith the first build, I'm tempted to try and get Bane earlier - asap after Dev Crit, but we'll see how the play-through goes. Glad you still like it, though!<br/>\n<br/>\nCheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "7:41 PM - Jul 19, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is actually the part where building style comes into play, Mick, and maybe even mindset. If you're spending the whole time until you get IKD thinking (Damn! This fight would be much easier if I had IKD), then it'll feel like forever and you'll tend to favor playability over power. If, on the other hand you keep thinking (I can't wait to reach level X so I can get IKD! It'll make things much easier), then you'll remain excited to keep playing it so you can get there. As a guy who does exactly that (puts himself through more difficult scenarios, so I can both remain interested in my builds and also make them \"the best they can be\", kinda like graduating with straight A's as opposed to settling for B's), I propose the following question: If you know that a build will be more powerful by making a certain choice, but it'll take it longer to mature, and if you know that you DO POSSESS the skill as a player to get it there, then why not do it? Why not demand more from yourself as a player in terms of tactics and even in-game decisions, making yourself into a better player and improving your \"bag of tricks\", even if it is harder to get there? As Buddha used to say, there is no growth without pain..<br/>\n<br/>\nLater, folks!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:25 PM - Jul 19, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It is indeed a question about mindset Max! I enjoy playing this game. If I put effort into building a character that I am going to play from level 1 to 40, I want it to work well as much of the time as possible. If it is a pain to play from level 1 to 30 and it is a god in the end game, I only get to enjoy its power 25% of the time, whereas I would have a good character 75 % of the time if it worked well from level 1 to 30 and less well after.<br/>\n<br/>\nI have no problem making bad builds if I want a challenge. And I often do that simply because I enjoy the challenge. But I don't feel I have to earn things by playing challenging builds.<br/>\nI do understand the concept of \"no growth without pain\". But it is not always true. Curiosity is not painful. And you can discover many things while having fun. <br/>\nBut after all, playing this game is not supposed to be school or work or chore.<br/>\n<br/>\nAs for this build, it is perhaps sub optimal, but not bad without EWS. The AC weakness is most tangible early on, before you get items with properties that can cover it. Therefore early offense and early power is important.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:20 AM - Jul 20, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It is also a matter of where you are playing. If you are playing on a server where leveling is just a preliminary and the main game starts at level 40, then you should definitely build for level 40 power. If you are playing single-player where the game is almost over at level 40, if you even reach level 40, then playability becomes more important.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "11:30 PM - Aug 15, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice story, Stag! Hope you will share the final version of your build one day.<br/>\n<br/>\n@Max, Mick and Empyre: I know both the feel of looking forward to the level when I finally will get this fancy feat and how that keeps me going sometimes, and how annoying it can be when you spend hours with tedious work. And when you finally get the good stuff, you think: 'darn, could have needed that earlier'. And, of course, Empyre is right: it depends on where you are playing, in most single player modules you want a bit of the power during the whole game or at least still in the first half, not after you have beaten the final Boss and the game is over.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Ant_",
      "avatar": "no_avatar.png",
      "timestamp": "3:32 PM - Mar 18, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was playing around with a similiar Ranger.<br/>\n30 Ranger 6 Monk 4 Fighter<br/>\nStarted out as an Elf Ranger with the following stats:<br/>\n<br/>\nStr 14<br/>\nDex 17<br/>\nCon 10<br/>\nWis 14<br/>\nInt 14<br/>\nCha 8<br/>\n<br/>\nAll attribute points into DEX. Went pure ranger pre epic to max out BAB and FE.<br/>\n<br/>\nIn the end the Charachter had Dex 32 with Great Dex V, 8 FE with BoE, AS, WF/EWF, EP, WS/EWS. <br/>\n<br/>\nLooks good but even with capped str, dex and wis bonuses from gear, if something like that is even possible, the Charachter still lacks uncanny dodge. Is a Charachter like this realy playable, anyone got expirience with something similliar?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:20 PM - Mar 18, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That will largely depend on your environment imo.<br/>\n<br/>\nIF you can lure and slay (lure one enemy, then kill it away from others), sure.  It will work just fine.<br/>\n<br/>\nIF you are in an environment that has some sort of swarm AI (like WoG does in some areas) OR in an environment that pits you against a horde of foes at once without any chance of avoiding it, then I think your AC is going to plummet, and you are going to get mega-ganked without having some sort of DR protections vs whatever damage they deal.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}