{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "946",
  "name": "Arelith Paladin Build, Help Appreciated.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-paladin-build-help-appreciated-t2354929.html",
  "author": "Mal",
  "avatar": "10758943_1532627788.png",
  "replies": "14",
  "views": "2.7K",
  "posts": [
    {
      "author": "Mal",
      "avatar": "10758943_1532627788.png",
      "timestamp": "7:50 PM - Jul 26, 2018",
      "content": "<div>Hi I am rather new to character building and this is my first attempt at making a build, any advice would be appreciated.<br/>\n<br/>\nThe concept is a Human Paladin defender with high AC to protect allies and ability to buff himself with paladin spells and rely on his divine abilities (might and shield)<br/>\nThe focus is mainly PvE/PvM but the ability to stand ground in PvP would be nice.<br/>\n<br/>\n<strong>Before I begin there are a few self imposed restrictions I need to mention:</strong><br/>\n<ul>\n<li>Character must be human</li>\n<li>Character must have access to all paladin spells</li>\n<li>Bastard sword preferred weapon</li>\n<li>Shield user</li>\n<li>I will be partying up with a character with high spot and listen.</li>\n</ul>\n<strong>Arelith changes:</strong><br/>\n<ul>\n<li>Characters must have at least 3 levels in a class before multi-classing.</li>\n<li>Paladins gain 1 hard wisdom per 7 levels.</li>\n<li>Bards can be Lawful/Good alignment</li>\n<li>2 gifts can be applied to the character (+2 in a stat)</li>\n</ul>\n<strong>My class idea in a nutshell is Bard(4)/Paladin(16)/CoT(10)</strong><br/>\n<br/>\n<strong>Starting stats:</strong><br/>\n<br/>\n15 Str (17 with gift)<br/>\n8   Dex<br/>\n12 Con<br/>\n14 Int (access to Expertise)<br/>\n12 Wis<br/>\n15 Char (17 with gift)<br/>\n<br/>\n14 Str (16 with gift)<br/>\n8   Dex<br/>\n14 Con (ignoring toughness feat)<br/>\n14 Int access to Expertise)<br/>\n12 Wis<br/>\n15 Char (17 with gift)<br/>\n<br/>\nFor the sake of cleanliness I will add skills at each class's final level<br/>\n<br/>\nLevel 1: Bard - [Blind Fight] + [Power Attack] (I am under the impression Blind fight is a necessity on Arelith) <br/>\nLevel 2: Bard<br/>\nLevel 3: Bard - [Cleave]<br/>\nLevel 4: Paladin +1CHA<br/>\nLevel 5: Paladin<br/>\nLevel 6: Paladin [Divine Might]<br/>\nLevel 7: Paladin<br/>\nLevel 8: Paladin + 1 CHA<br/>\nLevel 9: Paladin [Divine Shield]<br/>\nLevel 10: Paladin (Arelith Wisdom +1)<br/>\nLevel 11: Paladin<br/>\nLevel 12: Paladin +1CHA [Weapon Prof Exotic]<br/>\nLevel 13: Paladin<br/>\nLevel 14: Paladin<br/>\nLevel 15: Paladin [Weapon Focus - Bastard Sword]<br/>\nLevel 16: Paladin +1CHA<br/>\nLevel 17: Paladin  (Arelith Wisdom +1)<br/>\nLevel 18: Paladin [Great Cleave]<br/>\nLevel 19: CoT<br/>\nLevel 20: CoT +1CHA [Improved Crit - Bastard Sword]<br/>\n<br/>\n<strong>(This is where I gain confusion as to what feats are preferred to take)</strong><br/>\n<br/>\nLevel 21: CoT [Great CHA +1]<br/>\nLevel 22: CoT [Armour Skin]<br/>\nLevel 23: CoT<br/>\nLevel 24: CoT +1CHA [Epic Weapon Focus - Bast Sword][Great CHA+1]<br/>\nLevel 25: CoT<br/>\nLevel 26: CoT [Epic Prowess]<br/>\nLevel 27: CoT [Expertise]<br/>\nLevel 28: CoT +1CHA <br/>\nLevel 29: Paladin <br/>\nLevel 30: Bard (Tumble +30) (UMD 33)(Conc 33) (Heal 33) (Disc 30) (Taunt 20)<br/>\n<br/>\nThat is a rough idea of my Build.<br/>\n<br/>\nFinal Stats <br/>\n<br/>\n307 HP<br/>\n17 Str                                              16 Str<br/>\n8  Dex                                              8 Dex<br/>\n12 Con                                            14 Con<br/>\n14 Int                                               14 Int<br/>\n14 Wis                                             14 Wis<br/>\n26 Cha                                             26 Cha<br/>\n<br/>\n<strong>My questions roughly boil down to...</strong><br/>\n<ol>\n<li>Is [Expertise]/[Improved Expertise] worth it? If not should I take points off INT?</li>\n<li>Should I aim to get [Knockdown] or ]Improved Knockdown]?</li>\n<li>Is Toughness worth it?</li>\n<li>What Epic feats should I pick? I am unsure of [Armour skin], [Epic wep focus] and [Epic Prowess] as opposed to adding more CHA</li>\n<li>What Bard spells to take? (Full cantrips/ 3x Level 1 spells/ 2x Level 2 Spells.</li>\n<li>Is it worth Losing Bard for Rogue sneak attack?</li>\n<li>Am I losing too much in taking exotic weapon feat over a longsword?</li>\n</ol>\n\nIn terms of Bard spells I was leaning towards.<br/>\n<br/>\nLevel 1 Spells<br/>\nMage Armour<br/>\nExpeditious Retreat<br/>\nProtection from Alignment<br/>\n<br/>\nLevel 2 Spells<br/>\nSilence<br/>\nCats Grace (to add +2 AC to reach +1 Full plate Dex bonus. Also to buff my dexterity based friend)<br/>\n<br/>\nAnd that's the main jist of things. Any advice on my build would be greatly appreciated.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:40 AM - Jul 27, 2018",
      "content": "<div>Where do I start...<br/>\nPaladins are a MAD class and the restricted environment that you play isn't helping but we will try to do the best we can, as always.<br/>\n<br/>\nInstead of trying to repair your build it is much easier to give you a proposal and then you can tell us if it is to your liking. But first, let me answer some of your questions.<br/>\n<br/>\n1. Yes, it is worth it but you don't have the feats to take them.<br/>\n2. Same as above, plus we don't know if it is common for the enemies to have KD immunity or if there are items such as rogue's hood available.<br/>\n3. No, unless you have feats to spare.<br/>\n4. AS is mandatory, EWF &amp; EP even more so for any fighting character.<br/>\n5. Not much that you don't know already, MA, UV &amp; Cat's are the best, buffs mostly since you can't cast in combat any arcane spell that isn't verbal only.<br/>\n6. Rogue would also give you evasion but I don't know if it is crucial to your character. A couple dice of sneak attack is alright to have but not necessary.<br/>\n7. Exotic isn't worth it in this build, you have many more crucial feats to take and you don't have the feats for all of them.<br/>\n<br/>\nHere is a rough prototype for you,<br/>\n<br/>\nPAL 20/ BRD 4/ FTR 6 (Epic)<br/>\nPAL 12/ BRD 3/ FTR 5 (Pre-Epic)<br/>\n<br/>\nSTR:  16 +2 (Gift)/ <strong>18</strong><br/>\nDEX:    8<br/>\nCON: 12<br/>\nINT:   10<br/>\nWIS:  12 +2 (Pal)/ <strong>14</strong><br/>\nCHA: 16 +2 (Gift) +8 (Levels + Feat)/ <strong>26</strong><br/>\n<br/>\nPre-Epic Feats: Weapon Focus, Weapon Specialization, Improved Critical, Blind Fighting, Power Attack, Divine Shield, Divine Might, Extend Spell, Extra Turning, Craft Wands.<br/>\nEpic Feats: Epic Weapon Focus, Epic Weapon Specialization, Epic Prowess, Armour Skin, Great Charisma I.<br/>\n<br/>\nHP's: 324<br/>\nAB: 32/ 27/ 22/ 17<br/>\nDMG: 1d8 +10/ 17-20 x2<br/>\nSkills: Discipline: 33 (37), Tumble: 30, Taunt: 33 (41), Perform: 1 (9), Heal: 16 (18)</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:00 AM - Jul 27, 2018",
      "content": "<div>Keep in mind that a different build with the same classes is also possible, (Bard 16/ Paladin 6/ Fighter 8).</div>"
    },
    {
      "author": "Mal",
      "avatar": "10758943_1532627788.png",
      "timestamp": "4:11 AM - Jul 27, 2018",
      "content": "<div>Thanks for the response!<br/>\n<br/>\nThe restrictions sadly are for immersive purposes and to me not negotiable. I make my characters with race and class in mind before anything.<br/>\n<br/>\nDo I want to be a paladin? Yes.<br/>\nDo I want to be human? Yes.<br/>\nTo me I don't feel like a Paladin when a character (made up example) is say 29 Bard/1 Paladin I feel like a Bard who is a wannabe paladin. Hence the desire for the paladin spell-slots.<br/>\n<br/>\nThen from there create a character around that. I dislike when it is suggested I choose a different race for min/maxing. (Not that anyone suggested that but you get the point.) I want to be a human paladin but be the best I can with the hand I've been dealt.<br/>\n<br/>\nThe bastard sword however was less important to me and just wishful fantasy. I can live with the long-sword.<br/>\n<br/>\nI took note of the feats you mentioned and am currently building the character you suggested for trial. I do however wish to offer an altered version of my original idea but with the feats you suggested for scrutiny and will post details as soon as I finish testing.</div>"
    },
    {
      "author": "Mal",
      "avatar": "10758943_1532627788.png",
      "timestamp": "4:26 AM - Jul 27, 2018",
      "content": "<div>With the 20/4/6 build you suggested I did have the option of 2 extra feats. 1 at pre-epic and 1 post epic. With choices of cleave/great cleave, or knockdown/IK.  Or would this open potential for a bastard sword user with Exotic + cleave.<br/>\n<br/>\nI appear to have ended up with slightly different stats too.<br/>\n<br/>\n314HP<br/>\nWith basic longsword - 1d8+6<br/>\n<br/>\nThe extra spellslots given by the last 4 levels in Paladin are welcome though.<br/>\n<br/>\nI took inspiration and tried a 4Brd/20Pal/6CoT with the same stats, feats and AB output</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:57 AM - Jul 27, 2018",
      "content": "<div>I do like that, better be an organic character rather than a cookie-cutter one.<br/>\n<br/>\nThe damage is from strength (+4) and epic weapon specialization (+6)  total of 10.<br/>\nHit points should be 260+24+40= 324.*<br/>\nAC should be 17 naked then 28 with full combat (non-magical) gear but really 30 with an easy 12 dexterity.<br/>\n<br/>\nGreat cleave is one of the most useless feats out there, we take it only when we go for dev critical and never otherwise.<br/>\nEven regular cleave while nice is nowhere in the same tier as the rest of the feats in the build.<br/>\nYou can take bastard sword if you like, if you aren't used to wands then take that out and go for exotic weapons instead.<br/>\nDon't take non-epic feats in epic levels if you can help it.<br/>\n<br/>\nEdit: *It is a level thirty build so HP's should indeed be 314.</div>"
    },
    {
      "author": "Mal",
      "avatar": "10758943_1532627788.png",
      "timestamp": "5:27 AM - Jul 27, 2018",
      "content": "<div>After remaking again I found the error I had made I missed out epic weapon specialisation and that is the extra epic feat I mentioned. And yes my AB is now a +10 instead of 6!<br/>\nThis also appears to be something my Champion of Torm build misses out on.<br/>\n<br/>\nThere does however appear to still be a pre-epic extra feat.<br/>\n<br/>\nOptions I find notable include Knockdown, Cleave, Exotic weaponry, Toughness, Empower spell, Various Saves and energy resistance. Or if I stat into 13/14 int I could take Expertise, leave out wand crafting and take Improved I/E for maximum AC.<br/>\n<br/>\nI do however like the idea of this build. It presents a more martial feel to the paladin while not being associated with only one deity. And allowing more spell slots for me to use.<br/>\n<br/>\nMy last question would be in regards to skill points, I am not fully aware of how useful these are in game or Arelith terms. I was under the Impression UMD was very worthwhile if it could be taken. And concentration I suppose is not worth it?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:41 AM - Jul 27, 2018",
      "content": "<div>Yes, UMD is very good, replace the skills with:<br/>\n<br/>\nDiscipline: 33 (37), Tumble: 30, Taunt: 32 (40), Perform: 1 (9), UMD: 17 (25)</div>"
    },
    {
      "author": "Mal",
      "avatar": "10758943_1532627788.png",
      "timestamp": "6:09 AM - Jul 27, 2018",
      "content": "<div>I guess this will be my semi-last post on the topic, Everything seems good. I experimented with a 4rd/20Pal/6CoT build vs the fighter build. And here are the results.<br/>\n<br/>\nCoT build offers 1 extra post Epic feat as it does not have [epic wep spec]<br/>\nSaves of 28/24/26<br/>\nAB 32/27/22/17<br/>\n1dX+4<br/>\n<br/>\nFighter offers<br/>\nSaves of 27/20/23<br/>\nAB 32/27/22/17<br/>\n1dX+10<br/>\n<br/>\nIt appears to be a tradeoff of +6 damage vs 1 extra Str or CHA (that could possibly be exchanged for 2 const or int) and slightly better saves.<br/>\nor possibility of a normal feat.<br/>\n<br/>\nMy thinking is sacrificing 1STR + 1 CHA at beginning for 14 int would allow Both Ex/ImpEx to be taken in the CoT build along with some skills.<br/>\nBut this extra AC comes with the following...<br/>\n<ul>\n<li>A -7 damage penalty (Loss of 1Str mod and [epic wep spec])</li>\n<li>CoT saves at 27/23/25</li>\n<li>AB 31/26/21/16</li>\n</ul>\n\nCould I have your final opinion please if you (don't)believe extra skills, increased save and Ex/ImpEx are worth a tradeoff of the above losses?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:27 AM - Jul 27, 2018",
      "content": "<div>Go with Fighter.<br/>\n<br/>\nReasons are simple, COT is best when taken for at least 10 levels and you can utilize his Divine Wrath, otherwise, with only 6 levels you only gain minimal bonuses and Fighter is better. Your saving throws will be very good since in-game and with the aid of your spell buffs you will sit at 38 charisma making them even better (33/26/29 plus attribute bonuses).<br/>\n<br/>\nCOT would be better with your original idea (16/4/10) but then you would lose your extra spell slots.<br/>\n<br/>\nHope I helped, although I have no experience on that server apart from what we hear from players in this forum and the occasional reading of their Wiki.</div>"
    },
    {
      "author": "Mal",
      "avatar": "10758943_1532627788.png",
      "timestamp": "6:35 AM - Jul 27, 2018",
      "content": "<div>Alright thankyou again for the help!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:03 AM - Jul 27, 2018",
      "content": "<div>You edited your post but it's alright, I will answer to what I haven't yet.<br/>\n<br/>\nYou assume that expertise is going to make you a true defender of the realms and it is somewhat true, this is a good feat for \"normal\" warriors. In your case though, you already have a holy warrior with plate &amp; shield and full tumble and UMD, that alone puts you on par with a good defensive warrior. Let them make use of expertise and lose 5AB in order to gain 5AC, that is NOT your way. Your Paladin with his awesome charisma can raise his AC upwards to 14! points without losing ANYTHING from his AB just by making use of the Divine shield. Now THAT is the Paladin's way! You are not going to use it all the time but you are sure to use it when it matters. You have 17 (23) turn undead uses to fuel those Divine Feats, make good use of them and nothing will be able to hurt you. <br/>\n<br/>\nSo, to recap, expertise is a nice feat to have but nowhere near that important for you. More skills are always nice to have but you already have the most important ones, including \"taunt\", so I see little value to lower your AB in order to have more of them. And increased saves in a build with Paladin and a buffed 38 charisma...Let's just say that you simply don't need them. You can sacrifice \"craft wands\" in order to get your bastard sword and then you will have all that you wanted initially and more. Do not drop \"extend spell\" you need this for Divine Favour which is an awesome buff and one that you will use all the time, it's that good.<br/>\n<br/>\nHave fun,</div>"
    },
    {
      "author": "Mal",
      "avatar": "10758943_1532627788.png",
      "timestamp": "3:24 PM - Aug 03, 2018",
      "content": "<div>Sorry to bring up and old request but I have done some studying on the Arelith wiki and there are a few things I feel might need to be addressed.<br/>\n<br/>\nQuote from wiki.<br/>\n<br/>\n<strong>Use Magic Device</strong>: While UMD hasn't changed by itself, many items (specially racial items made through Crafting) have an increased UMD requirement to be wielded or worn.<br/>\n<br/>\nI may be wrong here but I believe there are some resting restrictions and health potions are not commonplace but healing kits are.  Should I lose 1 point of Str for 2 in int to allow for a Higher UMD and put points into Heal?<br/>\n<br/>\nI created a 30 build with the following:<br/>\n<br/>\n17 STR<br/>\n8 DEX<br/>\n12 CON<br/>\n12 INT<br/>\n14 WIS<br/>\n26 CHA<br/>\n<br/>\nDiscipline: 33 (36), Tumble: 30, Taunt: 33 (40), Perform: 1 (9), UMD: 33 (40), Heal 16 (18)<br/>\n<br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">EDIT</span></strong><br/>\n<br/>\nAfter further perusal I found that riding skill needs to be at least 6 to ride my paladin horse and that drinking health potions incur attacks of opportunity and flat-footedness. Healing kits however work in combat without penalty.<br/>\n<br/>\nI have hereby opted to use the 4/20/6 build you provided with 1 less STR given for 2 INT.<br/>\n<br/>\nDiscipline 33(36). Tumble 30. Perform 1(9), Heal 33 (35), Ride 6, UMD 17 (25) and Taunt 27 (35)</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:06 AM - Aug 04, 2018",
      "content": "<div>I don't advice you to drop strength more than that. If you need more intelligence then take it off from charisma instead where you have an overhead. <br/>\n<br/>\nSomething like (Str 18, Dex 8, Con 12, Int 12, Wis 16, Cha 24) and <br/>\n<br/>\nSkills: Discipline: 33(37), Ride: 6, Tumble: 30, Taunt: 33(40), Perform: 2(9), UMD: 18(25), Heal: 24(27) is what I would do.<br/>\n<br/>\nThe extra wisdom gives you another third level spell which is sorely needed for better spellbook management.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:24 AM - Aug 04, 2018",
      "content": "<div>Paladins also have \"lay on hands\" so when you have maxed-out your charisma you will be able to heal 260 hp's with a touch (once/ rest).</div>"
    }
  ]
}