{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "202",
  "name": "Aielund Sword Champion: Fighter 14/ CoT 20/ Rogue 6",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/aielund-sword-champion-fighter-14-cot-20-rogue-6-t2354534.html",
  "author": "AnotherSquarehead",
  "avatar": "10404082_1510287071.jpg",
  "replies": 15,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:15 PM - May 10, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello All,<br/>\n<br/>\n I present to you Huwen Drona, Sword Champion of Aielund. Huwen started life in the Unfinalized Builds section as a bit of fun over the Easter weekend (as I'm sure many other lives have begun) - the link being: <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354516/A-Bit-Of-Fun-Fighter-14-CoT-18-Rogue-8-DualWield#.V\" rel=\"noreferrer\" target=\"_blank\">nwnecbguild.forumer.com</a><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354516/A-Bit-Of-Fun-Fighter-14-CoT-18-Rogue-8-DualWield#.V\" rel=\"noreferrer\" target=\"_blank\">/topic/2354516/A-Bit-Of-Fun-Fighter-14-CoT-18-Rogue-8-DualWield#.V</a> (I've tried using the more curtailed and elegant link, but it doesn't seem to like me currently). That version worked fine for its initial intention, but I wanted to explore a little deeper. Thus...<br/>\n<br/>\n While I know the class combo is far from unique, Hip's filter doesn't seem to offer up anything quite the same. Mick Dagger's Halfling Champion was the inspiration, but given that Huwen is both STR-based and Human, and the split is considerably more CoT and less Rogue, I hope you'll agree that this is a build in its own right.<br/>\n<br/>\n I'd also better point out that Huwen is a build for Aielund (there's a clue in the title), so some things might look odd and/or surprising for other environments (particularly the skillset). I also know the skill allocation is messy, so any advice would be welcome. I'm assuming it's okay to put this sort of post here.<em> </em>I'm equally sure it'll be shifted elsewhere if it's not appropriate...<br/>\n<br/>\n As to what the build's all about...While I'm certain there are mightier, harder, sneakier, and definitely more magically and divine sourced builds out there, Huwen is a primer, if you will. He's designed to thrive throughout the early challenges of his youth, clear a space for himself in the forests of adolescence, and blossom in the high summer of his maturity. Cutting the crap, and ignoring the rotting in the autumn - or fall, he's playable throughout the campaign, and pre-epic in particular. I wouldn't recommend him as a soloist, however. (Though I know he cuts it solo in the OC. To be fair, I'm reliably informed, so would a frog in a frock or a toad in a tuxedo.) it may also be worth noting that one should be (within a level) at level 9 by the end of Act1 of Aielund, level 18 by the end of Act2, 24 by Act3's close, and finish at about level 36. I appreciate that Huwen hasn't done the final 4 levels, but let's be reasonable, eh?<br/>\n<br/>\n Right, nail-chomping begins now...Oh, and please let me know if I've omitted anything likely to give Hip a hissy-fit (scary beard-man), as well as anything else. Ta.<br/>\n<br/>\n<strong><em>EDIT2:</em></strong> Have now taken on board many of the comments below, though not all - at the risk of incurring collective wrath. I've also re-jigged level 34 onwards to reflect that this is an Aielund build, and thus effectively finishes at level 36. The first 9 levels deal with Part 1 of the saga, and with no helpful Rogue on standby, I decided to take on searching for and disabling those traps that come up. Post Part 1, Rogue effectively becomes a dump class, and is certainly not optimized - indeed, within this edit I'm moving Rogue 6 up to level 34, so I only miss out on +1 AC from Tumble. That said, this enables me to bring Epic Prowess forward to level 33, pushing Armour Skin back to level 38: figuring that an AB boost trumps half the AC loss at that point. I've also dropped Luck of Heroes for Expertise at level 1, but given that I'm reliably informed I'd underrated my saves anyway, 'ain't no big thing. As to weapons: there are many good Bastard Swords and Katanas in Aielund as well, though they would require WProf: Exotic, and in the case of BS, you're likely to have a companion who's fairly decent with them. Battle-axe would be a viable option, but, again, slashing. There don't appear to be a great number of top-end blunt weapons, so slashing and piercing appear to be the best deal to me. To reiterate this toon's purpose: he's not meant to flower at level 40, he's a bloke hired a get a barrel of beer from a pub up the road, and has to stay alive as assorted calamities happen to him. I believe this build accomplishes that...<br/>\n<br/>\n<strong>HUWEN DRONA</strong> - Aielund Sword Champion<br/>\n Fighter 14/ CoT 20/ Rogue 6<br/>\n Human - any non-Evil<br/>\n Levels 1-40, PvM<br/>\n<br/>\n STATISTICS<br/>\n<br/>\n STR 16 (32)<br/>\n DEX 15<br/>\n CON 14<br/>\n INT 14<br/>\n WIS 8<br/>\n CHA 8<br/>\n<br/>\n Hit Points: 456<br/>\n Sill Points: 269 - Concentration 28 (30), Disable Trap 12 (14), Discipline 43 (54), Heal 4 (3), Search 21 (23), Spellcraft 18 (20), Spot 41 (40), Tumble 35 (37), UMD 34 (33) - 14 spare<br/>\n Saves: (F/W/R) - 35/31/35 - +1R vs traps, +4 vs spells<br/>\n Sneak Attack: 3xD6<br/>\n AC: (naked) 22 <strong><span style=\"color:#FF0000\">[naked 10 + 2dex + 2as +7tum = 21, full plate 10 + 1dex + 2as + 7tum + 8arm = 28 (31 w/tower)]</span></strong><br/>\n BAB: 29<br/>\n AB: (max) 44 - melee; 40<strong><span style=\"color:#FF0000\"> [29bab + 2dex +1ep = 32] </span></strong>- ranged. Dual-Wielding - 42/37/32/27-42/37<br/>\n Damage: Longsword - 1d8+17 / Shortsword = 1d6+11<br/>\n<br/>\n LEVELLING GUIDE<br/>\n<br/>\n L1 - R1: Expertise / Power Attack / (Sneak Attack+1)<br/>\n L2 - F1: WF:Longsword<br/>\n L3 - F2: WF:Shortsword / Cleave<br/>\n L4 - F3: STR+1 (17)<br/>\n L5 - R2: (Evasion)<br/>\n L6 - F4: WS:Longsword / WS:Shortsword<br/>\n L7 - F5<br/>\n L8 - F6: Knockdown / STR+1 (18)<br/>\n L9 - R3: ImpCrit:Longsword / (Uncanny Dodge I / Sneak Attack+2)<br/>\n L10 - CoT1: (Lay on Hands)<br/>\n L11 - CoT2: ImpCrit:Shortsword / (Sacred Defence I)<br/>\n L12 - CoT3: Ambidexterity / STR+1 (19) / (Smite Evil)<br/>\n L13 - CoT4: 2-WFighting - (Sacred Defence II)<br/>\n L14 - CoT5: (Divine Wrath 1)<br/>\n L15 - CoT6: Blind Fight / Iron Will / (Sacred Defence III)<br/>\n L16 - CoT7: STR+1 (20)<br/>\n L17 - CoT8: Dodge / (Sacred Defence IV)<br/>\n L18 - R4: ImpKnockdown<br/>\n L19 - CoT9<br/>\n L20 - CoT10: Imp 2-WFighting / STR+1 (21) / (Sacred Defence IV / Divine Wrath 2)<br/>\n L21 - F7: GStr I (22)<br/>\n L22 - F8: EWF:Longsword<br/>\n L23 - F9<br/>\n L24 - F10: GStr II / EWF:Shortsword / STR+1 (24)<br/>\n L25 - F11<br/>\n L26 - F12: EWS:Longsword<br/>\n L27 - F13: GStr III (25)<br/>\n L28 - R5: STR+1 (26) / (Sneak Attack+3)<br/>\n L29 - F14: EWS: Shortsword<br/>\n L30 - CoT11: Epic Will<br/>\n L31 - CoT12: (Sacred Defence VI)<br/>\n L32 - CoT13: STR+1 (27)<br/>\n L33 - CoT14: GStr IV (28) / Epic Prowess / (Sacred Defence VII)<br/>\n L34 - R6: (Uncanny Dodge II)<br/>\n L35 - CoT15: (Divine Wrath 3)<br/>\n L36 - CoT16: GStr V / STR+1 (30) / (Sacred Defence VIII)<br/>\n L37 - CoT17<br/>\n L38 - CoT18: Armour Skin / (Sacred Defence IX)<br/>\n L39 - CoT19: GStr VI (31)<br/>\n L40 - CoT20: STR+1 (32) / (Sacred Defence X / Divine Wrath 4)<br/>\n<br/>\n SKILLS ALLOCATION<br/>\n<br/>\n L1 - DisTrap4/Heal4/Search4/Spell2/Spot4/Tumble4/UMD4 (Save16)<br/>\n L2 - Conc5/Disc5 (Save11)<br/>\n L3 - Conc1/Disc1/Spell1 (Save12)<br/>\n L4 - Conc1/Disc1 (Save15)<br/>\n L5 - DisTrap4/Search4/Spell1/Spot4/Tumble1/UMD3 (Save8)<br/>\n L6 - Conc2/Disc2 (Save9)<br/>\n L7 - Conc1/Disc1/Spell1 (Save10)<br/>\n L8 - Conc1/Disc1 (Save13)<br/>\n L9 - DisTrap4/Search4/Spell1/Spot4/Tumble5/UMD5<br/>\n L10 - Disc2/Spot1 (Save2)<br/>\n L11 - Disc1/Spell1/Spot1 (Save3)<br/>\n L12 - Disc1/Spot1 (Save6)<br/>\n L13 - Disc1/Spell1/Spot1 (Save7)<br/>\n L14 - Disc1/Spot1 (Save10)<br/>\n L15 - Disc1/Spell1/Spot1 (Save11)<br/>\n L16 - Disc1/Spot1 (Save 14)<br/>\n L17 - Disc1/Spell1/Spot1 (Save15)<br/>\n L18 - Spot1/Tumble10/UMD9 (Save6)<br/>\n L19 - Disc2/Spell1/Spot1 (Save6)<br/>\n L20 - Disc1/Spot1 (Save9)<br/>\n L21 - Conc11/Disc1/Spell1<br/>\n L22 - Conc3/Disc1 (Save1)<br/>\n L23 - Conc1/Disc1/Spell1 (Save2)<br/>\n L24 - Conc1/Disc1 (Save5)<br/>\n L25 - Disc1/Spell1 (Save7)<br/>\n L26 - Disc1 (Save11)<br/>\n L27 - Disc1/Spell1 (Save13)<br/>\n L28 - Search4/Tumble10/UMD10<br/>\n L29 - Conc1/Disc2/Spell1<br/>\n L30 - Disc1/Spot4<br/>\n L31 - Disc1/Spell1/Spot2<br/>\n L32 - Disc1/Spot3 (Save1)<br/>\n L33 - Disc1/Spell1/Spot1 (Save2)<br/>\n L34 - Search4/Spot1/Tumble5/UMD3<br/>\n L35 - Disc2/Spot2 (Save1)<br/>\n L36 - Disc1/Spot1 (Save4)<br/>\n L37 - Disc1/Spot1 (Save7)<br/>\n L38 - Disc1/Spot1 (Save10)<br/>\n L39 - Disc1/Search 1/Spot1 (Save11)<br/>\n L40 - Disc1/Spot1 (Save14)<br/>\n<br/>\n ...the apprentice shows a horseshoe to his master. He swallows in a dry mouth, but not just from the heat of the forge...<br/>\n<br/>\n<em><strong>EDIT</strong></em>: Have just noticed that this is almost a mirror version of Mick's Halfing Champion, which is a Rogue 20/CoT 14/Fighter 6 (apart from the race bit, obviously). I can only hope it's fit to stand on the same thoroughfare.<br/>\n<br/>\n<em><span style=\"color:#000000\">edit: per Hip 20160910 (corrections/additions of missing info, in</span></em><span style=\"color:#FF0000\"><strong> red</strong></span><em><span style=\"color:#000000\">)<br/>\n<br/>\n<strong>EDIT 3</strong>:</span></em><span style=\"color:#000000\"> On reflection, I decided it would be preferable to take both EWFs closer together, on the principle of \"You can't hurt what you can't hit\", so have delayed EWS: Longsword to level 26. Also, having recently attained level 37 before finishing Aielund, should this be repeated, I would be tempted to take a further level of Rogue for the final achievable Tumble points: thereby giving a further +1 to AC. It's not a guarantee, however, so I'd still keep Rogue 6 at level 34.</span><br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:38 PM - May 14, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You've really done a great job formating a complete, ready-to-go epic build, Stagmeister.  Congrats! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n Now, since the build already contains awesome saves (typical of most CoT combos), I'd dump LoH for an early <em>Expertise </em>so that you can dual-wield more safely during pre-epic.  Max always swore by Expertise and I have to admit, he was spot on. It's the most reliable means to get that +5 AC without needing to rely on equipment enhancements. When your toon is getting flanked, the AC has more proportional value than AB.  IMO ImpExpertise only has value in WM builds (or the odd shifter builds) due to huge AB penalty but the -5 version usually pays off well in the long run. Judge its utility according to your own melee playstyle and environment.<em>  Iron Will</em> seems justifiable due to the class split's intrinsic weakness in that area.  I would delay ITWF until the last pre-epic feat because that additional APR at -5 BAB is relatively insignificant.  In many feat-starved DW builds I skip it entirely for that reason.<br/>\n<br/>\n Get into the habit of drinking at least 1 of each pot of Cat, Endure and Owl just before each significant battle to glean the cheesy save boost from them.  If you are real lucky, that means +2 universal saves with mundane gear!<br/>\n<br/>\n Now to the skills...<br/>\n<br/>\n Is Taunting really that imposing in Aeilund?  If so, I understand the value of investing in <em>Concentration</em>.  But I still see a few re-allocable points.  Heal 4 buys you nothing but 4 HP and a slight increase in dealing with infections that you'll get a Take20 on anyway.  My own rule-of-thumb for the Heal skill is to either invest heavily (20+ points) or ignore entirely.  Before attempting a Heal kit check ALWAYS drink an Owl pot and equip any +WIS gear you may have been saving. That slightly better success chance can help and requires no design investment.<br/>\n<br/>\n You only need UMD 34(33) to cast all scrolls with 100% success so unless there is a crucial need to equip class gear valued well over a million gold, all those points are wasted.  That leaves you with 11 (4+7) spare points.  Set Traps 5(9) will net the +2 synergy to (and from) Disable which will simultaneously be boosted to 14(16) at that point.  Then, another 5 to Disable nets a level of 19(21) which will allow the toon to recover all deadly but Gas traps. Put the last point in Set for a final 6 (10).  At that point, you are very close to be able to set all deadly traps (but those crap Gas ones).  Use a combo of +DEX gear/Cat pots when you decide to set traps.  Maybe you even have access to some +skill jewelery to help reach the Set Trap breakpoint for deadlies at 15.  Keep checking the skill tab before you try setting a trap just to be sure.  If you have a cleric 5 or higher in the party (and spell control, naturally), have them cast a prayer (or a bard 6 or higher) and then don't dally setting traps.<br/>\n<br/>\n Or, if you are not interested in better trap management, shift those 11 points over to help your toon avoid Taunts better.  Your choice.  You know Aielund better than I do so it is your call.<br/>\n<br/>\n Seems like a keeper to me.  Good luck with your play-through!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:38 PM - May 14, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I never before heard of negative consequences for Great Cleave. I would think that it would have no effect unless you're killing like crazy, which I think would be a good thing. Is the problem that you don't get to choose who you attack next?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:02 PM - May 14, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>I never before heard of negative consequences for Great Cleave. I would think that it would have no effect unless you're killing like crazy, which I think would be a good thing. Is the problem that you don't get to choose who you attack next?</div></blockquote>\n<div align=\"left\">Yah, or run away, or chug a pot, or use heal kits, or switch weapons...  or anything. Heck, I'd even settle for AoOs as long as I could stop the animation.<br/>\n<br/>\n You can't always interrupt after round end like other attacks and Great Cleave can become strung out over more than one round depending on the toon's current APR (I remember one that lasted almost 3 rounds once).  At least with WW you can pick and choose an ideal situation by mode and prevent a potential disaster.  While your APR is low (like 1 or 2 per round), GC works pretty well to grab those \"freebies\" without much chance for iterations.  But a monk with 6 or more APR can get \"locked\" for a long, long time, auto-killing until fate runs its path. <br/>\n<br/>\n I've died while surrounded by a pack of relatively-easy-to-dispatch creatures whilst a DevCritter stood just outside the melee range, then it rushed in to take a swat when a space opened where a victim of GC dropped. I could see it closing but was unable to stop the great cleave animation from finishing up before the fatal shot landed.  The main problem is that as long as you keep killing in a single blow and enough low HP foes keep rushing in, the feat keeps triggering over and over without control.  Normally, that is a good thing because you can clear out cheapie mobs fast that way, but there is a downside.  Same deal when some archers with poison arrows spot me locked up.  Same deal when a mage appears from the shadows to cast a Bigby.  When your toon is tied up, the enemies in the periphery can do whatever they want.<br/>\n<br/>\n Generally, I am careful during recon to identify foes in the area, but some servers respawn enemies rather quickly so when you figure you've eliminated the most dangerous and begin to take on the next group, if the new battle goes on long enough, the nasty ones have time to reappear from behind and try to pinch your toon between the ones being fought and them.  Times like that, I would try to displace away from the whole mob to a distance, maybe go invisible or HiPS into stealth where I can begin to pull them apart piecemeal... but while the animation is playing, queuing any action becomes impossible.<br/>\n<br/>\n I take Great Cleave so few times that, when I do, I sometimes forget it is in my feat list and end up going too aggressive.  Plain Cleave breaks the free full BAB attack down to 1 per round max, so at the end of the round, you can still queue another action or maybe try to get another cleave if it is safe.  It would be nice (well, at least from my experience and perspective) if you could toggle between normal Cleave and Great Cleave as a modal like Expertise or Power Attack but alas, it works like it works so case closed as my bitchin' ends.<br/>\n<br/>\n Hey, if you've never been GC-locked, that's a good thing...  you play with perfectly-aligned karma.   Just carry on as usual.  But don't claim you were never warned. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /></div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:55 AM - May 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, now this is unfair! I've got so many responses to so many things and have only just come to terms with the quotey things!<br/>\n<br/>\n That being the case, the Great Cleavage (stop it, you know what I mean) question. Both of you (Hip and Empyre, in case anyone else is reading) have vastly greater playing experience than I do, but it's my thread, so I'm putting my two-penneth in (so there). As a predominantly \"rush in and hit them fast and often\" player - tactically suspect, I know - the first thing I do, before the aforementioned \"strategy\", is look who's around. Then I'll bob and weave to get to the meanest MF on the block first (probably down to my favoured Monk training, but CoT saves help, too). If, as in Aielund, you have solid support troops, Robert's your uncle and Fanny's a rude word, 'cos they'll handle the crowd control. Thus, Great Cleave is very much a hindrance (even the PC's own AoO can be).<em> I </em>want to be in charge of who's the victim of my wrath, after all. To be fair, I've only ever taken Great Cleave as a stamp on the Dev Crit passport (which of course is disabled in Aielund), so what do I know?<br/>\n<br/>\n I've lots more to say (what a surprise) on other comments, but not just now - RL beckons (well, bathroom, anyway). Except to say, good to see you're back, Hip!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:43 AM - May 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/> I know - the first thing I do, before the aforementioned \"strategy\", is look who's around. Then I'll bob and weave to get to the meanest MF on the block first (probably down to my favoured Monk training, but CoT saves help, too)<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">But that's exactly my point about Great Cleave.<br/>\n<br/>\n Let's say you charge into a mob when you spot that BMF intent on laying it on the ground via IKD.  Super.  Great plan.  The others around can't really hurt you that bad so you figure to just stand up to the pounding while eliminating the nastiest one.<br/>\n<br/>\n Now, let's say you miss the first 2 attempts because you are a god-awful dice roller like me.  Let's also assume that the BMF is having just as hard a time hitting your toon. The minions surrounding you will be making their feeble attempts to pierce your armor but one just happens to land a lucky blow with a 20 and does some damage.  What happens in that case is that, unless you quickly interrupt the flurry, the PC AI uses a function like GetLastAttacker to force your toon to suddenly turn toward the lucky minion and attack.  If your attack lands and happens to kill the critter, then GC begins to take over.  No more attacking the BMF, no more anything but watching the animation end.  As long as the flanker group is relatively small, the GC cycle will end with enough time to re-address the BMF again and still be alive... this time with all the pesky underlings dead. But that's for a small group, not one where the mobsters are trying to shoulder each other away trying to get an attack in on your toon.  That can get ugly with a boss whacking at you the whole time.<br/>\n<br/>\n So what GC ends up doing is replacing YOUR tactics with one of its own for a short period of time. Like a robo-toon.<br/>\n<br/>\n I complained about the PC AI over 10 years ago to the old Bioboards regulars on this exact issue and they insisted the PC AI was hardcoded and could not be altered.  But I'm not so sure about that today.  There have been vast improvements in just about every aspect of the game since then and I wonder if some server maybe has overridden the default PC AI, hardcoded or not.  Anyway... not to derail your build thread further.  Strange how a single comment can bloom into an entity of its own.  Now let's please return to our regularly scheduled program, eh? <br/>\n<br/>\n I want to read your thoughts about one of the more unusual kinds of DW builds, the multifocus CoT... this one I suspect to take advantage of a powerful weapon combo available in Aielund.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:32 PM - May 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>You've really done a great job formating a complete, ready-to-go epic build, Stagmeister.  Congrats! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n<strong><em>EDIT:</em></strong> Oops, forgot to mention on the GCleave thingy: yes, Hip, I was agreeing with you!</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:29 PM - May 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You should really mention if/where the build was tested.  The fact that you brought it all the way to Lvl 36 before posting it is worth its weight it gold.  I'd publish that fact along with a PROs/CONs section.  Since you have first-hand experience already, the advantages and deficiencies should be easy to identify and describe. <strong> I also would be interested to understand why you traded at least +2 AB in Grt STR feats to focus in 2 different weapons.</strong>  I am assuming there is both a longsword and shortword that are particularly attractive in Aielund and am dying to hear about the in-game effect using them in combo.<br/>\n<br/>\n You have misunderstood what a trainer is, Stagmeister.  It is a MODULE just like any other, not a utility.  There is no story, no quests, just building toons and testing combat and skills. The 2 modules I mentioned allow you to fast-forward your build concept by taking experience out of the picture. Levbel-test-level-test, etc.  Most trainers allow you to set the CR of the monsters attacking, which can be very useful.  Trainers are used primarily by builders who have an idea without any quantified proof of what the anticipated potential can do in-game and also to verify that what they draw out on paper can actually occur during gameplay. <br/>\n<br/>\n Well, as far as the rogue skills go, there just isn't much balance in your allocation, which why I mentioned how to round it off.  If you have no use for trap management, a rogue doesn't HAVE to get involved, can just take the damage and secondary effects like a tank I suppose.. so allocate them for what DOES matter.  Your Search rating is just high enough to spot epic traps if your toon tiptoes slowly. That's what 23 ranks buys you. If Aielund has no epics, then settle for a modified 21.  It is difficult to discern form your comments whether you want to play this toon as a rogue or just for Tumble and UMD dumps. <br/>\n<br/>\n BTW, your posted<em> Search</em> allocation is impossible.  It is INT-based, so it will gain +2 from the modifier. It cannot lose ranks.  I don't have time to add all your skill points up to se if they total right so you'll need to do the dirty work for us.<br/>\n<br/>\n Now, if all you want to do is disarm traps, then choose either 14(16) or 9(11).  The first level disables even gas traps, the second everything but. Any number in excess is just throwing away skill points.  If, however, you would like to recover as many deadly as possible to tame those tepid situations or sell for cash at the blackmarket, follow the method I suggested.  Set Trap 5 is just a way of opening up a combat strategy while gaining the +2 synergy across both skills.<br/>\n<br/>\n I recommend avoiding the common habit many player/builders get into by just tossing skill points out into skills that they think might come in handy rather than dedicated to achieve a certain purpose.  It can make the difference between an optimized build and just a good one.  Especially when designing for a specific environment, skills might be skewed to achieve a non-combat goal but still might be signficant nonethless.  The Persuade skill is one of those.  Even Animal Empathy can open up special quests that would unavailable otherwise.  There are more examples to be sure.<br/>\n<br/>\n Ummm... you do realize Owl scrolls will work exactly the same as Owl pots, don't you?  They are usually more expensive but, hey, rogues just steal whatever they want to pad their pockets.<br/>\n Who knows?  Maybe you might even stumble upon an Owl's Insight scroll or 3 (Will +7 for 15 hrs... sweet!).<br/>\n<br/>\n Expertise allows you to DW earlier because the +5 AC will prevent the loss of the shield AC from becoming a factor and actually improves overall AC beyond it.  Generally, you want at least a BAB of 10-15 before DWing and that should be easy to reach with all those early fighter-ish levels.  And I totally disagree about the value of ITWF.  If you just want an extra -5 BAB attack, drink a speed pot.  At least you'll get +4 AC even if you miss on the free attack (and it would be longsword anyway). The fact is: each additional attack is always tacked on at the end of the progression anyway.  If you keep track of every attempt, hit and miss like I do, you will see that most of your missed attempts occur from the free attacks (somewhere around 75-80% depending on APR).  Monk progression is exceptional in that the percentage is much lower, but that is to be expected with only -3 lost on BAB.  In other words, unless you are rolling lots of naturals, if you can't hit with your first attack from each hand, you won't be hitting with any of the free attacks either.  Hence, ITWF is just okay to have, but not worth sweating over or making a priority.<br/>\n<br/>\n I think what you should be ruminating over is: How might I have optimized the build better for Aielund?  Tactics is more about skills than feats but still can modify how well the build performs.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:21 PM - May 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>1. You should really mention if/where the build was tested. I'd publish that fact along with a PROs/CONs section. <br/>\n<br/>\n<strong>2. I also would be interested to understand why you traded at least +2 AB in Grt STR feats to focus in 2 different weapons.</strong>  I am assuming there is both a longsword and shortword that are particularly attractive in Aielund and am dying to hear about the in-game effect using them in combo.<br/>\n<br/>\n 3. You have misunderstood what a trainer is, Stagmeister.  It is a MODULE just like any other, not a utility.  There is no story, no quests, just building toons and testing combat and skills.<br/>\n<br/>\n 4. Well, as far as the rogue skills go, there just isn't much balance in your allocation, which why I mentioned how to round it off.  If you have no use for trap management, a rogue doesn't HAVE to get involved. Your Search rating is just high enough to spot epic traps if your toon tiptoes slowly. That's what 23 ranks buys you. It is difficult to discern form your comments whether you want to play this toon as a rogue or just for Tumble and UMD dumps. <br/>\n<br/>\n 5. BTW, your posted<em> Search</em> allocation is impossible.  It is INT-based, so it will gain +2 from the modifier. It cannot lose ranks.  I don't have time to add all your skill points up to se if they total right so you'll need to do the dirty work for us.<br/>\n<br/>\n 6. Now, if all you want to do is disarm traps, then choose either 14(16) or 9(11).  The first level disables even gas traps, the second everything but. Any number in excess is just throwing away skill points.<br/>\n<br/>\n 7. I recommend avoiding the common habit many player/builders get into by just tossing skill points out into skills that they think might come in handy rather than dedicated to achieve a certain purpose.  It can make the difference between an optimized build and just a good one.  Especially when designing for a specific environment, skills might be skewed to achieve a non-combat goal but still might be signficant nonethless.  The Persuade skill is one of those.<br/>\n<br/>\n 8. Expertise allows you to DW earlier because the +5 AC will prevent the loss of the shield AC from becoming a factor and actually improves overall AC beyond it.  Generally, you want at least a BAB of 10-15 before DWing and that should be easy to reach with all those early fighter-ish levels.  And I totally disagree about the value of ITWF if you can't hit with your first attack from each hand, you won't be hitting with any of the free attacks either.  Hence, ITWF is just okay to have, but not worth sweating over or making a priority.<br/>\n<br/>\n 9. I think what you should be ruminating over is: How might I have optimized the build better for Aielund?  Tactics is more about skills than feats but still can modify how well the build performs.<br/>\n  </div></blockquote>\n<div align=\"left\">Thanks, Hip. Okay then, I'll try to give answers as best I can...<br/>\n<br/>\n 1. Will do.<br/>\n<br/>\n 2. All right, then, but I suspect you're not going to like my answer. When I first started with NwN (October 2014) I stumbled upon the ECB a mere month later (before I'd even found the Wiki). My first build request was for a DWer, and initial discussions covered weaponry (among other things). While I understood perfectly why doubling up with one type of weapon was the rational choice, I could never quite get rid of the gremlin my mind who wanted two different types (different attack types, bonuses, variety). This was further aggravated by my first ever build here (more of a team effort, really, with much cajoling, encouragement and advice from Valerfor and Lord Mick of the Dagger), which was a re-tooling of Mazzy Fentan (from BG2) - currently residing in the Minsc and other BG builds thread, which I can't seem to find just at the moment. Mazzy had to be a short sword/short bow wielding halfling, thus placating the aforementioned gremlin. However, with this build I simply wanted to explore whether I could come up with one on my own. I'll put my hands up and say that a straight sword and board build would be a more efficient one, but I like the diversity. Simple as that. Sorry.<br/>\n<br/>\n Oh, and some of the longswords on offer are lovely. Aielund is pretty much capped at +7 weaponry, and they are rare as rocking-horse droppings, but a +5 Holy Avenger in Act 3 and a couple of the +7 blades in Act 4 are worth it on their own. I confess to not previously paying much attention to short swords after Act 2, but one does stand out (the +4 Faithblade). The reason for my flipping from mace to short sword in this iteration of the build is simply that Empyre recalls lots of good short swords being available in the Aielund Saga thread in the Modules forum, and I trust his judgement on these things!<br/>\n<br/>\n 3. Thanks, understood.<br/>\n<br/>\n 4. Both, really. I'm playing the Rogue element as a trap finder and disabler until L9 (Act 1), and after that pretty much just for Tumble and UMD, as other, highly capable Rogues are then drawn to me like flies. A tad cynical, but not overly so.<br/>\n<br/>\n 5. Ah. My bad. For some reason (likely booze and/or lack of sleep), led me to use WIS as the Search modifier rather than INT. Pillock. I'll change it in the edit. The rest do add up properly, honest!<br/>\n<br/>\n 6. Good to know. 11 it is, then (can't do 14 by L9, and see 4, above). Will handle in the edit.<br/>\n<br/>\n 7. You're absolutely right. I've struggled with skillsets since day 1, and normally relied on Mick to put me straight (he's a veritable skills demon). I think I'm getting better, though. Actually, some Persuade may well be of use in this build, too. I'll have to look harder at it.<br/>\n<br/>\n 8. That's very helpful - particularly regarding ITWF. Speaking now purely selfishly and as a player, I'm not drawn to shield-wielders, DW or 2Handers are much more my style. This probably stems from my ongoing adoration of the Monk class (especially STR-based), which tends to colour how I play everything. It shouldn't, I know, but my learning curve is ongoing. Thus, hunting for an early ITWF take is now no longer as important to me. Ta!<br/>\n<br/>\n Am now going to take the build on another run through of Aielund with a different gender and different companions, as well as using the two swords this time. Then I'll do the edit here.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:16 PM - May 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ahh... okay. The multifocus was a personal choice.  Fair enough.  I thought pehaps you had identified 2 weapons of different types that meshed especially well so was waiting to be spoiled.<br/>\n<br/>\n I recommend HIGHLY that any choices meant for either personal preferences (i.e. the kewlness factor) or those chosen to increase playability (you could lump skills and feats like Craft Wand into this category) within the specific environment (like Aielund, in this case) be clearly stated in the description so those of us who instinctively examine builds for optimization need not spin our wheels proposing methods to increase combat prowess when other considerations may be a priority.  Consider it more a courtesy than a requirement... but still worthwhile.<br/>\n<br/>\n Keep in mind that the more thoroughly you document your \"why's\" and \"wherefore's\" while a build is still fresh in your mind, the less likely you will need to access that deeply-recessed part of the cerebrum a year later when someone decides to question your rationale.  Let's just say this strategy becomes clearer as latent dementia looms closer and let it rest at that.<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:49 PM - May 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/><div align=\"left\">6. ...can't do 14 by L9...<br/>\n  </div>\n</div></blockquote>\n<div align=\"left\">You can get the modified disable trap rank to 16 by level 9 by taking all 12 ranks in the skill. You get a +2 bonus from intelligence and can get another +2 bonus from 5 ranks in set trap, if you want to take that skill.<br/>\n A pot of Fox' (and/ or intelligence gear) is another option.<br/>\n BTW was it in Aielund that these spells (cat's, bull's, owl's etc) always give a  flat +4 to the ability and hence a +2 to the skill?</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:49 PM - May 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>\n  </div></blockquote>\n<div align=\"left\">See what I mean? You just have to <em>mention</em> a skills issue and, as if from nowhere, a velvet voice murmurs in your ear...\"You dank wassock, here's the answer...\" Then, with a heady swirl of rum-soaked half corona the voice is gone, leaving you humbled but richer...<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n Cheers, Mick! I can do that - 'specially now I know I've over-umd it, and am both happy to down-play Heal (from 4) and realign when I take my Spots (would that teenagers had that option, eh?)<br/>\n<br/>\n Afraid I can't reciprocate in the help stakes, I've not played Aielund enough to know whether the spells have a flat value or not - Empyre might know<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Have no idea what happened with the quote box it was fine when I posted it, sorry!</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:04 AM - May 17, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>\n<blockquote><div><strong>Mick Dagger wrote:</strong><hr/>\n\n  </div></blockquote>\n<div align=\"left\"> Have no idea what happened with the quote box it was fine when I posted it, sorry!</div>\n</div></blockquote>\n<div align=\"left\">Simple.  You reached your quote quota. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /></div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:21 AM - May 17, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I didn't know, so I experimented. I loaded up saved game from within the Aielund saga and tried some potions. They did indeed always boost an ability by exactly 4. I tried bulls, cats, eagles, and owls on more than one party member, and got +4 consistently.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:39 AM - May 17, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A good build Stag, you are definitely become better as you go ;)<br/>\n<br/>\n I like the two different weapon choice, since you have so many bl**dy feats avaliable and devastating critical is not a factor, personally i would opt for two different damage types as well (sword &amp; mace) for example.<br/>\n<br/>\n Also i believe you don't give enough credit to yourself, i think your saves are a tad better than you state in your stat-block. I calculated them to be 36/36/32 (Fort/Ref/Will) but i might be wrong, it's late here..<br/>\n<br/>\n And, from what i remember the best weapon in Aielund bear a (+8) enhancement (katana).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "AnotherSquarehead",
      "avatar": "no_avatar.png",
      "timestamp": "1:32 AM - May 22, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Mick Dagger wrote:</strong><hr/><div align=\"left\">BTW was it in Aielund that these spells (cat's, bull's, owl's etc) always give a  flat +4 to the ability and hence a +2 to the skill?</div>\n</div></blockquote>\n<div align=\"left\">That would be the EMS (Enhanced Magic System). Many have complained about the documentation for this hak, but it does clearly explain this matter:<br/>\n<br/>\n      \"Ability Buffs<br/>\n      Per PHB +4 rather than 1+d4, and T/L rather than H/L<br/>\n      There's actually real value to casting these rather than drinking them now\"</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}