{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "289",
  "name": "Black Blade (Buccaneer) BG4 FTR12 Rogue24 (ED/SC-5)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/black-blade-buccaneer-bg4-ftr12-rogue24-ed-sc-5-t2296582.html",
  "author": "TyrTemplar",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "2.1K",
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "2:49 PM - Nov 07, 2012",
      "content": "<div><strong>Black Blade (the Buccaneer)--Blackguard(4), Fighter(12), Rogue(24) <br/>\nBy Tyr Templar</strong><br/>\n<br/>\n<strong>Concept</strong>: Of Ghosts, Gales and Gold, the Black Blade is a pirate. Like all notorious and knavish captains and sailors of old, this buccaneer is as charismatic as s/he is wanted by the law for evil deeds and bold strategies on the high seas. <br/>\n<br/>\n<strong>Pros and Cons:</strong><br/>\nThe Black Blade is an epic rogue, combining synergies with BG and fighter for a real melee presence--i.e., a good (All Natural) AB 44, good HPs (over 400) and sources of damage other than just sneak-damage alone, albeit of course sneak-damage, too. [+13d6 sneak die of it to be precise, along with traps, Fighter WS, BG Bull’s Strength (stacks with Bull’s potions) and BG Divine Might (enhance with CHA), so as to not be entirely sneak reliant either]. Also has nice saves [especially reflex (impr.evasion), excluding will, but including a good Fort (nice to see on a heavy sneaker build); with UMD/magic access for shoring up that will save, such magic access being a nice thing to have in and of itself, too]. Main weakness of this build is that the skills are rather thin (from the perspective of a rogue, but not as a melee), but with that said s/he has all a good, well-rounded Buccaneer really needs (especially when you have not only both ED and SC-5 but also a real hard AB (melee), over 400Hps, along with damage sources other than sneak although that of course (and lots of it), too, and did I mention traps?!?). Without any further ado, please meet: <br/>\n<br/>\n<strong>Black Blade (the Buccaneer), BG4, FTR12 Rogue24</strong><br/>\n<br/>\n<strong>I Attributes:</strong><br/>\nSTR: 13<br/>\nDEX: 18 (32)<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 8<br/>\nCHA: 14<br/>\n<br/>\nHalfling / Any Evil (Theme: Chaotic Evi). <br/>\n<br/>\n<strong>II. Level Guide:</strong><br/>\n01: Rogue(1): power attack<br/>\n02: Fighter(1): weapon finesse<br/>\n03: Fighter(2): weapon focus: shortsword, cleave<br/>\n04: Fighter(3): DEX+1, (DEX=19)<br/>\n05: Fighter(4): weapon specialization: shortsword<br/>\n06: Rogue(2): knockdown, {Evasion}<br/>\n07: Rogue(3): {Uncanny Dodge I}<br/>\n08: Blackguard(1): DEX+1, (DEX=20)<br/>\n09: Blackguard(2): great fortitude, {Smite Good}<br/>\n10: Fighter(5)<br/>\n11: Fighter(6): blind fight<br/>\n12: Blackguard(3): DEX+1, divine might, (DEX=21)<br/>\n13: Rogue(4)<br/>\n14: Fighter(7)<br/>\n15: Blackguard(4): divine shield<br/>\n16: Fighter(8): DEX+1, improved critical: shortsword, (DEX=22)<br/>\n17: Rogue(5)<br/>\n18: Rogue(6): toughness<br/>\n19: Rogue(7)<br/>\n20: Rogue(8): DEX+1, (DEX=23)<br/>\n21: Fighter(9): great dexterity I, (DEX=24)<br/>\n22: Fighter(10): epic weapon focus: shortsword<br/>\n23: Rogue(9)<br/>\n24: Rogue(10): DEX+1, great dexterity II, improved evasion, (DEX=26)<br/>\n25: Rogue(11)<br/>\n26: Rogue(12)<br/>\n27: Rogue(13): great dexterity III, defensive roll, (DEX=27)<br/>\n28: Rogue(14): DEX+1, (DEX=28)<br/>\n29: Rogue(15)<br/>\n30: Rogue(16): great dexterity IV, epic dodge, (DEX=29)<br/>\n31: Rogue(17)<br/>\n32: Rogue(18): DEX+1, (DEX=30)<br/>\n33: Rogue(19): self concealment I, self concealment II<br/>\n34: Rogue(20)<br/>\n35: Rogue(21)<br/>\n36: Rogue(22): DEX+1, self concealment III, (DEX=31)<br/>\n37: Rogue(23)<br/>\n38: Fighter(11)<br/>\n39: Fighter(12): self concealment IV, Epic Prowess (or, EWS: shortsword)<br/>\n40: Rogue(24): DEX+1, self concealment V, (DEX=32)<br/>\n<br/>\n---<br/>\n<strong>III Basics:</strong><br/>\na. Hitpoints: 424<br/>\n<br/>\nb. Saving Throws:<br/>\nFort: 29<br/>\nWill: 17<br/>\nReflex: 33 (Impr.Evasion)<br/>\n<br/>\nSaving Throw bonuses: Traps: +5, Fear: +2<br/>\nOther: BG Dark Blessing (Enhance w. CHA), UMD<br/>\n<br/>\n<strong>IV Combat Vitals:</strong><br/>\nBAB: 28, 44 (melee), +2 Smite Good: 46<br/>\n<br/>\nDamage: Mundane Shortsword: 1-6+3, +3 BG Bull’s, or: 1-6+6, +2 Divine (DM) (17-20/x2), +13d6 Sneak<br/>\nOther: Stealth; Smite Good, +4; DM (enhance w. CHA); PA, +5 damage (-5 ab); Traps.<br/>\n<br/>\n<strong>V Defense Vitals:</strong><br/>\nAC (naked): 30, +2 Divine Shield: 32 (Mundane Shield, +2: 34 AC). <br/>\nOther: DS (enhance w. CHA); Epic Dodge; SC-5 <br/>\n<br/>\n<strong>VI Spell Casting:</strong> UMD<br/>\n<br/>\n<strong>VII Skillpoints</strong>: 205*<br/>\nDisable Trap 2(1), Discipline 40(41)[+BG Bull’s], Hide 43(54)*, Move Silently 43(56)*, Set Trap 4(15)*, Tumble 40(51), UMD 33(35)<br/>\n<br/>\nNote: Halflings in addition to racial boni M/S shown, among other things supposedly get +4 size boni to stealth (small stature has its benefits); also, to trap skill you will add +20 (Take 20) when setting traps out of combat, thus meaning DEADLY Traps (more about which traps and damage, etc. you can read here: <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Trap\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Trap</a> ). All the better for raiding and plundering. ~ Enjoy!<br/>\n<br/>\nPlayers are free to adjust their Buccaneer to suit their own preferences/environs, as always. <br/>\n<br/>\n----<br/>\nOther Combos:<br/>\nThe Abuser rogue 19 / fighter 11 / blackguard 10 (human) by fernandooa<br/>\nCharismatic dwarf v.1 rogue 4 / fighter 8 / blackguard 28 (dwarf) by Grimnir77<br/>\nHis Infernal Mistress rogue 5 / fighter 10 / blackguard 25 (human?) by grizzled_dwarflord<br/>\nThe Blade Runner rogue 21 / fighter 12 / blackguard 7 (halfling) by grizzled_dwarflord<br/>\nMaster Thrower fighter 14 / rogue 13 / blackguard 13 (halfling) by kreestopearq<br/>\nThe Dark Prince (No DevCrit) fighter 8 / rogue 10 / blackguard 22 (human) by TyrTemplar<br/>\nThe Dark Prince (the Impaler) Dev.Crit fighter 8 / rogue 10 / blackguard 22 (human) by TyrTemplar<br/>\nBeautiful Evil rogue 10 / fighter 2 / blackguard 28 (human) by whirlin_merlin<br/>\nBeautiful Evil v2.0 rogue 10 / fighter 6 / blackguard 24 (human) by whirlin_merlin<br/>\n<br/>\nEdit: remove typo(s).</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:57 PM - Nov 09, 2012",
      "content": "<div>I have to admit - I fell for this little lass.   <br/>\nSCV, ED, Warrior AB, PA, Cleave, DM, DS, UMD, Stealth!!!<br/>\n<br/>\nThen when I got to know her better, the crush faded   <br/>\nShe was not that bright (int 8), her charm was not that great (+2) and it (DM/DS) only lasted 12 seconds each time. I dressed her up in the finest silk and jewels. Her charm then improved (+8), but still only lasted for 48 seconds.<br/>\n<br/>\nShe is still a great and coloful girl, and I think I can handle her minor flaws. I wish she could learn better to pack a punch (EWS) and have a thicker skin (AS), but I cannot complain. Her evasiveness goes a long way (SCV, ED, DS), and she punches hard already (SA, PA, DM, UMD). I only wish she could open the door for me (open lock)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "5:07 PM - Nov 09, 2012",
      "content": "<div>Well done, Mick. And true, s/he may not come with the most skills (from the perspective of a rogue), has all s/he really needs (and quite nice from the perspective of a melee).  But wouldn't be calling a pirate unintelligent---they've been known to kill for a lot less (too funny!). And a female pirate, you say? (Pirates of both genders do indeed have their charms). Aye, a great many male pirates known well to history, but there were indeed quite a few infamous female pirates, too, such as but not limited to Anne Bonney and Mary Read, with Bonney in particular being quoted as telling fellow pirate (and her fiance) on the night before his execution after his capture that, \"if you had fought like a man (meaning, like herself), you wouldn't be hanged like a dog.\" Yes, these pirates are charming, indeed, but be careful, I say. Say the wrong thing and they're lethal!   <br/>\n<br/>\n<strong>Real AB and Damage--Options:</strong><br/>\nThing about most DEX'ers in general, so little damage (though rogues of course have sneak, but they tend to have so little AB other than stealth-generated in order to deliver), meaning equipment dependency all around. But not so for this Buccaneer, who enjoys a right and proper warrior AB (which be separate and apart from, but also in addition to the stealth for delivery), along with different damage delivery options/sources as well. Though of course like all dex'ers (and melee warriors in general) you'll be enjoying the gear, entitled to everything that everyone else gets of course, and which spoils be augmenting that which s/he already has [and what h/she already has it rather nice all-around, indeed, especially for an epic rogue/heavy sneaker, I agree (thanks, Mick)]. <br/>\n<br/>\n<strong><br/>\nGame Time--a round equals 6 seconds:</strong><br/>\nThat said, and gear aside, while keeping in mind also that a round as in an in game unit of time, as it applies to combat itself lasts but a mere six (6) seconds. And in that six seconds, but a single round that be, this pirate indeed be deadly:<br/>\n<br/>\nDamage--Round Total:<br/>\nMundane round total (4 apr):<br/>\nMelee AB 44; Damage (1-6+6, +2 Divine (DM), or: 9-14/x4 apr): 36-56 (PA: 56-72) (crit: 17-20/x2), +78d4 Sneak<br/>\n<br/>\nNow bring on some gear, as in the usual salt fare to be found out at sea (i.e., +6 to Stats (STR/DEX/CHA), +5 keen shortsword, UMD/Haste ONLY): AB 52; Damage (1-6+13, +5 Divine (DM), or: 19-24/x5 apr): 95-120 (PA: 120-145) (crit: 15-20/x2), +78d5 Sneak.<br/>\n<br/>\nAnd as to that AB, just straight-up melee [i.e., not counting any benefits of the stealth either, but which when brought into the equation guarantees not only first strike, but also deprives all of yer foes their Dex, tumble and dodge AC, too, all of which goes out the window when flat-footed (which by striking from stealth, rogues/pirates do) has KD, too (One size up, a beautiful thing and works great, but never PvM/E dragons or something huge like that), along with traps, etc.]. Now, for most things, don't need the whole six seconds, but DM/DS lasts a longer than that, and have more of it (along w. BG Bull's, stacks with Bull's potions which is really nice, too). Combined with real, hard AB (along with SC-5/ED), ...   <br/>\n<br/>\nAh, but when it comes to the crit/sneak immunes, such as the undeads and so forth, you'll be happy to have not only yer warrior's AB but also the DM option, etc. as well, I agree (and with 5 turns per day or rest, along with your SC-5/ED, KD. No worries). Plus, UMD, true, but also the deadly traps!! (which no pirate should leave port without): <br/>\n<br/>\n<strong>Deadly Traps (types and damage):</strong><br/>\n* Acid Blob single creature 18d6 acid (and chance of paralysis, 5 rounds)<br/>\n* Electrical, 7 creatures/15 ft, 30d6 electric<br/>\n* Fire, All/10 ft. radius, 25d6 fire <br/>\n* Frost, single creature, 8d4 cold (&amp; chance of paralysis, 4 rounds)<br/>\n* Holy, single creature, 8d4 (12d10 if undead) divine damage<br/>\n* Negative, single creature, 9d6 negative (and chance of -1 level drain)<br/>\n* Sonic, All/10 Ft., 8d4 sonic (and chance of stun, 4 rounds)<br/>\n* Spike, single creature, 25d6 piercing<br/>\n* Tangle, All/10 Ft., chance of slowing, 5 rounds<br/>\nFor more information, see: <a class=\"postlink\" href=\"http://www.nwnwiki.org/Trap\" rel=\"noreferrer\" target=\"_blank\">http://www.nwnwiki.org/Trap</a> <br/>\n<br/>\nSo as you can see, despite an Int. 8, this pirate has quite a few tricks up his/her sleeve, which in turn makes him/her intelligent, I think (raiding and plundering calls for different techniques, not to mention different storms at sea, and need to do so while staying ahead of the law, too, such that options are indeed good)! Complaining about the lack of skills when it comes to pirates is the sort of thing that gets folks killed (LOL). But if it's a point in a lock that ye really want, by all means then pull one from Disc. and adjust for it (as all players are of course free to do--with a nice AC bolstered by DS and of course ED/SC-5 (best defense there is!), heh, not really an issue). After all, with all this, after seizing that ship and claiming your prize, I can see where one might at the end of the day get upset on finding, when about to grab that chest filled with riches, gold and jewels, that they are to be denied their prize on account of being unable to open the dam'd lock!  <br/>\n<br/>\nSneak, Slash and Plunder ON! ~ Tyr</div>"
    }
  ]
}