{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "109",
  "name": "The Archer Archdruid (pun intended) - Druid 24 / Fighter 14 / Monk 2",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-archer-archdruid-pun-intended-druid-24-fighter-t2355578.html",
  "author": "Maximillian_Kane",
  "avatar": "10758866_1605883460.jpg",
  "replies": 1,
  "posts": [
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "6:55 PM - Oct 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hail, Mighty ECBers!<br/>\n<br/>\nSo, recently, our good friend Luck_Dragon started a thread about a Druid / Fighter combo, and in the suggestions I gave him, I was struck with a flash of inspiration for a new concept build. This build is playable, but definitely not for the faint-hearted. There is a LOT of cheese involved in leveling this build, which includes a lot of well-chosen consumables to keep you going until you can stand on your own, and finding the right items in the right places. But the concept is cool and works twofold. <br/>\n<br/>\n1- I wanted to have a Druid that could reach as much BAB as possible in pre-epic, full Monk attack progression, while still being undispellable by anything but Mordenkainen's Disjunction. I should probably mention that in EE, being undispellable only happens at Caster Level 25, so this build won't be able to achieve its goal there. But I play in 1.69, and there you need 24 CLs to be immune to dispels, so it works. This would raise the Dragon Shape AB, which becomes kind of lowish nearing level 40, when fighting the end-game bosses, but it also means a much more painful leveling process. If you want an easy-peasy progression, play my Champion of the Wilderness. It still gets the full Monk progression, but the leveling is much smoother. <br/>\n<br/>\n2- The other part of the concept originated from the wordplay of Archdruid - Archer. I wanted to make a very proficient archer, that was also a Druid. Not the most Uber concept, but he has all the staple ranged combat feats and a few melee feats to fight in melee when he shifts. He will cast mostly from scrolls, and snipe while the summons (from scrolls) tank for him for most of his pre-epic progression. Snipe, snipe, snipe. Don't get in melee range. That should be your motto. <br/>\n<br/>\nEDIT: I tweaked the leveling order to make him easier to level at no loss. I went for all the 4th level spells as early as possible and Craft Wand, which should provide a decent boon to mitigate the difficulty of leveling him up. It still won't be easy, especially between level 12-33, which is when it comes together and becomes a serious powerhouse with Dragon Shape. But at least those first 12 or so levels should be easier this way.<br/>\n<br/>\nHe should be equipped with DR items, so as to avoid as much damage as possible (preferably Piercing immunity to resist ranged damage), because his AC won't be anything spectacular until level 22. Even at that level, it will be a struggle, because you won't have any of the staple Druid buffs or the best shapes available. You only get Elemental Shape at level 29, so you'll basically be stuck with limited uses of the Bear shape, which has an OK AB and low AC for those levels. Then at level 33, you get Dragon Shape and things start coming together. From that point forward, your main enemies are Dispel (not that it wasn't before, but before you had many other concerns), and Doors and narrow passages LOL. You should be proficient in Dispel-baiting if you have any hopes of playing this build to its twilight years. Luckily, you have Craft Wand, which means you can make a 50-charge Grease wand, as well as Stoneskin and Summon Creature IV wands to bait both dispels and breaches by controlling Line of Sight. If you can't control LoS, then you should probably pre-buff with wands, then wait for enemies to dispel you, then buff for real and whoop their behinds. This build can be played, but it requires an advanced player to use it to its full potential.<br/>\n<br/>\nOnce it does reach its full potential, the result is AMAZING!<br/>\n<br/>\nIn Dragon Shape, this build will have an OK AC, although lower than most Dragon Shapers due to lowish Wisdom and the lack of Armor Skin. It still should be enough to tank pretty much every enemy, and it has Expertise if it's getting hit for some reason. But what it lacks in AC, it makes up for in much-needed AB! Here are the calculations:<br/>\n<br/>\n28 BAB + 4 (+6 from claws, -2 from size) + 25 from 60 STR (which you can cap with Empowered Bull's Strength + Aura of Vitality + Ioun Stone + 1 Strength-boosting item if you get an unlucky roll) + Epic Prowess + Bless potion + Aid potion = 60 AB. If you can find some small uncommon items, like Heart of the Beast, or Elixir of Courage, it can go even higher than that.<br/>\n<br/>\nLadies and Gentlemen, the Archer Archdruid!<br/>\n<br/>\n<br/>\nDruid(24), Fighter(14), Monk(2), Human<br/>\n<br/>\nSTR: 8<br/>\nDEX: 14<br/>\nCON: 10<br/>\nWIS: 18 (34)<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Druid(1): Expertise, Extend Spell<br/>\n02: Druid(2)<br/>\n03: Druid(3): Empower Spell<br/>\n04: Druid(4): WIS+1, (WIS=19)<br/>\n05: Druid(5)<br/>\n06: Druid(6): Craft Wand<br/>\n07: Druid(7)<br/>\n08: Fighter(1): WIS+1, Blind Fight, (WIS=20)<br/>\n09: Fighter(2): Zen Archery, Weapon Focus: Longbow<br/>\n10: Fighter(3)<br/>\n11: Fighter(4): Weapon Specialization: Longbow<br/>\n12: Fighter(5): WIS+1, Point Blank Shot, (WIS=21)<br/>\n13: Fighter(6): Called Shot<br/>\n14: Fighter(7)<br/>\n15: Fighter(8): Improved Critical: Longbow, Rapid Shot<br/>\n16: Fighter(9): WIS+1, (WIS=22)<br/>\n17: Fighter(10): Knockdown<br/>\n18: Druid(8): Improved Knockdown<br/>\n19: Fighter(11)<br/>\n20: Fighter(12): WIS+1, Improved Critical: Unarmed, (WIS=23)<br/>\n21: Druid(9): Great Wisdom I, (WIS=24)<br/>\n22: Monk(1): {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n23: Druid(10)<br/>\n24: Druid(11): WIS+1, Great Wisdom II, (WIS=26)<br/>\n25: Druid(12)<br/>\n26: Druid(13)<br/>\n27: Druid(14): Great Wisdom III, (WIS=27)<br/>\n28: Druid(15): WIS+1, (WIS=28)<br/>\n29: Druid(16)<br/>\n30: Druid(17): Great Wisdom IV, (WIS=29)<br/>\n31: Druid(18)<br/>\n32: Druid(19): WIS+1, (WIS=30)<br/>\n33: Druid(20): Dragon Shape<br/>\n34: Druid(21)<br/>\n35: Druid(22)<br/>\n36: Druid(23): WIS+1, Great Wisdom V, (WIS=32)<br/>\n37: Fighter(13)<br/>\n38: Fighter(14): Epic Weapon Focus: Longbow<br/>\n39: Druid(24): Epic Prowess, Great Wisdom VI, (WIS=33)<br/>\n40: Monk(2): WIS+1, {Deflect Arrows}, (WIS=34)<br/>\n<br/>\nHitpoints: 348<br/>\nSkillpoints: 273<br/>\nSaving Throws (Fortitude/Will/Reflex): 24/32/18<br/>\nSaving Throw bonuses: Spells: +8, Fear: +2<br/>\nBAB: 28<br/>\nAB (max, naked): 28 (melee), 44 (ranged)<br/>\nAC (naked/mundane armor/shield only): 32/32<br/>\nSpell Casting: Druid(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nAnimal Empathy 31(30), Concentration 43(43), Disable Trap 1(3), Discipline 43(42), Listen 43(55), Lore 28(30), Open Lock 2(4), Spellcraft 38(40), Tumble 40(42), remaining skillpoints 1<br/>\n<br/>\n01: Animal Empathy(4), Concentration(4), Disable Trap(1), Open Lock(1), Spellcraft(4), Save(12), <br/>\n02: Animal Empathy(1), Concentration(1), Spellcraft(1), Save(16), <br/>\n03: Animal Empathy(1), Concentration(1), Spellcraft(1), Save(20), <br/>\n04: Animal Empathy(1), Concentration(1), Spellcraft(1), Save(24), <br/>\n05: Animal Empathy(1), Concentration(1), Spellcraft(1), Save(28), <br/>\n06: Animal Empathy(1), Concentration(1), Spellcraft(1), Save(32), <br/>\n07: Animal Empathy(1), Concentration(1), Spellcraft(1), Save(36), <br/>\n08: Concentration(1), Discipline(11), Save(29), <br/>\n09: Concentration(1), Discipline(1), Save(32), <br/>\n10: Concentration(1), Discipline(1), Save(35), <br/>\n11: Concentration(1), Discipline(1), Save(38), <br/>\n12: Concentration(1), Discipline(1), Save(41), <br/>\n13: Concentration(1), Discipline(1), Save(44), <br/>\n14: Concentration(1), Discipline(1), Save(47), <br/>\n15: Concentration(1), Discipline(1), Save(50), <br/>\n16: Concentration(1), Discipline(1), Save(53), <br/>\n17: Concentration(1), Discipline(1), Save(56), <br/>\n18: Animal Empathy(11), Concentration(1), Spellcraft(11), Save(40), <br/>\n19: Concentration(1), Discipline(2), Save(42), <br/>\n20: Concentration(1), Discipline(1), Save(45), <br/>\n21: Animal Empathy(2), Concentration(1), Spellcraft(3), Save(46), <br/>\n22: Concentration(1), Discipline(2), Listen(25), Tumble(25), <br/>\n23: Animal Empathy(3), Concentration(1), Lore(1), Spellcraft(2), <br/>\n24: Animal Empathy(1), Concentration(1), Lore(4), Spellcraft(1), <br/>\n25: Animal Empathy(1), Concentration(1), Lore(4), Spellcraft(1), <br/>\n26: Animal Empathy(1), Concentration(1), Lore(4), Spellcraft(1), <br/>\n27: Animal Empathy(1), Concentration(1), Lore(4), Spellcraft(1), <br/>\n28: Animal Empathy(1), Concentration(1), Lore(4), Spellcraft(1), <br/>\n29: Concentration(1), Lore(5), Spellcraft(1), <br/>\n30: Concentration(1), Lore(2), Open Lock(1), Spellcraft(1), Save(1), <br/>\n31: Concentration(1), Spellcraft(1), Save(6), <br/>\n32: Concentration(1), Spellcraft(1), Save(11), <br/>\n33: Concentration(1), Spellcraft(1), Save(16), <br/>\n34: Concentration(1), Spellcraft(1), Save(21), <br/>\n35: Concentration(1), Spellcraft(1), Save(26), <br/>\n36: Concentration(1), Save(32), <br/>\n37: Concentration(1), Discipline(15), Save(21), <br/>\n38: Concentration(1), Discipline(1), Save(24), <br/>\n39: Concentration(1), Save(30), <br/>\n40: Concentration(1), Discipline(2), Listen(18), Tumble(15), Save(1), <br/>\n<br/>\n<br/>\nUnfortunately, I wasn't able to include EWS in the Longbow, but you can tweak the build to get it in two different ways:<br/>\n<br/>\n1- Delaying Dragon Shape to level 39:  If you want the full Archer package, delay DS to be taken with the Druid bonus feat at 39, then drop 2 Great Wisdoms for Armor Skin and EWF Longbow, then take EWS Longbow with the Fighter 14 Bonus feat.<br/>\n<br/>\n2- Move 4 Fighter levels to epics, dropping 2 pre-epic feats (probably Improved Knockdown and Expertise), then use these extra Fighter feats to take EWF and Armor Skin.<br/>\n<br/>\nI just saw him as an Archer that slowly morphed into a Druid. If you see it the same way, you can even drop EWF Longbow for Armor Skin, although I find AC in Dragon builds is high enough without it, so I went with the flavor instead.<br/>\n<br/>\nEDIT 2 - Another possible tweak is to take Scribe Scroll instead of Craft Wand, if you have the patience to stack up scrolls of the same spells you would put into wands. Although wands are better in the sense they are more comfortable to use, they are also limited to level 4 or lower spells. On the other hand, a Druid with Scribe Scroll could craft Premonition, Nature's Balance, Stonehold, Heal, Mass Heal, and Storm of Vengeance scrolls to greatly add to their combat strategy. It's a very viable tweak that would probably make the build more effective and a bit more annoying to play, as keeping tons of scrolls in your inventory almost requires a stocking system to work properly. For me, I always like to have a wand crafter from each class in my account, and this seemed a perfect character to fill that role, so I went with Craft Wand.<br/>\n<br/>\nSo, what do you guys think?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "3:52 PM - Oct 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I just edited this build, because in a previous version, I was taking Spell Focus as well as the other casting feats (in place of Improved Critical: Unarmed and Improved Knockdown in pre-epics, and ESF + Armor Skin for 2 Great Wisdoms in Epics, as ESF can be taken with the Druid 24 Bonus Feat), so I needed to take Druid levels on general feat levels to accommodate that many spellcasting feats with such few caster levels, but then I decided to drop them on the next version, and posted the build without those feats. Then, after taking another fresh look, I saw that without the Spell Focus feats, it didn't make sense to delay the Druid levels that much, as just having all spells up to level 4 and Craft Wand from the getgo would make it much easier to level, and still reach the same end result. It looks much more playable now! <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}