{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "162",
  "name": "Noob Giude Request / Wrongly posted as well on Legacy Build... sorry guys",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/noob-giude-request-wrongly-posted-as-well-on-legac-t2354536.html",
  "author": "Orlouge",
  "avatar": "no_avatar.png",
  "replies": 4,
  "posts": [
    {
      "author": "Orlouge",
      "avatar": "no_avatar.png",
      "timestamp": "10:50 AM - May 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><span style=\"color:#ECF3F7\">Hi everyone. I'm not sure if anyone reads this anymore, but here I come.</span><br/>\n<span style=\"color:#ECF3F7\">I'm an almost 30 years old guy who played this game long long time ago, but not that often thus never got an in depth grasp of the game. Now that I'm almost done with climbing the RL ladder I have chance to devote my time on the childhood list of things I always wanted to do, and NWN has always been there.</span><br/>\n<span style=\"color:#ECF3F7\">I have come to this community since - while I did not have the chance to play as often as I would like to - I did spend some time luriking at builds websites, where I even remember Pendragon flaming a guy who claimed his dragon shifter build was better than what the community at that website had posted, and despite I've always been silent, I've been an avid reader of Pendragon, HipMaestro, Max Kane, and other contributors; but now I have the time to interact with this awesome community. I must say it was difficult to find the community since at the time it was at another website (had even filters for searching builds by class) and now I'm living in China (censorship takes on even the neverwintervault...).</span><br/>\n<span style=\"color:#ECF3F7\">Moving to the request, I think before requesting a specific build I would like to ask for an insight on each class strenghs and weaknesses, either on PvM and specially in PvP, and either for Low-Mid-High magic environments. I know most of you guys must be bored of the PvP since it seems (as HipMaestro said) is all reduced to who casts the Time Stop first, but given I haven't saw that yet with my own eyes I hope you understand my naive enthusiasm.</span><br/>\n<span style=\"color:#ECF3F7\">I will make you laugh a bit with my perception of classes so you can enlight this poor noob with some knowledge:</span><br/>\n<span style=\"color:#ECF3F7\">- Arcane Archer: haven't explored this class much. Seems to me only good to buff ranged attack dmg.</span><br/>\n<span style=\"color:#ECF3F7\">- Barbarian: I haven't explored this class much. Seems to me only as food for mages with some DR in the rage.</span><br/>\n<span style=\"color:#ECF3F7\">- Bard: Useful to access RDD and PM with better BAB than others, but (if I don't recall wrong) useless beyond 8 levels given song can get max benefits for combat within those levels. Usefull for skill dumps and UMD.</span><br/>\n<span style=\"color:#ECF3F7\">- Blackguard: I cannot understand why would anyone pick this class besides stacking BS or rollplay. Cha to savings can be get by Pally earlier.</span><br/>\n<span style=\"color:#ECF3F7\">- CoT: useful for feats, and Divine W. I was surprised to see Max Kane spent time making a build with cheese for it. </span><br/>\n<span style=\"color:#ECF3F7\">- Cleric: well, in my few time playing the game I spent most of the time playing high DC caster cleric, and I finished the campaigns just stacking SoVs, but I was not aware Clerics had enough tools to beat high ACs until I read Max Kane guide. Can Clerics beat the highest achievable AC in the game? Which class achieves the highest AC?</span><br/>\n<span style=\"color:#ECF3F7\">- Druid: my platonic love. I wonder why no one speaks about creeping doom spell. No SR or Saves allowd capped at 1000 dmg sounds good either in PvM and PvP (with bigby ofc). And above all, grants access to shifter which by roleplay is what I like the most.</span><br/>\n<span style=\"color:#ECF3F7\">- DwD: good for stacking DR with RL form. Besides that no idea.</span><br/>\n<span style=\"color:#ECF3F7\">- Fighter: for feat starved builds.</span><br/>\n<span style=\"color:#ECF3F7\">- Harper:  no clue</span><br/>\n<span style=\"color:#ECF3F7\">- Monk: in NWN wikia says it can achieve something like spell immunity stacking SR. What's the cons of going for that? Besides that, I'm well aware of the cheese he brings to the table.</span><br/>\n<span style=\"color:#ECF3F7\">- Paladin: smite evil, +saves, and some buffs, but can't think of it like a strong class. Maybe I feel too naked without respectable spellbook.</span><br/>\n<span style=\"color:#ECF3F7\">- PM: the immunities it has are obviously strong, but for example - in the undead lord build - Im not sure why would the creater keep going for it ISO feats on fighter. Just for the AC? Wouldn't it be stronger with more feats?</span><br/>\n<span style=\"color:#ECF3F7\">- PDK: this can't be seriously useful in single player or PvP. I mean, havent explored it, but has anyone make something respectable out of this?</span><br/>\n<span style=\"color:#ECF3F7\">- Ranger: free DW feats, some spells and good BAB. Any other uses?</span><br/>\n<span style=\"color:#ECF3F7\">- RDD: free stats, immunities, AC sounds respectable enough to me.</span><br/>\n<span style=\"color:#ECF3F7\">- Rougue: skills dumps, SA, UMD, evasion, uncanny dodge.</span><br/>\n<span style=\"color:#ECF3F7\">- SD: HiPS, Devensive Roll. Anything else?</span><br/>\n<span style=\"color:#ECF3F7\">- Shifter: aaaaaaah.... my rollplay love. I try to take outsider for rakshasa, undead for RL, but I don't think it will be suited for PvM if I don't have full druid spellbook or for PvP at all :(</span><br/>\n<span style=\"color:#ECF3F7\">- Sorcerer: can cast = good for me. I have seen the exalted sorceress build and played it in a PvP server, but has anyone tried to get divine shield with this?</span><br/>\n<span style=\"color:#ECF3F7\">- WM: for devastating critical lovers, and in my oppinion only good for people who can beat undeads with spells.</span><br/>\n<span style=\"color:#ECF3F7\">- Wiz: Spellcasting cheese.</span><br/>\n<span style=\"color:#ECF3F7\">After you finish laughing at me, if you ever manage, please try to give this poor noob a better insight on the use of each class, or maybe make a guide with the usefulness of each class in the guide section so it will be easier for noobs to understand the builds they see.</span><br/>\n<span style=\"color:#ECF3F7\">Again, happy to meet you all!</span><br/>\n<span style=\"color:#ECF3F7\">Cheers</span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:56 AM - May 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello Orlouge, and welcome! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n Unfortunately, I'm probably the least useful person to give you your first reply, having only been playing NwN for about 18 months, but I didn't want you to feel ignored!<br/>\n<br/>\n While you're waiting for the great and good to offer more sage counsel, you might want to have a browse through some of the Game Guides available in this forum. If memory serves, there are specific guides to the Arcane Archer, Assassin, Cleric, Druid, Pally and Shifter (I tend to remember alphabetically), as well as invaluable guides to playing and building better characters. Alas, my own couple of favourites - Monk and CoT - are currently guideless, and I'm certainly not the one to write them, but you can't have everything!<br/>\n<br/>\n You might also be interested in Hip's new ECB filter - available via a link in the Rules and Tools section (assuming you can access it), which enables searching by class, author, alignment, pretty much anything else.<br/>\n<br/>\n Equally, I know I continue to find it worthwhile just skithering around the Guild's different sections - it's amazing what you can pick up. That said, you'd think I'd be a better builder by now, but that's probably my fault.<br/>\n<br/>\n Again, welcome - hope you enjoy your stay!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orlouge",
      "avatar": "no_avatar.png",
      "timestamp": "2:33 AM - May 12, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the warm welcome and advises Stagmeister. I will keep reading those guide!<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:46 AM - May 12, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome to the guild Orlouge, I'll get right to the point.<br/>\n<br/>\n Fighters: The backbone of most builds, solid class but uninspiring, no special abilities of note apart from WS/EWS and the plethora of feats. Sadly in NwN 1 there are hardly enough good feats to take (especially with Dev. Critical banned) with all those bonus feats. That changed in NwN 2 but the game was not that good in comparison. They are responsible-alongside COT-for the most overused, most well-known, most cookie cutter, but most versatile and best in almost every single mission build of all time. The \"Fighter/Rogue/Champion of Torm\". This build can do everything and anything and do it well. It has literally no weaknesses.<br/>\n<br/>\n Barbarians: They offer some speed (that doesn't stack with boots of haste), Uncanny Dodge, more skil points (and Listen as a class skill), the best Hit Dice (D12) in the game, some Damage Reduction (DR) and the big ace Terrifying Rage! Now in default game, Terrifying Rage is not that useful but if you play on a Persistent World, many of them have modified the feat to be what truly should be. They run away from you unless they make-an near impossible to make-Will save. It is so much fun...<br/>\n<br/>\n Rangers: They are good, but only when they have many levels. In fact you should have at least 25-26 levels in them to become really good (Bane of Enemies). Fewer levels can be good also in some rare cases (a single level in epics for an epic feat for example) but the normal is to have as many levels in the Class as you can, with only the occasional dip to other classes for (full tumble, umd, ews, etc).<br/>\n<br/>\n Bards: One of the most powerful Classes in the game. They synergize with everything (and especially with the RDD) and the secret is in their Bard Song/ Curse Song combo and their wonderful skill set (umd, spellcraft, tumble, as class skills). Most of the \"Broken Builds\" involve Bard in some way or another. Crazy powerful combos with them, especially if you can change alighnments mid-game reliably. Some examples are (Cleric/Bard/RDD), (Fighter/Bard/RDD), (Bard/WM/RDD), (Bard/Ftr/AA), (Bard/CoT/RDD), (Bard/PM/BG), (Pal/Bard/RDD) and many more.<br/>\n<br/>\n Clerics: Well, what to say about Clerics...No challenge here, you win the game, move on to the...<br/>\n<br/>\n Druid: Now at first this seem like a Cleric-minus but then it comes the Dragonshape and its Jurassic Park all over again! If you are a fan of Kail then you know what Dragons are capable of... They do come late in game though, so keep that in mind. Oh, and every single persistand world nerfs them in some way or another, that too. (World of Greyhawk, doesn't but few reach 30's in there so eh..) In modules, the few that reach above 30 level, the magic level is so high that Dragonshape doesn't look so awesome anymore compared to your new shiny sword of world-slaying. Personally i like them and i like the role-playing aspect of them as well. Their spells aren't that bad either as you noticed, especially the dreaded Stonehold. Heal/Harm likewise.<br/>\n<br/>\n Monks: They are a love-or-hate thing. They have many things going for them and their speed is addictive. What's good is their Spell Resistance you asked? Well, they are effectively immune to spellcasters, if that doesn't ring a bell to you, then you must play somewhere harder where casters simply dominate the late-game and you will see for yourself. It feels so good to be immune to all these Bigby's and Wail's of the Banshee spells. Not to mention Isaak's missile storms. They also make great combo with Weapon Masters for the good old Eastern feel of sword-saint. A speedy WM is double the fun, trust me on that.<br/>\n<br/>\n Harpers: A good prestige class, although not on par with the \"monsters\" in there (Arcane Archer/ Red Dragon Disciple). They require specific builds to work well and they are mostly used for role-playing purposes in place of Rogues/Bards. Their bonus feats, if taken in epic for example can be of great help to Smiter builds. Or they can be used to \"push\" a skill to great levels in a build that requires it. They do have a useful skill list (tumble is a class skill) themselves as well.<br/>\n<br/>\n PDK: Avoid unless the persistent world that you play have made some kind of modifications to them. Even in Pen-and-Paper DnD nobody takes them, ever. Sad, and i really like their \"theme\" but in normal game they are simply \"dead levels\".<br/>\n<br/>\n RDD: Best prestige class in the game. So powerful...Although not my personal No 1, that would be the...<br/>\n<br/>\n Arcane Archer: You want to hit reliably AC's in the 80's? No problem! For Hard content this Class is the most reliable Rail-Gun that your party will have. Nothing else can attain so high AB, and it's all from afar too. They shut down Wizards like nothing else in the game (except pure Monks perhaps).<br/>\n<br/>\n Blackguards: Solid Class, they have full BAB, Taunt as a Class skill, they can take Divine Might/Shield, they gain additional Sneak attack dice, they have the most powerful \"Pet\", good hit points (D10), charisma to saves and all useful epic feats as bonus epic feats. What else do you want? Some of their best combos are (Ftr/Bard/BG), (Ftr/Rog/BG), (Bard/PM/BG) and (Bard/BG/RDD).<br/>\n<br/>\n Sorcerer/Wizard: Same as Clerics, although they involve a bit more micro-management because they are glass-cannons to start with. They do become even more powerful late-game though.<br/>\n<br/>\n ShadowDancers: As you said, HiPS, Defensive Roll and that's it? Okay they aren't bad if you go for ECS V but apart from that... Very few builds are working for more than some token levels for them. (Ftr 8/ WM 16/ SD 16) is one of them, mostly defensive though.<br/>\n<br/>\n<br/>\n And that's it for now, i have to go get some sleep, cya around Orlouge.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orlouge",
      "avatar": "no_avatar.png",
      "timestamp": "2:51 AM - May 13, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks a lot for the feedback mate! Seems the forum is not that active anymore and looks like we are the few post apocalypse survivors hehehe. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}