{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "148",
  "name": "About Legacy Build Divine Warrior",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/about-legacy-build-divine-warrior-t2355360.html",
  "author": "agmnthane",
  "avatar": "10759232_1581928197.jpg",
  "replies": "5",
  "views": "240",
  "posts": [
    {
      "author": "agmnthane",
      "avatar": "10759232_1581928197.jpg",
      "timestamp": "9:10 AM - Feb 17, 2020",
      "content": "<div>Can I play Divine Warrior in OC starting from level one or it's just level 40 build?  I played NWN years ago but never finished.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:26 AM - Feb 17, 2020",
      "content": "<div>The OC starts at level 1 and tops out at around level 20 iirc.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "agmnthane",
      "avatar": "10759232_1581928197.jpg",
      "timestamp": "9:28 AM - Feb 17, 2020",
      "content": "<div>Yes, I know.  That's why I asked whether or not it is playable at low level.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "9:36 AM - Feb 17, 2020",
      "content": "<div>I am not an expert but I don't see why not. These legacy builds seem to be made to be playable from 1, not for maximum power at 40. When you look at the build, she gets some of the good Pally feats like Divine Shield and Divine Might early, and there aren't 100 skill points saved until level 39 like in some builds for servers here.<br/>\nProbably not the most powerful build ever made, but should work well enough with the OC  (and maybe something like Aribeth's Redemption afterwards, if you make your toon a male).</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:48 AM - Feb 17, 2020",
      "content": "<div>It really depends on what one intends to do.<br/>\n<br/>\nIf one will be playing further with the same character (into HotU, for example), then it should be fine.<br/>\n<br/>\nIf, however  one is only playing the OC, then I would use a build from the level 20 builds.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:47 PM - Feb 17, 2020",
      "content": "<div>The OC &amp; nearly every module out there (with some rare exceptions) can be beaten by any build or player, no matter how inexperienced someone is. However, that doesn't mean that the build is enjoyable/good. If your intent is to play this build only up to OC or thereabouts, then you are going to have problems with it, the low AB chief amongst them. <br/>\n<br/>\nYou should also consider altering some stats/skills for the purpose of playability/enjoyment from the builds that you see here. <br/>\nFor example, having CHA (16) will enable a romance option with Sharwyn (the Bard) &amp; a maxed-out diplomacy skill will enable you to \"have your way\" in most conversations with NPCs that you meet (at least if your goal is to play a holy/noble-warrior type of character). <br/>\n<br/>\nHave fun!</div>"
    }
  ]
}