{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "199",
  "name": "Small stature and large weapons: exceptions?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/small-stature-and-large-weapons-exceptions-t2354791.html",
  "author": "Aquarius 233",
  "avatar": "10714033_1519247364.jpg",
  "replies": "11",
  "views": "1.6K",
  "posts": [
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "9:28 PM - Dec 10, 2017",
      "content": "<div>Hi all! <br/>\nIt's my second playthrough of the Swordflight series, and I've played it with a gnome spellsword. <br/>\nNow, as we all know, the small stature implies that:<br/>\n<blockquote><div>Because they are so small, they cannot use the following weapons: dire mace, two-bladed sword, double axe, greataxe, greatsword, halberd, heavy flail, quarterstaff, scythe, and spear.  <em>(Nwnwiki)</em></div></blockquote>\n\nToday I obtained a powerful halberd, and I was preparing to sell it...but...I noticed that if I selected the item, the game showed only a white halo, and not a red halo.....could it be that my small gnome could wield, with his own hands, the big bad halberd?<br/>\n<br/>\nOf course she does!<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201712/10714033_055b5414f1ea055ec66be4422970543c.png\"/><br/>\n<br/>\n<br/>\nI quickly went to the smithy and I discovered that the same can be applied for a spear, hence these weapons seem an exception (not mentioned in the wiki).<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201712/10714033_c8398b5bdee5efd03f1d8e1aa09ae666.png\"/><br/>\n<br/>\nIs that a bug in the game? I tried to search somewhere in this new and the old ecb guilds, but found nothing...</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:31 PM - Dec 10, 2017",
      "content": "<div>Thou art a miracle, Aquarius! Either that, or RogueKnight decided to make some adaptations, and I couldn't attest to that one way or another - others may know better.<br/>\n<br/>\nCool screenshots though!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "10:02 PM - Dec 12, 2017",
      "content": "<div>Ahah, yes, a miracle! <span class=\"text-emoji\">😄</span><br/>\nI think that it's not a change RogueKnight has made. That's because my little Nathee, at the really beginning of the original campaign (gave it a try now), when you have to buy your weapon, there is a white/fading green halo on both the halberd and the spear.<br/>\nBought the two of them and she can handle them, of course with both hands. <span class=\"text-emoji\">🙂</span><br/>\n<br/>\nIt would be perfect if someone could confirm it, but on the basis of all the evidence it seems that there are really exceptions to the weapons that can't be wielded by little creatures.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:30 PM - Dec 12, 2017",
      "content": "<div>Hmm, now I'm intrigued as well - come on, you clever buggers, has Aquarius stumbled upon a Gnome without equal, or is there a more mundane explanation? (I so want it to be that Nathee is special, btw.)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "3:26 AM - Dec 16, 2017",
      "content": "<div>This is interesting...   I run a few Halflings and have never noticed this with regards to spears or halberds.   I'll have to check it out on WoG next time and let you all know...</div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "7:17 AM - Dec 16, 2017",
      "content": "<div>Thank you very much, Grom! This can shed some light upon this matter. <br/>\nNow that I remember, I haven't done any check on exotic weapons: maybe the bastard sword and the katana (the only exotic weapons wielded with one hand by medium size people) can be grabbed by gnomes and halflings with two hands...<br/>\n<br/>\nThe weapons normally handled with two-hands by humans, elves, etc. can't surely be used by gnomes and halflings...</div>"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "1:47 AM - Dec 17, 2017",
      "content": "<div>Looking over the list you post from NWNWiKI that you posted, neither Bastard sword or Katana is on it.   Looks like they are usable by small folk.  Here's a tidbit that holds true at least over on WoG:  While Quarterstaffs are not usable by Halflings and Gnomes, Magic Staffs are.  I guess because your not supposed to be hitting folks with your Magic Staff??</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "4:53 AM - Dec 17, 2017",
      "content": "<div>Magic staffs are medium sized weapons. Humans and other medium sized creatures can wield them together with a shield.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "11:24 PM - Dec 21, 2017",
      "content": "<div>Just a question: with the halberd now usable with a small sized creature, would you prefer to use it or, instead, a scimitar for more frequent crits? it's a trade-off: better average damage vs more frequent crits.</div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "6:42 AM - Dec 29, 2017",
      "content": "<div>I just tested this in the OC Prelude (vanilla) and a gnome with martial proficiency could not equip a halberd. Either someone was playing with baseitems.2da or otherwise being creative with some other settings. But, without such tweaking, a small creature shouldn't be able to equip a large weapon.<br/>\n<br/>\n(Note that making custom weapons of other sizes is quite possible. For instance, CEP has a tiny spear that is  a medium weapon, usable small creatures as a two-handed weapon.)</div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "12:38 AM - Jan 02, 2018",
      "content": "<div>MrZork, thank you very much for your contribution!<br/>\nI don't know why the game showed the halberd as playable by my gnome (I have tried disabling the patch haks loaded into the game, and still the issue persists). However, I won't ever use it with a little character (it's been a while that it is in my inventory, not used, but ready for it), in order to play fairly (the only thing that matters to me). The same is valid for spears.</div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "1:43 AM - Jan 02, 2018",
      "content": "<div>Don't misunderstand me: If the module has added content to alter the weapon settings, there is nothing unfair about using them. I do understand your desire to play the module the way it was intended, so as not to undermine the challenges the module creator designed. I haven't played the module you mention, so I can't say whether what you are seeing was intended or not.</div>"
    }
  ]
}