{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "426",
  "name": "Paladin/?/? - build help",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/paladin-build-help-t2293831.html",
  "author": "10235414",
  "avatar": "no_avatar.png",
  "replies": "20",
  "views": "2.0K",
  "posts": [
    {
      "author": "10235414",
      "avatar": "no_avatar.png",
      "timestamp": "7:20 PM - Oct 21, 2012",
      "content": "<div>Hello!<br/>\n<br/>\nI have trouble deciding how to level my human paladin further on a rp-server. He uses bastard sword and tower shield accompanied with heavy armor currently. The level range is 1-30. The maximum item enhancements are +5 iirc.<br/>\n<br/>\nHis current stats are:<br/>\n<br/>\n<strong>Paladin (17)</strong><br/>\n<br/>\n<strong>Strength</strong> 16<br/>\n<strong>Dexterity</strong> 10<br/>\n<strong>Constitution</strong> 14<br/>\n<strong>Intelligence</strong> 10<br/>\n<strong>Wisdom</strong> 14<br/>\n<strong>Charisma</strong> 16<br/>\n<br/>\n<strong>Skills:</strong><br/>\n<br/>\nBluff 3<br/>\nConcentration 2<br/>\nCraft Armor 9<br/>\nDiscipline 6<br/>\nHeal 20<br/>\nHide 3 (this might have been a mistake, if I don't plan on making him into a blackguard.)<br/>\nIntimidate 3<br/>\nListen 2<br/>\nPersuade 3<br/>\nSearch 2<br/>\nSpot 2<br/>\nTaunt 3<br/>\nTumble 10<br/>\n<br/>\n<strong>Feats:</strong><br/>\n<br/>\nArmor prof (all)<br/>\nAura of Courage<br/>\nBullheaded<br/>\nDivine Grace<br/>\nDivine Health<br/>\nDivine Might<br/>\nDivine Shield<br/>\nLay on Hands<br/>\nLuck of Heroes<br/>\nPower Attack<br/>\nQuick to Master<br/>\nRemove Disease<br/>\nShield prof<br/>\nSmite Evil<br/>\nTurn Undead<br/>\nWeapon focus : bastard sword<br/>\nmartial simple exotic weapon prof.<br/>\n<br/>\nThere is also a modification done onto the paladin class on the server. The saving throw bonus on Divine Grace is capped to Paladin level (e.g. a level 3 Paladin would only receive a maximum of +3 saves from Divine Grace, no matter how high their Charisma modifier is).<br/>\n<br/>\nI would wish for more survivability in mostly PvM and some PvP. I'm rather melee-oriented currently.<br/>\n<br/>\nShould I focus on raising Charisma to increase my survivability? Should I take fighter levels for better weapon focuses? What about CoT? That should increase my saving throws and give me good feats. I should focus on some epic feats too. One feat which I could certainly use is Blind Fight which I don't have yet. <br/>\n<br/>\nIf there is anymore info you need, I'll be glad to provide. It's been awhile that I've played NWN.<br/>\n<br/>\nThank you!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:20 AM - Oct 22, 2012",
      "content": "<div>You have already cross-classed Tumble, you don't need to. A Paladin / CoT / Harper Scout should fit the theme and give you a decent skillset, except UMD. Plus HS gives 2 Bonus Feats. IMO invest in STR to at least 22, then if anything else is left, CHA. Use gear and buffs to cap your charisma and the two bonus feats from HS for Great Charisma (which means only take it after 21. But you would need two feats and many skills to fit the requirements. Rogue would be simpler and better, but wouldn't fit the theme, necessarily.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "6:47 AM - Oct 22, 2012",
      "content": "<div>Max has some good advice for you there, Stomppa-Tomppa, which I second. The great thing--but also the trick-- about Paladins is finding the right \"mix\" of STR and CHA. Unless you're going all out Smite Evil, there is no need for 25+ CHA. Even then I like a STR 20 myself (on build level 40); otherwise, 22+ STR rest into CHA will net you a nice balance so as to have a decent AB/damage set-up, bring on your Paladin buffs for more as required. <br/>\n<br/>\nHarper Scout is a good choice (has a nice skillset), but Rogue is even better, I agree. There is absolutely nothing that says a Rogue can't be LG. In fact, the opposite is true so far as Rogues as a class are not restricted to any alignment, free to train and use their skills for the cause of justice and force of good (and when combined with say a LG Paladin class, that makes them LG by defnition and thus they should!). When I think Pal/Rogue, 007 James Bond type comes immediately to mind; a secret agent in Her Majesty's Secret Service, out to save the wrold from the forces of evil, using his specialized training to scouting out the bad guys, gathering intelligence and hunting them down to stop them from destroying the world, bringing them to justice in the name of Queen and country. The Kings and Queens of past and the Church employed spies (intelligence gathering and counter-espionage), so there were Medieval O07s (Pal/Rogues) for sure! A dynamite combination--both build-wise AND RP-wise, indeed! <br/>\n<br/>\nSmite ON! ~ Tyr</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:07 PM - Oct 22, 2012",
      "content": "<div>For more survivability:<br/>\nUse items with bonus to strength and charisma. <br/>\nUse items with damage reduction/resistance. <br/>\nUse your spells to buff up! Don't leave home without bless, aid, bull's, cat's and GMW up. Use divine favor as often as you can.<br/>\nKeep adding to strength at level up. Take the EWF, AS and EP feats in epic levels. <br/>\nGet  the discipline skill up to an adequate level.<br/>\nAdd some more to taunt if you use that skill and still have trouble hitting others.<br/>\n<br/>\nTake at least 20 levels of paladin for full spellbook.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:33 PM - Oct 22, 2012",
      "content": "<div><blockquote><div><strong>TyrTemplar wrote:</strong>...but Rogue is even better, I agree. There is absolutely nothing that says a Rogue can't be LG. In fact, the opposite is true so far as Rogues as a class are not restricted to any alignment, free to train and use their skills for the cause of justice and force of good (and when combined with say a LG Paladin class, that makes them LG by defnition and thus they should!).  </div></blockquote> <br/>\nUnfortunately some people still think of rogues as thieves and as such as criminals. It is probably the heritage from the earlier D&amp;D editions. But the rules have changed and Tyr is right.   \n<blockquote><div>I think Pal/Rogue, 007 James Bond type comes immediately to mind; a secret agent in Her Majesty's Secret Service, out to save the wrold from the forces of evil, using his specialized training to scouting out the bad guys, gathering intelligence and hunting them down to stop them from destroying the world, bringing them to justice in the name of Queen and country. The Kings and Queens of past and the Church employed spies (intelligence gathering and counter-espionage), so there were Medieval O07s (Pal/Rogues) for sure! A dynamite combination--both build-wise AND RP-wise, indeed! </div></blockquote>\nC'mon 007 is a promiscuous assassin.   <br/>\nYou need 2 kills to qualify for the 00 status. <br/>\nTo get to the bad guys he uses his glibness and charm on their women, any number of them.<br/>\nHe is loyal to queen and country, but bends every rule in the book to get the results.<br/>\nThat's not my idea of a paladin or lawful good.<br/>\nBut I agree that he fits the rogue theme quite well.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "10235414",
      "avatar": "no_avatar.png",
      "timestamp": "2:09 PM - Oct 24, 2012",
      "content": "<div>Thanks for all the advice this far!<br/>\n<br/>\nI am now <strong>Paladin (21)</strong> and <strong>CoT (2)</strong>.<br/>\n<br/>\nStrength is now <strong>17</strong><br/>\n<br/>\n<strong>New skill points:</strong><br/>\n<br/>\nCraft Trap 2<br/>\nDiscipline 11<br/>\nListen 4<br/>\nLore 5<br/>\nSet Trap 1<br/>\n<br/>\n<strong>New Feats:</strong><br/>\n<br/>\nArmor Skin<br/>\nEpic Character<br/>\n- Paladin<br/>\nEpic Weapon Focus <br/>\nImproved Critical<br/>\nSacred Defense<br/>\nPurge Infidel ( Smite Evil )<br/>\n<br/>\nShould I still keep trying to apply for the Harper Scout? I already have item enchantments and spells which give me 22+ strength but now I'll have to raise it to 18 to get an even number without buffs.<br/>\nI took CoT before I was level 20. CoT doesn't get Smite Evil but \"Purge Infidel\" which gives CoT the ability to gain bonus damage equal to their class level, for the duration of their Charisma modifer as rounds. The bonus damage however, works only against those who have a different alignment me (still sounds useful though). Against opponents with same alignment, the Purge Infidel ability does not work.<br/>\n<br/>\nThe requirements for the HS is:<br/>\nFeats: Skill Focus: Listen, Skill Focus: Spot<br/>\nSkills: Craft Trap 2 ranks (done), Set Trap 2 ranks, Discipline 8 ranks (done), Spot 2 ranks (done), Listen 2 ranks(done), Search 2 ranks(done) and Lore 6 ranks <br/>\n<br/>\n24 : ???<br/>\n25 : ???<br/>\n26 : ???<br/>\n27 : ???<br/>\n28 : ???<br/>\n29 : ???<br/>\n30 : ???<br/>\n<br/>\nTell me if I've made mistakes.<br/>\n<br/>\nThanks!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:59 PM - Oct 24, 2012",
      "content": "<div>I would finish this build with Pal 23, Cot 6 Rogue or Monk 1, take Rogue or Monk to pump up Tumble, and in the case of Rogue, also UMD (Use Magic Device) at level 27, which would net you 30 Tumble, which is the maximum you can attain.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "10235414",
      "avatar": "no_avatar.png",
      "timestamp": "9:37 PM - Oct 24, 2012",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong>I would finish this build with Pal 23, Cot 6 Rogue or Monk 1, take Rogue or Monk to pump up Tumble, and in the case of Rogue, also UMD (Use Magic Device) at level 27, which would net you 30 Tumble, which is the maximum you can attain.<br/>\n<br/>\nTake it EZ!</div></blockquote>\n\nAh, I see. Any tips on what feats I could take (Blind Fight comes first into mind)? Should I keep raising strength or charisma? What about skills? I've been mostly raising heal, discipline and tumble. I was told that Taunt could be good too. <br/>\n<br/>\nI think I'll take the monk as it might fit more to my character.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:06 AM - Oct 25, 2012",
      "content": "<div>I would probably raise STR, Taunt is definitely good, Heal isn't, so you can stop raising it. There is something called Skill Dumps in NWN which isn't true for PnP. This means that if you take just 1 level of Monk at lvl 10, for example, and obviously have enough skill points, you can raise your skills as high as a Monk 10. So, stop taking Tumble and save points to take that with the Monk level.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "6:48 PM - Oct 25, 2012",
      "content": "<div>Actually, I am going to defend the choice of Rogue here, both for RP reasons and build reasons. (Perhaps James Bond wasn't the best example, but he definitely was no doubt about it a charming Rogue ... right you are, Mick; perhaps \"M\" would be a much, much better example, keeping James Disciplined while ENFORCING the Code ... <br/>\n<br/>\nMonk on a Paladin build? That is pure \"CHEESE\" ... it's OK, nothing wrong with it (lots of great skills, indeed), but let us call it what it is--I mean, RP? NOPE. Wearing Armor and using weapons VIOLATES 100% the Monk CODE, and lose ALL of their Monk abilities when violate their CODE. Now, I ask you: a) would a REAL monk (1 level does not for a monk make) violate the code (LG, LN or LE ONLY choice) -or- a Paladin (knight in shining armor, with the sword) make for a Paladin running around in cloth striking out with a fist (or kamas only), zero benefits with only 1 monk, or even begin to suggest a Holy Man of the Cloth (i.e. Monk) violate his own Oath when the Paladin has him/herself taken an Oath? COME ON. To avoid a Rogue due to old \"impressions\" of the class as being thieves, which isn't true (again, Rogues are not Limited, can be any alignment they want; as to monks, can be Lawful EVIL too you know, serving the serpent god, enslaving villages and sacrificing babies at the alter of doom). Seeing as you have already taken a few skills in traps, ROGUE works--already going the Secret Agent route, Her Majesty's Secret Service / CSIS (RCMP) / CIA. Medieval version of course, defending the people against terrorism, espionage, and bringing diabolical EVIL \"master minds\" to justice, in which case the only code a Pal/Rogue/CoT follows is that of the Paladin one proper. <br/>\n<br/>\nAlso, build wise: Rogue gets you a nice skills dump right away. You are playing up on a RP-server, and trust you aren't liking much all the attack of opportunities you are no doubt attacting when running around, especially when in combat. 26 Pal, 10 COT, 4 Rogue for 40 / make that: Pal 23/5 CoT/2 Rogue for lvl 30). <br/>\n<br/>\nYes, could put Rogue off to the end (or monk, though that doesn't in my mind work RP-wise, for reasons said, but also means a bunch of nasty AoOs, as you don't have mobility/spring attack. Tumble avoids that, which is a DEX-based non-melee skill (cross-train on a Pal/melee only as you know), and which Tumble Check to avoid AoOs is penalized when wearing heavy armor (-7 to -8 depending on the armor, with another -10 coming in if use a big board/Tower Shield). Note: when playing a pure melee be it a Paladin or what have you up, if going full-warrior of it (absent spring attack, etc.) then I cross-train as you are doing, having Cat's potions in my pack (up the Dex, in turn tumble), no need to worry about fear, etc. on a pally (unlike other melee warriors, no protect v. alignment etc. either so have need to cart clarity potions as well as Cat's, barring a Rogue or Bard in the mix, which allows for UMD--magic access, plus Tumble of course). <br/>\n<br/>\nNow, the good Pally spell Prayer gives a nice boost (+1 all skills), such that by Lev. 40 cross-class Tumble 20 (21 points in adjusted for 8 or 9 Dex), add +1 Prayer so 21 \"effective\" points, netting you a final adjusted score Tumble 14 (accounting for your armor) when sleeping naked under the stars, so not attacting AoOs when walking past enemies, much less running around in combat either without anything more. Hence, by Lev. 40 all good to go, no problem at all (actually, much sooner i.e late 20s, with a little help from a dex item which should be easy to find even on a low magic setting, but the point being if x-train same as if added a single level of Monk or Rogue at the end, only difference being the \"tumble class\" would on a 30 lev. build +3 (AC over a build w.o a tumble class in the mix. But waiting until the end has its drawbacks: i.e.,  AoOs ... a bit of a pain. (Technically, could wait as playing 30 and not 40, this is an option, and a good one as Max suggests, as it does mean more AC in the end, though).  <br/>\n<br/>\nSeeing as you are adding a tumble class anyway, however, why not NOW? i.e., get that tumble. If go Rogue also means some UMD (magic access) right away, as opposed to \"stocking up\" and waiting for a final skills dump. This, unless your world gives out free spring attack or you can find some Boots of Tumbling (boosts tumbling) which in turn would allow you to delay that, but still nice to pick up a little magic access on a melee. A paladin doesn't need UMD, comes with the good Paladin spell book (including immunities, nice saves especially when as here combined with CoT so no concern there, with healing and other such things). <br/>\n<br/>\nMonk--old Cleric trick, works for the tumble, but not exactly done for the RP. Rogue on the other hand, a different story: not just the tumble of course but can be anything they want, and with Paladin in particular fighting the good fight, believing in equality and freedom for all by definition, why on earth as a Paladin would you want to pre-judge an entire class, based on ... NOTHING. Rogues are NOT EVIL. But heh Monks can be (LE in fact, just as easily as LG or LN. And they do NOT wear armor or fight with weapons. Just saying...)<br/>\n<br/>\nJust some food for thought, in defense of the Rogue class. Other skills as a Pal/COT include: Concentration (if you want to cast defensively, use with defensive casting mode), and Taunt, yes. A very nice skill for the Paladin to have, don't leave home (PvM/E) without it, I agree! In terms of Equp't, other than the Dex thing (for Tumble DC), STR and CHA, also agree. And don't pre-judge the entire Rogue class just because of a charming one by the name of James Bond, eh? THINK \"M\" instead--and there you go!!   <br/>\n<br/>\nCheers<br/>\n<br/>\nEdit: remove typos, adjust for level 30.</div>"
    },
    {
      "author": "10235414",
      "avatar": "no_avatar.png",
      "timestamp": "7:52 PM - Oct 25, 2012",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong>I would probably raise STR, Taunt is definitely good, Heal isn't, so you can stop raising it. There is something called Skill Dumps in NWN which isn't true for PnP. This means that if you take just 1 level of Monk at lvl 10, for example, and obviously have enough skill points, you can raise your skills as high as a Monk 10. So, stop taking Tumble and save points to take that with the Monk level.<br/>\n<br/>\nTake it EZ!</div></blockquote>\n\nRighto.<br/>\n<blockquote><div><strong>TyrTemplar wrote:</strong>HOW DARE YOU HATE ON ROGUES</div></blockquote>\n\nWhoa! Okay, thanks for the advice. I guess I'll be going rogue then, aslong as I am not chastised about it too much in the server.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:27 PM - Oct 25, 2012",
      "content": "<div>Then go Rogue 3 CoT 4, cuz CoT 5 gives nothing, so you can at least have Uncanny Dodge, for what it's worth.</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "9:17 PM - Oct 25, 2012",
      "content": "<div>LOL! <br/>\n<br/>\nRemind them of the Paladins of Avoreen--defense, duty, war and vigilance (god of war, and Halflings, too, but not just halflings of course, cultivating good relations--and in turn numerous followers of Human, Dwarf and Elf pantheons. This, not to mention favoured class of the Halfling? Rogue ...  Dogma of Avoreen is Vigilance/keeping watch to protect against i.e. espionage and terroism, yes? CSIS, SIS (MI6), CIA, etc. Medieval times, to make the nation safer by maintaining readiness (and thus aggressive watchfulness) for incursions -- sure sounds to me like Pal/Rogue, aka \"secret agent\".  <br/>\n<br/>\nAnd yes, Rogue 3/CoT 4 works, too, but CoT 5 does give Divine Wrath--+3 AB/Damage and Saves, lasting the duration of your Cha-modifier (which Cha you're going to be enhancing any way, so why not ....). Yes, it's only once per day, but it's a nice little boost, the damage is \"divine\" based meaning it's not resisted.  Not huge, but still nice. Uncanny prevents Dex AC (not dodge, but DEX) from being lost when flat-footed or attacked by i.e. invisible creatures (very important to a Dex-based build for obvious reasons, not so much for a Str-based plate wearer--plate allowing for a +1 AC from Dex boost). 2 rogue is good and sufficent for the skills dump, and even nets you a bit of sneak (1d6) on your sword (3 of it would make that another sneak bonus (2d6), which is cool), and the evasion brought in on Rogue (2) is  nice, too. All the better for spying on and keeping watch over the bad guys, need good reflexes when a specialized secret agent, right? Either works, so up to you. <br/>\n<br/>\nA good choice, build-wise and RP-wise, I think. Makes me sleep much better at night, on behalf of the town, knowing there are specialized agents like you out there, keeping a watchful, vigilant eye over the bad guys, maintaining a proper level of preparedness against potential incursions, war (intelligence gathering is important and an honourable calling in turn), thus ensuring the people are safe and sound. LOTS to work with there, yes? And sounds good.   <br/>\n<br/>\nCheers</div>"
    },
    {
      "author": "10235414",
      "avatar": "no_avatar.png",
      "timestamp": "5:25 PM - Dec 11, 2012",
      "content": "<div>I have now reached max 30 and I look like this:<br/>\n<br/>\nPaladin 23 <br/>\nCoT 4<br/>\nRogue 3<br/>\n<br/>\nStrength 20<br/>\nDexterity 10<br/>\nConstitution 14<br/>\nIntelligence 10<br/>\nWisdom 14<br/>\nCharisma 16<br/>\n<br/>\nSkills <br/>\nBluff 3<br/>\nConcentration 2<br/>\nC. Armor 9<br/>\nC. Trap 2<br/>\nDiscipline 16<br/>\nHeal 20<br/>\nHide 3<br/>\nIntimidate 3<br/>\nListen 4<br/>\nLore 5<br/>\nPersuasion 3<br/>\nSearch 2<br/>\nSet Trap 1<br/>\nSpot 2<br/>\nTaunt 11<br/>\nTumble 30<br/>\nUMD 10<br/>\n<br/>\nFeats<br/>\nArmor Skin<br/>\nBlind Fight<br/>\nBullheaded<br/>\nDivine Grace<br/>\nDivine Health<br/>\nDivine Might<br/>\nDivine Shield<br/>\nEpic Prowess<br/>\nEpic Weapon Focus (b.sword)<br/>\nEvasion<br/>\nExtend Spell<br/>\nGreat Strength 1<br/>\nImproved Critical (b.sword)<br/>\nKnockdown<br/>\nLuck of Heroes<br/>\nPower Attack<br/>\nSacred Defense<br/>\nSneak Attack +2d6<br/>\nUncanny Dodge 1<br/>\nWeapon Focus (b.sword)<br/>\nWeapon proficiency exotic<br/>\n<br/>\nIf I should do a rebuild, what should I change? I was thinking of taking atleast 4 levels of fighter to get weapon specialization. I would like to be more devastating in melee, especially pvp. Guess that also means focusing on building strength. I also wasted a few skill points when trying to get the Harper Agent-requirements.</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "8:01 AM - Dec 14, 2012",
      "content": "<div>If you're going to take fighter for weapon spec, make sure to take FTR 4 on an epic level that gives a general feat 21, 24, 27, 30), so you can take both Weapon Spec and Epic WS at the same time on that level.  Also, you'll run into XP penalty taking FTR instead of CoT, so take that into consideration.<br/>\n<br/>\nNot knowing anything about your server, I would take Toughness or Cleave over Bullheaded, given your request for better melee presence.  <br/>\n<br/>\nOne area that may make a difference (but it's very AC/environment-dependent) is going with a Scimitar instead of Bastard Sword for the increased threat range for more critical hits, but that's only if you'll actually hit on the low end of that range (15-16 if no Keen available and 12-14 with Keen) to get a crit.  Given that you can buff Bless, AID, and +5 from divine favor from an AB perspective, that may be a good option, especially as you have a higher STR and lots of damage buffs (holy sword, defeaning clang, GMW or +5, etc).<br/>\n<br/>\nFor PvP, your taunt will be more effective if you max it out, esp vs melee since they usually don't take concentration.</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "8:22 AM - Dec 14, 2012",
      "content": "<div>I'm doing a double-post because the previous one was minor edits to what he had, but if he can rebuild from scratch, here's a different view that's significantly more powerful in melee, if the RDD portion is viable from a RP perspective, bringing your inner dragon (and soon outer) to bear against your enemies.<br/>\n<br/>\nPaladin(19), Sorcerer(1), Red Dragon Disciple(10), Human<br/>\n<br/>\nSTR: 16 (34)<br/>\nDEX: 8<br/>\nCON: 12 (14)<br/>\nWIS: 14<br/>\nINT: 12 (14)<br/>\nCHA: 14 (16)<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Paladin(1): Power Attack, Weapon Focus: Longsword<br/>\n02: Paladin(2): {Smite Evil}<br/>\n03: Paladin(3): Cleave<br/>\n04: Paladin(4): STR+1, (STR=17)<br/>\n05: Paladin(5)<br/>\n06: Paladin(6): Extend Spell<br/>\n07: Paladin(7)<br/>\n08: Paladin(8): STR+1, (STR=18)<br/>\n09: Paladin(9): Improved Critical: Longsword<br/>\n10: Paladin(10)<br/>\n11: Paladin(11)<br/>\n12: Paladin(12): STR+1, Blind Fight, (STR=19)<br/>\n13: Paladin(13)<br/>\n14: Paladin(14)<br/>\n15: Paladin(15): Divine Might<br/>\n16: Paladin(16): STR+1, (STR=20)<br/>\n17: Paladin(17)<br/>\n18: Paladin(18): Divine Shield<br/>\n19: Paladin(19)<br/>\n20: Sorcerer(1): STR+1, (STR=21)<br/>\n21: Red Dragon Disciple(1): Epic Weapon Focus: Longsword<br/>\n22: Red Dragon Disciple(2): (STR=23)<br/>\n23: Red Dragon Disciple(3)<br/>\n24: Red Dragon Disciple(4): STR+1, Great Strength I, (STR=27)<br/>\n25: Red Dragon Disciple(5)<br/>\n26: Red Dragon Disciple(6)<br/>\n27: Red Dragon Disciple(7): Great Strength II, (STR=28), (CON=14)<br/>\n28: Red Dragon Disciple(8): STR+1, (STR=29)<br/>\n29: Red Dragon Disciple(9): (INT=14)<br/>\n30: Red Dragon Disciple(10): Great Strength III, {Darkvision}, (STR=34), (CHA=16)<br/>\n<br/>\nHitpoints: 338<br/>\nSkillpoints: 133<br/>\nSaving Throws (Fortitude/Will/Reflex): 21/18/13<br/>\nSaving Throw bonuses: <br/>\nBAB: 24<br/>\nAB (max, naked): 39 (melee), 23 (ranged)<br/>\nAC (naked/mundane armor/shield only): 16/27<br/>\nSpell Casting: Paladin(4),Sorcerer(1)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 33(35), Discipline 33(45), Lore 8(10), Tumble 15(14), remaining skillpoints 29<br/>\n<br/>\nSo despite not having Epic Prowess, your AB is 5 points better that the build you ended up with above, due to your strength being 14 points higher - and you're doing 7 more damage right off the bat per hit (better than WS+EWS).  You'll also have the same Paladin buffs in addition to between 4 and 6 True Strikes (depending on CHA buffing/gear) that can be cast in full armor/shield.  <br/>\n<br/>\nThe +4 AC almost makes up for the -5 AC loss from not getting Armor Skin and 3 more Tumble AC and not only are you immune to fire, but you have a dragon breath of your own.<br/>\n<br/>\nGiven the even higher AB and the buffs available, I'd be tempted to go Scimitar assuming the lower end of the crit ranges are hitting per my post above.<br/>\n<br/>\nThen you'll truly be a Holy Beast.<br/>\n<br/>\nEDIT - you can get that extra point of AC back with Mage Armor, though it only lasts for 1 hour and has to be cast without armor/shield.</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "1:57 PM - Dec 14, 2012",
      "content": "<div>Stomppa, Good to hear.<br/>\n<br/>\nAs to FTR or COT on a Pal, both are similar (Fighter gives one extra feat and opens WS/EWS, but COT gives saves but Pal has nice saves on its own. If so, then 25 Pal/4 FTR/1 Rogue (delay rogue to end, otherwise, I see XP burden). Grab WS/EWS as above said (i.e., take EWS as epic fighter bonus feat same time grab WS on gen feat on ftr 4), and toughness, I agree, too. Only prob with that is if delaying tumble until the end, back to the same issue: i.e., AoOs while running around in combat througout your career. <br/>\n<br/>\nAs to adjusting for PvM or PvP, what's more important? If PvP, first thing's first. Drop DM/DS (you are not going the great smite route, need more naked AB/damage in turn), thus drop CHA and throw that into STR, keep your good Pal book (it's nice), and even nicer when you can't be dispelled meaning unless altered on your world 24+ Pal needed (those who say differently don't know what they are talking about, never having had the pleasure of being dispelled/morded and when they do, they'll change their tune). When you rely on buffs (PvP), you'd better be bullet proof against dispel and just in case of mord's you'll want a decent naked AB going in always, not to mention you're a melee and shouldn't be buff dependent as such (buffing is for clerics; Paladins are warriors. Shouldn't in turn like clerics fear Mord's. Drop the Cha/divines, pick up STR thus AB/Damage as said.   Other alternative if want to keep DM/DS is to take Pal 4 only, drop WiS and DEX, put into STR and go heavy Fighter of it (using Pal 4 to pick up the DM/DS as gen pre-ep feats), 1 rogue at end (avoid XP burden). Playability though, Pal 24/Cot 4/Ro 2 (no xp burden, grab tumble avoid AoOs while levelling, important when actually levelling, as we discusssed). <br/>\n<br/>\nOh, and swap Bastard sword for Scimitar (better crit range PvP), meaning one more feat for you, and thanks for reporting back. Its good to hear. <br/>\n<br/>\nSkills? Discipline, x-class tumble, either full train taunt or x-class spellcraft, or both. Concentration is nice, too (if pvp to resist a taunt, otherwise, dont bother with it, buff before battle not casting fireballs etc. while in it; again, youre a warrior, not a caster).  Up UMD, too (rogue doesn't enjoy arcane item entitlement unlike bard, so bring that up a bit, unless that's sufficient where you play for gear available, etc., such things being world dependent in turn). Just some ideas for you. <br/>\n<br/>\nPS Dante--a level 30 version of my Knight of Bahamut? Very cool. Might want to go Pal 25/RDD 4/Sorc 1 of it (i.e., dispel factor and all, assuming not altered. <br/>\n<br/>\nAa to RP and Dragonborne Paladins, they're knights of Bahamut, Bahamut being a part of D&amp;D since the beginning (Dragon King in very 1st supplement, Greyhawk, as I recall; by name in AD&amp;D first edition. Since then the portfolio of Paladins originally that of  Heironeous but now Bahamut's as well. And more about which you can read in my Dragon Lance/Dragon Knight build  here <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/dragon-lance-divine-dragon-pal29-rdd10-sorc1-t2294236.html\" rel=\"noreferrer\" target=\"_blank\">dragon-lance-divine-dragon-pal29-rdd10-sorc1-t2294236.html</a> .  You see, Stomppa, legitimate. If you should like and someone gives you a hard time of it, tell them to read the original D&amp;D books (where he was introduced first as \"Dragon King\" as said),. <br/>\n<br/>\nCheers</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "5:20 PM - Dec 14, 2012",
      "content": "<div>Agree with TT, if a main focus is PvP and casters are included, you'll want to keep at least 24 Paladin lvls in your non-RDD version.  Some of the lvl mix and skills dependent on available gear - for example when you say +5, how easy is it to get multiple items (along with being viable to wear them all) with +5 to saves?  If you can get +5 saves on multiple items, spellcraft becomes obsolete.  If you can get holy Avenger property and/or weapons with some damage bonuses, some of the buffs become redundant as well and dispel-ability is much less of a concern.  <br/>\n<br/>\nAlso agree with her on the PvP feats - DM and DS won't really be of as much help as things like toughness or knockdown.<br/>\n<br/>\nThe RDD build was actually something I threw together awhile back based off of Mith's original <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build240938.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 40938.html</a> Knight of Bahamut and I just swapped Bard for Sorc since many places don't allow alignment changes.  Where I play damage bonuses and heal potions are easy to come by, so the Divine might/shield combo doesn't help me much, so I run toughness, knockdown, and luck of hereos.</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "5:41 PM - Dec 14, 2012",
      "content": "<div>Cool. And yes, Mith and I both enjoyed RDDs, both drafing up Pal/RDDs, revising mine since in light of the patch, meatime since the beginning both Mith and I hammered home the point of their legitimacy-- powerful yes but also legitmate RP-wise, NWN1, NWN2 and Bio-boards, etc., too (revised my old ones for NWN2 as well; great combo, and still is). Seems the game (D&amp;D owned by WoTC from whom Bioware's NWN/NWN2 is licensed) agrees with us, so far as Bahamut, Dragon King, the lawful good dragon's portfolio was extended, responsibility for paladins!!! About time, heh. (so when it comes to RP-oriented servers, players who like the combo can rejoice as in no issue, eh?  <br/>\n<br/>\nMeantime, LoH is another good one (+1 all saves? Why not). Spellcraft though is important, especially PvP (sure, a +5 item is nice, but that stacks with spellcraft so as to become +9 v saves (x-crass, mod. 20 points; +10 assuming 22-3 mod. ranks and fox scroll or potion, esp. if dropping CHA as suggested, then sp.craft makes up for that, and something thus to consider in turn). Paladins are supposed to be immune to fear [careful, there's a bug that came in 1.69 as it pertains to Barbarian's Terrifying Rage, though. Seems TR ignores the fact that Pals are supposed to be immune, skipping the roll (which is still against fear) and applying not fear but rather what sure looks to me like paralysis instead, which is WORSE]. Otherwise, and that said, no such thing as too mjch saves when it comes to PvP. (Pal sans RDD aren't exactly dodging fire balls much less other high damage area of effect spells, get fear immunity, death ward and freedom, sure, but not much in the way of elemental resistance etc. either, so be careful about that). <br/>\n<br/>\nOtherwise, good stuff.<br/>\n<br/>\nTyr<br/>\n<br/>\nEDIT: just to add a quick note re: gear. If in a world where say +5 items are available, remember, you get +5 perma ab boost yes (making GMW and Holy Sword redundant, save and except HS's divine damage boni vs. evil, which is still nice); however, also means that everyone/everything else gets +25perma boost to AC (i.e., dodge, armor, deflection, natural, and shield). The higher the magic, the more AC outpaces AB, meaning, you need even more natural AB (to which you'll then add solid buffs, like divine favor, aid, bless and prayer, for more). In such environs, where weaponry enhancements like GMW become redundant, HS remains useful (divine boni v evil as noted), but also made redundant if find sword with holy avenger property, so very true. In such a case, fill book with div.favor, which remains useful. Also easy to cap out your CHA (Aura/Eagle's) and STR (bull's) in such environs as well, enabling better management of not only your spell book but also equipment slots, which are not infinite. Hope this helps.</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "7:15 PM - Dec 14, 2012",
      "content": "<div>right, I had meant that if +5 items with saves are relatively easy to get, then getting 4 of them to cap it out wouldn't be a problem, if the saves are on gear you'd normally otherwise use.  E.G. on a server I regularly play on, by 40th lvl, there are a variety of items with +10 to saves and a bunch more with +5, so getting to the cap with items you'd wear normally is pretty typical, so I only ever take spellcraft if it's necessary for feats; that's what I was getting at for the OP w.r.t. being environment-specific.</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "8:07 PM - Dec 14, 2012",
      "content": "<div>Dante, in such a place, I wouldn't take spellcraft either. Gotcha. <br/>\n<br/>\nStomppa, what we're talking about here when it comes to ie spellcraft and saves is the fact there's a bio-cap on saves, which is set at +20. Gear applies to cap, as does CoT's sacred defense and spellcraft (spellcraft applies only to save v. spells, though, whereas sacred defense, gear, etc. applies across the board, including but not limited to just spells). Pall Cha boni doesn't count towards that cap, gaining up to +6 more assuming CHA +12 (bio stat cap).  Once hit the caps, that's it. I'm not one to advocate gear-dependency but yes, if know for certain you'll get items which you'd ordinarily wear anyway that bring you to cap (without taking slots you'd otherwise want to use for something else as per Dante's e.g., and it's a good one), then no point in such environs wasting points on spellcraft when can use them (or the ability needed  to get those points in order to train it) for something else, I agree. <br/>\n<br/>\nLots of good advice in here for you to consider, and look forward to seeing what you do! <br/>\n<br/>\nTyr</div>"
    }
  ]
}