{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "685",
  "name": "Shh! Tell No One...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/shh-tell-no-one-t2355040.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 40,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:35 PM - Mar 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I wish I could have made the subject title a spoiler, but it appears I can't.<br/>\n<br/>\nI've just finished a Baldur's and Baldur's 2 run-through and before embarking on another Dragon Age run, I'm at something of a loose end (there, that's my excuses out of the way). Thus, I find myself thinking about forbidden subjects - namely magic and its uses.<br/>\n<br/>\nNow, a couple of things to get out of the way...I've never made an arcanist before, so will need even more babysitting than usual - yes, it's another round of dumb-ass questions from Stag on its way! Second, I've decided on Sorcerer for my first foray. Being a meleer by nature, all that preparation of spells that Wizard entails leaves me cold - give me spontaneous casting any day. Third (yes, I know...), if I'm going to do it, I don't want to confuse myself by being a spellsword or melee-mage: I want to stand behind and hurl horridness at things from afar.<br/>\n<br/>\nMy first thought was to harness the CHA synergy between Sorcerer and Bard, but then two things happened. I realized that the Sorcerer spells were always going to supercede the Bard ones, so in effect Bard would only be there for song, Tumble, and Lore, and given that I'm looking at about 26 levels of Sorcerer that wouldn't amount to very much. The second thing that happened was that I looked up the prospective classes in the Guild Filter and the Legacy Archive and there were none, which was a pretty big clue.<br/>\n<br/>\nThen I thought about other classes with potential synergy Pally, BG and CoT. I ruled BG out purely on the basis of not wanting 2 classes I've never played before at the same time, let alone having to be evil. Pally then went in the bin having seen Valerfor's Battle Sorceress, because it's both a combat pc and far too good a build for me to get close to. So, CoT, for a bit of occasional smiting (oh, and bonus feats and saves, too).<br/>\n<br/>\nSo I was left wondering about a 3rd class. Rogue has its appeal, as it always does, but guess what popped into my mind... Yep, Monk. A little speed, Tumble, and gear.<br/>\n<br/>\nIt's probably about time I asked a question now (if anyone's still awake). Is the idea of a Sorcerer/ Monk/ CoT build a stupid one? I'm currently toying with a Sorc 26/ Monk 4/ CoT 10 split, but I don't want to hurtle down a dead-end immediately.<br/>\n<br/>\nCheers<br/>\n<br/>\nOh, and I'd appreciate it if you didn't tell anyone about this, thanks.<br/>\n<br/>\nEDIT: Sorry, should have said that I'm looking at human. Would have been dwarf but for the CHA pen or gnome but for the xp pen. And human gets an extra feat and skill points, obvs<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:58 PM - Mar 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Shh! I'll whisper!!!<br/>\nYou are thinking of a NWN sorcerer right?<br/>\nAnd no half-breed, but a pure *whispers* m a g e.<br/>\nJust to clear things out...that is.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:12 PM - Mar 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">*Sighs* Yes. To both.<br/>\n<br/>\nI started thinking about a full 40 level Sorcerer, but thought that might be a bit of a stretch for me. It may (or may not) be easier to construct, but another class or two would make me feel more comfortable in my own skin.<br/>\n<br/>\nGods, Grom's never going to speak to me again...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:40 PM - Mar 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">(((<span style=\"color:#999999\">First of all: This is brave!</span>)))  Shh...<br/>\n<br/>\nMaybe if we can talk about what makes a mage tick, things will become less scary.<br/>\n<br/>\nFirst ((quiet)) lesson for building a sorcerer:<br/>\n1) Forget all you know about BAB and AB - it is irrellevant. If you hold a weapon, it is because it has item properties you want.<br/>\n2) Spell DC and Spell penertation are your new AB. You can either start reading up on it, or you can just take my word for it and get a<strong> high Cha</strong> (if sorcerer) for the Spell DC and a <strong>high casterlevel</strong> for the Spell penetration. There are feats to enhance both further, but that is secondary.<br/>\n3) A high caster ability (Cha for sorcerer) also grants you extra spell slots<br/>\n4) Keeping a high caster level while leveling pre epic is essential for getting powerful spells as soon as possible.<br/>\n<br/>\nSecond (secret) lesson for building a sorcerer:<br/>\nYou want a high spell DC to prevent your target from saving versus your spells. You want to focus on one or two spell schools to improve the DC of those spells. You have three feats you can take: Spell focus, Greater SF and Epic SF in any given spell school. You need the first to take the second, and the second to take the third. Each adds +2 to the DC of spells from that school. <br/>\nYou want a high enough Spell penetration to ovecome the Spell resistance of your target. You may need to boost this with extra feats if you multiclass and lower your caster level, if you take your mage to an area with foes above your level or if you just happen to play a module where the designer has added a high SR to bosses or just given SR to more monsters than usual. So this may be circumstantial.<br/>\n<br/>\nThird (silent) lesson for building a sorcerer:<br/>\nThere is something called meta magic. It has two uses: 1) It changes the spell 2) it makes it possible to cast the same spell from spell slots of different spell levels. The first is important for all mages. The last is especially important for spontaneous casters, like the Sorcerer. My hottest for a sorcerer are: extend, empower, maximize and silent.<br/>\n<br/>\nForth...<span style=\"color:#999999\">.shhhh</span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:06 PM - Mar 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Mick. Given that none of the great and good have produced a Sorcerers' Guide in the Game Guides section (irresponsible people that you are), I've just had to go by what I can pick up from other builds and the wiki. Which only further confuses me as often as not.<br/>\n<br/>\nAnd I do remember about meta magic - I had a thread back in 2017 entitled \"Explaining Meta Magic to a Monkey\" - a little sly learning.<br/>\n<br/>\nWhile researching a bit about these infernal arts, when I half-contemplated Wiz, I particularly liked the look of Evocation and Conjuration schools - kewl AoE effects apart from anything else - and if I'm going to stand on a hilltop in a dress with my hands aloft I want it to look pretty damned impressive. I'll confess, not specializing as a Wiz was another attraction to going for Sorcerer.<br/>\n<br/>\nNow, as for the other (secret, on tiptoes) info... Effectively, the deal is to swap combat feats for arcane ones. Thus, Blind Fight, Knockdown, Imp Crit can all hit the high road (I might still want to keep one or two, just in case) - particularly as a non-melee build. Then crank up both potency and volume. Hence the meta malarkey and things like Still, Extend, Empower and Max.<br/>\n<br/>\nNow, my biggest problem (and this is only a guess, there may be way bigger ones) is likely to be preventing myself from being too squishy, which is why I was wondering about Monk and CoT as potential complementary classes.<br/>\n<br/>\nAnd so the story that no one will ever know moves on...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:06 PM - Mar 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Forth lesson for building as sorcerer (don't tell anybody):<br/>\nDefense:<br/>\nYou already know how AC works. It works in the same way for casters.<br/>\n<br/>\nIt is even possible (shh), but somehow complicated to use shield and armor. You will then need the armor and shield feats. The best way to get them is to take a level of a class that gets them at lvl 1 like fighter, paladin, blackguard and cleric. Armor and shield interfere with arcane spells and can cause you to fail at casting your spells. You can still your spells (Still spell metamagic feat) and cast them at one spell level higher than normal, and you can take the epic Auto still feats and cast normally, despite your armor and shield. So using armor comes at a price. You have to spend feats and most probably you want to multiclass. Most sorcerers work well without, but on WoG they started playing a build known as the Exalted sorceress.<br/>\n<br/>\nYou already know how saves work. You have Spellcraft to improve the saves vs spells. You also have a fat Charisma that will give a great boost to saves if combined with the Divine grace feat of the Paladin or the Dark blessing feat of the Blackguard. This is one more of the ideas behind the Exalted sorceress. You don't have to use this, but you must know of it.<br/>\n<br/>\nIf you have good saves, Evasion can protect you from much elemental damage. You can get it early from several classes, already at lvl 1 from Monk. One more idea behind the Exalted sorceress.<br/>\nAnother point when using those classes is the access to Tumble as class skill.<br/>\n<br/>\nYou have access to a lot of spells that come into play for defensive purposes. They can give you different forms of AC, Damage resistence, Damage reduction, absorption of elemental damage, Self concealment, Invisibility, spell absorption etc etc.<br/>\nBut how to use spells falls under the lessons for <strong>playing</strong> a sorcerer.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:32 PM - Mar 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ha - I'm getting a Game Guide by default!<br/>\n<br/>\nWith my particular thoughts for my first crack at Sorcerer, I don't want shield and armour, so let's not worry unduly about them and their impact - it was part of my thinking about taking Monk as a complementary class.<br/>\n<br/>\nThis all seems to be suggesting that Sorcerer/ Monk/ CoT might actually be a viable option (assuming I take a WF in a weapon, of course). Maybe Sor 16/ M 2/ CoT 2 pre-epic? That's a wild stab in the dark, btw.<br/>\n<br/>\nI'll see what I can dig up about Exalted Sorceress builds as well - but Pally is a bit <em>too</em> LG for my liking, and BG is a build I'm not ready for yet.<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: So, presumably, I wouldn't need Still Spell if I'm not wearing armour?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:39 PM - Mar 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite> - and if I'm going to stand on a hilltop in a dress with my hands aloft I want it to look pretty damned impressive. I'll confess</div></blockquote>\nHere is something to look forward to. Quite the opposite of a hilltop, but even so:<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201903/10235235_fdc795ed92c1533e8f3b4ec4ccfcd639_t.jpg\" />\n</dl>\n</span><br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201903/10235235_82af65bc4b245a6bb4903bc8d370b878_t.jpg\" />\n</dl>\n</span>It is from Aielund second act, the Isle of the dead dungeon. And it is from the solo run with my Evil Speed Caster, but obviously before she multiclasses.\n<details><summary>Spoiler</summary>There are some rooms where you spawn a Warlord Mummy when you pick a magical weapon from a sarcophagus. There was a loop that let me pick the weapon and replace it and pick it and so on and spawn the room full of Warlord Mummies. I finished them all with a couple of castings of Sunburst and maybe a Firebrand to finish off any stragglers. I would not dare to try that stunt with a fighter type.\n</details>\nIf nothing else, it was a fine picture of the mummies.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:01 PM - Mar 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nHa - I'm getting a Game Guide by default!<br/>\n<br/>\nWith my particular thoughts for my first crack at Sorcerer, I don't want shield and armour, so let's not worry unduly about them and their impact - it was part of my thinking about taking Monk as a complementary class.<br/>\n<br/>\nThis all seems to be suggesting that Sorcerer/ Monk/ CoT might actually be a viable option (assuming I take a WF in a weapon, of course). Maybe Sor 16/ M 2/ CoT 2 pre-epic? That's a wild stab in the dark, btw.<br/>\n<br/>\nI'll see what I can dig up about Exalted Sorceress builds as well - but Pally is a bit <em>too</em> LG for my liking, and BG is a build I'm not ready for yet.<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: So, presumably, I wouldn't need Still Spell if I'm not wearing armour?\n</div></blockquote>\nFor your first build, and I mean just to learn how to build: Try first to build a pure sorcerer, just to get a feel with how to distribute abilities, when you get the different spells, what feats to take and where to put them. And what skills you have available. Keep it simple. Then you have something to work on and compare other builds with.<br/>\n<br/>\nFor playing a sorcerer, it is a step by step learning by doing process. And every level has its possibilities and challenges. You will be selecting and deselecting and using different spells as you level up. But all that comes later.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:48 PM - Mar 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll give all this a proper think...but in the meantime, I do believe these are Mick's first screenshots, so hoorah! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:23 PM - Mar 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've been doing some research, and have some questions, you'll be surprised to know...<br/>\n<br/>\n<strong>Pre-epic feats</strong>. Let's assume 18-20 levels of human Sorcerer. That's 8 feats. If I ignore all combat and defensive feats (at least for now), there appear to be 10 caster feats that could be worthwhile - 9 if I go without armour/shield and so don't need Still Spell. These are Extend Spell, Empower Spell, Maximize Spell, Silent Spell, Spell Focus, Greater Spell Focus, Quicken Spell, Spell Penetration and Greater Spell Penetration. I can see the merits in all of them, but my natural instincts would be to leave Silent Spell behind if I stay back with a meat-shield or two in front. Does that make sense?<br/>\n<br/>\n<strong>Starting Stats</strong>. My current thinking is, obviously, to max Charisma and dump Wisdom. As a secondary boost, I'm thinking Dexterity to help with AC when not in armour, but I can also see merit in both Constitution and Intelligence. Given that I'm going completely against type, I'm even thinking about dropping Strength to 10 (though I think I'd be physically sick if I dropped it any more). So how does a spread of Str 10, Dex 14, Con 10, Wis 8, Int 12 and Cha 18 sound?<br/>\n<br/>\n<strong>Class Split</strong>. I honestly do understand Mick's reasoning in going for a full level 40 Sorcerer, but it does make me a little twitchy, despite having looked at the Yardstick Builds thread (where I think Hip was the builder, buried somewhere on page 7 or 8). Even the Exalted Sorceress has 3 classes. So I'm still keen to add a few levels of other classes myself, and the addition of Monk does seem reasonable (including in Mick's own Evil Speed Caster, above). CoT might seem an odd choice, and I'm thinking of it in epic levels only (and I appreciate I'd have to take a WF in a melee weapon first, thus losing another of the aforementioned mage feats), but it has a weird panoply of epic bonus feats, including Epic Spell Focus, Combat Casting, and so on, which could allow for more Sorcerer bonus feats in Great Charisma. It also brings Divine Wrath and great boosts to saves. In other words, I'm still thinking Sorcerer 26/ Monk 4/ CoT 10. Just tell me if it's stupid.<br/>\n<br/>\n<strong>Spells</strong>. I entirely understand the number of base spells I can cast per day, but as far as \"known spells\" is concerned, once I \"know\" a spell, am I able to forget it and know another another one of the same level instead? For example, if I know Endure Elements at level 1, then having picked up Resist Elements at level 2 decide I'd rather know Grease at level 1, is that okay?<br/>\n<br/>\nOh, and as an addendum to <strong>Spells</strong>, where the bloody hell has Chromatic Orb gone? It was one of my fave level 1 Baldur's spells, and it's disappeared completely. B*s*a*ds!<br/>\n<br/>\nIt does strike me that this will likely be something of a glass cannon at early levels, and will need tlc from companions and/or summons and familiar, about which more another time...<br/>\n<br/>\nThat's where I am at the moment, anyway.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:41 PM - Mar 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Any time you take another level of Sorcerer, you can remove spells at that time to learn others in their place.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:54 PM - Mar 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Empyre, that's one conundrum solved (hey, if you're going to use \"felicitations\"...<img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:56 PM - Mar 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nI've been doing some research, and have some questions, you'll be surprised to know...</div></blockquote>\nNot surprised at all, this is new stuff.<br/>\n<blockquote><div>\n<strong>Pre-epic feats</strong>. Let's assume 18-20 levels of human Sorcerer. That's 8 feats. If I ignore all combat and defensive feats (at least for now), there appear to be 10 caster feats that could be worthwhile - 9 if I go without armour/shield and so don't need Still Spell. These are Extend Spell, Empower Spell, Maximize Spell, Silent Spell, Spell Focus, Greater Spell Focus, Quicken Spell, Spell Penetration and Greater Spell Penetration. I can see the merits in all of them, but my natural instincts would be to leave Silent Spell behind if I stay back with a meat-shield or two in front. Does that make sense?</div></blockquote>\nThe penetration feats are not always useful. They serve you best if you have low caster levels or if you from some other reason struggle a lot with SR.<br/>\nQuicken spell let you cast immediately and adds a second casting per round. But you get the same all the time without the feat whenever you are hasted. Quicken let you cast from slots 4 levels above the original spell, so it is only useful with level 5 spells and lower. It may be useful if you decide that you need to cast a spell like Firebrand a zillion times, but most often you can live well without it.<br/>\nExtend, Silent and Still all cast from slots 1 level above the original spell. Extend is useful bercause it gives longer duration to \"rounds per level\" spells. Still and Silent work with more spells than Extend, and are useful for that reason. If casting in armor is not a problem, you pick Silent. <br/>\nSome people take the Combat casting and Improved CC feats. A high Concentration skill will be enough in most cases to avoid attacks of opportunity in defensive casting mode and spell failure from taking heavy blows.<br/>\nIn vanilla NWN you can cast in Expertise mode and get +5 and even +10 AC for free since you don't suffer from the AB penalty. Many module designers and PW owners have disabled that  possibility, but sometimes taking both Expertise feats are worth it.<br/>\nAs for the spell focus feats, grab both SF and GSF (and also ESF) in one school, and take two schools if you can afford it.<br/>\n<blockquote><div>\n<strong>Starting Stats</strong>. My current thinking is, obviously, to max Charisma and dump Wisdom. As a secondary boost, I'm thinking Dexterity to help with AC when not in armour, but I can also see merit in both Constitution and Intelligence. Given that I'm going completely against type, I'm even thinking about dropping Strength to 10 (though I think I'd be physically sick if I dropped it any more). So how does a spread of Str 10, Dex 14, Con 10, Wis 8, Int 12 and Cha 18 sound?</div></blockquote>\nYou are right about Charisma, start high and take it as high as you can get it.<br/>\nYou are also right about Wisdom.<br/>\nIntelligence 10 gives 3 full skills for a human full sorcerer. Concentration and  Spellcraft are a must. If you want more skills depends on what kind of build you make. You need 13 Int if you want Expertise. 14 int gives a modifies Spellcraft of 45 whith full ranks. 12 Int gives Spellcraft 50 with capped Intelligence, and so on.<br/>\nPeople differ a bit when choosing between Strength, Dexterity and Constitution. You can boost them all with empowered spells if you want. I prefer Constitution for the hitpoints since this is a d4 build. Strength is good for carrying and for melee mages. Dexterity helps a bit in early levels when you hide behind your mighty badger and familiar, anxiously squeezing an x-bow between your swaety hands.<br/>\n<blockquote><div>\n<strong>Class Split</strong>. I honestly do understand Mick's reasoning in going for a full level 40 Sorcerer, but it does make me a little twitchy, despite having looked at the Yardstick Builds thread (where I think Hip was the builder, buried somewhere on page 7 or 8). Even the Exalted Sorceress has 3 classes. So I'm still keen to add a few levels of other classes myself, and the addition of Monk does seem reasonable (including in Mick's own Evil Speed Caster, above). CoT might seem an odd choice, and I'm thinking of it in epic levels only (and I appreciate I'd have to take a WF in a melee weapon first, thus losing another of the aforementioned mage feats), but it has a weird panoply of epic bonus feats, including Epic Spell Focus, Combat Casting, and so on, which could allow for more Sorcerer bonus feats in Great Charisma. It also brings Divine Wrath and great boosts to saves. In other words, I'm still thinking Sorcerer 26/ Monk 4/ CoT 10. Just tell me if it's stupid.</div></blockquote>\nStop twitching! I proposed a pure build for educational purposes. When you have pieced together a pure sorcerer, you can start looking at what other classes may add, and you have something to compare with.<br/>\nSorcerer 26/ Monk 4/ CoT 10 is the level spread of a spellsword. It is not stupid, it is just something else.<br/>\n<blockquote><div>\n<strong>Spells</strong>. I entirely understand the number of base spells I can cast per day, but as far as \"known spells\" is concerned, once I \"know\" a spell, am I able to forget it and know another another one of the same level instead? For example, if I know Endure Elements at level 1, then having picked up Resist Elements at level 2 decide I'd rather know Grease at level 1, is that okay?</div></blockquote>\nEvery time you level up you can choose to deselect known spells if you don't want them anymore, and you can choose the new ones you want. There is a limit to how many spells you can know at any given level.<br/>\n<blockquote><div>\nOh, and as an addendum to <strong>Spells</strong>, where the bloody hell has Chromatic Orb gone? It was one of my fave level 1 Baldur's spells, and it's disappeared completely. B*s*a*ds!</div></blockquote>\nIt is gone <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:32 AM - Mar 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Excellent post Mick, thank you! I was particularly fond of the mighty badger and the sweaty hands (goodness gracious!).<br/>\n<br/>\nPlenty more to ponder. I still can't help myself, it seems, when left to my own devices I start running straight into the sharpened arms of a meleer (sorry, \"spellsword\" to be fancy about it). Okay, any future twitchiness will, for now, be the result of either too much or too little whisky.<br/>\n<br/>\nAnd I need to read up on more of the spells themselves. Actually, there's something to be said about this, I feel. You clever wombats who've been coming up with casters for years hardly ever give your recommendations for spells - shame on you! It's like a Fighter build just saying, \"Take lots of combat feats.\" I appreciate that's not an entirely accurate analogy, but I trust you get my point.<br/>\n<br/>\nCheers (He signs off with harrumphing indignation <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:47 AM - Mar 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Of course playing a sorcerer is almost all about spells. We will get to that in time. And we will start with low level spells for low level characters, so you have something to start out with.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:09 AM - Mar 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sorcerer 40, no twitching around! <br/>\nCharisma 18 =&gt; 38 no less.<br/>\n<br/>\nResist your natural urge to \"add\" something to the character, you'll see why when you play her. <br/>\nAnd good luck!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "8:51 AM - Mar 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just chiming in to say that this is a fantastic discussion.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:02 PM - Mar 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Alright then, I've put the twitching in a dark corner with a towel over its head while I submit a first draft (though I can still hear it whimpering).<br/>\n<br/>\nI'll confess, when I first sat down with my trusty pencil and paper I thought, \"Well, this is all pretty straightforward. I don't have many feats to play with, so it's just about getting the right one in the right place. Easy.\" Which is probably what casters think about constructing a melee build for the first time. But as I went on I realized that it's actually a lot more nuanced than that (typical underhanded arcanist trick). Hopefully, I've paid attention to advice thus far, so it might not be too shambolic. In any case, it's a starting point...<br/>\n<br/>\n<strong>Soren the Slapdash Sorcerer</strong> (the name may change as progress is made)<br/>\nSorcerer 40. Human. Any alignment<br/>\n1-40 PvM (sadly untested, pending a reinstallation of NwN)<br/>\n<br/>\nSTATS<br/>\n<br/>\nStr 10<br/>\nDex 8<br/>\nCon 14<br/>\nWis 8<br/>\nInt 14<br/>\nCha 18 (38)<br/>\n<br/>\nHPs - 240<br/>\nSkill points - 215. Concentration 43 (45), Heal 43 (42), Lore 43 (45), Spellcraft 43 (45), Tumble (cc) 20 (20) <em>[3 spare for some crafting malarkey or other. Probably switch out Heal and/or Lore for more crafting stuff for our BSK friends]</em><br/>\nSaves - Fort 18, Will 21, Reflex 15. All +8 vs spells <em>[don't like any of these, tbh, but hopefully I'll be able to buff]</em><br/>\nAC (robes only) - <em>[gulp]</em> 13<br/>\nBAB - 20<br/>\nAB (max) - 20 (melee), 19 (ranged)<br/>\nSpells - Sorcerer 9<br/>\n<br/>\nLEVELLING <em>[all Sorcerer, so I'm not typing them all in]</em><br/>\n<br/>\n1 Extend Spell/ Expertise/ (Summon familiar <em>[open to suggestions]</em>)<br/>\n2<br/>\n3 Silent Spell<br/>\n4 CHA+1 (19)<br/>\n5<br/>\n6 Empower Spell<br/>\n7<br/>\n8 CHA+1 (20)<br/>\n9 Maximize Spell<br/>\n10<br/>\n11<br/>\n12 CHA+1 (21)/ Spell Focus <em>[open to advice: quite like Evocation or Conjuration]</em><br/>\n13<br/>\n14<br/>\n15 Quicken Spell<br/>\n16 CHA+1 (22)<br/>\n17<br/>\n18 Greater Spell Focus<br/>\n19<br/>\n20 CHA+1 (23)<br/>\n21 Great Cha I (24)<br/>\n22<br/>\n23 Great Cha II (25)<br/>\n24 CHA+1 (26)/ Epic Spell Focus<br/>\n25<br/>\n26 Great Cha III (27)<br/>\n27 Great Cha IV (28)<br/>\n28 CHA+1 (29)<br/>\n29 Great Cha IV (30)<br/>\n30 Epic Spell <em>[one of Epic Mage Armour, Epic Warding, Greater Ruin, Hellball]</em><br/>\n31<br/>\n32 CHA+1 (31)/ Great Cha VI (32)<br/>\n33 Epic Spell <em>[as above]</em><br/>\n34<br/>\n35 Great Cha VII (33)<br/>\n36 CHA+1 (34)/ Great Cha VIII (35)<br/>\n37<br/>\n38 Great Cha IX (36)<br/>\n39 Great Cha X (37)<br/>\n40 CHA+1 (38)<br/>\n<br/>\nI did wonder whether Improved Expertise might be worth it for the AC pump, but wasn't sure what to sacrifice.<br/>\n<br/>\nAnd another thing...Who in the Abyss was in charge of allocating spells to schools? Haste and Mass Haste - different schools. Flame Arrow and Fireball - different schools. And so on. Were they just blindfolded and threw darts at a board?<br/>\n<br/>\nAnyway, comments welcome (giggles less so, but still okay)<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: Should have remembered to include the spell DC. If I've got my sums right it's 30 (10+14 ability modifier+6 Epic Spell Focus) + the spell level<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:16 PM - Mar 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It is time to congratulate you - you have built your first sorcerer! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\nAs far as I can judge it is a legal build (as long as you pick epic spells you qualify for).<br/>\n<br/>\nYou do most things right, and it is a build I could play without problems.<br/>\nThe charisma is so high that even spells from spell schools you don't focus in pose serious threats to your targets. Your high caster level also secures a very good SR penetration.<br/>\n<br/>\nIf you don't twitch, you can squeeze in another greater spell focus by removing Expertise and Quicken. You will soon learn other ways than AC to avoid damage. You may even take the epic focus in the second school, if you only take one epic spell. As for schools I often pick Evocation or Necromancy or both.<br/>\n<br/>\nAnother question is when to take the feats, and in what order. The simplest answer to that is - when you need them.<br/>\nI would take SF early and GSF somewhere in mid-pre-epic. The level where you take meta-magic feats looks good<br/>\nNote that epic spells need a given rank in spellcraft. If you want them, take them as early as possible (unless it messes with something you have given priority).<br/>\n<br/>\nAs for what spells belong to what schools, the logic is beyond me as well. Look up the NWNWIKI and find a table that sorts spells by school, just so you know what you're dealing with.<br/>\n<br/>\nFormula for spell DC:<br/>\n<em>DC = 10 + spell level + ability modifier + feat modifier</em><br/>\nThe level 40 Soren has a feat modifier of 6 for his chosen school and the abilify modifier is 14 unbuffed and 20 when capped. Add 1 for level 1 spells and upwards to 9 for level 9 spells. A level 1 spell from an unfocused school has a DC of 25 if there are no charisma buffs. A level 9 spell from the focused school has DC of 45 when you cap charisma.<br/>\n<br/>\nLvl 40 Soren will always penetrate SR 41, and can penetrate SR 42 to 60 depending on a d20 roll.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "9:26 PM - Mar 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's an absolutely playable pure sorcerer you have there. You basically wrote down one of the yardsticks. The other viable one sacrifices some meta for a second school focus.<br/>\nYou are correct about the DC (it's the highest possible), aka DC45 wail with capped Cha.<br/>\nLook at you saves. Now imagine you Cha modifier added :) But first, I think Nick and Val are right, do it pure. You'll have other ways of not being affected by spells.<br/>\nConsider Necro for one of your SF. Wail of the banshee is a top spell (4x better than weird) but it has a saving throw.<br/>\nDepending on where you play, scribe scroll or craft wand can be taken instead of expertise (I love wands, but that's a personal preference and a WoGism.)<br/>\nThe last theoretical bit that remains: spell choice and how it changes during leveling.<br/>\nAnd finally, the big one: how to play. I'm not just thinking about the theory. A lot of it, more than with any other class, is execution. By the way, I'd love to see this discussion include how people actually cast with a spontaneous meta caster. That's the holy Grail of nwn IMO (if you don't pause, like on a server.)<br/>\n<br/>\nEDIT: and the ninja comes in the niiiiiiiiight<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:58 AM - Mar 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks both!<br/>\n<br/>\nA few things to say, if that's okay (and in no particular order)...<br/>\n<br/>\nWhen it came to feats, I settled on Valerfor's instruction of 18 (38) Charisma (for an easy life, as much as anything), which meant I needed 10 Great Charismas. That gave me 2 spare epic feats (because I was always going to take Epic Spell Focus) and Hellball or Greater Ruin sounded kewl, while Epic Warding or Epic Mage Armour sounded sensible (it's all about balance). However, if I'm going truly untwitchy, I'm fine with Mick's suggestion about dropping Expertise and Quicken (as Haste will have a similar effect in any case) pre-epic and picking up another focus and its greater cousin, then dropping an Epic Spell for the epic focus. That way I could have both Evocation (fun) and Necromancy (serious - see, balance again). It's not that I've changed my mind about liking Conjuration (I've always liked Melf's Acid Arrow, Flame Arrow and Cloudkill), but Horrid Wilting and Wail of the Banshee (as well as all that negative energy stuff) are hard to ignore.<br/>\n<br/>\nIf I go down that route, then I'm fine to drop INT to 12 - losing Heal or Lore - and popping a couple more points into Dex (I don't like it being of a negative value, even if in \"full plate and packing sword\").<br/>\n<br/>\nYou're quite right about the yardstick Mirnaia, but it's kind of hard not to semi-duplicate it given the lack of bonus feats available (in pre-epic, at least) without deliberately gimping yourself. But I promise I did construct this myself before looking back at the build (which, btw, I had wrong, it was D'Alessandro's build, and is on page 4 of the thread).<br/>\n<br/>\nAnd this is where it all goes t*ts up. I can't actually play the damned build atm, so theory is the only place I have left. Clearly, this is the type of build that needs to be practiced with, and it would be pointless to ask someone to test it for me. First, because I've already got Mirnaia running another putative build around for me (brilliantly), and second, I think I'd really need to get a proper feel for this one myself, having never played a Sorcerer in NwN before.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:07 AM - Mar 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The best of the bunch for spell feats are still, extend, empower &amp; maximize.<br/>\nThat leaves your room for 2XGreater spell focusses pre-epic.<br/>\nWhen you reach epic-levels take Epic spell focus, EMA &amp; EW plus Gr. CHAX10.<br/>\nEMA you want because it lasts all day &amp; adds +5AC even if you are full on magic items (dodge bonus).<br/>\nWith this set-up, you will have maximum DC 45 for your primary school &amp; DC 43 for your secondary, top-notch material.<br/>\n<br/>\nYou could add 1 Paladin &amp; 1 Monk level without loosing practically anything but this is a crutch if you truly want to learn to play a Sorceress. <br/>\nLearn first how to play her and then adding these little \"extras\" will feel like you have gained a massive boost in power because you will now know how to take advantage of these.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:50 PM - Mar 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>I can't actually play the damned build atm, so theory is the only place I have left. Clearly, this is the type of build that needs to be practiced with, and it would be pointless to ask someone to test it for me. First, because I've already got Mirnaia running another putative build around for me (brilliantly), and second, I think I'd really need to get a proper feel for this one myself, having never played a Sorcerer in NwN before.\n</div></blockquote>\nThis build doesn't need \"testing\". It is a straight up sorcerer, and it will work.<br/>\nBut playing this kind of character is different from what you are used to, so I understand that your need to get a proper feel for it. The only way to do that is to play.<br/>\n<br/>\nAt character creation you will also have to choose between the available familiars, and you choose the spells that you will use at character level 1.<br/>\nAt every level up you can choose to keep the familiar, or choose another one if you want. <br/>\n<br/>\nI think we have reached a point where getting used to <em>playing</em> a sorcerer will be the focus. <br/>\nI/we can guide you through that as well.<br/>\nBut I will at the same time invite other players to share from their knowledge, habits, tips and tricks that are relevant to where we are in the process.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:14 PM - Mar 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for all you've done to date, and I look forward to taking advantage of your generous offer of further assistance once I'm back up and running - hopefully not too long, as I'm going to try a full uninstall/install this weekend (together with all the modules I have added - updated where appropriate, but not using EE as yet). Deep joy.<br/>\n<br/>\nCheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Noctem",
      "avatar": "10759073_1554507612.jpg",
      "timestamp": "12:51 AM - Jul 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey <em class=\"mention\">@Stagmeister</em> - did you ever get around to playing your Sorc? I'm level 14 in Aielund, following @Mick's Evil Speed Caster build, and it's ridiculous fun. I'm hoping that you <em>will </em>play a Sorc <span style=\"text-decoration:line-through\">so that <em class=\"mention\">@Mick Dagger</em> and others will post that thread about spell choice </span>ehrm, I mean, that is to say... so that you can enjoy the raw power!<br/>\nYes, I'm a bit of a cheek. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:18 AM - Jul 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Not yet I'm afraid, Noctem. Having only recently got things up and working again, I went and plopped WoG on and it all crashed again. Not happy, I can tell you. I'll get it sorted - and it's not WoG, it's me.<br/>\n<br/>\nDo please feel free to copy in the spell recommendations to this thread (as it seems no one understands the words \"tell no one\" any more) - I've already had a pop about caster-types not giving their preferences.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Noctem",
      "avatar": "10759073_1554507612.jpg",
      "timestamp": "1:37 AM - Jul 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">...removing duplicate post because Stag's compie isn't the only one acting up, it seems...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Noctem",
      "avatar": "10759073_1554507612.jpg",
      "timestamp": "1:37 AM - Jul 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\n...(as it seems no one understands the words \"tell no one\" any more)...</div></blockquote>\nOops. And here I thought you were just being silly with that title. Well, if it makes you feel any better I can go back and put all my responses in Spoilers. ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:59 AM - Jul 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well you <em><strong>could</strong></em>, but I fear it's all gone too far already. I'll just have to live with the ignominy...<br/>\n<br/>\n*Sigh*<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "DoesntPlayAnymore",
      "avatar": "10759108_1563558681.png",
      "timestamp": "7:43 PM - Jul 19, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey, Stag, if it's still relevant, I came up with this thing. She gets 2 epic spell focuses and Epic Mage Armor and Epic Warding almost as soon as they are available (level 24 and 31) and Paladin saves. Should be mega playable and super simple to build. It even contains CoT as you originally thought. I hope this doesn't interfere with your learning process but I've been wanting to play an as-close-to-pure sorcerer with CoT myself and this is what I came up with. Curious what you think of her.<br/>\n<details><summary>Spoiler</summary>Sorcerer(35), Paladin(1), Champion of Torm(4), Lawful Good Human\nPlayability: Gonna test in Lord of Terror today, but yeah... Should work 1 - 40 PvM in most environments. Probably not too shabby PvP either, but I wouldn't know about that.\nSTR: 10\nCON: 14\nINT: 14\n\n01: Sorcerer(1): Spell Focus I, Spell Focus II\n03: Sorcerer(3): Silent Spell  Still Spell*\n05: Sorcerer(5)\n07: Sorcerer(7)\n09: Sorcerer(9): Greater Spell Focus II\n11: Sorcerer(11)\n13: Sorcerer(13)\n15: Sorcerer(15): Maximize Spell\n17: Sorcerer(17): <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Tenser%27s_transformation\" rel=\"noreferrer\" target=\"_blank\">Tenser's transformation</a><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Silent_spell\" rel=\"noreferrer\" target=\"_blank\">three spells</a></details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:20 PM - Jul 19, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Cheers for the Sorcerina, she looks good to me - but I think we've established I won't be her best judge! Because I'm nosy, I will, however, ask why the particular intransigence about her name?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "DoesntPlayAnymore",
      "avatar": "10759108_1563558681.png",
      "timestamp": "8:44 PM - Jul 19, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ok, ok, you can call her whatever!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:56 PM - Jul 19, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, here I was hoping for a great backstory! Never mind<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "DoesntPlayAnymore",
      "avatar": "10759108_1563558681.png",
      "timestamp": "12:54 AM - Jul 20, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong>Sorcer</strong><em>er</em>ina of <strong>Pal</strong><em>adin</em><strong>Torm</strong>ina <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "1:28 AM - Jul 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So, Stagmeister wants to learn how to play a Wizard the easy way huh???   No wonder you wanted it kept quiet!  <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\nI'll be interested to hear how your 40th level Sorc works out Stag.    Best I ever made it was Milo my 36th level WIZARD (you know, the guys who work for it!)  But then Raines computer crashed and he was lost forever...  Well...  not forever, I've remade him and have him up to 20th level. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:31 AM - Jul 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>grom56 wrote:</cite>\nSo, Stagmeister wants to learn how to play a Wizard the easy way huh???   No wonder you wanted it kept quiet!  <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /> (just for you!)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:32 AM - Jan 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello all<br/>\nThought I would bump this thread<br/>\n<br/>\nCurious to learn some tips on playing a sorcerer to improve my game<br/>\nDid you ever get around to doing it yet Stag?<br/>\n<br/>\nGreat discussion here, I learnt a lot.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:30 AM - Jan 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"18608\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18608&amp;sid=ed4a1a77778b9860d4f84c39e4cd05e6#p18608\">↑</a><div class=\"responsive-hide\">Jan 24, 2020</div></cite>Hello all<br/>\nThought I would bump this thread<br/>\n<br/>\nCurious to learn some tips on playing a sorcerer to improve my game<br/>\nDid you ever get around to doing it yet Stag?<br/>\n<br/>\nGreat discussion here, I learnt a lot.</div></blockquote>\nWell thanks <em>so</em> much for that, Orion (can't find a sarcastic face emoji atm). (*<em>mutters</em>* And still no one respects \"tell no one\"...*<em>sulks</em>*)<br/>\n<br/>\nAlas, no, I haven't yet taken Soren out for a run - I'm furtling around with a couple of potential builds currently (a Half-Orc and a Halfling). But I do seem to recall having made an idiotic deal with conlaoch that involves me playing a caster and him a cleric sometime this year. You'll know when I start, because I <em>will</em> be asking questions...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "2:00 AM - Feb 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This has been a very informative (and amusing) thread. Would love to hear of the escapades of Soren one day.<br/>\n<blockquote><div>Quoting Mick Dagger:<br/>\nBut how to use spells falls under the lessons for <strong>playing</strong> a sorcerer.</div></blockquote>\nSo, did I miss that part somewhere? <br/>\n<br/>\nAlso, Mick, in that image you posted of your Speed Caster on page one (HIGHLY motivating, btw), I see she's wielding a spear. Would that be for some particular stats on that weapon, or does the evil mistress simply enjoy poking things with a sharp, pointy stick?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:16 AM - Feb 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>UrbanHermit wrote: <a data-post-id=\"19105\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=19105&amp;sid=e7674da987811477fb9f4172ee1244ad#p19105\">↑</a><div class=\"responsive-hide\">Feb 16, 2020</div></cite>This has been a very informative (and amusing) thread. Would love to hear of the escapades of Soren one day.<br/>\n<blockquote><div>Quoting Mick Dagger:<br/>\nBut how to use spells falls under the lessons for <strong>playing</strong> a sorcerer.</div></blockquote>\nSo, did I miss that part somewhere? <br/>\n<br/>\nAlso, Mick, in that image you posted of your Speed Caster on page one (HIGHLY motivating, btw), I see she's wielding a spear. Would that be for some particular stats on that weapon, or does the evil mistress simply enjoy poking things with a sharp, pointy stick?</div></blockquote>\nHermit, we never reached the playing part, so you didn't miss anything.<br/>\nThe spear is in fact a little cheat on my part. There is an x-bow  she had with some magical properties. Between act 1 and 2 I exported the character and crafted a spear with the same properties, just for style. I could have done the same with a mage staff or any other simple weapon. It had no impact on game play.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}