{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "277",
  "name": "Spellswords...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/spellswords-t2219885.html",
  "author": "conlaoch",
  "avatar": "10235240_1510287070.jpg",
  "replies": "8",
  "views": "2.2K",
  "posts": [
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "7:33 PM - Apr 25, 2012",
      "content": "<div>Ok everyone, lets see your favorite spellswords....<br/>\n<br/>\nThe following 4 are some of my favorites although I also have a few that are just two classes that are quite fun as well.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build218246.html\" rel=\"noreferrer\" target=\"_blank\">The Galdring Pukje(Wizard25/Rogue10/SD5) by Grimnir77</a><br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build293989.html\" rel=\"noreferrer\" target=\"_blank\">Boccob's Magic Blade: Wizard 26 / Fighter 8 / Rogue 6 by Kail Pendragon</a><br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build300792.html\" rel=\"noreferrer\" target=\"_blank\">The August Spell-Blade: Sorcerer 26 / Fighter 6 / Champion of Torm 8 by Grizzled Dwarflord</a><br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build227074.html\" rel=\"noreferrer\" target=\"_blank\">Deathknight of Torm (Sorcerer20/PM10/CoT10) by Grimnir77</a><br/>\n<br/>\nI also play about a dozen variations of the above 4 toons.<br/>\n<br/>\nSo lets see some more well crafted spellswords.....<br/>\nConlaoch</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:15 PM - Apr 26, 2012",
      "content": "<div>Since it appears you are focusing primarily on the arcane-based variety...<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build249328.html\" rel=\"noreferrer\" target=\"_blank\">Mith's singing scyther aka. Ruinous Raconteur</a> has given me some mileage albeit tweaked a bit to adapt to the specific magic environment of choice.  The weapon itself is subject to personal preference but with the 2-hand-wielding weapon being the unifying constant among classical spellswords, scythe always works for me.   And the slash/pierce combo damage has an advantage at times.  <br/>\n<br/>\nStill, in general, divine spellswords rule... but are commonly tagged with the nom de plume of \"battle cleric\".  If it smells like uber-buffed two-handed big weapon melee, whether arcane or divine, it becomes a double threat on most servers regardless of magical discipline and the gods' glance.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "3:33 PM - Apr 30, 2012",
      "content": "<div>Yeah,<br/>\n<br/>\nI never could get the hang of using a cleric.  I'm too used to using magic to blast things.  The battle cleric just seems alien to me somehow.  Druids I can do though...<br/>\n<br/>\nConlaoch</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:58 AM - May 01, 2012",
      "content": "<div><blockquote><div><strong>conlaoch wrote:</strong>-- clip--<br/>\n I'm too used to using magic to blast things.  <br/>\n-- clip --</div></blockquote>\n...then perhaps what would float your builder's boat the best would be a <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build301814.html\" rel=\"noreferrer\" target=\"_blank\">Melee Mage</a> rather than a spellsword.  <br/>\n<br/>\nWebShaman pretty much perfected an approach for \"blasters\" to retain a significant melee presence while still empowered with all the arcane goodness characteristic of those godly high-level casters.  It does require some pre-planning to optimize the build's advantages, though.  Web's original build post itself contains a lot of strategy type information that is generally useful to all aspiring arcanists. <br/>\n<br/>\nOn the other hand, a spellsword is primarily a self-buffer, typically manning a greatsword, that maintains enough casting prowess to be considered an effective hybrid of both attacks but with the spell DC as a secondary consideration.  At least that has been my interpretation of the term \"spellsword\", though if Web had joined the new ECB, his perspective would be invaluable as a standing resource.    <br/>\n<br/>\nThe particular weapon and minimum number of caster levels (at least 24 are needed to shrug off most dispels) can vary, but the self-buffing combat methodology of a spellsword does not (or should not... for comparison's sake, that is).</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "3:03 PM - May 01, 2012",
      "content": "<div>Yeah, I like the melee mage tract, but I find myself using summons ore often then melee when I have that many caster levels.  I mainly play on WoG, and a crafted wand always has 50 charges.  Kind of hard to do the melee mage thing when I have a wand of summon IV for a quick 50 minions.  <br/>\n<br/>\nI think my fascination with Spellswords came from learning to play D&amp;D from the old blue box set (giving away my age there).  An elf was an automatic spellsword.  Slower exp progression, but warrior and mage all wrapped in one.<br/>\n<br/>\nMost of the time when I make a spellsword, it has 24-26 mage levels although the version above with sorc 20/CoT10/PM10 is real fun once the pale master crit immunity kicks in.<br/>\n<br/>\nConlaoch</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:05 PM - May 02, 2012",
      "content": "<div>With a spellsword you can not get everything. And you will never get a build that is as strong a warrior or mage as a specialized build can be. Spellswords are difficult to build because there are so many things you may want to focus on, and you don't have the resources to spread out on everything.<br/>\nI ended up building the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/spellsword-of-bahamut-sorc-26-paladin-4-rdd-10-t515415.html\" rel=\"noreferrer\" target=\"_blank\">Spellsword of Bahamut</a> to get what I wanted from a spellsword. If you read the thread you will also find some links to other builds that I like, or that have influenced the build.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "7:19 PM - May 02, 2012",
      "content": "<div>I knew I had seen more builds I hand't tried.  Your spellsword and \"Might and Magic\" were two of the ones on my list to play.<br/>\n<br/>\nI understand that you can't have the best of both, but either one of these with the proper tactics, can go a lot farther then many realize.  What a spellsword lacks in sheer bashing or zapping power, they usually make up in versatility. <br/>\n<br/>\nConlaoch</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:46 AM - May 03, 2012",
      "content": "<div><blockquote><div><strong>conlaoch wrote:</strong><br/>\nI never could get the hang of using a cleric.  I'm too used to using magic to blast things.  The battle cleric just seems alien to me somehow.  <strong>Druids</strong> I can do though...\n</div></blockquote>\nSince you mentioned it, amigo...<br/>\n<br/>\nschnab's <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build218275.html\" rel=\"noreferrer\" target=\"_blank\">Nature's Spellsword (Druid 24, Monk 6, CoT 10)</a> has some hidden potential and a most unusual conceptualization.  A non-dragon non-shifter druid is a rarity to begin with.  It has a well-planned template and with some tweaking could compete with those arcane styles we have become accustomed to staring at.  Wouldn't mind having a go at it myself when the opportunity presents itself.  Now, if only druids used divine domains... *sigh*<br/>\n<br/>\nLet us ruminate a moment.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "3:00 PM - May 03, 2012",
      "content": "<div>Bookmarked that one....<br/>\n<br/>\nThat should be real fun on WoG.  Druids get an enhanced summon at lvl 9, they added elemental princes/esses.  Swarm is nice, but one prince beats a swarm...  <br/>\n<br/>\nA few things I might change there though, I stopped taking combat casting and improved combat casting and just max the concentration.  Granted they still get the AoO, but it frees up two feats, and I'd probably drop Lightning reflexes as well.  that would allow me to get craft wand, scribe scroll and an epic feat.<br/>\n<br/>\nLOL.. never underestimate the power of a spare lvl 9 spell safely scribed to a scroll.  Especially when you play on a rest restricted server.<br/>\n<br/>\nThanks Hip, I'll definitely be trying this one.<br/>\n<br/>\nConlaoch</div>"
    }
  ]
}