{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "299",
  "name": "Final Ability Tally:  Why is even the best?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/final-ability-tally-why-is-even-the-best-t515399.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": "8",
  "views": "619",
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:56 AM - Aug 07, 2011",
      "content": "<div>Hello fellow building maniacs! <br/>\n<br/>\nFrom the start, I've been building using the convention of assuring that abilities always fall on an even number but now I must ask... Why?  (actually, I've been asking that question for some time, just not publicly.)<br/>\n<br/>\nI recognize that some environments make it easy to reach the +12 cap (I've played on a few of those myself, BTW) so in those cases, my point is moot.  I'm not interested in those servers/modules where everyone is running around with every ability capped.  It is all the others where it is problematic to cap one ability let alone several and it is those cases I wish to examine in depth.  Besides, what's to prevent a designer from setting a cap at +15 or another odd number?  Nothing.<br/>\n<br/>\nMoving forward, then...<br/>\n<br/>\nThe only ability that relies on the \"even\" prerequisite (i.e. modifier) is Intelligence because only the base level determines the skill point level distributed... unaffected by buffing via potions, other spell-imbued equipment or spells.  For the sake of making this deliberation easier, let us ignore the permanent ability enhancements contained on equipment. They come in all denominations and related to the magic level designed into the environment.<br/>\n<br/>\nNow, the most common buffs are based on the dice roll +1 formula.  So that means the highest possible buff will always be an odd number.  So adding that number to an even final number will always be odd... just missing the next higher modifier.  But if the final ability is odd, the next modifier will be reached.<br/>\n<br/>\nSo in those cases where there are two key abilities, let's say DEX and CON, that could either be DEX 12/CON 14 or <br/>\nDEX 13/CON 13, I claim that the latter split is superior.  <br/>\n<br/>\nI'll use the Maximize spell feat to illustrate this because it is easier to eliminate at least one variable.  We'll use Maximized Cat's Grace and Maximized Endurance to test the results.  With DEX 12/CON 14 split, buffed, you'd end up with DEX 17(+3)/CON 19(+4).  With the DEX 13/CON 13 split, you'd end up with DEX 18(+4)/CON 18(+4).  The latter split results in a higher modifier for DEX and the same modifier for CON with the same number of ability points distributed.<br/>\n<br/>\nThe same phenomenon could occur for all of the other 5 abilities (except INT, as mentioned before) but I just pulled a random pair to illuminate the point.<br/>\n<br/>\nBesides the example described, most all of the ability requirements for feats are set at an odd number, like Dodge, Ambidexterity, Power Attack, etc.  A coincidence?<br/>\n<br/>\nNow, only casters have the access to the Maximize spell but since most buffs max on an odd number, the example works.  What is the best possible end result?  Even non-casters will use potions that use the same 1d4+1 formula and so face the same random roll as do spellcasters who use the standard or empowered versions.  Dispel magic could change things though, because the PC may be left with just the innate ability levels remaining if it succeeds.  But spellcasters can build indispellability into the design so perhaps those builds should be considered to exist under vastly different potentials, different guidelines.  <br/>\n<br/>\nNow once you get past the self-imposed \"even ending ability spread\", it becomes much easier to make the most out of the ability points available.<br/>\n<br/>\nNaturally, it will become more difficult to evaluate similar builds because AB, AC &amp; Save levels may look lower than they actually are in practice.  But who enters any challenging combat scenario without being fully buffed?  That is usually a recipe for disaster and in those cases an even ability spread won't change the outcome.  <br/>\n<br/>\nSo if the only reason builds are so focused on ending ability spreads on even numbers is to make it easier to compare them side-by-side, I would like to understand at least that much as I continue forward.<br/>\n<br/>\nIt would be most interesting to read how others view this issue and how they are benefited or constrained by the \" final even ability spread\" in their builds.  Hopefully, there is something very basic that has alluded me (i.e. yet another bloody senior moment) so I can put this to rest once and for all and again design builds with my universe in total balance.  <br/>\n<br/>\nCheers!<br/>\nHip</div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "9:19 AM - Aug 07, 2011",
      "content": "<div>Interesting take on things. I have long thought that there is an edge to having even final ability scores, but that the edge isn't the build-breaking issue it sometimes appears to be and it depends pretty highly on the environment. <br/>\n<br/>\n(FWIW, I'm not sure that INT is unique in it's even number favoritism. There are some feats like Dragon Shape or Self Concealment that require even unbuffed ability scores. And caster bonus spells increase on even ability scores, though the buffs can apply if they don't go away during rest, which means spells won't help.)<br/>\n<br/>\nBTW, I think much of the emphasis on even-numbered ability scores comes from the need to compare builds in a fairly uniform way and that tends to mean looking at the build first unbuffed, then with self-buffs, and finally with party buffs or items. It's somewhat similar to the emphasis on comparing AC naked or with mundane armor. There aren't many environments where a level 40 toon won't have at least one item that boosts AC, but there are so many variables when we start down that road that we often don't spend much time discussing items unless analyzing a build for a particular environment where we know what will be available.<br/>\n<br/>\nGetting back to environment, as you note, the +12 ability buffing cap is arbitrary, though, AFAIK, it is most commonly kept at +12. That makes a difference, because I think many of us would flip to the pro-odd side of the issue if we thought a typical mod or PW would have an odd cap. And, favoring odd builds, there are plenty of PWs where the per item buff is limited to an odd number, like +3 or +5.<br/>\n<br/>\nAnd, the build itself matters. If the toon is a caster who can take maximize and is willing to give up the level 5 slots to use it, then he is guaranteed +5 buffs. Beyond that, even with empowered buffs or no metamagic, it's possible to cast a buff twice. With two casts, there is only a 75% chance that at least one of the casts will be odd (and a 43.75% chance that one will be the high roll of 5 or 7).<br/>\n<br/>\nA problem, though, is that while it's certainly true that one tries to buff before every big battle, one doesn't always know when that battle will arise and it's not always possible to buff beforehand. And, even in circumstances where preparation is possible, a character is unlikely to buff every ability. So, my wizard will try and buff INT and maybe CON, but he doesn't always buff WIS or DEX and there will be times where having the higher unbuffed saves or AC would have helped. One's playing style will affect this as well. Some folks like to barge in and start pounding on things whereas some folks prefer to scout ahead, then come back and buff, then stake out a positions, then let the fighting begin. <br/>\n<br/>\nAnother factor is just how much is the even score worth, in terms of the trade-off in increasing other ability scores or using that feat slot for another feat. For instance, I may have a hypothetical fighter who set DEX to 13 to get a feat. If other scores work out so that I can take that to 14 without giving up any ability score I care about, then I'll do it. But, if the choice is between 1) winding up with an even DEX and 2) boosting strength or taking some other useful feat, DEX will probably stay at 13. <br/>\n<br/>\nAnyway, in my view, because of the setup in most typical environments and because there are times when buffing isn't practical, there is often an advantage to even ability scores. But, getting all scores to turn out a certain way (whether the goal is even or odd) isn't always painless. As with most things, the advantage isn't always worth the trade-offs.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:35 PM - Aug 07, 2011",
      "content": "<div><blockquote><div><strong>MrZork wrote:</strong><br/>\n-- clip --<br/>\n<br/>\n(FWIW, I'm not sure that INT is unique in it's even number favoritism. There are some feats like Dragon Shape or Self Concealment that require even unbuffed ability scores. And caster bonus spells increase on even ability scores, though the buffs can apply if they don't go away during rest, which means spells won't help.)<br/>\n<br/>\n-- clip --\n</div></blockquote>\n\n...though equipment can alter the bonus slots permanently just as if WIS, CHA or INT was allocated during level-up so in that respect INT is not unique.<br/>\n<br/>\nI was referring mainly to the unique relationship between INT and skill points. Only the final modifier counts so the sooner (in the level sequence) one reaches an even INT score, the more skill points can be accrued.  Case in point: Expertise.  If settling for the base prereq 13 for final tally, any build will be deprived of 40 skill points by retaining the \"odd-ness\".  That much is assured.<br/>\n<br/>\nNo other ability has the influence on a general aspect of the game as INT does (i.e. affecting all classes equally for all builds) which IMO places it in a separate category for the odd-even debate.  <br/>\n<br/>\nHowever, feat prereqs come in differing flavors with the majority of them requiring odd-numbered ability levels, so as you say, the \"even-ness\" or \"odd-ness\" may be considered differently based on the specific feats to be planned and the situation.<br/>\n<br/>\nThanks for the lucid perspective on this phenomenon, MrZork.  We share a similar view (and perhaps a common neurosis) designing a build that will perform the way we intended.  And so it becomes a bit clearer.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:10 AM - Aug 11, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong>I recognize that some environments make it easy to reach the +12 cap (I've played on a few of those myself, BTW) so in those cases, my point is moot.  I'm not interested in those servers/modules where everyone is running around with every ability capped.  It is all the others where it is problematic to cap one ability let alone several and it is those cases I wish to examine in depth. <br/>\n//<br/>\nNow, the most common buffs are based on the dice roll +1 formula.  So that means the highest possible buff will always be an odd number.  So adding that number to an even final number will always be odd... just missing the next higher modifier.  But if the final ability is odd, the next modifier will be reached.<br/>\n<br/>\nSo in those cases where there are two key abilities, let's say DEX and CON, that could either be DEX 12/CON 14 or <br/>\nDEX 13/CON 13, I claim that the latter split is superior.  <br/>\n<br/>\nI'll use the Maximize spell feat to illustrate this because it is easier to eliminate at least one variable.  We'll use Maximized Cat's Grace and Maximized Endurance to test the results.  With DEX 12/CON 14 split, buffed, you'd end up with DEX 17(+3)/CON 19(+4).  With the DEX 13/CON 13 split, you'd end up with DEX 18(+4)/CON 18(+4).  The latter split results in a higher modifier for DEX and the same modifier for CON with the same number of ability points distributed.</div></blockquote>\n\nThe Maximize feat will always give 5 on a 1d4+1 roll. Your point is valid there.<br/>\n<br/>\nOn a normal 1d4+1 roll, the outcome will be 2, 3, 4 or 5,  25% of the time for each. The result will be in favor of the odd stat half the time, when you hit 3 or 5<br/>\nIf you empower the 1d4+1 roll, the outcome will be 3, 4, 6, or 7. Here too the result will be in favor of the odd stat half the time, when you hit 3 or 7.<br/>\n(If you reach the +12 cap things are different, but that was not your scenario.)<br/>\n<br/>\nExample: You choose between constitution 10, 11 and 12 in a given build. Is 11 really better than 10, and is 12 really better than 11?<br/>\nOn a normal 1d4+1 roll: <br/>\nIf the outcome is 2 the constitution will be 12, 13 and 14, the stat modifier will be +1, +1 and +2, so 11 is not better than 10.<br/>\nIf the outcome is 3 the constitutionwill be 13, 14 and 15, the stat modifier will be +1, +2 and +2, so 11 is just as good as 12.<br/>\nIf the outcome is 4 the constitution will be 14, 15 and 16, the stat modifier will be +2, +2 and +3, so 11 is not better than 10.<br/>\nIf the outcome is 5 the constitution will be 15, 16 and 17, the stat modifier will be +2, +3 and +3, so 11 is just as good as 12.<br/>\nThe results with empower will be parallell to this.<br/>\nSo if you invest 1 point it will be better half the time and have no effect the other half.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "11:07 PM - Sep 01, 2011",
      "content": "<div>My first post on the new forum!  LOL   for some of you  <br/>\n<br/>\nHip, having been around ECB since 2004 (arguably the \"oldie\" of the group), I believe it just became the convention.  The builds were done WITHOUT gear considered to make them easier to compare for the new players.  In that environment, the even were better than the odd.  <br/>\n<br/>\nTaking your points, YES!  Near the end of my career, I routinely stopped my cleric's wisdom at 19 base because they were strength based clerics and the points were needed for strength boosts.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:18 AM - Sep 02, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong>My first post on the new forum!  LOL   for some of you  <br/>\n<br/>\nHip, having been around ECB since 2004 (arguably the \"oldie\" of the group), I believe it just became the convention.  The builds were done WITHOUT gear considered to make them easier to compare for the new players.  In that environment, the even were better than the odd.  <br/>\n<br/>\nTaking your points, YES!  Near the end of my career, I routinely stopped my cleric's wisdom at 19 base because they were strength based clerics and the points were needed for strength boosts.</div></blockquote>\nAhhh... it's hard to break training.  But sometimes, it just must be done, eh?<br/>\n<br/>\nI feel privileged that you would choose one of my topics in which to introduce yourself, avado.  The more geezers, the merrier, as far as I am concerned.<br/>\n<br/>\nStill, I for one, would appreciate an opportunity to learn what makes avado tick... the mind behind the mask.  I suspect it may be a scary learning adventure but education always comes at a cost. *lol* Give us an OFFICIAL intro, willya dammit?  <br/>\n<br/>\nAnd Welcome!  You've been missed</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "4:59 PM - Sep 02, 2011",
      "content": "<div>I didnt see an \"Introduce yourself\" section.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:51 PM - Sep 02, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong>I didnt see an \"Introduce yourself\" section.</div></blockquote>\nJust <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewforum.php?f=13\" rel=\"noreferrer\" target=\"_blank\">click</a> and you are there!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:39 PM - Sep 03, 2011",
      "content": "<div>Well if you take items out of the discussion, then what Mick said is perfect, but I play and have played always in places where you can cap at least one stat through items, even if you need like 3 or 4 to cap one stat. When you throw items in the equation, you need only acheive +9 on each stat to cap it* (+7 if you have maximized stat boosts), leaving you with more room to equip other items with different functionalities instead of having to use them to reach a +11 or +12 cap. A +11 cap is for odd stats and will CERTAINLY make you lose 1 modifier compared to the even stats. I have always tried to cap at least 2 stats with the help of items in all my toons in all the worlds I have played. Besides, we are talking about FINAL stats, but they change back and forth from even to odd throughout the build, and so do your items as you progress in level. Therefore I always feel it`s best having even scores at least on the main stats of the build. <br/>\n<br/>\n*Note that this doesn't work that well with casting stats, because you won't gain more memorized spells by buffing those stats, so it's ideal to try to reach that cap entirely with items. <br/>\n<br/>\nIf this discussion is about just the stats themselves and not supposed to take items into account, then just ignore this post.</div>"
    }
  ]
}