{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "136",
  "name": "Dealing with Damage Shields",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/dealing-with-damage-shields-t2355450.html",
  "author": "webshaman1",
  "avatar": "10759110_1577099721.jpg",
  "replies": "25",
  "views": "830",
  "posts": [
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:20 PM - Apr 23, 2020",
      "content": "<div>Hiya all!<br/>\n<br/>\nI have a quick question about how do melee Battle Clerics without UMD deal with Damage Shields?<br/>\n<br/>\nAssuming low elemental DR and Caster level that cannot be dispelled, how does one solve this?<br/>\n<br/>\nAlso, Heal/Harm has been nerfed.<br/>\n<br/>\nExample : Let us say there is an Epic level Dragon that can cast Damage Shields.  It also has multiple Heals, etc. </div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "3:44 PM - Apr 23, 2020",
      "content": "<div>1. Wait until they drop<br/>\n2. Use extended silence<br/>\n3. Use offensive spells<br/>\n4. Use a DI summons (depends on the Module)<br/>\n5. Use a twohanded weapon and much healing<br/>\n6. Use a thrown weapon<br/>\n7. Use sequencers/items<br/>\n8. Throw a pocket Dwarf at it<br/>\n<br/>\nIf none of those work, I take my ball and go home<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:00 PM - Apr 23, 2020",
      "content": "<div>1. Is not a real option, because it is attacking me (and I have no way to get away - GS is very, very erratic in the environment where I play)<br/>\n2. Dragon is not affected by Silence, apparently (I have tried this - looks like it has Still).<br/>\n3. Offensive spells bounce off the SR (and I have no way of lowering it enough with a Cleric).<br/>\n4. Summons are not effective at that level.<br/>\n5. Two-Handed weapon does more damage to me than it...and it can heal itself.<br/>\n6. It is an option...but as it likes to melee me, I get AoO.<br/>\n7. An option to look into.<br/>\n8. Looking for volunteers!<br/>\n<br/>\nOh, and Dragon has multiple uses of Mord's, Greater Dispelling.<br/>\n<br/>\nThank you very much for the suggestions!  At least one is a very good option, and another is an option to try.</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "6:50 PM - Apr 23, 2020",
      "content": "<div>You said battle cleric. Is it pure cleric or have you muddied the waters?  And if you muddied it, what dirts did you muck with?<br/>\n<br/>\nWith or without umd, battle clerics reach a point of diminishing returns in some respects because they lack a knock out punch for those end game bosses. Sure, they do great melee damage all the time, and they can slap harms about, but on rare occasions that’s not enough. <br/>\n<br/>\nYou said he’s resistant to Silence. Did you cast it on him or yourself?  If on you then he likely has Auto Silence. If on him, well, don’t do that. <br/>\n<br/>\nAgainst damage shields itself:  stay ranged and keep buffs maxed on your ranged weapon and projectiles. Divine favor (extended/hasted/rapidshot/divine power). If you have divine might even better. Keep a steady supply of level 7-9 summons for him to chew on while you unleash holy hell from down range. <br/>\n<br/>\nFinally, get a crew. One shouldn’t hunt elder wyrms alone. </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:31 PM - Apr 23, 2020",
      "content": "<div>Yeah, I tried the Silence on myself after buffing and then meleeing.  Didn't faze it.  I suspect Auto-Still.<br/>\n<br/>\nBasically a Cleric/Monk/WM - very nice melee.  That's about it.<br/>\n<br/>\nThe problem with ranged is it doesn't like me to stay ranged.  <br/>\n<br/>\nBut the main problem here is just how to deal with the damage shields period.  How do most Battle Clerics do it?<br/>\n<br/>\nAbout the only \"strategy\" (if one wants to call it that) is to get to a level where my Spells can naturally pierce the SR...but then, say goodbye to any XP.</div>"
    },
    {
      "author": "stephenratcliffe809",
      "avatar": "10759100_1561880327.jpg",
      "timestamp": "8:59 PM - Apr 23, 2020",
      "content": "<div>Word of Faith spammed  - then ranged whatever until shields drop.<br/>\n<br/>\nSent from my SM-T810 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:07 PM - Apr 23, 2020",
      "content": "<div>Either RDD/XX/YY with a ring of Acid resistance OR<br/>\n<br/>\nRun circles till that shield drops OR <br/>\n<br/>\nUse Ranged attacks.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:30 PM - Apr 23, 2020",
      "content": "<div>I like Valerfor's and GDL's suggestions<br/>\nI have been putting an amulet of acid resistance (20-) on the quickbar of my meleer's due to Mestil's, its not perfect but it reduces the acid damage I take, if I can't get rid of the Mestil's. I think a ring of major acid resistance is 30- would be even better.<br/>\nI've been asking my teammates to do the same when needed, especially my monks.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:17 AM - Apr 24, 2020",
      "content": "<div>Thanks for the advice, everyone.<br/>\n<br/>\nIt's an interesting dilemma.</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "12:50 AM - Apr 24, 2020",
      "content": "<div>In my experience, there is a list of core things in NWN you have to mitigate/manage in some fashion.  This, of course, is further influenced by how a module is designed/gated.<br/>\n<br/>\nIn most modules UMD is the strongest mechanism for mitigation outside of your build focusing on the class itself and your item matrix.<br/>\n<br/>\nOnce you take UMD away from the equation, those holes become very apparent.<br/>\n<br/>\nClerics, on most worlds, have a single gaping hole in my experience which is lack of breach capability. <br/>\n<br/>\nUMD is the easiest way to mitigate this but usually on any world built to allow soloing, there are items.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:55 AM - Apr 24, 2020",
      "content": "<div>Yeah, I'm coming to that conclusion as well.<br/>\n<br/>\nSo, the obvious answer is to find a way to be able to breach without needing UMD.<br/>\n<br/>\nI think I know of a way.<br/>\n<br/>\nThat was all some great advice, and some good insight.</div>"
    },
    {
      "author": "The Flying Rodent",
      "avatar": "no_avatar.png",
      "timestamp": "1:22 AM - Apr 24, 2020",
      "content": "<div>I think the simple answer is that “you don’t have the right build type for this enemy”.<br/>\n<br/>\nIf the dragon has very high SR, given the max allowed in the toolset is 32SR, then your build most likely doesn’t have many cleric levels to penetrate ~32 SR... which means that it can’t use offensive spells against an obviously anti-melee countermeasure.<br/>\n<br/>\nBattle clerics are strong, but that doesn’t make them capable of doing everything (although, as has already been stated, UMD helps a lot in medium-high magic environments with plenty of scrolls available). I’d recommend requesting the help of a friendly mage to breach the shield for you. Might be easier then. :)</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "1:48 AM - Apr 24, 2020",
      "content": "<div><blockquote><div><cite>The Flying Rodent wrote:</cite>I think the simple answer is that “you don’t have the right build type for this enemy”.<br/>\n<br/>\nIf the dragon has very high SR, given the max allowed in the toolset is 32SR, then your build most likely doesn’t have many cleric levels to penetrate ~32 SR... which means that it can’t use offensive spells against an obviously anti-melee countermeasure.<br/>\n<br/>\nBattle clerics are strong, but that doesn’t make them capable of doing everything (although, as has already been stated, UMD helps a lot in medium-high magic environments with plenty of scrolls available). I’d recommend requesting the help of a friendly mage to breach the shield for you. Might be easier then. :)</div></blockquote>\n\nI suspect a friendly mage casting Mord’s Disjunction into 5x 2/per day sequencer would do the trick.<br/>\n<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "The Flying Rodent",
      "avatar": "no_avatar.png",
      "timestamp": "1:51 AM - Apr 24, 2020",
      "content": "<div>I don’t think you can selectively target Sequencer spells, they just auto cast on self. So if one cast Mords from a Sequencer, it would just dispel the Sequencer user. Could be wrong though!<br/>\n<br/>\nAlso would make for an interesting idea for a module designer: the option to persuade NPC’s to try on defective Sequencers and dispel themselves...</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:51 AM - Apr 24, 2020",
      "content": "<div>Sure, in a party (and of course, that is good advice!)<br/>\n<br/>\nThis is solo, however.<br/>\n<br/>\nJust trying to find ways to \"cover my bases\" with the build, where possible.  I got some really good fb on how to deal with it - w/o UMD.<br/>\n<br/>\nVery happy about it.  Nice way to \"think outside of the box\" so to speak.<br/>\n<br/>\nSo the build does not have to be reconsidered.  Just goes to show, if you want expert advice, go to the experts.</div>"
    },
    {
      "author": "The Flying Rodent",
      "avatar": "no_avatar.png",
      "timestamp": "1:55 AM - Apr 24, 2020",
      "content": "<div>With Monk Speed and/or Cleric buffs, kiting with Ranged Weapons is always an option. But then the success of this depends on the quality of Ranged weapons available, the Regen and AC of the target, etc.<br/>\n<br/>\nOn an old module that I used to play (and DM for), there was a +5,000 HP dracolich boss that I attempted to kill with a general Shifter build, but it had too high AB for me to deal with (but thankfully it had no healing and very little regen). So my solution was to run around for 45 minutes as a Death Slaad launching Chaos Spittles at it until it died. <br/>\n<br/>\nOutside the box mightn’t be the most efficient way of doing things, but it can be fun, lol.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:57 AM - Apr 24, 2020",
      "content": "<div>That's a nice solution!<br/>\n<br/>\nWhatever works, I say!</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "2:07 AM - Apr 24, 2020",
      "content": "<div><blockquote><div><cite>The Flying Rodent wrote:</cite>I don’t think you can selectively target Sequencer spells, they just auto cast on self. So if one cast Mords from a Sequencer, it would just dispel the Sequencer user. Could be wrong though!<br/>\n<br/>\nAlso would make for an interesting idea for a module designer: the option to persuade NPC’s to try on defective Sequencers and dispel themselves...</div></blockquote>\n\nI have not tried that particular spell on a sequencer, the make or break is whether or not it is an AOE cast or a single target cast.  I would not be overly concerned with stripping my own buffs in PVE as long as I deplete the enemy available spells.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "2:30 AM - Apr 24, 2020",
      "content": "<div>I just wanted to say, thanks for the interesting logical discussion.  I really appreciate the ... simplicity.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:35 AM - Apr 24, 2020",
      "content": "<div>Silence doesn't work well with large creature models since it's hard to make the AoE overlap with the creature's position. It's possible that the dragon doesn't have Silent Spell and is just outside of the Silence aura when it casts.<br/>\n<br/>\nHave you tried counterspelling the heals? If it heals via a monster ability then you're out of luck, but if it actually casts a spell then you should be able to counterspell them and reduce the fight time.<br/>\n<br/>\nIn general casters are the biggest problem for battle clerics, so as The Flying Rodent said you might just have to accept that it's a bad matchup.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:35 AM - Apr 24, 2020",
      "content": "<div>I think trying the Mords (or Lesser Spell Breach/Greater Spell Breach) idea on a sequencer is worth trying.<br/>\nI haven't had success in putting offensive spells on sequencers, but if it can be done, would love to know if it is possible.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:47 AM - Apr 24, 2020",
      "content": "<div>I just did some testing with a sequencer. Mords and GDispel both fit on the sequencer but when used they only work as though targeted on the caster. GSBreach doesn't work on the sequencer because it counts as an offensive spell. So you can Mord/dispel yourself but it won't dispel AoEs or breach any enemies.</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "2:50 AM - Apr 24, 2020",
      "content": "<div>If you are in a testing mood, how about Nature’s balance?<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:54 AM - Apr 24, 2020",
      "content": "<div>Nature's Balance doesn't have a breach effect in vanilla NWN, although adding one is probably the most common custom change I've seen to the spell. It does fit on the sequencer and it does reduce SR as normal when cast via sequencer.</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "3:46 AM - Apr 24, 2020",
      "content": "<div>Cool, thanks.  So that is an option as well, depending on SR and effective casting level from the sequencer, it might be enough to allow some cleric spell opportunities like Blade Barrier.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:08 AM - Apr 24, 2020",
      "content": "<div>That's too bad that Mord's and other Breaches cannot be Sequenced.<br/>\n<br/>\nBut the idea with Nature's Balance, that is a good one!</div>"
    }
  ]
}