{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "342",
  "name": "Abbot of the 7 Winds: Monk 12/Cleric 14/DwD 14 Beta",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/abbot-of-the-7-winds-monk-12-cleric-14-dwd-14-beta-t515394.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": "12",
  "views": "2.8K",
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:14 AM - Jul 31, 2011",
      "content": "<div>There are several builds with this class mix in the ECB, but all are quite different, focused on very specific applications.  I've become bored playing DWing kama monks and miss playing a fister with a decent stun against mages and retaining the class strengths of a monk.  Besides that, the few cleric monks I made were casters exploiting a few cheese levels.<br/>\n<br/>\nThis fellow won't be much with offensive casting other than to cause some general havoc.  I wanted to steer away from the dexpecker wall motif into something that could do some real damage.  With IKD, there is a good chance to thin out mobs the old-fashioned way, hand-to-hand.  My monks never had any summon help to distract enemies or Darkness to freeze attackers, well, at least some of them.  This guy is fast enough to attack a target, retreat and return at his own pace.  Good results against all undead including that blasted demilich who is such a headache.  I admit it is a bit thin in any one class, but the combo seems to work very well.<br/>\n<br/>\nNow, if only I could find a nice pair of gloves.   +1 Ki strike until I do.<br/>\n<br/>\nThere is a background story for this character w-a-a-y at the end of the build.  I thought it up while mowing the lawn a few hours ago and hope you like it.<br/>\n<br/>\n<strong>Abbot of the Seven Winds</strong><br/>\n<br/>\nMonk 12/ Cleric 14/ Dwarven Defender 14, Dwarf, Lawful any, PvM (what else?)<br/>\n<br/>\nSTR: 16 (30)<br/>\nDEX: 14 <br/>\nCON: 10<br/>\nWIS: 16 (17)<br/>\nINT: 12<br/>\nCHA: 6<br/>\n<br/>\n(See <span style=\"color:#0000FF\">Notes</span> for suggested variants)<br/>\n<br/>\nHP: 416<br/>\nSaves (F/W/R): 26/29/21 (36/39/31 vs. spells)<br/>\nOther save bonuses: Mind Effects: +2, Traps: +1, Poison: +2<br/>\nBAB: 26<br/>\nAB (max, naked): 40 (melee), 29 (ranged)<br/>\nAC (naked/mundane armor/shield only): 27/32<br/>\n<br/>\n01: Mnk 1 - Dodge<br/>\n02: Clc 1 - Domains Strength &amp; Trickery <span style=\"color:#0000FF\">[See Note 1]</span><br/>\n03: Mnk 2 - Toughness<br/>\n04: Clc 2 - STR+1 (17)<br/>\n05: Mnk 3<br/>\n06: Clc 3 - Weapon Focus: Unarmed<br/>\n07: Mnk 4<br/>\n08: Clc 4 - STR+1 (18)<br/>\n09: Mnk 5 - Extend Spell<br/>\n10: Clc 5<br/>\n11: Mnk 6<br/>\n12: DwD 1 - STR+1 (19), Imp Crit: Unarmed <br/>\n13: DwD 2<br/>\n14: DwD 3<br/>\n15: DwD 4 - Empower Spell<br/>\n16: Clc 6 - STR+1 (20)<br/>\n17: Mnk 7<br/>\n18: Clc 7 - Blind Fight<br/>\n19: Mnk 8<br/>\n20: Clc 8 - STR+1 (21)<br/>\n21: DwD 5 - Epic Weapon Focus: Unarmed<br/>\n22: Clc 9<br/>\n23: Mnk 9<br/>\n24: Clc 10 - STR+1 (22), Epic Prowess<br/>\n25: DwD 6<br/>\n26: DwD 7<br/>\n27: DwD 8 - Grt Str I (23)<br/>\n28: DwD 9 - STR+1 (24)<br/>\n29: DwD 10<br/>\n30: DwD 11 - Grt Str II (25)<br/>\n31: DwD 12<br/>\n32: Mnk 10 - STR+1 (26)<br/>\n33: Clc 11 - Grt Str III (27)<br/>\n34: DwD 13<br/>\n35: DwD 14 - Armor Skin<br/>\n36: Mnk 11 - STR+1 (28),  Grt Wis I (17)<br/>\n37: Clc 12<br/>\n<span style=\"color:#FF0000\"><strong>38</strong></span>: Clc 13<br/>\n<span style=\"color:#FF0000\"><strong>39</strong></span>: Clc 14 - Grt Str IV (29)<br/>\n<span style=\"color:#FF0000\"><strong>40</strong></span>: Mnk 12 - STR+1 (30)<br/>\n<br/>\n<strong>PROS</strong>\n<ul><li>Monk progression with high AB and 7 APR, hasted[/*:m]</li>\n<li>40% increase in move speed[/*:m]</li>\n<li>Innate SR of 22 (27 buffed)[/*:m]</li>\n<li>Bludgeoning damage supplemented with magical[/*:m]</li>\n<li>High buffed saves[/*:m]</li>\n<li>9/- DR[/*:m]</li>\n<li>Extremely resistant to KD, Called Shot &amp; Disarm *lol*[/*:m]</li></ul>[/list]<br/>\n<br/>\n<strong>CONS</strong>\n<ul><li>Relatively low skill set for a monk[/*:m]</li>\n<li>SR check too low for reliable casting of offensive SR spells[/*:m]</li>\n<li>GMW &amp; Darkfire buffs wasted on unarmed attack[/*:m]</li>\n<li>20% XP penalty levels 38-40[/*:m]</li>\n<li>No UMD [/*:m]</li>\n<li>No Craft Wand [/*:m]</li></ul>[/list]<br/>\n<br/>\n<strong>CRUNCH (@Lvl 40)</strong><br/>\n<br/>\nAB<br/>\nBase, unarmed +40/+37/+34/+31/+28/+25<br/>\n<br/>\nAvailable buffs (max):<br/>\nAid (1) + Bless (1) + Emp Bull's (3) + Div Power (4) + Div Favor (4) + Prayer (1) + Battletide (2) = 56<br/>\n+ Defensive Stance (1) = +57 AB<br/>\n<br/>\nBuffed, unarmed (in Defensive stance) +57/+54/+51/+48/+45/+42<br/>\nAs above, hasted +57/+54/+51/+48/+45/+42/+57<br/>\n<br/>\n(No listing of flurry stats because I never use it, but am sure you all know the drill to get 8 APR if that floats your boat.)<br/>\n<br/>\nDamage<br/>\nBase 11-22 (Crit 19-20 x2)<br/>\n<br/>\nAvailable buffs (max):<br/>\nEmp Bull's (3) + Div Favor (4, magic) + Prayer (1, slashing) + Battletide (2, magic) = 10<br/>\n+ Defensive Stance (1) = 11 damage<br/>\n<br/>\nBuffed, unarmed (in Defensive stance) 22-33 (Crit 19-20 x2)<br/>\n<br/>\nAC<br/>\nBase, naked/tunic 27<br/>\n<br/>\nAvailable buffs (max):<br/>\nEmp Owl's (4) + Haste (4) + Magic Vest (4) + Shld of Faith (4, deflection) = 43<br/>\n+ Defensive Stance (4) = 47 AC<br/>\n<br/>\nConditional AC<br/>\n+ Battletide (2 aura w/SR check)  = 49 AC<br/>\n<br/>\nSaves (F/W/R)<br/>\nBase 26/29/21 (36/39/31 vs. spells)<br/>\n<br/>\nAvailable buffs:<br/>\nEmp Endurance (3/0/0) + Emp Owl's (0/4/0) + Resistance (1/1/1) + Prayer (1/1/1) + Battletide (2/2/2) = 7/7/4<br/>\n+ Defensive Stance (4/2/2) = 11/9/6<br/>\n<br/>\nConditional saves<br/>\n+ Protect from Alignment (2/2/2) = 13/11/8<br/>\n<br/>\nMax buffed saves w/Defensive Stance = 39/41/29 (49/51/39 vs. spells)<br/>\n<br/>\nHP<br/>\nAvailable buffs:<br/>\nEmp Endurance (120) + Emp Aid (12) + Virtue (1) = 133<br/>\n+ Defensive Stance (80) = 213 + 416 (base) = 629 HP<br/>\n<br/>\nStunning Fist DC: 10 + 6 + 7 (w/Emp Owl's) = 23<br/>\n<br/>\n<strong>SKILLS: 159</strong><br/>\nConcentration 37(37), Discipline 43(53), Spellcraft 39(40), Tumble 40(42)<br/>\n<br/>\n01: Conc(4), Disc(4), Tumb(4), S - 8<br/>\n02: Conc(1), Spcr(5), S - 5<br/>\n03: Conc(1), Disc(2), Tumb(2), S - 5<br/>\n04: Conc(1), Spcr(2), S - 5<br/>\n05: Conc(1), Disc(2), Tumb(2), S - 5<br/>\n06: Conc(1), Spcr(2), S - 5<br/>\n07: Conc(1), Disc(2), Tumb(2), S - 5<br/>\n08: Conc(1), Spcr(2), S - 5<br/>\n09: Conc(1), Disc(2), Tumb(2), S - 5<br/>\n10: Conc(1), Spcr(2), S - 5<br/>\n11: Conc(1), Disc(2), Tumb(2), S - 5<br/>\n12: Conc(1), Disc(1), S - 6<br/>\n13: Conc(1), Disc(1), S - 7<br/>\n14: Conc(1), Disc(1), S - 8<br/>\n15: Conc(1), Disc(1), S - 9<br/>\n16: Conc(1), Spcr(6), S - 5<br/>\n17: Conc(1), Disc(2), Tumb(6), S - 1<br/>\n18: Conc(1), Spcr(2), S - 1<br/>\n19: Conc(1), Disc(2), Tumb(2), S - 1<br/>\n20: Conc(1), Spcr(2), S - 1<br/>\n21: Conc(1), Disc(2), S - 1<br/>\n22: Conc(1), Spcr(2), S - 1<br/>\n23: Conc(1), Disc(1), Tumb(4)<br/>\n24: Conc(1), Spcr(2)<br/>\n25: Conc(1), Disc(1), S - 1<br/>\n26: Conc(1), Disc(1), S - 2<br/>\n27: Conc(1), Disc(1), S - 3<br/>\n28: Disc(1), S - 5<br/>\n29: Disc(1), S - 7<br/>\n30: Disc(1), S - 9<br/>\n31: Disc(1), S - 11<br/>\n32: Disc(1), Tumb(9), S - 6<br/>\n33: Spcr(9)<br/>\n34: Conc(1), Disc(2)<br/>\n35: Conc(2), Disc(1)<br/>\n36: Disc(1), Tumb(4)<br/>\n37: Spcr(3)<br/>\n38: Conc(3)<br/>\n39: Conc(1), S - 2<br/>\n40: Disc(6), Tumb(1)<br/>\n<br/>\n<span style=\"color:#0000FF\"><strong>Notes</strong><br/>\n<br/>\n1.  Travel domain is the preferred alternative without permahaste item availability.  Animal or War (however, Aura of Vitality cannot be extended beyond 14 rounds) to elevate Dex AC. <br/>\n<br/>\n2.  Kama(s) can be used along with GMW &amp; Darkfire to satisfactory results even without foci.  However, due to thematic considerations and feat starvation, DWing was ruled out as a practical variant to this design.<br/>\n<br/>\n3.  By replacing 2 Grt Str feats a more versatile feat selection would be possible but I would wait to see what works in the specific environment before reducing the AB by 1.   Another, slightly defensive variant might be starting with DEX13, CON11, swapping 2 Grt Str for 1 Grt Con and 1 Grt Wis (final CON12/WIS18) to gain HPs, AC, fort/will saves, Level 4 slot and better DC.</span><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">The Abbot of the Seven Winds</span></strong><br/>\n<br/>\nA story (as related by Anders Tolben, the proprietor of the Seven Winds Tavern)<br/>\n<br/>\n<span style=\"font-size:200%;line-height:normal\">\" </span> A whiles back we had a bit of fracas here at the Winds.  I was nursin' 'ol Baines with his usual devil's tonic... with him cryin' on bout his missus and her bad cookin' when in steps Scratch, a burly bloke with none-too-hospitable manners... a loud, unshaven and surly piker who only gets louder when he's a gulpin' me swill.<br/>\n<br/>\nWell, me ear's locked up listenin' to Baines' tripe when Scratch wanders over to the end o' the bar and snatches up a staff that was leanin' near the highback there.  And he sez \"Wuts this purty thing, Tolben?  Nivver seed carvens on a stick like this afore!\"  So Baines breaks off his prattle, kinda worried like, and tells Scratch \"Better put that there branch down, Scratch!  It's the friar's en 'e is one of them clerky folk from up the path.\"<br/>\n<br/>\nScratch a-smilin' cracks back \"Wuzza friar?  That 'im by the 'arth?\" With which Baines nods, \"Yah, and 'ees a not like you ner me.  It weren't a good notion to fuss with 'is stuff.\"<br/>\n<br/>\nSo Scratch laughs. \"Haw, haw!  A friar by da fire!  Ain' that a dandy joke?\"<br/>\n<br/>\nThere sets Friar Noles... well, 'e wuz just half dozin' a might by me hearth, kinda drawin' smoke on that pipe of 'is, that scrawly grey beard a-hangin' limp... turns 's head, eyeballin' Scratch... gits up slow like 'n starts to walk over where Scratch is a-standin' holding that bleedin' stick in his hairy mits.   Noles sez to Scratch real uppity like \"Pardon me, sir, but the staff you are holding is a holy artifact that belongs where I placed it.\"  But Scratch is no flighty bird and tells him \"Art 'o fack is it?  Where there be art 'o fack of any here in Tolben's?  I sees nun.  I juss sees this here stick with a face carved on 'er.  It shoulda make a nice leanin' stick fer me 'ol mom 'oos not walkin' ver good no more.  Back to yur chair, grey face!  Tha' needs restin', not harpin' wid the likes 'o me.\"  <br/>\n<br/>\nNow Noles, well... ne'er faded 'is nebb, no furrow of 'is brow, plain as porridge.  He just asks 'im \"How's that hearing in your left ear, lad? Didn't you understand the words?\"<br/>\n<br/>\nWell, 'ol Scratch is mussed a bit, lookin' blank and sez \"'earin?  Wut the biznuss of me 'earin? I can 'ear 'nuff to know wuts worth 'earin and this 'ain it!  Sticks is cheap so find ya nother to walk wit!\"  Scratch is natch thinkin' the staff wuz the friar's battlestick and wants it to whoop 'im with it.  He gets into rows like that lots and learnt what might happen.<br/>\n<br/>\nI guess that flamed Friar Noles enough then, cuz he takes his right hand 'n cups it, swings at Scratch ear and then I hears... \"Pop\"!  Scratch stands there for a tick, wheelin' and quiet, sayin' nothin', then drops like 'ee was pole-axed, to the floor.  I sez \"Lawd, Noles! You killed 'em dead, you did!  This be trouble fer sure!\"<br/>\n<br/>\nBut Noles just looks at me sayin' \"He's just resting, Tolben.  Looks peaceful, doesn't he?  When he wakes, he'll be just pucker... better than before, I expect...  that highback over there... ?\"  He points to the chair he was sittin' in.  \"That an heirloom of some sort?\"  I'm fearin' that he's gonna finish off 'ol Scratch with it but I'm too shook to lie about it.  \"No, friar\" I sez, \"just another chair like all the rest.  What you got in your head to do, friar?\"  But he says nothin'... just steps to the bar rail.<br/>\n<br/>\nSo he goes into his pocket, makes a clutch for somethin' and slips me 3 sovereigns sayin' \"I expect that'll about cover it.\"  And he goes over to the chair, takes his fist and cleaves it sweet, right where the seat meets the back and it shatters into pieces on the floor.  Noles picks up a long sturdy piece that lay in the heap, hands it to Baines and tells 'im \"When your friend's head clears, give him this for his mother.\"  Then he grabs 'is staff 'n heads fer the door.<br/>\n<br/>\n\"Tolben.  You need to take a better hand with your patrons.  This is the last time I will correct one of them for you.\" I just stared at 'im.  \"Buy a chair a fellow can relax in, will you?  That one seemed to make me a bit nervy.\"  Through the doorway clankin' the door shut behind 'im.  Haven't seen 'im since, over a month now.<br/>\n<br/>\nAnyway, after Noles leaves, I am a-lookin' at Baines who's paled from all the mischief.  He sez to me \"Ever seed anythin' of that a'fore Tolben?\" I was too numb in the head to think about it, shakin' me bean.<br/>\n<br/>\nSo, I give him a drink. \"It's on the house, Baines.  Maybe we just fergit the whole bleedin' thing, eh?\"  And Baines nods and begins to nurse his ills as is his skill.  That was about all of the tale 'til Scratch woke up.  But Baines went right on with his drinkin', ne'er skipped a beat... I think blamin' Scratch for 'is cheek and floor dust.<br/>\n<br/>\nThe strangest thing was, after Scratch come to, he was a different bloke.  Still loud and rowdy talkin' but never troubled me or any of the tavern folk since with the foolery like he always had a-fore then.  I don't figger that the friar had magic going on there, but it sure was strange doings.  'Correct one of them', I was thinking what Noles said, \"Maybe when he corrects one, it really is the magic call, 'specially for an oaf like 'ol Scratch.  'ees a hard task to fix.\"<br/>\n<br/>\nEven through to today, Scratch is still \"corrected\".  He doesn't remember the friar at all when I ask him about the fuss, but his 'ol mom walks about more sturdy then ever before, holding that piece of the highback like a staff... and, to be true, I never saw a crack 'o smile from that lady before, but she smiles now.<br/>\n<br/>\nAny more, lads? Last call for the night! <span style=\"font-size:200%;line-height:normal\">\"</span></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "5:49 PM - Jul 31, 2011",
      "content": "<div>The first thing that comes to mind, looking at the class split, is to suggest Cleric 15/Monk 11 if not Cleric 17/Monk 9. Give up a little speed for lvl 8 spells (Firestorm, mass heal which is just great vs undead) and capped +1/3 lvl buffs or give up also -1AC for lvl 9 spells (SoV, Implosion) (compensated by +1 buffed AC if you want). Monk SR 22 is just pointless and poison immunity is no biggie (Neg En Protection makes you immune to ability drains of any kind already, thus making you virtually immune to poison). You lose some stunning fists a day but what you get back is worth more IMO.<br/>\n<br/>\nPS: will check the build more throughly and the story later on.</div>"
    },
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "3:46 PM - Aug 01, 2011",
      "content": "<div>Agree with Kail.  I like Cleric 15 (at a minimum) so you can max out the Divine Favor and Greater Magic Weapon bonuses (in case you find a nice kama as backup).  Going from 1d12 to 1d10 fist damage won't be a biggie.  Also, try for a 15 BAB pre-epic to take advantage of Divine Power...I think Monk 8 / Cleric 9 / DwD 3 will work.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:56 PM - Aug 01, 2011",
      "content": "<div><blockquote><div><strong>KailPendragon wrote:</strong>The first thing that comes to mind, looking at the class split, is to suggest Cleric 15/Monk 11 if not Cleric 17/Monk 9. Give up a little speed for lvl 8 spells (Firestorm, mass heal which is just great vs undead) and capped +1/3 lvl buffs... </div></blockquote>\nThe maxing of the 1/3 buffs is the best point, though this build can do fine without additional offensive spells.  DCs will be weak without some sort of penetration feats (no room) and low caster level.  I normally would not rely much on any offensive spells being reliable unless at least 20 caster levels and even then depending on foci and/or penetration feats to make up the difference.  No, a slightly more exalted caster level (i.e. +3) would merely provide more slots for buffing as far as the brawler aspects are concerned with poor results with high level spells (Implosion, specifically, very easy for high fort NPCs to save).\n<blockquote><div>\n... or give up also -1AC for lvl 9 spells (SoV, Implosion) (compensated by +1 buffed AC if you want).</div></blockquote>\nWIS 19 is beyond the scope of this build with the effect of making unbuffed attack fairly pedestrian (i.e. 37-38).  It was always intended to be primarily a buffed, brawler with a few support offensive spells against the easier, low save/low SR enemies.  I intentionally wanted to steer as far away from the monk dump routine and more to actually use the attack progression better together with a tertiary that would provide some defense to offset the AC issue of single-handed, tunic-only melee.\n<blockquote><div>\nMonk SR 22 is just pointless and poison immunity is no biggie (Neg En Protection makes you immune to ability drains of any kind already, thus making you virtually immune to poison). You lose some stunning fists a day but what you get back is worth more IMO.\n</div></blockquote>\nI agree with these points.  It's worth dropping down to monk 9 to retain imp evasion, but I am beginning to run into skill allotment problems at that level besides the escalating loss in AB.  Even with as many monk levels as in the original design, Concentration couldn't be maxed.  That bothers me to begin with.  Dropping it further will expose me even more to taunting.  Only the CON boosts from buffs and DwD stance is compensating to some degree. I am not deceiving myself into believing that the buffed attack/defensive levels will be there intact to use in all situations so would be relying solely on the base levels to survive in those cases.  I am reluctant to drop monk lower than a single level (2 would be a stretch) and definitely cherish every point in AC that can be gleaned from innate sources.  Otherwise, I would consider going to Monk 10/Cleric16 to gain slots/duration.  But the skill points are thinning out more than I would like beyond Monk11/Cleric15.<br/>\n<br/>\nBesides those considerations, I dislike any XP penalty in my builds.  If it comes late enough I can rationalize a few levels to some degree, but I do not favor the resultant handicap it causes when you are trying to stay abreast of the rest of your party's progress.\n<blockquote><div><strong>Demos wrote:</strong>Agree with Kail.  I like Cleric 15 (at a minimum) so you can max out the Divine Favor and Greater Magic Weapon bonuses (in case you find a nice kama as backup).  Going from 1d12 to 1d10 fist damage won't be a biggie.  \n</div></blockquote>\nI agree (as described above. should have noticed that when I built  ).  The kama-buffing would be an incidental benefit for the reason I explained in my general description of the intent and theme behind the build, but useful nonetheless.\n<blockquote><div>\nAlso, try for a 15 BAB pre-epic to take advantage of Divine Power...I think Monk 8 / Cleric 9 / DwD 3 will work.</div></blockquote>\nYes. I had considered that right from conception... but are you certain that it works with the monk's unarmed (-3) progression? IIRC, I tested it and it didn't work like in standard (-5) progressions.  I may need to retest this again, if you are certain that it does.  Revising the split itself is minor.<br/>\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -<br/>\n<br/>\nIn any case, thanks for the scrutiny, guys.  Learning lots since joining here.</div>"
    },
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "5:43 PM - Aug 02, 2011",
      "content": "<div>I tested Divine Power with an unarmed monk with a BAB of 15 and it worked as advertised.  I set my stats at STR = 10 and DEX =16 (took Weapon Finesse) for testing purposes.<br/>\n<br/>\nAt level 20 (Cleric 16 / Monk 4), before Divine Power, my attack schedule was +18/+15/+12/+9/+6 (BAB of 15, +3 from the DEX bonus, no weapon focus)<br/>\n<br/>\nWith Flurry of Blows, the attack schedule was +16/+13/+10/+7/+4/+16<br/>\n<br/>\nWith Divine Power, my attack schedule was +24/+21/+18/+15/+12/+24  (BAB of 20, +4 from the STR bonus since STR got bumped to 18).<br/>\n<br/>\nWith DP and Flurry of Blows on, the attack schedule was +22/+19/+16/+13/+10/+22/+17 ... so one free attack was at full AB (+22) and the second free attack was at the standard -5 progression.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:01 PM - Aug 02, 2011",
      "content": "<div>Thanks so much for vesting your own time and effort to test the progression, Demos.  I will definitely make the adjustments to include the suggestions both you and Kail have suggested to make it a significantly more versatile and more efficient build for what I had intended. <br/>\n<br/>\nI love this guild!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:22 AM - Aug 03, 2011",
      "content": "<div><span style=\"font-size:150%;line-height:normal\">Abbot of the Seven Winds - Revised (1) - Monk 11/Cleric 15/Dwarven Defender 14</span><br/>\n<br/>\nChanges from Monk 12/Cleric 14/Dwarven Defender 14 (w/26 BAB)<br/>\n(<span style=\"color:#8080BF\">Differences</span> high-lighted. All else is the same.)<br/>\n<br/>\nLosses<br/>\n<span style=\"color:#8080BF\">-1 AB (Melee &amp; ranged)<br/>\n-2 damage<br/>\n-2 Concentration<br/>\n-10% move speed<br/>\n-1 stunning fist/day<br/>\n-1 stunning fist DC<br/>\n- All innate spell resistance<br/>\n+2 Levels of XP penalty (36, 37)</span><br/>\n<br/>\nGains<br/>\n<span style=\"color:#8080BF\">+1 buffed AC<br/>\n+ Improved attack progression w/Divine Power<br/>\n+ 2 spell slots (Levels 3 &amp; 5)<br/>\n+ Level 7 Cleric spells<br/>\n+1 SR penetration</span><br/>\n<br/>\nMonk 11/Cleric 15/Dwarven Defender 14, Dwarf, PvM, Any Lawful<br/>\n<br/>\nSTR: 16 (30)<br/>\nDEX: 14<br/>\nCON: 10<br/>\nWIS: 16 (17)<br/>\nINT: 12<br/>\nCHA: 6<br/>\n<br/>\nHP: 416<br/>\nSaves (F/W/R): 25/28/21 (35/38/31 vs. spells)<br/>\nOther save bonuses: Mind Effects: +2, Traps: +1, Poison: +2<br/>\n<span style=\"color:#8080BF\">BAB: 25<br/>\nAB (max, naked): 39 (melee), 28 (ranged)</span><br/>\nAC (naked/mundane armor/shield only): 27/32<br/>\n<br/>\n01: Mnk 1 - Dodge<br/>\n02: Clc 1 - Domains Strength &amp; Trickery<br/>\n03: Mnk 2 - Toughness<br/>\n04: Clc 2 - STR+1 (17)<br/>\n05: Mnk 3<br/>\n06: Clc 3 - Weapon Focus: Unarmed<br/>\n07: Mnk 4<br/>\n08: Clc 4 - STR+1 (18)<br/>\n09: Mnk 5 - Extend Spell<br/>\n10: Clc 5<br/>\n11: Mnk 6<br/>\n<span style=\"color:#8080BF\">12: Clc 6 - STR+1 (19), Imp Crit: Unarmed<br/>\n13: DwD 1<br/>\n14: DwD 2<br/>\n15: DwD 3 - Empower Spell<br/>\n16: Mnk 7 - STR+1 (20)<br/>\n17: Clc 7<br/>\n18: Mnk 8 - Blind Fight<br/>\n19: Clc 8<br/>\n20: Mnk 9 - STR+1 (21)<br/>\n21: DwD 4 - Epic Weapon Focus: Unarmed<br/>\n22: DwD 5<br/>\n23: DwD 6<br/>\n24: Clc 9 - STR+1 (22), Epic Prowess<br/>\n25: DwD 7<br/>\n26: DwD 8<br/>\n27: DwD 9 - Grt Str I (23)<br/>\n28: DwD 10 - STR+1 (24)<br/>\n29: DwD 11<br/>\n30: DwD 12 - Grt Str II (25)<br/>\n31: DwD 13<br/>\n32: DwD 14 - STR+1 (26), Armor Skin<br/>\n33: Mnk 10 - Grt Str III (27)<br/>\n34: Clc 10<br/>\n35: Clc 11</span><br/>\n<span style=\"color:#FF0000\">36</span>: <span style=\"color:#8080BF\">Clc 12 - STR+1 (28), Grt Wis I (17)</span><br/>\n<span style=\"color:#FF0000\">37</span>: <span style=\"color:#8080BF\">Clc 13</span><br/>\n<span style=\"color:#FF0000\">38</span>: <span style=\"color:#8080BF\">Clc 14</span><br/>\n<span style=\"color:#FF0000\">39</span>: <span style=\"color:#8080BF\">Clc 15 - Grt Str IV (29)</span><br/>\n<span style=\"color:#FF0000\">40</span>: <span style=\"color:#8080BF\">Mnk 11 - STR+1 (30)</span><br/>\n<br/>\nSKILLS: 157<br/>\nConcentration <span style=\"color:#8080BF\">35(35)</span>, Discipline 43(53), Spellcraft 39(40), Tumble 40(42)<br/>\n<br/>\n<span style=\"color:#8080BF\">01: Conc(4), Disc(4), Tumb(4), S - 8<br/>\n02: Conc(1), Spcr(5), S - 5<br/>\n03: Conc(1), Disc(2), Tumb(2), S - 5<br/>\n04: Conc(1), Spcr(2), S - 5<br/>\n05: Conc(1), Disc(2), Tumb(2), S - 5<br/>\n06: Conc(1), Spcr(2), S - 5<br/>\n07: Conc(1), Disc(2), Tumb(2), S - 5<br/>\n08: Conc(1), Spcr(2), S - 5<br/>\n09: Conc(1), Disc(2), Tumb(2), S - 5<br/>\n10: Conc(1), Spcr(2), S - 5<br/>\n11: Conc(1), Disc(2), Tumb(2), S - 5<br/>\n12: Conc(1), Spcr(2), S - 5<br/>\n13: Conc(1), Disc(2), S - 5<br/>\n14: Conc(1), Disc(1), S - 6<br/>\n15: Conc(1), Disc(1), S - 7<br/>\n16: Conc(1), Disc(1), Tumb(5), S - 5<br/>\n17: Conc(1), Spcr(5), S - 2<br/>\n18: Conc(1), Disc(2), Tumb(2), S - 2<br/>\n19: Conc(1), Spcr(2), S - 2<br/>\n20: Conc(1), Disc(2), Tumb(2), S - 2<br/>\n21: Conc(1), Disc(1), S - 3<br/>\n22: Conc(1), Disc(1), S - 4<br/>\n23: Conc(1), Disc(1), S - 5<br/>\n24: Conc(1), Spcr(5), S - 2<br/>\n25: Conc(1), Disc(2), S - 2<br/>\n26: Conc(1), Disc(1), S - 3<br/>\n27: Conc(1), Disc(1), S - 4<br/>\n28: Conc(1), Disc(1), S - 5<br/>\n29: Conc(1), Disc(1), S - 6<br/>\n30: Conc(1), Disc(1), S - 7<br/>\n31: Conc(1), Disc(1), S - 8<br/>\n32: Conc(1), Disc(1), S - 9<br/>\n33: Disc(1), Tumb(13)<br/>\n34: Spcr(2), S - 1<br/>\n35: Spcr(2), S - 2<br/>\n36: Spcr(2), S - 3<br/>\n37: Spcr(3), S - 3<br/>\n38: Spcr(3), S - 3<br/>\n39: S - 6<br/>\n40: Disc(7), Tumb(4)</span><br/>\n<br/>\n<strong>CRUNCH (@Lvl 40)</strong><br/>\n<br/>\nAB<br/>\nBase, unarmed <span style=\"color:#8080BF\">+39/+36/+33/+30/+27</span><br/>\n<br/>\nAvailable buffs (max):<br/>\nAid (1) + Bless (1) + Emp Bull's (3) + Div Power (4) + <span style=\"color:#8080BF\">Div Favor (5) </span>+ Prayer (1) + Battletide (2) = 56<br/>\n+ Defensive Stance (1) = +57 AB<br/>\n<br/>\n<span style=\"color:#8080BF\">(1) Buffed, unarmed (in Defensive stance) +57/+54/+51/+48/+45/+57 (6 APR)<br/>\n(2) As in (1), hasted +57/+54/+51/+48/+45/+57/+52 (7 APR)<br/>\n(3) As in (2), flurry mode +55/+52/+49/+46/+43/+55/+50/+45 (8 APR)</span><br/>\n<br/>\nDamage<br/>\nBase <span style=\"color:#8080BF\">11-20</span> (Crit 19-20 x2)<br/>\n<br/>\nAvailable buffs (max):<br/>\nEmp Bull's (3) + <span style=\"color:#8080BF\">Div Favor (5, magic)</span> + Prayer (1, slashing) + Battletide (2, magic) = 10<br/>\n+ Defensive Stance (1) = <span style=\"color:#8080BF\">12 damage</span><br/>\n<br/>\nBuffed, unarmed (in Defensive stance) <span style=\"color:#8080BF\">23-32</span> (Crit 19-20 x2)<br/>\n<br/>\nAC<br/>\nBase, naked/tunic 27<br/>\n<br/>\nAvailable buffs (max):<br/>\nEmp Owl's (4) + Haste (4) + <span style=\"color:#8080BF\">Magic Vest (5)</span> + Shld of Faith (4, deflection) = <span style=\"color:#8080BF\">44</span><br/>\n+ Defensive Stance (4) = <span style=\"color:#8080BF\">48 AC</span><br/>\n<br/>\nConditional AC<br/>\n+ Battletide (2 aura w/SR check)  =<span style=\"color:#8080BF\"> 50 AC</span><br/>\n<br/>\nSaves (F/W/R)<br/>\nBase 26/29/21 (36/39/31 vs. spells)<br/>\n<br/>\nAvailable buffs:<br/>\nEmp Endurance (3/0/0) + Emp Owl's (0/4/0) + Resistance (1/1/1) + Prayer (1/1/1) + Battletide (2/2/2) = 7/7/4<br/>\n+ Defensive Stance (4/2/2) = 11/9/6<br/>\n<br/>\nConditional saves<br/>\n+ Protect from Alignment (2/2/2) = 13/11/8<br/>\n<br/>\nMax buffed saves w/Defensive Stance = 39/41/29 (49/51/39 vs. spells)<br/>\n<br/>\nHP<br/>\nAvailable buffs:<br/>\nEmp Endurance (120) + Emp Aid (12) + Virtue (1) = 133<br/>\n+ Defensive Stance (80) = 213 + 416 (base) = 629 HP<br/>\n<br/>\nStunning Fist DC: 10 + <span style=\"color:#8080BF\">5</span> + 7 (w/Emp Owl's) = <span style=\"color:#8080BF\">22</span><br/>\n<br/>\nSpells<br/>\n<span style=\"color:#8080BF\">#Slots (0 to 7): 6/7/7/7/5/5/4/3</span></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:42 PM - Aug 06, 2011",
      "content": "<div>Heya Hip, I was due to make an appearance in one of your builds, given we've discussed so many alternatives via e-mail. Lucky me that the first build I see of yours involves a Cleric. I am pretty much the newer avado when it comes to them, I have played at least 4 builds with very different results and purposes using clerical features. <br/>\n<br/>\nI hate what I'm about to do because I hate it when people do the same to me, but I don't see the point for Dwarven Defender here. I read an article by Thax in the old guild about the class, which said that if you're not going to take the most advantage of the Damage Reduction, then you're probably better off not using the class at all, because that is sort of like its trademark. What do these 14 levels + 2 feats spent as requirements give you besides mild DR, which, except for covering all weapon enhancements, is 1 point lower than Stoneskin (which you can get via Strength Domain),  Defensive Stance 6x a day and Defensive Awareness? What I mean is that I don't see the synergy here. If you dropped DD altogether and just went Cleric 26 Monk 14, the build would be much stronger, not to mention undispellable. Now if you added another class, say.. SD, even better!<br/>\n<br/>\nHowever, if you`re just trying a new class combo because you want to do something different, regardless of synergies, I would still go the way Kail and the others suggested. 15 Cleric is what you need for buffs, although you will be easily dispellable. Just have multiple copies of the same spell counting on the fact that you will be dispelled.I wouldnt go 17/9 for IE. I would rather have +1 AC from Monk 10 than lvl 9 cleric spells. But you will need to rearrange your stat points to get 18 WIS. <br/>\n<br/>\nI have to say that I personally prefer DEX-based Monk/Clerics, as the Cleric class already has some neat damage bonuses and the extra AC from both Wisdom and Dex is much more useful. Monk AC bonus doesn't work with any type of armor, so you either drop dex altogether and go for full plate or drop str altogether and go for robes + Monk AC.<br/>\n<br/>\nSorry if I seemed overly critical, my friend, but I do think that the way you structured this build, you're not taking advantage of the Monk/Cleric synergies, nor making good use of the DD class. Mithdradates has a build that goes Cleric 30 Monk 6 Fighter 4, I forget the name of it, which does use the synergies perfectly and is able to avoid XP penalty. You could take a look at it for reference <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:50 PM - Aug 06, 2011",
      "content": "<div>@Max:<br/>\nWell, it was partially a thematic one, the dwarven monk thing you know.  But originally, I needed a PrC fighter-type tertiary to get 4 APR (those XP penalties are painful for me to swallow because of the crew I play with leaving me in the dust).  <br/>\n<br/>\nThen, as Demos pointed out, Divine Power does indeed work with the monk progression, so at that point I really didn't need a fighter-type anymore and could have gone the full cleric/monk route but we are then back to manipulating the XP penalty again with a thematic dwarf (like Cleric30/Monk10 *ouch*).  No doubt Mithradates' build is human or half-elf (haven't checked it myself). <br/>\n<br/>\nThe other aspect of DwD besides DR (and as you have already pointed out) are the indispellable stance buffs.  I felt those were of great value since they last as long as the stance is held.  The 9/- Dr is just consequential to gaining stances (in this build), but it won't expire and need to be recast. 9 points is 9 points and an eternal soak, unlike Stoneskin or its ilk which has a finite absorption (that can be shredded quickly if flanked by mobs).<br/>\n<br/>\nTBH, cleric has gotten so boring and predictable these days.  High-cleric builds abound (and for good reason) so I was looking for another perspective.  Besides, when I designed this, the offensive spell potential was an afterthought with the low DCs so was only interested in affording enough Cleric levels to access the buff spells I needed and with manageable duration(s).  If they dispel, it still has the stance buffs intact.<br/>\n<br/>\nFinally, as for DEX-base... Unarmed is not finessable and fists ARE thematic... i.e. the brawling monk of The Seven Winds (when you get a chance, if you haven't yet, read the background story and you will see what I had in mind).  Some STR could be sacrificed for DEX but only at the expense of AB which I consider to be barely adequate @unbuffed 39 (40 in stance, with \"40\" as my personal absolute minimum for melee) at the current ability spread. The dodge AC from stance is also subject to Defensive Awareness so I deemed it a useful class feat, as good as Uncanny Dodge from Rogue, SD or Assassin, anyways.  I had considered opting for one of the Cat's Grace domains to boost DEX via empowered spell and that is still a possibility depending on how this fella fares in robes. That depends on the environment and whether hasted items are available more than anything else.  I rated my domain preference at (1) haste, (2) 50% conceal &amp; (3) +7 max DEX boost (with Strength as the only essential domain).<br/>\n<br/>\nI realize how NWN has decided to implement kamas, but IMHO, bladed weapons are inappropriate for a secular monk, without oriental ancestry, who is trained for defensive arts in the friary (maybe a staff or club, but please, no bladed weapons for an actual battle priest).  But that was their choice, not mine.<br/>\n<br/>\nSo, the bottom line is, I like the Monk 11/Cleric 15 version and am testing it now with my regular LAN partners so will see how well it performs.  So far, so good. <br/>\n<br/>\nI am pleased you took the time out to chastise me, 'ol friend.  If you hadn't, I would have suspected you were holding a grudge of some sort. <br/>\n<br/>\nP.S.  Is the monk attack progression lost if wearing armor or just the speed and AC?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:37 AM - Aug 07, 2011",
      "content": "<div>Hey Hip,<br/>\n<br/>\nI didn't have any time to read the background, so no, I didn't know what you meant. And for me anyway the background comes after the build, for the most part.<br/>\n<br/>\nThere are a few flaws in your reasoning, mostly misinformation. The most important one is that Unarmed Strike IS FINESSEABLE! Maybe now you will be able to make him a Dexer. That alone would drastically improve your build. About the Monk attack schedule, I honestly don't remember and am too lazy to test that now. You should consider taking the War domain, as it gives Cat's Grace Aura of Vitality as a lvl 7 spell if stats are hard to max out. Then you would also be able to do without Defensive Stance by equipping a perma-haste item and some Monk boots.<br/>\n<br/>\nHigh Cleric builds are abundant, as you said, for good reason. They rely on buffs a lot, so being undispellable is a great thing for them, besides, more spells and higher durations will only add to their power. A 20% XP penalty isn't that bad, perhaps you will need to solo after a heavy day of party play to get one level, two tops if the adventure is long and catch up to your party-mates. Or you could be a good friend and play on WoG with me and I'll have one of my XP Penalty builds wait for you so we can level together <br/>\n<br/>\nAnyway, if I were making something like this, I'd go Cleric 16 / Monk 10 / DwD 14 and definitely a Dex-build. This would cap your Divine Favor, Magic Vestment and GMW, which in this case is irrelevant, as he is unarmed. Making a Cleric-Monk based on strength can be a painful experience, since you run into a lot of mutually exclusive choices. Think about it at least <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:40 AM - Aug 08, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nThere are a few flaws in your reasoning, mostly misinformation. The most important one is that Unarmed Strike IS FINESSEABLE! Maybe now you will be able to make him a Dexer. That alone would drastically improve your build. About the Monk attack schedule, I honestly don't remember and am too lazy to test that now. You should consider taking the War domain, as it gives Cat's Grace Aura of Vitality as a lvl 7 spell if stats are hard to max out. Then you would also be able to do without Defensive Stance by equipping a perma-haste item and some Monk boots.\n</div></blockquote>\nThat blows my mind, Max! And for a mind that has been subject to the forces of entropy for so long, that is quite a feat (no pun intended  ).<br/>\n<br/>\nI had been under the impression that unarmed was not considered an actual weapon as far as NWN was concerned and therefore could not be finessed.  Checking the wiki concurs your claim not that it needs confirmation, just didn't know how I could have missed that before.<br/>\n<br/>\nThe reason for my misconception is based on the prereqs for Weapon Master.  WM doesn't consider unarmed a weapon so does not qualify for Weapon of Choice, hence a pure brawler can never be a WM... an inconsistency that I have always felt is unsubstantiated by reality.  Ask any martial artist if they consider their hands deadly weapons or just consult a court of law.  They SHOULD be considered weapons just as anything that can be gripped.<br/>\n<br/>\nSo now I am headed to revamp this as a weanie Dexer, but there are lots of possibilities there (other than WM) with the divine support to bolster the damage. Send me the bill for your expert consultation and the check will be in the mail to Brazil forthwith. <br/>\n<br/>\nUdaman, Max!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:35 AM - Aug 09, 2011",
      "content": "<div>Hip, you are a character! LOL<br/>\n<br/>\nAs for the misconception, it's perfectly understandable as it's called WEAPON finesse. You can only naturally presume the feat involves a weapon. Well, now about the build itself, I have 2 Dex-based Cleric Monks, and was working on a 3rd one, but stopped due to the lack of time. Here are the three I have for you to have an idea:<br/>\n<br/>\nCleric 15 Wizard 23 Monk 2 - Has nearly all the spells in the game, including Time Stop, IGMS, Harm and still gets Epic Warding, Epic Mage Armor, 72 AC and 57 AB with dual-wield Kamas and Flurry of Blows (10 APR). 59 AB just dual-wielding and 61 if only 1 Kama equipped. That one wasnt posted in the old guild because there was one nearly identical to it).<br/>\n<br/>\nCleric 26 Monk 9 SD 5 - The Shadow Priest build. That one I posted and referenced to in the guide I wrote, which was how we met IIRC. Undispellable, 71 AC, 63 AB, Epic Dodge, but low spell dcs in general so mostly for melee combat through buffs and tanking through ED and 50% Concealment from Improved Invisibility. Also has the stealth skills maxed out and HiPS, combined with Monk Speed to run if it can't tank.<br/>\n<br/>\nCleric 26 Rogue 13 Monk 1 - This is the one I was working on, but had to stop, Basically it gets Epic Dodge as well, but it doesnt have HiPS, instead it has Sneak Attack, but has XP penalty the moment you take that Monk level.<br/>\n<br/>\nOther Dex-based Cleric-Monks that I know of are Mith's Fighter 4 Monk 6 Cleric 30, dual-kamas with WS and EWS in them, Cleric 29 Monk 2 Ranger 9 (or any other alternative spread with at least 15 of Cleric and 9 of Ranger for Dual-Wield Kamas + buffs, 15-15-10 would also work but would be dispellable), Cleric 26 Monk 6 CoT 8 (Now that I think of it I made one of these for a friend of mine at a Brazilian PW, but I never played it myself), Also there is one more Monk-heavy that I don't remember exactly, but I think goes Monk 20 Cleric 15 SD 5 and also gets ED. In that one, the Cleric is taken for buffs only, it fights unarmed and is dispellable, but runs like hell and can rebuff at will. Also there is yet another build I made which takes this combination in a different way, Cleric 38 Monk 1 Rogue 1, my max-wisdom high Implosion-dc Cleric Zen Archer, which I believe you have stored somewhere in your PC or e-mailbox, but I need to rework it somehow to fit in a couple of feats... OH! Now that I Think of it, Kail's Order of Jormungandr build, which since redone to be made legal again has become Cleric 20 Monk 2 Druid 18: this is a dual-caster, high-DC, self-buffing, Dragon-shifting, zen-archer meanie. You can go Cleric 26 Monk 7 WM 7 and get critical enhancements for your Kama, but then youd have to drop dual-wield cuz not enough feats.<br/>\n<br/>\nSo just some food for thought as to the many possible ways to combine this combo with some other good stuff to make some even better stuff . I may have forgotten something, in fact I probably did, but still these are enough examples, I presume to make you think how pathetically overpowered this combo is. There are many ways to build a Cleric Monk, and basically, whatever you combine it with BESIDES Dwarven Defender (sorry, but it's true ) will make it much more powerful.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:55 AM - Aug 09, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nCleric 26 Monk 9 SD 5 - The Shadow Priest build. That one I posted and referenced to in the guide I wrote, which was how we met IIRC. Undispellable, 71 AC, 63 AB, Epic Dodge, but low spell dcs in general so mostly for melee combat through buffs and tanking through ED and 50% Concealment from Improved Invisibility. Also has the stealth skills maxed out and HiPS, combined with Monk Speed to run if it can't tank.</div></blockquote>\nActually, I am pasting one together right now that is very similar but without the ED.  (If I get a chance to max UMD, I do it!  )<br/>\n<br/>\nI didn't realize you could take ED on the same level as when Defensive Roll occurred, figuring one needed 6 levels of SD rather than 5 to get it, so now I must cram that tidbit of info into an otherwise finite receptacle, my skull.  *reaching for the crowbar*<br/>\n<br/>\nYour build is right there where you posted it about a year ago and I have used onion's suggestion of a halfling as a variant (by sheer coincidence... REALLY!).  It's similar but different, if you catch my meaning.  I have a personal bias against the redundancy of feats between monk &amp; SD just to \"buy\" ED so it didn't enter my consideration.  And going SD almost requires investing into maxed stealth skills for HiPS which I seldom use as a cleric (just keep a few GS's slotted for scouting and emergency escapes). But I do like that build, if I were going the SD route. <br/>\n<br/>\nDamn the DCs!  Fighters fight and clerics clerk and never the twain shall meet!  In my UMD version (hint) I would be looking to buy scrolls of Spell Breach from stores or passing arcanist scribes who are short on gold and amiable to trading with persons of disputable repute (another hint).<br/>\n<br/>\nAnyways, back to the task at hand...<br/>\n<br/>\nThanks for the boatload of suggestions, Max!  It will keep me occupied.</div>"
    }
  ]
}