{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "927",
  "name": "Opinions on lvl 30 Bard build intended for DnD Hardcore rules, solo (Swordflight module)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/opinions-on-lvl-30-bard-build-intended-for-dnd-har-t2354960.html",
  "author": "Luj1",
  "avatar": "no_avatar.png",
  "replies": "5",
  "views": "574",
  "posts": [
    {
      "author": "Luj1",
      "avatar": "no_avatar.png",
      "timestamp": "8:08 PM - Dec 22, 2018",
      "content": "<div>Okay so I'm not as proficient as you guys in building so forgive me for not coming up with a detailed plan. But this is what I had in mind.<br/>\n<br/>\n<br/>\n<blockquote><div>Human<br/>\nMale<br/>\nSmite-proof alignment (prolly Chaotic Neutral)<br/>\n<br/>\n2 Barbarian / 16 Bard / 12 Pale Master<br/>\n<br/>\nWhy 2 levels of Barbarian? Uncanny Dodge, Rage 1x day, proficiencies<br/>\nWhy Pale Master? Short answer - tankiness. Immunity to crits, lots of AC, HP<br/>\nWhy Bard? Good self-buffing from start to finish. Level 16 Song, Curse Song, Haste, Improved Invisibility, Keen, War Cry. Also class has solid saving throws<br/>\n<br/>\nStr - 16 till max<br/>\nDex - 8<br/>\nCon - 12<br/>\nInt - 14 (for some feats like Imp. Knockdown and to take many skills)<br/>\nWis - 8<br/>\nCha - 16<br/>\n<br/>\nPre-Epic Feats (8 total) - Luck of Heroes + Strong soul at first lvl (good saves), then Toughness (for HP), Still Spell, Curse Song, Knockdown, Improved Knockdown, Combat Casting<br/>\n<br/>\nEpic feats - Armor Skin (to stack AC to high levels), Epic Prowess (to make up for lost BAB), Automatic Still Spell (eventually)... dunno what else to pursue<br/>\n<br/>\nSkills - Perform, Tumble (in 5pt increments for the hidden AC bonus), Spellcraft (in 5pt increments for the hidden spell resistance), Use Magic Device, Discipline... want to get Persuasion too</div></blockquote>\n\nBasically my intention was getting Imp. Invis + Haste + Keen  on a mid-BAB class . Then Pale Master for more defense (I thought about RDD but that is more offensive).<br/>\n<br/>\nI opted for STR and not DEX cause this character will be defensively strong (I think) , but will maybe lack some damage <br/>\n<br/>\nI'd like to hear opinions on how to improve this build and finalize it <br/>\n<br/>\nAlso I had some questions:<br/>\n<br/>\n1. Do I really need Uncanny Dodge (which is why Im taking 2 levels of Barb)? I am not a dex fighter and Uncanny dodge doesnt help with retaining Dodge AC and Tumble bonuses right? Is there no way to retain those?<br/>\n<br/>\n2. Generally I am a little clueless which pre-epic feats to take. Do I need any of these: Combat Casting, Expertise, Improved Initiative, Blind fight? And do I need concentration skill?<br/>\n<br/>\n<br/>\nPS In case you were wondering Swordflight is a module balanced for D&amp;D Hardcore Rules and implements severe rest restrictions</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:29 PM - Dec 22, 2018",
      "content": "<div>Ten levels of RDD does give +4 AC, so it is not purely offense, and you get better BAB than Pale Master. If you make a Bard 16 / Barbarian 4 / RDD 10, and if you follow the rule of 4, you will get your 4th attack.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:03 PM - Dec 22, 2018",
      "content": "<div>I'm in no way qualified to comment on PM builds, but I totally get what Empyre says about RDD (assuming you only want PM for the AC bonus).<br/>\n<br/>\nAs to your questions: you don't lose your Tumble bonus, no matter what it always adds to your AC. And yes, Blind Fight is almost obligatory. You're also lacking in a Weapon Focus (and EWF), which may be a character choice, but if you're going Strength might be questioned. I'm not sure whether you want a primarily spell-chucker or melee type here. If melee, I'd drop Charisma down (and maybe some levels of Bard) and boost other areas - relying on the Song(s) for buffs and penalties. If not, drop Strength if you don't intend to be up front and personal.<br/>\n<br/>\nMy understanding is that Swordflight is particularly favoured to melee builds - especially at early levels - if that helps at all. Might be worth a think.<br/>\n<br/>\nCheers!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Luj1",
      "avatar": "no_avatar.png",
      "timestamp": "7:35 AM - Dec 23, 2018",
      "content": "<div>In the end I decided to go with 12 Bard / 10 RDD / 10 Pale Master </div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:24 PM - Dec 23, 2018",
      "content": "<div>From my understanding, based on some reviews from Lilura &amp; from the Vault, <br/>\nwith such a build you run the risk of making this a battle of the '20s.  The main enemies in Swordflight have a competent AC unlike what you are used seeing in other modules. <br/>\nOptimally, you also need a build that is optimized for level 26-27 and not 30, as this is what you end up in the third module.<br/>\nIn my opinion, you should seek a build that is either Fighter-Bard-Palemaster OR Fighter-Bard-RDD, with a shield of course. <br/>\nThe other option is a Fighter-Rogue-Weapon Master &amp; dispatch them before they become a nuisance.<br/>\nHave fun.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:38 PM - Dec 23, 2018",
      "content": "<div>Why don't you post your build/draft so we can comment on it and help you improve it?<br/>\n<br/>\nFrom what you have posted so far: I would take Armor proficiency heavy, and a weapon focus + epic weapon focus. I would drop combat casting. Still spell, and the saves feats are nice to have, but not a \"must\" with this kind of build. With a starting dex of 8, you don't need uncanny dodge. You have choosen some essential skills. Taunt is also a fine combat skill.<br/>\nI agree with taking RDD. If you take PM, you must find a way to secure a high enough AB.<br/>\n<br/>\nEdit: For Auto still one needs the ability to cast level 9 spells. Bards only get level 6 spells.</div>",
      "author-color": "#AA0000"
    }
  ]
}