{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "857",
  "name": "Fallen Paladin with 10 attacks (ie Paladin 12 / Monk 2-6 / Blackguard 22-26) - concept only",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/fallen-paladin-with-10-attacks-ie-paladin-12-monk--t2355076.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "13",
  "views": "376",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:50 PM - Jun 15, 2019",
      "content": "<div>Hey guys<br/>\n<br/>\nAs previously mentioned i'm kinda excited by 10 attack builds. I'm also excited by builds which haven't been done before, that have significant variety (ie not just clicking and killing) and really tests the limits of the game's DnD 3rd edition rules. <br/>\n<br/>\nHence right now I'm very interested in creating a Fallen Paladin build (think Aribeth de Tylmarande) except you dual Kamas with improved two weapon fighting (ITWF) and minor class Monk.<br/>\n<br/>\nI'm also interested in it being either mixed strength / charisma based, or mostly charisma based to take advantage of having both divine grace and dark blessing plus eagle splendor / Aura of Glory to further buff up your saving throws (I'm totally up for +20 to all saving throws) / DM / Divine Shield and did I mention Monk evasion as well for reflex saves. If I wanted to go totally crazy about saves then I could go Paladin / CoT / Blackguard, but as mentioned, I have a weakness for 10 attack / round builds even if such builds force you to pump dex a little and use up 3 feats and to be honest I'm already pretty happy if all my saves are sitting around 50.<br/>\n<br/>\nIt's also a M. A. D. build (multi attribute dependent) in that you will want good scores in Strength, Dexterity (for ITWF), Constitution, Wisdom and Charisma, and the buffs you have on hand (Bull's Strength, Eagle's Splendor, Aura of Glory, and in Aielund I think you also get Endurance) will help but this is definitely not going to be one of those builds where you run around with crazy stat scores such as Strength 40.<br/>\n<br/>\nIt's also kind of exciting because your weapon style gradually evolves over time. You can start out as a heavy plate / sword and shield, then go single Kama / monk robes when you take your first Monk level when you are in the process of becoming evil, then dual Kama once you get ambidexterity then improved two weapon fighting. You can also switch back to Kama / Shield / Heavy Plate if you want the extra AC, and you dont have good monk robes but if you want to output significant damage you will want to take the armor off and put your robes on.<br/>\n<br/>\nSkills wise I'm interested in Discipline, Heal, Tumble and Persuade (I've noted there are sometimes huge bonuses for passing persuade checks in Aielund? and obviously persuade is great during the main NWN campaign). To manage these adequately I'd want Human and Int 12 (+1) for skill points / level<br/>\n<br/>\nThe main thing that has been putting me off is the alignment shift from Lawful Good to Lawful Evil, which aside from the number of potential atrocities one might have to commit to achieve this outcome is the fear that modules may not actually allow such a large change for this to be possible. But I get the feeling it is easier to be become evil than it is to become good?<br/>\n<br/>\nI thought I could use the last Paladin level and a few Monk levels to become evil. I've given a range just in case it takes longer, but the less Monk levels you take, the better your BAB and the more your 10 attacks hit. I'm not sure its worth taking Monk to 6 just to get the free knockdown and improved knockdown feats as you lose a bit of BAB. You will want a Tumble dump around 36 to get Tumble 40 for +8 AC plus the ability to run around where you want in combat.<br/>\n<br/>\nI want to play a significant part of the modules as evil but not heavily nerf the Paladin spell strength such as Divine Favor so I felt Paladin 12 / Monk 2-6 / Blackguard 22-26 would be a nice balance, you get lvl 3 spells and Divine Favor +4. You would take your first Monk level at character level 13 and make your first tumble dump for a nice +3AC and your +5 to hide for prerequisite for blackguard. I think you pretty much play end of Aielund Act 2, Act 3 and Act 4 pt1, Act 4 Pt2 and Act 4 Pt3 as a Fallen Paladin.<br/>\n<br/>\nAnyway I was wondering if any of you guys had any experience of managing big alignment changes such as this. I'm about to start an Aielund run through Act 1 to Act 4 pt 3 with a build and I will let you know of the results<br/>\n<br/>\nI've read TyrTemplar's build (<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build244612.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 44612.html</a> - Monk 9 / Paladin 15 / Blackguard 16) which was posted an incredible 13 years ago, which aside from wielding a single longsword (which doesn't make sense as a Monk?), wants you to make this huge alignment change at level 16 to go from Paladin to Blackguard. I also wanted to mention I noted Mick Dagger for commented on that post way back then regarding potential improvements!<br/>\n<br/>\nAnyway that was the only P/M/B build I could find. I couldnt find any others on Google.<br/>\n<br/>\nAnyway I will try to follow guidelines:<br/>\n<br/>\n1) PvM<br/>\n<br/>\n2) Level cap - 40<br/>\n<br/>\n3) Race preference - Human<br/>\n<br/>\n4) Class preference - Paladin 12 / Monk 2-6 / Blackguard 22-26<br/>\n<br/>\n5) Melee preference - Initially longsword or scimitar / shield  with heavy plate, then single Kama when monk obtained, then dual Kama with ambidexterity/improved two weapon fighting which with flurry of blows + haste = 10 attacks. Epic Vrock summon please! :)<br/>\n<br/>\n6) Range preference - None<br/>\n<br/>\n7) Weapon preference - Kama<br/>\n<br/>\n8) Maximum item enhancement - +7 - Act 4 pt 3<br/>\n<br/>\n9) Spellcasting - Buffs such as Divine Favor, Bull's Strength, Eagle's Splendor, Aura of Glory, Aid, Magic Circle against Alignment, Divine Might and Divine Shield. If you want lvl 4 spells u need to use scrolls.<br/>\n<br/>\n10) Custom factors - NWN main campaign, NWN HoTU, Aielund (ie no dev crit, nerfs to GMW, Darkfire etc)<br/>\n<br/>\nAnyway Hopefully I can give you an update soon how i go!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:48 PM - Jun 15, 2019",
      "content": "<div>Hi Orion.<br/>\n<br/>\nI admit to struggling with the propriety of alignment shifts - not just on ethical grounds, but also because surely once you swap from one to another you lose all the benefits gleaned from the first if they are alignment specific. So I'm probably not going to be terribly helpful here.<br/>\n<br/>\nI did come across another Aribeth build using Hip's filter. Admittedly, it's not got any Monk, being A Pally/ BG/ CoT - but I'll give you the link if you're interested in having a look: it's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/aribeth-paladin-26-blackguard-4-cot-10-t2269104.html\" rel=\"noreferrer\" target=\"_blank\">Aribeth</a><br/>\n<br/>\nI wish you well with your endeavours!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:37 AM - Jun 16, 2019",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>\nHi Orion.<br/>\n<br/>\nI admit to struggling with the propriety of alignment shifts - not just on ethical grounds, but also because surely once you swap from one to another you lose all the benefits gleaned from the first if they are alignment specific. So I'm probably not going to be terribly helpful here.<br/>\n<br/>\nI did come across another Aribeth build using Hip's filter. Admittedly, it's not got any Monk, being A Pally/ BG/ CoT - but I'll give you the link if you're interested in having a look: it's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/aribeth-paladin-26-blackguard-4-cot-10-t2269104.html\" rel=\"noreferrer\" target=\"_blank\">Aribeth</a><br/>\n<br/>\nI wish you well with your endeavours!\n</div></blockquote>\n\nThanks so much for your message. <br/>\n<br/>\nRE losing class abilities on alignment shifts - I agree a Paladin who becomes Evil should lose at least some of the powers of Goodness but the NWN1 rules allow you to retain your abilities. So I have this interesting situation where I will have things like Divine Grace/ Dark Blessing, Smite Good /Smite Evil, Protect against Good/Protect against Evil abilities in the same player character. I find this totally fascinating. I want to push the rules to the limits, if I can.<br/>\n<br/>\n<em>RE: Paladin/Blackguard builds</em><br/>\nI've seen a few Paladin / BG / CoT builds running around, another common choice I've seen is Paladin / Fighter / Blackguard. <br/>\n<br/>\nI've seen some discussion about stuff like Paladin / Ranger / Blackguard but I think ranger is best as a primary class as you benefit from high levels. I wouldn't recommend that<br/>\n<br/>\nI think Paladin / Cleric / Blackguard is probably really good if you take the Trickery Domain. Cleric / Blackguard is really strong, and I've posted a C/M/B build before. It allows you to cast invisibility a few times a day plus other buffs such as Dark Fire which is super fun against enemies who are vulnerable to sneak attacks. For those of you wanting to get a minor class for stealth abilities, I would say one of the best choices is Cleric with Trickery. You can cast invisibility multiple times a day, you have the find traps spell and you don't bother spending 80-90 skill points in Hide and Move Silently and getting hide in plain sight with shadowdancer. <br/>\n<br/>\nMaximllian Kane's P/B/CoT build is kind of a 'Redeemed' Aribeth which I'm totally fine with. You have to go from LG to LE then LG again which may be manageable. It's kind of a Paladin with Blackguard levels are  there for  Bull Strength and Dark Blessing saves. I really like the fact he chooses to pump charisma in his build and only take two levels in strength which to be honest, which is valuable to help with weight management of heavy armor and a tower shield. I personally think he should consider using some of the CoT levels to manage his transition from LG -&gt; LN -&gt; LE -&gt; LN -&gt; LE which is a lot of alignment shifting to do. He lists the saving throws (F/R/W) as 46/39/38 but really if your character has Eagle Splendor and Aura of Glory active and one charisma item, you would be look at saves around 55-60 / 50-55 / 50-55 which is ridiculously high<br/>\n<br/>\nMonk is kinda great to multiclass with Blackguard because you nearly get all the prerequisites for the Blackguard Class (Hide +5 as class skill and free cleave feat) with a single level at character level 2 or later.<br/>\n<br/>\nI think get a large amount of the benefits from the Blackguard class by getting pretty high levels to get high sneak attack values and to strengthen your summon fiend. I think a nice sweet spot for blackguard is level 25, as you can use one of your bonus epic feats for additional sneak attack damage. The Epic Vrock always seems to be relevant as well if you pump up your blackguard levels. The Blackguard abilities that are somewhat not useful are inflict wounds (they are melee range abilities that take into account their AC, you may as well just hit them) and contagion which conceptually is interesting but not particularly strong PvM.<br/>\n<br/>\n<em>RE Alignment shift update + information on the wiki - it is easier than it seems, to become evil</em><br/>\nI'm one quarter the way through Aielund part 1. running around with a scimitar +1 and short sword +1 and a masterwork full plate at level 4 with hardcore DnD rules and two companions I've also clad in full plate. I've given Dante a great sword +1 to take advantage of his high ish strength. It's a pain not having Bull's Strength, because things are simply so heavy. Chose nearly all the evil dialogue options (there were some evil things I just did not want to do and I didn't need to as I dont want to shift just yet), and I've got my alignment down from 85 to 74. So far so good actually (what a play on words). You stop being good when you are below 70, so for now I'm happy not to drop it too low for now as I want more paladin levels for now. The only big problem I've encountered was one enemy getting a lucky critical hit wielding a greatsword on Nellise, which led to her instant demise (but it could have also happened to the player character) and I can see why the default difficulty disables critical hits on player characters.<br/>\n<br/>\nOne thing I've learned from the nwn wiki regarding alignment shifts is that once your alignment shifts, the new alignment value sits in the center of the range. So the alignment shift may actually be easier than I think.<br/>\n<br/>\nFor example if I change from good to neutral, when my alignment drops below 70 whether it be by 1 point or 10 points, its new value becomes 50. So to go from good (85) to evil (30), you only really need to shift your alignment 16 points to get to neutral, then a further 20 points to become evil. So really it is only a 36 alignment point shift, not 55 points. This is much more manageable than I thought.<br/>\n<br/>\nAnyway I will let you know how I go!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:29 AM - Jun 16, 2019",
      "content": "<div>Thanks, Orion. I'll confess that I've only successfully played one evil character, and that was Mick's Kama-Shinobi (a d-w Monk/ SD/ Ass) - also in Aielund, as it happens.<br/>\n<br/>\nAnd Monk is my single favourite class - in all its guises - as you'll discover the more of my drivel you read.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:34 AM - Jun 16, 2019",
      "content": "<div>Great to hear Monk is your favourite class! <br/>\n<br/>\nJust curious what your thoughts are on Monk / Red Dragon Disciple builds? Maybe they can dual kama with ITWF for those sweet 9 attacks with a huge strength stat :) (I know I know)<br/>\n<br/>\nI've been trying to find ways to incorporate the two together. You would have to take Bard or Sorcerer. The best builds I can think of are primary class monk with a single level of sorcerer and 10 of RDD (which means any buffs you want would have to come from scrolls or wands, true strike is really good though! and at least you don't have to rely on a alignment shift), or a primary class bard who starts with 4 levels of monk, becomes 'fallen' by shifting from lawful to neutral, then 10 of RDD. <br/>\n<br/>\nI get the feeling that primary bard would be stronger if you dual kama, because you get the Keen spell, other buffs like ethereal visage, Bull Strength, Mage Armor, Cat's Grace, Owl's Wisdom, Bard Song, Curse Song and Lasting inspiration (100 round duration songs????) which sounds really strong. Obviously this is not possible in the official NWN campaign as it doesn't allow alignment shifts from lawful to chaotic and back. <br/>\n<br/>\nIt is super easy to do in Aielund Act 1 however to become a fallen monk. You can shift your alignment towards chaos 16 points to get from Lawful to Neutral by level 4 through conversation dialogues, breaking and entering a particular house (about 6 points shift towards chaos), and taking treasures from four sarcophaguses (I think the pleural is sarcophagi?) which is another 8 chaos points.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:33 AM - Jun 16, 2019",
      "content": "<div>As far as Monk/ RDD builds are concerned, Empyre is the master, and may well wish to wade in here. I know that his Order of the Wyrm is my go-to build when going somewhere for the first time, and it's never let me down.<br/>\n<br/>\nI know he's updated and had different versions of it over time, but below is a link to my first encounters with the build, which are still the ones I use (modified if Dev Crit is disabled), from December 2014, when I was only a month into both the guild and the game. Empyre's builds can be found at the bottom of page 1 and the top of page 2, if you don't want to wade through heaps of my naive warblings. One is Unarmed, the other a d-w Kama build.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/singing-monk-with-maybe-some-dragon-blood-t2354358.html\" rel=\"noreferrer\" target=\"_blank\">Order of the Wyrm</a></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:41 PM - Jun 16, 2019",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>\nAs far as Monk/ RDD builds are concerned, Empyre is the master, and may well wish to wade in here. I know that his Order of the Wyrm is my go-to build when going somewhere for the first time, and it's never let me down.<br/>\n<br/>\nI know he's updated and had different versions of it over time, but below is a link to my first encounters with the build, which are still the ones I use (modified if Dev Crit is disabled), from December 2014, when I was only a month into both the guild and the game. Empyre's builds can be found at the bottom of page 1 and the top of page 2, if you don't want to wade through heaps of my naive warblings. One is Unarmed, the other a d-w Kama build.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/singing-monk-with-maybe-some-dragon-blood-t2354358.html\" rel=\"noreferrer\" target=\"_blank\">Order of the Wyrm</a>\n</div></blockquote>\n\nThanks for that link. I gained a lot by reading through it!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:15 AM - Jun 17, 2019",
      "content": "<div>I am glad that I could help, albeit indirectly.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:39 AM - Jun 17, 2019",
      "content": "<div><blockquote><div><cite>Empyre65 wrote:</cite>\nI am glad that I could help, albeit indirectly.\n</div></blockquote>\nYou are one of many on this forum who have left a lasting legacy!<br/>\n<br/>\nI will share something else I learnt while going through my play through and researching. I'm near the end of Act 1 of Aielund, lvl 7 paladin, using a short sword and shield / heavy plate.<br/>\n<br/>\nDark Blessing and Divine Grace stack, however the maximum bonus one can get on saves is +20. (<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Saving_throw_advice\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Saving_throw_advice</a>)<br/>\nThat means the highest I will ever want to go on a 'Fallen Paladin' / Blackguard build with a buffed charisma modifier is 10, which is 30 charisma<br/>\nIf I reach the maximum ability buff with Aura of Glory / Eagle's Splendor and charisma items, which is +12, then a reasonable time to stop pumping charisma would be a base number of 18 and put the rest in Strength.<br/>\n<br/>\nI'm also amazed that Bull Strength from Blackguard and Bull Strength from Spells stack, and I honestly did not know that!<br/>\n<br/>\nAlso regarding optimizing the build, I need to consider pumping either Taunt or Concentration skills (to protect against Taunt). -6 AC might mean a +30% increased chance to hit / to be hit, if your AC/Attack are in satisfactory ranges. My preference would be to go for Taunt, as I do want those 10 attacks to hit more often. It might mean I have to ditch Heal or Persuade, or get Int 14. Anyway I will have a think about it</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:59 AM - Jun 17, 2019",
      "content": "<div>I've another link for you, Orion!<br/>\n<br/>\nI don't know if you're taking Expertise in this build, but Max has a nice little trick to combine Taunt and Expertise to great effect. It's at point 7 in the link, if you're interested - though the whole thing is worth the read.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/playing-better-the-importance-of-knowledge-and-int-t2354384.html\" rel=\"noreferrer\" target=\"_blank\">Playing Better</a></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:26 PM - Jun 17, 2019",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>\nI've another link for you, Orion!<br/>\n<br/>\nI don't know if you're taking Expertise in this build, but Max has a nice little trick to combine Taunt and Expertise to great effect. It's at point 7 in the link, if you're interested - though the whole thing is worth the read.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/playing-better-the-importance-of-knowledge-and-int-t2354384.html\" rel=\"noreferrer\" target=\"_blank\">Playing Better</a>\n</div></blockquote>\n\nThanks for your link, I did read Max's post earlier today before when I was searching for stuff on Taunt, but it was great to read it all again. it covered a lot of material and sometimes one has to re-read things a few times to get it to absorb!<br/>\nIf I do go for the Max's Taunt / Expertise method im gonna want Int 14 for my build which sadly means another CONS 8 build (i guess it can be worked around with buffs)</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:06 PM - Jun 17, 2019",
      "content": "<div><blockquote><div><cite>Orion2019 wrote:</cite>\nDark Blessing and Divine Grace stack, however the maximum bonus one can get on saves is +20. (<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Saving_throw_advice\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Saving_throw_advice</a>)\n</div></blockquote>\nThe charisma based saves bonus from Dark Blessing and Divine Grace (BG and Paladin) do not count toward the +20 cap on saves, whereas the saves bonus from Sacred Defence (CoT) does.<br/>\nThe text on the wiki page you link to is perhaps not completely clear on this.  But Dark Blessing and Divine Grace are listed among feats that add to the saves without counting towards the cap. And for Sacred Defence it is specified that it does count towards the cap.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:53 PM - Jun 17, 2019",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote:</cite>\n<blockquote><div><cite>Orion2019 wrote:</cite>\nDark Blessing and Divine Grace stack, however the maximum bonus one can get on saves is +20. (<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Saving_throw_advice\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Saving_throw_advice</a>)\n</div></blockquote>\nThe charisma based saves bonus from Dark Blessing and Divine Grace (BG and Paladin) do not count toward the +20 cap on saves, whereas the saves bonus from Sacred Defence (CoT) does.<br/>\nThe text on the wiki page you link to in perhaps not completely clear on this.  But Dark Blessing and Divine Grace are listed among feats that add to the saves without counting towards the cap. And for Sacred Defence it is specified that it does count towards the cap.\n</div></blockquote>\n\nThanks  for clarifying that! I clearly got confused reading the wiki, but now I re-read it, it talks about 'non capped feats'. Duh!<br/>\n<br/>\nSo yes lets buff Charisma all the way folks!<br/>\n<br/>\nOn a separate note I have found taunt really good for a paladin / charisma type build by the way. Just helps so much with hitting things, especially with the AB penalties with dual wielding. Going through Act II Aielund now with a lvl 9 paladin, ITWF and Divine Favour. Pretty nice to have 4 attacks with +8  damage buffs  (3 from DF, 5 from DM) on every hit.<br/>\nMax's tip to always carry a ranged weapon was solid gold as well. although one can manage without it in Aielund, it made the boss fight in Act 1 quite a bit easier. You can harass them, and get them to come to you and kill them off bit by bit. Sort of like when I played Diablo 1 and 2, you dont really want to charge in and get mobbed. It never occurred to me how easy the official NWN campaigns were and what bad habits I had developed.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:14 PM - Jun 18, 2019",
      "content": "<div>Just another brief update - have got to lvl 12 paladin on Aielund. Have shifted from lawful good to Lawful neutral (42)<br/>\n<br/>\nI have purposely only shifted my alignment through conversation options. Any alignment shift to evil can be accelerated by killing 'commoners' but this is not in line with my own ethics as a player, and it looks like I dont need to do it as im only 12 points away from lawful evil.<br/>\n<br/>\nWhen I finish my build I will put a section on how to get to LE on aielund</div>"
    }
  ]
}