{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "308",
  "name": "30 lvl TwoBladedSword Challenge for Amia",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/30-lvl-twobladedsword-challenge-for-amia-t2354262.html",
  "author": "Bloodedblade",
  "avatar": "10235235_1549015559.jpg",
  "replies": 14,
  "posts": [
    {
      "author": "Bloodedblade",
      "avatar": "no_avatar.png",
      "timestamp": "6:46 AM - Jun 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Alright I tried to find this forum on my old link and almost panicked when it was gone.   Thanking the NWN gods I found you all once more especially with this challenge I've in mind.  I've recently been reading up on how worthless Twobladed swords are.  I have never really tried them to be honest but have always thought they looked pretty wicked.   I know there are obvious downsides the loss of shield and ac and the minuses to ab as well.  Still there is something about them I don't know maybe I have seen Darth Maul too many times but they are something I want to give a shot.   This is a definite challenge for the wizards that reside here I believe because most say there is no way to make a useful build with them.  I would suppose going ranger for the free feats would make the most sense and I have no qualms with that at all.  In Amia they have capped all the armors at 9 now so you can get plate mail type ac for the most part if you can hit the dex so the medium armor is not a concern.  I have no real idea on what the classes should be something with a tumble dump and umd or evasion mayhap would be very useful other then that fighter or weapon master?  I usually play a human but I don't mind elves if that makes a difference.  I guess what I am looking for is something that can lay down some smack and be as survivable as possible with the all the concessions one has to make with this weapon with regards to armor class.  The extra attacks might make up for the ac loss by mowing things down quickly before they hit me is all I can come up with.  I don't know if it is possible in 30 lvls or at all but I do know if it is this is place to find out.  I don't want to sound overly confident but if I am its because the builders here proven it time and time again so you have no one to blame but yourselves for my  blind faith.  Thanks in advance for any help that can be given I know this one is going to be a hard one.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Bloodedblade",
      "avatar": "no_avatar.png",
      "timestamp": "9:54 PM - Jun 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Wow I can't believe no one has anything so far.  Seems there is something to the argument of there being no use for the twobladed sword after all sadly.  Well its still early so keeping my fingers crossed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:42 PM - Jun 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Fear not Bloodblade for you will have your Darth Maul soon, it is just that these boards have seen a considerable decrease in traffic these past few weeks (maybe the forum alteration \"helped\" with that as well), so answers are delayed a bit. Now, as far as your dual-sword build request goes my best bet would be a human (Ftr 10/ Bard 4/ Wm 16) based on your needs for UMD plus Full Tumble Ranks and as an extra you will be able to max out your spellcraft as well which i consider more important than evasion unless we are talking for more than a handfull of Rogue levels. Go with a starting ability spread of (Str 16 Dex 15 Con 14 Int 14 Wis 08 Cha 08) and wear a full plate, no need for Roguish armour with that build. Don't forget to craft your dual-sword like a light-saber and use wands for the \"force effects\" <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Bloodedblade",
      "avatar": "no_avatar.png",
      "timestamp": "2:17 AM - Jun 11, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the input its quite valuable.  Your probably right about the forum changing links it threw me for a loop.  I was thinking ranger because I wasn't sure about the number feats needed to pull this off.  I was messing around with the ranger idea but with light armor required the ac is absolutely horrendous not that its going to be off the charts either way but wow it hurt.  I wish I was better at this kind of thing but thats why I'm grateful I found this place and folks like yourself.  I'll monkey around best I can but I fully admit I'm not the best in setting up the optimum.  Its a great start for me though and gets me going in the right direction thanks a bunch.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:57 PM - Jun 11, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Let me help you a bit more then, i don't have the time to do the exact build and format it in a nice post but i will give you the basics so you can start making him and see what you will get out of this dual-sword Wmaster. Remember this is but one way to make an efficient dual-wielder, there are more but i will focus on this one because playing a dual-wielder Wmaster is fun!<br/>\n<br/>\n So, start with first level as a human fighter so you don't have to start with a positive charisma score and set your abilities to Str 16  Dex 15  Con 14  Int 14  Wis 08  Cha 08. You will finish your pre-epic career as a (Fighter 7/ Bard 3/ Wmaster 10).<br/>\n<br/>\n The feats you will need to take are the following feats: Dodge, Mobility, Spring Attack, Whirlwind Attack, Expertise, Wproficiency Exotic, Wfocus Twin Sword, Icritical Twin Sword, Blind Fight, Ambidexterity, Two-Weapon Fighting, Improved Two-Weapon Fighting. As you see, you don't have much room pre-epic to get different feats so i take only the absolutely necessary and i will delay the Wspecialization to get it in Epics at the same time that i will take the Epic Wspecialization.<br/>\n<br/>\n Moving into Epic levels now, you will need the following feats: Epic  Wfocus: Twin Sword, Wspecialization &amp; Epic Wspecialization: Twin Sword (at 24th level), Armour Skin, Epic Prowess, Great Strength X3. You will finish this way as a (Fighter 10/ Bard 4/ Wmaster 16) and with a final Strength of 26. Your fnal AB will be a quite impressive 40 (38, while you dual-wield).  Your AC will be OK at least with the plate armour &amp; full tumble ranks and if you need more you can always activate Expertise for a nice +5 AC boost.       <br/>\n<br/>\n For skills, you better know the specifics of your server, but don't neglect to take the important ones like, discipline/ spellcraft/ tumble/ umd/ concentration &amp; you need to have 4 ranks in Intimidate before you attempt to take your first level as a Wmaster.<br/>\n<br/>\n And that's it man, i hope i helped a bit for now. As always ask whatever questions you may have about the build or another way of making your hero and we will be glad to help you.<br/>\n<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:46 PM - Jun 11, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Not a bad idea... but understand that a build using double-sided weapons will ALWAYS pale when compared to DWing two small weapons (like kukris, for example).  But apparently you have already resigned yourself to accepting the concessions, as extensive as they might be, but are seeking the aesthetics of the animation (sort of flies in the face of any ECB toon, really, but you are the customer <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />).  Nonetheless, the first questions that come to mind (understand that although I've helped with Amia builds in the past, having never played there before and lack the familiarity of the environment, the opinions of the regular players there are worth there weight in gold pieces where my own currency is more like Monopoly money) are...<br/>\n<br/>\n First... Keen.<br/>\n<br/>\n Is this a property that can be found readily on your weapon of choice?  If not, do merchants sell keen edge scrolls?<br/>\n<br/>\n #2... DevCrit.<br/>\n<br/>\n Does Amia allow DevCrit and if so does it operate as the default feat?<br/>\n<br/>\n #3... Are you comfortable with buffing up your toon to achieve elevated AB, AC &amp; damage levels or prefer to rely on innate boosts (class and feat)?  Keep in mind that buffs will usually stack with the innate combat levels you own.<br/>\n<br/>\n #Finally... besides the leveling restrictions of Amia (which I would need to reacquaint myself with to provide a usable build for that server), are you aware of any other class, race, feat or item restrictions that would influence the effectiveness of a melee build?  May as well provide full disclosure right up front rather than waste any more time &amp; effort than is necessary, right?<br/>\n<br/>\n Then, we can start getting serious.<br/>\n<br/>\n As far as WM goes, you are going to need loads of feats pre-epic (probably using fighter levels) to both prime your qualification for WM and enhance your DWing prowess.  You'll only need 7 WM levels, depending on your play style preference, but use that number as starting base.  IMO, a ranger build would be weak.  You'll get some more damage (depending on what you are attacking, naturally) but I believe you are going to need heavy plate without the option of a shield or at least without any buffing to help. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Bloodedblade",
      "avatar": "no_avatar.png",
      "timestamp": "1:50 AM - Jun 12, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I know as you stated concessions will be made for this weapon.  I guess I don't know how flawed this build will be if or survivability is at all achievable.  My hope at the very least is even if  he is easily hit he will deal out damage enough to take down his opponents before they drop him.  I really have no idea of what the potential output would be.  You asked about keen and it can be found on weapons in Amia and added to those that don't have it.  Dev crit has been altered so that it no longer kills on a failed fort save instead, it knocks down an opponent for x amount of rounds along with inflicting Blindness, Deafness and Silence for x turns.  X is determined by the weapons base critical hit range with • Large-sized weapon, 20 : 4 • Other sizes of weapons, 20 : 3 • 19-20 : 2 • 18-20 : 1 if that makes sense to you though it doesn't to me.  Things in Amia seem to spam dispell pretty regularly so I'm not sure how long a self buffer would have spells unless it was at a high lvl which doesn't seem possible with the feats required.  I hope I have answered what you need to aid me and its greatly appeciated indeed. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:26 AM - Jun 12, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The #1 most important factor is to have fun regardless of what is optimized or what is not. For instance, I love playing shifters myself, though they are usually under-powered wherever I play them. Go with what intrigues you, make changes you feel comfortable with if you deem them necessary and learn from your mistakes along with the rest of us. You'll know by level 10-15 whether the build is providing enough entertainment to be worth investing more time.<br/>\n<br/>\n Any suggestions I make herein would need to be tweaked to take advantage of Amia-specific races and customizations. That's your own responsibility. Try to understand what the build is trying to accomplish and improve it to work best on the particular server.\n<blockquote><div><strong>Bloodedblade wrote:</strong><hr/>I know as you stated concessions will be made for this weapon.  I guess I don't know how flawed this build will be if or survivability is at all achievable.  My hope at the very least is even if  he is easily hit he will deal out damage enough to take down his opponents before they drop him.  I really have no idea of what the potential output would be. </div></blockquote>\n\n Keep in mind that though a double-sword is a large weapon, you only get full STR mod for MH damage (not 150% like other large weapons) and 50% for OH, as if you were holding a medium weapon MH &amp; light (small) weapon OH. But the DWing penalties can all be avoided with ambidex &amp; 2-wpn fighting.\n<blockquote><div>\n You asked about keen and it can be found on weapons in Amia and added to those that don't have it. <br/>\n  </div></blockquote>\n Good. Then both ends will be keen with forging.\n<blockquote><div>\n Dev crit has been altered so that it no longer kills on a failed fort save instead, it knocks down an opponent for x amount of rounds along with inflicting Blindness, Deafness and Silence for x turns.  X is determined by the weapons base critical hit range with • Large-sized weapon, 20 : 4 • Other sizes of weapons, 20 : 3 • 19-20 : 2 • 18-20 : 1 if that makes sense to you though it doesn't to me. <br/>\n  </div></blockquote>\n If it doesn't have a chance to kill, DevCrit should be avoided then. Too many prereqs to make it worthwhile though it could certainly be built with enough fighter levels by level 30.\n<blockquote><div>\n Things in Amia seem to spam dispell pretty regularly so I'm not sure how long a self buffer would have spells unless it was at a high lvl which doesn't seem possible with the feats required.<br/>\n  </div></blockquote>\n I see. Can't really build a cleric/WM within 30 too well. I was concerned mainly about two issues: piercing DR and hasting. A battle cleric would have no problems with either. First off, magic and divine damage would even pierce Epic Warding where your huge physical damage would pretty much bounce off. Also, crits would multiply both those cleric damage types. Further, unless permahaste items are available, Travel domain would assure another full AB APR compared to a WM without haste (not to mention the +4 stackable AC intrinsic to the effect) and Divine Power yet another. Unfortunately, mantles won't prevent dispelling so you are correct that a high-level battle cleric would be needed to avoid most dispels. Clerics will reach buffed AB into the 50's which may be necessary to hit ACs over 35 regularly (like against DEXers or monk Wisdom builds) and enough free attacks to balance the lost +2 from ki critical range boost.   Like I said, I have no clue what item props are available on Amia.  Knowing that could significantly alter what class spread I would try to use.\n<blockquote><div>\n I hope I have answered what you need to aid me and its greatly appeciated indeed. </div></blockquote>\n Yup. I checked the Amia page briefly and it seems there are no leveling restrictions as per Arelith. That means single dumps are legit. Good to know.<br/>\n<br/>\n Valerfor's build suggestion seems pretty good to me. Ability spread looks about right. The only change I would make is to forgo 3 bard levels. They really buy you nothing but regular dump intervals at the cost of weakening the final build. Conspicuously missing from the feat schedule is KD/IKD. Big mistake against mages. All they need do is erect 3-layer damage shield and let you kill yourself against them (figure 7 magic + 33 fire + 64 acid on avg per hit for lvl 30 mage) unless there are items with enough resistance to absorb it all . IMO, the only strategy that stands a ghost of chance to succeed is to keep them on their backs until the the shields drop and prevent them from casting. It will take a while (up to 6 turns for high-level mage), but at least you can avoid taking Isaac missile damage or worse, like Bigby at the same time... while trying to heal from the reflected damage. Actually, dueling vs. other melee will become a similar stand-off... a KD spam battle. Disarm might be another option against melee vs. small weapon DWers, but the attack penalty is a nasty -5. IKD has no penalty vs. medium and a -4 vs. large opponents (you could end up dueling polymorphs at some point, I suppose). So KD/IKD will end up costing 1 AB and the build will look something like this:<br/>\n<br/>\n Ftr 13/WM 16/Brd 1, Human (choose: LN, TN or CN vs. any smiters)<br/>\n<br/>\n STR 16/24, DEX 15, CON 14, WIS 8, INT 14, CHA 8<br/>\n<br/>\n --&gt; All ability bumps to STR<br/>\n<br/>\n 1-12 (Ftr 1-12) - Expertise, WP Exotic, WF: 2-Blade Sword, Ambidexterity, 2-Wpn Ftg, Dodge, Mobility, Spring Attack, IC: 2-Blade Sword, Imp 2-Wpn Ftg, WW, BF, WS<br/>\n 13-20 (WM 1-8) - WoC, KD, IKD<br/>\n ----------<br/>\n 21-26 (WM 9-14) - EWF, ESkF: Discipline, Epic Prowess<br/>\n 27 (Ftr 13) - EWS<br/>\n 28,29 (WM 15,16) - Armor Skin<br/>\n 30: Brd 1 - Grt STR I<br/>\n<br/>\n HP: 356<br/>\n Saves (F/W/R) 17/10/17 (24/17/24 vs. spells)<br/>\n BAB: 25<br/>\n AB (max, naked): 39 (melee) (37 w/2-blade sword), 28 (ranged)<br/>\n AC (naked/mundane armor/shield only): 20/30<br/>\n Discipline 33(50), Intimidate 4(3), Spellcraft 33(35), Tumble 30(32), not yet allocated --&gt; 63 (if you expect to get taunted often, stick 33 into Conc)<br/>\n<br/>\n Comments:<br/>\n<br/>\n Epic feat order can be swapped around.  I tried to get WM 13 in ASAP for the +1 AB.  The fighter level can be thrown anywhere really.<br/>\n<br/>\n A viable alternative for ESF: Discipline (for better KD) might be --&gt; ESF: Spellcraft, for +2 saves to spells (saves on this toon are pretty lame atm). <br/>\n<br/>\n A dwarven variant of above will net an extra +2 saves vs. spells plus the racial beni.  If UMD ranks are allocated, remember to compensate for the -2 CHA.<br/>\n<em>Edit: Oh... and +30 HP (total 386) since it starts with CON 16.  I like the orc &amp; goblin attack bonuses as well, especially on a server with diverse subraces.  But dwarven beauty is in the eye of the beholder so it may not befit your tastes.</em><br/>\n<br/>\n If you are depending on regular Tumble, Spellcraft and UMD dumps to reach Lvl 30, feel free to water down the build to accomplish that goal.  If it is intended for PvP, it will gimp it down even further than the weapon choice itself.  Personally, I prefer to party if a solo build is relatively weak in the early going.  Depends on how much dueling you are intending to engage in or how much time in the most challenging areas of the server layout.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Bloodedblade",
      "avatar": "no_avatar.png",
      "timestamp": "12:24 AM - Jun 13, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks alot for the time and effort it took for this.  I'm gonna to plug this into my leveler and run it up and hit the arena to see how it fares.  I'd like to keep it one level bard like you recommend but it's hard to wait for that last level for tumble and the other goodies.  I prefer travelling with a party if one can be found.  This build probably won't be able .too solo regardless.  Do you feel it would at least be a comparable flanker by damage dealing to other fighter or weapon master types?  If he is going to soak up healing I want him to and to at least deal it out as well.  Thanks for all the help and info.  I'm very thankful I found this place and the people who are willing and able to aid the build handicapped.<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:03 AM - Jun 13, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">...download the <a class=\"postlink\" href=\"http://nwvault.ign.com/View.php?view=modules.Detail&amp;id=3717#Files\" rel=\"noreferrer\" target=\"_blank\">The Halls of Advanced Training Deluxe - HotU+SoU Edition</a> from the Vault. It is just a module so no prereqs except v1.69 patch is needed. It has leveling controls and testing areas. I use the one with the target dummies to debug combat actions and the other that spawns monsters of adjustable CR and total number before I post any build or try on a server. It even has a rogue testing area and PvP arena should you want to practice your dueling with friends.<br/>\n<br/>\n I wouldn't assume that your dual-blade can't solo. A lot depends on item props whether you can withstand magical attacks well enough while wailing. Play style can make a big difference, too. The build itself isn't bad, it's just not reaching the full combat potential due to the weapon choice. Doesn't mean it can't be fun to play with. I played with a friend who had an obsession to dual-wield katanas, suffered the awful attack penalties that were associated with that weapon choice, and still had fun playing it (samurai madness methinks). That toon did fine, but he had a real hard time hitting bosses (the reduced AB from DW penalties was catching up with him.... eventually). I'm sure you will be able to party just fine with other melee types. Best scenario: find a friendly cleric to transform you into a nuclear tank. You'd be wise to steer clear of monsters where your focus (high damage crits) is neutralized like undead, constructs &amp; PMs.<br/>\n<br/>\n BTW, with CBC builds are fast and nearly effortless. The main effort was trying to get a grasp of Amia. My instinct tells me there could be some hidden enhancements yet to be discovered in their racial repertoire.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:32 AM - Jun 13, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, i stayed up untill 4 a.m in the morning for doing this (the new forums managed to destroy my build's layout once), but here is the final version of the WM build, this time with Knockdown as well.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354264/Twice-Attack-Double-Guarantee-Ftr-12-Bard-2-Wm-16#.U5phHLH5dn8http://home.comcast.net/~worldofgreyhawk/builds/data/build293577.html\" rel=\"noreferrer\" target=\"_blank\"><strong><span style=\"font-size:100%;line-height:normal\"><span style=\"color:#0000FF\">Twice the Attack - Double the Guarantee</span></span></strong></a><br/>\n<br/>\n And as you will find out in your leveler this thing is a killer, if he doesn't manage to kill faster than the eye blinks, then something is wrong cause the only two things that would kill constantly faster than him, would be a dual-kukri Wmaster or a Scyther.<br/>\n<br/>\n Another thing that i would propose for you, but i don't have the time to build it right now, it's a (Ftr 16/ Bard 4/ Rdd 10) Elf. It will have the same or better AB and +4 AC from Dragonic Armour plus the Fire &amp; Paralysis Immunities but it won't have the huge criticals of the Weapons Master. Both of them are Top choices in my opinion, you will see the second one tomorrow when i have the chance to write it down.<br/>\n<br/>\n<br/>\n Also a minor correction, the IKD feat does not cancel the initial -4 AB penalty on your attacks but rather impose a penalty to the opponent of the same value. It may seem the same but it is not, meaning that poor AB warriors won't be able to hit high armour class opponents for example even with the IKD feat. The only feat that gives effectively an AB gain would be the Improve Disarm when the difference is two or more categories between the weapons (Greatsword Vs short-sword). I remember the same misunderstanding had occured when \"Puff the Magic Dragon\" back in 2004 assumed she would gain +8 AB Vs medium opponents due to size, and maybe that was true back then before the upcoming patches finalize the feat.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:20 AM - Jun 13, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Valerfor wrote:</strong><hr/>\n Also a minor correction, the IKD feat does not cancel the initial -4 AB penalty on your attacks but rather impose a penalty to the opponent of the same value. It may seem the same but it is not, meaning that poor AB warriors won't be able to hit high armour class opponents for example even with the IKD feat.</div></blockquote>\n True. My bad. In many cases, it will just be the delta between the two check values but if the AC is around AB + d20 of 15-19 it matters. AC over AB + 20 won't because you'll only hit on 20 anyway and AC less than AB + 15, you'll always hit (bar the automiss) so it doesn't matter where you place the adjustment. Good point, though.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Bloodedblade",
      "avatar": "no_avatar.png",
      "timestamp": "10:30 PM - Jun 13, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Much thanks good gentlemen.  I'm off to give this fellow a go on the arena.  I know there are serious concessions with the two blade but damn they look cool.  Much thanks and respect to two.  I learn alot from you folks.  It's like on line classes at Nwn university.  Thanks professors<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:24 PM - Jun 15, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It took a bit longer than i expected Bloodblade due to some finishing touches, but here is the Rdd-based Twin-Sword warrior i made for you, i hope you enjoy it!<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354265/Death-Thousand-Cuts-Fighter-16-Bard-4-Red-Dragon-Disci#.U510RbH5dn8http://home.comcast.net/~worldofgreyhawk/builds/data/build293577.html\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#0000FF\"><strong>Death from a Thousand Cuts</strong></span></a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:24 PM - Jun 17, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here is a completely different attempt using cleric. So far it is just a rough sketch. Self buffed AB should be in the high 40s.<br/>\n<br/>\n Cleric(24), Fighter(4), Bard(2), Human<br/>\n<br/>\n STR: 14 (16)<br/>\n DEX: 14 (15)<br/>\n CON: 14<br/>\n WIS: 14 (19)<br/>\n INT: 14<br/>\n CHA: 8<br/>\n<br/>\n 01: Cleric(1): Extend Spell, Two-Weapon Fighting<br/>\n 02: Cleric(2)<br/>\n 03: Cleric(3): Weapon Proficiency Exotic<br/>\n 04: Fighter(1): DEX+1, Ambidexterity, (DEX=15)<br/>\n 05: Cleric(4)<br/>\n 06: Cleric(5): Weapon Focus: Two-Bladed Sword<br/>\n 07: Cleric(6)<br/>\n 08: Cleric(7): WIS+1, (WIS=15)<br/>\n 09: Cleric(8): Knockdown<br/>\n 10: Cleric(9)<br/>\n 11: Fighter(2): Blind Fight<br/>\n 12: Cleric(10): WIS+1, Improved Two-Weapon Fighting, (WIS=16)<br/>\n 13: Cleric(11)<br/>\n 14: Cleric(12)<br/>\n 15: Cleric(13): Improved Critical: Two-Bladed Sword<br/>\n 16: Cleric(14): WIS+1, (WIS=17)<br/>\n 17: Cleric(15)<br/>\n 18: Bard(1): Improved Knockdown<br/>\n 19: Cleric(16)<br/>\n 20: Cleric(17): WIS+1, (WIS=18)<br/>\n 21: Cleric(18): Epic Weapon Focus: Two-Bladed Sword<br/>\n 22: Cleric(19)<br/>\n 23: Fighter(3)<br/>\n 24: Fighter(4): WIS+1, Weapon Specialization: Two-Bladed Sword, Epic Weapon Specialization: Two-Bladed Sword, (WIS=19)<br/>\n 25: Cleric(20)<br/>\n 26: Cleric(21)<br/>\n 27: Cleric(22): Epic Prowess<br/>\n 28: Cleric(23): STR+1, Armor Skin, (STR=15)<br/>\n 29: Cleric(24)<br/>\n 30: Bard(2): Great Strength I, (STR=16)<br/>\n<br/>\n Hitpoints: 304<br/>\n Saving Throws (Fortitude/Will/Reflex): 20/21/14<br/>\n Saving Throw bonuses: Spells: +7<br/>\n BAB: 19<br/>\n AB (max, naked): 26 (melee), 22 (ranged)<br/>\n AC (naked/mundane armor/shield only): 20/30<br/>\n Spell Casting: Cleric(9)<br/>\n XP penalty from level 23<br/>\n<br/>\n Skillpoints: 169<br/>\n Concentration 33(35), Discipline 33(36), Perform 7(6), Spellcraft 33(35), Tumble 30(32), UMD 33(32)<br/>\n<br/>\n 01: Concentration(4), Spellcraft(4), Save(12), <br/>\n 02: Concentration(1), Spellcraft(1), Save(15), <br/>\n 03: Concentration(1), Spellcraft(1), Save(18), <br/>\n 04: Concentration(1), Discipline(7), Save(15), <br/>\n 05: Concentration(1), Spellcraft(2), Save(17), <br/>\n 06: Concentration(1), Spellcraft(1), Save(20), <br/>\n 07: Concentration(1), Spellcraft(1), Save(23), <br/>\n 08: Concentration(1), Spellcraft(1), Save(26), <br/>\n 09: Concentration(1), Spellcraft(1), Save(29), <br/>\n 10: Concentration(1), Spellcraft(1), Save(32), <br/>\n 11: Concentration(1), Discipline(7), Save(29), <br/>\n 12: Concentration(1), Spellcraft(2), Save(31), <br/>\n 13: Concentration(1), Spellcraft(1), Save(34), <br/>\n 14: Concentration(1), Spellcraft(1), Save(37), <br/>\n 15: Concentration(1), Spellcraft(1), Save(40), <br/>\n 16: Concentration(1), Spellcraft(1), Save(43), <br/>\n 17: Concentration(1), Spellcraft(1), Save(46), <br/>\n 18: Discipline(7), Perform(4), Spellcraft(1), Tumble(20), UMD(21), <br/>\n 19: Concentration(2), Spellcraft(1), Save(2), <br/>\n 20: Concentration(1), Spellcraft(1), Save(5), <br/>\n 21: Concentration(1), Spellcraft(1), Save(8), <br/>\n 22: Concentration(1), Spellcraft(1), Save(11), <br/>\n 23: Concentration(1), Discipline(5), Save(10), <br/>\n 24: Concentration(1), Discipline(1), Save(13), <br/>\n 25: Concentration(1), Spellcraft(3), Save(14), <br/>\n 26: Concentration(1), Spellcraft(1), Save(17), <br/>\n 27: Concentration(1), Spellcraft(1), Save(20), <br/>\n 28: Concentration(1), Spellcraft(1), Save(23), <br/>\n 29: Concentration(1), Spellcraft(1), Save(26), <br/>\n 30: Concentration(1), Discipline(6), Perform(3), Spellcraft(1), Tumble(10), UMD(12)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}