{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "808",
  "name": "The merchant.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-merchant-t2355182.html",
  "author": "sataricon",
  "avatar": "10759088_1568407219.jpg",
  "replies": "6",
  "views": "172",
  "posts": [
    {
      "author": "sataricon",
      "avatar": "10759088_1568407219.jpg",
      "timestamp": "7:08 AM - Oct 03, 2019",
      "content": "<div>Can the community here help me with the following.<br/>\nA merchant type character that can solo in a harsh environment like WOG.<br/>\nHe must be able to craft wands and scribe scrolls.<br/>\nOnly PVM and will play tell he reach max level if all possible.<br/>\n<br/>\nIt must be playable from the get go with an ok leveling curve.<br/>\n<br/>\n<br/>\nI'm thankful for taking the time to help me in other threads and other forums.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:48 AM - Oct 03, 2019",
      "content": "<div>I remember a thread from a few months ago that might be just what you are looking for:<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=11&amp;t=2355104\" rel=\"noreferrer\" target=\"_blank\">The Eccentric Gnomeish Red Mage Shopkeeper Merchant (Cleric 17/Wizard 21/Rogue 2)</a></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:05 PM - Oct 03, 2019",
      "content": "<div>Wizard 37/Cleric 1/Rogue 2 - I know, it looks a bit strange.<br/>\n<br/>\nThis character can create wands and potions, scribe scrolls, has Animal Domain for better Summons (esp. on WoG), has 2 levels of Rogue for UMD, Tumble, and Evasion (and a bit of sneak, should she need it).<br/>\n<br/>\nOn WoG, creating wands, potions, or scrolls for Clerics is meh - this will demonstrate why :<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/viewtopic.php?f=1&amp;t=1227&amp;view=print\" rel=\"noreferrer\" target=\"_blank\">https://www.tapatalk.com/groups/worldof ... view=print</a><br/>\n<br/>\nBest leave those, and concentrate on Wizard spells - the Arcane.<br/>\n<br/>\nMy character on WoG, Shia Ders, is basically this - a Merchant.  She rarely adventures anymore, only to get the XP she needs to create wands and scrolls (she is never asked for potions, and I think on WoG, most don't ask for potions because they are readily available).<br/>\n<br/>\nWands are another thing, and so are scrolls (esp Mord's, etc).  She also deals in Dweomerstones and Sequencers (where the power REALLY is).<br/>\n<br/>\nIf interested, I can break down her stats and build by level.</div>"
    },
    {
      "author": "sataricon",
      "avatar": "10759088_1568407219.jpg",
      "timestamp": "1:32 PM - Oct 03, 2019",
      "content": "<div>Why wands and scrolls for clerics isn't good?<br/>\n<br/>\nAnd of course i'd like to see your character.</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "4:22 PM - Oct 03, 2019",
      "content": "<div>I too would like to hear your thoughts on why the crafting for clerics isn't good, not that I'm disagreeing with you, WebShaman, just that I want to hear what you have to say.<br/>\n<br/>\nOn WoG I am typically only wanting potions when I play a shifter build, druid/monk/shifter ....then I'll get all I can of ultravision(6) and other buffs....nice to be able to pop a level 15 bulls strength while shifted etc...and also prot from elements, etc.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:33 PM - Oct 03, 2019",
      "content": "<div>Well, some of the good cleric spells like Divine Favor and Divine Power, as well as Darkflame, are horribly reduced in level - so the duration and damage is not that good.<br/>\n<br/>\nFor example :              Caster Level<br/>\nDarkfire                                    5<br/>\nDivine Favor                            5 <br/>\nDivine Power                           7<br/>\n<br/>\nThose are really not very good values IMO - Certainly not worth taking all those Cleric levels - one can basically get scrolls and wands of such from Merchants ingame.<br/>\n<br/>\nThere are a few spells that are good, of course.  But I just don't see it being worth being a crafter for Cleric stuff on WoG - even Bless and Aid are only Caster level 2, and 3.  And Magic Vestment is limited to 5, as is Shield of Faith.<br/>\n<br/>\nSo is it really worth all the Cleric levels, for some Hammer of the Gods at 20?  Some Healing at level 15?  Implosion at 17?<br/>\n<br/>\nYMMV.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:31 PM - Oct 03, 2019",
      "content": "<div>Come on guys, let's see some builds-not only talking, of-course Web is right (mostly) for Clerical buffs, although I have used the CL20 Hammer &amp; is very effective even later on the game, makes you want to have him there just for that. Nearly any Red-mage build could become a crafter &amp; even have a decent melee presence, depends upon the competence &amp; experience of the user mostly, in those complicated builds. Besides, you don't need to level him/her to forty, he is gonna burn exp all the time by crafting. Perhaps one could modify Max's Magical-Master? <br/>\n<br/>\nFrom the old ECB, you have classics like Gdl's War Wizard =&gt; <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build231822.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 31822.html</a><br/>\npretty easy to also give him brew potions as well, thus having all three crafting feats (Scribe scrolls, Brew potions, Craft wands.)<br/>\n<br/>\nAnd even oddball builds could fill that role, with a little bit of polish, check Aerie =&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/minsc-and-other-bg-characters-t2354360-s80.html#p6411\" rel=\"noreferrer\" target=\"_blank\">minsc-and-other-bg-characters-t2354360-s80.html#p6411</a><br/>\n<br/>\nHere's a strong contender, with just a bit of shuffling he can have everything, even Dev Crit &amp; be super-effective, I just didn't have the time to make the modifications myself, but I have calculated everything &amp; it is easily done should you want it =&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-abjurant-champion-wizard-26-ftr-6-cot-8-t2354353.html#p742\" rel=\"noreferrer\" target=\"_blank\">the-abjurant-champion-wizard-26-ftr-6-c ... .html#p742</a></div>"
    }
  ]
}