{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "141",
  "name": "Spot vs Listen",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/spot-vs-listen-t2355401.html",
  "author": "Zanithar",
  "avatar": "10759190_1575525433.jpg",
  "replies": 9,
  "posts": [
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "8:54 AM - Mar 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Recently I have shifted from a “Spot” builder to a “Listen” builder as I explore the listening around corner mechanic.<br/>\n<br/>\nI am not sure which I prefer and I suspect much of it is subjective rather than build specific but I am curious which people prefer and why?<br/>\n<br/>\nI am less interested in “I go spot because there is more plus spot stuff on my server” and more interested in understanding the mechanical choices and/or the general feelings of effectiveness.<br/>\n<br/>\nMy primary focus is PVE but happy to learn more about PvP stuff as well.<br/>\n<br/>\nI started this thread because <em class=\"mention\">@Orion2019</em> noted he preferred Spot and I want to hear his thoughts on why that was the case and I thought to myself there are some really solid builders/players here that probably have things I have never read/thought about.<br/>\n<br/>\nI prefer spot on melee and/or caster builds and listen on anything that sneaks, particularly corner sneakers (no HiPS) and I have been exploring those builds more of late.<br/>\n<br/>\nWhich do you prefer and why?  Also, does it change depending on what you play?<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:09 AM - Mar 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I prefer Listen - because one, as you have already stated, can \"see\" around corners.<br/>\n<br/>\nI think there is something about the mechanics of Spot that gives it a better \"chance\" (or more checks per round, etc) than Listen does.<br/>\n<br/>\nI believe the whole \"Spot/Listen vs MS/Hide\" thing was discussed way back when on the Bioboards, and Brian Chung gave the Community some huge insights to how the mechanics worked.  It's probably kicking around, somewhere.  I'm pretty sure that someone saved it (like light reducing chances, etc).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:24 AM - Mar 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote:</cite>\nI believe the whole \"Spot/Listen vs MS/Hide\" thing was discussed way back when on the Bioboards, and Brian Chung gave the Community some huge insights to how the mechanics worked.  It's probably kicking around, somewhere.  I'm pretty sure that someone saved it (like light reducing chances, etc).</div></blockquote>\n\nIt is summarised here:<br/>\n<br/>\n<br/>\n<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Detect\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Detect</a><br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:42 AM - Mar 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, it is too bad we lost that board with all that info on it.<br/>\n<br/>\nI know many tried to save the best parts, and one can gets some through the Way Back Machine, but still...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:19 PM - Mar 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for bringing up this topic Zanithar<br/>\nBoth our venerable Grizzled_Dwarflord and WebShaman were in fact very active participants in the Detection Mechanic Thread that eventually led to Bioware Community Manager Stanley Woo arranging some of the mechanics to be released in exchange for some donuts and coffee was the story that was sold to us<br/>\n<br/>\n<a class=\"postlink\" href=\"http://web.archive.org/web/20090211050528/http://nwn.bioware.com/forums/viewtopic.html?topic=549835&amp;forum=42&amp;sp=15\" rel=\"noreferrer\" target=\"_blank\">Web Archive Article on Spot vs Listen from Bioware Boards by Brenon Holmes</a><br/>\n<br/>\nThe_Krit who is the current manager of the NWN Wiki, also had a detailed commentary on Spot vs Listen<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/true-seeing-t3591-s20.html\" rel=\"noreferrer\" target=\"_blank\">Discussion about Spot vs Listen by The_Krit, WoG Forum</a><br/>\n<br/>\nAt present yes I prefer spot over listen but I actually like having both if possible.<br/>\n<br/>\nI used to favor listen very heavily due to the ability to detect through walls/doors/around corners and detection of invisible creatures.<br/>\nHowever when I started playing on WoG pretty much every creature tries to use stealth on you.<br/>\nIt made me consider whether that was the correct decision.<br/>\nThe obvious thing was to ask the WoG player base on the forum, and DM Wise referred me to the above link where The_Krit discussed detection mechanics.<br/>\nI was fascinated to learn The_Krit favored the spot mechanic but also brought up the concept of investing in both skills being even more effective.<br/>\n<br/>\nI learned for myself Spot has a few advantages over listen. There is probably more but these are the main points I can think of right now:<br/>\n- Spotted creatures cannot sneak attack or death attack from stealth whereas listened creatures can sneak attack / death attack from stealth<br/>\n- Spot does not get worse over distance, whereas listen gets worse by 1 DC every 3 meters from the target<br/>\n- Spotted creatures remain detected until they go out of eyesight, whereas listened creatures can become 'unlistened' and return back to stealth<br/>\n<br/>\nOr in plain language:<br/>\n- A spotter gets less sneak attack damage from stealthy sneakers.<br/>\n- A spotter detects enemies from further away if in eyesight.<br/>\n- Once a spotter detects an enemy is detected they remain detected whilst in eyesight whilst a listener may lose detection of the enemy.<br/>\n<br/>\n- Listen gets detection around walls / corners whereas spot does not<br/>\n- Invisible creatures can be listened but cannot be spotted<br/>\n<br/>\nAnyway I don't think either approach is necessarily completely wrong but there are particular advantages to spot over listen that I like better which I have listed above but if possible I like perhaps a spot 40 listen 20 split<br/>\n<br/>\nIt would be good to get a PvP perspective on this too. <br/>\nPvM mechanics are different and very much in favor of the player.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:26 PM - Mar 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The reason I like Listen over Spot :<br/>\n<br/>\nIn any environment, where vanilla TS is available to the PC, Listen trumps Spot every time (as long as one has TS).<br/>\n<br/>\nThis is because one will automatically Spot hiding foes because of vanilla TS.  Thus, being able to also \"see\" creatures behind doors, walls, etc, where TS will not reveal them, is a huge bonus.  It's like having Superman's X-Ray vision.<br/>\n<br/>\nIf one has a build that cannot, for whatever reason, equip vanilla TS, then Orion and The Krit is right - Spot over Listen.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:29 PM - Mar 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thats a fair comment Web, I always forget about vanilla tree seeing<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:04 PM - Mar 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I prefer spot, but web is right; vanilla TS favors listen. <br/>\nSometimes when my character detects (listens) a creature behind a wall, it disappears when it reaches line of sight.<br/>\nWhen you detect a creature with spot it remains visible as long as it is within los.<br/>\nSpot is also a factor against pick pockets.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:27 PM - Mar 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sometimes it's about simple practicalities such as which classes you're using. Monk has listen but not spot, CoT and Barbarian have spot but not listen, for example, and it's better to have one \"full\" skill than a half-charged cross-classed one (though that's still better than none at all). Equally, ranged builds and stealthy ones will find spot more efficacious (you can't shoot around corners, after all), whereas low dex melee-types might well gain more from listen. As with much in the game, it depends largely on the build and your chosen play-style. It also depends on whether the environment you're playing in has items that help with, for example, true seeing. I know that where I play more \"stuff\" is readily available to aid in spotting enemies than hearing them.<br/>\n<br/>\nSo, mostly it comes down to personal preference and environment. Again.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "3:20 PM - Mar 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">PvM has been covered pretty well so I'll chime in with my experiences in PvP. I'll assume that Listen and Spot are both available, obviously some builds only have access to one as a class skill and some class spreads don't have either detect skill as class skills.<br/>\nThe key spells for this discussion are Amplify, Camouflage/Mass Camouflage, Silence, and True Seeing. In vanilla NWN Amplify gives +20 Listen, Camouflage and Mass Camouflage stack to give +20 Hide, Silence bypasses Listen checks, and vanilla True Seeing can detect everything in your LoS.<br/>\n<br/>\nNormally if vanilla TS is available on PvP servers it is only available for casters, there are almost never vanilla TS items or scrolls available since it would be a huge nerf for sneakers. If vanilla TS is available then I rarely bother with detect on my casters, although as others have already pointed out Listen is mechanically the superior choice. The rest of this post assumes that vanilla TS is not available, either due to class restrictions or nerfs to TS.<br/>\n<br/>\nIf I am making a dedicated spotter build (ie aiming for close to 127 Listen/Spot) then I always choose Spot. The fact that you can lose track of a heard creature is a huge problem, since in a fight between a dedicated sneaker with HiPS and a dedicated spotter the sneaker has an advantage if played properly. Silence is another factor, See Invisibility is usually available in some form on balanced PvP servers but there is no equivalent effect that can penetrate Silence in vanilla NWN.<br/>\n<br/>\nFor high detect builds I usually favour Spot unless there is a particular reason to choose Listen (eg playing a bard that can cast Amplify). Camouflage/Mass Camouflage is still a problem with high Hide sneakers, but with a high Spot it should be able to spot bad/mediocre sneakers that use Camouflage/Mass Camouflage.<br/>\n<br/>\nFor low/mediocre detect builds I tend to favour Listen over Spot as long as there are similar Listen/Spot bonuses in that environment. Those bonuses include both items and spells such as Amplify (+20 Listen) or nerfed TS (ranging from +20 to +50 Spot in my experience). In vanilla NWN Camouflage and Mass Camouflage stack to give +20 Hide, there is no equivalent boost to MS. Assuming that there are similar Listen/Spot bonuses, this gives Listen an advantage over Spot when fighting druids and (particularly) rangers, which are usually some of the most dangerous sneakers.<br/>\nSilence is still a factor here, although if Silence is rare on sneakers then I tend to stick with Listen and accept that it won't be useful against certain bards or clerics. If Silence is common on the server I will usually build for both Listen and Spot, favouring Spot if I can only choose one. It's better to be at a disadvantage when detecting than to not have any chance at all.<br/>\nIf there are large bonuses to only one of the detect skills (usually nerfed TS giving a large Spot bonus) then I tend to choose that detect skill over the other for low/mediocre detect builds. This usually means focusing on Spot, so Silence isn't a problem but Camouflage/Mass Camouflage can still cause issues.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}