{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "185",
  "name": "Bard/Blackguard/PaleMaster",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bard-blackguard-palemaster-t2354491.html",
  "author": "Lorbaz",
  "avatar": "no_avatar.png",
  "replies": "4",
  "views": "2.7K",
  "posts": [
    {
      "author": "Lorbaz",
      "avatar": "no_avatar.png",
      "timestamp": "4:37 PM - Jan 18, 2016",
      "content": "<div>Hi all,<br/>\n<br/>\n i´m about to fire up some high-lvl modules (or a series of modules) and I came upon your forum while looking for a certain class-combination, which I don´t even remember anymore. I was quite inspired by some of your awesome builts and immediatly started running a few of those with great results (a spellsword by Valerfor- Wizard 26/FTR 6/COT 8, what a beast). After that I started browsing your forums some more and found these two builds:<br/>\n<br/>\n 1) the \"Harvester of Souls\" <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354285/HARVESTER-Of-SOULS-FTR-10-PAL-5-WM-25#.Vpz2Lk92HRo\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... pz2Lk92HRo</a><br/>\n<br/>\n and<br/>\n<br/>\n 2) the \"Undead Phalanx\" <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2353779/UNDEAD-PHALANX-BARD-11-PM-10-WM-19#.VpzpiE92HRo\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... pzpiE92HRo</a><br/>\n<br/>\n Then it hit me. I never played a truly evil toon nor one with a freaking Scythe! Those two builds and especially Valefors \"Harvester of Souls-picture\" inspired me to build something like a \"Reaper\" a true Harvester of Souls (able to summon undead and swinging a scythe of course) with the two classes Blackguard and Pale Master (both sort of evil already and basicly able to do what I had in mind). To qualify for pale master i need an arcane caster, which led me to a bard. Kind of neat I thought because now my \"reaper\" can also wail like a freaking banshee :D<br/>\n<br/>\n But now I´m lost because I don´t know enough about character building. I don´t know where to start and would gladly apreciate your help with my general idea. My first thought was to just take Valefors \"Undead Phalanx\" and sort of substitute the weapon master for blackguard but now I feel lost.<br/>\n<br/>\n I know the general \"idea\" is not exactly new but most builds I found by googling just focus on the scythe and end up similar to the \"Harvester of Souls\". I have no idea if a Bard/Blackguard/PaleMaster can be viable at all. I only found this combination mentioned once (<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515391/Evil-Singer-V2-Bard-26-Blackguard-4-Pale-Master-10#.Vp0Fo092HRo\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/51 ... p0Fo092HRo</a>) but that is not exactly what I had in mind (same class combination though).<br/>\n<br/>\n Short Version:<br/>\n 1) PvM<br/>\n 2) Level cap: 1-40 - Viable while leveling would be awesome<br/>\n 3) Race preference: none<br/>\n 4) Class preference: Bard/Blackguard/PaleMaster (if you have some more viable options I will listen to them, because I´m just a beginner)<br/>\n 5) Melee preference: a freaking scythe :D<br/>\n 6) Range preference: nope, I primarily want to mow things down with my scythe<br/>\n 7) Weapon preference: yes, yes a scythe<br/>\n 8) Maximum item enhancement: Not sure about that because I have not decided what modules I want to play with this toon.<br/>\n 9) Spellcasting: I primarily want a melee-character but according to my \"idea\" he should be able to summon at least some sort of undead (Blackguard and Pale master should be able to do exactly that)<br/>\n 10) Custom factors: none yet.<br/>\n<br/>\n<br/>\n Any and all advice is appreciated!  Thanks in advance.<br/>\n  </div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:10 PM - Jan 18, 2016",
      "content": "<div><strong><span style=\"color:#0000FF\">Welcome to the guild, Lorbaz!</span></strong><br/>\n<br/>\n Obviously, the scythe forces this concept to be an STR build of some sort.  Case closed.  Also, your HPs will be puny for a meleer.  That mean plenty of invis casting or pots for low-HP situations to heal.<br/>\n<br/>\n PM builds are usually only viable in low-mid magic environments that do not provide crit immunity on items.  Is this the case for you?  Else, PM merely nerfs any caster abilities and does not provide anything different from what are item enhancements other than some AC.  Their summons are easy to dispatch by any boss and that will be the main hurdle to overcome in the final analysis.<br/>\n<br/>\n Are you looking for a DevCrit build?  If so, it's a STR/CHA split, very light CHA (meaning: less dmg, less AC, lower DB saves) especially to get DevCrit early enough to be of any use (this would be a different situation on a 40 cap server where you would be playing a high-level toon a long, long time so it wouldn't really matter how late DevCrit kicks in).<br/>\n<br/>\n Except for grabbing DM/DS/DB bonus, you'll require few levels of BG.  You won't be hiding in heavy armor very well so would probably need to develop a nice long caster-based Darkness spell assuming you want to take advantage of the BG sneaks.  But how much sneak damage?  That will set the BG level.<br/>\n<br/>\n The main problem I see is that without lots of levels of pre-epic BG, your BAB is going to suck.  Since you won't be getting the tower AC, 4 APR seems to be essential to dispatch flankers quickly before receiving too much damage from those still standing.  Hence, I'd skip PM altogether during pre-epic with something like Brd12/BG8(BAB 17) or Brd8/BG12(BAB 18) and plan your necromancer in epic levels.  Yes, you could take 4 (or even 8) PM levels pre-epic at the cost of BAB (which equates to hitting power), but I don't see any value in that strategy.<br/>\n<br/>\n I guess what I am trying to infer is: Don't become too enamored with the idea that two prestige classes just happen to require evil alignment and therefore must somehow support each other.  There may be no synergy at all worth exploring just for thematic reasons.<br/>\n<br/>\n Ever considered a Risen Lord?  That scyther is immune to a lot more than crits. And could be made into a DEX build with incredible AC without losing any potential for damage.<br/>\n<br/>\n Or a scythemaster, if you REALLY want to do damage? (...which is incidentally why you found those two scythe builds focused around WM)<br/>\n<br/>\n One tip I will impart here:  Whenever you conceptualize a solo (non-party) build... design in terms of PvP.  In other words, if you are considering different builds, choose one and then \"battle\" that build on paper with any contenders.  It will expose how optimized the build is and where the weakness(es) lie and then at that point decide how it may need to be changed to suit the chosen environment better.</div>"
    },
    {
      "author": "Lorbaz",
      "avatar": "no_avatar.png",
      "timestamp": "2:06 PM - Jan 19, 2016",
      "content": "<div>Wow, thanks for the thorough reply!<br/>\n<br/>\n I was looking for an evil toon that I might get attached to and carry through several modules (sort of like a heroes path) or some module like Eye of the Beholder. I was never able to see dev crit in action because when played HotU I did not realize it was there and after I learned about the feat I mostly played modules where it was disabled (Aielund) or my toon did not reach epic levels.\n<blockquote><div>HipMaestro wrote:<br/>\n I guess what I am trying to infer is: Don't become too enamored with the idea that two prestige classes just happen to require evil alignment and therefore must somehow support each other. There may be no synergy at all worth exploring just for thematic reasons.</div></blockquote>\n Jep, that is exactly what kind of happened... I was so giddy with the pairing of Pale Master and Blackguard that I did not think much about if that combination might even be reasonable. After my post here I used a module that lets me level a toon to 40 and I started more or less randomly leveling that class-combination. The result was quite sobering... I ended up with something like Bard 14/Pale Master 10/ Blackguard 16 and while I was kind of happy with the amount of Skills and the available/chosen feats, most of my other values (AC and AB) felt lackluster because I was expecting higher values.<br/>\n<br/>\n So you are right that dropping at least the Pale Master and/or revamp my whole concept - evil toon using a scythe - is propably the best idea. Right now i´m contemplating if somthing like barbarian/blackguard/other class (maybe asassin) will fit my theme (terrifying rage sounds interesting).<br/>\n<br/>\n I will look into you suggestions (scythemaster) but i´m not exactly shure what you mean by \"risen lord\" (shape shifter build?).<br/>\n<br/>\n How do you best plan your builds? I downloaded some excel-spreadsheet but i was a little overwhelmed by that at first (have to look into it a little further).<br/>\n<br/>\n Tanks again for your reply, that gave me quite a bit to think about.<br/>\n  </div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:10 PM - Jan 19, 2016",
      "content": "<div>Hey! That's why we are still here hashing out builds after 10+ years of playing this game and building toons.  Honestly, though, there are few surprises anymore.  Except for the impact on the game mechanics by the final patches, just about every avenue has been explored by our predecessors.<br/>\n<br/>\n What keeps toon-building vital, though, are the custom tweaks that designers use to change the environment.  And it's not just a matter of low-magic, mid-magic, high-magic today.  There are level caps to consider, banned classes, altered or eliminated spells/feats, custom classes and other limitations that can make designing an effective toon still quite challenging and dynamic for us. All that it takes, though, is a clear definition by the requestor as to what he/she absolutely wants to achieve (or experience) and the guild will make its best shot to provide tutelage to realize it.<br/>\n<br/>\n I want to caution you about one idiosyncrasy of my \"method\"... I seldom (if ever) will post a fully-detailed build outside of the completed sections.  My impetus is that I would rather a new builder learn the mechanics (i.e. \"the why's and wherefor's\") of building than just shoving a listing under their eyes to (hopefully) comprehend.  I feel it is our responsibility as guild members to encourage independence in new builders because more than not, play-style is a big factor in how effective each build can be for the user.  -end of sermon-<br/>\n  - -<br/>\n Yes, I was referring to the Risen Lord undead shape as one of the most uber scythers available.  It become less uber, though, as the magic environment increases due to the limitations of the item merge (eg. the belt slot NEVER merges for polymorphs).  It is, however, a great method to obtain crit immunity without nerfing the divine casting potential of the druid (not beyond the 10 levels needed to access RL, that is).<br/>\n - -<br/>\n As long as you have MS Office installed on your machine, Kamiryn's build calculator (CBC) makes it so very easy to create and change builds on the fly.  It is fairly straight forward but if you have any problems/concerns using it, post questions in the General Discussion subforum. But what you really need to concentrate on, initially, is defining a list of priorities you wish to achieve, decide which class combos might fulfill those goals and your preferences, and then begin using the CBC to quantify your ideas.  The last step is to test a fully-calculated build using either a trainer or leveling with the console in any random <strong>VANILLA</strong> module (like the v1.69 OC or a small custom module you could make yourself just for that purpose).  Occasionally (hardly at all really, but it <strong>can</strong> happen), we find an inconsistency between what the CBC provides and how the game digests the plan... so test it just to be sure before finding out, after you've spent hours playing a toon, that it can't be implemented exactly as planned on paper.  <br/>\n - -<br/>\n The scything WM has been exploited in many environments as the most damaging build created (with all due respect to smite builds). But a DevCrit build focuses on an entirely different rationale.  Rather than focusing on damage, an uber DevCrit wants to land hits as often as possible (i.e. uber AB, uber APR) with the highest DC possible (i.e uber STR).  Naturally, any DevCrit build is intrinsically strength-based so you'll always get relatively high damage with it.  The best DevCrit build I've ever made (or seen) is a kukrimaster.  Highest AB, highest crit range, highest APR... a friggin' monster that drops non crit-immunes fast provided the opposed Fort is not also uber.  A close second is a kama monk WM, second because kama crit range just sucks and a monk WM will never reach the AB of a fighter-ish WM.<br/>\n<br/>\n So your first decision is: Are you willing to gimp effectiveness vs. crit immunes with an all-out DevCrit build or rather focus mainly on dealing as much damage as possible with a fairly good DevCrit build in the back seat fro the full spectrum of adversaries?  The environment you anticipate has everything to do with that decision.  There is no \"one-size-fits-all\" build that achieves ultimate optimization under all circumstances.<br/>\n<br/>\n That should be enough for you to think about before declaring your absolutes for us to help you achieve that goal.  Good luck in your building ventures! <img class=\"img-emoji\" src=\"emoji/11.gif\"/><br/>\n<br/>\n P.S. Apologies for the wordiness.  It's a genetic trait methinks. :P</div>"
    },
    {
      "author": "Lorbaz",
      "avatar": "no_avatar.png",
      "timestamp": "3:29 PM - Jan 22, 2016",
      "content": "<div>Thanks again for the reply!<br/>\n<br/>\n You are right, that is quite a bit to think about. Don´t worry about the wordiness. I really appreciate the time you put into this and your method is quite alright with me because everybody can just copy a build and never become better at building a character by themself.<br/>\n<br/>\n I got flooded with work during the last few days so I hope will have some time this weekend to make some builds, test them a little bit and figure out what I really want. I really do have a lot to learn because until now I mostly just focused on a certain class (or combination) and never cared too much about feats and skills (apart from the most necessary ones).</div>"
    }
  ]
}