{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "204",
  "name": "Lookinf for a Ranger/Rogue Build lvl 40.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/lookinf-for-a-ranger-rogue-build-lvl-40-t2354464.html",
  "author": "Gardoni",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "1.1K",
  "posts": [
    {
      "author": "Gardoni",
      "avatar": "no_avatar.png",
      "timestamp": "1:14 AM - Sep 18, 2015",
      "content": "<div><span style=\"color:#000000\">Hi Everyone Guys. Great Forum for a Great Game never Die. Sorry for my Bad English.</span><br/>\n<span style=\"color:#000000\">I'm looking a Nice build for a PW set in Middle Earth [RPG Oriented].</span><br/>\n<span style=\"color:#000000\">I'd Like </span><strong>Aragorn Style</strong><span style=\"color:#000000\">, </span><strong>Ranger/Rogue/ShadowDancer</strong><span style=\"color:#000000\">, nice for</span><strong> PVP</strong><span style=\"color:#000000\">. </span><br/>\n<span style=\"color:#000000\">The PW is Low Magic.. I think Max Lvl weapon +7.</span><br/>\n<span style=\"color:#000000\">I'd like a character </span><strong>built</strong><span style=\"color:#000000\"> on </span><strong>DEXTERITY</strong><span style=\"color:#000000\">, not of strength, so that we can also use a bow. [But not necessarily, I understand that you can not have it all]</span><br/>\n<span style=\"color:#000000\">I Love Shortswords, or Kukry maybe, two weapon fighting style.</span><br/>\n<br/>\n<span style=\"color:#000000\">Someone is kind enough to give me a hand?</span><br/>\n<span style=\"color:#000000\">Many thanks to anyone who wants to answer, and congratulations again to the Forum very rich in information.</span><br/>\n<br/>\n<span style=\"color:#000000\">EDIT: I forgot. I'd like to be </span><strong>Elf<br/>\n<br/>\n<span style=\"color:#FF0000\">I had written in the wrong section. I fixed properly.</span></strong></div>"
    },
    {
      "author": "Gardoni",
      "avatar": "no_avatar.png",
      "timestamp": "8:59 PM - Sep 21, 2015",
      "content": "<div>Nobody helps me?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:11 AM - Sep 24, 2015",
      "content": "<div>Alright, let me try to help you a bit Gardoni,<br/>\n<br/>\n But first - welcome to the Guild!<br/>\n<br/>\n First of all, i was somewhat confused from what you said about  the magic level of your PW. Having +7 Items is hardly low magic, in fact is almost high magic especially if there are many immunities on items. That will work in your favour though since Dexterity characters simply love high magic settings for various reasons. Now to the build, i see one split that will make this work just fine and that is Ranger 26/ Rogue 13/ SD 1. This will give you everything you want and then some more. High AC, Epic Dodge, HiPS, Bane of Enemies e.t.c. The problem here is that all of them arrive quite late in the build. You see, you need BoE as much as you need ED and both of them require a lot of levels in their respective classes so you will most likely have a mediocre build for the first 30 or so levels and then Bam! everything arrives at once.. Now it all depends from the rate that you can advance in your PW, if leveling-up is something relative easy then yes it is a viable build, in case though that this is not the case (and most RP focussed Worlds are not encourage high levels) then you will feel less than Heroic with this character - to put it mildly. In fact i have some \"Monster Rangers\" in the \"Pure Builds\" thread that will advance more quickly and will feel much more powerful than this build will ever feel, until the very last levels. No, they do not have long ears and they do not hide behind trees but they are brutally efficient. And even more efficient would be a Ranger 28/ Bard 2/ RDD 10 that will make the build above to look punny in comparison but it makes next-to-no-sense in a RP focussed PW. Eh, you can't have it all ;-)<br/>\n<br/>\n Anyway, i talked too much and  showed too little, so the build below is an example of \"your\" kind of Ranger -adjusting it for an Elf is really simple. Take a good look at it and tell me what you think,<br/>\n<br/>\n<span style=\"color:#B22222\"><em><strong>Blade of the Wilderness -- </strong></em></span><a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build197283.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 97283.html</a><br/>\n  </div>"
    }
  ]
}