{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "268",
  "name": "Bard Song Skill Level",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bard-song-skill-level-t2297680.html",
  "author": "10235387",
  "avatar": "no_avatar.png",
  "replies": 5,
  "posts": [
    {
      "author": "10235387",
      "avatar": "no_avatar.png",
      "timestamp": "11:30 AM - Nov 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I want to build a Bard 30/RDD 10 and get the maximum impact from Bard Song, but you need 100 points in Perform and even with a CHA of 38 I don't see how to get the 100.<br/>\n<br/>\nRanks - 43<br/>\nCHA bonus - 14<br/>\nSkill Focus + Epic - 13 <br/>\nAbility Cap - 6<br/>\n<br/>\nThat is 76.  Where do I get the other 24?  Also, can the Bard Song skill bump be added in, or is that part of the ability cap?<br/>\n<br/>\nAlso - I need a good Bard guide.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "2:15 PM - Nov 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm working on a \"yardstick\" project, with other members here, but haven't gotten around to the bard class yet (unless someone else wants to take it on, I'm happy to do it but give me time to get around to it, working on a couple of others at the moment including an \"Illustrated Guide\" to the Paladin and Ranger class which will further augment, illustrate and thus contribute to all what's been done over in the guides section already, but we/the guild haven't gotten around yet to the bard, and that's a crying shame, I agree, which will be remedied (and will be in due course, no worries). As to song and caps, at 76 perform you are already well past the \"Sweet Spot\" when it comes to that (honestly, don't need that much, see below). In terms of \"theory\" as to how to take the skills/effect to the max, it's doable via gear, but won't really be playable. (Theory is cool though, love the idea of \"max\" and thinking about how to get there, too!):<br/>\n<br/>\nUnless something's changed in the patch, my understanding of it is as follows:<br/>\n43 points into a skill, +ability Stats Cap, +SF/ESF and the rest (to a maximum of) +50 from items (note: as to how it all applies to the Curse Song effect on your enemies, additionally bump that with your bard song itself, which bard song as it applies to you and your allies also counts towards the +50 cap).<br/>\n<br/>\nHow do you do this:<br/>\nBard 25/Harper Scout 5 (2 boni feat, take Grt.Charisma), 10 RDD (+2 Char). Start Cha 18 / Finish 38, all ability points into CHA, all but ESF: perform epic feats into CHA (incl. the 2 HS boni feats). Take LI as bard boni feat level 23. 43 points into perform, +13 SF/ESF perform, +14 stats: 70. Bio-Cap Stat (50) gives you +6 more (76, yes, from +12 Stat boost gear, including i.e. Harper's potions for e.g., so not that difficult to cap). Now, your Bard song will boost your perf skill so as to boost your Curse Song as said. Ah, but as to how to boost your bard song itself, as in, how to get your perform skill up for that is to do so from items, like bard toys (musical instruments) and bard specific gear (perform-boosting items and gear).<br/>\n<br/>\nBTW, with all that, better get representation as every record company on the planet is going to be fighting over themselves to sign him/her up to the label--not to mention every party out there begging for a show. Yep, pity the party that doesn't have a bard. Really do! <br/>\n<br/>\nThat said, for all intents and purposes, a 24+ level bard with a 20 level bard song/curse song (give or take a couple, the +AC 5 to you and your allies, and -5 AC to your foes is the \"sweet spot\") along with lasting inspiration is a force to be reckoned with, and the record companies er parties, teams will fight themselves to get to you (including your enemies who will want their AB/AC/Skills, etc. back!). Bard 24-26/rdd 10/4-6 CoT or ftr. CoT 4 for boni feats, 5 gets you Divine Wrath and of course Sacred Defense, 1 more for bonus feat; ftr for proficiencies and feats (like WS, with 6 get EWS). Bard 26/10 RDD/4 BG  or (if alignment change is OK) paladin is also a great mix with Bard/RDD (dark blessing has BG, paladin with divine grace for cha into saves, with armor prof., etc., not to mention the DM/DS). CHA 16 for your bard spells, can go more if you like (especially if going i.e. DM/DS route), enjoying your bard buffs (can take the perf. skills boosts also if you want), along with a great song/curse of course, too, and either way can take care of itself just fine.  Don't need all 100 points, honestly not worth it (give up too much, so little in return). But is it doable? Yes, in theory--i.e., only via skill-boost items/bard instruments, gear. Hope this helps.<br/>\n<br/>\nSing/Curse ON! ~ Tyr<br/>\n<br/>\nEDIT: remove typo, clarify recommendation.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "10235387",
      "avatar": "no_avatar.png",
      "timestamp": "5:40 PM - Nov 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks - didn't think about Bard gear!  Perhaps I'll look at 4 levels of Paladin to start, but I usually play through the OC and won't be able to legally do the alignment shift.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "6:12 PM - Nov 14, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sounds good, but as to the OC and alignment issue, yes, this could be an issue. Little opportunity via dialogue choices in-game to do so, other than shift b/w good-evil axis as I recall and even then not much of that either, as compared to i.e. Baldurs. It's been awhile since I played through the OC, don't recall any particular console command for it but do believe there's a hak out there or via the DM client/scripts; otherwise, build a character up in one of the trainers save it once the alignment changes are done, then start up a fresh game and import character. (You'd think a RPG would make it a bit easier to shift alignments, as in, put the \"role-play\" into RP-g ... ). Soooo much easier to run with BG in turn; come on, listen to the song of the dark side, does it not sing ever so soft and sweetly? <br/>\n<br/>\nJust to add, used to have encounter \"issues\" of sorts all the time in RP'ing my paladins (PnP), Seems some DMs had a certain idea as to what a Paladin \"should be\" (you know: the boring 1-dimensional kind: do you kill a baby Orc found as an orphan in the woods because blah, blah, blah). Anywho, found new DMs (not so restricting, better rp-all around not to mention much better character building); then, do admit, it could be the bard in me.   <br/>\n<br/>\nEdit,<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:02 AM - Nov 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The feat Artist gives a +2 bonus to perform.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "8:44 PM - Nov 16, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And now we're theoretically up to 78 perform (\"artist\" -- must be taken 1st level i.e. on character creation as bard so as to have perform skill, yes?). Alright, then, so, only 22 more to go! <br/>\n<br/>\nGloves of the Minstrel, +3 Perform; Greater Gloves of the Minstrel, +6 Perform; then there's Epic Gloves of the Minstrel, Perform +30 (and there you go!).   <br/>\n<br/>\nOthers: Belt of the Performer +1 (+1 CHA/Perf); Belt of the Performer +3 (+3 CHA, +2 Perf); Belt of the Performer +5 (+5 CHA; +4 Perf). Sirene's Cloak, +1 (+1 CHA/Perf), and Sirene's Cloak +2 (+2 CHA/Perf).<br/>\n<br/>\nApparently, there's a bow (Lifting Note Bow), includes +8 Perform (but being a Bard/RDD, Str/CHA, doesn't really apply here as not Dex-based Archer i.e. AA, but thought to mention it), with CHA enhancing items apart from potions, scrolls for the most part coming in the form of rings, belts and Cloaks (especially i.e. Nymph variety), but can be found on some shields, too.<br/>\n<br/>\nAdd that stuff up alone (Epic Gloves, +30 Perf; Belt +4 Perf; Sirene's +2 Perf = 36) means only \"need\" 64 perf to hit 100 in turn (though really, Bard Song Lvl 17 (requires 35+ perform, gives +5 all skills for 18 Lvl Curse Song, meaning -6 all enemy skills, etc. as in, just enough UMD they thought they had to equip whatever it is they have equipped they suddenly find they no longer have, etc., and on and on their de-skilling goes, including all that so-called stealth, discipline and so forth, heh). Also, it's from that point on your bard and all allies get/enjoy the whole +2 AB/+5 AC from your song (opposite effect has your curse on all enemies of course, same with the saves, etc.) with Lasting Inspiration, 24+ Bard for non-dispel factor, and all good to go. Oh, and when it comes to your skill set, don't forget to train up your Taunt either. This, because a successful taunt (opposed concentration check) reduces enemy AC by -6 so as to effectively raise by +6 your own AB and that of your allies; with the effects of song on your skills and your curse on that of your enemies' skills, heh. Yep, once you go bard, you never go back -- who doesn't love a good (or evil if BG as the case may be) bard?!! (Have fun!).<br/>\n<br/>\nSing/Curse ON! ~ Tyr<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}