{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "334",
  "name": "Dual-Katana Fighter",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/dual-katana-fighter-t2350350.html",
  "author": "Moredhel",
  "avatar": "10235447_1565972826.jpg",
  "replies": 49,
  "posts": [
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "11:33 PM - Feb 21, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hey guys,<br/>\n<br/>\nI know I have asked for help on the rogue/cleric/blackguard character a day or two ago, but I just can't play evil (even though persuading suffering townsfolk to give up their money because I lie to them about having the cure IS kinda funny) long enough to really enjoy it.<br/>\n<br/>\nI had another character, loosely rp'ing Drizzt Do'Urden (loose as in being rogue/ranger and using rapier/short sword), but that save is messed up because my henchman died right before I entered Luskan *sigh*, and now I'm looking at the idea of a dual katana-wielding fighter thanks to this page: <a class=\"postlink\" href=\"http://www.gamebanshee.com/neverwinternights/strategies/fighter.php\" rel=\"noreferrer\" target=\"_blank\">http://www.gamebanshee.com/neverwintern ... ighter.php</a>  (scroll down to Building A Two-Weapon/Double-Weapon Fighter).<br/>\n<br/>\nIt focuses on a human, but I always have this urge to play as an elf because humans are usally quite yawn-ish in games. The downside of me going elf would be having less feats, taking more time to get really good at dualwielding those japanese badboys and the -2 CON. Another downside is the inability to summon extra help (unless I take Linu along my journeys) and I got quite used to that as a rogue, ranger and/or cleric :\\<br/>\n<br/>\nOh, and another thing: what would a human or elf (yeah I'm still debating between picking my fav pointy-eared treehugger and the bland human) dualwielding fighter wear? Leather? Or Medium Armor to have decent enough AC but not harm the DEX too much?<br/>\n<br/>\nedit: maybe it doesn't matter if I just pick Elf, because I plan to play this guy all the way through OC, SoU and HoTU. It'll only bug me at lower lvls, but what the hell.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:57 PM - Feb 21, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually, here's what you are looking for:<br/>\n<br/>\nFighter(28), Bard(2), Red Dragon Disciple(10), Dwarf<br/>\n<br/>\nSTR: 18 (42)<br/>\nDEX: 10<br/>\nCON: 16 (18)<br/>\nWIS: 8<br/>\nINT: 14 (16)<br/>\nCHA: 6 (8)<br/>\n<br/>\nDwarf: (Darkvision, Defensive Training vs. Giants, Stonecunning, Hardiness vs. Poison, Hardiness vs. Spells, Offensive Training vs. Goblinoids, Offensive Training vs. Orcs, Skill Affinity: Lore)<br/>\n01: Fighter(1): Power Attack, Cleave<br/>\n02: Fighter(2): Weapon Proficiency Exotic<br/>\n03: Fighter(3): Weapon Focus: Dwarven Waraxe<br/>\n04: Fighter(4): STR+1, Weapon Specialization: Dwarven Waraxe, (STR=19)<br/>\n05: Fighter(5)<br/>\n06: Fighter(6): Knockdown, Expertise<br/>\n07: Fighter(7)<br/>\n08: Fighter(8): STR+1, Improved Knockdown, (STR=20)<br/>\n09: Fighter(9): Improved Critical: Dwarven Waraxe<br/>\n10: Fighter(10): Great Cleave<br/>\n11: Fighter(11)<br/>\n12: Fighter(12): STR+1, Disarm, Improved Disarm, (STR=21)<br/>\n13: Fighter(13)<br/>\n14: Fighter(14): Blind Fight<br/>\n15: Fighter(15): Skill Focus: Discipline<br/>\n16: Fighter(16): STR+1, Improved Expertise, (STR=22)<br/>\n17: Fighter(17)<br/>\n18: Fighter(18): Toughness, Improved Power Attack<br/>\n19: Fighter(19)<br/>\n20: Fighter(20): STR+1, Called Shot, (STR=23)<br/>\n21: Fighter(21): Overwhelming Critical: Dwarven Waraxe<br/>\n22: Bard(1)<br/>\n23: Red Dragon Disciple(1)<br/>\n24: Red Dragon Disciple(2): STR+1, Great Strength I, (STR=27)<br/>\n25: Fighter(22): Devastating Critical: Dwarven Waraxe<br/>\n26: Red Dragon Disciple(3)<br/>\n27: Red Dragon Disciple(4): Great Strength II, (STR=30)<br/>\n28: Red Dragon Disciple(5): STR+1, (STR=31)<br/>\n29: Red Dragon Disciple(6)<br/>\n30: Red Dragon Disciple(7): Great Strength III, (STR=32), (CON=18)<br/>\n31: Red Dragon Disciple(8)<br/>\n32: Red Dragon Disciple(9): STR+1, (STR=33), (INT=16)<br/>\n33: Red Dragon Disciple(10): Great Strength IV, (STR=38), (CHA=8)<br/>\n34: Fighter(23)<br/>\n35: Fighter(24): Armor Skin<br/>\n36: Fighter(25): STR+1, Great Strength V, (STR=40)<br/>\n37: Fighter(26): Epic Weapon Focus: Dwarven Waraxe<br/>\n38: Bard(2)<br/>\n39: Fighter(27): Great Strength VI, (STR=41)<br/>\n40: Fighter(28): STR+1, Epic Prowess, (STR=42)<br/>\n<br/>\nHitpoints: 576<br/>\nSkillpoints: 184<br/>\nSaving Throws (Fortitude/Will/Reflex): 26/15/16<br/>\nSaving Throw bonuses: Spells: +10, Poison: +2<br/>\nBAB: 30<br/>\nAB (max, naked): 50 (melee), 31 (ranged)<br/>\nAC (naked/mundane armor/shield only): 24/35<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nDiscipline 43(62), Lore 14(21), Open Lock 1(1), Perform 7(6), Spellcraft 37(40), Tumble 40(40), UMD 41(40)<br/>\n<br/>\n<br/>\n01: Discipline(4), Lore(4), Open Lock(1), Save(6), <br/>\n02: Discipline(1), Lore(1), Save(8), <br/>\n03: Discipline(1), Lore(1), Save(10), <br/>\n04: Discipline(1), Lore(1), Save(12), <br/>\n05: Discipline(1), Lore(1), Save(14), <br/>\n06: Discipline(1), Save(17), <br/>\n07: Discipline(1), Save(20), <br/>\n08: Discipline(1), Save(23), <br/>\n09: Discipline(1), Save(26), <br/>\n10: Discipline(1), Save(29), <br/>\n11: Discipline(1), Save(32), <br/>\n12: Discipline(1), Save(35), <br/>\n13: Discipline(1), Save(38), <br/>\n14: Discipline(1), Save(41), <br/>\n15: Discipline(1), Save(44), <br/>\n16: Discipline(1), Save(47), <br/>\n17: Discipline(1), Save(50), <br/>\n18: Discipline(1), Save(53), <br/>\n19: Discipline(1), Save(56), <br/>\n20: Discipline(1), Save(59), <br/>\n21: Discipline(1), Save(62), <br/>\n22: Discipline(1), Perform(5), Spellcraft(12), Tumble(25), UMD(25), <br/>\n23: Discipline(1), Spellcraft(3), <br/>\n24: Discipline(1), Spellcraft(3), <br/>\n25: Discipline(1), Save(3), <br/>\n26: Discipline(1), Spellcraft(6), <br/>\n27: Discipline(1), Spellcraft(3), <br/>\n28: Discipline(1), Spellcraft(3), <br/>\n29: Discipline(1), Spellcraft(2), Save(1), <br/>\n30: Discipline(1), Spellcraft(1), Save(3), <br/>\n31: Discipline(1), Spellcraft(1), Save(5), <br/>\n32: Discipline(1), Spellcraft(1), Save(7), <br/>\n33: Discipline(1), Spellcraft(1), Save(10), <br/>\n34: Discipline(1), Save(14), <br/>\n35: Discipline(1), Save(18), <br/>\n36: Save(23), <br/>\n37: Save(28), <br/>\n38: Discipline(1), Perform(2), Spellcraft(1), Tumble(15), UMD(16), <br/>\n39: Discipline(3), Lore(2), <br/>\n40: Discipline(1), Lore(4), <br/>\n<br/>\nChange the weapon and race as you see fit, as it truly doesn't matter. For a dual-weapon, you'll need a deeper tweak, so I'd go for a two-hander. Seriously, with that much STR and 1.5x multiplier, you'll hardly need the extra attacks per round with this guy.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:47 AM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Trust <strong>MAX</strong>imillian Kane to give you a sledgehammer for squashing a fly   <br/>\n<br/>\n<br/>\nMan, where are you looking i am wondering... Gamebanshee is hardly the place when you have questions like these..<br/>\n<br/>\nOkay, i have the feeling that you are still exploring the game and you are undecided to what you want. That's fine, as this is what makes the game so wonderful but at least we need to have some constants <br/>\n<br/>\nso we can give you a proper advice.<br/>\n<br/>\n<br/>\nOkay, here are two builds for you based on what do you asked. The first one is the simplest and the second one is the more advanced. Both of them are very close to what you are looking for (and i think you should stick close to a pure build for start).<br/>\n<br/>\nPure Fighter ---&gt;  <a class=\"postlink\" href=\"http://worldofgreyhawk.fr.yuku.com/topic/2262/A-Simple-Fighter-with-not-sosimple-weapons-140\" rel=\"noreferrer\" target=\"_blank\">http://worldofgreyhawk.fr.yuku.com/topi ... eapons-140</a><br/>\n<br/>\nFighter/Monk/WM ---&gt;  <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build213860.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 13860.html</a><br/>\n<br/>\n<br/>\nNow here is what i want from you. Take a<strong> close look</strong> at them and tell us what do you think you like more. Forget the race and weapons. Just what do you think you like more and find simpler to play.<br/>\n<br/>\n<strong>Then</strong> i will build you (or someone else from here) a build that's exactly fit for your needs and the lvl 1-27 range you are gonna play, with the earliest acquisition of feats possible and the race you want.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "12:58 AM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for your input Kane, but it's not what I was looking for  Your Dwarf has 1 weapon or a 2-hander, which is the (half) opposite of my dualwielding Elf <br/>\n<br/>\nAnd thank you as well, Valerfor, but I have played NWN many times before (yet finished it only 3 times as I've spent most of my time online). It's just that I have new ideas of playing the game beside the standard fighter, or wizard, or whatever<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:14 AM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">One of the characters i enjoyed very much especially in HoTU was a Ranger with bane of enemies and EWS i made. He was so powerful and those many attacks, you could hardly seen him moving his hands!<br/>\n<br/>\nThe truth is that he was a mediocre build but the easiness of the OC/SOU/HoTU and the OP weapons in the game (Rizolvir) made him look like Kratos. Since i did not knew enough back then, i thought he was a killing machine <br/>\n<br/>\nwithout equal    (He even persuade Aribeth!)<br/>\n<br/>\n<br/>\nThe point is, play what you have fun with  <br/>\n<br/>\n<br/>\nAnd if you take some time and see what i linked too, and tell me what you prefer, i will still build you a character with the guys here that will make your fun even greater!<br/>\n<br/>\nLord of Terror has also the same level range and i bet you are gonna enjoy it very very much.. ---&gt; <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/the-lord-of-terror-the-diablo-campaign-t2349855.html\" rel=\"noreferrer\" target=\"_blank\">the-lord-of-terror-the-diablo-campaign-t2349855.html</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:35 AM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey dude,<br/>\n<br/>\nYou may have played for a long time, but in your previous topic and in this one, we can tell that you haven't taken your NWN experience into the depth that we have here at the ECB. No offense, but just the fact that you want to dual-wield Katanas tells us that you don't really know a lot about this game, or else you'd know that katanas are large weapons and you receive a higher penalty for doing so. Or maybe you do know, but the OC is SO EASY that you can finish it dual-wielding Greatswords (you can't, just being sarcastic here ), so you just don't care.<br/>\n<br/>\nI can tell you this: NWN is THE MOST COMPLEX GAME EVER MADE! The realm of possibilities for Character building is just INFINITE or almost. I can tell you from experience that the OC represents ZERO challenge for a good build, so if you REALLY REALLY REALLY want a Katana dual-wielder, the OC is probably the place to do it. <br/>\n<br/>\nThe power in building strong characters comes from the synergies between the classes, things that you gain from one class that complement the things that you gain from another class. As an example, we can quote Mick Dagger's recently posted Divine Bomber, in the level 20 section. It's SUCH A COOL BUILD! It's a Bard / AA / BG. BG gives him save bonuses, Bull's Strength and Divine Might, AA gives him AB points, which allows him to invest his stat points in Charisma for more DM uses per day and higher damage with the bow. And bard comes in as a requirement for AA, but also brings in the skill points, skill set, the Bard Song and a couple of spells. There are SO MANY SYNERGIES in this build that are VERY WELL EXPLORED by Mick.<br/>\n<br/>\nThe guy you want to make will start with a deficit, he will receive a -4 penalty to each attack in both hands because of the size of the Katana, but NOT JUST THAT!!! He will also need at least 15 DEX to dual-wield (ITWF requires it) unless he goes for Ranger, BUT, being a Katana guy, he will need to be STR-oriented, since Katanas aren't finesseable. Rangers can't wear heavy armor or else they lose their dualwielding properties, so you'll have low AC, even lower because you won't be able to carry a shield, having 2 weapons and all. So, basically, unlike the example I explained above of Mick's build, your build is actually SEVERELY HANDICAPPED from the start because of what you want it to do, which on the plus side can make the OC slightly more challenging.<br/>\n<br/>\nAnyway, what I want to explain to you is this: If you are going to dual-wield, the most reasonable thing to do would be to go for a light weapon, and since it has a DEX requirement of 15, it's probably a good idea to go for a DEX-based toon, but if you want STR, you can do what I'll explain next: I'm thinking a simple Fighter / Rogue / WM who wields Kukris should be able to get the job done with ease, if you're interested. You could go Fighter 10 Rogue 3 WM 7. Start with 16 STR, 15 DEX (13 +2 from Elf), 14 CON (16 -2 from Elf), 13 INT, 8 WIS and 8 CHA. All stat points go to STR. You have 5 stat increases until level 20, so you'll end up with 20 STR. <br/>\n<br/>\nI could build you something if you like the idea, but I want to know whether you are willing to let go of the Katana idea first.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:40 AM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Another possibility is a Ranger / Rogue / Shadowdancer. It'll have lower AB, but it'll be much much sneakier. <br/>\n<br/>\nI'll wait for you to answer and then I will show you a couple of builds.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:13 AM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Why, what is the problem with dual-wielding katanas in the OC/SOU/HoTU?<br/>\n<br/>\nMephisto himself has 32 AC.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:36 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Valerfor wrote:</strong>Why, what is the problem with dual-wielding katanas in the OC/SOU/HoTU?<br/>\n<br/>\nMephisto himself has 32 AC.</div></blockquote>\n\n 32 AC! Hard to believe I was ever proud of myself for killing him. <br/>\n<br/>\nThe problem isn't dual-wielding Katanas <strong>on OC, SoU, HotU</strong>, the problem is just with <strong>dual-wielding katanas</strong> and the way that it handicaps the build.<br/>\n<br/>\nIn fact, if you read my post again you'll see that I said that the OC, SoU and HotU are the place to try things like that if one really wants to, I just don't see why someone would want that! I remember when I first started I had a Ranger / Weapon Master who dual-wielded RAPIERS! He could barely hit anything up until the Underdark in HotU, but the only reason I did that was because I didn't know how dual-wielding worked. After I learned, I would never encourage someone to make a gimped build. I'd rather teach them the ropes so they can learn to make powerful characters, after all, this is the ECB, not the GCB (Gimped Character Builders) <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "2:39 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I bow to your wisdom... my silly elf didn't really hit, so I'll take a good look at the dwarf you posted. Only one thing: can I get/buy the dwarven waraxe at start? If yes, imma make meself a <a class=\"postlink\" href=\"http://en.wikipedia.org/wiki/Bruenor_Battlehammer\" rel=\"noreferrer\" target=\"_blank\">Bruenor Battlehammer</a> <br/>\n<br/>\nedit: why the single point in Open Lock? I can just Power Attack to bash those pesky chests open or take Tomi along, right?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:01 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey man!<br/>\n<br/>\nThanks for being open to change your views. It really helps to have that kind of attitude if you don't have enough knowledge of the game's mechanics to make your own overpowered characters. <br/>\n<br/>\nI believe you can buy it right from the start at the Merchant Tutorial guy. Don't remember his name, been a VERY LONG time. Now, not only you can, if you swap some feats around and start with WF: Dwarven Waraxe (take Exotic Proficiency and WF at character creation instead of Power Attack and Cleave and take PA and Cleave on the levels where you'd take WPE and WF), you should be able to pick one up in the chest right behind you in your starting room.<br/>\n<br/>\nThe one point in Open Locks is for WoG (the server where I play), because there, if you bash chests, there is a chance that the loot will be destroyed with the chest. In the OC, you don't need it. <br/>\n<br/>\nFunny thing about Salvatore, I saw a video of one of his interviews, where he talked about the origin of Drizzt, and how he was a last minute sidekick to Bruenor, but then people started sending letters to the editor asking more about the elf, which prompted him to have his own stories.<br/>\n<br/>\nBut, Bruenor Battlehammer is a VERY POWERFUL GUY, I just don't see him as a Red Dragon Disciple. I will show you another build which is, I believe, more suitable for him:<br/>\n<br/>\nFighter(12), Dwarven Defender(26), Rogue(2), Dwarf<br/>\n<br/>\nSTR: 16 (26)<br/>\nDEX: 13<br/>\nCON: 18 (22)<br/>\nWIS: 8<br/>\nINT: 13<br/>\nCHA: 6<br/>\n<br/>\nDwarf: (Darkvision, Defensive Training vs. Giants, Stonecunning, Hardiness vs. Poison, Hardiness vs. Spells, Offensive Training vs. Goblinoids, Offensive Training vs. Orcs, Skill Affinity: Lore)<br/>\n01: Fighter(1): Power Attack, Cleave<br/>\n02: Fighter(2): Weapon Proficiency Exotic<br/>\n03: Fighter(3): Weapon Focus: Dwarven Waraxe<br/>\n04: Fighter(4): STR+1, Weapon Specialization: Dwarven Waraxe, (STR=17)<br/>\n05: Fighter(5)<br/>\n06: Fighter(6): Toughness, Dodge<br/>\n07: Fighter(7)<br/>\n08: Dwarven Defender(1): STR+1, {Defensive Stance}, (STR=18)<br/>\n09: Dwarven Defender(2): Knockdown, {Defensive Awareness I}<br/>\n10: Dwarven Defender(3)<br/>\n11: Dwarven Defender(4)<br/>\n12: Dwarven Defender(5): CON+1, Improved Knockdown, (CON=19)<br/>\n13: Dwarven Defender(6)<br/>\n14: Dwarven Defender(7)<br/>\n15: Dwarven Defender(8): Expertise<br/>\n16: Dwarven Defender(9): CON+1, (CON=20)<br/>\n17: Dwarven Defender(10)<br/>\n18: Fighter(8): Improved Critical: Dwarven Waraxe, Blind Fight<br/>\n19: Fighter(9)<br/>\n20: Fighter(10): CON+1, Great Cleave, (CON=21)<br/>\n21: Dwarven Defender(11): Epic Damage Reduction I<br/>\n22: Rogue(1)<br/>\n23: Dwarven Defender(12)<br/>\n24: Dwarven Defender(13): STR+1, Epic Damage Reduction II, (STR=19)<br/>\n25: Dwarven Defender(14): Epic Damage Reduction III<br/>\n26: Dwarven Defender(15)<br/>\n27: Dwarven Defender(16): Great Strength I, (STR=20)<br/>\n28: Dwarven Defender(17): STR+1, (STR=21)<br/>\n29: Dwarven Defender(18): Epic Weapon Focus: Dwarven Waraxe<br/>\n30: Fighter(11): Great Strength II, (STR=22)<br/>\n31: Fighter(12): Epic Weapon Specialization: Dwarven Waraxe<br/>\n32: Dwarven Defender(19): STR+1, (STR=23)<br/>\n33: Dwarven Defender(20): Great Strength III, (STR=24)<br/>\n34: Dwarven Defender(21)<br/>\n35: Dwarven Defender(22): Overwhelming Critical: Dwarven Waraxe<br/>\n36: Dwarven Defender(23): STR+1, Devastating Critical: Dwarven Waraxe, (STR=25)<br/>\n37: Dwarven Defender(24)<br/>\n38: Dwarven Defender(25)<br/>\n39: Rogue(2): Great Strength IV, {Evasion}, (STR=26)<br/>\n40: Dwarven Defender(26): CON+1, Epic Prowess, (CON=22)<br/>\n<br/>\nHitpoints: 724<br/>\nSkillpoints: 141<br/>\nSaving Throws (Fortitude/Will/Reflex): 30/19/17<br/>\nSaving Throw bonuses: Spells: +2, Traps: +1, Poison: +2<br/>\nBAB: 30<br/>\nAB (max, naked): 42 (melee), 32 (ranged)<br/>\nAC (naked/mundane armor/shield only): 19/30<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nDisable Trap 7(8), Discipline 43(51), Heal 1(0), Open Lock 8(9), Tumble 40(41), UMD 42(40)<br/>\n<br/>\n<br/>\n01: Discipline(4), Save(8), <br/>\n02: Discipline(1), Save(10), <br/>\n03: Discipline(1), Save(12), <br/>\n04: Discipline(1), Save(14), <br/>\n05: Discipline(1), Save(16), <br/>\n06: Discipline(1), Save(18), <br/>\n07: Discipline(1), Save(20), <br/>\n08: Discipline(1), Save(22), <br/>\n09: Discipline(1), Save(24), <br/>\n10: Discipline(1), Save(26), <br/>\n11: Discipline(1), Save(28), <br/>\n12: Discipline(1), Save(30), <br/>\n13: Discipline(1), Save(32), <br/>\n14: Discipline(1), Save(34), <br/>\n15: Discipline(1), Save(36), <br/>\n16: Discipline(1), Save(38), <br/>\n17: Discipline(1), Save(40), <br/>\n18: Discipline(1), Save(42), <br/>\n19: Discipline(1), Save(44), <br/>\n20: Discipline(1), Save(46), <br/>\n21: Discipline(1), Save(48), <br/>\n22: Disable Trap(3), Open Lock(4), Tumble(25), UMD(25), <br/>\n23: Discipline(2), Save(1), <br/>\n24: Discipline(1), Save(3), <br/>\n25: Discipline(1), Save(5), <br/>\n26: Discipline(1), Save(7), <br/>\n27: Discipline(1), Save(9), <br/>\n28: Discipline(1), Save(11), <br/>\n29: Discipline(1), Save(13), <br/>\n30: Discipline(1), Save(15), <br/>\n31: Discipline(1), Save(17), <br/>\n32: Discipline(1), Save(19), <br/>\n33: Discipline(1), Save(21), <br/>\n34: Discipline(1), Save(23), <br/>\n35: Discipline(1), Save(25), <br/>\n36: Discipline(1), Save(27), <br/>\n37: Discipline(1), Save(29), <br/>\n38: Discipline(1), Save(31), <br/>\n39: Disable Trap(4), Open Lock(4), Tumble(15), UMD(17), <br/>\n40: Discipline(2), Heal(1), <br/>\n<br/>\nThis is your typical DWARVEN FIGHTER, a guy who proudly wears his battle scars as a testament to his endurance. Let me know what you think.<br/>\n<br/>\nOne last thing, about my \"WISDOM\". all the information is here, accessible to you provided you want to take the time to learn. Well, not all, but most of it .<br/>\n<br/>\nYou can start with my Complete Guide to the Basics of Character Building, in the Game Guides section. Just <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/a-complete-guide-to-the-basics-of-character-building-t515440.html\" rel=\"noreferrer\" target=\"_blank\">CLICK HERE</a> to get started!<br/>\n<br/>\nSave journey and HAVE FUN!!!<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "5:11 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, that does look like THE Bruenor, minus the Rogue levels  What would you consider a good alternative if I ditch those 2? Go F/DD or add 2 WM to it?<br/>\n<br/>\nI mostly like the idea of having near 200 hp more than the F/B/RDD build, but the disable trap comes (way) too late imho, and I can take Tomi for that. On henchmen, I know I can rotate between them, but I always like having atleast 2 who I can swap if needed, and those two are Tomi (for traps) and Linu (for heals and buffs). Daelan is strong, but it itches me to go into battle with 2 fighters, I prefer to spread the abilities in combat  I've read that Linu is for ranged combat and buffing, but I kinda enjoy having her right at my side for melee damage...<br/>\n<br/>\nedit: on WM, I've just seen that adding only 2 of them is not really great, either none or 7 lvls to make good use of that class, but that's my inexperienced opinion.<br/>\n<br/>\nedit2: on Drizzt, I believe Salvatore meant Wulfgar to be the hero of the series, with indeed Drizzt as a last minute sidekick, but after 3 or so chapters, Salvatore discovered Drizzt would be the star of it all<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:22 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Rogue is there for the skill dumps. There is not really another class that you can put in there that will give you that much benefit. Rogue gives you Tumble as a Class Skill and UMD (Use Magic Device), which are just THE TWO MOST IMPORTANT SKILLS IN THE GAME. Tumble adds +8 to AC at level 37 (+1 for every 5 ranks in it) and UMD allows you to cast from scrolls. The only two other classes that give you these two skills as class skills are Bard and Assassin. Bruenor isn't an Assassin kind of guy for sure, and Bard could be OK, but it doesn't give you Sneak Attack or Evasion, so basically, you'll be less effective with Bard than with Rogue. Don't think too much of it, though, the Rogue levels could represent that he has had contact with the \"underworld\", or \"shady dealings\" in the past, or just that he is \"street safe\". having Rogue levels doesn't necessarily make Bruenor an outlaw, you know?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "5:37 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And now you have me debating my choice again... lol.<br/>\n<br/>\nSTR 42 vs 26<br/>\nCON 18 vs 22<br/>\nHealth: 576 vs 724 (with Def Stance on I presume?)<br/>\n<br/>\nI really fancy the überstrength of the first build, I'll go with that one... I think <br/>\n<br/>\nOh, and for the Bard part: SONGS OF BATTLE! RHAAAGH!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:07 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice solid advices max, but i think you try to learn Moredhel too many things at once.<br/>\n<br/>\n<br/>\nAs i understood so far, the OP needs to have a concept to work upon so he get attached to his character or else no ammount of optimization will make him keep his character.<br/>\n<br/>\nWhere you see a perfect 50 AB build with dragon powers, he sees only an ugly dward with an axe and a shield and no interesting stuff to do. Sword &amp; board is the most boring setup for a player.<br/>\n<br/>\nI say you play something intersting Moredhel, either dual-wield or grasp a two-handed weapon and go to town. King Harbroom had a greataxe, Driiz't had dual-scimitars, Sturm Brightblade will have divine might and so on.<br/>\n<br/>\n<br/>\nYou will hardly need the AC of a tower shield if you use a simple thing. Knockdown! You can make them cry with this feat in all of OC/SOU/HoTU and with the extra damage from either dual-wield or a good two-hander they will be <br/>\n<br/>\ndead before you know it. I made a pure barbarian recently and played rapidly SOU &amp; HoTU. I stayed in medium armor for RP reasons too. No full tumble, no shield AC, i had the  Greatsword HArbinger +8 and still 55 AC on HoTU.<br/>\n<br/>\nThey were dead in the first flurry usually and i have Tony's AI inside and i play on HArdcore only. I believe the normal settings are more forgiving, especially without Tony's.<br/>\n<br/>\n<br/>\nSo, give him something he can adhere to. Also i believe that we must give Modhere a build that rises to power as early as possible even at the cost of later power.<br/>\n<br/>\nI am willing to help what i can, but i need to know what you want to play first. Find a concept that you really like and let us know what this is. Then we will give you the best.<br/>\n<br/>\nBut as it is now max tries all too sincerely to help giving his best, without knowing exactly what you want first.<br/>\n<br/>\n<br/>\nJust my 2 coppers,<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "6:40 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">No, I like both builds!  I don't mind being a \"boring\" sword and board character, as it fits the usual idea of that one being the hero (and personally I simply cannot play Dragon Age Origins as anything else than a tankwarrior, because if I pick an archer or rogue or something, the feeling of epicness flies out the window). In Morrowind I tend to play the melee type of guy as well, so it's ok for me to play this style <br/>\n<br/>\nYou do make a point with your \"rise to power early\" comment, though. The whole Tumble and UMD feel kinda lost to me if I can select them no earlier than, say, lvl 22.<br/>\n<br/>\nMax, could you possibly redo (or give advice on) your F/R/DD build so I can get certain feats earlier in-game? I was thinking of picking 8 fighter/1 rogue/1 dwarven defender so I can have both the tumble/umd and def stance by the time I enter Luskan.<br/>\n<br/>\nedit: I also fancy sinking the Lockpickpoints into Disable Trap, I bet that won't hurt the build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "6:53 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Something like this:<br/>\n<br/>\n01: Fighter(1): Power Attack, Cleave<br/>\n02: Fighter(2): Weapon Proficiency Exotic<br/>\n03: Fighter(3): Weapon Focus: Dwarven Waraxe<br/>\n04: Fighter(4): STR+1, Weapon Specialization: Dwarven Waraxe, (STR=17)<br/>\n05: Fighter(5)<br/>\n06: Fighter(6): Toughness, Dodge<br/>\n07: Fighter(7)<br/>\n08: Fighter(8): Improved Critical: Dwarven Waraxe, Blind Fight<br/>\n09: Dwarven Defender(1): STR+1, {Defensive Stance}, (STR=18)<br/>\n10: Rogue (1)<br/>\n<br/>\n01: Discipline(4), Save(8),<br/>\n02: Discipline(1), Save(10),<br/>\n03: Discipline(1), Save(12),<br/>\n04: Discipline(1), Save(14),<br/>\n05: Discipline(1), Save(16),<br/>\n06: Discipline(1), Save(18),<br/>\n07: Discipline(1), Save(20),<br/>\n08: Discipline(1), Save(22),<br/>\n09: Discipline(1), Save(24), <br/>\n10: Disable Trap(10), Tumble(10), UMD(4), assuming my calculations are correct.<br/>\n<br/>\nAs you see, I prefer focussing more on the ability to disable a trap, and less on UMD.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:07 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey dude. <br/>\n<br/>\nEvery build is tweakable, you can do that if you want, but I wouldn't. As Valerfor says, you don't really NEED any of that in the OC. I only discovered Tumble gave you AC after finishing HoTU 100 times LOL. The problem with doing things this way is that you would have to drop a feat and you'd lose 1 AB on a build that \"technically\" is already a low AB build, but like he said, Mephistopheles has 32 AC, so it doesn't even matter.  . The only real droppable feats there are: Exotic Weapons and Improved Knockdown. The remaining feats are either requirements for something else (Cleave, Great Cleave and Improved Critical for DevCrit, Power Attack for Cleave, Dodge and Toughness for Dwarven Defender) or VERY USEFUL FEATS (Expertise saves you LOTS OF DEFENSIVE STANCES for the most important battles, KD goes without saying and Blind Fight is ESSENTIAL for all meleers when fighting concealed creatures or when you're blinded. And, this build only has two Rogue levels to spread around 40, so if you choose to take a pre-epic skill dump, you'll suffer later on with the lack of another dump for many levels.<br/>\n<br/>\nWhat I would advise you to do is this: if you REALLY value playability that much, change the spread. Add more Rogue levels, in which case you don't even have to use my build, you can go with Grizz's Citadel, which is a VERY POWERFUL build that takes more Rogue for Crippling Strike and is WAY MORE PLAYABLE than mine (well, it's way more powerful until level 22, then mine would be better).<br/>\n<br/>\nHere's the build:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build249289.html\" rel=\"noreferrer\" target=\"_blank\">CLICK HERE</a><br/>\n<br/>\nYou can do as you please, it's important that you like your character, but I'm just telling you what I think is best. Sometimes you need to do the exact opposite to learn why it is that I'm suggesting what I am and then you'll start understanding not just the advice I'm giving you, but also WHY I'm giving it to you.<br/>\n<br/>\nEDIT: Just saw your post. Forgot to mention that 724 HP is WITHOUT Defensive Stance. <br/>\n<br/>\nNow, not knowing the value of UMD is something very common in beginning players. You don't really NEED to buff up for ANY encounter, not even bosses, so it does kind of seem like overkill (and given the level of difficulty you'll be facing, it SURELY IS ). But, trust me when I say, if you EVER go beyond the OC, UMD will be VITAL. It's one thing to go into a battle with a full plate and a weapon, it's another one to go with a Bless potion, an Aid potion, a Stoneskin scroll, a Flame Weapon scroll, an Improved Invisibility scroll, a Bull's Strength scroll, etc.. In some places, those buffs will mean the difference between victory and defeat. Unfortunately for you, the OC is not one of those. Why don't you give that Diablo module that Valerfor mentioned a try? It's going to BLOW YOUR MIND!<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "7:25 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">724hp without def stance? *jaw hits floor*<br/>\n<br/>\nI will follow your build and take Linu along in my journeys for buffs<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:27 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey dude!<br/>\n<br/>\nThis is MY version of the Citadel. I just changed a couple of feats around and the skills. Here it is:<br/>\n<br/>\nFighter(4), Rogue(10), Dwarven Defender(26), Dwarf<br/>\n<br/>\nSTR: 16 (26)<br/>\nDEX: 13<br/>\nCON: 18 (22)<br/>\nWIS: 8<br/>\nINT: 13<br/>\nCHA: 6<br/>\n<br/>\nDwarf: (Darkvision, Defensive Training vs. Giants, Stonecunning, Hardiness vs. Poison, Hardiness vs. Spells, Offensive Training vs. Goblinoids, Offensive Training vs. Orcs, Skill Affinity: Lore)<br/>\n01: Rogue(1): Luck of Heroes<br/>\n02: Rogue(2): {Evasion}<br/>\n03: Fighter(1): Knockdown, Weapon Focus: Warhammer<br/>\n04: Fighter(2): STR+1, Dodge, (STR=17)<br/>\n05: Fighter(3)<br/>\n06: Rogue(3): Toughness, {Uncanny Dodge I}<br/>\n07: Rogue(4)<br/>\n08: Rogue(5): STR+1, (STR=18)<br/>\n09: Rogue(6): Improved Knockdown<br/>\n10: Dwarven Defender(1): {Defensive Stance}<br/>\n11: Dwarven Defender(2): {Defensive Awareness I}<br/>\n12: Dwarven Defender(3): STR+1, Expertise, (STR=19)<br/>\n13: Dwarven Defender(4)<br/>\n14: Dwarven Defender(5)<br/>\n15: Dwarven Defender(6): Blind Fight<br/>\n16: Dwarven Defender(7): STR+1, (STR=20)<br/>\n17: Rogue(7)<br/>\n18: Dwarven Defender(8): Improved Critical: Warhammer<br/>\n19: Dwarven Defender(9)<br/>\n20: Dwarven Defender(10): CON+1, (CON=19)<br/>\n21: Dwarven Defender(11): Armor Skin<br/>\n22: Dwarven Defender(12)<br/>\n23: Dwarven Defender(13)<br/>\n24: Dwarven Defender(14): CON+1, Great Strength I, Epic Weapon Focus: Warhammer, (STR=21), (CON=20)<br/>\n25: Dwarven Defender(15)<br/>\n26: Dwarven Defender(16)<br/>\n27: Fighter(4): Weapon Specialization: Warhammer, Epic Weapon Specialization: Warhammer<br/>\n28: Rogue(8): CON+1, (CON=21)<br/>\n29: Dwarven Defender(17)<br/>\n30: Dwarven Defender(18): Epic Damage Reduction I, Epic Damage Reduction II<br/>\n31: Dwarven Defender(19)<br/>\n32: Rogue(9): STR+1, (STR=22)<br/>\n33: Dwarven Defender(20): Great Strength II, (STR=23)<br/>\n34: Dwarven Defender(21)<br/>\n35: Dwarven Defender(22): Epic Damage Reduction III<br/>\n36: Dwarven Defender(23): STR+1, Great Strength III, (STR=25)<br/>\n37: Rogue(10): Crippling Strike<br/>\n38: Dwarven Defender(24)<br/>\n39: Dwarven Defender(25): Great Strength IV, (STR=26)<br/>\n40: Dwarven Defender(26): CON+1, Epic Prowess, (CON=22)<br/>\n<br/>\nHitpoints: 692<br/>\nSkillpoints: 207<br/>\nSaving Throws (Fortitude/Will/Reflex): 29/20/21<br/>\nSaving Throw bonuses: Spells: +2, Traps: +2, Poison: +2<br/>\nBAB: 28<br/>\nAB (max, naked): 40 (melee), 30 (ranged)<br/>\nAC (naked/mundane armor/shield only): 21/32<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nDisable Trap 40(43), Discipline 43(51), Search 20(21), Set Trap 20(23), Spot 7(6), Tumble 40(41), UMD 37(35)<br/>\n<br/>\n<br/>\n01: Disable Trap(4), Search(4), Set Trap(4), Tumble(4), UMD(4), Save(16), <br/>\n02: Disable Trap(1), Search(1), Set Trap(1), Tumble(1), UMD(1), Save(20), <br/>\n03: Discipline(6), Save(17), <br/>\n04: Discipline(1), Save(19), <br/>\n05: Discipline(1), Save(21), <br/>\n06: Disable Trap(4), Search(4), Set Trap(4), Tumble(4), UMD(4), Save(10), <br/>\n07: Disable Trap(1), Search(1), Set Trap(1), Tumble(1), UMD(1), Save(14), <br/>\n08: Disable Trap(1), Search(1), Set Trap(1), Tumble(1), UMD(1), Save(18), <br/>\n09: Disable Trap(1), Search(1), Set Trap(1), Tumble(1), UMD(1), Save(22), <br/>\n10: Discipline(5), Save(20), <br/>\n11: Discipline(1), Save(22), <br/>\n12: Discipline(1), Save(24), <br/>\n13: Discipline(1), Save(26), <br/>\n14: Discipline(1), Save(28), <br/>\n15: Discipline(1), Save(30), <br/>\n16: Discipline(1), Save(32), <br/>\n17: Disable Trap(8), Search(4), Set Trap(8), Tumble(8), UMD(8), Save(5), <br/>\n18: Discipline(2), Save(6), <br/>\n19: Discipline(1), Save(8), <br/>\n20: Discipline(1), Save(10), <br/>\n21: Discipline(1), Save(12), <br/>\n22: Discipline(1), Save(14), <br/>\n23: Discipline(1), Save(16), <br/>\n24: Discipline(1), Save(18), <br/>\n25: Discipline(1), Save(20), <br/>\n26: Discipline(1), Save(22), <br/>\n27: Discipline(1), Save(24), <br/>\n28: Disable Trap(11), Tumble(11), UMD(11), <br/>\n29: Discipline(2), Save(1), <br/>\n30: Discipline(1), Save(3), <br/>\n31: Discipline(1), Save(5), <br/>\n32: Disable Trap(4), Search(2), Tumble(4), UMD(4), <br/>\n33: Save(3), <br/>\n34: Save(6), <br/>\n35: Save(9), <br/>\n36: Save(12), <br/>\n37: Disable Trap(5), Search(2), Spot(7), Tumble(5), UMD(2), <br/>\n38: Discipline(3), <br/>\n39: Discipline(3), <br/>\n40: Discipline(3), <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "8:07 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for that build, mate  I have one question, if it doesn't bother you: what if I still want to use the exotic weapons &gt; dwarven waraxe? Please bear with me and don't immediately discourage me from trying <br/>\n<br/>\nWould it look like this:<br/>\n<br/>\n01: Fighter(1): Luck of Heroes, Weapon Proficiency: Exotic<br/>\n02: Fighter(2): Weapon Focus: Dwarven Waraxe<br/>\n03: Fighter(3)<br/>\n04: Rogue (1): Evasion<br/>\n05: Fighter(4): Power Attack, Cleave<br/>\n<br/>\n01: Discipline(4), Save(8),<br/>\n02: Discipline(1), Save(10),<br/>\n03: Discipline(1), Save(12),<br/>\n04: Sink points into Disable, Search, Tumble, UMD, Save what's left (if able)<br/>\n05: Discipline(1), Save X<br/>\n<br/>\nWould this work? I just fancy starting out as a Fighter instead of a Rogue.<br/>\n<br/>\nedit: oh yeah, what would my char wear? (Half) Plate and (Tower) shield or something less encumbering/more DEX-forgiving for Rogue abilities?<br/>\nedit 2: maybe switch lvl 4 and 5 for earlier PA and Cleave and more Rogue skillpoints?<br/>\nedit 3: reached Fighter(4) at early stage, thus having the basis, so I can add up to Rogue(10) and DD(26) later.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:00 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I second max's previous statement. \"UMD is vital outside OC/HoTU\", well said.<br/>\n<br/>\n<br/>\n1) If you start with fighter you will loose 24 skill points that you can't recover later. Characters start their lives with 4 X {Int. Modifier + (class skill points)} at level 1. That's the reason he goes with Rogue first.<br/>\n<br/>\n2) Uncanny Dodge is not the same as Dodge. It is a class feauture of the Rogue and some other classes and valuable in DEX builds most of all but a good thing to have anyway. You don't loose your DEX modifier to AC ever.<br/>\n<br/>\n3) You cannot take Dwarven Waraxe at 1st level if you start as a rogue since i believe it has a BAB requirement. Starting as a fighter you could but you will loose many skill points. You can take it later in the build though.<br/>\n<br/>\n4) Your character if he is a Dwarven Defender or generally a melee STR-based build should always wear the heviest armour possible. That means Full Plate with a Tower Shield strapped on your off hand.<br/>\n<br/>\n5) Encumberance will hardly matter in a STR build. Soon you will be able to carry Tons!<br/>\n<br/>\n<br/>\nDragon Age Origins, warrior but with a 2-hander for me, i loved that giant cleavers   <br/>\n<br/>\n<br/>\nLet me close with another number just for kicks,<br/>\n<br/>\nDrow ARCHmage with 13 AC<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "9:15 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the reply, Valer <br/>\n<br/>\nI'll follow the build as it is then, but include exotic and waraxe and see which skills I'll ditch later on. Since my char will start as a rogue, his name will not be Bruenor Battlehammer. I'm trying to remember what my Dwarf Warrior (or Paladin, I forgot) in WoW is called, but it's been months, quite possibly 1,5 years, ago since I played... since it's been that long I can't log in on the forum to see all my chars, unless they changed that. Ah well...<br/>\n<br/>\nAtleast I already found a kickass image for portrait:<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i59.tinypic.com/123448n.jpg\" /><br/>\n<br/>\n<br/>\n<br/>\nedit: A-HA! I could log in and see the name: Hyurgish!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:26 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's a great portrait!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "9:36 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm not entirely sure about Set Trap, though I can see the fun in setting a nasty trap and then luring an enemy (or more) in and start kicking ass, but I think I'll just rush into battle. Was considering to put those points in Intimidate or Persuade since he's a gruff bastard, even with Lawful Good/Neutral as Alignment, because hey, Inquisitors also did things to get the answers they sought, right?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:45 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey man!<br/>\n<br/>\nThe picture looks AWESOME!! Can you send me the file? I'd love to add it to my NWN portraits list. <br/>\n<br/>\nAs to your questions, starting with Rogue is good because of skill points, as Valerfor already explained. The fact he starts with Rogue shouldn't prevent you from naming him Bruenor Battlehammer, and his name is Battlehammer, so he should carry a Battlehammer . But, if you want the waraxe, you'll have to drop a feat for it. What would you drop? Probably Improved Knockdown or Improved Critical. Actually, since this build doesn't go for Devastating Critical, there's no reason not to drop Improved Critical. In truth, the difference in weapon isn't going to be worth the feat investment. With a Warhammer, you'll be doing 1d8 damage and critting for 19-20 / x3. With the Dwarven Waraxe, you'll have 1d10 damage critting for 19-20 / x2. One thing that doesn't really matter in the OC but will in other worlds is that Slashing-type damage resistance is way more common than Bludgeoning-type. Not just because of damage belts, but Undead creatures alone have Slashing and Piercing resistance, while no Bludgeoning resistance.<br/>\n<br/>\nAnyway, if you want to wield a waraxe go for it, but DON'T TAKE THAT FIGHTER LEVEL BEFORE. The reason why that 4th Fighter level is delayed is because you need to wait until the epics to be able to take Epic Weapon Specialization. Since there are only 4 Fighter levels in that build, you have to wait until a general feat level in epics to take that.<br/>\n<br/>\nThe alternative is to change the whole spread of the build, lowering your DR and HP for one more feat and the ability to anticipate the Fighter feats. You can go Fighter 8 Rogue 10 DD 22. You would lose 8 HP, 3 /- Damage Reduction, but gain 1 feat (lose 1 feat from DD 26, gain 2 feats from Fighter 6 and Fighter 8). Then you would be able to take 6 Fighter / 4 Rogue 10 DD pre-epic, getting fewer skill dumps, but gaining 1 BAB and the extra feat you got could be used to get the Exotic Weapons you want so bad. Would you like me to build you that alternative?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:51 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">LOL, again, the OC thing. Yeah, go for Persuade. In the OC, it should be more useful than anywhere else. The thing is that with your high Disable Traps total, you can recover traps, then set them against your enemies. Equip a bow, shoot an arrow and lure them to the green carpet of death!!!! Of course, you'd have to know the \"trick\" for setting multiple traps in one spot. If you want to, I can teach you. Send me a PM about it.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:01 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Tha thing that does matter though and goes in Warhammer's favour once more is that in OC you will get random drops throughout the game depending on your weapon focus selection.<br/>\n<br/>\nAnd i believe the Warhammer option is the only +5 weapon there is. Can't rememberthe name though. <br/>\n<br/>\nAnd max's right, max out that persuade, you will make tons of checks based on it. Although i don't remember if Aribeth is an option for Dwarves later in HoTU or not.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "10:07 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hehe, just download the picture and use the nifty little program called Converter v1.62 (don't forget to place both in your NWN folder!) and you're done <br/>\n<br/>\nAbout the slashing vs. bludgeoning: does that also count for SoU and HotU?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:32 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Wherever you face Undead creatures, it's best to have Bludgeoning damage. It's not so bad for you because you are a STR toon, so you dish out enough damage to bypass their resistance with ease. Nothing is a problem in SoU / HoTU. The whole thing is just too easy. <br/>\n<br/>\nYou'll understand that if you ever come to play on WoG, and fight Lord Vaine and Althea at around level 30 and Aspect of Orcus, White Dragon King, Llolth, or even Eclavdra in your 30s. THOSE are challenging encounters. Imagine, just for the kicks, that the Drow Wizards (regular mobs, not special bosses like The Valsharess), have Time Stop, Greater Ruin, Mummy Dust, Epic Mage Armor, and they cast Mordenkainen's Disjunction to strip you clean of all your buffs and protections, and there are like 5 of them per screen. Now THAT, is fun <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:32 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I remembered the name finally, it is the \"Hammer of Thunderbolts\".<br/>\n<br/>\nCan't remember if there is a good Dwarven Waraxe in OC &amp; SOU although in HoTU there are two of them that are nuts!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:40 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Can't believe we talk so much about these sub*par campaigns like OC/SOU/HoTU while there is so many fantastic PW's to play on or even superb single player modules like \"The lord of Terror\" or \"Aielund\" lol, must be the wine or something   <br/>\n<br/>\nYou know, i think that the positive energy of the OP and the fact that sadly there is not so many people online usually to discuss things, brought this. hehe, anyway this is fun, we tell stories, make builds for the OC, tis a good time we have!<br/>\n<br/>\n<br/>\nHeh, couldn't resist... <br/>\n<br/>\nThe Lich Lord CR 28 has 17 AC.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "10:53 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">*grin* Enjoy your wine, I might take some in a few hours as well (it's 11pm here in the Netherlands, but I prefer to drink after midnight) <br/>\n<br/>\nI'm sticking with waraxe thought, feels cooler than a warhammer. I'll just see how it ends up later, prolly need a bit more rogue or fighter lvls, sacrificing a DD thingsy later on. If you'll excuse me now, I have some bastards to slay!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "11:23 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh by the gods... I cannot even get my hands on a waraxe in the OC?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:41 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Moredhel wrote:</strong>Oh by the gods... I cannot even get my hands on a waraxe in the OC?</div></blockquote>\n\nWell, I don't remember, but I think it was one of those weapons that were introduced into the game afterwards, in one of the later patches / expansions, so probably not. Warhammer it is<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:49 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Heh, seems the game itself want you to make the best choice, and Bruenor may once again be called \"Battlehammer\"   <br/>\n<br/>\nOr you could just throw them both in the basketr and take the Ravager as your weapon of choice (Halberd), one nasty weapon this is! But no, i don't want to confuse you more with more choices!<br/>\n<br/>\nNice avatar btw, is this Jarlaxle?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "11:55 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Siiiiiigh...<br/>\n<br/>\nSo now I get to choose between warhammer, greataxe and halberd, although the latter doesn't sound dwarvish to me <br/>\n<br/>\nAnd no, my avatar is Drizzt Do'Urden  THIS is Jarlaxle:<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i5.photobucket.com/albums/y178/MarkusTay/Posters/Jarlaxle.jpg\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:58 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Why don't you start him on SoU, then the Waraxe should be vailable<br/>\n<br/>\nJust a thought<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "12:00 AM - Feb 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nope, because the waraxe was introduced in HotU<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "12:14 AM - Feb 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh well, I remember smashing my enemies with the <a class=\"postlink\" href=\"http://uesp.net/wiki/Morrowind:Skull_Crusher\" rel=\"noreferrer\" target=\"_blank\">Skull Crusher</a> and later <a class=\"postlink\" href=\"http://uesp.net/wiki/Morrowind:Sunder\" rel=\"noreferrer\" target=\"_blank\">Sunder</a> in Morrowind, so I guess I can do the same in NWN  Hyurgish Battlehammer, Dwarf Fighter/Rogue/Dwarven Defender at the ready!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:17 AM - Feb 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I vote for Zak over both of them, but nice picture anyway<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:42 PM - Feb 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Val, check your private messages<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:00 PM - Feb 24, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Noted, check yours too<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "6:40 PM - Feb 24, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well slap me on the bottom and call me Sally, do I have two lovebirds in my topic?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:25 PM - Feb 24, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ha haha ha, rather an exchange of secret services<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:36 AM - Feb 26, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">We are secretly plotting your demise, Moredhl<br/>\n<br/>\n<br/>\n<br/>\nVal, I have read your message, just haven't had time to reply it. Thursday I will have free time. I'll do it then. I know I'm writing here right now, but this is quick, that won't be.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "12:31 PM - Feb 26, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Pff, plotting MY demise? May the both of you suffer a mild tickling cough!<br/>\n<br/>\nMUAHAHAHAHA! *cackle*<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:52 PM - Feb 26, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "9:21 PM - Mar 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Valerfor wrote:</strong><br/>\n<br/>\nOkay, here are two builds for you based on what do you asked. The first one is the simplest and the second one is the more advanced. Both of them are very close to what you are looking for (and i think you should stick close to a pure build for start).<br/>\n<br/>\nPure Fighter ---&gt;  <a class=\"postlink\" href=\"http://worldofgreyhawk.fr.yuku.com/topic/2262/A-Simple-Fighter-with-not-sosimple-weapons-140\" rel=\"noreferrer\" target=\"_blank\">http://worldofgreyhawk.fr.yuku.com/topi ... eapons-140</a><br/>\n</div></blockquote>\n\nLOL, that was the build I made to run in a pure class party way back when.  Valerfor, his name was Mirumoto Hojatsu  and he ended up at lvl 35/36 (don't remember) when the party finished up.  Definitely not fully optimized but that's why it was a pure 40.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:49 PM - Mar 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey, he wasn't bad at all imho,<br/>\n<br/>\nwe are talking pure builds here &amp; you found a descent use for those 36 bonus feats!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}