{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "750",
  "name": "The Second Sons of Solonor (Rogue 5 / Wizard 24 / AA 11)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-second-sons-of-solonor-rogue-5-wizard-24-aa-11-t2355253.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 9,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:18 AM - Dec 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong><span style=\"font-size:150%;line-height:normal\">The Second Sons of Solonor: The Elven Special Forces (Rogue 5 / Wizard 24 / AA 11)</span></strong><br/>\n<br/>\n<strong><span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201912/10759084_17b81085200b7e778cf4ace1f78459e2.jpg\" />\n</dl>\n</span></strong><br/>\n<strong>Lore:</strong><br/>\nAt the height of dominance of Cormanthyr, the once fabled Empire of the Elves, the greatest challenge faced by the elves were not external threats to survival such as deforestation, expansion of the other humanoid races and a declining fertility rate, but threats from within - from the internal political machinations of the once great family houses of Cormanthyr. <br/>\n<br/>\nTradition held that the first born son inherited everything that belonged to the father, in the case of the great houses, this meant practically rulership of large portions of the elven empire. All other siblings were considered 'spares' in that they would be next in line until the first born son bore offspring, unless something lethal happened to the heir in waiting. And once the first born son took rulership and bore their offspring, the siblings of the new ruler of the House found they no longer had any further role, any further possessions, any further purpose and were cast aside to find their own way in the world.<br/>\n<br/>\nThe more intelligent younger siblings sought out roles early in their life preparing for their noble titles to be stripped from them over time, becoming craftsman, warriors, clerics, bards and wizards.<br/>\n<br/>\nIn 650 DR the elven city of Myth Drannor was gripped by a crisis. Haemir Ralororis, the second born son of House Ralororis, and one of the greatest and most intelligent wizards of his generation, gathered together in his arcane tower a group of powerful elven second born princes and princesses and quietly plotted to eliminate the heirs to their respective houses before they could bear offspring.<br/>\n<br/>\nIn the course of 5 months, eight first born sons of the great Houses of Myth Drannor suddenly died in 'unfortunate' circumstances. <br/>\n<br/>\nThe city was in uproar. An elven lifespan lasts centuries, and for eight crown princes to suddenly die was outrageous. A thorough investigation was instigated by the grieving Lords, and Haemir and his group were discovered.<br/>\n<br/>\nRather than simply execute their second born children, the Lords decided a more appropriate punishment would be to strip them from the line of succession, place a blood-hex upon them, forcing them into irrepressible loyalty to the empire until death. Following which they were ordered to use their combat prowess, their arcane powers and their stealth and survival skills to serve the empire, infiltrating the outer enemy territories. <br/>\n<br/>\nThis newly formed regiment, the Second Sons of Solonor, was so effective that the enemies of the empire were so terrified of these dark special elven forces, that they immediately complied with the empires diplomatic request out of fear of these arcane warriors. <br/>\n<br/>\nAnd the empire had now discovered ways of managing the more ambitious and skilled younger siblings and potential rivals to the heir...<br/>\n<br/>\n<strong>Detail:</strong><br/>\nI was on a long drive interstate (approximately 450km) when I came up with this build idea.<br/>\n<br/>\nBalanced melee / ranged / spellcasting / stealth &amp; rogue skill using.<br/>\n<br/>\nBase AB 39 Melee, Base AB 39 ranged with +6 enchantment (able to penetrate stoneskin/greater stoneskin/premonition), level 9 spells with eventual 'undispellability', almost 300 skill points with access to the rogue class skills ie high stealth/listen skills, able to set deadly traps/?recover deadly traps / tumble 40 / UMD 33 to cast any spell, Epic Mage Armor, Epic Warding, Keen Senses<br/>\n<br/>\nThis is the Jack of all Trades, effective at everything without being the master at anything.<br/>\n<br/>\nMain weakness I think might be the HP, I've got it to about 300 which is probably good enough, but a little more would be nice. <br/>\n<br/>\nWill save is a little low but hopefully lesser mind blank / mind blank can cover that without any issues. Also there is +7 to saves against spells +2 to mind effects which also helps with boosting this up <br/>\n<br/>\nAnyway haven't playtested it so I've put this build here. Designed it for WoG, where PnP Tensors can seriously boost up the AB and HP, also stuff like GMW on bows, arrows and flame weapon on bows is very handy to make this guy very strong.<br/>\n<details><summary>Spoiler</summary>Rogue(5), Arcane Archer(11), Wizard(24), Elf\nSTR: 15 (28)\nCON: 12\nINT: 16 (19)\n\n01: Rogue(1): Point Blank Shot\n03: Wizard(1): Weapon Focus: Longbow, {Scribe Scroll}\n05: Wizard(3)\n07: Wizard(5): Extend Spell\n09: Wizard(6): Blind Fight\n11: Arcane Archer(1)\n13: Arcane Archer(3)\n15: Arcane Archer(5): Weapon Focus: Greatsword\n17: Arcane Archer(7)\n19: Arcane Archer(9)\n21: Wizard(7): Epic Weapon Focus: Longbow\n23: Wizard(9)\n25: Wizard(11)\n27: Arcane Archer(11): Epic Prowess\n29: Wizard(14)\n31: Wizard(16)\n33: Wizard(18): Great Strength II, (STR=25)\n35: Wizard(20): Great Intelligence III, (INT=19)\n37: Rogue(5)\n39: Wizard(23): Great Strength III, Epic Spell: Epic Warding, (STR=27)\n\nSkillpoints: 295\nSaving Throw bonuses: Spells: +7, Mind Effects: +2\nAB (max, naked): 39 (melee), 39 (ranged)\nSpell Casting: Wizard(9)\n\n\n01: Disable Trap(4), Hide(4), Listen(4), Move Silently(4), Open Lock(1), Search(4), Set Trap(4), Tumble(4), UMD(4), Save(11), \n03: Concentration(6), Save(13), \n05: Concentration(1), Save(21), \n07: Concentration(1), Save(29), \n09: Concentration(2), Save(3), \n11: Hide(1), Listen(5), Move Silently(1), \n13: Hide(1), Listen(1), Move Silently(1), Save(5), \n15: Hide(1), Listen(1), Move Silently(1), Save(13), \n17: Hide(1), Listen(1), Move Silently(1), Save(21), \n19: Hide(1), Listen(1), Move Silently(1), Save(29), \n21: Spellcraft(24), Save(14), \n23: Spellcraft(1), Save(22), \n25: Save(32), \n27: Save(44), \n29: Save(54), \n31: Save(65), \n33: Save(77), \n35: Save(89), \n37: Disable Trap(8), Hide(17), Listen(17), Move Silently(17), Tumble(27), UMD(21), \n39: Concentration(2), Spellcraft(4), </details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:25 AM - Dec 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Very nice!<br/>\nAn undispellable spellsword with 4 attacks/round and AB 39. It also has good ranged potential. If you can find a good mighty bow, you don't even need the ranged boosts available on WoG. Deadly traps add to the repertoire. The spells DC is not the best, but non-save spells like IGMS and the Bigby series will still be very strong weapons. And if you can exploit the low saves of your targets, other attack-spells can also add to your versatility.<br/>\nAC may be an issue when going mele with a two hander. Stoneskins only help until your opponents have +5 weapons. You have no Still spell, but if you can cap dexterity, robes give the same AC that a full plate would give. There are tactical ways around this with your versatility, but you have to give it some attention.<br/>\n<br/>\nUnless you want to recover traps, you dont need that many skill points in Disable trap. 1 rank is enough to recover your own traps, 16 (modified ranks) to disarm vanilla deadly traps and 26 to recover deadly traps. As a mage you have a spell that can disable all traps in the vicinity, so there may be some points to spare here. If you want to recover traps, beware that you may get XP from disarming floor traps, but not from recovering them. For some strange reason that does not happen with traps on doors and containers - there you get XP also when you recover. <br/>\nYou may want to put more points in Spellcraft and Concentration, or perhaps in Craft trap. <br/>\nYou can also have the Pixie familiar help you with rogue skills. You have the Knock spell to help you with locks. Or you can blast doors and containers open with fireballs, the way I do with my mages.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:21 AM - Dec 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is a pretty cool build!<br/>\n<br/>\nWith both Epic Mage Armor AND Epic Warding, it will punch AC and DR wise way above it's mundane self.<br/>\n<br/>\nOne doesn't really need to recover Traps on WoG - there are enough trap vendors where one can purchase them.  They are really cheap, considering.<br/>\n<br/>\nAny way to fit Craft Wand in there?  Scrolls are fine, but having 50 charges of 1-4th spells is nifty!   Esp. a Wand of Lesser Breach would just be the cat's meow!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:30 AM - Dec 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"17828\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17828&amp;sid=84c675eccebc991be28830d81f069139#p17828\">↑</a><div class=\"responsive-hide\">Dec 05, 2019</div></cite>\nAny way to fit Craft Wand in there?  Scrolls are fine, but having 50 charges of 1-4th spells is nifty!   Esp. a Wand of Lesser Breach would just be the cat's meow!</div></blockquote>\nI thought one could include Craft Wand by swapping it for Extend Spell <br/>\n<br/>\nThanks for the tip on trap vendors<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "ratty_uk2011",
      "avatar": "no_avatar.png",
      "timestamp": "1:01 PM - Dec 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Cracking backstory!   And I never realised AA unlocked Martial Weapons and Sheilds.<br/>\n<br/>\nI'd be tempted to get Craft Wand and Extend Spell in by L20 at the cost of one of the Greatsword feats.<br/>\n<br/>\nAnd maybe go sword (longsword) &amp; board instead for that true Elf thing <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "DarkShinobi",
      "avatar": "10759009_1621031747.jpg",
      "timestamp": "8:42 PM - Dec 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Had to make sure I log on to comment on this build, the background story is awesome. <br/>\nJust a quick question, based on this build, at which level do you think you could perceive that the build is going well? Where is the power spike? Or is it focused on level 40 only? <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:09 AM - Dec 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi DarkShinobi! <br/>\n<br/>\nWelcome! Thanks for commenting!<br/>\n<br/>\nI had a very good feeling about this build, and when I do, I tend to write a lot more backstory / lore, and who wouldn't want to play some sort of elven special forces commando, kind of like the <a class=\"postlink\" href=\"https://en.wikipedia.org/wiki/List_of_military_special_forces_units\" rel=\"noreferrer\" target=\"_blank\">elite special forces units of the modern era</a>, highly skilled and versatile except elves are renowned for their magical prowess so I added that in there as well, I am totally looking forward for some IGMS/ILMS spam whilst being able to do everything else, not as a master but 'good enough' <br/>\n<br/>\nI also had to consider the story of how such individuals end up in the special forces in the first place, which is an interesting one, this time I made it out of punishment, similar to the dwarven noble backstory from Dragon Age: Origins, except on a larger scale, we need enough traitors to fill entire commando units. <br/>\n<br/>\nRegarding the elite commando unit's name, I suspect there might have been some Starcraft influence there (think the Sons of Korhal). <br/>\n<br/>\nThere's heaps of cool stuff that could be explored in there, like the 'ignored siblings', issues of inheritance, parents confronted with heinous crimes committed by their children - its something that can very much be fleshed out into something very rich, dark and confronting. Perfect for the consummate role playing DnD'er and enough versatility for the powergamer to enjoy<br/>\n<br/>\nI designed the build for level 40 power but that being said I am currently play testing this build, I have taken it to level 5 on World of Greyhawk persistent world and it plays perfectly fine like any dual classed stealthy rogue / wizard, I believe it will be very playable throughout its entire journey. <br/>\n<br/>\nHeaps of cool stuff I've learned about NWN stealth rogue/wizard gameplay like summons whilst sneak attacking em with longbow or longsword (buffed by flame weapon), retrieving and setting traps for difficult enemies, cheesy round the corner stealth / sneak attack / stealth type tactics<br/>\n<br/>\nThe longbow hits more often but melee weapons (funnily enough, quarterstaff is the best for me right now) do a lot more damage, this will obviously change once I get access to longbows with the mighty property + more AA levels<br/>\n<br/>\nI believe the combat prowess will peak around level 27 with the AA 11 and Level 6 Wizard Spells.<br/>\n<br/>\nMagical prowess should peak at 39 with undispellability, epic mage armor and epic warding.<br/>\n<br/>\nIn terms of rogue skill power, there is a massive rogue skill dump at level 40 which this occurs, but this can be taken earlier depending on the module, or swap the AA level for a rogue level for a bit more balance at the expense of being able to penetrate stoneskin/greater premonition etc (which may or may not be important depending on the module - or the availability of Mord's scrolls heh)<br/>\n<br/>\nIf you wanted to play a version of this build for level 20 or 30 environments (or level 28 - hordes of the underdark) I would make some changes for sure to make sure it is optimised<br/>\n<br/>\nHope that answers your question<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:46 AM - Dec 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">On WoG, you would be better off with Shortbow.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "stephenratcliffe809",
      "avatar": "10759100_1561880327.jpg",
      "timestamp": "3:12 PM - Dec 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote:</cite>On WoG, you would be better off with Shortbow.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk</div></blockquote>Nod, nod - hit those Weapon Focus chests post L3.<br/>\n<br/>\nAnd check every arrow you find to build up a collection of specials <br/>\n<br/>\nSent from my SM-T810 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:43 PM - Dec 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Us Archers normally \"trade\" arrows amongst ourselves whenever we meet up - it's sort of a tradition.<br/>\n<br/>\n1 arrow of each type found, traded for the same.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}