{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "008",
  "name": "Paladin, Oh boy.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/paladin-oh-boy-t2354788.html",
  "author": "Rua Blackmist",
  "avatar": "10423421_1510287071.jpg",
  "replies": "6",
  "views": "402",
  "posts": [
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "3:21 AM - Dec 04, 2017",
      "content": "<div>(Arelith lv 30)<br/>\n<br/>\nNever thought I'd see the day, I'd be going for a Paladin. The Warrior of Light. The Vaunted Lightbringer. The Guy with Flashy Lights! The basically a cleric in plate armor and why don't they get more spells guy!<br/>\n<br/>\nAll right, let me explain what I thought about going for. I thought about doing a &gt;Elven&lt; Paladin who uses a Bastard Sword. Not sure if there's a better alternative (although the Bastard Sword did seem fitting since you can use it and a shield, and thought it might be powerful as well. (Although, I have thought about Scimitar as well, but not entirely sure about that.) It would save an extra feat, but not sure what a good weapon choice might be (melee is the intent here though)<br/>\n<br/>\nNow, don't entirely quote me on this, but I thought about doing something like Paladin/CoT/Rogue or Fighter (Not sure which is the best choice)<br/>\n<br/>\n<br/>\nMy intention was to take enough Paladin levels I could buff myself (and maybe also get that Holy Sword, seems strong), but I have no intention of making a smiter. (Way to many things 'bypass' the alignment of evil to make that even remotely viable. PVP or PVE wise.)<br/>\n<br/>\n<br/>\nI've stumbled upon quite a large issue. I've never worked with a Paladin... at all. I mean I imagine Paladin and CoT have good synergy (maybe), but I haven't the faintest clue to start.<br/>\n<br/>\n<br/>\nI know the skill points will likely suffer (as you can't have it all, though Discipline and Heal might be a nice edition) <br/>\n<br/>\n<br/>\nWhile I'm pretty sure Fighter would probably be better than Rogue (I imagine it also adds synergy and rogue probably doesn't make any sense overall within what I'm trying to build, as in.. not really viable)<br/>\n<br/>\n<br/>\nTL;DR - Start with the first sentence. I can't TL;DR this.<br/>\n<br/>\n<br/>\nAny help would be appreciated. I know this post is kinda a mess but bear with me xD. I'm not exactly looking for a 'handout' build I want to do this myself, but a rough idea of where to start and so I can eventually get advice or critic. As... I'm not even sure if I should start out as a Paladin or what.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:57 AM - Dec 04, 2017",
      "content": "<div>Just some quick points,<br/>\n<br/>\na) Even if you wanted a \"Smiter\" in Arelith's restricted environment and with only thirty levels to work with, it would not be worth it.<br/>\n<br/>\nb) I have to say that Bastard swords in Elf hands, are looking very good, to my eyes at least, because the Elves are slim and the sword is very \"defined\" on them.<br/>\n<br/>\nc) I don't remember if Arelith has nerfed the AC bonus from Tumble or not, but if you wanted an evasion/ full tumble class that fits with Paladins, then i would suggest Monk as an alternative choice.<br/>\n<br/>\nd) You do not really need CoT in your case, because Paladin's with at least descent charisma have already very good saves, so going heavy on Paladin is the wisest choice probably. Fighters on the other hand...well who says \"no\" to 6 extra damage on every hit? Also having Fighter in your build will allow you to take some Paladin feats that you would probably leave out otherwise (extend spell, extra turning etc). I am assuming of course that you will want to take the \"divine\" feats for your class.<br/>\n<br/>\ne) With 30 levels to work with and the restriction of 3 straight levels in a class before you move on, i would say Paladin 20/ Fighter 6/ Monk 4 would be good for starters. You will want to take also both \"gifts\" your server allows in Strength &amp; Charisma so you will have descent stats, but it can be done without them, you will just have to sacrifice your Dexterity &amp; Intelligence (once again) to make it work. And they say Paladins are \"dumb\" bah, there are just not enough points!<br/>\n<br/>\n<br/>\nAnyway, good luck with your build Rua</div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "5:21 AM - Dec 05, 2017",
      "content": "<div>Would you recommend starting as a 'Fighter or Paladin' on the first level? Should I use the fighters bonus feats to get the weapon focus? (Alongside Improved Critical?) Doing this by myself is a bit of challenge (fun), but I hadn't realized how many feats are available to melee fighters. (A darn lot I might add, dunno even half of the 'decent' ones.) <br/>\n<br/>\nThough, it might help if I could figure out how many skill points I can get my hands on, alongside how many feats I have to select. Unfortunately, it's hard to keep track of in the base game (using that as my 'test tool')</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:12 PM - Dec 05, 2017",
      "content": "<div>Hi Rua,<br/>\n<br/>\nAssuming you're taking the Paladin 20/ Fighter 6/ Monk 4 split suggested by Valerfor, you'll want Weapon Specialization as the F4 bonus feat, and its epic version as the F6 one (so be sure to take the last 1 or 2 levels in epic). If you take the 1st level as a Fighter you'll get a bonus feat then, so you could take both Weapon Proficiency: Exotic and Weapon Focus: Bastard Sword then, to get them in nice and early.<br/>\n<br/>\nAs far as skill points go, it will (obviously) depend on your INT, but assuming no extra points from that, you'll have 2 points per level of Fighter and Paladin and 4 points per level of Monk. Thus, if you take either Fighter or Pally at level 1, you'll have a princely 74 points to play with, and if you take Monk at level 1 you'll have a vastly superior 80. In real terms, that's a maxed Discipline and Tumble (total 63 points) and a smattering of something else. At least you won't be spoiled for choice!<br/>\n<br/>\nThis is all predicated on no Arelith changes, of course.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:45 PM - Dec 05, 2017",
      "content": "<div>Str 16/ Dex 8/ Con 10/ Int 12/ Wis 14/ Cha 14 Elf. Start with 3 levels of Monk, last Monk level at 27. Fighter is as Stagmaister said, the rest is Pally. Epic feats are ews from fighter, 3 generic feats for AS, EP &amp; EWF and the last one for Great Cha. You should split the points between Strength &amp; Charisma and end somewhere around Strength 18/ Charisma 20 or the opposite. Buffed this should get you 10/11 rounds of divine might/ shield and with Pally buffs you should also have very good damage/ attack bonus. You just need to buff a bit before battles is all. Pre-epic feats are: Exotic weapons, Wf: Bastard sword, IC: Bastard sword, WS: Bastard sword, BF, Extend Spell, Power attack, Divine might, Divine shield &amp; Knockdown/ Extra turning. Monk will also give you Cleave for free, as well as Evasion.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:49 PM - Dec 05, 2017",
      "content": "<div>Ah, forgot...With 12 intelligence &amp; Elf you should have 101 skill points at lvl 30, if you start with Monk.</div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "11:30 PM - Feb 15, 2018",
      "content": "<div><table class=\"post_content_table\"><tbody><tr><td>Paladin(26), Fighter(4), Elf</td>\n</tr>\n<tr><td></td>\n</tr>\n<tr><td>STR: 16 (24)</td>\n</tr>\n<tr><td>DEX: 10</td>\n</tr>\n<tr><td>CON: 10</td>\n</tr>\n<tr><td>WIS: 14</td>\n</tr>\n<tr><td>INT: 12</td>\n</tr>\n<tr><td>CHA: 14 (17)</td>\n</tr>\n<tr><td></td>\n</tr>\n<tr><td>Elf: (Hardiness vs. Enchantments, Keen Sense, Low-light Vision, Skill Affinity: Listen, Skill Affinity: Search, Skill Affinity: Spot, Sleeplessness)</td>\n</tr>\n<tr><td>01: Fighter(1): Blind Fight, Power Attack</td>\n</tr>\n<tr><td>02: Fighter(2): Knockdown</td>\n</tr>\n<tr><td>03: Fighter(3): Weapon Focus: Longsword</td>\n</tr>\n<tr><td>04: Paladin(1): STR+1, (STR=17)</td>\n</tr>\n<tr><td>05: Paladin(2): {Smite Evil}</td>\n</tr>\n<tr><td>06: Paladin(3): Cleave</td>\n</tr>\n<tr><td>07: Paladin(4)</td>\n</tr>\n<tr><td>08: Paladin(5): STR+1, (STR=18)</td>\n</tr>\n<tr><td>09: Paladin(6): Divine Might</td>\n</tr>\n<tr><td>10: Paladin(7)</td>\n</tr>\n<tr><td>11: Paladin(8)</td>\n</tr>\n<tr><td>12: Paladin(9): STR+1, Improved Critical: Longsword, (STR=19)</td>\n</tr>\n<tr><td>13: Paladin(10)</td>\n</tr>\n<tr><td>14: Paladin(11)</td>\n</tr>\n<tr><td>15: Paladin(12): Divine Shield</td>\n</tr>\n<tr><td>16: Paladin(13): STR+1, (STR=20)</td>\n</tr>\n<tr><td>17: Paladin(14)</td>\n</tr>\n<tr><td>18: Paladin(15): Extend Spell</td>\n</tr>\n<tr><td>19: Paladin(16)</td>\n</tr>\n<tr><td>20: Paladin(17): STR+1, (STR=21)</td>\n</tr>\n<tr><td>21: Paladin(18): Great Strength I, (STR=22)</td>\n</tr>\n<tr><td>22: Paladin(19)</td>\n</tr>\n<tr><td>23: Paladin(20)</td>\n</tr>\n<tr><td>24: Paladin(21): STR+1, Great Strength II, (STR=24)</td>\n</tr>\n<tr><td>25: Paladin(22)</td>\n</tr>\n<tr><td>26: Paladin(23): Epic Weapon Focus: Longsword</td>\n</tr>\n<tr><td>27: Paladin(24): Great Charisma I, (CHA=15)</td>\n</tr>\n<tr><td>28: Fighter(4): CHA+1, Weapon Specialization: Longsword, (CHA=16)</td>\n</tr>\n<tr><td>29: Paladin(25)</td>\n</tr>\n<tr><td>30: Paladin(26): Great Charisma II, Armor Skin, (CHA=17)</td>\n</tr>\n</tbody></table>\n<table class=\"post_content_table\"><tbody><tr><td>Hitpoints: 300</td>\n</tr>\n<tr><td>Skillpoints: 99</td>\n</tr>\n<tr><td>Saving Throws (Fortitude/Will/Reflex): 21/16/14</td>\n</tr>\n<tr><td>Saving Throw bonuses: Mind Effects: +2</td>\n</tr>\n<tr><td>BAB: 25</td>\n</tr>\n<tr><td>AB (max, naked): 35 (melee), 25 (ranged)</td>\n</tr>\n<tr><td>AC (naked/mundane armor/shield only): 12/23</td>\n</tr>\n<tr><td>Spell Casting: Paladin(4)</td>\n</tr>\n<tr><td>Alignment Changes: 0</td>\n</tr>\n<tr><td></td>\n</tr>\n<tr><td>Concentration 33(33), Discipline 33(40), Heal 33(35)</td>\n</tr>\n</tbody></table>\nExcuse the boxes didn't know how to get rid of them. So, this is my 'attempt' at something... saves seem ...standard. for a paladin I guess. Lemme know what you think</div>"
    }
  ]
}