{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "175",
  "name": "Looking for inspiration (Sorc, possibly PM and RDD)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/looking-for-inspiration-sorc-possibly-pm-and-rdd-t2354504.html",
  "author": "Tyrful",
  "avatar": "10235276_1510287070.gif",
  "replies": 12,
  "posts": [
    {
      "author": "Tyrful",
      "avatar": "no_avatar.png",
      "timestamp": "10:10 PM - Mar 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello, first time poster. I've only very recently found the site, and decided to join today because it seems like a nice place, with nice people - and because I also can't seem to find many NWN communities still talking about builds.<br/>\n<br/>\n So a couple of weeks ago I happened upon two things: NWN Diamond on GOG, and the <a class=\"postlink\" href=\"http://archive.wizards.com/default.asp?x=dnd/arch/cc\" rel=\"noreferrer\" target=\"_blank\">NPC Closeup Archive</a>, which was a regular set of articles by Wizards of the Coast where they'd showcase some NPCs, going through their backstory and character sheet through various levels (1, 4 and 7 or 2, 6 and 12, for instance). I played NWN a lot when it came out, then burned out on it until HotU, and then burned out on that one again. But it's been a while, so I bought the game and decided - based on a lack of character ideas to (role)play - to try and see if I could recreate some of those NPCs, as best as possible.<br/>\n<br/>\n Now, I say \"some\" because there are some cases where that NPC Archive isn't useful for NWN - mainly because it's for actual D&amp;D and not a computerized version with a series of limitations and tradeoffs. However, it's still possible to recreate a number of similarities or ideas. My first attempt so far is for the character <a class=\"postlink\" href=\"http://archive.wizards.com/default.asp?x=dnd/cc/20020126a\" rel=\"noreferrer\" target=\"_blank\">Zola, Sorcerer of the Scars</a>. The backstory involved is fine for what it is, though the mechanics are proving to be a challenge in NWN for some reasons:<br/>\n<br/>\n *Half-Elf, so it won't benefit from an extra Feat at character creation.<br/>\n *Exotic Weapon Proficiency with Kukris, which... Adds quite the flavor, but seems strange for a Sorcerer, especially since the STR and DEX indicated there don't exactly push him as capable of fighting. There are combat-fuelling spells, further specializations and DEX investments, true, but I think this would compromise more usefull spell-based Feats.<br/>\n *Charm Person, which is - from experience, limited as it may be - a pretty useless spell (no noticeable effect in combat or outside, unless for purposes of improving NPC reaction, which can be swayed with other spells or potions; and I can't remember many times where it affected, if it affected at all, merchant prices).<br/>\n *Scribe Scroll at an early stage, which is useless until HotU.<br/>\n *Points into Hide, Listen, Move Silently, Search and Spot when these aren't Class skills (and how useful are these for non-Rogues in NWN, anyway?).<br/>\n *An Owl familiar - though hey, that's really more cosmetical. Personally, I think the Hellhound kind of fits the character, so I'm going with that instead :P<br/>\n<br/>\n So, I guess this leads into two questions/build advices:<br/>\n<br/>\n 1) The backstory points out he used a \"kukri of wounding\", which was \"used many times during his missions\". His strongest suit seems to be his arcane manipulations, not his knifeplay, but it also suggests he used it often. What would be the major issue of having a Sorcerer built for spells and melee, even if the physical aspect wouldn't be as powerful? I know precious spell feats would fall behind, though how many is many, if we were to adjust the build for serviceable melee vs. adjusting it to handle himself in a fight, even if resorting to a lot of buffs (and probably no henchmen, just the familiar and the ocasional summons)?<br/>\n<br/>\n 2) The build (and character background) caps at 12, though I'd like to take it up to 40 in NWN. I've been thinking of eventually adding PM and RDD levels, perhaps 23 Sorc/10 PM/7 RDD (or switch the RDD with PM for earlier stat bonuses and larger HD, even if just for a couple of levels). RP-wise, I'm sure RDD and PM could fit too.<br/>\n<br/>\n Thanks in advance for any suggestions :)<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:07 AM - Mar 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><span style=\"color:#ADD8E6\"><strong><span style=\"font-size:120%;line-height:normal\">Welcome aboard!</span> </strong></span> It's great to hear there are still new players (and in your case, returning ones) for what is turning out to be an almost eternal AD&amp;D game.<br/>\n<br/>\n Now to your dilemma...<br/>\n<br/>\n You are spot-on regarding your instincts on all counts you itemized.  Yes, though a spellsword of sorts is viable using sorcerer as the base, it can be tedious depending on the intended environment so THAT is your first decision.  There is no one-size-fits-all build, regardless of class split, that will excel in all surroundings so you'll need to define the target first and then justify why you are setting the preferences you are (they may be nerfing the potential without you even realizing it).<br/>\n<br/>\n Consider a few guidelines:<br/>\n<br/>\n Single-player or server?  In some cases, especially if the content is popular, you can get an idea of what sort of builds will prosper by reading player synopsis and discussions about the module or campaign.  Most active servers have forums which discuss builds and changes, few of which are known to the ECB community unless they have already sampled it.<br/>\n<br/>\n Low-, mid- or high-magic?  As the magic level increases, the effectiveness of casters, whether as offensive slingers or self-buffers, decreases until at the highest magic setting, spellcasting is neutralized by creatures' immunities, spell resistances and saves, not to mention access to items that mimic most of the power of a dedicated spellcaster.<br/>\n<br/>\n Solo or party?  Especially for spellcasting, will the toon be pretty much independent as far as survival goes or will it serve as a unit of a diversified party?  Of course, you can rely to some degree on summons but the strongest summons pale when compared to a party tank.<br/>\n<br/>\n Expected maximum level.  What level do you expect your toon to play the majority of its most challenging encounters at?  ECB contributors typically will furnish a map that optimizes at or near Level 40 so, for example, if you suspect that the completion of the adventures will occur by Level 35 (or earlier), that robust potential planned for Level 40 will never come to fruition.  In other words, most of the level 40 builds posted assume that the build will be played extensively AT Level 40.  This is not really typical of a random build's actual use so must be considered.<br/>\n<br/>\n These are basic, boilerplate considerations before even attempting to begin selecting classes, feats and skills, but if let unaddressed will usually end up with a do-over and wasted time.<br/>\n - - - - - -<br/>\n Now, with all that stated... anything can be designed, any legal combo of classes is candidate.  But there are trade-offs, of course.  For your spellsword example, every BAB is important. A spellsword is not a cleric and has few buffs that will increase the chances of hitting with their attacks.  That means, the fewer levels of sorc pre-epic, the stronger the melee presence during the entire build, but the less magic-focused it will be early on.  RDD can help a bit, but is not a panacea when you must split ability increase between STR &amp; CHA (a Dexer is not an alternative with RDD since it does nothing for that ability).<br/>\n<br/>\n Most high-level sorcerers would be using polymorphs of Polymorph Self, Tenser and Shapechange to establish a melee presence in situations where spellcasting won't work (like vs. raks and demilichs, for instance).  That means a spellsword relies mainly on equipment to boost their AB enough to hit reliably (GMW only helps up to mid-magic) while their spell DC and penetration becomes watered down by fewer caster levels and less-than-dominant ability level.  (Note: PM really hurts SR penetration for all but custom class mods.) This is then the main decision.  What AC levels is your spellsword likely to encounter and how successful a melee presence are you willing to settle for?  Then we would build around these metrics to uncover a suitable compromise.<br/>\n<br/>\n It is not my intent to sidestep answering your main ideas with generalities, but rather than send you on a wild-goose chase with a partly-conceived recommendation, I opt for clear definition. And hope you follow the train of thought and logic behind it.<br/>\n<br/>\n Oh, btw... not only are <em>Scribe Scroll</em> and <em>Craft Wand</em> a boon to arcanists in most environments, access to those feats can actually determine whether a high-level solo spellcaster is viable at all. You'll need to know beforehand whether the content provides blanks scrolls and skel bone drops (or bone wands) to decide if you can take advantage.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Tyrful",
      "avatar": "no_avatar.png",
      "timestamp": "3:01 AM - Mar 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi, HipRedux, thank your for welcoming me :) And on the contrary, I do not find these to be generalities, but very helpful questions in order to refine the concept. I hadn't even thought of some of these possibilities until I started writing this topic.<br/>\n<br/>\n As for the guidelines, most of these can be summed up as single-player: the official campaign and expansions. I'd like to explore some PW's in the near future, however, my internet connection is really not suited for stable play at this time - and might not be for the next couple of months, as I'm moving away soon and will have to deal with new ISPs and whatnot. So for now, I'm only considering a Level 40 jaunt across the OC + SoU + HotU. If I end up a few levels short, I'll possibly work through some of the premium modules included in the Diamond package too. For this character, I'm also considering a familiar and summons, and likely no henchmen.<br/>\n<br/>\n It is the less magic-focused aspect I am wary of. From memory, there were magic \"peaks\" across the OC that left my melee fighters in trouble, though with henchmen, these were doable. In HotU though, I found myself using spellcasters more often (and you've reminded me of shapechanging spells and how I like them). I think, considering the entire \"trilogy\", that a spellsword might be more effective until late OC + beginning SoU, if he were as balanced as possible; but a \"purer\" spellcaster or fighter would be more effective in HotU - at least, I had far less issues with specialists than jacks-of-all-trades (truth be told, I'm not a very good build optimizer).<br/>\n<br/>\n So... I suspect a compromise would effectively \"split\" the build. Up to 20-ish, the BAB + equipment + necessary physical combat feats wouldn't damage the character so much, but from epic territory onwards, it might very well be a liability. I'd have to run two different characters, almost, and since I plan on going all the way... I entertained the possibility of taking Shadowdancer levels instead but the entry level is harsher, even if SD's have good options for more defensive casting.<br/>\n<br/>\n Maybe an alternative, if I *really* want to go with some measure of melee ability (and the thought is fading fast after all this) for lower levels and pre-shapechanging, would be to skip the character's flavor weapon (and take a Feat better spent elsewhere), and go with FW/MW/GMW's, possibly aided by Keen, True Strike, Bull's Strength and Cat's Grace. Earlier Touch spells could also replace it. These could leverage (once again, at earlier levels) the character's lack of Clerical-like buffing, specially when coupled with AOE \"controlers\" like Negative Energy Burst or self-contained invisibility/concealment spell family.<br/>\n<br/>\n Also, I believe scroll creation will only be a consideration in HotU. The OC does not feature blank scrolls, so it'd be a waste taken early. Meanwhile, wand materials are more likely to drop for Wizards due to Int values (they almost don't need to take ranks in Craft), and usually there are very few limits to having a character expend his spell repertoire and rest every 5 minutes (still, wands are generally created with 50 charges, which is always nice, and they're faster to use than casting the corresponding spell but lack metamagic application). The XP and GP loss shouldn't be much of a hassle for Wands based on mid-level magic, placing the Wand creation feat as a concern but probably not until SoU/HotU.<br/>\n<br/>\n I'm still interested in PM and RDD levels; even if I abandon the spellsword, I think a purer spellcaster still tends to gain some things from them, even if mostly added defenses, but will have to look at it further.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:04 AM - Mar 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Very good clarification, Tyrful.  That's the kind of information we need to make a more informed recommendation... so kudos for speedy reply!<br/>\n<br/>\n Alright...<br/>\n<br/>\n Now first of all... OC-SoU-HotU sequence is going to be a poor choice.  The sequence should be either OC-HotU or SoU-HotU (recommended), with bridge mods if you have them installed. <br/>\n<br/>\n The reason is that your toon will finish about 16-18 from the OC depending on how much you use hench, familiar and/or summons, with 18 the pure solo likely finish.  That means when you start SoU there will be zero challenge and your XP from kills VERY low.   That's why the expansion HotU was designed to follow SoU (that and a distinctly different storyline ala \"adventures of Deekin\") which attains somewhere in the 12-15 finishing level.  Even going the OC-HotU route will start HotU off netting low-end XP kills but due to the CRs increasing rather quickly in HotU, eventually you'll begin to experience more normal challenges somewhere around when Ch1 ends and Ch2 begins.  Naturally, you can play in any order you like but you probably won't have much fun sprinting through most of SoU and with all the uber gear from the OC, makes an even further anti-climactic experience.<br/>\n<br/>\n So, regardless of which route (OC first or SoU first), your final level will be around 28 give or take a level or two.  By shoving SoU into the mix, you will only gain a few levels, maybe up to 30-32 at best due to the anemic CRs in HotU for such a high-level toon.  Hence, I would recommend designing a Level 28 build which may be a bit lower in actuality depending on how much you use additional support (hench/summons/familiar) during battles.  In that eventuality, design your last few levels (approx 26-28) as \"throw-away\" levels since you may not even realize them.<br/>\n<br/>\n With 28 levels to schedule, those pre-epic sorc levels will be difficult/impossible to compensate melee-wise since BAB will be very low.  That means not only will your AB barely hit anything (not until the uber weapons appear in Ch2 HotU anyway), but your APR will be hard-pressed to reach 3.  Forget about 4 APR altogether, not without several fighter-type levels pre-epic.  Plus, your anemic BAB will also affect the polymorph AB and APR which you will depend upon to get you out of jams when the sword/dagger/mace/whatever won't hit enough.<br/>\n<br/>\n Another issue with a mid-epic arcane build is casting failure.  You can use Still Spell for most spells but that means you will be locked out of other useful metamagic (like Extend, Empower, Maximize) when forced to use stilled spells.  Both armor and shield will have an effect on casting failure.  There is some gear that will eliminate most of the casting failure but who knows when it will become available.  For at least part of your progress (before RDD levels, if you choose to follow that plan), heavy plate and tower will be tough to manage with your relatively low STR allotment.  Autostill Spell is beyond the scope of a Level 28 build.<br/>\n<br/>\n PM benefit is really only an issue vs. DevCrit threats, which do not exist in any of the campaigns.  By sticking with a decent starting CON, Toughness, some +CON gear and Empowered Endurance, your caster's HP pool will be large enough to absorb the occasional crit damage.  That's what the recipro shields (Death, Elemental, Mestil's) are for... kill enemies while chugging heal pots.  An arcanist's concealment potential is also very good so when combined with damage soaks like Stoneskin/Premonition getting hit regularly is actually a GOOD thing.  Imagine Tenser or Iron Golem surrounded by recipro shields and pre-buffed fully!  Pretty scary.  The only real danger are archer/slinger mobs but they will typically fall to any Fort save offensive spell rather quickly.  IMO, PM will merely dilute your casting prowess and provide an AC boost that is not needed.  BTW, Expertise DOES work in all the campaigns so it can exploited for up to a +10AC bonus.  Something to consider.<br/>\n<br/>\n Your choice is really either spellsword (focusing on melee feats with some complementary buffing and offensive casting) or a primary arcanist with enhanced casting who can melee with just about any class weapon equally well but not particularly dominant and depending on magical defenses/shields to control and cause damage by just standing there casting and swatting.  In the latter case, you may find that your toon will need to toggle through Improved Expertise-Expertise-No Expertise during a single battle to find a good AC that allows the enemies to receive damage but not so much that your sorc cannot heal fast enough due to flanking crits.<br/>\n<br/>\n A spellsword would be something like a human, half-elf or dwarven Ftr/Src/RDD (really the only way to grab enough combat feats).  A dedicated caster, however, would probably include a Tumble class like Rogue or Monk and more racial options. <br/>\n<br/>\n Another option for a spellsword (and most likely a stronger one) would be a Bard/RDD.  You'll still need Still Spell with armor/shield but can bolster the AB woes using bard/curse songs in combination.  Plus the skill set will be much better, easier to manage and UMD will open up all that sweet monk gear among its other benefits.  If you've forgetten, I'll remind you... the effects from bardic singing CANNOT be dispelled. ;)   In HotU, Deekin can sing well, but he cannot curse.  And he will not respond during combat to commands very well.<br/>\n<br/>\n Though the OC does not provide blank scrolls, the large bones used to craft bone wands will drop, so any arcanist that can win skill check Craft Weapon vs. DC 13 can craft wands for spells up to Level 4.  You are correct that Wizards typically have an advantage finding bones with their elevated INT level but with a modest investment in the weapon skill combined with equipping +INT gear and a pre-buff of Fox before fighting skels, plenty of large bones will drop for sorc and bard, as well.  Craft Weapon does not need to be trained.<br/>\n<br/>\n Ummm... I like the pixie familiar best if you have no rogue around. On most servers, <em>Find Traps</em> spell has been nerfed to do only THAT action: find traps i.e highlight them on the screen... not disarm them.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Tyrful",
      "avatar": "no_avatar.png",
      "timestamp": "12:25 AM - Mar 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi and thank you once again, HipRedux.<br/>\n<br/>\n I haven't had a lot of time today to ponder on the build except on my way to work, and since I'm packing up for a weekend away with family, that leaves me with even less time. However, I did think about it and as usual, still remain undecided.<br/>\n<br/>\n I liked the Bard/RDD suggestion, though... As I said initially, I was going for a Sorc/PM/RDD build (I've already left PM behind) but the RDD would be around level 7. I need to confess that I don't really care for the wings, and also at first, was reluctant to take a \"full\" RDD as it didn't fit the character's concept. However, while the full bonuses for a B/RDD might be worth it (even with wings, gah), is it better to take, say, 18 Bard/10 RDD and sacrifice a Bard epic feat? Or go instead with Bard 23/RDD 7 (bonus Bard feat and no wings, yay)?<br/>\n<br/>\n I have a custom made module to test character builds (in truth, it's a signpost in the middle of a small forest that levels you up once per touch). I tried a 30th level character (23 B/7 RDD), ending with the following:<br/>\n<br/>\n STR 18 (14+4RDD)<br/>\n DEX 14<br/>\n CON 16 (14+2RDD)<br/>\n INT 14<br/>\n WIS 8<br/>\n CHA 22 (14+Great Charisma+Level point distribution)<br/>\n<br/>\n Curse Song<br/>\n Lingering Song<br/>\n Expertise, and Imp. Exp.<br/>\n Combat Casting, and Imp. C.C.<br/>\n Craft Wand<br/>\n Empower/Extend/Maximize/Still Spell (*later changed, see below)<br/>\n Epic Toughness I (*later changed, see below)<br/>\n Great Charisma I<br/>\n<br/>\n For a strict 28 level build, I'd wager 18 B/10 RDD would be the \"ideal\". I tried something like:<br/>\n<br/>\n STR 22 (14+8RDD)<br/>\n DEX 14<br/>\n CON 16 (14+2RDD)<br/>\n INT 16 (14+2RDD)<br/>\n WIS 8<br/>\n CHA 22 (14+2RDD+Level point distribution)<br/>\n<br/>\n Curse Song<br/>\n Craft Wand<br/>\n Empower/Maximize/Still Spell (*Extend didn't seem as useful)<br/>\n Toughness (*the bonus' nicer than a static 20HP)<br/>\n Expertise, and Imp. Exp.<br/>\n Scribe Scroll<br/>\n Lingering Song<br/>\n Combat Casting, and Imp. C.C.<br/>\n Not too certain about other feats, however: Martial Weapon Proficieny (for nicer weapons), Lasting Inspiration (looks great), or even Epic Prowess (is a +1 to all attacks really noticeable?).<br/>\n<br/>\n I don't have the full specifics now but this second version was hardier. I think taking 10 Bard, 10 RDD, then 8 Bard levels was also better than my first try, a straight 18 Bard and 10 RDD.<br/>\n<br/>\n As for the initial stats themselves, I wanted a higher STR and DEX for combat. Didn't invest much in STR as I knew RDD would help it grow. The initial 14 CON will probably improve my survivability if I'm to be in the thick of combat. The INT 14 was really to splurge on skill points (Perform, UMD, Concentration, Spellcraft and Tumble went over 40, and I also had enough to invest in Persuade), and the added +2 after full RDD gave me even more 10 levels to spend on the Bard side of things. A 14 CHA was comfortable, and made better with the RDD boost and the incoming character points. Not sure if it'd be worth it to drop STR and DEX by 2 and 1, respectively, to boost CHA one more point.<br/>\n<br/>\n Apologies if I'm not saying much more right now, but I'm really out of time today and out for the weekend. Hope to have something else to show if I get time to think on this. Thank you once again!<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:58 AM - Mar 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Go ahead and make a level 40 build and play the excellent Sands of Fate series after HotU, which will bring you the rest of the way to level 40. At level 40, you could have, for example, Bard 20 / Fighter 10 / RDD 10. At level 20, it would be Bard 8 / Fighter 4 / RDD 8, giving you your 4th attack per round. The 6 levels of Fighter in epic would give you Epic Weapon Spec, Epic Prowess, and Armor Skin, allowing you to use the general feats for Epic Weapon Focus and Great Strength VI. If you wear a cloak (and why wouldn't you?), the wings won't show.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:10 AM - Mar 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Appears you are getting some results after some trial and error. Nice! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:25 PM - Mar 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/><strong>[------&gt; @Tyrful and Empyre:  Does Aielund scripting allow casting in Expertise mode? </strong> Granted, it's a cheesy exploit, but if it's there, I always use it because I am a ruthless, XP-lusting mercenary.<strong>  <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />  </strong>Ooops!  I just remembered the OP's plan was not for Aielund but the Bio campaigns (getting these requests all mixed up now).<strong>  </strong>Expertise works while casting in all those but how about in the <em>Sands of Fate</em>?<strong> ]</strong><br/>\n  </div></blockquote>\n<div align=\"left\">I've never played a caster in either Aielund Saga or Sands of Fate, so I don't know.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:38 PM - Mar 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@Empyre: I see.  Never suspected that. This will be even more of an adventure for a spellcaster without some informed guidance for that content.<br/>\n<br/>\n @Tyrful:  Then, in that case (above), make a quickie level 1 arcane spellcaster, sorc or wiz, possibly wiz might be better since Expertise needs at least INT 13. Then find something to attack with any offensive spell using Expertise mode in <em>Sands of Fate</em> to see if the casting action \"breaks\" Expertise.  If it doesn't, I recommend including Improved Expertise as well for that extra +10 stackable AC.  Doesn't really matter if your toon dies easily during the test due to the CR mismatch as long as that single mechanism is evaluated.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:23 AM - Mar 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In Sande of Fate, a too-low-level character will be leveled to level 25, and all characters are given some moderately nice stuff, before you encounter any hostiles.<br/>\n<br/>\n I very rarely play casters, and when I do, it's a self-buffing melee Cleric. That's why when anybody has questions about casters, I usually leave that for casting experts.<br/>\n<br/>\n I know single-player isn't your thing, but you owe it to yourself to experience firsthand why everybody is always praising the Aielund Saga. It really is as good as we all say. Sands of Fate is not a waste of time, either.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:28 PM - Mar 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, come on Hip, play with the poor people for a bit! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:43 PM - Mar 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's not that I don't play SP modules or have a bias.  That's not true at all.  I play loads of SP CC and evaluate their potential for our LAN gaming and am constantly testing my own creations.  But I steer away from custom haks, sticking with modifications I am positive will not create more effort on my part to make repairs.<br/>\n<br/>\n I quite agree about your recommendation of Aielund, had DL'd it (the entire series) over a year ago and there it still sits in my download folder.  I am so neurotic installing custom haks when my game play is operating trouble-free (check a recent post on WoG forum about the trials of this exact issue).  I also am skeptical on the newest version of CEP because 2.4 (when it was originally released) caused me all kinds of frustration and reinstallation effort, so much so that I lost confidence in the advancing CEP program.  Therefore, I've been sticking with CEP 2.3 CC and servers because that particular version compilation has been so severely sanitized over the years for such a diverse audience, there is no chance of conflicts with either the stock campaigns or any vanilla CC.  IMHO the problem with some of the newest haks (like CEP 2.6) is that they are not being tested thoroughly on older OS/CPU/graphics configurations enough, if at all. Utility designers characteristically have cutting edge resources at hand so tend not to concern themselves with the problems of legacy tech that many of us are holding onto. <br/>\n<br/>\n All I can say is, it is still on my agenda, but awaits the confidence of an adventuring spirit, not the spirit that dares the perils of new NWN vistas but rather the one that does not fear all the potential fumbling around trying to reestablish stasis when the overrides clash.<br/>\n<br/>\n - - - - - - -<br/>\n<br/>\n Pure spellcasters are the most challenging to play under most situations (unknown creature SR/immunities and save levels, limited resting, dependence on some party tank to buy casting time, etc.) but can also be the most fun for that exact same reason.  For most all content, I've eventually tried a high-level rog/wiz unless it becomes clear the magic level is just too high to waste my time.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:56 PM - Mar 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">At first, I was thinking \"The CEP haks aren't overrides, and therefore shouldn't affect the OC.\" But then I figured out that you were saying that you have overrides that might be interfered with by haks. The Sands of Fate is old enough that it must surely use an older version of CEP, and the same is probably true about the Aielund Saga (but check its page in the vault to be sure). I remember playing both way back when I had a single-core AMD CPU.<br/>\n<br/>\n In Aielund, you have to wait to rest again either 5 real-time minutes or 5 in-game hours, I forget which. In Sands of Fate, you don't have that restriction, but whenever you rest, several hours pass in-game.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}