{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Preepic - Level 20 Builds",
  "forum_id": "004",
  "id": "003",
  "name": "Double Kama Fallen Paladin: Corrupted Divine Whirlwind (Paladin 12 / Monk 3 / Blackguard 5)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/double-kama-fallen-paladin-corrupted-divine-whirlw-t2355084.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "1",
  "views": "6.4K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:36 AM - Jun 23, 2019",
      "content": "<div>Hi all ECB'ers,<br/>\n<br/>\nI thought I'd stir up some life into the pre-Epic character build section of the forum by posting my fallen Paladin build, which is play tested to level 20 Aielund Act 1 to mid Act 3, which is a mixed Strength/Charisma build.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_ba4b2f674308fb94e00e947d560d7338_t.jpg\"/><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Lore:</span></strong><br/>\nOlia Meynolt was a staunch holy knight of the Church of Aielund and the Crown, yet the attacks on Bracksford and Culdeny, the kidnapping and multiple assassination attempts on the Princess hardened her heart and soul to the extent she began searching for ways to strengthen her power against the unseen and cowardly forces working against her. She will take any step possible to defend the Crown and began practicing her skills with the Kama weapon with Monks of the Valley of the Silent, imbuing this rapidly attacking weapon which with the powers of her divine might and also learning the defensive skills of the Monk class. Furthermore she discovered her offensive and defensive powers could be enhanced further with the powers of darkness, and insidiously 'fell' unbeknownst to many except her closest companions to the powers of darkness, enhancing her holy protective powers with a shroud of evil almost guaranteeing complete protection from all actions which require great fortitude, great reflexes or great will to resist, gaining the ability to devastate surprised or off-balanced opponents and being able summon enormous reserves of strength, and the undead and succubi for aid in combat. She will do whatever it takes, no matter what, to defeat the great threat to her land and sovereign, but at what price to her soul? And is there a possibility for redemption for her dark conduct in the future?<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Other Paladin/Monk/Blackguard builds:</span></strong><br/>\nOnly one I could find was TyrTemplar's Blood Knight (M9/P15/BG16) build on the epic builds database. <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build244612.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 44612.html</a>. That one involves a shield and longsword. It's not bad but dual Kamas with Divine Might means a lot more damage potential (admittedly at the cost of up to 3 feats for ITWF, but surely its worth it for the joy of 10 attacks per round?) or even single Kama for 7 attacks per round. Not sure about skilling Hide with full plate and shield either...<br/>\n<br/>\nCouldn't find any others in our forum. I know Maximillan Kane has done a Paladin/Blackguard with an 'Aribeth' build (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/aribeth-paladin-26-blackguard-4-cot-10-t2269104.html\" rel=\"noreferrer\" target=\"_blank\">aribeth-paladin-26-blackguard-4-cot-10-t2269104.html</a>) but no monk obviously.<br/>\n<br/>\nSo I believe I am tilling fertile ground here for a new build! I'm sure this build is unique. This one is optimised for level 20 which is kind of its peak. Other builds will get even stronger in Epic levels (for example at level 40 I doubt it can compare with Druid's Dragon Shape, for example)<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">The details:</span></strong><br/>\nPaladin(12), Monk(3), Blackguard(5)<br/>\n<br/>\nHuman, Lawful Good -&gt; Lawful Evil (between level 12-14. see <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=15137#p15137\" rel=\"noreferrer\" target=\"_blank\">my guide on how to change alignment in practice in NWN 1 modules</a> for all the details of how I did it in Act 2)<br/>\n<br/>\nSTR: 14 (16)<br/>\nDEX: 14 (15)<br/>\nCON: 8<br/>\nWIS: 14<br/>\nINT: 14<br/>\nCHA: 14 (16)<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Paladin(1): Power Attack, Two-Weapon Fighting<br/>\n02: Paladin(2): {Smite Evil}<br/>\n03: Paladin(3): Divine Might<br/>\n04: Paladin(4): DEX+1, (DEX=15)<br/>\n05: Paladin(5)<br/>\n06: Paladin(6): Ambidexterity<br/>\n07: Paladin(7)<br/>\n08: Paladin(8): STR+1, (STR=15)<br/>\n09: Paladin(9): Improved Two-Weapon Fighting<br/>\n10: Paladin(10)<br/>\n11: Paladin(11)<br/>\n12: Paladin(12): STR+1, Blind Fight, (STR=16), start alignment change to Lawful Evil<br/>\n13: Monk(1): {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n14: Blackguard(1): *Alignment Change*<br/>\n15: Blackguard(2): Knockdown, {Smite Good}<br/>\n16: Blackguard(3): CHA+1, (CHA=15)<br/>\n17: Blackguard(4)<br/>\n18: Blackguard(5): Divine Shield<br/>\n19: Monk(2): {Deflect Arrows}<br/>\n20: Monk(3): CHA+1, (CHA=16), Still Mind, Monk Speed<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\"><strong>When naked and unbuffed</strong></span><br/>\nHitpoints: 174<br/>\nSkillpoints: 121<br/>\nSaving Throws (Fortitude/Will/Reflex): 20/16/16<br/>\nSaving Throw bonuses: Mind Effects: +2<br/>\nBAB: 19<br/>\nAB (Unarmed, naked): 22/19/16/13/10/7<br/>\nAC (naked): 18<br/>\nSpell Casting: Paladin(3)<br/>\nAlignment Changes: 1<br/>\nSummons: Create Undead (Ghast), Summon Fiend (Succubus)<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\"><strong>When equipped whilst playing Aielund Act 3 and buffed</strong></span><br/>\nAt reaching level 20 in Aielund Act 3, I was equipped with: <br/>\n- Kama +3 (+3 enchantment, +2d6 acid, Keen), Kama +3 (+3 enchantment, +1d6 acid, Keen), <br/>\n- Robes of the Transcendant Path (+5 AC, cast Premonition level 15 1/day), Boots of the Hurricane +5 (+5 dodge AC, +2 Dexterity), Gauntlets of Ogre Power (+2 Strength), Belt of Agility +2 (+2 Agility, Freedom), Blessed Helm of Command (+2 Cha, Immunity to Death Magic and Fear, Discipline +4), Nymph Cloak +4 (+4 Cha), <br/>\n- Periapt of Wisdom +4 (+4 Wisdom), Lesser Ring of Power (-5 reduction to Fire/Ice/Electrical, +1 regeneration), Ring of Protection +4 (+4 deflection AC).<br/>\n<br/>\nWhen buffed with Bull's Strength, Eagle's Splendor, Aura of Glory, Magic Circle Against Alignment (Evil), Divine Favor, Prayer, Divine Might, Divine Shield, Lesser Ioun Stone Pale Blue (+2 Strength), Gem of Seeing (cast True Seeing level 9 1/day), Premonition level 15, Flurry of Blows:<br/>\n<br/>\nSTR: 24<br/>\nDEX: 19<br/>\nCON: 8<br/>\nWIS: 18<br/>\nINT: 14<br/>\nCHA: 28<br/>\n<br/>\nAC 47<br/>\nHP 174<br/>\nAB: +30/+27/+24/+21/+18/+15 +30/+27 and 1 flurry attack - 9 attacks per round<br/>\nDamage (main hand): 1-6 +7 (Crit 19-20/x2) +3 Slashing, +2d6 Acid +1 Divine +4 Divine +9 Divine (+1d6 sneak attack)<br/>\nDamage (off hand): 1-6 +3 (Crit 19-20/x2) +3 Slashing +1d6 Acid +1 Divine +4 Divine +9 Divine (+1d6 sneak attack)<br/>\nSaves (F/R/W): 33/33/31 (+18 to all saves from Divine Grace and Dark Blessing, which stack!)<br/>\n<br/>\n<strong>Damage per round: </strong><br/>\nSlashing: 9d6 + 7x7 + 3x2 = 9d6 +55 / round<br/>\nDivine: 9 + 36 + 81 = 126 / round<br/>\nCritical chance 10% for double damage (from Keen enchantments from Act 2 and 3)<br/>\nSneak: 9d6 / round if applicable<br/>\nBonus Weapon damage from legitimate enchantments from Act 2 and 3 (enchantment +3, 2d6 acid main, 1d6 acid offhand): 9x3 slashing + 7x2d6 acid + 2x1d6 acid / round = 27 slashing +14d6 acid / round<br/>\n<br/>\n<strong>When added up (this presumes every attack will hit your opponent!):</strong><br/>\nCritical and sneak immune opponents (ie constructs, undead): 231 to 346 damage per round<br/>\nSneak immune but not critical immune opponents (ie dragons, opponents engaging you directly): 254.1 to 380.6 damage per round<br/>\nOpponents vulnerable to sneak and critical (ie knocked down/stunned opponents, opponents engaging companions/minions): 263.1 to 434.6 damage per round<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_1e3cbcc67395d0b447a2fbeb62db7e6a_t.jpg\"/>I used a potion of Bull's Strength as Bull's Strength (Blackguard) is <strong>bugged </strong>in my version of Aielund Act 3 (like it doesn't actually cast). Totally unfair! For the sake of fairness, and to simulate if this character was to play another module.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Skills:</span></strong><br/>\nDiscipline 23(26), Heal 23(25), Hide 5(7), Listen 12(14), Persuade 17(20), Taunt 21(24), Tumble 20(22)<br/>\n<br/>\n01: Discipline(4), Heal(4), Persuade(4), Taunt(4), Save(4), <br/>\n02: Discipline(1), Heal(1), Persuade(1), Taunt(1), Save(5), <br/>\n03: Discipline(1), Heal(1), Persuade(1), Taunt(1), Save(6), <br/>\n04: Discipline(1), Heal(1), Persuade(1), Taunt(1), Save(7), <br/>\n05: Discipline(1), Heal(1), Persuade(1), Taunt(1), Save(8), <br/>\n06: Discipline(1), Heal(1), Persuade(1), Taunt(1), Save(9), <br/>\n07: Discipline(1), Heal(1), Persuade(1), Taunt(1), Save(10), <br/>\n08: Discipline(1), Heal(1), Persuade(1), Taunt(1), Save(11), <br/>\n09: Discipline(1), Heal(1), Persuade(1), Taunt(1), Save(12), <br/>\n10: Discipline(1), Heal(1), Persuade(1), Taunt(1), Save(13), <br/>\n11: Discipline(1), Heal(1), Persuade(1), Taunt(1), Save(14), <br/>\n12: Discipline(1), Heal(1), Persuade(1), Taunt(1), Save(15), <br/>\n13: Discipline(1), Heal(1), Hide(5), Listen(4), Persuade(1), Tumble(10), <br/>\n14: Discipline(1), Heal(1), Persuade(1), Taunt(2), <br/>\n15: Discipline(1), Heal(1), Taunt(1), Save(2), <br/>\n16: Discipline(1), Heal(1), Taunt(1), Save(4), <br/>\n17: Discipline(1), Heal(1), Taunt(1), Save(6), <br/>\n18: Discipline(1), Heal(1), Taunt(1), Save(8), <br/>\n19: Discipline(1), Heal(1), Listen(3), Tumble(10), <br/>\n20: Discipline(1), Heal(1), Listen(5), <br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Strengths:</span></strong><br/>\nCrazy strong saves with Eagle's Splendor (+4 Cha in Aielund), Charisma buffing equipment (I had +6 Cha), Dark Blessing and Divine Grace combined. (ie 33/33/31). To give you an idea how good those saves are, an epic Level 40 character would have base high saves of 22 (ie a level 40 fighter would have a fortitude save of 22), and base low saves of 16 (ie a level 40 fighter would have a will save of 16). <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Base_save\" rel=\"noreferrer\" target=\"_blank\">Reference: NWN Wiki: Base save</a>. So all my saves were already 50-100% higher than a normal level 40 character, at level 20.<br/>\nReflex save of 33 combined with Evasion is super strong, pretty much means you are 95% immune to dragon breath or any spells/abilities that have a reflex save for half damage.<br/>\nReflex save of 33 is very strong with Deflect Arrows, you pretty much much are 95% immune to the first arrow that is shot at you (which normally has the highest AB), per round<br/>\nAccess to Divine Favor, Divine Might, Divine Shield and Prayer for some AB, Damage and AC buffs.<br/>\nBoth Physical and Divine damage. (normally Divine Favor is Magical Damage, in Aielund it is Divine type damage)<br/>\nDouble Kama Monk with Improved Two Weapon Fighting means 9 attacks per round with flurry, 10 attacks per round with flurry and a potion of speed.<br/>\nDivine Might, Divine Favor and 1d6 sneak attack buffs combined with 9 attacks means potentially 123 - 171 extra damage per round from these abilities.<br/>\nDivine Might and Shield are not dispellable<br/>\nNo XP multi-class penalties<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Weaknesses:</span></strong><br/>\nAlignment shift Lawful Good to Evil has to be managed. See my guide in the game guide section for my details.<br/>\nYou need to hit your attacks to do the damage. BAB 19 plus Divine Favor is fine for that, but if you have ways of dropping their AC further (through Knockdown, Taunt or stuns from companions) you will do even more damage. That being said, you are totally fine with playing a game of 20s against enemies with 9 attacks per round, but it is kind of annoying to play that game.<br/>\nYou are very susceptible to Taunting with low Cons and no Concentration skilled up. If you don't like this, then skill Concentration rather than Taunt.<br/>\nDivine Shield is Dodge AC, meaning you need to face your opponent and be attacking them for it to count. You are vulnerable when this wears off, you are casting abilities including recasting Divine Shield, Taunting or you are knocked down. This means the AC value of 47, while it looks impressive, is in fact situational and you have to be careful to make sure you are using it in combat.<br/>\nDispel magic is somewhat strong against you, and will remove some of your buffs, which you may have to recast (causing the above problem to occur). The most important buff is actually your charisma spells. <br/>\nYou are susceptible to Knockdown as a mixed Strength / Charisma builder BUT there are knockdown immune boots in the game. <br/>\nThere is a bug in Aielund Act 3, where Bull's Strength (Blackguard) does not actually work. Otherwise you would be seeing much more Double Bull's Strength action.<br/>\nConstitution 8 can be managed with the Endurance Spell (provided by Paladin class in Aielund), potions/items.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Solo dragon action:</span></strong><br/>\nThese are tough fights for any hero to face in Aielund Act 3. These were tough fights for me to complete solo but achievable. I used all my buffs, plus two potions of speed for each fight, lay on hands and 1-2 potions of heal. I changed my boots to the knockdown immune boots (Boots of Astounding Grip), as knockdown killed me pretty badly on unsuccessful attempts. The potions of speed were largely to make sure I could get enough distance to recast my Divine Shield/Divine Might and Divine Favor Buffs. Minions were never going to be useful as they were not immune to the fear aura, and I didn't have any ways to shield them from it.<br/>\n<br/>\nOn the plus side, my reflex saves were amazing, which combined with evasion pretty much meant the dragon breath would never do any damage to me. They would cast their dragon breath and I would dodge all the damage through my ridiculously high saves! Incredible.<br/>\n<br/>\nAzurefang was definitely the hardest, his dispel magic is very cruel.<br/>\n<br/>\n<br/>\n<strong>Azurefang at level 18</strong><br/>\nAzurefang standing tall and proud at the top of this hill, blocking a vital pathway for the citizens of Aieland, our dark brooding hero swore bloody vengeance despite facing what looks to be both literally and metaphorically, an uphill battle, against the odds. Yet despite this she told her companions to simply stand back and watch how the Lady of Darkness gets the job done. With her newly learned corrupted divine shield protecting her, she knew she could fight toe-to-toe, 'mano a mano', in a duel of epic proportions. Charging in with almost demonic determination to defeat all who oppose her, no matter what...<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_ba40dd1425874e7250642caa6caffb05_t.jpg\"/><br/>\nA vicious battle ensured. Our hero grievously wounded the dragon fighting toe to toe with her rapid divine blessed double Kama attacks but her divine powers waned and her magic protections were half stripped by the dragon's wily power. Able to retreat rapidly with speed, and recasting her divine shield of darkness and grasping the corrupted divine might energies, victory was able to achieved and the great dragon was no more. Exhausted, she lay in the snow and looked the stars, praying to the darkness for even more power to defeat her foes... before returning to her amazed companions, victorious, ready to resume their journey...<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_9335fedb1e9211fd6b4dbcdae8b687af_t.jpg\"/><br/>\n<br/>\n<strong>Razorfang at level 19</strong><br/>\nKnowing the great dragon would swear revenge for the slight inflicted by their party, our dark hero asked her companions to stay safely inside the caverns despite the protestations of the Princess. 'I defend the Crown and I will defeat your enemies, no matter what. This is my fight, and my fight alone. You must not be placed at risk' she said brusquely. The princess noting the almost infernal fire in her hero's eyes, she realised there, possibly with a little fear, that this was not a request but an order by her dark champion that would be enforced with the powers of Hell, and there was no way she could override this, even with her regal status. The princess quietly relented and acknowledged our hero had never failed her before. Grasping her magical and corrupted divine powers for attack, damage and defense, our hero boldly faced the enraged dragon. Landing grievous blow after blow toe to toe with the dragon with the savagery of the corrupted divine powers of darkness she found she easily dodged the dragon's powerful acid breath single every time to the dragon's enormous frustration. As her divine powers wore off she took advantage of the thick forestry obstructing the huge dragon's movements, and moved to safety to recast these abilities. Ready to defeat her mortal foe she returned to fight the dragon to the end, without fear, and ready to achieve her objectives, no matter the cost. The dragon fell, and with a loud thud landed to the ground, causing the ground to shake for miles.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_1f1e46cfdb8ebf28b4d3419d9cdda61a_t.jpg\"/><br/>\n<br/>\nAs the vanquished Dragon lay in the King's forest she remembered a request from one of the townsfolk. She removed one of her foes great horns as proof of her great deed, to prove they were now safe from harm, although she cared little for the thanks of those she disliked, perhaps there would be a reward for this deed from the commander of militia guard. She then returned to the cavern to inform her awestruck companions that the way was now clear and their journey could continue.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_0b9be095b5fa3ba8607eb298d697736f_t.jpg\"/><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Playing the build beyond level 20:</span></strong><br/>\nI could either focus on Monk or Blackguard, or try to advance further as a Paladin if I could return to Lawful Good (I have fallen too far, for now, for this to be easy to achieve).<br/>\n<br/>\nIf I went Monk, I would suggest P12/M23/BG5. This would give you a stack of Monk abilities including spell resistance 33, monk AC +4, 50% concealment from Empty Body, poison immunity, +70 speed bonus but none of those sweet bonus feats. <br/>\n<br/>\nIf I went Blackguard, I would get P12/M6/BG22. This would give Sneak attack 7d6, Epic Prowess, Epic Weapon Focus, Armor Skin and Epic Fiendish Servant for free, as well as Improved Knockdown from Monk 6 and three tumble dumps for AC (or listen dumps, if you want to skill up listen).<br/>\n<br/>\nIf I went Paladin, I would get P18/M6/BG16, for level 4 paladin spells, improved knockdown for monk + tumble and listen dumps, Epic Fiendish Servant from Blackguard +1 bonus feat<br/>\n<br/>\nHaven't play tested Monk, but I think this could be better... just looking at it...<br/>\n<br/>\nRegarding statistic progression I wouldn't go crazy about the saves from Charisma. They are already insanely high and I wouldn't level charisma further.  I only leveled Charisma further to ensure a decent duration and amount of casts per day of Divine Might and Divine Shield.<br/>\n<br/>\nI would probably buff Strength further for better AB and damage and rely on the Charisma buffs already available. You need to hit them to do that sweet damage...<br/>\n<br/>\nHope you enjoyed this post! Happy to receive comments on improvements. <br/>\n<br/>\n<strong><span style=\"font-size:75%;line-height:normal\">Edit: fixed up some typos/grammar issues, added a bit of lore and storyline, put some more analysis regarding saves, added the weapon enhancements to damage per round</span></strong></div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "5:29 AM - Jan 11, 2022",
      "content": "<div>Very interesting build.  I'm looking for a reasonable Pal/BG that I can go full circle (have them fall, then bring them back).<br/>\n<br/>\nI'd be tempted to skimp on INT and put more points in CON.  I have never played Aielund, but I can do without pumping Heal &amp; Taunt.<br/>\nAlso, I'd look at dropping TWF/AMB/ITWF and replacing them with WF:Kama, Toughness &amp; Improved Initiative.  You lose the 2 offhand APR, but you have 6 already (7 with flurry) and you gain +3 AB, 20 HP and you'll generally strike first in the 2nd round/all subsequent rounds. </div>"
    }
  ]
}