{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "152",
  "name": "Vhaeraunite Cleric",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/vhaeraunite-cleric-t2354544.html",
  "author": "Maladus",
  "avatar": "10577588_1510287072.jpg",
  "replies": 17,
  "posts": [
    {
      "author": "Maladus",
      "avatar": "no_avatar.png",
      "timestamp": "4:40 AM - Jun 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello everyone, I've visited these forums several times over the years but have only just made an account because I'd like to see if you all can help me with a build for a new character concept that I want to play. The idea for this character is that he will be a Vhaeraun worshipping Drow Cleric. I was looking at the build listed here (<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515410/Monk-6Cleric-1618Fighter-86-Arelith#.V1DrrJErJhE\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/51 ... 1DrrJErJhE</a>) and I like the feel of the concept, however Monk is out of the question because I cannot be a cleric of Vhaeraun and be a lawful alignment. Here are some other things to keep in mind:<br/>\n<br/>\n<span style=\"color:#ECF3F7\">1) PvM or PvP - Builds that are maximized for PvM are often not maximized for dueling with other PCs.</span><br/>\n Balanced PvM and PvP; The character is a Drow and will likely see a bit of both.<br/>\n<br/>\n<span style=\"color:#ECF3F7\">2) Level cap - What is the maximum level that the build (or server) will likely reach?</span><br/>\n 30<br/>\n<br/>\n<span style=\"color:#ECF3F7\">3) Race preference - Unless a class demands a specific race or races, Human will be assumed. Otherwise, specify the your favorite.</span><br/>\n Drow<br/>\n<br/>\n<span style=\"color:#ECF3F7\">4) Class preference - Describe which class(es) you have been considering so far and why. Your own concept is key to building what will do the job and be the most fun for you to play.</span><br/>\n Cleric is a must, whatever else you use to fill out the build is up to you<br/>\n<br/>\n<span style=\"color:#ECF3F7\">5) Melee preference - A few options to consider are: dual-wielding vs. one-hand with shield, high AC dexterity-based vs. high-damage strength-based, sneak attacks (stealth), taunting, specialized attacks (e.g. whirlwind, knockdown, called shots, sneaks, death attacks... you name it!).</span><br/>\n Dual-Wielding is preferred, but I know this can be hard with the restrictions<br/>\n<br/>\n<span style=\"color:#ECF3F7\">6) Range preference - DEX archery or Zen Archery (WIS)</span><br/>\n Character will be mostly melee<br/>\n<br/>\n<span style=\"color:#ECF3F7\">7) Weapon preference - Which weapon type would you enjoy using the most?</span><br/>\n Scimitar<br/>\n<br/>\n<span style=\"color:#ECF3F7\">8) Maximum item enhancement - In the setting where you intend to play this character, what is the highest enchantment (or bonus) that is likely to be used on equipment?</span><br/>\n +3<br/>\n<br/>\n<span style=\"color:#ECF3F7\">9) Spellcasting - If you are requesting a build that is likely to use magic, explain its general use. Will it be used primarily to add enhancements to a physical base attack (i.e. for buffing), to cast strong offensive spells or a balance of both areas of expertise? If arcane-based, would you prefer to be able to cast spells reliably while wearing armor? Is indispellability of buffs an important consideration?</span><br/>\n The build I'm looking for is to be a sort of Battlecleric, thus reaching level 9 or epic spells is not a necessity<br/>\n<br/>\n<span style=\"color:#ECF3F7\">10) Custom factors - Are there any special conditions that will affect how the build will work where you intend to play it? A PRC server is one example of a custom environment. Many servers have their own modifications to the standard game which will factor into the devising of a solid character build. Also, some community modules set their own rules</span><br/>\n The server i paly on is Arelith, so the standard restrictions for that apply. The biggest of which is the 3 level rule where you must take at least 3 levels into the new class your plan to multiclass into before you can take levels in other classes.<br/>\n<br/>\n Hopefully I have provided enough information to give you guys something to work with. I'll keep a close watch on this forum to answer any further questions that arise.<br/>\n<br/>\n Thanks in advance!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:45 AM - Jun 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Somehow, I suspect there may be some additional restrictions regarding deity in force but off the top of my head...<br/>\n<br/>\n DWing scimis will suffer the offhand penalty and beyond the scope of a cleric-heavy build to focus in more than one weapon type. <br/>\n<br/>\n My inclination for a drow would be some sort of divine shadow like rogue or asn but there are hurdles. What is the favored class of drow on Arelith? IIRC it could be Cleric else I'm thinking of another server.<br/>\n<br/>\n There are many ways to go here.  Look towards some finessable attack. CoT is out with asn.  If clc is favored for drow, any non-evil clc/rog/CoT works but limits weapon choice to probably S/S rapier or DW handaxes (assuming there are enough feats to go DW w/o sacrificing essentials.  But non-evil for a drow?  Dunno how much RP enters the picture.<br/>\n<br/>\n Problem with clc/ftr/asn is that 1) lots of skills to xclass to reach the 8 stealth ranks to qualify and 2) if clc not favored, then need to keep clc-to-ftr within 1 level.<br/>\n<br/>\n Recent testing has proved that a cleric who focuses on Darkness is extremely powerful when delivering sneaks/DAs. Never any opposed AoOs! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maladus",
      "avatar": "no_avatar.png",
      "timestamp": "5:56 AM - Jun 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The character would be involved in a lot of RP, so I would prefer alignment to be NE or CE. As I said in my outline DW is preferred, but I am open to other options...even  using a shield to give a boost to the AC. As far as Domains go, it is not mechanically enforced although they would prefer that the domains are close to the deity's dogma (<a class=\"postlink\" href=\"http://wiki.arelith.com/Cleric\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Cleric</a>). <br/>\n<br/>\n When trying to work out this build on my own, I had thought about Ranger to 9 (for free Imp 2 Weap) but that leaves little room for other things like fighter, etc. Assassin could be cool, but at that point Rogue might be more useful since the DC on DA would be too low to be really effective.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maladus",
      "avatar": "no_avatar.png",
      "timestamp": "7:23 AM - Jun 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Forgot to mention that the multiclass penalty had been removed on Arelith, but the 3 level rule remains.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:50 AM - Jun 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maladus wrote:</strong><hr/>The character would be involved in a lot of RP, so I would prefer alignment to be NE or CE. As I said in my outline DW is preferred, but I am open to other options...even using a shield to give a boost to the AC. As far as Domains go, it is not mechanically enforced although they would prefer that the domains are close to the deity's dogma (<a class=\"postlink\" href=\"http://wiki.arelith.com/Cleric\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Cleric</a>).<br/>\n<br/>\n When trying to work out this build on my own, I had thought about Ranger to 9 (for free Imp 2 Weap) but that leaves little room for other things like fighter, etc. Assassin could be cool, but at that point Rogue might be more useful since the DC on DA would be too low to be really effective.</div></blockquote>\n<div align=\"left\">Can't really convert dogmas into domain names on those pages so I'll leave that up to you.<br/>\n<br/>\n I don't think you will not have much choice if going the DEX route.  Scimi is not finessable so it would be rapier or other suitable. An STR build is counter-productive for a DP cleric because most of the DEX AC and stealth will be washed out.  And there are other issues with the class split.<br/>\n<br/>\n For example, an Epic Dodge (@Lvl 27) clc12/ftr4/rog14 has high XP penalty using elf's unfavorable class bias (wizard).  You still haven't indicated the favored class for Drow so assume it is the same as elf.  Ftr and CoT are the only feat \"feeders\" but since CoT is out of consideration, your evil bias forces the penalty. <br/>\n<br/>\n Ranger requires 9 levels to achieve what a fighter can in 6 as far as DWing goes and ftr not limited to light armor.  If you go scimi/shield or STR DW, ranger is even a worse choice.<br/>\n<br/>\n It is looking like you will need to decide between scimi and DWing.  Choose one. Assassin still looks like the best choice because at least you avoid -40% XP penalty.  Ignore the DC altogether and focus on skill dumps, avoiding XP penalty and get the same sneak damage but Epic Dodge is not part of clc/ftr/asn recipe.<br/>\n<br/>\n edit: just ninja'd before posting.  Hmmm... so the clc/ftr/rog poses no XP penalty issue on Arelith then?  Very unusual.  Then choose your favorite martial finessable weapon and we will examine the trade-offs between DWing and S/S.<br/>\n<br/>\n Something like this for the earliest ED possible, high-stealth with pre-epic BAB 15 ...<br/>\nSpoiler [+]<br/>\n<br/>\n Fighter(4), Rogue(14), Cleric(12), Elf/Drow (Any alignment)<br/>\n<br/>\n STR: 8<br/>\n DEX: 18 (26)<br/>\n CON: 10<br/>\n WIS: 16<br/>\n INT: 14<br/>\n CHA: 8<br/>\n<br/>\n 01: Rogue(1): Blind Fight<br/>\n 02: Rogue(2)<br/>\n 03: Rogue(3): Knockdown<br/>\n 04: Fighter(1): DEX+1, Weapon Focus: Rapier, (DEX=19)<br/>\n 05: Fighter(2): Weapon Finesse<br/>\n 06: Fighter(3): Expertise<br/>\n 07: Cleric(1): Doms War (or Animal)/Travel (or Strength or Trickery)<br/>\n 08: Cleric(2): DEX+1, (DEX=20)<br/>\n 09: Cleric(3): Improved Knockdown<br/>\n 10: Cleric(4)<br/>\n 11: Cleric(5)<br/>\n 12: Cleric(6): DEX+1, Improved Critical: Rapier, (DEX=21)<br/>\n 13: Cleric(7)<br/>\n 14: Cleric(8)<br/>\n 15: Cleric(9): Extend Spell<br/>\n 16: Cleric(10): DEX+1, (DEX=22)<br/>\n 17: Cleric(11)<br/>\n 18: Rogue(4): Empower Spell<br/>\n 19: Rogue(5)<br/>\n 20: Rogue(6): DEX+1, (DEX=23)<br/>\n 21: Rogue(7): Epic Weapon Focus: Rapier<br/>\n 22: Rogue(8)<br/>\n 23: Rogue(9)<br/>\n 24: Rogue(10): DEX+1, Great Dex, Improved Evasion, (DEX=25)<br/>\n 25: Rogue(11)<br/>\n 26: Rogue(12)<br/>\n 27: Rogue(13): Epic Dodge, Defensive Roll<br/>\n 28: Cleric(12): DEX+1, (DEX=26)<br/>\n 29: Rogue(14)<br/>\n 30: Fighter(4): Epic Prowess, Armor Skin<br/>\n<br/>\n<br/>\n<br/>\n Note that the final Ftr level comes very late to enable early ED and late Disc dump.  Else, take Ftr 4 at 24 or 27 for earlier Disc dump with ED at 30.<br/>\n (I assume you might be able to gift some additional DEX into the build.)<br/>\n<br/>\n ... else a DW STR version w/shorties (or light hammers, maces, handaxes) but significantly less skilled<br/>\nSpoiler [+]<br/>\n<br/>\n Fighter(12), Rogue(6), Cleric(12), Elf/Drow (Any alignment)<br/>\n<br/>\n STR: 14 (24)<br/>\n DEX: 14 (15)<br/>\n CON: 10<br/>\n WIS: 16<br/>\n INT: 14<br/>\n CHA: 8<br/>\n<br/>\n 01: Rogue(1): Blind Fight<br/>\n 02: Rogue(2)<br/>\n 03: Rogue(3): Knockdown<br/>\n 04: Fighter(1): DEX+1 (15), WF: Shortsword<br/>\n 05: Fighter(2): Ambidexterity<br/>\n 06: Fighter(3): TWF<br/>\n 07: Cleric(1): Doms Trickery/Travel<br/>\n 08: Cleric(2): STR+1 (15)<br/>\n 09: Cleric(3): Extend Spell<br/>\n 10: Cleric(4)<br/>\n 11: Cleric(5)<br/>\n 12: Cleric(6): STR+1 (16), ITWF<br/>\n 13: Cleric(7)<br/>\n 14: Cleric(8)<br/>\n 15: Cleric(9): ImpCrit: Shortsword<br/>\n 16: Cleric(10): STR+1 (17)<br/>\n 17: Cleric(11)<br/>\n 18: Rogue(4): Empower Spell<br/>\n 19: Rogue(5)<br/>\n 20: Fighter(4): STR+1 (18), WS: Shortsword<br/>\n 21: Fighter(5): Grt Str (19)<br/>\n 22: Fighter(6): EWF: Shortsword<br/>\n 23: Fighter(7)<br/>\n 24: Fighter(8): STR+1 (20), Grt Str (21), Epic Prowess<br/>\n 25: Cleric(12)<br/>\n 26: Fighter(9)<br/>\n 27: Fighter(10): Grt Str (22), Armor Skin<br/>\n 28: Fighter(11): STR+1 (23)<br/>\n 29: Rogue(6)<br/>\n 30: Fighter(12): Grt Str (24), EWS: Shortsword<br/>\n<br/>\n<br/>\n<br/>\n Morphing this into scimi/board would be rather easy and gain 3 feats (possibly PA/Cleave and IKD) that route.<br/>\n<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maladus",
      "avatar": "no_avatar.png",
      "timestamp": "8:02 PM - Jun 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">When looking at the martial finessable weapons, I would go with rapier to get the increased critical threat range. Just out of curiosity, how would either of those two builds be when soloing?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:58 PM - Jun 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A nice, simple STR-based scimitar-and-shield Cleric 24 / Fighter 6 would be powerful. With 24 levels of Cleric, your buffs would be indespellable. Assuming a female Drow with Cleric as the favored class, there would be no EXP penalty.<br/>\n If you're not concerned with indispellability, I could make a DEX-based rapier-and-shield Cleric 18 / Fighter 6 / Bard (or Rogue) 6 with more Tumble AC and minimal EXP penalty.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:15 AM - Jun 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maladus wrote:</strong><hr/>When looking at the martial finessable weapons, I would go with rapier to get the increased critical threat range. Just out of curiosity, how would either of those two builds be when soloing?</div></blockquote>\n<div align=\"left\">Yah, for sword/board, probably the best choice unless you can buy <em>Keen Edge</em> scrolls, then handaxe's multiplier would prevail.  DWing needs either shorties for crit range or handaxes for multiplier (dmg) else the offhand AB penalty will be stiff.  Some DW players like hammers or maces for bludgeoning but there are so few races (like skels) that are painted with a specific damage resistance type, that it seldom produces much advantage in the long run.<br/>\n<br/>\n I've soloed toons similar to these within SP &amp; PW alike without much problem.  Once you get a few cleric levels in, the heavy work will lighten considerably.  At low levels I'll use the animated summon, slot some inflict spells (or other Neg nrg) to help heal it, do very well and risk little.  The trick is to let it (summon) cause as much damage as possible but unsummon before it makes a kill to protect your XP.  Eventually, most summons just get in the way anyway and alert hostiles before you are positioned properly.  Thoroughly explore the advantages of <em>Darkness </em>because it can help to control mobs very easily and all you need is <em>Ultravision </em>to pierce it before TruSee becomes available.<br/>\n<br/>\n The way I set these sequences up accrues the maximum skills via early rogue but you could surely go heavy cleric and postpone rogue until later if you feel a higher level cleric is more comfortable in early going for you.  Fighter will raise your BAB quickly and provide the weapon choices you need... so you can only wait so long before the need to multiclass looms.  To fine-tune aspects of the build like the optimized sequence requires a detailed knowledge of the server, the CRs likely to be encountered in various regions, the equipment availability, etc.  Fortunately, a cleric is competent with strictly mundane gear which is the main class advantage in low- to mid-magic environs.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maladus",
      "avatar": "no_avatar.png",
      "timestamp": "6:28 AM - Jun 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I don't know about Keen Edge scrolls, but there is a craftable weapon that has permanent keen on it with a maximum of +3 AB. I still feel like DW is more in the spirit of the orignal build I looked at, and fits better with the chosen deity since Vhaeraun's followers tend to be assassins or rogues. That said, though it would be cool, I don't feel like stealth is key to who the character is so it's not a big deal to do without that. <br/>\n<br/>\n So with that being said, I think the STR DW route is something that I'm starting to be more attracted to. Do you suffer a penalty when DW rapiers?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:36 AM - Jun 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maladus wrote:</strong><hr/>Do you suffer a penalty when DW rapiers?<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">DWing rapiers is -4 mainhand and offhand with Ambi/TWF.  DWing light weapons (like shorties) is -2 MH/OH.  In a 40 cap build you m ight be able to focus in 2 weapons (medium/light) at once but is beyond the scope in this case.  BTW, you only need rapiers for DEX builds (i.e. finessed attack).  The penalty would be the same in a STR build DWing scimis (another non-light weapon), your preferred weapon. <br/>\n<br/>\n For PvM, it comes down to whether you feel you can hit the higher AC hostiles with that big of a penalty or not (divine buffs can only compensate so much).  Remember, in the early (low BAB) DW levels, -4 AB could end up resulting in up to 50% penalty (the multiclass limitation on Arelith discourages quick pre-epic attack power for 3/4 classes). Then again, you could just switch to sword/board and save the DWing for lesser opponents.  In PvP, though, -4 AB would be HUGE!  Combined with the standard -5 BAB progression, you'll be swatting and missing a lot with those extra attacks.<br/>\n<br/>\n I assumed you wanted to maximize sneak opportunities via stealth so apologies.  Using <em>Darkess </em>you really don't need stealth in most cases so focus on detection.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maladus",
      "avatar": "no_avatar.png",
      "timestamp": "6:49 PM - Jun 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I tried the STR DW build in a PGCC and it performed pretty good. How would the skill spread look? I went with this when trying it out:<br/>\n<br/>\n Concentration 33(32), Discipline 33(40), Heal 33(36), Spellcraft 25(27), Tumble 32(35), UMD 15(14), remaining skillpoints 15<br/>\n 01: Heal(4), Tumble(4), UMD(4), Save(28),<br/>\n 02: Heal(1), Tumble(1), UMD(1), Save(35),<br/>\n 03: Heal(1), Tumble(1), UMD(1), Save(42),<br/>\n 04: Concentration(7), Discipline(7), Heal(1), Save(31),<br/>\n 05: Concentration(1), Discipline(1), Heal(1), Save(32),<br/>\n 06: Concentration(1), Discipline(1), Heal(1), Save(33),<br/>\n 07: Concentration(1), Heal(1), Spellcraft(10), Save(25),<br/>\n 08: Concentration(1), Heal(1), Save(27),<br/>\n 09: Concentration(1), Heal(1), Save(29),<br/>\n 10: Concentration(1), Heal(1), Save(31),<br/>\n 11: Concentration(1), Heal(1), Save(33),<br/>\n 12: Concentration(1), Heal(1), Spellcraft(5), Save(30),<br/>\n 13: Concentration(1), Heal(1), Save(32),<br/>\n 14: Concentration(1), Heal(1), Save(34),<br/>\n 15: Concentration(1), Heal(1), Save(36),<br/>\n 16: Concentration(1), Heal(1), Save(38),<br/>\n 17: Concentration(1), Heal(1), Spellcraft(5), Save(35),<br/>\n 18: Heal(1), Tumble(15), UMD(9), Save(20),<br/>\n 19: Heal(1), Tumble(1), Save(28),<br/>\n 20: Concentration(3), Discipline(14), Heal(1), Save(14),<br/>\n 21: Concentration(1), Discipline(1), Heal(1), Save(15),<br/>\n 22: Concentration(1), Discipline(1), Heal(1), Save(16),<br/>\n 23: Concentration(1), Discipline(1), Heal(1), Save(17),<br/>\n 24: Concentration(1), Discipline(1), Heal(1), Save(18),<br/>\n 25: Concentration(1), Heal(1), Spellcraft(5), Save(15),<br/>\n 26: Concentration(1), Discipline(1), Heal(1), Save(16),<br/>\n 27: Concentration(1), Discipline(1), Heal(1), Save(17),<br/>\n 28: Concentration(1), Discipline(1), Heal(1), Save(18),<br/>\n 29: Heal(1), Tumble(10), Save(17),<br/>\n 30: Concentration(2), Discipline(3), Heal(1), Save(15),<br/>\n<br/>\n Not sure if that is what you had in mind, but I could see me putting 5 more points into UMD (on Arelith you don't really need more than 15 in UMD unless you really want to use racial only items) because I don't know where else to put the extra points. Also, how important is Blind Fight? I wonder if the feats could be changed to pick up IKD...but I'm not sure whether the tradeoff is worth it or if it is even possible.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:45 PM - Jun 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maladus wrote:</strong><hr/>How would the skill spread look? I went with this when trying it out:<br/>\n<br/>\n Concentration 33(32), Discipline 33(40), Heal 33(36), Spellcraft 25(27), Tumble 32(35), UMD 15(14), remaining skillpoints 15<br/>\n<br/>\n Not sure if that is what you had in mind, but I could see me putting 5 more points into UMD (on Arelith you don't really need more than 15 in UMD unless you really want to use racial only items) because I don't know where else to put the extra points. Also, how important is Blind Fight? I wonder if the feats could be changed to pick up IKD...but I'm not sure whether the tradeoff is worth it or if it is even possible.<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Since you are ignoring stealth, that opens up a lot of skill ranks and you have done a decent job figuring out how to spread them out.  Using the bias you've provided, this is my version:<br/>\nSpoiler [+]<br/>\n<br/>\n Concentration 33(33), Discipline 33(40), Heal 30(33), Spellcraft 28(30), Tumble 30(32), UMD 32(31)<br/>\n<br/>\n 01: Heal(4), Tumble(4), UMD(4), Save(28)<br/>\n 02: Heal(1), Tumble(1), UMD(1), Save(35)<br/>\n 03: Heal(1), Tumble(1), UMD(1), Save(42)<br/>\n 04: Concentration(7), Discipline(7), Heal(1), Save(31)<br/>\n 05: Concentration(1), Discipline(1), Heal(1), Save(32)<br/>\n 06: Concentration(1), Discipline(1), Heal(1), Save(33)<br/>\n 07: Concentration(1), Heal(1), Spellcraft(7), Save(28)<br/>\n 08: Concentration(1), Heal(1), Spellcraft(1), Save(29)<br/>\n 09: Concentration(1), Heal(1), Spellcraft(1), Save(30)<br/>\n 10: Concentration(1), Heal(1), Spellcraft(1), Save(31)<br/>\n 11: Concentration(1), Heal(1), Spellcraft(1), Save(32)<br/>\n 12: Concentration(1), Heal(1), Spellcraft(1), Save(33)<br/>\n 13: Concentration(1), Heal(1), Spellcraft(1), Save(34)<br/>\n 14: Concentration(1), Heal(1), Spellcraft(1), Save(35)<br/>\n 15: Concentration(1), Heal(1), Spellcraft(1), Save(36)<br/>\n 16: Concentration(1), Heal(1), Spellcraft(1), Save(37)<br/>\n 17: Concentration(1), Heal(1), Spellcraft(1), Save(38)<br/>\n 18: Heal(1), Tumble(15), UMD(15), Save(17)<br/>\n 19: Heal(1), Tumble(1), UMD(1), Save(24)<br/>\n 20: Concentration(3), Discipline(14), Heal(1), Save(10)<br/>\n 21: Concentration(1), Discipline(1), Heal(1), Save(11)<br/>\n 22: Concentration(1), Discipline(1), Heal(1), Save(12)<br/>\n 23: Concentration(1), Discipline(1), Heal(1), Save(13)<br/>\n 24: Concentration(1), Discipline(1), Heal(1), Save(14)<br/>\n 25: Concentration(1), Heal(1), Spellcraft(11), Save(5)<br/>\n 26: Concentration(1), Discipline(2), Heal(1), Save(5)<br/>\n 27: Concentration(1), Heal(1), Save(7)<br/>\n 28: Concentration(1), Save(10)<br/>\n 29: Tumble(8), UMD(10), Save(2)<br/>\n 30: Concentration(2), Discipline(4)<br/>\n<br/>\n<br/>\n<br/>\n Not being familiar with Arelith, you seem to have placed a priority on the Heal skill so I have incorporated it likewise.  For most environments, though, I would have shifted all those points over to Listen to help detect invisibles and hiddens approaching.  You would know better than I the relative value of those skills on your server.  But even ignoring the bias, you still should want the saves vs. spells as high as possible since this build is not structured for high-saves (my sheet shows F/W/R of 17/17/15 and 23/23/21 vs spells) but just barely enough.  Your divine buffs will help some as will scrolls of <em>Protection from Spells</em> (+8 vs. spells if available) but that is certainly not the focus of this build.<br/>\n<br/>\n<em>Blind Fight</em> is possibly the singlemost important melee feat in existence.  Check the <strong><a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Blind_fight\" rel=\"noreferrer\" target=\"_blank\">wiki description</a></strong> to get a better feel of what your toon will be exposing itself to without it.  TBH, I even started using the feat with my dedicated archers because they waste too much expensive ammo trying to hit shadows and other concealed types without it.  With that annoying drain touch attack looming, it's important to dispatch those races quickly.<br/>\n<br/>\n UMD:  So are you telling me Arelith doesn't use the standard scroll check?  If it doesn't, you can get by with just enough for a value check and item valuation depends on the server.  Level 9 scrolls are usually somewhere in the 3k to 4K gold range which means a UMD of about modified 5 is plenty.  But that doesn't address the value of rods, wands and other more expensive magical items that might bolster your buffing potential.  The most important UMD advantage for a cleric is to gain access to mantles and even better... BREACHES!  It's the only way a non-arcanist has to lower enemy SR other than druid's <em>Nature's Balance</em>.  At Level 31, and with the standard scroll check in effect you will be able to cast spells by scroll up to Level 7.  Beyond that level, scrolls have a +5% extra failure rate per level (i.e. at UMD 31, a Level 9 scroll would have a 10% chance of fizzling dead when used).<br/>\n<br/>\n TBH, this build, even with all those fighter levels, is still feat-starved in pre-epic (which is where you would be taking IKD, +save feats, skill focus, etc.).  A DP cleric needs to keep pre-epic BAB below 16 and any more fighter levels would put this toon over.  You really need <strong>all</strong> those I've outlined.  <em>Extend</em> for lengths for your primary buffs and <em>Empower</em> to boost your abilities as high as possible (Empowered Healing Circle is also very sweet around mobs of undead).  Nope.  I don't see any wiggle room which why I discarded the DEX version.  There is simply no room to insert Weapon Finesse without losing a crucial proficiency for most situations.  Now, a single hand option? Yes.  A few more feats to choose from.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:47 PM - Jun 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You actually have 17 extra points, not just 15, because having 32 Tumble isn't any more helpful than 30 points. With Tumble, you get +1 AC from every 5 base ranks in Tumble, not the net score, unlike Spellcraft or UMD. On the other hand, if you can get your Spellcraft to 33 (or 28), your net score would be a multiple of 5, which is what you need for another +1 to saves against spells.<br/>\n My favorite place to dump left-over skill points is Lore, so I don't have to trek to a merchant and waste 100 old to identify something. Since you're on a PW, maybe a crafting skill would be nice.<br/>\n<br/>\n EDIT: Ninja'd, and I forgot to answer the question about Blind Fight, but Hip has you covered there.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maladus",
      "avatar": "no_avatar.png",
      "timestamp": "10:22 PM - Jun 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Cool, well then looks like we've got most things figured out. Thanks a lot guys!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maladus",
      "avatar": "no_avatar.png",
      "timestamp": "11:46 PM - Jun 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually, now that I think about it, would you recommend a Domain other than Trickery since stealth is not a factor? Travel is still really useful for Haste.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:13 AM - Jun 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><em>Trickery</em> is actually used more to get access to ImpInvis but I agree, without vesting into rogue skills, it's benefits are somewhat diluted.<br/>\n<br/>\n Probably either<em> Strength</em> or <em>Magic</em>.  Strength for earlier DP + Stoneskin.  Magic for Mage Armor (the dodge AC always stacks) + Stoneskin.  Since this build never gets any higher than Clc 12, any domain with dominant spells after 6 (like War and Plant) have little value.  So choose wisely.<br/>\n<br/>\n Just be sure to cast Emp Eagle before you use any domain special abilities in order to extend the duration as long as possible.<br/>\n<br/>\n Check back as to your progress on the server with this build.  When you are satisfied with the performance, consider posting it as an Arelith finished, tested build in the level 30 cap section listing the Pros/Cons revealed by your own experience.  As far as I am concerned, YOU are now the owner. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />  Game on!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maladus",
      "avatar": "no_avatar.png",
      "timestamp": "4:53 AM - Jun 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I got to looking at the build, and was thinking...would it make more sense to take the 12th level of Cleric at 27 to get the 2 additional skill points into Spellcraft to make it an even 30 to get an additional +1 against spell saving throws? Also, double checked with someone on the server and you don't need anymore than 20 in UMD. The spell failure DC for scrolls is apparently nonexistent on Arelith.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:25 AM - Jun 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maladus wrote:</strong><hr/>I got to looking at the build, and was thinking...would it make more sense to take the 12th level of Cleric at 27 to get the 2 additional skill points into Spellcraft to make it an even 30 to get an additional +1 against spell saving throws? Also, double checked with someone on the server and you don't need anymore than 20 in UMD. The spell failure DC for scrolls is apparently nonexistent on Arelith.</div></blockquote>\n<div align=\"left\">Spellcraft is modified by your intrinsic INT so already reaches 30 at Level 25. The only other option is to delay final Clc 12 until Level 30 to get 33 (35) for +7 vs spells.  It's your own preferance whether the extra slots for level 5 &amp; 6 spells five levels earlier is more playable or not. Decide how much your capped toon will be played to make that choice.  That is more of a PvP issue.  How this build will perform in duels is anybody's guess as it was not designed with that in mind.<br/>\n<br/>\n If Arelith doesn't use the hardcore scroll check then set UMD at whatever level is needed to use the equipment/wands you have your eye on. Since I have no idea how your server sets gold value for each property, only you can make that assessment.  Vanilla UMD uses 300K, 600K &amp; 1M gold for levels 20, 25 &amp; 30, respectively for class emulation.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}