{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "297",
  "name": "Terracotta Soldier (Dragon Blade) (PvP) FTR 28 Bard 2 RDD 10",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/terracotta-soldier-dragon-blade-pvp-ftr-28-bard-2--t2293083.html",
  "author": "TyrTemplar",
  "avatar": "no_avatar.png",
  "replies": 4,
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "8:40 AM - Oct 17, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong><br/>\nTerracotta Soldier (Dragon Blade) (PvP) --FTR(28), Bard(2), RDD(10)</strong><br/>\n<strong>By Deborah “Tyr” Templar</strong> <br/>\n<blockquote><div>\n<strong>Author’s Note – Credits and Adaptation/Revision History: </strong><br/>\nThis is the Terracotta Soldier, based on my NWN2 (ECB2) Wind Duke (Dragon Blade), as subsequently modified (co-authored) by myself and Mithdradates (for your mortal combat pleasure in his Hall of Training see: <a class=\"postlink\" href=\"http://ecb2nwn2.faerunonline.com/builds/data2/30build296017.html\" rel=\"noreferrer\" target=\"_blank\">http://ecb2nwn2.faerunonline.com/builds ... 96017.html</a> ). In making these adaptations, Mith and I were keeping with the true spirit of our drakes in NwN1 (ECB1)—the Duke/Soldier itself tracing from my Dragon Blade and companion series (modified for NWN2), with the Soldier in turn adapted once again therefrom so as to return here in the ECB1, thus accounting for 1.69, etc. <br/>\n<br/>\nMay the legend of the Dragon Riders Live ON! ~ Tyr. </div></blockquote>\n<strong>Dragon Blade (The Summary):</strong><br/>\nDragon Blades were an elite fighting force, comprised of plane warriors who actually rode and fought on dragons; the pair, rider and dragon, were dedicated to the preservation and defense of the native planes, many of whom took part in the Dragon Wars. It is said the bond between dragon and his/her rider is a strong and magical one. It is also said that, in time, the bond grows between a rider and his/her dragon, such that they begin to “see” and “think” as one, and that each of the pair eventually take on many characteristics of the other. It is widely believed all Dragon Blades (and their dragons) died out during the time of the dragon wars.<br/>\n<br/>\nThey are wrong: a few survived. <br/>\n<br/>\n(**For the Full and Complete Story of the Terracotta Soldier (Dragon Blade), entitled: “The Emperor’s New Blade” see, <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/terracotta-soldier-dragon-blade-barbarian-28-rdd-10-bard-2-t2292942.html#p20291317\" rel=\"noreferrer\" target=\"_blank\">terracotta-soldier-dragon-blade-barbarian-28-rdd-10-bard-2-t2292942.html#p20291317</a> ).<br/>\n<br/>\n<strong>The Build--Pros and Cons</strong>:<br/>\nThis Soldier is focused in two different weapons (delivering two different damage types) and is loaded with Combat Feats, including Devastating Critical (DC 45 / 51 BioCap) on both weapons; with high/PG AB  50 [natural 49+1Song, +6 Taunt: 56] to land those devastating crits, and high Drake STR charged damage, cuts down mobs like there’s no tomorrow.<br/>\n<br/>\nBased on the maxim that the best Defense is a strong Offense, has a nice enough AC for a melee warrior (thanks to RDD, with Expertise for more), bolstered by IKD, Improved Disarm and over 500HPs, such that defense is solid nevertheless.  As is typical of melee builds, saves could be better (with the exception of Fort, which is alright), but enjoys IKD, RDD immunities (Fire, etc.) and a decent skill set, including UMD (magic access' always nice to have on a melee build, for shoring up saves etc while adding versatility like using monk gear, etc., too). <br/>\n<br/>\nNOTE: This build is a PG build that is also playable, but if you prefer a different Soldier without disarm (i.e., for PvM/PvE, where monster claws cannot be disarmed) see: Barbarian Variant: <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/terracotta-soldier-dragon-blade-barbarian-28-rdd-10-bard-2-t2292942.html\" rel=\"noreferrer\" target=\"_blank\">terracotta-soldier-dragon-blade-barbarian-28-rdd-10-bard-2-t2292942.html</a> (DevCrit with Terrifying Rage instead), <br/>\nOR  <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/dragon-rider-the-mighty-blade-barbarian-28-rdd-10-bard-2-t2292943.html\" rel=\"noreferrer\" target=\"_blank\">dragon-rider-the-mighty-blade-barbarian-28-rdd-10-bard-2-t2292943.html</a> [with an even more Terrifying TR and EDR III (DR 15/-) in lieu of Disarm and Dev.Crit], with links therein to the original “Dragon Blade” and others in the series). On the other hand, if strictly interested in PvP, then see Alt/Optimization Note in the Level Guide Section, Below (and what the Soldier, ECB2 was/is all about!). <br/>\n<br/>\nWithout any further ado, please meet:<br/>\n<br/>\n<strong>Terracotta Soldier (Dragon Blade) (PvP)<br/>\nRace: Human.  Alignment: Any Non-Lawful (Theme: Chaotic Neutral)</strong><br/>\n<br/>\n<strong>I Attributes:</strong><br/>\nSTR: 18 (40)<br/>\nDEX: 10<br/>\nCON: 14 (16)<br/>\nWIS: 8<br/>\nINT: 14 (16)<br/>\nCHA: 8 (10)<br/>\n<br/>\n<strong>II Level Guide</strong>:<br/>\n01: Fighter(1): Luck of Heroes, Toughness, Power Attack<br/>\n02: Fighter(2): Cleave<br/>\n03: Fighter(3): Weapon Focus: Scimitar<br/>\n04: Fighter(4): STR+1, Weapon Specialization: Scimitar, (STR=19)<br/>\n05: Fighter(5)<br/>\n06: Fighter(6): Weapon Focus: Heavy Flail, Weapon Specialization: Heavy Flail<br/>\n07: Fighter(7)<br/>\n08: Fighter(8): STR+1, Knockdown, (STR=20)<br/>\n09: Fighter(9): Blind Fight<br/>\n10: Fighter(10): Improved Critical: Scimitar<br/>\n11: Fighter(11)<br/>\n12: Fighter(12): STR+1, Great Cleave, Improved Critical: Heavy Flail, (STR=21)<br/>\n13: Fighter(13)<br/>\n14: Fighter(14): Improved Knockdown<br/>\n15: Fighter(15): Great Fortitude<br/>\n16: Fighter(16): STR+1, Disarm* (STR=22)<br/>\n17: Fighter(17)<br/>\n18: Fighter(18): Impr.Unarmed Strike (OR, SF: Discipline, +3 Disc. )*, Improved Disarm*<br/>\n19: Fighter(19)<br/>\n20: Fighter(20): STR+1, Expertise, (STR=23)<br/>\n21: Bard(1): Epic Weapon Focus: Scimitar<br/>\n22: Red Dragon Disciple(1)<br/>\n23: Red Dragon Disciple(2): (STR=25)<br/>\n24: Red Dragon Disciple(3): STR+1, Epic Weapon Focus: Heavy Flail, (STR=26)<br/>\n25: Red Dragon Disciple(4): (STR=28)<br/>\n26: Red Dragon Disciple(5)<br/>\n27: Red Dragon Disciple(6): Epic Prowess (or, one of: Epic Fort or ESF: Disc)*<br/>\n28: Red Dragon Disciple(7): STR+1, (STR=29), (CON=16)<br/>\n29: Red Dragon Disciple(8)<br/>\n30: Red Dragon Disciple(9): Great Strength I, (STR=30), (INT=16)<br/>\n31: Red Dragon Disciple(10): {Darkvision}, (STR=34), (CHA=10)<br/>\n32: Fighter(21): STR+1, (STR=35)<br/>\n33: Fighter(22): Great Strength II, Overwhelming Critical: Scimitar, (STR=36)<br/>\n34: Fighter(23)<br/>\n35: Fighter(24): Devastating Critical: Scimitar<br/>\n36: Fighter(25): STR+1, Great Strength III, (STR=38)<br/>\n37: Fighter(26): Overwhelming Critical: Heavy Flail<br/>\n38: Fighter(27)<br/>\n39: Fighter(28): Great Strength IV, Devastating Critical: Heavy Flail, (STR=39)<br/>\n40: Bard(2): STR+1, (STR=40)<br/>\n<br/>\n* Weapon Note: Scimitar (Slashing, medium size weapon) and Heavy Flail (Bludgeoning, large size/2-handed weapon) taken for a number of reasons, including the ability to deliver different damage types; also, and whereas the scimitar enables tower shield use and has a nice crit range (+AC and forcing the crits), the heavy flail is a 2-hander (consistent damage delivery on i.e. crit immune enemies/monsters) and for which size you’ll gain a bonus when it comes to the disarm game (size of weapon counts!). As always, players are free to switch out to another combination of their own choosing. For more info, see: <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Improved_disarm\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Improved_disarm</a>  and <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Disarm\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Disarm</a> .<br/>\n<br/>\nFor more info about Called Shot, IKD and Imp.Disarm, see: <br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Called_shot\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Called_shot</a> (Called Shot); <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Knockdown\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Knockdown</a> and <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Improved_knockdown\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Improved_knockdown</a> (IKD);  “Weapon Note” links re: Imp.Disarm, above.  [/quote]<br/>\n<br/>\nIf looking to PvM/E your Soldier, then drop the disarm line (since monster claws can't be disarmed), picking up Lightning Reflexes at level 18, along with Impr.Power attack and Impr.Expertise (instead of disarm and impr. disarm, respectively), or other feats of your own choosing. Conversely, if for any reason uninterested in Dev.Crit (ie, it's banned on your world, etc.), then drop Grt.Cleave (for one of the above or other of your own choosing), taking EWS in Scim and Heavy Flail (instead of OC feats), Armor Skin and Epic Toughness (instead of DC feats).<br/>\n<br/>\n---<br/>\n<br/>\n<strong>III Basics</strong>:<br/>\na. Hitpoints: 536<br/>\n<br/>\nb. <strong>Saving Throws (vs. Spells)</strong>:<br/>\nFort: 28 (31)<br/>\nWill: 16 (19)<br/>\nReflex: 17 (20) <br/>\n<br/>\nOther: RDD Immunities (Fire, Paralysis, Sleep), Darkvision, UMD<br/>\n<br/>\n<strong>IV Combat Vitals:</strong><br/>\na.  Devastating Critical (DC): 45 (assuming +12 STR: DC 51)<br/>\n<br/>\nb. Attack Bonus (AB):<br/>\nBAB: 30, AB 49 +1 Song: 50, +6 Taunt: AB 56 <br/>\nBio-Cap (assuming +12 STR, Weaponry/UMD): Melee:  75, +6 Taunt: AB 81     <br/>\n<br/>\nc. Damage (Illustrative):<br/>\n*Mundane Scimitar: 1-6+17, +1 Song, OR: 1-6+18 (crit: 15-20/x2) (Keen: 12-20/x2)<br/>\n*Mundane Heavy Flail: 1-10+24, +1 Song, OR: 1-10+25 (17-20/x2)<br/>\n<br/>\n<strong>V Defense Vitals (AC)</strong>:<br/>\nAC 22 , +8 Mundane Plate, +3 Mundane Tower Shield: AC 33 (38 Ecpertise, -5 AB) <br/>\n<br/>\nOTHER: UMD, Improved Knockdown, Improved Disarm, Devastating Critical; combatants cannot harm you when they’re disarmed and/or they’re dev.critted/dead, no? <br/>\n<br/>\n<strong>VI. Spell Casting</strong>: UMD<br/>\n<br/>\n<strong>VII. Skillpoints</strong>: 229*<br/>\nDiscipline 43(58), Listen 43(42), Lore 8(13) (RDD prereq.), Perform 6(6), Spellcraft 12(15), Taunt 42(42), Tumble 40(40), UMD 35(35)<br/>\n<br/>\n*As always, players should feel free to adjust their Soldier in order to suit their own needs/environs.<br/>\n<br/>\n<strong>Other Combos</strong>:<br/>\nThere are 22 builds that utilize this class combo at time of posting the Wind Duke/Terracotta Soldier in the ECB2 (NWN2),  only 2 of which use this same class split—namely, Munchkin the Dwarf Dragon Wannabe fighter 28 / bard 2 / red dragon disciple 10 (dwarf) by Xylophone (goes CON/EDR route), and Dragon Warrior fighter 28 / bard 2 / red dragon disciple 10 (human) by Spooky222 (a nice PvM build), such that the Terracotta Soldier being a PG/melee Drake warrior was/remains unique. <br/>\n<br/>\n<strong>Crit, Slash, Sing ON! ~ Tyr</strong><br/>\n<br/>\nEdit: added non-disarm alternative under level guide for those who want to PvM/E their Soldier.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:12 PM - Oct 17, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Do you REALLY expect to get disarmed enough to warrant vesting a feat into a weapon proficiency that is unfocused and poor crit range?  If disarming is such a hazard, why not just slot a spare scimi or flail weapon switch and break out of combat long enough to execute it?  Seems overly defensive investment to me.  Dunno about that strategy.   Those capped uber-magic ratings seem impressive but typically, because the ACs will dwarf them in that sort of environment, 20-rolls will become your staple.  And you'll need to get very lucky on all your Taunt rolls to compete.<br/>\n<br/>\nBTW, unless your server has fixed it, Terrifying Rage is broken.  It unduly penalizes a single class, pally, for the aura of courage required feat.  Besides, in PvP TR is so easily countered (clarity potions, any mind blank scroll version, protection from alignment if not some neutral alignment) it becomes a wasted feat.  Against poorly-designed monster skins &amp; AIs, I suppose it has its uses, but bug exploitation is lame... IMHO.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "4:26 AM - Oct 18, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hip,<br/>\n<br/>\nGood question re: the one feat \"impr.unarmed strike\" (not exactly like Soldier is feat starved, as he most definitely isn’t) so far as Soldier –who doesn’t have TR, being a straight-up (no buffs, no tricks, no nonsense) PG/Drake warrior--isn't particularly worried about being disarmed, but rather is the one who will be doing the disarming, IKD’ing –and- dev.critting in PvP. However, always good to have a “back up” i.e. effective Fist just in case (some say I worry too much, and I can live with that). In PvP, if your opponent pulls another weapon, marvelous, open themselves up and just take it again. No such thing as an endless supply, no forge on the battle field to make another. Can’t do a “time out” by hitting the space button much less scrolls and potions lying around either, and no such thing as immunity to dev.crit, etc.—it’s a fort save against insta-death, Soldier being a PG/Drake warrior’s DC is HIGH (DC 45 / 51 StrCap): you crit, they die. Very effective ... LOL.  <br/>\n<br/>\nIn real-time battle, melee vs. melee an opponent without their weapon doesn’t hit/damage and as if not more importantly without their weapon they CANNOT dev.crit. Disarming foes is a proper (major) battle tactic and used throughout the ages in RL for a reason—warrior v. warrior, depriving them of their weapons which they would really like to use to kill you, but you take it away from them so that they can’t, using yours to kill them instead (war is war:  you have yours, you dev.crit, and they're dead. Simple is really best). This –the disarm game--is the Game in NWN2 (note: no dev.crit NWN2, so was about KD instead but then that got nerfed in the MOTB (cool down), so disarm to protect oneself against crit-crazy WMs and sneak-charged/HiPs sneakers, and which “disarm (PvP) game” the ECB2 Terracotta Soldier started (as discussed in the ECB2 build and links therein to his forebears), that being the game NWN2 only no dev.crit; with dev.crit alive and well NWN1, heh, even better and far more fun, yet at the same time makes disarm/improved disarm EVEN MORE IMPORTANT. Remember: Dev.crit is a Fort save against INSTANT DEATH!<br/>\n<br/>\nWithout their weapon, though, your opponents CANNOT dev.crit (much less anything else, really). Simple. Meantime, called shot, disarm and KD are a discipline check against AB; with Soldier’s Naked AB 50 (75 Cap, the Taunt bonus on top of all that is great but lowers AC for effective AB so doesn’t count for these purposes) and with his high Drake STR charged Discipline with SF/ESF Disc. (likewise enhance with STR gear, whatever your opponents get, of course you get, too; they’d better be comfortable with their fist, etc. —heh, heh). <br/>\n<br/>\nUnarmed Strike: <br/>\nHaving monk gloves (UMD) in the glove/bracers slot supposedly protects against an AoO [which otherwise happens when you perform an action with your fist, like striking out which AoO the “imp.unarmed strke” feat removes, and why it was taken (only monks get that one for free, which makes total sense, and they augment same with monk equipment like gloves which Soldier can do, too, thanks to UMD)]. That said, Soldier’s Naked Fist AB (unfocused mundane weapons, too) is very good/HIGH, coming in at AB 47 (Cap: 72, +6 Taunt: 78) such that he hits with his fist. And with all that HIGH Drake STR 40 coming in (Naked Fist Damage: 1—3+16 (15 STR+1 Song); make that 1-3+22 with STR gear, and which can be enhanced with the monk gear same as the monks do), now thar be damage, and far better than what dexers with equipment do in fact (not that they’ll do much damage, I mean, as against the Soldier, they’ll be disarmed and on their backs … <br/>\n<br/>\nI build characters whose strengths and merits rest on what it that they can do, all natural wholesome stats, without magic enhancements like gear and scrolls. Keep in mind also that whatever your opponents can get, you get as well. Difference is, Soldier doesn’t NEED gear –he’s a PG/DRAKE melee and combat loaded (thus playable in all magic settings/levels/environs), but rather is augmented by it. I prefer power over playability, always did, shooting for 40 excellence. When dependent on a weapon (for obvious reasons) to deliver the dev.crit, you’d best be able to hang onto it; and of course it’s good and proper strategy to deny your opponent theirs (pull out another and they open themselves up and will only lose that one as well; without it, they cannot dev.crit; in the end, they’re weaponless, IKD’d and dev.critted/dead. NEXT). That said, the Bard dump at 21 (tumble, UMD, etc.) speaks not only to the build design but also makes Soldier (and the rest of the Dragon Blade Series) versatile, thus very playable as well (I like playable power, and always did, and UMD/magic access is always nice to have on a melee). <br/>\n<br/>\nSuppose in light of Soldier’s stats that you “could” drop impr.unarmed strike if you’re CERTAIN to get gloves, but me, I wouldn’t do that personally…I do not rely on equipment (who says on any particular world you’re going to get that? Much is world dependent, and besides, Soldier is the opposite of feat-starved as said. Combat loaded, really, and I am not one to rely on equipment, never did). But if you’re 100% on getting it, then suit to taste ... (players are always free to adjust for their own world/environs of course!).<br/>\n<br/>\nBut back to the strategy: Soldier's strategy is simple, and a rather excellent one (I do say humbly). To repeat: opponent’s disarmed, IKD’d and Dev.Critted—i.e., THEY ARE DEAD. NEXT. Works great, and with those stylish dragon wings, looks great doing it, too. Then, one would naturally expect a well-trained, well-disciplined Dragon Riding Soldier who goes on to become an Army General for the First Emperor of China to be exceptionally well trained (combat loaded) and well-disciplined, and Soldier is. You hit, you damage. You crit, they die. Simple is best. <br/>\n<br/>\nPlease know that I appreciate the question and comment. <br/>\n<br/>\nCrit ON! ~ Tyr<br/>\n<br/>\nTerrifying Rage NOTE: Soldier doesn’t have TR, although the Barbarian variants do; sorry to hear developers PvM/PvE some places are incorporating skins, etc. to nerf proper Barbarian Class feats, etc. (PnP/D&amp;D).  Exploiting script to nerf a legitimate, proper long-standing D&amp;D class is not only lame, but frightening in my view. Meantime, will save is a typical weakness of melee warriors, and one of the easiest things to shore up via Clarity potions and UMD (scroll versions) in PvM/PvE, true, but scrolls aren't just lying around for the taking in PvP arenas not to mention dispellable (barring sufficient caster levels, which dispel comes in scroll form, and to which arcane items bard and UMD entitles use); when down a potion or cast (no combat casting) also open yourself up to an AoO (free attack) and might as well congratulate your opponent on their “win” in advance…  <br/>\n<br/>\nTeam play with casters (like clerics on the field, etc.) makes it much more interesting; take Soldier with his all natural, high/PG melee stats out and buff him up for e.g. (not that he needs it); but yes, Clerics and PG/Drakes make for a great combination, always did. Gotta love that Fire immunity among other things. All natural is best! <br/>\n<br/>\nEDIT: remove typos, add dispel info.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:13 PM - Oct 18, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Tyr, I made a very similar build myself, but went Dwarf instead of Human for ~coolnes~. The result was a little higher ending STR (42) by dropping the second weapon and a somewhat different feat selection (as mine didn't focus on saves). The idea of focusing in 2 weapons is kind of nice, though, and it only costs 1 AB and Damage, which makes it even more attractive. I would consider a small tweak in your feat selection order. I have always liked to have Expertise ASAP, so you could delay Toughness and rework your feats to take it from level 1. On WoG, that +5 AC will generally mean that enemies will only hit you on very high rolls (if not only on 20s) and most of the times you won't get critted to death, whereas a couple of extra HP won't do much for ya in the beginning. You can delay Improved Knockdown to lvl 20, as you should still be able to KD things that need to be KDed, or the WF on Heavy Flail, because it can still be deadly even with 1 less AB. Excellent build, kudos!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "6:15 PM - Oct 19, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Glad you like TS! Mith and I had a great time putting him together (ECB2), really does clean up and with dev.crit alive and well in NWN1, heh, re-tooled for ECB1 of course, as that's even better! (Must admit, when it comes to dev.crit, in NWN2 where it didn't exist, I really missed that!).<br/>\n<br/>\nAnd yes, the double weapon focus especially in light of same is quite important, I think so, too. If I were to go pure unbridled STR of it, Half-Orc comes immediately to mind (STR 44), but didn't for many reasons and not just due to XP burden either. Firstly, human = 1 extra feat (LoH=+1 all saves, no such thing as too much saves ....  AND more skills (consider what TS's got to be the \"package\" these days, at least if going to solo PvM/E or enter (PvP) arenas. Second, there are all sorts of crit. immune things (crit strategy and forcing the fort save v. inst-death even though a high DC 45 / 51 Cap just don't work so good against dead things, so need the Heavy Flail for things like that; true also PvP where there are also dev.crit immune things (Pale Masters come to mind), with the heavy flail ensuring that dead things actually stay dead for good ... LOL. <br/>\n<br/>\nPlay Tip: All fun aside, and as is set out in the links above, when it comes to the disarm game (NWN1, being a bit different than NWN2), the combatant with the larger weapon gains a +4 bonus per size category of difference (as between the respective weapons). A successful hit deals normal damage against your foe, and if the opponent fails a discipline check (as against your AB/roll) then you \"win\" (foe disarmed). Unlike the roll/discipline check for a KD/IKD, however, the bonus due to weapon size seemingly affects the roll. In other words, as against say a medium weapon like a scimmy, your just got a whole whack of STR for free in terms of the weapon size boni (double weapon/options are good, indeed!). So, pull your foe's weapon with the Large Heavy Flail (even better if they're IKD'd / prone), then take 'em with the crit chewing, dev.crit forcing scimmy. Alternatively, if it's a crit immune Pale Master or something, then stay with the Heavy Flail and pound 'em hard instead. Different situations call for different strategies of course, thus different \"tools\" (weapons) for the job. Much like casters have different spells, important for melee to have different weapons so as to have options, too, I agree. And with a PG/Drake melee (mundane weapon) naked AB 50,+ Taunt ... you hit, you damage, you crit., things die ... and if crit. immune, then fact the Heavy Flail's crit range isn't as wide as the scimmy's matters not at all; with 1.5 Drake STR charged boni coming in on that, heh, it's deadly alright. Works good!   (thanks, Max).<br/>\n<br/>\nAnd yes, by all means, take Expertise out of the gate if you want, moving Toughness down to where IKD is (and IKD to where Exp. currently is)), and that which you IKD can typically be KD'd still so no problem there, I think (some find a couple HPs in the beginning helpful and why I set it up that way). Me, so long as I get my WF, Cleave and WS in early, with Blind fight in at 9-12, doesn't matter so much when Toughness comes in (it's all retro-active, so matters not really), so long as it does, I'm a happy Soldier. Thanks so much for the compliment, and sounds good. <br/>\n<br/>\nSlash/Bludgeon and Crit ON! ~ Tyr<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}