{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "093",
  "name": "Anomen Delryn, the Squire turned Paladin - Cleric 20 / Paladin 2 / Champion of Torm 18",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/anomen-delryn-the-squire-turned-paladin-cleric-20--t2355639.html",
  "author": "Maximillian_Kane",
  "avatar": "10758866_1605883460.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "5:31 PM - Dec 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hail, Mighty ECBers!<br/>\n<br/>\nToday I present you another one of the Baldur's Gate NPCs, and one I'm very familiar with. See, my PC was old at the time, so it'd crash after a certain part in the game, which meant I could only play it up to a certain point. Anomen was one of the NPCs that I almost always took with me, and the one I always equipped with the Flail of the Ages (which is why I'm giving him the Light Flail focus, and since he also had his Delryn family shield to go with it, it can't be a Heavy Flail. I've also never built any Light Flail focused characters, so it's nice for a change). Anyway, he was a bit of a prick, arrogant, self-righteous and narrow-minded, although his asshollery stemmed not from a sense of superiority, but from the deep insecurity seeded in him by the way his father treated him. When you meet him, he's about to take a test to become a Paladin, and the coolest thing is that your choices will heavily impact whether he succeeds or fails, which will also heavily impact his personality moving forward. If he succeeds, he then becomes more self-confident and proud, whereas if he fails he becomes a \"fuck it all\" kind of guy. In game terms, if he succeeds he becomes Lawful Good, if he fails he becomes Chaotic Neutral. Needless to say that in this interpretation he succeeds. It'd be an interesting exercise to make an alternative build for him if he fails the test. Perhaps I'll do that in the near future.<br/>\n<br/>\nIn the game, he was a high-STR, low-DEX Battle Cleric, which in Ad&amp;D meant his AC was quite bad, represented here by the lack of a Tumble class. I know he was a Fighter / Cleric in terms of classes, but I didn't want to make him that way here, because with a little bit of a poetic license, we could instead of Fighter use CoT in NWN, which way more in line with his story, and has very similar characteristics. He still remains a high-STR, low-DEX battle Cleric, just not using Fighter as part of the build. In powergaming terms, what I tried to accomplish here was to get as much benefit as I could from the bonus feats without severely gimping his stats. Thankfully, CoT allows you to take Great Wisdoms as a Bonus Feat, which means you can certainly spread out his other stats into STR and CHA for the divine feats. WIth the 2 Paladin levels, the CHA bonus will be added to his saves, which are great with 18 CoT levels. He isn't meant to tank, but he can certainly dish out some serious damage. The lack of Evasion certainly hurts, so a Ring of Improved Evasion is desirable. He can also flank and Taunt his enemies with his acid personality and bravado to allow your party to hit them more easily.<br/>\n<br/>\nEDIT: One thing I didn't mention but probably should, is that the Strength Domain is FUNDAMENTAL here, because you'll have 16 WIS for your whole pre-epic life, which means you'll only be able to cast spells up to 6th level. That means your success after a certain point will depend much more on you yourself doing the fighting than on summoned creatures. For that reason, 2 levels of Divine Power are absolutely vital to this build's success.<br/>\n<br/>\nWithout further ado, please welcome Anomen to our halls!<br/>\n<br/>\nCleric(20), Paladin(2), Champion of Torm(18), Human<br/>\n<br/>\nSTR: 16 (26)<br/>\nDEX: 8<br/>\nCON: 10<br/>\nWIS: 14 (20)<br/>\nINT: 14<br/>\nCHA: 14 (18)<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Cleric(1): Expertise, Power Attack, Domain Travel, Domain Strength<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Extend Spell<br/>\n04: Cleric(4): WIS+1, (WIS=15)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): Divine Might<br/>\n07: Cleric(7)<br/>\n08: Cleric(8): WIS+1, (WIS=16)<br/>\n09: Cleric(9): Divine Shield<br/>\n10: Cleric(10)<br/>\n11: Cleric(11)<br/>\n12: Cleric(12): STR+1, Knockdown, (STR=17)<br/>\n13: Cleric(13)<br/>\n14: Cleric(14)<br/>\n15: Cleric(15): Blind Fight<br/>\n16: Cleric(16): STR+1, (STR=18)<br/>\n17: Cleric(17)<br/>\n18: Paladin(1): Weapon Focus: Light Flail<br/>\n19: Champion of Torm(1)<br/>\n20: Champion of Torm(2): STR+1, Improved Critical: Light Flail, (STR=19)<br/>\n21: Champion of Torm(3): Great Wisdom I, {Smite Evil}, (WIS=17)<br/>\n22: Champion of Torm(4): Great Wisdom II, (WIS=18)<br/>\n23: Champion of Torm(5)<br/>\n24: Champion of Torm(6): CHA+1, Great Charisma I, Great Wisdom III, (WIS=19), (CHA=16)<br/>\n25: Champion of Torm(7)<br/>\n26: Champion of Torm(8): Armor Skin<br/>\n27: Champion of Torm(9): Great Charisma II, (CHA=17)<br/>\n28: Champion of Torm(10): CHA+1, Epic Weapon Focus: Light Flail, (CHA=18)<br/>\n29: Cleric(18)<br/>\n30: Champion of Torm(11): Great Strength I, (STR=20)<br/>\n31: Champion of Torm(12)<br/>\n32: Cleric(19): STR+1, (STR=21)<br/>\n33: Champion of Torm(13): Great Strength II, (STR=22)<br/>\n34: Champion of Torm(14): Epic Prowess<br/>\n35: Champion of Torm(15)<br/>\n36: Champion of Torm(16): STR+1, Great Strength III, (STR=24)<br/>\n37: Champion of Torm(17)<br/>\n38: Cleric(20)<br/>\n39: Champion of Torm(18): Great Strength IV, Great Wisdom IV, (STR=25), (WIS=20)<br/>\n40: Paladin(2): STR+1, (STR=26)<br/>\n<br/>\nHitpoints: 360<br/>\nSkillpoints: 215<br/>\nSaving Throws (Fortitude/Will/Reflex): 38/38/30<br/>\nSaving Throw bonuses: Spells: +8<br/>\nBAB: 25<br/>\nAB (max, naked): 37 (melee), 25 (ranged)<br/>\nAC (naked/mundane armor/shield only): 15/26<br/>\nSpell Casting: Cleric(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 43(43), Heal 7(12), Open Lock 1(0), Spellcraft 38(40), Spot 42(47), Taunt 43(47), Tumble 20(19)<br/>\n<br/>\n01: Concentration(4), Heal(2), Open Lock(1), Spellcraft(4), Tumble(2), Save(4), <br/>\n02: Concentration(1), Spellcraft(1), Save(7), <br/>\n03: Concentration(1), Spellcraft(1), Tumble(1), Save(8), <br/>\n04: Concentration(1), Spellcraft(1), Save(11), <br/>\n05: Concentration(1), Spellcraft(1), Tumble(1), Save(12), <br/>\n06: Concentration(1), Spellcraft(1), Save(15), <br/>\n07: Concentration(1), Spellcraft(1), Tumble(1), Save(16), <br/>\n08: Concentration(1), Spellcraft(1), Save(19), <br/>\n09: Concentration(1), Spellcraft(1), Tumble(1), Save(20), <br/>\n10: Concentration(1), Spellcraft(1), Save(23), <br/>\n11: Concentration(1), Spellcraft(1), Tumble(1), Save(24), <br/>\n12: Concentration(1), Spellcraft(1), Save(27), <br/>\n13: Concentration(1), Spellcraft(1), Tumble(1), Save(28), <br/>\n14: Concentration(1), Spellcraft(1), Save(31), <br/>\n15: Concentration(1), Spellcraft(1), Tumble(1), Save(32), <br/>\n16: Concentration(1), Spellcraft(1), Save(35), <br/>\n17: Concentration(1), Spellcraft(1), Tumble(1), Save(36), <br/>\n18: Concentration(1), Taunt(21), Save(19), <br/>\n19: Spot(22), Tumble(1), <br/>\n20: Heal(4), Spot(1), <br/>\n21: Heal(1), Spot(1), Tumble(1), Save(1), <br/>\n22: Spot(1), Save(5), <br/>\n23: Spot(1), Tumble(1), Save(7), <br/>\n24: Spot(1), Save(11), <br/>\n25: Spot(1), Tumble(1), Save(13), <br/>\n26: Spot(1), Save(17), <br/>\n27: Spot(1), Tumble(1), Save(19), <br/>\n28: Spot(1), Save(23), <br/>\n29: Concentration(11), Spellcraft(12), Tumble(1), Save(3), <br/>\n30: Spot(2), Save(6), <br/>\n31: Spot(1), Tumble(1), Save(8), <br/>\n32: Concentration(3), Spellcraft(3), Save(7), <br/>\n33: Spot(2), Tumble(1), Save(8), <br/>\n34: Spot(1), Save(12), <br/>\n35: Spot(1), Tumble(1), Save(14), <br/>\n36: Spot(1), Save(18), <br/>\n37: Spot(1), Tumble(1), Save(20), <br/>\n38: Concentration(6), Spellcraft(3), Save(16), <br/>\n39: Spot(2), Save(19), <br/>\n40: Concentration(2), Taunt(22), <br/>\n<br/>\nSo, what do you guys think?<br/>\n<br/>\nEDIT: After Valerfor's contribution, I thought it'd be nice to mention a few viable tweaks to the build that would maintain the original concept, but depend on personal preference and environment.<br/>\n<br/>\n1- This build was made with WoG in mind, where there is a Cleric-only item called Benevolent Sandals, which grants KD immunity, and some other really nice things to a Cleric. That's why I chose not to include Discipline in this build. But, if you're playing in a server or module where KD immunity isn't available, you can drop Spellcraft and Heal (you'll have 2 leftover points) and take Discipline instead. In this case, you should probably take Cleric 19, and 20 right after Cleric 18 to maximize your caster levels ASAP. The irony here is that I didn't include Discipline because I was thinking of that specific WoG item, but I chose domains that won't work there LOL. On WoG I'd recommend you to go with St. Cuthbert to retain the Strength domain.<br/>\n<br/>\n2- There is an alternative class split for those of you who aren't as comfortable playing highly dispellable characters. You could go with Cleric 23 / Paladin 2 / CoT 15. You lose 2 to all saves, but gain 3 Caster Levels, which reduce your chances of being dispelled by 15%. The lost feat from CoT 18 is recovered with the Bonus Feat from Cleric 23, so it's really a matter of personal preference. You will still have a 5% (10% in EE) chance to be dispellable by Greater Dispelling, compared to a 20% (25% in EE) chance as is now. <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:37 PM - Dec 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">a)  Make him a Cleric 23/ Paladin 2/ Champion of Torm 15, don't argue, just do it. <br/>\n<br/>\nb)  You should take \"Knockdown\" before the Divine Feats.<br/>\n<br/>\nc)  Also, why you do not have Discipline in your skillset? <br/>\nRelaying into the Clerical boots much? Other PWs might not have that &amp; you don't have umd to find cheap solutions (like Rogue's Hood) either. <br/>\n<br/>\nd)  You should also take your Cleric levels a lot sooner to maximize the CL effect before it fades away.<br/>\nYou do not need late Spellcraft skill-dumps late in this build, you're already almost immune to most spells that require a save.<br/>\n<br/>\ne) I would change \"Expertise\" to \"Empower Spell\" &amp; WF: Light Flail to WF: Longsword, but that's just me.<br/>\n<br/>\nOtherwise, a nice, thematic build for Anomen.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "10:30 PM - Dec 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote: <a data-post-id=\"23175\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=23175&amp;sid=9e609f30170cc361ca2f0ded15d4f377#p23175\">↑</a><div class=\"responsive-hide\">Dec 18, 2020</div></cite>a)  Make him a Cleric 23/ Paladin 2/ Champion of Torm 15, don't argue, just do it. <br/>\n<br/>\nb)  You should take \"Knockdown\" before the Divine Feats.<br/>\n<br/>\nc)  Also, why you do not have Discipline in your skillset? <br/>\nRelaying into the Clerical boots much? Other PWs might not have that &amp; you don't have umd to find cheap solutions (like Rogue's Hood) either. <br/>\n<br/>\nd)  You should also take your Cleric levels a lot sooner to maximize the CL effect before it fades away.<br/>\nYou do not need late Spellcraft skill-dumps late in this build, you're already almost immune to most spells that require a save.<br/>\n<br/>\ne) I would change \"Expertise\" to \"Empower Spell\" &amp; WF: Light Flail to WF: Longsword, but that's just me.<br/>\n<br/>\nOtherwise, a nice, thematic build for Anomen.</div></blockquote>\nHey Val!<br/>\n<br/>\nNo surprise, we disagree again, but at least only in one item and half of another, which has to be good news considering our history, right? LOL<br/>\n<br/>\nA) Certainly a viable tweak. It's +2 to all saves vs +3 Caster levels. I figured he was dispellable either way, so I went with the saves. But I have no objections to this tweak at all. <br/>\n<br/>\nB) This one I disagree with, and I'll explain my reasons below:<br/>\n<br/>\n1- If you've read my Cleric guide, you'll notice that up until level 12, you're in Embryo Stage / Hatching stage. This means that at these levels I really don't buff and fight much. I just summon a Skeleton Warrior with Animate Dead, buff it up and watch it tear through enemies, while I fire my Heavy Crossbow from afar. Very seldom do I engage in combat myself.<br/>\n2- Because of the above, the divine feats work better and give more flexibility, as they can be used with ranged attacks as well.<br/>\n3- It's very little use to KD your opponent if you don't have a 2nd attack per round to attack the prone opponent with. That only happens at level 8, although you could technically get it temporarily at level 7 with Divine Power (which can be extended because of the Strength domain). I just find it more efficient to summon and snipe.<br/>\n<br/>\nC) You are 100% right about that and it should be mentioned in the OP. There is definitely room for Discipline to be tweaked into the build. All you need to do is drop Spellcraft and get the rest of the points from Heal. I'll include this in the OP as an edit.<br/>\n<br/>\nD) Again, I kind of agree, kind of don't. If I went for discipline, then yes, I'd do that after I had attained enough Wisdom via CoT bonus feats to cast 9th level spells. Certainly a viable alternative that will be mentioned in the edit.<br/>\n<br/>\nE) I would NEVER advise anyone to drop Expertise in a build that has Taunt. <br/>\n<br/>\nThe Light Flail was a little bit of a self-indulgent choice. I played him with the Flail of the Ages 100% of the time, but any weapon could work, since you could customize him to taste in the game.<br/>\n<br/>\nThanks for the input!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:40 AM - Jan 14, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am impressed by the way this build manages to raise strength by 10 points, wisdom by 6 points and charisma by 4 points - and still get the essential epic combat feats. Taking a lot of CoT in epic lavels makes it possible. Valerfor's suggestion of taking cleric to 23 levels removes an epic CoT feat, but gives an epic cleric feat, so you still can take that final Great wisdom feat.<br/>\nThe build is a fine portray of Anomen successfully becoming a paladin.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}