{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "192",
  "name": "PvM and PvP builds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pvm-and-pvp-builds-t2354868.html",
  "author": "jedimstrmeow",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "447",
  "posts": [
    {
      "author": "jedimstrmeow",
      "avatar": "no_avatar.png",
      "timestamp": "12:56 AM - Apr 29, 2018",
      "content": "<div>So I'm going to apologize right off the bat for what some may consider a very baseline concept... But I'm not sure what differentiates a PvM build and a PvP build. Looking on these forums, there are a few I would like try out on a low magic PvP server that caps at level 20. And honestly this is the only place that I have found that provides level 20 cap builds. <br/>\n<br/>\nIn particular there is a Spell-bow build (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/savage-spell-bow-barbarian-3-wizard-8-aa-9-t2350964.html\" rel=\"noreferrer\" target=\"_blank\">savage-spell-bow-barbarian-3-wizard-8-a ... 50964.html</a>) and an assassin/ranger build that I want to try but I don't understand why they are playable PvM and nothing about PvP. And most importantly... What is the difference?!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:56 AM - Apr 29, 2018",
      "content": "<div>Mick is the creator of the build and the best to answer questions about it, but as for your other question, I will try to explain briefly what is the main difference (without being the only) of a PvP server Vs a PvM one.<br/>\n<br/>\nIn PvP servers you do not have the middle ground, there are no builds that are geared towards making your levelling process easier or builds that are flavourful. You always build with the exact environment in mind (items, rules changes, etc) and most importantly you build based on what you are going to face from the rest of the players. You will see many small changes &amp; details that in PvM we ignore or we leave up to the player to decide, like being an Elf because they are spotting better than anyone else. You won't see an average (or simply good) weapon master, you will see a Half-Orc maxed-out strength with a scythe or the opposite, a Dwarven Defender! Clerics are everywhere of course, at level 20 and because these servers usually nerf to the ground Isaacs Missiles, you will probably encounter Ice Storm spammers and so on...</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:07 PM - Apr 29, 2018",
      "content": "<div><blockquote><div><cite>jedimstrmeow wrote:</cite>\nSo I'm going to apologize right off the bat for what some may consider a very baseline concept... But I'm not sure what differentiates a PvM build and a PvP build. Looking on these forums, there are a few I would like try out on a low magic PvP server that caps at level 20. And honestly this is the only place that I have found that provides level 20 cap builds. <br/>\n<br/>\nIn particular there is a Spell-bow build (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/savage-spell-bow-barbarian-3-wizard-8-aa-9-t2350964.html\" rel=\"noreferrer\" target=\"_blank\">savage-spell-bow-barbarian-3-wizard-8-a ... 50964.html</a>) and an assassin/ranger build that I want to try but I don't understand why they are playable PvM and nothing about PvP. And most importantly... What is the difference?!\n</div></blockquote>\n\nI must admit that i never had PvP in mind when I made the Savage spell-bow. It is based on a half elf character I played many years ago on a level 20 PW.  I enjoyed playing that character and I was satisfied with how it performed in PvM. I improved the build further before posting it here. So that's the story behind why it is flagged as PvM.<br/>\nWhen you build for PvP, you build to beat specific opponents in a given environment. That is not the story behind this build.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "jedimstrmeow",
      "avatar": "no_avatar.png",
      "timestamp": "10:07 PM - Apr 29, 2018",
      "content": "<div>Well I may just try the build for the heck of it then. I am not entirely sure how to build to beat any of these guys anyways so - there is plenty of environment to verse against </div>"
    }
  ]
}