{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "856",
  "name": "NWN Character Build Search",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/nwn-character-build-search-t2355078.html",
  "author": "KidMiracleman",
  "avatar": "no_avatar.png",
  "replies": "17",
  "views": "376",
  "posts": [
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "8:18 PM - Jun 16, 2019",
      "content": "<div>It does not seem to work anymore.  Wanted to find a Ranger WM DD.  Is there such an animal??<br/>\n<br/>\nDavid</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:02 PM - Jun 16, 2019",
      "content": "<div>Hi David. I've had a quick check, and both Hip's ECB Guild Filter thread and the link Mick provides in the last post of How and Where to Access Legacy ECB Archives thread both seem to be working fine (both in the Rules and Tools forum). Hope you can get that sorted soon. If not, please let us know what seems to be happening.<br/>\n<br/>\nIn any case, there are no Ranger/ WM/ DwD builds in either. My guess would be because of the feat starvation. A Dwarf Ranger will only get 7 pre-epic feats, and you need Dodge/ Mobility/ Expertise/ Spring Attack/ Whirlwind Attack and Weapon Focus for WM, as well as Toughness for DwD (with Dodge already included in WM pre-requirements). So that's all 7. No Knockdown, no Blind Fight, no Imp Crit, let alone anything else<br/>\n<br/>\nNow, I appreciate you might be able to cope with that with some of your Nordock sub-races (like Smith), but I don't think anyone has built anything specifically for that.<br/>\n<br/>\nSorry</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "4:12 AM - Jun 17, 2019",
      "content": "<div>That is ok.  What else would go well with Ranger and DwD?</div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "4:21 AM - Jun 17, 2019",
      "content": "<div>This is the screen I am getting.  I must be doing something wrong</div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "4:22 AM - Jun 17, 2019",
      "content": "<div>Here it is</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:51 AM - Jun 17, 2019",
      "content": "<div>See if this works for you, David. Just click on the word \"Greyhawk\" in Mick's final post on the following thread. I've just tried it and it's working for me. Good luck!<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/how-and-where-to-access-legacy-ecb-archives-t2354480.html\" rel=\"noreferrer\" target=\"_blank\">ECB Archives</a></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:16 AM - Jun 17, 2019",
      "content": "<div>As far as what would work with Ranger and Dwarven Defender goes, it all really depends upon what sort of build you're looking for. I'm going to hazard that you're looking at Ranger for dual-wielding purposes, so probably not a fully defensive build, which means you're likely to want a Dex build to give you decent AC for tanking purposes (and you wouldn't necessarily need Rogue for Uncanny Dodge, as DwD's Defensive Awareness II, at level 5, pretty much makes you immune to sneaks by making you impossible to flank when in combat). I know you aren't particularly concerned about xp penalties, so Monk might be good (free feats, Wisdom synergy with Ranger for more AC, etc). Shadowdancer might be nice if you want to be sneaky. Or good old Fighter (or CoT). Lots of potential!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "10:13 PM - Jun 17, 2019",
      "content": "<div>You remembered.  :)  Well, the reason I wanted Ranger DD is because the subrace I want to use is arctic Dwarf and their favored class is Ranger.  DwD because I like that class and why not since he will be a Dwarf.  Monk sounds good as the third class.<br/>\nAlso, the link worked for me.  I like the Defender of the Forest ranger 23 / monk 12 / dwarven defender 5 (dwarf) especially since it was submitted by ArcticDwarf900 and I will be using an Arctic Dwarf subrace.  I just don't want to use the bow as a weapon.  I would prefer kamas or maybe even Dwarven Waraxe  :)</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:04 AM - Jun 18, 2019",
      "content": "<div><blockquote><div><cite>KidMiracleman wrote:</cite>\nYou remembered.  :)  Well, the reason I wanted Ranger DD is because the subrace I want to use is arctic Dwarf and their favored class is Ranger.  DwD because I like that class and why not since he will be a Dwarf.  Monk sounds good as the third class.<br/>\nAlso, the link worked for me.  I like the Defender of the Forest ranger 23 / monk 12 / dwarven defender 5 (dwarf) especially since it was submitted by ArcticDwarf900 and I will be using an Arctic Dwarf subrace.  I just don't want to use the bow as a weapon.  I would prefer kamas or maybe even Dwarven Waraxe  :)\n</div></blockquote>\nThanks for your questions. It looks like you have found fertile ground to create your own build!<br/>\n<br/>\nNot only that but it sounds like you want to dual kama as a ranger, and right now I have somewhat of an interest and weakness for dual kama max attack per round builds!<br/>\n<br/>\nThere are obvious things I can see you might want to improve on with ArcticDwarf900's build. Feel free to look at the nwn wiki regarding how many class levels you will want to have in each class. Generally if you want to go ranger you will want quite a few levels in it to make sure your animal companion is strong enough, to increase the number of favored enemies, and the favoured enemy buff. You get bonus feats at certain levels, and 23 is not really a great level to stop leveling ranger.<br/>\n<br/>\nBane of enemies feat sounds very strong (+2d6 against favoured enemies thats like a greatsword) and taking it at level 36 means you will play most of the game without it. If you dual Kama with ITWF from your ranger levels, haste and flurry you do 10 attacks per round. Therefore that single feat alone, which you could get at level 21, could give 20d6 damage per round against favoured enemies once you start to get monk levels.<br/>\n<br/>\nI agree with his choice to stop leveling DD at 5 for defensive awareness II. but its just whether DD gives you what you want. I just honestly wonder if a class such as assassin or rogue might be better.<br/>\n<br/>\nFor example you could get Assassin 3 instead of DD 5 and Monk 2 instead 3 for uncanny dodge and a 2d6 death attack which will be very strong if you do 8-10 attacks per round. Uncanny dodge allows you to retain your dexterity bonus if you are flat footed (ie knocked down), and I think has to be strongly considered in any dexterity build.<br/>\n<br/>\nAlso I would point out there are no ranger / monk / assassin builds I could find on the greyhawk database or on google, and this could be fertile ground to create your own unique build as well!<br/>\n<br/>\nMy suggestions would be to go Ranger 32 / Monk 3 / Dwarven Defender 5 with a strength build. If you want to go dexterity you could go Ranger 35 / Monk 2 / Assassin 3 if you go Dex (it will work with strength too). Try to get bane of enemies feat at level 21. Try to get uncanny dodge if you go dexterity build.<br/>\n<br/>\nwith the proviso I am not an expert ranger player by any means. there are others out there, and there are others who have invested far more into the ranger class than I have. I would suggest reading Darthmuffin's guide (<a class=\"postlink\" href=\"https://gamefaqs.gamespot.com/pc/930137-neverwinter-nights-diamond/faqs/30128\" rel=\"noreferrer\" target=\"_blank\">https://gamefaqs.gamespot.com/pc/930137 ... faqs/30128</a>). Mick Dagger's also wrote a post 'Bane of all' (Ranger 40) which may be worth reading too. <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build229136.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 29136.html</a><br/>\n<br/>\n<br/>\nHappy building!</div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "12:08 PM - Jun 18, 2019",
      "content": "<div>Thank you for your suggestions.  I like the Dwarven Defender prestige class because it seems off to play a dwarf and not have a few DD levels.  I know it sounds odd but that is how I role  :)  I like this build.  I would prefer Dwarven Waraxe though.  <br/>\nBattle Ranger of the North ranger 21 / dwarven defender 14 / rogue 5 (dwarf) by Christian.schnabel<br/>\n Thoughts?? </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:30 PM - Jun 18, 2019",
      "content": "<div>I've just had a look at the Battle Ranger of the North, and I think there's lots of potential there. Myself, I'd make a few tweaks...See what you think.<br/>\n<br/>\nFirst, the stats - and these come from the changes involved in taking Arctic Dwarf (<em>for those unaware, David plays on Nordock, with various sub-races and a level cap of 120</em>). If I've got this right, Arctic Dwarf gets +6 STR, +2 DEX, -2 CON, and -4 WIS (as well as 50% cold immunity, +10 Hide and +8 Move Silently). With the changes to DD, you'll also get +2 CON when you reach DD10. So, your WIS is going to be screwed regardless, therefore I'd consider trashing it completely - which you can do when taking Rogue rather than Ranger as your first level. It won't help your will save any, but it will give you more points to play with at creation. Equally, you'll only need to start with DEX 11, because the Arctic Dwarf will bump it to 13 anyway. So you can bump your starting stats in STR and/or CON, which will be your two primary stats. Afraid I haven't worked it out fully, but you get the principle. (And, of course, should you get to a CON of 21, EDR III opens up for you.)<br/>\n<br/>\nSecond, levelling and class splits. My temptation would be to go for Ranger 22/ DD 14/ Rogue 4. It means you will lose 1d6 sneak attack, but means you'll be able to take Bane of Enemies much earlier - particularly if your pre-epic split becomes Rogue 2/ DD 5 (or 6)/ Ranger 13 (or 12). Your final BAB would remain as 29, so nothing lost there. It's more a question of which you'd prefer first - earlier access to Bane or more DD.<br/>\n<br/>\nThird, feats and skills. If you lost Luck of Heroes at level 1 and took Exotic Weapon Proficiency, then Dwarven Battleaxe becomes available, should you wish. And I'm not sure about taking Set Trap - Disable might be a better bet. That said, I can't remember if Christian takes Spellcraft, but if he doesn't, maybe he should.<br/>\n<br/>\nAnyway, these are just a few thoughts for you to mull over. Let us know how it goes!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "6:12 PM - Jun 18, 2019",
      "content": "<div>It is Nordock but another Nordock.  It is Nordock age of Heroes.  I just started playing on this one because Nordock Martial Age is Italian.  I don't read Italian so good  :)  Anyways here is the stats for the Arctic Dwarf on Age of Heroes<br/>\n<br/>\n    Ability Bonus: Strength +4<br/>\n    AC Bonus +1 (Deflection)<br/>\n    Decreased Ability Score: Dexterity -2<br/>\n    Immunity: Damage Type: Cold 100% Immunity Bonus<br/>\n    Damage Vulnerability: Fire 50% <br/>\n    Skill Bonus: Hide +4<br/>\nMust be: Dwarf.<br/>\nECL: + 1<br/>\n<br/>\nFavored class: Ranger<br/>\n<br/>\nAs you can see favored class is Ranger but I guess she does not have to be ranger.  Though I was wondering if a Ranger Bard RDD would not be a bad combo to solve the fire Vulnerability.  Thoughts??  Have never played on this one so I have no idea what monsters are the most prevalent.  <br/>\n<br/>\nDavid</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:12 PM - Jun 18, 2019",
      "content": "<div>Defensive Awareness also protects your DEX AC when you're flat footed or attacked by unseen enemies.<br/>\n<br/>\nI wonder if the 50% fire vulnerability from Arctic Dwarf plus the 100% fire immunity from RDD would add up to a 50% fire immunity.<br/>\n<br/>\nHow about Fighter 14 / Bard 16 / RDD 10?  As long as you keep Fighter and Bard even until level 40, you will have no experience penalty until level 40.  You can take WS/EWS for +6 damage against all enemies, not just a select few.<br/>\n<br/>\nBard / RDD / DD would be another option.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:48 PM - Jun 18, 2019",
      "content": "<div>You couldn't give us a link to Age of Heroes could you, David? It might be helpful.<br/>\n<br/>\nThanks</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:29 AM - Jun 19, 2019",
      "content": "<div>If it helps, here is Nordock Martial Age:<br/>\n<a class=\"postlink\" href=\"http://nordockmartialage.altervista.org/?doing_wp_cron=1560904108.9016129970550537109375\" rel=\"noreferrer\" target=\"_blank\">http://nordockmartialage.altervista.org ... 0537109375</a></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:01 AM - Jun 19, 2019",
      "content": "<div>Already got that one thanks, Valerfor (hence my thoughts about Arctic Dwarf - just the wrong Arctic Dwarf), it's Age of Heroes we ain't got (<em>bloody sub-races, grumble, chunter, moan, complain</em>).<br/>\n<br/>\nThanks, though!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "11:14 AM - Jun 19, 2019",
      "content": "<div>Sorry.  I do not know where the link to Age of Heroes is at.  There not be one.  I got the info from Discord.  <br/>\nHere is the link that I have <a class=\"postlink\" href=\"https://discord.gg.UQzr8nr\" rel=\"noreferrer\" target=\"_blank\">https://discord.gg.UQzr8nr</a>  Hope it helps</div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "7:37 PM - Jun 19, 2019",
      "content": "<div>I did build an Arctic Dwarf Bard RDD DD once before and she got 100% fire immunity and 100% Fire Immunity<br/>\nThere is a dwarf subrace on Nordock Martial Age with lore 8.  <br/>\nrace: dwarf<br/>\n subarace: antico-saggio<br/>\nDex -5, Con +1, Wis +8<br/>\nbenefits: lore 8<br/>\n<br/>\nCould make a Nice Bard RDD DD tank I would imagine.<br/>\n<br/>\nDavid.  </div>"
    }
  ]
}