{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "594",
  "name": "The SoU Combat Cleric (18 Cleric/2 Fighter)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-sou-combat-cleric-18-cleric-2-fighter-t2355492.html",
  "author": "yamuchaop",
  "avatar": "no_avatar.png",
  "replies": 0,
  "posts": [
    {
      "author": "yamuchaop",
      "avatar": "no_avatar.png",
      "timestamp": "2:22 PM - Jun 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">This build was all over the place on the server i used to play on back in the day, i remember it quite fondly. The server was Realm of Krynn, a dragonlance server where i played my dwarf fighter/rogue, human barbarian/fighter, human cleric/fighter and human Illusionist. I spent a lot of time hacking away at monsters, chatting, dueling etc. Good memories :)<br/>\n<br/>\nHuman<br/>\n<br/>\n<strong>Attributes</strong>, I do not recall them exactly, but it was something like this:<br/>\nStrength - 15(18)<br/>\nDexterity - 8<br/>\nConstitution - 12, i do seem to recall having a higher constitution.<br/>\nWisdom - 17(19)<br/>\nIntelligence - 13<br/>\nCharisma - 8<br/>\n<br/>\nFighter 1<br/>\nCleric 1-18<br/>\nFighter 2 - Get that discipline maxed! :)<br/>\n<br/>\n<strong>Domains: Underscored my preference, but there where many variations.</strong><br/>\n<span style=\"text-decoration:underline\">Trickery</span><br/>\n<span style=\"text-decoration:underline\">Strength</span><br/>\nWar<br/>\nTravel - This was specifically for another server that had no haste granting items.<br/>\n<br/>\n<strong>Skills:</strong><br/>\nConcentration: Max<br/>\nDiscipline: Max - Could be skipped if you where rich enough to have both a Ring of quickness (Haste) and Dragon slippers (Immune KD and fear), which i eventually was.<br/>\nSpellcraft: Max<br/>\nTumble: 10<br/>\n<br/>\n<strong>Feats</strong> - 10 picks!<br/>\n<strong>Core: (7)</strong><br/>\nWeapon focus: Rapier (The best weapon on the server was a +5, keen, 1d6 acid damage, 2d8 massive critical rapier)<br/>\nImproved critical: Rapier<br/>\nSpell penetration<br/>\nGreater spell penetration<br/>\nKnockdown<br/>\nImproved knockdown<br/>\nToughness<br/>\n<strong>Optional: I had many variants of this character, but i have underscored my favored picks.</strong><br/>\nExtend spell<br/>\nCombat casting<br/>\nBlind fight (Darkness and invisibility was very common)<br/>\nLuck of heroes<br/>\n<span style=\"text-decoration:underline\">Empower spell</span><br/>\n<span style=\"text-decoration:underline\">Spell focus:</span> Conjuration (Storm of vengeance) or <span style=\"text-decoration:underline\">Evocation</span> (Implosion, Firestorm)<br/>\n<span style=\"text-decoration:underline\">Greater spell focus:</span> Conjuration or <span style=\"text-decoration:underline\">Evocation</span><br/>\n<br/>\nSo how did it play? Well each player sort-of adopted their own strategies but the most common was just buffing with favour and power. I used quite a variety of tactics: harm, storm of vengeance in duels to stun-lock opponents, hammer of the gods, blade barrier, fire storm the invisible people, knockdown and of course stick 'em with the pointy end. Some players went a step further and took 16 cleric/4 fighter for weapon specialization, but i preferred the versatility of having 9th level spells. In hindsight it could probably be improved upon, but leave me my memories ;)<br/>\n<br/>\nThe most fun memory i have of this character was dueling a new comer to the server. He would show up once a day with some fancy new gear that countered my previous strategy, and i'd beat him in a new way. This continued for a month or so, until he eventually declined duels with me :)<br/>\n<br/>\nHoU completely killed this build, i tried updating it but it was never the same again. The updated version was a cleric/fighter/rogue which was alright and also fun to play.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}