{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "192",
  "name": "Building Style x In-game Decisions",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/building-style-x-in-game-decisions-t2354679.html",
  "author": "Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:07 PM - Mar 12, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hail, guys!<br/>\n<br/>\n In another topic, Hip and I were discussing building philosophy, and instead of continuing to hijack said topic with something that's completely unrelated (it was a build request after all), I decided to go ahead and start a discussion about this in its own topic, since it seems to have a lot of potential in terms of ideas for newer builders, and also for us to learn more about how each one of us builds their toons.<br/>\n<br/>\n So, I'll start by telling you guys how I build, what I take into consideration and just how my mind goes around building a toon.<br/>\n<br/>\n - Melee toons:<br/>\n<br/>\n With all my melee toons, regardless of whether they're DEX-oriented, STR-oriented, CON-heavy Tanks or even CHA-based smiters, the first thing I focus on is building up pre-epic BAB, getting max number of APR (BAB 16+ or 18+ if utilizing Monk attack progression), except with Clerics, who NEED to have BAB 15 or less to make the most out of Divine Power. But I do so without breaking the concept of the build. So, if I'm building something with 19 Rogue levels, I will most likely take 4 pre-epic, like in my <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2329192/#.WMU6F4WcHIU\" rel=\"noreferrer\" target=\"_blank\">Drow Fencer</a> build.<br/>\n<br/>\n After that, I look at combat resourcefulness and the feats that I want to be the most important ones for that toon, so IKD for pretty much all of them if I can afford it, Expertise is one that I almost always take as well, then DevCrit for STR-based ones, EDR for CON-artists (pun intended), Epic Dodge for DEXers, Great Smiting for CHA-based pallies, or whatever else I may have forgotten about at the moment. I not only try to take those feats, but also try to take them ASAP, as long as that doesn't jeopardize the level 40 power of the build. So, for example, if a certain build has Epic Dodge, and anticipating it would require me to drop a BAB point by taking more Rogue pre-epic, then I'll just have to do without it for a few more levels. You may be asking yourselves why. Well, each player is different. Some players like to immerse themselves in RP and pretend they're actually their characters. I myself have a hard time RPing with pre-determined dialogue options, so what I do is I write a little background story for EVERY new character I create, and it's become such an OCD that I don't create a character until I've come up with a background. Then I just play the game as a powergamer, but that little background I wrote makes me actually \"love\" my character and want to play him / her and realize their full potential. So, basically, this mindset makes me look forward to taking the next feat that'll make this toon that much stronger, and if I have to be honest, my toons are the reason I still play the game. No doubt the game is fun and has many other features, but my toons and builds to me are what keeps me interested. I like new stories, but not as much as I like new characters.<br/>\n<br/>\n In his reply, Hip said that I have an obsession with the level 40 \"paper\" calculations of my builds. Not quite, but not totally off either. I know many players who play their toons all the way to 33rd or 34th level, and then they have nothing to look forward to in those last six levels, so they just abandon their toons in limbo. Me, I normally have a lot to look forward to all the way to level 37 or even 39 in some builds. And the way they start out weak and sort of \"blossom\" all the way through to level 40 is just beautiful. Another thing Hip said was about perma-death. It may seem so that I only build the way I do because I can die without much consequence where I play. Perhaps it is, but I think I'd still build the same way for perma-death servers. The only thing I'd change would be the way I played my builds. I'd most likely need to level them up against weaker opposition longer than most, then after they hit a certain point, I'd be all set and continue to level them normally. One important thing, though. Not all my builds lack playability. The build I linked above is a good example of a toon that's very playable all the way through. But MORE OFTEN THAN NOT, my melee builds will struggle in pre-epic.<br/>\n<br/>\n - Caster toons:<br/>\n<br/>\n As for casters, I would divide these into two different groups: Dedicated casters and Spellswords (or self-buffers with some casting prowess). Spellswords are my favorite toon type, but I have built dedicated casters, or at least casters who are just as proficient as a dedicated caster while doing something else. Most remarkably, my <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515398/\" rel=\"noreferrer\" target=\"_blank\">Champion of the Wilderness</a> and my <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515420/#.WMU_bYWcHIU\" rel=\"noreferrer\" target=\"_blank\">Demolition Man</a>. The first is a Dragon Shaper who has great casting capabilities and good melee prowess with huge saves, and the second is a Zen Archer Cleric with focus on Evocation.<br/>\n<br/>\n Normally, for dedicated casters, I try to focus on spell DCs (casting stats and spell focus feats) and the metamagic feats that'll make them more proficient in casting. I know my bread and butter, so I don't take Maximize Spell for Wizards, just because there's nothing to Maximize (Max IGMS would cost you a Time Stop, which is IMO a bad tradeoff). I normally take Empower, Still or Silent and Extend for most of my casters.<br/>\n<br/>\n For spellswords, I focus on building BAB, just as I would with a Melee toon, but the difference is that I use Extend Spell (a lot) and sometimes Empower Spell for stat buffs if I can afford it, to compensate for the BAB I lose due to taking a Caster class instead of a full BAB class pre-epic. My <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2344104/#.WMVBH4WcHIU\" rel=\"noreferrer\" target=\"_blank\">Draconic Arcanist</a> is a good example. As Mick stated himself in the thread, it looks very hard to level up, but I have a few tricks up my sleeve that allow me to level it up without too much trouble. The first thing is scrolls. You can scribe scrolls of summon creature, which you then cast without removing armor. Turn on expertise and tank for your summons in Full Plate, while they come from behind and attack the enemies. I use a Panther familiar for the first 5 levels, which does sick damage, then I also buy (if possible) higher level Summon Creature scrolls, which I use if I'm in trouble. Invisibility scrolls are also very important. So, as you can see, it's not cheap, but it's doable! Then the RDD bonus kicks in, as well as the Wizard spells, which allows you to switch strategy, still using scrolls, but less so than before. Potions of Barkskin, Bless and Aid are also very important. Stat buffs, normally I have them on Wands or scrolls I craft myself as a backup plan, but I'll buff myself up with extended versions of these once a day. They'll last until I get dispelled or until I rest again. whichever comes first. Then I rebuff via scrolls as needed.<br/>\n<br/>\n I avoid casting spells that require a save, because my casting stat will be the minimum allowed to cast all my spells, so I focus on no-save spells and buffs. On Arcane spellswords, this means IGMS, Mord's, Time Stop, Premonition, Damage shields, etc... On Divine, this means Divine Power, Divine Favor, Word of Faith, Magic Vestment, etc.. I occasionally memorize a Storm of Vengeance or Destruction spell or two just because they do damage if you fail the save and there's just nothing better to put there anyway.<br/>\n<br/>\n - Roguish toons / skillful sneakers.<br/>\n<br/>\n These toon types are not my bread and butter. I have built and played a few, but I have too much of a head-on approach to play one of these guys properly. They don't rely on fighting much to overcome obstacles, so you need a more patient approach to succeed with these. I don't think I've ever built a sneaker that doesn't at least do something else. And I generally focus on that something else to make the build playable for my style. Basically, I utilize stealth as a secondary part of my arsenal, not as the main. I presume that playing one of these guys whose main focus is sneaky stuff, you'd need to play the game the way Hip described, using Recon tactics, traps, consumables etc... The problem with this is that I'm used to self-buffers, so each second I waste is one more second that my buffs are counting towards expiring. My <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2268950/\" rel=\"noreferrer\" target=\"_blank\">Nathyrra</a> build is a good example. She utilizes stealth, but through Darkness and Invisibility most of the time, as she doesn't have HiPS. Still, she buffs up and her buffs last only 10 or 20 hours / rounds or turns (depending on the buff), so I always feel that the clock is ticking with her. Still, I have leveled her to 40 on WoG, and she did surprisingly well, better than I was expecting.<br/>\n<br/>\n If you're playing one of these, you're going to do a lot of things in non-combat scenarios, and you're going to have to get creative in combat, or team up with someone. Since I like to be good in combat, or at least have different alternatives, I struggle with these, because traps just take up so much space in your inventory and they're not good against every enemy. I know how to set \"the green carpet of death\", just like any good Rogue player does, but I don't know how to kill tough bosses solo any other way. And if those tactis don't work, what do you do? Most of my spellswords can solo most of the high level bosses on WoG. Nathyrra can't, and I don't know if she'll evel be able to do it. Some have 25/- elemental resistance and DR, so trap damage is significantly reduced against them. If I have someone to tank for me, it works out just fine.<br/>\n<br/>\n But, as for skills, I focus on Disable Traps, Set Traps, Hide, Move Silently, and I put 1-25 points on Search (then buy a Watchman's Helm, get a Robe of Eyes, etc...) to be able to find just about everything on the server. I also take Tumble and UMD, of course. And since you're going to be the skillful type, Open Locks seems like the next best alternative. You should put at least 1 point in OL. If you're a DEXer and have access to +10 Thieves Tools and skill-enhancing items (Ring of Burglary), etc.., then that 1 point will most likely help out a lot.<br/>\n<br/>\n And, finally, I'd like to wrap it up by discussing playability:<br/>\n<br/>\n Well, what is playability? I would say that playability is the answer to the question \"how easy is it to gain levels and progress in a module, campaign, or PW using this build?\" But it's actually more than that. Each server (or module), has custom modifications and settings that favor certain build types. So, for example, Sands of Fate is extremely high-magic, which favors STR-based Melee types and sort of hinders the usefulness of Spellswords. A low-magic server is the opposite. In places with lots of traps and unbashable locks and containers, Rogue skills become almost mandatory. Places with monsters with low AC and high AB will favor DEX-based melee toons, etc.. So, just by knowing the specifics of the server you play on, you should have a good idea of what kinds of builds would be strong there and also the builds that would struggle. My Champion of the Wilderness is very self-sufficient (meaning he can do really well even without gear), as he relies on spells and Polimorphs to kill things, so whenever I start playing on a new environment, I make him first. It's kind of my recon toon. After I figure out the items, encounters, quests, etc, I will have a good idea of which builds will have an easier time and which builds will have a harder time on that environment. Then I decide which toons I want to make next. But even that toon will get destroyed in high magic. How can you compete with a +12 Keen Bastard Sword, a +12 armor and a +12 Tower Shield with Dragon Shape? You can't!<br/>\n<br/>\n In a nutshell, playability is server-oriented in all aspects. Custom modifications can make a build unusable, stronger or weaker, and magic level also impacts which builds will be playable, and which ones won't. In that sense, Hip was right when he said that we all build with a bias towards where we play. For that same reason, Stag (LOL), I always bashed the OC every time you talked about it. Your experience there (bias) will lead you to believe that a deeply flawed build is good. As an example, I finished the OCs with a Ranger who dual-wielded Rapiers (I didn't know about the offhand small weapon thing back then). Furthermore, it'll also impact your playstyle. I only started USING combat feats when I began to play Aielund, and even then I used to do so while surrounded by weak things trying to hit me to no avail. So playability is impacted by how many tricks you have up your sleeve and how much you know about the server. It pains me to remember that I once thought a 65-AC Wizard 20 / Cleric 20 (going Wizard 20 pre-epic LOL) was good because he destroyed Mephistopheles! Just as a comparison, Mephistopheles was a level 27 boss with 35 AB. On WoG, there's a boss called Lord Arbas, who you face around level 20-22, who has 45 AB IIRC. And he's not one of the hardest ones either, although if you have low AC, he'll slice you up like a pizza. As a rule of thumb, the harder the environment, the more resourceful you need to be to overcome it.<br/>\n<br/>\n So, in my philosophy, I try to go for MAX level 40 power, which makes it more challenging to play my builds in an already challenging environment that is WoG. But I do know the server pretty well, I know all the bosses, what gear is available, custom modifications, quests, rewards, who drops which items, tactics that work and tactics that don't work against certain monsters, etc. That knowledge I have makes every one of my builds more playable by default. Even the ones who are knowingly gimped. My choices will increase the final power of the build, while sometimes making it harder to level for a few levels (or a lot of levels LOL), but nothing that I can't compensate with in-game decisions. I also prioritize combat-oriented things, in detriment of other things that would maybe make the build more well-rounded (but worse at its intended specialty). So, I might not be able to open all locks or to disable all traps, but I'll kick the crap out of my enemies. A toon who can't open a lock will still live, a toon who can't win a battle will not. And if I'm still in the \"gimped stage\" of the build, I simply avoid facing harder encounters until it becomes un-gimped (or I team up with someone to face them). My builds were designed with the aim to beat majos bosses on WoG solo. I don't know how many players can say that they soloed all the toughest bosses on one of the toughest servers out there with their builds. I have, and most likely thanks to this mindset I have when building. However, not all builds are capable of facing all the bosses. So, the ones that are, are truly special. I have only 2 builds (so far) who were able to defeat them all: <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515401/#.WMVSCoWcHIU\" rel=\"noreferrer\" target=\"_blank\">The Magical Master</a> and <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515430/#.WMVSR4WcHIU\" rel=\"noreferrer\" target=\"_blank\">The Shadow Priest</a>.<br/>\n<br/>\n So, now that I've shared my process, I ask: what's yours?<br/>\n<br/>\n Take it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:05 PM - Mar 12, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Max,<br/>\n<br/>\n Afraid I have to be somewhere else now, but just a couple of things before I come back with something more in-depth.<br/>\n<br/>\n 1. Brilliant idea for a topic!<br/>\n<br/>\n 2. Massive thanks for the insight and honesty.<br/>\n<br/>\n I'm looking forward to what this could unearth <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "7:29 AM - Apr 25, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Things can a bit different in single player modules, especially in RP-heavy modules. Everything is possible here, sometimes you even get XP for handling locks and traps. Skills like Persuade and Bluff can become very important (I know a short module where you have to play a combo using Rogue as well as RDD if you want to do all quests, it is low on combat, the three toughest battles can be avoided, most important skills are Persuade and Bluff. Respawn is free, provided you can *talk* your way out of afterlife.)<br/>\n<br/>\nWhich is why I want to go from (relatively) low RP modules to high RP modules (and save Aielund and stuff for later). Doesn't make it easier to distribute your skill points when you do not only need combat skills, but also a lot of social skills (and maybe sneaky skills, too).<br/>\n<br/>\nAnyway, some helpful thoughts here, as always. Some things to think about and keep in mind.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}