{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "296",
  "name": "Dragon Knight (Divine Dragon) Pal26 RDD10 Bard4",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/dragon-knight-divine-dragon-pal26-rdd10-bard4-t2294234.html",
  "author": "TyrTemplar",
  "avatar": "no_avatar.png",
  "replies": "1",
  "views": "2.1K",
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "7:40 AM - Oct 24, 2012",
      "content": "<div>Roaming the Land in Search of Liberty and Justice PvM (1-40) and PvP <br/>\n<br/>\n<br/>\n<strong>Dragon Knight (Divine Dragonborn Paladin of Bahamut)</strong><br/>\n<strong> By Deborah “Tyr” Templar</strong><br/>\n<br/>\nThis build was originally published in the ECB II on November 13, 2007, and revised for NWN1. The build is a “Divine Dragon”, an epic Paladin/RDD with high/PG AB and damage output bolstered not only by Paladin Spells but also Divine Might and Divine Shield. The weakness of the build is that it requires an alignment change; such change is along the lawful-neutral axis which is easy to do, with ample time in which to do so but for those who do not want an alignment change, a Socercer variant is provided here: <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/dragon-lance-divine-dragon-pal29-rdd10-sorc1-t2294236.html#p20302926\" rel=\"noreferrer\" target=\"_blank\">dragon-lance-divine-dragon-pal29-rdd10-sorc1-t2294236.html#p20302926</a>  (NB: includes an option for those who would like Great Smiting on their Knight of Bahamut as well). Dragon Knight (Bard Variant) follows in the next post but first I present to you the Dragon Knight’s Story as Dragon knights of Bahamut aren’t made, they’re  born:<br/>\n<br/>\n<strong>The Dragonborn: Knights of Bahamut<br/>\n<br/>\nGold Half-Dragons are rare, and rarer still one may think are Gold Dragon-descended celestials; however, it often happens that two parents – one, a pure bred golden dragon the other a pure bred angel should find each other together and unified in some common purpose, most typically a common fight against evil – be it the dragon wars, which raged for decades and affected not just middle earth but all of the planes so as to eventually involve not just dragons, but demons, celestials and even the early prime races alike, or the angel-demon wars, for which dragons in general and Golds in particular enlisted, for they were especially indebted to the celestials (and demons) for their assistance during the dragon wars. From these times of war it often happens that two unlikely parents come together and share warmth, a romance born for a reprieve from the harsh realities of war or be it something more, something much deeper, a true found love between two equals brought together by fate whose hopes and aspirations as well as deepest fears are shared, intertwined on the battle field, which brings out both the worse and the best in all who partake in war. With their common love of justice and freedom, and hatred also of evil and oppression in common, it is not so rare after all that Golds and celestials should come together in union: before human-kin walked the prime there was dragon-kin, and before the dragons walked the demons and celestials. <br/>\n<br/>\nBut before them all were the gods and goddesses, including Bahamut, also known as the Lord of the North Winds. The son (and subservient only to) Lo, who himself is the one true dragon god, Bahamut carries with him the responsibility of the throne, for he is the King of all Good Dragons, with the Golds -- being of LG alignment, especially representing well their good dragon king’s dogma, which dogma cherishes justice and individual freedom as not just high ideals, but as something which must be maintained above all else. For a life, all life, if lived without liberty is a life not just wasted but lost. <br/>\n<br/>\nWith liberty comes great responsibility, however, especially when that life is descended from powerful Golden dragonblood for whom Bahamut takes notice. Accordingly, when a child is born of such a union, if the child should of his or her own volition decide to dedicate himself/herself to Bahamut’s cause, such a child is embraced by Bahamut in his own special albeit slow way (slow being a relative term for dragons, since their lifespan towers by comparison to non-dragons such as humans, whom dragons see as rash and hot tempered by contrast to most dragons, quick to rush in and act before thinking, and often causing more trouble by doing so than if they had simply not acted at all; it is a philosophy shared also by most celestials and demons, so far as they feel similarly about humans which gives some such creatures an air of superiority about them, but many – both celestial and Golds see this not as a fault of the humans or other prime races, but more of an opportunity and an invitation to assist, to teach, with many Golds and Celestials alike dedicating themselves, in their own way, to protecting the short-lived precious prime races on earth, if only to watch over them.<br/>\n<br/>\nFor the most part, Gold-Dragons are very kind to their children, and take silent pride in knowing that their dragon-blooded descendents, especially if a dragon-blooded celestial, will by blood inherit this calling, the need and desire to watch over humans in particular but other prime races also, which calling in turn leads many of these children (with a little coaxing no doubt by either or both parents) to put their draconic blood (and celestial heritage) to proper use for the greater good by joining the knighthood (aka paladin). It is the best a Gold can hope for, for their half-gold children do not inherit the longevity of either their dragon or celestial parent, but rather only live as long as if they were born  of mortals; then, a life that burns so bright will only burn half as long, or so they say, and this maxim is true as it relates to dragon-borns. A fact that in the child’s eyes may seem to strain the relationship between itself and his/her gold parents, and especially since golds are not known by mortals to move quickly on an issue, if they even move within the span of a mortal’s lifetime at all, for golds thoroughly think about their actions and the consequences of absolutely everything they do before they do anything at all. <br/>\n<br/>\nTo the child, it may seem as if their gold parent is uncaring, but this is not in fact so since golds are usually very patient and most friendly throughout their half-golds lifetime, even although they will not go out of their way to help. In turn, however, this forces the half-gold to be independent, resilient, and to think for him or herself; with their noble heritage burning in their veins, one-part Gold dragon, another part celestial, half-golds are as a general rule honest, sociable, trustworthy and honorable, being values highly respected by human-kin, beast-kin, dragons and planetouched alike. These are also the values cherished and espoused by Bahamut, which values likewise tend to make half-golds naturally gravitate towards knighthood. Whether it was fate, born of a love sparked in the heat of battle against evil for justice and freedom between a Gold and a celestial, that the offspring of such a union, the half-gold should find his/her way to serve as a knight of Bahamut, in the struggle to further justice and individual liberty throughout his/her lifetime, the same purpose of which s/he was born, remains a mystery: but that half-golds, half-celestials walk the earth in search of justice and freedom, and righting-wrongs, while serving as a bridge of sorts as between dragons and humans is a given, and in a sense, the fact such offspring exist and are dedicated to the mortal world by their Gold parent, driven by a blood lust for adventure and a calling to assist all those in need, is but one more way in which Golds (and Bahamut) watch over humans, albeit they do so indirectly of course and, like all dragons, they take silent pride in so doing even if they are slow if at all to admit it. <br/>\n<br/>\nSource: Kolja Kestrel et al., Races of the Dragon (Wizards of the Sword Coast/Hasbro: 2006).<br/>\n<br/>\nWHAT FOLLOWS is the Build--Dragon Knight, Bard Variant.</strong></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "7:41 AM - Oct 24, 2012",
      "content": "<div>Dragon Knight—BARD Variant:<br/>\nPaladin(26), Red Dragon Disciple(10), Bard(4), <br/>\n<br/>\nRace: Human; Alignment: LG (start) / NG (end)<br/>\n<br/>\nI Attributes:<br/>\nSTR: 16 (38)<br/>\nDEX: 8<br/>\nCON: 8 (10)<br/>\nWIS: 14<br/>\nINT: 12 (14)<br/>\nCHA: 16 (20)<br/>\n<br/>\nII Level Guide:<br/>\n01: Paladin(1): toughness, power attack<br/>\n02: Paladin(2): {Smite Evil}<br/>\n03: Paladin(3): weapon focus<br/>\n04: Paladin(4): STR+1, (STR=17)<br/>\n05: Paladin(5)<br/>\n06: Paladin(6): knockdown<br/>\n07: Paladin(7)<br/>\n08: Paladin(8): STR+1, (STR=18)<br/>\n09: Paladin(9): Divine Shield<br/>\n10: Paladin(10)<br/>\n11: Paladin(11)<br/>\n12: Paladin(12): STR+1, blind fight, (STR=19)<br/>\n13: Paladin(13)<br/>\n14: Paladin(14)<br/>\n15: Paladin(15): divine might<br/>\n16: Paladin(16): STR+1, (STR=20)<br/>\n17: Paladin(17)<br/>\n18: Paladin(18): improved critical<br/>\n19: Paladin(19)<br/>\n20: Paladin(20): STR+1, (STR=21)<br/>\n21: Paladin(21): great strength I, (STR=22)<br/>\n22: Paladin(22)<br/>\n23: Paladin(23): Epic Weapon Focus<br/>\n24: Paladin(24): STR+1, great strength II, (STR=24)<br/>\n25: Paladin(25)<br/>\n26: Paladin(26): epic prowess<br/>\n<br/>\n27: Bard(1): great strength III, (STR=25), *Alignment Change* (MUST be NON-Lawful by HERE).<br/>\n28: Red Dragon Disciple(1): STR+1, (STR=26)<br/>\n29: Red Dragon Disciple(2): (STR=28)<br/>\n30: Red Dragon Disciple(3): great charisma I, (CHA=17)<br/>\n31: Red Dragon Disciple(4): (STR=30)<br/>\n32: Bard(2): STR+1, (STR=31)<br/>\n33: Red Dragon Disciple(5): great strength IV, (STR=32)<br/>\n34: Red Dragon Disciple(6)<br/>\n35: Red Dragon Disciple(7): (CON=10)<br/>\n36: Red Dragon Disciple(8): STR+1, great strength V, (STR=34)<br/>\n37: Bard(3)<br/>\n38: Red Dragon Disciple(9): (INT=14)<br/>\n39: Red Dragon Disciple(10): improved knockdown, {Darkvision}, (STR=38), (CHA=19)<br/>\n40: Bard(4): CHA+1, (CHA=20)<br/>\n<br/>\nIII Basics:<br/>\na Hitpoints: 408<br/>\n<br/>\nb Saving Throws (Self-Buffed) [v Spells]:<br/>\nFort: 27 (37) [42]<br/>\nWill: 23 (33) [38]<br/>\nReflex: 20 (30) [35]  <br/>\n<br/>\nPaladin Immunities, spells (fear, disease, mind-spells, death magic, slow, entanglement, Etc.); <br/>\nRDD Immunities (fire, paralysis, sleep)<br/>\n<br/>\n(+1 Resistance, +1 Prayer, +5 Aura/Eagle’s, +2 Protection v Alignment, +1 Fort/Will Song). <br/>\n<br/>\nIV Combat Vitals:<br/>\na BAB: 30, Melee AB: 48, +1 Song: 49 / Bio-Cap: AB 74 (melee), +11 Smite Bonus: 85<br/>\nSelf-Buffed AB: 64 (melee) <br/>\nOther: +5 Smite Evil (+9 Smite Aura/Eagles’, or: Self-Buffed AB 73 vs. Evil)<br/>\n<br/>\n[+2 Bull’s Str, +5 Divine Favor, +1 Prayer, +1 Bless, +1 Aid, +5 GMW (or Holy Sword)]<br/>\n<br/>\nb Damage—Illustrative:<br/>\nMundane Scimitar: 1-6+14, +2 Song, OR: 1-6+16 (crit: 15-20/x2), +26 Smite<br/>\nSelf-Buffed: 1-6+24, +1d6 v Evil, +5 Magic, +9 Divine (crit: 15-20/x2) (12-20/x2 Keen),<br/>\n+26 Smite<br/>\n<br/>\n[+2 Bull’s, +5 Div.Favor (Magic), +1 Prayer, +5 and 1d6 Evil Holy Sword (or +5 GMW), +9 Div.Might (Aura/Eagle’s)]<br/>\n<br/>\nV Defense Vitals:<br/>\nAC: 21, +8 Mundane Plate, +3 Tower: 32,+1 Prayer, +9 Div.Shield (Aura/Eagle’s): 42 AC<br/>\n<br/>\nOther: Bard Spells, UMD<br/>\n<br/>\nSpell Casting: Paladin(4),Bard(2)<br/>\n<br/>\nSkillpoints: 182*<br/>\nDiscipline 43(57), Heal 1(3), Listen 43(45), Lore 8(14), Perform 9(14), Spellcraft 23(25), Tumble 40(39), UMD 15(20)<br/>\n<br/>\nFeel free to adjust your Knight to suit your own needs/environs, as always.<br/>\n<br/>\nEdit: remove typo</div>"
    }
  ]
}