{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "262",
  "name": "druid wiz pm non shifter ie not puff the magic dragon.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/druid-wiz-pm-non-shifter-ie-not-puff-the-magic-dra-t2354348.html",
  "author": "SmkNThDrkNght",
  "avatar": "10235447_1565972826.jpg",
  "replies": 21,
  "posts": [
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "9:39 PM - Dec 06, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">So I like druids as non shifters and never really thought about pairing one with whiz and pm until the last couple days. However when I used pulses search engine I came up with the famous <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build117497.html\" rel=\"noreferrer\" target=\"_blank\"> Puff the Magic Dragon v.1.0 </a> build. <br/>\n This is not what I'm looking for. I was hoping that someone could throw together a melee and caster version character with these classes.<br/>\n For melee: a scythe wieilder would be cool. Heavy armor would be nice. Over and dev crit. Not necessary but nice if worked in. As for any epic spells epic warding would be my first choice. Maybe a self buffer type. O and the pm crit immunities.<br/>\n For a slinger: undispellable druid spells the scythe would be cool for aesthetics but not necessary. Epic mage armor , warding , hellball , greater ruin would all be desired. Cc icc and spell pen line if possible.<br/>\n These builds would be for Pvm only.  <br/>\n Thanks in advance for anything you guys/gals throw together.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:16 AM - Dec 07, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like non-shifter Druids as well, although i bow to the greatness of \"Puff the magic Dragon\". Kail's \"Order of Jormungadr\" is better but at the time Puff was posted it was eons ahead of it's time.<br/>\n<br/>\n Back to the topic, bone Druids are cool but for an undispellable caster with ema and warding you will have to go the (20/ 4/ 16) split to get them. That assures you all the Druid spells but you will be somewhat dispellable (15%). Iit it worthy in such a build with access to heal? I think not in my opinion, so go for (Druid 24/ Bard 4/ Pale Master 12) instead to gain +8 AC and all the Pale Master's goodies and keep the Undispellable for all your buffs. Switching Wizard for Bard as i did, will also give you +4 AC from full tumble and access to UMD for crazy combos, you don't need paltry Wizard spells with a real caster level of four.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "12:44 AM - Dec 07, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the quick response , that being said I know bard would be way better in terms of playability and I'm not looking for a shifter like the great grizzled ones <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build251344.html\" rel=\"noreferrer\" target=\"_blank\"> The Dracolich of Autumn Twilight </a> . Consider the original request in rp terms not powergaming ie no bard please. :-) maybe just a payable version .<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:17 AM - Dec 07, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So you are looking for rp-builds then? hmm, kinda hard to optimize a non-optimizable build (lols) but i will try. From the top of my head i think (Druid 20/ Wizard 4/ Pale Master 16) is what will serve you best for the melee Druid. We can drop that to (Druid 18/ Wizard 3/ Pale Master 19) for more epic spells if you like them much and better Pale Master summons. As for the caster Druid i think (Druid 26/ Wizard 4/ Pale Master 10) with a couple epic spells other than the Wizard exclusive ones (EMA/Warding) would be the best we can do. Unfortunately Devastating Critical will be hard for the melee Druid and impossible for the caster Druid and even if we manage to incorporate it into the melee Druid then it will cost you a lot. We can do the Penetration line though, and the Heavy Armour too, no problem here. Scythe is likewise workable although Druids have for free one of the best melee weapons (Scimitar) as you know but if you want to make a Halloween Druid then it's fine, and maybe he will hit hard too. To tell you the truth, it is the total AB that troubles me but what the heck, you are a Druid so if you are bored to play with them, then do an empowered firestorm followed by a Hellball and be done with it :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:41 AM - Dec 07, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, bloody hell. I thought I'd look at others' requests so as to stop being so 'me, me,me', and try to see if I could be of use. But no, \"sorry, didn't get a word of that\" applies. I'll go now. Good luck!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:20 PM - Dec 07, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@ Smoke, you know what? I think we can make good use of that Wizard levels by taking 6 of them instead. The 5th lvl should be a free metamagic feat allowing us to take something else pre-epic which is croweded at the moment. The more i think of it, the more i tend to see the (24/ 6/ 10) split as the best option. I am gonna try a rough build for both caster and melee druids and see what we can get out of it.<br/>\n<br/>\n Lets try with the ability scores: (Str 16 Dex 08 Con 12 Int 14 Wis 16 Cha 08) seems a good start. Human of Course because we need all the feats we can get and we don't want a penalty to our Intelligence.<br/>\n<br/>\n Pre-Epic feats: WP: Exotic, WF: Scythe, IC: Scythe, Heavy Armour, Spell Penetration, Greater Spell Penetration, Spell focus Conjuration, Greater Spell focus: Conjuration<br/>\n<br/>\n Epic Feats: EWF: Scythe, Epic Prowess, Empower Spell (Wizard Bonus), Scribe Scroll (Wizard Bonus), Epic Spell focus: Conjuration OR Epic Spell Penetration (Druid Bonus), Armour Skin, Great WIS IV<br/>\n<br/>\n Final Ability Scores: (STR 26  DEX 8  CON 12  INT 14  WIS 20  CHA 8) -- Final AB: +37/ +32/ +27 (Scythe)<br/>\n<br/>\n What do you think of it?<br/>\n<br/>\n<br/>\n @ Most important thing is that you are willing to help, none of us were born experts Stagmeister :)<br/>\n<br/>\n ~  Armoured, Sharpened and rearing to go!<br/>\n (bloody hell i am gonna lose this, i don't have any left i think)...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "9:05 AM - Dec 08, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think I'd drop the ic for blindfight. Other than that it looks good. I didn't even think about the spell focus conjuration I bet it's a nice boost for a druid. Things like that are why I still ask questions. <br/>\n Are warding and mage armor really whiz and sorc specific?  For some reason I was thinking just epic caster (besides pm) qualified. Hmmm 24/6/10 yep no warding maybe greater ruin... decisions ;-)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:13 AM - Dec 08, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's your Druid man, but i must respectfully disagree with your choice, dropping the IC from a scimitar it's alright but dropping IC from a Scythe, well kind of defeats the purpose, you know what i mean... Blind fight is a very nice feat but by no means mandatory for a spell-sword. For your second question, yes this is part of the \"balance\" so to say, only wizards/ sorcerers can have epic mage armour and epic warding, along with pale masters of at least 16th lvl. A wizard or sorcerer must qualify for 9th lvl spell-casting to take them so 17th lvl at least for wizards and 18th for sorcerers, same as auto-still i believe. Can you imagine if clerics had epic warding too along with all those buffs and heals they already possess? Now about the spell focus in conjuration, you will find it very, very useful, you see stonehold is a \"will save\" spell that totally destroys your foes and you can whack them while you have freedom on yourself at your leisure. Storm of Vengeance, vine-mine and grease are all conjurations too. If you want Greater Ruin then you can substitute one great wisdom for that, although your empowered firestorms will do certainly more damage than that (but i understand the concept). Something good that comes out of the wizard lvls is that you will have also 4th lvl wizard spells with a CL of 6th, so you can flame weapon and keen your Scythe for more coolness ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "7:57 PM - Dec 08, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A cleric with epic warding no I'd rather not face that.<br/>\n Good point on blind fight vs ic . Just wasn't sure when I'd get to lvl 13 druid (true seeing).. also I thought druid couldn't take a weapon pro feat I wouldn't know tho since I've always used the scimmy. Grt wis feat over greater ruin then, It would bug the bejeezus outta me to end at 19.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:28 PM - Dec 08, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, and more than that it will help you with the spell DC's as well, every bit counts. Greater ruin has nothing on empowered firestorm. Druids are the only ones that can empower a firestorm spell and the spell itself is one of the only that doesn't have a cap, Simple mathematics say that your Druid will be able to throw 36d6 firestorms, which is also an AoE spell and you need no epic feat for that. Thankfully Druids have plenty of flashy spells to satisfy you, like empowered call lightning, flame strike, storm of vengeance, creeping doom, harm, to say a few, so those along with your fourth lvl wizard spells like improved invisibility or isaacks lesser missile storm and the weapon buffs, should be enough.<br/>\n<br/>\n Good Hunting!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "11:18 PM - Dec 08, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">How did you see this pc leveling? Straight druid for max bab then wiz in epic with pm and the last druid levels afterward? You put scribe as a epic feat ...  12/4/4 pre loses out a little but gets scribe earlier plus was I wrong about weapons proficiency? If I was right then something else would have to be there besides druid.? Idk can't test/play till midnight pacific time.<br/>\n<br/>\n *edit*'just checked the wiki druid cannot take any weapon proficiencies so 12/4/4  pre epic I suppose unless your thinking something else.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:29 AM - Dec 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I also just checked the wiki and it seems you're right Smoke. Damn, another complication that i did not foresee cause i always take some fighter/bard lvls along with druid pre-epic. Well in this case you will need to either stick with a scimitar/shield or take a spear. But i guess you are set on Scythe so, (Druid 12/ Wizard 4/ Pale Master 4) it is but it will lower your AB by two points. Still enough for taking out the normal mobs though especially if it is on a natural terrain where druids get their (+2 AB) bonus. Man, it is like the game do wants you to powergame a bit, taking a scimy means you were also be able to throw out improved critical and take blind fight too, in it's place, along with having a better AC. At this point i feel it is a matter of personal preference, coolness over efficiency so to say and nobody is going to tell you better than yourself. If it was me, i would go for scimy/shield and take all 20 lvls straight druid pre-epic for best AB and CL, and let my spells do the talking when it comes to coolness.<br/>\n<br/>\n { STR 16 (<strong>26</strong>)  DEX 8  CON 12  INT 14 (<strong>15</strong>)  WIS 16 (<strong>20</strong>)  CHA 8 }<br/>\n<br/>\n Pre-Epic: WF: Scimitar, Blind Fighting, Heavy Armour, Spell Penetration, Greater Spell Penetration, Spell Focus: Conjuration, Greater Spell Focus: Conjuration, Empower Spell<br/>\n<br/>\n Epic Feats: Great Wisdom IV, EWF: Scimitar, Epic Prowess, Armour Skin/ Epic Spell Penetration, Great Intelligence I (Wizard Bonus), Scribe Scroll (Wizard), Epic Spell Focus: Conjuration (Druid Bonus)<br/>\n<br/>\n Going with scimitar/shield in this case allowed me to take empower spell pre-epic so i could take great Intelligence (I) with the wizard bonus feat, that means you say hello to 5th lvl wizard spells like bigby's Interposing hand and lesser mind blank. Better yet, with a full plate/shield and pale master lvls you don't really need armour skin so you could take both epic spell penetration and epic spell focus: conjuration. It looks like a win/win scenario to me, and a fine spell-sword to be.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "1:13 AM - Dec 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like it however thoughts on stilled spell instead of greater spell focus perhaps. So the armor off cast armor on thing doesn't have to be done with the wiz spells...<br/>\n<br/>\n *edit* I guess it would end up being epic spell focus.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:21 AM - Dec 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There is no reason to take still spell for your wizard spells in my opinion, think about it, your only spells that you will be casting with your wiizard slots will be buffing spells. Flame weapon, keen weapon, cat's grace, lesser mind blank, improved invisibility, endurance, mage armour, are all buffing spells. Instead quick-slot your armour and a set of clothes (if you don't want to be doing this naked, like myself) and do your buffs, then set out to adventure and use your druid spells for hard combats, everything else can be taken out with your weapon. And here is where scribe scrolls comes in handy, scribe those bigby's hands, those heals and everything else that you like and quick-slot them too, then fill-up those slots with your blaster spells (for your druid spell slots) and utility spells (for your wizard spell slots), maximum flexibility with just some clever play.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "2:29 AM - Dec 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good points I was probably over thinking things. I'm going to roll this guy out tonight and try to catch up with you all in the oc.<br/>\n<br/>\n *edit*  opinion on combat casting over blindfight?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:37 AM - Dec 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Combat casting, what is that? Blind - Fight of course!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:39 AM - Dec 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, you are joining the O.C run? Splendid!<br/>\n<br/>\n ~ There be safety in numbers and i am two or three at least!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "3:32 AM - Dec 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">10/4 on the blindfight question.<br/>\n Why yes I'm gonna do a run thru its been awhile. Will post my \"status\" in stags thread. One last question (I hope) on the build. I am a fan of elfs besides losing the extra feat and skill points do you think picking elf over human iis an ok tradeoff ? You do gain the extra weapons and other eleven innate goodies and blindfight could be the dropped feat.  My thought is that the abilities would be the hardest thing to work around. You?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:32 AM - Dec 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I guess if that makes you more eager to play your druid, go ahead and change the race to elf, but in reality it makes nothing for the build itself... Yeah elves are only for dexers and archers (and even then hins are often better), You will lose blind-fight, 43 skill points, 40 hit points, in order to gain +2 dexterity which will do nothing of course and a longsword proficiency that is an equivalent weapon with the scimitar and maybe a little worse. But you will gain the slender physique of the elves and their luxurious hairstyles, i think that't a fair trade ;) I know, i have done before such trades and worse, because i just liked some things. It won't break the build though, it is worse but it won't break it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "5:08 AM - Dec 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">O I'm itching to play has nothing to do with it's race.  I'm a truck driver and finally got a power inverter so I can play while on the road now. But I have to do my job to. I did throw the pc together in the novice to epic character creator on my break but didn't play any. That'll be when I park tonight around 11:30 pacific lol the cpu is on my bunk waiting for me .<br/>\n<br/>\n Btw thanks for your input and ideas.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "9:38 PM - Dec 09, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So last night was a bummer I did get 2 versions thrown together in the n2ecc one was yours as listed above (all druid pre epic w scimmy) the other was a 12/4/4 pre epic with a scythe (neither were elves) .  Looking at them that way the straight to 20 is absolutely the better powergaming option while the split level one was more rp and got those pm skills (hide, ms, listen) a little earlier as well (so probably the one I'll play but no scythe) . Now I had assumed my inverter was operational it wasn't as soon as I started the oc my battery died :'( game over<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:26 AM - Dec 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Damn! Those little annoyances that always occur at the worst time...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}