{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "294",
  "name": "A Hello and a Request",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/a-hello-and-a-request-t515424.html",
  "author": "lightningkmf",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "485",
  "posts": [
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "8:48 PM - Aug 27, 2011",
      "content": "<div>Hi everyone. I am glad to see that the guild is up and running again. I myself have been creating builds for years and really enjoy it.  I look forward to getting better as I learn from the experts who reside here. <br/>\n<br/>\nEarlier today I tried to send a pm out but I was unable to yet.  I wanted to discuss a build with someone but did not want to send PMs yet. Could a build expert please send me a message or try to look me up on MSN ([url=mailto:<a href=\"mailto:lightningkmf@aol.com\">lightningkmf@aol.com</a>]<a href=\"mailto:lightningkmf@aol.com\">lightningkmf@aol.com</a>[/url]). Thanks in advance.</div>"
    },
    {
      "author": "Dzmitry",
      "avatar": "no_avatar.png",
      "timestamp": "9:01 PM - Aug 27, 2011",
      "content": "<div>I think, you can discuss any build in our Build Request section with ALL members of this small comunity, not with a single one member. Come on, we all here a interested in discussing other's builds and mading ours ones.<br/>\n<br/>\nAnd, welcome to the new ECB community, man =)</div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "10:17 PM - Aug 27, 2011",
      "content": "<div>I would not mind discussing with anyone individual and rather enjoy it... I just know that there are many members from my server who visit this site and im not sure if I would want for everyone to know the ins and outs of my character with all of their weaknesses exposed.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:16 PM - Aug 27, 2011",
      "content": "<div><blockquote><div><strong>lightningkmf wrote:</strong>Hi everyone. I am glad to see that the guild is up and running again. I myself have been creating builds for years and really enjoy it.  I look forward to getting better as I learn from the experts who reside here.\n</div></blockquote>\nWelcome, aboard!  We've missed you! \n<blockquote><div>\nEarlier today I tried to send a pm out but I was unable to yet.  I wanted to discuss a build with someone but did not want to send PMs yet. Could a build expert please send me a message or try to look me up on MSN ([url=mailto:<a href=\"mailto:lightningkmf@aol.com\">lightningkmf@aol.com</a>]<a href=\"mailto:lightningkmf@aol.com\">lightningkmf@aol.com</a>[/url]). Thanks in advance.</div></blockquote>\nUmmm... You lost me here.  Are you trying to PM here on the ECB or not?  Or are you trying to send email to another member?<br/>\n<br/>\nMake sure you have your Board Preferences set the way you want them.  Access it through the Control Panel.  If you just want to send email, well... as long as you know the other member's email addy you don't even need to interface with the ECB.  <br/>\n<br/>\nPlease reinterpret you vexation.  It's been a long day so far for me. <br/>\n<br/>\nAs far as trying to hide a build idea from your playmates, well... that probably won't work.  The true power of the ECB stems from a cooperative evaluation of a build.  Sure there are general formulas that are more-or-less common knowledge, but each member has his/her own experiences and can only offer advice from that knowledge base.  So unless you are PMing with a self-proclaimed builder deity, your building will probably suffer from personal bias.  Besides, it really flies in the face of what ECB is all about and that is providing the general building community the best possible character builds with the guild's \"seal-of-approval\".  Not that I haven't discussed building myself with friends by email... it's just that THIS forum is better!</div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "11:33 PM - Aug 27, 2011",
      "content": "<div>I went and tried to send a message through the forum by clicking on the new message in the tab then clicking on compose new message and was unable to.   I also tried to respond to your message Hip and was unable to.  I suppose i could try and compose the message for everyone. I am trying to come up with a reference to many of the most powerful builds I have come across and wanted to know your thoughts. One reason I was hesitant to post the builds is some of them I find to not make rp sense and do not really want to see them around the server.  Thank you for the warm welcome. I really am looking forward to getting more involved in the community and hopefully through your assistance I can improve my building knowledge and abilities.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "3:35 PM - Sep 09, 2011",
      "content": "<div>Private messaging is allowed in the boards settings, I don't know why it is not working for you. Please §PM me the details and I'll try to look into it.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:54 PM - Sep 09, 2011",
      "content": "<div><blockquote><div><strong>KailPendragon wrote:</strong>Private messaging is allowed in the boards settings, I don't know why it is not working for you. Please §PM me the details and I'll try to look into it.</div></blockquote>\n\nHow will he PM you if it's not working? Must be the holiday hangover <br/>\n<br/>\nTake it EZ!</div>"
    }
  ]
}