{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "006",
  "name": "Wizard and Sorcerer Spellcasting Strategies",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/wizard-and-sorcerer-spellcasting-strategies-t2355313.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "38",
  "views": "14.8K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:45 AM - Jan 24, 2020",
      "content": "<div><strong><span style=\"font-size:175%;line-height:normal\">Wizard and Sorcerer Spellcasting Strategies</span></strong><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_d86c1e99349cac0a487c1089c12635e9.jpg\"/><span style=\"font-size:50%;line-height:normal\">Image sources: <a class=\"postlink\" href=\"https://www.pinterest.com.au/pin/298433912792860075/\" rel=\"noreferrer\" target=\"_blank\">https://www.pinterest.com.au/pin/298433912792860075/</a> and https://www.flick.r..com/photos/fantasy-art-and-portraits/3174028023</span><br/>\n<br/>\nArcane spellcasting is extremely diverse and varied. <br/>\n<br/>\nCombined with a character with poor hit points, poor armor class and poor attack bonus, skillful spell usage is desirable for an enjoyable experience. <br/>\n<br/>\nWith over <strong>180 different spells</strong> (including epic spells) to choose from, the choice of strategy can get overwhelming for the new player. <br/>\n<br/>\nThis guide aims to present an uncomplicated series of strategies for the new player, starting with simple strategies usable from level 1, towards the more advanced strategies at later levels. I have indicated which do not require a high casting statistic such as high intelligence or charisma by calling it \"No DC casting\".<br/>\n<br/>\nPlease note some of the strategies I have not utilised to the fullest, but I have mentioned them in this document because I am aware of them, and am keen to learn more about them as well. <br/>\n<br/>\nThese are a useful list of references I personally found useful, for further reading:<br/>\n<br/>\n<a class=\"postlink\" href=\"https://web.archive.org/web/20100417103320/http://nwn.bioware.com/forums/viewtopic.html?topic=487784&amp;forum=42&amp;sp=0\" rel=\"noreferrer\" target=\"_blank\">Knight_ofLimbo's The Sorcerer Guide: Handbook for Proper Spellslinging</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/shh-tell-no-one-t2355040.html\" rel=\"noreferrer\" target=\"_blank\">General sorcerer build advice from the ECB community (mostly Mick Dagger)</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/melee-mage-wizard-40-t2354625.html\" rel=\"noreferrer\" target=\"_blank\">WebShaman's Melee Mage</a><br/>\n<br/>\nThere is an enormous amount of content to cover, and to do appropriate justice to this will take time. <br/>\n<br/>\nThis particular post will cover summons and familiars &amp; strategies related to them which is already an enormous topic but I will try to be concise. <br/>\n<br/>\nThis is PvM focused and although some of the strategies apply PvP, this is not written with this in mind.<br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:175%;line-height:normal\">Building a Wizard or Sorcerer</span></strong><br/>\n<br/>\nThis section I will keep short, as the focus is on strategies rather than building, and this could be a topic on its own.<br/>\n<br/>\nThe most important asset for Wizards and Sorcerers is caster levels. A decent spell caster will want at least 20 levels in Wizard or Sorcerer, and more if it is a level 40 build, 25+ for 'undispellability', 31+ for 100% spell penetration against maximum toolset spell resistance. A multiclassed spellsword such as a Fighter/Wizard (Valerfor's Abjurant Champion) or Sorcerer/Paladin (Mick Dagger's Spellsword of Bahamut) can accept lower caster levels in exchange for combat ability. But in general, in terms of pure casting ability, more caster levels means more spells, more spell penetration, more power, more bonus feats and more resistance the dispel (but not breach) of Mordenkainen's Disjunction.<br/>\n<br/>\nThe most important statistic for dedicated casters is the spell casting attribute. This is Intelligence for Wizards and Charisma for Sorcerers. This attribute allows for spell casting (ie level 9 spells require 19+ Int or Cha), bonus spells/day and contributes to DC rolls for spells such as Firebrand, Sunburst, Horrid Wilting and Wail of the Banshee. The higher one's DC roll, the more likely the spell will succeed, the lower, the more likely it will fail. Some spells such as Issac's Greater Missile Storm (IGMS) and Bigby's Forceful Hand do not use DC rolls, but most of the area of effect spells will.<br/>\n<br/>\nOther important attributes include Constitution (for hit points, fortitude save and to help with the concentration skill), Intelligence (for skill points for sorcerers) and Strength (to avoid being encumbered, mobbed and dying). Dexterity might be useful for specialised builds (such as stealth Wizard/Sorcerer builds). Wisdom is useful for multiclass cleric/wizards, but such builds are challenging to make well.<br/>\n<br/>\nThe most important skills are Concentration, Spellcraft and Tumble. Concentration allows one to get their spells off successfully if they are receiving damage. Spellcraft allows recognition of spells cast by enemies and improves saves against spells. Tumble increases armor class and allows for a chance to avoid attacks of opportunity.<br/>\n<br/>\nThe most important feats for a dedicated spellcaster are metamagic feats. Extend Spell, Empower Spell, Maximize Spell, Silent/Still Spell allow for more powerful spells, and more spellcasting flexibility. For example with Silent, Empower and Maximize, a level 20 sorcerer with 28 charisma (boosted by items) can cast 7 IGMS spells at spell levels 6, 7, 8 and 9, or 28 IGMS spells. Each IGMS spell does av 140 damage, emp IGMS 210 av damage, max IGMS 240 damage. On average, added up all these spells cast as IGMS will do 5110 magical damage, if the spells penetrate and the enemy does not have magic damage resistance. Strategies can be applied to different situations. Against fire vulnerable enemies, Standard/Silent/Empower/Max Firebrand, against undead, Standard/Silent/Empower/Max Undead to Death. <br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_782199c8f0d4c35d8fe608e3a7935632_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">A water elemental summon drawing the attention of (or 'tanking') a very difficult boss, while I cast empowered IGMS to damage him. World of Greyhawk Persistent World Server</span><br/>\n<br/>\nOther valuable feats include spell focuses, crafting, spell penetration, toughness, save feats (ie great fortitude) and skill focus: concentration. Popular spell focuses include Necromancy, Evocation, Enchantment. Craft Wand and Scribe Scroll are very valuable in persistent worlds (especially wands of lesser spell breach) but less useful in single player modules where experience is limited. Spell penetration feats are useful however can be enhanced by Breach spells and Mordenkainen's Disjunction, being able to lower non-monk's spell resistance by up to 10. <br/>\n<br/>\nPopular epic spells are Epic Mage Armor and Epic Warding. These prolong the mage's survival, are not dispellable and are excellent. Other spells such as Greater Ruin, Hellball, Dragon Knight/Mummy Dust are nice but are non-essential. Auto-Still III is very valuable to allow for spell casting while wearing armor and using a shield.<br/>\n<br/>\nOther features can be added with minimal investment such as Rogue for skills, Shadowdancer for Hide in Plain Sight, Monk 3 for Evasion/Deflect Arrows and Monk Speed, Paladin for Divine Grace (+saves)/proficiencies and Fear/Disease immunity, Cleric for Animal Domain (empowered summons)/proficiencies, Fighter for bonus feats and proficiencies, Ranger 1 for a bonus greater/epic spell focus feat in epic levels. Sorcerers can also access Divine might and Divine shield with significant feat investment.<br/>\n<br/>\nSorcerers have more spells per day, far more flexibility for unexpected events and excellent synergy with charisma classes such as paladin, but have a quite limited spell selection and less skill points. A Wizard has less spells per day, but has a very very large spell selection, and has far more flexibility for planned events, they get far more skill points and have additional bonus feats including scribe scroll for free. I tend to prefer sorcerer as there are a small number of spells that I enjoy casting a lot, flexibility with unexpected events (such as needed more Bigby's than expected) and just 'turning up' so to speak without having to prepare in advance. Wizards are also extremely powerful too, and many players prefer being able to cast every spell available to them and essentially be able to deal with any situation very effectively, provided sufficient advance planning.<br/>\n<br/>\nSome example dedicated spellcaster builds: <br/>\n- <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build231822.html\" rel=\"noreferrer\" target=\"_blank\">Grizzled_Dwarflord's The War Wizard</a><br/>\n- <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/exalted-sorceress-sorcerer-38-paladin-1-monk-1-t515460.html\" rel=\"noreferrer\" target=\"_blank\">cdaulepp's Exalted Sorceress</a><br/>\n- <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/speed-caster-sorceror-36-monk-3-paladin-1-t515365.html\" rel=\"noreferrer\" target=\"_blank\">WhiZard's Speed Caster</a><br/>\n<br/>\nSome example spellswords:<br/>\n- <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-abjurant-champion-wizard-26-ftr-6-cot-8-t2354353.html\" rel=\"noreferrer\" target=\"_blank\">Valerfor's Abjurant Champion</a><br/>\n- <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/spellsword-of-bahamut-sorc-26-paladin-4-rdd-10-t515415.html\" rel=\"noreferrer\" target=\"_blank\">Mick Dagger's Spellsword of Bahamut</a><br/>\n<br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Summons and Familiars</span></strong><br/>\nArcane Spellcasters (Wizards and Sorcerers) usually wish to avoid melee or ranged combat due to their poor combat statistics (with the exception of Spellswords, which will be discussed later).<br/>\n<br/>\nSummons and familiars allow the arcane spellcaster to create another individual to perform the melee or ranged combat on your behalf, and with the goal of allowing the spellcaster to avoid physical combat altogether by providing an alternative target to allow you to cast spells unimpeded. <br/>\n<br/>\nLearning how to use summons/familiars effectively is probably the most essential part of playing a solo spellcaster, and is also extremely valuable in a party situation if you get targeted.<br/>\n<br/>\nYou can only have one summon and one familiar (two total) active at a time. <br/>\n<br/>\nIf you have access to animal companions through multiclass with Druid or Ranger, you may have an animal companion active as well. <br/>\n<br/>\nThere will reduced experience gain with more summons active unless the module has been scripted otherwise. If summons are not required, it is best to unsummon them for maximal experience gain.<br/>\n<br/>\nThe armor class of all summons and familiars is generally poor and does not scale well particularly in epic levels. You should expect your summons to be hit in combat, potentially multiple times. The most valuable intrinsic statistics for your summons / familiars are usually its damage reduction properties (ie 15/+1 for the Tyrantfog Zombie), damage immunities, elemental resistances/immunities and sometimes its offensive qualities.<br/>\n<br/>\nWith the poor armor class of summons and familiars, this makes improved invisibility a very attractive spell to cast on them, with 50% concealment you should expect your summons to last 25-50% longer against physical attacks. Stoneskin can also be helpful as well.<br/>\n<br/>\nNot all summons and familiars are made equal and there are differences between them that should be considered.<br/>\n<br/>\nSummons and familiars in general are considered 'No DC casting', although there may be small buffs depending on the casting attribute modifier (for example, [url=http://Shelgarn's persistent blade]Shelgarn's persistent blade[/url]) they can generally be ignored.<br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Summons - the basics</span></strong><br/>\n<em>Summon Creature I to IX </em> (level 1 to 9)<br/>\nSummon Creature is your basic, multi-purpose summon. <br/>\n<br/>\nThis is useful for most situations but tends not to necessarily excel at one situation compared with another. Generally the highest level summon available is the one that should be memorised, although there are useful strategies involving low level summons as well. <br/>\n<br/>\n<em>Physical damage resistant and immune summons</em> <br/>\nCertain summons are better than the standard summon creature spells at comparable spell levels to soak up physical damage. <br/>\n<br/>\nSpells in this category include:<br/>\n- Shelgarn's persistent blade (level 1)<br/>\n- Animate undead (level 5)<br/>\n- Black blade of disaster (level 9)<br/>\n<br/>\nNote that Shelgarn's persistent blade only has 4hp and is vulnerable to magical and elemental damage, but has damage reduction 25/+1 making it very useful at low levels.  <br/>\n<br/>\n<em>Elemental damage resistant summons</em> <br/>\nThese summons are good at dealing with elemental damage, and include:<br/>\n- Shadow Conjuration [Summon Shadow] (level 4) / Greater Shadow Conjuration [Summon Shadow] (level 5) / Shades [Summon Shadow] (level 6) <br/>\n-&gt; shadow fiend and shadow lord summons from this spell are immune to fire, electrical and cold damage<br/>\n- Black blade of disaster (level 9)<br/>\n- Various other summons (ie Summon Creature IX Elder Water Elemental is immune to fire, Gate's Balor summon is immune to electricity)<br/>\n<br/>\n<em>Offensive / Spellcaster summons</em> <br/>\nI believe these summons are generally more offensively focused and not necessarily as good as others to receive damage (with the exception of the Black Blade of Disaster of course). <br/>\n- Lesser planar binding (level 5) / Planar binding (level 6) / Greater Planar binding (level 8)<br/>\n- Create Greater Undead (level 8)<br/>\n- Mordenkainen's Sword (level 7)<br/>\n- Black blade of disaster (level 9)<br/>\n<br/>\n<em>Gate </em>(level 9) <br/>\nThe Balor summon has offensive capabilities wielding a keen greatsword with 5 APR, and defensive capabilities including spell resistance 28, immunity to electrical, damage resistance 20/- to acid/cold/fire, damage reduction 30/+3. The caveat is that protection against evil must be active or it will turn against you. This is checked every 6 seconds by the Balor. <br/>\n<br/>\nGate is somewhat overshadowed by the Black Blade of Disaster however.<br/>\n<br/>\n<em>Black blade of disaster</em> (level 9) <br/>\nThe Black Blade of Disaster (BBoD) I would consider as one of the most powerful summons in the game. <br/>\n<br/>\nIt is essentially indestructible, and can only be removed through:<br/>\n- targeting the sword with Mordenkainen's disjunction (wizard/sorcerer lvl 9 spell) or Dismissal (bard/cleric 4 and wizard/sorcerer 5 spell).<br/>\n- breaking the caster's concentration with a mind affecting ability such as confusion, paralysis or stun<br/>\n- successfully dispelling the spellcaster (dispelling the spellcaster can remove the sword)<br/>\n- the caster breaking his concentration by attacking, casting a spell etc, subject to a 6 second 'OnHeartBeat event' check...<br/>\n- the caster dying<br/>\n- the spell running out (it lasts 1 round / caster level)<br/>\n<br/>\nOffensively it is a keen greatsword with two attacks per round at an AB of +28, and has a on hit effect of fortitude save DC 17 or death. For enemies that do not die, it can penetrate damage reduction up to +15.<br/>\n<br/>\nThis appears to be the ultimate summon essentially, which is at the price of the caster not  being able to undertake a large number of actions.<br/>\n<br/>\nActions that do not break concentration include walking, talking, setting traps, using emotes and healer's kits. <br/>\n<br/>\nI have listed a few strategies I am aware of involving the BBoD further on in the post. <br/>\n<br/>\n<em>Epic Summons (Mummy Dust, Dragon Knight)</em><br/>\nThese summons are interesting but I believe are very much overshadowed by the BBoD, however they still can have a place in a build if there are enough epic level feats.<br/>\n<br/>\nAs discussed the AC of the summons scales poorly, and this applies to Epic Summons as well. <br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Familiars</span></strong><br/>\n<em>Early game - Consider a familiar 'tank'</em><br/>\nI believe the ideal early game familiar is one that can act as an additional summon to prevent you having to engage in combat.<br/>\n<br/>\nSuch a familiar I believe should have damage reduction and regeneration from the beginning. <br/>\n<br/>\nThe Fire mephit, Ice mephit and Imp have these qualities.<br/>\n<br/>\n<em>Mid to late game - Consider the pixie</em><br/>\nLater on familiars become less powerful in combat although the Eyeball familiar appears interesting with a number of ranged spell like abilities / round.<br/>\n<br/>\nThe familiar I use later on is the Pixie for its lock picking and trap disabling abilities. <br/>\n<br/>\nIt is vulnerable in combat, and once summoned, one will want to order it to 'stand its ground' in a safe location to avoid getting destroyed until you wish to unsummon it or rest. <br/>\n<br/>\nAs mentioned previously all summons and familiars generally do not scale well in terms of AC and with the exception of the BBoD, tend to die very rapidly in combat as leveling progresses in epic levels. <br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Summon strategies</span></strong><br/>\n<em>The escape</em><br/>\n- cast any summon spell (even summon creature I)<br/>\n- cast your escape spell, this could be expedious retreat/haste/mass haste, invisibility or greater sanctuary (potions of speed or invisibility potions can also be used)<br/>\n- cast another summon if needed<br/>\n- run<br/>\n<br/>\n<br/>\n<em>The tank</em><br/>\n- cast any summon spell, the more powerful defensively the better<br/>\n- buff your summon with low level defensive defensive buffs. Suggestions include endure elements, mage armor, improved invisibility (for 50% concealment), endurance, stoneskin, protection against alignment (mind immunity)<br/>\n- get your summon to engage against the enemy while you sit at the back, casting spells, shooting with a bow/crossbow/sling, or using a wand (ie magic missile, ILMS) on the opponent, or healing your summon<br/>\n- if you need to escape, one can cast invisibility / greater sanctuary / haste etc before the summon dies<br/>\n- area of effect offensive spells that normally damage allies such as fireball or incendentary cloud could be cast with impunity against fire resistant or immune summons<br/>\n<br/>\n<br/>\n<em>The lightning rod</em><br/>\n- to be used when not in combat, but you are worried about sneaky / stealthed / invisible opponents that you cannot detect<br/>\n- firstly go invisible or cast greater sanctuary to stay safe<br/>\n- cast summon creature I<br/>\n- if there are any invisible or stealthed opponents, the AI will tend to target your low level summon<br/>\n- enemies are then spotted due to their hostile action<br/>\n- if spells are baited out, one could cast further low level summons to lower the number of spells the enemy caster has remaining<br/>\n<br/>\n<br/>\n<em>The dispel bait</em><br/>\n- cast summon creature I<br/>\n- cast a minor buff on the creature (such as resistance, mage armor etc)<br/>\n- approach invisible or sanctuaried<br/>\n- observe the enemy casters blow dispelling abilities on your summon rather than you<br/>\n<br/>\n<br/>\n<em>The skeletal killer (useful level 9 to level 15, approximately)</em><br/>\n- cast animate dead after you obtain caster level 6+ (if you have PM levels)<br/>\n- this will summon either a skeletal warrior or skeletal chieftain which during this period is strong both offensively and defensively<br/>\n- buff this summon with:<br/>\n-&gt; flame weapon<br/>\n-&gt; bull's strength<br/>\n-&gt; endure elements / mage armor<br/>\n-&gt; improved invisibility / stoneskin / keen weapon<br/>\n- go invisible<br/>\n- observe your greatsword wielding skeleton with DR 5/+1 and damage immunity 50% to piercing/slashing go to work<br/>\n- use heal kits or a wand of negative energy periodically to restore its health<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_46c617d8e6858ac0aa1469c6d632dc10_t.jpg\"/><span style=\"font-size:75%;line-height:normal\"><em>My sorceress is invisible in this screenshot. My skeleton chieftain is buffed with Bull's Strength, Flame Weapon and Improved Invisibility. I periodically recast buffs and heal my summon as needed. It is important to not to stand too close to enemies, otherwise they will be able to 'listen' you despite your invisibility. It is also to be cautious dealing with enemies who could can see invisibility. </em></span><br/>\n<br/>\n<br/>\n<em>The Black Blade of Disaster - staying safe without losing your summon</em><br/>\nGreater sanctuary can be cast before this spell, making the mage untargetable apart from AoE effects and the Black Blade able to do its work. <br/>\n<br/>\nInvisibility is another option before casting your summon but is vulnerable to true seeing and see invisibility spells.<br/>\n<br/>\nThe mage can walk, converse and <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Talk:Black_blade_of_disaster\" rel=\"noreferrer\" target=\"_blank\">set traps</a> without breaking concentration, although if you engage in combat, setting traps will not enjoy Take 20 unless you have the rogue feat skill mastery.<br/>\n<br/>\n<em>The Black Blade of Disaster - spell-casting in between the 6 second OnHeartBeat checks</em><br/>\nThe mage can undertake actions which normally break concentration by sneaking in such actions in between the 6 second 'OnHeartBeat event' checks. <br/>\n<br/>\n<em>BBoD - Haste</em><br/>\nKnight_ofLimbo and the NWN Wiki: BBoD entry wrote a strategy where a hasted mage (who can cast two spells / round) can cast the Black Blade of Disaster then buff it with one spell. <a class=\"postlink\" href=\"https://web.archive.org/web/20100417103320/http://nwn.bioware.com/forums/viewtopic.html?topic=487784&amp;forum=42&amp;sp=0\" rel=\"noreferrer\" target=\"_blank\">This is KoL's words</a>:<br/>\n<blockquote><div><strong>2. Black blade of Boss killing</strong><br/>\n<br/>\nSpell required: Greater Sanctuary (lvl 8 ) , Black blade of Disaster (lvl 9)<br/>\n<br/>\nThis strategy is meant for fighting tough magic-immune bosses. Cast Sanctuary during a fight, then summon the Black blade of Disaster, it will not break the sanctuary and the blade is invulnerable to almost all damage, all you have to do is just sit back and wait for it to wear down that pesky boss. For added fun, if you are hasted or has quicken spell then you can buff the sword with one spell (such as haste) making it even more powerful.</div></blockquote>\n<em>BBoD - haste -&gt; emote/heal kit -&gt; spell</em><br/>\nThe <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Black_blade_of_disaster\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki entry on the Black Blade of Disaster</a> advises that the usual concentration checks can be allow for actions that normally break concentration, to be snuck in, by using actions such as emotes or healers kits, then the desired spell in an action queue. It is not clear whether haste is mandatory to do this or not.<br/>\n<blockquote><div>The \"concentration\" required by this spell is not continuous. Rather, it is checked every six seconds (during the summons' OnHeartbeat event). If at the moment of the check, the caster is considered to be not concentrating (because of either an action being taken or an effect the caster is subject to) then the spell is broken. What happens between checks is not relevant, so it is possible to get around this limitation with careful timing, for which haste may be useful. <br/>\n<br/>\n(One tactic is to build an action queue consisting of a spell to cast followed by an emote or two, then repeating. Healer's kits have also been used instead of emotes, but that is naturally limited by the number of kits possessed.)\n<ul>\n<li>The actions a caster can take that are considered to break concentration are exactly the following: attacking, casting a spell (including spells from items), counterspelling, disabling a trap, flagging a trap, picking a pocket, and taunting.</li>\n<li>The conditions a caster can be under that are considered to break concentration are exactly the following: confused, dominated, frightened, paralyzed, petrified, polymorphed, sleeping, and stunned.</li>\n</ul>\n</div></blockquote>\n<br/>\n<strong>Summary</strong><br/>\n- Summons are mostly used to engage in physical combat so you don't have to<br/>\n- Certain summons are strong against physical damage<br/>\n- Animate dead is a strong mid pre-epic summon against physical damage opponents<br/>\n- Black Blade of Disaster is close to indestructible and is a very powerful summon<br/>\n- Very low level familiars that are useful include fire mephit/ice mephit/imp. <br/>\n- At higher levels I suggest the Pixie for opening locks / disabling traps<br/>\n- Summons generally scale poorly with levels<br/>\n<br/>\nHope you have enjoyed reading this post. It has been an excellent learning experience to organise my thoughts in this way.<br/>\n<br/>\nThere are far more experienced wizard/sorcerer players out there than me, so I am delighted to hear any thoughts they may have on summons and strategies they use.<br/>\n<br/>\nThere are other spell casting topics which I will work on writing a post on in future. I haven't decided exactly on what I want to write on but the next one I look forward to writing on is buffing spell strategies (spells which enhance the offensive or defensive capabilities of the character).<br/>\n<br/>\n<strong>Edit:</strong> added a short section on building wizards and sorcerers</div>"
    },
    {
      "author": "ratty_uk2011",
      "avatar": "no_avatar.png",
      "timestamp": "2:05 PM - Jan 24, 2020",
      "content": "<div>Great work as always Orion!<br/>\n<br/>\nMaybe worth noting in the Strategy section that the CL7 Spell, Word of Faith, includes a no-save Dismissal affect.<br/>\n<br/>\nMany PW's (including WoG) use a modified enemy AI which will freely use this spell if the mod builder includes it in a Cleric build enemy template.    </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:06 PM - Jan 24, 2020",
      "content": "<div>Buffing a BBoD can have amazing effects (Haste, Bull's Strength, etc).  Anything to help make it deadlier, quicker, and hit easier.<br/>\n<br/>\nThe \"trick\" is not to loose the takt - by that, I mean when one starts by first Hasting it (hopefully while Hasted oneself), then filling the queue with alternating Healing Kit/Spell on BBoD.</div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "8:39 PM - Feb 16, 2020",
      "content": "<div>Very nice. Will there be more on actually using offensive/defensive spellcasting tactics and techniques? Things like using meta-magic as a means of spell management?<br/>\n<br/>\nI'd like to see some info on the use of the feat Combat Casting. I'm not quite clear on it's usefulness at low levels with low concentration. Yet I see it being taken as a first feat on some of the builds I've come across, and seen it listed as a \"must have\" from various places. The <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/exalted-sorceress-sorcerer-38-paladin-1-monk-1-t515460.html\" rel=\"noreferrer\" target=\"_blank\">Exalted Sorceress</a> doesn't take it until level 21, and the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/evil-speed-caster-sorc-35-monk-3-bg-2-t2319013.html\" rel=\"noreferrer\" target=\"_blank\">Evil Speed Caster</a> doesn't use it at all.<br/>\n<br/>\nI also see that neither one of those builds uses Spell Penetration. Would that be due to the high caster level making it unnecessary?<br/>\n<br/>\nAnd I realize those may be more along the lines of build questions, than \"how to play,\" but figured they're relevant enough to mention here.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:06 PM - Feb 16, 2020",
      "content": "<div>Yes more is coming, it is a work in progress -&gt; as I learn more and feel more confident about spell casting I will write more, some of the experienced hands out there can critique what I write. The standards of this forum are high, and understandably so. For me to write more I will have to play more arcane casters -&gt; one of the challenges is finding the time.<br/>\n<br/>\nRegarding Combat Casting I think it can be useful if one's concentration is low but I have never taken that feat. I tend to ignore that feat as I view it as non-essential and many of the newer caster builds I have reviewed seem to ignore it as well. As a side note Improved Combat Casting eliminates attacks of opportunity in combat, but defensive casting mode does the same thing if one's modified concentration score (ie total skill ranks + attribute modifiers + feat modifiers + item modifiers) is 27 or more, less if you use lower level spells than level 9 spells.<br/>\n<br/>\nYou are correct with the caster levels.<br/>\nSpell penetration is the caster level plus feat modifiers (ie Spell Penetration / Greater Spell Penetration / Epic Spell Penetration) plus a 1d20 dice roll, versus the enemy's spell resistance score. If SP is equal or higher than the SR, the spell is successful.<br/>\nThe standard maximum toolset SR is 32. Not all enemies will have spell resistance by the way.<br/>\nDedicated Caster Builds should be designed to try to beat the standard maximum toolset SR regularly.<br/>\n30 caster levels should mean spell penetration is successful 95% of the time for maximum toolset SR.<br/>\nHigh spell resistance can also be lowered by spells such as Mordenkainen's Disjunction and Lesser Spell Breach. <br/>\n<br/>\nThat being said, certain environments have been created by custom module designers and dungeon masters that have large numbers of enemies who have higher than the maximum toolset SR. Examples of this are high level spell resistant monk opponents, or Drow (who have SR = character level + a certain number).<br/>\nWhether your caster will penetrate that type of spell resistance anyway with the spell penetration feats is questionable.<br/>\nIt is probably worth it if your caster completely relies on spells to defeat opponents but there are ways where spell resistant opponents can be beaten with spells, for example, summons, polymorphs (ie Shapechange spell) and damage shields (ie Mestil's Acid Sheath).<br/>\nSpell penetration depends on the environment in the end, I think most dedicated casters should aim to beat maximum toolset SR regularly beyond that I am unsure.<br/>\n<br/>\nThere's a lot more information on all these topics on the NWN Wiki which I'm sure you are aware of</div>"
    },
    {
      "author": "UrbanHermit",
      "avatar": "10759229_1581741214.jpg",
      "timestamp": "1:29 AM - Feb 17, 2020",
      "content": "<div><blockquote><div><cite>Orion2019 wrote: <div class=\"responsive-hide\">Feb 16, 2020</div></cite>There's a lot more information on all these topics on the NWN Wiki which I'm sure you are aware of</div></blockquote>\nOh, yes... very much aware. I frequently Alt+Tab from the game to my browser where the Wiki stays open for quick access. <br/>\n<br/>\nThank you very much for the explanations. The Wiki is great, but it's kind of bare-bones information that still leaves me scratching my head sometimes. <span class=\"text-emoji\">🤔</span></div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "3:46 PM - Feb 17, 2020",
      "content": "<div>Combat Casting<br/>\nLimited usefulness for most arcane builds. If a build has any of the following, I would recommend passing on Combat Casting:<br/>\n- Access to immunity to criticals and Mestil's Acid Sheath<br/>\n- Effective 29 modified ranks in Concentration<br/>\n- High AC<br/>\n<br/>\nCombat Casting is most useful to Spellswords that aren't talking some form of critical immunity and want/need melee spellcasting ability.<br/>\n<br/>\nLow level wizards that engage in melee typically cast spells beforehand. Mage Armor, Bull's Strength, et al. are the staple of the starting caster.<br/>\n<br/>\nMeanwhile, mages with access to Mestil's Acid Sheath and immunity to criticals WANT to get the AoOs from melee casting. Stoneskin or other damage reduction will absorb enough of the incoming damage for the damage shields to kill most things.<br/>\n<br/>\nA caster with 29 modified ranks in Concentration passes all combat casting checks automatically, so the feat isn't needed. Only builds with a need for another combat mode (Expertise or Power Attack) should bother with Improved Combat Casting. Certain martial clerics may get more use out of it, as such.<br/>\n<br/>\nAny character with a high AC won't get hit very much anyways, making AoOs mostly pointless.<br/>\n<br/>\nFinally, if you're still considering Combat Casting, but the environment doesn't have perma-haste, you might want to see if you can squeeze Automatic Quicken Spell III into the build. This will act like perma-haste when casting and negate AoOs at the same time.<br/>\n<br/>\nFinally, if playing in a very level limited environment (i.e.: level cap 6), Combat Casting may be worth your investment, especially if you want to use spells more offensively and less as buffs.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:04 PM - Jun 23, 2020",
      "content": "<div><strong><span style=\"font-size:150%;line-height:normal\">Wizard and Sorcerer Buffs</span></strong><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_e46de26c9845e731457dd5869c82634c.jpg\"/><br/>\n<span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://i.pinimg.com/736x/b5/0b/73/b50b735fdafe1c8b6016615d5bf9e5c0.jpg\" rel=\"noreferrer\" target=\"_blank\">https://i.pinimg.com/736x/b5/0b/73/b50b ... f9e5c0.jpg</a></span><br/>\n<br/>\nAs mentioned there is an enormous number of arcane spells. This section will cover 'buffs', which are spells used on the caster or allies for a beneficial effect over a period of time. <br/>\n<br/>\nI have grouped them into:<br/>\n- short duration vs long duration<br/>\n- offensive vs defensive vs special<br/>\n<br/>\nSome general notes:<br/>\n- The number of caster levels (CL), and/or whether it was cast with extend spell or not will impact the duration of the buffs. <br/>\n- Some buffs (ie. Bulls strength) could be considered as offensive (on a high strength spell-sword), defensive (combined with a high discipline score to prevent disarm) or special (to carry more weight from a dungeon to sell in town)  <br/>\n<br/>\nBuffs can also be deemed dispellable or 'undispellable'. An 'undispellable' buff cannot be removed with the spells lesser dispel, dispel or greater dispelling. This is achieved with 25 or more caster levels. So a character with 25 wizard levels or more cannot have his or her stoneskin spell removed by these spells, provided the original buff was cast as a memorized spell. Originally it was thought 24 caster levels would be sufficient (see <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Greater_dispelling\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki: Greater Dispelling</a>) however ingame testing results by from two players <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/ee-dispel-changes-t2355514.html#p21221\" rel=\"noreferrer\" target=\"_blank\">suggests 25 caster levels are necessary</a>. There are additional exceptions (for example, a self targeted silence spell is always dispell-able no matter the caster level) however as far as I know no wizard or sorcerer spell has these exceptions apply.<br/>\n<br/>\n'Undispellable' buffs can be removed in other ways. The spells lesser spell breach, greater spell breach and Mordenkainen's disjunction can remove a character's stoneskin buff even with 40 wizard levels from a breach effect. There is a complex list of buffs removed by breaches which can be viewed at <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Breach\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki: Breach</a>. The 50% concealment from the improved invisibility spell, while not breachable, can be removed with the Cleric's invisibility purge spell without failure if the cleric is standing close enough. Crafted magic spells, cast from scrolls, wands and potions will always be dispellable as the highest crafted magic possible is caster level 20.<br/>\n<br/>\nEpic spells (ie Epic Mage Armor, Epic Warding) cannot be dispelled, breached or purged regardless of the caster level of the character.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_4d5727c6c1887bcf6e9d45e821295bfc_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">The strategies that apply to a dedicated spellcaster will differ slightly compared with a spell-sword (a multiclassed mage and warrior, ie a fighter/wizard or sorcerer/paladin)</span><br/>\n<span style=\"font-size:75%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://i.pinimg.com/originals/99/26/b8/9926b83d04d1d96e78096134c6ed5a3c.jpg\" rel=\"noreferrer\" target=\"_blank\">https://i.pinimg.com/originals/99/26/b8 ... ed5a3c.jpg</a></span><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Short duration offensive buffs</span></strong><br/>\nThere are a few useful short offensive buffs, haste/mass haste, damage shields (death armor, elemental shield and Mestil's acid sheath), time stop, true strike and tensor's transformation.<br/>\n<br/>\n<em>Haste/Mass haste</em><br/>\nThis allows for two spells or actions / round or an extra attack, +4 dodge AC and increased movement speed. Mass Haste is harder to dispel and affects the whole party. Certain actions, such as using a wand or brooch of shielding, will use up the whole round regardless of haste, but other actions such as divine might or shield, will allow a further spell or action to be cast.<br/>\n<br/>\n<em>Damage Shields</em><br/>\nDamage shield spells deal damage to an enemy when the caster is hit by an enemy's melee attack. It deals an  amount of damage that is the is defined by the spell. The amount of damage dealt by the opponent does not alter the damage dealt. An opponent could deal 1 damage, 100 damage or even no damage (through physical damage resistance, immunities and reductions) the same amount defined by the spell is applied. <br/>\n<br/>\n- Death armor is a level 2 spell which deals 1d4 +CL (maximum CL damage +5) magical damage per melee hit received, for a duration of 1 round / caster level. <br/>\n- Elemental shield deals 1d6 +CL fire damage per melee hit received, and also provides 50% damage immunity to fire and cold, for a duration of 1 round / caster level. <br/>\n- Mestils acid sheath deals 1d6 + (2 × CL) acid damage with no maximum per melee hit received, for a duration of 1 round / caster level. <br/>\n<br/>\nAll three spells can be active at the same time, meaning all three will damage an enemy hitting the caster with a melee attack. The extend spell metamagic feat can be used to double the duration of the spell. There are two other damage shield spells that wizards and sorcerers do not normally have access to, namely Bard's wounding whispers (sonic) and Cleric's Aura versus Alignment (divine or negative), the only way wizards and sorcerers can cast this is either through UMD or having enough levels in the appropriate class. <br/>\n<br/>\nA damage shield strategy outputs some of the high damage possible per round in the game against melee mobs. The most favorable opponents are low damage melee enemies who are not acid or fire resistant or immune. Melee monks are usually good to use shields against, with so many attacks per round. Harder opponents who shields are still useful against are big melee hitters, these could be high strength two handed weapon wielded who can hit for a lot of damage, especially if they critical hit. Shields are still useful, however one must be careful to watch the health bar. Damage shields are not useful against archers or spellcasters who are not using melee attacks, apart from elemental shield will reducing fire and cold damage dealt to you.<br/>\n<br/>\nIf damage shields are used often, strategies to lower damage dealt while minimally affecting the opponents ability to hit to the caster are very useful. These include damage reduction (ie. ghostly visage, stoneskin, ethereal visage, greater stoneskin, shadow shield, premonition, Epic Warding, endure/resist/prot from elements) and critical hit immunity (from either Pale Master 10 or Shapechange: Iron Golem). Equipment can also assist, along with having a decent amount of HP (from the endurance spell, equipment, or constitution score). <br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_8227a51a0c1629c6e38348f84e743f7a_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">My sorceress is fighting a melee mob with Mestil's Acid Sheath, Elemental Shield, Death Armor damage shields on the World of Greyhawk Persistent World server. </span><br/>\n<span style=\"font-size:75%;line-height:normal\">Shapechange: Iron Golem is used to protect me from excessive damage through crit immunity and damage reduction, and to increase my HP.</span><br/>\n<br/>\nOne can adjust the damage output and damage received with more or less AC or concealment, as one can either be hit so infrequently it isn't worth using the shields, or be hit so much one cannot heal fast enough. One can lower their AC by being flatfooted, this removes Tumble/Dodge and Dexterity AC (only tumble/dodge AC in builds with uncanny dodge I), by simply clearing the action queue and standing still. Triggering attacks of opportunity by drinking potions, attacking with a ranged weapon or moving around without sufficient tumble can also help increase damage output.<br/>\n<br/>\n<em>Time Stop</em><br/>\nTime stop is considered one of the most powerful spells in the game when used in conjunction with Issac's Greater Missile Storm (IGMS) and haste. Time Stop allows the caster to do whatever they wish for 9 seconds with no one else being able to undertake any other action.<br/>\n<br/>\nThe ideal combo I understand is (I am admittedly, still learning this):<br/>\n- Haste (or be hasted from an item)<br/>\n- Time stop -&gt; Max/Emp IGMS -&gt; Max/Emp IGMS<br/>\n- Time stop -&gt; Max/Emp IGMS -&gt; Max/Emp IGMS<br/>\nEtc until one runs out of time stop spells.<br/>\n<br/>\nMax IGMS does 240 damage and Emp IGMS average 210 damage at CL 20. So each Time Stop - Max/Emp IGMS - Max/Emp IGMS combo does 420-480 damage, assuming spell resistance is penetrated and there is no magical damage resistance or immunity. This is ideally best if there is only one target (ie a difficult boss). Against a mob of enemies, the missiles tend to get more dispersed and other spells, such as Max/Emp firebrand, horrid wilting or wail of the banshee might be better choices. The same combo can be performed (ie Time Stop -&gt; Wail -&gt; Wail) provided one is hasted. Mordenkainen's Disjunction, Greater Spell Breach or Lesser Spell Breach can be cast early during the combo to remove protections and lower spell resistance. <br/>\n<br/>\n<em>True Strike</em><br/>\nThis spell increases AB by 20 for 9 seconds. There is some synergy between haste and true strike increasing the effectiveness of true strike by 25-50%. <br/>\n<br/>\n- Without haste true strike will only affects the next round because 3 seconds is used to get to the next round <br/>\n- With haste if cast as the second action it affects the next round plus one flurry, because those 3 seconds normally used to get to the next round no longer are needed <br/>\n<br/>\nWith 4 APR (including haste) this will be 6 attacks affected by true strike.<br/>\nWith 5 APR (including haste) this will be 7 attacks affected by true strike.<br/>\nWith 6 APR (haste and rapid shot) this will be 8 attacks affected by true strike.<br/>\n<br/>\nKing Ubu in his build <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build180449.html\" rel=\"noreferrer\" target=\"_blank\">Divine Strike Bowman</a> (Paladin 5 / Sorcerer 5 / AA 30) utilises this strategy, by using haste, then divine might-true strike. <br/>\n<br/>\nThis is King Ubu's explanation of the concept:\n<div class=\"codebox\"><p>Code: <a href=\"#\" onclick=\"selectCode(this); return false;\">Select all</a></p><pre><code>Damn, I was hoping to not have to explain this.. \n\nOk, so normally the TS lasts 9 seconds. This gives you 1 round of +20 AB, because the spell actives in the middle of the first round and lasts till the end of the first\n\nseconds----&gt;\n--1--2--3--4--5--6 7--8--9--10-11-12-13-14-\n&lt;-- round 1 -----&gt;&lt;---- round 2 ----&gt;&lt;-- round 3--\n&lt;-- TS -&gt;&lt;--------- +20 AB ---------&gt;\n\nBut... If you're hasted, you get 2 spells in a round. So if you cast TS as the 2nd spell....\n\n--1--2--3--4--5--6 7--8--9--10-11-12-13-14-15\n&lt;-- round 1 -----&gt;&lt;---- round 2 ----&gt;&lt;-- round 3--\n&lt;-spell-&gt;&lt;-- TS -&gt;&lt;--------- +20 AB----------&gt;\n\nSo your TS lasts into the 3rd round, enough for the 1st flurry in that round. Now the fooly cooly part is the 1st spell can be 'Divine Might'. So while hasted, you just queue up:\n\nDivine Might\nTrue Strike\nRapid Shot\nAttack\n\nAnd your next 8 attacks get +20AB/+cha(divine) damage.</code></pre></div>\n<em>Time Stop + True Strike</em><br/>\nAquarius has written of a Time Stop / True Strike combo that can be helpful in certain situations:<br/>\n<blockquote><div><strong>Aquarius_233 wrote:</strong><br/>\n<br/>\nForgot to mention a combo used with a sorcerer spellsword against bosses, that can heal themselves and have a high spell resistance. This is a \"melee version\" of the time stop + IGMS combo, I write it here in the hope that can be of interest for someone:<br/>\n1) hit enemy until they are in \"Near dead\" status; if Tenser's transformation is active, don't hit him/her anymore and avoid enemy until Tenser's wears off;<br/>\n2) before proceeding to next steps, make sure that haste is active and so divine might (if applicable);<br/>\n3) cast time stop, then (if the AB is not enough to continuously hit the enemy) true strike, then attack him/her 3 or 4 times (depending on your \"attack per round\" parameter);<br/>\n4) repeat step 3 until boss is dead: in the meanwhile, cast haste/activate divine might if it wears off.<br/>\n<br/>\nIf timing is good, enemy will die before healing himself/herself.</div></blockquote>\n<em>Tensor's Transformation (TT)</em><br/>\nThis spell transforms the caster into a longsword wielding warrior for 1 round / caster level. <br/>\nThe vanilla NWN version was been altered from the original Pen and Paper (PnP) Dungeons and Dragons v3.0 version by Bioware.<br/>\nIts usefulness is limited by how effective Shapechange is in comparison, when it can be accessed, particularly given it lasts longer.<br/>\nWith polymorph spells such as TT, Polymorph Self and Shapechange one may forget memorized spells, as any attribute bonuses from magical equipment do not transfer when polymorphed with these spells (they do transfer to an extent with Druid and Shifter polymorph abilities such as Wild Shape).<br/>\nThe <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/script/improved-tensors-transformation-spell-fix\" rel=\"noreferrer\" target=\"_blank\">modified PnP version of the spell</a> is more attractive and is used in some modules.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Short defensive buffs</span></strong><br/>\nA few defensive spells last 1 round / caster level or a similar short duration, namely resistance (2 turns), expeditious retreat, clarity, spell mantles, globes of invulnerability, ethereal visage, displacement, greater sanctuary, epic warding. <br/>\n<br/>\nGreater sanctuary is one of the most powerful spells in the game, and has some very interesting strategies that can be used with it (ie greater sanctuary + black blade of disaster). It is not a perfect protection, as casters can still be hit by AoE spells, and attacks of opportunity (ie by spell casting against a melee opponent with true seeing in melee range, who is in combat)<br/>\n<br/>\nSpell mantles and globes of invulnerability can be helpful against spell casters. Empowered spell mantle provides more protection than greater spell mantle, empowered lesser spell mantle and spell mantle are similar. <br/>\n<br/>\nDisplacement and extended displacement is a useful source of 50% concealment against opponents with invisibility purge who can purge away the longer lasting improved invisibility spell. I understand this is particularly relevant in PvP. <br/>\n<br/>\nEpic Warding is valuable in boss fights, particularly in conjunction with damage shields. <br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_c2fe8f59c70335e1335f093da6ac0075_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">Here Rold (myself), Fifur (Franz) and Betha (Aquarius) are fighting Lord Vayne and Lady Althea. </span><br/>\n<span style=\"font-size:75%;line-height:normal\">Lady Althea is protected with Epic Warding, a formidable physical damage shield that lasts 1 round/caster level, and can absorb +20/50, 50 damage/caster level. </span><br/>\n<span style=\"font-size:75%;line-height:normal\">World of Greyhawk Persistent World Server</span><br/>\n<br/>\nClarity can be useful if lesser mind blank or mind blank is unavailable and prot v alignment will not work (ie a neutral aligned enemy). <br/>\n<br/>\nExpeditious retreat is valuable in speed caster builds. For more information, see NWN Wiki: <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Monk_speed\" rel=\"noreferrer\" target=\"_blank\">Monk Speed</a>, Whizard's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/speed-caster-sorceror-36-monk-3-paladin-1-t515365.html\" rel=\"noreferrer\" target=\"_blank\">Speed Caster</a> and Mick Dagger's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/evil-speed-caster-sorc-35-monk-3-bg-2-t2319013.html\" rel=\"noreferrer\" target=\"_blank\">Evil Speed Caster</a> builds.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Short special buffs</span></strong><br/>\nThese include identify, clairaudience/clairvoyance, these are useful abilities in some situations. <br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Long offensive buffs</span></strong><br/>\nThese spells last at least 1 turn / level, and include magic weapon, bull's strength, cat's grace, flame weapon, fox's cunning, keen edge, greater magic weapon, polymorph self, shapechange. <br/>\n<br/>\nBull's strength, cat's grace and fox's cunning increase strength, dexterity and intelligence respectively. They can be cast with empower spell, making them 50% stronger. <br/>\n<br/>\nMagic weapon grants a melee weapon a +1 enchantment which is sometimes useful early game. Greater magic weapon provides +1-5 enchantment to a melee weapon. Flame weapon provides added fire damage to a melee weapon. Keen edge applies the keen property to weapon with slashing damage (ie scimitar, greatsword, longsword, kukri, halberd, greataxe, scythe etc). <br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_833a7fcd5d9aed7a8383fdc3b4c2e638_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">Even unconventional melee weapons can have flame weapon applied to it. Here my Bard/Sorcerer Tanner Gordon has whacked an enemy with a custom CEP guitar (1d2 20x2) with flame weapon applied. World of Greyhawk Persistent World Server.</span><br/>\n<br/>\nPolymorph self and shapechange turn the caster into another creature that is intended to have reasonable combat ability compared to the usual wizard/sorcerer. I find Shapechange: Iron Golem the most useful, due to the tremendous immunities (ie mind immunity, critical/sneak immunity, ability drain immunity) and damage reduction +3/30-.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Long defensive buffs</span></strong><br/>\nThese include endure/resist/prot from elements, energy buffer, mage armor, shield, ironguts, prot v alignment/magic circle v alignment, endurance, owl's wisdom, invisibility/invisibility sphere/improved invisibility, stoneskin/greater stoneskin/premonition, lesser mind blank/mind blank, shadow shield, protection versus spells, epic mage armor.<br/>\n<br/>\nEndure elements, resist elements, protection from elements and energy buffer reduce elemental damage. Energy buffer can only be put on the caster, the others can be cast on allies and summons. Endure elements and protection from elements have a duration of 24 hrs regardless of caster level.<br/>\n<br/>\nMage armor grants +1 armor AC +1 natural AC +1 dodge AC and +1 deflection AC. Only the dodge AC stacks with other sources of AC, in practice later in the game this provides +1 dodge AC in most environments, which can be a useful addition. Early game before enchanted items are available, this spell is more powerful.<br/>\n<br/>\nShield provides +4 deflection AC and immunity to magic missile. This is valuable early game, especially against enemies using magic missile. <br/>\n<br/>\nIronguts increases the fortitude save against poison, and is sometimes useful early game against poisons and poison traps.<br/>\n<br/>\nProtection versus alignment and magic circle versus alignment provide a number of bonuses against enemies of either evil or good alignment, including +2 deflection AC, increased saves, however the most valuable is mind immunity. Protection versus evil is an extremely useful spell against undead, with their fear auras and other mind affecting abilities. Protection against alignment can also be cast on allies if one is of either good or evil alignment to protect them from your own spells, for example, if you were to cast stinking cloud in battle, they would be protected from the daze effect. <br/>\n<br/>\nEndurance increases HP and fortitude save. This can be cast empowered to increase its effectiveness by 50%. <br/>\n<br/>\nOwl's wisdom increases wisdom and will save, also can be cast empowered.<br/>\n<br/>\nInvisibility makes a target invisible, which is excellent for scouting and escaping battles. Invisibility sphere creates a invisible circle making allies around the caster invisible. In both cases invisibility will break when  performing a hostile action such as attacking or using an offensive spell. <br/>\n<br/>\nImproved invisibility is the same as invisibility, however once invisibility is broken, the 50% concealment provided by invisibility will remain. Due to the 50% concealment and long duration, improved invisibility is one of the most valuable defensive abilities in the game.<br/>\n<br/>\nGhostly visage reduces physical damage +1 soak 5 damage, 10% concealment and provides immunity to level 1 spells, it is an excellent low level defensive buff that lasts 1 turn / level. The damage reduction falls off late pre-epic when opponents tend to have more powerful spells and enchanted weapons. <br/>\n<br/>\nStoneskin, greater stoneskin and premonition reduce physical damage, up to +4 enchantment. +5 or stronger enchanted weapons will bypass these protections. The spells stack on each other, but only one spell is used up at a time. It can be helpful to have a greater stoneskin active when premonition runs out, allowing the caster time to recast premonition again.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_718886d088f8258ffbf7a4c9bd037e78_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">My sorceress Yldrorth, casting stoneskin on my teammates (Yogmister7, Neon-Maniac, SnorriHT) in the World of Greyhawk Persistent World Server</span><br/>\n<br/>\nLesser mind blank and mind blank provide mind immunity against all opponents. Mind blank provides mind immunity in a small area of effect to allies as well.<br/>\n<br/>\nShadow shield provides +3/10 damage reduction, negative damage immunity and death magic immunity, and is an excellent defensive spell.<br/>\n<br/>\nProtection versus spells provides +8 to saves against spells for the caster and a number of allies, and is a powerful defensive spell, particularly as it cannot be removed by breaches.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_6b7f65488e1192e9a885f0698f359665_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">Milo the Mage (Grom), a pure wizard, casting Protection versus Spells on the entire party outside White Plume Mountain, World of Greyhawk Persistent World</span><br/>\n<br/>\nEpic Mage Armor provides +5 armor AC, +5 deflection AC, +5 natural AC and +5 dodge AC for 24hrs and it cannot be dispelled or breached even by Mordenkainen's. <br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Long special buffs</span></strong><br/>\nThis includes see invisibility, ultravision, true seeing, legend lore. <br/>\n<br/>\nSee invisibility is valuable against enemies with invisibility. Ultravision is essential to have vision through magical darkness, and has excellent synergy with the darkness spell. <br/>\n<br/>\nTrue seeing provides the ability to see anything, the vanilla NWN version of this spell is considered so powerful that in some environments it is modified so its power is reduced. <br/>\n<br/>\nLegend lore is a longer lasting version of identify. I believe it stacks with identify, but have not tested this yet.<br/>\n<br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Putting the pieces together</span></strong><br/>\nThe purpose of the thread is strategies. Here is a list of buffing strategies from the above text.<br/>\n<br/>\n<em>1. Standard buffs</em>: <br/>\n<br/>\nPremonition (and/or Greater Stoneskin and/or Stoneskin)  <br/>\nEpic Mage Armor (or Mage Armor) <br/>\nImproved Invisibility <br/>\nEnergy Buffer or Prot v Elements <br/>\nMind Blank (or Lesser Mind Blank / Prot v Alignment) <br/>\nShadow Shield / <br/>\nEmpowered Endurance &amp; Empowered Cat's Grace <br/>\nExtended Mass Haste (or Haste) <br/>\nProt vs Spells<br/>\n<br/>\n- physical damage reduction, +5/30, up to 400hp physical damage absorbed<br/>\n- +5 dodge AC minimum from EMA, up to +20 AC depending on items equipped<br/>\n- 50% concealment<br/>\n- elemental damage reduction up to 40 damage, up to 60 elemental damage absorbed<br/>\n- mind immunity<br/>\n- death magic immunity, negative damage immunity, +3/10 damage reduction<br/>\n- extra HP / dex AC / fort and reflex saves / ranged AB<br/>\n- two actions / round plus +4 dodge AC<br/>\n- +8 to saves against spells plus allies<br/>\n<br/>\nThis is a list of standard buffs a character can use when playing as a spellcaster with no special strategies in mind. <br/>\n<br/>\nIf there is a chance of them getting dispelled, it helps to save your spells and only use the defensive buffs you need plus Epic Mage Armor, which is always undispellable and lasts 24 hours. Important buffs are physical damage reduction, 50% concealment, mind immunity, death immunity, elemental damage resistance, haste for two spells / round. <br/>\n<br/>\nI recommend only using all of them if you don't think your opponents will dispel your buffs as it is very time consuming to cast all of them. A high level caster with a Mord's spell can very easily ruin your day by removing all these buffs. Casting invisibility or greater sanctuary can allow the caster to recast all the essential buffs again if this does happen.<br/>\n<br/>\n<em>2. Spellsword or melee teammates</em><br/>\n- if there are melee warrior teammates in your party, or one is playing a spellsword (a character who has a useful melee AB attack combined with spellcasting), useful buffs include Greater Magic Weapon (or Magic Weapon), Flame Weapon, Keen Edge, Haste/Mass Haste, Bull's Strength, Cat's Grace for melee dex characters. Other protective spells as listed above can be helpful as well, particularly mind immunity, as many melee warrior classes have poor will saves. <br/>\n- in vanilla NWN, ranged teammates can benefit from either Cat's Grace or Owl's Wisdom, and Haste/Mass Haste. Custom modifications are available to also allow the usual buffs that can be cast on melee weapons to also be able to be cast on ranged weapons or ranged ammunition.<br/>\n<br/>\n<em>3. Haste, then Time Stop - Max/Emp IGMS </em>- Max/Emp IGMS - Time Stop - Max/Emp IGMS - Max/Emp IGMS etc<br/>\n- more details outlined previously in the text (ie a Mord's could be used to lower spell resistance/remove defenses, or Max/Emp Firebrand for AoE damage rather than single target)<br/>\n<br/>\n<em>4. Haste, then Spell/Ability (ie Divine Might) - True Strike</em> - (rapid shot if available) 6-8 attacks at +20 AB<br/>\n- more details in the text<br/>\n<br/>\n<em>5. Extended Mestil's Acid Sheath / Ext Elemental Shield / Ext Death Armor </em>then Empowered Endurance / Epic Warding / Shapechange: Iron Golem (or Pale Master 10 and Premonition/Epic Warding) to reduce melee damage received while dealing up to 125 damage to enemies / melee hit received by the caster.<br/>\n<br/>\n<em>6. Greater Sanctuary and Black Blade of Disaster </em><br/>\n- discussed in the summons post previously<br/>\n<br/>\nHope you enjoyed reading this and hope this helps for those wanting to try playing a wizard and sorcerer, or wanting to improve their skills.<br/>\n<br/>\nI haven't covered offensive spells yet, but there is already a lot in this post which overlaps, and there is already a significant amount of content covered already, and I might cover that another day.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "1:15 PM - Jun 24, 2020",
      "content": "<div>Awesome guide Orion.  Though you forgot one of my favorite spells..    Ghostly Visage....    last a decent amount of time..   +5 damage reduction.. and the best part...  Immunity to all lvl 1 spells....   and 10% concealment.<br/>\n<br/>\nWhat other low level buff makes goblin/kobold shamans ineffective while absorbing damage and giving you concealment?<br/>\n<br/>\nOther then that... great work, and the screenshots just push it over the top...</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:09 PM - Jun 24, 2020",
      "content": "<div>Thanks Conlaoch! Well spotted with ghostly visage! <br/>\nI forgot to list it in the long defensive buffs section, with so many spells to discuss and I probably got tired! <br/>\nIt has all the great features you mention. Only downside is the +1/5- falls off late pre-epic, but by then one gets stoneskin :). <br/>\nOh yes the immunity to lvl 1 spells is fabulous against spells like grease and magic missile. <br/>\nWith the amount of information, the pictures are essential to break up the text a bit!</div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "12:53 PM - Jun 25, 2020",
      "content": "<div>Hail Orion!<br/>\nAn amazing contribution to the guild and community! To be commended!</div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "8:24 PM - Jun 25, 2020",
      "content": "<div>Thank you Orion for this addition! Only issue with guides is that they are very long to read eheh, but seeing the glass half-full this is a great contribution!</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:14 PM - Jun 25, 2020",
      "content": "<div>Thanks Ten Pura and Aquarius!<br/>\nI tried my best to make it as concise as possible<br/>\nI will try to make it even more concise but without sacrificing comprehensiveness too much</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:46 PM - Jun 27, 2020",
      "content": "<div><strong><span style=\"font-size:150%;line-height:normal\">Area of effect spell strategies</span></strong><br/>\nArea of effect (AoE) spells are cast on the environment or enemies to have detrimental effects. <br/>\n<br/>\nThis includes:<br/>\n- dealing damage, physical and elemental <br/>\n- mind affecting<br/>\n- slows, knockdowns, other disables<br/>\n- reducing saves or attributes<br/>\n- save or die rolls<br/>\n- a mixture of the above<br/>\n<br/>\nThey are instantaneous or short duration. They can have a cone of effect, a line of effect, a wall of effect, a circular or cloud area of effect. Some spells have saving throws to reduce damage, others do not and are called \"No DC\" spells. All damage spells that require saves will be assumed to be reflex saves. Therefore evasion and improved evasion are a significant counters to these spells, unless written otherwise. <br/>\n<br/>\nThey are excellent against 'mobs of enemies'. When one faces a large number of enemies, AoE spells should be considered. If uncertain, party friendly spells to begin with. If one is sure they can be safe, then non-party friendly spells can be used.<br/>\n<br/>\nI have made a significant effort to make this shorter.<br/>\n<br/>\n<strong>Cones</strong><br/>\n- Burning hands (max 5d4 fire reflex 1/2)<br/>\n- Color spray<br/>\n- Mestil's acid breath (max 10d6 acid reflex 1/2)<br/>\n- Cone of cold (max 15d6 cold reflex 1/2)<br/>\n- Prismatic spray<br/>\n<br/>\nThese are all instantaneous, and affect a small cone 10-11 meters in size in front of the caster. Due to the short range, care must be exercised in casting these spells. Color spray is level 1 spell with a 1d4+1 duration stun that scales well into late levels against mind vulnerable opponents. Other spells I have found have limited usefulness due to the short range placing the caster in danger. They are not party friendly.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_b428c6321edd7b81b2178331132f4f1b_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">Color spray cast by an enemy Kobold Shaman, stunning my teammate. World of Greyhawk Persistent World Server.</span><br/>\n<br/>\n<strong>Line of effect</strong><br/>\n- Lightning bolt (max 10d6 electrical reflex 1/2)<br/>\n- Chain lightning (max 20d6 initial target / 10d6 other target electrical, enemies only, reflex 1/2 max 40 targets)<br/>\n<br/>\nThese are all instantaneous electrical spells which can affect multiple targets. Lightning bolt, level 3 will also affect allies. Chain lightning, a level 6 spell might be an alternative to Firebrand against fire resistant or immune enemies.<br/>\n<br/>\n<strong>Wall of effect</strong><br/>\n- Wall of fire (4d6 fire 1 round / 2 lvls reflex 1/2)<br/>\n<br/>\nThis wall lasts for a reasonable time, however the damage is low compared with other spells. I think there are better spells. <br/>\n<br/>\n<strong>Circular instant damaging spells</strong><br/>\n- Gedlee's electric loop (max 5d6 electrical, chance to stun 1 round reflex 1/2)<br/>\n- Fireball (max 10d6 fire reflex 1/2)<br/>\n- Scintillating sphere (max 10d6 electrical reflex 1/2)<br/>\n- Negative energy burst (max 1d8 +20 negative will 1/2, max -10 str no save)<br/>\n- Ice storm (max 3d6 bludgeon 15d6 cold no save)<br/>\n- Firebrand (max 15d6 fire, max 40 targets reflex 1/2)<br/>\n- Delayed blast fireball (max 20d6 fire reflex 1/2)<br/>\n- Horrid wilting (max 25d8 magical, fort 1/2)<br/>\n- Sunburst (max 25d6 magical against undead enemies 6d6 magical non undead enemies, reflex 1/2, reflex blindness)<br/>\n- Meteor swarm (20d6 fire, 2m safe zone around caster reflex 1/2)<br/>\n<br/>\nThere is a long list of spells here. Firebrand and Sunburst will only affect enemies which is good in parties. Sunburst is excellent against undead, but is also useful against non-undead as it can blind enemies. Horrid wilting will not affect the caster, but will affect other allies, and magic damage is less frequently resisted. Ice storm has no saving throw but can damage the caster. Sunburst, Horrid wilting, Ice storm, Firebrand and Negative energy burst (no save strength damage) scale well into later levels. <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Negative_energy_burst\" rel=\"noreferrer\" target=\"_blank\">Negative energy burst</a> may heal and increase the strength of undead allies with the appropriate setting (D&amp;D hardcore or higher, Full PvP).<br/>\n<br/>\nOther spells listed can be useful at the time of obtaining them, apart from possibly Meteor Swarm, which for a level 9 spell seems to not do enough damage compared with alternatives. One could, for example, cast empowered firebrand for 22d6 fire damage which is party friendly as a level 7 spell.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_bcc0f633665fa53cdca646a7debb992d_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">I cast Sunburst on this group of undead, dealing substantial damage, and blinding them. Castle Hart, World of Greyhawk Persistent World.</span><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_42babbb5b9ed7413947683d5783b8b9a_t.jpg\"/><br/>\n<span style=\"font-size:75%;line-height:normal\">I also cast sunburst on these enemies, dealing much less damage, however they are blinded and will have difficulty hitting me. Lair of the Manscorpion King, World of Greyhawk Persistent World Server.</span><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_ea002aab9c2f96f1d692755555412225_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">I cast a standard firebrand afterwards to deal damage while they struggle to hit me. A Horrid Wilting spell would have been good too but I am saving spells in this rest restricted environment.</span><br/>\n<br/>\nIssac's Lesser Missile Storm, Issac's Greater Missile Storm and Ball Lightning I have classified as single target (as this is the ideal usage) and will cover that with single target spells.<br/>\n<br/>\n<strong>AoE instant death spells</strong><br/>\n- Dismissal (will +6 or die, unsummon BBoD)<br/>\n- Circle of death (fort or die, only less than 9 hit die enemies)<br/>\n- Undead to death (undead only, will save or divine damage = current HP, max 20d4 hit die)<br/>\n- Banishment (will or caster level x2 hit die summons/familiars/companions/outsiders destroyed)<br/>\n- Weird (will or 3d6 magic damage, if will fails fort or die, automatic death for enemies with less than 4 hit die)<br/>\n- Wail of the Banshee (fort or die)<br/>\n<br/>\nDismissal is a nice spell which has a +6 DC bonus and can unsummon Black Blades of Disaster. The wiki states friendly summons will also be unsummoned. Banishment I think can be helpful but Dismissal looks better. The <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Talk:Banishment\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki: Talk section</a> has some discussion on whether these spells affect polymorphed players (ie Wild Shape'd Druid/Shifters)<br/>\n<br/>\nUndead to death is an excellent AoE spell which only affects undead as described. It deals divine damage equal to the undead's current hit points to slay them. Divine damage resistance or immunity can reduce damage. The maximized version does not cap caster level, allowing this spell to slay up to 160 hit die of undead. <br/>\n<br/>\nWail of the Banshee is a level 9 huge AoE spell which only targets enemies and I consider one of the best spells for DC casters. Death magic immunity will protect against Wail. <br/>\n<br/>\nWeird, a level 9 AoE spell requires two saves to succeed. It will work against death magic immune opponents but not mind immune opponents.<br/>\n<br/>\nCircle of death, a level 6 spell, will only affect enemies with 8 hit die or less, limiting its usefulness.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_6acbd317c1739b9b298b0894bd112eec_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">Wail of the Banshee, cast by my Sorceress Ananie, during a Monday Night Crew Party, World of Greyhawk Persistent World Server</span><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202006/10759084_ca8a0b285935b89fe6d7d122953e1d85_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">MrZork casting Wail of the Banshee with his Wizard, Gnolem, on the World of Greyhawk Persistent World Server</span><br/>\n<br/>\n<strong>Other circular instant spells</strong><br/>\n- Sleep (will sleep)<br/>\n- Balagarn's iron horn (20 str check 1 round knockdown)<br/>\n- Gust of wind (fort 3 round knockdown remove clouds)<br/>\n- Slow (will 50% movement -1APR enemies only max 40 creatures)<br/>\n- Confusion (will confusion)<br/>\n- Fear (will fear, necromancy)<br/>\n- Great thunderclap (will stun 1 round fort deafen 1 min reflex knockdown 6 seconds)<br/>\n- Mass blindness/deafness (fort blind and deaf)<br/>\n- Mass charm (will +50% reputation humanoids up to 79 hit die)<br/>\n<br/>\nMass blindness/deafness, fear, slow, confusion I think are great spells that scale well. Sleep is a powerful low level spell. Coup de grace is applied to sleeping opponents, leading to instant death. It will not affect creatures with 5 or more hit die. Sleep wands are also very useful. It is not party friendly, however elves and half-elves are immune to sleep, allowing them to use these wands with impunity. Gust of wind can knockdown creatures for 3 rounds and remove certain cloud effects (ie stinking cloud) and might be situationally useful.<br/>\n<br/>\nLesser dispel, dispel magic, greater dispelling and Mordenkainen's disjunction can be cast as an AoE spell, but I will cover that with single target spells. <br/>\n<br/>\n<strong>AoE damage duration effects</strong><br/>\n- Evard's black tentacles (max 20 targets, bludgeoning 1d4+4 grapple check, fort paralysis, small creatures immune, no spell resistance)<br/>\n- Cloudkill (slow and 1d10 acid 7+ hit die, fort death 4-6 hit die, death 1-3 hit die)<br/>\n- Acid Fog (4d6 acid initial, 2d6 acid every round, fort slow)<br/>\n- Incendiary cloud (4d6 fire reflex 1/2)<br/>\n<br/>\nEvard's is nice to put on a wand as the DC check doesn't affect damage and there are no spell penetration checks. I think multiple Evard's stack on each other, although have not found any references to this. Damage resistance and reduction can reduce its usefulness (ie the Ethereal Visage buff or Monk 20+ with +1 soak 20 will resist damage). I haven't used the others a lot. Cloudkill and Acid fog look useful as with no save for damage. I think incendiary cloud can be dodged with evasion, I have not found it particularly satisfying to use for a level 8 spell.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_913c3bab88f446a0aab5c9d82ad80295_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">Here my sorceress Lumina is in a party with Neon-Maniac's Rulir, a Fighter/Bard/RDD longsword and shield warrior. Lumina is lawful good alignment. </span><br/>\n<span style=\"font-size:75%;line-height:normal\">I cast protection versus alignment (good) on both myself and Rulir, to make us mind immune against good spell casters. </span><br/>\n<span style=\"font-size:75%;line-height:normal\">We position ourselves at a choke point. I cast summon VII (which becomes Summon VIII with Cleric's animal domain empowered summons) to assist Rulir, </span><br/>\n<span style=\"font-size:75%;line-height:normal\">I cast Stinking Cloud when we get mobbed by a horde of Bugbear warriors. </span><br/>\n<span style=\"font-size:75%;line-height:normal\">We are immune to the daze effects but the bugbears are not, and we fight them at a substantial advantage, as they have to make a fort save every round or be dazed.</span><br/>\n<span style=\"font-size:75%;line-height:normal\">We also have ultravision, and I can also cast Darkness to make the enemies unable to see us, however with the choke point, this was not necessary.</span><br/>\n<span style=\"font-size:75%;line-height:normal\">Ghost Tower of Inverness quest, World of Greyhawk Persistent World Server</span><br/>\n<br/>\n<strong>AoE non-damage duration effects</strong><br/>\n- Grease (reflex slow initial, reflex knockdown every 6 seconds)<br/>\n- Darkness / Shadow conjuration: Darkness (no save)<br/>\n- Web (slow without freedom, reflex entangle)<br/>\n- Stinking cloud (fort dazed)<br/>\n- Mind Fog (will -10 will)<br/>\n<br/>\nGrease is a handy level 1 spell, potential knockdown every 6 seconds in an AoE, spell resistant enemies still have to make these saves or get knocked down. Darkness and Shadow Conjuration: Darkness are very useful spells when combined with ultravision, enemies cannot target you with ranged attacks or spells without ultravision, enemies may have reduced AC and also have an attacker miss chance as well. Darkness can be cast without arcane failure in armor. Web, stinking cloud and mind fog I believe are good spells, however I have not used them a lot. Stinking cloud I think is interesting, as protection against alignment can protect the caster and allies against the mind affecting effects. <br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Putting it together</span></strong><br/>\nDesigning an AoE spellbook depends on:<br/>\n- the caster (DC or non-DC)<br/>\n- the situation (general or specific)<br/>\n<br/>\nI have designed a few sample spellbooks for different situations. They cover AoE spells only, single target focused spells (such as Mord's, IGMS) will be covered in a different section. Other experienced spellcaster players may have different spellbooks for AoE spells, these are just my preferences. <br/>\n<br/>\n<strong>DC caster standard AoE spellbook </strong><br/>\nA mixture of crowd control, different damage types and instant death is ideal for DC spell casters.<br/>\n<br/>\n9 - Wail of the Banshee<br/>\n8 - Horrid Wilting (magical), Mass Blindness/Deafness<br/>\n7 - Emp Firebrand (fire), Max Ice Storm (phy/ice), Delayed blast fireball (fire)<br/>\n6 - Emp Evards (phy), Chain Lightning (electrical), Emp Ice Storm, Undead to Death (undead)<br/>\n5 - Firebrand, Cloudkill (acid), Dismissal<br/>\n4 - Evard's, Fear<br/>\n3 - Negative Energy Burst (negative), Slow, Stinking Cloud<br/>\n2 - Darkness, Ext Grease<br/>\n1 - Color Spray, Grease<br/>\n<br/>\n<strong>DC caster party friendly AoE spellbook </strong><br/>\nThis is when one does not wish to injure teammates but cast AoE spells freely<br/>\n<br/>\n9 - Wail of the Banshee<br/>\n8 - Mass Blindness/Deafness, Max Firebrand, Emp Chain Lightning, Sunburst (undead)<br/>\n7 - Emp Firebrand<br/>\n6 - Chain Lightning, Undead to Death (undead)<br/>\n5 - Firebrand<br/>\n4 - Evard's (only in situations), Fear (with protections)<br/>\n3 - Slow, Stinking Cloud (with protections)<br/>\n2 - Darkness (with buffs), Ext Grease (with knockdown immunity)<br/>\n1 - Color Spray (with buffs), Grease (with knockdown immunity)<br/>\n<br/>\n<strong>No DC caster AoE Spellbook</strong><br/>\nThis is for casters who have a low primary casting stat (ie Int/Cha 19 or 20, commonly spellswords or arcane con-focused tanks). There are empty spell levels with less variety of spells, these can be filled with buffs, summons and single target spells (ie Mords/Bigbys/IGMS). <br/>\n<br/>\n9 - None<br/>\n8 - None, or maybe Sunburst (undead only, without evasion) <br/>\n7 - Max Ice Storm, Max Evards<br/>\n6 - Emp Ice Storm, Emp Evards<br/>\n5 - Silent Ice Storm, Sil/Ext Evards<br/>\n4 - Ice Storm, Evards<br/>\n3 - Negative Energy Burst (strength), Sil/Ext Darkness<br/>\n2 - Darkness<br/>\n1 - None<br/>\n<br/>\nI plan to write about single targeted spells in a future post.<br/>\n<br/>\n<strong>Edit: </strong>Added some screenshots of Sunburst and Firebrand</div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "10:36 PM - Jun 27, 2020",
      "content": "<div>Forgot to mention a combo used with a sorcerer spellsword against bosses, that can heal themselves and have a high spell resistance. This is a \"melee version\" of the time stop + IGMS combo, I write it here in the hope that can be of interest for someone:<br/>\n1) hit enemy until they are in \"Near dead\" status; if Tenser's transformation is active, don't hit him/her anymore and avoid enemy until Tenser's wears off;<br/>\n2) before proceeding to next steps, make sure that haste is active and so divine might (if applicable);<br/>\n3) cast time stop, then (if the AB is not enough to continuously hit the enemy) true strike, then attack him/her 3 or 4 times (depending on your \"attack per round\" parameter);<br/>\n4) repeat step 3 until boss is dead: in the meanwhile, cast haste/activate divine might if it wears off.<br/>\n<br/>\nIf timing is good, enemy will die before healing himself/herself.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:19 AM - Jun 28, 2020",
      "content": "<div>Thanks Aquarius for sharing the Time Stop / True Strike combo!<br/>\nI have added it into the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/wizard-and-sorcerer-spellcasting-strategies-t2355313.html#p21025\" rel=\"noreferrer\" target=\"_blank\">Wizard and Sorcerer Buffs post</a></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:55 PM - Jul 06, 2020",
      "content": "<div><strong><span style=\"font-size:150%;line-height:normal\">Single target focused spells</span></strong><br/>\n<br/>\nThese spells:<br/>\n- do damage or cause death<br/>\n- disable, reduce enemy defenses or abilities<br/>\n<br/>\nThese are best against bosses or other vital targets.<br/>\n<br/>\n<strong>Magic Missile (MM), Issac's Lesser Missile Storm (ILMS) and Issac's Greater Missile Storm (IGMS)</strong><br/>\nThese are powerful spells that can be combined with metamagic (silent, empower, maximize) for additional spells/day. Spell slots 1-9 could subsequently be filled with versions of each of these three spells. Magic damage is rarely resisted, although certain spells provide immunity to magic missile (ie Shield, Ghostly Visage) and immunity to ILMS (ie Globes of Invulnerability). ILMS can be put on a wand. ILMS and IGMS are most effective when used against a single target. When there are multiple enemies, the missiles spread out the missiles and damage amongst the targets, which is not ideal. Maximized IGMS (caster level 20+) does 240 magic damage, Empowered IGMS (20+) average 220 magic damage, when hasted two spells / round can be cast, so dealing 450 damage / round to a single target is very significant. These spells do not have saving throws for half damage. Spell penetration checks will still apply. Casting Mord's or a Breach to lower spell resistance can be helpful. <br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_c5a1ff9571b4ef8f3010cfb704157620_t.jpg\"/><br/>\n<span style=\"font-size:75%;line-height:normal\">Magic missile. The maximum number of missiles is 5 with caster level 9+. World of Greyhawk Persistent World Server.</span><br/>\n<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_ff9846c29154dbb991b9411f3eeddabc_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">Grom (Milo the Mage) and myself (Ananie) using ILMS wands against archers shooting at us in a fortress in the Shield Lands, World of Greyhawk Persistent World Server.</span><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_30f678e46eaa30b4c5903995a5f3b287_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">IGMS cast by MrZork (Lyrum). All 15 missiles (IGMS is weakened to maximum 15 missiles in this environment) will hit the only enemy target, a powerful boss called Shattados the Cruel, on the World of Greyhawk Persistent World Server</span><br/>\n<br/>\n<br/>\n<strong>Flame arrow</strong><br/>\nThis spell deals fire damage, a 4d6+1 fire arrow (hidden +1 damage, according to the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Flame_arrow\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki</a>), with one extra arrow every 4 caster levels. At caster level 40 it can do slightly more damage than IGMS (40d6+10) but overall the spell is weaker than IGMS as fire resistant enemies are more common, there is a reflex save for half damage (or no damage if enemies have evasion) and peak damage for flame arrow is obtained with 40 caster levels as opposed to IGMS's 20. On the plus side, flame arrow uses lower spell levels compared with IGMS (ie level 3 versus IGMS's level 6) and is very good at removing spell mantles, with each arrow counting as a level 3 spell. As a result between 3 to 30 spell levels can be removed from a spell mantle with a flame arrow spell. IGMS will only remove 6 spell levels.<br/>\n<br/>\n<strong>Finger of death / Phantasmal killer</strong><br/>\nFinger of death forces an enemy to make a fortitude save or die. For those with Necromancy spell foci this can be a useful spell against low fortitude save enemies without death magic immunity ie rogues, bards, arcane spellcasters. When the spell works it is incredible, but when it fails it feels rather dismal.<br/>\n<br/>\nPhantasmal killer forces a will save and if successful, a fortitude save or die. For those with Illusion spell foci, this can be valuable against enemies without fear or mind immunity and weak will and fortitude saves (rogues, assassins). Death magic immunity is not protective against this spell, only mind or fear immunity. <br/>\n<br/>\n<strong>Melf's Acid Arrow</strong><br/>\nThis does 3d6 acid damage, plus 1d6 per round up to 13 rounds with 39 CLs, with no save for half. It can be useful against low level casters to interrupt concentration checks, however at higher levels other spells are more attractive.<br/>\n<br/>\n<strong>Other damage spells</strong><br/>\nThere are other spells such as Combust, Ball Lightning, Ray of Frost, which can be situationally useful.<br/>\n<br/>\n<strong>Bigby's 5-9</strong><br/>\nAll Bigby's spells are valuable. <br/>\n<br/>\nBigby's 6 (forceful hand) is probably the best bigby spell against enemies without knockdown immunity. It has a very difficult strength check, which if the enemy fails, the enemy will be knocked down for 1 round / level. Because of how difficult the strength check is, this spell is useful against nearly any enemy without knockdown immunity. Some exceptions might be very high strength huge sized dragons and giants, but often it is worth a try even against these enemies. A knocked down difficult opponent for 11-80 rounds (depending on CL and extend spell) makes combat much easier, even if 5 Bigby's 6 spells are needed to be cast to succeed, against some enemies this is very very much worth it. High AC does not protect against Bigby's 6, unlike Bigby's 7. There is a spell penetration check.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_aa28b5be574886ec6dc806940a92e0bb.jpg\"/><span style=\"font-size:75%;line-height:normal\">Grom (Milo the Mage) casting a Bigby's hand spell (blue arrow) against a troublesome archer in the Shield Lands, World of Greyhawk Persistent World</span><br/>\n<blockquote><div><strong>Bigby's Forceful Hand (Bigby's 6) Strength Check:</strong><br/>\n- caster rolls 1d20 + 14 versus the target's roll of 1d20 + target's strength modifier + target's size modifier<br/>\n- if the caster's roll is equal or greater than the target's roll, then the knockdown is successful for 1 round / caster level (source: <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Talk:Bigby%27s_forceful_hand\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki, Talk: Bigby's 6</a>)<br/>\n- if my math is correct, a medium sized enemy would need 40 strength (mod 15) for a 50% chance to resist the strength check and 80 strength (mod 35) to always resist the strength check</div></blockquote>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_883d74f37da98d31239a1f12aa8dcb41_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">Bigby's 6. This nasty mage boss killed two of my teammates, but has been knocked to the ground for 1 round / caster level by my sorceress Yldrorth! World of Greyhawk Persistent World Server.</span><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_aa3943cd619d3c68d4205baf2cd1c8c5_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">This powerful dragon has the potential to devastate my party. </span><br/>\n<span style=\"font-size:75%;line-height:normal\">To the right, Lormo (MrZork), an elven arcane archer has had his buffs dispelled and is afflicted with fear, and is unable to fight.</span><br/>\n<span style=\"font-size:75%;line-height:normal\">I fortunately had scribed a large number of Bigby 6 scrolls with the scribe scroll feat. I had approximately 15 in my pack. </span><br/>\n<span style=\"font-size:75%;line-height:normal\">The dragon has innate resistance to Bigby's 6, with a very high strength score, and huge size making the strength check difficult.</span><br/>\n<span style=\"font-size:75%;line-height:normal\">Despite this, on my 5th or 6th attempt, the Dragon failed the strength check, and is disabled for 15 rounds.</span><br/>\n<span style=\"font-size:75%;line-height:normal\">The Great Dragon is now at the mercy of our party, and the tide of battle turned greatly in our favor.</span><br/>\n<span style=\"font-size:75%;line-height:normal\">Our party of 5 leave the battle and complete the quest, victorious.</span><br/>\n<span style=\"font-size:75%;line-height:normal\">World of Greyhawk Persistent World Server.</span><br/>\n<br/>\n<br/>\nBigby's 7 (grasping hand) and Bigby's 9 (crushing hand) has a grasping effect that no enemy can be immune to. The spell has to succeed with an AC check to see if it hits, then a grapple check against strength, BAB and size. If the grasping check succeeds there is no way to remove the effect apart from dispels or Mords spells. It can also paralyse the opponent which enemies can be immune to with mind or paralysis immunity. Enemies can still attack when grasped provided they are not paralysed, but they cannot move. Bigby's 9 additionally has a +2 attack roll, and will deal 2d6+12 bludgeoning damage / round, one round / level, which can be quite substantial if the enemy does not have damage soak or bludgeoning resistance.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_41fa9888456b650cd1c1fc89c0b5e0bb_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">This powerful melee combatant has been grappled by Bigby's 7. He is immune to paralysis however there is no immunity to the grapple effect. </span><br/>\n<span style=\"font-size:75%;line-height:normal\">He cannot damage me as long as I stay out of melee range. I am using a wand of ILMS to damage him.</span><br/>\n<span style=\"font-size:75%;line-height:normal\">Tomb of Shattados, World of Greyhawk Persistent World Server.</span><br/>\n<br/>\nBigby's 5 reduces enemy AB by 10, which is useful however it can be removed by lesser restore (including lesser restoration potions). Bigby's 8 (stun and damage) is also good as it only uses a AC check. <br/>\n<br/>\n<strong>Mordenkainen's Disjunction </strong><br/>\nThis spell, along with Bigby's 6 and IGMS, is very much an essential part of a spellcasters kit. It has a breach effect which can remove up to 6 enemy defenses listed under breach effect (ie Mestil's Acid sheath, premonition) which removes effects regardless of the defenders caster level. It has a dispel check of 1d20 plus CL against 12 plus defender caster level for non breachable spells. It also lowers spell resistance by 10 for 10 rounds for non Monks. It can also be cast as an area of effect spell.<br/>\n<br/>\n<strong>Greater Spell Breach and Lesser Spell Breach</strong><br/>\nThese valuable spells remove four and two breachable defenses respectively, and lower spell resistance by 5 and 3 against non-Monks. Lesser spell breach can be put on a wand.<br/>\n<br/>\n<strong>Greater Dispelling, Dispel magic, Lesser dispel</strong><br/>\nThese are situationally useful. Some effects are easily dispelled, as they will always have an effective caster level of 0, such as the silence effect. Lesser dispel can be cast whilst silenced as there is no verbal component. Greater Dispelling can be used in an area of effect version to remove area of effect clouds. Due to the hidden <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Dispel\" rel=\"noreferrer\" target=\"_blank\">dispel mechanics</a>, arcane casters have substantial advantages removing area of effect clouds cast by divine spellcasters such as SoV and Stonehold, as dispel checks use the charisma ability modifier, unless the character is a wizard (then it uses intelligence). <br/>\n<br/>\n<strong>Flesh to stone </strong><br/>\nThis is one of the most powerful disables in the game for which there are no immunities against. This can essentially permanently disable any opponent at moderate range, if the enemy fails a fortitude save. <br/>\n<br/>\n<strong>Other disables</strong><br/>\nIn challenging PvM environments, dominate monster and control undead can be powerful spells. If an enemy monster has 500+ HP and the caster dominates it, then the spell caster has a 500+ HP summon for the duration. Be careful when the spell wears off... Dominate monster when used in PvP against players causes a daze effect.<br/>\n<br/>\nDominate person, Hold person, Hold Monster, Tasha's, Daze and Ray of Enfeeblement can be valuable spells in certain situations.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_51fd6ea94db8e9237c5763157a2a5abc_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">This hydra has a poor will save and is not mind immune or immune to paralysis. </span><br/>\n<span style=\"font-size:75%;line-height:normal\">I have cast Hold Monster (lvl 5, 1 round/lvl) and defeat the hydra with my Dire Bear summon and my longsword.</span><br/>\n<span style=\"font-size:75%;line-height:normal\">Ruins of Castle Inverness, World of Greyhawk Persistent World</span><br/>\n<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_076e89dcb31a4848638da3f3fc3502c5_t.jpg\"/><span style=\"font-size:75%;line-height:normal\">These Fire Giants deal a lot of damage, however they are not mind immune, and have low armor class. I disable both of them, and hit them with a flame weapon'ed longsword.</span><br/>\n<span style=\"font-size:75%;line-height:normal\">Fire Elemental Node (ToEE), World of Greyhawk Persistent World Server</span><br/>\n<br/>\n<strong>Uninterrupted spellcasting - keep the enemy busy</strong><br/>\nThe ideal situation is to cast these spells uninterrupted by melee combatants, ranged enemies and enemy mages. There are various useful strategies for allow one to continue casting uninterrupted.<br/>\n<br/>\n<em>Party and summons</em><br/>\n- party members (ie. a melee fighter draw aggression in PvM)<br/>\n- summon creature I-IX, animate dead, epic summons <br/>\n- familiars (only at low levels)<br/>\n<br/>\n<em>Disables</em><br/>\n- Bigby's 6 to 9, Flesh to Stone<br/>\n<br/>\n<em>Speed</em><br/>\n- expeditious retreat, haste, mass haste spell (so you are always able to move faster and run far from enemies), potentially unlocking the speed cap with monk speed (obtained with 3 levels of Monk, see <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/speed-caster-sorceror-36-monk-3-paladin-1-t515365.html\" rel=\"noreferrer\" target=\"_blank\">WhiZard's Speed Caster</a> and <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/evil-speed-caster-sorc-35-monk-3-bg-2-t2319013.html\" rel=\"noreferrer\" target=\"_blank\">Mick Dagger's Evil Speed Caster</a>)<br/>\n<br/>\n<em>Slow</em><br/>\n- tangle traps (and other traps)<br/>\n- slow spell <br/>\n<br/>\n<em>Become unseen</em><br/>\n- invisibility <br/>\n- greater sanctuary <br/>\n- hide in plain sight (from a level of Shadowdancer)<br/>\n<br/>\n<em>Stop them seeing</em><br/>\n- darkness / ultravision <br/>\n- mass blindness/deafness<br/>\n<br/>\n<em>Addle their mind</em><br/>\n- mind affecting abilities such as daze, sleep, stinking cloud, fear, confusion<br/>\n<br/>\n<em>Succeed with concentration checks</em><br/>\n- reduce damage with being stoneskin/premonition, prot v elements/energy buffer, epic warding, palemaster 10 crit/sneak immunity, epic damage reduction III<br/>\n- skill boosts to concentration (ie epic skill focus: concentration)<br/>\n- reduce being hit through improved invisibility, displacement, mage armor / epic mage armor etc...<br/>\n<br/>\n<em>Control time and do what you want</em><br/>\n- (extended) haste, then<br/>\n- time stop, spell 1, spell 2, time stop, spell 1, spell 2, etc...<br/>\n- see gameplay videos for more details</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:30 PM - Jul 06, 2020",
      "content": "<div>What we have here is the caster guide I always wanted and never found time to write. The topic is huge. It shows that you have gathered some experience playing casters.<br/>\nThere are still chapters to cover, among them the use of meta magic, choice of spell schools, DC casting and spell choice vs different kind of enemies. <br/>\nBut that does not lessen the fact that this guide is great and offers a lot of useful info.<br/>\nIf I should add something, it would be the use of Time Stop to control the field. Imo it belongs somewhere in your last paragraph.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:58 PM - Jul 06, 2020",
      "content": "<div>Timestop+[insert spell here]+rinse, repeat= I win button.<br/>\n<br/>\nIt's the cheesiest.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:56 AM - Jul 07, 2020",
      "content": "<div>Thanks for the comments, particularly Mick's suggestions on further chapters, I had not considered these, but each suggested chapter has a lot of merit to discuss :)</div>"
    },
    {
      "author": "rogueking",
      "avatar": "no_avatar.png",
      "timestamp": "10:49 PM - Jul 07, 2020",
      "content": "<div><blockquote><div>On the plus side, flame arrow uses lower spell levels compared with IGMS (ie level 3 versus IGMS's level 6) and is very good at removing spell mantles, with<strong> each arrow counting as a level 3 spell</strong>. As a result between 3 to 30 spell levels can be removed from a spell mantle with a flame arrow spell. IGMS will only remove 6 spell levels.</div></blockquote>\nWHAT?!!! I have been playing this game since it first came out and I had no clue about that.  Today I just got learnt, and I have a new trick for those damn epic wizards.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:56 PM - Jul 07, 2020",
      "content": "<div>Just use a Wand of Lesser Breach.<br/>\n<br/>\nBlows all sorts of things off spellcasters.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:44 AM - Jul 08, 2020",
      "content": "<div>Greetings and welcome Rogueking! I can see this is your first post! <br/>\nThanks for the feedback. It's good to know the work I do on these guides has a positive impact.<br/>\n<br/>\nWith the mantles, it can be a useful strategy to spam flame arrow at times rather than other spells to damage mages, they also rarely have evasion, plus the mantle might get shredded and the mage receives the damage from the leftover arrows. With haste, this could be 6 to 60 spell levels removed from the mantle from two flame arrow spells / round. There are other weaknesses to flame arrow as mentioned in the text. Zombie Lords (the ones wielding Kamas) also use mantles as well.<br/>\n<br/>\nAs Web has mentioned wands of lesser spell breach are one of the most useful tools for persistent worlds. 20-50 charges, remove 2 defenses, no spell resistance check, no chance of failure, lower spell resistance by 3, this is one of the best tools available, especially for UMD users. I have used a wand of LSB recently during a party run yesterday, and it helped to lower spell resistance fighting some dragons so more of my missiles from my wand of ILMS would hit!<br/>\n<br/>\nThere are some downsides. Experience is used to craft wands, so a single player module user will not want to make these or take the craft wand feat. A non rest restricted environment also makes craft wand less attractive. More minor points are LSB is a lvl 4 spell. A sorcerer may not memorize LSB as there are so many great lvl 4 spells to choose from and choose to take Mord's instead. Wands can only be used once per round, so if a player is hasted, that will use up all the actions in the round (ordinarily it is 2 spells / round when hasted).<br/>\n<br/>\nOverall I think flame arrow is a useful alternative to remove mantles and a useful spell overall, why I put it in the post after IGMS in the damage spell section. Flame arrow has significant weaknesses but the mantle shredding puts the spell higher up in value compared with some other single target damage spells.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "12:38 PM - Jul 08, 2020",
      "content": "<div>RE: Flame Arrow      It's also really nice against critters that are extra susceptible to fire damage...  like Mummies....   more bang for the buck compared to a fireball...</div>"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "3:28 PM - Jul 09, 2020",
      "content": "<div><blockquote><div><cite>rogueking wrote: <div class=\"responsive-hide\">Jul 07, 2020</div></cite><blockquote><div>On the plus side, flame arrow uses lower spell levels compared with IGMS (ie level 3 versus IGMS's level 6) and is very good at removing spell mantles, with<strong> each arrow counting as a level 3 spell</strong>. As a result between 3 to 30 spell levels can be removed from a spell mantle with a flame arrow spell. IGMS will only remove 6 spell levels.</div></blockquote>\nWHAT?!!! I have been playing this game since it first came out and I had no clue about that.  Today I just got learnt, and I have a new trick for those damn epic wizards.</div></blockquote>\nIf a spell mantle absorbed 24 spell levels from a casting of flame arrow with an equivalent of 30 spells, do the excess arrows deal damage?</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:30 PM - Jul 09, 2020",
      "content": "<div>I believe that is the case, because the mantle is gone when the excess arrows hit, but I haven't tested it.</div>"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "1:43 PM - Jul 12, 2020",
      "content": "<div>Another question, is there any good strategy for a solo pure mage against a demilich? Aside from, maybe casting BBoD? Btw, this creature is also able to cast Mord’s, Harm, even summon its own BBoD.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:41 PM - Jul 12, 2020",
      "content": "<div>It is a difficult opponent. Having a look at the creatures stats in the Wiki (<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Demilich\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Demilich</a>), it is immune to cold and electric, has +20 soak 30, and acid/fire/sonic reduction 20/-.<br/>\nI have defeated such creature using Mestil's Acid Sheath and Death Armor, along with huge RDD strength with a two handed with Sword of the Dracolich (Sorc 20 / RDD 10 / PM 10).<br/>\nIt says it is immune to all spells except epic spells, so perhaps summons and damage shields would be the answer.<br/>\nHappy for others to give suggestions.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:59 PM - Jul 12, 2020",
      "content": "<div>If you have Greater Ruin, you might be able to nail it with this dead, one shot.  35d6 vs 145.  GR doesn't miss, and the save is Fort, which is the Demilich's bad save.<br/>\n<br/>\nIt's also not immune to Time Stop.<br/>\n<br/>\nSo I would go in fully buffed (of course) in GS (Greater Sanctuary), cast GR, if not dead, Time Stop - Greater Sanctuary - Time Stop - BBoD - Haste (on BBoD, but only if you are Hasted, of course) and let the BBoD whack it.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:29 PM - Jul 13, 2020",
      "content": "<div>After reading darktooth question and Web's response I decided to visit a Demi-Lich on WoG.<br/>\nMy Sorcereress Lumina is a Sorc 20 / Cleric 1 (Animal Domain and Divine Shield) / Paladin 1 (For great saves, martial weapon prof)<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202007/10759084_5c7d5f8820de8534ba7683c545b57492_t.jpg\"/>I was expecting a tough battle however anti-climatically the Demi-Lich died in 3-4 hits from my Water Elemental Princess (which is an empowered summon IX on WoG, not present in all environments). <br/>\nI might try again another time with a standard Summon IX and see how I go. </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:42 PM - Jul 13, 2020",
      "content": "<div>That Demi-Lich may be a Lesser Demi-Lich - <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Lesser_demilich\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Lesser_demilich</a><br/>\n<br/>\nThe DR of the Demi-Lich (30/+20) should absorb most if not all of the damage from the Water Elemental Princess,not to mention the spells that it can bring to bear.<br/>\n<br/>\nI have been wondering about Epic Warding combined with Iron Golem (and having 1 level of Monk) - does the Epic Warding act as it does with Dragon Shape from Druids, and make the claws of the Dragon be able to pierce +20 DR?  If so, Epic Warding, Iron Golem, and beat that thing down pretty easily (no DR, 145 HPs goes fast).</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:46 PM - Jul 13, 2020",
      "content": "<div>I think you may be right, it might be a lesser Demi-Lich, it died so fast I was disappointed, maybe it has been relabeled as a demi-lich for some reason.<br/>\nOr maybe Demi-Liches are nerfed on WoG. Or maybe I might have to visit the Demonweb Pits to meet a proper Demi-Lich perhaps?<br/>\nEasiest way to test it all out is to just use the toolset to make a Demi Lich and import whatever mage I have to fight it.<br/>\nUnsure about the EW / Shapechange (Iron Golem), never tested it.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:53 PM - Jul 13, 2020",
      "content": "<div>I checked the toolset - WoG has multiple versions of the Demi-Lich.<br/>\n<br/>\nThe Standard ones in the Toolset (of which one has the DR 30/+20 property on the Creature Skin) and all the others, which do not.<br/>\n<br/>\nAnd I am thinking that WoG may not have a version of the DR 30/+20 Demi-Lich - I certainly cannot remember ever running into a version of it.  Maybe somewhere in the gloomy depths of Undermountain...because the Demonweb version is not the DR 30/+20, neither are any other areas, of that I am sure.<br/>\n<br/>\nHaving the DR 30/+20 version, with total spell immunity, would certainly be a major challenge for just about any character on WoG. </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:07 PM - Jul 13, 2020",
      "content": "<div>The Water Elemental Princess, on the other hand, does 6d10+10 str damage per hit (the 6d10 is the creature slam on the \"fists\")<br/>\n<br/>\nThat would be a max of 70 a hit - so even with 30/+20 DR, a few hits is going to kill the Demi-Lich anyway.  Though on average, there is not going to be all that much damage dealt.<br/>\n<br/>\nStill, it is strange that the Demi-Lich did not self-harm itself.  Or did it?<br/>\n<br/>\nI'm convinced that it is a Lesser Demi-Lich (meaning not one of the 30/+20 DR versions, but a \"watered down\" WoG version as per the Toolset).</div>"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "7:14 AM - Jul 14, 2020",
      "content": "<div>Try the demilich in the PGCC. I believe that is the standard creature. In the playground, you can teleport to the undead area.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:04 AM - Jul 16, 2020",
      "content": "<div><span style=\"font-size:150%;line-height:normal\"><strong>Gameplay Videos</strong></span><br/>\n<br/>\nPictures and videos can say more than a thousand words. This is gameplay footage in NWN EE recorded with the Microsoft Game Bar. <br/>\n<br/>\n<strong>Time Stop / IGMS x2 Combos</strong><br/>\n<br/>\n<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/8j5BgGCZcGE\" style=\"background:url(https://i.ytimg.com/vi/8j5BgGCZcGE/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><br/>\n<br/>\n<span style=\"font-size:75%;line-height:normal\">This video shows gameplay footage from NWN: EE to demonstrate the Time Stop - Issac's Greater Missile Storm (IGMS) x2 Combo against a difficult boss, Emeraxis, on the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/\" rel=\"noreferrer\" target=\"_blank\">World of Greyhawk Persistent World Server</a> using a Level 28 Sorceress. </span><br/>\n<br/>\n<span style=\"font-size:75%;line-height:normal\">The character is hasted, to allow for two spells / round. The enemy has his spell resistance reduced by 10 with Mordenkainen's Disjunction which I have used on a scroll. Then it is simply a matter of cycling Time Stop - Empowered IGMS x2, Time Stop - Empowered IGMS x2 etc... until he is defeated or I run out of spells. </span><br/>\n<br/>\n<span style=\"font-size:75%;line-height:normal\">My sorceress has caster level 26, so I do not worry about Emeraxis's greater dispelling at the beginning, as this spell cannot dispel my buffs at caster level 25 or higher. Her buffs are Epic Mage Armor, Shadow Shield, Empowered Endurance, Empowered Bull's Strength, Flame Weapon, Ultravision, Protection versus Evil and Mage Armor.</span><br/>\n<br/>\n<br/>\n<br/>\n<strong>Time Stop / Area of Effect Combos</strong><br/>\n<br/>\n<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/_NRfWZELsy0\" style=\"background:url(https://i.ytimg.com/vi/_NRfWZELsy0/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><br/>\n<br/>\n<span style=\"font-size:75%;line-height:normal\">This is a video showing the usage of Time Stop combined with a number of area of effect spells, single target disable spells and single target damage spells. These spells are Sunburst, Horrid Wilting, Firebrand, Bigby's Forceful Hand and Issac's Greater Missile Storm. My sorceress is in the Mines of Azak-Zil on the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/\" rel=\"noreferrer\" target=\"_blank\">World of Greyhawk Persistent World Server</a>. </span><br/>\n<br/>\n<span style=\"font-size:75%;line-height:normal\">Haste is used at the beginning, which is very important, as this allows for two spells per round. My build has Divine Shield, so I use this to boost my AC up in case any of the enemies attack me. I have invisibility, allowing me to make the first move without being detected. </span><br/>\n<br/>\n<span style=\"font-size:75%;line-height:normal\">Sunburst is a very powerful spell against undead but is also useful against non-undead for it's ability to blind enemies, making combat safer if I didn't defeat them all. Horrid Wilting is a powerful magic damage spell which does not affect the spell caster but can affect allies and teammates. Firebrand is a powerful fire damage spell that will only target enemies. Bigby's Forceful Hand (or Bigby's 6) is one of the most useful and powerful single target disables in NWN against enemies who do not have both knockdown immunity and mind immunity. Issac's Greater Missile Storm is one of the most useful and powerful single target damage spells for Wizards and Sorcerers.</span><br/>\n<br/>\n<span style=\"font-size:75%;line-height:normal\">Wail of the Banshee is another very powerful level 9 spell that could be used here, however these enemies have a high fortitude save and I chose not to use this spell.</span></div>"
    },
    {
      "author": "The Flying Rodent",
      "avatar": "no_avatar.png",
      "timestamp": "2:27 AM - Jul 17, 2020",
      "content": "<div>Hey Orion! Spotted this guide on Reddit, looks pretty comprehensive! I imagine many hours have been spent looking at spell effects and testing out combinations of spells, and it looks great so far.<br/>\n<br/>\nAs Mick has stated too, there’s a lot more that could be added to the guide, and also some things that could be done in terms of formatting to make it both easier to write and to read.\u2028\u2028<br/>\n<br/>\nWithout 'hopefully' being too long winded, here’s some suggestions:\u2028\u2028<br/>\n<br/>\n<strong>Formatting\u2028\u2028</strong><br/>\n<br/>\nFirst off, it can really help to break things into broad sections, and then into finer sections, and use subheadings for particular topics. You’ve kinda already done this, but utilising formatting to a greater extent will make it a lot easier both to organise in your head as you expand the guide, ‘and’ make it easier to others to read.\u2028\u2028<br/>\n<br/>\nNext: <strong>Google Docs is your friend, </strong>particularly if you’re writing something large that you want to perhaps expand upon in the future (say you want to edit a particular chapter or add a new one; really easy to do with a doc without having it be broken up by people’s replies!!). You can just copy paste what you have now into a blank doc, and stick a Shareable Link at the beginning of the forum thread. Easy done.\u2028\u2028<br/>\n<br/>\nIf you’re specifically want to present comparative information about something (like, say, what Kamiryn did many years ago with the Build Calculator), you can use Google Sheets. Probably not necessary for a Mage guide, but something to keep in mind.<br/>\n<br/>\n\u2028\u2028As an example: Below is a link to a Crafting Guide I recently finished writing for an NWN EE action server, A Dawn of Heroes, which I’m currently DM staff for. The guide is a modified version of a crafting guide that I wrote for ‘another’ Nordock server ~10 years ago, and the server happens to use the same crafting system (Ambrosia Tradeskill System or ATS). So a lot of the guide was transferrable, and thankfully I didn’t have to re-write ‘everything’. \u2028\u2028<br/>\n<br/>\nSuffice to say: The guide’s pretty long, ‘way’ too long for a forum post, and makes use of Google Docs + Sheets for crafted item stats + formatting (don’t ask how long it took to write, lol). The original version I wrote 10 years ago 'also' used Google Docs, and it made it a 'lot' easier to update the guide 10 years later.<br/>\n<br/>\nSo I highly recommend you use Google Docs with the mage guide! :)\u2028\u2028<br/>\n<br/>\n<strong><a class=\"postlink\" href=\"https://docs.google.com/document/d/1fLn6uMZ-8fHL2LyP4kwi8bsfVb8XHxHl53qBuY7USHk/edit?usp=sharing\" rel=\"noreferrer\" target=\"_blank\">Link to A Dawn of Heroes Crafting Guide.</a></strong><br/>\n<br/>\nAgain, as an analogy, the crafting guide breaks things broadly up into ‘general info’ + ‘ingredient info’ + ‘item info’ + ‘a breakdown of a really important quest related to several crafted items’. And then uses subheadings under those 4 banners. For the Mage guide, you could do something similar, working from the general to the specific. \u2028\u2028<br/>\n<br/>\n---<br/>\n<br/>\nFor some specific content that you could add:<br/>\n<br/>\n<strong>\u2028\u2028Familiars</strong><br/>\n<br/>\nYou could do a really detailed breakdown of what they all do individually, and the strengths/weaknesses of each familiar. IMO however, there are only a handful that are worth using, which would probably include:\u2028\u2028<br/>\n<br/>\n- Mephits/Imp for early game tank (as has been mentioned)\u2028<br/>\n- Pixie as a pocket Rogue (as has been mentioned),\u2028<br/>\n- Faerie Dragon (Improved Invisibility at level 1, which can be cast on player if possessed, and confuse ray bolts from level 5),\u2028<br/>\n- Eyeball (The ‘Touch Attack’ familiar which spams fairly consistent damage rays of various damage types, and sports a Daze and KD bolt by level 20ish),\u2028<br/>\n- Panther (Up to 10d6 Sneak attack, useful for mages that like Disabling opponents a lot).\u2028\u2028<br/>\n<br/>\nThe ‘crowd control’ touch attacks that Faerie Dragon and Eyeball familiar have, if used by the player by possessing the familiar and manually targeting stuff, are amazingly potent when used well. You can for eg, completely disable a level 40 boss that lacks mind immunity (the touch attack has no save; it just has to ‘hit’), as a level 20 something Faerie Dragon or Eyeball familiar, for a couple of minutes, which in a party PW scenario is amazing. It was also super cheesy on PvP servers such as Antiworld back in the day, which balanced the duration for other disables like Bigby Hands, but not Faerie Dragon bolt, lol.<br/>\n<br/>\n<strong>\u2028\u2028Summons<br/>\n</strong><br/>\nThere are 4 commands that summoners can use to ‘pilot’ their summons\u2028\u2028.<br/>\n<br/>\n- Attack Nearest (VWE),\u2028<br/>\n- Follow (VEE)\u2028<br/>\n- Hold Position (VWX)<br/>\n\u2028- Guard Me (VWF).\u2028\u2028<br/>\n<br/>\nAttack Nearest ‘normally’ tells summons to attack their nearest target, but can often fail once a lot of factors in combat start happening (eg enemy area spells start hitting summons). This can cause summon AI tends to spaz out, leaving them standing still instead of attacking targets, even if they're taking damage from them. I 'think' it's because for whatever reasons, summons use 'Mount Actions' past a certain point, but this is just conjecture.<br/>\n<br/>\nEither way: Guard Me, specifically tells summons to attack the target that ‘you’re’ attacking, which can be a lot more useful than Attack Nearest, and ‘usually’ works when the AI spazzes out. You might have to tell summons to both Follow and 'then' Guard Me to clear their action queue, in the event that Guard Me on its' own doesn't do anything.<br/>\n<br/>\nYou can also use Guard Me to get summons to attack while you’re unseen. If you equip a ranged weapon with no ammunition (eg a Sling with no bullets) whilst invisible, you can ‘direct’ summons to attack enemies with Guard Me, and not break invisibility (because you haven’t carried out any hostile actions).\u2028\u2028<br/>\n<br/>\n---<br/>\n<br/>\nAnyway. There’s lots more I could add, but that’s probably more than enough from me heh. \u2028\u2028Hope this helps! :)\u2028\u2028</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:44 AM - Jul 17, 2020",
      "content": "<div>Thanks for the comment The Flying Rodent!<br/>\nI will edit the summon and familiar advice when I get a chance, this is good stuff you have supplied<br/>\nThere is other stuff some of the redditors let me know about too like stackable shadow conjuration mage armor<br/>\nAlso other stuff I thought about was expertise and improved expertise for spell casters -&gt; these are excellent feats for environments where this is not nerfed<br/>\nI wouldn't mind a few more screenshots and videos as well.<br/>\nWith the sheer volume of information it is a challenge to present it in a concise, structured and enjoyable way that a new player can understand<br/>\nRE Google Docs and other platforms I hesitate, they are good platforms, for now I am happy for the guide to be in the ECB forum with their permission, it is interactive, there are many skilled players active here, it has reasonable formatting, I can edit the posts and it is the environment which has taught me building skills. The forum posts get dispersed in between the replies but I can put up a contents page with links to each, the replies are a valuable contribution and really a part of the guide too, I guess<br/>\nI can always upload something to the NWN Vault at some stage, in case of the forums closing (similar to what happened to the original Bioware forums)<br/>\nIf you got more commentary feel free to add more! either by reply or via PM</div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "6:46 PM - Aug 23, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Jul 13, 2020</div></cite>That Demi-Lich may be a Lesser Demi-Lich - <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Lesser_demilich\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Lesser_demilich</a><br/>\n<br/>\nThe DR of the Demi-Lich (30/+20) should absorb most if not all of the damage from the Water Elemental Princess,not to mention the spells that it can bring to bear.<br/>\n<br/>\nI have been wondering about Epic Warding combined with Iron Golem (and having 1 level of Monk) - does the Epic Warding act as it does with Dragon Shape from Druids, and make the claws of the Dragon be able to pierce +20 DR?  If so, Epic Warding, Iron Golem, and beat that thing down pretty easily (no DR, 145 HPs goes fast).</div></blockquote>\nHey, man!<br/>\n<br/>\nAnswering your question, it does. However, if you're a near-pure Arcane caster, your AB should basically be abysmal in Iron Golem form, so even though you're going to pierce DR, the challenge will be to hit them. There is a CHEESY way to increase your AB in Iron Golem form on WoG, but I won't mention anything about it here, as it doesn't work everywhere. PM me if you want to know (provided you don't already).<br/>\n<br/>\nEven for Arcane Spellswords, you'll lose GMW and equivalent bonus that apply to your weapon, so even though your AB will be higher than that of an dedicated caster, that still won't be enough to hit any high-level boss on WoG reliably due to their insanely high ACs. Against early-or-mid-epic bosses it might work (Thinking Arbas and the like).<br/>\n<br/>\nTake it EZ!</div>",
      "author-color": "#00AA00"
    }
  ]
}