{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "790",
  "name": "Bard-orcerer: a viable design?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bard-orcerer-a-viable-design-t2355176.html",
  "author": "233",
  "avatar": "10714033_1519247364.jpg",
  "replies": 41,
  "posts": [
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "11:53 PM - Sep 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">This idea is continuously haunting me, as I truly like both classes, so I have to ask: can this combo create a good spellsword build?<br/>\n<br/>\nInto the old guild there is only one build with this combo, but it has been designed as a support caster (singing death by _bgwells_, available at this <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build219603.html\" rel=\"noreferrer\" target=\"_blank\">link</a>).<br/>\n<br/>\nI thought at the CHA synergy between these two classes, that can call also for divine shield...<br/>\nHowever, the only concepts I came up with led me only to an AB of 36, reached by sacrificing the still spell feats...I tried to include a cleric level for divine shield, but this would have lowered the BAB and AB...<br/>\n<br/>\nI thought to use it in WoG with a medium armor, as<br/>\n<br/>\n<details><summary>Spoiler</summary>the merchant in Rift Canyon sells a little shield that provides -10% to spell failure, and however without that shield the falure is limited to 20/30 %</details>\nThis is to be mostly played as a buffer, with tumble and UMD dump, and a medium buffer/debuffer song. If I have to fight as a caster (IGMS), I'll wear a robe instead.<br/>\nSaves suck, so there has to be reliance on items.<br/>\n<br/>\nSorcerer(26), Bard(14), Human<br/>\n<br/>\nSTR: 17 (28)<br/>\nDEX: 8<br/>\nCON: 12<br/>\nWIS: 8<br/>\nINT: 13<br/>\nCHA: 15 (19)<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Bard(1): Lingering Song, Expertise<br/>\n02: Bard(2)<br/>\n03: Bard(3): Weapon Focus<br/>\n04: Bard(4): STR+1, (STR=18)<br/>\n05: Bard(5)<br/>\n06: Bard(6): Extend Spell<br/>\n07: Bard(7)<br/>\n08: Bard(8): STR+1, (STR=19)<br/>\n09: Bard(9): Knockdown<br/>\n10: Bard(10)<br/>\n11: Bard(11)<br/>\n12: Sorcerer(1): STR+1, Blind Fight, (STR=20)<br/>\n13: Sorcerer(2)<br/>\n14: Sorcerer(3)<br/>\n15: Sorcerer(4): Toughness<br/>\n16: Sorcerer(5): CHA+1, (CHA=16)<br/>\n17: Sorcerer(6)<br/>\n18: Bard(12): Empower Spell<br/>\n19: Sorcerer(7)<br/>\n20: Sorcerer(8): CHA+1, (CHA=17)<br/>\n21: Sorcerer(9): Epic Weapon Focus<br/>\n22: Sorcerer(10)<br/>\n23: Sorcerer(11)<br/>\n24: Sorcerer(12): CHA+1, Great Strength I, (STR=21), (CHA=18)<br/>\n25: Sorcerer(13)<br/>\n26: Sorcerer(14)<br/>\n27: Sorcerer(15): Great Strength II, (STR=22)<br/>\n28: Bard(13): CHA+1, (CHA=19)<br/>\n29: Sorcerer(16)<br/>\n30: Sorcerer(17): Epic Prowess<br/>\n31: Sorcerer(18)<br/>\n32: Sorcerer(19): STR+1, (STR=23)<br/>\n33: Sorcerer(20): Great Strength III, (STR=24)<br/>\n34: Sorcerer(21)<br/>\n35: Sorcerer(22)<br/>\n36: Sorcerer(23): STR+1, Great Strength IV, Epic Spell: Epic Mage Armor, (STR=26)<br/>\n37: Sorcerer(24)<br/>\n38: Sorcerer(25)<br/>\n39: Bard(14): Great Strength V, (STR=27)<br/>\n40: Sorcerer(26): STR+1, Epic Spell: Epic Warding, (STR=28)<br/>\n<br/>\nHitpoints: 268<br/>\nSkillpoints: 206<br/>\nSaving Throws (Fortitude/Will/Reflex): 17/23/19<br/>\nSaving Throw bonuses: Spells: +8<br/>\nBAB: 23<br/>\nAB (max, naked): 36 (melee), 23 (ranged)<br/>\nAC (naked/mundane armor/shield only): 17/25<br/>\nSpell Casting: Sorcerer(9),Bard(5)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 43(44), Discipline 34(43), Open Lock 1(0), Perform 17(21), Spellcraft 39(40), Tumble 40(39), UMD 31(35)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:18 AM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You can socket items to reduce arcane casting penalty to nothing.<br/>\n<br/>\nAs such gems are plentiful, and most don't use them (dunno why), it is easy to get some together.<br/>\n<br/>\nIt doesn't matter what item it is btw.<br/>\n<br/>\nSo you will be looking for some good med. armor, right?<br/>\n<br/>\nMight want to try stopping by Dragorath's Lair - though you might find a set of the armor in the AG.<br/>\n<br/>\nYou will have access to Tensor's Tran, which on WoG is more like the PnP version - that should boost your AB and attacks, accordingly - and as a Sorc, you will have plenty of castings of it!<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "12:26 AM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Some might suggest, to go Bard 16, and sorcerer 24, and squeeze in Lasting inspiration. I am not aware of why you want those last 2 sorcerer levels.<br/>\nWebShaman is right...you can pretty easily socket items to reduce you casting failure chance, and also mitigate it with items with reduced casting penalties as standard drops, if you are having a hard time finding gems of that nature. I think there are a lot of us who'd pass them on pretty easily.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:38 AM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Its certainly an interesting idea to make a charisma based spellsword with EMA and EW! It's ambitious too!<br/>\n<br/>\nI'm not super familiar with these classes but, suggestions to try to help:<br/>\n<br/>\nWould like more HP. I read this comment from Kail some time ago and try to get as close as I can (sometimes I miss the target by about 50hp, but the main thing is being able to tank enough damage to stand in melee)<br/>\n<blockquote><div><strong>Kail Pendragon wrote (</strong><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/toughness-called-shot-why-all-the-love-t515384.html#p1272%5Bb\" rel=\"noreferrer\" target=\"_blank\">toughness-called-shot-why-all-the-love- ... ml#p1272[b</a>]): <br/>\nI[/b]n general Toughness is not a bad feat (eventually equivalent to 2 epic feats) to have although it's not high on my priorities. It's a good way to bring HPs up to a desired mark (at lvl 40 for me it's 400 HPs for those involved regularly in melee without being absolute melee specialists, 300 for casters, 500 for dedicated meleers).</div></blockquote>\nBoth Bard and Sorcerer have terrible HP rolls. <br/>\n<br/>\nMaybe a starting Str of 16, Cons 14 and Int 14 could put you in the right direction achieve what you need. +40 hp and +43 skill points is worth dropping 1 Str for I think. You could even drop Int to 10 and put Cons to 16, it might be worth imputing the numbers to see what each looks like before you make a decision<br/>\n<br/>\nI think squeezing a third class in would be good. <br/>\n<br/>\nWould be great to have Blackguard for the bonus to saves /martial weapon foci / heavy armor proficiency and possibly Divine Might in the build but you would need to take power attack and cleave is the downside and the build is somewhat feat starved already. If you take BG, a Bard 13 / BG 3 / Sorc 24 split might be good<br/>\n<br/>\nFighter would also be tempting for +2 bonus feats as well plus heavy armor / martial weapon proficiency, with two levels. Can be taken epic for +2 great strengths or pre epic for +1 AB and extra combat feats/allowing you to have martial weapon foci. You'd get a 20% exp penalty but in a PW it won't matter as much. Bard 14 / F 2 / Sorc 24 split.<br/>\n<br/>\nMick also has just taught me about a trick with the ranger class. If you take a single level epic, you can use the ranger bonus feat for epic weapon focus or epic prowess. Bard 13 / R1 / Sorc 26 would be what I'd do if you did that. Bard 13 I think has level 5 bard spells so I don't think you'd lose a lot?<br/>\n<br/>\nWould like more AB if possible (you've tried pretty hard I can see!), this is going to be challenging. UMD is helpful on WoG to access Divine Power and PnP Tensor's<br/>\n<br/>\nAlternatively your classes have tools to lower AC. Taunt to help with hitting enemies. Curse song might be good? I dont know enough to comment but the bonus to hitting things with zero chance of failure would be helpful. Would swap lingering song for this. <br/>\n<br/>\nIn WoG I have been told not to worry about Arcane spell failure / Auto Still Spell, one can easily socket an item with all those -% arcanist gems (more experienced players pls correct me if I'm wrong)<br/>\n<br/>\nAnyway its an interesting idea, got a lot of potential I think, with the proviso I'm not a bard/sorc expert at all<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:05 AM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">His Sorc levels get him TT, so no need to UMD it.<br/>\n<br/>\nDivine Power suxx0rs as an UMD user because the caster level is so low - though every bit helps. There are, of course, ways to work around this, but they are complicated and take time.<br/>\n<br/>\nKail built this kind of Spellsword and leveled it to 40 on WoG - I don't know if he had fun doing it, though - I think he died alot to 1 rolls from spam spells and abilities.<br/>\n<br/>\nI have a version of the Exhalted Sorceress and she murders things - she is truly a terror.<br/>\n<br/>\nShe even killed the improved version of Draggie (took I believe over 38 IGMSs to do it, finishing with Epic Ruin ftw).<br/>\n<br/>\nSo it is doable.<br/>\n<br/>\nThe build is going to HATE Drow, however.<br/>\n<br/>\nIt's gonna get completely wrecked.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:11 AM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Since you don't take any feats that require 13 INT or better, you should go with STr16, Cha16, Con14, Int12, instead. The final attributes would be the same but you just gained 40 hps. Lasting Inspiration requires 20 Bard levels, so it isn't possible with this class-split &amp; he already has lingering song which extends his song duration to 15 rounds each. Expertise, while a nice feat to have, it's not for this build, we have many more important feats to take, including of course curse song. And btw, your AB is fine for a spell-sword, Tenser's Transformation will make this 43AB instead of 36AB &amp; giving you four attack/round as well. As for the armor, there is both a medium one (or two) &amp; a certain buckler that don't have any chance of spell-failure. It's gonna be 3AC worse than full plate &amp; tower shield combo in total, but that's a small price to pay for discounting four whole feats (the three of them epic) from your build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "2:12 AM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Webshaman,<br/>\n<br/>\nI've not played a spellsword against the Drow solo,so are you suggesting that they'd be casting Mords and breaches with such frequency that tenser transformation wouldn't be viable?  I don't think Tensers is breachable, and he has enough caster levels that the dispelling part shouldn't take place with much frequency...hrmm..though at level 30 when he might be heading drow direction...I think I begin to see the issues...<br/>\n<br/>\nBut in general, to keep the conversation going,with Tensers up on WoG we're talking it having an ab of ...48, just from the TT. Do you feel taking some spell penetration feats would help deal with them? I mean..I know the ac is lowish as listed but of course he would actually be wearing medium armor.. ..and with damage shields and DR items...<br/>\n<br/>\nBasically I'm asking for you to expand on what issues you see with the WoG drow with this build.<br/>\n<br/>\nEdit: Of course you're right Valerfor about the 20 levels of bard needed for lasting inspiration...I am not sure what I was thinking.  I'll blaming it on my fasting.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:17 AM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Don't mention it gkorjax, I have done my share of little mistakes like this, especially when not enough coffee is circulated through the blood. <br/>\nI don't think that Sorc26 is gonna have a particularly difficult time with the drow, the 26CL isn't exactly low. Now, if that was 15CL like many other spell-swords that I have seen going down there... then definitely yes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:46 AM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, if one takes it real slow, and doesn't get swarmed by two or three Drow Wizards, things might go ok.<br/>\n<br/>\nThere is this one area, that tends to rapidly degenerate into a regular sh1tfest, ending up with 2~3 Drow Wizards, a couple of Drow Warriors, and some scouts.<br/>\n<br/>\nThe Drow warriors will hit his AC regularly (I mean, they have like 57 AB or so) and like to spam ki strikes.<br/>\n<br/>\nThe real nutter imo is when the Drow Wizards release the Epic Ruin.<br/>\n<br/>\nNo real protection vs it, you just have to suck it up and heal fast.<br/>\n<br/>\nI don't see too much problem with the Priestesses.<br/>\n<br/>\nI'm not sure about the Mords - but at that low a caster level, if they use it (I think I recall it being used), it's going to be nasty.<br/>\n<br/>\nThe build will probably need to retreat at that point and regroup.<br/>\n<br/>\nI've been doing the Drow lately, and that one area is a considerable nut to crack, even with a dev hitter with high AC and AB, plenty of DR and Regen, not to mention immunities.<br/>\n<br/>\nThey just throw so much at you at once, that you get swamped.<br/>\n<br/>\nIirc, there are 3 Drow Wizards in that Hallway - far enough away from one another to be hard to get to, but close enough where they can notice you.<br/>\n<br/>\nMy AA did them easy enough, but snipers have it easier there due to range.<br/>\n<br/>\nI kill one Drow Wizard easily enough with a melee, but then the other two are Timestopped up, buffed, and then start the light show.<br/>\n<br/>\nI mean, those Drow Wizards will have Epic Armor, Epic Warding up - plus some mantles on, and some sheaths running.<br/>\n<br/>\nGonna be interesting.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:41 AM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">One interesting thing you can do, if you have taken the drow wizards out &amp; have access to 9th-level spells: <br/>\nExtended acid seath, fire shield &amp; wounding whispers =&gt; turn to Iron Golem. AC doesn't matter, come at me bro  <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\nThat's 1d6 +1d6 +1d6 +52 +26 +14 reciprocal dmg for each of their hits. <br/>\nThey are gonna dive into their doom like lemmings (kudos for those that remember the game.)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:18 AM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice one Valerfor!<br/>\n<br/>\nYou can drop your tumble, dodge and dex AC as well by simply standing still and not undertaking any actions so one can receive additional 'punishment'<br/>\n<br/>\nThanks for reminding me of that game. <br/>\n<br/>\nThe internet says the myth of Norwegian lemmings jumping to their death is a myth perpetuated by Disney in a documentary in the 1950s!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "12:37 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>One interesting thing you can do, if you have taken the drow wizards out &amp; have access to 9th-level spells: <br/>\nExtended acid seath, fire shield &amp; wounding whispers =&gt; turn to Iron Golem. AC doesn't matter, come at me bro  <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\nThank you for your replies!<br/>\nI have thought to further multiclass with cleric or fighter, however as I didn't want to pay a high price I have discarded temporarily the idea:\n<ul>\n<li>This build strongly needs EMA, its +5 dodge AC and, <span style=\"text-decoration:underline\">more than that</span>, the room for amulets/rings/cloacks that boost <span style=\"text-decoration:underline\">CON</span>/STR/CHA;</li>\n</ul>\n<ul>\n<li>Bard levels are to be left as they are, because, in my opinion, the lv 11 song at level should not be worth the  (-2 sorcerer levels, and EMA gone).</li>\n</ul>\nCleric multiclassing would have dropped AB by 1.<br/>\nAs you have correctly pointed out, CON is to be raised. This is one of my first concerns.<br/>\nThe strategy I have in mind for drows I like the same previously used: bring with me a huge amount of invisibility scrolls/potions, and take advantage of both line of sight and the paths followed by mages, like I did in Metal Gear Solid (good times, with that game!): when a wizard is distant from the other, approach it while invisible, knock it out and kill it; immediately cast invisibility/greater sanctuary, and find a strategic position to harm the other one or dispose of some warriors/rogues, in the case someone is already running towards me....<br/>\nQuite a slow game, I will need patience....<br/>\n<br/>\nI didn't know about these socket gems,  precisely I don't know at all how to use them. Is craft weapon needed?<br/>\nI once picked a morningstar with its name coloured in green...are only these type of items socketable?<br/>\nAfter applying some changes, the build should be as follows:<br/>\n<br/>\nSorcerer(26), Bard(14), Human<br/>\n<br/>\nSTR: 16 (28)<br/>\nDEX: 8<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 12<br/>\nCHA: 16 (19)<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Bard(1): Lingering Song, Curse Song<br/>\n02: Bard(2)<br/>\n03: Bard(3): Weapon Focus<br/>\n04: Bard(4): STR+1, (STR=17)<br/>\n05: Bard(5)<br/>\n06: Bard(6): Extend Spell<br/>\n07: Bard(7)<br/>\n08: Bard(8): STR+1, (STR=18)<br/>\n09: Bard(9): Knockdown<br/>\n10: Bard(10)<br/>\n11: Bard(11)<br/>\n12: Sorcerer(1): STR+1, Blind Fight, (STR=19)<br/>\n13: Sorcerer(2)<br/>\n14: Sorcerer(3)<br/>\n15: Sorcerer(4): Toughness<br/>\n16: Sorcerer(5): STR+1, (STR=20)<br/>\n17: Sorcerer(6)<br/>\n18: Bard(12): Empower Spell<br/>\n19: Sorcerer(7)<br/>\n20: Sorcerer(8): CHA+1, (CHA=17)<br/>\n21: Sorcerer(9): Epic Weapon Focus<br/>\n22: Sorcerer(10)<br/>\n23: Sorcerer(11)<br/>\n24: Sorcerer(12): CHA+1, Great Strength I, (STR=21), (CHA=18)<br/>\n25: Sorcerer(13)<br/>\n26: Sorcerer(14)<br/>\n27: Sorcerer(15): Great Strength II, (STR=22)<br/>\n28: Bard(13): CHA+1, (CHA=19)<br/>\n29: Sorcerer(16)<br/>\n30: Sorcerer(17): Epic Prowess<br/>\n31: Sorcerer(18)<br/>\n32: Sorcerer(19): STR+1, (STR=23)<br/>\n33: Sorcerer(20): Great Strength III, (STR=24)<br/>\n34: Sorcerer(21)<br/>\n35: Sorcerer(22)<br/>\n36: Sorcerer(23): STR+1, Great Strength IV, Epic Spell: Epic Mage Armor, (STR=26)<br/>\n37: Sorcerer(24)<br/>\n38: Sorcerer(25)<br/>\n39: Bard(14): Great Strength V, (STR=27)<br/>\n40: Sorcerer(26): STR+1, Epic Spell: Epic Warding, (STR=28)<br/>\n<br/>\nHitpoints: 308<br/>\nSkillpoints: 206<br/>\nSaving Throws (Fortitude/Will/Reflex): 18/23/19<br/>\nSaving Throw bonuses: Spells: +8<br/>\nBAB: 23<br/>\nAB (max, naked): 36 (melee), 23 (ranged)<br/>\nAC (naked/mundane armor/shield only): 17/25<br/>\nSpell Casting: Sorcerer(9),Bard(5)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 43(45), Discipline 33(42), Open Lock 1(0), Perform 16(20), Search 1(2), Spellcraft 39(40), Tumble 40(39), UMD 31(35)<br/>\n<br/>\n<br/>\n01: Concentration(4), Discipline(4), Open Lock(1), Perform(2), Spellcraft(4), Tumble(4), UMD(4), <br/>\n02: Concentration(1), Discipline(1), Perform(1), Spellcraft(1), Tumble(1), UMD(1), <br/>\n03: Concentration(1), Discipline(1), Perform(1), Spellcraft(1), Tumble(1), UMD(1), <br/>\n04: Concentration(1), Discipline(1), Perform(1), Spellcraft(1), Tumble(1), UMD(1), <br/>\n05: Concentration(1), Discipline(1), Perform(1), Spellcraft(1), Tumble(1), UMD(1), <br/>\n06: Concentration(1), Discipline(1), Perform(1), Spellcraft(1), Tumble(1), UMD(1), <br/>\n07: Concentration(1), Discipline(1), Perform(1), Spellcraft(1), Tumble(1), UMD(1), <br/>\n08: Concentration(1), Discipline(1), Perform(1), Spellcraft(1), Tumble(1), UMD(1), <br/>\n09: Concentration(1), Discipline(1), Perform(1), Spellcraft(1), Tumble(1), UMD(1), <br/>\n10: Concentration(1), Discipline(1), Perform(1), Spellcraft(1), Tumble(1), UMD(1), <br/>\n11: Concentration(1), Discipline(1), Perform(1), Spellcraft(1), Tumble(1), UMD(1), <br/>\n12: Concentration(1), Search(1), Spellcraft(1), <br/>\n13: Concentration(1), Spellcraft(1), Save(2), <br/>\n14: Concentration(1), Spellcraft(1), Save(4), <br/>\n15: Concentration(1), Spellcraft(1), Save(6), <br/>\n16: Concentration(1), Spellcraft(1), Save(8), <br/>\n17: Concentration(1), Spellcraft(1), Save(10), <br/>\n18: Concentration(1), Discipline(1), Spellcraft(1), Tumble(6), UMD(7), <br/>\n19: Concentration(1), Spellcraft(1), Save(2), <br/>\n20: Concentration(1), Spellcraft(1), Save(4), <br/>\n21: Concentration(1), Spellcraft(1), Save(6), <br/>\n22: Concentration(1), Spellcraft(1), Save(8), <br/>\n23: Concentration(1), Spellcraft(1), Save(10), <br/>\n24: Concentration(1), Spellcraft(1), Save(12), <br/>\n25: Concentration(1), Spellcraft(1), Save(14), <br/>\n26: Concentration(1), Spellcraft(1), Save(16), <br/>\n27: Concentration(1), Spellcraft(1), Save(18), <br/>\n28: Perform(3), Spellcraft(1), Tumble(10), UMD(10), <br/>\n29: Concentration(1), Spellcraft(1), Save(2), <br/>\n30: Concentration(1), Spellcraft(1), Save(4), <br/>\n31: Concentration(1), Spellcraft(1), Save(6), <br/>\n32: Concentration(1), Spellcraft(1), Save(8), <br/>\n33: Concentration(1), Spellcraft(1), Save(10), <br/>\n34: Concentration(1), Spellcraft(1), Save(12), <br/>\n35: Concentration(1), Spellcraft(1), Save(14), <br/>\n36: Concentration(1), Spellcraft(1), Save(16), <br/>\n37: Save(20), <br/>\n38: Save(24), <br/>\n39: Concentration(1), Discipline(18), Perform(1), Tumble(10), <br/>\n40: Concentration(4), <br/>\n<br/>\n<br/>\nWith CON capped, she should reach 548 HP (848 HP in iron golem form). That should relieve me a bit.<br/>\n<br/>\nAs the mines of Azak Zil hold a certain pair of cleric boots (usable with UMD), I wondering if dropping totally discipline and partially UMD (to a modified 25) could help raising Taunt as Orion suggested.....so my AC would be higher.<br/>\n<br/>\nEdit: thank you Orion for the Ranger multiclassing trick, this could help save an epic feat and make room for either ESF: Taunt, Armor Skin or Great Charisma.<br/>\nI'll keep in mind for other builds, unfortunately for the above reasons I cannot decrease any of these classes....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:14 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sounds like a plan!<br/>\n<br/>\nI like!<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:04 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think this looks nice.<br/>\n<br/>\nWith curse song and bard song active, your effective AB will be 36 +2(bs) +3(cs) = 41<br/>\n<br/>\nAdd extended PnP Tensors which is undispellable = +13AB + 2d4/Str * 0.5 [if not at cap] = +15 AB on average. it also will add up 26d6 hp combined with +16hp from bard song will help get that HP up to about 400 which is kind of the target for a melee character.<br/>\n<br/>\nWith an effective AB of 56 I would assume you will not have trouble hitting things, although the only way to be sure is to try out the build. Perhaps Taunt would be overkill here?<br/>\n<br/>\nYou could also add aid and bless from potions or a scabbard of blessing for a further +2 AB<br/>\n<br/>\nTo answer your question on gems, there are two types. <br/>\n<br/>\nYou have encountered the green type which is the least common, and the old gem system. My experience is these have fixed drop points (ie not random). Only green gems can be socketed in green items. I have only encountered the morningstar that you have also encountered, but I have not fully explored undermountain / underdark yet.<br/>\n<br/>\nThe more common gem are the teal type which randomly drop. These get socketed into teal socketed items, which have a (x) which tells you how many sockets the item has. The maximum sockets is 6 and minimum sockets 1. ie: Socketed Greataxe (2) = 2 sockets<br/>\n<br/>\nThe ranger trick is Mick Dagger's nugget of knowledge I have spread around for general consumption :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:02 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Let's see some of the in-game stats: <br/>\nAB 36 (base) +7 (Tenser's) +5 (GMW) +6 (Capped STR) +2 (Bard's Song) +3 (Curse Song) +2 (War Cry) +2 (Aid, Bless) = 63 AB (And you're still below the AB Cap). <br/>\nAC 23 (base, with chain shirt + buckler) +4 (18 DEX) +4 (Haste) +5 (EMA, Dodge) +1 (MA, Dodge) +4 (Armor enhancement) +5 (Buckler enhancement) +3 (Bard Song) +4 (Curse Song) +5 (Deflection) +5 (Natural) +4 (Boots, Dodge) = 67 AC (And you're still below the Dodge Cap). <br/>\nAnd for single powerful enemies you also have Bigby's Interposing Hand for +10 AC (effective) &amp; Negative Energy Burst for another +3 AC (effective from their -6 STR). <br/>\nOf course, they can heal/restore that, if they have a lesser restoration potion with them, but I don't think so <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\nYou will find that the Sorcerer's power is mostly unlimited &amp; constrained only by the skill of their user. <br/>\nA single Ranger level, besides the other things that Mick mentioned already, will also give you Set Traps, yet another tool to defeat almost anything &amp; anyone with some clever trap-stacking.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:12 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Almost forgot, <br/>\nA single Cleric level, besides the ability to wear heavy armor &amp; take a Divine feat, will also give you the ability to select animal domain &amp; get your hands to the powerful Elemental Princes, and with Sorcerer &amp; Bard, you can buff those much, much better.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "5:53 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Valerfor,<br/>\nAre you speaking of WoG Tensers ? If so, its listed as bonus ab is caster level/2 ...Am I missing something, or are you referring to vanilla tensers?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:12 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>gkorjax wrote:</cite>Valerfor,<br/>\nAre you speaking of WoG Tensers ? If so, its listed as bonus ab is caster level/2 ...Am I missing something, or are you referring to vanilla tensers?</div></blockquote>\nI was not speaking for the default Tenser's, but for the \"fixed\" one as presented on WoG or if you download it from the Vault. <br/>\nBut I had the impression that the AB boost was stoping at full bab (30AB-23AB=7AB), if that isn't the case then it's 1 more AB to the above figure. <br/>\nThanks for mentioning this gkorjax!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "6:16 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Maybe my interpretation is too simplistic, i.e. I don't take into account all the subtleties...but here is WoG version.<br/>\n<br/>\nTenser's Transformation - caster gains 2d4 STR and DEX, d6 hit points per caster level and +1 base attack bonus per 2 caster levels. You no longer polymorph into a doom knight so you get to keep spell slots gained via magic items that polymorphs unequip. AC bonus is now a +4 natural, not a +4 dodge. Simple and Martial Weapon Proficiencies are added to your character via a temporary feat addition to the character's currently equipped armor. 100% Spell Failure for duration, even from items.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:19 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There is no mention for the full bab cap, so it might extend this until you hit the AB cap instead. <br/>\nEither way, is fine, the AB boost is gonna be quite strong indeed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:31 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There are so many tricks you can do with a good spell-sword that are limited only by your imagination, really. <br/>\nFor example, if you have set your mind on a particular boss &amp; you aren't sure that you will pass his SR for IGMS spamming, you could load all your 9th-level slots into TS &amp; 1 Mord for example &amp; then with Tenser's enabled &amp; all buffs, go toe-to-toe with him/her inside the time-stop. I guess that inside the TS, your enemy will be flat-footed, meaning no tumble, no dodge, no dex bonuses of any kind &amp; his/her AC will drop like a stone in cold water. Then its simple, really. TS =&gt; Mord's =&gt; Full melee 1 round =&gt; TS =&gt; Full melee 2 rounds =&gt; TS =&gt; Full melee 2 rounds, etc. until he/she is dead. This works even better when your spell-sword has Dev Crit, which is basically double-cheddar in your sandwich.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:14 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I experimented with Bard/Sorcerer some years ago. I was never really satisfied with the result, but I may have overlooked something. I never had WoG in mind, so Arcane spell failure was an issue. I even ended up trying something dex based. I'll post that here just for comparison.<br/>\n<details><summary>Spoiler</summary>Bard(16), Sorcerer(24), Human\nSTR: 10\nCON: 10\nINT: 14\n\n02: Bard(2)\n04: Bard(4): DEX+1, (DEX=17)\n06: Bard(6): Weapon Focus: Dagger, Mace or Sickle\n08: Bard(8): DEX+1, (DEX=18)\n10: Sorcerer(2)\n12: Bard(9): DEX+1, Empower Spell, (DEX=19)\n14: Sorcerer(5)\n16: Sorcerer(7): DEX+1, (DEX=20)\n18: Sorcerer(8): Greater Spell Penetration\n20: Bard(12): DEX+1, (DEX=21)\n22: Bard(13)\n24: Sorcerer(11): CHA+1, Epic Prowess, (CHA=17)\n26: Sorcerer(13)\n28: Sorcerer(14): CHA+1, (CHA=18)\n30: Sorcerer(16): Great Dexterity I, (DEX=22)\n32: Bard(15): CHA+1, (CHA=19)\n34: Sorcerer(19)\n36: Sorcerer(21): DEX+1, Great Dexterity III, (DEX=25)\n38: Sorcerer(23): Epic Spell: Epic Warding\n40: Bard(16): DEX+1, (DEX=26)\nHitpoints: 192\nSaving Throw bonuses: Spells: +9\nAB (max, naked): 35 (melee), 32 (ranged)\nSpell Casting: Bard(6),Sorcerer(9)\nSkillpoints: 253\n</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "9:57 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>There are so many tricks you can do with a good spell-sword that are limited only by your imagination, really. <br/>\nFor example, if you have set your mind on a particular boss &amp; you aren't sure that you will pass his SR for IGMS spamming, you could load all your 9th-level slots into TS &amp; 1 Mord for example &amp; then with Tenser's enabled &amp; all buffs, go toe-to-toe with him/her inside the time-stop. I guess that inside the TS, your enemy will be flat-footed, meaning no tumble, no dodge, no dex bonuses of any kind &amp; his/her AC will drop like a stone in cold water. Then its simple, really. TS =&gt; Mord's =&gt; Full melee 1 round =&gt; TS =&gt; Full melee 2 rounds =&gt; TS =&gt; Full melee 2 rounds, etc. until he/she is dead. This works even better when your spell-sword has Dev Crit, which is basically double-cheddar in your sandwich.</div></blockquote>\nThat's quite a trick!<br/>\n<br/>\nP.S.: I have tested, in the WoG offline module, the elemental princess in Critwall some minutes ago, if used well she is very destructive. :)<br/>\nNow I understand why she has a great reputation! <br/>\nTomorrow I'll test it in a match with Arbas (although I think I can win by stacking empowered blade barriers with my cleric...)<br/>\n<br/>\nIt makes me tempted to input a level of cleric, the AB would drop by 1 but your calculation shows that, at highest levels (from lv 29/30), she should not be so worried about her AB....<br/>\n<br/>\nThank you Mick for your input!<br/>\nI understand that with this combo is very difficult (if not impossible) to make an optimized build...feat starving, low CON, armor spell failure...but I'm sure it'll be fun (even if painful) to level it on WoG, this is an union of my favorite classes (so far)...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:14 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nope.<br/>\n<br/>\nYou get totally wrecked.<br/>\n<br/>\nYou will see.<br/>\n<br/>\nWDK, AoO, Lolth, etc will wreck this build.<br/>\n<br/>\nYou will have major problems with Drow.<br/>\n<br/>\nWith Rary &amp; Co.<br/>\n<br/>\nEtc.<br/>\n<br/>\nThe build works well in a group - but not solo.<br/>\n<br/>\nAlready tried it.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:16 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Try it against Lord Vayne and Lady Athea (minor WoG nuisances, really).<br/>\n<br/>\nThey'll wreck your solo build fast.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "stephenratcliffe809",
      "avatar": "10759100_1561880327.jpg",
      "timestamp": "10:51 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Stop sitting on the fence Webby :)<br/>\n<br/>\nSent from my SM-T810 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:16 PM - Sep 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What I mean is this - it's a \"one trick pony\".<br/>\n<br/>\nIt's not sustainable without horrendous amounts of item luggage (and on WoG, with enough item luggage, you can basically do everything with just about any build).<br/>\n<br/>\nSo, you hack your way through the reddies,  maybe used some spells to buff, etc.<br/>\n<br/>\nGet to the next level - even with planning  and careful tactics  used alot of resources to secure a key...<br/>\n<br/>\nYou now need to rest, regain oneself.<br/>\n<br/>\nThe next level requires even more, so rinse, repeat.<br/>\n<br/>\nThen the Underdark - and things get...messy.<br/>\n<br/>\nFinally, a chance to gain ones breath, and recuperate. <br/>\n<br/>\nPerhaps one gets through to the Demonweb.<br/>\n<br/>\nNow the drain begins.<br/>\n<br/>\nAnyone who has done it knows what I mean.<br/>\n<br/>\nYou need PERFECT meta-knowledge here - and even that will not give you a breather!<br/>\n<br/>\nBy the time you face Lolth &amp; Co, you'll be running on empty, because the build CANNOT sustain itself.<br/>\n<br/>\nThis is what I mean.<br/>\n<br/>\nCan the build reach level 40 on WoG?<br/>\n<br/>\nYes, easily.<br/>\n<br/>\nIs it something that can solo all the hard things on WoG?<br/>\n<br/>\nOnly under very good expertise and Server knowledge imo.<br/>\n<br/>\nThis is not straddling the fence imo.<br/>\n<br/>\nIt is just how things are.  NWN has no balance for a Spellsword aka the PrC or NWN2 with the Eldritch Knight and a feat that gives arcane castor levels back.<br/>\n<br/>\nWe all know this.<br/>\n<br/>\nSpells from this Spellsword will \"fizzle out\" against Drow SR (not to mention most end boss SR, regardless of Mord's SR lowering).<br/>\n<br/>\nThe AB, and Arcane protections just don't cut it against the hordes in a clinch - and against Lolth, there is nowhere to run (not to mention navigating the demonweb).<br/>\n<br/>\nRary &amp; Co present a similar conundrum - with Yugoloths and Golem constructs, some making the Shield strategy useless, along with the magical route.<br/>\n<br/>\nThis build has no Dev Crit to deal with the masses quickly and easily, making each battle a drain.<br/>\n<br/>\nI ran into these problems early on on WoG, as I demonstrated that a Melee Mage could be viable - it is, but WoG presents a very difficult environment for such.<br/>\n<br/>\nKail did a lot of specialized builds of Spellswording, and sort of \"invented\" the Summons Wand spamming to drain dispels and breaches in order to prevent the drain on resources.<br/>\n<br/>\nThese days, you need an inventory of specific items, to get your Spellsword to the next \"replenishment area\".<br/>\n<br/>\nSo instead of saying \"on the fence\", I would describe it more like \"been there, done that\".<br/>\n<br/>\nI concentrate on other builds to solo WoG, that are less time and tactically intensive.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:29 AM - Sep 30, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like that Aquarius is trying to create something new and different, gone to the trouble of optimising it with the ECB's input<br/>\n<br/>\nOnly way to see how it really is, to try it out :)<br/>\n<br/>\nI'm keen to hear how it goes - Aquarius has been thinking about this Sorcerer Spellsword idea for a few months now, I remember a previous thread back then<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:11 PM - Sep 30, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, I want him to try it out (or her, dependingly!)<br/>\n<br/>\nI'm just a bit skeptical, is all.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "8:10 PM - Sep 30, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">My idea is to play this build because I like both classes and I want to try something new, as Orion said....this can, whatever will be the end, help me improve my gameplay and my strategical approach to the various situations occuring in this server/game.<br/>\nYes, I am a bit skeptical too, and I truly hold in high esteem all your judgements and advices, hence I want to be as much realistic as possible. My aim is not to solo ALL the major bosses in this server, I could be happy if I could finish Rary/Critwall/(and if possible) Drow areas. I am aware of my limits as a player, I have soloed WDK many times with my Bard/Fight/RDD and only won once; I don't underestimate my enemies, even when they are rats <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />.<br/>\n<br/>\nI strongly think that Tenser's transf. is not to be used all the times (the 100% arcane spell failure an high price/risk), in fact I previously defeated Vayne and Althea with a Paladin/sorcerer/CT spellsword without using any Tenser and without EMA (I was at level 27-28, I think). <br/>\n<br/>\nYes, I died two times each fight, and after defeating Vayne I rested at Law's Forge before facing Althea, and maybe my strategy won't work in the server. If nothing will work, I will be however happy to have tried.<br/>\n<details><summary>Spoiler</summary>Steps:\n2) Pixie removes the trap and opens the door, while I sneak into and kill the balor on the far left of the wings, he can cast greater dispelling. Dispose of all demons into both the left and right wing through shields, and Tenser;\n4) As long as he is close, dispel all his buffs through a Mord's. He couldn't absorb all my Premonition, due also to greater swordsman's belt, and his HP was drained by acid and fire shields. When he has been badly wounded, cast a time stop and two IGMS (not empowered). This should end the game with him, not allowing casting of heals or using of potions.\nI have killed her three times in a row using only a mords (without the breach) and Bigby failed on the first time in only one attempt.I point out that I rested at Law's Forge between Vayne and Althea's fights, but maybe a more skilled player can do the work without resting.I am aware that this is a difficult plan, but I have already implemented it and I think it can work another time.\n</details>\n\nI can opt to replace toughness with craft wand, this has helped so much with the drow as, with the bard build, I continuously casted haste and improved invisibility to be able to \"slay and run\".<br/>\nI will stock on some Leomund's to be able to safely pass thorugh drow and Rary area safe....<br/>\n<br/>\nUnfortunately, due to RL, I don't have enough time to level her now into the server, but I'll do it as soon as possible. In the meanwhile, I'll try the fight with Vayne and Althea in the offline module, and let you know...as of now, I humbly thank you all for your precious support and advice! ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "11:25 PM - Sep 30, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite><a href=\"https://www.tapatalk.com/groups/nwnecbguild/memberlist.php?mode=viewprofile&amp;u=10759110&amp;sid=e58ec89651116816a0d92ce72365c902\">webshaman1</a> wrote: <a data-post-id=\"17146\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17146&amp;sid=e58ec89651116816a0d92ce72365c902#p17146\">↑</a><div class=\"responsive-hide\">Sep 29, 2019</div></cite>What I mean is this - it's a \"one trick pony\".<br/>\n<br/>\nIt's not sustainable without horrendous amounts of item luggage (and on WoG, with enough item luggage, you can basically do everything with just about any build)<br/>\nSent from my SM-G955F using Tapatalk</div></blockquote>\nFor this reason, I play with the classes and pcs that can make my travel entertaining.<br/>\nThis is how each gamer does, I think.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:38 AM - Oct 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Please let us know how it goes!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "11:03 PM - Oct 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And the winner is.....Westra Brightwood!!  <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\nBefore continuing...I faced Althea and Vayne at level 33 (when she obtained the 20th sorcerer lv...she needed maximum flexibility and spell slots in a fight like this).<br/>\nEquipment was mostly +2/+3, but it worked anyway.<br/>\n<br/>\nAs saves were pretty low, I used a ring of resistance and a cloak to raise them by 5.<br/>\n<br/>\nAs I found both Althea and Vayne one beside the other, I chose the direct assault (without defeating any other enemy): run to them in greater sanctuary, time stop + mord's on Althea, casted three empowered IGMS, and finished Althea with some morningstar swifts.<br/>\n<br/>\nProof of the deed:<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201910/10714033_0440a084027a5cc5181255959622b62c.png\" /></dl>\n</span><br/>\nHere I am finishing a stunned Althea:<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201910/10714033_5569a5358fbf2f917e6b7f8591ee5fc0_t.png\" />\n</dl>\n</span><br/>\n<br/>\nStats when max buffed and Tenser:<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201910/10714033_333c7fb1c111590ca08e0ab7cd8a5e88.png\" />\n</dl>\n</span><br/>\n<br/>\nJust a proof of how many damage the three combined shields do (I hadn't any more time stops, so I had to defeat Vayne by attack and shields..I forgot to cast also Tenser's), Vayne's HP decreased by 19+44+11=74!<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201910/10714033_33c683ae7d3ac3f5acbb6944d02710d3.png\" />\n</dl>\n</span><br/>\n<br/>\nMaybe she won't defeat drows, but at least Althea and Vayne are dead! :)<br/>\n<br/>\nEdit: one of the greatest features of the build, in my opinion, is the combined bard and sorcerer spell casting: you can, for example, cast an extended ultravision as a bard, and a darkness as a sorcerer (so you max the duration of darkness).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:30 AM - Oct 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's really well done! Thanks for posting the combat strategies you used!<br/>\n<br/>\nI guess it sounds like you know where your next destination might be? :)<br/>\n<br/>\nI have two questions if I can ask?<br/>\n<br/>\n1. I'm terrible at arcane spellcasters. Have you got other combat strategies in addition to the two you posted to teach me?<br/>\n<br/>\n2. Anything you would change in the build now that you have playtested it a reasonable duration? I think you wrote about including craft wand in the build, did you end up doing that?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:53 AM - Oct 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Noice!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:52 AM - Oct 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@Orion, if you had fun with your Druid, then you will love arcane spell-casters man. <br/>\n@Aquarius, well done!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "10:45 PM - Oct 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you for your advices on building this PC ;)<br/>\nI have created her with the PGCC and leveled her to lv 33; as, however, I gave her only the greater swordsman belt, and +3/+2 weapons and rings, I still have to go to some areas (Dragotha's one as well, so I will understand which armor she is treasuring) to take down all major bosses and to obtain the most needed boots/cloaks/amulets! Will let you know of her progress!<br/>\nI didn't take the craft wand feat, as of now. I used it a lot against drows with my Bard/Figh/RDD, and I would like to try new strategies and not to heavily depend on wands. This will imply to wait to face them until level 40, when she will take epic warding.<br/>\nHowever, if I would have to rebuild her, I would surely replace toughness with silent spell or still spell: extend does not work with attack spells (e.g. IGMS, ice storm), and I could widen my arcane arsenal and raise the flexibility of this build.<br/>\n<br/>\nEven if I won't be able to finish drow's area (but I am confident), I will level her into the server....<br/>\n<br/>\n@ Orion: I can share some advices and some tricks I have learnt, unfortunately (but also luckily) I have yet to understand how to play perfectly a character like this one.<br/>\nI found myself very comfortable with the sorcerer spellsword's playstyle. Even if sorcerers are troubling to level at low levels, later on they blossom and become very strong.<br/>\nSorcerers can help you face unplanned circumstances, as you can cast almost each spell in every moment. Besides, in my opinion maximum flexibility means many tricks to learn ;)<br/>\n<br/>\nI have enjoyed your druid DS playthrough, and I'm sure you'll find yourself comfortable with arcane casters!<br/>\n<br/>\nSome little advices from my experience:<br/>\n - the shadow shield spell, especially when extended, can help you make room for amulets (+CON/+saves/+....) ;<br/>\n - WoG has some items that can help you cap charisma;<br/>\n - always have Bigby 6 spells at your disposal, they can help defeating wizards (I don't know how the fight would have been without a Bigby on Althea);<br/>\n - an interesting strategy for a battle with mages is to use a scroll of silence and sneak to a mage, and knock him/her down, he/she won't be able to do anything (of course, Althea has some scrolls to counterattack and it is immune to KDs so I don't advise doing this against her). Silent spell feat can help a lot, increasing flexibility and avoiding to be \"disarmed\" by another caster;<br/>\nI have found in WoG offline module that in Rao's temple (or Heironeous one in Greyhawk, don't clearly remember) there are \"Silence\" spells scrolls that can used by paladins (strage, as this is not a Paladin spell); <br/>\n - darkness + ultravision combo is quite useful, however with some bosses in WoG (e.g. Althea/Vayne) it's like having a big flashing arrow into the top of your head, saying \"target here, you ...\".<br/>\n - craft wand feat can be quite useful during Tenser's, when you are not able to cast spells. Useful wands with this character can be made with spells as Haste/Improved invisibility/Identify/True strike/Invisibility/Darkness/Ultravision/Find traps/Keen edge/Elemental shield/Lesser spell breach/Wounding whispers/war cry.<br/>\n - Invisibility has often been, for me, an alternative to greater sanctuary when escaping from melee foes (I leave greater sanctuary for mages). As you cast stat buffs as empowered, you have room for 3-4 invisible uses;<br/>\n - my favourite strategy when facing threatening foes that don't melee (e.g. liches, demi-liches), is to have in my bag a 2-handed weapon (I love halberds) and cap STR + bless weapon + holy sword. My sorcerer/pally/CT has 30 STR, meaning 1d10+15+5 (greater magic weap) + 3d6 divine damage (this latter cannot be resisted).<br/>\n - You can sneak through traps and closed doors through your pixie (she has improved invisibility that make her avoid battles);<br/>\n - Be ready to change spells on quickslots if needed (even if it is a nuisance):when fighting wizards such as Althea, you will want to have time stop/mords/bigby/empowered an normal IGMS in the same row, preferrably into the middle of the bar so it is quicker to click on them; <br/>\n - Capping stat (INT/STR), even when playing a spellsword, can be quite useful as you can increase the number of spells at your disposal. In the above fight my charisma was 19; increasing it to 22-23 (for example, with a +4 ring in WoG) would have added 1 sixth spell, and to 28 a lv 9 lv spell, that is one more turn of time stop and IGMS to almost kill Althea safely.<br/>\nThis can help saves, if you want to build a Sor/Pal.<br/>\nThis is the main reason why I stubbornly want EMA in this build.<br/>\n<br/>\nI take this exercise as a little brainstorming, so others who are much more keen with spellsword builds can correct/add if there is something wrong (so I can learn something new).<br/>\n<br/>\nP.S.: one of my funniest moments with Althea was with my Sorc/Pal/CT, as she casted Bigby 9 and immobilized me, then (I don't know why) a Mords (maybe to dispel my buffs), that dispelled also Bigby's and allowed me to escape from her!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "12:35 AM - Oct 19, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just a little update, finally real life has given me enough time to complete preparation and finalize drow stages!<br/>\n<br/>\nBuild testing completed! Drows and Lolth are no more.<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201910/10714033_5d62ec1986ba76219f31e355dc8cf386.png\" /></dl>\n</span><br/>\n<br/>\nIt has been a difficult fight since the entrance of the Drow city....and very resource-draining! <br/>\nPotions used: one Leomund scrolls and almost 40 heal potions (but got a bit more than 20 from dead drows).<br/>\n<br/>\nThe turning point has been epic warding, as it helped me many times! In order to have it earlier, I took the last sorcerer level at Character level 39 instead of 40.<br/>\nTherefore, if I had to re-set leveling, I would replace toughness with craft wand and switch (as I have done) last sorcerer level to 39 to get earlier Epic Warding.<br/>\n<br/>\nSome tactics generally employed (maybe someone can suggest other strategies that can be applied):<br/>\n<details><summary>Spoiler</summary>I managed to kill weapon masters and rogue through soaking belts switching, shields and attacks.\nNot to mention the bone ring against other deadly enemies...\nI only had to use Tenser's with priestesses, to:\n\n\nHence, the only strategy I come up with has been: physical attacks!\nI thought to attack her (with Tenser on) until she gest to badly wounded, activating EW as late as possible, so it can last more, and wait for normal Tenser to finish its effects while I attack other enemies, for example Balrogs.\nWhen Tenser wears off, time stop + true strike, then three attacks, being ready to cast another time stop and repeat the process until she dies. I have not mastered the counting of rounds (I want to understand fully the mechanic, as they are crucial for each playthrough) but I found out that, if I click on cast TS during the third attack, the PC immediately casts TS after it, without her doing a single move (healing).\nThis strategy worked two times, another time I died due to a too early epic warding activation, and early finish of effects....\nLuckily I choose, in previous fights, to keep level 1 and level 9 slots, in case I would need them for Lolth....\n</details>\nOk, I am so happy that this build has succeeded the testing, promoted for server! Thread closed. :)<br/>\n<br/>\nEDIT: minor corrections.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "6:08 AM - Oct 19, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is really awesome to read<br/>\nFrom what I'm reading there's a lot of sorceress power<br/>\nWas bard spell casting useful or was it mostly bard song/curse song? I'd presume Improved invisibility / Keen weapon would have been handy from the bard side of things...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:22 AM - Oct 19, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You can create a socket item on WoG that has 15 DR vs Slashing/Bludgeon/Piercing, which is \"only\" 5 less than a Gr. Belt, which will both relieve the need to swap AND free up your Girdle/Belt slot.<br/>\n<br/>\nNice read on your Lolth adventures - that area is top notch for challenge on WoG solo play wise.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "8:59 PM - Oct 19, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"17368\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17368&amp;sid=8c8b04bbeffb93903fa4a2eef550d187#p17368\">↑</a><div class=\"responsive-hide\">Oct 19, 2019</div></cite>This is really awesome to read<br/>\nFrom what I'm reading there's a lot of sorceress power<br/>\nWas bard spell casting useful or was it mostly bard song/curse song? I'd presume Improved invisibility / Keen weapon would have been handy from the bard side of things...</div></blockquote>\nUnfortunately, I haven't used bard spells against Lolth/drow priestesses/drow wizards, as they cast greater dispelling and (for Lolth) also Mords, wearing them all in a second. Furthermore, Lolth casted dispels more than one time in the same fight, and dispelled all my buffs but the ability ones (bulls/endurance), so shields, premonitions and bard spells are to be avoided to save slots for further casting. You can use them for the fight in the demonweb pits, as\n<details><summary>Spoiler</summary>there are two areas that can let you rest (after that some enemies have been beaten).\n</details>\nI tried, in the second fight, to immediately (after being teleported to the centre of the arena) cast time stops and bigby's 5 nd 6 after Mords on her, but she quickly dispelled them (don't remember if she has casted a Mords on herself, like I did against the Bigby 7 that traitor casted against my other PC).<br/>\nFor bards spellcasting, I have used improved invisibility/wounding whispers/invisibility/empowered cat's grace/mage armor/ultravision/darkness/war cry when fighting drow rogues and weapon masters, as drow priestess always use, in their first two turns, a greater dispelling (the alternative is a greater ruin, way worse as their greater dispelling dispels only the air around them).<br/>\nAlso the balrogs continuously casted dispel, so (in fear of being dispelled and waste turns for re-casting spells) I chose not to cast anything bard-related.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "9:46 PM - Oct 19, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"17369\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17369&amp;sid=8c8b04bbeffb93903fa4a2eef550d187#p17369\">↑</a><div class=\"responsive-hide\">Oct 19, 2019</div></cite>You can create a socket item on WoG that has 15 DR vs Slashing/Bludgeon/Piercing, which is \"only\" 5 less than a Gr. Belt, which will both relieve the need to swap AND free up your Girdle/Belt slot.<br/>\n<br/>\nNice read on your Lolth adventures - that area is top notch for challenge on WoG solo play wise.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk</div></blockquote>\nYou mean the items whose name is coloured in teal?<br/>\nWestra has found something in her online adventures....nevermind, I will try to have it in the server: this is great news, as it will avoid the nuisance of changing belt in each fight, and free up three quickslot in the main bar (nice advantage). I fear that I need three gems, one for each damage reduction type...it would be too good to have in only one slot all three DRs...<br/>\n<br/>\nInto the fight with Lolth I used the green socketable morningstar, filled in with the gems I found (keen/str +3/enhancement +3). Keen helped much against Lolth (couldn't use other morningstar due to her elemental immunities).<br/>\n<br/>\nThank you, your previous warnings led me to equip as many heal potions and Leomunds as possible; however, Leomunds only worked in drow area, and not in demonweb pits and related areas.<br/>\nThis is the second time I defeat Lolth and her minions without devastating critical, but the first playthrough (bard26/figh4/ rdd10) was easier as I spammed haste and improved invisibility wands, and had lasting inspiration, and a capped 50 strenght....now I understood how resource draining are the demonweb pits.<br/>\n<br/>\nBy the way, I have read some posts into the WoG forum, where DM Raine strongly recommended (if not prohibited) to avoid fights in areas, due to the fact that the next adventurer would have found twice the enemies (previous ones + new spam). If my understanding is correct, that means that the invisibility + run away strategy (without returning to clear the area) is to be considered only as an exception to avoid suicide missions. Is that true?<br/>\nIn my playthroughs, offline modules, I have almost always fought the enemies near me or that can see me, so to be prepared for server play.<br/>\n<br/>\nI'll make an example just to make the question clearer:<br/>\n<details><summary>Spoiler</summary>Northern Critwall, area \nIs this behaviour compliant with the server rules?\n</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}