{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "502",
  "name": "17Wizard/7Cleric/6Monk Spellsword, Level 30",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/17wizard-7cleric-6monk-spellsword-level-30-t515508.html",
  "author": "NwnwhiteBoy",
  "avatar": "no_avatar.png",
  "replies": "22",
  "views": "1.6K",
  "posts": [
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "6:16 AM - Oct 15, 2011",
      "content": "<div>Okay, I know that I breaking the Cleric at least 15 levels, and so on but, I had a thought and was wondering what you guys thought of it. I know its probably really bad but I want to see if it is even an aright concept.<br/>\n<br/>\nSo here is a Level 30, character that can be played on Arelith.<br/>\n<br/>\n<br/>\nCleric(7), Wizard(17), Monk(6), Human<br/>\n<br/>\nSTR: 8<br/>\nDEX: 15<br/>\nCON: 12<br/>\nWIS: 15 (22)<br/>\nINT: 16 (19)<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Cleric(1): Ambidexterity, Two-Weapon Fighting, Domain Strength, Domain Trickery<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Scribe Scroll<br/>\n04: Cleric(4): INT+1, (INT=17)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): Expertise<br/>\n07: Cleric(7)<br/>\n08: Monk(1): WIS+1, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}, (WIS=16)<br/>\n09: Wizard(1): weapon Focus: Kama<br/>\n10: Wizard(2)<br/>\n11: Wizard(3)<br/>\n12: Wizard(4): INT+1, Blind Fight, (INT=18)<br/>\n13: Wizard(5): Extend Spell<br/>\n14: Wizard(6)<br/>\n15: Wizard(7): Improved Critical: Kama<br/>\n16: Wizard(8): WIS+1, (WIS=17)<br/>\n17: Wizard(9)<br/>\n18: Wizard(10): Improved Two-Weapon Fighting, Silent Spell<br/>\n19: Wizard(11)<br/>\n20: Wizard(12): WIS+1, (WIS=18)<br/>\n21: Monk(2): Epic Weapon Focus: Kama, {Deflect Arrows}<br/>\n22: Wizard(13)<br/>\n23: Wizard(14)<br/>\n24: Wizard(15): WIS+1, Armor Skin, Great Intelligence I, (WIS=19), (INT=19)<br/>\n25: Wizard(16)<br/>\n26: Monk(3)<br/>\n27: Monk(4): Great Wisdom I, (WIS=20)<br/>\n28: Monk(5): WIS+1, (WIS=21)<br/>\n29: Monk(6): {Knockdown, Improved Knockdown}<br/>\n30: Wizard(17): Great Wisdom II, (WIS=22)<br/>\n<br/>\n<br/>\n<br/>\nHitpoints: 202<br/>\nSkillpoints: 229<br/>\nSaving Throws (Fortitude/Will/Reflex): 17/26/15<br/>\nSaving Throw bonuses: Spells: +7, Mind Effects: +2<br/>\nBAB: 16<br/>\nAB (max, naked): 18 (melee), 18 (ranged)<br/>\nAC (naked/mundane armor/shield only): 27/30<br/>\nSpell Casting: Cleric(4),Wizard(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 33(34), Discipline 32(31), Heal 33(39), Listen 32(38), Lore 33(37), Spellcraft 33(37), Tumble 30(32), remaining skillpoints 3<br/>\n<br/>\n<br/>\nThis is using DP for the AB only, nothing else. Monk for AC and speed and Wizard for the Buffing spells which are not DP and DF. this was just a thought, it probably really bad, and I NEVER have made a spell caster before.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:27 AM - Oct 15, 2011",
      "content": "<div>LOL, too early for you to try this combo out. This is simply a horrible build. Cleric 7 sucks, why bother with it? Your DP will last 7 rounds, that's NOTHING! Wizards also get Scribe Scroll for FREE at level 1, you spent a feat on it. At a lvl 30 cap it's IMPOSSIBLE to build a good Wizard Cleric, even worse in a server where you need to take 3 Monk levels mandatory and in a row. Mate, forget about this class combo for your server and also leave it alone for now, as it`s a REALLY ADVANCED AND INTRICATE build to play. That said, it doesn't work in a lvl 30 cap, but at level 40, it's not only doable but excellent!<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=7&amp;t=89\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.44.forumer.com/viewt ... p?f=7&amp;t=89</a>My Magical Master build<br/>\n<br/>\nThat one is probably untoppable as THE SINGLE BEST WAY to make a Wizard/Cleric. There might be different tweaks here and there, and personal preference like whether to make him a dual-kama fighter or a single kama, but the core is the best possible spread and distribution. Take a look at it.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "6:37 AM - Oct 15, 2011",
      "content": "<div>Was expecting it to be REALLY bad.  <br/>\nAnd I must have over look Scribe scroll. xD The 7 round DP didn't even occur to me at the time but it makes perfect sense.<br/>\n<br/>\nI am glade however that if I was not caught up in a 30 level cap, and levelling rules, I could have made a very nice build..<br/>\nAlso, what's Illusionist? Sub-class of wizard?</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "8:57 AM - Oct 15, 2011",
      "content": "<div><blockquote><div><strong>NwnwhiteBoy wrote:</strong>Was expecting it to be REALLY bad.  <br/>\nAnd I must have over look Scribe scroll. xD The 7 round DP didn't even occur to me at the time but it makes perfect sense.<br/>\n<br/>\nI am glade however that if I was not caught up in a 30 level cap, and levelling rules, I could have made a very nice build..<br/>\nAlso, what's Illusionist? Sub-class of wizard?</div></blockquote>\n\nIllusionist is a specialist, which gives you an extra slot at every lvl. Clerics can get Divine Power at lvl 3 so you can extend it. Your levelling is wrong, you must take 3 monk in a row, might as well do 4 to preserve a little BAB. If you'd do it 15Cleric/6monk/Wizard 9 then perhaps. Just perhaps. There are som nice Arcane buffs, and you could forget going above 15 INT, right. I think I'll take a look at that split.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "12:40 PM - Oct 15, 2011",
      "content": "<div>Cleric(15), Monk(6), Illusionist(9), Human<br/>\n<br/>\nSTR: 8<br/>\nDEX: 16<br/>\nCON: 12<br/>\nWIS: 16 (24)<br/>\nINT: 14 (15)<br/>\nCHA: 8<br/>\n<br/>\n01: Cleric(1): Ambidexterity, Two-Weapon Fighting, Domain Trickery, Domain Strength<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Weapon Finesse<br/>\n04: Cleric(4): WIS+1, (WIS=17)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): <strong>Expertise or Blind Fight</strong><br/>\n07: Cleric(7)<br/>\n08: Cleric(8): WIS+1, (WIS=18)<br/>\n09: Cleric(9): Extend Spell<br/>\n10: Cleric(10)<br/>\n11: Cleric(11)<br/>\n12: Cleric(12): WIS+1, Improved Two-Weapon Fighting, (WIS=19)<br/>\n13: Cleric(13)<br/>\n14: Cleric(14)<br/>\n15: Monk(1): Weapon Focus: Kama, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n16: Monk(2): WIS+1, {Deflect Arrows}, (WIS=20)<br/>\n17: Monk(3)<br/>\n18: Cleric(15): Improved Critical: Kama<br/>\n19: Illusionist(1): {Scribe Scroll}<br/>\n20: Illusionist(2): WIS+1, (WIS=21)<br/>\n21: Illusionist(3): Epic Weapon Focus: Kama<br/>\n22: Monk(4)<br/>\n23: Illusionist(4)<br/>\n24: Illusionist(5): WIS+1, Armor Skin, Great Intelligence I, (WIS=22), (INT=15)<br/>\n25: Illusionist(6)<br/>\n26: Illusionist(7)<br/>\n27: Monk(5): Epic Prowess<br/>\n28: Illusionist(8): WIS+1, (WIS=23)<br/>\n29: Illusionist(9)<br/>\n30: Monk(6): Great Wisdom I, {Knockdown, Improved Knockdown}, (WIS=24)<br/>\n<br/>\nHitpoints: 234<br/>\nSaving Throws <br/>\nFortitude 18<br/>\nWill 27<br/>\nReflex 16<br/>\nSaving Throw bonuses: Spells: +6, Mind Effects: +2<br/>\n<br/>\nBAB: 19<br/>\nAB (max, naked): 26 (melee), 23 (ranged)<br/>\nAC (naked/mundane armor/shield only): 29/30<br/>\nSpell Casting: Cleric(8),Wizard(5)<br/>\n<br/>\nSkillpoints: 177<br/>\nConcentration 33(34)<br/>\nDiscipline 33(32)<br/>\nHeal 20(27)<br/>\nListen 33(40)<br/>\nSpellcraft 28(30)<br/>\nTumble 30(33)<br/>\n<br/>\nI think this fella could perform okay. Delaying the last Cleric lvl is necessary to get the kama feats. There is xp-penalty at lvl 19 and from 25 too life. Your ECL with the wizard lvls will offset this to a degree though.<br/>\nSpellslots, wizard: 0:5 - 1st lvl:6 - 2nd lvl:6 - 3rd lvl:4 - 4th lvl:3 - 5th lvl:2<br/>\nShould mainly be for extra buffing, or even some utility spells.<br/>\nex.: Grease, Acid Sheathe, Bigby's interposing hand, Lesser spell mantle, Stoneskin, Elemental shield, Keen Edge, Haste, Knock. And if you want to use Cleric slots for Divine Favor, Divine Power you can Cats Grace etc from Wizard list. Extended, they'd be okay. Forget damage spells entirely.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:24 PM - Oct 15, 2011",
      "content": "<div>Grim, Why don't you stop Wisdom at 18 and raise DEX with the remainder? If you're going to melee and you're not going for lvl 9 spells, why would you bother with 24 WIS? I would recommend ending with 15 INT, 18 WIs and 22 DEX for 3 extra AB. <br/>\n<br/>\nActually, if you lower Monk to 4, you can get Wizard 11, the bonus feat from Wizard is taken as Great INT and you can have Extended Mestil's Acid Sheath, IGMS and Bigby lvl 6 to deal with casters. You lose some speed, KD and IKD, but IMO it's worth it, since any DEX Cleric / Monk has very high AC and AB, so KD and IKD are definitely not a must.<br/>\n<br/>\nI still maintain that the OP endures the learning process before trying out something like this. To effectively play a toon like this well, you need to know ALL SPELLS IN THE GAME very well and in which situations to use them. IMO not the kind of thing a new guy should start with.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "3:52 PM - Oct 15, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong>Grim, Why don't you stop Wisdom at 18 and raise DEX with the remainder? If you're going to melee and you're not going for lvl 9 spells, why would you bother with 24 WIS? I would recommend ending with 15 INT, 18 WIs and 22 DEX for 3 extra AB. </div></blockquote>\nWell, I thought extra spells and AC which won't be gone since there is no uncanny. But of course, 3 AB is better. I blame my shortage of time.  You trade +3 AB for -1 AC and 4 spellslots.<br/>\n<blockquote><div><strong>Maximillian Kane wrote:</strong>Actually, if you lower Monk to 4, you can get Wizard 11, the bonus feat from Wizard is taken as Great INT and you can have Extended Mestil's Acid Sheath, IGMS and Bigby lvl 6 to deal with casters. You lose some speed, KD and IKD, but IMO it's worth it, since any DEX Cleric / Monk has very high AC and AB, so KD and IKD are definitely not a must.</div></blockquote>\nOh, that's what I would've done, but I thought I'd drop posting alternatives so far. And no, getting it at lvl30 is not a must at all. If you can get by that far without, you can get by forever.<br/>\n<blockquote><div><strong>Maximillian Kane wrote:</strong>I still maintain that the OP endures the learning process before trying out something like this. To effectively play a toon like this well, you need to know ALL SPELLS IN THE GAME very well and in which situations to use them. IMO not the kind of thing a new guy should start with.</div></blockquote>\nThis build is not a walk in the park, but the steeper the learning curve, the faster the learning. If he wants to play it, he'll probably do it anyway.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "1:30 AM - Oct 16, 2011",
      "content": "<div>So Illusionist is Wizard with illusion Spell area selected?<br/>\n<br/>\nAlso, I was just flinging ideas out there so I could become a better builder faster, I probably wound play this, but it taking time of my study just making them let alone playing them for now. (Don't study any way because I get distracted by forums )<br/>\n<br/>\nThis may sound naive but, apart from the 7 rounds of DP (which I do realize is HORRIBLE!!!) and the over looked scribe scroll from Wizard. Why is this so terrible? The saves aren't bad, the AC is about the same as other level 30 builds I looked at, and the AB is 37ish whit 6 attacks about(can't remember exactly) 37,34,32,37,32,27? <br/>\n<br/>\nI'm not doubting it is just wondering why it is.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "5:08 AM - Oct 16, 2011",
      "content": "<div><blockquote><div><strong>NwnwhiteBoy wrote:</strong>So Illusionist is Wizard with illusion Spell area selected?</div></blockquote>No. <br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Spell_school\" rel=\"noreferrer\" target=\"_blank\">Spell school</a><br/>\n<br/>\nAn illusionist is a wizard specializing in the school of illusion: this implies a bonus to spellcraft checks to identify spells from the illusion school, a malus to same checks to identify spells from the opposing school (enchantment), the impossibility to cast/learn/memorize spells (also from scrolls) of the opposing school and +1 spell/spell level chosen from any spell in the spellbook. Apart the spellcraft bonus it has nothing to do with illusion spells, as you can see. Illusion is typically chosen because it is opposed by enchantment which is by many considered expendable, at least is certain circumstances.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "7:28 AM - Oct 16, 2011",
      "content": "<div><blockquote><div><strong>NwnwhiteBoy wrote:</strong><br/>\nThis may sound naive but, apart from the 7 rounds of DP (which I do realize is HORRIBLE!!!) and the over looked scribe scroll from Wizard. Why is this so terrible? The saves aren't bad, the AC is about the same as other level 30 builds I looked at, and the AB is 37ish whit 6 attacks about(can't remember exactly) 37,34,32,37,32,27? <br/>\n<br/>\nI'm not doubting it is just wondering why it is. </div></blockquote>\nDP can be extended, even in your build. But just 2 casts or so.<br/>\n<br/>\nWhy it's horrible? It isn't horrible, but you should at least take Weapon Finesse. Also, as I was adviced, stop increasing Wisdom, 16's enough, really. Put the rest in DEX. With 7 lvls of Cleric 16 should suffice. Then come back and check your number. You can call it 14 rounds of Glory. <br/>\n<br/>\nI hate trying to set up the attack schedule with Divine Power, Haste, Flurry and Dual-wielding kama monks, but one thing is for sure, you'll get 10 APR. The offhand will always be at max AB/max AB-5 I think(-2 for dual-wield), even with flurry. To figure the rest, build it, test it in combat debugging.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "9:19 AM - Oct 16, 2011",
      "content": "<div>Okay, I get that illusionist is now thanks <br/>\n<br/>\nThanks for telling me how to improve!! If Excel didn't die when I was saving I'd try but I haven't got the time ATM. <br/>\n<br/>\nThe Lots of WIS and INT was for Spell slots. (for more extended DP and more DP un-extended)</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:33 PM - Oct 16, 2011",
      "content": "<div>This build is horrible IMO because Cleric there does ABSOLUTELY NOTHING! The only way you will see how bad it is is by comparing it with the one suggested by Grim and with the alterations I suggested. You have to understand certain things first, which is exactly why I said it's best to leave this class combo for later and start with something simpler. Here is the catch: At a level 30 cap, you DON'T HAVE ENOUGH LEVELS to get what is best of this class combo, which basically is full clerical goodies and all arcane spells, plus EMA (Epic Mage Armor) and EW (Epic Warding). Epic Warding requires 34 Spellcraft, so it's simply UNATTAINABLE in Arelith unless it's been modified, as you'd have to be lvl 31 to have 34 ranks in spellcraft. So the lvl 30 caps makes it so that you have to choose between Cleric power and Wizard power. If you, as you did in your original build, go for all wizard spells, Cleric becomes practically useless except for DP, and your pre-epic BAB is so much lower (because you're forced to take many levels of Wizard pre-epic and even waste the Wizard 5 bonus feat in something other than Great Intelligence). All your pre-epic BAB shortage will be \"temporarily replaced\" by Divine Power, but seriously, you'll have 3 extended DPs a day for 14 rounds, and the rest of the time you just won't hit anything. Compare that to a lvl 15 Cleric with 16 WIsdom that will have 6 to 8 Extended Divine Powers that last for 30 rounds and 4-6 regular Divine Powers that last for 15 rounds, and on top of that, an even higher number of Divine Favors that give +5 to AB and damage as opposed to your build's +2. Your Magic Vestment gives you +2 Armor AC, where the 15 Cleric version would give +5. Are you beginning to see how bad it is?<br/>\n<br/>\nIf you go the other way, like in the build Grim proposed, you won't have access to some of the Wizard's best spells, like Time Stop, Bigby Hands, Modenkainen's Disjunction, Premonition, Shadow Shield, etc. You won't get any epic spells, you won't be able to empower IGMS or extend Mestil's Acid Sheath (you will only have 2 slots of lvl 6 spells so you can extend it but then you won't have IGMS or Bigby lvl 6). So either way you don't get the best of both worlds. I suggest you leave this combo alone if you're going to play on a lvl 30 cap, but if you move somewhere with a lvl 40 cap, it's a whole new world!<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "4:10 PM - Oct 16, 2011",
      "content": "<div>Well 30 caps are lame  haha.<br/>\n<br/>\nCompletly see where you're coming from!! The whole thing is impractical. For 30 cap  even though the spells for one class are there, I don't have enough space or length with them to work properly, and once DP is gone completely screwed.<br/>\n<br/>\nHowever going and trying this build as a level 40, I would have success? ( if not getting excessive amounts of WIS and INT) Well at least MORE success, than at level 30.<br/>\n<br/>\nAnd I do think I shell heed your advice and wait untill later to start making arcane and divine mixed builds! <br/>\nGet one caster class down at a time, I am thinking!!!! <br/>\n<br/>\nThanks for taking the time to explain to me why this will be completely fail at a level 30 cap with only my level of building skill!! Again very, very appreciative for your time and advise!</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "6:18 PM - Oct 16, 2011",
      "content": "<div>You can build well working cleric/mages in a lvl 40 environment. Max should have posted one, right dude?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:46 AM - Oct 17, 2011",
      "content": "<div><blockquote><div><strong>KailPendragon wrote:</strong>You can build well working cleric/mages in a lvl 40 environment. Max should have posted one, right dude?</div></blockquote>\n\nYeah, i've posted a link to it somewhere in this thread and I believe the OP has already seen it, that's where his doubts about \"illusionist\" came to be.</div>"
    },
    {
      "author": "NwnwhiteBoy",
      "avatar": "no_avatar.png",
      "timestamp": "4:30 AM - Oct 17, 2011",
      "content": "<div>Have seen it and that is where my doubts about Illusionist came form</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "10:32 AM - Oct 17, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nIf you go the other way, like in the build Grim proposed, you won't have access to some of the Wizard's best spells, like Time Stop, Bigby Hands, Modenkainen's Disjunction, Premonition, Shadow Shield, etc. You won't get any epic spells, you won't be able to empower IGMS or extend Mestil's Acid Sheath (you will only have 2 slots of lvl 6 spells so you can extend it but then you won't have IGMS or Bigby lvl 6). So either way you don't get the best of both worlds. I suggest you leave this combo alone if you're going to play on a lvl 30 cap, but if you move somewhere with a lvl 40 cap, it's a whole new world!<br/>\n<br/>\nTake it EZ!</div></blockquote>\nSo what you're basically saying now, is that this build is good at lvl 40, but crap between lvl15 and around 35 somewhere? So in any envirionment where you won't be playing a lot after 40, just forget it?<br/>\n<br/>\n*edit* critical typo....</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:38 PM - Oct 17, 2011",
      "content": "<div><blockquote><div><strong>Grimnir wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nIf you go the other way, like in the build Grim proposed, you won't have access to some of the Wizard's best spells, like Time Stop, Bigby Hands, Modenkainen's Disjunction, Premonition, Shadow Shield, etc. You won't get any epic spells, you won't be able to empower IGMS or extend Mestil's Acid Sheath (you will only have 2 slots of lvl 6 spells so you can extend it but then you won't have IGMS or Bigby lvl 6). So either way you don't get the best of both worlds. I suggest you leave this combo alone if you're going to play on a lvl 30 cap, but if you move somewhere with a lvl 40 cap, it's a whole new world!<br/>\n<br/>\nTake it EZ!</div></blockquote>\nSo what you're basically saying now, is that this build is good at lvl 40, but crap between lvl15 and around 35 somewhere? So in any envirionment where you be playing a lot after 40, just forget it?</div></blockquote>\n\nNope, that's not what I'm saying. This is how I see it: I play all my toons knowing what I'll get, that means I'm willing to endure a little (or big) difficulty period to acheive something in a build. Now this build specifically, lags a lot until you start getting the meaningful Wizard spells (from 5 spell levels on). That's when you get Extended Improved invisibility, Bigby 5, Mestil's, then Bigby 6, Greater Stoneskin, IGMS, Extended Mestil's, Greater Spell Breach, Shadow Shield, Spell Mantle, Bigby 7, Premonition, Empowered IGMS, Mord's, Greater Spell Mantle, Time Stop and Bigby 9 (I'm not really a fan of Bigby 8). Now the OP said that the Bigby hands in his server have a Reflex save, so nearly all of them are gimped for use. Anyway, At level 33 you get lvl 9 spells, at 31 you get lvl 8 spells and at 29 you WOULD get lvl 7 spells if it weren't for the restriction of 3 levels in a row for each class. You must agree that all the HP and BAB sacrifice and the lag you need to endure while you're getting your Wizard levels up (till around Wizard 9) is too much to be able to reach only 6 arcane spell levels and WAY LATE in the build (I'm considering my suggested alteration of a 15 11 4 final spread, otherwise not even those spells are available). I have played my Magical Master build from 1-40 SEVERAL times and in all of them it`s been MOST POWERFUL from lvl 29 on (in my spread), which is when you start to get high-level arcane spells. No Cleric 15 build will be weak in a low-mid magic environment EVER unless there's been nerfs to the cleric spells, but when compared to the power you COULD HAVE from lvl 33 on, enduring all that to never quite get it is just not worth it IMHO.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "4:51 PM - Oct 17, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><blockquote><div><strong>Grimnir wrote:</strong>So what you're basically saying now, is that this build is good at lvl 40, but crap between lvl15 and around 35 somewhere? So in any envirionment where you <strong>won't</strong> be playing a lot after 40, just forget it?</div></blockquote>\n\nNope, that's not what I'm saying.......but when compared to the power you COULD HAVE from lvl 33 on, enduring all that to never quite get it is just not worth it IMHO.</div></blockquote>\n Okay, not quite what you were saying, but not too far from it either, then.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:09 PM - Oct 17, 2011",
      "content": "<div><blockquote><div><strong>Grimnir wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong><blockquote><div><strong>Grimnir wrote:</strong>So what you're basically saying now, is that this build is good at lvl 40, but crap between lvl15 and around 35 somewhere? So in any envirionment where you <strong>won't</strong> be playing a lot after 40, just forget it?</div></blockquote>\n\nNope, that's not what I'm saying.......but when compared to the power you COULD HAVE from lvl 33 on, enduring all that to never quite get it is just not worth it IMHO.</div></blockquote>\n Okay, not quite what you were saying, but not too far from it either, then. </div></blockquote>\n\nI guess, in a way. But I do sort of \"dream\" about the next good character feature I'm going to get when I'm playing my toons, and that's what keeps me going forward. Right now, Maximillian Kane (my Magical Master build) is lvl 37 in WoG and I can't wait for lvl 39, when I get EMA and EW! In this case, my \"dreamed\" features would never come, so I wouldn't be all that eager to play it through. But you're right, I kind of exaggerated a bit when I said it's worthless, it's not worthless, but it's kind of like getting a cheap engine into a Ferrari, you know? Oh! The speed it COULD'VE reached if I had bought the full package!</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "1:06 AM - Oct 18, 2011",
      "content": "<div>I am not sure if this is on topic or not, but it is food for thought.<br/>\n<br/>\nA long, long, long time ago, in a galaxy far away...  ok.. it  it was 2004!  SO about the same year ECB started.<br/>\n<br/>\nThe build was The Red Mage  <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build150360.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 50360.html</a><br/>\n<br/>\nThis is a straight 23 wiz/17 cleric with Dev crit!  Yep, sounds great right?  Well, it was my nemesis for about 4 or 5 YEARS!  No matter how I worked it, it never really achieved what I wanted out of such a build.  Even when I played PRC and had access to Eldric knight, it never really was exceptional.  <br/>\n<br/>\nI remember a discussion I had with Tengudor_t and he laughed.  it was just a CONCEPT build, and idea, not for play!  And he is right.  As fun as it is to mix up the 2 schools of spells, the DC just arent that great.  You end up being a level 40 character that has the spells of level 20 characters (in this case), and it never really gets to be epic.  Trust me, i even used the class Heirophant (which grants +10 to ALL spell DC, even arcane spells).  It was better, but still fell short, imo.  iirc, i even used 23 cleric levels (divine levels) cuz in PRC you get access to ALL epic spells with ANY caster class.  <br/>\n<br/>\nWith a build like this (using Intelligence), you NEED to have Full Plate.  Monk, while nice, wont have the wisdom boost with only 7 class levels (which grants you +2 to everything!! woopppeee).  I like the originality of the level mixes, but that is as far as i like the idea.  <br/>\n<br/>\nWith 30 levels, you really have to specialize. If 40 doesnt really work, then 30 is going to work even less, depending on the environment (maybe the areas are toned down too, which may make it work better..  17/13 sort of thing).</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:06 AM - Oct 18, 2011",
      "content": "<div><blockquote><div>You end up being a level 40 character that has the spells of level 20 characters (in this case), and it never really gets to be epic. Trust me, i even used the class Heirophant (which grants +10 to ALL spell DC, even arcane spells). It was better, but still fell short, imo. iirc, i even used 23 cleric levels (divine levels) cuz in PRC you get access to ALL epic spells with ANY caster class. \n</div></blockquote>\n\nI'm sorry, but you're wrong about this. VERY wrong. It's pretty common knowledge that you should use only NO-SAVE spells on a low ability caster. Now you saying that you have the same spells as a lvl 20 caster leads me to believe you're not using the correct spells. What you say is right, you do have the same spells or casting prowess of a lvl 20 caster, but it's AWESOME, not bad!!! With most of the useful spells, the difference between the effects of dedicated casters vs this build is minimal or ZERO, except for lvl 9 Cleric spells and a few others, like Blade Barrier. Here's a rough list:<br/>\n<br/>\n- Time Stop: Same with any caster level.<br/>\n<br/>\n- Mord's: The Breach effect ALWAYS works regardless of level, the Dispelling one is good against any non-dedicated caster / self buffer (low-mid caster levels).<br/>\n<br/>\n- Bigby Hands: Only duration is worse, all the other features work exactly the same (in default NWN, as I understand in this case specifically, the server has modified them)<br/>\n<br/>\n- Premonition: Will absorb a total of 230 points of damage (10 per caster lvl), instead of 300 (capped).<br/>\n<br/>\n- Spell Mantle line: Pretty much only duration varies<br/>\n<br/>\n- Shadow Shield: Only duration varies.<br/>\n<br/>\n- IGMS: Exactly the same.<br/>\n<br/>\n- Mestil's Acid Sheath: loses up to 34 points of damage (2 per caster level and doesn't cap)<br/>\n<br/>\n- Improved Invisibility: Only duration varies.<br/>\n<br/>\n- All stat buffs: The same (Wizards also get access to Cat's Grace without requiring a domain to boost DEX)<br/>\n<br/>\n- Magic Missile: Same<br/>\n<br/>\nNow on the Cleric side:<br/>\n<br/>\n- Lvl 9 Cleric spells: Not very useful, as they all allow a save to be made. In some situations, Implosion or SoV MIGHT work, but not often enough that you can rely on them.<br/>\n<br/>\n- Word of Faith: Works the same<br/>\n<br/>\n- Blade Barrier: Loses DC (but you can keep a target immobile by throwing a Bigby 9 at him and watch him die with your Blade Barriers having to roll the saves every single round, which will in part make up for the lower saves with more rolls)<br/>\n<br/>\n- Harm: Works the same (even better with True Strike in case you get dispelled, as an instant back-up +20 to AB getaway clause, and you can finish off the guy with Magic Missile after a successful Harm)<br/>\n<br/>\n- All Cleric buffs: same, except Battletide, which will have a lower DC.<br/>\n<br/>\nNow as for the Monk part of it, here's what you may not be realizing: I think Monk isn't the problem, I think trying to make a Strength build is the problem. Making a Dex-based Wizard / Cleric / Monk you don't need Auto-still feats, your AC will be higher than any full-plate counterpart and so will your INITIATIVE, which means your Time Stop will be the first one to work. That is usually enough for you to kill any single opponent at any given time. <br/>\n<br/>\nThe \"weakness\" of a build like this only shows if you try to use SoV's, Fire Storms, Wails of the Banshee and such spells. This class combo REALLY has a spell for every situation as long as you follow the guideline of staying away from save spells. Going Hierophant wouldn't work, as even with +10 to DCs, they'll be low most of the time.<br/>\n<br/>\nIn short, as long as you try to stay away from save spells and use metamagic feats to make sure you have many no-save spells at your disposal, this combo is a MONSTER.</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "7:00 AM - Oct 18, 2011",
      "content": "<div>Oh the passion!  LOL<br/>\n<br/>\nMonster?  I tended to worry about leveling a character all the way through, playing areas at or above the character level I was at to maximize xp per kill as I never played on servers for very long that gave extra boss xp (xp per kill was cappd at 300, and typical was less than 100).  With this build you have a stretch where you are gaining nothing much from the wizard levels, imo, COMPARED to other possibilities.  I NEVER played a character dependant on others to level or kill.  I can see level 33 being where you now have enough to start having the arcane side being a threat, but i never liked 16 levels to get there. <br/>\n<br/>\nAnd in the end, while it is nice to have all no save spells, the KILLERS require saves, thus DC.  <br/>\n<br/>\nIf you look at the outline, it also has Dev crit, which minimizes (with autostills) really any extra feats you can play around with.  If you were going a straight caster, then I could see it being a monster.  That was NEVER my play style however (the reason I messed around with it so long to find the right tweak for me).  <br/>\n<br/>\nOh yee of little faith!  Heiro works insanely!  I used that with a 19 base wisdom cleric with NO difficulties (obviously, in a PRC environment).  <br/>\n<br/>\nIn the end, I was also the insane guy who wished for the release of the Mystic Theurge PRC... <a class=\"postlink\" href=\"http://www.nwnprc.com/manual/index.html\" rel=\"noreferrer\" target=\"_blank\">http://www.nwnprc.com/manual/index.html</a>  which makes the entire discussion moot (as now, you can have caster level of 39 with both magics).  Unfortunately, I was also trying to figure Dev crit into that guy, but using a vanilla races, it was impossible to get the stats to do it.  <br/>\n<br/>\nI am glad the combo works for you Max.</div>"
    }
  ]
}