{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "505",
  "name": "Arelith Best Builds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-best-builds-t515425.html",
  "author": "lightningkmf",
  "avatar": "no_avatar.png",
  "replies": "10",
  "views": "14.7K",
  "posts": [
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "12:03 AM - Aug 28, 2011",
      "content": "<div>Hello, I am trying to form a chart of some of the strongest builds that could exist on Arelith. On Arelith the max level is 30.  You can only add +1 abilities and +2 skills to items... there are a few crafted exceptions but not many. Your helmet, armor, and shield can have a +3 ac modifier to them.  The best crafted blade can have +3 ab and + 6 slash or blunt. Only weapons with no properties on them can have a spell cast on them and you can only cast one enchantment per item. (so if you cast GMW then you can not cast darkfire).  You can use ranger lvls as a prereq for the Arcane Archer prestige class.  If you have any more rule questions then I will be happy to help inform you. <br/>\n<br/>\nSo far here are some of the conclusions I have come too. <br/>\n<br/>\n<strong>BEST STEALTH BUILD</strong><br/>\n<strong>19 rogue 6 monk 5 fighter</strong><br/>\nReason: This character has a pretty high stealth damage while getting monk APR (attacks per round) progression and the addition of monk ac. You will be able to basically go into a fight and throw 10 knockdown attempts and keep doing that till they fall down. Once they fall down then your sneak will tear them apart. <br/>\n<br/>\nI also think the rogue 16 CoT 10 Fighter 4 is good but I like the previous more... I might put this as second though. <br/>\n<br/>\n<strong>BEST BATTLE PRIEST</strong><br/>\n? (Not my area of expertise)<br/>\n<br/>\n<strong>BEST MELEE MAGE</strong><br/>\n? (Not my area of expertise)<br/>\n<br/>\n<strong>BEST WELL ROUNDED FIGHTER</strong><br/>\n<strong>bard 16 CoT 10 ftr 4 </strong><br/>\nReason: I say well rounded because the way i have composed this build I do not just try to push to be as strong of a melee fighter as possible. I also take feats for increased saves as I look at my excel sheet i see that it ends with a highest ab of 32 . 28/24/24 (fort/will/reflex) after items and bard buffs you could easily mold yourself to destroy melee types or immune to many caster spells. <br/>\n<br/>\n<strong>BEST NO MAGIC MELEE</strong><br/>\n? (Not my area of expertise)<br/>\n<br/>\n<strong>BEST DIVINE CASTER</strong><br/>\n<strong>Cleric 27 Monk 3</strong><br/>\nReason: I have not done as much here as I probably should to be posting the best build... Even though 27/3 is a pretty simple breakdown it works. You get a huge ac boost from monk wis ac bonus and tumble. Be sure to get a spell focus in Evocation and just laugh extremely strong Implosion spells at your enemies. <br/>\n<br/>\n<strong>BEST ARCANE CASTER</strong><br/>\n<strong>Sorc 26 Pally 4 </strong><br/>\nReason: This one was kinda tough to say. I have not used this build on a server yet but I have built it and messed with it on test servers. Its a beast. Its not necissarily a pure caster though. You end up using divine armor and might to obliterate your enemies. <br/>\n<br/>\nI also like wizard 26 rogue 4 for the extreme customization of spells and the abiltiy to steath up to your enemy fully buffed before freezing time and unleashing Wail of the Banshee. But I probably have to say the previous build is stronger. <br/>\n<br/>\n<strong>BEST ARCHER</strong><br/>\n? (Not my area of expertise)<br/>\n<br/>\n<strong>BEST BUILD</strong><br/>\n<strong>Druid 24 Monk 6</strong><br/>\nReason: I really don't like this build or the rp that goes with it..... I have to admit though. Dragon shape with this build is just unreal.. This build will allow you to destroy armies of enemy 30s. It really is that good. <br/>\n<br/>\nI wrote this rather quickly and will try to come back later and format it more. I really am looking forward to hearing your thoughts. I hope that you are able to point out all the flaws that I have in my thinking so that I can learn even more. Let me know if you have any questions or if you would like I can write out the full version of these builds. Let me know if I forgot any categories you would like to add to this list. <br/>\n<br/>\nEnjoy</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:59 AM - Aug 28, 2011",
      "content": "<div><blockquote><div><strong>lightningkmf wrote:</strong>Hello, I am trying to form a chart of some of the strongest builds that could exist on Arelith. On Arelith the max level is 30.  You can only add +1 abilities and +2 skills to items... there are a few crafted exceptions but not many. Your helmet, armor, and shield can have a +3 ac modifier to them.  The best crafted blade can have +3 ab and + 6 slash or blunt. Only weapons with no properties on them can have a spell cast on them and you can only cast one enchantment per item. (so if you cast GMW then you can not cast darkfire).  You can use ranger lvls as a prereq for the Arcane Archer prestige class.  If you have any more rule questions then I will be happy to help inform you. \n</div></blockquote>\nI would suggest gathering this very useful information along with that from other Arelith faithful and posting to the PW subforum as dedicated topic.  In that way, as soon as any build is tagged as one to be used on Arelith anyone can gain/refresh their acquaintance with its idiosyncrasies in a central location.  It's up to you folks from Arelith to keep it as accurate as possible, though.\n<blockquote><div>\nSo far here are some of the conclusions I have come too. \n</div></blockquote>\nToo large a list for me to tackle in one session, especially sight-unseen, so I'll comment only on a few quickly...\n<blockquote><div>\n<strong>BEST STEALTH BUILD</strong><br/>\n<strong>19 rogue 6 monk 5 fighter</strong><br/>\nReason: This character has a pretty high stealth damage while getting monk APR (attacks per round) progression and the addition of monk ac. You will be able to basically go into a fight and throw 10 knockdown attempts and keep doing that till they fall down. Once they fall down then your sneak will tear them apart. <br/>\n<br/>\nI also think the rogue 16 CoT 10 Fighter 4 is good but I like the previous more... I might put this as second though. \n</div></blockquote>\nAm assuming a DWing kama DEX build here which depends on a paucity of crit/sneak immunes to be effective.  If it isn't there already, I would advise Crippling Strike which can neutralize even the toughest STR-based foes.  A STR-based version wouldn't be very stealthy.\n<blockquote><div>\n<strong>BEST ARCANE CASTER</strong><br/>\n<strong>Sorc 26 Pally 4 </strong><br/>\nReason: This one was kinda tough to say. I have not used this build on a server yet but I have built it and messed with it on test servers. Its a beast. Its not necissarily a pure caster though. You end up using divine armor and might to obliterate your enemies. \n</div></blockquote>\nProbably a mini-version of the Exalted Sorceress, the cream of caster builds.\n<blockquote><div>\nI also like wizard 26 rogue 4 for the extreme customization of spells and the abiltiy to steath up to your enemy fully buffed before freezing time and unleashing Wail of the Banshee. But I probably have to say the previous build is stronger.\n</div></blockquote>\nWith Greater Sanctuary at least 26 rounds (extended double that), why muck it up with rogue levels, and why even the 4th level?  Seldom do serious wizs allocate to DEX so the benefits of UD are pretty much lost.  3 Monk levels would be better IMO for the 10% speed boost (assuming robes here) and still get Evasion and monk robes/boots.  I love UMD myself, but much of its value will be lost with an arcane caster (scrolls of Mord, Time Stop, Gtr Sanctuary, rods, wands, etc.).\n<blockquote><div>\n<strong>BEST ARCHER</strong><br/>\n? (Not my area of expertise)\n</div></blockquote>\nThat should be easy.  A DEX-based elven bard/fighter/AA.  So much for this list for the time being....<br/>\n<br/>\nWe need to actually view a <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=21&amp;t=7\" rel=\"noreferrer\" target=\"_blank\">properly-formatted build</a> itself to make any worthwhile comments.  Just the class split with a brief outline offers little.  I wouldn't post them all together in a single topic either.  What you can do is post the individual builds in the appropriate build subforum (Level 30 builds from what I gather) and then list all the links in this thread like <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=6&amp;t=100\" rel=\"noreferrer\" target=\"_blank\">this</a>.  You can amend the list as more builds are submitted.<br/>\n<br/>\nIf they are requests, describe in detail the goals which are desired and post them into the Request forum.<br/>\n<br/>\nHope this helps spark you on your journey!  Good luck!</div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "8:42 PM - Aug 28, 2011",
      "content": "<div>In your archer build would you divide it 16 bard 10 AA 4 ftr?</div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "9:41 PM - Aug 28, 2011",
      "content": "<div>and can you think of anything stronger than a druid monk with dragonshape?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "10:33 PM - Aug 28, 2011",
      "content": "<div><blockquote><div><strong>lightningkmf wrote:</strong>In your archer build would you divide it 16 bard 10 AA 4 ftr?</div></blockquote>\nI was thinking more along the lines STR8/DEX20(30)/CON12/WIS8/INT12/CHA12, FTR6/BRD6/AA18, 300 HP, Base AB of 46 w/longbow, Bard 2 spells, Lingering Song, Curse Song, Called Shot, Rapid Shot, Dodge, EWS w/skills UMD, Tumble, Spellcraft, Traps but may need to move start abilities around to get skills.  Haven't worked it all out yet but there will be a single level with 20% XP penalty yet otherwise none.  Level 18 AA will get 14d6 imbue arrows.  Could be much better on a server with single dump levels but there it is fer ya regardless.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "10:50 PM - Aug 28, 2011",
      "content": "<div><blockquote><div><strong>lightningkmf wrote:</strong>and can you think of anything stronger than a druid monk with dragonshape?</div></blockquote>\nI would bet a high-level cleric could drop it's HP down to almost nothing with a single cast of Harm rather easily since its SR is quite low.  Naturally, equipment could provide immunities and raise SR higher but we are speaking of basic empowerment, right?  As far as I am concerned, clerics own NWN with the possible exception of an equally high level sorcerer.<br/>\n<br/>\nIt really depends on the nerfs your server has made to the overpowering spell repertoire.  But for vanilla NWN, I will choose cleric power anytime.</div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "11:54 PM - Aug 28, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>lightningkmf wrote:</strong>and can you think of anything stronger than a druid monk with dragonshape?</div></blockquote>\nI would bet a high-level cleric could drop it's HP down to almost nothing with a single cast of Harm rather easily since its SR is quite low.  Naturally, equipment could provide immunities and raise SR higher but we are speaking of basic empowerment, right?  As far as I am concerned, clerics own NWN with the possible exception of an equally high level sorcerer.<br/>\n<br/>\nIt really depends on the nerfs your server has made to the overpowering spell repertoire.  But for vanilla NWN, I will choose cleric power anytime.</div></blockquote>\n\nWould you think that a battle priest would be best or a caster cleric?   If battle priest do you think 19 cleric/6monk/5ftr is the best? For caster what do you prefer?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:04 AM - Aug 29, 2011",
      "content": "<div><blockquote><div><strong>lightningkmf wrote:</strong><br/>\nWould you think that a battle priest would be best or a caster cleric?   If battle priest do you think 19 cleric/6monk/5ftr is the best? For caster what do you prefer?</div></blockquote>\nA Battle Cleric can be both... just the ability to penetrate SR would be much lower than with a purer cleric.  Also, since a Battle Cleric must split ability bumps between WIS and either STR or DEX (unless going into Zen Archery), spell DCs would also be lower.  However, the battle version has more versatility which is why many folks prefer them.  Monk is a synergy class for AC and a compensation for typical cleric feat starvation, among other uses (i.e. kama wielding with monk progression).<br/>\n<br/>\nAt least 24 levels of cleric are necessary to assure relative indispellability of buffs (the strength of a Battle Cleric), so that would be a prerequisite of a reliable Battle Cleric build.  Therefore, Cleric 19 would be rather easy to dispel. I believe there have already been a few discussions of the Battle Cleric used for Arelith 30 Level cap builds which you may find educational.  The Build Requests section may have some of these already documented.<br/>\n<br/>\nWhat works \"best\" on a Level 40 cap server may not obtain the same level of efficiency on a Level 30 cap server so you would need to factor that into the comparison. <br/>\n<br/>\nAgain... some of the uberness of cleric spells have been nerfed for balancing purposes on certain servers, so one would need to take that into account before deciding on the best course of action (i.e. how to build it most effectively).<br/>\n<br/>\nOne thing to keep in mind when you try to evaluate the effectiveness of builds in general is that there are MANY MANY builds that can dominate large mobs of average to somewhat difficult hostiles (like a DevCrit WM scyther)  The best builds are those that can handle high DR, high SR, high HP, highly-concealed and mantled taunting, IKD spammers without flinching.  Those are rare, but that is where the power of the build is best realized.</div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "8:18 PM - Aug 29, 2011",
      "content": "<div>Intersesting.. So with your philosophy of needing 24 cleric levels would you propose a 24 cleric/6 monk as the best character then?   The reason I mentioned the 18 cleric/6 monk/6 fighter is because Kail brings it up in the thread <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=10&amp;t=94\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.44.forumer.com/viewt ... ?f=10&amp;t=94</a></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:47 AM - Aug 30, 2011",
      "content": "<div><blockquote><div><strong>lightningkmf wrote:</strong>Intersesting.. So with your philosophy of needing 24 cleric levels would you propose a 24 cleric/6 monk as the best character then?   The reason I mentioned the 18 cleric/6 monk/6 fighter is because Kail brings it up in the thread <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=10&amp;t=94\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.44.forumer.com/viewt ... ?f=10&amp;t=94</a></div></blockquote>\nI didn't infer that at all.  All I stated was to maintain indispellable buffs you need at least 24 levels in cleric (or any caster, for that matter). Kail's suggested build was in direct response to the OP's original class split.  Dispellable buffs is one of the prices to pay to dual-wield kamas in that build (too dang many feats needed with a cleric).  Even with a DEX variant, another feat would be needed (Finesse) so within 30 levels there is only so much you can achieve, especially within the 3-level minimums (and indispellability is not one).  How Kail would rank the relative priorities in such a build?... well, that is a question best directed to him.<br/>\n<br/>\nDon't get too hung up with the term \"best\".  Best is in the mind of the beholder.  It has a lot to do with how a particular player can utilize a build within the chosen environment. For example, if someone has a personal aversion to wielding kamas then one that features kamas may not be \"best\" in their minds.  I don't care for them myself but can still acknowledge their utility to reach certain statistical advantages (like qualifying to use the sweet monk progression, slashing damage and finessable). <br/>\n<br/>\nAnother example, a Cleric 25/SD5 would be a nifty nondispellable caster DEX build with HiPS and other dexxy features, but limited to simple weapons and weapon/shield (no DW).  If one feels simple weapons are inferior or if the server provides superior weapons of only a different category, that build will also not be satisfactory to a potential user.  It wouldn't be \"best\" to them.<br/>\n<br/>\nAlso, you should further limit your planned compilation to either PvM or PvP and state that clearly in the description because the 2 categories are worlds apart. Also, I don't think there are many experienced PvP players in the guild (though I may be wrong about that).</div>"
    },
    {
      "author": "Atypical",
      "avatar": "no_avatar.png",
      "timestamp": "1:31 AM - Oct 16, 2011",
      "content": "<div>A few points to make about some of the things listed here:<br/>\n<br/>\n1) Yes, weapon buffs aren't stackable. With one exception: Bless Weapon. Which, while only working vs undead, could open up some build options.<br/>\n<br/>\n2) 24 levels to be undispellable works, unless the dispeller took Epic Spell Focus: Abjuration, which gives him +6 to dispel checks on this server.<br/>\n<br/>\n3) Ranger levels count towards the prereq for AA. You mentioned Bard/Fighter/AA, but Ranger/AA/??? could also work.<br/>\n<br/>\n4) For your \"Best Divine Caster\", you'll have to remember that since you have to take the first 3 levels in a new class in a row, you'll end up taking monk for the first time around 26 / 27 for Tumble dumps.<br/>\n<br/>\n5)\n<blockquote><div>I also like wizard 26 rogue 4 for the extreme customization of spells and the abiltiy to steath up to your enemy fully buffed before freezing time and unleashing Wail of the Banshee.</div></blockquote>\n\n(From arelith.com's front page):<br/>\nRULE 2: Abide by the Rules of Engagement<br/>\n<br/>\nCombat actions and political actions against other PC's (PvP) MUST BE INTERACTIVELY ROLE PLAYED. That means: you interact, they interact, BEFORE any battle occurs. No exceptions. If your character is killed by another PC (or vice versa), you must wait one realtime day before participating in PvP or interacting in any way with that PC or other hostile PCs from the battle unless both sides explicitly agree otherwise. You are always free to take flight from PvP. Having an opposite or evil alignment is not sufficient reason for PvP action. Before attacking another player the dislike state must be activated.</div>"
    }
  ]
}