{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "348",
  "name": "The Faceless:  Rogue 19 / Fighter 20 / Shadowdancer 1",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-faceless-rogue-19-fighter-20-shadowdancer-1-t515357.html",
  "author": "Demos",
  "avatar": "no_avatar.png",
  "replies": "1",
  "views": "3.2K",
  "posts": [
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "8:50 PM - Jul 12, 2011",
      "content": "<div>Here is my spin on the classic Rog/Ftr/SD combination.  The inspiration for this guy came as I was originally tweaking Tattoed Monk's <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build304886.html\" rel=\"noreferrer\" target=\"_blank\">Versatile Stealth Warrior</a>.  I kept the basic premise:  stealthy warrior with HiPS who can dish out multiple damage types depending on the foe.  However, my tweaks became a bit more than minor (as you'll see ) and I'm quite pleased with the outcome.<br/>\n<br/>\n~~~~~~~~~~~~~~~~~~~~<br/>\nThe negotiations were going badly.  In fact, disastrous may have been a better description.<br/>\n<br/>\nCaptain Logan Shoreman shook his head and let out a deep sigh.  The separatists had successfully staged an almost impossible operation - the kidnapping of the visiting Celene ambassador and her entourage.  This action was unbelievable on so many different fronts that the captain thought surely divine intervention was at work.<br/>\n<br/>\n\"Sir!\"<br/>\n<br/>\nLogan looked around and saw his corporal running towards him.  Corporal Sudo Windfoot was obviously in distress and moving as fast as his Halfing legs would take him.<br/>\n<br/>\n\"What is it Corporal?\"<br/>\n<br/>\n\"It's the separatists, sir,\" huffed Sudo.  The exertion was causing the halfing to take breaths in between words.  \"They're threatening to kill the hostages, one every hour, if their demands aren't met.\"<br/>\n<br/>\n\"Take it easy, Sudo.  And take a breath.  Hostage takers always make that threat, you know that.\"<br/>\n<br/>\n\"I know, Captain, but they're threatening to kill the Ambassador's daughter first!\"<br/>\n<br/>\n~~~~~~~~<br/>\n<br/>\nThe negotiations were going well.  In fact, much better than expected.  Concessions had been made and the ultimate prize didn't seem far off.  Morkul looked at the huddled group of prisoners and snickered, his bony arm with its hanging flesh absently scratching his chin.<br/>\n<br/>\n\"You better hope the Council gives in to our demands.  Otherwise, it's not going to be pretty for you.\"<br/>\n<br/>\nThe last comment caused a rousing laughter among Morkul's men, and some of them began pointing at the potential examples to send to the Watch.  Despite the conditions, one young Elven lass spoke up.<br/>\n<br/>\n\"You call yourselves separatists?  You're no better than common bandits!  Why do you think the Council will even want to bargain with you?\"<br/>\n<br/>\nMorkul fixed the girl with a hard stare.  \"You've just signed your death wish Elf.  I think we just found our first volunteer.\"<br/>\n<br/>\nThe Elf did not flinch at those undead eyes and continued.  \"If I was in the Council, I'd grant your wish to secede from Greyhawk, just so that I could know where your worthless hides were.  Then I'd bring an army and ...\"<br/>\n<br/>\n\"Shut up!  That's it, I've had enough of your mouth!  Donan, tie her up and gag her.  We'll give the Council 2 hours to accept our demands.  Otherwise, they'll have to explain why they let such an important dignitary die while under their protection.\"<br/>\n<br/>\n~~~~~~~~~<br/>\n<br/>\nThe hour was getting late.  Logan had received the Morkul's ultimatum but had not heard a response from the Council.  There was only 30 minutes until the deadline and he was at a loss of what to do.  He kept watching the building and could spot the various separatists moving about.  As much as he wanted to send his troops in to end it, he knew that it would only accelerate Morkul's threat of slaughtering everyone he held.<br/>\n<br/>\n~~~~~~~~~~<br/>\n<br/>\nThe darkness was a welcome ally for Erzik.  Not that he needed it but it would make his job much easier.  A man as muscular as Erzik and armed and armored for battle should have been easily spotted, but he hadn't earned the nickname \"The Faceless\" without good cause; you only saw his face if he wanted you to, and typically that was the last face anyone saw.<br/>\n<br/>\nHe quietly made his way to the hostage takers' building and entered, easily avoiding both Greyhawk city guards and separatists alike.  Once inside, he quickly located where the separatists held the captives and noted how they were positioned and any repetitive movements they made.  The big one in the middle must have been Mokul.<br/>\n<br/>\nRetracing his steps, Erzik laid traps at hallway junctions and doorways and snuffed out any torches.  He needed to make sure the hostages were allowed adequate time to escape once the rescue began.  Satisfied his preparations were in order, he returned to the main hostage room, where Murkul and 4 of his cronies surrounded the hostages.<br/>\n<br/>\n\"Times up!\" Murkul shouted to the guards outside.<br/>\n<br/>\n\"Wait!\" came the reply from Logan.  \"We've sent a messenger to the Council and they're gathering the ransom!\"<br/>\n<br/>\n\"Bah, you're just stalling.  Make sure you tell that to the...\"<br/>\n<br/>\nBefore Murkul could finish, a blade punched through his chest.  Stumbling forward and snarling with rage, he whirled around, yanking the blade out of his assailant's grasp.<br/>\n<br/>\n\"What?  Who...  How...\" stuttered Murkul.  He looked around and his four companions were face down in pools of blood while the hostages were making for a hasty exit.<br/>\n<br/>\n\"Who dares?!  Fools!  Guards, kill the hostages!\" shouted Murkul as he began the incantations of a spell.<br/>\n<br/>\nBefore he could complete it, a heavy flail appeared out of thin air and struck him across his face.  A second blow hit his legs, knocking him down.  He raised his skeletal arm to block a third but his arm shattered at the impact.  More blows followed...<br/>\n<br/>\nLogan heard the fighting and shouting and immediately called for the guards to storm the building.  Sounds of explosions and screams soon echoed in the night as Erzik's traps were set off by Murkul's men.  By the time Logan made it upstairs, all the resistance had ended.  Other than the 4 men he had left guarding the hostages, Murkul's men were mostly alive, either stunned or held in place by Erzik's traps.<br/>\n<br/>\n\"They're in the next room, Captain.  Alive.\" whispered a voice in Logan's ear, sending shivers up his spine.  As expected, when he turned around, there was no one there.<br/>\n<br/>\n~~~~~~~~~~~<br/>\n<br/>\n<strong>The Faceless:  Rogue(19), Fighter(20), Shadowdancer(1)</strong><br/>\n<br/>\nHuman<br/>\nAny alignment<br/>\nPlayable 1-40 PvM (testing in progress on WoG)<br/>\n<br/>\nSTR: 16 (32)<br/>\nDEX: 14<br/>\nCON: 14<br/>\nWIS: 10<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Rogue(1): Toughness, Dodge<br/>\n02: Fighter(1): Weapon Focus: Scimitar<br/>\n03: Fighter(2): Knockdown, Weapon Focus: Heavy Flail<br/>\n04: Fighter(3): Str+1, (STR=17)<br/>\n05: Fighter(4): Weapon Specialization: Heavy Flail<br/>\n06: Rogue(2): Mobility, {Evasion}<br/>\n07: Rogue(3): {Uncanny Dodge I}<br/>\n08: Fighter(5): Str+1, (STR=18)<br/>\n09: Rogue(4): Blind Fight<br/>\n10: Rogue(5)<br/>\n11: Rogue(6)<br/>\n12: Rogue(7): Str+1, Improved Critical: Scimitar, (STR=19)<br/>\n13: Rogue(8)<br/>\n14: Rogue(9)<br/>\n15: Rogue(10): Power Attack, Improved Evasion<br/>\n16: Fighter(6): Str+1, Cleave, (STR=20)<br/>\n17: Rogue(11)<br/>\n18: Fighter(7): Improved Knockdown<br/>\n19: Fighter(8): Great Cleave<br/>\n20: Rogue(12): Str+1, (STR=21)<br/>\n21: Fighter(9): Great Strength I, (STR=22)<br/>\n22: Shadowdancer(1): {Hide in Plain Sight}<br/>\n23: Fighter(10): Epic Weapon Focus: Heavy Flail<br/>\n24: Fighter(11): Str+1, Epic Will, (STR=23)<br/>\n25: Fighter(12): Overwhelming Critical: Scimitar<br/>\n26: Fighter(13)<br/>\n27: Rogue(13): Great Strength II, Slippery Mind, (STR=24)<br/>\n28: Fighter(14): Str+1, Devastating Critical: Scimitar, (STR=25)<br/>\n29: Fighter(15)<br/>\n30: Rogue(14): Great Strength III, (STR=26)<br/>\n31: Rogue(15)<br/>\n32: Rogue(16): Str+1, Epic Skill Focus: Hide, (STR=27)<br/>\n33: Fighter(16): Great Strength IV, Epic Weapon Specialization: Heavy Flail, (STR=28)<br/>\n34: Fighter(17)<br/>\n35: Fighter(18): Epic Weapon Focus: Scimitar<br/>\n36: Fighter(19): Str+1, Great Strength V, (STR=30)<br/>\n37: Rogue(17)<br/>\n38: Rogue(18)<br/>\n39: Fighter(20): Great Strength VI, Armor Skin, (STR=31)<br/>\n40: Rogue(19): Str+1, Epic Skill Focus: Move Silently, (STR=32)<br/>\n<br/>\nHitpoints: 442<br/>\nSkillpoints: 351<br/>\nSaving Throws (Fortitude/Will/Reflex): 22/20/22<br/>\nSaving Throw bonuses: Traps: +4<br/>\nBAB: 27<br/>\nAB (max, naked): 41 (melee), 29 (ranged)<br/>\nAC (naked/mundane armor/shield only): 22/32<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nCraft Trap 6(8), Disable Trap 39(43), Discipline 42(53), Hide 43(55), Move Silently 43(55), Open Lock 10(12), Search 8(10), Set Trap 39(43), Spot 40(40), Tumble 40(42), UMD 41(40)<br/>\n<br/>\n<strong>Notes</strong><br/>\n1.  Has Weapon Specialization in the heavy flail to maximize damage against crit-immune mobs - pick any weapon flavor but I like flail because it's bludgeoning<br/>\n2.  Dev Crit line of feats - I chose scimitar because of the crit range and you can Keen it.  If you have keen rapiers aplenty on your world then it may not matter.<br/>\n3.  He is a plate armor wearing nightmare so don't hesitate to use him as a front-line fighter.  Obviously he's most effective when he can get those sneaks in.<br/>\n4.  Traps...and lots of them.  He's 2 points shy of dropping Epic Traps (I think) so he can lay down a field of surprises.  Downside is he can't craft any, except the most basic, so you may wish to trade some of the Disable/Set Trap points for Craft Traps if you can't buy traps on your world.<br/>\n5.  Epic Will (lev 24) and Slippery Mind (lev 27) chosen because of his miserable Will save.  Most melee rogue types (except with CoT) suffer from this anyway but always good to keep some Clarity potions and Prot from Align scrolls around.<br/>\n6.  No Epic Prowess...just ran out of feats.  Swap it for Armor Skin if you prefer offense to defense.<br/>\n7.  No Crippling Strike...used the slot for Slippery Mind (see # 5 above).  Also, if the mob is crit/sneak immune then CS doesn't do much good.  If the mob is not, you can Dev Crit...<br/>\n<br/>\n<br/>\nComments, questions and flames welcome!</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "5:40 PM - Jul 13, 2011",
      "content": "<div>I suggest going for epic trapping skills they are just so close it's a \"waste\" stopping a few points shy of them. If True seeing is readily available then spot can be dropped and that search needs some love (you wanna spot traps right?). Craft trap is environmental, you can easily not care about it at all if traps are sold regularly or you can pump it up (and on WoG you get both craft trapping enhancing gear and true seeing  )<br/>\n<br/>\nMe, I would get crippling strike over slippery mind. The latter applies only vs spells by the way, so it doesn't cover the whole will save spectrum and through UMD or gear a rogue can over his will save usually. CS fires in different circumstances than dev crit does, so it is still worth getting imo.<br/>\n<br/>\nAnyhow, solid build. It's difficult to go wrong with a FTR/Rogue, it's a well working combo.</div>"
    }
  ]
}