{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "293",
  "name": "Dragon Slayer (Sword) Bard8 RDD10 CoT22",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/dragon-slayer-sword-bard8-rdd10-cot22-t2294858.html",
  "author": "TyrTemplar",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "5.9K",
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "7:20 PM - Oct 27, 2012",
      "content": "<div><strong>Dragon Slayer- Bard(8), Red Dragon Disciple(10), Champion of Torm(22)<br/>\nBy Deborah \"Tyr\" Templar</strong><br/>\n<blockquote><div><strong>Author’s Note</strong>: <br/>\nThis build is one of two characters in my Dragon Slayer series published in the ECBII on May 28, 2008 (NWN-MoTB), and found here, <a class=\"postlink\" href=\"http://ecb2nwn2.faerunonline.com/builds/data2/30build297081.html\" rel=\"noreferrer\" target=\"_blank\">http://ecb2nwn2.faerunonline.com/builds ... 97081.html</a> . The characters in this series were adapted from builds designed for the ECBII (NWN2 first 20) and published March 4, 2007, being modified from one of my earlier series of the same name as designed originally for NWN1 and published in the ECB1 on June 2, 2006. The series is being revisited in light of the 1.69 Patch, it being about the Dragon Slayer: a brave and noble knight who, in the process of slaying dragons finds himself bathed in dragon blood, the magical properties of which transform him into a half-dragon himself. Whereas this build, the Dragon Slayer (Sword) is a melee warrior which focuses on the sword,  the other character focuses on the Song, being two different aspects of dragons of old, and which were equally known for their ferocity, strength and prowess in battle as they were their magic and song, and which aspects this series examines in turn. To see the other character and/or In the event you should prefer the Song over the Sword, see: <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/dragon-slayer-song-bard24-rdd10-cot6-t2294923.html\" rel=\"noreferrer\" target=\"_blank\">dragon-slayer-song-bard24-rdd10-cot6-t2294923.html</a> . What follows is the tale of the Dragon Slayer, with the build (Dragon Slayer, Sword variant)following immediately after in the very next post. <br/>\n<br/>\nMay the legend of the Dragon Slayer live on! ~ Tyr</div></blockquote>\n<strong>The Tale of the Dragon Slayer</strong><br/>\nBy Deborah \"Tyr\" Templar<br/>\n<br/>\nA long time ago, on a tiny blue planet called Earth, before the human-kin, there lived the dragons. Gold ones, red ones, black, green and blue, their colors and alignments all represented, like varying colors of different shades and intensity that come together to make a rainbow. These dragons fought amongst themselves, some for wisdom, others for hunting grounds, with others still fighting for gold; neither good nor evil in the truest sense were the dragon-kin, in whom all the alignments were represented, with the differences bringing balance into the world, and thus being necessary. The dragon wars raged on for centuries, and then, one day, there suddenly came human-kin.<br/>\n<br/>\nIt is said, in ancient Chinese scripture, that a demi-goddess, being half-goddess, and half-drake, is responsible for the appearance of the human-kin, whom she created secretly one day while sun basking near a river bank, in accordance with a secret recipe known only to the god-kin. The creation lore of the North American Indians teaches us that it was a raven who was responsible for human kin, and the Ancient Chinese would not necessarily disagree, so far as they also believed that dragons were shape-shifters, able to take any form they pleased, with many enjoying the bird form or so it is believed. It is a difficult question, for which the likes of human kin may never know the answer, other than that, as humans, we think, and therefore we are. And yet, that the dragons roamed the ancient world, what we now think of as dinosaurs, lends credence to these stories.<br/>\n<br/>\nWhat we know from these ancient stories is that the dragon, whatever its form, was a wise and magical beast, which are said to have visited a number of ancient Chinese philosophers. These dragons appeared out of curiosity, as they were curious to find out more about these new beasts called humans. On finding that the human kin could think and speak, these dragons were delighted, with some generously sharing their teachings. Some of these dragon teachings, it is further said, found its way into the ancient book of Confucius, whose own learned readings, some say, included some ancient writings drafted by those while keeping the company of a dragon. Whether or not a dragon is responsible for some of the Confucians’ thinking, we may never know. But we do know from Ancient Europe that this friendship between the dragons and man-kin was sparse at best, and at worse non-existent. In short, most dragons did not like this new beast called man-kin, whom they saw as a threat, taking over their lands and hunting grounds, always sneaking off with their gold, and constantly insisting on interrupting their peaceful dragon songs. No, to interrupt dragon music, regardless of a dragon’s alignment, was to a dragon an utter sin: as a result, a great number of dragons detested the man-kin. While many went out of their way to avoid humans entirely, others were bent on destroying him. And yet, the dragon wars raged on, with whole towns and villages destroyed in the process; puny humans. In the dragon wars, there were many human casualties.<br/>\n<br/>\nAt least this was the relationship between humans and dragons as seemed to exist in Old Europe, in that part of the world now known as Great Britain, which suffered a peculiar dragon infestation problem. There, a long time ago, it was taken as a scientific fact that dragons were a constant menace to human society, being responsible for every disaster, from geysers and poisonous gas, to earthquakes and forest fires: science was certain that it was dragons who were responsible for all the chaos in nature, and that dragons were out to destroy humans; although few who ever encountered a real, live dragon lived to tell the tale, there were survivors of the dragon wars. Be they innocent villagers whose entire village had just been destroyed by dragon quake or dragon fire, or brave and noble knights who made it their life’s mission to save human-kind by chasing after the dragon beasts, there were Britons who did not need science to confirm what they had witnessed with their own eyes: thar be beasts roaming about the lands, and those beasts be dragons. <br/>\n<br/>\nOne of these survivors was the Dragon Slayer, a brave and noble knight, specially commissioned by the King to hunt down the dragons. Wherever they struck, wherever they roamed, the Dragon Slayer was out to protect the people, and secure justice for the land. He was a hero of the people, a legendary knight, and his appearance alone gave the people hope, where they had none before. The Dragon Slayer was their champion and, when he fought, he fought with all the hope and the prayers of the people: they were in his heart, as he was in theirs. Their thoughts and their prayers were at all times with him.<br/>\n<br/>\nAnd for the people, he delivered: slaying dragons all about the lands. Big ones, little ones, red, green, and blue: he did it for the people. His name was shouted all across the land, a hero he was, and the people loved him for it. But the dragons knew of him, too. <br/>\n<br/>\nOne day, while the Dragon Slayer was camping out in the woods on a dragon hunt, an ancient red dragon came upon him and knew instantly who he was. In one foul breath of fire, the ancient red blew, and then swallowed up the Dragon Slayer whole, including his tent: an evil red, for sure, but by no means stupid. <br/>\n<br/>\nGasping for breath, and rudely awoken from his rest, confused, the Dragon Slayer had but a few seconds to react, before becoming a pile of dragon goo. Quick thinking, the Dragon Slayer pulled out a blade, a tiny dagger, from his breaches, and set quickly to work. With great strength and tenacious ferocity, the Dragon Slayer slashed at the Dragon’s innards, and with a great gush of blood pouring forth from the Dragon, the Dragon Slayer managed to cut his way through. The evil red was dumb founded and confused, seriously wounded; it hesitated, not knowing exactly what to do. <br/>\n<br/>\nReaching, quickly, for his blade, which he had hung earlier that evening in a tree before turning in, the Dragon Slayer reacted. With thundering speed, great strength and precision, the Dragon Slayer’s blade came crashing down upon the evil red’s throat, and in an instant, it was over. The red came crashing to the ground, dead, its blood flowing, like a river, and splattering the Dragon Slayer thoroughly. Although he had been victorious, yet another dragon downed by his blade, another notch for his belt, the Dragon Slayer also fell to the ground, exhausted and burned, and covered in dragon blood. He could barely breathe.<br/>\n<br/>\nNo one knows exactly how much time passed while the Dragon Slayer lay out in the woods, but many say that the ordeal changed the Dragon Slayer forever. Some say that the great and legendary Dragon Slayer died that day; others insist that that’s simply not true. What is known is that the effects of the dragon blood is magical, filled with potent properties, and that such properties worked their magic on the Dragon Slayer, bringing him back to life from the brink of exhaustion, by mixing in with his own blood, and in short, rearranging his molecular structure. One day, awoken from his woodland sleep, he heard music: dragon music, and was surprised to see that he could not only breathe fire, but had also sprouted wings; dragon fire and dragon wings. Born of the human kin, he was now dragon kin; half-human, half-drake. Where his adventures next took him, no one can be certain: that he’s still out there, somewhere, slaying the evil dragons, in between his new ability to hear and perform the dragons’ song is, however, what some believe. <br/>\n<br/>\nThe next time you look to the sky, and see a bird singing in the tree, you might reflect upon this story, and ask yourself the following question: is that bird, up there in the tree, is it really just a bird singing, or might it instead be a dragon perhaps even the Dragon Slayer, trying to speak? <br/>\n<br/>\nWHAT FOLLOWS is the DRAGON SLAYER (Sword Variant).</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "7:28 PM - Oct 27, 2012",
      "content": "<div><strong>Dragon Slayer (Sword)--Bard(8), Red Dragon Disciple(10), Champion of Torm(22)</strong><br/>\n<br/>\n I Attributes:<br/>\n STR: 17 (40)<br/>\n DEX: 10<br/>\n CON: 14 (16)<br/>\n WIS: 8<br/>\n INT: 14 (16)<br/>\n CHA: 11 (13)<br/>\n<br/>\n Race: Human. Alignment: Non-Lawful, Non-Evil (Theme: Chaotic Good)<br/>\n<br/>\n II. Level Guide:<br/>\n 01: Bard(1): weapon proficiency martial, power attack<br/>\n 02: Bard(2)<br/>\n 03: Bard(3): cleave<br/>\n 04: Bard(4): STR+1, (STR=18)<br/>\n 05: Bard(5)<br/>\n 06: Bard(6): curse song<br/>\n 07: Red Dragon Disciple(1)<br/>\n 08: Red Dragon Disciple(2): STR+1, (STR=21)<br/>\n 09: Red Dragon Disciple(3): weapon focus<br/>\n 10: Red Dragon Disciple(4): (STR=23)<br/>\n 11: Champion of Torm(1)<br/>\n 12: Champion of Torm(2): STR+1, blind fight, armor proficiency heavy, (STR=24)<br/>\n 13: Champion of Torm(3): {Smite Evil}<br/>\n 14: Champion of Torm(4): knockdown<br/>\n 15: Champion of Torm(5): great fortitude (PvP), OR, Expertise (PvM/E)<br/>\n 16: Champion of Torm(6): STR+1, improved critical, (STR=25)<br/>\n 17: Champion of Torm(7)<br/>\n 18: Champion of Torm(8): Toughness*; Great cleave<br/>\n 19: Champion of Torm(9)<br/>\n 20: Bard(7): STR+1, (STR=26)<br/>\n 21: Champion of Torm(10): overwhelming critical, devastating critical<br/>\n 22: Red Dragon Disciple(5)<br/>\n 23: Red Dragon Disciple(6)<br/>\n 24: Red Dragon Disciple(7): STR+1, great strength I, (STR=28), (CON=16)<br/>\n 25: Red Dragon Disciple(8)<br/>\n 26: Red Dragon Disciple(9): (INT=16)<br/>\n 27: Red Dragon Disciple(10): epic fortitude (PvP), OR, IKD(PvM/E), {Darkvision}, (STR=32), (CHA=13)<br/>\n 28: Champion of Torm(11): STR+1, (STR=33)<br/>\n 29: Champion of Torm(12)<br/>\n 30: Champion of Torm(13): great strength II, (STR=34)<br/>\n 31: Champion of Torm(14): epic weapon focus<br/>\n 32: Champion of Torm(15): STR+1, (STR=35)<br/>\n 33: Champion of Torm(16): great strength III, (STR=36)<br/>\n 34: Champion of Torm(17)<br/>\n 35: Champion of Torm(18): epic prowess<br/>\n 36: Champion of Torm(19): STR+1, great strength IV, (STR=38)<br/>\n 37: Champion of Torm(20)<br/>\n 38: Champion of Torm(21)<br/>\n 39: Champion of Torm(22): great strength V, armor skin, (STR=39)<br/>\n 40: Bard(8): STR+1, (STR=40)<br/>\n<br/>\n<span style=\"color:#FF0000\"><strong>Skill Schedule</strong><br/>\n 01: Discipline(2), Listen(2), Lore(4), Perform(2), Spellcraft(4), Taunt(4), UMD(4), Save(6),<br/>\n 02: Discipline(1), Listen(1), Lore(1), Perform(3), Spellcraft(1), Tumble(5), UMD(1),<br/>\n 03: Discipline(2), Listen(1), Lore(1), Spellcraft(1), Taunt(1), UMD(1),<br/>\n 04: Discipline(1), Listen(2), Lore(1), Spellcraft(1), Taunt(1), UMD(1),<br/>\n 05: Lore(1), Perform(3), Spellcraft(1), Taunt(1), UMD(1),<br/>\n 06: Discipline(2), Listen(1), Spellcraft(1), Taunt(2), UMD(1),<br/>\n 07: Discipline(2), Listen(2), Spellcraft(1),<br/>\n 08: Discipline(1), Listen(2), Spellcraft(1), Save(1),<br/>\n 09: Discipline(1), Listen(1), Spellcraft(1), Save(3),<br/>\n 10: Discipline(1), Listen(1), Spellcraft(1), Save(5),<br/>\n 11: Discipline(1), Save(9),<br/>\n 12: Discipline(1), Save(13),<br/>\n 13: Discipline(1), Save(17),<br/>\n 14: Discipline(1), Save(21),<br/>\n 15: Discipline(1), Save(25),<br/>\n 16: Discipline(1), Save(29),<br/>\n 17: Discipline(1), Save(33),<br/>\n 18: Discipline(1), Save(37),<br/>\n 19: Discipline(1), Save(41),<br/>\n 20: Discipline(1), Listen(7), Perform(3), Taunt(14), Tumble(15), UMD(8),<br/>\n 21: Discipline(1), Save(4),<br/>\n 22: Discipline(1), Spellcraft(8),<br/>\n 23: Discipline(1), Spellcraft(4),<br/>\n 24: Discipline(1), Listen(2), Spellcraft(2),<br/>\n 25: Discipline(1), Listen(4),<br/>\n 26: Discipline(1), Listen(3), Spellcraft(1),<br/>\n 27: Discipline(1), Listen(1), Spellcraft(2), Save(2),<br/>\n 28: Discipline(1), Save(7),<br/>\n 29: Discipline(1), Save(12),<br/>\n 30: Discipline(1), Save(17),<br/>\n 31: Discipline(1), Save(22),<br/>\n 32: Discipline(1), Save(27),<br/>\n 33: Discipline(1), Save(32),<br/>\n 34: Discipline(1), Save(37),<br/>\n 35: Discipline(1), Save(42),<br/>\n 36: Discipline(1), Save(47),<br/>\n 37: Discipline(1), Save(52),<br/>\n 38: Discipline(1), Save(57),<br/>\n 39: Discipline(1), Save(62),<br/>\n 40: Discipline(1), Listen(13), Perform(4), Spellcraft(12), Taunt(20), Tumble(20),</span><br/>\n<br/>\n III. Basics:<br/>\n a. Hitpoints: 512 (520 Singing)<br/>\n<br/>\n b. Saving Throws (Singing ONLY) [v Spells]<br/>\n Fort: 42 (43) [52]<br/>\n Will: 32 (33) [42]<br/>\n Reflex: 33 (34) [43]<br/>\n<br/>\n Saving Throw bonuses: Spells: +9 (included in the above calculations)<br/>\n *Other: RDD Immunities (Fire, Sleep, Paralysis); Bard Spells; Divine Wrath [when pulled, add another +9 to all-saves, +9 AB/+9 Damage (Divine based) and DR 15/+3].<br/>\n<br/>\n IV. Combat Vitals:<br/>\n<br/>\n a. Devastating Critical (DC): 45, +1 Curse: 46 / Bio-Cap: DC 51, +1 Curse: 52<br/>\n<br/>\n b. Attack Bonus (AB):<br/>\n BAB: 27,<br/>\n AB 46+2 Song: 48, +6 Taunt: 54 (Melee) / Bio-Cap: AB 72, +6 Taunt: 78 Melee, +7 Smite Evil: 85<br/>\n<span style=\"color:#FF0000\"><strong>AB, ranged: 28</strong></span><br/>\n<br/>\n *Other: Bard Buffs; Divine Wrath.<br/>\n<br/>\n c. Damage—Illustrative:<br/>\n Mundane Scimitar: 1-6+15 +2 Song, OR: 1-6+17 (crit: 15-20/x2) (no buffs, no equipment)*<br/>\n Gear (+5 Keen Scimitar, +6 STR): AB 56, +6 Taunt: 62; Damage: 1-6+25 (crit: 12-20/x2)<br/>\n<br/>\n Other: Smite Evil; Divine Wrath; Bard Spells.<br/>\n<br/>\n V. Defense Vitals (AC):<br/>\n AC 24, +8 Mundane Plate, +3 Mundane Tower: 35, +2 Curse: 37 AC (no buffs, no equipment)<br/>\n<br/>\n *Other: Dev.Crit; Lay-on-Hands and Divine Wrath; Bard Spells.<br/>\n<br/>\n VI. Spell Casting: Bard(3), Bard Toys.<br/>\n *Recommended: Amplify (+20 Listen); Balagarn’s Iron Horn (no save); Pro-v-Alignment; Ultravision and Darkness (no save); See Invisibility; Clarity; Eagle’s: Haste; Keen Edge; Dispel. See your Bard book here: <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Bard\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Bard</a> .<br/>\n<br/>\n VII. Skillpoints: 251*<br/>\n Discipline 43(58), Listen 43(42), Lore 8(19) (RDD prereq.), Perform 15(16), Spellcraft 42(45), Taunt 43(44), Tumble 40(40), UMD 17(18). Note: Song: +1 all skills ; Curse: -1 all enemy skills.<br/>\n<br/>\n Players should feel free to adjust their Slayer to suit their own needs/preferences, as always.<br/>\n<br/>\n EDIT: added note about Divine Wrath [a once a day ability which is fully open, simply enhance with CHA); when pulled, at 22 CoT, grants Slayer an additional +9 all-saves, +9 AB and +9 Damage (divine-based), and DR 15/+3, none of which appears/is accounted for in the above figures (I see it as something nice to have in the pocket, like an insurance policy, even although with these stats the Slayer hardly needs it, but in the \"pocket\" so thought to mention it nevertheless. ~ Enjoy!].<br/>\n<br/>\n<em><span style=\"color:#000000\">edit: per Hip 20160910 (corrections/additions of missing info, in</span></em><span style=\"color:#FF0000\"><strong> red</strong></span><em><span style=\"color:#000000\">)  additional note:  Skill allotment sequence may not reflect what was used in testing by the author.</span></em></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:09 AM - Oct 28, 2012",
      "content": "<div><blockquote><div><strong>TyrTemplar wrote:</strong><br/>\nFort: 42 (43) [52]<br/>\n<br/>\nDevastating Critical (DC): 45, +1 Curse: 46  /   Bio-Cap: DC 51, +1 Curse: 52<br/>\n<br/>\n AB 46+2 Song: 48, +6 Taunt: 54 (Melee) / Bio-Cap: AB 72, +6 Taunt: 78 Melee, +7 Smite Evil: 85\n</div></blockquote>\nFort saves &gt; 42<br/>\nDev crit DC &gt; 45<br/>\nAB &gt; +46<br/>\n<br/>\nScary specs</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "9:36 PM - Oct 29, 2012",
      "content": "<div>(thanks, Mick).<br/>\n<br/>\nSlay ON! ~ Tyr</div>"
    }
  ]
}