{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "307",
  "name": "Paladin Challenge",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/paladin-challenge-t2354273.html",
  "author": "KidMiracleman",
  "avatar": "no_avatar.png",
  "replies": "9",
  "views": "1.0K",
  "posts": [
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "8:58 PM - Jul 10, 2014",
      "content": "<div>I am not sure if I have posted this before but I thought I would post it again.  Looking for creative builds that can use a raw relic I have found<br/>\n<br/>\n 25 paladin levelsArmor bonus +15 AC natural modifier Bonus feat. Hide in plain sightUniversal +5Regeneration +10<br/>\n<br/>\n What would be a good build that would take advatage of this amulet??  Questions??<br/>\n<br/>\n David<br/>\n  </div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "9:01 PM - Jul 10, 2014",
      "content": "<div>What about this build?  <br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build242764.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 42764.html</a></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:10 PM - Jul 10, 2014",
      "content": "<div><blockquote><div><strong>KidMiracleman wrote:</strong><hr/>What about this build?<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build242764.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 42764.html</a></div></blockquote>\n<div align=\"left\">It's a smiter.  Is a smiter what you are looking for?<br/>\n<br/>\n BTW, before we embark on another wild goose chase, please take the time to read <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515448/Build-request-guidelines#.U777Bsa33Ud\" rel=\"noreferrer\" target=\"_blank\">Kail's Build Request Guidelines</a>.  There are simply too many directions to go with minimum of Pal25 as your sole restriction (I see at least 20 ECB legacy builds that could work, not even counting any in this forum).  Please... detail all significant nerfs and/or changes that apply on the server you want to experiment with this toon. I suspect it could become very involved since you already mentioned subraces which pretty much falls into your own lap (the CBC tool was designed for only default races and classes).  <br/>\n<br/>\n You may find it more efficient all around to create a topic with the title of your server \"Tornado of Souls\" IIRC... in the PW subforum... and start listing.  Don't just paste all the text from the server rules.  Condense them down to character build-only factoids.  That way you need not keep repeating all the customizations (like the nerf on the DevCrit feat, for example) every time you request a build.  It's up to you how you handle it, though.</div></div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "9:05 AM - Jul 11, 2014",
      "content": "<div>I am just trying to get some ideas.  So far I have not really shot down any ideas.  Everything is useful.  I appreciate any and all help<br/>\n<br/>\n David</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:15 PM - Jul 11, 2014",
      "content": "<div>Then the best I can offer is the fact that Pal 26 yields an additional bonus feat with enough pally levels to cast virtually indispellable buffs (other than Mords of course).  That leaves 14 levels to toy with.  For a smiter build, CoT levels are very useful. Beyond that, there's not likely to be any astonishly innovative concepts that builders like Mith, Kail, Max, Grim &amp; Mick (just to name a few) have not previously covered for a pally build by their own industry and insight.  All those are accessible through the WoG search engine.<br/>\n<br/>\n Review what's already been devised by other epic builders, extract what you like from them and what you don't like (or what is not applicable to the server where you intend to play it) and piece together your own version with some background on why it is useful to you, then post it.  That's about all the effort you need to exert to get some viable suggestions on how to optimize a build concept.</div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "12:12 AM - Jul 16, 2014",
      "content": "<div>I am looking for a build that takes full advantage of the relic amulet<br/>\n<br/>\n David</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:32 AM - Jul 16, 2014",
      "content": "<div>1.  Is RDD a viable class on your server?  If so, how does it differ from the default class, if at all?<br/>\n 2.  Once again... are you looking for a smiter?  It makes a big difference.  Has smiting been altered in any way on your server?<br/>\n 3.  Is HiPS the default feat (hide can succed when disengaged during combat action) or an altered version on your server?<br/>\n 4.  Are there any items that bestow <em>Immunity: Critical Hits</em> to the wearer on your server?<br/>\n<br/>\n My first instinct is a stealth build to take advantage of the free HiPS. If the server abounds in true seers HiPS loses most of its value. But WITHOUT the true seeing threat, and since you had indicated in a previous request that alignment is not an issue on your server, I would consider an assassin hybrid of some sort.  You won't find Pal/Asn builds with the search engine because they almost always build within legal character guidelines.  A combination of Divine Might and Death Attacks could be very troublesome for both PvM and PvP opponents, though the stun DC would not be all that effective.  But the sneaks will trigger from stealth and darkness.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:40 AM - Jul 16, 2014",
      "content": "<div>I'd either make a stealthy Paladin 26 / Rogue 14 to take advantage of the HiPS, or ignore the HiPS and go for a strong Paladin 26 / Fighter 4 / CoT 10 and enjoy the other benefits of the amulet.<br/>\n I am willing to make either or both builds for you, but they would probably strongly resemble builds that already exist in the <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/buildsearch/\" rel=\"noreferrer\" target=\"_blank\">Epic Character Build Search Engine</a>.<br/>\n<br/>\n Edit: Ninja'd.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "8:58 AM - Jul 16, 2014",
      "content": "<div>I am not looking for a smiter nor am I not looking for one.  If I do not go with a dex build then it would be nice to go with a build in which his <br/>\n str can get up to 37 in legendary levels.  The he can equip the best shield in the game.<br/>\n<br/>\n RDD is a viable class.  I do not think it differs in any way.  This is the only server I have ever played on. It has been a long time since I played on the <br/>\n Original Campaign.  I have no idea if there is anything that is really different</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:14 PM - Jul 16, 2014",
      "content": "<div><blockquote><div><strong>KidMiracleman wrote:</strong><hr/>I am not looking for a smiter nor am I not looking for one.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n Then I will discount that possibility as a build focus.\n<blockquote><div>\n If I do not go with a dex build then it would be nice to go with a build in which his str can get up to 37 in legendary levels. The he can equip the best shield in the game. RDD is a viable class. I do not think it differs in any way.<br/>\n  </div></blockquote>\n Then Mith's <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build240938.html\" rel=\"noreferrer\" target=\"_blank\">Knight of Bahamut</a> looks viable with a few tweaks. Essentially I have replicated his build in toto pre-epic with some minor changes to better suit that item you want to build around.<br/>\n<br/>\n Paladin(27), Bard(3), Red Dragon Disciple(10), Human (start with LG)<br/>\n<br/>\n Ability bumps just like Mith (+8 STR, +2 CHA); final spread STR 14(32), DEX 8, CON 14(16), INT 14(16), WIS 14, CHA 14(20)<br/>\n w/capped abilities (should be no problemo on a high-magic server like yours) STR 44, CHA 32, CON 28 DEX 20, WIS 26, INT 28 in that order of preference.<br/>\n<br/>\n 1-20 Pal - WF, Blind Fight, KD (or Expertise), PA, Div Might/Shield, Imp Crit, Ext Spell (all just like Mith's)<br/>\n 21 Brd - EWF<br/>\n 22-31 RDD - (2)Grt STR, ESkF: Hide<br/>\n 32-38 Pal - ESkF: Mv Sil, AS, Grt CHA, Prowess<br/>\n 39,40 Brd - Grt CHA<br/>\n<br/>\n Skills: Discipline 43(54), Hide 43(52), Lore 8(14), Move Silently 43(52), Perform 4(9), Spellcraft 42(45), Tumble 40(39), UMD 8(13)<br/>\n You can figure out the AB, AC &amp; saves ceilings when you test with your trainer, but saves will be very high, especially vs. spells.<br/>\n<br/>\n The reason for the slight variation in class spread is that you will only reach a level 3 song anyway. The few extra HPs &amp; buff duration is worth more than the few xtra skill points. You won't likely be trying to cast arcane with heavy/tower in tow so just stick with the song boosts.<br/>\n<br/>\n There are 3 alignment swaps. You can flop them around to need fewer if you like but with a manager available, what difference is there? To gain the most skill points, get to RDD 9 ASAP.\n<blockquote><div>\n This is the only server I have ever played on. It has been a long time since I played on the<br/>\n Original Campaign. I have no idea if there is anything that is really different</div></blockquote>\n Then learn. It's best to place a request here when you are completely aware of the limitations and enhancements that will have a direct impact on the build design. We are more than happy to help in any way we can but don't particularly like wasting time bouncing back and forth with each new \"discovery\" a requester publishes.<br/>\n<br/>\n In any event, good luck in your search for that elusive uber combo that will dominate.</div>"
    }
  ]
}