{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "529",
  "name": "Battle Priestess, Please.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/battle-priestess-please-t515412.html",
  "author": "MiniQuinny",
  "avatar": "no_avatar.png",
  "replies": "4",
  "views": "1.0K",
  "posts": [
    {
      "author": "MiniQuinny",
      "avatar": "no_avatar.png",
      "timestamp": "7:52 PM - Aug 20, 2011",
      "content": "<div>I am on a Server capped at level 30, with minimul magical equipment (Arelith)<br/>\n<br/>\nI am hoping for a Pure Cleric, Human.<br/>\nTo wield a Dwarven Waraxe (Simply for Oh So Awesomeness)<br/>\nShe will have preference to Melee battles, but I would like her to have a powerful set of spells if required.<br/>\nIdealy, I would wish for both Greater Ruin and Hell Ball with an Epic Evo Focus.<br/>\n<br/>\nAny Idea's would be super, Thank You!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:34 PM - Aug 20, 2011",
      "content": "<div>If you are really set on a pure one for Arelith... <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=6&amp;t=100\" rel=\"noreferrer\" target=\"_blank\">link</a> <br/>\nIt's weak compared to several multiclass battle clerics, melee-wise. Expect to suffer against KD &amp; Disarm spammers.<br/>\n<br/>\nWelcome to the new ECB!</div>"
    },
    {
      "author": "MiniQuinny",
      "avatar": "no_avatar.png",
      "timestamp": "11:51 AM - Aug 21, 2011",
      "content": "<div>The Pure Cleric is for RP purposes, but that build is awesome.<br/>\nIf you were to reconmend a MultiClass for the Benefit of Melee, would<br/>\nmy character still gain Ninth Level spells with both Hellball and Greater Ruin?<br/>\nI would consider a Multi Class but the Epic and Ninth level spells are required<br/>\ngreatly for my Characters purpose of Arelith.<br/>\n<br/>\nThank You<br/>\nMiniQuinny</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:07 PM - Aug 21, 2011",
      "content": "<div>Taking 3 monk levels at 27 thru 29 will <strong>add</strong> the following to the pure build:<br/>\n+3 Tumble AC  (w/Tumble@30)<br/>\nMax Discipline 32(36) - Anti KD/disarm/called shots<br/>\nEvasion<br/>\nCleave<br/>\nAccess to monk boots &amp; robes<br/>\n<br/>\nWithout armor/shield, a monk 3 would get +6 AC from WIS, +10% move speed &amp; monk attack progression with monk weapons.  These benefits would be realized with a DEX version of this build but with the waraxe prereq, it is not feasible, so I steer away from DEX/kama.<br/>\n<br/>\nWhat is lost is:<br/>\n-3 to break thru spell resistance (this build is not focused to break SR anyway)<br/>\n<br/>\nAll cleric buffs remain indispellable at Cleric 27/Monk 3 and everything else in the build guide remains the same except for the skill allocation.<br/>\n<br/>\nThis is just the first example that came to mind but it should illustrate why a MC build will almost always be superior to a pure build in some regards.  It's called \"synergy\".  If you need the specifics of the revised version, I can PM you the details since it won't be a pure build anymore.</div>"
    },
    {
      "author": "MiniQuinny",
      "avatar": "no_avatar.png",
      "timestamp": "1:04 AM - Aug 22, 2011",
      "content": "<div>Could you PM me or more Multi-Classed Cleric build then? Something that is still able with Spells, but an all around strength.<br/>\nIf possible, Hellball and Greater Ruin are still required. Thank you so much</div>"
    }
  ]
}