{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "171",
  "name": "Despite Best Advice...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/despite-best-advice-t2354501.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 28,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:35 AM - Feb 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">...I've tried it anyway.<br/>\n<br/>\n I've been thinking about a Monk/Fighter/CoT build for a while, and was advised to look at <em>Tatooed Monk</em>'s builds by the splendid and august HipRedux. This I have singularly failed to do (sorry Hip), though I did notice the reference to a hard time up to level 6, so I thought I whack some Fighter levels in there to compensate. I did catch Mick Dagger's Epic Brawler Champion in the Full Epic Builds section - which looks great - but I was looking to incorporate lots more Monk: essentially, I wanted a Monk with attack bonuses from Fighter and defence bonuses from CoT. So I did one anyway. (Oh, and apparently Unarmed Strike doesn't count as a melee weapon for CoT purposes, though it's certainly not bloody ranged! Anyway, that's why I took a kama WF as well, then conveniently forgot about it),<br/>\n<br/>\n I contemplated posting it directly onto the Level 40 Builds section, but am still too scared after the debacles of Grim Stonefoot and the Crimson Nun, so here it is to be shot at.<br/>\n<br/>\n I will say before posting that it's a non-Dev Crit build: 2 reasons - 1st, I'm playing Aielund currently, which doesn't permit Dev Crit; and 2nd, you can play without Dev Crit anywhere, but with Dev Crit only in some places, so I hope it's universally useful.<br/>\n<br/>\n Right then, to the build...I give you, <strong>STORMFRONT</strong> (couldn't bring myself to call a Dwarf \"Brightwater\")<br/>\n<br/>\n MONK 30 / FIGHTER 4 / CHAMPION of TORM 6<br/>\n<br/>\n PvM 1-40<br/>\n Dwarf, Lawful Good or Neutral<br/>\n<br/>\n STR 16 (32)<br/>\n DEX 14<br/>\n CON 14<br/>\n INT 12<br/>\n WIS 14<br/>\n CHA 6<br/>\n<br/>\n HPs: 410<br/>\n Skill Points: 195 - Concentration 35 (37), Discipline 43 (54), Listen 39 (41), Spellcraft 19 (20), Tumble 40 (42)<br/>\n AC (naked): 30<br/>\n DR 20/+1, SR 44<br/>\n Empty Body: 50% concealment 2xday (30 rounds). Wholeness of body: Heal 60HP/day. Speed +100%<br/>\n Saves (F/R/W): 32/31/28 (+6 v Spells)<br/>\n BAB: 26<br/>\n AB: +41/+38/+35/+32/+29/+26 (+Flurry of Blows)<br/>\n Damage (unarmed): 1d20+17 (19-20 x2)<br/>\n Immunity to Disease / Poison / Mind Effects<br/>\n<br/>\n LEVELLING GUIDE<br/>\n<br/>\n 1. M1 - Luck of Heroes / (Cleave / Evasion / Flurry of Blows / Improved Unarmed Strike / Stunning Fist)<br/>\n 2. F1 - WF: Unarmed<br/>\n 3. M2 - Power Attack / (Deflect Arrows)<br/>\n 4. F2 - Blind Fighting / (STR+1) [STR17]<br/>\n 5. F3<br/>\n 6. F4 - WS: Unarmed / Dodge<br/>\n 7. M3 - (Monk Speed / Still Mind)<br/>\n 8. M4 - (STR+1) [STR18]<br/>\n 9. M5 - Iron Will / (Purity of Body)<br/>\n 10. M6 - (Knockdown / Imp Knockdown)<br/>\n 11. M7 - (Wholeness of Body)<br/>\n 12. M8 - Imp Crit: Unarmed / (STR+1) [STR19]<br/>\n 13. M9 - (Imp Evasion)<br/>\n 14. M10 - (Ki Strike 1)<br/>\n 15. M11 - Lightning Reflexes / (Diamond Body)<br/>\n 16. M12 - (STR+1) [STR20]/ (Diamond Soul)<br/>\n 17. M13 - (Ki Strike 2)<br/>\n 18. M14 - WF: Kama<br/>\n 19. M15 - (Quivering Palm)<br/>\n 20. M16 - (STR+1) [STR21] / (Ki Strike 3)<br/>\n 21. CoT1 - Great Strength I [STR22] / (Lay on Hands)<br/>\n 22. CoT2 - Epic WF: Unarmed / (Sacred Defence +1)<br/>\n 23. M17<br/>\n 24. M18 - Great Strength II / (STR+1) [STR24] / (Empty Body)<br/>\n 25. M19<br/>\n 26. M20 - (Perfect Self)<br/>\n 27. CoT3 - Great Strength III [STR25]<br/>\n 28. CoT4 - Epic WS: Unarmed / (STR+1) [STR26] / (Sacred Defence +1)<br/>\n 29. CoT5 - (Divine Wrath +3 5/+1)<br/>\n 30. CoT6 - Great Strength IV [STR27] / Armor Skin<br/>\n 31. M21<br/>\n 32. M22 - (STR+1) [STR28]<br/>\n 33. M23 - Epic Prowess<br/>\n 34. M24<br/>\n 35. M25 - Imp SR I<br/>\n 36. M26 - Great Strength V / (STR+1) [STR30]<br/>\n 37. M27<br/>\n 38. M28<br/>\n 39. M29 - Great Strength VI [STR31]<br/>\n 40. M30 - Imp SR II / (STR+1) [STR32]<br/>\n<br/>\n SKILLS DISTRIBUTION<br/>\n<br/>\n 1. Disc4/Tum4/List4/Spell2/Conc4<br/>\n 2. Disc1 (Save2)<br/>\n 3. Disc1/Tum2/Spell1/List2<br/>\n 4. Disc1 (Save2)<br/>\n 5. Disc1/Spell1 (Save2)<br/>\n 6. Disc1 (Save4)<br/>\n 7. Disc1/Tum4/Spell1/List2<br/>\n 8. Disc1/Tum1/List2/Conc1<br/>\n 9. Disc1/Tum1/Spell1/List1<br/>\n 10. Disc1/Tum1/List1/Conc2<br/>\n 11. Disc1/Tum1/Spell1/Conc1<br/>\n 12. Disc1/Tum1/List2/Conc1<br/>\n 13. Disc1/Tum1/Spell1/List1<br/>\n 14. Disc1/Tum1/List1/Conc2<br/>\n 15. Disc1/Tum1/Spell1/List1<br/>\n 16. Disc1/Tum1/List3<br/>\n 17. Disc1/Tum1/Spell1/Conc1<br/>\n 18. Disc1/Tum1/Conc3<br/>\n 19. Disc1/Tum1/Spell1/List1<br/>\n 20. Disc1/Tum1/List2/Conc1<br/>\n 21. Disc1 (Save2)<br/>\n 22. Disc1/Spell1 (Save2)<br/>\n 23. Disc1/Tum3/List2/Conc1<br/>\n 24. Disc1/Tum1/Spell1/Conc1<br/>\n 25. Disc1/Tum1/List1/Conc2<br/>\n 26. Disc1/Tum1/Spell1/List1<br/>\n 27. Disc1 (Save2)<br/>\n 28. Disc1/Spell1 (Save2)<br/>\n 29. Disc1 (Save4)<br/>\n 30. Disc1/Spell1 (Save4)<br/>\n 31. Disc1/Tum5/List3<br/>\n 32. Disc1/Tum1/Spell1/Conc1<br/>\n 33. Disc1/Tum1/Conc3<br/>\n 34. Disc1/Tum1/Spell1/Conc1<br/>\n 35. Disc1/Tum1/List2/Conc1<br/>\n 36. Disc1/Tum1/Spell1/Conc1<br/>\n 37. Disc1/Tum1/List1/Conc2<br/>\n 38. Disc1/List1/List2/Conc2<br/>\n 39. Disc1/List2/Conc2<br/>\n 40. Disc1/List2/Conc2<br/>\n<br/>\n Now, I'm not entirely sure what works and what doesn't - I certainly hope it's not an illegal build, and Monsieur Le Daggeur would pick that up faster than anyone - logged-on or not, I think he smells it. But is it any good? Hip, I don't know your fortes (probably the lot), but I do know Empyre makes fiendishly good Monks, so I shall simply quake and tremble for a bit. The target is there, gentlefolk...<br/>\n<br/>\n Cheers!<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Okay, I've given him a race change (although I think a girly Dwarf might well be better) and tweaked appropriately, I hope. What do you think?<br/>\n<br/>\n<em><strong>2nd EDIT:</strong></em> And we try again!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:37 AM - Feb 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Your naked AC is 28: base 10 + 2 from DEX + 6 from 30 levels of Monk + 8 from 40 Tumble + 2 from Armor Skin = 28.<br/>\n A Monk can take Armor Skin as a bonus feat, but not Epic Prowess. That leaves you with either Epic Toughness or Improved Spell Resistance.<br/>\n By the time you take Epic Will, you are already immune to mental effects because you have at least 20 levels of Monk by then, so that's where you can take Epic Prowess.<br/>\n Because you are taking WF Kama only to qualify for CoT, why not take it just in time, at level 9? That lets you take Blind Fight, Dodge, and Mobility earlier.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:11 AM - Feb 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, I did know about the need to waste a feat to make an unarmed CoT and have mentioned it several times in the past though can't recall exactly where.  Unfortunately, that tactic won't work for WM builds, which is probably the reason I considered the issue more related to that class than CoT.   And btw... an AD&amp;D melee weapon is something your toon holds in its hands, not the hands themselves (though Bruce Lee would likely debate the fact).  This much fister monks share with creature weapon attacks... neither holds a weapon.  But unlike creatures, a Stoneskin buff does not allow an unarmed monk to penetrate DR +5.<br/>\n<br/>\n But what are you trying to accomplish with DEX 14/Dodge/Mobility?  Yes, Dodge has some use as a miscellaneous AC source but can still be lost when flanked.  With this much Tumble, Mobility is totally worthless unless you are planning on wearing armor (I seriously doubt that).  This isn't a stealth build (or ED one), anyway, so DEX really doesn't factor in.  But don't believe me.  Test high Tumble with a trainer where you can spawn huge flanking mobs and see for yourself how many times Tumble triggers to avoid AoOs with a robe-wearer.<br/>\n<br/>\n For my uses, I would rather have WIS 14 for more reliable AC, better Will saves (which happen to be your weakest, though not by much) and a better stun.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:34 AM - Feb 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Spring Attack is the feat made useless by good tumble. The +4 AC from Mobility applies to all attacks of opportunity, not just from moving in combat. If you drink a potion during combat, Mobility will come in handy, but maybe that isn't worth it. On the other hand, what feats should he take instead?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:23 AM - Feb 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Both.<br/>\n<br/>\n Points in order:<br/>\n<br/>\n i) AC - my bad. Having ensured I factored in Armor Skin, I then forgot to count it. One of the perils of doing it all on paper (still. And yes, I know I should grab a CBC, but then I'd have to learn how to work it - spot the Luddite).<br/>\n<br/>\n ii) WF: Kama - you are quite correct, Empyre. I fear that having recognized that I needed it I just slung it in there early so I didn't forget about it.<br/>\n<br/>\n iii) Epic Prowess and Monk BFs - thanks for noticing that, Empyre, I wasn't sure. My temptation is to go for Imp SR, but it's only +2, so I'm wondering whether Epic Energy Resistance might be worthwhile?<br/>\n<br/>\n iv) DEX/WIS and Will - interestingly, both Empyre's comments about binning Epic Will for Epic Prowess and Hip's about taking WIS over DEX link together beautifully here (I think). If I drop EW I lose 4 points of Will saves, but if I take 14 WIS and 10 DEX I get 2 back. Of course, it does mean my Reflex save drops by 2, as well as impacting on Tumble, but I'm already putting 40 into that, so no real difference there. Swings and roundabouts, really. Except...I don't lose anything from AC and get a boost to Listen, which is nice. I suspect this all arose because I'd initially had CON at 14 rather than 12, so either DEX or WIS was going to get an 8, and since low WIS doesn't have a negative impact on AC I decided to favour DEX. Then I promptly forgot that I decided to not get hit at all rather than soak it up through HPs.<br/>\n<br/>\n Anyway, I'm babbling now. But I do have a question about WIS/DEX - would you go for a 14-10 split or a 12-12? I'll do the edit once you're kind enough to advise on this one. Oh, and would dropping DEX have an impact on my ability to take Dodge and/or Mobility? Maybe Disarm or Dirty Fighting could replace one if necessary?<br/>\n<br/>\n I appreciate that, regardless of anything else, this build could be more brutal (Half-Orc), more resilient (Dwarf), more agile (Elf), more nimble (Halfling), or more downright weird (Gnome), but I opted for the middle ground. Hope it's coming on all right.<br/>\n<br/>\n Thanks in advance!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:42 PM - Feb 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>\n Anyway, I'm babbling now. But I do have a question about WIS/DEX - would you go for a 14-10 split or a 12-12? I'll do the edit once you're kind enough to advise on this one. Oh, and would dropping DEX have an impact on my ability to take Dodge and/or Mobility? Maybe Disarm or Dirty Fighting could replace one if necessary?<br/>\n<br/>\n<br/>\n  </div></blockquote>\n Well, you could go 12-12 in an attempt to balance saves, but with CoT boosts I hardly suspect such finessing (no pun intended) would be an advantage.  Naturally, without DEX 13, Dodge/Mobility are no longer an alternative. That's the choice I suggested for the reasons I already mentioned.  <strong>Disarm</strong> is not going be very effective without holding a large weapon (besides the AoO it triggers, that is) and <strong>Dirty Fighting</strong>.... meh... a feat that never really got off the ground for Bioware IMO.  Forces your toon to trigger a combat mode that can be just bothersome with the high APR you will be using.<br/>\n<br/>\n Consider <strong>Called Shot</strong>. <br/>\n<br/>\n Besides the oft-implemented mob control feature used by archers (i.e. Leg shots), Arm shot AB penalties will stack within the long duration (4rnds) effectively increasing your toon's AC beyond any AC stacking limits that may be in effect.  The only caveat is that the target must actually have arms (or legs) to use it.  But I tend to leave Called Shot as one of the last combat feats to choose pre-epic due to the user's attack penalty, one of the higher ones.  It does take some practice to select it for the first attack in a flurry but can dominate situations that would otherwise be unmanageable. \n<blockquote><div>I appreciate that, regardless of anything else, this build could be more brutal (Half-Orc), more resilient (Dwarf), more agile (Elf), more nimble (Halfling), or more downright weird (Gnome), but I opted for the middle ground. Hope it's coming on all right.<br/>\n  </div></blockquote>\n I like your build methodology.  Mine works in a very similar manner. <br/>\n<br/>\n i.e. Build using Human first to get the largest number of feats and skillpoints and then reanalyze.  If you find you have feats/skillpoints to spare within the base framework, then begin considering racial advantages that could optimize the build's effectiveness further and start to reassemble the concept with the bias.<br/>\n<br/>\n I like halfling but that will mean lower damage and longterm XP penalty.  Same goes for 3 of the other races you mentioned.  Dwarf will resolve the penalty issue and probably the only alternative unless the environment makes it easy to level (yes, there are still servers like this around that are designed for Level 40 toons to venture into challenging areas they would not be able to attempt at less-than-capped level).  That extra 2 ability points would be inviting to me.  I usually build without any preference as to the appearance itself so races mean nothing more than a mechanical means to achieve the optimization I seek.  No so for all players, though.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:09 PM - Feb 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hmm, maybe choosing a Dwarf wouldn't be a bad idea. You would lose a feat, but we're already struggling to find out what feats to take. You'd lose a skill, but if you choose Spellcraft to drop, you would lose +4 saves against spells, but gain +2 from Dwarf, so the net loss would only be 2. There would be 3 more skill points lost, which I guess would have to come from Concentration. BTW, 20 Spellcraft gives you +4 against spells, not just +2, +1 for every 5 points.<br/>\n<br/>\n In PvM, Disarm is only useful in modules designed for it so the NPCs would have a weapon in their inventory. I would choose Called Shot over Dirty Fighting. Maybe Skill Focus: Concentration to replace the 3 lost skill points? Maybe Resist Energy, of a different energy type then Epic Energy Resistance because they do not stack. Maybe Hip will come in with a suggestion that is so obviously better that we will wonder why we didn't think of that.<br/>\n<br/>\n I'd go for the 14-10 split. Then again, I'd start with 16 STR, freeing 6 points so I could have 14 DEX, 14 WIS, <strong>and</strong> 14 CON (or 16 CON, if Dwarf, or maybe 14 CON and 12 INT to replace the lost skill), but others might disagree, saying that it isn't worth the loss of an AB.<br/>\n<br/>\n<strong>EDIT:</strong> Ninja'd because I took so long thinking and typing.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:05 PM - Feb 15, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ooh, now I've really got some food for thought! I do like the idea of Dwarf - three reasons:<br/>\n<br/>\n i) As I think I mentioned, I was trying to up my CON at first attempt, but couldn't make it stick, so Empyre's thought about dropping STR to a 16 starting point would work wonderfully. It also solves the WIS/DEX dilemma by sidestepping it completely, which is nice! I'll see if a redistribution of pre-epic levels to Monk12/Fighter4/CoT4 would be useful - it'd give me the lost +1AB back, but I need to balance that with wanting the advantages of getting to L16 in Monk asap. Hmm.<br/>\n<br/>\n ii) I've only played, or indeed built, Dwarves (or Dwarfs, depending on whether we're Tolkien-ing or not) with DD in mind, so this would be really useful on both (building and playing) counts. Hopefully making me better at both (ha!).<br/>\n<br/>\n iii) Most importantly, aesthetically, a dour, squat wee toon belting around at a zillion mph appeals hugely!<br/>\n<br/>\n As an aside, one thing I've just realised - while I've only constructed 4 builds, all but one (Grim Stonefoot) have had some CoT in them. Not odd in itself, perhaps, but I've only ever actually played one character with CoT. Probably uncovers something about me best left in the shadows...<br/>\n<br/>\n Okay then, the drawing board awaits. I'll do it as an edit on the first post when I think it's fit for human consumption (also no pun intended).<br/>\n<br/>\n Cheers! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n<strong><em>EDIT:</em></strong> I'm tempted, with regard to skill points, to keep Spellcraft as a sort of layman's UMD - you can wear stuff you wouldn't ordinarily be allowed to (eg, Robes of Light in Aielund, which give a slightly better set of stats than Transcendant Robes+5), and lose Concentration. What do you think? Oh, and I've decided to keep the levelling as it is (just swapped M14 for CoT 3 at level 20, giving a Feat and Bonus Feat at 21 - with CoT4). I've also decided to drop Toughness - I've got higher HPs anyway, so might as well make better use of that slot. Think I'll keep Dodge and Mobility, though - tempted as I am by Resist Energy and SF. Oh, and would I be able to take SF in Spellcraft even though it's a cross-class skill? Sorry, being a nuisance now...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:10 PM - Feb 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello All,<br/>\n<br/>\n I've just done the edit - does he/she look any better?<br/>\n<br/>\n Thanks<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:13 PM - Feb 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Perhaps your goal would be best-served by reading about <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2349903/THE-IRON-FIST-MONK-35-FTR-5\" rel=\"noreferrer\" target=\"_blank\">Valerfor's Iron Fist build</a> where many of the same issues were dissected.  You'll notice that the DEX/Dodge route was also elected in a similar build, but with Mobility conspicuously-ignored because the designer recognized it had no value, in effect wasting a full feat in a high Tumble build.  It's important to be able to separate instincts or gut feelings from quantitative evidence when you try to design for optimal effect.<br/>\n<br/>\n I suggest you use \"SkF\" as an abbreviation for Skill Focus in your discussions since most will get it confused with Spell Focus which historically has been the feat associated with \"SF\". <br/>\n<br/>\n For skills requiring training (like Spellcraft), all that's needed is a single rank to open up access to the associated focus.  Cross-classing has nothing to do with SkF access.  It's a matter of whether the skill under consideration is prohibited from the class or not.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:15 PM - Feb 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's great Hip, thank you. I'll be sure to check out Valerfor's build - like Empyre's, many of his \"fit\" my style of play. Mind you, if it's a demonstrably superior build I'll end up sulking and weeping in a corner somewhere!<br/>\n<br/>\n I'm currently contemplating dropping my CON to 14 and boosting INT to 12 (as per Empyre's other suggestion), as I'm feeling the lack of skill points quite keenly, so will also have a more thorough dissection of what other feat I might take for Mobility (and point taken re Called Shot, though I'm still wondering about Resist Energy and Skill Focus - and thanks for the abbreviation tip, as a non spell-chucker I tend to blank out those things magicka!). I think I'll still have sufficient HPs to leave out Toughness and concentrate on not getting hit. It feels odd thinking about only having one \"dump\" stat, but no worse for that!<br/>\n<br/>\n Oh, and valuable info on SkF for Spellcraft - I wasn't clear from the Wiki. I just knew UMD wasn't an option (always a shame to miss out on that, but what can you do?).<br/>\n<br/>\n Back to the pencil sharpener, then! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n<strong><em>EDIT:</em></strong> Just read Valerfor's thread. I see what you mean. Most startlingly, it seems Max and I are on the same page (though probably for different reasons)! Don't get me wrong, Max has stupendous credentials, I just find his play style doesn't mesh with mine like some others do - even though his guide on playing better was invaluable - I do love a good paradox! Anyway, I digress. All good stuff, and I feel I can still carry on with this build because there are sufficient differences. I shall progress with heightened knowledge and present version 3 when I can. Thanks again.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:04 PM - Feb 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">All right, the 2nd edit's now there, with lowered CON and highered INT. Had a phany (epiphany seems too strong) in light of Hip's comments and reading Valerfor's thread, so have re-tooled somewhat. Now not taking any CoT until epic, meaning I can get more Monk in early and not sacrifice any more AB. It also means I skither around which other feat to take pre-epic, 'cos I've lost one, as well as giving me all 3 CoT BFs in epic - which means I can take EWS, AS and Epic Prowess earlier, as well being able to take 2 Imp SR feats as Monk bonuses. I'm quite pleased - hope you are - and that I haven't just ballsed it up.<br/>\n<br/>\n Over to you!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:33 PM - Feb 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It looks to me like you're good to go.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:45 PM - Feb 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Brilliant - thank you!<br/>\n<br/>\n I do have one quick question (as ever). Regarding the skill points: I'm not sure whether Listen and/or Concentration are dependent on inputted scores (like Tumble) or modified scores (like Spellcraft)? I can make any modifications here regardless, but it would also be good to know for the future.<br/>\n<br/>\n Thanks again.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:14 PM - Feb 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">All skills are modified by the associated ability.  Tumble has the unique distinction of boosting <strong>AC</strong> according to the alloted ranks.  So, if 40 ranks were allocated for a toon with -8 DEX, it would still get +8 Tumble AC even though the ability modifier sets the level to 39.  The 39 (modified) level would be used for all Tumble checks.  That's why a single rank in Spellcraft can benefit any class when combined with their intrinsic INT level, Fox potions and/or any complementary +INT gear...  an easy way to gain +1 saves vs. spells with almost no investment on the ledger sheet.<br/>\n<br/>\n I'm still unclear what value all that Concentration has for a non-caster, though.  Does Aeilund really have such promiscuous MvP Taunting going on?  I can understand the use of high Conc for PvP but obviously this is a design for SP so am at a loss to understand the benefit.  What seems even more vague is Valerfor's suggested option between maxing Conc OR Listen?  Is it just the approx 40 extra skill points that need to be distributed wherever handy?  The point is: if Taunting is indeed a serious concern (like it would be in some PvP clashes), I'd max Conc and swap out PA for SkF: Conc since PA is really only useful for easy targets, chest bashing and qualifying for Great Cleave/DevCrit (which is not part of this build).  At Level 40 under mundane conditions with this build, you'd have a final Conc of 48 to counter those pesky Taunts.<br/>\n<br/>\n But you and Empyre would know better than I how the creature AIs have been modified in these modules and the inherent value of high Concentration levels for a non-caster.<br/>\n<br/>\n edit:  Oops.... forgot the overall opinion.  Looking well-structured and concise now.  Most all the loose ends have been addressed. Just be sure, if you should decide to publish this in the finished Level 40 section, to: 1) test it out for an hour or so in-game before posting as complete and 2) document every assignment made in consideration of environment-specific factors (like item choices you mentioned before).  It makes it so much easier for a random player to pull it up and begin re-customizing for their own SP or PW playing when the personal choices have been highlighted.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:55 PM - Feb 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I can tell you that the AI in Aielund does indeed taunt. On the other hand, they do indeed use stealth. What I don't know is the DC's for their taunts. There are chests and doors early on that need either picking or bashing.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:22 PM - Feb 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Excellent, Hip, thank you.<br/>\n<br/>\n I'm going to be very honest here, though it behoves me nothing. I confess that much of the time I only take 40 Tumble for its +8 AC, with little or no regard to any of its other attributes. Equally, I'll take Spellcraft to its modified 40, or 20, as here, for its superficial merits, rather than understanding its depths. Extrapolating this superficiality to Listen and Concentration, and working in multiples of 5, my question was whether it would be better to have, for example, an input of 35 into Concentration modified to 37, or an modified output of 35 with an input of 33. I <em>will</em> learn more of the intricacies as I go on, I promise.<br/>\n<br/>\n As to Concentration; I found that a hard one to get my head around (particularly given my non-arcane preferences) until the anti-Taunt stuff was explained to me - and there are a lot of taunting critters (mostly early-doors Barbarians, admittedly - though I've only just finished Part3, so I don't know about the last episode) in Aielund. But I'm not trying to make an Aielund-specific build here, even if playing there is what triggered my thoughts. I want one that will be good wherever it's played. Just trying to learn - I'm only 18 months into playing NWN, let alone building, so all advice is more than welcome.<br/>\n<br/>\n As to Valerfor's suggested option, I can only make the assumption that he wanted another maxed skill, but he'd have to answer that (apparently he was playing on WOG at the time. Oh, and btw, I haven't yet joined a PW, so have nothing to say thereon, or about any PW for that matter).<br/>\n<br/>\n I'm intrigued by your assessment of PA. This, indeed, had been my reading and appreciation of PA - I'd only ever really seen it as an entry fee to Dev Crit - until entering a conversation with Mick (Dagger). Admittedly, we were discussing a DEX-based build, but it was helpful nonetheless. So now I find myself a little torn. I will say that, much as taking Iron Will was on the basis that it would be made largely redundant by later Monk attributes, so PA is useful early on. That said, I did wonder long and hard about whether to take it in this build or not, and you've now made me a tad baffled - why would I want to boost my Concentration by SkF if it's of little merit? Aaargh! I'd quite like to have taken some Heal and/or Lore as skills, but couldn't seem to fit them in in a worthwhile fashion, but it may be that dropping Concentration down by a few points now...Blimey, this is hard work!<br/>\n<br/>\n Also - again in the interests of honesty - I'll say that, for me, when the combat starts, I tend not to use pause, just go with the ebb and flow, and then reload when/if I or my companions get obliterated, to get it better next time. This isn't merely a random confession, it lets you know why I tend towards feats that are intrinsic rather than considered mid-melee and then implemented.<br/>\n<br/>\n Regardless, my intention with this build was always to use it. It's a \"me\" build, so I'll certainly be testing it - by playing it - before contemplating putting it anywhere near the finished section, which is a scary place to go! Oh, and I get what you say about environment-specific factors, so wilco.<br/>\n<br/>\n Thanks Hip, hope what I've said makes some sense! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, Empyre, missed your input while posting this, Ta!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:19 AM - Feb 17, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I suppose, first off, you should understand the nature of a 40 cap build.<br/>\n<br/>\n Although the final tally reflects what combat and skill potentials are designed in, under most conditions (like optimimizing for a specific module or campaign) those totals are either never realized fully (meaning: never quite reaching Level 40 during the adventure) or are achieved at the very end.  Therefore, what matters most is the efficiency and economy that the schedule provides while playing the majority of the content.  So, with that in mind...<br/>\n<br/>\n Small differences in final skill levels means less than regular allotments to support the journey.  Like the difference between a 33 or 37 final Spellcraft level.  What matter if the campaign has ended? This is not the case on a 40 cap server where most of the challenge takes place after Level 40 has been reached.  Quite different scenarios with equally different demands on the character progression, both in combat potential and skill mastery.  Be finicky when you figure to be playing the Level 40 toon for weeks or months.<br/>\n<br/>\n Also, keep in mind that gear enhancements and buff items may raise a skill like Spellcraft to the next increment at different points in the build's leveling sequence.  It's hard to predict where the breakpoints will fall but experience with an environment will oft times reveal subtleties like this.  I hope this explanation hasn't been too cryptic.  It's just another way to say that the content itself will dictate when it is most important to achieve a particular skill level and even that may change depending on how XP is accrued from one toon to another (Does Aeilund employ some version of ECL adjustment? Dunno.) I suspect Empyre has drawn some conclusions about when and where levels should be in Aielund to achieve the best results so defer to his experience on that subject.<br/>\n<br/>\n Using PA:  You'll do more damage but hit much less, especially early on when AB/BAB is so low.  So it comes down to how long you feel your toon is safe standing there missing until a good roll launches a PA.  Now, for a dexer who had the foresight to set STR at least to 13, PA could be an efficient way to cause more damage to low-AC foes.  Typically, high-AC dexers peck away little by little, so PA might afford them a way to increase damage while remaining fairly safe by virtue of their Dex AC.  A STR build has less to gain proportionately from PA since those toons can generally kill the same creatures quickly without suffering the AB penalty to do so and doesn't have enough AC to linger as long.  As a prereq to Great Cleave or DevCrit, though, PA's value changes for well-muscled toons.<br/>\n<br/>\n Playing without \"Pause\" will help reduce the culture shock when you finally decide to taste on-line play, whether on a PW or with a select group of friends who set up a gaming LAN. It's good training. Additionally,  if you limit your save/reloads to only session-ending/new session-initiating actions and not to correct unwanted results, you will be emulating exactly what happens during on-line play although the death penalty varies from script to script... so you'll have to guess whether your campaign handles that the way you'd find implemented most places.  But settling for what the Fickle Finger of Fate doles out is how AD&amp;D was designed to be played, from PnP days to present.  *When pulled over for speeding I asked the officer, innocently, whether I could please reload my last half mile on radar.  I'm sure I could roll better the second time!  Hardly glancing up, he appeared to be fumbling in his pocket for his set of handcuffs.*<br/>\n<br/>\n Don't be intimidated about posting a complete, tested build to ECB.  The most experienced veterans among us were stumblebum noobs (in my case, eternally) at one time, though it may be too long ago for them to remember or admit! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:06 AM - Feb 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hmm, I'm a little perplexed. Not by your comments, Hip (he hastens to add!), but because I've just played the build up to L6 in two PvM environments (Aielund - with companions, and the OC - solo - yes, I know, 'oh, the OC's rubbish, blah blah blah', heard it all before and you're all wrong, so there. Genuinely, I don't see any great difference in terms of quality of experience between Aielund and the OC thus far. But I'm more interested in the story arc than mithering over whether I can kill 8 or 9 goblins/slaads/purple people-eaters in a single round, so poop to everyone else! Can, meet lid, meet worms. Sorry, rant over, but I do think the OC's worth defending on several fronts, which I won't go into now, but would be happy to somewhere else - maybe we should have a \"Behind the Bike-sheds at Break\" thread?), deliberately minimizing gear and items to see how the build works...<br/>\n<br/>\n And actually, I think there's more to be gained at these early levels by taking more Monk and less Fighter. Hence my perplexity (perplexedness, perplexitude?). I'd thought by whacking in all 4 levels of Fighter before L7 I'd be tempering the toon like steel, but I was wrong. I suspect some of it was also driven by taking WS as soon as reasonably possible, but I now reckon the character would be better served with Monk levels 3 and 4 coming in at build levels 5 and 6. I'm not yet sure whether Monk 5 and/or 6 should also come in earlier, 'cos I haven't got that far yet, but I'm certainly going to shift Fighter 3 and 4 to at least L7 and 8.<br/>\n<br/>\n I'm aware, of course, that much herein is governed by my playing style, rather than the cold, cold world of the Creator. And I do love playing Monk (was it only a year ago I railed against Empyre and his - as I then thought - heretical suggestions that Monk could be merged with another class?) However, if I make all this clear when and if it's posted in the the Full Epic section, it should be okay, shouldn't it?<br/>\n<br/>\n Thus, I'll give serious thought to an edit to this build as I progress through it.<br/>\n<br/>\n @Hip - You're quite right about ensuring the build works before posting it - it seemed a little precious to me initially, but I doff my cap in wrongness. One of the things I've become increasingly aware of is that many of our ECB builds are designed to be phenomenally good at Level 40, but have cavernous playing holes between \"birth\" and \"ascendancy\" (one of the reasons why, for example, I will never play a build that has 2 Rogue or Bard class inserts, simply to skill dump Tumble and UMD at 17 and 37 - or whatever. Now, I appreciate that I may sound like a hypocrite because of my previously extolled love of a Monk/RDD build that has a single level of Sorcerer within it, but I see that as a failure of the rules as they currently stand, not the concept of the game.) I want to get as many life-saving skills/feats/abilities as possible as early as possible - and then I'll kill everything in sight! (Maybe not quite as life-affirming a message as I'd hoped!)<br/>\n<br/>\n Blimey, I've prattled on here a bit - sorry, all. I've not been out today, so please understand...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:51 AM - Feb 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think most of the adverse comments about the OC stem from the somewhat-predictable plot and mechanisms devised to move the story forward (i.e. compose a shopping list of items that need to be found and returned to some NPC to gain access to another list of deliverables, and so on...).  But keep in mind, that most of these comments occurred after the expansions and some innovative CC was being released and when PWs were in their infancy.  While the OC was the one-and-only outlet for NWN... hardly a single judgemental comment was expressed.  Pretty predictable reaction IMO under the circumstances.<br/>\n<br/>\n I still like the challenge presented in the first chapter.  It \"feels\" a lot like PnP to me and is well-balanced.  But the OC was never designed with prestige classes, OP feats or all those no-save uber spells in mind yet most folks who pick it up via GoG know no better.  It's hard to form a valid opinion about content that simply hasn't existed in its native form for over 10 years.  What SHOULD have happened is that the community create a \"devolved\" OC campaign with a hak that would remove all the improvements that were implemented through the expansions but never intended to be used within the OC framework.  Well, I have never read about any interest in rebalancing the OC and am not holding my breath in anticipation.  It's just seems such a shame that near all of the players currently playing the OC will never be exposed to the original environment, the one that translated AD&amp;D onto the computer screen.   Today the OC has been relegated to the status of an orientation campaign, a stepping-off point for more elaborate gaming experience.<br/>\n<br/>\n Except for the impact on the skill point total, generally-speaking, it is an advantage in a melee build, to devote early levels to fighter-type classes so that some combat hits will register.  For example, a build I posted for someone recently listed the first 3 levels as monk, cleric, rogue.  In the build, XP penalty was a huge problem due to the chosen race.  So, the result was a Level 3 toon with a BAB of 0!  In most environments, that is a recipe for failure or at least, a heck of a struggle just to progress.  That one level out of four that does not enhance BAB can get expensive because most areas scale the CR according to character level so as the enemies are getting tougher, non-fighter types will be steadlily falling behind.  Of course, there's more to combat than just statistics but still, the percentages don't lie.<br/>\n<br/>\n The best leveling sequence for any build is always the one sculpted for a specific environment and that is only exposed through gameplay, not guessing.  Whether you decide to publish your concept as an Aielund-specific sequence or a more general scheme, I'm sure it would interest all those trying out that campaign to read about your personal adjustments and the reasoning behind them.  So start taking notes! ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:01 PM - Feb 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Cheers, Hip - sage counsel, as always.<br/>\n<br/>\n I understand entirely what you say about making life harder for oneself in BAB terms, it's just that Monk brings so much more to the table, and I tend towards the defensive end of the spectrum early on in a build (you'll never become a menace to society if you've been pasted over the pavement at L3). If this was designed to be an uber death-dealer, it'd simply be a race to qualify for WM and then just keep them ki strikes and crits flowing (I personally don't get on too well with the WMs I've played). By and large, I'm quite happy with any AB over +40 if I can stay alive in order to hit back - which, I suppose, takes on board your disquisition on saves, reloads and life in a PW. To a certain extent, with Monk, it's about getting to L1, 3, 6, 9, 12, 16 and 20 (which means having a fairly strong concept of what you want to achieve before you begin), because they're the \"big\" levels, as I see it, so it becomes more of a balancing act during the pre-epic build. In a way, the incredible oomph of a high level Monk comes almost as an accident of the build, which is why I hold it in such regard (one could argue that it's pretty much a prestige class that you can take from level 1).<br/>\n<br/>\n With regard to the OC, I guess it must've been fine by me otherwise I wouldn't still be playing NwN in any environment. Certainly, the biggest challenge is staying alive until Port Llast. Initially, I'd put that down to becoming familiar with your particular toon's foibles, but increasingly I'm suspecting it may have more to do with some of the exceptional gear you can get your hands on fairly early and cheaply (the Golden Hat springs to mind - surely it can't be right that something you can pick up at level 8 or 9 is still the best headgear in the entire campaign) - one of the reasons why I'm deliberately under-equiping in my current play-through: I want to test the build not the equipment.<br/>\n<br/>\n Right then, off to play with some wyverns in Aielund and a shedload of zombies in the OC - PnP at the ready! (I'll make any build modifications when I'm further into things.)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:01 AM - Feb 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Only me again,<br/>\n<br/>\n Just by way of an update: I'm currently testing the build in two PvM environments - Aielund, only at level 8 at the mo, 'cos it's hard work concentrating on both campaigns; and then I thought, Empyre suggested I go SoU/Nether Scrolls/HotU/Sands of Fate, so why not try that out? Just approaching nasty ol' snake-hair, and all goes well currently. Except one thing - and, to be honest, you guys may be slipping up here - my skills distribution is, only by a tiny margin, bollocks. I'll do an amended version when I hit L20, just to keep the suspense going...<br/>\n<br/>\n Oh, and Hip, I am taking notes as advised!<br/>\n<br/>\n Btw, where is everyone?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:22 PM - Feb 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>Just by way of an update: I'm currently testing the build in two PvM environments - Aielund, only at level 8 at the mo, 'cos it's hard work concentrating on both campaigns; and then I thought, Empyre suggested I go SoU/Nether Scrolls/HotU/Sands of Fate, so why not try that out? Just approaching nasty ol' snake-hair, and all goes well currently. Except one thing - and, to be honest, you guys may be slipping up here - my skills distribution is, only by a tiny margin, bollocks. I'll do an amended version when I hit L20, just to keep the suspense going...<br/>\n<br/>\n<br/>\n  </div></blockquote>\n TBH, I really have no clue what your updated version of this build looks like... feats, abilities OR skills.  I remember the deliberation, but not the resolution.<br/>\n<br/>\n But what I stated previously still applies... DESIGN FOR THE ENVIRONMENT.<br/>\n<br/>\n While there may have been some utility with Concentration vs taunters in Aielund, there is none in any of the Bioware campaigns. Those points are essentially tossed away. The rest of the skill allocations are fairly automatic.  Discipline to avoid most special attacks, Tumble for avoiding AoOs &amp; extra AC, Spellcraft to boost saves vs spells and Listen as your one-and-only detection skill which actually has little value in the campaigns since the AI is not focused on stealth. But it does make concealed enemies slightly easier to creep up on so is not totally without merit.<br/>\n<br/>\n Keep in mind that this (ftr/mnk/cot) is not a skillful build combo, not with INT 12, anyway.  Besides... only bards, rogues and assassins are able to expand their skill repertoire enough to change how the toon interacts with its environment.  So I really don't understand how you feel your success rate would have changed with a modified skill set.  Perhaps a few examples might expose the deficiencies for us? \n<blockquote><div>\n Oh, and Hip, I am taking notes as advised!<br/>\n  </div></blockquote>\n Congratulations! I am sure your recount of adventuring will be illuminating to the community. *hmmm... that reads a bit sarcastic now that I check it... but it is definitely not*\n<blockquote><div>\n Btw, where is everyone?<br/>\n  </div></blockquote>\n Your guess is as good as mine. Walking their pit bull. Changing the oil in their vintage 1962 Ford Falcon. Defrosting the refrigerator. Or, more likely... playing NWN! *lol*<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:10 PM - Feb 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Hip,<br/>\n<br/>\n The build I started the playthroughs with is as per the edited version in the first post on this thread, if you wanted a look-see. I suspect I overdid the Concentration due to my being successfully taunted many times in my first blast through Aielund, and so over-compensated. As you say, the rest of the skills pretty much wrote themselves (Discipline, Tumble, Spellcraft and Listen - I would have gone for Spot, but it's not really an option for Monk). This is where personal playing style, as well as your counsel about designing for the environment, kicks in (as far as skills are concerned). With 35 spare points to distribute (more if I drop a few from Listen), if one tends towards sneakiness Hide and Move Silently spring to mind. I myself am not, so in most instances would probably stick some points in Persuade (being a Dwarf with a Charisma of 6, it's damned hard work persuading anybody of anything, which can lead to missed sub-quests, etc), Heal (particularly if soloing) and/or Lore (cheapskate that I am, as well as it being annoying to have to lug items back only to find they would have been really useful in the battle just past). I'll make it clear that there are options when I finalise the build. Oh, btw, it was my maths that knackered the distribution initially - making it an impossible build as it stood - but I was going to raise the Concentration issue again anyway.<br/>\n<br/>\n Thanks for the encouragement!<br/>\n<br/>\n Off to take the fridge for a walk...hang on, no, time to crank up Undrentide!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:46 PM - Feb 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You'll never see \"convenience\" skills allocated on ECB unless the build is skill-flushed (like some roguish ones are) or designed for a well-defined environment (in that case, a posted skill set could be construed as spoilerish information for the undoctrinated of the community).  It's up to the player to glean, adjust and prioritize a formally-published skill set level to best suit what is encountered.  In SP, skill checks can be rerolled and I have passed many important Persuade checks by simply equipping my best CHA/Persuade gear, chugging enough Eagle pots to raise the extra 2 points then saving the game for reload fully buffed.  Same goes for Appraisal (when it is scripted on store open).  Buy Clear Thought rings, maybe a Thayvian Circlet or Intellect Cap (fairly common gear) and use Fox pots before rolling the opposed merchant check.  The amount spent on the boosting gear is quickly recouped by the superior appraisals and once you get a good appraisal it will stand that way until the appraise level increases.<br/>\n<br/>\n I have an odd relationship with stealth skills.  On the one hand, they are a cheap way to conceal for sneak attacks and death attacks.  But on the other hand, they effect movement speed.  I just finished building/testing a maxed stealth Dexer for a PW and played it through to Level 40.  I hardly ever used stealth, though.  Why?  Because it turns out that creature detection skills are so high (or presence of True Seeing skins) on the higher challenge rating level enemies who I could have benefited it most using against, that the stealth check almost always loses and I get trapped inside a mob that I would have otherwise simply pulled apart.  Good 'ol Invis pots is still my mainstay alternate to stealth and one that still allows my toon to move at full speed.  Yes, it can become expensive early on buying pots, but when potential death is factored in... a bargain.  For a dedicated sneaker, especially where HiPS has not been nerfed, though, it is a matter of economics.<br/>\n<br/>\n As far as taunt attempts vs a high-level monk... IMO it's just misguided in PvP and ineffective in PvM.  By the time a hasted monk is perceived and the taunt action begins, the monk should have already stunned or KD'd the taunter.  They just move too fast to succumb to the short-distance taunt action.<br/>\n<br/>\n Except for RDD, I have personally never invested a point in Lore. At times, a failed Lore check at a puzzle can be frustrating but there is almost always an alternative solution.  As for IDing purposes, in SP a single Lore pot or ID scroll will identify near everything in inventory by pausing the game (more like 5 or 6 items during on-line play if you are fast).  And again, boost your skills as you would for Appraise checks before using the ID pot/scroll.  All item values around 10K-20K can be ID'd this way with no skill investment.   Dwarves get that natural +2 to Lore to further boost the value ceiling.<br/>\n<br/>\n I use Heal skill for the opposite reason... will neither cause an AoO nor break the combat action of my targeted ally.  For pure solo, I just break combat, displace, then heal.  I never put my toon in a situation where it must try to survive a near-death situation by emergency in-combat heal action.  If needed, first a invis pot to buy displacement time and then use the consumable in safety.  Tougher to implement vs dragons and other True Seers, but they move fairly slow so displacing is easier. Especially for a motorized monk!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:11 PM - Mar 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually, I've kind of flipped my thinking on the skills issue. Rather than seeing the remaining 35 points (after essentials) as a puzzle as to where to best allocate them, it actually gives flexibility to the build, allowing the player to adapt for their environment. For example, I'm now in Undermountain in HotU, and I know full well that I'm not seeing many of the secret doors. Now, I know I could go buy a Watchman's Hat, but it's a damn nuisance switching gear all the time (you should see me slinging belts on and off - it's a wonder my trousers stay up), so a few points in Search would be beneficial. I know that's CC, but I'd have stockpiled a few to use. However, I doubt that I'd take any in (eg) the Aielund environment. Equally, using CoT to grab some Spot skills might be useful, even though the last CoT level comes at 30. I suppose what I'm saying is that I'll probably give anyone choosing to make use of the build their own freedom to allocate those points not spoken for by the essentials.<br/>\n<br/>\n I'm intrigued by your use of the term \"convenience\" skills. Surely<em> all</em> skills that aren't about keeping you alive are \"convenient\" in the old must-should-could scenario?<br/>\n<br/>\n I absolutely get what you say about stealth skills - and am pleased I'm not the only one!<br/>\n<br/>\n The taunting issue was more about when I was at low levels, so I'd probably only take Concentration (if at all) while still in single digits in this build.<br/>\n<br/>\n Oh, and just a little snippet - while being a Billy Whizz Monk is splendid most of the time (obviously), I've just had to slow him down lots for his fight with an Ogre-Mage I didn't want to kill, because I decorated the walls with him before he had chance to surrender - d'oh. Not often I get to complain about being <em>too</em> good at the job!<br/>\n<br/>\n Sorry, one more little thing, Hip: I've just read your guide to traps - excellent, thank you. It took a lot of the mystique out of the process, and like a lot of people, I tend to avoid what I don't understand.<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "10:08 PM - Mar 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I completely agree about the value of Search, especially for a speedy monk.  Not only helpful for spotting hidden apparatus, but to extend the distance (i.e. prior warning) that a trap on the ground will be spotted while moving at high velocity.  All those OnHeartbeat checks can be a nuisance to deal with unless your play style is full of slow recon (the way I play, but very few others). <br/>\n<br/>\n Those bulky toons who think they can just barge through trap fields (Max... are you reading this? *lol*) are in for a rude awakening when they begin to encounter Epic traps and stacked Deadlies.  One such stack of Deadly Sonic traps were a huge problem in one area I've stumbled through where a mob of duergar archers were waiting nearby to destroy any stunned target which had lost the roll against one or more of the stack.<br/>\n<br/>\n After all the skills directly related to coping with direct combat have been allocated, I also like to pump Search as high as possible, x-classed or not.  Also, when venturing in areas suspected to perhaps contain hidden goodies and traps... ALWAYS gulp Fox pots every few hours.  It really does help. ;)  Those Ammies of the Master also boost that skill and others.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:55 PM - Mar 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Cheers, Hip.<br/>\n<br/>\n Have finished the run-through of SoU/HotU with this Monk/Fighter/CoT now (I would have included the Nether Scrolls transition mod, but it would be tempting fate, as every download I've ever made has been problematic - from minor glitches to complete shutdowns - so I'll save that for a later date.). Had technical problems with the battle with Meph, in that it wouldn't come out of the cutscene and he deaded me without my ever getting the chance to make a blow, just stood there and took it. Finally got it halfway sorted, but interestingly the picture captured on my final save was of a level 1 Aielund character. Weird. I haven't yet downloaded Sands of Fate either, but promise I will once I've completed the below (again, still not wanting to tempt fate - no pun intended).<br/>\n<br/>\n Anyway, have learned several things about the build in this environment (to level 28, anyway) which I'll use in my amendments. As I said previously, I'll now give it a full blast through Aielund as well, so I can see what commonalities there are in the build as well as any differences. Unbelievably, I'm actually being conscientious and rigourous before posting this on the Full Epic forum! If I find any issues with Aielund itself, I'll be sure to post them in the Modules forum - who knows, I might meet the Cosmic Tomato there.<br/>\n<br/>\n Thanks for the continuing support!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:31 PM - Mar 12, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well paint me pink and call me Susan - successfully downloaded Sands of Fate first time! I've just passed the Gate Spirit and been zapped down to a desert landscape. I'll leave it there for now, as I want to complete Aielund with this dude first, but then I can actually give it a proper go (Empyre beware - there will be some dumb-ass questions coming your way, I'm sure. And yes, I'll put them on another thread - guessing I'll have to start one in the Modules forum.). Hurrah!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}