{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "230",
  "name": "RDD bonuses - a couple of quick questions...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/rdd-bonuses-a-couple-of-quick-questions-t2354439.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "4",
  "views": "641",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:31 PM - May 28, 2015",
      "content": "<div>I'm trying to cobble together a build that includes 10 levels of RDD and have reached a head-scratching moment during skill points allocation: when I receive +2 to INT at level 9, does my extra skill point apply retrospectively (like taking the Toughness feat), or just from that level onwards? Also, does the same apply to the +2 CON at level 7? I tried the wiki, but the answer seemed well hidden, if it was there at all.<br/>\n<br/>\n Thanks all</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:18 PM - May 28, 2015",
      "content": "<div>The skill points from increased INT are not retroactive, but the health gain and Fortitude save from increased CON is.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:59 PM - May 28, 2015",
      "content": "<div>Thanks Empyre, that clears things up (and probably means I'll boost INT by an extra 2 points in character creation, rather than CON - though that's not definite yet).</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:10 AM - May 29, 2015",
      "content": "<div>No such thing as too many skill points <span class=\"text-emoji\">😜</span></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:44 PM - May 29, 2015",
      "content": "<div>True enough, wise one! However, the point is now moot, as I was looking at constructing a Barbarian/RDD/Bard build and found that there were about 83,000,000 of them already out there, so have knocked it into the proverbial cocked hat. Strangely enough, my mind moved from Barb/RDD/Bard to Barb/Fghtr/HS to Barb/HS/WM and has now settled on WM/Fghtr/Rogue. Much of that is down to our earlier discussion elsewhere about WM and DD, together with wanting to try a melee build without relying on heavy armour (hence looking at Barbarian first), counter-intuitive though it seems. A sort of Conan type. I admit that taking Fighter instead of Barb seems a coward's way out, but I only did so because of the stupidity of a Weapon <em>Master</em> not being able to specialise in that weapon!<br/>\n<br/>\n Anyway, rambling on now. Will stick something on the Unfinished Builds section for you to shoot at soon!</div>",
      "author-color": "#AA0000"
    }
  ],
  "author-color": "#AA0000"
}