{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "275",
  "name": "Powerbuilding x Playability",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/powerbuilding-x-playability-t2266327.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": "1",
  "views": "741",
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:46 PM - Jun 30, 2012",
      "content": "<div>Hail, folks!<br/>\n<br/>\nI wanted to start this discussion because I have often been involved in debates with some of ou most illustrious members (Hip in particular ) for being \"too much of a powerbuilder\". I acknowledge that my builds can be a pain in the behind to play and level at the first few levels, but by the end, they become such monsters that to me, it makes it worth the trouble you go through at start. I recently saw in the guild's introduction section one of our newer members who is playing my Magical Master build, in its early stages, and is saying that he's very very weak. That is absolutely true, intended and somewhat unavoidable due to the build's characteristic. You could make him more playable by, say, lowering DEX and increasing CON, or changing the spread to have more Tumble dumps throughout, but that would cost you either EMA or EW, etc...<br/>\n<br/>\nSo, here are a few things you'll find that I ALWAYS do when I build in order to attain MAX lvl 40 power:<br/>\n<br/>\n- Delay the acquisition of Rogue, Assassin, Shadowdancer, Monk when using them in builds with other classes that have a full BAB progression to after lvl 20, without changing the optimal spread (meaning that I don't add more Fighter, CoT, Paladin levels just to build BAB, but once I have defined the optimal spread, I try to squeeze as many levels of these classes pre-epic to build up my BAB). F.EX: Fighter 12 WM 25 Rogue 3, the first Rogue level is taken at 23, so I can have 30 BAB at lvl 40.<br/>\n<br/>\n- I Always try to end on a level that gives me something, and that often means delaying important epic feats to the late 30's, such as Epic Dodge in my Shadow Priest build, or Epic Mage Armor and Epic Warding in my Magical Master, etc... I could change the spread and make these builds get those features at lvl 30 or even before, but that would mean a weaker character at 40, and that just doesn't make sense to me.<br/>\n<br/>\n- I don't like building toons that have low AB, so you won't see any of my builds with less than 55 fully buffed AB at 40. That is very important to me, because I am all about powerbuilding, and I HATE battles of 20, I really do. Even my tanking Dwarven Defender build has 58 fully buffed AB.<br/>\n<br/>\nI have to say that this style of building and therefore playing keeps things interesting for me all along. I have played this game for 8 years now, so at least this way I can keep things interesting even after having played it for so long. So far, online I have NEVER EVER had a problem playing any build from 1-40, except for one little exception case, but that was mostly because of my lack of knowledge of the server more than anything else. Nowadays, I believe I would be able to play it from 1-40 without too much problem.<br/>\n<br/>\nSo, what about you guys? What is your opinion on this matter?<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:35 PM - Jun 30, 2012",
      "content": "<div>It depends on the environment in which you are playing. If you will be spending most of your time at level 40, then it is important to be as powerful at level 40 as you can be. If you will be spending most of your time <strong>getting</strong> to level 40 (or whatever level you end up at), like in single-player campaigns, playability is more important, but even then, powerbuilding is worthwhile, as long as it doesn't hurt playability too much.</div>",
      "author-color": "#00AA00"
    }
  ]
}