{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "939",
  "name": "Paladin Build Request ARELITH",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/paladin-build-request-arelith-t2354940.html",
  "author": "Lathandier",
  "avatar": "10758956_1536074492.jpg",
  "replies": "6",
  "views": "956",
  "posts": [
    {
      "author": "Lathandier",
      "avatar": "10758956_1536074492.jpg",
      "timestamp": "5:26 PM - Sep 04, 2018",
      "content": "<div>Heya,<br/>\n<br/>\nI'm looking to build a Tyr Paladin - one of the Triad. I will be playing this build on Arelith, and do have a rather heavy RP focus. My downfall tends to be I don't care about builds, but it does sometimes come to crunch when you do need to lay the smackdown in pvp - and I'd at least like to be competitive since everyone else is. <br/>\n<br/>\nPaladins on Arelith gain a hard bonus to Wisdom every 7 levels after 1 so at level 21 for e.g. you'd gain a hard +3 wis. At 21 you also gain a +3 CL to dispels. Other than that there are no real changes to Pallys. Fighter's have a tonne of additions to make them more viable as straight builds on Arelith, so I was thinking something that could get up in the face of someone and go \"Hyah!\" and bam bam bam! <br/>\n<br/>\nBut really, I'm just a bit stuck for inspiration. A strength based pally seems the way to go, but I really don't know as I haven't much experience. <br/>\n<br/>\nAny help would be fantastic. <br/>\n<br/>\nKindest regards,<br/>\n<br/>\nLathy</div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "7:42 PM - Sep 04, 2018",
      "content": "<div>Hello Lathy,<br/>\n<br/>\nwelcome to the treasure trove of builds!<br/>\nI don't know a thing about Arelith, and I'm still not much of a builder, but others here probably will be able to help you. Have you checked the game guides section yet? There is a helpful post from Maximilian Kane about the Paladin class.<br/>\nWhile the builds are for WOG and go to level 40, you still might want to check here: <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/buildsearch/index.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... index.html</a>. Maybe there is something that is close to what you have in mind?<br/>\nI also would recommend downloading the ECB guild filter: <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/other/ecb-guild-filter\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... ild-filter</a>.<br/>\n<br/>\nDo you want a single class paladin or some class combination? The more specific you are in your request, the better the experts here can help you.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:34 PM - Sep 04, 2018",
      "content": "<div>Hi Lathy, good to meet you.<br/>\n<br/>\nFG makes some good suggestions. I'm not a pally player myself (keep meaning to, but so many builds, so little time), but just wondering, are you wanting to boost Charisma and Strength, or just the one? Pally/CoT always seems like a strong build - particularly if Cha-based (with 10 CoT levels), while Pally/Fighter might make more sense if you're just looking for Str (with 6 Fighter levels). You've probably got enough room for a 3rd class - one that could give Tumble, for example - so Rogue or Bard might be good options (just for 4 levels), or even Monk.<br/>\n<br/>\nJust trying to keep you thinking until someone who knows what they're talking about comes along!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Lathandier",
      "avatar": "10758956_1536074492.jpg",
      "timestamp": "1:12 AM - Sep 05, 2018",
      "content": "<div>Hey guys! Thanks for the responses! <br/>\n<br/>\nI am a fan (despite them generally being weaker) of straight builds. So 30 pally. I just don't know how viable that is, so was also thinking of throwing Fighter in there for extra feats. I'm not a fan of cookie cutter (although it looks like there are very few cookie cutter builds for paladins) - as the roleplay and unique/gimmick aspect for me tends to win me over. (e.g. I have a straight Barbarian on Arelith, all CON and DR) EDIT: So a high CHA seems like something stereotypically a Pally would have if they dedicated their life to it - but also STR in there too. Who knows? <br/>\n<br/>\nI'll take a look at the recommended builds from Max. I've read a lot of Max's builds and I like what he has to say. <br/>\n<br/>\nThanks for your welcoming words guys!<br/>\n<br/>\nEDIT AGAIN: Okay - so I've decided on their base race as Dwarf. On Arelith Dwarves get the Dwarven Waraxe proficiency automatically - so Dwarven Waraxe + Tower Shield. Maybe even a Dwarven Defender/Pally combo???? Is that INSANE?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:05 AM - Sep 05, 2018",
      "content": "<div>Well, again I reinforce that I haven' played a pally, but I did wonder about DwD/Pally. I veered away in fear of mockery from the great and good - though that's never bothered me much before. I suppose it's about the number of feats required to have both classes work well - plus the challenge of having 3 big stats (Str, Con, and Cha) in only 30 levels (especially given the negative to Cha for Dwarves), and at least 1 other having to be better than adequate (Wis). And a decent Dex is needed to meet DwD requirements. It may be possible, but it would take someone better than I am to come up with it - sorry.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:29 AM - Sep 05, 2018",
      "content": "<div>Str(14) Dex(13) Con(12) Int(13) Wis(14) Cha(12) - (after dwarf's racial adjustments) could work, but you would be massively underpowered. These concepts are better left for single-player modules where the competition is less fierce. If it is your first time(s) playing in an unknown environment then you better start with something that is proven/strong and you can come up with ideas for role-playing her later, or you could let the character grow by itself and tell her own stories.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:58 PM - Sep 05, 2018",
      "content": "<div>Wis would not have to be higher than 11 or 12 to begin with if you plan on taking 14 or 21 Paladin levels.</div>",
      "author-color": "#AA0000"
    }
  ]
}