{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "108",
  "name": "Juvenile Wyvern - Level 30 Dragon",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/juvenile-wyvern-level-30-dragon-t2354623.html",
  "author": "theflyingrodent",
  "avatar": "no_avatar.png",
  "replies": "9",
  "views": "679",
  "posts": [
    {
      "author": "theflyingrodent",
      "avatar": "no_avatar.png",
      "timestamp": "12:15 AM - Nov 04, 2016",
      "content": "<div>So the Mid-Epic Forums contain no level 30 Dragon Shifter.<br/>\n<br/>\n<br/>\n Here's a Level 30 Dragon Shifter!<table class=\"post_content_table\"><tbody><tr><td>Druid(18), Champion of Torm(6), Monk(6), Human</td></tr><tr><td> </td></tr><tr><td>STR: 14</td></tr><tr><td>DEX: 8</td></tr><tr><td>CON: 10</td></tr><tr><td>WIS: 18 (30)</td></tr><tr><td>INT: 14</td></tr><tr><td>CHA: 8</td></tr><tr><td> </td></tr><tr><td>Human: (Quick to Master)</td></tr><tr><td>01: Druid(1): Toughness, Blind Fight</td></tr><tr><td>02: Monk(1): {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}</td></tr><tr><td>03: Druid(2): Extend Spell</td></tr><tr><td>04: Druid(3): WIS+1, (WIS=19)</td></tr><tr><td>05: Druid(4)</td></tr><tr><td>06: Druid(5): Empower Spell</td></tr><tr><td>07: Druid(6)</td></tr><tr><td>08: Druid(7): WIS+1, (WIS=20)</td></tr><tr><td>09: Druid(8): Spell Focus: Conjuration</td></tr><tr><td>10: Druid(9)</td></tr><tr><td>11: Druid(10)</td></tr><tr><td>12: Druid(11): WIS+1, Weapon Focus: Scimitar, (WIS=21)</td></tr><tr><td>13: Druid(12)</td></tr><tr><td>14: Druid(13)</td></tr><tr><td>15: Champion of Torm(1): Greater Spell Focus: Conjuration</td></tr><tr><td>16: Champion of Torm(2): WIS+1, Improved Critical: Unarmed Strike (WIS=22)</td></tr><tr><td>17: Champion of Torm(3): {Smite Evil}</td></tr><tr><td>18: Monk(2): Extra Stunning Attacks, {Deflect Arrows}</td></tr><tr><td>19: Monk(3)</td></tr><tr><td>20: Monk(4): WIS+1, (WIS=23)</td></tr><tr><td>21: Champion of Torm(4): Great Wisdom I, Great Wisdom II, (WIS=25)</td></tr><tr><td>22: Monk(5)</td></tr><tr><td>23: Druid(14)</td></tr><tr><td>24: Druid(15): WIS+1, Great Wisdom III, (WIS=27)</td></tr><tr><td>25: Champion of Torm(5)</td></tr><tr><td>26: Champion of Torm(6): Great Wisdom IV, (WIS=28)</td></tr><tr><td>27: Druid(16): Great Wisdom V, (WIS=29)</td></tr><tr><td>28: Druid(17): WIS+1, (WIS=30)</td></tr><tr><td>29: Monk(6): {Improved Knockdown}</td></tr><tr><td>30: Druid(18): Dragon Shape</td></tr><tr><td> </td></tr><tr><td> </td></tr><tr><td> </td></tr><tr><td> </td></tr><tr><td> </td></tr><tr><td> </td></tr><tr><td> </td></tr><tr><td> </td></tr><tr><td> </td></tr><tr><td> </td></tr><tr><td> </td></tr><tr><td>Hitpoints: 282</td></tr><tr><td>Skillpoints: 219</td></tr><tr><td>Saving Throws (Fortitude/Will/Reflex): 23/31/18</td></tr><tr><td>Saving Throw bonuses: Spells: +5, Mind Effects: +2, Fear: +2</td></tr><tr><td>BAB: 20</td></tr><tr><td>AB (max, naked): 23 (melee), 19 (ranged)</td></tr><tr><td>AC (naked/mundane armor/shield only): 26/26</td></tr><tr><td>Spell Casting: Druid(9)</td></tr><tr><td>Alignment Changes: 0</td></tr><tr><td> </td></tr><tr><td>Animal Empathy 33(32), Concentration 33(33), Disable Trap 1(3), Discipline 32(34), Hide 32(31), Move Silently 32(31), Open Lock 1(0), Spellcraft 23(25), Tumble 30(29)</td></tr></tbody></table>\n\n Would most easily level using area spells + wildshape + unarmed attacks. Stonehold + Freedom + Bear + Animal Companion would be effective. Shapes make use of magical effects from Armour, Helmet and Shield. Recommended that one of these be a permanent haste item.<br/>\n<br/>\n Stats in Dragon Shape:<br/>\n<br/>\n STR - 48 [60 with Empowers Bulls Strength, Extended Blood Frenzy and Extended Aura of Vitality],<br/>\n DEX - 36 [46 with Empowered Cat's Grace Potion, Extended Aura of Vitality],<br/>\n CON - 32 [44 with Empowered Endurance Potion, Extended Blood Frenzy and Extended Aura of Vitality]<br/>\n INT - 14<br/>\n WIS - 30 [42 With Owl's Insight and Owls WIsdom Potion],<br/>\n CHA - 8<br/>\n<br/>\n AB in shape:<br/>\n<br/>\n +6 enhanced claws: 20 + 6 [enh] - 2  + 25 [strength] = +49/+46/+43/+40/+37<br/>\n Non-enhanced claws: Above minus 6, so: <span style=\"color:#000000\">+43/+30/+37/+34/+31<br/>\n<br/>\n AC in Shape:<br/>\n<br/>\n 10 + 5 [bark] + 5 [deflection from shifting] + 20 [dodge] + 6 [tumble] + 16 [wisdom] + 18 [dexterity] = 80 AC. Silliness.<br/>\n<br/>\n HP: 282 + 30x17 constitution = 282 + 510 + 100 temp hp = 892 HP. Also silliness.</span><br/>\n<br/>\n Improved Knockdown at level 29 [a bit late but still], 40/+6 Damage Reduction in Shape, Stealth, and 9 Stunning Fists, DC of 10 + 15 + 16 = DC41.<br/>\n<br/>\n Dispel would hurt a bit.<br/>\n<br/>\n<br/>\n Thoughts/additions?<br/>\n  </div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:11 AM - Nov 04, 2016",
      "content": "<div>What happened to your \"no-brainer\" feat, mate?<br/>\n<br/>\n I suspect there is at least one Arelith request for a Level 30 DS floating around and naturally CoT would need to have been involved. The build would have been listed in that thread. Unfortunately there no way to search the request forum.  I doubt any \"official\" ever made it into the complete and tested forum because DS, in general, became unpopular after the initial novelty wore off years ago.  Dragons only work well in wide-open spaces because archers can pick them off easily in dungeons and inside buildings.<br/>\n<br/>\n What's the deal with Conjuration focus?  For Stonehold &amp; SoV?</div>"
    },
    {
      "author": "theflyingrodent",
      "avatar": "no_avatar.png",
      "timestamp": "8:56 AM - Nov 04, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/><span style=\"color:#DCE8F2\">What happened to your \"no-brainer\" feat, mate?</span></div></blockquote>\n<br/>\n<span style=\"color:#DCE8F2\">*profuse rustling of pages*<br/>\n<br/>\n You mean that one? :P<br/>\n<br/>\n<br/>\n DS in the context of a level 30 capped emvironment is quite powerful. But yes, easily  outmaneuvered, not practical in tight spaces or against archery. More a stand still and tank against AI type of character.</span><br/>\n<br/>\n<span style=\"color:#DCE8F2\">I Was more surprised than anything that there wasn't one there, but it sounds like a few build plans have been lost to the sands of time.</span><br/>\n<br/>\n Conjuration was for stonehold and Sov yeah. It has quite a few feats to burn pre level 20, suppose it could get zen archery too. <br/>\n<br/>\n Twas a rough as guts spreadsheet job, not very optimised. :)</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:16 PM - Nov 04, 2016",
      "content": "<div><blockquote><div><strong>theflyingrodent wrote:</strong><hr/>\n<span style=\"color:#DCE8F2\">*profuse rustling of pages*<br/>\n<br/>\n You mean <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Improved_critical\" rel=\"noreferrer\" target=\"_blank\">that</a> one? :P</span><br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Now my world is making more sense. hehehe... yup. You nailed it.<br/>\n<br/>\n IIRC my suggestion for the Lvl 30 DS request was a starting spread of STR10, DEX8, CON10,WIS18,INT16,CHA 8.  Monks gets Cleave without STR prereq, all combat abilities get overwritten anyway and the WF was always intended to be a merely sacrificial prereq for CoT.  The extra skill points from INT16 I used to xclass the trap skills.  I thought the idea of a dragon leaning over to disable all traps and pick all locks (can't use picks so must be a somewhat higher intrinsic level to be effective) while in stealth mode would look comical (and it does!) but enough points for the native form to recover them all for a free supply or to sell at a Blackmarket store.<br/>\n<br/>\n I also liked the extra stuns with so few monk levels but used my \"extra\" feats for stealth SkFocus rather than to boost casting effectiveness since the size modifier has negative effects on those skills.  Went with Search rather than Empathy because that feat is so buggy on most servers and traps are the dragon's bane, especially Negative ones.  Also, the dominated targets seem to just stand around looking coy rather than deflecting attack threats and soaking up your XP rewards.  Could be a CEP rescript issue, I suppose.  Dunno. but it is seldom worthwhile outside of vanilla content. <br/>\n<br/>\n The only skill missing is Listen.  Dragon's true sight will catch the opposed stealthers but can only spot enemies using Greater Sanctuary by the sound when they move. The ultra WIS level helps to offset the detection size penalty (just like it does with stealth skills).<br/>\n<br/>\n Zen archery?  Meh.  I'd use spells, buffed pal and wild/elemental shapes until the goal was in sight.  An awakened pal buffed with GMF does incredibly well against DR types. I suppose you could throw a buffed summon in the mix as well but the party of two is usually good enough for most tasks.  The key is in finding a way to protect against fear until level 16.  The Will save is pretty good for the druid but not so for their furball ally which runs like it was set on fire when feared.  Watch out for those mummies!<br/>\n<br/>\n Toughness...  also a good choice for any dedicated polymorph build.  I've seen people throw in Weapon Finesse to help their badger and Air Elemental when they use shapes in confined areas. Don't recall if I did that or not, though.<br/>\n<br/>\n I believe Stonehold can be resisted with Clarity pots or any sort of mind protection but haven't tested this stuff in quite a while so have no records to support that.<br/>\n<em>edit: yah. Stonehold is easily resisted by any method used to apply immunity of mind effects to the weak-willed including Clarity and standard creature skins.</em><br/>\n<br/>\n I think the main difference in my version was going heavier caster pre-epic while manuevering feats for polymorphs.  Something like dru16/mnk4 with Dru 17 at 21 and then CoT1-6 for a quick WIS ramp-up for AC bonus and SF DC boosts for the shapes. It doesn't matter whether you take your WF in pre-epic or not because it has no value beyond the class prereq. You'll never achieve more than 3 APR (that's the native progression obviously) in a 30-level DS build so it doesn't matter how you get to BAB 15.  Gaining access to Nature's Balance during pre-epic can help lots against arcane threats (and the extra slots don't hurt either).<br/>\n<br/>\n Anyway... that's all from my recall.  Problem is, I can't remember if it was a build suggestion on the ECB, Reddit, Twitter, Facebook or some other venue.  Since BSN folded, the NWN community has spread out all over the Net.<br/>\n<br/>\n<em>edit: confirmed some spell-specific information a few lines above.</em></div></div>"
    },
    {
      "author": "theflyingrodent",
      "avatar": "no_avatar.png",
      "timestamp": "3:19 AM - Nov 05, 2016",
      "content": "<div>Fair enough. Looking through the archive, it seems there a lot of broken character build links like this (Supposedly a Combat Medic build, which I love).<br/>\n<br/>\n<a class=\"postlink\" href=\"http://my.xfinity.com/~worldofgreyhawk/builds/data/build138926.html\" rel=\"noreferrer\" target=\"_blank\">http://my.xfinity.com/~worldofgreyhawk/ ... 38926.html</a><br/>\n<br/>\n I understand the majority of the guild members here play primarily for RP, and that seems to be reflected in the builds I've seen here [lots of interesting combos to be sure!]. But for the newcomers to NWN, who might be directed to this place looking for something safe to play, there's quite a lack of bread-and-butter powerbuilds on display IMO. And it looks like a lot of them 'used' to exist but are now dead links.<br/>\n<br/>\n Are they still archived away somewhere? Or have they just been swallowed up by forum deactivation? If not, I could set about trying to piece some of them back together. After all: The more players the merrier, this is an old game. :)<br/>\n<br/>\n<br/>\n Edit: Aaaaand I'm guessing its this.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354480/How-and-Where-to-Access-Legacy-ECB-Archives#.WB1PXfp97IU\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... B1PXfp97IU</a></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:32 AM - Nov 05, 2016",
      "content": "<div>Surely you jest. <img class=\"img-emoji\" src=\"emoji/10.gif\"/> Optimized power builds is the ECB's main focus unless specified to be designed for other reasons by the contributor (roleplay, module-specific, server-specific or whatever personal preferences have been documented).  You are free to express your own ideas about any build posted here that would improve the end result, make it comply better with your idea of what \"optimized\" is or should be.  And there is no time limit on resurrecting any discussion.  Regardless of how old any build is, it can still be commented anew (though the original author may not still be active these days... c'est la vie!).  The sad fact is, most of the vets have suffered the inevitable pressures and responsibilities of RL as a natural adjunct of the aging process and no longer have a window of opportunity for frivolous pursuits after egaming for near 15 years.  The embryos of the past are now the middle-aged of the present.<br/>\n<br/>\n I already posted links for you to all the applicable resources to locate ECB builds, old and new ------------&gt; <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/reply/20853813/Bearded-Battlewitch-SoUHotu-Wizard-23-Fighter-4-Assassi#reply-20853813\" rel=\"noreferrer\" target=\"_blank\"><strong>HERE</strong></a>.   <br/>\n The Comcast server that housed access to the previous guild's database has been offline for years now.<br/>\n<br/>\n BTW, there was a pre-epic ECB guild way back when and that has its own downloadable widget, but there was never a mid-epic or free-level guild.  Those sorts of builds are unique unto the current ECB that Kail developed here.<br/>\n<br/>\n Keep in mind, however, that some legacy builds contain designs/exploits that were applicable only for earlier versions of NWN and no longer compliant.  Check the <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/forums/60574/\" rel=\"noreferrer\" target=\"_blank\"><strong>Bioware Legacy Builds</strong></a> section for a few examples of such postings that do not comply with v1.69.</div>"
    },
    {
      "author": "theflyingrodent",
      "avatar": "no_avatar.png",
      "timestamp": "6:43 AM - Nov 06, 2016",
      "content": "<div>Yep I jest, should look before I leap. :P<br/>\n<br/>\n Perhaps <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/other/epic-character-builders\" rel=\"noreferrer\" target=\"_blank\">THIS LINK</a> could be made more explicitly available? Maybe pinned to the top of the Full Epic Builds Forum with some additional info about pre 1.69'ness etc?<br/>\n<br/>\n I walked into the 'Level 40 Builds' Forum upon entering here, to find about 200 mostly monks and fighters, unaware of the 2,000+ builds covering the entire nwn spectrum that existed in the 'rules' section until you pointed it out.</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:36 AM - Nov 06, 2016",
      "content": "<div>Well, it was always intended that the Rules and Tools section (the one Kail worked on the longest) be one of the first areas new viewers would peruse rather than just jumping into the building aspects and hoping natural osmosis takes care of their education.  Kail's plan was to avail neophytes of the most key resources in one spot in an effort to make their designing time the most productive immediately.   And I agree.<br/>\n<br/>\n I continue to nudge folks new to the site in that general direction but sometimes it doesn't make a dent.  We shouldn't need flashing neon signs pointing directions when most all Forums on the Web follow just about the same organization... an introduction, a set of rules/guidelines and then a page of links/description to resources that will support using the site.<br/>\n<br/>\n I'm a documenter and file systems manager by former trade (among many other positions shoved down my throat over the years) so understand very well the benefits of structure.  The ECB has a table of contents to start the journey out right, so if visitors decide to bypass it, they stand to miss out on many items that would make their time here more efficient.  I've learned that myself on other forums.  It's always best to get fully oriented before trying to contribute something.<br/>\n<br/>\n There are ways to force new members to visit the orientation and fundamentals first before granted posting access (some forums use this method), but alas, Forumer doesn't provide that level of control.</div>"
    },
    {
      "author": "theflyingrodent",
      "avatar": "no_avatar.png",
      "timestamp": "9:56 AM - Nov 06, 2016",
      "content": "<div>It certainly looks like a lot of effort went into that section. I cannot imagine how long it would've take to categorise all of that.<br/>\n<br/>\n I agree: at the end of the day, the goal is for players to have the knowledge to design builds for themselves, not just copy other's ideas. In that regard, having a library of resources that goes through the process, close by to a library of builds that could be used for reference, certainly encourages a DIY approach to character building.<br/>\n<br/>\n And yes, sometimes people just want a build that they can pick out like a bag of sweets, and don't take the time to try and digest a forum properly.<br/>\n<br/>\n I first posted the Battlemage/witch build on the Bioware forums at the beginning of this year, and once it died tried to post it onto the NWN GoG forum [seemed like a place that new players would stop at], before being directed here. In that regard, I rushed into things unaware of the structural standard builds are held to, a standard for which is helpful for categorising and comparing them side by side.<br/>\n<br/>\n I also missed out on reading key components of the forums before I did so [for e.g. the table of contents], which if I'd taken the time would've directed me to the library of builds a lot sooner. For which I made a little bit of a fool out of myself asking silly questions.<br/>\n<br/>\n So! Having learnt from my mistakes, I might try and focus on adding a few polished characters into the Epic Build archive when I get the chance. I've played in a few neighbourhoods over the years and can still see some interesting builds that I've encountered that are not currently in the Old or New Archive. It looks like Valerfor has quite a high standard of presentation: That would be a good level to aspire to!<br/>\n<br/>\n And maybe in a few months, I'll post an Aelund adventurer up if I ever get the chance to complete it. My background is in teaching; I like organised concise explanations of stuff. :)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:40 PM - Nov 06, 2016",
      "content": "<div><blockquote><div><strong>theflyingrodent wrote:</strong><hr/>\n\n And maybe in a few months, I'll post an Aelund adventurer up if I ever get the chance to complete it. My background is in teaching; I like organised concise explanations of stuff. :)<br/>\n  </div></blockquote>\n<div align=\"left\">In case you've not picked it up elsewhere, it's probably worth noting that Aielund is a non-DevCrit environment (and a decent Will save will help a lot, too).</div></div>",
      "author-color": "#AA0000"
    }
  ]
}