{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "159",
  "name": "A thought for future builds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/a-thought-for-future-builds-t2355197.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": "5",
  "views": "236",
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:36 PM - Oct 14, 2019",
      "content": "<div>Hello all, <br/>\nI'm gonna be super-brief, because my time is limited, so, straight to the point. <br/>\n<br/>\nI was thinking lately that we are having a lack of \"desire\" for lack of a better word, to build towards expanding our level-20 &amp; level-30 sections of the forum. <br/>\nI know for a fact, that I had plans to make at least half-a-dozen builds for the level-20 sub-forum, including a Ranger 15/ Fighter4/ Rogue 1 &amp; a half-orcish Fighter 6/ Bard 4/ Pale-Master 10, to name a few. <br/>\nBuilding for the level-20 &amp; level-30 sub-forums can be a really rewarding experience since so many spots have been left untouched &amp; there is so much room for innovation. <br/>\nBesides, there are many folks around that play on RP-oriented servers &amp; almost all of them are level 20/30 capped &amp; could really use our help. <br/>\n<br/>\nThat's all, feel free to agree or disagree with this, I'm interested in hearing your thoughts.</div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "10:01 PM - Oct 14, 2019",
      "content": "<div>That's a great proposal from my point of view, lv 20 is sometimes the cap in offline modules, so this will surely give some ideas and proposals for new characters!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:12 PM - Oct 14, 2019",
      "content": "<div>I'm with you all the way on this, Valerfor.<br/>\n<br/>\nMany PWs and most modules won't allow you the luxury of playing at level 40, and many players either don't have the inclination or facility to do so, and we would be remiss in our mission to assist in building to <em>all</em> levels unless we gave those level 20 and 30 builds some love.<br/>\n<br/>\nAnd apart from helping players, it's surely a good discipline for the builder to squeeze what they can into the levels available. I've seen several putative builds lately that take pre-epic feats in epic levels - and that's a luxury only afforded by builds that will reach those glorified heights. How quickly we forget...<br/>\n<br/>\nSo yes, an excellent idea. Builders get to hone their skills, players get to benefit - win /win!<br/>\n<br/>\n(And Mick started up something similar back in November 2017 about quality low-level - below 10 builds which we may sadly have let rot on the vine... <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/what-makes-a-strong-low-level-1-10-build-t2354767.html\" rel=\"noreferrer\" target=\"_blank\">https://www.tapatalk.com/groups/nwnecbguild/what-makes-a-strong-low-level-1-10-build-t2354767.html</a>)<br/>\n<br/>\nStill, what can we do but do better?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:41 AM - Oct 15, 2019",
      "content": "<div>Agree <br/>\n<br/>\nMmm I made the last lvl 20 build :) Maybe a few months ago. Then I started playing WoG with its Epic Challenges etc.<br/>\n<br/>\nSuggest 20, 30 (Arelith) and 28 (for HoTU) -&gt; we can run a challenge perhaps.<br/>\n<br/>\nMaybe Level 28 can be a subsection forum to acknowledge that is essentially the Lvl cap for HoTU<br/>\n<br/>\n'Highest AB' playble warrior for HoTU challenge or something like that </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:14 AM - Oct 15, 2019",
      "content": "<div>I don't see why a \"challenge\" would - or should - be necessary. If we agree other areas need more attention, let's just attend to them, eh?<br/>\n<br/>\nI'm also averse to making something like a level 28 sub-forum, or the floodgates open and we have a level 36-38 Aielund build sub-forum, and so on. Just know it's a good general build or where the build will be played and construct accordingly.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "6:10 AM - Oct 15, 2019",
      "content": "<div>Well challenge is not in a literal sense, but more where people put up ideas on what constitutes a strong build in a certain circumstance.<br/>\n<br/>\nThat thread you linked of Mick's for example. I think there were two ideas for the strongest lvl 1 build, a 18 Str fighter and a Druid level 1 with improved expertise<br/>\n<br/>\nOr the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/concept-yardstick-builds-t2293896.html\" rel=\"noreferrer\" target=\"_blank\">yardstick builds thread by TyrTemplar</a><br/>\n<br/>\nMight be a bit of fun you know<br/>\n<br/>\nAielund sub-forum... hmmm... good idea... but its pretty close to level 40... &gt;:)</div>"
    }
  ]
}