{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "302",
  "name": "Request for Sorcerer help (Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/request-for-sorcerer-help-arelith-t2354277.html",
  "author": "Hafen",
  "avatar": "10235222_1510287070.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "3:42 PM - Jul 18, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">This is supposed to be a PVP character, level cap is 30rd, race drow (basic elf race with/without drow subrace gifts). Our faction consistes from 90% of meleers and all enemies rely purely on their arcane spellcasters.<br/>\n<br/>\n I want to keep it low ECL, so i post ECLs i wanna to choose from - availeble gifts: drow subrace (adds +2 char +2 int 32 SR for 2ECL), mark of humilty (-2ECL, but - 2 to all abilities)<br/>\n<br/>\n For multiclassing the basic rule of Arelith - 3 followings lvls in each class must be taken when multiclassing.<br/>\n<br/>\n From role play reasons i dont wish to employ Pale Master, i am not wishing to role play out being undead/partial undead.<br/>\n<br/>\n Cheers.<br/>\n<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "7:51 PM - Jul 18, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just curious because I am not very familiar with the Arelith system: Why bother with both the drow subrace and the humility gifts? Is it just for role-play purposes? Humility nerfs all of the advantages of the drow subrace except for 32 SR and darkness 1/day, which seems like a poor trade for no net gain in INT, CHA, or DEX, and -2 STR, -2 WIS, and -4 CON. Meanwhile, the evil-only alignment restrictions preclude taking paladin for the saving throw bonuses and possible divine shield.<br/>\n<br/>\n Obviously, if you mean that you might create a drow sorcerer without the humility \"gift\" (or even the drow subrace gift), then that may work out fine. Having +2 CHA and INT could be a nice edge for this build (especially as sorcerers are often skill starved). I would definitely not take humility. If level advancement with +2 ECL will be too slow, then drop the drow subrace gift, but that would depend on how quickly you need the toon to advance.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "10:46 PM - Jul 18, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The original thougt was that subrace offers sr which renders me ost immuneto scrolls and wands. Qlso bpnus to charisma and int would counter the penalty from humility.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:30 PM - Jul 18, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You would still have -2 on your STR, DEX, CON, and WIS. That's <strong>huge</strong>. You are better off with the ECL from Drow, or taking no gift at all.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:20 AM - Jul 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I agree with the the others that the gift appears to be more a curse than a gift and would decline it unless there is some RP reason to penalize your toon.<br/>\n<br/>\n The most obvious multiclass for synergy would be to go LG with 4 levels of pally... nothing innovative naturally, but you'll get great saves, an AC bonus from Div Shield that will stack with EMA and if you decide to melee using a polymorph (eg. tenser's or FE golem), you can select Div Might (along w/DS), castable while polymorphed.  <br/>\n<br/>\n With high CHA, the benefits will be significant and still will be able to avoid dispels other than Mords with 26 levels of sorc (even a pure Sorc 30 can be dispelled by Mords anyway).  Pretty much run-of-the-mill exploit for a CHA build. Actually, you could even add 3 levels of a tertiary dump class (perhaps one idea might be to grab monk progression for use with polymorphs using creature weapons and a late tumble dump plus some handy \"monkish\" feats) since Sorc 23 should still be able to grab a few epic spells (though I haven't actually sketched it out myself yet).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}