{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "333",
  "name": "magic and mods",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/magic-and-mods-t2351231.html",
  "author": "madmocha",
  "avatar": "no_avatar.png",
  "replies": 2,
  "posts": [
    {
      "author": "madmocha",
      "avatar": "no_avatar.png",
      "timestamp": "11:11 PM - Mar 13, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I'll preface this question by stating that I use mods because my internet is limited to a wireless, low bandwidth connection.  My wife would make short work of my online time if I were to take large chunks out of her work-related bandwidth.      As much as I would enjoy doing online PW's, alas...<br/>\n<br/>\nAnyway, I've always tended to play fairly generic fighter types, only recently venturing into the world of the Rogue.  In constantly searching for adequate mods, I came across the 'Ravenloft' series, which I gather is strictly mage centered.  I'm embarrassed to say, I've never played mage.   Don't really know the class or how to play it.  I've done quite a bit of reading, though, including whats in the 'Concept - yardstick' thread.  At this point I'm not really looking to create something new or different.  I thought I'd maybe just try a basic pre-made build (which is why I wasn't sure whether to address this here or in the 'General' forum).  With the plethora of various types of mages... Wizards, Sorcerers, fighter types, strictly mage types, etc., I wasn't sure which direction would be best to go for a magic user noob.  That's the question I'm asking.<br/>\n<br/>\nThanks (ahead of time).<br/>\n<br/>\n*Edit...<br/>\nI guess that includes, do you have a pre-made build suggestion you would consider good for said noob.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:00 AM - Mar 14, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hmm, wonderful new world isn't it?<br/>\n<br/>\nAlrigth, you posed two questions so i am gonna answer them individually.<br/>\n<br/>\n1) PW's don't take a lot of bandwith to play, i know because i have a limited speed connection myself, Max too amongst others. Still, the world of modules can provide for much entertainment till you get to play in a real PW. There is llso a third option that i do not know if you have consider it or you know about it at all. Play in a serious PW offline, here take a look at probably the best of it's kind (low/ medium magic world)<br/>\n<br/>\n-&gt; <a class=\"postlink\" href=\"http://nwvault.ign.com/View.php?view=Modules.Detail&amp;id=3867\" rel=\"noreferrer\" target=\"_blank\">http://nwvault.ign.com/View.php?view=Mo ... il&amp;id=3867</a>  (module)<br/>\n-&gt; <a class=\"postlink\" href=\"http://worldofgreyhawk.fr.yuku.com/\" rel=\"noreferrer\" target=\"_blank\">http://worldofgreyhawk.fr.yuku.com/</a>  (forums)<br/>\n<br/>\nWoG offline will provide you with countless hours of enjoyment and in a rather harsh environment but it will give you some real feedback and will make you a better player. It has scripted quests (hundreds), is huge &amp; is updated regularly plus you only need CEP 2.4 to run it (link provided at the module). Frankly from what i have searched it is the only world that the build we make here work as intended or even better. No arbitrary fluctuated saving throws on enemies, no perma-true seeing on enemies, no forbidden feats, almost all enemies use real builds from ECB, 2-handed builds can have good AC via the shield bracers and so on. Plus the server's quests are top notch, directly delivered from the 1st Edition modules. And you can play on LAN if you want with your friends. One warning though, it is a tough world, so you maybe want to try something else after all. It is definitely worth a good look though.<br/>\n<br/>\n2) If you want to play a caster in modules then this is not a problem, usually they don't have rest restrictions and that makes them caster-friendly no matter what you will choose. In most PW's though you will have to conserve your spellpower somewhat. Now, the best user-friendly full caster is definitely a cleric. You can cast in full plate and generally you will play much like you play with your warriors - except you can fire spells too! And it is the most powerful class there is, so i would recommend to play a Cleric first before you start playing other full casters. except if by \" caster \" you meant a Sorcerer/Wizard, then i would recomment to play a Bard first before you go into the deep of spellcasting. Generally baby-steps, one at a time and then before you know it you will play full casters before you even realize it   <br/>\n<br/>\n3) Some build recommendations then, I will keep it simple for now and only link pure ones, keep in mind though that the full potencial will come once you play in a forty lvl world/module.<br/>\n<br/>\n-&gt; <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build178675.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 78675.html</a>  (very useful posts there- read it thoroughly)<br/>\n-&gt; <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build301814.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 01814.html</a>  (the famous melee mage)<br/>\n<br/>\nSearch here too for Max's clerics, i believe later he build two pure ones too.<br/>\n<br/>\nHappy gaming!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "madmocha",
      "avatar": "no_avatar.png",
      "timestamp": "10:18 AM - Mar 14, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Valerfor,<br/>\nTo say I'm fairly ecstatic would be understating.  I didn't know there were any PW's that allowed for off line play, and the fact that it is WoG is...awesome!      Have I ever played on Grayhawk?  No.  But you can't hang around ECB forums for any length of time without becoming familiar with the name.  Griz  has been touting the place for as long as I can remember.   Yeah, I've been dropping in occasionally since '03 I think.  My boys, grown now, were fans of his 'stories', like the ones that started the last great bounty hunter and Iron archer builds.  Anyway,  this is amazing.  Thanks.<br/>\n<br/>\nI got my information about band-width usage from a friend that works at an electronics store.  I tried going on once, and my wifes work-place was wondering what was causing the drain on the account, so that's when I asked this guy, and he said yeah, it can take a lot.  So... ?<br/>\n<br/>\nAnyway, thanks much for the answers.  Much appreciated.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}