{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "991",
  "name": "Assassin build help request",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/assassin-build-help-request-t2354834.html",
  "author": "Niu7",
  "avatar": "10758869_1521841378.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "Niu7",
      "avatar": "10758869_1521841378.jpg",
      "timestamp": "10:59 PM - Mar 26, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Salut! Since \"Enchanted Edition\" coming out tomorrow I want to play NwN again and, perhaps, get involved in some online actions. I was thinking about Arcane Archer build but I understand that I am stuck with it because I've played with it so much previously. <br/>\n<br/>\nSo I decided to try something new, namely, the assassin. <br/>\n<br/>\nI want to build something easy: ranger 9/fighter 4/assassin 27.<br/>\n<br/>\nI read this manual, began to plan the character and ... got stuck :-( <br/>\n<br/>\nNow I need your help :-)<br/>\n<ul>\n<li>So, first: do I need to increase the constitution by more than 10 points? Given that I'm considering PvP. Also, do I need to consider to take Toughness feat for more health or I can skip it?</li>\n<li>Second: do I need to get Dodge/Mobility/Spring attack feats or I can skip them?</li>\n<li>Third: is it enough to get 27 levels of the assassin or better to get 30?</li>\n<li>Fourth: do I need to take Discipline skill or no?</li>\n<li>Fifth: how critical it is for an assassin to get Improved critical feat?</li>\n</ul><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "4:36 AM - Mar 27, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think you should spend some time looking at the discussions of the builds posted in the various build forums. Such as the level 40 build forum and the level 20 build forum. <br/>\n<br/>\nIf you're asking whether you should increase your con for that class breakdown, the general answer is no. You want to put the stat increases into either something that is going to increase your hitting, or decrease your chance of getting hit. Unless you are doing a build that has damage reduction, or is planning on being a tank. An assassin is not generally a tank.<br/>\n<br/>\nIs this assassin a strength build or a dex build?<br/>\n<br/>\nIn general, assassins, with all the sneak attack damage, won't generally be missing improved critical that much, because if things are immune to sneaks, they're generally immune to critical hits....<br/>\n<br/>\nYour third question is ambiguous....better for what? At what cost. 3 more assassin levels generally nets you 3 more dc on your death attack paralyze dc...<br/>\n<br/>\nLook for an assassin build .  If you have questions on what is going on with that build, make a post and start a discussion about that build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:39 AM - Mar 29, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Take a look at this one Niu, he is an unusual one but uses the three classes you mentioned and still generates a high dc \"death attack\" even though he doesn't really need it to get the job done. He has about (50) hide/move silently in full plate armour should you wish to play peek-a-boo. And you don't need to concern yourself with taking a feat or not since he probably has everything you ask for and more, same with skills. If i was doing him again now i would probably eschew the shield for a two-handed weapon as well but this is something that can be very easily changed.<br/>\n<br/>\n<strong><span style=\"color:#CC0000\">Night Raider</span></strong> =&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-night-raider-ftr-10-asn-25-rng-5-t2354423.html#p7048\" rel=\"noreferrer\" target=\"_blank\">the-night-raider-ftr-10-asn-25-rng-5-t2 ... html#p7048</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}