{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "182",
  "name": "Shield Tanking dwarf",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/shield-tanking-dwarf-t2354499.html",
  "author": "Lieutenant Kalis",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "410",
  "posts": [
    {
      "author": "Lieutenant Kalis",
      "avatar": "no_avatar.png",
      "timestamp": "4:49 AM - Feb 07, 2016",
      "content": "<div>So.. I was thinking about a Wizard/Dwarven defender. Splitting it 20/20. He will be capable of meeting the +12 Intel cap. What should I spell focus in to enhance it's ability? Should I do conjuration? Would it be wise to go 20 in DD or to atlease get the -/9 DR. Thinking about going full constitution to pump his Hitpoints. What are your thoughts?<br/>\n<br/>\n ~Lieutenant Kalis</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:11 PM - Feb 07, 2016",
      "content": "<div>Don't see the point, really. <br/>\n<br/>\n With Epic Warding, Premonition, Imp Invis, etc etc... the value of an extra 9 points of DR becomes inconsequential.  Not to mention a high-level mage's ability to polymorph into a hasted, ridiculously-powerful uber-HP Iron Golem that can pierce up to 20/- DR with creature weaponry.  Throw in Mestil's Sheath, Elemental Shield &amp; Death Armor (all long duration, btw) and any enemy DwD 30 (including one with the full monty of epic DR feats) won't get within an arm's length of the golem without suffering severely (assuming the mage could be hit at all which is unlikely for a DwD attack, an historically mediocre-AB defensive tank toon).  The only way to destroy a mage enhanced in this manner would be with high-DC Slay Construct enhancement weaponry and AFAIK those don't exist unless the designer(s) of the PW specifically considered such a threat and made them available. <br/>\n<br/>\n BTW, Kalis... are you planning on playing two builds simultaneously on your PW or are you already bored with your first request?</div>"
    },
    {
      "author": "Lieutenant Kalis",
      "avatar": "no_avatar.png",
      "timestamp": "9:00 PM - Feb 07, 2016",
      "content": "<div>I've started the Cleric/monk/rogue. Just not many players on atm. I ask about the wizard because I already have a 19 wizard and wanted feedback to whether going 20 DD would be worth it. But I do like your choice better. I can surely see its a long way for me before I take in consideration that building an \"ideal\" toon takes time and precise calculations. My apologies Hip, I've only got time on the weekends and little time on the weekdays to sit down and piece together a fun toon. <br/>\n<br/>\n ~Lieutenant Kalis</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "10:17 PM - Feb 07, 2016",
      "content": "<div><blockquote><div><strong>Lieutenant Kalis wrote:</strong><hr/>I've started the Cleric/monk/rogue. Just not many players on atm. I ask about the wizard because I already have a 19 wizard and wanted feedback to whether going 20 DD would be worth it.<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">You are probably better off with a few monk dumps for tumble and monk AC.  The extra move speed wouldn't hurt either.  If you buff with Empowered Owl's, you'll gain 2-3 AC that will not get lost when flanked or by AoOs like dodge or dex AC will.  Also, when the occasion does finally arrive that you must use a polymorph (like against Raks or demilichs... all those spell immunes), the forms using creature weapons will get the sweet monk progression and with high APR.  Try it out with a hasted, stoneskinned Umber Hulk with monk influence and you will see what I mean.<br/>\n<br/>\n Of course, you'll need to save enough skill ranks to make sure you can get the greatest AC boost from Tumble.  Also, Discipline dumps would help vs potential KD/IKD attempts on your mage.<br/>\n<br/>\n If you are trying to incorporate a fighter class (any 1 BAB/level pre-epic class is a \"fighter\" class) to make a spellsword, you'll need to get many high BAB levels in during pre-epic (BAB 16 as target) and leave the mage spell development until epic, for the most part. DwD is certainly a fighter class, but one that adds little that the spell repertoire cannot accomplish on its own. The main problem with such an idea is that by splitting the primary ability (either INT/STR or INT/DEX with finessed attack), each gets diluted by the other.  That's why fighter is so much better during epic.  You can take Great Ability feats with all the general slots and still have plenty of bonus room to enhance combat.<br/>\n<br/>\n  </div></div>"
    }
  ]
}