{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "026",
  "name": "Ash - \"The Squirrel\" (Rogue 28/ Fighter 6/ CoT 6)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ash-the-squirrel-rogue-28-fighter-6-cot-6-t2355826.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 17,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:54 PM - Nov 12, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><em>EDIT 1 August 2024: I've now finally played Ash through to Level 40 (the OC and Mines of Twin Summit). She needs to be played carefully and patiently until level 7, and really starts earning her corn at level 12. After that, she's a smooth levelling character and a great play. Initially she had 2 Improved Sneak Attacks, but I ended up taking Skill Mastery instead of one, so now she 'only' has 15d6+6 sneak damage. As much as anything, I decided to do this because Ash really taught me a lot about the fun to be had in blowing bad dudes to pieces. I would have taken it earlier - probably swapping with Crippling Strike - but it didn't occur to me until about level 33. I've kept all the discussion about her included from her time in the Build Request/ Unfinalized Builds forum just to give a fuller picture of her construction. She's also something of an RP build, so feel free to take points from Charisma and redistribute should you wish.</em><br/>\n<br/>\nTime for adding a halfling Rogue to my repertoire. She got her name from when she was barely a toddler, found abandoned and freezing in winter snows by a band of mercenaries. She couldn't remember her own name, but would snuggle up next to the campfire as close as she could and sleep in its embers, so the men called her Ashy-Arse after the grey stains on her the following morning. She quickly learned to take care of herself, never going hungry and \"borrowing\" both clothes, then trimming them to her diminutive size, and knives, used to feed to her curiosity - she could not bear not to know what was in the various travelling chests of the mercs. They tolerated such activities, for she was always smiling and full of entertaining tricks of the hand and eye that gave the men rare smiles at the end of the day. As she grew, she deemed the \"Arse\" bit of her name something of an embarrassment, so dropped it like a broken plate, and was given the nickname \"The Squirrel\" for her agility, inquisitiveness, and ability to hoard assorted \"could come in useful\" items. The kinder men of the group also taught our young hin some fighting skills so she could defend herself, if needed.<br/>\n<br/>\nAnyway, to the build. Rogue/ Fighter/ CoT has been successfully done many times before - including several excellent halfling builds (I'm struggling to provide links atm, but special mention should go to Tyr Templar's Shadow Sword - R26/ F4/ CoT10; and Mick Dagger's Halfling Champion - R20/ F6/ CoT14), but I'm hoping Ash brings something new to the table. I'm sure you'll let me know if not. I've built her my way, so there are various alterations you might prefer.<br/>\n<br/>\nSo, here she is. Any comments welcome!<br/>\n<br/>\n<strong>Ash \"The Squirrel\"</strong><br/>\nRogue 28/ Fighter 6/ CoT 6<br/>\nHin - any non-evil<br/>\n<br/>\n<strong>Stats</strong><br/>\nSTR 10<br/>\nDEX 18 (34)<br/>\nCON 10<br/>\nWIS 8<br/>\nINT 16<br/>\nCHA 12<br/>\n<br/>\nHPs: 328<br/>\nAC: (naked) 33, (+large shield) 35<br/>\nSaves: Fortitude 26, Will 20, Reflex 39. +4 v spells, +2 v fear-type spells, +6 v traps<br/>\nSneak Attack: 15d6+6<br/>\nSpells: UMD<br/>\nBAB: 27<br/>\nAB: (max, melee) 44, (dual-wield) 42, (ranged) 41, (thrown weapon) 42<br/>\nSkills: 401. Disable Trap 43 (48 w/synergy), Hide 43 (61), Listen 43 (46), Move Silently 43 (61), Open Lock 33 (45), Persuade 19 (20), Set Trap 31 (45 w/synergy), Search 39 (42), Spellcraft (cc) 17 (20), Tumble 40 (52), UMD 34 (35)<br/>\n<br/>\n<strong>Levelling</strong><br/>\n1 R1: Luck of Heroes/ {Sneak Attack I}<br/>\n2 F1: Weapon Finesse<br/>\n3 R2: Weapon Focus: Dagger/ {Evasion}<br/>\n4 F2: DEX+1 (19)/ Knockdown<br/>\n5 R3: {Uncanny Dodge I}<br/>\n6 F3: Blind Fight<br/>\n7 F4: Weapon Specialization: Dagger<br/>\n8 R4: DEX+1 (20)<br/>\n9 CoT1: Two-Weapon Fighting<br/>\n10 CoT2: Ambidexterity<br/>\n11 R5<br/>\n12 R6: DEX+1 (21)/ Improved Knockdown<br/>\n13 R7<br/>\n14 R8<br/>\n15 R9: Improved Two-Weapon Fighting<br/>\n16 R10: DEX+1 (22)/ {Improved Evasion}<br/>\n17 R11<br/>\n18 R12: Toughness<br/>\n19 CoT3<br/>\n20 F5: DEX+1 (23)<br/>\n21 CoT4: Great Dexterity I (24)/ Epic Weapon Focus: Dagger<br/>\n22 R13: {Defensive Roll}<br/>\n23 R14<br/>\n24 F6: DEX+1 (25)/ Great Dexterity II (26)/ Epic Weapon Specialization: Dagger<br/>\n25 R15<br/>\n26 CoT5<br/>\n27 R16: Great Dexterity III (27)/ Epic Dodge<br/>\n28 CoT6: DEX+1 (28)/ Armour Skin<br/>\n29 R17<br/>\n30 R18: Epic Prowess<br/>\n31 R19: {Crippling Strike}<br/>\n32 R20: DEX+1 (29)<br/>\n33 R21: Great Dexterity IV (30)<br/>\n34 R22<br/>\n35 R23<br/>\n36 R24: DEX+1 (31)/ Great Dexterity V (32)/ {Skill Mastery}<br/>\n37 R25<br/>\n38 R26<br/>\n39 R27: Great Dexterity (33)<br/>\n40 R28: DEX+1 (34)/ Improved Sneak Attack I<br/>\n<br/>\nAnd a pic...<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202111/10404082_e707150a68a0d51ffe9babeaff2b69fc_t.jpg\" />\n</dl>\n</span><br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:44 PM - Nov 12, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">She is a wonderful rogue!<br/>\nShe has epic dodge, epic traps handling and AB like a dedicated warrior!<br/>\nThe high intelligence not only gives extra skill points, it also enables recovering of epic traps without resorting to feats to boost the skill.<br/>\nDual wielding makes it possible with 7 attacks per round when you get a haste item. That means 3 times 16d6 + weapon damage in the first attack flurry!<br/>\nPicking kukris and even improved critical is a bit of a roleplay choice as I see it. This girl does (16d6+6)×3 even with a toothpick. And if she can't sneak them, then in most cases she can't crit them. I'm a big fan of the old fighter/thief and I know where you come from and kukris look good on her and you even have the feats, so no worry.<br/>\nI only see one inconsistency here and that is a cha of 8 on this little charmer. But if you put enough ash on her face, then maybe...<br/>\nI was also wondering about your own concern about will saves, 20 being a limit, sort of. Then if you only had a feat to spare... <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:44 PM - Nov 12, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just leapt up and punched the ceiling Mick - thank you! (Even if my hand and knees hurt now.)<br/>\n<br/>\nYou know me far too well, Mick. My initial draft had INT at 14 and both STR and CHA boosted by 2 each, but I shed that for more INT. However, I'm now wondering whether dropping CON to 12 (328 hps and 26 Fort ain't too bad for an ED Rogue, after all) and at least lifting CHA to 10. I could raise it a little higher - to 12 - depending on the below (which apart from RP reasons would give me an extra 2 whole skill points to play with!). As you know, Stag doesn't do 8 strength, which I appreciate would do the same, but will never happen in one of my builds - it hurt enough to drop to 10.<br/>\n<br/>\nYou're right about kukri - and there's no RP reason for it. I could easily drop Exotic for dagger focus (though I do prefer slashing over piercing damage), which could give her Iron Will or LoH to bring that Will save up to 20+ (I was hoping saves v spells and fear might help compensate). And if I dropped Imp Crit, I could drop CON to 10 and boost CHA to 12. Toughness would be an option to take the hps back up to 328, along with Dodge or Expertise as other choices. My gut is saying I should stick with Imp Crit - and I've learned to listen to something that big - but could be persuaded otherwise, depending on your CHA modifier!<br/>\n<br/>\nBut in essence, I'm bloody delighted some of your lessons in Rogue have gone in!<br/>\n<br/>\nCheers<br/>\n<br/>\nOh, and I know she's wearing footwear in her pic, but they're special boots of extra springiness...honest.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:23 PM - Nov 12, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Right, I've had time for a mull, and decided dagger is fine rather than kukri. I've also reached a truce with my gut, which is much more amenable after eating, and dropped Imp Crit for Toughness, raising her CHA to 12. There is a practical reason for the latter as well as RP, which is that she's meant to play in party, and has no business getting involved with sneak/crit immunes: she has big burly types around her to deal with that malarkey, while she makes herself useful trapping and stalling others. But those extra hit points are handy just in case she's discovered too early. So I shall go amend accordingly.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "1:27 AM - Nov 15, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">She's an ideal party rogue.<br/>\n<br/>\nI'm building a Rogue/Fighter/CoT (26/4/10), but he's STR based and wields a Dire Mace (I'll post after he grows up a little more).  I was originally on the same track as you with DEX based, going for Epic Dodge &amp; SC III, but I changed for reason I will explain when I post him.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "10:57 PM - Nov 19, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like this one Stag, but can you remember whether all the good daggers in Aielund are evil only?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:33 PM - Nov 20, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Being honest, <em class=\"mention\">@Dingpot</em> , I'm afraid I can't. But I would be very surprised if that was the case - Aielund's normally pretty good for all weapon needs. I would look up some of my past play-throughs to check, but when my game last crashed I lost all my old saves. Maybe sometime else knows?<br/>\n<br/>\nGlad you like her, though!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "9:59 PM - May 15, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like her. That's my kind of gameplay. Charisma and persuade are good choices ro RP a rogue !<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:24 PM - Aug 01, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Now moved to Full Epic forum, following play-through.<br/>\n<br/>\nEDIT: Oops! Forgot to include a full skills schedule - I'll get onto it pronto!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "4:44 PM - Aug 01, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Stag! Congrats on the build! I'm surprised nobody mentioned this, and maybe I'm wrong, but you could go Rogue 28 / Fighter 4 / CoT 8 for the same AB, same number of feats and pretty much everything else the same, except +1 to all saves gained from this switch. Please disregard this comment if I'm wrong, but can you take EWS on a CoT level once you have WS? I was under the impression you could. If not, that would require you to lose 1 epic feat for WS in epics, making it not worth the switch.<br/>\n<br/>\nOtherwise, excellent build! Kudos!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:01 PM - Aug 01, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Max, and you're dead right about CoT getting EWS. I know why I did it this way, though - and it wasn't just to get EWF and EWS asap. The problem arises with what class you take at level 20. If you take an extra level in Rogue, yes, you get Defensive Roll earlier, but you lose 1 BAB, and therefore 1 AB. If you take another level in CoT, yes, you gain an extra pre-epic bonus feat, but you lose an epic bonus feat. So on balance I think she's fine as she is. YMMV, of course.<br/>\n<br/>\nCheers - and good to hear from you, btw!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "8:34 PM - Aug 01, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"29466\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=29466&amp;sid=5c6dab9963bf2e809216980115a6f2ad#p29466\">↑</a><div class=\"responsive-hide\">Aug 01, 2024</div></cite>Thanks Max, and you're dead right about CoT getting EWS. I know why I did it this way, though - and it wasn't just to get EWF and EWS asap. The problem arises with what class you take at level 20. If you take an extra level in Rogue, yes, you get Defensive Roll earlier, but you lose 1 BAB, and therefore 1 AB. If you take another level in CoT, yes, you gain an extra pre-epic bonus feat, but you lose an epic bonus feat. So on balance I think she's fine as she is. YMMV, of course.<br/>\n<br/>\nCheers - and good to hear from you, btw!</div></blockquote>\nYeah, I see the issue now. It's not even about EWS in itself, it's the fact you'd need to take Fighter 4 in epics, keeping your spread as Rogue 12, Fighter 3 CoT 5, with the same number of feats in theory, but in practice you'd need to spend one of your epic feats on WS, which would mean sacrificing something else. OK, fair enough. <br/>\n<br/>\nBut just in theory also, you could consider Rogue 24 / Fighter 6 / CoT 10, dropping Skill Mastery for a couple more Epic Feats and a slight bonus to saves. You'd lose 2d6 SA damage from Rogue 25 and 27, but you could in theory drop Toughness, get WF on a Shortbow, then WS and EWS on said bow and be quite versatile in combat! Just some food for thought! <br/>\n<br/>\nThanks, mate! Good to speak to you once more! I've been lurking here still, but being that I kind of quit this game in favor of Baldur's Gate 3 (I only have time to play one game, if at all!), I often get things mixed up between the two rulesets.<br/>\n<br/>\nTake care!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:26 PM - Aug 01, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">After I posted, I said to myself (billy-no-mates that I am), \"I bet he comes back with a Rogue 26/ Fighter 4/ CoT 10 suggestion\"! But that would simply mimic Tyr's Shadow Sword build - and she already got a bit cross with me once for my Firewing of Corellon build! (I'm still struggling to make links, so you'll have to find them for yourselves for now.)<br/>\n<br/>\nWhile we're at it, I would also like to reference and commend your own Professional Henchman build - an antediluvian  Rogue 29/ Fighter 10/ Ranger 1 hin.<br/>\n<br/>\nAnd I can't cast aspersions as to your commitment, not if you're giving BG3 some serious attention - not played it yet, look forward to giving it a whirl!<br/>\n<br/>\nCheers - and take it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "11:24 PM - Aug 01, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"29468\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=29468&amp;sid=5c6dab9963bf2e809216980115a6f2ad#p29468\">↑</a><div class=\"responsive-hide\">Aug 01, 2024</div></cite>After I posted, I said to myself (billy-no-mates that I am), \"I bet he comes back with a Rogue 26/ Fighter 4/ CoT 10 suggestion\"! But that would simply mimic Tyr's Shadow Sword build - and she already got a bit cross with me once for my Firewing of Corellon build! (I'm still struggling to make links, so you'll have to find them for yourselves for now.)<br/>\n<br/>\nWhile we're at it, I would also like to reference and commend your own Professional Henchman build - an antediluvian  Rogue 29/ Fighter 10/ Ranger 1 hin.<br/>\n<br/>\nAnd I can't cast aspersions as to your commitment, not if you're giving BG3 some serious attention - not played it yet, look forward to giving it a whirl!<br/>\n<br/>\nCheers - and take it EZ!</div></blockquote>\nWell, Rogue 26 / Fighter 4 / CoT 10 isn't as optimized a spread, as Rogues give Bonus Feats every 4 levels after 20, so you're basically giving up a feat  (for Fighter 6) for a couple of skill points and 1 more d6 of SA damage. 24/6/10 on the other hand is perfectly optimal, as it ends on a level that gives you something in all 3 classes.<br/>\n<br/>\nAnd FYI, there's also my Mazzy Fentan build, which is quite similar to this one in many ways, but goes more into the Fighter than Rogue side.<br/>\n<br/>\nAs for BG 3, I'll PM you a couple of builds I made for the companions over there! You're gonna love that game!<br/>\n<br/>\nTake it EZ, for old times' sake! :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:40 PM - Aug 01, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually, I've had a thought. Might be stupid, but let's give it some air. I'm thinking here about a Rogue 28/ Fighter 4/ CoT 8 here. If I were to lose LoH from Level 1 then pop in Blind Fight or Knockdown in its place, I could replace the \"missing\" feat with Improved Critical as the CoT bonus feat pre-epic with a Rogue 12/ Fighter 4/ CoT 4 split - giving +1 to all saves anyway, maybe 1 more for Fortitude and Will, I need to check. Yes, EWF, EWS and AS will be delayed delayed a touch longer (maybe only 1 level), though ED can still be had at level 27, which is the key epic feat here, and can't be had any earlier. I would lose 14 skill points, but I'm sure they can be accommodated. I'll look at this further.<br/>\n<br/>\nShe still works damn well as she stands, though!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "11:53 PM - Aug 01, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"29470\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=29470&amp;sid=5c6dab9963bf2e809216980115a6f2ad#p29470\">↑</a><div class=\"responsive-hide\">Aug 01, 2024</div></cite>Actually, I've had a thought. Might be stupid, but let's give it some air. I'm thinking here about a Rogue 28/ Fighter 4/ CoT 8 here. If I were to lose LoH from Level 1 then pop in Blind Fight or Knockdown in its place, I could replace the \"missing\" feat with Improved Critical as the CoT bonus feat pre-epic with a Rogue 12/ Fighter 4/ CoT 6 split - giving +1 to all saves anyway, maybe 1 more for Fortitude and Will, I need to check. Yes, EWF, EWS and AS will be delayed delayed a touch longer (maybe only 1 level), though ED can still be had at level 27, which is the key epic feat here, and can't be had any earlier. I would lose 14 skill points, but I'm sure they can be accommodated. I'll look at this further.<br/>\n<br/>\nShe still works damn well as she stands, though!</div></blockquote>\nThat would work, but you'd need to drop an Epic feat. The way I see it, there really isn't any droppable epic feat, except Skill Mastery, IMO. That would take care of this little problem, and net you a couple more feats in the process, as there really isn't much you're gaining from those 4 levels of Rogue.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:11 AM - Aug 02, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah. Knew there'd be a problem. As you were, children.<br/>\n<br/>\nEDIT: That said, Armour Skin is more of a 'nice to have' rather than a 'must have', so it could still work. I think.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:41 AM - Aug 02, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, you can take EWS as a CoT feat.  I've done it many times.<br/>\n<br/>\nI just realized a problem with that idea.  If you simply swap Fighter 5 and 6 for two  more levels of CoT, you gain a pre-epic feat and lose an epic feat.  To keep the epic feat, you would be forced to take Rogue 13 at level 20, losing a BAB.  So, you wind up trading an point of AB for a point in your saves.  With that in mind, you are probably better off leaving it as-is.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}