{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "262",
  "name": "Possible Bug with Cleave and Attack Animations",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/possible-bug-with-cleave-and-attack-animations-t2333497.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": "4",
  "views": "751",
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:17 PM - May 22, 2013",
      "content": "<div>Hail, ECBers,<br/>\n<br/>\nSo, I have been playing this game forever, and for a while now I have known something (or at least I think I know it), which I would like to share with you here. In my observation, there is a bug with Cleave and the attack animations for NWN characters. I'll try to explain how and why it works this way (if at all), and maybe someone can correct me if my observation isn't spot on. So, here we go:<br/>\n<br/>\nThe NWN standard round lasts for 6 seconds. In terms of animations, it's divided in three 2-second flurries of attacks. So, at level 1 you have 1 attack per round, which is made at the first 2-second flurry.<br/>\n<br/>\nThe second attack per round comes when you reach 6 BAB, and is added to the second 2-second flurry, so in-game you have the feeling you now attack twice as fast (which is not true, you now attack at 2/3 of your \"maximum speed\" whereas before you attacked at 1/3).<br/>\n<br/>\nThe third attack is added on the third flurry, as you would expect, when you reach 11 BAB. It gets added to the third 2-second flurry, and now you technically have \"maximum attack speed\", or rather, all the 2-second flurries are covered with at least one attack each.<br/>\n<br/>\nWhen you get the fourth attack, at BAB 16 (before reaching level 20) it gets added to the first 2-second flurry of attacks, so your toon will perform a double attack in the first attack, and then two more spaced attacks before the end of the round.<br/>\n<br/>\nThe fifth attack gets added to the second 2-second flurry, so now your toon will perform two double attacks and one single attack (normally this fifth attack comes from Haste, but it can come from dual-wielding or Monk attack progression).<br/>\n<br/>\nIt continues on to a maximum possible achievable 10 attacks per round with a dual-wielding Monk with 2 Kamas. This guy would have one QUADRUPLE attack in the first flurry, one TRIPLE attack in the second flurry and another TRIPLE attack in the third flurry.<br/>\n<br/>\nFor some reason, probably technological limitations, you can't switch targets in the middle of a particular flurry. So, if you have 5 attacks per round (the typical number for a hasted meleer), your schedule will be divided as follows - 2-2-1. If you kill some monster with the first attack of a particular flurry, the second attack is thrown to the wind, as you can't switch it to a different target. You basically attack someone who's already dead.<br/>\n<br/>\nNow, with Cleave, what happens is that it's triggered by the death of a foe, and it gets added to the current flurry you're on when there's at least one attack in each flurry, and so you end up cleaving the monster you just killed, instead of a new enemy.<br/>\n<br/>\nI'm not sure this is actually happening in the combat log, or if it's just a problem with the animation. Sometimes your toon doesn't move but it attacks regardless because the computer you play on doesn't process information fast enough. I've tried testing it, but I don't know how to spawn different types of monsters on my training mod, so I haven't been able to. I reckon that to be able to test this, you'd need to build a module with many different monsters (one of each specimen), surround your character with Cleave (not Great Cleave, just Cleave) and watch the combat log. When it says : \"X\" attempts Cleave on \"Y\", you check whether it's the same monster being attacked or a different one. If anyone could verify this for me, it'd be great. <br/>\n<br/>\nI can think of 2 people off the top of my head that would be able to perform such a task: WhiZard and HipMaestro. Are you up for this?<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "12:15 AM - May 23, 2013",
      "content": "<div>When performing a cleave, the flurry that triggers it will have all attacks performed.  The blow that kills as well as extra attacks beyond what is needed to kill are flagged \"cleave\" (or great cleave) and are replaced during the bonus attack sequence with blows at full AB.  The attack then continues onto the next target with \"cleave\" flurries.  These flurries take up much less time than a regular flurry and only contain enough blows until the first hit (if the hit kills and you have great cleave, it will then be replaced with an attack at full AB which is added to the bonus attack progression).  A large number of cleave flurries can impede on the off-hand attacks preventing them from triggering for the round.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:10 PM - May 23, 2013",
      "content": "<div>I've re-read this post of yours three times now and I'm having trouble picturing what you're explaining there. Could you be more specific? What do you mean by Bonus Attack Sequence?<br/>\n<br/>\nThanks.</div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "6:26 PM - May 23, 2013",
      "content": "<div>An attack is divided into three progressions (sequences) first all the natural main hand blows occur (starting at full AB and progressing at -5), then the bonus attacks occur (starting at full AB and progressing at -5), and then the off-hand attacks occur (starting at full AB and progressing at -5).   To keep things simple consider a monk with 6 APR (from multiclassing) that has great cleave. He is fighting a ton of zombies (zombies don't run so they don't give AoO) which he is guaranteed to kill each every hit.  The attack progression I generated from this was as follows:<br/>\n<div class=\"codebox\"><p>Code: <a href=\"#\" onclick=\"selectCode(this); return false;\">Select all</a></p><pre><code>Attack Roll       Specifier    Place in AB scheme\n+21                 hit             +21\n+21                 gc miss      +18\n+15                 hit             +15\n+21                 gc hit         +12\n+21                 gc hit         +9\n+21                 gc miss      +6\n+21                 hit             +21\n+21                 gc hit         +16\n+21                 gc hit         +11\n+21                 gc hit         +6\n+21                 gc hit         +1\n+21                 gc hit         -4\n+21                 gc hit         -9\n+21                 gc hit         -14\n+21                 gc hit         -19\n+21                 gc hit         -24\n+21                 gc hit         -29\n+21                 gc hit         -34\n+21                 gc hit         -39\n+21                 gc hit         -44\n+21                 gc hit         -49\n+21                 gc hit         -54\n+21                 gc hit         -59\n+21                 gc hit         -64\n+21                 gc hit         -69\n+21                 gc hit         -74\n+21                 gc hit         -79\n+21                 gc hit         -84\n+21                 gc miss      -89\n-94                 miss           -94\n-99                 hit              -99\n+21                gc hit          -104\n+21                gc hit          -109\n+21                gc hit          -114\n+21                gc hit          -119\n+21                gc miss       -124\n-129*             miss            -129\n</code></pre></div>\n\n*The very last attack displays as +127 but this is a display error (does not influence combat) as the display only shows the last 8 bits on the scale -128 to +127)<br/>\n<br/>\nNote that in this example there are exactly 6 misses (the number of attacks the monk had scheduled for the round).  Blows of the normal attack progression are added to the bonus progression when lost by cleaves.</div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "12:09 AM - May 24, 2013",
      "content": "<div>To clarify what I said before, a blow marked cleave is just the next blow in the combat sequence when a cleave is triggered.  This blow is at full AB and replaces the blow in the standard progression, adding a blow to the bonus progression.  So an extra attack will always be made on the next creature, when cleave triggers, it just won't necessarily be the attack marked cleave.<br/>\n<div class=\"codebox\"><p>Code: <a href=\"#\" onclick=\"selectCode(this); return false;\">Select all</a></p><pre><code>Example 2\nDW (5 main hand + 2 offhand + flurry = 8 APR) monk with cleave and no great cleave\n\nAttack Bonus     Specification    Place in AB progression\n----------------------------Flurry 1----------------------------\n+28                   hit                   +28\n+28                   cleave hit         +25\n---------------------------Flurry 2--------------------------------\n+22                  hit                   +22\n--------------------------Flurry 3---------------------------------\n+19                  hit                   +19\n-------------------------Flurry 4----------------------------------\n+16                 hit                   +16\n+30                 hit                   +30 (bonus from flurry)\n------------------------Flurry 5-----------------------------------\n+25                hit                   +25  (bonus from cleave)\n----------------------- Flurry 6----------------------------------\n+28               offhand hit       +28\n+23               offhand hit       +23\n</code></pre></div>\n\nNote 6 creatures were killed here instead of the normal three.  Most of the time the spread isn't this good, but it does show that cleave by itself interferes with the flurries, spreading out the blows among more targets.</div>"
    }
  ]
}