{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "154",
  "name": "ANDARIEL – Maiden of Anguish  (BARD 5/ RDD 15/ PM 20)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/andariel-maiden-of-anguish-bard-5-rdd-15-pm-20-t2350062.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": "32",
  "views": "22.8K",
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:51 PM - Feb 15, 2014",
      "content": "<div>This build needs neither fanfare nor advertisement.<br/>\n<br/>\nThere are many builds that use this combo but none with my level split or the AB &amp; Damage of this one.<br/>\n<br/>\nI have used this character in a more toned-down version in WoG and she performed superbly under all circumnstances, making the normally super tough Drow a complete joke.<br/>\n<br/>\nHere she is the Maiden of Anguish herself.<br/>\n<br/>\n<br/>\n<strong>ANDARIEL – Maiden of Anguish</strong><br/>\n<br/>\n<strong>(BARD 5/ RDD 15/ PM 20)</strong><br/>\n<br/>\nRACE: Human Female<br/>\n<br/>\nALIGNMENT: Neutral Evil<br/>\n<br/>\nPLAYABILITY: PvM 1-40<br/>\n<br/>\nSTARTING STATS:<br/>\nSTR  - 18<br/>\nDEX -  08<br/>\nCON - 14<br/>\nINT  - 13<br/>\nWIS - 08<br/>\nCHA - 11<br/>\n<br/>\nENDING STATS:<br/>\nSTR  -  42<br/>\nDEX  -  08<br/>\nCON  - 16<br/>\nINT   - 15<br/>\nWIS  - 08<br/>\nCHA - 13<br/>\n<br/>\nHit Points: 442<br/>\n<br/>\nSkill Points: 214<br/>\n<br/>\nDiscipline: 43 (59)<br/>\nSpellcraft: 43 (45)<br/>\nTumble: 40 (39)<br/>\nPerform: 8 (9)<br/>\nLore: 8 (15)<br/>\nListen: 33 (32)<br/>\nUMD: 39 (40)<br/>\n<br/>\nSaving Throws (Fort/Ref/Will):  26/ 18/ 25  –&gt;  35/ 27/ 34  (saves Vs spells)<br/>\n<br/>\nNaked AC: 42  (mundane full plate only)<br/>\n<br/>\nBAB: 23<br/>\n<br/>\nAB: +43/ +38/ +33  (Scythe)<br/>\n       <br/>\nDMG: 2D4 + 24 / 19-20 x 4<br/>\n<br/>\nBard Song: 5/ Day She can sign for +1 AB &amp; +2 DMG +1 Fort &amp; +1 Will<br/>\n<br/>\nEpic Warding for 20 rounds absorbing 1000 Damage<br/>\n<br/>\nEpic Mage Armor for 20 AC last for 20 hours<br/>\n<br/>\nSpellcasting: UMD everything under the sun <br/>\n<br/>\n<br/>\nLEVELING GUIDE:<br/>\n<br/>\n01) BARD (01): Armor Proficiency Heavy, Blind Fight<br/>\n02) BARD (02): <br/>\n03) BARD (03): Weapon Proficiency Exotic<br/>\n04) PM (01): <br/>\n05) PM (02): <br/>\n06) RDD (01): Weapon Focus Scythe<br/>\n07) RDD (02): <br/>\n08) RDD (03): <br/>\n09) RDD (04): Knockdown<br/>\n10) RDD (05): <br/>\n11) RDD (06): <br/>\n12) RDD (07): Improved Critical Scythe<br/>\n13) RDD (08): <br/>\n14) RDD (09): <br/>\n15) RDD (10): Disarm<br/>\n16) PM (03): <br/>\n17) PM (04): <br/>\n18) PM (05): Improved Disarm<br/>\n19) PM (06): <br/>\n20) BARD (04): <br/>\n21) PM (07): Epic Weapon Focus Scythe<br/>\n22) PM (08): <br/>\n23) PM (09): <br/>\n24) PM (10): Great Strength I<br/>\n25) PM (11): <br/>\n26) PM (12): <br/>\n27) PM (13): Great Strength II, Energy Resist Acid<br/>\n28) PM (14): <br/>\n29) PM (15): <br/>\n30) PM (16): Great Strength III, Epic Mage Armor<br/>\n31) RDD (11): <br/>\n32) RDD (12): <br/>\n33) RDD (13): Great Strength IV<br/>\n34) RDD (14): Epic Prowess<br/>\n35) RDD (15): <br/>\n36) PM (17): Great Strength V<br/>\n37) PM (18): <br/>\n38) PM (19): Epic Warding<br/>\n39) PM (20): Great Strength VI<br/>\n40) BARD (05):<br/>\n<br/>\nCOMBAT OPTIONS: <br/>\n<br/>\nImproved Disarm for extra situational AB<br/>\n<br/>\nKnockdown for dealing with Mages &amp; Rogues<br/>\n<br/>\nSPECIAL NOTES: <br/>\n<br/>\nANDARIEL - The Maiden of Anguish is totally immune to Paralysis, stun, holds, sleep, sneak attacks, critical hits, fire and maybe i forgot some.<br/>\n<br/>\nShe can summon Skeletal Blackguards to do her biding but prefer to do the job alone for the most part.<br/>\n<br/>\nShe has a death touch attack that you dont need to use cause scythe hurts a lot more! DC is 22 save or die 3/ day btw.<br/>\n<br/>\nShe is resistant to Acid 10<br/>\n<br/>\nShe has nice red wings to show to her friends!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:18 PM - Feb 15, 2014",
      "content": "<div>I love her already!<br/>\n<br/>\nJust one question; why RDD15/PM20 rather than RDD10/PM25?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:25 PM - Feb 15, 2014",
      "content": "<div>Bonus epic feat list of RDD have Epic Prowess. That allows me to get full six GR. STR.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:55 PM - Feb 15, 2014",
      "content": "<div>Hey dude!<br/>\n<br/>\nNice going with Andariel, man! It's like the twin sister of my <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/the-cursed-half-dragon-chanter-bard-20-rdd-10-pm-10-t2330742.html\" rel=\"noreferrer\" target=\"_blank\">Cursed Half-Dragon Chanter</a><br/>\n<br/>\nThat's the build for Rheya Nightcloak on WoG. Maybe when she's high enough, she can fight alongside Andariel, man!<br/>\n<br/>\nGood job!<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:30 AM - Feb 16, 2014",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong>Bonus epic feat list of RDD have Epic Prowess. That allows me to get full six GR. STR.</div></blockquote>\nThat is fair enough: 5 levels of RDD then give +1AB and +1AC, 5d12 HP and a minor dragon breath bonus. <br/>\nAn alternative is Armor skin instead of EP with +3 to AC rather than +1AB and +1AC.<br/>\n<br/>\n5 more PM levels give +2 AC instead, if you just skip EP. You get 5d6+5 HP, an upgraded summon (lich lord), 2 bonus feats to spend on epic spells or epic summons, and (I believe) one more spellslot for your lvl 2 bard spells.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:24 PM - Feb 16, 2014",
      "content": "<div>Thanks Max, <br/>\n<br/>\nYou have some nice AB going for Reya too man!<br/>\n<br/>\nYou are welcome in the party of the indestructibles  <br/>\n<br/>\n<br/>\nMick, it is what you said exactly but keeping adding AC in a build that takes already +17 AC and EMA on top of  a full tumble class is unnecessary in my opinion.<br/>\n<br/>\nI wanted to have as much AB &amp; Damage was possible and that was only feasible by taking four more levels of RDD.<br/>\n<br/>\nThjanks again for the input man!</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:01 PM - Mar 24, 2016",
      "content": "<div>Saves vs spells with Spellcraft 45 is +9, not +11 as is listed in the build.  Where are those other 2 intrinsic saves coming from?<br/>\n<br/>\n All spells under the sun is 32 (33) rather than 39 (40) so there are 7 ranks to slide over to the detection skill.<br/>\n<br/>\n Once again, a build posted without a skill schedule. *tsk* *tsk*</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:08 PM - Jan 02, 2017",
      "content": "<div>I have played this build and enjoyed its brutal power. I took less UMD and maxed listen. <br/>\n One thing I realized is that you can start with intelligence 12. I believe Valerfor took int 13 for the disarm feats. But because of the draconic abilities, intelligence jumps to 14 at character level 14. So you are OK when you start taking the  disarm feats at lvl 15. <br/>\n The spare point you get from starting with int 12, can be spent on charisma for an extra lvl 2 spell slot, or on dexterity to make it easier to fill the gap up to dex 12, for full plate armor.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:08 PM - Jan 02, 2017",
      "content": "<div>I'm curious about a few things about this build in practice, Mick... <br/>\n<br/>\nHow successful is your spellbook casting in combat or were you just swapping the plate on/off for buffing?  I was assuming this build would be relying on items for casting without even Still Spell available.  <br/>\n<br/>\nAnd how long are the buff durations outside of the Epic spells?  I'd expect them to be very short.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:34 PM - Jan 02, 2017",
      "content": "<div>The spellbook casting is that of a level 5 bard, except that PM levels grant a few extra slots. So this build only has level 2 spells and lower. I have not tested if one could use level 3 and 4 slots for meta magic, since the build doesn't have any meta magical feats. And all spells with a somatic component must be cast \"naked\".<br/>\n The duration of bard spells is as expected for a level 5 bard. The epic warding last 20 rounds and EMA 20 hours from the 20 PM levels.<br/>\n I experience no UMD checks when casting from any kind of scrolls on hardcore difficulty. (modified UMD is 30)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:20 PM - Jan 02, 2017",
      "content": "<div>Ahh... thanks for the clarification, Mick.  <img class=\"img-emoji\" src=\"emoji/11.gif\"/> Having never chosen to build or play a high-level PM myself, I was interested what the impact of PM levels was as compared to a wiz PM or sorc PM.<br/>\n<br/>\nWhat I've found about Bard's version of UMD is that it is hard to set a level because it depends on the value of items your toon will likely want to equip.  The UMD value table helps to some degree in setting a viable target but some environments, typically the high-magic ones, place so many high-value properties on gear that, even with a net level of 40 UMD, your toon won't be able to equip them.  So it just depends.  As far as casting from scrolls, seldom are the highest-level ones valued over a few thousand gold, so 5-10 ranks is more than enough to use them all perfectly. </div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "3:47 AM - Feb 16, 2018",
      "content": "<div>Is it worthwhile picking up Taunt with this build, or are the dumps spaced too far apart?<br/>\n<br/>\nIf you shift your starting stats to 17 Str, 10 Dex &amp; 14 Int, you gain an extra 43 skill points.  Then drop 1 Gr Str for AS then you get +2 AC, +1-6 AB(Taunt) at the loss of 1ab/dmg.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:24 PM - Feb 20, 2018",
      "content": "<div>It would be worthwhile in a more defensive variant of this build. For example, if you had chosen to take a bastard sword &amp; tower shield combo then I personally would also get her some taunt. But I can hardly imagine the environment that so much armour class is needed except perhaps in a high magic persistent world. And if you select to take \"taunt\", then go all the way with it and instead of taking \"armour skin\" go with epic skill focus \"taunt\" as your feat of choice.<br/>\n<br/>\nYou would also need to change the \"disarm\" feats for improved knockdown &amp; toughness perhaps since those would compliment better the defensive variant.</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "10:21 AM - Dec 25, 2018",
      "content": "<div>I'm so confused. What's the purpose of this build? Is it played as a more or less pure fighter, whacking enemies in the head with the scythe? There are almost no magic, unless wands, rods scrolls, etc that you find or someone else makes. Is it \"just\" a very intricate way to build a very tough fighter?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:37 PM - Dec 25, 2018",
      "content": "<div>A very, very tough fighter indeed. So tough that bosses on a medium-to-high-magic world have trouble hitting &amp; the rest are simply out of luck. She is immune to a ton of things as well, sneaks, crits &amp; fire included. She has magic via UMD of course, wands for darkfire, improved invisibility, keen weapon etc are all very useful to almost every fighter that isn't already a cleric hybrid &amp; she can use them as well as anybody else. There was a revolution back in the day, I am talking about 2005 here (Neverwinter Nights history) when Ralkain posted a build called \"The Pale Drake\" in the legacy ECB forums &amp; proved that this kind of build is so much tougher than a dwarven defender exactly because enemies can't ever hope to crit her or reliably hit her. That was an Elf &amp; ended at 36 strength &amp; had a rapier. It was a prototype of sorts. I took this and improved it by a lot &amp; this was one of my first builds when I entered the ECB.<br/>\n<br/>\nAlso, I forgot to add her EMA ability (that lasts all day) when I was making the calculations for your server. <br/>\nHer true AC: 47 (base w/shield) +10 (Armour) +10 (Shield) +10 (Amulet) +10 (Ring) +10 (Boots) +4 (Haste) +5 (EMA) +1 (Mage armour, stacks w/EMA)= 107 AC.<br/>\nAnd then she has Epic Warding shield for 1000 Dmg absorption. And she can have Improved Invisibility/Displacement for an additional 50% miss chance via UMD. <br/>\nTough doesn't even begin to describe her...</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "4:40 PM - Dec 25, 2018",
      "content": "<div>I'm sold. I'm gonna whack my current project and go with this. Gotta try it, it's so weirdly strangely crazy.</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "7:52 PM - Jan 11, 2019",
      "content": "<div>OK. A question: Is Disarm good in any way? I have NEVER in the last 18? years played with Disarm. Follow-up question: If I'm allergic to Disarm, what two feats do I take instead?</div>"
    },
    {
      "author": "neo.dietrich",
      "avatar": "10759013_1546875159.jpg",
      "timestamp": "8:05 PM - Jan 11, 2019",
      "content": "<div>I've personally never found it useful. A lot of your enemies are going to be creatures that can't be disarmed. As for the dangerous enemies with weapons... there's usually a more useful action to take (like a regular attack at full AB).</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:23 PM - Jan 11, 2019",
      "content": "<div>If you have a bigger weapon then your target, you get an AB bonus.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "8:26 PM - Jan 11, 2019",
      "content": "<div>It's not for removing the weapon from the opponent (that's just a corollary), it's for improving your AB when they wield a small (net +4 AB) or tiny (net +8 AB) weapon.<br/>\nWhether it's worth two feats is up to debate, but the idea is to INCREASE your AB situationally.<br/>\n<br/>\nEDIT: Ninja'd by the Ninja himself!</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "10:32 PM - Jan 11, 2019",
      "content": "<div><blockquote><div><cite>Mirnaia wrote:</cite>\nIt's not for removing the weapon from the opponent (that's just a corollary), it's for improving your AB when they wield a small (net +4 AB) or tiny (net +8 AB) weapon.<br/>\nWhether it's worth two feats is up to debate, but the idea is to INCREASE your AB situationally.<br/>\n<br/>\nEDIT: Ninja'd by the Ninja himself!\n</div></blockquote>\nErr... No? You get a -4 first, then a +4 or a +8. So you only get a bonus if you have a weapon two categories bigger otherwise you're even. This doesn't seem likely for a big boss. It definitely doesn't seem worth spending two feats on it.<br/>\n<br/>\nI repeat my question: What feats should you choose instead?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:28 AM - Jan 12, 2019",
      "content": "<div>Yeah, it's what both Mick &amp; Mirnaia said, for the situational AB bonus, but if you don't want to take it anyway (and it isn't useful at all in case you go for 107 AC, which means you'll have to use a shield) then IKD &amp; Toughness aren't bad at all.<br/>\nI would not take Expertise in that build because in all other PW's you don't need that insane AC and where you need it you ain't gonna hit consistently if you do.<br/>\nIf you want a dummy target though, then Improved Expertise &amp; Toughness is a good combo.</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "11:08 AM - Jan 12, 2019",
      "content": "<div>I like the idea of a shield and warhammer (or Dwarven Waraxe) since it gives better AC and almost the same attack. On the other hand, I already have a toon that's a tank (DD with axe/shield) and one that's a DPS (WM with Hammer/shield) so I think I'll go with the scythe for fun, even if it's not optimal. (Although, you can argue, in a situation where the boss has high DR, it's better statistically with fewer hits with bigger damage, hence Scythe. Also, cooler.) As you say, the AC is kinda enough as it is. Also, IKD and Toughness it is.</div>"
    },
    {
      "author": "Valkos",
      "avatar": "10235425_1545159776.jpg",
      "timestamp": "9:24 AM - Feb 12, 2019",
      "content": "<div>I have a question regarding this bad boy.<br/>\n<br/>\nI'm playing on a server that has many low hp mobs, so taking Great cleave is really good for soloing.<br/>\n<br/>\nWould you change up your weapon profeciency for martial instead, to take greatsword?<br/>\n<br/>\nAlso did you ever consider taking 8 bard, 4 PM, 8 RDD pre epic, to gain the AB you would lose from not having 15 levels of RDD and stick with 10?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:45 PM - Feb 12, 2019",
      "content": "<div>If you're playing on a server with many low hp mobs &amp; want to take great cleave, then why don't you go for dev crit as well?<br/>\nAnd yes, in that case I would absolutely go for a greatsword instead.<br/>\nUnless it is banned of course.<br/>\nFor the second part of the question, you mean going Bard 10/ PM 20/ Rdd10?<br/>\nYes, I have thought of it but essentially you trade EP &amp; 1AC for 1 BAB and some slightly better bard song &amp; a couple of spells that I don't use, because I use wands anyway.<br/>\nIt could go either way, the core of the build is solid &amp; customizable enough to accommodate such changes easily.<br/>\nThanks for sharing your thoughts Valkos!</div>"
    },
    {
      "author": "Valkos",
      "avatar": "10235425_1545159776.jpg",
      "timestamp": "4:28 PM - Feb 12, 2019",
      "content": "<div>i have never played on a server rhat allowed dev crit in its original form or it not being banned. <br/>\ni found a middle ground setup from this and went with 8bard 2 pm 10 rdd instead, as im on a hardcore server ish. <br/>\nthis is my first ever try playing something that is with only 3 atks! :O</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "10:28 AM - Feb 18, 2019",
      "content": "<div>I made some changes, to adapt this for Blackstone Keep, where I play. Since the Epic Mage Armor only nets me +5 Dodge (the rest don't stack), I switched that for a mummy summon (which is buffed on BSK). Then I dropped 2 STR and got myself DevCrit (which on BSK gives +35% bonus damage). Also took Armor Skin, since the bosses on BSK have crazy high AB and if you wanna go tank, go full tank. I'm probably only gonna hit on crit anyway, so I might as well maximize my AC. Only thing I couldn't make myself do, was go Shield/Warhammer, which would have been better, but... The scythe is so much cooler. Oh, well. That decision cost me 9AC in return for slightly better crit and coolness.<br/>\n<details><summary>Spoiler</summary>Bard(5), Pale Master(20), Red Dragon Disciple(15), Human\nSTR: 18 (40)\nCON: 12 (14)\nINT: 12 (14)\n\n01: Bard(1): Blind Fight, Armor Proficiency Heavy\n03: Bard(3): Weapon Proficiency Exotic\n05: Pale Master(2)\n07: Red Dragon Disciple(2): (STR=21)\n09: Red Dragon Disciple(4): Power Attack, (STR=24)\n11: Red Dragon Disciple(6)\n13: Red Dragon Disciple(8)\n15: Red Dragon Disciple(10): Cleave, {Darkvision}, (STR=29), (CHA=14)\n17: Pale Master(4)\n19: Pale Master(6)\n21: Pale Master(7): Epic Weapon Focus: Scythe\n23: Pale Master(9)\n25: Pale Master(11)\n27: Pale Master(13): Devastating Critical: Scythe, Epic Energy Resistance: Sonic I\n29: Pale Master(15)\n31: Red Dragon Disciple(11)\n33: Red Dragon Disciple(13): Great Strength II, (STR=36)\n35: Red Dragon Disciple(15)\n37: Pale Master(18)\n39: Pale Master(20): Great Strength IV, (STR=39)\n\nSkillpoints: 214\nSaving Throw bonuses: Spells: +9\nAB (max, naked): 41 (melee), 23 (ranged)\nSpell Casting: Bard(2)\n</details></div>"
    },
    {
      "author": "FFN001",
      "avatar": "10759039_1548781954.jpg",
      "timestamp": "5:38 PM - Mar 02, 2019",
      "content": "<div>I tried this build. It is a slow start but picks up speed. Honestly, at first I was excited about getting started on the Pale Master so quickly, then I started to hate that class as my AB lagged. Overall this build has great defense and damage but it takes a while to catch up on AB...and until you get 10 levels of PM, a single crit takes you down thanks to the low HP. As a high level character, this build rocks. Getting there is a grind.</div>"
    },
    {
      "author": "FFN001",
      "avatar": "10759039_1548781954.jpg",
      "timestamp": "7:55 PM - Apr 04, 2019",
      "content": "<div>It starts off very slow but the pay off is crazy. I thought ac capped at 75. By the end of Aielund I had 81 without a shield. Good thing I had lots of resurrection scrolls because I survived encounters that, through my own stupidity, I should have lost. I was the last one standing in every case. My AB was a bit low but when I hit, I hit hard.</div>"
    },
    {
      "author": "sataricon",
      "avatar": "10759088_1568407219.jpg",
      "timestamp": "12:53 AM - Sep 13, 2019",
      "content": "<div>Dear friend.<br/>\nI started to follow this build right now and i'm level 12 with it on WOG server.<br/>\nThe build is fun but i wanted to ask how to make it even more tanky?<br/>\nWill taking 5 levels from RDD and adding them to PM do the trick?<br/>\n<br/>\nthe build is fun and very stylish to the point that i want to make another version of it with a shield for more tanky feel.<br/>\nI play solo most of the time BTW.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:17 AM - Sep 13, 2019",
      "content": "<div><blockquote><div><cite>sataricon wrote:</cite>Dear friend.<br/>\nI started to follow this build right now and i'm level 12 with it on WOG server.<br/>\nThe build is fun but i wanted to ask how to make it even more tanky?<br/>\nWill taking 5 levels from RDD and adding them to PM do the trick?<br/>\n<br/>\nthe build is fun and very stylish to the point that i want to make another version of it with a shield for more tanky feel.<br/>\nI play solo most of the time BTW.</div></blockquote>\nMight I refer you to the second and third posts of this thread? And this gal ain't no tank, she's a destroyer.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "sataricon",
      "avatar": "10759088_1568407219.jpg",
      "timestamp": "9:31 AM - Sep 13, 2019",
      "content": "<div>Wait so later on this build can't tank?<br/>\nbecause i solo i needed a build that can take some punishment and maybe deliver it too.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:39 AM - Sep 13, 2019",
      "content": "<div>To me this is a very tanky destroyer<br/>\n<br/>\nSome further reading:<br/>\n<br/>\n<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Epic_warding\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Epic_warding</a><br/>\n<br/>\n<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Pale_master\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Pale_master</a></div>"
    }
  ]
}