{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "015",
  "name": "[Request] Swordsman / WM for \"The Aielund Saga\"",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/request-swordsman-wm-for-the-aielund-saga-t2354807.html",
  "author": "Zapato",
  "avatar": "10758849_1517392315.jpg",
  "replies": "5",
  "views": "5.1K",
  "posts": [
    {
      "author": "Zapato",
      "avatar": "10758849_1517392315.jpg",
      "timestamp": "8:23 PM - Jan 07, 2018",
      "content": "<div>Hello everyone! I've recently rediscovered the joy of playing Neverwinter and I'm now finishing up my very first playthrough of HotU (with Valerfor's Iron Fist build :P). Thanks to Lilura's blog I want to try \"<em>The Aielund Saga\" </em>straight after it. Since this module go's all the way to level 37'ish I'd love to plan out a build in advance. However, I'm far from and expert builder and I'm struggling with some of the class levels and the feats even when looking at comparable builds online. I'm also not one 100% sure on the changes made to character creation in this specific module. So without further ado, here's the type of character I would like to play:<br/>\n<ul>\n<li>I want to make a Human swordsman / warrior that strapped his grandfathers Greatsword to his back in search for adventure! He will either be neutral or good, I haven't decided yet.</li>\n<li>Preferred weapon will be a Greatsword which he will use to lay waste to his enemy's. This is why I want to make him a Weapon Master :D.</li>\n<li>I'm unsure on what the remaining class levels will be. Fighter seems obvious but I'm not opposed to adding some barbarian in there if it benefits the build or for flavor (??).</li>\n<li>Searching around the web I've seen many WM builds featuring Rogue levels. I'm not sure if these are added purely to benefit two weapon style builds?</li>\n</ul>\n\nAny help is greatly appreciated. Thanks in advance :)</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:39 AM - Jan 08, 2018",
      "content": "<div>The Aielund Saga is a favorite of mine, and others here, too.<br/>\n<br/>\nThe reason to add Rogue is mainly to get Tumble as a class skill. For every 5 ranks in Tumble (unmodified), you get a +1 to your AC, which is even more important if you are not going to use a shield. Bard and Monk also have Tumble as a class skill.<br/>\n<br/>\nThere is a henchman in Chapter 1 who specializes in the greatsword, and one of the choices for henchmen in Chapter 2 is also a greatsword wielder.<br/>\n<br/>\nFor a Weapon Master in Aielund, I recommend the katana. In Aielund, the katana has the 1d8 damage of a longsword an the 18-20 critical threat of a scimitar, and there are several really cool katanas in the game. As a bonus, you get to use a shield, too.<br/>\n<br/>\nFor a greatsword user, you might want to consider a Fighter / Bard / RDD. Ten levels of RDD gives you more strength to take advantage of your two-handed weapon and +4 AC to partially compensate for the loss of shield AC. The Bard levels can give you Tumble as a class skill. The Fighter levels give you more feats, including Weapon Spec and Epic Weapon Spec for even more damage.<br/>\n<br/>\nWith all that said, if you still want a greatsword-wielding Weapon Master, I'd be happy to make one for you that will cleave his way through the enemies of Aielund like butter.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Zapato",
      "avatar": "10758849_1517392315.jpg",
      "timestamp": "1:45 AM - Jan 08, 2018",
      "content": "<div>Thanks for the quick reply Empyre. If you don't mind, I'd love to see that build of a Greatsword-wielding Weapon Master :). I don't mind a level or two in Rogue, Monk or Bard but RDD is not how I envisioned this character. The same thing for katana's.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:58 AM - Jan 08, 2018",
      "content": "<div>Hi there, Zapato, and welcome!<br/>\n<br/>\nAielund is my favourite module of those I've played, so I believe you've made an excellent choice. Regarding character creation, for the sort of build you're looking for the only potential impacts would be if you took Ranger or Bard, both of whom get an extra 2 skill points per level (thus 8 more at chargen). If you want to check out other changes in the campaign (eg the EMS), iirc they're on page 13 of the Aielund Saga thread of the Modules section of the NwN World sub-forum here (it's a long thread!). I don't know yet if Savant has made any new changes within his enhanced version, released on 3rd January this year (and the word \"enhanced\" doesn't mean it's geared for the EE beamdog are working on.<br/>\n<br/>\nThe main reasons you'll see levels of Rogue in essentially melee builds - particularly dual-wield or two-hander builds - are for Tumble (up to +8 AC), Evasion, and UMD. The first two being particularly helpful if you've no shield to strap on, and the third is never a bad thing.<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Ninja'd by Empyre!<br/>\n<br/>\nInterestingly enough, I've just finished a run through Aielund with a greatsword-wielding kensai, so I can recommend the build without hesitation. It's actually another of Valerfor's - Whirlwind of Steel (Monk 21/ Fighter 8/ WM 7). The one specifically designed for Aielund is on the final page of the thread - together with a dwarven variation. The thread itself is on the first page of the Full Epic - Level 40 Builds section.<br/>\n<br/>\nI confess that I'd quite like to plug my own Aielund Sword Champion (Fighter 14/ CoT 20/ Rogue 6) build as well, which is on page 2 of the above section. However, that is neither a WM nor a GS-wielder, rather being a dual-wield long-and-short sword toon, so it might not be for you.<br/>\n<br/>\nRegardless, enjoy your time with us, and enjoy Aielund!<br/>\n<br/>\nOh, and if Valerfor's build ain't for you, do please get back to us.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:02 AM - Jan 08, 2018",
      "content": "<div>The trap and lock skills are really nice to have in Chapter 1, but not needed after that because you will have a Rogue henchman for that. Concentration is there to try to foil the AI's frequent attempts to Taunt you. There is a certain point where it is nice to be able to craft your own weapons.<br/>\n<br/>\nYou  can never have everything you want in a build. There are always compromises. This time, your Will saves are really bad, and you get Listen and Spellcraft really late, but that can't be helped. You will need to stock up on Clarity potions or find some other mind protection for the final battle.<br/>\n<details><summary>Spoiler</summary>\nAielund Great Swordsman (Fighter 10 / Rogue 8 / Weapon Master 22)\nPlayable 1 - 40\nAbilities:\nDEX: 14\nWIS: 8\nCHA: 10\nLeveling Guide:\n01: Fighter(1): Power Attack, Cleave, Weapon Focus: Greatsword\n03: Fighter(2): Dodge, Knockdown\n05: Fighter(3)\n07: Rogue(3): {Uncanny Dodge I}\n09: Fighter(6): Mobility, Spring Attack\n11: Fighter(8): Expertise\n13: Weapon Master(1): Weapon of Choice: Greatsword\n15: Weapon Master(3): Improved Critical: Greatsword\n17: Rogue(4)\n19: Weapon Master(6)\n21: Fighter(10): Epic Weapon Focus: Greatsword, Epic Weapon Specialization: Greatsword\n23: Weapon Master(8)\n25: Weapon Master(10)\n27: Rogue(6): Great Strength II, (STR=24)\n29: Weapon Master(13): Armor Skin\n31: Weapon Master(15)\n33: Weapon Master(16): Great Strength IV, Epic Prowess, (STR=28)\n35: Weapon Master(18)\n37: Rogue(8)\n39: Weapon Master(21): Great Strength VI, (STR=31)\n\nHitpoints: 488\nSaving Throws (Fortitude/Will/Reflex): 21/15/24\nBAB: 29\nAC (naked/mundane armor/shield only): 22/32\nAlignment Changes: 0\nSkills:\n\n02: Disable Trap(5), Open Lock(5), Search(5), Tumble(5), UMD(5)\n04: Disable Trap(2), Intimidate(4), Open Lock(2), Search(2), Tumble(1)\n06: Discipline(1), Save(7)\n08: Concentration(3), Discipline(2)\n10: Concentration(4), Discipline(1)\n12: Concentration(1), Craft Weapon(3), Discipline(1)\n14: Discipline(1), Save(7)\n16: Discipline(1), Save(15)\n18: Discipline(2), Save(3)\n20: Discipline(1), Save(11)\n22: Craft Weapon(1), Tumble(5), UMD(5)\n24: Discipline(1), Listen(4)\n26: Discipline(1), Listen(4)\n28: Discipline(2), Listen(3)\n30: Discipline(1), Listen(4)\n32: Listen(1), Tumble(5), UMD(5)\n34: Discipline(1), Listen(1), Spellcraft(1), Save(1)\n36: Discipline(1), Listen(1), Spellcraft(1), Save(1)\n38: Discipline(2), Listen(1), Spellcraft(1), Save(1)\n40: Discipline(1), Listen(1), Lore(1), Spellcraft(1)\n</details></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Zapato",
      "avatar": "10758849_1517392315.jpg",
      "timestamp": "10:25 AM - Jan 08, 2018",
      "content": "<div>Thanks so much Empyre and Stagmeister for the reply's! Prepare to see more of me here once NWN: EE Hits in full.</div>"
    }
  ]
}