{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "676",
  "name": "The Banshee Barbarian - Barbarian 30 / PDK 5 / HS 5",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-banshee-barbarian-barbarian-30-pdk-5-hs-5-t2355372.html",
  "author": "SnorriHT",
  "avatar": "no_avatar.png",
  "replies": "13",
  "views": "732",
  "posts": [
    {
      "author": "SnorriHT",
      "avatar": "no_avatar.png",
      "timestamp": "6:38 AM - Feb 24, 2020",
      "content": "<div>** G'day All, Hopefully I've formatted this correctly. I ask your assistance in evaluating this Alpha build. If it passes the muster, I'll then update it, play it and then post it in the level 40 section. <br/>\nThanks in advance for your help :-)<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202002/10759233_da35391c265563f9b5046864869b9324.jpg\"/><br/>\n<strong>Bronnie the Banshee</strong><br/>\nBronnie is Dwarf girl who eats unusual things to make her friends laugh; including raw meat, insects and paper. But sometimes jokes go too far, like eating that Wail of the Banshee scroll stolen from her Uncle's locked draw. It was then Bronnie found out that actions have consequences and that old saying about bad things happening in threes. Firstly, her Uncle was a rather moody Dwarf and being a respected councillor, had her banished from the City for three years. Secondly, she experienced a rather long and a painful bout of indigestion. Thirdly, after her stomach settled down, Bonnie was amazed to discover that feelings of anger, surprise or danger would coalesce into wispy wailing banshees cascading from her mouth...<br/>\n <br/>\n<strong>Introduction</strong><br/>\nThis build borrows heavily on the beautiful <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-harper-knight-ftr-30-pdk-5-hs-5-t2354260.html#p649\" rel=\"noreferrer\" target=\"_blank\">The Harper Knight</a>  created by Valerfor. Thank you for your inspiration :-)<br/>\n<br/>\nI play on a low magic Persistent World with many server side changes that creates a sense of satisfaction from hard fought progression. Feats like Devastating Critical have been removed, limited (HIPS) and many spells (i.e. True Seeing, Raise Dead, Resurrection, various Stoneskins etc) have been modified or have a spell component cost. The best magic items I have seen are +5 and are likely found on the butchered corpse of a Boss. Many bosses are immune to sneak attack, critical hits, have spell resistance, true seeing, are hasted and/or dispel on hit. While normal content can be cruised with smart and careful play, a Boss fight is an event of exceptional risk and reward. <br/>\n<br/>\n <br/>\n<strong>Aim</strong><br/>\nThe aim is to make the Purple Dragon Knight (PDK), Harper Scout (HS) and Barbarian classes work together in a fun, engaging way but also be viable on a low magic server. Non-dispellable offence or defence is valuable in such an environment, as well feats, spells and an attitude that supports being a team player. The Banshee Barbarian is a front line warrior who can also provide party-wide combat buffs and support.<br/>\n <br/>\n<br/>\n<strong>Overview</strong><br/>\nDwarf: (Darkvision, Defensive Training vs. Giants, Stonecunning, Hardiness vs. Poison, Hardiness vs. Spells, Offensive Training vs. Goblinoids, Offensive Training vs. Orcs, Skill Affinity: Lore)<br/>\nBarbarian(30), Harper Scout(5), Purple Dragon Knight(5)<br/>\n <br/>\nSTR: 16 (32)<br/>\nDEX: 14<br/>\nCON: 16<br/>\nWIS: 10<br/>\nINT: 14<br/>\nCHA: 6<br/>\n<br/>\nHitpoints: 560<br/>\nSkillpoints: 248<br/>\nSaving Throws (Fortitude/Will/Reflex): 26/22/18<br/>\nSaving Throw bonuses: Spells: +2, Mind Effects: +2, Traps: +7, Poison: +2<br/>\nBAB: 30<br/>\nAB (max, naked): 42 (melee), 33 (ranged)<br/>\nAC (naked/mundane armor/shield only): 20/28<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n <br/>\nAppraise 5(7), Discipline 38(49), Heal 11(11), Intimidate 40(48), Listen 30(32), Lore 30(39), Persuade 8(6), Search 4(6), Spot 2(4), Taunt 41(39), Tumble 30(32), Ride 2(4)<br/>\n<br/>\n<br/>\n<strong>Strengths</strong> <br/>\n- Dwarf racial abilities are very useful on a low magic server, which also has many low to high level custom Goblinoids, Orcs and Giants<br/>\n- High Listen and Lore to find monsters, kill ‘em and identify their stuff<br/>\n- A high undispellable Attack bonus (BAB + Greater Rage)<br/>\n- High strength improves the PDK’s Fear feat (DC is 10 + purple dragon knight level + strength modifier)<br/>\n- High strength allows changing weapons to overcome damage resistance without loss of attack bonus<br/>\n- Terrifying Rage with high Intimidate paralyses monsters (-2 penalty to attack and saving throw rolls) <br/>\n- Fear immunity provides no defence from Terrifying Rage<br/>\n- A high taunt skill to provide up to -6 AC penalty for 5 rounds and a 30% chance of spell failure<br/>\n- Improved Will and Reflex saves due to Harper Scout levels, Barbarian Rage, Iron Will, Epic Will, Tymora’s Smile and Lliira’s Heart<br/>\n- HS Cat’s Grace and Eagle’s Splendor Feats buff DEX for Reflex saves and improve CHA for Intimidate and Taunt. I believe they also stack with the cast spells of the same name<br/>\n- HS allows Cat’s Grace and Eagle’s Splendor potions to be crafted, which is a nice party trick<br/>\n- The PDK’s Inspire Courage and Oath of Wrath are additional bonuses for a Boss fight.<br/>\n- The PDK’s Rallying Cry combined with Barbarian Fast movement allows a quick entry, or retreat from a fight<br/>\n- Five levels of HS provide 30 ranks of Tumble (+6 Dodge Bonus)<br/>\n- Uncanny Dodge allows retention of dexterity bonus when flat-footed<br/>\n- Uncanny Dodge and Deneir’s Eye provide improved defence against traps<br/>\n- HS provides Invisibility once/day<br/>\n- The Mounted Combat feat has no utility on the server, but a discounted PDK only cloak with the Toughness feat, AC deflection, and universal saving throws has been provided as compensation<br/>\n<br/>\n <br/>\n<strong>Weaknesses </strong><br/>\n- A Feat starved build; no weapon focus, epic weapon focus or improved critical<br/>\n- Late blooming, with the Terrifying Rage Feat only available at level 24<br/>\n- There are plenty of creatures immune to paralysis, making Terrifying Rage useless<br/>\n- Testing has shown that Epic Skill Focus Intimidate is required to consistently fear opponents with very high will<br/>\n- Lack of damage (no weapon specialisation, no critical hit extra damage, no burst damage feats/spells)<br/>\n- Vulnerable to monsters that drain Strength (and therefore reduce the to hit bonus)<br/>\n- Unable to wear heavy armour<br/>\n- Average armour class without Tumble<br/>\n- Using the PDK Fear feat in close quarters may cause the character to be feared as well<br/>\n- Using Taunt makes the character flat-footed<br/>\n- Becoming flat-footed removes the Dodge bonus<br/>\n <br/>\n <br/>\n<strong>Levelling Guide</strong><br/>\n<span style=\"text-decoration:underline\">Levels, ability scores and feats</span><br/>\n01: Barbarian(1): Power Attack<br/>\n02: Barbarian(2): {Uncanny Dodge I}<br/>\n03: Barbarian(3): Mounted Combat<br/>\n04: Barbarian(4): STR+1, (STR=17)<br/>\n05: Purple Dragon Knight(1)<br/>\n06: Purple Dragon Knight(2): Cleave<br/>\n07: Purple Dragon Knight(3)<br/>\n08: Purple Dragon Knight(4): STR+1, (STR=18)<br/>\n09: Purple Dragon Knight(5): Iron Will<br/>\n10: Barbarian(5)<br/>\n11: Barbarian(6)<br/>\n12: Barbarian(7): STR+1, Blind Fight, (STR=19)<br/>\n13: Barbarian(8)<br/>\n14: Barbarian(9)<br/>\n15: Barbarian(10): Expertise<br/>\n16: Barbarian(11): STR+1, (STR=20)<br/>\n17: Barbarian(12)<br/>\n18: Barbarian(13): Alertness<br/>\n19: Barbarian(14)<br/>\n20: Barbarian(15): STR+1, (STR=21)<br/>\n21: Harper Scout(1): Great Strength I, Epic Will, (STR=22)<br/>\n22: Barbarian(16)<br/>\n23: Harper Scout(2)<br/>\n24: Barbarian(17): STR+1, Terrifying Rage, (STR=23)<br/>\n25: Harper Scout(3)<br/>\n26: Harper Scout(4)<br/>\n27: Harper Scout(5): Great Strength II, Epic Skill Focus: Intimidate, (STR=24)<br/>\n28: Barbarian(18): STR+1, (STR=25)<br/>\n29: Barbarian(19)<br/>\n30: Barbarian(20): Great Strength III, (STR=26)<br/>\n31: Barbarian(21)<br/>\n32: Barbarian(22): STR+1, (STR=27)<br/>\n33: Barbarian(23): Great Strength IV, (STR=28)<br/>\n34: Barbarian(24): Epic Prowess<br/>\n35: Barbarian(25)<br/>\n36: Barbarian(26): STR+1, Great Strength V, (STR=30)<br/>\n37: Barbarian(27)<br/>\n38: Barbarian(28): Armor Skin<br/>\n39: Barbarian(29): Great Strength VI, (STR=31)<br/>\n40: Barbarian(30): STR+1, (STR=32)<br/>\n <br/>\n<span style=\"text-decoration:underline\">Skill allocation per level</span> <br/>\n01: Discipline(4), Heal(2), Intimidate(4), Listen(3), Lore(3), Persuade(1), Search(1), Spot(1), Ride(2), <br/>\n02: Discipline(1), Intimidate(1), Listen(1), Lore(1), Spot(1), <br/>\n03: Discipline(1), Intimidate(1), Listen(1), Lore(1), Search(1), <br/>\n04: Discipline(1), Intimidate(1), Listen(1), Lore(1), Search(1), <br/>\n05: Discipline(1), Intimidate(1), Persuade(1), Save(1), <br/>\n06: Discipline(1), Intimidate(1), Persuade(1), Search(1), <br/>\n07: Discipline(1), Intimidate(1), Persuade(2), <br/>\n08: Discipline(1), Intimidate(1), Persuade(2), <br/>\n09: Discipline(1), Intimidate(1), Lore(1), Persuade(1), <br/>\n10: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n11: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n12: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n13: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n14: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n15: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n16: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n17: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n18: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n19: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n20: Discipline(1), Intimidate(1), Listen(1), Taunt(2), Save(1), <br/>\n21: Appraise(1), Tumble(6), <br/>\n22: Discipline(1), Intimidate(2), Taunt(2), Save(1), <br/>\n23: Appraise(1), Tumble(6), <br/>\n24: Discipline(1), Intimidate(2), Save(3), <br/>\n25: Appraise(1), Tumble(6), Save(2), <br/>\n26: Appraise(1), Tumble(6), Save(1), <br/>\n27: Appraise(1), Tumble(6), <br/>\n28: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n29: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n30: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n31: Discipline(1), Intimidate(1), Listen(1), Lore(1), Taunt(2), <br/>\n32: Discipline(1), Heal(1), Intimidate(1), Listen(1), Lore(1), Taunt(1), <br/>\n33: Discipline(1), Heal(1), Intimidate(1), Listen(1), Lore(1), Taunt(1), <br/>\n34: Discipline(1), Heal(1), Intimidate(1), Listen(1), Lore(1), Taunt(1), <br/>\n35: Discipline(1), Heal(1), Intimidate(1), Listen(1), Lore(1), Taunt(1), <br/>\n36: Discipline(1), Heal(1), Intimidate(1), Listen(1), Lore(1), Taunt(1), <br/>\n37: Discipline(1), Heal(1), Intimidate(1), Listen(1), Lore(1), Taunt(1), <br/>\n38: Discipline(1), Heal(1), Intimidate(1), Listen(1), Lore(1), Taunt(1), <br/>\n39: Discipline(1), Heal(1), Intimidate(1), Listen(1), Lore(1), Taunt(1), <br/>\n40: Discipline(1), Heal(1), Intimidate(1), Listen(1), Lore(1), Taunt(1),<br/>\n<br/>\nThank you for reading and I look for ward to your considered suggestions :-)</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:29 AM - Feb 24, 2020",
      "content": "<div>A Barbaric PDK, snooping HS?<br/>\n<br/>\nAnd a Dwarf?<br/>\n<br/>\nNobody tell GDL!<br/>\n<br/>\nI am wondering really what PDK is bringing to the build.  I think those levels, invested in something else, might be better spent.<br/>\nThe PDK buffs are really short, and pretty minor, especially for a Boss fight. You could, for example, either stick some Blackguard in there, or more Barbarian (a Barbaric HS...just think of the Diplomacy!) and get more out of it, I am thinking.  For example, there is no EDR in this build.  I think going that route might be a better one.<br/>\n<br/>\nIs there any real reason for taking PDK?  Like, are there substantial changes to the feats granted, or perhaps some sort of social and/or ingame benefits?<br/>\n<br/>\nI am probably just too tied down to \"PDK bad as is.  Only play modified PDK. Ugh!\"<br/>\n<br/>\nStill, when taking a look at what PDK gets, it is really underwhelming :<br/>\n<br/>\n<strong>Rallying Cry </strong>: three times per day, a purple dragon knight can utter a powerful shout that gives all allies a +1 bonus to attack and a 20% bonus to land speed for one round. <br/>\n<br/>\nIt's only 1 round!  If it was at least per level, that would go a long way to making it better imo.  This is sooooo much worse than a low level Bardsong AND the speed bonus just does not last long enough to truly get away.<br/>\n<br/>\n<strong>Heroic Shield </strong>: You may aid an ally, giving them a +4 dodge bonus to their armor class for one round. <br/>\n<br/>\nThis kind of has more potential, until you realize that the effects only last 1 round.  Meaning that, although instantaneous, you kind of either have to be a superman with your selecting and mashing all the while trying to do whatever else you are doing!<br/>\n<blockquote><div>With good timing, a player can have this feat be continuously in effect without interrupting whatever the player's character is doing. (As an instant feat, it does not interrupt actions, and its effect can be renewed as soon as the old effect expires.) </div></blockquote>\n\nCan be kind of nice, I guess, to \"buff\" the Rogue as he is moving out sneaky and Sneak Attacking something (because the Buff can be cast on the portrait itself and that works, regardless of distance!)  But again, it is a 1 round thing, so it would have to be done continually.  Not good for your Bosses, because they are mostly immune to sneak, you said.<br/>\n<br/>\n<strong>Inspire Courage</strong> : Once per day, the purple dragon knight can inspire his troops in combat. All affected creatures gain a +1 bonus to attack and damage, and a +2 bonus against mind-affecting spells. These bonuses last for 10 rounds.<br/>\n<br/>\nThis is a bit better, and one wonders really why the other abilities were not along these lines.  It is still a short lived effect, and has way too less uses/day.<br/>\n<br/>\n<strong>Fear</strong> : Once per day, the purple dragon knight may cast the fear spell with a caster level equal to his character level. <br/>\n<blockquote><div>The DC for the spell is 10 + purple dragon knight level + strength modifier (DC 127 if the strength modifier is negative). The character level determines the number of rounds the effect lasts. </div></blockquote>\n\nI don't know if the Server has patched this so that the DC 127 if negative is gone.  If not, it really makes the case for PDK being matched with a character with negative strength!  Like a Cleric or Mage. It is too bad that this is also not 1/PDK level.  It will probably be useless against Bosses, as they will probably have either Mind immunity or Fear immunity.  Might be good for controlling their m0bs, however (assuming there are any).  At 1/day, however, it is pretty limiting.  <br/>\n<br/>\n<strong>Oath of Wrath</strong> : Once per day, the purple dragon knight may swear to defeat a single opponent. He gains a +2 bonus to attack, damage, saves, and skills vs. that opponent. This lasts for a number of rounds equal to twice his class level. <br/>\n<blockquote><div>\n<ul>\n<li>This is an instant feat.</li>\n<li>The bonuses granted by this feat apply against all members of the target's race.\n<ul>\n<li> As attack and damage bonuses versus a specific race are reported on the character sheet, a player can use this feat to discover the racial type of an opponent. </li>\n</ul>\n</li>\n</ul>\n</div></blockquote>\n<br/>\nThis is a more interesting feat granted - it lasts longer, and is a valid buff imo.  The fact that it is also good against all members of the target's race makes it pretty useful.  Too bad it is 1/day.  1/level would be AWESOME.<br/>\n<br/>\n<strong>Final Stand</strong> : Once per day, the purple dragon knight can inspire his troops to a heroic effort. Each ally in the area gains 2d10 hit points. This ability can affect a number of people equal to his purple dragon knight level + charisma modifier, and lasts for the same number of rounds. <br/>\n<br/>\nYour build has nerfed this ability!  I don't know if the negative Cha will actually steal from the number of people it can effect, but it sure is not going to last long!  You'll have to really buff that Cha beforehand...and even then, 2d10 temporary HPs...nah.<br/>\n<br/>\nLater, you should get some HS help with a HS Eagle's Splendor potion and so.  Still is a meh.<br/>\n<br/>\nI personally think Bioware made this build with the OC in mind - being able to rest whenever one wished, meaning that PDK could replenish it's abilities whenever it needed to, practically.  In a non-rest restricted environment, it is practically a different Class imo.<br/>\n<br/>\nI don't know how your Server handles resting, but most such environments controll it tightly, in order to prevent Spellcasters from ruling the roost totally.  Rest restrictions kill this Class imo.<br/>\n<br/>\nSo, in retrospect, although the abilities might look good on paper (or on a screen, as the case may be), in practice, unless under specific conditions, they fall far short of other Class abilities.</div>"
    },
    {
      "author": "SnorriHT",
      "avatar": "no_avatar.png",
      "timestamp": "11:19 AM - Feb 24, 2020",
      "content": "<div>LOL! Thanks webshaman for the feedback. You are very knowledgeable and enjoy reading your comments :-)<br/>\n<br/>\nYou are correct in that resting is heavily restricted on the PW. On reflection I am seeing the PDK preserve his meager abilities until he get's to the Boss fight. <br/>\nI think there is a word for a person (i.e. me) inspired and imprisoned by a bad idea (the PDK). I also wish the PDK was better, I agree there other better choices, but I am compelled to make it at least workable ;-)<br/>\n<br/>\nI am currently talking to builder and he is willing to provide items to make the PDK at least palatable. I doubt it will match replacing the PDK with a proper class but it's something. If there is anything you can suggest within the constraints (prison?) of a Barb/PDK/HS, please let me know.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:55 AM - Feb 24, 2020",
      "content": "<div>Well, obviously some of the PDK's abilities are affected by Cha - which in your build is hehe...yeah.  I think you can see it is pretty low.<br/>\n<br/>\nThis doesn't have to be a problem, but you have PDK at 26 levels away from help (HS with HS Eagle's Splendor) - meaning you will have to rely on some other buffs that are available to at least put Cha at neutral numbers.  Also, HS bonus feats of either Curse Song or FE will mean you will be going with FE.<br/>\n<br/>\nNot that Final Stand is anything to shout about.  You won't miss it, most likely.<br/>\n<br/>\nVery, very little return for the bang here.<br/>\n<br/>\nI have no idea (I don't think anyone does, really) what happened with HS and PDK.  They are really strange Prestige Classes in the form that Bioware presented us with. Back then, as they first came out, everyone (including me) rushed for ways to make them playable, but for the most part...meh.  I think these two Prestige Classes are the least played, and probably the PDK is absolutely dead last.<br/>\n<br/>\nHS actually has some uses, in some builds.<br/>\n<br/>\nStill, I admire your dedication to these little used oddities.  Keep chugging away, maybe you will find something we all missed.  Won't be the first time.  Even if you don't, do NOT let my words discourage you!  Play what you consider is fun and enjoyable.  I was only commenting on how these components work in your build.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:48 PM - Feb 24, 2020",
      "content": "<div>I think there is enough here to make a very playable Barbarian build. <br/>\n<br/>\nSome tweaks I would consider if I would play this (from a builder learning the Barbarian class):<br/>\n- Take Heavy Armor Proficiency at level one, equipping heavy armor from the beginning is a huge quality of life bonus.<br/>\n- With full plate + tower you can dump Dex and Wisdom and invest into Con<br/>\n- You can then try to fit Epic Damage Reduction III (9/-) into the build. Dwarf should make it easy to get without sacrificing too much AB. EDR III is a powerful feat, add Barb damage reduction 7/- to it thats 16/- DR. Any non-critical hit without elemental damage is not going to damage you for anything more than a few points of damage.<br/>\n- I would recommend taking Weapon Focus, Epic Weapon Focus and Epic Prowess for +4 AB total, I think you only have EP. <br/>\n- If your ending base Str is 30+ then two handed is very attractive.<br/>\n- The critical melee feats I try to put in all my builds are Blind Fight and Knockdown. Blind fight to deal with concealed enemies. Knockdown to disable casters and destroy Dex/Dodge/Tumble AC allowing your 2nd to 4th attacks (and your teammates) a better chance at hitting them. Terrifying Rage provides some crowd control, but if they they are fear immune (I think this provides immunity?) this provides some extra support<br/>\n- Consider Mighty Rage, not so much for what it gives you, but for extra rages / day, which can be stacked with the standard Rage for double terrifying rage (two saves / round) cheese<br/>\n<br/>\nIn terms of build weaknesses, the saves are the big one which I can see you have tried to address with will boosting feats, well done. <br/>\nWith a bit more constitution in the build your fortitude will be closer to 30, which is good against instant death stuff like Cleric's implosion which goes through death immunity.<br/>\nCan you drop lore 30 down for crossclassed spellcraft? The extra saves from spellcraft can also help against spells, including mind affecting spells which you are working hard to protect. Maybe 10-15 crossclassed ranks?<br/>\n<br/>\nNo DC arcane spellcasters are the bane of any meleer's existance. If I am playing this I am curious as to what my strategy is going to be. Probably with Harper invisibility / invisibility potions, heaps of AB boosting and try to knock them down and kill them before they can get a Bigby's hand off. <br/>\n<br/>\nHope these suggestions help<br/>\nLove to see a successful PDK build. If you can get one to 40 come back and post your exploits, make sure you take a bunch of screenshots along the way too!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:35 PM - Feb 24, 2020",
      "content": "<div>I assume the banshee part of this buld is the terrifying rage howl. <br/>\nIf I were forced to build something like this - with PDK that is - I would have taken barbarian straight to level 20. That means better rages and DR earlier. I would invest in WF and EWF. I would also take AP Heavy. I would sprinkle HS throughout epic levels with HS 5 at lvl 37 for a final tumble dump. I would take PKD as late as possible - you don't really need it earlier anyway - only leaving room for important skill dumps.<br/>\n<br/>\nEdit: Ninja'd by Orion</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "6:17 PM - Feb 24, 2020",
      "content": "<div>I hate to say it. 4-6 lvls of fighter would be sweeeet. Heavy armour, WF, EWF and EP. Sorry, just had to.<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "SnorriHT",
      "avatar": "no_avatar.png",
      "timestamp": "8:56 PM - Feb 24, 2020",
      "content": "<div>Thanks for the feedback webshaman Orion, Mick Dagger and Grimnir, lots of yummy food for thought! :-)<br/>\n<br/>\nThe basis of the Build is Barb and PDK, so the HS levels can go. As suggested I am going to explore:<br/>\n- Taking a few levels of fighter to provide WF, EWF, knockdown and Heavy armour;<br/>\n- With heavy armour, put DEX into CON and use that CON for Epic Damage reduction and better Fortitude saves<br/>\n- start the PDK after level 20 to access damage reduction earlier<br/>\n- Invest some points into spellcraft.<br/>\n<br/>\nI am still going to include Terrifying Rage, as I can use the PDK levels to pump intimidate and Epic skill focus: Intimidate can be dumped. With STR 21 and CON 21 Mighty Rage is also an option, which also gives more opportunities to use Terrifying Rage.<br/>\n<br/>\nBack to CBC spreadsheet and thanks once again!</div>"
    },
    {
      "author": "SnorriHT",
      "avatar": "no_avatar.png",
      "timestamp": "11:44 PM - Feb 24, 2020",
      "content": "<div>I've been crunching the CBC spreadsheet on the Bus trip to work. I am going to continue to work on the Barbarian build, but there is specific value to have at least one early PDK level, due to special cloaks available on the PW I play on. Mind-effects and spells are the big concern on the low magic PW, so I'd also consider and Elf.<br/>\n<br/>\nSo I am going throw this open and make the build criteria the following:<br/>\n<br/>\n- Dwarf or Elf (Resistance against mind effects)<br/>\n- At least one PDK level before level 20, at character level 7 or 8<br/>\n- non-evil and non-chaotic alignment<br/>\n- PW rules: No Devastating Critical, HIPS can only be used once every 18 seconds, hardcore rules for using scrolls<br/>\n- PW provides option for a Fighter Henchman from levels 1-40, so a build does not need to be comprised to operate solo.<br/>\n<br/>\nPW builder has provided three PDK only cloaks, each reflecting a different aspects of the PDK:<br/>\n- The Leader: War Cry (7) 1/day,  +1 Deflection AC, +1 Universal saving throws<br/>\n- The Courageous: Clarity (5) 2/day,  +1 Deflection AC, +1 Universal saving throws<br/>\n- The Protector: Aid (5) 3/day, +1 Deflection AC, +1 Universal saving throws<br/>\n<br/>\nI am confident the builder will provide additional cloaks with +2 or +3 deflection AC and Universal saving throws once I get a PDK character up to the appropriate level.<br/>\n<br/>\nAnything else is open. I don't expect you give me a completed build, but I would appreciate some pointers, for example: \"Hey an Elf Barbarian/PDK/Wizard may work as Wizard who can melee a little bit, if you specialise in necromancy, take spell focus necromancy for better DC on Fear and Scare spells...\"<br/>\n<br/>\nI'll then work on it in the CBC spreadsheet and make it work within the context of the City of Melnibone PW.<br/>\n<br/>\n Thanks in advice your consideration!</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:18 AM - Feb 25, 2020",
      "content": "<div>PDK and Fighter before level 20 should make your fort save stronger probably the optimal amount will be 2 PDK levels and 1 fighter level, saving a few more fighter levels for epic level feats. <br/>\n<br/>\nBetween Elf and Dwarf I would choose dwarf to help you get EDR III more easily with +2 cons bonus, and +2 to saves against spells, amongst other bonuses, also fighter as a favored class.<br/>\n<br/>\nWhich cloak is best depends on the availability of clarity and aid potions which are usually cheap and plentiful in many environments. War Cry may be less common on a potion. <br/>\n<br/>\nI think if you stick with making a good barbarian with PDK you are looking fine. <br/>\n<br/>\nI like Barbarian and Champion of Torm over Barbarian and Fighter, the two classes complement each other. CoT helps a lot with the saves. This build draft called: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18969#p18969\" rel=\"noreferrer\" target=\"_blank\">Warlord of the Hinterland</a> I built with the guilds help and am part way through play testing and it may help you glean some additional ideas.</div>"
    },
    {
      "author": "SnorriHT",
      "avatar": "no_avatar.png",
      "timestamp": "4:20 AM - Feb 25, 2020",
      "content": "<div><blockquote><div><cite>Orion2019 wrote: <div class=\"responsive-hide\">Feb 25, 2020</div></cite>PDK and Fighter before level 20 should make your fort save stronger probably the optimal amount will be 2 PDK levels and 1 fighter level, saving a few more fighter levels for epic level feats. <br/>\n<br/>\nBetween Elf and Dwarf I would choose dwarf to help you get EDR III more easily with +2 cons bonus, and +2 to saves against spells, amongst other bonuses, also fighter as a favored class.<br/>\n<br/>\nWhich cloak is best depends on the availability of clarity and aid potions which are usually cheap and plentiful in many environments. War Cry may be less common on a potion. <br/>\n<br/>\nI think if you stick with making a good barbarian with PDK you are looking fine. <br/>\n<br/>\nI like Barbarian and Champion of Torm over Barbarian and Fighter, the two classes complement each other. CoT helps a lot with the saves. This build draft called: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18969#p18969\" rel=\"noreferrer\" target=\"_blank\">Warlord of the Hinterland</a> I built with the guilds help and am part way through play testing and it may help you glean some additional ideas.</div></blockquote>\nThanks Orion, I like the thought of a Barbarian/CoT/PDK. It occurs to me that going Human as per the Warlord of the Hinterland equates to an extra feat to compensate for Mounted Combat. Also the extra Human skill points could also be spent on Spellcraft, appraise and Tumble. Time to crunch Human vs Dwarf Barb/CoT/PDK :-)</div>"
    },
    {
      "author": "SnorriHT",
      "avatar": "no_avatar.png",
      "timestamp": "3:47 AM - Feb 27, 2020",
      "content": "<div>G'day All,<br/>\nI am going to admit defeat on a Barb/PDK build, because Barbarian cannot cover the weaknesses inherent in the PDK class design. Instead I am looking at two new concepts:<br/>\n<br/>\n(1) A Dwarf CoT 27 / Fighter 8 / PDK 5, based on Orion's Warlord of the Hinterland (which I really like). Fighter makes it an easy to to qualify for the PDK and Fighter, CoT deliver a ton of feats that allow all the warrior goodies, vastly improved saves and maybe even enough room to boost CHA.<br/>\n<br/>\n(2) A Human Druid 28 / Monk 8 / PDK 4, based on KailPendragon's Oerthblood. A low strength Caster specialising in the Heavy Crossbow. A Companion and Fighter henchman, or party member, would be the *cough* meat shields *cough*. If cornered, then a wild or elemental shape should start the sock puppet parade. The lack of feats is brutal, but the Monk provides the extra goodies. <br/>\n<br/>\nBuilds that can run with just two classes are perhaps the way to explore the PDK without feeling guilty. For the Ftr/CoT the PDK can provide some undispellable AB, damage and mind effects defence for Boss fights. For the Drd/Mnk I'll explore if the PDK feats can be used in shapes. Furthermore the Fear feat, along with the Druid control spells, could be very useful for an Archer. <br/>\n<br/>\nTesting will be hammer and anvil of truth :-)</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "7:01 AM - Feb 27, 2020",
      "content": "<div>Here's a build that I made for the PW where I play because they did \"beef\" up the PDK somewhat.  I never posted this because I never had a chance to playtest it, but in theory everything should work.  Note, I opted not to take the 5th level in PDK because I felt the ability granted with Level 5 was really the most worthless special ability of the bunch.  <br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Title: Rhapsody in Blood</span></strong><br/>\n <br/>\nClasses: Bard26/Purple Dragon Knight4/Fighter10<br/>\nAlignment: Only Neutral or Neutral Good<br/>\nRace: Human<br/>\nPlayable 1-40, PvE, Low to Mid-Magic<br/>\n <br/>\n<strong>Attributes</strong><br/>\nStr16 (30)<br/>\nInt14<br/>\nWis8<br/>\nDex10<br/>\nCon12<br/>\nChr15 (16)<br/>\n <br/>\n1 Bard1, Power Attack, Cleave<br/>\n2 Fighter1, WF: Scimitar, 2 in Ride skill<br/>\n3 Bard2, Curse Song<br/>\n4 Bard3, Str17<br/>\n5 Bard4<br/>\n6 Bard5, Mounted Combat<br/>\n7 Bard6<br/>\n8 Bard7, Str18<br/>\n9 Bard8, Craft Wand, 5 Craft Weapon, 2 Spot, 2 Listen, 1 Persuade, 1 Intimidate<br/>\n10 PDK1<br/>\n11 PDK2<br/>\n12 PDK3, Blindfighting, Str19<br/>\n13 PDK4<br/>\n14 Bard9<br/>\n15 Bard10, Still Spell (or KD)<br/>\n16 Fighter2, Improved Crit, Str20<br/>\n17 Bard11<br/>\n18 Fighter3, Great Cleave<br/>\n19 Fighter4, WS: Scimitar<br/>\n20 Bard12, Str21<br/>\n21 Bard13, Great Str I<br/>\n22 Bard14<br/>\n23 Bard15<br/>\n24 Bard16, Great Str II, Chr16<br/>\n25 Bard17<br/>\n26 Bard18<br/>\n27 Bard19, Great Str III<br/>\n28 Bard20, Str25<br/>\n29 Bard21<br/>\n30 Bard22, Great Str IV<br/>\n31 Bard23, Lasting Inspiration<br/>\n32 Fighter5, Str27<br/>\n33 Fighter6, OC, Dev Crit<br/>\n34 Bard24<br/>\n35 Fighter7<br/>\n36 Fighter8, EWF, EWS, Str28<br/>\n37 Fighter9<br/>\n38 Fighter10, Epic Prowess<br/>\n39 Bard25, Great Str V<br/>\n40 Bard26, ESF: Perform, Str30<br/>\n <br/>\n<strong>Combat Vitals</strong><br/>\nUnbuffed AB: 41/36/31/26<br/>\nBuffed Attack Schedule: 59/54/49/44/59<br/>\nAC: 29 mundane plate/shield<br/>\nDamage: 1-6+16, (12-20/x2 keened)<br/>\nDev DC: 40 (46 max)<br/>\nHP: 336 (376 with Bard Song)<br/>\n <br/>\n<strong>Base Saves</strong>         <strong>Under Bard Song</strong>            <strong>vs Spells</strong><br/>\nFort: 23               (25)                                    (34)<br/>\nReflex: 20           (23)                                    (32)<br/>\nWill: 19               (22)                                    (31)<br/>\n <br/>\n<strong>Skill Set                             Modified            Bard Song Boost w/+4 to Perform</strong><br/>\nConcentration 13            (14)                      (25)<br/>\nCraft Weapon: 5              (7)                        (18)<br/>\nDiscipline: 43                   (53)                      (64)<br/>\nListen: 2                            (1)                        (12)<br/>\nLore: 1                               (29)                      (40)<br/>\nOpen Lock: 1                                                 (12)<br/>\nPerform: 43                      (56)                      (67)<br/>\nPersuade: 1                      (4)                        (15)<br/>\nRide: 2                                                            (13)<br/>\nSearch: 1                           (3)                        (14)<br/>\nSpellcraft: 43                    (45)                      (56)<br/>\nSpot: 2                               (1)                        (11)<br/>\nTaunt: 43                          (46)                      (57)<br/>\nTumble: 40                                                    (51) <br/>\nUMD: 25                           (28)                      (39)<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Strengths</span></strong><br/>\nLasting Inspiration<br/>\nDev Crit<br/>\nEpic Weapon Specialization<br/>\nFear Feat DC: 24 (30 max)<br/>\nCan Still Wounding Whispers, Improved Invis, War Cry, Haste<br/>\nCraft Wand for Wands of Invis, Summon Monster, etc.<br/>\nOutstanding Skill Set<br/>\nHigh Taunt Score<br/>\nHeroic Shield to buff party member AC +4<br/>\nBard Song for another +5 to AC<br/>\nCurse Song to Drop Opponents AB by 2 and AC by 6 (and -11 to skills and)<br/>\nCurse Song to lower Opponents Fort by 2, making your Dev Crit DC higher<br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Weaknesses</span></strong><br/>\nLow Hit Points<br/>\nModest AB<br/>\nStrip Tease to Buff<br/>\nNo KD (but you can swap with Still)</div>"
    },
    {
      "author": "SnorriHT",
      "avatar": "no_avatar.png",
      "timestamp": "8:50 PM - Feb 27, 2020",
      "content": "<div>Grizzled, that is a cool build, thank you. The Curse Song would be devastating :-) <br/>\n<br/>\nI'm now treating this foray into the PDK as a journey rather than an end because I've learnt so much from build veterans as yourself.<br/>\n<br/>\nYou've also confirmed my thinking that 4 PDK levels with at least 4 Fighter levels is a good base for a PDK build. Then add the main class.</div>"
    }
  ]
}