{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "378",
  "name": "Looking for a HIPS Bowman (lvl 40)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/looking-for-a-hips-bowman-lvl-40-t2344326.html",
  "author": "campgod",
  "avatar": "no_avatar.png",
  "replies": 17,
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "2:41 AM - Oct 22, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello guys, I am looking for a archer that can HIPS. I once saw a one and she was pretty unstoppable. She would just come out of no where light you up, hips and come out and do it again. I looked through some of your builds and didn't see many, is there a reason for that? The server I am playing on has Dev crit but it just does more damage not kill. No potions or scrolls unless someone brews them or scribes them for you. You get perma haste right off the bat through craft able items. One can lvl to 40 pretty fast as well. The server has no real restrictions and you can put any +12 ability score on gear. this server has RP, PvP and PvE. You can lvl to 40 and then re-build if need be. I was thinking it would be cool to have a Dev crit archer...but I am sure most of the serious PvP'ers  have a high fort anyway. Not sure what would make the best combo, Ranger something or then there's the AA builds... I think I even seen a HIPS cleric/WM/SD build one time with a bow. I am pretty opened to anything as long as it has high AB and HIPS. Some survivability would be nice but I know its a trade off, so that's 2nd to the main goal. Thanks for all your time and thoughts.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:02 AM - Oct 22, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>campgod wrote:</strong>Hello guys, I am looking for a archer that can HIPS. I once saw a one and she was pretty unstoppable. She would just come out of no where light you up, hips and come out and do it again. I looked through some of your builds and didn't see many, is there a reason for that? \n</div></blockquote>\nOnly guessing here but possibly because an AA (if that's the direction you are looking) never needs stealth. \n<blockquote><div>\nThe server I am playing on has Dev crit but it just does more damage not kill. No potions or scrolls unless someone brews them or scribes them for you. You get perma haste right off the bat through craft able items. One can lvl to 40 pretty fast as well. The server has no real restrictions and you can put any +12 ability score on gear. this server has RP, PvP and PvE. You can lvl to 40 and then re-build if need be. I was thinking it would be cool to have a Dev crit archer...but I am sure most of the serious PvP'ers  have a high fort anyway. </div></blockquote>\nDevCrit archery usually uses RDD to get enough STR for a usable DevCrit DC while still being able to hit reliably.  Trying to reach dominant levels in both STR &amp; DEX is just about impossible without clerical buffs.  Besides that, without fighter or CoT levels, you'll be hard-pressed to find all the feats to qualify for DevCrit, sacrificing a lot of potential just to be \"cute\".\n<blockquote><div>\nNot sure what would make the best combo, Ranger something or then there's the AA builds... I think I even seen a HIPS cleric/WM/SD build one time with a bow. \n</div></blockquote>\nOnly if the server has changed the WM feat prerequisites.  WMs, by default, can only take advantage of melee weapons. Dunno what your server has customized so can't really assess that sort of build.\n<blockquote><div>\nI am pretty opened to anything as long as it has high AB and HIPS. Some survivability would be nice but I know its a trade off, so that's 2nd to the main goal. Thanks for all your time and thoughts.</div></blockquote>\nI suppose I would consider <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build122146.html\" rel=\"noreferrer\" target=\"_blank\">this</a> as a starting point for an AA type HIPS archer.  It's a somewhat-fragmented and incomplete build but has a basic outline worth investigating.<br/>\n<br/>\nAnother way that occurs to me is a divine archer of some kind like clc/rog/sd, DEX-based rather than Zen, to get the highest stealth skills possible for HIPS while reaching high AB and extra damage via divine buffs to be effective in PvP.  Probably use Divine Trickery to raise stealth even higher.  With darkness, you'll be able to hit by sneak attacks almost every hit.  Hey, that would be a real p.i.t.a. strategy against PvP foes, no?  Pop out of the shadows, cast darkness, sneak attack like crazy, then HIPS away when they started to close.  Just a random thought... hehehe<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:00 PM - Oct 22, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you try the search engine for the old guild, you will find several bard/AA/SD builds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:59 PM - Oct 25, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great, thanks for the suggestions guys. I thought maybe some of the builds from old would be out dated in some area's. I am by no means a builder so didn't know what changes if any would effect the lvl progression, As you can tell form the WM comment.... *head down*<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "12:09 AM - Oct 26, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I do like that idea Hip! Like I said I am no good at building though... How would that set up look like? (The cleric/rogue/shadow dancer)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "9:43 PM - Oct 26, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>campgod wrote:</strong>Like I said I am no good at building though... How would that set up look like? (The cleric/rogue/shadow dancer)</div></blockquote>\nDon't you think it's about time you started getting better at building, campgod?  You'll learn more by posting your best idea, no matter how hideous it may be, and then begin to understand what to select under a broad range of circumstances as the guild begins to dissect it.  We are all nice people and would never flame you, so why not give it a shot?  It's fun making a build with your own hand... and more interesting for us to help a novice builder!  Most all of the builds you can find with the Search Engine and those posted in the new ECB have already been given significant consideration so you can use any of those as a starting point, if you like.<br/>\n<br/>\nThe indisputable fact is: with the vast diversity of PWs out there and with each customization they use to create a unique vision of how NWN should work in their eyes, most of ECB \"finalized\" builds are only a starting point anyway.  The only exceptions are those which have been created specifically for a single environment or server.  So there is no one in a better position to decide how to put any build to its optimal use than YOU!  The adventuring spirit!  There is nothing like it!<br/>\n<br/>\n- end of sermon -<br/>\n<br/>\nIn the meantime...<br/>\n<br/>\n...as long as you are comfortable playing a self-buffer, this is an extremely potent sneaker build.  If you find you don't have the patience, I suggest you stick to some sort of bard AA hybrid (like the one Mith posted on ECB years ago that I already referenced).  The damage will pale compared to this one and not provide a means to penetrate pierce-type resistance, but is easier to play.<br/>\n<br/>\nAlso, an elven longbow version was drafted with almost identical leveling schedule.  There is 20% XP penalty throughout most of it though, slightly lower AB &amp; AC &amp; stealth, though Keen Sense is vary handy for spotting opposed HIPSers. IMO, this one is superior since HIPS relies so much on the initial Hide/Spot check. In each case, SD isn't taken until epic levels to max AB.  You can decide if it is worthwhile gimping the build for earlier access to HIPS or not (earliest is level 8 IIRC).  The subsequent feat &amp; skill juggling is your own affair. <br/>\n<br/>\nRogue(23), Cleric(16), Shadowdancer(1), Halfling, any alignment (TN recommended)<br/>\n<br/>\nSTR: 9<br/>\nDEX: 19 (30)<br/>\nCON: 10<br/>\nWIS: 16 (18)<br/>\nINT: 10<br/>\nCHA: 8<br/>\n<br/>\nHalfling: (Fearless, Good Aim, Lucky, Skill Affinity: Listen, Skill Affinity: Move Silently, Small Stature)<br/>\n01: Rogue(1): Dodge<br/>\n02: Cleric(1): Domain Trickery, Domain (Magic, War or Travel)  See Notes<br/>\n03: Cleric(2): Weapon Focus: Shortbow<br/>\n04: Cleric(3): DEX+1, (DEX=20)<br/>\n05: Cleric(4)<br/>\n06: Cleric(5): Extend Spell<br/>\n07: Cleric(6)<br/>\n08: Rogue(2): DEX+1, {Evasion}, (DEX=21)<br/>\n09: Cleric(7): Empower Spell<br/>\n10: Cleric(8)<br/>\n11: Cleric(9)<br/>\n12: Cleric(10): WIS+1, Point Blank Shot, (WIS=17)<br/>\n13: Rogue(3): {Uncanny Dodge I}<br/>\n14: Cleric(11)<br/>\n15: Cleric(12): Improved Critical: Shortbow<br/>\n16: Cleric(13): WIS+1, (WIS=18)<br/>\n17: Cleric(14)<br/>\n18: Rogue(4): Mobility<br/>\n19: Cleric(15)<br/>\n20: Cleric(16): DEX+1, (DEX=22)<br/>\n21: Shadowdancer(1): Epic Weapon Focus: Shortbow, {Hide in Plain Sight}<br/>\n22: Rogue(5)<br/>\n23: Rogue(6)<br/>\n24: Rogue(7): DEX+1, Epic Prowess, (DEX=23)<br/>\n25: Rogue(8)<br/>\n26: Rogue(9)<br/>\n27: Rogue(10): Great Dexterity I, Defensive Roll , (DEX=24)<br/>\n28: Rogue(11): DEX+1, (DEX=25)<br/>\n29: Rogue(12)<br/>\n30: Rogue(13): Great Dexterity II, Improved Evasion, (DEX=26)<br/>\n31: Rogue(14)<br/>\n32: Rogue(15): DEX+1, (DEX=27)<br/>\n33: Rogue(16): Great Dexterity III, Epic Dodge, (DEX=28)<br/>\n34: Rogue(17)<br/>\n35: Rogue(18)<br/>\n36: Rogue(19): DEX+1, Rapid Shot, ESkF: Hide, (DEX=29)<br/>\n37: Rogue(20)<br/>\n38: Rogue(21)<br/>\n39: Rogue(22): Called Shot (or ESkF: Move Silently) See Notes<br/>\n40: Rogue(23): DEX+1, (DEX=30)<br/>\n<br/>\nHitpoints: 274<br/>\nSkillpoints: 246<br/>\nSaving Throws (Fortitude/Will/Reflex): 22/26/30 (26/30/34 vs spells) - unbuffed<br/>\nSaving Throw bonuses: Traps: +5, Fear: +2<br/>\nBAB: 25<br/>\nAB (max, naked): 26 (melee), 40 (ranged)<br/>\nAC (naked/mundane armor/shield only): 29/31<br/>\nSpell Casting: Cleric(8)<br/>\n<br/>\nDisable Trap 10(12), Hide 43(67), Move Silently 43(59), Open Lock 1(11), Search 5(5), Set Trap 5(17), Spellcraft 20(20), Spot 43(51), Tumble 40(50), UMD 36(35)<br/>\n<br/>\n01: Hide(4), Move Silently(4), Tumble(4), UMD(4), Save(16), <br/>\n02: Spellcraft(5), Save(13), <br/>\n03: Spellcraft(1), Save(14), <br/>\n04: Spellcraft(1), Save(15), <br/>\n05: Spellcraft(1), Save(16), <br/>\n06: Spellcraft(1), Save(17), <br/>\n07: Spellcraft(1), Save(18), <br/>\n08: Hide(7), Move Silently(7), Tumble(6), UMD(2), Save(4), <br/>\n09: Spellcraft(2), Save(4), <br/>\n10: Spellcraft(1), Save(5), <br/>\n11: Spellcraft(1), Save(6), <br/>\n12: Spellcraft(1), Save(7), <br/>\n13: Hide(5), Move Silently(5), Tumble(5), <br/>\n14: Spellcraft(2), <br/>\n15: Spellcraft(1), Save(1), <br/>\n16: Spellcraft(1), Save(2), <br/>\n17: Spellcraft(1), Save(3), <br/>\n18: Hide(5), Move Silently(5), Save(1), <br/>\n19: Save(3), <br/>\n20: Save(5), <br/>\n21: Hide(3), Move Silently(3), Tumble(5), <br/>\n22: Disable Trap(1), Hide(1), Move Silently(1), Open Lock(1), Set Trap(1), Spot(3), <br/>\n23: Hide(1), Move Silently(1), Spot(1), Tumble(5), <br/>\n24: Hide(1), Move Silently(1), Tumble(1), UMD(5), <br/>\n25: Disable Trap(4), Hide(1), Move Silently(1), Search(1), Tumble(1), <br/>\n26: Hide(1), Move Silently(1), Set Trap(4), Spot(1), Tumble(1), <br/>\n27: Hide(1), Move Silently(1), Spot(5), Tumble(1), <br/>\n28: Hide(1), Move Silently(1), Tumble(1), UMD(5), <br/>\n29: Hide(1), Move Silently(1), Spot(5), Tumble(1), <br/>\n30: Hide(1), Move Silently(1), Tumble(1), UMD(5), <br/>\n31: Hide(1), Move Silently(1), Spot(5), Tumble(1), <br/>\n32: Hide(1), Move Silently(1), Tumble(1), UMD(5), <br/>\n33: Hide(1), Move Silently(1), Spot(5), Tumble(1), <br/>\n34: Hide(1), Move Silently(1), Tumble(1), UMD(5), <br/>\n35: Hide(1), Move Silently(1), Spot(5), Tumble(1), <br/>\n36: Hide(1), Move Silently(1), Tumble(1), UMD(5), <br/>\n37: Hide(1), Move Silently(1), Spot(5), Tumble(1), <br/>\n38: Hide(1), Move Silently(1), Spot(5), Tumble(1), <br/>\n39: Hide(1), Move Silently(1), Search(4), Spot(2), <br/>\n40: Disable Trap(5), Hide(1), Move Silently(1), Spot(1), <br/>\n<br/>\nI'm not going through the trouble of itemizing all the stats seeing as how this is not an officially-submitted build, only a suggestion for consideration.  I'll leave it to you to figure out all that stuff if/when you play it.  The stats listed are naked, combat-debugged ones, so equipment can elevate the final results quite a bit where you play this nasty imp.<br/>\n<br/>\nAB (Full buff, hasted)<br/>\nStandard Attack +61/+56/+51+/+61/+56<br/>\nRS mode +59/+54/+49/+59/+54/+49<br/>\n<br/>\nBasically,the cleric buffs add around +15 AB to the base attack, so with a +5 shortie, you'll hit the AB cap (would cap at +66 AB).<br/>\n<br/>\nAC (full buff, hasted, cast Prayer on engagement)<br/>\n54 AC (includes opposed AB penalties)<br/>\n<br/>\nHP (full buff, Aid, Virtue, Emp Endur): just over 400<br/>\n<br/>\nStealth<br/>\nHide: over 80 w/Divine Trickery (always cast Emp Eagle first to extend duration)<br/>\nMove Silently: over 70 w/Divine Trickery <br/>\n<br/>\nNotes:<br/>\n<br/>\n1. If HIPS's hide doesn't hold reliably while you displace, swap out Called Shot for ESkF: Move Silently. It will set that skill over 80.<br/>\n<br/>\nMyself, I use Called leg shots a lot for slowing mobs and reducing their AC a bit, but choose as your style dictates (arm shots effectively raise your own AC a bit).  The AB is high enough to beat most Discipline checks.  Don't pay attention to the character skill sheet for small races in regard to stealth and detection levels.  It lies!   <br/>\n<br/>\n2. Domains: Trickery Domain is a build staple.  Magic Domain was chosen for extra AC &amp; stoneskin DR (which is somewhat unnecessary really with ImpInvis &amp; Epic Dodge in effect).  If you aren't able to easily reach +12 cap for DEX &amp; CON with items, War domain may be better.  Also, without permahaste available (or lots of Speed potions), choose Travel Domain (Haste buff will last just over 3 turns extended) which only has one spell worth having, but a great one.<br/>\n<br/>\n3.  Attacking from stealth, I cast either Darkness or WoF.  Either one will assure subsequent 100% sneak hits on non-SA resistant targets.  WoF is essentially an mob-control alternative to combat True Seeing and Ultravision, but Darkness allows no save or SR check and seems to work well enough in most situations.  Just make sure that your own toon has prebuffed TS beforehand! <br/>\n<br/>\n4. Use robes with this build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:17 PM - Oct 27, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hail campgod!<br/>\n<br/>\nI would change a couple of things in Hip's build.<br/>\n<br/>\nI'd go Cleric 15 Rogue 24 SD 1 or Cleric 20 Rogue 19 SD 1. The spread he chose isn't optimized (Rogue grants you a bonus feat every 4 levels after 20, and he only gets to 23). I'd be leaning more towards the 20/19/1 spread, but then you'd need one more point in Wisdom to be able to cast lvl 9 spells (it's workable into the build). Or you can use the first spread and get an extra feat at Rogue 24, which you could use to take a ESF move silently \"for free\" instead of as an alternative to Called Shot. I would NEVER wait that long to take Called Shot. All my archers use that feat and it's great. Called Shot Leg lowers enemy movespeed which makes it so that you can kite and run very effectively, not allowing enemies to get close to you.<br/>\n<br/>\nThere is another possibility, you don't actually NEED Rogue levels to have SD. Monk would do just fine. A similar spread to my Shadow Priest build would grant you the ability to get Epic Dodge and still be indispellable, but you'd be a bit feat-starved and no UMD. The fortunate side effect is the Monk Speed, which works wonders for an archer, not to mention Monk AC. Here is a link:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/the-shadow-priest-cleric-26-monk-9-sd5-t515430.html\" rel=\"noreferrer\" target=\"_blank\">The Shadow Priest</a><br/>\n<br/>\nSubstitute the Kama feats for bow feats, but you'll need to take Martial Weapons Proficiency for Longbow or be content with a sling. You'll probably need to get rid of Blind Fight for WPM, then Weapon Finesse is out for PBS (Point Blank Shot), and Improved Critical can be exchanged for Rapid Shot. You can reorder the feats as you see fit. Dodge and Mobility can't be changed for they are requirements for SD.<br/>\n<br/>\nSo, you can have a blindfighting slinger or a non-blindfighting bowman, that choice is yours. Or you can take Improved Critical on a sling if you don't want either Blind Fight or Weapon Proficiencies (not recommended). I would walk around with Dusts of Appearance to get rid of Concealment bonuses due to Invisibility if you choose not to take Blind Fight). If your server has them in abundance, you can even go with Shuriken as your chosen weapon. It'll be like a little ninja sniper theme. Pretty cool, but on WoG there just aren't enough for sale or in drops to keep you supplied all the time.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:47 PM - Oct 28, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nI would change a couple of things in Hip's build.<br/>\n<br/>\nI'd go Cleric 15 Rogue 24 SD 1 or Cleric 20 Rogue 19 SD 1. The spread he chose isn't optimized (Rogue grants you a bonus feat every 4 levels after 20, and he only gets to 23). I'd be leaning more towards the 20/19/1 spread, but then you'd need one more point in Wisdom to be able to cast lvl 9 spells (it's workable into the build). Or you can use the first spread and get an extra feat at Rogue 24, which you could use to take a ESF move silently \"for free\" instead of as an alternative to Called Shot. \n</div></blockquote>\nLook closer, Max.  It's as optimized as it can be for PvP.<br/>\n<br/>\nCleric 15/Rog24 costs an AB, 2 fewer buff spell slots (not to mention 2 more extended rounds of divine buffs) and 1 less point in DT stealth skills.  No, thanks.  The extra feat might seem handy but not worth reducing combat effectiveness.  Divine Trickery boosts 1 stealth for every TWO levels of cleric.<br/>\n<br/>\nCleric 20 costs 24 skill points,  Again, no thanks.  I need to max stealth skills and as much detection as possible rather than trying to turn this into a spell caster.<br/>\n<br/>\nThis is a dedicated STEALTH build.  You are competing with other HIPSers or sneakers, most probably, and need any edge.  Size helps.  High DEX helps.  Maxing the stealth and detection skills help.  And the cleric buffs along with Divine trickery also helps.<br/>\n<br/>\nAccess to level 9 spells do absolutely nothing to assure this toon will hide, move and spot at the highest levels. This is a PvP HIPS build or that is how it is designed.  If just PvM, then why waste time investing in stealth skills at all?  High DEX is enough to hide from 90% of all monster blueprints, with an occasional boss that will spot the sneaker.  Meh.  Striving for an extra rogue bonus feat is fine as long as it doesn't gimp the intrinsic strengths of the build, which it does.  Rog 24 buys me nothing I need more than as high AB as possible with maxed stealth/detection skills.<br/>\n<br/>\nBut... I would change the skill distribution I listed in the original build.  Better... eliminate the 20 from spellcraft (saves will be fine with buffs anyway), the other few \"spare\" points and shift 1 point from each Hide and UMD (just need enough to cast scrolls of Mord and Timestop with full success) all those points to max Listen.  Spot will end up being the weaker of the two detection skills.  The final spread would look like this with full buff and all modifiers:<br/>\n<br/>\nHide 42(81), Listen 43(56), Move Silently 43(74), Spot 43(54), Tumble 40(50), UMD 35(34)<br/>\n<br/>\n(The 1 point shifted from Hide to Listen will still result in an 81 Hide check, which should be plenty.)<br/>\n<blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nI would NEVER wait that long to take Called Shot. All my archers use that feat and it's great. Called Shot Leg lowers enemy movespeed which makes it so that you can kite and run very effectively, not allowing enemies to get close to you.\n</div></blockquote>\nTBH, I paid little attention to feat order other than as qualifiers.  Since it is apparent that leveling is rather easy (per campgod's server description), all that really matters is getting to 40 with all the feats and abilities in tact so you can PvP.  But I wouldn't waste a pre-epic feat on Called Shot, though, since the low pre-epic AB (-4) will guarantee that you'll miss more leg shots than hit them except against foes that pose no threat.  AA's pre-epic AB would be a different story, naturally.  This isn't an AA.\n<blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nThere is another possibility, you don't actually NEED Rogue levels to have SD. Monk would do just fine. A similar spread to my Shadow Priest build would grant you the ability to get Epic Dodge and still be indispellable, but you'd be a bit feat-starved and no UMD. The fortunate side effect is the Monk Speed, which works wonders for an archer, not to mention Monk AC. Here is a link:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/the-shadow-priest-cleric-26-monk-9-sd5-t515430.html\" rel=\"noreferrer\" target=\"_blank\">The Shadow Priest</a><br/>\n<br/>\nSubstitute the Kama feats for bow feats, but you'll need to take Martial Weapons Proficiency for Longbow or be content with a sling. You'll probably need to get rid of Blind Fight for WPM, then Weapon Finesse is out for PBS (Point Blank Shot), and Improved Critical can be exchanged for Rapid Shot. You can reorder the feats as you see fit. Dodge and Mobility can't be changed for they are requirements for SD.<br/>\n<br/>\nSo, you can have a blindfighting slinger or a non-blindfighting bowman, that choice is yours. Or you can take Improved Critical on a sling if you don't want either Blind Fight or Weapon Proficiencies (not recommended). I would walk around with Dusts of Appearance to get rid of Concealment bonuses due to Invisibility if you choose not to take Blind Fight). If your server has them in abundance, you can even go with Shuriken as your chosen weapon. It'll be like a little ninja sniper theme. Pretty cool, but on WoG there just aren't enough for sale or in drops to keep you supplied all the time.\n</div></blockquote>\nA HIPS archer that doesn't cause serious sneak damage is asking for trouble.  He'll need to stand a good chance to break arcane concentration before Timestop is cast and 12d6 will go a long way towards achieving that goal.  Sneak damage combined with Divine Favor, Battletide, Prayer &amp; STR boosts (w/mighty bows) will make it tough to launch any successful spells.  x3 crits make it even more likely a high-damage score will occur so I'd stick with bows for a PvP HIPser.  Without KD available as a range attack, only damage can compete with spell casting threats.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:39 PM - Oct 28, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hip, how does BAB suffer with Rogue 24? Go Cleric 12 Rogue 8 pre-epic and it costs ZERO BAB points. <br/>\n<br/>\nYou lose 1 DT boost, hardly a big deal, even less so if you consider that feat is ESF: MS. Spells, again not a big problem. You lose a couple of slots, but gain more stealth. <br/>\n<br/>\nI disagree with your comments about the BAB and Called Shot. You clearly underestimate the buffing potential of Clerics. just to give you an idea, Divine Favor ALONE takes you to the same BAB level of a Fighter, add Divine Power, Bless, Aid, Prayer and Battletide and you are SURELY capable of spamming Called Shot and consistently finding your mark. Even without GMW working on bows. I guarantee that!<br/>\n<br/>\nI agree with the Monk SD comments, however, I was neglecting the damage aspect because on WoG you can cast GMW on arrows as well as Darkfire, so my Cleric Zen Archers have never had problems dealing damage, but for environments without this custom feature, the Rogue sneaker is better optimized for damage dealing. However, if True Seeing isn't modified, no matter how high the Stealth skills are, he will be detected by enemy casters. Regardless, if a HiPS bowman you want, a HiPS bowman you will have, right?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "2:41 AM - Oct 29, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">First of all I just want to thank the both of you for the help and advice, second this is why I love coming here. You guys look at everything form all different angles! Hip, I was thinking about what you said about the skill distribution and think maybe the spellcraft would be better if UMD doesn't help me just yet cause I am new to the server and do not know anyone who can provide me with scrolls. That is the only way one can acquire them. If that is the case then would spellcraft be a better choice? On this server one can re-lvl back to 2 and rebuild at anytime, you just cant redo the first lvl. I can not wait to see how this discussion ends to weigh the difference's.  Once again thank you guys for your time.<br/>\n<br/>\nP.S. How does one go about making a build anyhow? Is there some spread sheet or a calculator I can use?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:58 AM - Oct 29, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong>Hip, how does BAB suffer with Rogue 24? Go Cleric 12 Rogue 8 pre-epic and it costs ZERO BAB points. <br/>\nYou lose 1 DT boost, hardly a big deal, even less so if you consider that feat is ESF: MS. Spells, again not a big problem. You lose a couple of slots, but gain more stealth. \n</div></blockquote>\n...and 2 rounds duration on DP among other short duration spells. But...<br/>\n<br/>\nYou're right there, Max.  I was trying to get access to AoV pre-epic with Clc 16 for CON boosts with a measly 100 HP level or so, but it really doesn't matter that much in easily leveling situations. And those 6 skills points are handy.  I'm convinced. Clc15/Rog 24/SD 1 is the way to go. \n<blockquote><div>\nI disagree with your comments about the BAB and Called Shot. You clearly underestimate the buffing potential of Clerics. just to give you an idea, Divine Favor ALONE takes you to the same BAB level of a Fighter, add Divine Power, Bless, Aid, Prayer and Battletide and you are SURELY capable of spamming Called Shot and consistently finding your mark. Even without GMW working on bows. I guarantee that!\n</div></blockquote>\nBut acquiring the AB offset is a gradual process.  The longer called shot attack is postponed the less the proportional difference between standard attacks and the longer the buffs will hold to offset the penalty.  And without PBS early, it'll be -8 AB that needs to be compensated for closer range, not just -4.  And that is my point.  The later Called Shot is used, the less the penalty affects the attack.   Use when only DF +2, Aid and Bless are available, they'll usually miss where a standard attack won't.  I tend to use Called shots more on bosses than mob control myself so the highest AB attack is very important even with cleric buffs (relative to an AA's AB). It still comes down to a dice roll with more faces in your favor or fewer.\n<blockquote><div>\nI agree with the Monk SD comments, however, I was neglecting the damage aspect because on WoG you can cast GMW on arrows as well as Darkfire, so my Cleric Zen Archers have never had problems dealing damage, but for environments without this custom feature, the Rogue sneaker is better optimized for damage dealing. However, if True Seeing isn't modified, no matter how high the Stealth skills are, he will be detected by enemy casters. Regardless, if a HiPS bowman you want, a HiPS bowman you will have, right?\n</div></blockquote>\n...and THAT is the ultimate disclaimer to any sneaker build, HIPS or otherwise.  Many servers use a version of TS that just increases the Spot skill by a certain amount.  If default TS is in effect, a HIPSer is worthless against any class that has access to the spell or any item with the TS prop.  For that matter, HIPS itself is often altered to become just as worthless on PvP servers.  And a high SA rogue is not effective vs. PM wizards either.  It all comes down to the fiddling designers have done to the base game as to what works and what doesn't.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:28 AM - Oct 29, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>campgod wrote:</strong>Hip, I was thinking about what you said about the skill distribution and think maybe the spellcraft would be better if UMD doesn't help me just yet cause I am new to the server and do not know anyone who can provide me with scrolls. \n</div></blockquote>\nThat's part of UMD's benefit... the one that establishes the highest useful level, 34.  Casting success with scrolls is a DC of 25 + spell level (max of 9) = 34.  I usually round it off to 35 (modified ranks) in case there are expensive class-specific items that are desirable.  And there are usually wands, rods or other magical items that can make the adventure less tedious.  TBH I've never played on a world where UMD wasn't one of the most useful skills.\n<blockquote><div>\nThat is the only way one can acquire them. \n</div></blockquote>\nUmmm... are there any persistent containers for a player account on your server?\n<blockquote><div>\nIf that is the case then would spellcraft be a better choice?\n</div></blockquote> <br/>\nIf you can't buy them or trade for them, then sure.  Good as anything I guess. Or traps, if you like to disable them or use them in combat.\n<blockquote><div>\nOn this server one can re-lvl back to 2 and rebuild at anytime, you just cant redo the first lvl. \n</div></blockquote>\nA re-leveler. Yeah.  Makes things easier so you don't need to always rebuild just to make a minor adjustment.  I like those myself but it does encourage laziness.\n<blockquote><div> <br/>\nI can not wait to see how this discussion ends to weigh the difference's.  \n</div></blockquote>\nMe too  \n<blockquote><div> <br/>\nOnce again thank you guys for your time.<br/>\n<br/>\nP.S. How does one go about making a build anyhow? Is there some spread sheet or a calculator I can use?</div></blockquote>\nUnfortunately, you'll need Excel loaded on your machine to use the sweet <a class=\"postlink\" href=\"http://nwvault.ign.com/View.php?view=other.Detail&amp;id=856\" rel=\"noreferrer\" target=\"_blank\">CBC</a>.  Else, you'll need to do it on paper.  That's how I do all the PRP builds and some of the build requests with special class requirements.  It takes much longer by hand, but eventually you get used to how things fit together, all the feat prerequisites, the synergies, etc. and it goes faster.  But just studying existing builds is just as good a way to learn and you have a lot to choose from, so many that you may go \"build blind\".  Or become like Max where your brain becomes so focused on building characters that it can do little else.   *ducking the wet flounder*<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:06 PM - Oct 29, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>But acquiring the AB offset is a gradual process. The longer called shot attack is postponed the less the proportional difference between standard attacks and the longer the buffs will hold to offset the penalty. And without PBS early, it'll be -8 AB that needs to be compensated for closer range, not just -4. And that is my point. The later Called Shot is used, the less the penalty affects the attack. Use when only DF +2, Aid and Bless are available, they'll usually miss where a standard attack won't. I tend to use Called shots more on bosses than mob control myself so the highest AB attack is very important even with cleric buffs (relative to an AA's AB). It still comes down to a dice roll with more faces in your favor or fewer.</div></blockquote>\n\nThat's exactly what Called Shot is for, to not let your enemy approach, and I never suggested delaying PBS. I'd take PBS at level 1 and delay Dodge. Called Shot should be taken at level 9, Empower Spell at 12, Dodge at 15 and Mobility at 18. Problem solved! You can take Improved Critical in epics after you've taken the cookie-cutter epic feats. 5% increased chance of critting with a bow is by no means indispensable to this guy, since SA damage isn't multiplied on criticals. In fact I would drop IC for Armor Skin, to combo with your Epic Dodge. Now that I see it, you can make that guy more versatile by taking Weapon Finesse instead of Empower Spell. In my book that's a 50-50 tweak.<br/>\n<blockquote><div>That's part of UMD's benefit... the one that establishes the highest useful level, 34. Casting success with scrolls is a DC of 25 + spell level (max of 9) = 34. I usually round it off to 35 (modified ranks) in case there are expensive class-specific items that are desirable. And there are usually wands, rods or other magical items that can make the adventure less tedious. TBH I've never played on a world where UMD wasn't one of the most useful skills.</div></blockquote>\n\nAgreed, if you have either Rogue or Assassin in a build and don't take UMD as a priority, you need medical help <br/>\n<blockquote><div>Unfortunately, you'll need Excel loaded on your machine to use the sweet CBC. Else, you'll need to do it on paper. That's how I do all the PRP builds and some of the build requests with special class requirements. It takes much longer by hand, but eventually you get used to how things fit together, all the feat prerequisites, the synergies, etc. and it goes faster. But just studying existing builds is just as good a way to learn and you have a lot to choose from, so many that you may go \"build blind\". Or become like Max where your brain becomes so focused on building characters that it can do little else.  *ducking the wet flounder*</div></blockquote>\n\nYeah, funny guy! I would add that for you to LEARN how to properly build a character, there is no better way than BUILDING CHARACTERS! Practice makes perfect. Playing other people's builds can be good in that you compare them to your first builds and you start to see how weak your builds are (as they should be, we all gotta start somewhere) and maybe even why they are so. Reading articles in the Game Guides section can be excellent for your development because through them you understand the thought process behind build choices and that helps you organize your own ideas. Besides, as full-blown builders, we disagree plenty of times still, based on playing experience, playstyle and preferred environments, so it's not like anything is set in stone. You just have to find what works for you. I had a friend on WoG who NEVER took the Cleave feat unless he was going for Devcrit, because he fought his battles by pulling strays out of groups and killing them one by one, so he has no use for it. I, I tend to be a \"bit\" (read LOT lol) more aggressive, and get surrounded many times, because I tend to have very strong high level builds (with weak early levels), so Cleave to me is very good. That's just the style. It's not that I build for lvl 40, it's that I build for maximum playability without jeopardizing lvl 40 power. That's my style, it's what works for me, but it's different for each person.<br/>\n<br/>\nBTW, Hip, have you actually counted how many builds I have posted here? I'm curious, but too lazy to count them. And what if I told you you've only seen maybe 60% of what I actually have? It's true, I have many more builds that weren't posted either because they were not that different from other existing builds or because I don't feel they're ready yet (or my Baldur's Gate series builds, which I haven't posted here)<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:40 PM - Oct 29, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong>You can take Improved Critical in epics after you've taken the cookie-cutter epic feats. 5% increased chance of critting with a bow is by no means indispensable to this guy, since SA damage isn't multiplied on criticals. \n</div></blockquote>\nSA isn't but everything else is, notably the divine damage.  Mighty props make crits even more effective.  But sliding it into epic levels is not a bad idea.\n<blockquote><div>\nIn fact I would drop IC for Armor Skin, to combo with your Epic Dodge. \n</div></blockquote>\nI wouldn't.  3.5% more AC vs. 5% more opportunities for high damage seems a bad trade-off to me.  But if your berserker allows itself to be flanked consistently (PvM considerations again), then the decision could be a coin toss.\n<blockquote><div>\nNow that I see it, you can make that guy more versatile by taking Weapon Finesse instead of Empower Spell. In my book that's a 50-50 tweak.\n</div></blockquote>\nIt's unnecessarily reducing the combat effectiveness and you'll need to buff a swapped shield to get the bang for your bucks.  Tumble will take care of the AoOs and PBS assured an extra AB in those melee range instances anyway. <br/>\n<br/>\nDuring extended PvP combat engagements, all those sweet cleric buffs will begin to expire, one-by-one and you'll be left with just the long-term buffs in your arsenal.  Emp Cat's will assure at least a sustained +1AB to tack onto that somewhat pedestrian base +40 (+41 PBS) and Emp Endur enough HPs so that you can stand a few errant opposed crits.  In high-magic, the ability buffs are generally without value since caps can be reached.  But even then, if the choice comes down to gear with ability boosts or some god-like props (common on those kinds of servers), self-buffing abilities is a reliable work-around.<br/>\n<br/>\nHIPS is a bit funky at times trying to disengage, so you can find yourself \"naked\" with only your most reliable enhancements remaining and difficulty triggering stealth to save your butt long enough for rebuffing.   Unfortunately, committing to halfling (or elf, for that matter) assures that melee fighting is not an option in this build, not an effective one anyway.  I'll pass on Weapon Finesse, in every book in the Library of Congress.  <br/>\n<br/>\nI'll leave it to you to count your posted builds.  I've posted about 0.000000001% of mine and have moved almost all of them to an external drive because the blasted spreadsheets take like 15mB each (don't like to have to retrace my steps)!   Many are designed for 3.5 rules anyway, since that's our groups PnP ruleset and it takes too much time to convert them over to 3.0.   But I digress...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:10 PM - Oct 29, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, how I love this thread! <br/>\n@ campgod; read my arcane archer guide to see why you want to make an AA HIPSer (or not). Anyway, the guide has some advice on playing an archer character.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:49 AM - Oct 30, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hip, I won't quote you cuz it's not necessary, but all Clerics should rebuff constantly, extended PvP or not. You have 15 CLs, which means your buffs don't last long. You should be prepared for that. In that module you sent me, Max fully rebuffed at least 3 times per boss battle. He almost ran out of buffs against Captain Xer. Clerics have a pedestrian base AB, that comes with the territory, but especially in low magic, their buffed AB will excel!<br/>\n<br/>\nAbout AS vs IC. What was your math to reach the 3.5% number? Did you take into consideration that opponents have multiple attacks per round and that ED allows you to avoid the first one each round?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:17 PM - Oct 30, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong>Hip, I won't quote you cuz it's not necessary, but all Clerics should rebuff constantly, extended PvP or not. You have 15 CLs, which means your buffs don't last long. You should be prepared for that.\n</div></blockquote>\nExactly.  And thanks for emphasizing my prior point that one should design all self-buffers, like a cake, to optimize the combat potential without considering the \"frosting\" that the buffs provide (or equipment props, for that matter). All it takes is *poof* and then *yikes!... without optimizing the attack potential at mundane levels.\n<blockquote><div>\nAbout AS vs IC. What was your math to reach the 3.5% number? Did you take into consideration that opponents have multiple attacks per round and that ED allows you to avoid the first one each round?\n</div></blockquote>\nWell... this is a dedicated ARCHER, right?  So if you are playing it as such, those flanking situations will be few and far between especially with ED, mob control spells, HIPS and tangle traps if you opt for those skills.  There is more than enough defensive prowess already in the build without gimping it for 54 + 3.5% more (or +2) AC [54 is 96.5% of 56, an increase of 3.5%], buffed stats, naked naturally.<br/>\n<br/>\nAnd while we are questioning the tossing about of superfluous percentages...<br/>\n<br/>\n...that \"5% more crits\" statement of yours is very misleading to a new toon builder.  I really didn't think we needed to debate the obvious merits of a game-staple like Improved Critical at this point and with all the building that has proceeded us, but since you insist...<br/>\n<br/>\nYeah.  From 20 to 19-20 increases the PROBABILITY of a crit by 5%.  But it still doubles the combat potential from the original 5% to 10% for a bow (and any other crit 20 weapon, for that matter), from 1-in-20 to 1-in-10.  That means that an archer who has cast a pre-buffed summon tank, has party tank support  and/or has succeeded in immobilizing the majority of a combat threat with Darkness, WoF or a myriad of other means... can position in the periphery of the battle, pummeling enemies with complete impunity waiting until that first crit occurs... causing triple the non-SA damage (which will probably be as high as SA damage by itself, anyway), thereby reducing the time needed to destroy the target(s).  What Imp Crit does is reduce that waiting interval by one-half, regardless of what range weapon is being used (e.g. xbow 19-20 crits doubles from 10% to 20%, ).   Lucky players will stand in awe at the improved killing rate while those like me, who seem to be always rolling dice made of clay, will appreciate the occasional blessing.<br/>\n<br/>\nCompared to the superfluous benefits of Weapon Finesse's melee focus or Armor Skin's minor boost IN THIS ARCHER BUILD, well... there really is no comparison necessary.  Not unless your intent is to play an archer like a melee character who just happens to have adequate archery skills.  In that case, scrap archer altogether and stick with a finessed rapier or DW kukri.  It'll save lots of reworking in the future.<br/>\n<br/>\nP.S I'm glad our debate is high in entertainment value for Mick.  Personally, I miss all the high-octane, character-assassination furor of the legacy boards, as unseemly as it could become at times.  It really used to get nasty between some of the \"combatants\" with moderators needing to step in sometimes to slap them back into reality. All that passion in a discussion about a video game!  *lol*  Now THAT was entertainment!  Unfortunately, that behavior had the effect of scaring a lot of would-be contributors with thinner skins who didn't want to chance being insulted as to their gaming acumen.  A shame, but c'est la vie!  Congregating among the elite has its advantages and curses, I suppose.  Back to the yard work...<br/>\n<br/>\nMax... carry on, lad!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "7:05 AM - Nov 04, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Mick. I read it and it has tons of good info. I was also looking at the other build you told me about Hip (the bard10/SD2/AA28) and found out that on the server I play on now, lets Assassins have HIPS at lvl 8. How would a bard10/Assassin9/AA21  look compared to the org. build? Would it take to much away? Would the death/sneak attack which works the same way on this server be worth the trade off?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}