{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "324",
  "name": "Enchanter Build for a Sorcerer",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/enchanter-build-for-a-sorcerer-t2352773.html",
  "author": "GoldenEel",
  "avatar": "no_avatar.png",
  "replies": "19",
  "views": "9.9K",
  "posts": [
    {
      "author": "GoldenEel",
      "avatar": "no_avatar.png",
      "timestamp": "5:35 AM - Apr 11, 2014",
      "content": "<div>Greetings ECBG!  <br/>\nLong time lurker, first time poster.  This is truly a fantastic site full of great info for those lacking in savvy character building skills (me)!   <br/>\n<br/>\nI am looking for some help completing a sorcerer build for a low level RP persistant world and would be grateful for any input. Levels are uncapped, but it's highly unlikely that this toon will ever reach 20 as free time isn't what it used to be.  Interested in exploring the ins and outs of a focus in enchantment spells and excited to learn how to combo them with other dmg spells.<br/>\n<br/>\nCaveats:<br/>\n1. Play-style is for a pure sorcerer, caster focus, with a bump in STR for small melee presence for low level mobs or when out of spells at low levels. Also helps with carrying loot.  magic bags are non-existeant or maybe limited to only 1 and certainly not a true bag of holding. <br/>\n2. Enchantment spell focus.  maybe this is a mistake but the dominate, hold line of spells is intriguing and should make for really nice RP.  Never really tested the effectiveness of the Enchant spells.<br/>\n3. Viable for party play and solo play.<br/>\n4. Expertise/Imp Exp are nerfed (i think).<br/>\n5. Craft wand is a possibility, but if reaching level 20 is possibly out of the question, whats the point in burning up xp?  Shouldnt all exp go towards leveling <br/>\n6. No Skill dumps.  only a handful 2-3 skills can be saved per each level up.<br/>\n7. Low magic items, mostly +2 &amp; +3, with maybe a rare +4 <br/>\n8. Not allowed to have more than 1 attribute at 8 or lower.<br/>\n9. Rest times are restricted to safe areas, ie campsites or settlements.  Unsure how long between rests, but probably 8 game hours or more.<br/>\n10. Steep death penalty.  100xp / lvl<br/>\n<br/>\nOther thoughts:<br/>\n1. This is my fist planned build, so attributes/feats/skills may be chosen at times others may not find ideal, or may even be a waste of slots...that's precisely what i am looking for help with.  <br/>\n2. I chose the attribute spread based on an attempt to be somewhat balanced for solo play when necessary.  It occurs to me starting CHA at 16 instead of 18 is possibly a very costly mistake.  Perhaps scaling back the INT and STR for 18 CHA is optimal?<br/>\n3. Not sure what to add to this build for the final feat.  perhaps, dropping toughness and add a 2nd greater school of focus or adding craft wand at lvl 6 and bumping the other feats down?<br/>\n4. If someone wants to take this build all the way to 40 to help other readers, be my guest!<br/>\n<br/>\nThanks in advance for your time and interest!<br/>\n<br/>\n<br/>\nSorcerer(20), Human<br/>\nAlignment: ?<br/>\n<br/>\nSTR: 14<br/>\nDEX: 10<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 16 (21)<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Sorcerer(1): Toughness, Spell Focus: Enchantment<br/>\n02: Sorcerer(2)<br/>\n03: Sorcerer(3): Extend Spell<br/>\n04: Sorcerer(4): CHA+1, (CHA=17)<br/>\n05: Sorcerer(5)<br/>\n06: Sorcerer(6): Empower Spell<br/>\n07: Sorcerer(7)<br/>\n08: Sorcerer(8): CHA+1, (CHA=18)<br/>\n09: Sorcerer(9): Maximize Spell<br/>\n10: Sorcerer(10)<br/>\n11: Sorcerer(11)<br/>\n12: Sorcerer(12): CHA+1, Silent Spell, (CHA=19)<br/>\n13: Sorcerer(13)<br/>\n14: Sorcerer(14)<br/>\n15: Sorcerer(15): Greater Spell Focus: Enchantment<br/>\n16: Sorcerer(16): CHA+1, (CHA=20)<br/>\n17: Sorcerer(17)<br/>\n18: Sorcerer(18): 2nd Spell Focus??<br/>\n19: Sorcerer(19)<br/>\n20: Sorcerer(20): CHA+1, (CHA=21)<br/>\n<br/>\nHitpoints: 140<br/>\nSkillpoints: 115<br/>\nSaving Throws (Fortitude/Will/Reflex): 8/11/6<br/>\nSaving Throw bonuses: Spells: +5<br/>\nBAB: 10<br/>\nAB (max, naked): 12 (melee), 10 (ranged)<br/>\nAC (naked/mundane armor/shield only): 12/12<br/>\nSpell Casting: Sorcerer(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 23(25), Heal 9(8), Listen 6(5), Open Lock 1(1), Persuade 5(10), Search 8(10), Spellcraft 23(25), Tumble 10(10)<br/>\n<br/>\n01: Concentration(4), Heal(1), Open Lock(1), Persuade(1), Search(1), Spellcraft(4), Tumble(2), Save(1), <br/>\n02: Concentration(1), Heal(1), Listen(1), Spellcraft(1), Save(1), <br/>\n03: Concentration(1), Heal(1), Spellcraft(1), Tumble(1), Save(1), <br/>\n04: Concentration(1), Heal(1), Listen(1), Spellcraft(1), Save(1),<br/>\n05: Concentration(1), Heal(1), Spellcraft(1), Tumble(1), Save(1), <br/>\n06: Concentration(1), Persuade(1), Search(1), Spellcraft(1), <br/>\n07: Concentration(1), Spellcraft(1), Tumble(1), Save(1), <br/>\n08: Concentration(1), Listen(1), Search(1), Spellcraft(1), <br/>\n09: Concentration(1), Spellcraft(1), Tumble(1), Save(1), <br/>\n10: Concentration(1), Persuade(1), Search(1), Spellcraft(1), <br/>\n11: Concentration(1), Spellcraft(1), Tumble(1), Save(1), <br/>\n12: Concentration(1), Listen(1), Search(1), Spellcraft(1), <br/>\n13: Concentration(1), Spellcraft(1), Tumble(1), Save(1), <br/>\n14: Concentration(1), Persuade(1), Search(1), Spellcraft(1), <br/>\n15: Concentration(1), Spellcraft(1), Tumble(1), Save(1), <br/>\n16: Concentration(1), Listen(1), Search(1), Spellcraft(1), <br/>\n17: Concentration(1), Spellcraft(1), Tumble(1), Save(1), <br/>\n18: Concentration(1), Persuade(1), Search(1), Spellcraft(1), <br/>\n19: Concentration(1), Heal(2), Spellcraft(1), Save(1), <br/>\n20: Concentration(1), Heal(2), Listen(1), Spellcraft(1),</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:12 PM - Apr 11, 2014",
      "content": "<div>Welcome to ECB GoldenEal,<br/>\n<br/>\nFor your first planned build this doesn't look bad at all, but would you be interested to add some power into it? We usually take Sorcerer when we want to have some synergy with Charisma-based classes OR else we can switch that to Wizard which might be a better fit for you. Also since you said that lvl 20 will likely be the top lvl that you will reach, you might be consider to change your starting/ ending stats to: STR 15 (16)  DEX 10 CON 14  INT 12  WIS 08  CHA 16 (20). Alternatively for Wizard you can go with: STR 15 (16)  DEX 12  CON 14  INT 16 (20)  WIS 10  CHA 08.<br/>\n<br/>\nBy the way, what is the server you are playing at? Seeing their ruleset will be better for us in order to better customize the build to your needs.</div>"
    },
    {
      "author": "GoldenEel",
      "avatar": "no_avatar.png",
      "timestamp": "4:24 PM - Apr 11, 2014",
      "content": "<div>Thank you, Valerfor, for the warm welcome and thoughtful response.<br/>\n<br/>\nSure, I'm interested in adding a little power to the build.  You're attribute spread suggestions make good sense, but the idea to switch to a wiz build puts me at a crossroads.  I really like both classes, and have more experience with the Wiz class, but I also like the synergy of the a sorc and CHA that you mentioned.  In short, I like the idea of RPing the sorc better than the wiz and I like more spells per day, thought limited, but if you think a better enchanter build would be Wiz, then please feel free to add discussion of that as an alternate.  The largest hurdle is the 3 lvls in a specific class before reaching level 20 and no major skill dumps.<br/>\n<br/>\nAs for the server I was looking at is the forgotten realms savage frontier.  I'm not married to that server, but I do appreciate and want to play on a RP server that is low magic, solid lore and achieving levels really means something to the player.  in other words, this build could be for any similar server like this, but for the sake of the build, let's use the FRSF server for build rules.<br/>\n<br/>\nThanks again!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:31 PM - Apr 11, 2014",
      "content": "<div>Alright then, if you play on a FR server and you are indeed interested on adding some power to the mix, choices are several. Adding a single lvl of Paladin to your build will mean that you can <strong>boost all your saves by as much as +11 </strong>across the board &amp; you will get <strong>Martial weapon proficiency</strong> for free as well. The only requirement is that you must be LG. Now, look at some combos with this, by taking \"still spell\" you can wear your full plate armour and cast up to 8th lvl spells safely behind it's protection, while you make short work of the mobs with your Greatsword. Really the incredible amount of buffs a Sorcerer can have will make you a small god at these lvls. For RP purposes you can say you are role playing a \"War Wizard of Cormyr\" and that would be perfectly fit into your style too. Most of the time you can be with your robes but when the situation demands it you take a round, don your full plate and go to battle. For metamagic feats with your Sorcerer i would take the essentials only and rather focus in two schools. That means empower, extend &amp; still spell. I do not know how it fits you role playing style but Necromancy focus is the best you can have as your second school focusses, an alernative would be Evocation and if you want to be truly unique Transmutation for Petrification. <br/>\n<br/>\nIf you need some help with good spells for buffing &amp; strategy just say so and i will provide you with the lists too, for now how is that Paladin lvl sounds?</div>"
    },
    {
      "author": "GoldenEel",
      "avatar": "no_avatar.png",
      "timestamp": "10:05 PM - Apr 11, 2014",
      "content": "<div>+11 saves and free martial, heavy armor and shield proficiency with a side of fear immunity - what's not to like!  I have seen similar threads in these forums that maximize the use of this build synergy sort of like the Exalted Sorceress, for example. While the paladin levels sound nice, LG isn't exactly my style, nor is it easy to RP.  maybe the black guard would be a better RP alternative, but at the cost of more feats for pre-reqs?  When I started this thread I was intent on a pure caster sorc with an enchant focus, and that is still my primary focus, but your ideas of maximizing the power build side of this class with a multi in Pal/BG sound so intriguing too!  I'm not here to waste anyone's time, but both styles seem like they could have their own place in a game world and now I'm sorta stuck between which to choose.  Honestly I'm interested to see your take on both versions, but if that is asking too much, I understand.  Perhaps this is a case where you are trying to tell me that if I wanted to pure cater with a focus on enchantment, I should just roll a Wiz, but if wanted to use the Sorc, it would be pitiful as a pure caster, so it would need to be a multi-classed melee sorc?<br/>\nThanks again for the tips</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:04 PM - Apr 11, 2014",
      "content": "<div>You like Dark side of the moon? That's cool too, take 2 lvls of BG and get your Dark blessing along with all the rest (martial weapons, heavy armour e.t.c.). Plus you get three attacks that way too! I would not get more than two lvls of another class though if i cant get my Sorcerer above lvl 20, so to preserve the allmighty 9th lvl casting. And as a dark side you are perfectly jutified from an RP perspective to Gsf: Necro as you second school, which has all the power   <br/>\n<br/>\nHave fun, and i would like to hear your opinion on this too.</div>"
    },
    {
      "author": "GoldenEel",
      "avatar": "no_avatar.png",
      "timestamp": "11:51 PM - Apr 11, 2014",
      "content": "<div>Due to the server rules, 3 lvls in BG would be required by lvl 20, otherwise the toon would be illegal.  hence the quandary.<br/>\n<br/>\nNecro is definitely great and would make for good RP with the BG.  I am really liking this idea.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:42 AM - Apr 12, 2014",
      "content": "<div>I <strong>AM</strong> the Dark Side of the Moon.  <br/>\nMy DM avatar at the Anchorome PW was Shar, the Mistress of Darkness.<br/>\nAssassins and <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/evil-speed-caster-sorc-35-monk-3-bg-2-t2319013.html\" rel=\"noreferrer\" target=\"_blank\">Blackguards</a> just crawl out from under my fingernails as I type.<br/>\n<br/>\nEven so...<br/>\nPlaying a sorcerer is very different from playing a wizard. Both classes have their own strengths, and their own styles of play. A wizard player won't play a sorcerer unless someone points a gun to his head. <blockquote><div><strong>HipMaestro wrote:</strong>I do like Mick's strategies, though.  If someone held a gun to my head and forced me to play a sorc I'd be using those tips. </div></blockquote>\nLikewise, a sorcerer player will never understand why anyone will play a character with only one, or maybe three slots for a given spell per day.<br/>\n<br/>\nIf you want to play a sorcerer, then do so.<br/>\n<br/>\nThe strength of the sorcerer is his spells. He is weak - very weak - early on. He has almost no spells, no armor, no hitpoints, no AB. But later on, as he gets levels, he gets spells. He gets more and more spells, spellslots, spell penetration, charisma and spell DC - in short; more and more SPELLPOWER.<br/>\nIt is not an exaggeration to claim that a sorcerer lives - and dies by his spells.<br/>\n<br/>\nThe spellpower of the sorcerer spells improves level by level until level 20. <br/>\nAfter that you only improve the spell DC by gaining higher charisma and spell penetration by taking more caster levels. You can also take epic spells. But apart from that you don't get more spells and only get spellslots from higher charisma.<br/>\n<br/>\nIf you plan a character for a level 20 environment, going pure sorcerer is important to get more spellpower. If you plan for a character going into epic levels, you get the freedom to take a couple of levels of other classes for charisma synergies and whatnot, as long as you keep your gaze fixed at taking as many sorcerer levels as possible for spell penetration and getting the charisma as high as possible for the spells DC.<br/>\n<br/>\nSo even if Blackguards crawl out from under my fingernails, I must advice you to restrain from multiclassing, unless you plan on taking your sorcerer into epic levels.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:34 AM - Apr 12, 2014",
      "content": "<div>... Yeah 3 lvls is way to steep a price to pay since you then loose your 9th lvl of spells, unfortunately... Are you sure you won't go at 22nd lvl perhaps ? Casters are the easiest class to advance if you know what you are doing and you said you have played before Wizards.<br/>\n<br/>\nFor me, i would rather play as i want with the hope that i can get into that two-three lvls more, or i wouldn't play that at all, But thats just me. Just so much synergy between A Dark Sorcerer and BG and spells with Necro focus...  Argh, i want to play this Now! Oh, and Enchantment fits perfectly with that RP aspect of the build, you force others to do your binding (Enchantment) or you kill them (Necromancy) if they don't! What a character!<br/>\n<br/>\n* By the way with those 3 lvls of Bg you would get 3 attacks, martial weapons, heavy armour &amp; shields, +11 to all saves and +11 to your AC/ Dmg...  Too much power to ignore.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:11 AM - Apr 12, 2014",
      "content": "<div>And yes, GoldenEel i would indeed recommend for you to play a Wizard if you go for lvl 20 restricted plain caster. Not that the pure Sorcerer will be bad for you, not at all but if there is no synergy then go with a Wizard is much more better. 5 extra feats are a lot, not to mention the tons of skill points you can have and the earlier access to spells.</div>"
    },
    {
      "author": "GoldenEel",
      "avatar": "no_avatar.png",
      "timestamp": "4:40 PM - Apr 12, 2014",
      "content": "<div>The Sorc/BG combo with enchant and necro focus sounds delicious!  That's excatly a combo that I would enjoy RPing on a lvl 40 server.  Great ideas all around, Valerfor.  One day i'd like to see what kind of spread you come up with for this sinister creation!<br/>\n<br/>\nHey Mick, that's a solid rundown of the strengths and weaknesses of a pre-epic sorc.  You also seem to be one of the resident sorc experts as i've read some of your sorc play-style tips and some of your 40 builds like the Spellsword of Bahamut and Evil Speed Caster. All very helpful info. Thank you for chiming in and please stick around to share some more knowledge!<br/>\n<br/>\nI appreciate the rec to go Wiz for lvl 20 environments and totally understand why b/c of the benefits of the extra feats, skill points, flexibility.  However, for the sake of this discussion, I want to go pure caster sorc.  In your opinions is the enchant/necro combo focus for a lvl 20 sorc viable for this feat starved class, or would you recommend a single spell focus?  Using the framework of the build posted above, how would you tweak it if you wanted to build a lvl 20 sorc with enchant focus?  Again, keep in mind the server would be rp, not hacknslash power lvl to 20 in a month.<br/>\n<br/>\nThank you both for the recommendations and different points of view!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:18 PM - Apr 12, 2014",
      "content": "<div>I have played too in heavy RP PW's that go up to lvl 20 and maybe up to 30 with DM permission only (rare), and even there getting to 20 lvl isn't that slow because the players help you to explore and missions are done usually from a big team. Role playing helps too to advance quicker in lvls as you are given more missions from the DM's e.t.c. Anyway i totally understand that you have not much time for playing, so i will strictly focus in a lvl 20 environment for a Sorcerer and not a Wizard. Since you need three lvls in order to get another class i would avoid as Mick said, multi-classing and play a pure sorcerer with the following start/ending attributes: STR 15 (16)  DEX 10  CON 14  INT 12  WIS 08  CHA 16 (20), Feats: Sf: Enchantment, Gsf: Enchantment, Sf: Necromancy, Gsf: Necromancy, Empower Spell, Extend Spell, Martial Weapons - OR Exotic Weapons, Wf: Greatsword - OR Wf: Scythe. Toughness you won't need as usually 20 hp's wont save you if things go wrong and if you play your Sorcerer correctly things simply won't touch you. With Greater Sanctuary &amp; Time Stop you can escape any encounter that goes wrong for you. Extend your haste spell before you go in a battle and cast all your protections especially Shadow Shield &amp; Premonition. The weapon feats arent't necessary but they do add to style for a Role Playing Sorcerer, especially the Scythe for a Darker version of her.<br/>\n<br/>\nThat's all man and i hope you have fun with your Sorcerer,</div>"
    },
    {
      "author": "GoldenEel",
      "avatar": "no_avatar.png",
      "timestamp": "11:18 PM - Apr 12, 2014",
      "content": "<div>Interesting take, swaping silent and maximize for a weap prof and focus - I like it!<br/>\nHey thanks again for your time and help!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:40 AM - Apr 14, 2014",
      "content": "<div>My thoughts were to make something out of that starting 14 STR of yours and as things went you will end up probably with 4-5 AB higher than most other sorcerers, plus it adds to the style except from its practical use, so i thought why not? <br/>\n<br/>\nHave fun,</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:00 PM - Apr 14, 2014",
      "content": "<div><blockquote><div><strong>GoldenEel wrote:</strong>Hey Mick, that's a solid rundown of the strengths and weaknesses of a pre-epic sorc.  You also seem to be one of the resident sorc experts as i've read some of your sorc play-style tips and some of your 40 builds like the Spellsword of Bahamut and Evil Speed Caster. All very helpful info. Thank you for chiming in and please stick around to share some more knowledge!</div></blockquote>\nYou're welcome   <br/>\n<br/>\nAs for trading metamagic feats for weapon prof. and focus, I'd say It's easier to build a \"Melee mage\" based on the Wizard class, because you have 4 pre epic bonus feats and can learn more buffing spells. <br/>\nMetamagic is especially important for the sorcerer, because of the ability to improvise \"on the spot\" and be able to <strong>bombard</strong> with a given spell taken from spellslots of as much as 5 different spell levels. EG a Sorcerer with Cha 34 can cast Ice storm  9 times as a normal spell, then 8 times silenced, 8 times empowered, 8 times maximized and finally 8 times quickened before he runs out of that spell.<br/>\nI can see the need for weapon prof martial or exotic to be able to RP something mean looking, and I would be willing to sacrifice Silent spell for that, since much (if not all of it) is covered by Extend spell. But taking weapon focus for +1 AB is IMO not worth it if you give up Maximize spell, which is far more powerful.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:48 PM - Apr 14, 2014",
      "content": "<div>I would agree for Maximize spell if this was a PvP scenario (very valuable) but for PvE it is not that good of a feat, neither are ice storms his only (or best) weapon.<br/>\n<br/>\nAlthough Mick's suggestion is solid (he wants you to play your Sorcerer like a real caster), i have found that in RP-Wolrds some things can be left to a notch below the maximum, but surely from a caster's point of view taking metamagic feats are always preferred from most other things. My take was to try and make it more unique, while working in the limited (lvl 20 - no more than one stat below 10) frame we set. <br/>\n<br/>\nHave fun,</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:17 AM - Apr 15, 2014",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong>I would agree for Maximize spell if this was a PvP scenario (very valuable) but for PvE it is not that good of a feat, neither are ice storms his only (or best) weapon.</div></blockquote>\nMaximize is the only metamagical feat that uses spellslots 3 levels above the original spell. So there is no other metamagical feat to replace it. As for power, in one on one situations (PvP or PvM) maximized IGMS at lvl 9 is a major killer spell.<br/>\nIce storm is a great spell in many situations, but of course it is wrong to claim that it is the sorcerer's best or only weapon. What is best, depends on what you are up against. That is why a sorcerer player wants to be able to improvise on the spot and cast the appropriate spell as much as needed. Ice storm was chosen as an example, but this is not about Ice storm. It is about metamagic, and what you can do when you have the full arsenal of metamagical feats.<br/>\n<br/>\nYour interpretation, that I advice GoldenEel to build and play the sorcerer as caster is right. That's what sorcerers are, that's what they do best. <br/>\n<br/>\nBut I also play flawed characters, for RP reasons, or just for the challenge, so I know where you're coming from.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:01 PM - Apr 15, 2014",
      "content": "<div>Yeah Mick, basically we say the same thing, i don't think anyone has a different opinion of what is more useful for a pure sorcerer - a metamagic feat or Wf - what i was saying was that i was trying to make him more unique while sacrificing as little as possible, within the context of the build's request. I rarely anyway build full-power sorcerers, they end being way too powerul for my tastes even without multiclassing at all   <br/>\n<br/>\nBut since we are here already, let me visualize your interpretation for GoldenEel, so he can measure what you propose.<br/>\n<br/>\n<br/>\nHuman Sorceror lvl 20,<br/>\n<br/>\nSTR 11  DEX 10  CON 14  INT 14  WIS 08  CHA 17 (22)<br/>\n<br/>\nFeats: Extend Spell, Empower Spell, Maximize Spell, Sf: enchantment. GSf: enchantment, Sf: necromany, GSf: necromancy, Exotic weapons<br/>\n<br/>\n<br/>\nCorrect me if i have done something different Mick,<br/>\n<br/>\n<br/>\n* I do hope you have fun GoldenEel and you don't mind all that blabbering we have here</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:52 PM - Apr 15, 2014",
      "content": "<div>Since he is carrying a big stick, I gave him more strength. I dropped intelligence since you don't take Expertise and don't have that many class skills to choose between. If going past level 20 is an option, starting charisma is 18.<br/>\nUse Ghostly visage/Cat's/Stoneskins/Premonition/Improved invisibility/Shield/ Mage armor/Shadow shield/Haste for melee defence, depending on level.<br/>\nBuff melee attack with MW/GMW/Flame weapon/ Bull's/ Haste/ TS.<br/>\nAbuse the resiprocal damage shields for added melee prescence.<br/>\nDon't be afraid to use your attack spells to soften them up first, or your enchanter spells to add muscle to your party.<br/>\n<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tSorcerer(20), Human<br/>\nSTR: 14<br/>\nDEX: 11<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 10<br/>\nCHA: 17 (22)<br/>\n<br/>\n01: Sorcerer(1): Spell Focus: Necromancy, Spell Focus: Enchantment<br/>\n02: Sorcerer(2)<br/>\n03: Sorcerer(3): Weapon Proficiency Exotic<br/>\n04: Sorcerer(4): CHA+1, (CHA=18)<br/>\n05: Sorcerer(5)<br/>\n06: Sorcerer(6): Extend Spell<br/>\n07: Sorcerer(7)<br/>\n08: Sorcerer(8): CHA+1, (CHA=19)<br/>\n09: Sorcerer(9): Empower Spell<br/>\n10: Sorcerer(10)<br/>\n11: Sorcerer(11)<br/>\n12: Sorcerer(12): CHA+1, Maximize Spell, (CHA=20)<br/>\n13: Sorcerer(13)<br/>\n14: Sorcerer(14)<br/>\n15: Sorcerer(15): Greater Spell Focus: Enchantment<br/>\n16: Sorcerer(16): CHA+1, (CHA=21)<br/>\n17: Sorcerer(17)<br/>\n18: Sorcerer(18): Greater Spell Focus: Necromancy<br/>\n19: Sorcerer(19)<br/>\n20: Sorcerer(20): CHA+1, (CHA=22)<br/>\n<br/>\nHitpoints: 120<br/>\nSkillpoints: 69<br/>\nSaving Throws (Fortitude/Will/Reflex): 8/11/6<br/>\nSaving Throw bonuses: Spells: +4<br/>\nBAB: 10<br/>\nAB (max, naked): 12 (melee), 10 (ranged)<br/>\nAC (naked/mundane armor/shield only): 12/12<br/>\nSpell Casting: Sorcerer(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 23(25), Spellcraft 23(23), Tumble 10(10), remaining skillpoints 3<br/>\n<br/>\n01: Concentration(4), Spellcraft(4), Tumble(2), <br/>\n02: Concentration(1), Spellcraft(1), Save(1), <br/>\n03: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n04: Concentration(1), Spellcraft(1), Save(1), <br/>\n05: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n06: Concentration(1), Spellcraft(1), Save(1), <br/>\n07: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n08: Concentration(1), Spellcraft(1), Save(1), <br/>\n09: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n10: Concentration(1), Spellcraft(1), Save(1), <br/>\n11: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n12: Concentration(1), Spellcraft(1), Save(1), <br/>\n13: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n14: Concentration(1), Spellcraft(1), Save(1), <br/>\n15: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n16: Concentration(1), Spellcraft(1), Save(1), <br/>\n17: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n18: Concentration(1), Spellcraft(1), Save(1), <br/>\n19: Concentration(1), Spellcraft(1), Save(2), <br/>\n20: Concentration(1), Spellcraft(1), Save(3),</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "GoldenEel",
      "avatar": "no_avatar.png",
      "timestamp": "8:06 PM - Apr 15, 2014",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong>I do hope you have fun GoldenEel and you don't mind all that blabbering we have here  </div></blockquote>\n\nHey man, blabbering is great!  I know you're kidding around, but that's what this message board is for.  Posting a build idea with some basic guidelines and watching two pros hammer out the details with a little back and forth chatter is exactly what I was after.  I definitely know more about the class now that I did before posting the question for help.<br/>\n<blockquote><div><strong>Mick Dagger wrote:</strong>Since he is carrying a big stick, I gave him more strength. I dropped intelligence since you don't take Expertise and don't have that many class skills to choose between. If going past level 20 is an option, starting charisma is 18.<br/>\nUse Ghostly visage/Cat's/Stoneskins/Premonition/Improved invisibility/Shield/ Mage armor/Shadow shield/Haste for melee defence, depending on level.<br/>\nBuff melee attack with MW/GMW/Flame weapon/ Bull's/ Haste/ TS.<br/>\nAbuse the resiprocal damage shields for added melee prescence.<br/>\nDon't be afraid to use your attack spells to soften them up first, or your enchanter spells to add muscle to your party.<br/>\n<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tSorcerer(20), Human<br/>\nSTR: 14<br/>\nDEX: 11<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 10<br/>\nCHA: 17 (22)<br/>\n<br/>\n01: Sorcerer(1): Spell Focus: Necromancy, Spell Focus: Enchantment<br/>\n02: Sorcerer(2)<br/>\n03: Sorcerer(3): Weapon Proficiency Exotic<br/>\n04: Sorcerer(4): CHA+1, (CHA=18)<br/>\n05: Sorcerer(5)<br/>\n06: Sorcerer(6): Extend Spell<br/>\n07: Sorcerer(7)<br/>\n08: Sorcerer(8): CHA+1, (CHA=19)<br/>\n09: Sorcerer(9): Empower Spell<br/>\n10: Sorcerer(10)<br/>\n11: Sorcerer(11)<br/>\n12: Sorcerer(12): CHA+1, Maximize Spell, (CHA=20)<br/>\n13: Sorcerer(13)<br/>\n14: Sorcerer(14)<br/>\n15: Sorcerer(15): Greater Spell Focus: Enchantment<br/>\n16: Sorcerer(16): CHA+1, (CHA=21)<br/>\n17: Sorcerer(17)<br/>\n18: Sorcerer(18): Greater Spell Focus: Necromancy<br/>\n19: Sorcerer(19)<br/>\n20: Sorcerer(20): CHA+1, (CHA=22)<br/>\n<br/>\nHitpoints: 120<br/>\nSkillpoints: 69<br/>\nSaving Throws (Fortitude/Will/Reflex): 8/11/6<br/>\nSaving Throw bonuses: Spells: +4<br/>\nBAB: 10<br/>\nAB (max, naked): 12 (melee), 10 (ranged)<br/>\nAC (naked/mundane armor/shield only): 12/12<br/>\nSpell Casting: Sorcerer(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 23(25), Spellcraft 23(23), Tumble 10(10), remaining skillpoints 3<br/>\n<br/>\n01: Concentration(4), Spellcraft(4), Tumble(2), <br/>\n02: Concentration(1), Spellcraft(1), Save(1), <br/>\n03: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n04: Concentration(1), Spellcraft(1), Save(1), <br/>\n05: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n06: Concentration(1), Spellcraft(1), Save(1), <br/>\n07: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n08: Concentration(1), Spellcraft(1), Save(1), <br/>\n09: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n10: Concentration(1), Spellcraft(1), Save(1), <br/>\n11: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n12: Concentration(1), Spellcraft(1), Save(1), <br/>\n13: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n14: Concentration(1), Spellcraft(1), Save(1), <br/>\n15: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n16: Concentration(1), Spellcraft(1), Save(1), <br/>\n17: Concentration(1), Spellcraft(1), Tumble(1), <br/>\n18: Concentration(1), Spellcraft(1), Save(1), <br/>\n19: Concentration(1), Spellcraft(1), Save(2), <br/>\n20: Concentration(1), Spellcraft(1), Save(3),<br/>\n<br/>\n<br/>\n</div></blockquote>\n\nNow that's a write up!  Great build-layout and an even better description of spell tactics!<br/>\n<br/>\nThank you both for the time and effort to complete this build.  I have a much deeper understanding of the class and the intricacies of the build.  I can't wait to roll this one soon!<br/>\n<br/>\nSide Note:  One of these days we'll have to discuss the lvl 40 SO/BG/?? combo for some seriously evil power building!<br/>\n<br/>\nThanks again Gents!</div>"
    }
  ]
}