{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "189",
  "name": "Wulgar Ironbow: Fighter 16/ Dwarven Defender 19/ Harper Scout 5",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/wulgar-ironbow-fighter-16-dwarven-defender-19-harp-t2354617.html",
  "author": "HipRedux",
  "avatar": "10577588_1510287072.jpg",
  "replies": 10,
  "posts": [
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:37 AM - Oct 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><table class=\"post_content_table\"><tbody><tr><td>Here is a bearded chap I had been playing in our LAN parties<br/>\n where he had become an awesome archer/tank combo.  <br/>\n That's handy for adapting to any party mix.  When cooping<br/>\n with warrior types, he can pull mobs apart for them and then<br/>\n snipe as his comrades deal with the unruly mob up close and<br/>\n personal.  Those that get through the ranks still need to deal<br/>\n with his slashing attack.  With a mix of AAs, rogue archers or<br/>\n artillery casters he can tank with his little hatchet.  <br/>\n Probably one of the most versatile toons I've built.<br/>\n<br/>\n But his real forte' is his bowmanship.  This is the first PBS<br/>\n archer I've really liked because most of the others were too<br/>\n frail to chance long exposures within melee range.  This guy<br/>\n has no traps.  He has no summoning capability. He must<br/>\n suffer the damage of those attackers that will not succumb<br/>\n to leg shots.  Wulgar handles this pressure quite well, in part<br/>\n with HP much higher than a standard archer<br/>\n (or AA, for that matter) and also the DR never expires.<br/>\n<br/>\n I've been saving the Harper skills for boss encounters and<br/>\n relying on just the Cat pots for a regular DEX boost.  The<br/>\n only limitation so far is that we play mainly low-mid magic<br/>\n so no higher than mighty +3 are sold.  It doesn't seem to<br/>\n matter though.  There is a good assortment of fire, ice,<br/>\n electrical and acid enhancements on the arrows (once you<br/>\n can afford them).  They are only d4 arrows but hit on<br/>\n most attacks.</td><td><img class=\"post-image\" loading=\"lazy\" src=\"http://i1132.photobucket.com/albums/m573/HipMaestro/wulgar_ironbow_zps9zemsznd.png\" /></td></tr></tbody></table>\n<strong>PROs</strong> <ul><li>Equal efficiency with ranged or melee attacks.</li> <li>Exceptional and versatile party toon, but can solo with some micromanagement.</li> <li>Pulling ability is excellent.  Most closers never make it within melee switch range.</li> <li>Either robes or heavy plate armor work fine though robes are preferred in later epic levels.</li> <li>The archery skill assures that most elemental resistances can be bypassed just by swapping ammo.</li> <li>Both attacks have high-damage crits for a DEX build.</li> <li>Wulgar doesn't miss often ranged or melee.</li> </ul>\n<strong>CONs</strong> <ul><li>No Epic Dodge.  That's a rogue or monk/SD combo so cannot be a factor here.</li> <li>No UMD.  My archers are most often summoners so must learn a different pace with this guy.</li> <li>Without sneaks or AA boosts the toon is fairly dependent on mighty bows for consistent damage.</li> <li>Trap detection is... well... pretty lean except for those placed underground and with some help from Harper skill.</li> <li>Specializing in 2 weapons leaves it a bit feat-starved.  Hence, no room for handaxe ImpCrit without sacrificing more valuable feats.</li> </ul>\nSimilar Builds<br/>\n None.  Fighter DwDs tend to use monk, rogue, SD or even assassin for tertiary.  Of those listed, none focus on ranged attacks as the primary attack.<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>Wulgar \"Death's Eye\" Ironbow</strong></span><br/>\nSpoiler [+]<br/>\n<br/>\n His father Wuldan became the original archer of the mountain.  Out of necessity and innovation rather than custom.<br/>\n<br/>\n Of the three sons only the youngest, Wulgar, remained behind with his sire at the original homestead.  The brothers had trekked South years before to join the mining clans ripe with plans to advance their personal fortunes by the trade of rare ores and forged weaponry, armor, implements and jewelry... skills more typical of his race.  The castles and towns populating the southern vastness provided an almost endless opportunity for rich dwarven commerce.<br/>\n<br/>\n The home sat at the foot of the Kharak, the mountain range which guarded the woodlands from the constant threat trickling down, almost daily, from the flatlands beyond the tor.  When snaring squirrels and rabbits in the surrounding woodlands became too tedious and distasteful, Wulgar's father sought to harvest from the abundant venison herds, mostly red deer and elk, that roamed freely through the overgrowth of oak, birch and poplar forests that crept up the mountain side.  There was no way to outrun the beasts to slay them with his cleaver, even on horseback, so Wuldan began devising bows by smelting and forging ores rendered from the mine fronted by his home.  A powerful propelling force was generated by laminating iron straps together sandwiched with one or more rare metals, some with magical properties.  Thus it was that the first iron-composite bows became indoctrinated as a blood legacy. In time, the craftsmanship improved with the advent of rare alloys and clever forging techniques.<br/>\n<br/>\n Delved into the mountain shoulder, the rock facade that faced the forest obscured the cavern within, a dwarven deep that housed a foundry and stocks.  Through a vertical surface shaft that extended into the caves below, the heat and smoke of the hearth was vented and yet another portal farther back erupted upward from the chief furnace.  Other similar shafts stepped gradually up the escarpment providing skylights that allowed filtered light to penetrate into the deepest recesses of the underground fortress.  Smelting and forging activity was limited to the blackest hours of night in order to secure the habitation, a danger that the smokes and fumes wafting through the sky would surely reveal to passing adventurers.<br/>\n<br/>\n The entire scree around the entrances (there were three in all) was strewn with many sizes of easily-dislodged, smooth, rounded boulders, all individually-hewn by Wuldan and his sons... an engineered hazard to prevent egression over the peak from all except an occasional sure-footed goat seeking scraps of grazing.  It had become a periodic task for the sons to maintain the avalanche zone, replacing the stone arrangements when disturbed, to the bane of intruders unfamiliar with the area. The tumbling alert always gave rise to a hail of arrows that never missed.  Staked orc and goblin heads at the slope's crest warned the reckless and unwary.  Even so, unmarked graves of stubborn trespassers dotted the underbrush for miles around just a few feet under tread while the invasive grasses grew to obscure evidence of any freshly-disturbed soil.  <br/>\n<br/>\n But there was little trade for the metal bows crafted by Wulgar's family, stifling any possible windfalls.  The weapons were far to heavy for any but dwarves to heft and string (the bowstring was actually resilient wire composed of a rare ore only procured in the South) so the market was small.  Few dwarves ever considered investing their purse into one of the craft's expensive bows and only the most burly human warrior could hope to carry and manipulate the powerful limbs that could pierce armor from over 200 meters away.  Those with brutish orc blood never made it within safe bartering range.<br/>\n<br/>\n So began Wulgar Ironbow's reputation and career as a mercenary for hire.  His uncanny, glowing eyes and vast targeting expertise became so renowned that rumors of a possible elvish blood influence surfaced, much to Wulgar's displeasure.   No one has ever discovered the source of any of these ill-advised conjectures.  Ironically though, his father Wuldan never forcefully denied the claim.<br/>\n<br/>\n<br/>\n<br/>\n<strong>Fighter(16), Dwarven Defender(19), Harper Scout(5), </strong>Any lawful and non-evil Dwarf<br/>\n<br/>\n STR: 14<br/>\n DEX: 18 (34)<br/>\n CON: 12<br/>\n WIS: 8<br/>\n INT: 14<br/>\n CHA: 6<br/>\n<br/>\n 01: Ftr(1): Weapon Finesse, WF: Longbow<br/>\n 02: Ftr(2): WF: Handaxe<br/>\n 03: Ftr(3): Point Blank Shot<br/>\n 04: Ftr(4): DEX+1 (19), WS: Longbow<br/>\n 05: Ftr(5)<br/>\n 06: Ftr(6): Rapid Shot, WS: Handaxe<br/>\n 07: Ftr(7)<br/>\n 08: Ftr(8): DEX+1 (20), ImpCrit: Longbow<br/>\n 09: Ftr(9): Toughness<br/>\n 10: Ftr(10): Dodge<br/>\n 11: DwD(1)<br/>\n 12: DwD(2): DEX+1 (21), Called Shot<br/>\n 13: DwD(3)<br/>\n 14: DwD(4)<br/>\n 15: DwD(5): Iron Will<br/>\n 16: DwD(6): DEX+1 (22)<br/>\n 17: Ftr(11)<br/>\n 18: Ftr(12): Alertness, Blind Fight<br/>\n 19: Ftr(13)<br/>\n 20: Ftr(14): DEX+1 (23), Knockdown<br/>\n 21: HS(1): EWF: Longbow, Grt DEX (24)<br/>\n 22: DwD(7)<br/>\n 23: DwD(8)<br/>\n 24: DwD(9): DEX+1 (25), EWF: Handaxe<br/>\n 25: DwD(10)<br/>\n 26: DwD(11)<br/>\n 27: HS(2): Grt DEX (26)<br/>\n 28: DwD(12): DEX+1 (27)<br/>\n 29: DwD(13)<br/>\n 30: Ftr(15): EWS: Longbow<br/>\n 31: Ftr(16): EWS: Handaxe<br/>\n 32: HS(3): DEX+1 (28)<br/>\n 33: DwD(14): Grt DEX (29), Armor Skin<br/>\n 34: DwD(15)<br/>\n 35: DwD(16)<br/>\n 36: DwD(17): DEX+1 (30), Grt DEX (31)<br/>\n 37: HS(4)<br/>\n 38: DwD(18): Epic Prowess<br/>\n 39: HS(5): Grt DEX x2 (32,33)<br/>\n 40: DwD(19): DEX+1 (34)<br/>\n<br/>\n HP(max): 498<br/>\n Saves F/W/R: 25/20/28 (31/26/34 v spells); 27/22/30 (33/28/36) w/Tymora<br/>\n Add'l saves - Mind Effects: +2 (+4 w/Lliira), Traps: +3 (+5 w/Deneir), Poison: +2<br/>\n BAB: 30 (4 APR)<br/>\n AB (max, naked): 46 (mundane handaxe), 46 (mundane longbow) [47 PBS, 44-45 RS, 42-43 CS]<br/>\n AB (buffed): 50 (melee) 46 for KD, 50 (ranged, 51 PBS, 48-49 RS)<br/>\n AC (naked/fplate/fplate+tshield): 33/30/33 (37/30/33 buffed)<br/>\n - - Naked 10 + 12dex + 8tum + 2as + 1dodge<br/>\n - - Fplate 10 + 1dex +8tum + 2as + 1dodge + 8arm (+3 tower)<br/>\n<br/>\nDamage(ranged w/mundane arrows)<br/>\n Longbow, piercing 7-14, crit @19-20 21-42<br/>\n Damage(+5 mighty, intrinsic): Longbow w/mundane arrows, piercing 9-16, crit @19-20 27-48<br/>\n Damage(+5 mighty, @STR 20): Longbow w/mundane arrows, piercing 12-19, crit @19-20 36-57<br/>\n<br/>\nDamage(melee)<br/>\n Handaxe, slashing 9-14, crit @20 27-42<br/>\n Handaxe, DefStance, slashing 10-15, crit @20 30-45 (w/capped STR 15-20 crit@20 45-60)<br/>\n<br/>\n Skills: 182 - Discipline 43(45), Listen 33(34), Lore 6(15), Persuade 8(6), Search 4(6), Spellcraft 18(20), Tumble 40(52)<br/>\n<br/>\n<strong>Skill Allocation</strong><br/>\n 01: Disc(4), Srch(2), S - 8<br/>\n 02: Disc(1), S - 11<br/>\n 03: Disc(1), Srch(1), S - 12<br/>\n 04: Disc(1), S - 15<br/>\n 05: Disc(1), Srch(1), S - 16<br/>\n 06: Disc(1), Pers(1), S - 17<br/>\n 07: Disc(1), S - 20<br/>\n 08: Disc(1), Pers(1), S - 21<br/>\n 09: Disc(1), S - 24<br/>\n 10: Disc(1), Pers(1), S - 25<br/>\n 11: Disc(1), Lis(14), S - 14<br/>\n 12: Disc(1), Lis(1), Pers(1), S - 14<br/>\n 13: Disc(1), Lis(1), S - 16<br/>\n 14: Disc(1), Lis(1), Pers(1), S - 16<br/>\n 15: Disc(1), Lis(1), S - 18<br/>\n 16: Disc(1), Lis(1), Pers(1), S - 18<br/>\n 17: Disc(1), S - 21<br/>\n 18: Disc(1), Pers(1), S - 22<br/>\n 19: Disc(1), S - 25<br/>\n 20: Disc(1), Lore(6), Pers(1), Spcr(1), S - 18<br/>\n 21: Lis(2), Tum(20), S - 2<br/>\n 22: Disc(1), Lis(1), Spcr(2)<br/>\n 23: Disc(1), Lis(1), Spcr(1)<br/>\n 24: Disc(1), Lis(1), Spcr(1)<br/>\n 25: Disc(1), Lis(1), S - 2<br/>\n 26: Disc(1), Lis(1), S - 4<br/>\n 27: Tum(10)<br/>\n 28: Lis(2), Spcr(1)<br/>\n 29: Spcr(2)<br/>\n 30: Spcr(2)<br/>\n 31: Spcr(2)<br/>\n 32: Disc(1), Tum(5)<br/>\n 33: Spcr(2)<br/>\n 34: Spcr(2)<br/>\n 35: Disc(2), Spcr(1)<br/>\n 36: Disc(2), Spcr(1)<br/>\n 37: Disc(1), Tum(5)<br/>\n 38: Disc(4)<br/>\n 39: Disc(1), Lis(5)<br/>\n 40: Disc(4)<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>Details</strong></span><br/>\n<br/>\n DR 12/-<br/>\n<br/>\n DefStance (handaxe only), 10x/day: +80HP (578), +4/+2/+2 F/W/R 31/24/32 (37/30/38 v spells),<br/>\n +4 dodge AC 37/34/37 (41/34/37 buffed), +1 dmg (+3 crit)<br/>\n<br/>\nBuffs/spells<br/>\n  <br/>\n HS Cat pot +2AB/AC, HS Cat spell +2AB/AC (stacks) = +4AB/AC<br/>\n Tymora's Smile: +2 universal saves<br/>\n Lliira's heart: +2 mind-affecting saves<br/>\n Deneir's eye: +2 trap saves<br/>\n Invisibility<br/>\n Sleep DC 31 vs. Will (w/DEX pre-buffs)<br/>\n<br/>\nStats when reaching +12 ability caps, fully buffed:<br/>\n<br/>\n HP(max): 738<br/>\n Saves F/W/R: 31/26/34 (43/38/46 v spells); 33/28/36 (45/40/48 v spells) w/Tymora<br/>\n AB (max, naked): 52 (mundane handaxe), 52 (mundane longbow) [53 PBS, 50-51 RS, 48-49 CS]<br/>\n AC (naked/fplate/fplate+tshield): 39/30/33<br/>\n - - Naked 10 + 18dex + 8tum + 2as + 1dodge<br/>\n - - Fplate 10 + 1dex +8tum + 2as + 1dodge + 8arm (+3 tower)<br/>\n<br/>\nVariant<br/>\n<br/>\n Substitute 2 FEs for Great DEX at Levels 21 and 39 for +2 dmg vs. FEs (possibly Undead and Elementals or Constructs).  Affects both melee and range damage at the cost of -1AB/-1AC/-1reflex.<br/>\n I prefer the higher AB to support Rapid Shot mode and Called Shot efficiency for the bow and KD attempts with the handaxe.<br/>\n For a bludgeoning switch instead of slashing, replace handaxe with mace (d6 crits x2).<br/>\n<br/>\nNotes and Recommendations<br/>\n<br/>\n It's best to choose a damage type other than piercing for your focused melee weapon.  Slashing weapons can be buffed with Keen Edge by sympathetic arcanists.  Bludgeoning weapons will fare slightly better against skels and other piercing-resistance creatures.<br/>\n<br/>\n This build performs best by equipping bow/robes or robes/tower with finessed handaxe.  However, should an exceptional piece of heavy plate be found, the AC drop-off is not so severe to restrict gearing to only a light set-up.  STR 14 (116 lbs) is adequate to support heavy plate/tower (90 lbs), when needed.  Strive to equip enough ability gear to reach at least STR 20 in anticipation of mighty bows appearing.  Defensive Stance can help reach the STR cap (w/+2) for the melee switch.  Collect Bull pots to help make up the difference.   <br/>\n<br/>\n Harper's Cat Grace pots cost 5 XP and 60 gold each to craft.  For other caster classes to brew a +DEX potion costs 60 XP and 1500 gold so the Harper version is a real bargain though the caster level is much lower than the brewed version.  Eagle pots can also be crafted but will only benefit CHA-based skills (like Taunt) or for interactions with NPCs.  There is a limit of crafting one potion per day, however, so make it a daily ritual unless pots are readily sold for a reasonable price.<br/>\n<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:46 AM - Oct 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like it, well done!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:21 PM - Oct 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Let me get my head around this...<br/>\n<br/>\n Hip constructs a build with no UMD, no trapping and minimal buffing...are you sure you're not using an alias? <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n Seriously, Wulgar looks great - and fits beautifully in my \"needs to be palyable at all levels\" credo. Alertness is a feat I seldom see taken and is a great call here. Imaginatively constructed to get the best from the concept, and another build I'll be taking for a run around some time - thanks, Hip!<br/>\n<br/>\n Cheers<br/>\n<br/>\n<strong><em>EDIT</em></strong>: A couple of things I should have mentioned: I like the back-story - it's good to put flesh on the bones. And kewl name as well!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:23 PM - Oct 29, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the support guys!<br/>\n<br/>\n As for choosing<em> Alertness</em> to follow the path-less-trod, Stagmeister... well... it's a prereq for HS (as is <em>Iron Will</em>) else that slot would have surely been used for either IKD or ImpCrit: Handaxe.  But yes, it does help with the stealth detection in a skill-starved situation so not an entirely frivolous investment.<br/>\n<br/>\n For our LAN parties, a back story is absolutely essential since much of the fun is the tête-à-tête that goes on between members as part of the general esprit de corps.  Glad you enjoyed the glimpse ;)<br/>\n<br/>\n Wulgar just happens to be the product of some extracurricular meanderings of his mother, a well-guarded secret among the family.  Fortunately, his father holds no resentment because his \"son\" is about as dedicated an heir as could be desired and was the only one to take up the mantle of the craft Wuldan wanted to pass on as part of the blood legacy.  The other two brothers abandoned the homestead when the lure of riches became too great.  Neither had a great affection for the woodland life or the never-ending protection of the lands south of the Kharak either.  At this juncture in the story, Wulgar is planning a visit southward to briefly reunite with his brothers and, potentially, find his mother and perhaps a mate of his own that might appreciate the austere and dangerous surroundings of the homestead.  But that is a lot of \"ifs\".<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:40 PM - Oct 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Congratulations Hip! This is indeed a neat build.<br/>\n<br/>\n Using dwarf to be able to take DwD for DR 12/- in an archer so it can handle PBS is creative.<br/>\n This one also handles melee really well and can fill the role as a melee-based tank.<br/>\n The AB is high for both ranged and melee.<br/>\n The AC is good and you have the stance.<br/>\n The saves are fine.<br/>\n And this dexer has the dwarven super version of uncanny dodge, namely defensive awareness!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:31 PM - Dec 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Right then. Having just buggered up my first attemped HS build, then, after a re-imagining, found I'd virtually replicated Valerfor's Halberdier, except worse; now is the time to take Wulgar away from his dad (Hip, not Wuldan) and see if I can break him - sorry, have him work for me as well.<br/>\n<br/>\n Haven't played an archer-type before, nor one of Hip's builds (my fault - normally too much mucking around with traps and buffs for a grunt like me <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:51 PM - Dec 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>\n Haven't played an archer-type before, nor one of Hip's builds (my fault - normally too much mucking around with traps and buffs for a grunt like me <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Reading about a Wulgar clone in the Aielund thread would be mucho kewl!  My own Aielund adventuring is still in its infancy so welcome all insight into what works and what doesn't.<br/>\n<br/>\n What will be next, Stagmeister?  A spellcaster venturing through the campaign?  You have so many stones left unturned.  I am envious.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:34 PM - Dec 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n  </div></blockquote>\n<div align=\"left\">Well, I'm also still trotting round with Mick's Kama Shinobi in Aielund, but felt a need to have a non evil build going as well (I was beginning to enjoy all the villainy too much). Spellcaster is bottom of my list, I'm afraid (still something of a magic Luddite), but, who knows...<br/>\n<br/>\n As it is, I've just passed my second anniversary of playing NwN, so still have much learning to come. I see from another thread that it took you a couple of years to master vanilla, so I'm a little behind, but I have good tutors.<br/>\n<br/>\n Oh, and please forgive me if I tweak for environmental puposes, and I'll try posting a screenshot or two as well - as evidence, if nothing else!<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Arse. My quote management remains crappy. Sorry.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:08 AM - Dec 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sorry, have a build question already. I understand what you say about Imp Crit: Handaxe, but would it not be worth dropping KD for it? My rationale for the question is that Called Shot will also work for melee weapons (either slowing or hampering foes' attacks) and has, effectively, the same attack penalty as KD. Admittedly, not as useful against mages, but if I'm tanking with Wulgar when mages are hovering behind the mob, maybe I wouldn't be using him right (and, of course, if I am using his archery skills against said mages, KD is the last thing I'd want). Or am I missing something?<br/>\n<br/>\n And I promise it's not just me being anti-KD - it's a genuine question!<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:30 AM - Dec 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Called Shots won't help against casters.  The problem using it in melee is that you will be subject to a counter attack on every attempt.  It's a whole lot trickier than a hit-or-miss KD that lays them prone for a round.  All arm shots do is raise your AC by 2 on each success.  It won't help you hit them any easier like KD does.<br/>\n<br/>\n The reason KD was inserted where it is?  Because until you get EWS: LB 10 levels later, your ranged damage will most likely never break concentration.  It was postponed as far into pre-epic as possible since most other feats had greater impact. <br/>\n<br/>\n If you can survive against mages until Level 30, then sure, pick the feat you prefer.  If you notice, I've been very consistent about developing both weapon foci/specialities in unison.  That was intentional.  Wulgar is also good for pure melee players used to higher damage weapons than bows, who would like a taste of some serious bowmanship either from artillery range or close encounters. They can pick up the bow for practice in their leisure and not fret much about the loss of a shield's AC. <br/>\n<br/>\n TBH, Wulgar very seldom uses his axe for more than chopping kindling or mage necks when I play him so the damage becomes secondary. Just whack 'em down an step on their face. With all his DR, he can stand there without a shield firing in PBS mode without much anxiety at all when it comes to handling flankers.<br/>\n<br/>\n BTW, if you get in the habit of allowing mages to \"hover\", you are asking for trouble. It's always better to rush them with your axe, hasted if possible, and let their minions pelt you with blows. Always strike at the greatest threat first or you will provide them with the one element they relish... TIME!  Once you get that extra damage from EWS, it's more likely you'll be able to interrupt their plans, but even then, don't count on it. This is not an AA who specializes in ruining mages' lives.<br/>\n<br/>\n Oh, one other tip:  if you finally reach your mage target and find you've provided enough time for those nasty damage shields to fly up in full glory, pull out the bow and begin plunking away at PBS distance.  You'll get no recipro damage and the melee range tends to make NPC mage AI confused and PC mages a bit nervous.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:40 PM - Dec 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Asked and answered - very helpful, Hip, thanks.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}