{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "177",
  "name": "Cleric/Monk/",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/cleric-monk-t2354508.html",
  "author": "DoctorVic",
  "avatar": "no_avatar.png",
  "replies": "11",
  "views": "708",
  "posts": [
    {
      "author": "DoctorVic",
      "avatar": "no_avatar.png",
      "timestamp": "4:04 PM - Mar 07, 2016",
      "content": "<div>Looking to build a Cleric Monk, Level 21. Sounds Utilizing the spells Undeath to Death and Implosion. Race: I'd Prefer Human because of the Two Feats, But if you've got a better Suggestion Express it. </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:18 PM - Mar 07, 2016",
      "content": "<div>Hi Doctor Vic, and welcome!<br/>\n<br/>\n Alas, your first reply is from a relative newbie, but I'm fairly certain that the great and good will be looking for some more info from you - such as the environment in which you'll be playing - Persistent World (and if so, which one) or single player; what's allowed and what isn't (skill dumps, etc); what sort of character you're looking for (eg, quick and agile or strong and sturdy); and so on.<br/>\n<br/>\n Perhaps not what you were hoping for as a first response, but I know the builders here will want to create the best possible build for you, and that means they'll need as much detail as they can (you can't have a bespoke suit without taking measurements) from you.<br/>\n<br/>\n Cheers, and welcome once again!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "DoctorVic",
      "avatar": "no_avatar.png",
      "timestamp": "5:23 PM - Mar 07, 2016",
      "content": "<div>The Server i'm Running on Contins Mid-High level Magic. Overwhelming Critical is Not Allowed on our Server. I'm Looking for a Cleric with Monk Cheese, But with Cleric Buffs. Skill Dumps i think can go into Wisdom for the AC.</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:32 PM - Mar 07, 2016",
      "content": "<div><blockquote><div><strong>DoctorVic wrote:</strong><hr/>Looking to build a Cleric Monk, Level 21. Sounds Utilizing the spells Undeath to Death and Implosion. Race: I'd Prefer Human because of the Two Feats, But if you've got a better Suggestion Express it. <br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Welcome to the new, shiny ECB!  We are glad you found us home.<br/>\n<br/>\n I recommend highly that you read Kail's Build Request Guidelines that was not written to present a roadblock for the requestor but to eliminate worthless recommendations (and waste of time on both sides).  Normally I would also suggest downloading and installing the replacement for the legacy ECB archive Search utility, but this request does not appear to be for an epic build (Level 40).<br/>\n Still, you may find an occasion to find them useful.  The two links are (if you haven't noticed them yet):<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515448/Build-request-guidelines\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#FF0000\"><strong>Build Request Guidelines</strong></span></a><br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354480/How-and-Where-to-Access-Legacy-ECB-Archives\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#FF0000\"><strong>How and Where to Access Legacy ECB Archives</strong></span></a><br/>\n<br/>\n Actually, a human gets one extra feat and one extra skill point per level but you are close in your assessment of the race bias.<br/>\n The basic theory of this combo is that Monk 6 has the most value for class investment.  Cleric 17 is needed for level 9 spells.  WIS 19 is needed for level 9 spells. <br/>\n That means the highest monk level obtainable (and still cast level 9 spells) is 4.  Monk 3 is needed for the speed boost and +2 mind spell saves.  Monk 4 is optional and provides no additional monk bonus. Cleric 18/Monk 3 will give a bit more slots, spell penetration and resistance to dispelling, BAB 14.  Cleric 17/Monk 4 will increase BAB by 1 settling on 15.  Beyond that...<br/>\n<br/>\n What you need to decide is a few things first:<br/>\n<br/>\n 1) How often would you like to take advantage of the Tumble dump and the extra monk skill points?  4 times max is possible.  Each dump would add +1 AC that stacks with all other sources.<br/>\n 2) What weapon are you planning to use and will it take advantage of the monk progression?  That means unarmed or kama.  Any other weapon uses the -5 BAB progression.<br/>\n 3) Only a robed (or naked) monk w/o shield will benefit from the WIS AC, the monk AC and the monk speed.  It also means pumping DEX rather than STR makes more sense. Is this what you were planning?<br/>\n 4) By \"utilizing\" those two spells do you merely mean \"accessing\" them via Cleric 17+ or \"focusing\" on them via Spell Focus: Evocation and Spell Focus: Necromancy?<br/>\n 5) Your base skill set should include Discipline, Spellcraft and Tumble.  Perhaps Concentration is also a good idea to help mimimize spell interruption while being flanked or targeted by archers.<br/>\n Your skill requirements will determine the INT level needed to achieve that set.  Any other skills you were planning on accessing/needing?<br/>\n<br/>\n Answering these questions and those from the Request template (above) should define your request well enough to recommend a productive build strategy.</div></div>"
    },
    {
      "author": "DoctorVic",
      "avatar": "no_avatar.png",
      "timestamp": "5:48 PM - Mar 07, 2016",
      "content": "<div><span style=\"color:#4C5D77\">1) PvM or PvP - PvP and PvM</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">2) Level cap - Max Cap is 40</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">3) Race preference - Human</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">4) Class preference -Cleric for the Buffs and Wsdom and Monk for the Cheese and Increase of Wisdom to AC</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">5) Melee preference -Dual Weild Kamas</span><br/>\n<span style=\"color:#4C5D77\">6) Range preference - DEX archery or Zen Archery (WIS)</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">7) Weapon preference - Kama</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">8) Maximum item enhancement -Max Enchant is +7</span><br/>\n<span style=\"color:#4C5D77\">9) Spellcasting - Buff and Cast Offensive spells</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">10) Custom factors - Overwhelming Critical is out of the Question. No other Restrictions</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">A few examples of custom requirements might be:</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">Legal classes - some classes are prohibited on certain servers so list them all in your request.</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">Leveling constraints - some times a server will require that you take a minimum number of one class before you multiclass to another. This will drastically alter a standard build progression.</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">Feats - some feats have been modified significantly by servers which may render them less effective than the standard version</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">Spells - same issue as feats. Sometimes the effects and/or durations will be changed dramatically and this will impact the build.</span><br/>\n<br/>\n<span style=\"color:#4C5D77\">items -</span></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:19 PM - Mar 07, 2016",
      "content": "<div>OK, so we can make a level 40 build for you, but it needs to be strong at level 21? At level 40, how about Cleric 29 / Monk 11? With 11 levels of Monk, you get more Monk speed, immunity to disease and poison, Knockdown and Improved Knockdown, and +2 AC, and also more Tumble skill dumps. With 29 levels of Cleric, you get 3 Cleric bonus feats. Armor Skin is a Cleric feat, but Epic Prowess isn't.<br/>\n<br/>\n I'm sure that Hip will come by later with more detailed recommendations.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "DoctorVic",
      "avatar": "no_avatar.png",
      "timestamp": "8:06 PM - Mar 07, 2016",
      "content": "<div>Sounds Amazing</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:31 PM - Mar 07, 2016",
      "content": "<div>I wanted to piece together an Epic Dodge battle priest version since high-cleric is so blasted feat-starved.  Max did one (Shadow Priest) on the legacy ECB that did just that, but not a dual-wield.  So my work is cut out for me. No plagiarizing for me! *boo*  The problem with going one-handed is that all the monk bonuses are neutralized with a shield.  Between the monk AC, DEX AC and WIS AC this toon will have way more AC than any hvy plate/tower combo, especially after ability buffs. <br/>\n<br/>\n It's a HiPS-er like his (since you didn't indicate any HiPS nerf in your request), therefore no XP penalty to concern with.  But there is one feat choice to make that, TBH, I don't have the time to analyze statistically to determine what is theoretically better.  An ED mnk/clc could be made with rogue, but not without XP penalty along the way.<br/>\n<br/>\n Overview is:<br/>\n Cleric(23), Monk(12), Shadowdancer(5), Lawful Human (Pre-epic mnk8/clc12)<br/>\n<br/>\n STR 10, DEX 16(26), CON 12, WIS 16(20), INT 12, CHA 8<br/>\n Pre-epic: all bumps to DEX, Epic: WIS, DEX x3, WIS<br/>\n<br/>\n Feats: Pre-epic - Ambidexterity, Blind Fight, Finesse, WF, TWF, Dodge, IC (or ITWF, that's the decision), Mobility  (note: neither finesse nor wf can be taken until level 2 with 3/4 BAB classes)<br/>\n           Epic: Grt WIS, Grt DEX x2, Grt WIS, Epic Dodge (Lvl 33), EWF, Prowess, Armor Skin<br/>\n          [Zen archery would be redundant in this build]<br/>\n<br/>\n Domains:  Really doesn't matter that much but be sure to include one domain that provides Cat's Grace.  <em>Strength</em> is a handy domain to open up more DP slots.<br/>\n<br/>\n Skills: Discipline 43(43), Hide 43(51), Move Silently 43(51), Spellcraft 42(43), Tumble 40(48) ---&gt; 11 left over<br/>\n<br/>\n Using the Level 5 spell, a Clc 23 can reach SR 35 so why go to Mnk 12?  Because the monk SR 22 cannot be breached or dispelled.  Look at it as an insurance policy.<br/>\n Decide which has more value at Level 15, Improved critical or ITWF.  ITWF is probably better vs crit immunes like undead but ImpCrit better vs all other races.  Your insane monk APR will make the benefit of an add'l APR even less proportionately for monk progression and, incidentally, the extra attack from ITWF is at -5 BAB, not -3 (which is why I value it so little with a dual-kama monk).  With flurried attacks you will miss ITWF even less.<br/>\n<br/>\n Other benefits of Clc 23 is near-immunity to dispels (Clc 24 is immune all dispels except Mords) and good penetration without needing extra feats.  Empowered abilities would have been very handy but unfortunately, metaspelling is not possible in this build, not without sacrificing AB/AC and using epic feats to do it.  You shouldn't be needing Extended spells with this many clc levels.<br/>\n<br/>\n Native AB develops more slowly here than typical builds to get ED ASAP.  However, Cleric buffs will more than compensate for the temporary lack.<br/>\n<br/>\n HiPS not available until epic.  Could swap out 4 levels of pre-epic Monk for 4 of SD but IMO monk 6 is more useful than HiPS in pre-epic, especially until the stealth skills become elevated a bit more and monk levels have discipline dumps.<br/>\n<br/>\n Skill-wise, the ability spread only warrants what I've listed.  To max Concentration as well, either one of the current skills will need to be sacrificed (not recommended) or the abilities split up to get to INT 14 (also not recommended because it slows progress even further).<br/>\n<br/>\n If not an ED build, then consider a mnk/clc/CoT which will open more feats and the sweet CoT Great WIS bonus feats.  In either case, a robed monk cleric will get more value from a Dex build than one focused on STR.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:11 PM - Mar 07, 2016",
      "content": "<div>With only 23 caster levels and 20 WIS, how effective would your build be at casting offensively, like DoctorVic wants to?</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "DoctorVic",
      "avatar": "no_avatar.png",
      "timestamp": "12:29 AM - Mar 08, 2016",
      "content": "<div>Whats the Level Split for your build there Hip?</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:50 AM - Mar 08, 2016",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong><hr/>With only 23 caster levels and 20 WIS, how effective would your build be at casting offensively, like DoctorVic wants to?</div></blockquote>\n<div align=\"left\">I'm guessing... better than usual with the ability to toggle stealth during combat to avoid AoOs and even avoid archer threats better.  Depending on what you mean by \"effective\".  If \"likely to damage with spells\"  probably the same as a high-level cleric on this server.  If \"chance to avoid AoOs and spell interruption\", better than any non-HiPS build.<br/>\n<br/>\n If I were not going the melee self-buffer route (which apparently was designed to be the primary attack of this requestor), then take the minimum 1-2 monk levels to grab the AC benefits, the spell focus and epic spell focus for the two schools he seems enamored with, max Concentration and use a relatively pure caster build with pumped WIS.  CoT levels would boost both the intrinsically-poor saves and provide more opportunities to elevate WIS even if melee prowess was not all that important. <br/>\n<br/>\n However, vs custom spell resistant skins &amp; spell immunes, the spell repertoire (outside of combat buffs) won't help anyway.  I'm guessing the described +7 environment will not provide much successful offensive casting opportunities at any caster level.  Clc 23 will penetrate SR in the 24-43 range with average resistance check approx 33.  Should be enough vs anything but a custom SR (bosses) or immunes.<br/>\n<br/>\n Elevating WIS beyond 20-ish means this is no longer a melee build since only ranged attacks will benefit from the WIS AB of Zen.  Going STR will always be lagging due to the initial DEX investment for dual-wielding plus the loss of signficant DEX AC.<br/>\n<br/>\n I'm assuming PvM without any further information on what combo he expects to duel.  Undeath to Death is not a PvP spell and Implosion too easily saved against in high magic high Fort PvP.  A PvP toon would be an entirely different beast to design.</div></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:52 AM - Mar 08, 2016",
      "content": "<div><blockquote><div><strong>DoctorVic wrote:</strong><hr/>Whats the Level Split for your build there Hip?</div></blockquote>\n<div align=\"left\">I am guessing you mean \"Level-up sequence\" and was hoping you would join in the design process by hashing out a fully-fledged sequence yourself since I've furnished such a complete framework already. <br/>\n<br/>\n It's best if new designers take an active part early so they are in a good position to make minor tweaks themselves \"on the fly\" as the custom features (encounters, item props and availability, etc.) of the environment become gradually evident.  Your list doesn't need to be fancy, use abbreviations as you like... we've seen them all.  If nothing else, it will show participants your level of understanding of the basics so we know what needs to be explained in more detail as we make recommendations.  As far as skills go, only Tumble levels are prereq for ED so you need not be too concerned about skill allocations in first draft.  Anyway...<br/>\n<br/>\n Pre-epic leveling is straightforward. Start with a few monk levels to qualify for WF &amp; Finesse then alternate with cleric however seems most beneficial to you.  Max always liked to go straight cleric but I prefer to gradually access the monk feats at regular intervals.  Either way works fine. Fill in the feats the way it makes most sense to you. Like I said, I postponed HiPS until epic (which just happens to be Level 21) and the rest basically just cleric levels peppered with regular monk and SD tumble dumps.  There are enough boosts to WIS either by ability bump or by feat to assure that each new spell level will have adequate ability level to cast spells.  If you notice the final Discipline level (43) you can immediately infer, w/STR 10, that the build ends on a monk level, since Disc is only a class skill for monk.<br/>\n<br/>\n I am not being intentionally evasive but do have a method to my madness.</div></div>"
    }
  ]
}