{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "247",
  "name": "Code Name - Stingray: (Bard 9/ RDD 10/ Assassin 21)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/code-name-stingray-bard-9-rdd-10-assassin-21-t2354390.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": "7",
  "views": "3.0K",
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:57 AM - Feb 28, 2015",
      "content": "<div>Some times i wonder myself, \" is there anything the RDD's can't do \" and for once more they proved me wrong. This is an Assassin that in his veins runs Black Dragon Blood and he is greatly enhanced by it. I designed him first as a highly skilled agent/ negotiator of sort, and he can do this job with admiring efficiency due to his three hundrend skill points and multiple talents, but at the end, if the negotiations fail he can resort to more...drastic measures. True to my style, this Assassin of sort is Strength-based and although he has a decent enough DC for his Death Attack he frankly doesn't give two coppers if it will work, simply because he is designed to deliver staggering strikes to his enemies with-or-without it. You can change his weapon to suit your style but when i have so much power under the bonnet, so to say, i find the dreadful Scythe to be the most efficient weapon for him. The usual of an RDD very good defences exist here as well and i have taken Expertise as another layer of protection along with Heavy Armour. If he has some weak points, that would be his saving throws, but against spells they are quite good indeed thankfully to his high Spellcraft skill. There is one other build with the same classes in the old ecb, by <em><strong>Nimueh Leafbow</strong></em> called \"<em><strong>Black Claw Executioner</strong></em>\" but with a massive 6 AB difference against mine, is on another league already, although he does attain Dev. Critical.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i1375.photobucket.com/albums/ag474/valerfor/BHAAL_zpscwkergll.png\"/><br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>THE STINGRAY</strong></span><br/>\n<br/>\nRACE: Human<br/>\nALIGNMENT: Neutral Evil<br/>\nPLAYABILITY: PvM 1 – 40<br/>\n<br/>\nSTARTING/ ENDING STATS:<br/>\nSTR -  18 (<strong>40</strong>)<br/>\nDEX -  08<br/>\nCON - 12 (<strong>14</strong>)<br/>\nINT -   14 (<strong>16</strong>)<br/>\nWIS -  08<br/>\nCHA - 12 (<strong>14</strong>)<br/>\n<br/>\nHit Points: <strong>388 </strong>{<strong>396</strong>}<br/>\n<br/>\nSkill Points: <strong>300</strong> <br/>\n<br/>\nDiscipline: 43 (58)<br/>\nHide: 43 (52)<br/>\nMove Silently: 43 (52)<br/>\nPerform: 13 (15)<br/>\nLore: 8 (20)<br/>\nSet Trap: 14 (15)<br/>\nDisable Trap: 10 (15)<br/>\nOpen Locks: 6 (5)<br/>\nSearch: 10 (13)<br/>\nSpellcraft: 42 (45)<br/>\nTumble: 40 (39)<br/>\nUMD: 28 (30)<br/>\n<br/>\nSaving Throws (Fort/Ref/Will): 21/ 21/ 22 → 30/ 30/ 31 (saves Vs spells)<br/>\n<br/>\nNaked/ Armoured AC: 23/ 34 (Plate and Shield, 36 with Cat's Grace)<br/>\n<br/>\n<br/>\nBAB: 25 (Three Attacks/ Four Attacks w/ Haste)<br/>\n<br/>\nAB: +44/ +39/ +34 (Scythe) → {+2AB from Bard Song}<br/>\n<br/>\nDMG: 2d4 +22/ 19-20 x4 (Scythe) → {Dual-Dmg Type}<br/>\n<br/>\n<br/>\nSpellcasting: Bard 3rd level of spells plus UMD and Assassin special abilities <br/>\n<br/>\nBard Song 9/Day: +2 Attack/ +2 Dmg/ +1 all saves/ +8 Hp's/ +1 all skills<br/>\n<br/>\nImmune to Fire, Paralysis, Sleep effects, Darkvision, Dragon Breath <br/>\n<br/>\nDeath Attack DC: 34 (40) → Paralyse for 21 min <br/>\n<br/>\nSneak Attack: 11d6 &amp; Improved Knockdown<br/>\n<br/>\n<strong><span style=\"font-size:100%;line-height:normal\">LEVELING GUIDE</span></strong>:<br/>\n01) Bard (01): Knockdown, Expertise<br/>\n02) Bard (02):<br/>\n03) Bard (03): Exotic Weapons<br/>\n04) Bard (04):<br/>\n05) Bard (05): {Lore, Hide, Move Silently, all 8 ranks}<br/>\n06) Red Dragon Disciple (01): WF: Scythe<br/>\n07) Red Dragon Disciple (02):<br/>\n08) Red Dragon Disciple (03):<br/>\n09) Red Dragon Disciple (04): Blind Fight<br/>\n10) Red Dragon Disciple (05):<br/>\n11) Red Dragon Disciple (06):<br/>\n12) Red Dragon Disciple (07): Heavy Armour<br/>\n13) Red Dragon Disciple (08):<br/>\n14) Assassin (01):<br/>\n15) Assassin (02): Improved Knockdown<br/>\n16) Assassin (03):<br/>\n17) Assassin (04):<br/>\n18) Bard (06): Improved Critical: Scythe<br/>\n19) Bard (07):<br/>\n20) Bard (08):<br/>\n21) Red Dragon Disciple (09): EWF: Scythe<br/>\n22) Red Dragon Disciple (10):<br/>\n23) Assassin (05):<br/>\n24) Assassin (06): Armour Skin<br/>\n25) Assassin (07):<br/>\n26) Assassin (08):<br/>\n27) Assassin (09): Epic Prowess<br/>\n28) Assassin (10):<br/>\n29) Assassin (11):<br/>\n30) Assassin (12): Great Strength [1]<br/>\n31) Assassin (13):<br/>\n32) Assassin (14): ESF: Move Silently<br/>\n33) Assassin (15): Great Strength [2]<br/>\n34) Assassin (16):<br/>\n35) Assassin (17):<br/>\n36) Assassin (18): ESF: Hide, Great Strength [3]<br/>\n37) Assassin (19):<br/>\n38) Assassin (20):<br/>\n39) Assassin (21): Great Strength [4]<br/>\n40) Bard (09):<br/>\n<details><summary>Spoiler</summary>01: Discipline(4), Hide(4), Lore(4), Move Silently(4), Perform(2), Tumble(4), Save(6), \n03: Discipline(1), Hide(1), Lore(1), Move Silently(1), Perform(1), Tumble(1), Save(6), \n05: Discipline(1), Hide(1), Lore(1), Move Silently(1), Perform(1), Tumble(1), Save(8), \n07: Discipline(1), Save(16), \n09: Discipline(1), Save(24), \n11: Discipline(1), Save(32), \n13: Discipline(1), Save(40), \n15: Disable Trap(5), Hide(1), Move Silently(1), \n17: Hide(1), Move Silently(1), Tumble(5), Save(3), \n19: Discipline(1), Hide(1), Move Silently(1), Save(4), \n21: Discipline(1), Save(10), \n23: Disable Trap(4), Hide(3), Move Silently(3), Set Trap(7), Tumble(5), Save(1), \n25: Hide(1), Move Silently(1), UMD(10), \n27: Hide(1), Move Silently(1), Tumble(5), Save(2), \n29: Hide(1), Move Silently(1), UMD(5), Save(4), \n31: Hide(1), Move Silently(1), Save(16), \n33: Hide(1), Move Silently(1), Save(23), \n35: Hide(1), Move Silently(1), Save(35), \n37: Hide(1), Move Silently(1), Tumble(5), Save(42), \n39: Hide(1), Move Silently(1), Save(54), \n</details>\nEdit by Mick Dagger: Skills schedule added</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:21 AM - Feb 28, 2015",
      "content": "<div>This is a fine strength based assassin build that takes advantage of the RDD boni, and has warrior AB with only 3/4 BAB classes. The mundane AC when wielding a scythe (no shield) is 31, and reaches 33 once you buff your dex to 12, and that is strong for a 2-hander build, especially so when you can add expertise. The saves are average, except the will save that is better than most fighter types. A high spellcraft clearly helps against mages, and UMD helps against \"everything\".<br/>\n<br/>\n I still want to suggest some tweaks. The first is to take blind fight and expertise in the opposite order. You can meet hard hitting foes during your first levels, but seldom concealed or invisible ones, and you \"never\" get blinded.<br/>\n I would have done the skills slightly differently as well. I would add 3 points to UMD to secure 100% success with level 9 scrolls, unless bard can read all arcane scrolls where you play. You have a very good stealth for a strength build. I would have added spot, just to make sure I know who to attack first when I break cover. I would take the points from the lock and trap skills.<br/>\n<br/>\n You admit that you don't play much on the death attack with this assassin. A DC of 34 is by no means bad, but a focused assasin build is closer to 40, and your weapon style only gives 3 attacks per round with a maximum of 2 attacks (with haste) in the opening flurry when you attack flat-footed creatures from stealth. You answer that well with a strong melee presence. That makes me wonder if this character could have done just as well, or even better with a Ba 21/ RDD 10/ As 9 split for LI and still retaining the II from assassin. Or alternatively dropping assassin altogether for rogue. I know that is more than a tweak, but I ask since this is a new character concept.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:06 PM - Feb 28, 2015",
      "content": "<div>Hey Val!!<br/>\n<br/>\n Interesting concept you have here, a non-DA-reliant Assassin build. As mick says, though, you won't paralyze many enemies because unless hasted, you will only have 1 attack in the first flurry. One chance to paralyze, albeit with a high-ish DC, is not as good as 3 from a typical dual-wielder. So, if I may suggest a couple of tweaks, I'd advise you to do the following:<br/>\n<br/>\n 1- As Mick has already said, Expertise and Blind Fight should be swapped. I think this is a no-brainer.<br/>\n 2- Get rid of Heavy Armor proficiency for Extend Spell. You'll need your buffs to last longer, and wth it you can equip this guy with an Elven Chainmail and not have to worry about spell failure when rebuffing, since he doesn't do shields.<br/>\n 3- Drop 2 Assassin levels for 2 Bard to gain access to another source of Improved Invisibility. You lose 1 DA d6 of damage and 2 DA DC, you gain a few more spellcraft dumps during the build and level 4 Bard spells.<br/>\n 4- I would also consider dropping STR to 16 and raising CON for more HP (put the remaining points in CHA). This is a two-hander melee build with low AC, so it needs to withstand damage, and Bard and Assassin are both d6 hit die classes, which save for mages are the crappiest HPs you can get. Even RDD starts at d6. Besides, AB wil hardly be a problem for you, much less damage.<br/>\n<br/>\n As for the rest, there is another thing that I am torn about suggesting because of this guy's Scythe focus and low Bard levels. Let me throw it out here and let you decide. You could consider dropping Spellcraft for Taunt. Your saves are bad, and I'm not sure how much the Spellcraft skill points will help you succeed on saves. If you're facing a dedicated caster, IMO you'll still fail, and if you're not, then you'll probably not have to roll a save. On the other hand, your AC is not high enough to allow you to stand in front of the enemy with expertise, so you'd need to swap to a sword / board configuration, Taunt in Expertise and then go back to the Scythe, and this would also consume duration of your already low duration buffs, so I reckon that in this build the combo wouldn't be as useful as in others. On the flipside, you'd get +6 AB on a successful Taunt, which is no small bonus, and the possibility to fight in Expertise \"for free\" if you're getting hit too often.<br/>\n<br/>\n I like the idea of a Brute Assassin, though!<br/>\n<br/>\n Take it EZ!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:35 AM - Mar 01, 2015",
      "content": "<div>Thanks for the input guys,<br/>\n<br/>\n @ Mick,<br/>\n<br/>\n Solid suggestion about the swapping of the feats, i will edit the build to reflect that change. Bards are able to use all Arcane Scrolls without failure so, there is no need for the skill change. Nice suggestion about the lasting inspiration tweak, and you know that everywhere that i can, i do take that feat, but like yourself i came upon the same conclusion, this wasn't an Assassin anymore with a DC 22 for his Death Attack, so i decided against it. I also considered briefly the change of the split to (Bard 6/ Rdd 10/ Ass 24) but that lowered my AB by 1 point, and one of the priorities i had for this build was to have as higher an AB as i could. Still though, this is a nice alternative especially if you consider that the addition of 3 points to the Death Attack DC brought him close to the territory of the really dangerous Assassins. I actually would like to hear your opinion (and Max's as well) about that.<br/>\n<br/>\n @ Max,<br/>\n<br/>\n You have an interesting point there about Taunt, but i feel that the loss of a universal (+9 to all of my saves Vs spells) is too heavy for it. Also this build does not have low AC as you said, it is the opposite in fact, as it is a full plate Assassin, with full tumble, dragonic armour, and expertise on top of those. If nothing else he is very well protected (and he has umd as well) so that he can use a two-handed weapon for savage strikes. If however the AC is still a problem in some servers, you can always change that to a (dwarven waraxe and heavy shield) set-up. I do maintain that the Scythe is a better solution though.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:09 PM - Mar 02, 2015",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>@ Mick,<br/>\n Nice suggestion about the lasting inspiration tweak, and you know that everywhere that i can, i do take that feat, but like yourself i came upon the same conclusion, this wasn't an Assassin anymore with a DC 22 for his Death Attack, so i decided against it. I also considered briefly the change of the split to (Bard 6/ Rdd 10/ Ass 24) but that lowered my AB by 1 point, and one of the priorities i had for this build was to have as higher an AB as i could. Still though, this is a nice alternative especially if you consider that the addition of 3 points to the Death Attack DC brought him close to the territory of the really dangerous Assassins. I actually would like to hear your opinion (and Max's as well) about that.</div></blockquote>\n<div align=\"left\">The ideal situation for a death attack is to initiate an attack from stealth when your victim is flat-footed. You want as many attacks per round as possible to get more attacks in the first flurry when you initiate the attack, because you attack with all those attacks in the first flurry simultaneously. You also want a high DC so it becomes hard to save vs paralysis.<br/>\n Your build has stealth and can attack \"from the shadows\". With a scythe you get 3 attacks per round, giving 1 attack in the first flurry. You can improve that with haste or with a divine power scroll so you get 2 attacks in the first flurry, and that doubles the damage and the chance of paralysing the target.<br/>\n A DC of 34 is OK against rogues and mages with low fort saves. A lvl 40 wizard or rogue with con 10 has a fort save bonus of 16 and will roll saves between 17 and 36.  That character will need an 18 roll to beat the DC. A fighter with con 16 will have a fort save bonus of 25 and will roll saves between 26 and 45. That fighter will beat the DC with a roll of 9. The same fighter with 10 CoT levels can have a fort save bonus of 32 and will make the save unless he rolls a 1.<br/>\n But the DC is only half of the death attack. You still get the damage bonus of 11d6 when you hit a flat-footed, prone or flanked creature.<br/>\n Assassin is also more than the death attack. One important feature is the spell like abilities, especially the improved invisibility spell. You get it at assassin level 9, and even then it is better than the spell you can cast from scrolls.  On the other hand, a high level bard casting improved invisibility is better than a low level improved invisibility from assassin.<br/>\n<br/>\n It makes sense to use assassin in your build. The build has the benefit of a lvl 21 assassin improved invisibility and has a death attack DC that will be sufficient against low fortitude characters.<br/>\n One may always ask when it becomes better to take rogue over assassin. If you choose rogue for your current build, you will be stuck with a low level easily dispellable improved invisibility from scrolls. You will not be able to paralyze your enemies. But rogue gets more skillpoints, evasion and more bonus feats. And you can take rogue levels whenever you want to.<br/>\n If you want to play your character like a brawler/flanker with knockdown as a main trick, then rogue may be better for you. The reasons to take rogue get stronger the more bard levels you take, as a consequence of the strengthening of the bard spells, the weakening of the assassin spell like abilities and the dwindling death attack DC.</div></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:50 PM - Mar 02, 2015",
      "content": "<div>Nice analysis Mick, although you evaded the question per se ;-)<br/>\n<br/>\n But i know why, it is hardly possible to lean on one side or the other. One might say the AB is already high and the loss of 1 point wouldn't hurt much if it were to gain 3 DC on Death Attack, but the other side of the coin is that the higher the AB the easier it becomes for the IKD Alpha strikes to leave your foes permanently to the ground till they die a quick death and the easier it is to confirm those dreadful criticals of the Scythe. So i will leave this as is, and one might alter it to his/her tastes depending on the environment. As far as Rogue is concerned i would incorporate it into the build if i was going for at least 16 Levels of Bard, much like yourself, we are in agreement here once more. Perhaps i would take 17 Levels of Bard and 13 Levels of Rogue in order to gain Improved Evasion and Crippling Strike and stop there and that would be a fair alternative, although still not an Assassiin.<br/>\n<br/>\n Thank you for your input,</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:30 PM - Apr 14, 2015",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>Nice analysis Mick, although you evaded the question per se ;-)<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">OK, to answer your question: Here is one way of building it with 3 more assassin levels, just for comparison. One could even have taken 4 more assassin levels if not for the discipline skilldump at the end.<br/>\n It is viable, but not brilliant.<br/>\nSpoiler [+]<br/>\n<br/>\n Bard(6), Red Dragon Disciple(10), Assassin(24), Human<br/>\n  <br/>\n STR: 17 (40)<br/>\n DEX: 15<br/>\n CON: 8 (10)<br/>\n WIS: 8<br/>\n INT: 14 (16)<br/>\n CHA: 11 (13)<br/>\n  <br/>\n 01: Bard(1): Armor Proficiency Heavy, Knockdown<br/>\n 02: Bard(2)<br/>\n 03: Bard(3): Weapon Focus: Dagger<br/>\n 04: Bard(4): STR+1, (STR=18)<br/>\n 05: Bard(5)<br/>\n 06: Assassin(1): Two-Weapon Fighting<br/>\n 07: Assassin(2): {Uncanny Dodge I}<br/>\n 08: Assassin(3): STR+1, (STR=19)<br/>\n 09: Assassin(4): Ambidexterity<br/>\n 10: Assassin(5)<br/>\n 11: Assassin(6)<br/>\n 12: Assassin(7): STR+1, Blind Fight, (STR=20)<br/>\n 13: Red Dragon Disciple(1)<br/>\n 14: Red Dragon Disciple(2): (STR=22)<br/>\n 15: Red Dragon Disciple(3): Improved Two-Weapon Fighting<br/>\n 16: Red Dragon Disciple(4): STR+1, (STR=25)<br/>\n 17: Assassin(8)<br/>\n 18: Red Dragon Disciple(5): Improved Critical: Dagger<br/>\n 19: Red Dragon Disciple(6)<br/>\n 20: Red Dragon Disciple(7): STR+1, (STR=26), (CON=10)<br/>\n 21: Red Dragon Disciple(8): Epic Weapon Focus: Dagger<br/>\n 22: Assassin(9)<br/>\n 23: Red Dragon Disciple(9): (INT=16)<br/>\n 24: Red Dragon Disciple(10): STR+1, Epic Prowess, {Darkvision}, (STR=31), (CHA=13)<br/>\n 25: Assassin(10)<br/>\n 26: Assassin(11)<br/>\n 27: Assassin(12): Great Strength I, (STR=32)<br/>\n 28: Assassin(13): STR+1, (STR=33)<br/>\n 29: Assassin(14): Epic Skill Focus: Hide<br/>\n 30: Assassin(15): Great Strength II, (STR=34)<br/>\n 31: Assassin(16)<br/>\n 32: Assassin(17): STR+1, (STR=35)<br/>\n 33: Assassin(18): Great Strength III, Epic Skill Focus: Move Silently, (STR=36)<br/>\n 34: Assassin(19)<br/>\n 35: Assassin(20)<br/>\n 36: Assassin(21): STR+1, Great Strength IV, (STR=38)<br/>\n 37: Assassin(22): Epic Reflexes<br/>\n 38: Assassin(23)<br/>\n 39: Assassin(24): Great Strength V, (STR=39)<br/>\n 40: Bard(6): STR+1, (STR=40)<br/>\n<br/>\n Hitpoints: 264<br/>\n<br/>\n Saving Throws (Fortitude/Will/Reflex): 18/20/28<br/>\n Saving Throw bonuses: Spells: +6, Traps: +2, Poison: +12<br/>\n BAB: 24<br/>\n AB (max, naked): 43 (melee), 27 (ranged)<br/>\n AC (naked/mundane armor/shield only): 24/34<br/>\n Spell Casting: Bard(2)<br/>\n<br/>\n Skillpoints: 298<br/>\n Discipline 43(58), Hide 43(55), Lore 8(17), Move Silently 43(55), Perform 11(12), Search 12(15), Spellcraft 27(30), Spot 42(41), Tumble 40(42), UMD 29(30)<br/>\n<br/>\n<br/>\n<br/>\n  </div></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:35 PM - Apr 14, 2015",
      "content": "<div>Yeah, this is what i came up as well, when i was testing the build in various ways of increasing Assassin's power, but in  the end i decided against it. Better leave two-weapon fighting to Dexterity-types Mick, ideally a Hin of Shadows or similar. Here we are served much better by relying on a big Scythe, i did various tests with &amp; without it and the constant firepower of it, was better than anything else i put on pgc3. The only downside of this build if i ever found one is the lack of the fourth attack but with haste taken as granted at some point, he will still have an opening flurry of two Death attacks, that is all we ever want, and if something survives that, it will quickly succumb to the massive damage we deal with each strike.<br/>\n<br/>\n Still, this is a nice alternative for a more traditional set-up (more attacks) and i thank you that you took the time and made this to illustrate your point!</div>"
    }
  ]
}