{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "983",
  "name": "BoW Arena PVP Server",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bow-arena-pvp-server-t2354853.html",
  "author": "Blooddov3",
  "avatar": "10758889_1525336313.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "Blooddov3",
      "avatar": "10758889_1525336313.jpg",
      "timestamp": "4:02 AM - Apr 14, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Looking for PvP builds to use on the Bastion of War pvp Arena server.<br/>\n<br/>\nAll and any builds posted will most likely be used as I plan to have many characters.<br/>\n<br/>\nAll builds please<br/>\nmelee<br/>\nsneaks<br/>\ntanks<br/>\ncasters<br/>\ncaster counters<br/>\nsneak counters<br/>\nbuffers<br/>\nhealers<br/>\n<br/>\nMuch appreciated!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:37 PM - Apr 14, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sorry, Blooddov3, but we're really going to have to know a lot more about Bastion of War - and PvP will always depend on who you're facing as well as what you bring. So, essentially, loads more info, please<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Blooddov3",
      "avatar": "10758889_1525336313.jpg",
      "timestamp": "12:57 AM - Apr 15, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll copy and paste the spell/feat changes. I expect this post to go ignored in less you want a challenge in class building all the help and reply's are extremely appreciated...<br/>\n<br/>\nSo heres the walls of text...<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nWith the exception of Battletide, Dirge, Invisibility Purge, and War Cry, all area of effect spells are Full PvP -- they affect friend and foe alike. Team kills are penalized, so please be careful. <br/>\n<br/>\nSpells may not be cast while in Expertise mode. <br/>\n<br/>\nThe duration of most disabling spells has been changed to 2 rounds + 1/3 levels to a maximum of 20 rounds. The maximum duration is increased 50% if Extended. This affects the following spells: Bigby's Clenched Fist, Bigby's Crushing Hand, Bigby's Forceful Hand (10 rounds max), Bigby's Grasping Hand, Charm Monster, Charm Person, Charm Person or Animal, Confusion, Control Undead, Dominate Animal, Dominate Monster, Dominate Person, Fear, Flesh to Stone (10 rounds), Hold Animal (10 rounds), Hold Monster (10 rounds), Hold Person (10 rounds), Mass Charm &amp; Turn Undead. The duration of summon immobilization effects (such as Dragon and Mummy fear) are a maximum of 20 rounds. <br/>\n<br/>\nMost buffing spells do not stack with themselves, including Aid, Regenerate, Tenser's Transformation, and Undeath's Eternal Foe. Damage shields (Elemental Shield, Wounding Whispers, Death Armor, Mestil's Acid Sheath) do not stack with the each other. <br/>\n<br/>\nA \"high AC mage\" is defined as one with the Armor Skin epic feat, Epic Mage Armor spell or more than 20 points in the Tumble skill. See Elemental Shield, Epic Warding and Mestil's Acid Sheath. <br/>\n<br/>\n<strong>Amplify</strong>: Provides +10 to Listen (instead of +20). Does not require a somatic component. <br/>\n<br/>\n<strong>Aura versus Alignment</strong>: Only one instance of Holy Aura or Unholy Aura may be active at a time, but each provides immunity to mind-affecting spells for both alignments; Unholy Aura Inflicts divine damage instead of negative (just like Holy Aura). <br/>\n<br/>\n<strong>Balagarn's Iron Horn</strong>: Based on discipline check. The DC is the same as the Bigby spells except there is no Size Modifier. <br/>\n<br/>\n<strong>Ball Lightning</strong>: Bug fixed (should have Reflex save). <br/>\n<br/>\n<strong>Battletide</strong>: When cast from an item, doesn't create AOE, only provides +2 AB, +2 damage, and +2 saving throws. <br/>\n<br/>\n<strong>Bigby's Forceful Hand, Bigby's Grasping Hand, Bigby's Clenched Fist, Bigby's Crushing Hand</strong>: Based on Discipline check. DC = caster level + spell level - 15 + caster ability modifier + Spell Focus bonus + size modifier (vs. large size) + d20. Arcane Defense lowers the DC by 2. The damage from Clenched Fist and Crushing Hand is 2.5x to compensate for the reduced duration. <br/>\n<br/>\n<strong>Bigby's Interposing Hand</strong>: Decreases the target's Attack Bonus by 2d4 + 1 instead of flat -10. <br/>\n<br/>\n<strong>Blade Barrier</strong>: Handles Reflex saving throw and Evasion / Improved Evasion feats properly. <br/>\n<br/>\n<strong>Bless</strong>: Bug fixed (wasn't centered on target). <br/>\n<br/>\n<strong>Camouflage, Mass Camouflage</strong>: Provide +5 to Hide skill, instead of +10. <br/>\n<br/>\n<strong>Continual Flame</strong>: When cast on an item, the light property is temporary. <br/>\n<br/>\n<strong>Control Undead</strong>: Turns undead instead of control (domination). <br/>\n<br/>\n<strong>Create Undead</strong>: The summoned undead creature is always a pet of the caster. <br/>\n<br/>\n<strong>Dispel Magic, Lesser Dispel Magic, Greater Dispel Magic, Mordenkainen's Disjunction</strong>: The DC check to dispel a buff is caster level + Spell Focus Abjuration (+1, +2 &amp; +4 for Spell Focus, Greater SF &amp; Epic SF Abjuration respectively) + d20 vs. target's character level + Arcane Defense Abjuration (+2) + 11. Instead of the caster level being capped for Lesser Dispel, Dispel Magic, Greater Dispel &amp; Mordenkainen Disjunction it is the full caster level minus the following adjustment: <br/>\nBards, Clerics, Druids &amp; dispel traps: -13 / -8 / -3 / -2 (mord trap) respectively. <br/>\nSorcerers and Wizards: -16 / -11 / -6 / -2 respectively. <br/>\nIf the dispeller's adjusted caster level is higher than the target's character level, it is lowered to be the same, to allow a maximum base chance of 50% to dispel. The Spell Focus bonus then only applies if the target's character level is less than 6 levels higher. <br/>\n<br/>\n<strong>Divine Favor, Divine Power</strong>: The following spells and feats are weakened when used together: Divine Favor, Divine Power, Divine Shield and Bard Song. The first one used is at full power but any subsequent are half power (but duration is unchanged), but Divine Favor is simply removed when Divine Power is used. (Alternatively, you can set which one will always be at full power using the PC wand.) Divine Favor: The caster gains a +1 bonus for every 4 caster levels (instead of 3). Divine Power never provides an extra attack per round. <br/>\n<br/>\n<strong>Dominate Monster</strong>: Immobilizes in addition to daze. <br/>\n<br/>\n<strong>Dragon Knight</strong>: The Red Dragon summon does not have True Seeing. <br/>\n<br/>\n<strong>Elemental Shield</strong>: When cast after Epic Warding, damage is reduced by 20% or -- for high AC mages -- 60%. <br/>\n<br/>\n<strong>Epic Warding</strong>: Absorbs 35 points of damage per caster level before collapsing (reduced from 50 points per level). If cast after Elemental Shield or Mestil's Acid Sheath, the Damage Reduction amount and damage absorbed before collapsing is reduced by 20% or -- for high AC mages -- 60%. <br/>\n<br/>\n<strong>Expeditious Retreat</strong>: Spell disabled. <br/>\n<br/>\n<strong>Find Traps</strong>: Does not disarm traps, but does reveal traps to all party members. <br/>\n<br/>\n<strong>Flame Arrow</strong>: Only a single SR check for all missiles, so each missile isn't counted as a separate spell against spell mantles. <br/>\n<br/>\n<strong>Gate</strong>: The summoned Balor is always a pet of the caster. <br/>\n<br/>\n<strong>Greater Ruin</strong>: The number of damage dice is 15 + caster level (instead of flat 35d6). Failing saving throw also causes blindness for 1d6 + 4 rounds. Spell Focus Evocation adds DC as per feat. (2, 4, 6) <br/>\n<br/>\n<strong>Greater Sanctuary</strong>: Duration changed to 2 rounds + 1 round per 3 levels. The Spellcraft and Heal skills are lowered, so Counterspell and Healer's Kits can't be used while ethereal. Provides an attack and damage penalty. Etherealness is removed when casting any spell -- actions are cleared and the caster can't cast another spell for 5 - 12 seconds. <br/>\n<br/>\n<strong>Greater Spell Breach</strong>: Spell Resistance may not be breached. <br/>\n<br/>\n<strong>Heal, Mass Heal, Greater Restoration, Harm</strong>: Healing is capped at 50 Hit Points + 1d4 points per caster level; damage is capped at 100 Hit Points + 2d4 points per caster level. <br/>\n<br/>\n<strong>Hellball</strong>: The number of damage dice for each damage type is 5 + caster level divided by 4 (instead of flat 10d6). The Cold damage has also been added. Spell Focus Evocation adds DC as per feat (2, 4 or 6). <br/>\n<br/>\n<strong>Holy Aura</strong>: See Aura versus Alignment. <br/>\n<br/>\n<strong>Holy Sword</strong>: The Holy Avenger property has been changed to Enhancement Bonus +5, Damage Bonus Divine 1d6, Spell Resistance 16, Use Limitation Paladin. The Enhancement Bonus is not applied if the weapon already has the identical item property, so that it can be used in conjunction with Greater Magic Weapon. <br/>\n<br/>\n<strong>Ice Storm</strong>: Has the following caster level when cast in Rakshasa form: (Druid level + Shifter's level) / 2 + 3. <br/>\n<br/>\n<strong>Invisibility Purge</strong>: Does not affect allies but does affect caster; duration changed to 1 round / level; aura visual effect added; does not affect Assassin's Improved Invisibility ability. <br/>\n<br/>\n<strong>Invisibility Sphere</strong>: Duration changed to 1 round / level. <br/>\n<br/>\n<strong>Isaacs Greater Missile Storm</strong>: Limited to a maximum of 10 missiles per target. <br/>\n<br/>\n<strong>Knock</strong>: Works on plot doors in a Large Sphere. <br/>\n<br/>\n<strong>Lesser Spell Breach</strong>: Spell Resistance may not be breached. <br/>\n<br/>\n<strong>Magic Circle Against Alignment</strong>: Same as Protection from Alignment change. <br/>\n<br/>\n<strong>Magic Vestment</strong>: No effect when cast on Chaos Shield item. <br/>\n<br/>\n<strong>Mass Charm</strong>: Works like other charm spells; dazes target(s). The hit dice restriction has been removed. <br/>\n<br/>\n<strong>Mestil's Acid Sheath</strong>: Damage lowered to 1d6 points + 1.25 points per caster level. If cast after Epic Warding, damage is reduced to 1d6 + 1 point per caster level or -- for AC Mages -- to 1d6 + 0.5 points per caster level. <br/>\n<br/>\n<strong>Mordenkainen's Disjunction</strong>: Bugs fixed; see Dispel Magic. Also, Spell Resistance may not be breached. <br/>\n<br/>\n<strong>Mordenkainen's Sword</strong>: The Helmed Horror summon does not have True Seeing. <br/>\n<br/>\n<strong>Negative Energy Burst</strong>: Fixed bug so it heals friendly undead. <br/>\n<br/>\n<strong>Planar Binding, Lesser Planar Binding, Greater Planar Binding, Planar Ally</strong>: Planar Summoning Crystals are available from the Magic Item merchant that will alter the alignment of the summon. <br/>\n<br/>\n<strong>Polymorph Self</strong>: The Umber Hulk polymorph does not have True Seeing. <br/>\n<br/>\n<strong>Protection from Alignment</strong>: Provides immunity to mind-affecting spells of the opposing alignment, i.e., both Protection from Good and Protection from Evil provide immunity against both Good and Evil mind-affecting spells. <br/>\n<br/>\n<strong>Raise Dead, Resurrection</strong>: Spells disabled. <br/>\n<br/>\n<strong>Shapechange</strong>: The Red Dragon polymorph does not have True Seeing, and its Dexterity is reduced to 10 and natural Armor Class increased by 10. <br/>\n<br/>\n<strong>Spell Resistance</strong>: Spell Focus (Abjuration) provides bonuses when cast on self: Spell Focus provides +1 SR, Greater Spell Focus +2 and Epic Spell Focus +4. <br/>\n<br/>\n<strong>Silence</strong>: Provides immunity to Curse Song. <br/>\n<br/>\n<strong>Time Stop</strong>: Spell disabled. You may purchase an epic misc item to reenable it in a different manner. <br/>\n<br/>\n<strong>True Seeing</strong>: Does not automatically see through characters in Stealth Mode; spell is a combination of the See Invisibility and Ultravision spells and also grants a +10 skill bonus to Search skill. <br/>\n<br/>\n<strong>Undeath's Eternal Foe</strong>: The AC bonus type is Dodge. <br/>\n<br/>\n<strong>Unholy Aura</strong>: See Aura versus Alignment. <br/>\n<br/>\n<strong>War Cry</strong>: Does not require a somatic component. <br/>\n<br/>\n<strong>Word of Faith</strong>: Grants a Will saving throw before taking effect. <br/>\n<br/>\n<strong>Vampiric Touch</strong>: Does not work on dead creatures. <br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://www.bastionsofwar.com/images/blue_line.gif\" /><br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Skill, Feat, Class &amp; Ability Changes</span></strong><br/>\nThe Pale Master class has been changed so they \"gain\" -2 AC upon reaching level 8. <br/>\n<br/>\nThe Red Dragon Disciple class has been changed so they \"gain\" -25% Cold Vulnerability, -2 Discipline and -2 AC upon reaching level 10. The penalties are cumulative, which means a character who is 8 PM and 10 RDD get both penalties. <br/>\n<br/>\nSocial skills such Appraise and Persuade are not used. <br/>\n<br/>\nAll polymorph spells and abilities (including all Shifter forms) may not be canceled due to a bug that can crash the server. You may however unpolymorph by using the familiar/animal companion ability if you have more than 250 hit points. Also, characters are not saved while polymorphed. <br/>\n<br/>\n<strong>Arrow of Death, Hail of Arrows, Imbue Arrow, Seeker Arrow</strong>: Physical damage is applied as magical when the Arcane Archer has at least Enchant Arrow V (to compensate for a bug with bypassing Damage Reduction) and the target doesn't have Epic Warding or x/- damage reduction (such as from Barbarian or Dwarven Defender levels). The damage also includes arrow damage bonus, bow Massive Criticals, and Epic Weapon Specialization. <br/>\n<br/>\n<strong>Barbarian Rage</strong>: Provides additional bonuses of +1 Attack Bonus, +1 Damage, +1 Fortitude, +1 Discipline, and +1 Concentration. Succeeding a difficulty check of Constitution modifier + 1d20 vs. DC 21 will halve the -2 AC penalty. The unraged Constitution modifier is doubled in the duration calculation. <br/>\n<br/>\n<strong>Bard Song</strong>: Does not work for Bards below level 11 with less than 18 Perform; skill decreases above 4 are cut in half (an 8 decrease is reduced to 6); removes Bard's invisibility and Greater Sanctuary upon use. Effects removed upon the Bard's death. <br/>\n<br/>\n<strong>Brew Potion, Craft Wand, Scribe Scroll, Craft Armor, Craft Trap, Craft Weapon</strong>: Disabled. (The Rogue Vendor sells unlimited use trap creation kits.) <br/>\n<br/>\n<strong>Bull's Strength (Blackguard ability)</strong>: Enhanced when a Blackguard also has the Epic Fiending Servant feat; it gives an additional +3 AB and +3 damage. With 20+ Blackguard levels, the bonus is increased to +4 AB and +1d8 damage. <br/>\n<br/>\n<strong>Craft Harper Item</strong>: Creates Greater Cat's Grace or Greater Eagle's Splendor potions; the cost has been changed to 15 XP/GP for 5 potions and the ability may be used an unlimited number of times. Greater Cat's Grace increases Dexterity by 1d3+1, Attack Bonus +1 and Armor Class +1. Greater Eagle's Splendor increases Charisma by 1d3+1, all saving throws +2 and increases Heal skill by 20%. The duration is 5 Hours. <br/>\n<br/>\n<strong>Curse Song</strong>: Does not work for Bards below level 12 with less than 18 Perform; skill decreases above 4 are cut in half (an 8 decrease is reduced to 6); removes Bard's invisibility and Greater Sanctuary upon use. Effects removed upon the Bard's death. The Silence spell provides immunity to Curse Song. <br/>\n<br/>\n<strong>Disable Trap, Search</strong>: Trap detect and disarm DCs have been changed, so it's possible for other PCs to find and remove enemy traps. The standard detect DC modifier has been changed to 0 and the disarm DC modifier has been reduced by the base detect DC. So, the detect DC is the trap setter's Set Trap skill plus d20, and the disarm DC is 12-15 points higher (depending on the trap). <br/>\n<br/>\n<strong>Disarm, Improved Disarm</strong>: Weapons are returned to the owner when anyone picks it up or upon death. <br/>\n<br/>\n<strong>Divine Shield</strong>: See Divine Favor for when it's used in combination with divine spells or Bard Song. The AC granted is lowered by 1 / 3 for a character with the Epic Fiendish Servant feat (Blackguard's enhanced Bull's STR). <br/>\n<br/>\n<strong>Dragon Shape</strong>: The Wild Shape 6x/day prerequisite has been changed to 5x/day. True Seeing has been removed. Dexterity reduced to 10, Hide Skill lowered by 8, and Armor Class (Armor type) increased by 7. +6 Soak 40 Damage Reduction has been removed. <br/>\n<br/>\n<strong>Epic Fiendish Servant</strong>: See Bull's Strength (Blackguard ability). <br/>\n<br/>\n<strong>Evasion, Improved Evasion</strong>: Does not work while using Medium or Heavy Armor or Tower Shield. <br/>\n<br/>\n<strong>Greater Rage</strong>: Instead of increasing Strength and Constitution 6 points, the increase is only 4 points. However, it provides additional bonuses of +1d2+1 Attack Bonus, +2 Damage, +2 Fortitude, +2 Discipline, +2 Concentration, and 1 HP per character level. Succeeding a difficulty check of Constitution modifier + 1d20 vs. DC 21 will halve the -2 AC penalty. The unraged Constitution modifier is tripled in the duration calculation. <br/>\n<br/>\n<strong>Greater Wildshape, Outsider Shape, Undead Shape</strong>: True Seeing &amp; Hide in Plain Sight have been removed from all polymorph forms. <br/>\n<br/>\n<strong>Great Smiting</strong>: Limited to III for Good characters and VI for Evil characters. <br/>\n<br/>\n<strong>Hide in Plain Sight</strong>: Disabled. Speak with Shady Character to level up as a Shadowdancer. <br/>\n<br/>\n<strong>Improved Invisibility (Assassin ability)</strong>: The Assassin gains +5% to his Improved Invisibility concealment at 13th level, +5% every four levels thereafter, up to a maximum of 65%. The Assassin ability is unaffected by dispel and Invisibility Purge. <br/>\n<br/>\n<strong>Lasting Inspiration, Lingering Song</strong>: Lingering Song is applied before Lasting Inspiration, which is reduced to 4 times duration for Bard Song and 2 times duration for Curse Song (instead of 10 times). <br/>\n<br/>\n<strong>Mighty Rage</strong>: Instead of increasing Strength and Constitution 8 points, the increase is only 2 points. However, it provides additional bonuses of +1d2+4 Attack Bonus, +4 Damage, +4 Fortitude, +4 Discipline, +4 Concentration, and 2 HP per character level. The unraged Constitution modifier is quadrupled in the duration calculation. <br/>\n<br/>\n<strong>Pick Pocket</strong>: Skill is not allowed on BoW. Do not put points into it. <br/>\n<br/>\n<strong>Search</strong>: See Disable Trap. <br/>\n<br/>\n<strong>Shadow Evade</strong>: Grants the caster 25% concealment, 2/+6 DR &amp; +1 AC. These bonuses grow +3% concealment, +1 DR &amp; +1 AC for every 2 SD levels above level 4, and for every 3 levels above level 10. Duration changed to 40 rounds + 3 rounds / SD level. This ability is undispellable, and the bonuses cap at SD level 22. <br/>\n<br/>\n<strong>Terrifying Rage</strong>: AB decrease is no longer blocked by fear immunity. (Lower level enemies with fear immunity will have AB decrease also.) Provides +2 AC dodge bonus (but only if characters has less than 10 Pale Master levels). DC = Skill Level - 10 + d20. Mind Immunity on enemies further lower the DC by -5. <br/>\n<br/>\n<strong>Thundering Rage</strong>: Enhanced to give +5 Enhancement Bonus (to both main &amp; offhand weapons) and 1d4 Sonic Damage Bonus (main hand). Ranged weapons receive +5 Attack Bonus. Additionally, the Massive Criticals property has been increased from 2d6 to 2d8. <br/>\n<br/>\n<strong>Turn Undead</strong>: Duration changed to 2 rounds + 1/3 levels to a maximum of 20 rounds. <br/>\n<br/>\n<strong>Use Poison</strong>: When coating a weapon with poison, the normal duration of 3 rounds is extended by 2 rounds for every 3 Assassin and/or Blackguard levels and 1 round per Intelligence modifier.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}