{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "249",
  "name": "Best House Rules/Items You Have Seen",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/best-house-rules-items-you-have-seen-t2352147.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": 6,
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:45 PM - Mar 28, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">As per topic, please state the best house rules you have seen in any PW you have played so far.<br/>\n<br/>\nLet me get started this, with the famous...<br/>\n<br/>\n1) <strong>Shield Bracers</strong> (WoG).<br/>\n<br/>\nWhat it does: It allows 2-hander users to retain some of their AC even when not holding a shield. The (shield) AC comes at a price of the bracers slot of course &amp; it is lower somewhat from the bonus of a full tower shield +5 for example (about 2 points behind). It also doesnt come easily but you have to find them or request directly from a DM at a price.<br/>\n<br/>\nWhy is Great: Because the 2-handed weapons does't have exactly the advantage of the PnP version (they get double the power attack bonus there), these little bracers, allow for great customization fo characters and builds. No longer the only viable solution for a tough PW is the sword &amp; board solution. You don't get the full bomus and that's why it is balanced, but you are more comfortable to play with any 2-handed weapon of your choice without thinking that you are several points behind the AC mark.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "4:09 PM - Mar 29, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That reminds me of a PW  where I used to play. The Shield spell was scripted to give the Shield type AC bonus rather than the ordinary Deflection type. That also made the Brooch of shielding valuable for many characters.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:13 PM - Mar 29, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's a great idea also Mick, makes that trinket much helpful for everyone.<br/>\n<br/>\n2) <strong>Description Editor</strong> (Thain)<br/>\n<br/>\nWhat it does: It is a tool that allows you to edit your biography at a later time in the game. It also allows you to edit the description and the names of almost all the items in the game as well as long as you have them in your inventory.<br/>\n<br/>\nWhy it is great: Obviously this is perfect for RP servers but it can be used to many other settings as well, it makes countless mundane items have more depth to them. Makes items interesting. You may forge a blade lets say and you can edit the description to say whatever you want so it bears your marks and so on.. Really usefull tool for just about everything, as long as you have some imagination.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "9:48 AM - Apr 05, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like your formula, too tired to follow it atm. I read someplace that Dev. Crit was replaced with double damage (I guess that'd be double crit damage?). Sounded kinda neat as a houserule IMHO.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:14 PM - Apr 05, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Heh definitely better than some other interpretations i have seen like (increase all fort saves by an excessive amount).<br/>\n<br/>\nFor what is worth, my houserule for this would be to base the DC upon Weapons. -2 to DC for tiny/ normal DC for medium/ +2 DC for large weapons.<br/>\n<br/>\nAnd if you wanted to do it more realistic, you can also take into consideration the threat multiplayer too. Normal DC for (X2) weapons/ +1 to DC for (X3) weapons / +2 to DC for (X4) weapons. <br/>\n<br/>\nThat way the Large heavy hitting  weapons will have a better DC from tiny kukris and that Scyther Wmaster with Dev. Critical would be truly terrifying. This is balanced from the fact that these weapons don't crit often and you are forfeiting your shield at all. I think it makes sense.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:38 AM - Apr 07, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">3) <strong>Magic Electrifier (WoG)</strong><br/>\n<br/>\nWhat it does: It is a tool that allows you to replenish the charges to your Wands and Magic items in general, by destroying other magic items and \"stealing\" their power.<br/>\n<br/>\nWhy it is great: Because it makes UMD using characters really good and you can save a rare item that you have by refilling it with charges. Also Sorcerers don't have to invest money &amp; exp to make wands all the time but simply recharge the ones they have. That way they can buff a whole party for example (and Rogues too).<br/>\n<br/>\nWhy it is not great: It gives more power to an already powerful skill and it shifts the focus to UMD-using characters more. In WoG that is balanced from the existance of many 1/ Day use items that many can use including pure warriors, and from the lvl requirement you must have before you can even get access to it (lvl 20)/ High initial cost.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:35 AM - Apr 08, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">4) <strong>Extended Rod of Fast Buffing</strong> (WoG)<br/>\n<br/>\n<br/>\nWhat it does: It is a Rod that basically allows spellcasters (or UMD users) to cast all their selected buffs in one standard action.<br/>\n<br/>\nWhy it is great: Because it saves a lot of time, especially in groups and thus leaves more time for adventuring.<br/>\n<br/>\n<br/>\n<strong>Note</strong>: That Rod exists in many PW's, but i mentioned specifically WoG version because there it works also with all metamagic feats as well, due to a recent modification by Mr. Zork &amp; Dm Nocturne.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}