{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "702",
  "name": "Combat medic/support",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/combat-medic-support-t2355333.html",
  "author": "Conviction",
  "avatar": "no_avatar.png",
  "replies": "8",
  "views": "213",
  "posts": [
    {
      "author": "Conviction",
      "avatar": "no_avatar.png",
      "timestamp": "6:44 PM - Feb 02, 2020",
      "content": "<div>Hi I am new to the forums. Sorry if the format is off.<br/>\n<br/>\n1-40 PVM, Default modules and then later customs. <br/>\n<br/>\nNo particular race preferred, I was considering ELF for the weapon feat freely given.<br/>\nI am considering longbow + zen archery, or scimitar. <br/>\n<br/>\nMy goal is to build a party faveorite cleric or druid or bard with maximum possible wisdom (CHA if bard but, it seems the least likely pick) for spell effect and count. I am uncertain of the domains to choose. I am considering travel with strength for cat/aura or one of the domains that give invisibility or stoneskin. I would like to be able to contribute to the fighting however probably not in the form of offensive magic. I would prefer to have all of my prepared spells in the form of support and healing or crowd control. <br/>\n<br/>\nWhen it comes to skills I feel as though I haven't the slightest idea where to begin. I was thinking about Concentration, Spellcraft, Lore, and Heal. I noticed that the spot and listen skills are wisdom modified but, I don't know how practical they would be to the character.  I also am uncertain if I should get craft wand or potion for haste/invisibility/barkskin/stoneskin additional uses outside of my daily limit or if they would require use magical device since they are gained through domains and are not natural to the cleric if I go the cleric route.<br/>\n<br/>\nWhen deciding my attributes would it be safe to leave dex and charisma at base or 10 due to support from spells and feats for accuracy and, unless there is a way to add rogue or similar levels and use light armor the reflex saves will probably be too low to benefit? <br/>\n<br/>\nWhen picking the prepared spells for each day would it be more optimal to choose the hour/class level spells and extend the more potent turn/class level spells? Is it safe to keep strength at 10-12 and use bull's strength to improvise? Also how reliable is find traps is it able to fail?<br/>\n<br/>\nIs there options to increase AC values besides taking a level of Monk for the wisdom to AC trait? I am not oposed to using monk it's just that I am uncertain how to get value out of utilizing the level for a skill dump or not waste some of their feats.<br/>\n<br/>\nThank you in advance for reading through this long winded post and any feedback provided.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "7:38 PM - Feb 02, 2020",
      "content": "<div>I would recommend a WIS caster Cleric, with a few Monk levels and either Rogue or CoT for your third class. The exact build would depend on the environment though, there are a lot of ways to make a decent caster cleric. The best races are probably elf, halfling, human, and gnome, although the best choice depends on the build.<br/>\n<br/>\nRegarding domains, it depends on what is available in your environment. If permahaste is available then Travel is worthless, if permahaste isn't available then it is one of the best domain choices. Trickery is another solid domain choice too, you get both Improved Invisibility and Divine Trickery. For a caster cleric the best alternative domains are probably Heal, Magic, Plant, Strength, and War. I usually go for Magic/Trickery or Travel/Trickery on my caster clerics, depending on whether permahaste is available or not.<br/>\n<br/>\nI suggest leaving CHA at 8, but the DEX would depend on the build. I usually go for 14 DEX on my clerics for the extra AC, although if AC isn't important then you can drop that to 8 as well. Divine Power increases STR to 18 and has a duration of Rounds/Level so at higher levels you won't be as bothered by low STR. Clerics don't have many skill points, so try to aim for 14 INT (even as a human). CON is also very important, try to avoid using it as a dump stat.<br/>\n<br/>\nClerics can craft wands of Haste and Improved Invisibility and then use those wands without UMD, so that won't be a problem. However whether it is worth getting Craft Wand or not depends on the environment, particularly if there are rest restrictions or if Craft Wand has been modified.<br/>\n<br/>\nFor feats, I suggest taking Epic Spell Focus: Evocation, Extend Spell, and Silent Spell. Even if you plan on being a support healer, a caster cleric makes for a very strong offensive caster. Harm/Heal and Implosion are some of most powerful spells in vanilla NWN. Armor Skin, Blind Fight, Empower Spell, ESF: Concentration, and Zen Archery are all very useful feats too.<br/>\n<br/>\nFor skills, Concentration and Spellcraft are the important ones. As a cleric you can ignore Heal, since your spells will be much more effective at higher levels. How useful Lore is depends on your environment, so sometimes it's worth investing in and sometimes it isn't. Monks get Discipline and Tumble as class skills, those are the main ones that you don't get from cleric. Discipline is useful for avoiding Knockdown and other combat feats, Tumble increases AC and prevents AoOs from moving around during combat. As a healer you will probably spend a lot of time moving around the battlefield so you should aim for at least 15 Tumble. Assassin and Rogue both get UMD which can also be very useful, a Cleric/Monk can't be a Bard without alignment changes so that's probably not an option. If you have vanilla True Seeing then Listen/Spot aren't that useful for you, if True Seeing is modified to give See Invisibility and a Spot bonus (which is the most common modification) then they can be very useful.<br/>\n<br/>\nWhen it comes to AC you either go Monk or wear heavy armor and use a shield. At low levels heavy armor is better but once your WIS starts increasing Monk will be a better option. If you plan on sticking with heavy armor then you will need to have a decent STR score. In addition to AC and skills, Monk also gives Evasion and a speed increase. Deflect Arrow and Improved Knockdown can also be very useful depending on your environment and how you build.</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "8:41 PM - Feb 02, 2020",
      "content": "<div>Demolition Man - Cleric 38 / Monk 1 / Rogue 1<br/>\n<a class=\"postlink\" href=\"https://r.tapatalk.com/shareLink/topic?share_fid=1923037&amp;share_tid=515420&amp;url=https%3A%2F%2Fwww%2Etapatalk%2Ecom%2Fgroups%2Fnwnecbguild%2Fviewtopic%2Ephp%3Ft%3D515420&amp;share_type=t&amp;link_source=app\" rel=\"noreferrer\" target=\"_blank\">https://r.tapatalk.com/shareLink/topic? ... source=app</a><br/>\n<br/>\nThis should suit, it is the standard for such things <span class=\"text-emoji\">😁</span><br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "8:44 PM - Feb 02, 2020",
      "content": "<div>Sprinkle in more rogue if you feel the need.  Also, for Domains:<br/>\nTravel &gt; War &gt; Plant/Death/Trickery &gt; everything else<br/>\n<br/>\nIf where you are playing has a permanent wearable or haste item then Travel can be dropped.<br/>\n<br/>\nAny should suit for the campaign however.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "8:47 PM - Feb 02, 2020",
      "content": "<div>Also, give this a read regarding spells:<br/>\n<br/>\nAn Insight into the Cleric Class<br/>\n<a class=\"postlink\" href=\"https://r.tapatalk.com/shareLink/topic?share_fid=1923037&amp;share_tid=515461&amp;url=https%3A%2F%2Fwww%2Etapatalk%2Ecom%2Fgroups%2Fnwnecbguild%2Fviewtopic%2Ephp%3Ft%3D515461&amp;share_type=t&amp;link_source=app\" rel=\"noreferrer\" target=\"_blank\">https://r.tapatalk.com/shareLink/topic? ... source=app</a><br/>\n<br/>\nIt should help with what and where.<br/>\n<br/>\nExtend is used both as a spell book optimisation (get more and/or move to a different level to free up prior level) as well as to double low time durations.<br/>\n<br/>\nDouble duration on things like: Aura of Vitality, Bless, Haste, Improved invis, battle cry, regen, aid, prayer, etc <br/>\n<br/>\nMove or increase the number of castings of things like: Heal<br/>\n<br/>\nSome are both like: Divine Power <br/>\n<br/>\nDid I mention ... Clerics are my favourite class :)<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Conviction",
      "avatar": "no_avatar.png",
      "timestamp": "8:57 PM - Feb 02, 2020",
      "content": "<div><blockquote><div><cite>Yunim wrote: <div class=\"responsive-hide\">Feb 02, 2020</div></cite>When it comes to AC you either go Monk or wear heavy armor and use a shield. At low levels heavy armor is better but once your WIS starts increasing Monk will be a better option. If you plan on sticking with heavy armor then you will need to have a decent STR score. In addition to AC and skills, Monk also gives Evasion and a speed increase. Deflect Arrow and Improved Knockdown can also be very useful depending on your environment and how you build.</div></blockquote>\nThank you very much for your very informative post. <br/>\n<br/>\nThis part about improving AC has me slightly confused. If I take levels in monk do I need to wear light armor in order to obtain the additional AC from wisdom? I wouldn't be oposed to this, honestly I would prefer to lighten the weight of the character. <br/>\n<br/>\nThis is very encouraging to make a light(if viable), bow based high wisdom cleric. I want to take the feats you recommended for spell focus evocation silent spell and extended spell. Is there anything else in particular I need besides zen archery to enable the bow portion of the build? Is there an advantage to be had in choosing Elf here for the bow proficiency or would I still have the advantage playing human? (I have no preferences among the races)<br/>\n<br/>\nEDIT: I read the details for the demolition man build and further information on cleric. Thank you as well for the insight this is exactly what I was looking for. You guys are great.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "9:09 PM - Feb 02, 2020",
      "content": "<div>Monks only get bonus AC from WIS when wearing robes, so you won't be using any armor or shields at all.<br/>\n<br/>\nIf you want to use a longbow you will need to be either an elf or have Weapon Proficiency Martial (either from a class or by selection).<br/>\nIf you want to use a heavy crossbow you don't need any proficiency feats but you will need to take Rapid Reload.<br/>\n<br/>\nBlind Fight helps against concealment with both your ranged attacks and your touch attacks (Harm/Heal). Weapon feats (WF, IC, EWF, Epic Prowess), Called Shot, Point Blank Shot, and Rapid Shot (can't be used with crossbows) are the standard ranged feats. Honestly you can get by with just Zen Archery since you can self-buff your AB and use speed and acceptable casualties/party members to avoid getting into melee range. However if you want to focus on the archery over casting then those are feats to consider, there is a lot of flexibility when it comes to caster clerics.<br/>\n<br/>\nHumans get an extra feat and an extra skill. Elves get higher DEX, lower CON, free longbow proficiency, and Keen Senses. There are arguments for either race so whichever one you pick is up to you.</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:16 PM - Feb 02, 2020",
      "content": "<div>Also, to add more insight on monk AC.  It is often the case, even with a low level monk class dip that you ignore all the monk “do not wear armor” bonuses and clank about in full plate and a shield until the stuff that makes the monk bonuses work (Wis and Dex) get to the level they out weigh what full plate and a shield offer.<br/>\n<br/>\nSo, my clerics that start with level 1 monk (often for skill points and those early feats like cleave) shift out of plate/shield in the early teens.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "2:34 AM - Feb 03, 2020",
      "content": "<div><blockquote><div><cite>Zanithar wrote:</cite>Sprinkle in more rogue if you feel the need.  Also, for Domains:<br/>\nTravel &gt; War &gt; Plant/Death/Trickery &gt; everything else<br/>\n<br/>\nIf where you are playing has a permanent wearable or haste item then Travel can be dropped.<br/>\n<br/>\nAny should suit for the campaign however.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div></blockquote>\n\nI figure I would add to this/mesh to what was said above.  Adding Dex to a cleric start is useful for AC.  There are two ways to add this, one is to take extra Dex as a base stat.  The other is to take a domain that nets Cat’s Grace (this is subject to the +12 &lt;usually&gt; stat cap). This is not the primary reason I rate War as the #2 Domain choice but is also a solid reason.  The reason War is #2 is that you also net Aura of Vitality.  On a deep cleric build an area spell that gives you +4 Str/Dex/Con offers a bunch of equipment flexibility AND the ability to buff all your friends.  It is a fantastic support spell for a deep caster cleric focusing on support.<br/>\n<br/>\nI personally prefer to have some flexibility on those extra “Dex” allocation points and often drop them into another stat like Int/Con or even Charisma (for builds that take divine might) which cannot be “helped” using War Domain.  Depending on the build, they may well stay in Dex ... but it is nice to have the same flexibility offered to the other stats with the zoo/animal buffs.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    }
  ]
}