{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "885",
  "name": "Capture the Wind - Rogue 13/ Ranger 9/ Assassin 18",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/capture-the-wind-rogue-13-ranger-9-assassin-18-t2355026.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:44 AM - Feb 12, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi All.<br/>\n<br/>\nThe eagle-eyed amongst you will have noticed I've started playing with Assassin builds over the last couple of days. While I certainly don't pretend to expertise in the class, I'm trying the \"learning by doing\" ethic. Now, I'm sure this one isn't anything like optimized, but it's got a feel to it I quite like, so I've come to you asking for opinions (hopefully constructive ones).<br/>\n<br/>\nIt's not the most elegant sequencing, but I can justify it with back-story if that helps...<br/>\n<br/>\nThe young Hin toddler was into absolutely everything - turn over a bucket and he'd be inside it; lock up the apples for the winter and he'd be on that bucket moving the latch with a twig; and could you grab hold of him? You could no more capture the wind.<br/>\n<br/>\nAs he grew older and ventured more widely, he learned to love the forests and their strange creatures, watching and tracking them as quietly as he could. More importantly, he could leave his baby sister howling like a gale back home for his parents to care for - while he was a boy with a mission to find out what he could about the wild, free as the wind.<br/>\n<br/>\nHe had to move to a nearby town in his adolescence, along with his young sister. A wasting disease had taken his parents, and most of the rest of the village - people and animals - besides. Here, he relied on his sleight of hand and agility - with no means of payment or bartering, \"borrowing\" became his natural means of making money to feed and house the two of them. He fell in with a fence who was looking to rise in the town's hierarchy, and the pair made plenty of cash - he borrowing, the other supplying. Alas, it all came crashing down when one borrowed item came from the local gang-boss...and the fence tried to sell it back to him. The fence \"disappeared,\" but not without revealing who had taken the item. He returned to his lodgings one night to find his sister beaten senseless and blinded. He was not cowed. He took his poor little sister to the nearby monastery in the woods, where the good monks swore to care for her and offered him succour. He declined their kindness - other needs stabbed at his mind. The wind was about to become a gale.<br/>\n<br/>\nAnd so the inquisitive young Hin with a love for nature and its ways became the puissant storm that we know today: spoken of only as Capture the Wind.<br/>\n<br/>\nJust made that up to justify when I take the classes below. Please feel free to bugger around with them.<br/>\n<br/>\nOh, and I'm pretty sure I haven't optimized my stat spread.<br/>\n<br/>\nRogue 13/ Ranger 9/ Assassin 18<br/>\nHalfling, any evil (NE if you want to follow the story)<br/>\nPvM 1-40 (not yet tested - that's why it's here)<br/>\n<br/>\nStats<br/>\nStr 12<br/>\nDex 18 (34)<br/>\nCon 14<br/>\nWis 10<br/>\nInt 14<br/>\nCha 8<br/>\n<br/>\nHPs - 356<br/>\nAC - (naked) 31 (or 33, see below)<br/>\nSaves - F 22, R 35, W 17 (+4 vs spells, +2 vs fear-type spells)<br/>\nBAB - 27<br/>\nAB - 43 (or 44, see below): 41 (or 42) dual-wield<br/>\n<br/>\nSkill Points - 322<br/>\nHide 43 (59), MS 43 (61), Spell (cc) 18 (20), Spot 43 (49), Tum 40 (52), UMD 34 (33) - leaving 83 pts to split between Conc, DTrap, OLock, Lore, Search and Set Trap, according to taste<br/>\n<br/>\nLevelling<br/>\n1 Rog1 Blind Fight<br/>\n2 Rog2 (Evasion)<br/>\n3 Rgr1 (TWF/ FE1) Weapon Finesse<br/>\n4 Rgr2 Dex+1 (19)<br/>\n5 Rgr3<br/>\n6 Rgr4 Exotic Weapon Prof<br/>\n7 Rgr5 (FE2)<br/>\n8 Rgr6 (Animal Comp)/ Dex+1 (20)<br/>\n9 Rgr7 WF: Kukri<br/>\n10 Rgr8<br/>\n11 Rgr9 (ITWF)<br/>\n12 Rog3 KD/ Dex+1 (21)<br/>\n13 Rog4<br/>\n14 Rog5<br/>\n15 Rog6 Imp Crit: Kukri<br/>\n16 Rog7 Dex+1 (22)<br/>\n17 Rog8<br/>\n18 Ass1 IKD<br/>\n19 Ass2<br/>\n20 Ass3 Dex+1 (23)<br/>\n21 Ass4 GDexI (24)<br/>\n22 Rog9<br/>\n23 Rog10 (Imp Evasion)<br/>\n24 Rog11 GDexII/ Dex+1 (26)<br/>\n25 Rog12<br/>\n26 Rog13 (Def Roll)<br/>\n27 Ass5 Epic Dodge<br/>\n28 Ass6 Dex+1 (27)<br/>\n29 Ass7<br/>\n30 Ass8 GDexIII (28)<br/>\n31 Ass9<br/>\n32 Ass10 Dex+1 (29)<br/>\n33 Ass11 GDexIV (30)<br/>\n34 Ass12<br/>\n35 Ass13<br/>\n36 Ass14 EWF: Kukri/ GDexV/ Dex+1 (32)<br/>\n37 Ass15<br/>\n38 Ass16<br/>\n39 Ass17 *Epic Prowess OR Armour Skin*<br/>\n40 Ass18 GDexVI/ Dex+1 (34)<br/>\n<br/>\nPlease muck about and improve as you see fit!<br/>\n<br/>\nThanks<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Numpty that I am, I forgot to include the Death Attack, sorry. It's not stellar: 9d6 with a DC of 30.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:52 PM - Feb 12, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This build has a fine story, and can be a joy to play. You get Hin cuteness, warrior like AB, Dual wield, Epic dodge, plenty of skills, and a heavy hitting Sneak attack. <br/>\n<br/>\nThe min/maxer in me would probably look into:<br/>\nRogue 13/ Assassin 26/ SD 1, with ED, better SA/DA, but lower BAB and 1 less attack per round,<br/>\nRanger 10/ Assassin 28/ SD 2, with better AB and DA DC, but no ED,<br/>\nor Ranger 10/ Rogue 29/ SD 1, for a dual wielding ED rogue with skills and skill booster feats (or ISAs) galore.<br/>\nBut I don't know if it would make me any happier.<br/>\n<br/>\nIf you feel feat starved, remember that you may add an epic bonus feat by taking Ranger 10 in epic levels. That let you take EWF or EP instead of a third FE. You don't have room for that in a Rogue 13/ Assassin 18 build though.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:16 AM - Feb 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Mick, greatly appreciated. Even though the story was really a concoction simply to try to justify when I took certain levels (I'd love to end the tale with him reclaiming his sister from the monastery and the pair of them retreating into the woods once his vengeance was fulfilled - ie, a final Ranger level. Nothing wrong with a happy ending, I say).<br/>\n<br/>\nI know I'm not entirely confident with bigging up Ass (still nothing to do with fat arses), but I entirely see what you say about min/max-ing. And naturally, of course, the Rgr10/ Rog29/ SD1 appeals most to me - but I'm supposed to be trying Assassin on for size. Argh!<br/>\n<br/>\nAt least it wasn't crap. Thanks again!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}