{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "106",
  "name": "Hearth Guard: Fighter 8/ CoT10 /Dwarven Defender 22",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/hearth-guard-fighter-8-cot10-dwarven-defender-22-t2354692.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": "4",
  "views": "7.6K",
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:01 AM - Apr 22, 2017",
      "content": "<div><em>This is a repost of a build designed by grizzled_dwarflord on 10/9/2005, referenced by Stagmeister in a <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354609\" rel=\"noreferrer\" target=\"_blank\">discussion of the build and possible variants</a>.  We can thank GDL and him for the glimpse into a great concept!  For a full look into the subsequent guild discussion, you'll need to access the legacy archive.</em><br/>\n<br/>\n- - - - - - - - - - - - - - - - - -<br/>\n<br/>\nMy first submission to this guild was a Dwarven Defender build, and it is only fitting that my last build bookends the first with another Defender. After this, I retire to the role of heckler and will fade into the hazy fog of Forum mythology. Life to you, my brothers and sisters, and everlasting glory!<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>The Hearth Guard</strong></span><br/>\n<br/>\nFighter8/CoT10/Dwarven Defender22<br/>\nDwarf<br/>\nAlignment: Any Lawful<br/>\nPlayable 1-40, PvM<br/>\n<br/>\nStr16 (28)<br/>\nInt13<br/>\nWis8<br/>\nDex13<br/>\nCon18 (22)<br/>\nChr6<br/>\n<br/>\n1 Fighter, Blooded, Weapon Focus<br/>\n2 Fighter, Knockdown<br/>\n3 Fighter, Blindfighting<br/>\n4 Fighter, WS, Str17<br/>\n5 Fighter<br/>\n6 Fighter, Dodge, Toughness<br/>\n7 Fighter<br/>\n8 CoT1, Str18<br/>\n9 CoT2, Improved Knockdown, Improved Crit<br/>\n10 DwD1<br/>\n11 DwD2<br/>\n12 DwD3, Improved Initiative, Str19<br/>\n13 DwD4<br/>\n14 DwD5<br/>\n15 DwD6, Mobility<br/>\n16 DwD7, Str20<br/>\n17 DwD8<br/>\n18 DwD9, Spring Attack<br/>\n19 DwD10<br/>\n20 CoT3, Con19<br/>\n21 CoT4, Great Con I, Epic Weapon Focus<br/>\n22 Fighter8, Epic Weapon Specialization<br/>\n23 CoT5<br/>\n24 CoT6, ESF: Spot, Epic DamageReduction I, Con 21<br/>\n25 DwD11<br/>\n26 DwD12<br/>\n27 DwD13, Great Str I<br/>\n28 DwD14, Epic DamageReduction II, Str22<br/>\n29 DwD15<br/>\n30 DwD16, Great Str II<br/>\n31 DwD17<br/>\n32 DwD18, Epic DamageReduction III, Str24<br/>\n33 CoT7, Great Str III<br/>\n34 CoT8, Epic Prowess<br/>\n35 CoT9<br/>\n36 CoT10, Great Str IV, Superior Initiative, Str27<br/>\n37 DwD19<br/>\n38 DwD20<br/>\n39 DwD21, Great Str V<br/>\n40 DwD22, Armor Skin, Con22<br/>\n<br/>\nAB: 43/38/33/28<br/>\nAC w/ Full Plate: 26<br/>\nHit Points: 724<br/>\nInitiative: +15<br/>\nDamage Reduction: 24/-<br/>\n<br/>\nFort: 36 (38)* (40)**<br/>\nWill: 24 (26)* (28)**<br/>\nReflex: 24 (26)* (28)**<br/>\n<br/>\nDiscipline: 43(52)<br/>\nSpot: 43 (54)<br/>\nTumble: 20<br/>\nLore: 1<br/>\nHeal: 2<br/>\n<br/>\n*Indicates Defensive Stance bonus<br/>\n**Indicates Defensive Stance and Dwarf Hardiness bonus<br/>\n<br/>\nAdvantages vs. Dwarven Wall:<br/>\n--Better Damage; +5 more base damage<br/>\n--Quicker: +15 Initiative vs. Wall's +1<br/>\n--Higher Saves: Fort +3, Will +2, Reflex +4<br/>\n--Higher AB: 43 vs 41<br/>\n--Blindfighting, Improved Knockdown<br/>\n-- 54 Spot Skill to aid against Stealthers<br/>\n<br/>\nDisadvantages vs. Dwarven Wall<br/>\n--Only 54 less Hit Points<br/>\n--6 less Damage Reduction<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><em>CBC Conversion</em></span><br/>\nSpoiler [+]<br/>\n<br/>\nFighter 8/ Champion of Torm 10/ Dwarven Defender 22, Any Lawful non-evil Dwarf<br/>\n<br/>\nSTR: 16 (28)<br/>\nDEX: 13<br/>\nCON: 18 (22)<br/>\nWIS: 8<br/>\nINT: 13<br/>\nCHA: 6<br/>\n<br/>\n01 - Ftr(1): Blooded, WF (Note: cannot choose Unarmed Strike)<br/>\n02 - Ftr(2): KD<br/>\n03 - Ftr(3): Blind Fight<br/>\n04 - Ftr(4): STR+1 (17), WS<br/>\n05 - Ftr(5)<br/>\n06 - Ftr(6): Toughness, Dodge<br/>\n07 - Ftr(7)<br/>\n08 - CoT(1): STR+1 (18)<br/>\n09 - CoT(2): IKD, ImpCrit<br/>\n10 - DwD(1): {Class: Defensive Stance}<br/>\n11 - DwD(2): {Class: Defensive Awareness}<br/>\n12 - DwD(3): STR+1 (19), Improved Initiative<br/>\n13 - DwD(4)<br/>\n14 - DwD(5)<br/>\n15 - DwD(6): Mobility<br/>\n16 - DwD(7): STR+1 (20)<br/>\n17 - DwD(8)<br/>\n18 - DwD(9): Spring Attack<br/>\n19 - DwD(10)<br/>\n20 - CoT(3): CON+1 (19)<br/>\n21 - CoT(4): Grt CON (20), EWF<br/>\n22 - Ftr(8): EWS<br/>\n23 - CoT(5)<br/>\n24 - CoT(6): CON+1 (21), ESkF: Spot, EDR I<br/>\n25 - DwD(11)<br/>\n26 - DwD(12)<br/>\n27 - DwD(13): Grt STR (21)<br/>\n28 - DwD(14): STR+1 (22), EDR II<br/>\n29 - DwD(15)<br/>\n30 - DwD(16): Grt STR (23)<br/>\n31 - DwD(17)<br/>\n32 - DwD(18): STR+1 (24), EDR III<br/>\n33 - CoT(7): Grt STR (25)<br/>\n34 - CoT(8): Epic Prowess<br/>\n35 - CoT(9)<br/>\n36 - CoT(10): STR+1 (26), Grt STR (27), Superior Initiative<br/>\n37 - DwD(19)<br/>\n38 - DwD(20)<br/>\n39 - DwD(21): Grt STR (28)<br/>\n40 - DwD(22): CON+1 (22), Armor Skin<br/>\n<br/>\nHP max: 724<br/>\nSaves F/W/R (vs spells): 36/24/24 (38/26/26)<br/>\nAdd'l saves: Traps +1, Poison +2<br/>\nBAB: 30 (4 APR)<br/>\nAB (max, naked): 43 (mundane melee weapon), 32 (ranged)<br/>\nAC (naked/mundane fplate+tower): 17/28 (+1 Dodge, last attacker)<br/>\n<br/>\nSkills (129) - Discipline 43(52), Heal 2(1), Lore 1(4), Spot 43(54), Tumble 20(21)<br/>\n<br/>\nSchedule<br/>\n01: Discipline(4), Tumble(2), S - 4<br/>\n02: Discipline(1), S - 6<br/>\n03: Discipline(1), Tumble(1), S - 6<br/>\n04: Discipline(1), S - 8<br/>\n05: Discipline(1), Tumble(1), S - 8<br/>\n06: Discipline(1), S - 10<br/>\n07: Discipline(1), Tumble(1), S - 10<br/>\n08: Discipline(1), Spot(11), S - 1<br/>\n09: Discipline(1), Spot(1), Tumble(1)<br/>\n10: Discipline(1), Spot(1), S - 1<br/>\n11: Discipline(1), Spot(1), Tumble(1)<br/>\n12: Discipline(1), Spot(1), S - 1<br/>\n13: Discipline(1), Spot(1), Tumble(1)<br/>\n14: Discipline(1), Spot(1), S - 1<br/>\n15: Discipline(1), Spot(1), Tumble(1)<br/>\n16: Discipline(1), Spot(1), S - 1<br/>\n17: Discipline(1), Spot(1), Tumble(1)<br/>\n18: Discipline(1), Spot(1), S - 1<br/>\n19: Discipline(1), Spot(1), Tumble(1)<br/>\n20: Discipline(1), Spot(1), S - 1<br/>\n21: Discipline(1), Spot(1), Tumble(1)<br/>\n22: Discipline(1), S - 2<br/>\n23: Discipline(1), Spot(2), Tumble(1)<br/>\n24: Discipline(1), Spot(1), S - 1<br/>\n25: Discipline(1), Spot(1), Tumble(1)<br/>\n26: Discipline(1), Spot(1), S - 1<br/>\n27: Discipline(1), Spot(1), Tumble(1)<br/>\n28: Discipline(1), Spot(1), S - 1<br/>\n29: Discipline(1), Spot(1), Tumble(1)<br/>\n30: Discipline(1), Spot(1), S - 1<br/>\n31: Discipline(1), Spot(1), Tumble(1)<br/>\n32: Discipline(1), Spot(1), S - 1<br/>\n33: Discipline(1), Spot(1), Tumble(1)<br/>\n34: Discipline(1), Spot(1), S - 1<br/>\n35: Discipline(1), Spot(1), Tumble(1)<br/>\n36: Discipline(1), Spot(1), S - 1<br/>\n37: Discipline(1), Spot(1), Tumble(1)<br/>\n38: Discipline(1), Lore(1), Spot(1)<br/>\n39: Discipline(1), Heal(1), Spot(1)<br/>\n40: Discipline(1), Heal(1), Spot(1)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>Backstory</strong></span><br/>\nSpoiler [+]<br/>\n<br/>\n\"He's waking up—Jaleen, he's waking up!\"<br/>\n<br/>\nThe Dwarf's eyes fluttered for a moment, and then snapped open, his pupils slowly contracting as they adjusted to the torch-lit interior.<br/>\n\"Where am I?\" he asked.<br/>\n\"Shh, you are in the refuge of the Arandiri,\" said a voice as soft as silk. Above him was the most beautiul creature he had ever seen. Pale, delicate and sensuous, the elf's platinum hair cascaded around her face and shoulders while she tenderly dabbed a damp cloth across his brow. And then she smiled, \"but a more important question is, 'Who are you?'\"<br/>\n\"Who am I?\" and he paused, his eyes searching the surroundings as if for some possible clue. He appeared to be in some sort of cavern, natural in formation. All around him were scores of elven women and children, some huddled very close together, and he could see the unmistakable look of fear in their eyes. A pall of doom hung above them, and many of them wept openly. He looked back up at the elf maiden who still smiled gently at him.<br/>\n\"I—I—don't remember,\" he said. \"Where I am? What is this place? Why are these people in fear?\"<br/>\n\"I am Jaleen, Daughter Princess of the Arandiri. We found you ten days ago in the wreckage of a ship that crashed upon our shores. You were the only survivor. In fact, you were the only person we found in all the wreckage. We found no signs of the crew. We took you in and I cared for you and tended to your injuries, but--\" and then a shadow crossed her face.<br/>\n\"But?\"<br/>\n\"But it seems fate has a sense of irony. You survived the sea and shipwreck only to share and witness our doom.\"<br/>\n\"Thou speaketh in riddles, fair lady.\"<br/>\n\"The Morg-Kelzi have come.\"<br/>\n\"Morg-Kelzi?\"<br/>\n\"Yes, it means Black Reavers, and they have gathered again, as they do every hundred years. The Morg-Kelzi are a fell and wicked people who dwell in the dark jungles to the South. Once a century they gather, and then launch devastating attacks upon our people—raiding, pillaging, destroying everything in their path. Before them they drive a wedge of fear, and behind them they leave only desolation. Not even plants are spared of their cruelty, for they burn everything, and plow the earth, and till it with salt and their malevolence. Each time we have been able to withstand their onslaughts, but this time is different. This time they are greater in number than ever we have seen before, and they are led by a Demon, some Beast of the Ancient World, that goes before their horde like a pestilence, and who has slain our people's greatest champions. Even now the last remaining warriors of my people battle these foes outside this refuge. We have barricaded ourselves in here, as this is the last remaining sanctuary.\" She paused and gestured around her. \"These are the last of my people, and soon it will be as if we never have been. So you see, my Dwarf with no Memory, fate spared you only in jest. For now you share our fate, and in a few hours--\" she stopped, and her eyes, moist with tears, looked to the elven children clinging to their mothers.<br/>\n<br/>\n\"I'm sorry,\" she said turning back to the Dwarf. \"I must not let them see me despair. They have been through so much, my people. We are all that remain.\"<br/>\n\"Thou art kind to have sheltered me, in this thy darkest hour,\" and the Dwarf reached a gnarled hand and gripped hers in his. And she could not help but notice the strength in his limbs, the cords of muscle and sinew knotted in his arms, the thick shoulders which were like slabs of granite. And there upon his left shoulder was a strange marking, a brand of some sort that had been burned upon his flesh.<br/>\n\"What does this mean?\" she asked as she reached out to touch it.<br/>\nAnd immediately the Dwarf gritted his teeth and snarled in pain. A flood of scalding memories washed across him, and every sinew in his body strained, his knuckles whitenened, and the cords on his neck went taut.<br/>\n<br/>\nAnd then the moment was gone, and the Dwarf's body relaxed, and he opened his eyes and studied Jaleen. She was a picture of serenity and grace, but he could see the uncertainty in her eyes.<br/>\n\"I remember now,\" he said quietly. \"Tis a rune. A dwarven rune. It means, 'Exile.'\"<br/>\n\"You were exiled?\"<br/>\n\"Aye,\" he said grimly. \"I was a Hearth Guard, a bodyguard to my King, and I had betrayed the Oath of Stone.\"<br/>\n\"Oath of Stone?\"<br/>\n\"Amongst my people, the Oath of Stone is the final ceremony to become a Hearth Guard. Part of the oath states that in a Time of War, the Hearth Guard must stay and protect the family of the King. For the Hearth Guard must have no family of his own, and therefore no obligations but to those of the King's family.”<br/>\n“But,” Jaleen looked troubled, “that means not only can you not have a family, but you must abandon the ones that reared you. How injust!”<br/>\n<br/>\n“Be not so quick to judge. Hearth Guards are honored above all other classes in my society, and they are chosen only once every hundred years. They are not picked at random, nor dost one choose to become a Hearth Guard. It chooses thee.”<br/>\n“I apologize, ” she said, “My people are very different and I was wrong to judge. Please continue.”<br/>\n“Twas a dark day,\" the Dwarf said as he sat up. \"We were under siege by a new enemy, one that we had never seen before. They were akin to thee, tall and fair, except their skin was black like warsmoke, and they delighted in our suffering and woe. And they come upon our people by surprise, thousands of them, and all about them was a black devil magic, and they slew our King at the front gates, and many died, and they streamed unchecked into the Hall of Histories. Several us knew if we could hold them in the Grand Hall, even for a few hours, then that would grant us enough time until reinforcements arrived. We were desperate, and every axe counted. And so I made the choice. I left my post. I left the King's family unguarded. And we staunched their advance. And we won this conflict. And we sent back to the Abyss those red-eyed elves of smoke and flame.\"<br/>\n<br/>\n\"But, the King's family? Did they remain safe?\"<br/>\n\"Aye, they were safe.\"<br/>\n\"So, you did the right thing! You saved your people!\"<br/>\n\"Aye, but I broke the Oath. Above all things, the Hearth Guard must hold true to the Oath of Stone. The Oath of Stone is meant to be unbreakable, inexorable, and stands symbolic of our people’s faith, trust, and loyalty.\"<br/>\n\"I still don't see why you should be punished for saving your people.\"<br/>\n\"Fair lady,\" the Dwarf began, as he grabbed both her hands gently and stared into her eyes. \"If a Hearth Guard is allowed to break the Oath of Stone, the most revered law amongst my people, if he is allowed to break this Oath, then what is our civilization for?\"<br/>\nJaleen slowly nodded her head as she studied the earnest faith smouldering in the Dwarf's steel-grey eyes.<br/>\n\"Thus, the Clan Elders deemed that such a crime is punishable by death….Instead, they chose exile....and that's how I came by this mark upon my flesh. The Elder Council, in spite of my requests, refused me Death.\"<br/>\n\"Don't speak of such things,\" Jaleen cried in dismay.<br/>\n“Nay, I speak only the truth. In their judgment, they also stripped my name from me, for I was no longer worthy of the Dwarven tongue. I am the Dwarf with No Name, a Hearth Guard without a Hearth, a Dwarf without a home, a betrayer to The Oath of Stone.”<br/>\n<br/>\n\"Your tale saddens me. But I am glad you shared it with me in this final hour.\" And then she reached under the Dwarf's cot and pulled forth a great hammer of war. It's heavy handle was wrapped in well-worn leather,and each of the hammer's heads was the size of a man's head. \"When we found you among the wreckage, we also found this.\"<br/>\nThe Dwarf looked at it in wonder, and slowly reached his hand to grasp it.<br/>\n\"I see now,\" he said, and then his mouth dropped and his eyes opened wide. \"It is so clear now, like a bolt from the blue.\" And the Dwarf dropped to one knee and bowed his head. \"Forgive me, Moradin, for doubting thee.\"<br/>\n\"I don't understand,\" Jaleen said.<br/>\n\"Neither did I, until now. Dost thou believe in fate, Jaleen? That there are things greater than ourselves guiding our steps?\"<br/>\n\"I believe that--\"<br/>\n<br/>\nKra-booooom!<br/>\n<br/>\nAnd the whole cavern shuddered, and screams of terrors erupted around them.<br/>\n<br/>\nKRA—BOOOOOM!<br/>\n<br/>\n“Those are the barricades!” Jaleena cried jumping up. “The others have fallen! Quickly everyone, prepare your cups!”<br/>\n<br/>\nThe Dwarf caught her arm as she reached for a goblet at a makeshift table.<br/>\n\"What dost thou mean, 'cups'?\" he growled.<br/>\n\"It's a poison. We are to drink when the barricades fail. We cannot allow ourselves, our children, to suffer at their hands!\"<br/>\n\"Then I have one request of thee. And thou must trust me. Do not drink from these thy cups!\"<br/>\n\"What will you do?\"<br/>\n\"Know this, fair lady: it is by no accident that I am with thee here in this darkest hour. I will force them to pay a heavy price to enter here. This day they do battle with a Hearth Guard, and it will be a battle they are not likely to forget.\"<br/>\n\"And if you fail--\"<br/>\n\"Then thou'st may drink, and perhaps we shall meet again in the next life. Farewell.\"<br/>\n<br/>\nAnd the Dwarf strode to the front of the cavern and stood calmly, warhammer in one hand, and a piece of discarded timber in the other, and waited. Jaleen herded her people to the rear of the cavern where they crouched anxiously in the shadows.<br/>\n<br/>\nKRA----BRAAACCKKKKKK<br/>\n<br/>\nAnd the barricade was sundered in a cloud of dust, smoke and splintered wood, and the Dwarf was engulfed in the billowing dust, and then a silence followed. And when the dust and smoke cleared, the Dwarf stood firm, unmoving, jaw set, completely covered in a thick brown layer of dust and debris, and the light from outside streamed in through the entrance and splashed across the Dwarf's mighty frame and form, and silhouetted him like some mythic champion from an age primordial.<br/>\n<br/>\nIn poured the Morg-Kelzi, a writhing twisting mass of screaming savages, their bodies painted a chalk white and a pitch black, and they wore nightmarish visages upon their faces, masks made of bone and skull, painted in the likeness of faces of madness and horror, and they hurtled their bodies headlong through the cavern entrance, swinging wicked axes and spiked flails and weapons crafted with foul intention.<br/>\n<br/>\nAnd they almost rushed by the Dwarf, for he appeared to be a statue to them, and he emanated no fear, for they could smell it, for that odor came from the rear of the cavern.<br/>\n<br/>\nBut with a twist of the wrist and a shrug of the shoulders, four bodies thudded to the ground with crushed skulls. And then the howling Reavers quickly became aware of the threat, and the battle was joined. The Dwarf never moved, save for the hammer that swung in a deadly arc, whistling as it sailed through the air, accompanied by the steady cadence of cracked skulls and crushed sternums. And the corpses piled high around the Dwarf, until the entire entrance was choked with corpses of the Morg-Kelzi, and he stood upon them as if they were battlements, while the Reavers scrambled up the sides only to join the fallen.<br/>\n<br/>\nThree times they charged him. Three times they crashed upon him like an angry sea. Three times did that sea crash and falter, and recede back. Their fallen could no longer be counted, so great was their loss. And the Dwarf stood sure-footed atop the mass of the fallen, besmirched in blood and grime, his great chest heaving, his sinews rippling, but he showed no signs of fatigue.<br/>\n<br/>\nAnd then came the Beast of which Jaleen had spoken. The once fearless Reavers fled before its approach like flooded rats. It lumbered into the cavern, and the earth groaned beneath each of its footfalls. It was a great winged thing, nearly twice the height of man and equally broad. Its skin was like a mottled fungus, and its head was crowned by deadly horns the length of broadswords, it's clawed hand clutched an ebon spear whose shaft was thickness of a small oak, and its eyes burned with a bestial light.<br/>\n<br/>\nAnd its roar, like an avalanche, thundered throughout the cavern, and all who heard it through themselves to the ground in pain and dismay. But the Dwarf with No Name stood firm as rock, and his grim glare blazed through his bloody countenance in defiance of the beast.<br/>\n<br/>\n\"I am Death, miserable creature!\" its voice rumbled like the sound of boulders grinding, and its wings unfolded and stretched behind him on foul leathery pinions.<br/>\n<br/>\n\"Then make thy claim, creature. I do not parley with base Hellspawn!\"<br/>\n<br/>\nAnd the battle that ensued was the stuff of legend. So titanic was their struggle that they battled through day and deep into night. But the Dwarf never flagged, never wavered, never fatigued, and the Demon became more and more enraged by this opponent who would not yield, until finally, as the rays of the morning sun crept into the cavern to light up the combatants, the Dwarf took such a blow that he sunk to his knees. And, to the Demon's surprise, the Dwarf did not rise. And the Demon hesitated, for he knew this was his hour, and that the Dwarf awaited the deathblow. And the Demon cackled in hideous delight so great was his pleasure, and he lifted his foul spear high above his head and brought it down with such violent force that it sank deep into the rock where the Dwarf had stood.<br/>\n<br/>\nBut the Dwarf was not there, for during the monent in which the Demon hesitated, the Dwarf tumbled through the Demon's legs, and as the spear plunged through the rock, so was the Dwarf's hammer shattering the spine of the monster.<br/>\n<br/>\nAnd its howl deafened those in the cavern, and echoed off the hillsides. And in panic it tried to free the spear from the rock, but it held fast, and the Dwarf came upon the Demon in a passionless fury, and blow after blow rained down upon the beast until it was upon its knees, its wings limp. And the bestial light in its eyes was snuffed. And the Dwarf, with one final blow, knocked the head so soundly from its shoulders that it tumbled outside and rolled down the slopes and came to a rest at the feet of the remaining Morg-Kelzi. Their spirit then was completely sundered, and they fled for fear of the \"Elf Demon\" who had come to punish them for their wickedness.<br/>\n<br/>\nSo complete was the Morg-Kelzi's defeat that they never again troubled the peaceful Arandiri.<br/>\n<br/>\nAnd Jaleen crept from the corners of the cavern to where the Dwarf stood silently, alone, amidst the gruesome carnage. She reached a trembling hand to his shoulder, and he turned slowly around, and the hammer fell away from his hand. His body was rent from wounds too many to count, and his eyes were distant.<br/>\nBut his focused in on hers, and he said, \"My hearth.\"<br/>\n<br/>\nAnd he fell to the floor, and Jaleen tried to catch him, but his girth was too great and she was borne to the ground as well. But she was able to hold him, and cradle his head, and she sang an old Arandiri lullaby as the last breath left his lips, and as she held him she felt a surge of heat upon her hand where she gripped the Dwarf's shoulders. She moved her hand and saw the Rune branded upon his shoulder shine with a soft white light. It flared for an instant, and she shielded her eyes, and then the light was gone.<br/>\n<br/>\nAnd no trace remained of the branded Rune.<br/>\n<br/>\nAnd thus the legend was born, how the greatest champion of the Arandiri was not an Elf, but a Dwarf. A bond was formed among the two peoples, and the Dwarf with No Name was named anew by his kin, though his body was laid to rest in Arandir, and a great cairn was built around the cavern refuge where he had fallen. And it was built by the hands of Elves and Dwarves alike, and this monument stood, like a beacon, and shined as an emblem of hope and faith between the two nations.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<span style=\"text-decoration:underline\">Builds using same class split (just one):<br/>\n</span><strong>The Doorman</strong> by mphacon (Fighter8/CoT10/Dwarven Defender22)<br/>\n<br/>\n<span style=\"text-decoration:underline\">Builds similar conceptually (one more):</span><br/>\n<strong>Fighter 8 / DwD 26 / CoT 6</strong> by BobHund_no  (DwD wall w/o focus on initiative)</div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "8:10 PM - Nov 14, 2020",
      "content": "<div>Used this on Aielund (with henchmen) and Mines of Twin Summit as a solo. He is truly indestructible! Superb build.</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "6:32 AM - Nov 15, 2020",
      "content": "<div>Oh boy.  Where'd you guys find this one?  Oldie but a goodie.  Need to clean up that prose a bit.  I would probably change a few things were I to play him today.  The iniative feats ... that was in the days when, in a battle of knockdowns, whoever had the better iniative would get theirs off first.  Not as important these days, but my opponents then were often KD-spamming warriors or Rogues from the Halls of Advanced Training. Probably would drop Improved Iniative and Spring Attack for the Disarm line of feats.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:35 AM - Nov 15, 2020",
      "content": "<div>Improved Disarm would be awesome.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:49 AM - Nov 15, 2020",
      "content": "<div><blockquote><div><cite>grizzled_dwarflord wrote: <div class=\"responsive-hide\">Nov 15, 2020</div></cite>Oh boy.  Where'd you guys find this one?  Oldie but a goodie.  Need to clean up that prose a bit.  I would probably change a few things were I to play him today.  The iniative feats ... that was in the days when, in a battle of knockdowns, whoever had the better iniative would get theirs off first.  Not as important these days, but my opponents then were often KD-spamming warriors or Rogues from the Halls of Advanced Training. Probably would drop Improved Iniative and Spring Attack for the Disarm line of feats.</div></blockquote>\nMea culpa, Dwarflord. I then had my own go at making him a bit more 1.69-ready (Hip gives the link in the OP). I wasn't playing him in a disarm environment, and ended up giving him a full line of both blunt and slashing damage (warhammer and Dwarven waraxe) instead.<br/>\n<br/>\nStill one of my favourites!</div>",
      "author-color": "#AA0000"
    }
  ]
}