{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "191",
  "name": "Pure(ish) Monk - Elven",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pure-ish-monk-elven-t2354482.html",
  "author": "d20dyke",
  "avatar": "10235276_1510287070.gif",
  "replies": 6,
  "posts": [
    {
      "author": "d20dyke",
      "avatar": "no_avatar.png",
      "timestamp": "7:28 PM - Dec 03, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I have a character that's entirely fleshed out in concept, but unfortunately her original build isn't legal on the server where I play her now. Long story short, she's a blind elf that's also an escaped slave. I'm hoping to make her an unarmed monk, as she would have been beaten to within an inch of her life had she been caught with a weapon in hand. Same thing with armour. Now, the server I'm on is one where levelling is extraordinarily slow, but it *is* capped at forty.<br/>\n<br/>\n Just going to go down the list to start, and will fill in the blanks as I go or at the end.<br/>\n<br/>\n 1) PvM would be preferred. She's really not one to pick fights with people, but since she's out in the wilds an awful lot, she has to be able to defend herself. <br/>\n<br/>\n 2) Level cap - 40, though it's crucial to be playable throughout, as levelling is beyond slow.<br/>\n<br/>\n 3) Race preference - she's an elf. A moon elf, to be precise.<br/>\n<br/>\n 4) Class preference - I'm hoping to make her a pure monk, or as close to pure as possible. Druid/Monks are illegal, and at least three levels must be had in all classes. Since I don't see her using weapons or armour...and since she can't read scrolls/spellbooks, it seemed pure monk would be best.<br/>\n<br/>\n 5) Melee preference - She's sort of frail, so defenses can be slightly lowered. When provoked to fight, however, she's efficiently brutal. Not much for takedowns, because she doesn't want to risk them getting up and coming after her. The basics are all she really seeks, but I'm fine with either high damage strength based or high AC dex based. Something where she can be self sufficient would definitely be preferred, as she doesn't trust people enough to rely on them.<br/>\n<br/>\n 6) Ranged preference - virtually nonexistent<br/>\n<br/>\n 7) Weapon preference - unarmed, even though I know it's not typically preferred. She won't touch a blade.<br/>\n<br/>\n 8) Maximum item enhancement - not certain of the maximum, but I know magic items are difficult at best to acquire<br/>\n<br/>\n 9) Spellcasting - I don't see her using magic much, especially since so much of it would require sight (scrolls, etc)<br/>\n<br/>\n 10) Custom factors - If allocating skill points, heal and listen are must haves for her, as is tumble. Discipline is a given for monks, as well.<br/>\n<br/>\n If there is anything else you'd like/need to know, please don't hesitate to throw questions/comments/concerns my way. <br/>\n<br/>\n Thank you!<br/>\n<br/>\n -d20dyke<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:33 PM - Dec 03, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">My first insti8nct is to advise you to take 4 levels of fighter pre-epic to get that extra attack per round (6 instead of 5), and then either 2 or 6 more levels of Fighter in epic, but since neither Monk nor Fighter is the favored class for an Elf, you would have a 20% experience penalty. It might be worth it to get +6 damage from WS / EWS as well as the extra attack, but it is up to you to decide.<br/>\n Another idea is to take 5 levels of Shadowdancer, not for HiPS, which is really nice, but for Uncanny Dodge to keep your DEX armor when flat-footed, and for Defensive Roll to qualify for Epic Dodge, which makes you harder to hit.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "d20dyke",
      "avatar": "no_avatar.png",
      "timestamp": "1:56 AM - Dec 04, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">XP is such a difficult thing to get on this server...I don't think the penalty would be worth it, but I might do it later on. Come to think of it, I'd have little objection, so long as the benefits were worth it. And shadow dancer takes an application, as does any prestige class, which means it's a hassle not worth fighting through. What would you recommend for starting stats? <br/>\n<br/>\n -d20dyke<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:19 AM - Dec 04, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Take 4 CoT levels after Monk 10.  You may need to qualify by \"faking\" an unused weapon focus, but it shouldn't matter. (IIRC unarmed WF doesn't qualify for CoT)<br/>\n<br/>\n You do realize that you are significantly handicapping a monk build by going with elf, don't you?  Even halfling would be better. But to each their own, I suppose.  RP can be hell :P<br/>\n<br/>\n If you are set on a fister, I'd strongly consider an alternative to STR... a WIS Monk.  You'll gain AC that cannot be lost by flankers or flatfeet and build a dominant SF DC to make all mages cringe to see you closing.  BTW, stuns last 3 times longer than KDs and operate independent of the relative character size difference.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "d20dyke",
      "avatar": "no_avatar.png",
      "timestamp": "3:12 PM - Dec 04, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Unfortunately, I'm well aware of the handicap. It's the price I pay for story. With any luck, she'll find someone she can fall in with so she's not venturing out into the world alone forever. <br/>\n<br/>\n If it were an easy request, I'd have played around with creating a build myself. But I'm just stuck here. <br/>\n<br/>\n I think ive only made one unarmed monk before, and she was human in a magic heavy world. She was surprisingly awesome. Thing is, I don't think I can replicate her here, especially not with an elf. <br/>\n<br/>\n I don't think I've made any CoTs. What would be the benefit of doing such? <br/>\n<br/>\n -d20dyke<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:30 PM - Dec 04, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>d20dyke wrote:</strong><hr/>--clip--<br/>\n<br/>\n I don't think I've made any CoTs. What would be the benefit of doing such? <br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">It's basically a fighter with better saves and smite.  Since it is a prestige class, it will bypass your concern about losing too much XP and still achieve the highest monk APR possible (BAB 16 @Lvl20).  You'll get the 2 fighter bonus feats and +2 universal saves.  The only caveat is, like WM, unarmed does not qualify as a melee weapon so in this case, there's the rub... a throw-away WF feat.  Also, CoTs cannot be evil.  But unlike WMs, CoTs do not have to avoid unarmed attack to reap the class benefits.<br/>\n<br/>\n IMO the monk progression is the most significant reason to go with the class.  2nd is probably the uniquely-dominant base saves. The lawful constraint can oft times limit your building flexibility, but there are work-arounds..<br/>\n<br/>\n One thing that I am curious about, though... which server are you planning to play this build and are there any build constraints which contributing members should be made aware of before beginning to throw out a fully, detailed build?</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:13 AM - Dec 07, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Since all base classes excapt for Wizard (useless for this build) give you an experience penalty, and all prestige classes require you to jump though hoops, it looks like a pure Monk build would be best. I think that the second one I posted on page three of this thread: <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2293896#.VmUqgb8-Kc6\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/22 ... mUqgb8-Kc6</a> could be adapted from Halfling to Elf, and from kama to unarmed, and work for you.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}