{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "225",
  "name": "Happy New Year (belatedly)!",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/happy-new-year-belatedly-t2354488.html",
  "author": "Templar",
  "avatar": "10404082_1510287071.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:51 PM - Jan 10, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello bevryoddy - hope you're all well!<br/>\n<br/>\n I've not been around for a while - three reasons: i) crappy IT, which I believe is now resolved - to the extent that I can now download HAKs, CEPs and other mushrooms without everything blowing to smithereens, hoorah!; ii) in hushed tones - I've been playing Baldur's and Icewind - tell no one; and iii) I made about six or seven flaccid atrocities of the last build I was looking to construct, and I was too ashamed to present any of them to your illustrious company - it's still on the backburner, though...<br/>\n<br/>\n Anyway, just thought I'd say hello again - it's good to be back.<br/>\n<br/>\n Oh, and I see Hip Replacement is here - and there was me thinking him naught but a legend! And referencing your recent Santa debate...surely you need look no further? (Though to my mind he would be a judgemental, unforgiving zealot - rather than your easy-going, workaday type of zealot - so paladin/conjuror/purple-people-eater seems closest)<br/>\n<br/>\n One last thing - Empyre, you are an absolute star - thanks for your continuing posts on my original thread, I haven't been able to have a look for some time, but now I can, I have, and it appears you can play a bit.., ;)<br/>\n<br/>\n You may notice that I still babble on, and on, and...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:11 AM - Jan 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey!  The more the merrier, no?  We'll assume your New Year greeting was based on the ancient Hellenic calendar which make your greeting timed just perfectly <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n I must have missed your contributions in my absence so by all means, persue whatever your heart desires in whatever fashion is most comfortable.  And yes, I am<strong> also</strong> grateful for Empyre's persistence and dedication to the spirit of expertise in designing.<div align=\"center\">So...</div>\n<div align=\"center\"><span style=\"font-size:150%;line-height:normal\"><em><strong><span style=\"color:#0000FF\">Happy New Year</span>!</strong></em></span></div>\n<div align=\"center\">back at ya</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:59 PM - Jan 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>and iii) I made about six or seven flaccid atrocities of the last build I was looking to construct, and I was too ashamed to present any of them to your illustrious company - it's still on the backburner, though...</div></blockquote>\n<div align=\"left\">Now you made me curious :)<br/>\n<br/>\n ...and by the way; Happy new year!</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:23 PM - Jan 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hiya, Mick. I wouldn't let your curiosity get the better of you: I was trying to marry Monk, Bard and RDD, but the alignment change kept taking me roughly from behind whenever I wasn't paying due heed. So I tried furtling around with Monk, Fighter, WM, and that was even worse (particularly as it appears you can't use unarmed strike as your WoC. Arse.) There's something to that maxim about running before you can walk...<br/>\n<br/>\n I blame Empyre (hee-hee). If it wasn't for his awesome Order of the Wyrm (both unarmed and kama versions), I wouldn't have gone near this. Oh, and you too, Monsieur Le Daggeur - for getting me interested in Dex builds! There I was, happy in my knuckle-running, when all of a sudden...<br/>\n<br/>\n I've been a Guild member for a year now, yet it appears I've learned nowt. I am going to give 'evil' a proper go this year (even though randomly slaughtering a bystander seems a tad harsh to stay within alignment), primarily so I can have a real bash at a Shadow-Dancer/Assassin build - which I still think should be by default neutral, but hey-ho.<br/>\n<br/>\n But before I do, I must finish BG2 - I'm off to have stern words with the nasty Drow assassin/mage...<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:21 AM - Jan 12, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the kind words. I don't know what to say, but it would have been rude so say nothing.<br/>\n May your 2016 be at least as good as 2015, or even better!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Templar",
      "avatar": "10235261_1528181864.jpg",
      "timestamp": "6:16 AM - Jan 19, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">:) Hope the new year treats everyone wonderful! half way through the first month!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}