{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "305",
  "name": "Call for PRC Builders",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/call-for-prc-builders-t515388.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": "1",
  "views": "501",
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:47 AM - Jul 28, 2011",
      "content": "<div>Which of you folks are adept at building for the PRC classes and races?<br/>\n<br/>\nI know there is no Excel CBC for the PRC available but is there some sort of creation simulator that will at least help to establish the starting abilities?  I would prefer not to install the entire PRC just to be able to do this (actually, it's quite impossible to procure a huge download like the PRC without calling in mucho favors from friends so that is never going to happen in this lifetime for yurz troolie).<br/>\n<br/>\nI really believe anyone like myself who understands many of the basics of building yet is unfamiliar with the nuances of the PRC environment should still be able to offer valid build suggestions if we have some basic tools at our disposal.  An on-line one would be perfect <br/>\n<br/>\nAny links, suggestions and/or ideas?</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "3:17 AM - Jul 28, 2011",
      "content": "<div>I'm afraid you've gotta do it old school style. If it's for build advice you ain't required to actually test the build and hopefully someone else can catch a blatant mistake. Suggestions based on knowledge acquired from the PRC manual can be quite helpful, especially if complemented by a character builder's mindset (like you have).<br/>\n<br/>\nNow, if we have enough interest developing I can open up a PRC section of the forums where to publish tested builds, which implies having the PRC downloaded and installed. And a huge amount of time to just come out with a focused build idea, ah!<br/>\n<br/>\nAnyhow, if anyone knows of any kind of utility to help develop PRC builds, please don't be shy. I'm all ears... well actually eyes</div>"
    }
  ]
}