{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "959",
  "name": "Bard/CoT? I'm amazed this thread os still going on",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bard-cot-i-m-amazed-this-thread-os-still-going-on-t2354905.html",
  "author": "Boxcrab",
  "avatar": "10758928_1529659321.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Boxcrab",
      "avatar": "10758928_1529659321.jpg",
      "timestamp": "12:49 PM - Jun 22, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello! I'm trying a build setup wich I will present a more detailed blueprint lateral on, but would love to see some foreign insight, it's for a RP server, capped at 10 or 15 (depends on the time played), with a Minimum of 3 levels for each class.<br/>\n<br/>\n1) PvM or PvP - some people don't carrera about PvP, I really don't neither, but others do and are alloud to confront you, very awkward. I'll say that, if it's good for PvP It should be good for PvM xD<br/>\n<br/>\n2) Level cap - 10 or 15<br/>\n<br/>\n3) Race preference - Any<br/>\n<br/>\n4) Class preference - Bard or Paladín. CoT would be nice but Rapier Focus can harm a paladin aproximation since only one god allows it un a forgottem realm setup (neutral good).<br/>\n<br/>\n5) Melee preference - Shield, rapier and high AC. <br/>\n<br/>\n6) Range preference - DEX archery or Zen Archery (WIS)<br/>\n<br/>\n7) Weapon preference - Rapier!<br/>\n<br/>\n8) Maximum item enhancement - I would say that armor bonus is +4 top, weapon +3, +2 for elemental 1d4/1d6 aproximations.<br/>\n<br/>\n9) Spellcasting - Not necesary, but wands and scrolls hace their relevance. Improcedencia invisibility wands are a thing that can be crafted by mates.<br/>\n<br/>\n10) Custom factors - It's a PW RP server, so munchkin setups aren't good unless you want to stay at 10. You have some custom feats, dash for a quick sprint with bonus attack, knockdown is free, like feint, works with STR and you can get improved versión. And expertise goes Up ti -+5 with improved being -+10, depends on your AB and what you want to set It up with<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:22 PM - Jun 22, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It seems to me that the best solution would be straight Paladin(15), because of the buffs that cap at (+5) exactly at that level. I don't understand PW's with that many restrictions but it's up to you. Start with Str15 (18) Dex(8) Con(12) Int(10) Wis(14) Cha(16). Feats are WF: Rapier, IC: Rapier, Power Attack, Divine Might, Divine Shield, Blind-Fighting, Extend Spell. This should rock in a low-magic, low-level world.<br/>\n<br/>\nGood luck,<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Boxcrab",
      "avatar": "10758928_1529659321.jpg",
      "timestamp": "2:40 PM - Jun 22, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi! Thanks for such a short reply.<br/>\n<br/>\nWouldn't It be simply suboptimal for saving throws compared with multiclassing and facing wizards por clerics? <br/>\n<br/>\nGoing for STR, and being the choice of picking Rapier, isn't It simply verter going for Long Sword? <br/>\n<br/>\nAlso... Isn't divine might not worth it since you aren't focusing on charisma? (Compared for example vs a feat like improved critical, wich never expires)<br/>\n<br/>\nAsking purely for a healthy disscussion :)<br/>\n<br/>\nPD: Any other advice for that cap?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:51 PM - Jun 22, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You already have improved critical for your rapier (IC) listed on the recommended feats to take.<br/>\n<br/>\nYour charisma is fine at 16. Paladins have two spells that they stack to raise this to 24 and then with a single (+4 charisma) item you max-out at 28. This will allow you to do +9 damage with divine might and have +9 AC with divine shield. The duration would be 9 rounds for each use of your abilities. Getting your charisma to 28 will also give you a great (+9 to all saves) boost to your saving throws. Other classes might have trouble maxing out their main attribute scores in such a low magic-world but Paladin's do not. I have played myself in low-magic worlds and have seen with my own eyes Paladins there, they were on another level so to speak in terms of abilities (also arcane archer-rogues) and power.<br/>\n<br/>\nWith your Paladin, the best choice for you is to take an elemental rapier (1d6 elemental damage, +2 enchantment) and then cast Greater magic-weapon on it. You will now have a +5 rapier with 1d6 elemental damage! Next, cast Divine-favour on you and finally Divine-might, you will suddenly hit like the express-train with your rapier inflicting 60-70 damage with each critical hit to your opponents! And if you find a keen rapier you will be able to crit from 12-20. You will have to play him right though, Paladins do require a certain minimum level of knowledge to get the most out of them.<br/>\n<br/>\nOther good advice for 15th level capped Pw's include Fighter(8)/Weapon-master(7). This is the simplest option, you go and whack hard with your weapon, that's all it does, but it does it superbly. Get a two-handed Axe for this and see the criticals get to three-digit numbers. It doesn't have the same amount of defences as the Paladin has though. A Cleric 15th level would also be very good. but he is slightly more complicated to use (more buffing) than Paladins are.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}