{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "187",
  "name": "Revising Old Builds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/revising-old-builds-t2354903.html",
  "author": "Maximillian_Kane",
  "avatar": "10758866_1605883460.jpg",
  "replies": "10",
  "views": "538",
  "posts": [
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "11:40 PM - Jun 18, 2018",
      "content": "<div>Hail, everyone!<br/>\n<br/>\nSo, I've been thinking. NWN is SO complex and beautiful that one truly never stop learning it. A poker saying (twenty minutes to learn, a lifetime to master) might very well apply to it, except for the 20 minutes to learn thing.<br/>\n<br/>\nI recently got from my friend BC, the newer CBC version, which reduces file sizes from 15 MB to less than 3, while retaining all functionalities. That has caused me to take a new fresh look at ALL my builds as I \"upgraded\" them into the new version, and I tell you, I have now, more than ever, a CLEAR picture of how much I've grown over the years since I last posted these builds. I looked at my own choices and I thought: \"why the HELL would I do that?\". The answer, most of the times, was simple: I didn't know enough about the game to know better.<br/>\n<br/>\nAs a result, NOT A SINGLE build has come out unscathed. As I grew as a player, I found out the sweet spots for each skill, how they work and to which builds they're more useful. I also changed the way I prioritize feats, because back when I used to get surrounded all the time with no fear of getting hit, Power Attack, Cleave and Great Cleave were absolutely essential, and Expertise was just \"more unnecessary AC\". Nowadays, having played on WoG, where if you're surrounded, as a rule of thumb, the only way you'll come out is dead, save very few exceptions, where low caster levels means you WILL get dispelled, where taking 3 melee classes means you WON'T be able to level past a certain point, without some very cheap tactics, anyway, where if you don't KD a mage, or wear a Death Immunity item against high level mages that are immune to KD, you're in for a WORLD of pain and will most likely die. This invaluable experience has changed me as a builder<br/>\n<br/>\nMy Holy Weapon Master With Cheese is unplayable on WoG in its original version, so I made her a Paladin 19 / Rogue 2 / WM 19, but even in the default 26 / 13 / 1 version (the one that's posted here), I reworked a lot of feats.<br/>\n<br/>\nMy Magical Master is no longer a dual-wielder, although this may be a WoGism, since there aren't many good Kamas in the server. Although the reason I chose to forego it was so that I could have Knockdown to disable mages, more specifically drow ones, who are spell resistant and immune to Bigby 6 (mine, anyway, due to low caster levels).<br/>\n<br/>\nAll of my builds had 40-43 UMD, nowadays, I always stop at 35 modified ranks, so I save a few skill points there, which can go a long way in other useful skills. I also didn't know my traps well, so I wasted a whole bunch of skill points on Trap Skills by going over certain thresholds, which I now use much more appropriately.<br/>\n<br/>\nThere's much more that I now may have forgotten, but my question is: should I repost their updated versions? If so, should I do it in a separate topic or should I just post them in their previous threads?<br/>\n<br/>\nI ask because I've met many people who play or have played my builds over the years, and I feel that if I don't repost them, these people won't have access to the \"latest content\". I saw, for example, Mirnaia's post about playing the Magical Master and he was dual-wielding Kamas, which is the \"old version\" of the build. <br/>\n<br/>\nWhat do you guys think about this?<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:43 AM - Jun 19, 2018",
      "content": "<div>Hey Max!<br/>\n<br/>\nIn essence, this seems like a really good idea, and from a purely technical approach I'd say rebuilds should be posted outside their original threads - I know Hip's filter only works with the first build in any given subject. However, I also know that Hip's been absent for over a year, so things could get problematic. Your call, I guess.<br/>\n<br/>\nOne thing strikes me, however, and this is not attempting to detract from everything you have and continue to bring to the guild, and (as a second disclaimer) I have read your guides to playing and building. But not everyone plays like you, or wants to. Now, you may well see them as mistaken, and that's fair enough, but that's not your call is it? Otherwise there's only one way of \"winning\", and that's missing the point of the whole thing, isn't it?<br/>\n<br/>\nAnd just stop it with the \"well, on WoG...\" stuff. Point made and taken, thanks.<br/>\n<br/>\nI'm in playful mood, so am looking forward to what's going to come back from this...<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:52 AM - Jun 19, 2018",
      "content": "<div>I suggestion would be to edit the new build into the first post of the old thread, but have the old build in a spoiler, so people can see what the comments are commenting on. Also, bump the thread, putting the new build in the new comment.<br/>\n<br/>\nIn case you don't already know, to put the build in a spoiler, put [/spoiler] after the build and the same thing without the slash before the build.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "2:21 AM - Jun 19, 2018",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>Hey Max!<br/>\n<br/>\nIn essence, this seems like a really good idea, and from a purely technical approach I'd say rebuilds should be posted outside their original threads - I know Hip's filter only works with the first build in any given subject. However, I also know that Hip's been absent for over a year, so things could get problematic. Your call, I guess.<br/>\n<br/>\nOne thing strikes me, however, and this is not attempting to detract from everything you have and continue to bring to the guild, and (as a second disclaimer) I have read your guides to playing and building. But not everyone plays like you, or wants to. Now, you may well see them as mistaken, and that's fair enough, but that's not your call is it? Otherwise there's only one way of \"winning\", and that's missing the point of the whole thing, isn't it?<br/>\n<br/>\nAnd just stop it with the \"well, on WoG...\" stuff. Point made and taken, thanks.<br/>\n<br/>\nI'm in playful mood, so am looking forward to what's going to come back from this...<br/>\n<br/>\nCheers</div></blockquote>\n\nHey dude! <br/>\n<br/>\nThe \"whole WoG thing\" was what opened my eyes. I know people don't play like me and by no means am I caiming it's the only way. I look at this more like a ladder, or a leveling of the builder, if you will. I've been where you guys are, I've made loads of Aielund playthroughs, and then I moved on. There's a monster in character building called \"the comfort zone\". Nothing wrong with staying there, but....<br/>\n<br/>\nDo you remember when you first came into the guild and in EVERY post you made I would tell you that you should play Aielund instead of the OC? I remember you being \"sick\" of my bashing of the OC. Yet, you kept playing the same module over and over again. Nothing wrong with that either, but...<br/>\n<br/>\nAfter what? 2 years? You finally went ahead and tried Aielund out. Now, the other day I read a post of yours in which you mentioned that Aielund was your personal favorite (or one of your personal favorites). Am I correct? And it only took 2 years! <img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji4.png\"/><br/>\n<br/>\nMuch in the same way Aielund was a \"step up\" in competition for you back then and now is part of your comfort zone, WoG (or any other similarly challenging environment, but I don't know any) is possibly next on the line. Now, maybe this idea will keep marinating in your head for the next two years, and then you'll give it a go. Maybe 5 years from now, you look back and go: \"Now I understand what you were trying to tell me.\" Or not <img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji23.png\"/><img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji23.png\"/><img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji23.png\"/><br/>\n<br/>\nI guess what I'm saying is that there are many different ways to have fun. In SP modules, it's more about the story, RPing characters, and less about actually testing your builds. But, our bread and butter here is building, and for that purpose, the stiffer the challenge, the better! <br/>\n<br/>\nYou can't call yourself an Epic Character Builder until you've tried out a hard server, like you can't call yourself a professional fighter by beating up skinny nerdy kids with glasses. <img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji23.png\"/><img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji23.png\"/><img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji23.png\"/><img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji23.png\"/><img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji41.png\"/><br/>\n<br/>\nTake care, brother!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "2:30 AM - Jun 19, 2018",
      "content": "<div><blockquote><div><cite>Empyre65 wrote:</cite>I suggestion would be to edit the new build into the first post of the old thread, but have the old build in a spoiler, so people can see what the comments are commenting on. Also, bump the thread, putting the new build in the new comment.<br/>\n<br/>\nIn case you don't already know, to put the build in a spoiler, put [/spoiler] after the build and the same thing without the slash before the build.</div></blockquote>\n\nThe problem there is that I lost access to my old account, so I can't edit the OPs. I guess I'll just post them down below.<br/>\n<br/>\nThanks!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:45 AM - Jun 19, 2018",
      "content": "<div>Hey max,<br/>\n<br/>\nI for once would love to see your evolved builds, especially if the changes make them more playable in HC environments.</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "4:31 AM - Jun 19, 2018",
      "content": "<div>I too would like to see the evolved builds.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:33 AM - Jun 19, 2018",
      "content": "<div>Hey Max!<br/>\n<br/>\nI was expecting harsher treatment, damn it!<br/>\n<br/>\nYou're dead right about SP modules, it's about storylines and RP as much as anything, or, unless going into a PW, you might as well spend all your time in a trainer mod. And what you've said about WoG I <strong>have</strong> taken to heart, and am committed to playing there soon(ish) - it's just the constant banging on about it I decided to bite at <span class=\"text-emoji\">😋</span><br/>\n<br/>\nI know I'm no master-mason here, and wouldn't dream of saying I was. I suppose I see my role more as an agent provocateur, if I'm being generous to myself, or an inquisitive child if I'm being more honest. And they're allowed to have the occasional hissy fit/temper tantrum, aren't they? But I'm still here, and still keen to learn - which I can only do by asking questions, right?<br/>\n<br/>\nAnd I know I would certainly like to see how your classics have evolved over time - and the same would also be true for builds from our other greats (and yes, you know who you are). Again, a learning experience! Maybe a new thread in the Full Epic forum a bit like the Yardstick Builds one in the Build Requests forum? Just trying to be helpful in Hip's absence.<br/>\n<br/>\nRegardless, I always enjoy our banter, Max <span class=\"text-emoji\">😘</span><br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:21 PM - Jun 20, 2018",
      "content": "<div><blockquote><div><cite>Empyre65 wrote:</cite>\nI suggestion would be to edit the new build into the first post of the old thread, but have the old build in a spoiler, so people can see what the comments are commenting on. Also, bump the thread, putting the new build in the new comment.<br/>\n<br/>\nIn case you don't already know, to put the build in a spoiler, put [/spoiler] after the build and the same thing without the slash before the build.\n</div></blockquote>\nI agree with Empyre on this one!<br/>\n<br/>\n@ Max<br/>\nIf you for some reason have lost access to your old login, you can of course start a new thread. You can even copy content from your old thread and put it in your new one if you want the old build for comparison.<br/>\n<br/>\nEdit: I look forward to seeing the new Holy Weaponmaster with not quite so much Cheese. <span class=\"text-emoji\">😜</span></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "12:45 PM - Jun 26, 2018",
      "content": "<div><blockquote><div><cite>Maximillian_Kane wrote:</cite>\nI saw, for example, Mirnaia's post about playing the Magical Master and he was dual-wielding Kamas, which is the \"old version\" of the build. \n</div></blockquote>\n\nI did eventually have the courage to take the CBC and tweak it. I am currently experimenting with the magical master in solo WoG, and I am single-kama - exactly to get BF, KD and craft wand instead of the dual weapon feats. Changed to a dwarf because 40% xp penalty ROCKS (actually, because of deity restrictions), and tweaked a few skills. You need to start with different ability scores but the end result is the same.</div>"
    },
    {
      "author": "Scythius",
      "avatar": "10759001_1543250173.jpg",
      "timestamp": "5:55 PM - Nov 27, 2018",
      "content": "<div>Love the guides and builds you made in 2011 and would honestly love to see them updated, preferably in the old threads with thoughts about why the changes were made.</div>"
    }
  ],
  "author-color": "#00AA00"
}