{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "017",
  "name": "How to change alignment during NWN 1 modules including a Paladin/Blackguard playthrough example",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/how-to-change-alignment-during-nwn-1-modules-inclu-t2355081.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "0",
  "views": "6.3K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:34 AM - Jun 20, 2019",
      "content": "<div>Hi all ECBers,<br/>\n<br/>\nThere are a couple of builds out there that require alignment changes to be viable, however there is a lack of guides or information on how to actually obtain these alignment shifts in game and in practice. I've asked this forum last week and googled and there isn't a huge amount. There is a lot of discussion about maintaining alignments and even a module published to 'fix up your alignments' after playing your characters through single player modules. But none about how to change your alignment in game. So it's time for me to share my experience and provide some tips/advice and hopefully you will find this post a unique and positive contribution!<br/>\n<br/>\nFor those of you out there who have done this before but haven't posted yet, please feel free to comment. You may have much more expertise on this topic than I do! And I know there are a lot of lurkers out there! Don't be shy!<br/>\n<br/>\nI am currently building a hybrid strength/charisma Paladin / Monk / Blackguard build through Aielund Act 1 and 2 and have been able to manage the shift successfully. At character level 16 (end of Act 2 Aielund) she now has both Dark Blessing and Divine Grace (with F/R/W saves of 26/22/21 including evasion for reflex saves, Valennia, a Barbarian companion in contrast has saves of 14/8/5), Smite Evil and Smite Good, can buff myself with Bull's Strength (blackguard), Eagle's Splendor and Endurance, in the same character who dual's Kamas with ITWF and does 8 attacks per round with flurry divine might and divine favour +4 . She has the 'Knockdown' ability, can create undead minions, will get the 'Sneak attack' ability and 9 attacks per round at level 17, Divine Shield at level 18 for extra AC for tankability, so she is pretty nasty.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_fc90f39e95ebcbb14984e32a848b4d25.jpg\"/><br/>\n<br/>\n<strong>Preparing for the shift</strong><br/>\nThere was quite a bit of planning involved to make this work in practice.<br/>\n<br/>\nThe first step is understanding how alignment and alignment shifts work. The <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Alignment\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki</a> is very helpful regarding this. Something that is not obvious and is explained well in the Wiki, is that if your alignment changes, say from Good (70) to Neutral, it doesn't matter whether you undertook an action which dropped your alignment by 1 point or 10 points at that particular moment, your new alignment value will be in the center of your new alignment. So if you change from Lawful (85) Good (70) to Lawful Neutral, by undertaking an Evil conversation option which drops your alignment by 2 points, your new alignment values will be Lawful 85 / Neutral 50, not Lawful 85/ Neutral 68. This is very valuable to understand. It seems extremely daunting to shift alignment from Good (85) to Evil (15), but you must understand in practice this could be only a 36 point alignment shift rather than a 70 point alignment shift, because it will take you only 16 points to get from Good (85) to Neutral (50) by reaching the 69 threshold, and 20 points to get from Neutral to Evil by crossing the 30 threshold. Feel free to read the wiki, message me or post if you don't understand this.<br/>\n<br/>\nThe second thing to understand is that alignment shifts faster if you undertake actions at the opposite spectrum. So if you are Good, and undertake an action which normally shifts alignment by 1 point towards Evil, your alignment will actually shift 2 points. This means it is actually twice as easy to shift from Lawful to Neutral (say in a Monk/Bard/RDD build) than it is to shift from Neutral to Lawful.<br/>\n<br/>\nThe third step is being clear exactly when you want to make the shift. This is both at what level you want to make the shift, and where in the module you want to shift. I wanted to make the shift at level 12 of Paladin, because you get +4 AB and damage with divine favour spells, access two level 2 spells / day with wisdom 14, and get a reasonable length on your paladin spell buffs such as Eagle's Splendor and Aura of Glory. You reach level 12 in Aielund Act 2, so this had to be the setting in which the shift had to be undertaken.<br/>\n<br/>\nThe fourth step is know if it is practical. I had access to an <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/aielund-saga-act-i-nature-abhors-vacuum\" rel=\"noreferrer\" target=\"_blank\">Aielund walkthrough</a> which although out of date with the current version of Aielund (version 3.11, last updated 2018), is actually an extraordinary 534 pages of content which provided an enormous amount of detail about everything in the module, including alignment shifts. This is available on the NWN Vault website in the downloads section for Aielund Act 1. This document allowed me to realise what are my options regarding the alignment shift, discover whether I could make the alignment shift from LG to LE via conversation alone (I did not want to kill 'Commoner' NPCs to do this), and allowed me to map out the process of making the alignment shift from through conversation alone including avoiding potential pitfalls. <br/>\n<br/>\nThe fifth step is to be clear on what you are prepared to do to shift your alignment. It is extremely easy to shift your alignment from Good to Evil by killing 'Commoner' NPCs who will shift your alignment 5 points towards Evil (and interestingly, not shift you towards chaotic). However this does not roleplay well with a Lawful type character who has no reason to kill innocent individuals who do not threaten the player character, have any role in their schemes, or have any hidden powerful loot they might want to take from them. Doing such tasks would have spoiled any sense of achievement I might have obtained by playing my character. This is a 'Fallen Paladin' who has insidiously, through the strain of multiple assassination attempts on the life of herself and the Princess, has become cruel and harsh, and will take any action possible to achieve her goals of defending Aielund and the Crown and her own interests, but in a lawful way. So I was not willing to make the alignment shift by doing this, and I wanted to do it purely through conversation options only which I was able to achieve in Act 2 Aielund. <br/>\n<br/>\nThe sixth step is to avoid quests or actions which could shift your alignment in the desired direction, before you are ready. Basically you want to rush to your target level by trying to do as many quests or gain experience in ways which don't affect your alignment much as possible, avoiding these alignment shifting quests/actions, then slow down your level progression and shift your alignment appropriately until you reach your goal. I will explain this in more detail below, with an example of how I did it.<br/>\n<br/>\nThe final step is put your character close to the threshold of shifting close to your desired level and time/place in the module. For Good or Lawful characters seeking to drop their alignment, you will want to have an alignment value hovering at or slightly above 70. For Evil or Chaotic characters seeking raise their alignment you will want your value to sit about 30 or less. Neutral characters will want their value just under 70 or just above 30, depending on which direction you want your alignment to shift. In Aielund Act 1 I was able to make my Paladin have an alignment of Lawful Good, with a Good alignment value of 71, very easily through conversations. I then completed Act 1 and progressed to Act 2 at level 9, ready to make the shift.<br/>\n<br/>\n<strong>Making the shift</strong><br/>\nAs mentioned you should know what level you want to make the shift and what module you will be making the shift in. For me it was Act 2 Aielund, Paladin level 12. <br/>\n<br/>\nI was not prepared to kill commoner NPCs for roleplaying reasons. <br/>\n<br/>\nThis is a summary of Aielund Act 2 and how I did the alignment change purely through conversational options. Spoiler alert.<br/>\n<br/>\n<details><summary>Spoiler</summary>\n<br/><br/><br/>\nThis was very challenging for a module which strongly favours good characters. This is how I did it.\nTo become lawful neutral and shift my alignment from 70 to 50, I spoke with Guard Captain Deckard in the Docks district and stated '[Evil] Nobody tries to assassinate me and the Princess without retribution. Nobody.' for a 2 point shift towards Evil (as a Good character).\nI then shifted my alignment from 50 to 30 further by conversation options which each shifted alignment towards Evil by 1 point on each occasion, except at the end, which provided a shift of 5 points towards Evil:\n- Completed the 'Taking candy from a Child' in the Residential district by eating the candy at the end to teach her how cruel and unfair life can be. (48)\n- when talking with Adelay Addams about 'Hunting the Hunter quest', initiate it by asking for work, state 'Make it a LOT of extra gold and I'm sure I can stir up some interest' to avoid the alignment shift to good, and when discussing Veerak Brun hunting people state '[Uncaring] Yeah that's a hell of a thing. Go on. (46)\n- when Lord Southby realises you are the player character, state 'In the flesh', It is important not to choose the Lawful conversation option here otherwise you will miss out on the potential evil alignment shift. When discussing work, state 'I'm all ears', and when being advised the number of shadow druids to fight would be at least 30 state '[Evil] A small army then? It's going to take me all day to hack through so much meat.' (Good lord what sort of hero are you! Lord Southby will ask. You will respond: the kind that gets the job done, no matter what.) (44)\n- When speaking with Peridoc Dabbenfold in the Market District sewers, when he is uncooperative about the location of the Assassin's Guild, state '[Evil] If gold is no value to you, then maybe your life is'. (42)\nSo this was a shift from LG (70) to LN (42) with pretty much no experience gain. This was the part where it got harder.\n- Clear out the assassin's guild then speak with Peridoc with Ronan in the party about his betrayal. I advised him it is 'If you think I won't kill everyone here, you've been sorely misinformed about me.' If you don't have Ronan in the party and Peridoc speaks to you about working together, state 'It will be hard to work together without your head on your shoulders'. (41)\n\n- Then ask Duke Charles Montague '... did you say a gold dragon' to start 'The gold dragon' quest. Speak to Desmond at the University. Ask about the gold dragon. Definitely avoid saying 'Just showing myself around. Sorry to bother you.' which will shift your alignment towards good. Enter the portal he creates. Speak to Salinder (Ancient Gold Dragon). When Salinder mentions he will die and the Ironlord's defeat was only temporary, state '[Evil] So when do you croak? Kneel over? Kick the bucket? (38)\nI then headed to the Stoneguard Mountains. I got to level 13 and took my first level of Monk. Defeated the Frost Giant Warleader which allows you to speak with the dwarven King Sullinus McTavish. \n- Speak with King Sulinus McTavish about the Sceptre of Transcendance ('War and other catastrophes' quest). Avoid any potential alignment shifting statements except at the end, when talking about investigating the mines state '[Evil] I'll be back with the information. You better have something for me when I return'. It is important when discussing the Scepter, not to choose the preceeding [Lawful] conversation option, otherwise you will not get this shift. (37).\n\n\n\n</details>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_a389e03e5352b409333510bc8b47f3d6_t.jpg\"/><br/>\n<br/>\nSo thats how I changed from Lawful Good to Lawful Evil without killing Commoner NPCs. Saving up the three levels was an important part of the process. If I found it impossible to advance the story enough to make the desired alignment without leveling further I would have taken more levels in Monk, but I didn't need to.<br/>\n<br/>\nSome of you out there may be interested in shifting from Lawful to Neutral (allowing for example Monk/Bard, Monk/Barbarian, Paladin/Bard, Paladin/Barbarian combinations) I know this is quite feasible in Aielund Act 1 at around level 4. Level 4 is a great level to switch from Paladin or Monk, as you gain a large amount of the class abilities in those first four levels. Here are the details:<br/>\n<details><summary>Spoiler</summary>\nAs a Lawful character there is a house in Bracksford you can break into for approximately 6 points of Chaotic shift, and a crypt in Culdeny you can loot for a further 8 points of Chaotic shift, which combined with a couple of chaotic conversation options you can make a 16 point switch from Lawful 85 to Neutral pretty easily. You can reach all these locations at level 4. \n</details>\n\nCertain alignment shifts are actually very easy to achieve. One example might be a Paladin / Druid build you may want to make, who will have the ability to turn into a dragon with the level 9 shapechange spell, and later using the epic feat Dragon Shape (a so called 'Divine Dragon Knight') who will have great saves, Divine Might and Divine Shield. It is very easy to make the switch at say, level 4 or level 8, by sitting the 'good' alignment at 70 or 71, reach the desired level, then undertake an evil action or conversation to drop to Lawful Neutral. I have probably demonstrated one of the hardest shifts to make. Other difficult shifts are from Evil to Good, and from Chaotic to Lawful. <br/>\n<br/>\nSo in summary:<br/>\n<br/>\n1. Understand the alignment mechanics by reading the NWN Wiki page, and understanding actions at the opposite end of the spectrum (ie Evil actions as a Good character) cause double the shift <br/>\n2. Think about what would be ok for your character to do to change alignment. Easy ways to become chaotic for example are breaking and entering/stealing, releasing prisoners etc. Easy ways of becoming evil are killing commoner NPCs which may not role play well with your character. Other ways of shifting alignment are difficult but possible and ideally require a thorough understanding of the module being played, as demonstrated. <br/>\n3. Know at what class and character level you want to make the shift, and consider when and where in the module you will make the shift.<br/>\n4. Reach the desired character level for your alignment change whilst saving up alignment shifting activities and quests that go in the desired direction, and keep your alignment right at the border to allow you to rapidly change when you want to.<br/>\n5. Obtain the desired character level then do all the alignment shifting activities whilst trying to minimise level gain. Remember you can 'Save levels' if you wish (ie not level up), until you reach the desired alignment, then use up your levels. I had to save three levels until I reached the desired alignment. <br/>\n6. Certain conversation options may preclude you from taking alignment shifts in the desired direction, even if you are given the desired conversation option later. So a Lawful conversation option early on may stop you from gaining the shift towards Evil, if there is a later Evil conversation option.<br/>\n<br/>\nAlignment shifted builds can be very powerful. I have demonstrated that a Paladin / Blackguard build is very feasible during Aielund Act 2, making one of the most difficult alignment changes from LG to LN to LE over a few levels, without killing commoner NPCs.  <br/>\n<br/>\nOnce again, hope you have enjoyed the read!<br/>\n<br/>\n<strong><span style=\"font-size:75%;line-height:normal\">Minor edit: Bull's Strength (Paladin version) and Bull's Strength (blackguard version) do not stack in Aielund, so I have edited the text to reflect this. Have also made minor edits in the text to fix typos and make it clearer.</span></strong></div>"
    }
  ]
}