{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "207",
  "name": "Discipline for Dexers-Not worth it.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/discipline-for-dexers-not-worth-it-t2354703.html",
  "author": "gkorjax",
  "avatar": "no_avatar.png",
  "replies": "4",
  "views": "2.8K",
  "posts": [
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "5:44 AM - May 19, 2017",
      "content": "<div>Hi...I've been lurking here for a while, playing NWN for quite some time, etc. Currently my server is down, World of Greyhawk. This being so I'm in need of a nwn fix so I started looking at the builds posted here and I took a peek at the third one down or so...called Avoreen's sting and I noticed some discussion about something I thought was decided quite a while ago, but perhaps that needs to be reitterated, or perhaps I need to be straightened out!<br/>\n<br/>\n I noticed that this dex build is investing in Discipline. I think this is a total waste of skill points in a dex build, especially because the build is discussing point allocation. To me I simply see 43 points that could be put elsewhere. Here's what I feel is important to the discussion, so if I miss anything, feel free to chime right on in and set me straight...I'll be primarily focussing on magic levels on WOG, which is primarily +5 items max. I feel the argument would most likely hold true in different environments.<br/>\n<br/>\n Dexer caps out Discipline with Discipline of 43. Dexer has naked ac of 35...lets assume +5 items in all armor slots...that brings the ac up to 56...Lets give modest stat boosting items to dex and wis, to give +6 more to ac. Lets assume 20 strength with items and buffs.<br/>\n Total ac now is 62. Discipline 48.<br/>\n<br/>\n Stronc the orc tries to knockdown Dexer. He is spamming knockdown. He needs to roll a 66 for the knockdown to land, i.e. 66 -4 (Knockdown attempt) = 62. He hits with the knockdown, now the contest occurs.<br/>\n Dexer has check his discipline versus the attack roll...I'm not sure what is exactly meant by the attack roll here, if its the 66, or rather the 62, but in either case....lets look but its probably obvious, unless I've made a mistake somewhere.<br/>\n to tie attack roll of 66 vs 48 +1d20. So basically Dexer has to roll an 18-20.  15 percent chance of his 43 invested points in discipline to save him from being knocked down.  If the check is against the 62, you stay standing when you roll a 14-20...35 percent of the time.  Things get  worse when fighting Joe the Giant, or heaven forbid Smasher the dragon...increasing in size modifiers for the knockdown...or an opponent who has Improved Knockdown!<br/>\n Things get worse yet again when  you fight enemies who are even more competent. Standard frontline fighter PC ab is probably raw at 44 ish. Give them a +5 sword and some other buffs, and that discipline check is going to be needing to roll a 20 to succeed in keeping you from being Knocked down. I feel that this is most likely to be the case.<br/>\n<br/>\n Unless you are playing a strength build, or in a world where there are lots of discipline boosting items, or you have a build that has a lot of feats to invest in skill focus discipline it is just not worth it to invest in Discipline. If the world has a lot of items with bonus to discipline, there are probably items that give knockdown immunity as well.<br/>\n<br/>\n Again, maybe I'm missing something, if so PLEASE point it out to me.<br/>\n<br/>\n Cheers,<br/>\n<br/>\n<br/>\n<br/>\n  </div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:17 AM - May 19, 2017",
      "content": "<div>First off, thanks for taking a moment to check in while you have time for a diversion from WoG, gkorjax.  <span style=\"color:#0000FF\"><em><span style=\"font-size:140%;line-height:normal\"><span style=\"font-family:COMIC SANS MS\"><strong>Welcome! </strong></span></span></em></span><br/>\n<br/>\nNow on to the dissection of your generality...<br/>\n<br/>\nIt's because you are using tunnel vision to view the issue that your assessment is skewed.  WoG's item properties do not reflect a global condition.  It's just one example and happens to be mid-magic.  You've inserted a lot of \"unlesses\" into your analysis that I've itemized as to impact.  But it's true... there are a lot of \"unlesses\" to consider.<br/>\n<br/>\nThe first issue to be aware of is that, except for two feats available to certain classes, DEX AC, though exceeding a comparable STR build on paper, is not guaranteed.  As a matter of fact, most DEXers depend more on Tumble's AoO avoidance,  Evasion/Reflex saves) and Epic Dodge for survival than the hypothetical AC level that can be achieved. That means builds with at least Rog 3, SD 1 or DwD 5 are exceptional examples where you could apply your reasoning.  In those cases, the added insurance of a maxed Discipline back-up is dubious at best.<br/>\n<br/>\nDEXers should hoard all the Bull pots they can afford and it should be  an automatic pre-buff before any encounter, not only to increase damage  but all STR-related advantages (like Discipline, if they use it).   Capping STR is even better (DEXers should aim for at least STR 20 when  possible) but typically not possible in low-magic settings.  In any case, with intrinsic STR 10 and no skill focus, a maxed Discipline would set the check at least at 45.<br/>\n<br/>\nIn mid-magic, like WoG demonstrates, Discipline will typically lag behind DEXer AC.  Granted.  That should be obvious without breaking down the attack roll.  However, even in those cases, where the DEXer loses all that lofty AC due to getting flanked or caught flat-footed, you'll need to recalculate your detailed expose' and revisit the value of maxed Discipline while under duress.  The effective AC level will begin to approach that of a strength build in those cases. Of course, both Uncanny Dodge and, even better, Defensive Awareness 2 both will assure that precious DEX AC stays intact for the most part. And... do not discount the effects of a high level bard in the party that can boost AC at most by 7 but skills by 19.  See a pattern evolving here?  DWing DEXers are also handicapped AC-wise by lack of shield AC.  So many permutations to consider when making blanket statements.<br/>\n<br/>\nNext situation, low magic.  Here it is extremely difficult for the AC to reach the max Discipline level (43+) because you are dealing with +1 or +2 AC enhancements and capping DEX with item props is likewise, a fantasy.  In a similar fashion, pre-epic levels even in +5 environments (like on WoG), will not reflect the lofty end-of-build paper totals for comparison's sake.  For that, you'll need to wait until all those Grt DEX feats take hold and anticipate access to items with the AC enhancement cap.  <br/>\n<br/>\nFinally, high magic.  Sry, but you do not have a leg to stand on in this case because typically skill caps are easy to reach and, BTW, that's 50.  So with even STR 10 and maxed Discipline your AC would need to reach in the ballpark of 43+50 = 93 AC and that's not going to happen, even for a dedicated DEXer.  And... the same AC loss is still possible just like in any other magic level environment without the two aforementioned feats factored in.<br/>\n<br/>\nAssuming there are equal proportions of low-magic, mid-magic and high-magic environments in NWNLand, that means that maxed Discipline will be a dubious proposition 33% of the time <span style=\"text-decoration:underline\">when the build includes</span> a DEX-stablized feat but absolute insurance against special attacks the other 66% of the universe.<br/>\n<br/>\nNaturally, opting for Discipline in a DEX build demands at least two prereqs: 1) once the most influential combat-related skills have been addressed are there spare skill ranks to spare? and 2) is there a Discipline dump class available that can max the skill late enough to be effective?  It's not any more complicated a decision than that, actually.<br/>\n<br/>\nFinally, this issue only relates to finessed melee and PBS archery.  An artillery archer should NEVER EVER need to deflect special attacks except for occasional called shot hits... and that is really only a possibility in PvP (I've yet to encounter any creature AI that issues called shots, not that it's <span style=\"text-decoration:underline\">impossible</span>, only that it never occurred in 10+ years of wandering the realm so is extremely rare at best).  Investing in Discipline to avoid only ranged special attacks, I agree, is not cost-effective.</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "6:42 AM - May 20, 2017",
      "content": "<div>Thanks for your reply. I still disagree. Unless one is a strength build , discipline is going to be almost useless, so useless that it is a waste of skill points. Yes, the fundamental point is that if AC &gt;&gt; Discipline, then Discipline is a questionable investment at best.  Additionally one can simply say that if the attack roll &gt;&gt; Discipline then Discipline is also a waste of points. You go into these whole case of situations about being flanked and the need for Uncanny Dodge etc or they're going to lose their dodge ac when flat footed, then discuss about having a bard around with maxed out bard song to give you another 19 to your discipline..etc etc. You also talk about how dexers should be chugging potions of strength etc...sure...if they are aware enough of danger to be able to chug a potion right before the attack happens...they're most likely not going to be flat footed either. MOST LIKELY.<br/>\n<br/>\n And you state the I AM THE ONE WITH TUNNEL VISION?  Most of the time when you are fighting things you are not flat footed. If you are flat footed all the time, I suggest you address this issue immediately. Sure, mr Badass stealth guy can sneak up on you and land a knock down while you are flatfooted (and thus have a lower ac) with your DEXER...err...Ranger/monk/(something else that doesnt have either 3 rogue levels, 2 barb, etc (other classes with Uncanny Dodge, though I'd suspect that most DEXER builds would have at least 3 levels in one of these classes). Most of the time you are probably not travelling around with a Bard with maxed out bard song. Most of your characters life. So again..for most of these situations, for a dex build, or actually for any high ac build, Discipline is not a good investment.<br/>\n<br/>\n Lets look at low level low magic.  Dexlo is a level 10 dexer, ac 28  with discipline of 14...Facing Knocker the fighter , also level 10. Probable attack of 16. Knocko rolls a knockdown attempt of 18+16=34 -<br/>\n  4 =30 knockdown lands. Discipline check versus 30 (or is it 34? we'll go with 30 to be generous).  Dexer has to roll at least 16 to not be knocked down.  Is this a good investment? 25 percent chance of success?<br/>\n<br/>\n You also bring up high magic worlds as a place where I have no leg to stand upon, where there are skill boosting items up to the 50 points are easy to get.  Assuming for a moment that this is true...aren't anti knockdown items and spells all over the place in such environments? EVEN MORE SO the investment of 43 points into discipline as a waste.<br/>\n<br/>\n Though you claim that I am the one with tunnel vision it seems that you are the one that is listing all these special cases...eg. if one is a dexer and FLATFOOTED all the time one should invest in discipline. If one is on a high magic server with items that grant 50 skill points (and you equip these items all the time in place of other items) that lacks anti knockdown items. If one is travelling with a bard to give you 19 more discipline.<br/>\n<br/>\n My claim, though it is NOT my own, simply something I've read before and taken the time to analyze, is that for most non strength based builds, discipline is a skill that should be done without. The build that I'm talking about Arvoreen's silent sting, DOES has Uncanny dodge...and I still see people quibbling about skill points for trapping etc, stating that discipline is essential? WHERE? Certainly not on WOG. On some high magic server where there are +30 discipline items around with no anti knockdown items?<br/>\n<br/>\n Additionally even if one is concerned about being flatfooted, I am having a hard time trying to imagine some dexer build that lacks uncanny dodge or defensive awareness etc, something that people would actually play, not some april fools joke.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:23 PM - May 20, 2017",
      "content": "<div>Excellent discussion, people! While many vets may have gone through this debate in the past, it's all good info to me.<br/>\n<br/>\n At the risk of dumbing it down somewhat, and as the builder of Arvoreen's Silent Sting, I'll just chuck in my \"why I took Discipline\" two-penneth worth. By inclination I tend towards STR-based melee builds, so a large part of this was a sort of comfort blanket - I'd just feel naked without some Disc in a melee situation. I'd ummed and ahhed about dropping it for Concentration, but figured that I was as likely to be subject to knockdown as to taunt, and it was better to protect as far as possible against the one than have half-arsed protection against both. Sure, I could have binned both and gone down a full-on trapping route, but that wasn't the purpose of this build, and I'm not sure what other skills would have been more helpful than Disc: UMD, Listen, Hide and Move Silently were maxed already, I had enough points in Disable and Set Traps to do what I needed. Maybe Spot? At least Discipline had some advantages that didn't skew the build in a different direction.<br/>\n<br/>\n Anyway, keep up the detailed discussions - all good stuff!<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "5:35 PM - May 21, 2017",
      "content": "<div>I would have put the points allocated to discipline into search, persuade, appraise, etc...all stuff to make playing the character on a world more fun during the leveling. Most likely boost search because if you're quick and stealth and playing in a party, or even alone, you're going to want to find the traps that are out there. Not to mention secret doors and or whatever other things the mod makers have assigned to the search skill.<br/>\n<br/>\n Basically the idea is this, if your Discipline is not greater than your AC (in whatever situation), discipline isn't going to be a good investment. <br/>\n<br/>\n Note that in a typical high magic server the ac of your build, silent sting, is most likely to be 36 +6(wis buffs) +6(dex buffs)+10(natural ac) +10 (deflection ac)+10(armor ac)+10(dodge ac)+4 haste<br/>\n<br/>\n =88. And even if you're dual wielding I am betting that there is some way to get shield ac from a ring or gloves....and you'd probably be able to get +5 from that. So...there we go, for your build 93 ac. Even without a bard song to boost it.  Or simply wear your knockdown protection.</div>"
    }
  ]
}