{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "288",
  "name": "Playing Better: A Few Considerations",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/playing-better-a-few-considerations-t515489.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": "16",
  "views": "1.3K",
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:22 AM - Sep 20, 2011",
      "content": "<div>Hello, my guildsmates. I would like to raise this discussion in order for each of us to pitch in a little of our own in-game experiences. The focus of this topic is to discuss strategies or ways to improve your IN-GAME performance, optimizing it, in a way, like we spend time optimizing our builds. I would rather this topic remained as general as you guys can keep it, but since this is a game of situations, feel free to explore as many as you feel are needed to cover as much ground as possible. I will start the brainstorming now, but I am pretty sure I cannot remember all that I wanted to say here at once, and neither should you. Years of playing take a while to remember, so feel free to come back here and make another post when you remember something new! Here I come:<br/>\n<br/>\n1- Knowing your classes: This seems quite obvious, but when you get down to the specifics, it isn't. Want an example? When you Empower a spell like Fire Storm (at level 9 and only Druids can empower them), does the DC come with the original spell level or does it get counted as a lvl 9 spell?? When you cast Mordenkainen's Disjunction, for how long does the enemy's Spell Resistance remain lowered? A more thoroughly discussed but that I'm sure not many people knew about before we engaged in this debate and I explained on my guide: How Divine Power works, specifically.<br/>\n<br/>\n2- Knowing the types of enemies you are facing: How many of you can keep up with the combat log in real-time gaming to find out information on your enemies? Like when you Taunt someone, it shows the result of the creature's Concentration check, so by that you can get a good idea on your chances of succeeding. Similarly, casting certain spells at certain types of enemies, you can get a good look at their saving throws and gauge how likely your tactics are to be successful. There is a boss where I play that is a melee-type, but he drops several will-enhancing items once you kill him. If you have never killed him, you don't know that, and as a general rule, meleers do get low will saves, but you should take a look at the combat logs regardless and check their saving throws just in case a DM tries to play smartass . You can spend a full spellbooks worth of Dominate Monster spells on him and he simply won't bend!<br/>\n<br/>\n3- DON'T FORGET TO USE YOUR STUFF!! I say this but yesterday I forgot to cast Haste on an adventure before a critical encounter and nearly ended up taking a dirtnap. Had it not been for a wand of Haste I had and was able to use quickly, I wouldn't have survived. It happens more oftern when you shelve a toon (haven't played him in a long time) and then take him out for a spin, but the combos don't instantly come back to you. <br/>\n<br/>\n4- Know how to conserve your resources. Don't waste skills and spells to finish a battle quickly unless you know you will be able to rest. More than once have I gotten impatient and used a couple of buffs, then run into a battle where I really needed them and have to do without. I am saying this but as you can see, I pretty much make the same mistakes I'm trying to advocate against, although now much less than before. It's a constant exercise.<br/>\n<br/>\n5- Similarly but on the opposite directions, know when to USE your resources: How many times have I died trying to save up a heal potion until it was too late? I know, that's stupid, but being greedy can be a bitch. Don't feel sorry if you have to use that precious charged item you've been saving for a special occasion. It's much more frustrating to die when you could've avoided it than to lose a particular item or charge. You should always try to play at your best, and that means using all your resources when they are needed. How many times have you forgotten to drink a Clarity potion when facing a Dragon and then gone: FU....! afterwards when your low-will meleer runs in terror? Sometimes you know you have to, but aren't paying enough attention and then end up paying in blood for that.<br/>\n<br/>\n6- Try different tactical approaches to different battles: If you are not having success in a particular battle, just try different stuff. You'd be surprised how much a different tactical approach can change the outcome of a battle. Our illustrious Marshall (who is away in Asia btw, so that's why he hasn't shown much or at all) and I went over to a boss where we play that he claimed he couldn't kill. I told him to try a different strategy, worked on the specifics and he managed to win the battle at FULL HEALTH. True, he is still learning the game so he doesn't yet know how to optimally use a build and all it has to offer. The particular build he was using was GDL's legendary Charnel Lord, which I happen to know and have in my hard drive, so I was able to help there.<br/>\n<br/>\n7- Always have a couple of bags with BACKUP ITEMS. It doesn't matter what class, but this is even more true for meleers. Any good meleer should have all three belts of Damage Resistance in a bag and also one that gives strength. In a given situation, use these items strategically to increase your odds. The applications of this can be endless, like with my Pally WM I have a Watchman's Helm and an item that allows me to cast True Seeing. Whenever I can't find a secret door, I equip the blasted helm, use True Seeing, which has been modified where I play to add to skills rather than automatically detect stuff like in vanilla NWN, and VOILÁ, secret door, here I come! Wands of Find Traps for fighter-types, scrolls for UMDers, anything you can use, keep, don't sell. There used to be a boss in one of the brazillian PWs I used to play which was called Mecha-Golem or something similar (i'm translating). That thing was immune to criticals, obviously, but most people avoided soloing it because it had AN AURA that lowered your constitution to 3 (-4 modifier), so you'd go from 300 HP to 80 or so. And it had a Ranged Touch attack that did 70 Fire damage. So it would get close and just use the attack right after your CON was lower. All you needed there was a Shadow Shield or Negative Energy Protection scroll and Energy Buffer spell and he became quite easy. If you have that spell, grand, you just memorize it, but if you are a meleer with UMD, you should keep the scrolls for such situations.<br/>\n<br/>\nI think this is enough to start with, Now you guys pitch in what you can add to this and we can go from there. <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "3:03 PM - Sep 20, 2011",
      "content": "<div>1.  Slow down!!!!   Seen way too many people rush into a room and die nobly...  I'd rather wait and use the door as a choke point. Let them come to me and I'll take them one or two at a time, thank you very much...<br/>\n<br/>\n2.  Slow down!!!   Search takes a few seconds to reveal that trap.. would have been nice to side step that instead of being paralyzed as they surround and dispatch your sorry behind...<br/>\n<br/>\n3.  Slow down!!  If you had slowed down a bit, you would have seen how many opponents were.  Then you could have dropped a tanglefoot bag to slow them down.  Or scatter a few traps, or a choking cloud bag.  [NOTE:  how many don't think to use those items?  or just sell them as junk].  Caltrops slow an enemy and also do small amounts of damage.<br/>\n<br/>\n4.  Slow down!  A pause and a look around would have let you spot that Bodak or Basilisk.  Sorry old chum...  keep a stiff upper lip and hit that respawn button would ya?<br/>\n<br/>\n5.  Slow down.  Did you know that a minefield of traps can dispatch your foe before he even gets to you?  and also saves you from using heals...<br/>\n<br/>\nOk.. thats enough beating of a dead horse....  <br/>\n<br/>\nHave fun ...<br/>\n<br/>\nConlaoch</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "3:19 PM - Sep 20, 2011",
      "content": "<div>6 - Slow down! Your party's scouts need their time to do all they need to do to ensure a successful mission.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:07 PM - Sep 20, 2011",
      "content": "<div>7. Recon.   Use whatever means at your disposable to search out enemies, traps and potential flanking geometry (both offensively and defensively) BEFORE ATTACKING.  In a well-planned build there should ALWAYS be some reliable means to explore unobserved or you are just begging to get swarmed and trapped.<br/>\n<br/>\n8. Control numbers in each encounter.  I seldom EVER see any of my fellow playmates use a range weapon (unless it is their focus) and it is the single easiest method to manage the perception range of enemies.  Shoot an arrow, throw a dart or sling a bullet at the closest enemy and then kite them away from the mob.  Rinse and repeat.  If your party can form a kill zone behind you, it is a very simple method to break a horde into digestible pieces.  Even a caster will eventually pursue so it works against all foes.<br/>\n<br/>\n9. Ignore all rabbit chases.  If a monster AI is really clever it will occasionally retreat a wounded minion toward its mob.  Never chase.  Always move in slowly and practice standard recon procedures (see item 7).<br/>\n<br/>\n(BTW, all these tactics are ones we employ in our Home Guard exercises on weekends.  Granted... AI is not as resourceful as actual human thought but it is just as effective.)</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "7:37 PM - Sep 20, 2011",
      "content": "<div>LOL  So, ok, maybe I am old school...  What ever happened to bulding the \"ultimate\" character and just barge into a room and kill everything?  <br/>\n<br/>\nYeah, I died a few times with that strategy, but that was the FUN of it!  Too much strategy numbs the brain!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:23 PM - Sep 20, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong>LOL  So, ok, maybe I am old school...  What ever happened to bulding the \"ultimate\" character and just barge into a room and kill everything?  <br/>\n<br/>\nYeah, I died a few times with that strategy, but that was the FUN of it!  Too much strategy numbs the brain!</div></blockquote>\n\nI understand what you mean, but in a well-balanced environment that's hardly possible. However, if you do things strategically, you can and sometimes even SHOULD rush in. This is in response to those SLOW DOWN advocaters . I'm not saying you shouldn't slow down, just not always. Allow me to illustrate:<br/>\n<br/>\nWhere I play there is a high-level place where dwells the Fire Giant King. Now if he were alone, it'd be a pain to take him, but he has over 20 regular guards, plus one War Troll Warrior, 2 Fire Giant Priestesses and 2 Fire Giant Wizardesses. With one of my toons, Maximillian Kane, my Magical Master build, I find that the best way to take him out is RUSHING IN! However, with other toons a more tactical approach is required.<br/>\n<br/>\nI know it sounds crazy, but come in invisible or in GS, cast Time Stop, 2 Bigby 9 hands on the two Wizardesses, then another Time Stop, 2 Bigby 9 hands on the Priestesses, then 1 extended level 7 Hand on the King himself, all of which have never failed me. Then I cast 4 Empowered Blade Barrier spells on the Priestesses and Wizardesses (one on each) to ensure they will be dead by the time the combat is over, while the guards fruitlessly miss on every attack they try except natural 20s, but those don't hurt cuz I have Premonition and Protection from Elements on, not to mention 50% concealment from II. Now from there I buff up with damage shields, Divine Power, Battletide, Prayer and Divine Favor, all of these extended, as well as the damage shields and start taking out the mobs. If they hit me they get damaged, if they don't I kill them by hacking the shyt out of them. As they drop down dead from my damage, more come in and surround me, so I never stop attacking, and it allows me not to have to rebuff. I can use a Word of Faith to blind them so I don't get overwhelmed, but I'd rather take the hits and kill them faster. The regular guards are pathetic, so they die easily, so does the War Troll. The king is held for twice as long as the priestesses and wizardesses, so I needn't worry about him. When I finish off the guards, I heal if required and finish off the casters if they're not already dead by then and only then I get the King. And the King is easy as hell, all you have to do is cast Harm 2x and then an empowered IGMS. If you have Time Stop scrolls, use one to ensure he won't heal inbetween Harms. Now the most tiresome part of this kamikaze strategy is looting . This strategy requires loads of practice with the build at hand so you know the exact order in which to cast your spells (because you will start accumulating actions in your action queue at the top left of your screen) and very fast hands to do it in the right tempo, and I happen to have both . The only danger is that the Wizardesses have True Seeing so you need to be really fast and cast your Time Stop before they can mantle up.<br/>\n<br/>\nAs avado mentions, this high-paced high-adrenaline all out style can be extremely fun, but it requires a toon with the right tools to make it happen. A Time Stop scroll wouldn't work, as generally a hasted character casts 2 spells in the time it takes a non-hasted character to cast one spell, but as for using items, such as scrolls, he can only use one per round.<br/>\n<br/>\nAlso I'd like to add one thing to my list there:<br/>\n<br/>\nX- ALWAYS TAKE THE CASTERS OUT FIRST: This is pretty common knowledge, I reckon, but if not here, then where will I ever get a chance to mention this? Don't let them buff up if you can. The down side to the SLOW DOWN strategy is that you allow casters to buff, and then a battle can be made that much more difficult. The way I play is coming in invisible and taking out the casters first and foremost, then if I am able I melee with the rest and if not I run like hell until some of the monsters abandon persuit, and then I take out the rest and return. I play with like the most defensive player on WoG on a regular basis. He NEVER rushes in, except when he's with me. We managed to take out an INSANE amont of monsters together in a very high level area called Rary's Fortress. There were SERIOUSLY, over 50 mobs and a boss. I used my Champion of the Wilderness build, now level 36, and I simply drank 10 Heals till the casters ran out of spells and tanked the rest, while he, with his lvl 40 Fighter Bard AA, picked his shots from afar. After the casters were gone, it was easy.<br/>\n<br/>\nAnyway, take out the casters before they buff up, unless they're too many, then improvise, slow down if you must <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "10:11 PM - Sep 20, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong>LOL  So, ok, maybe I am old school...  What ever happened to bulding the \"ultimate\" character and just barge into a room and kill everything?  <br/>\n<br/>\nYeah, I died a few times with that strategy, but that was the FUN of it!  Too much strategy numbs the brain!</div></blockquote>\nPuberty was supposed to end that approach I thought.  I stand corrected.</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "1:46 AM - Sep 21, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong>I understand what you mean, but in a well-balanced environment that's hardly possible. </div></blockquote>\n\nThe difference between THEORY and FACT, or in this case, insanity!  You seem to be obsessed with WoG, but let me edumicate you a bit.  The server I played on at the end of my career was designed for PARTIES!  This means 3 and more in a group at a time.  That is how the pw was designed.  It also had PRC, so meeting a variety of repeated epic spells (like 4 hellballs or 3 greater ruins from the SAME CASTER) was not uncommon in the 20+ areas (it was a lv 40 server with PRC).  There is no such thing as BALANCED !  Balanced is for the textbook technicians who want to turn everything into a mathematical equation.  Like a famous quote \"NEVER TELL ME THE ODDS!\"  <br/>\n<br/>\nSince we never played nwn together (and I am a little bit more than rusty), you have no idea what I mean!   My ENTIRE game stategy was, OFFENSE IS DEFENCE! (both in game and in forums it seems!)  Playing nwn defensively is akin to playing golf and never actually getting around to hitting a golf ball.  Sure, you can do it, but it just aint enjoyable!  (I will let you stir on that last analogy cuz I am not sure of it either!   )</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:33 AM - Sep 23, 2011",
      "content": "<div>Well, I don't know much about PrC, so it's hard to talk about it, but from what you say, it doesn't seem very balanced, just overpowered. But I'd rather leave that analysis to you, cuz you're the one that knows more about it than all of us combined. Is it balanced or overpowered?</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "6:39 AM - Sep 23, 2011",
      "content": "<div>LOL  Balance is IMPOSSIBLE!  I am sorry to awaken you to this, but there will always be players like me (and the guys I learned from) who want to figure out, within the rules of the server, the holes.  There are players that will do \"what they feel\" and that is fine.  Yes, PRC is out of balance!  NWN is out of balance!  To look at the game with \"Balance\" is ignoring the reality of the game.  Dragons rule pvp.  Maxed IGMS rule pvp.  Dev crit is evil.  ED is crazy.  Planar turning is an absolute waste! There WILL be areas that are hard for some and not others.  TO cater to the easy makes it too easy.  To make it a challenge for the \"freaks (me)\", makes it impossible.  There is no Balance in the Real world.  There can be no balance in a video world.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:12 PM - Sep 23, 2011",
      "content": "<div>I agree that there is no balance in PvP, but you're wrong when you say that one shouldn't strive for balance on PvM. A certain degree of it can be attained with custom modifications. The DMs and world builders can do ANYTHING to a mob, they can make it immune to magic, they can make it immune to physical damage, give them as high a saving throw as they feel is required. There might never be 100% balance, and in that sense, you are also right, and they will have to pick what kind of players they want to balance their world according to, but there can be attempts to reduce and even MINIMIZE imbalance. I think those attempts are great. If Bioware didn't take the time to correct many of the bugs, errors and imperfections of this game, then it's up to the world builders and scripters to do so. There is a reason why many of the great players play on WoG, and I have to say that balance is a good part of it, as well as great DMs and excellent areas and dungeons to explore. To do what you suggest is to just give up on all imperfections and just say: \"screw this, let chaos rule\". I don't agree with that, and honestly, you talk too much from your experience, which is now obsolete, and has been for the past 4 or 5 years. Try playing the game again, and I assure you that if your mind is still sharp enough, you will see it's much LESS imbalanced than it used to be. Even with only the Bioware modifications of the last patches, and no custom content. Add custom content to that and it's even less so. Before going berserk in one of your classic replies, please do as I suggest and you will see what I mean.</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "3:17 PM - Sep 23, 2011",
      "content": "<div>I have nothing to say, for the first time in my history.  If what you say is true, and the game is so balanced that a pure cleric, pure wizard, pure fighter and pure bard can all play the game EXACTLY the same way, then the game has become ridiculous.  That anyone would want to play in this sort of environment says a great deal about a great deal.   If the game has become so balanced, there is no more need for ECB.  There is the RECOMMEND button to replace us, after all, what need is there to build a character PROPERLY if the worlds are so balanced?   <br/>\n<br/>\nI was seriously thinking about playing this game again, but not like this.  If balance reins, nwn has died.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:01 PM - Sep 23, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong>I have nothing to say, for the first time in my history.  If what you say is true, and the game is so balanced that a pure cleric, pure wizard, pure fighter and pure bard can all play the game EXACTLY the same way, then the game has become ridiculous.  That anyone would want to play in this sort of environment says a great deal about a great deal.   If the game has become so balanced, there is no more need for ECB.  There is the RECOMMEND button to replace us, after all, what need is there to build a character PROPERLY if the worlds are so balanced?   <br/>\n<br/>\nI was seriously thinking about playing this game again, but not like this.  If balance reins, nwn has died.</div></blockquote>\n\nLOL, I never said that. I said that custom scripters STRIVE to achieve balance. I have heard, although not played anywhere with this, of places that give certain benefits to PURE characters, to balance out the game. Let me try to illustrate with examples, as is my nature, without mentioning WoG, to avoid not being taken seriously by everyone and mistaken by some server-fanatic or something. Let me present you with irrefutable evidence:<br/>\n<br/>\na few BALANCE fixes in latest patches:<br/>\n<br/>\n- Dragon Shape moved to 18 Druid, instead of 14.<br/>\n- Undeath's Eternal Foe made to give a Deflection AC instead of Dodge and not stacking with itself.<br/>\n- Divine Power stacking with other extra attacks nerfed to -5 for each new extra attack.<br/>\n- Holy Sword dispel property nerfed.<br/>\n<br/>\nThose are the ones that just pop out off the top of my head, but I'm sure there's more if you search the changelogs for the 1.69 patch. Now, what you may want to argue is whether they were successful, and many people may differ. I reckon that with these changes, the classes have become less overpowered than they used to be. Now let us revert to the original intention of this topic, which was suggesting ways to improve your playstyle.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "9:27 PM - Sep 23, 2011",
      "content": "<div>Look avado, I think you are misunderstanding the concept of a (roughly) balanced game environment with that of a dull and uninventive one. When module builders (be it for PWS or for SP or MP modules to be downloaded) strive to balance out the game, it means they strive to reduce the power gap between different and legitimate well performing builds, both in the sense of designing proper areas that cater to the different build types and in the sense of tuning specific and more or less \"broken\" game features. The game is so complex that there are so many ways to do that and while some methods may very well end up creating a dull experience, others do instead improve it. The final aim, is to be able to create a challenge of a nearly equal difficulty level for the broad category of well thought out and well performing builds.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "9:30 PM - Sep 23, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong><br/>\nSince we never played nwn together (and I am a little bit more than rusty), you have no idea what I mean!   My ENTIRE game stategy was, OFFENSE IS DEFENCE! (both in game and in forums it seems!)  Playing nwn defensively is akin to playing golf and never actually getting around to hitting a golf ball.  Sure, you can do it, but it just aint enjoyable!  (I will let you stir on that last analogy cuz I am not sure of it either!   )</div></blockquote>\n\nI find defensive builds very much enjoyable instead (have you seen my epic dodging, self concealed, crit immune, dual dagger wielder, epic trapper, taunter halfling of doom known as \"The Pale Sneaker of Doom\" Rogue 20/Bard 6/PM 10?), although they are surely not everyone's cup of tea. Myself I tend to appreciate all type of builds and I choose which to play according to my current mood. <br/>\n<br/>\nThe good thing about NWN is that there' sa build type for everyone</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "10:41 PM - Sep 23, 2011",
      "content": "<div><blockquote><div><strong>KailPendragon wrote:</strong>Look avado, I think you are misunderstanding the concept of a (roughly) balanced game environment </div></blockquote>\nI realized that after I put it up.  People talk about balance, which is the wrong word, imo.  To me, balance is exactly that, balance, not some subjective illusion.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "10:59 PM - Sep 23, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong><blockquote><div><strong>KailPendragon wrote:</strong>Look avado, I think you are misunderstanding the concept of a (roughly) balanced game environment </div></blockquote>\nI realized that after I put it up.  People talk about balance, which is the wrong word, imo.  To me, balance is exactly that, balance, not some subjective illusion.</div></blockquote>\nWell dude, when we talk about \"balance\" in relation to NWN we don't mean some ideal state where everything plays the same (which is a ridiculous concept, aye) but of rather trying to make the game challenge the various (efficient and well done) build types in a roughly equivalent manner difficulty level wise. I suppose all of us would find that kind of artificial balance that you mention ludicrous, to say the least.</div>"
    }
  ]
}