{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "256",
  "name": "Best playstyle for a near-pure sorcerer.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/best-playstyle-for-a-near-pure-sorcerer-t515444.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": "14",
  "views": "3.4K",
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:29 PM - Sep 06, 2011",
      "content": "<div>Hello, my good mates. I have been playing a near-pure Sorcerer build of mine to try to tweak it a little, but I seem to be facing a lot more difficulties than I expected because I still don't have as many spells as I would like to. What happens is I can kill pretty much everything I face, but it costs me a good portion of my spellbook to do so, and I end up not having enough spells to different situations or multiple encounters, so I rest a lot, after one or two encounters I am already depleted and if I don't cast the spells, well, I die. I have levelled mages in the past, but all of them Wizards, and Wizards do have an easier time because of the memorized spells system. I was wondering if anyone with more experience playing the class could help me out and give me a couple of tips on how to play this character without so much trouble and having to rest so often. Should I unlearn my spells, walk around with lots of scrolls, what should I do?<br/>\n<br/>\nThanks in advance!<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:17 PM - Sep 06, 2011",
      "content": "<div>Here are some thoughts on the matter from my experience with pure sorcerers:<br/>\n<br/>\nAt low levels the sorcerer is a weak spellcaster, and it isn't very good at anything else either. You have few spells and get access to them later than the wizard. You also suffer from low hitpoints, low ac, low ab etc. So you really need help to stay out of trouble. What many (most?) people do in the earliest levels, is hiding behind a summon and the familiar ( I prefer one with damage reduction), firing x-bow bolts and the occasional spell. Wands of MM and Ray of frost may be of help. If you can afford potions and scrolls, they do help the buffing and attacks. Do buff your summons! Scrolls of summons of a higher level than you can cast can help too. You risk spawning higher level monsters, but get more xp if you succeed. If things get too hairy, step back and slum in a less dangerous area until you have more power.<br/>\n<br/>\nIf there are resting restrictions, you should probably wait a while between each run. A 5 hours restriction means you need to be level 5 for the 1h/level buffs to last until the next rest. The 1 turn/level spells will then need to be extended, or you will need to be level 10 before they last until next time you can rest.<br/>\n<br/>\nWhen gaining levels you get both more and higher level spells, more spellslots, metamagic, and the spells get more powerful. Somewhere around lvl 10 (casterlevel) you will have enough buffs and firepower to live well without summons, and you can live as a caster, more or less. <br/>\n<br/>\nYou will run out of spells, and you will have to rest, but you will last longer as you level up. And you will also be able to kill faster, both with your area of attack spells, single opponent attack spells and damage shields. Running in circles hoarding is often efficient. I have no problem emptying a level 20 sorc of spells in the time before 2 extended hastes run out. <br/>\nPlan ahead so you don't run out of buffs or spells in the middle of action. A scroll, potion or wand of Invisibility, or Greater sanctuary in your last slot can save your day. I have sometimes resorted to the desperate casting of a scroll of Tensers to fight my way out of trouble.<br/>\n<br/>\nA sorcerer can to some degree adopt the melee mage tactics when he gets access to Ghostly visage, Improved invisibility, Stoneskin, Flame weapon and GMW. Standard GMW and Flame weapon from scrolls have a nice and high caster level granting you a +5 weapon with a 11-14 fire damage bonus. So if you can buy these scrolls you want to pick other level 2 and 3 spells. Damage resistance items are imo often necessary if you want to survive as a Melee sorcerer. And when you get the damage shields, they will help kill the opponents faster.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:23 AM - Sep 07, 2011",
      "content": "<div>Ah-hah!  This is a prime weakness of sorc IMO... only able to scribe those already selected during development. So, the only recourse is to scribe those that are not offensive and expend the slots for power-casting.  If you can buy enough scrolls from merchants, there are several that are very effective in scroll form.  The ones my wiz keeps in inventory (via scribing usually) are GS, Mords/dispels, Gtr Mantles, Banishment (vs. slaad mobs), the 8 &amp; 9 Bigby's, Shapechange, Timestop &amp; Shadow Shield.  So if you can tote a few stacks of these with you, it will make your sorc life easier, I'd expect.<br/>\n<br/>\nI do like Mick's strategies, though.  If someone held a gun to my head and forced me to play a sorc I'd be using those tips.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "7:14 PM - Sep 07, 2011",
      "content": "<div>This is one of the reasons why we say Craft Wand is a must on WoG.  Not only does a Sorc get fewer spells, but WoG is rest restricted. I have to wait 8 hours between rest breaks.  With Craft Wand though, I normally carry around a wand of Magic missile, Invis, Ghostly Visage, Flame Weapon, Fire arrow (useful to strip spell mantles), web, ILMS, etc.  If I am doing a lot of meat shields (pets, etc), I also do stone skin, bulls, flame weapon, etc.  I can also make a Summon Monster IV wand just to have 50 meat shields.<br/>\n<br/>\nAs someone pointed out before, don't recall where, it takes 7 seconds to read a scroll.  1.5 to activate a wand.  I can do a lot of run and zap before I run out of wands and have to rest/recraft/reload.<br/>\n<br/>\nA Magic missile wand is 2250-6740 gold and about 90-270 exp to craft (on WoG), so I sometimes carry 3-4.  A ILMS wand is about 45,000 gold.  So I'll burn up a couple MM wands if need be... unless its a big critter then I soften it up with the ILMS first. [WoG Note, an ILMS wand can take out a swamp living dragon for an easy 12k exp, or a certain corrupted Shield Lands knight for 15k - easier then hand to hand Max ]<br/>\n<br/>\nGranted a wand can only hold up to lvl 4 spells, but there are a lot of useful ones there.  Additionally on WoG, all wands contain 50 charges.  Also there is an item called a magic electrifier that will eat an item and turn its gold piece value into magical charges.  So I have been known to take flame weapon as a spell, craft a wand, next level swap flame weapon out for Bull Strength or Endurance.  Craft another wand, swap next level.  It lets me get a series of buffing wands while still getting a full spellbook.  I just use the electrifier to recharge them when they get low.<br/>\n<br/>\nA little tidbit Grizzled Dwarflord taught me, don't underestimate the power of a combust wand.  From NWN Wiki, <br/>\n<br/>\n\"Description: This spell makes a creature burst into flame. The initial eruption of flame causes 2d6 fire damage +1 point per caster level (maximum +10) with no saving throw. Further, the creature must make a reflex save or catch fire taking a further 1d6 points of damage. This will continue until the reflex save is made.\"<br/>\n<br/>\nSo a real clumsy critter, like orcs, goblins, etc will keep burning until they make a reflex save.....<br/>\n<br/>\nGranted Craft Wand isn't a silver bullet, but it sure makes things a lot easier when your a sorc.<br/>\n<br/>\nHope this helps, or at least gives you food for thought...<br/>\n<br/>\nConlaoch</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "9:52 PM - Sep 07, 2011",
      "content": "<div>@Conloach:  So, on WoG, a level 8 wizard can create the same wand as a level 40 wizard with the same potential and same cost?</div>"
    },
    {
      "author": "shia luck",
      "avatar": "no_avatar.png",
      "timestamp": "10:08 PM - Sep 07, 2011",
      "content": "<div>Sorcerers do tend to increase more in power as you level, because after a while you are not running out of the spell you need. Takes a lot of spells before a high lvl sorc with metamagic runs out of spell mantles. Ironically, at lower levels the opposite happens simply through not having enough different spells.  <br/>\n<br/>\n<br/>\nTo what's been written, I'd add that it's hugely dependent on spell choice and choice of 2nd class. For some levels, MM is a great spell because of it's unlikliness to be resisted, and so IGMS will be in your spellbook later for the same reason. But at really low levels, give me grease, true strike and a bow. If your other class is say cleric and you took divine might, you'll be the most powerful archer around for a few levels. If you take animal domain then you have stronger summons for those few who get past the grease. Cloud of bewilderment and especially stinking cloud combined with grease is a deadly combination. Well, not deadly, but highly disabling, and I guess that's my point. One spell can disable whole mobs, but it'll take lots of spells to kill them all with spells. <br/>\n<br/>\nAnother thought is that despite all the advice for taking extend spell, sometimes, silent would serve you better in spellbook management. It's the only way to get true strike at lvl2 for a start. Ideally, you have both of course, but due to the limited number of spells you have, getting metamagic early is vital so that you don't run out of the spell you can best use for the situation you are in. <br/>\n<br/>\nSpell selection is vital of course. As well as clouds, flame weapon, darkness, ultravision last your whole life and help make lvl2 spells a bit of a nightmare to choose, but early on, those 3 are possibly my most popular choice. Don;t forget a few familiars can be buffed with flame weapon too. Pixie, (? Don't remember, sry. i think there's at least one more tho. I tend to go with pixie of course. Fits the enchantress RP I prefer and very nice to have around for traps and locks). It does mean you spend some time party managing, keeping them out of the cloud, making sure the summons is the attackers target so pixie gets her sneak attack in. Darkness makes that a lot easier of course with it generating automatic sneaks. The 1st lvl illusion spell (name??? *sigh*) is very effective if the mobs get too close. <br/>\n<br/>\nThe other thing about spell selection is you want each spell to have multiple ways to give you the advantage and at least one spell to cover the danger zones. E.g. clouds to keep them at medium range, 1st lvl illusion spell/summons/charm person for those that get to close range. Any missile spell is good for the unresistability of magic damage, but while necessary later on, they are'nt so good against multiple enemies at any stage. Darkness is a perfect example with it concealing you and giving pixie auto sneak attacks. Evards tentacles can be very useful, if you have small familiar and choose a small summons. That's good to take for a level and stock up on scrolls if you have access to decent scroll crafting/purchase. Wand crafting would come in very useful, especially if there's a way to recharge them. <br/>\n<br/>\nIt's hard to say what would help without knowing what the other class is. We play characters not classes, no? If you got rogue UMD in there then I pray you can find a shop selling divine power scrolls and trap making equipment, and get SD asap *grin*. <br/>\n<br/>\nIn general anyway, I find enchantment, conjuration and illusion spells to be far more useful in making the battlefield favour you, than a few damage dealing spells. Cloud and kite, buffed summons and kite, hide and shoot from darkness, take every advantage of your other classes, make wands and scrolls, think in terms of spell combinations, ensure you have an escape route... <br/>\n<br/>\n...oh and find a big strong fighter at the inn and bat your eyelashes at him ftw. *grin*<br/>\n<br/>\nHave fun</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:30 AM - Sep 08, 2011",
      "content": "<div><blockquote><div><strong>shia luck wrote:</strong><br/>\nAnother thought is that despite all the advice for taking extend spell, sometimes, silent would serve you better in spellbook management. It's the only way to get true strike at lvl2 for a start. Ideally, you have both of course, but due to the limited number of spells you have, getting metamagic early is vital so that you don't run out of the spell you can best use for the situation you are in. \n</div></blockquote>\nI quite agree.  Silent Spell for a high level caster over Extend, as durations aren't a problem over 30 levels (3 turns is usually sufficient). Besides, clerics spamming silence can be a real pain.\n<blockquote><div>\nDon;t forget a few familiars can be buffed with flame weapon too. Pixie, (? Don't remember, sry. i think there's at least one more tho. \n</div></blockquote>\nPretty sure only pixie can be buffed with GMW &amp; Flame Weapon (but not Keen Edge  ) in vanilla as that is the only familiar with an additional weapon proficiency other than creature weapon.  The pixie character sheet lies, btw, claiming it is unarmed when it's not.  It is possible that some servers have modified the familiar feats and equipment, though.<br/>\n<br/>\nNever even thought about using Darkness for the sneaks.  Cute idea.  Me likes.   \n<blockquote><div>\n...oh and find a big strong fighter at the inn and bat your eyelashes at him ftw. *grin*\n</div></blockquote>\n...and I'm assuming that technique comes from personal experience.  Not fair!  Batted my eyelashes at Dorna once for a similar purpose and she asked me if I had something stuck in my eye as she lifted her battleaxe up to remove it.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "4:33 PM - Sep 08, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong>@Conloach:  So, on WoG, a level 8 wizard can create the same wand as a level 40 wizard with the same potential and same cost?</div></blockquote>\n\nThats the nice part, the wands scale.<br/>\n<br/>\nThey always have 50 charges, no matter what the level of the creator.  The power scales though as the caster grows.  This is because WoG uses The_Krit's enhanced magic crafting system.  <br/>\n<br/>\nTake Magic missile for instance.\n<div class=\"codebox\"><p>Code: <a href=\"#\" onclick=\"selectCode(this); return false;\">Select all</a></p><pre><code>Spell                      Caster Level   Scribe GP   Scribe XP   Craft GP       Craft XP     Brew GP      Brew XP\nMagic Missile                  3             75          3            2250          90          ---          --- \nMagic Missile                  5             125         5            3750         150          ---          --- \nMagic Missile                  9             225         9            6750         270          ---          --- \n</code></pre></div>\n\nIt always has 50 charges, but as your caster level grows you get the higher level wand.<br/>\nAll the spells are similar.  In plain Vanilla NWN, the charges are random I think, and the caster level is set as well if I recall.  As you can see from the chart, scribing scrolls is fairly cheap, but when you do the math for 50 charges, I save 60 exp  and 1500 gold for making a wand versus making 50 scrolls.  Downside is scrolls can handle lvl 5-9 spells, wands cannot.<br/>\n<br/>\nFor those that are curious, the list of the spells on WoG is found at <a class=\"postlink\" href=\"http://worldofgreyhawk.10.forumer.com/viewtopic.php?t=1227\" rel=\"noreferrer\" target=\"_blank\">Wands, potions and scrolls</a><br/>\n<br/>\nConlaoch<br/>\n<br/>\n[Edited to replace a shy W]</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "5:54 PM - Sep 08, 2011",
      "content": "<div>STOP IT!! You guys are making me want to come out of retirement and attempt to install nwn on this pc (it hasnt yet, as it is a vista pc)!  STOP IT!!  LOL</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:18 PM - Sep 08, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong>STOP IT!! You guys are making me want to come out of retirement and attempt to install nwn on this pc (it hasnt yet, as it is a vista pc)!  STOP IT!!  LOL</div></blockquote>\n\nDude, why not? It's the best game ever and there are still plenty of us playing. Join us!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:38 AM - Sep 09, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong>STOP IT!! You guys are making me want to come out of retirement and attempt to install nwn on this pc (it hasnt yet, as it is a vista pc)!  STOP IT!!  LOL</div></blockquote>\nLook at it his way, avado... there's a whole other generation for you to torture and beguile.  You could be \"avado phoenix\" from the ashes!</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "1:23 AM - Sep 09, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong><br/>\nLook at it his way, avado... there's a whole other generation for you to torture and beguile.  You could be \"avado phoenix\" from the ashes! </div></blockquote>\ninteresting proposition!  avado phoenix... hmmm<br/>\n<br/>\nI have grown soft in my old age.  My daughter is now 3 and all the \"extra\" energy I had is used on that   I have no idea how the \"old\" team played the game so much with kids!  LOL</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "3:40 AM - Sep 09, 2011",
      "content": "<div><blockquote><div><strong>avado wrote:</strong>I have grown soft in my old age.  My daughter is now 3 and all the \"extra\" energy I had is used on that   I have no idea how the \"old\" team played the game so much with kids!  LOL</div></blockquote>\n<br/>\nWhat better way to unwind after the little ones are asleep.  Log online and go kill things.....<br/>\n<br/>\n<br/>\nConlaoch</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:15 PM - Sep 09, 2011",
      "content": "<div>Hey guys!<br/>\n<br/>\nI know this topic has gone somewhat astray and I loved all the new ideas you guys gave me to play him. However, I went for Evocation school focus, and I think that might be the problem. The way I see it is: If I go for Evocation, it's mostly spells of Reflex save, subject to evasion. If I go for Necromancy, it's mostly spells with Fortitude saves vs death and they are subject to immunities and if I go for Enchantment, it's mostly spells with Will saves and also subject to immunities. When I built my caster Druid, Champion of the Widerness, it used Conjuration as a school of focus and had Grease and SoV as Reflex and Stonehold as a Will save spell, which is fine because meleers and sneakers generally have weak will and Casters generally have lowish Reflex, so it meant I always had an adequate spell to deal with each and every circumstance or nearly so. With this build, I don't see that many options in terms of spells that can work on most types weak saves. Is there any other suggestion as to a good school of focus that might do that??? Conjuration won't work as Sorcerers don't get Stonehold or SoV.<br/>\n<br/>\nAlso, I'm plagued by the low AC. it's just ABYSMAL till lvl 18, when I get Divine Shield, and low till 27, when I get Auto-still III, then very high. I wonder if it's doable to reduce my effectiveness as a caster temporarily and walk around in full plate, only casting stilled spells. What do you think? I'm thinking of switching to Necromancy, as you generally don't use more than 1 spell to kill one or several monsters, and use IGMS and the like for those immune or survivors. With evocation I normally find myself having to waste 4 or 5 spells to kill everything each encounter. What do you think of that too? I can't squeeze Craft Wand in, unless I drop Divine Shield, but +16 Dodge AC for 16 Rounds with capped CHA is just too much to pass on...<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "RoyHobbs",
      "avatar": "no_avatar.png",
      "timestamp": "4:25 AM - Sep 24, 2013",
      "content": "<div>I been hooked for 4 years now.  When Best Buy was still selling them I started reading where it was no longer going to be sold so I purchased 7 copies so I would have enough CD Keys for all my Laptops here at the house and friends who were interested.</div>"
    }
  ]
}