{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "543",
  "name": "LV 40 request - ftr/paladin/cot build based of RP stats",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/lv-40-request-ftr-paladin-cot-build-based-of-rp-st-t2355592.html",
  "author": "coconutbetta",
  "avatar": "no_avatar.png",
  "replies": "5",
  "views": "210",
  "posts": [
    {
      "author": "coconutbetta",
      "avatar": "no_avatar.png",
      "timestamp": "12:18 AM - Oct 27, 2020",
      "content": "<div>I'm looking for assistance in making a relatively efficient character based off an rp build (so not leet obviously but a guiding hand)<br/>\n<br/>\n Requirements: 4 levels of fighter for weapon spec (will probably take these 4 levels off the bat?), minimum 15 levels of paladin for access to all spells, minimum 10 levels of cot.<br/>\n<br/>\nStr: 14<br/>\nDex: 12<br/>\nWis: 12 (eventually 14)<br/>\nInt: 14<br/>\nCon: 12 (eventually 14)<br/>\nCha: 14<br/>\n<br/>\nStarting abilities: Power Attack, Expertise, Blooded<br/>\nStarting skill point: 4 in discipline, 4 in heal, 4 in lore, 4 in craft armor, save rest, eventually dump into spot when cot<br/>\n<br/>\nFrom there I have no idea on direction, charsima based would be nice, but need str for that attack bonus? Is it possible to get both great smites and overhwelming critical in the same build with the above stats? I was thinking hammer focus with tower shield<br/>\n<br/>\n<br/>\nMuch obliged!<br/>\n<br/>\n<br/>\n\"Here are a few guidelines that will aid the members of the guild in understanding your request better:\"<br/>\n<br/>\n1) PvM or PvP - mostly pvm, but spawns hurt on this server, so pvp too? seems like eventsonly reward 'winners'.<br/>\n<br/>\n2) Level cap - cap is 40 but most likely will be a year or so until 24, would like full 40 build in any case, playable throughout<br/>\n<br/>\n3) Race preference - human, i would have liked half elf but i punished myself enough with the above rp stats<br/>\n<br/>\n4) Class preference - noted above<br/>\n<br/>\n5) Melee preference - warhammer and shield, would have access to taunt as paladin but unsure if usable without uncanny dodge<br/>\n<br/>\n6) Range preference - dex but he's more melee<br/>\n<br/>\n7) Weapon preference - warhammer<br/>\n<br/>\n8) Maximum item enhancement - +3 on base items, +5 with spells<br/>\n<br/>\n9) Spellcasting - paladin spells<br/>\n<br/>\n10) Custom factors - not really</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:46 AM - Oct 27, 2020",
      "content": "<div>Hello coconutbetta, <br/>\nIs this a character you already have started playing? I mean is that why you are so specific about starting abilities, feats and skills? In that case, what class(es) do you start with? <br/>\nOr is there room for changes in the starting specs after all?<br/>\nIf not, our options are rather limited.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "coconutbetta",
      "avatar": "no_avatar.png",
      "timestamp": "2:14 AM - Oct 27, 2020",
      "content": "<div>Hi hi, I have not started playing. but the start was just to flesh out the rp base. open to suggestions.</div>"
    },
    {
      "author": "coconutbetta",
      "avatar": "no_avatar.png",
      "timestamp": "2:15 AM - Oct 27, 2020",
      "content": "<div>ps though my preference is for the rp layout set in first post. Is it really terrible?  and starting class is fighter for 3 feats. </div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "3:23 AM - Oct 27, 2020",
      "content": "<div>Pal26/Figh4/CoT10 is the best class spread for what you want, although you will be best off focusing on STR and ignoring Smite Evil completely. Overwhelming Critical and Great Smite would be tough to get on a min-maxed build, let alone a build with these starting abilities. If Devastating Critical is available then you should focus on STR and get it, otherwise you should ignore Overwhelming Critical and raise both STR and CHA. The build will have plenty of combat feats, decent buffed AB, and decent saves, but your AC will be fairly mediocre.</div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "3:27 AM - Oct 27, 2020",
      "content": "<div>Hi, Coconutbetta!<br/>\n<br/>\nWelcome to our halls. Glad you're having your first go at building a character. The first step I would recommend is that you take a look at the Game Guides section. There, you can find a couple of guides I wrote that would help you immensely to build this guy: \"The Complete Guide to the Basics of Character Building\", and also my Paladin guide. Having read these two, you'll probably be closer to having a procedure for building your character.<br/>\n<br/>\nAlso, check out the Builder's Tools section. The CBC (Character Build Calculator) is an invaluable tool to help you plan your character.<br/>\n<br/>\nI'd recommend more min-maxing with the stats. Invest in what you need, and forget about what you don't need. If you're going with Charisma-based, drop your DEX to 8 and leave Strength at 14. I'd also start with 14 WIS. I wouldn't waste any stat increases on it. But read the guides first. It's a LOT of information, so if you have any questions, just holler!<br/>\n<br/>\nGood luck!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>",
      "author-color": "#00AA00"
    }
  ]
}