{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "467",
  "name": "PW mostly solo build advice",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pw-mostly-solo-build-advice-t2243751.html",
  "author": "Dante2377",
  "avatar": "no_avatar.png",
  "replies": "16",
  "views": "5.0K",
  "posts": [
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "3:55 PM - May 26, 2012",
      "content": "<div>I'm looking for some general advice for a new character for the pw I play on. I'm not looking for someone to fully build it, just some class mix and feat/theme guidelines (or point to other builds already made as examples). <br/>\n<br/>\nI've been playing nwn for years but only started online 3 months ago. Ive been on the pw I'm about to describe below for 2 months and have 2 characters up to level 40 - Mith's blood and faith and Dwarven Landslide (f10 dd14 wm 16). <br/>\n<br/>\nThe pw is mid-to high magic with ILR - you can buy up to +7 weapons (lvl21 ILR ) and armor and depending on alignment special shops have +10. +10 is the max allowed and there are forges that can add tons of properties, although it gets exponentially more expensive and pushes ILR up.  Once you get halfway through the main quest you have the option to but more powerful gear in terms of non-enhancement bonus properties (eg 5 + 2d10 damage bonuses etc) <br/>\n<br/>\nGetting items with immunity to knockdown and death magic is not too hard and you can add haste to items past a certain point.  No true sight items and most enemies do not have it- eg some bosses and creatures you would typically expect ( mind flayers, boss dragons, clerics who cast the spell true sight etc). <br/>\n<br/>\nSpells are not modified at all eg Harm, but main plot bosses are harm immune and clerics cast neg energy pro at first encounter. <br/>\n<br/>\nMost potions incl heal are easily available and almost all scrolls are available as well incl 9th level spells <br/>\n<br/>\nClasses and feats are not modified either and there is NOT an abundance of crit immune creatures outside the normal undead, constructs, etc at least so far (I am only 33% through the main quest). <br/>\n<br/>\nThe main quest and some other quest does have locks and traps that need to be dealt with although the main quest locks dont have a dc higher than 30, so a pc w 10-15 OL is enough.  Traps on doors need to be dealt with you can't just run through them. Find trap scrolls are available. <br/>\n<br/>\nIn terms of other players there are many times were there are no other lvl 40 players on or they are elsewhere. I'm looking for pvm suggestions on builds that will play mostly solo but also in parties when available. I'm comfortable and have played clerics and fighters online and the dwarflord's Deathstroke build through the OC and HotU.  My Dwarven landslide pc now can't get to certain areas due to no OL or traps or UMD. He has good damage which I like (200-250 pt crits). My cleric (blood and faith build) is very versatile but seems to lack a punch against hard enemies and it becomes more a war of attrition - eg my 400 heal potions and smaller attacks vs your 4 heal potions but powerful attacks.  I'm less comfortable playing wizards just because so much time was spent playing the OC and other lower level modules, but I'm open to anything. </div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:39 PM - May 26, 2012",
      "content": "<div>This sounds like a place where a meleer will thrive. I would avoid playing any mage, as those settings are generally very imbalanced for those types of characters.<br/>\n<br/>\nHere are a couple of ideas you may wanna try out:<br/>\n<br/>\nPaladin 26 WM 13 Monk or Rogue 1 (if there isn't any dispelling going on, you can try Paladin 20 Monk or Rogue 1 Weapon Master 19 for +2 AB)<br/>\nFighter 12 WM 25 Rogue 3<br/>\nFighter 28 Bard 2 RDD 10<br/>\nPaladin 26 Fighter 12 Rogue 2<br/>\n<br/>\nClerics in general would be a bad idea, except for Mith's Blood &amp; Faith or his Hierophant (which would probably be locked in a few battles of 20), because of the Wisdom investment required to cast the spells and the pathetic damage compared to the weapon damage properties that they would do. Druids are terrible because of how much you lose from the items that don't merge on shift, so I would recommend only going shifter to take Rakshasa shape and have over 100 AC.<br/>\n<br/>\nIf you want a more skillfull build you can go with Kail's Bard 16 Rogue 14 RDD 10, or my Bane Crusher build (Ranger 23 Rogue 16 SD 1). There is also Bard / PM / RDD if you like to be locked in a battle of 20's all the time, as that is a high AC low AB build.<br/>\n<br/>\nA Great Smiter Paladin 29 CoT 10 Monk or Rogue 1 would also be good, I presume.<br/>\n<br/>\nIf you need an Open Lock version earlier, then maybe you can make a Fighter 10 Rogue 5 WM 25 losing 2 AB points for more skill points and playability.<br/>\n<br/>\nMy personal recommendation on those settings would be Fighter 12 Wm 25 Rogue 3.<br/>\n<br/>\nCheers!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:36 PM - May 26, 2012",
      "content": "<div>I agree with Max about the WM.  If there are few crit-immunes on a high-magic server (which is an extremely rare situation BTW), WMs should rule PvM.  Not sure which build I would recommend but there is usually a decision to make between max APR via kama monk/WM (plus some handy closing speed), max crit range via fighter/kukrimaster WM or CoT/kukrimaster WM (better vs. uber mages).  I am assuming that DevCrit works as it does on vanilla in this recommendation.  And, as is usually the case when item enchantments abound, builds will often revolve around procuring those items which have been imbued with the most exploitive properties and THAT I cannot offer any suggestions about.  For example, in the build choice described above, if \"killer\" kamas are available, a bias has been set by the server that you may want to exploit or not.<br/>\n<br/>\n--&gt; BTW, is that Find Traps spell being used vanilla or nerfed to just locate them and not disable?<br/>\n<br/>\nBut if highly-elemental enchanted arrow stacks are available, universally, some sort of AA will dominate.   For the highest magic server I ever played, with the monster blueprints containing insane HPs, SR &amp; saves  (thus reducing casting mages, bards and clerics to some sort of support role just to survive) and ridiculous AC levels, only the solo AA never died out of over a dozen other builds I played through the entire server.  (I should add that they had a few bosses that had been empowered with some exotic recipro damage that would return twice the amount of physical damage they took to the attacker which allowed no save or resistance.  A real nasty situation but it was set up that hard to acquire a semi-godly item.) I tried many mixes, but found that by using divine AA combo (clc/brd/AA), the divine damage was reliably irresistable against all foes... and with animal domain... the AA could place decent tankers up that wouldn't die in 2 secs.  If not divine, then a ranger/AA works for pretty much the same reason, good meat shields.  But the divine one is superior IMO.  Even without uber arrows, the AA's AB will pierce extremely high AC monsters when other builds will be relying on 20's to do damage. <br/>\n<br/>\nIf your server is not as imposing as a high-magic environment like this, an AA will rule even more.  But naturally, one would need to be comfortable with archer strategy and game play which many players are not.  They like kewler-looking toons or are elf bigots.  <br/>\n<br/>\nedit: Oh drat! Where are my manners today?  A Post #1 always deserves an official welcome, so in Kail's absence...<br/>\n<span style=\"color:#FF0000\">WELCOME</span> <span style=\"color:#0000FF\">ABOARD</span>, <span style=\"color:#00BF80\">MATE</span>!</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "5:21 AM - May 27, 2012",
      "content": "<div>A couple comments:<br/>\n<br/>\nYes, Find Traps is vanilla and disabled.  Dev Crit is vanilla.  No feats or spells have been modified.<br/>\n<br/>\nIn terms of weapons, they're all more or less the same at high level - no abundance of super-weapons of one type or another.  <br/>\n<br/>\n@ HipM - if you mean plant domain for Barkskin, you can easily buy amulets of natural armor + 1 through +7 and can add up to +5 Natural AC onto any amulet via a forge, so Barkskin certainly isn't a good reason to go Plant domain.  Same with Boots - can add up to +5 dodge to any boots, so UMD for monk gear isn't that hot (although UMD for scrolls and some alignment shifted gear is).<br/>\n<br/>\nI wouldn't say crit immune creatures are rare, just not overly rare.  for example in OC and HoTU, it seemed like there was an over abundance of undead, golemns, and all bosses were crit immune.  On this server it just seems to be an average mix<br/>\n<br/>\nMy default next character without any feedback here was going to be F10 R3 WM25, though trying to decide on a base 18-20x2 weapon vs BattleAxe x3 was a decision (note: there's too many good shields with stat boots, damage reduction/resistance, and other good properties to go 2handed).<br/>\n<br/>\nThere are highly enchanted stacks of [not-cheap] arrows (some have like 6 damage bonuses, some have Mord Disj on hit, etc) available but only once you're a certain point through the main quest, which definitely needs a well-equipped lvl40 to do.  But you can also buy a [also not cheap] magic quiver that can produce unlimited arrows of one type.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:32 AM - May 27, 2012",
      "content": "<div>Here are some other ideas to consider, all DEX-based:<br/>\nRogue 16 / Wizard 2 / AA 22, Elf<br/>\nRogue 19 / Monk 11 / Fighter 10, Human<br/>\nRogue 29 / Monk 10 / Shadowdancer 1, Human<br/>\n<br/>\nI have already built all of these, but only posted one of them: <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/shadow-striker-2-rogue-29-monk-10-shadowdancer-1-t2176222.html\" rel=\"noreferrer\" target=\"_blank\">Shadow Striker 2: Rogue 29 / Monk 10 / Shadowdancer 1</a> If you want one of the others, ask, and ye shall receive. With any of them, you might want to tweak them for your PW, especially the skills.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:03 PM - May 27, 2012",
      "content": "<div><blockquote><div><strong>Dante2377 wrote:</strong><br/>\n@ HipM - if you mean plant domain for Barkskin, you can easily buy amulets of natural armor + 1 through +7 and can add up to +5 Natural AC onto any amulet via a forge, so Barkskin certainly isn't a good reason to go Plant domain.  Same with Boots - can add up to +5 dodge to any boots, so UMD for monk gear isn't that hot (although UMD for scrolls and some alignment shifted gear is).\n</div></blockquote>\nNo, I meant animal domain for advanced summons and consequently better tanks.  Eventually, once you get access to SC9, the \"boost\" ends, but it is a huge help while trying to level fast.  (BTW, the domain boost has the same effect on scrolls &amp; other items that summon creatures.)  Also, having Cat's available makes a DEX AA's AB that much more potent especially if Empowered.  And you can pretty much ignore the potential XP drain from the summons, they will seldom actually kill anything but are effective diversions (be careful about using imbued arrows around them, though... IIRC it counts as offensive AoE damage vs. them  )<br/>\n<br/>\nMax, avado &amp; I were hashing out the pros and cons of a WIS-focused build like this in <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/bowyer-bandito-divino-cleric-23-bard-2-arcane-archer-15-t515441.html\" rel=\"noreferrer\" target=\"_blank\"><strong>a build thread I posted</strong></a>, but in a high-magic environment, spells tend to have little affect on monsters with their modified skins so in that scenario I would go the DEX AA route.  The special AA arrow DCs are DEX-based, so it helps to focus that way.  Also, with a DEX build variant, one could also add Weapon Finesse with a rapier to their repertoire and retain the high AB and divine damage when they made a weapon switch. <br/>\n<br/>\nIn either case (WIS or DEX), the spread is the same... Cleric 23/Bard 2/AA 15 or 24/1/15 depending on your play style and item availability (Tumble AC isn't all that important to a pure artillery archer... or ANY AC for that matter... and class-specific/alignment-specific items may or may not be all that beneficial to the toon).  That extra cleric level (to 24) gleans better resistance vs. dispelling so it may be worthwhile.  The only issue with this combo is the XP penalty, but on high-magic USUALLY it is relatively easy to reach level 40 soloing anyway.  So... either wiz or sorc could be subbed if it becomes a serious consideration, in which case I would go with the 24/1/15 split.  <br/>\n<br/>\nIf spells ARE effective against the monsters on the server, though, you could use spells like HoG &amp; SoV for mob control and ignore the summons altogether.  And in that situation, the WIS build would be better even though the racial bias favors a DEX one.  Also, I would ignore the DS/DM feats entirely unless you can easily cap CHA to make it feasible.<br/>\n<br/>\nSounds like you have access to arrows that would complement a divine AA's strengths nicely.  Worth a shot IMO.</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "8:49 PM - May 30, 2012",
      "content": "<div>Spells are hit and miss - I stopped using offensive spells other than Harm (coupled with Invis).  The server is set to Full PVP, so SoV hurts party members (although I don't party up too much), but for some reason is also targets you (the caster).  Not sure why, but I really ripped myself up the first two times I cast it.  I honestly like seeing enemy priests cast it bc it doesn't affect me much and it hurts them more than me.  HoG and WoF don't seem to do too much, implosion occasionally works (worked better when i first got lvl9 spells, but now vs lvl 40 opponents, not so much).  Firestorm is alright, but it's usually just faster to hit them (e.g. everyone seems to make saves).<br/>\n<br/>\nIn terms of capping abilities, there are lesser ioun stones available for each stat (adds +2 for 24 hours, only 1 stone active).  You can also buy Ring of Intellect up to +10, amulet wisdom up to +10, Bracers Dex up to +10, nymph cloak up to +7, and str items up to +4, although many armors and items are available and will be found by 40 (e.g. fire giant belt [+5]), greater dragon slippers +3str +3dex, etc).  Con bonuses are all over the place too, although only a few 30+ boss/quest items give +10.  So in terms of buffs, capping of any desired score is available by the time you're 40 with a wide variety.  <br/>\n<br/>\nMany locked doors have been set to \"plot\" so Knock isn't an option, some level (10-15 points) of Open Lock is needed for solo'ers.  Same with Traps, many traps set to continuous, so they need to be disabled or Find Traps scroll (vanilla, they WILL disable).<br/>\n<br/>\nMax earlier said this \n<blockquote><div>then maybe you can make a Fighter 10 Rogue 5 WM 25 losing 2 AB points for more skill points and playability.</div></blockquote>\n\nassuming he was comparing to F12 R3 WM25, wouldn't that be just -1AB, losing 1 AB at R4 instead of Fighter (assuming 1-2 pre-epic rogue level)?<br/>\n<br/>\nIf dev crit isn't available or not worth taking, do you end up taking epic feats like Energy Resistance or Epic Toughness just to fill slots?<br/>\n<br/>\nI'm thinking given the potions and scrolls available  a Fighter/Rogue/WM is the way I might go something in the 12/3/25 or 10/5/25 mix.  Esp since almost all the Paladin's spells are rendered redundant via high level items outside of Bless, Aid, Prayer.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:22 PM - May 30, 2012",
      "content": "<div>You lose 1 pre-epic BAB, but also a feat, so your STR ends up at 30 instead of 32, but that can be solved by dropping exotic weapons. I just like the style points for Katana. Here are both builds:<br/>\n<br/>\nFighter(12), Weapon Master(25), Rogue(3), Human<br/>\n<br/>\nSTR: 16 (32)<br/>\nDEX: 13<br/>\nCON: 16<br/>\nWIS: 8<br/>\nINT: 13<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Fighter(1): Power Attack, Weapon Proficiency Exotic, Cleave<br/>\n02: Fighter(2): Weapon Focus: Katana<br/>\n03: Fighter(3): Expertise<br/>\n04: Fighter(4): STR+1, Weapon Specialization: Katana, (STR=17)<br/>\n05: Fighter(5)<br/>\n06: Fighter(6): Dodge, Mobility<br/>\n07: Fighter(7)<br/>\n08: Fighter(8): STR+1, Improved Critical: Katana, (STR=18)<br/>\n09: Fighter(9): Spring Attack<br/>\n10: Fighter(10): Whirlwind Attack<br/>\n11: Weapon Master(1): Weapon of Choice: Katana<br/>\n12: Weapon Master(2): STR+1, Knockdown, (STR=19)<br/>\n13: Weapon Master(3)<br/>\n14: Weapon Master(4)<br/>\n15: Weapon Master(5): Improved Knockdown<br/>\n16: Weapon Master(6): STR+1, (STR=20)<br/>\n17: Weapon Master(7)<br/>\n18: Weapon Master(8): Great Cleave<br/>\n19: Weapon Master(9)<br/>\n20: Weapon Master(10): STR+1, (STR=21)<br/>\n21: Weapon Master(11): Great Strength I, (STR=22)<br/>\n22: Weapon Master(12)<br/>\n23: Rogue(1)<br/>\n24: Weapon Master(13): STR+1, Great Strength II, Overwhelming Critical: Katana, (STR=24)<br/>\n25: Weapon Master(14)<br/>\n26: Weapon Master(15)<br/>\n27: Fighter(11): Great Strength III, (STR=25)<br/>\n28: Rogue(2): STR+1, {Evasion}, (STR=26)<br/>\n29: Weapon Master(16): Devastating Critical: Katana<br/>\n30: Weapon Master(17): Blind Fight<br/>\n31: Weapon Master(18)<br/>\n32: Weapon Master(19): STR+1, Epic Weapon Focus: Katana, (STR=27)<br/>\n33: Weapon Master(20): Great Strength IV, (STR=28)<br/>\n34: Fighter(12): Epic Weapon Specialization: Katana<br/>\n35: Weapon Master(21)<br/>\n36: Weapon Master(22): STR+1, Great Strength V, Epic Prowess, (STR=30)<br/>\n37: Weapon Master(23)<br/>\n38: Rogue(3): {Uncanny Dodge I}<br/>\n39: Weapon Master(24): Great Strength VI, (STR=31)<br/>\n40: Weapon Master(25): STR+1, Armor Skin, (STR=32)<br/>\n<br/>\nHitpoints: 508<br/>\nSkillpoints: 190<br/>\nSaving Throws (Fortitude/Will/Reflex): 23/15/21<br/>\nSaving Throw bonuses: Spells: +4<br/>\nBAB: 30<br/>\nAB (max, naked): 51 (melee), 32 (ranged)<br/>\nAC (naked/mundane armor/shield only): 21/32<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nDiscipline 43(54), Heal 2(1), Intimidate 4(3), Open Lock 16(17), Spellcraft 20(21), Tumble 40(41), UMD 41(40)<br/>\n<br/>\n======================================================//==============================================================<br/>\n<br/>\nFighter(10), Weapon Master(25), Rogue(5), Human<br/>\n<br/>\nSTR: 16 (30)<br/>\nDEX: 13<br/>\nCON: 16<br/>\nWIS: 8<br/>\nINT: 13<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Fighter(1): Power Attack, Weapon Proficiency Exotic, Cleave<br/>\n02: Fighter(2): Weapon Focus: Katana<br/>\n03: Fighter(3): Expertise<br/>\n04: Fighter(4): STR+1, Weapon Specialization: Katana, (STR=17)<br/>\n05: Fighter(5)<br/>\n06: Fighter(6): Dodge, Mobility<br/>\n07: Fighter(7)<br/>\n08: Rogue(1): STR+1, (STR=18)<br/>\n09: Fighter(8): Spring Attack, Whirlwind Attack<br/>\n10: Fighter(9)<br/>\n11: Weapon Master(1): Weapon of Choice: Katana<br/>\n12: Weapon Master(2): STR+1, Knockdown, (STR=19)<br/>\n13: Weapon Master(3)<br/>\n14: Weapon Master(4)<br/>\n15: Weapon Master(5): Improved Knockdown<br/>\n16: Weapon Master(6): STR+1, (STR=20)<br/>\n17: Weapon Master(7)<br/>\n18: Rogue(2): Improved Critical: Katana, {Evasion}<br/>\n19: Weapon Master(8)<br/>\n20: Weapon Master(9): STR+1, (STR=21)<br/>\n21: Weapon Master(10): Great Cleave<br/>\n22: Weapon Master(11)<br/>\n23: Rogue(3): {Uncanny Dodge I}<br/>\n24: Weapon Master(12): STR+1, Great Strength I, (STR=23)<br/>\n25: Weapon Master(13): Overwhelming Critical: Katana<br/>\n26: Weapon Master(14)<br/>\n27: Weapon Master(15): Great Strength II, (STR=24)<br/>\n28: Weapon Master(16): STR+1, Devastating Critical: Katana, (STR=25)<br/>\n29: Weapon Master(17)<br/>\n30: Weapon Master(18): Blind Fight<br/>\n31: Weapon Master(19): Epic Weapon Focus: Katana<br/>\n32: Fighter(10): STR+1, Epic Weapon Specialization: Katana, (STR=26)<br/>\n33: Rogue(4): Great Strength III, (STR=27)<br/>\n34: Weapon Master(20)<br/>\n35: Weapon Master(21)<br/>\n36: Weapon Master(22): STR+1, Great Strength IV, Epic Prowess, (STR=29)<br/>\n37: Weapon Master(23)<br/>\n38: Rogue(5)<br/>\n39: Weapon Master(24): Epic Skill Focus: Discipline<br/>\n40: Weapon Master(25): STR+1, Armor Skin, (STR=30)<br/>\n<br/>\nHitpoints: 500<br/>\nSkillpoints: 202<br/>\nSaving Throws (Fortitude/Will/Reflex): 22/15/23<br/>\nSaving Throw bonuses: Spells: +4<br/>\nBAB: 29<br/>\nAB (max, naked): 49 (melee), 31 (ranged)<br/>\nAC (naked/mundane armor/shield only): 21/32<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nDisable Trap 13(14), Discipline 43(63), Heal 1(0), Intimidate 4(3), Open Lock 16(17), Spellcraft 20(21), Tumble 40(41), UMD 41(40)</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "4:31 AM - May 31, 2012",
      "content": "<div>so chatting with the other players (and one DM), they basically said any of the monsters I'd face mid 30's and beyond won't really be dev crit'able (or at least any that a properly designed and equip'd high level character would need/want to dev crit).</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:53 AM - May 31, 2012",
      "content": "<div><blockquote><div><strong>Dante2377 wrote:</strong>so chatting with the other players (and one DM), they basically said any of the monsters I'd face mid 30's and beyond won't really be dev crit'able (or at least any that a properly designed and equip'd high level character would need/want to dev crit).   </div></blockquote>\nSo what does this mean?  You stated earlier that DevCrit itself was not nerfed (\"vanilla\"; no feats or spells modifed) so are...\n<ul><li>Monster ACs so high that you are almost guaranteed to lose in the threat roll?[/*:m]</li>\n<li>Monster fort saves so high that DevCrit saves will usually succeed?[/*:m]</li>\n<li>Most high-level monster skins contain Immunity: Critical Hits property?[/*:m]</li></ul>[/list]</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "5:14 AM - May 31, 2012",
      "content": "<div>This one: \n<blockquote><div>Monster fort saves so high that DevCrit saves will usually succeed</div></blockquote>\n<br/>\nA note to me from one of the DM's\n<blockquote><div>Actually you can get crits on most bosses, but their saves are too high to dev crit them. On this server, there is no fail save when rolling one. The only bosses not critable are undeads or constructs. You may get dev crit to work on giants or dragonkins. I can't be sure since I don't remember their fort saves. I do know that the prismatic dragons are dev critable. Also the northland pirates are dev critable as well. After that, dev crit is pretty much useless. The Lost Rhun areas are mostly undead, and once you reach the Abyss or Hell, there are a lot of constructs, and anything critable has saves in the 70s or above.</div></blockquote></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:48 PM - May 31, 2012",
      "content": "<div>I wouldn't replace DevCrit regardless, because it's taken as a Weapon Master bonus feat, which otherwise you could only take Epic Toughness for +20 HP, and that IMO is a very bad option. At least it'll save you time and make you reach the bosses having taken in less damage as you'll finish fights with regular mobs faster.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:15 PM - May 31, 2012",
      "content": "<div><blockquote><div><strong>Dante2377 wrote:</strong>The pw is mid-to high magic with ILR - you can buy up to +7 weapons (lvl21 ILR ) and armor and depending on alignment special shops have +10. +10 is the max allowed and there are forges that can add tons of properties, although it gets exponentially more expensive and pushes ILR up.  Once you get halfway through the main quest you have the option to but more powerful gear in terms of non-enhancement bonus properties (eg 5 + 2d10 damage bonuses etc) <br/>\n<br/>\nGetting items with immunity to knockdown and death magic is not too hard and you can add haste to items past a certain point.  No true sight items and most enemies do not have it- eg some bosses and creatures you would typically expect ( mind flayers, boss dragons, clerics who cast the spell true sight etc). <br/>\n<br/>\nSpells are not modified at all eg Harm, but main plot bosses are harm immune and clerics cast neg energy pro at first encounter. <br/>\n<br/>\nMost potions incl heal are easily available and almost all scrolls are available as well incl 9th level spells <br/>\n<br/>\nClasses and feats are not modified either and there is NOT an abundance of crit immune creatures outside the normal undead, constructs, etc at least so far (I am only 33% through the main quest).  </div></blockquote>\n\nThis looks like the perfect environment for a dexterity based melee character with high AC, ED, SCV, HIPS/stealth and UMD.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "3:38 PM - May 31, 2012",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong>I wouldn't replace DevCrit regardless, because it's taken as a Weapon Master bonus feat, which otherwise you could only take Epic Toughness for +20 HP, and that IMO is a very bad option. At least it'll save you time and make you reach the bosses having taken in less damage as you'll finish fights with regular mobs faster.</div></blockquote>\n\nI could always take Improved Expertise instead as that might be useful against hard bosses.  In terms of damage, at that level, I'll have regen at least +15 and prob more like 20-25 and have Heal potions galore (my two current 40 lvl PCs have like 300 each), so I'm not too worried about showing up at the boss at less than full HP.<br/>\n<blockquote><div>\nThis looks like the perfect environment for a dexterity based melee character with high AC, ED, SCV, HIPS/stealth and UMD.</div></blockquote>\n\nI've thought about that, although the 11 point damage difference from a 22 STR character vs 44 strength character can be a difference maker as once you get higher level DR becomes more prevalent.  I'm much less familiar with that type of character though.  I played Grizzled Dwarflord's Deathstroke through the OC and part of HoU, but since pretty much any competent character will do well, I didn't really need to do much \"strategery\".</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:16 PM - May 31, 2012",
      "content": "<div>You can redo the skills, but this is a pretty solid build of mine <br/>\n<br/>\nRogue(19), Weapon Master(7), Fighter(14), Halfling<br/>\n<br/>\nSTR: 10<br/>\nDEX: 20 (32)<br/>\nCON: 12<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHalfling: (Fearless, Good Aim, Lucky, Skill Affinity: Listen, Skill Affinity: Move Silently, Small Stature)<br/>\n01: Rogue(1): Expertise<br/>\n02: Fighter(1): Weapon Finesse<br/>\n03: Fighter(2): Dodge, Weapon Focus: Shortsword<br/>\n04: Fighter(3): DEX+1, (DEX=21)<br/>\n05: Fighter(4): Weapon Specialization: Shortsword<br/>\n06: Fighter(5): Mobility<br/>\n07: Fighter(6): Spring Attack<br/>\n08: Rogue(2): DEX+1, {Evasion}, (DEX=22)<br/>\n09: Fighter(7): Whirlwind Attack<br/>\n10: Fighter(8): Knockdown<br/>\n11: Fighter(9)<br/>\n12: Weapon Master(1): DEX+1, Improved Knockdown, Weapon of Choice: Shortsword, (DEX=23)<br/>\n13: Rogue(3): {Uncanny Dodge I}<br/>\n14: Weapon Master(2)<br/>\n15: Weapon Master(3): Improved Critical: Shortsword<br/>\n16: Weapon Master(4): DEX+1, (DEX=24)<br/>\n17: Weapon Master(5)<br/>\n18: Rogue(4): Blind Fight<br/>\n19: Weapon Master(6)<br/>\n20: Weapon Master(7): DEX+1, (DEX=25)<br/>\n21: Rogue(5): Great Dexterity I, (DEX=26)<br/>\n22: Rogue(6)<br/>\n23: Rogue(7)<br/>\n24: Rogue(8): DEX+1, Great Dexterity II, (DEX=28)<br/>\n25: Rogue(9)<br/>\n26: Rogue(10): Improved Evasion<br/>\n27: Rogue(11): Armor Skin<br/>\n28: Rogue(12): DEX+1, (DEX=29)<br/>\n29: Rogue(13): Defensive Roll<br/>\n30: Rogue(14): Epic Dodge<br/>\n31: Fighter(10): Epic Weapon Focus: Shortsword<br/>\n32: Fighter(11): DEX+1, (DEX=30)<br/>\n33: Rogue(15): Self Concealment I<br/>\n34: Fighter(12): Epic Weapon Specialization: Shortsword<br/>\n35: Fighter(13)<br/>\n36: Rogue(16): DEX+1, Self Concealment II, Self Concealment III, (DEX=31)<br/>\n37: Fighter(14): Epic Prowess<br/>\n38: Rogue(17)<br/>\n39: Rogue(18): Self Concealment IV<br/>\n40: Rogue(19): DEX+1, Self Concealment V, (DEX=32)<br/>\n<br/>\nHitpoints: 364<br/>\nSkillpoints: 304<br/>\nSaving Throws (Fortitude/Will/Reflex): 21/16/34<br/>\nSaving Throw bonuses: Traps: +4, Fear: +2<br/>\nBAB: 29<br/>\nAB (max, naked): 46 (melee), 43 (ranged)<br/>\nAC (naked/mundane armor/shield only): 32/34<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nAppraise 43(45), Hide 43(54), Intimidate 4(3), Listen 43(44), Move Silently 43(56), Tumble 40(51), UMD 41(40), remaining skillpoints 47<br/>\n<br/>\n<br/>\n01: Appraise(4), Hide(4), Intimidate(4), Listen(4), Move Silently(4), Tumble(4), UMD(4), Save(12), <br/>\n02: Save(16), <br/>\n03: Save(20), <br/>\n04: Save(24), <br/>\n05: Save(28), <br/>\n06: Save(32), <br/>\n07: Save(36), <br/>\n08: Appraise(7), Hide(7), Listen(7), Move Silently(7), Tumble(6), UMD(7), Save(5), <br/>\n09: Save(9), <br/>\n10: Save(13), <br/>\n11: Save(17), <br/>\n12: Listen(1), Save(20), <br/>\n13: Appraise(5), Hide(5), Listen(1), Move Silently(5), Tumble(5), UMD(5), Save(4), <br/>\n14: Listen(1), Save(7), <br/>\n15: Listen(1), Save(10), <br/>\n16: Listen(1), Save(13), <br/>\n17: Listen(1), Save(16), <br/>\n18: Appraise(5), Hide(5), Listen(1), Move Silently(5), Tumble(5), UMD(5), <br/>\n19: Listen(1), Save(3), <br/>\n20: Listen(1), Save(6), <br/>\n21: Appraise(3), Hide(3), Listen(1), Move Silently(3), Tumble(3), UMD(3), <br/>\n22: Appraise(1), Hide(1), Listen(4), Move Silently(1), Tumble(2), UMD(1), <br/>\n23: Appraise(1), Hide(1), Listen(1), Move Silently(1), Tumble(1), UMD(1), Save(4), <br/>\n24: Appraise(1), Hide(1), Listen(1), Move Silently(1), Tumble(1), UMD(1), Save(8), <br/>\n25: Appraise(1), Hide(1), Listen(1), Move Silently(1), Tumble(1), UMD(1), Save(12), <br/>\n26: Appraise(1), Hide(1), Listen(1), Move Silently(1), Tumble(1), UMD(1), Save(16), <br/>\n27: Appraise(1), Hide(1), Listen(1), Move Silently(1), Tumble(1), UMD(1), Save(20), <br/>\n28: Appraise(1), Hide(1), Listen(1), Move Silently(1), Tumble(1), UMD(1), Save(24), <br/>\n29: Appraise(1), Hide(1), Listen(1), Move Silently(1), Tumble(1), UMD(1), Save(28), <br/>\n30: Appraise(1), Hide(1), Listen(1), Move Silently(1), Tumble(1), UMD(1), Save(32), <br/>\n31: Save(36), <br/>\n32: Save(40), <br/>\n33: Appraise(3), Hide(3), Listen(3), Move Silently(3), Tumble(3), UMD(3), Save(32), <br/>\n34: Save(36), <br/>\n35: Save(40), <br/>\n36: Appraise(3), Hide(3), Listen(3), Move Silently(3), Tumble(3), UMD(3), Save(32), <br/>\n37: Save(36), <br/>\n38: Appraise(2), Hide(2), Listen(2), Move Silently(2), Tumble(1), UMD(2), Save(35), <br/>\n39: Appraise(1), Hide(1), Listen(1), Move Silently(1), Save(41), <br/>\n40: Appraise(1), Hide(1), Listen(1), Move Silently(1), Save(47),</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:33 PM - May 31, 2012",
      "content": "<div>If you're contemplating DEX-based build and don't want to do \"strategery\", here's some ideas, but WOW, Maximillian Kane's build is indeed solid. With any of these, I'll post the full build upon request, and feel free to customize it for your environment and playing style.<br/>\n<br/>\nIf you're concerned with low STR in a DEX-based build, here's a compromise: a DEX-Based <strong>Monk 25 / Sorcerer 1 / RDD 14</strong> that ends with DEX 32 and STR 22. This build has no Epic Dodge or Uncanny Dodge, though. Here are the stats and skills as I played it in Sands of Fate, a very high magic environment:<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tAbilities:<br/>\nSTR: 14 (22)<br/>\nDEX: 16 (32)<br/>\nCON: 10 (12)<br/>\nWIS: 14<br/>\nINT: 14 (16)<br/>\nCHA: 8 (10)<br/>\n<br/>\nStats:<br/>\nHitpoints: 416<br/>\nSkillpoints: 290<br/>\nSaving Throws (Fortitude/Will/Reflex): 24/27/30<br/>\nSaving Throw bonuses: Spells: +9, Mind Effects: +2<br/>\nBAB: 24<br/>\nAB (max, naked): 39 (melee), 36 (ranged)<br/>\nAC (naked/mundane armor/shield only): 42/42<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nSkills:<br/>\nDiscipline 43(49), Lore 43(46), Persuade 36(36), Search 43(46), Spellcraft 42(45), Spot 43(45), Tumble 40(51)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>Rogue 19 / Monk 11 / Fighter 10</strong>: This one has Epic Dodge and trap and lock handling skills and one more attack per round compared to that Monk-RDD build. Stats and skills:<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tAbilities:<br/>\nSTR: 16<br/>\nDEX: 16 (32)<br/>\nCON: 12<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nStats:<br/>\nHitpoints: 382<br/>\nSkillpoints: 369<br/>\nSaving Throws (Fortitude/Will/Reflex): 22/17/33<br/>\nSaving Throw bonuses: Spells: +4, Mind Effects: +2, Traps: +4<br/>\nBAB: 26<br/>\nAB (max, naked): 41 (melee), 38 (ranged)<br/>\nAC (naked/mundane armor/shield only): 33/34<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nSkills:<br/>\nDisable Trap 34(38), Discipline 42(45), Lore 21(23), Open Lock 43(54), Persuade 21(20), Search 43(45), Set Trap 5(18), Spellcraft 18(20), Spot 43(42), Tumble 40(51), UMD 41(40)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>Monk 25 / Fighter 10 / Shadowdancer 5</strong>: This one has Epic Dodge, HiPS and the maximum attacks per round. Stats and skills:<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tAbilities:<br/>\nSTR: 14<br/>\nDEX: 16 (32)<br/>\nCON: 10<br/>\nWIS: 14<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nStats:<br/>\nHitpoints: 380<br/>\nSkillpoints: 291<br/>\nSaving Throws (Fortitude/Will/Reflex): 25/24/33<br/>\nSaving Throw bonuses: Spells: +4, Mind Effects: +2, Traps: +1<br/>\nBAB: 26<br/>\nAB (max, naked): 41 (melee), 38 (ranged)<br/>\nAC (naked/mundane armor/shield only): 38/38<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nSkills:<br/>\nDiscipline 43(45), Hide 43(54), Listen 43(45), Lore 18(20), Move Silently 43(54), Persuade 22(21), Spellcraft 18(20), Tumble 43(54)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>Rogue 29 / Monk 10 / Shadowdancer 1</strong>: This one has Epic Dodge, HiPS, and trap and lock handling skills, but one less than maximum attacks per round. Stats and skills:<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tAbilities:<br/>\nSTR: 14<br/>\nDEX: 16 (32)<br/>\nCON: 12<br/>\nWIS: 12<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nStats:<br/>\nHitpoints: 302<br/>\nSkillpoints: 431<br/>\nSaving Throws (Fortitude/Will/Reflex): 21/21/35<br/>\nSaving Throw bonuses: Spells: +4, Mind Effects: +2, Traps: +5<br/>\nBAB: 25<br/>\nAB (max, naked): 39 (melee), 36 (ranged)<br/>\nAC (naked/mundane armor/shield only): 32/32<br/>\nSpell Casting: <br/>\nAlignment Changes: 0<br/>\n<br/>\nSkills:<br/>\nDisable Trap 34(38), Discipline 42(44), Hide 43(54), Listen 43(44), Lore 29(31), Move Silently 43(54), Open Lock 43(54), Search 40(42), Set Trap 12(25), Spellcraft 18(20), Tumble 40(51), UMD 26(25)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>Rogue 16 / Wizard 2 / Arcane Archer 22</strong>: This is the one I am currently playing in SoU right now, but planning eventually to play in Sands of Fate after HotU. It has Epic Dodge, trap and lock handling skills, and a decent ranged attack. This one is an Elf, but all of the others are Humans. Stats and skills:<br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n\t\tAbilities:<br/>\nSTR: 14<br/>\nDEX: 18 (34)<br/>\nCON: 12<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 10<br/>\n<br/>\nStats:<br/>\nHitpoints: 320<br/>\nSkillpoints: 330<br/>\nSaving Throws (Fortitude/Will/Reflex): 20/17/35<br/>\nSaving Throw bonuses: Spells: +9, Mind Effects: +2, Traps: +3<br/>\nBAB: 26<br/>\nAB (max, naked): 39 (melee), 53 (ranged)<br/>\nAC (naked/mundane armor/shield only): 32/35<br/>\nSpell Casting: Wizard(1)<br/>\nAlignment Changes: 0<br/>\n<br/>\nSkills:<br/>\nDisable Trap 40(44), Lore 35(37), Open Lock 40(52), Persuade 20(20), Search 40(44), Set Trap 5(19), Spellcraft 43(45), Spot 42(43), Tumble 40(52), UMD 25(25)</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "4:27 PM - Jun 14, 2012",
      "content": "<div>As a follow-up, I used the F10 R5 WM25 build Max posted on page 1 removing Exotic and ESF Discipline for 2 more Great STR to get AB to 50 and am using it on a different (higher magic) PW.  It's leveled great and been perfect PvM, thanks.  Only downside is there's a little more PvP than I had expected, but im gonna try a few different things.  thanks for the advice here.</div>"
    }
  ]
}