{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "067",
  "name": "Co-op Builds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/co-op-builds-t2355866.html",
  "author": "charleswatkins",
  "avatar": "10235447_1565972826.jpg",
  "replies": 15,
  "posts": [
    {
      "author": "charleswatkins",
      "avatar": "no_avatar.png",
      "timestamp": "12:40 AM - Dec 21, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I'm new to NWN but I know my way around Baldur's Gate and Divinity. A buddy and I want to start a co-op game and seeing all the effort here that's gone into character builds, I'm wondering if there might be a guide for two player co-op.  What are some builds that work well together?<br/>\n<br/>\nI'm used to playing some kind of Fighter/Thief and my partner is a cowardly Sorcerer. But I gather NWN is going to be a bit more complicated.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:13 PM - Dec 21, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's a big question, Charles. Oh, and hello and welcome, btw!<br/>\n<br/>\nIt took me a long time to adjust to Neverwinter from Baldur's. It wasn't so much the rule changes as the lack of a party, because Neverwinter is predominantly a solo or minimally co-oped game. Thus, many of the builds you'll find here are completely self-sufficient and require no companions. There are hundreds - if not thousands - of options just for solo play, so the multipliers involved for a co-op guide would be astronomical!<br/>\n<br/>\nThat said, a Fighter/Rogue (not a Thief anymore) type should give a good melee presence - though you'll have to decide whether you want a strength or dexterity based one. And a caster of some kind - Wizard/ Sorcerer/ Bard or a more Divine rooted one - would make a worthy addition.<br/>\n<br/>\nGive us a few more details of the kind of build(s) you're looking for and we'll be happy to oblige.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:25 PM - Dec 21, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">For the OC?<br/>\n<br/>\nYou can solo it with a sharp stick.<br/>\n<br/>\nSo any combination involving two should be more than good enough.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:33 PM - Dec 21, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You're not helping, Webby, you do know that? It took me a while to grasp that \"A frog in a frock or a toad in a tuxedo\" (TM, me) could blitz the OC, but you have to learn the ropes first - and doing it is the best way to illumination (ohm).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:49 PM - Dec 21, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I made an attempt to solo the OC with a low hitpoint sorcerer. It was \"hardcore\" - if you die, the game ends. I even documented it in a thread here. I failed in the prelude. And I am an experienced player.<br/>\nSo show the new players some respect. Character building is rather complicated and it is easy to go wrong.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "charleswatkins",
      "avatar": "no_avatar.png",
      "timestamp": "10:49 PM - Dec 21, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you, Stagmeister -- for your greeting and offer of help.<br/>\n<br/>\nOne of my favorite D&amp;D classes is the Ranger/Cleric, so I thought I might try some variation on that. Lots of interesting Fighter builds are posted, some with Cleric capabilities. Arcane Archer looks like fun, so how about Ranger/Cleric/Arcane Archer?  Or maybe Druid instead of Cleric? <br/>\n<br/>\nFor the magic user, I lean to the Wizard over the Sorcerer for the variety of spells and the added skills. We could go Rogue (or Bard?) as a second class. <br/>\n<br/>\nI'd love to find something resembling these, so I won't have to go in blind regarding skills and feats. For now, I'm still trying to decide the ones I want.<br/>\n<br/>\nCheers,<br/>\nCharles<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:15 PM - Dec 21, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome to our guild Charles!<br/>\nRanger/Cleric is a very strong combo in earlier versions of dnd and in Baldurs Gate.<br/>\nIn NwN Cleric is a very strong class on its own. So you can easily drop Ranger and look for other combos.<br/>\nBard is a very strong class for party play, primarily because of the effects the songs have on the party and the enemies. <br/>\nAA is the class that has most to offer if you want an archer.<br/>\nIf you want a wizard  then rogue as minor class has much to offer with its wide selection of class skills boosted by the extra skill points granted by the wizards high intelligence.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:18 PM - Dec 21, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Interestingly enough, I recently asked the question about the lack of Cleric/Ranger builds here - <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/why-no-cleric-ranger-builds-t2355667.html\" rel=\"noreferrer\" target=\"_blank\">Cleric/Ranger</a> . That thread told me why it's a false synergy in NwN, and doesn't work nearly as well as in BG. Another problem with going for an Arcane Archer is that it requires at least 1 level of Bard, Sorcerer or Wizard. Cleric doesn't qualify.<br/>\n<br/>\nA Ranger (or Fighter, or CoT)/ Cleric/ Monk could work well, and have decent Zen Archery, but I offer no guarantees - others will have wiser thoughts than I.<br/>\n<br/>\nSorry, have to go for now - I'll look at the second build later.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:02 AM - Dec 22, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">May I also suggest that you skip completely the OC and go straight and without any reservations to <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-aielund-saga-t515487.html\" rel=\"noreferrer\" target=\"_blank\">The Aielund Saga</a> instead?<br/>\n<br/>\nOkay, maybe if you don't know the controls yet, you should play the SoU/HoTU, once. <br/>\n<br/>\nAlso, for a completely new NwN player, the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/concept-yardstick-builds-t2293896.html\" rel=\"noreferrer\" target=\"_blank\">Yardstick Builds</a> might prove handy. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:53 AM - Dec 22, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The OC does a good job of teaching you how to play the game.  There are many modules and campaigns better than the OC (Aielund being a prime example), but it is not nearly as awful as people make it out to be.  I have enjoyed it quite a few times.<br/>\n<br/>\nWhen you finish the OC, do not take that character into SoU.  SoU starts at level 1, and HotU follows SoU.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:09 AM - Dec 22, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, I have enjoyed the OC too! <br/>\n<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/VQC0pzsVxL8\" style=\"background:url(https://i.ytimg.com/vi/VQC0pzsVxL8/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><br/>\n<br/>\n<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:46 AM - Dec 22, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Look, I get the \"you have to learn to walk before you can run\" blather.  I do, I get it.<br/>\n<br/>\nBut regardless of build, equipment, etc, the first time anyone runs into the Dire Spider in that sewer, especially coming from BG style of D&amp;D (although the OP does say they are familiar with Divinity) is going to be screaming as they die multiple times.<br/>\n<br/>\nIt's like an abrupt, rude shock of difficulty.<br/>\n<br/>\nNWN and 3rd Ed uses Damage Reduction rules.  And they can be a bit complicated as to how to penetrate (re : do damage against) them.<br/>\n<br/>\nHaving a second player (meaning double the resources, etc) makes things much easier - but that spider is probably going to kill you both anyways.  It will most likely take you both time and experience to understand what works (and what doesn't).  3rd edition rules have LOTS of things to learn in them.  Hell, the existence of this place alone is testimony to that!<br/>\n<br/>\nThe first thing to be aware of with the OC is that it was made for characters level 1 ~ 20.  Meaning level 40 builds will not help here.  Also, unless one is going to be scamming the system, there is a finite amount of XP available. Also, there is a limit on what type of items one will find or can purchase, create, etc.<br/>\n<br/>\nWe have a section here with level 20 builds - <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/preepic-level-20-builds-f6/\" rel=\"noreferrer\" target=\"_blank\">preepic-level-20-builds-f6/</a><br/>\n<br/>\nUsing any one of these will lead to better results. <br/>\n<br/>\nNormally, I would suggest a Tank character (meaning one that can stand and fight, and reasonable expect to survive some blows as well as dish some damage out) and a nuker (which means someone who can really deal the AoE (Area of Effect) damage.  Having some healing will be helpful, but not absolutely necessary as healing is always available via the Recall Stone and Temple.<br/>\n<br/>\nThe NWN OC will first take you through the Prelude (I seriously cannot believe that Mick died there, but perhaps he got critted). It is basically a \"how to do the basics\" of NWN.  Movement, access inventory, the character sheet, basic combat, ranged combat, etc.  And it does a pretty good job of this imo.<br/>\n<br/>\nBut once leaving the Prelude, things get complicated, quickly.  You will be offered a choice of paths you can take.  What is important to note about the different paths, is that they favor different classes (meaning they offer different strengths/weaknesses in the form of challenge).  Where one build will thrive, another may struggle a bit due to how the areas are tailored.  <br/>\n<br/>\nLater, the challenge will pick up as the more complicated abilities, feats, and spells, etc become available (both for and against you) - it is seriously possible to totally gimp your build to the point of absolute uselessness.<br/>\n<br/>\nUsing builds from the link I have provided will go a long way towards avoiding that fate.<br/>\n<br/>\nOther than that, after getting through the learning curve, it is basically as I said - anyone and their grandmother can beat the OC with a sharp stick.  It is made to be like this.<br/>\n<br/>\nOne thing that one might want to know is that Bards have it easiest in the OC due to Bioware bias.  I guess they considered Bards weak, or something.  Anyways, having a Bard along is going to really boost the viability of your game.  Just get to know the intricacies of Bard Song and Curse Song and you will be good to go.<br/>\n<br/>\nI am not sure how the OC handles co-op play in regards to XP.  I do know that using Henchmen and Familiars/Summons reduces XP, so there is that.  Not that it is going to be a major factor in the game - as I have previously mentioned, the OC is not designed to be difficult (with some noteable exceptions).  Those exceptions are well documented these days (not like it was when I first played the game back when it first came out) and strategies and tactics with how to deal with them are readily online.<br/>\n<br/>\nWhat I will suggest is this : if one gets \"stuck\" (like with the Dire Spider) then one should go another way, earn XP, level up, then come back later.  This will often unlock abilities, feats, items, etc that will make a previous encounter that was difficult a breeze.<br/>\n<br/>\nI envy you that this is all new - I wonder how far it will take you and your co-op buddy.  If you both like what you experience, you might want to skip Modules altogether and go for the Online (Persistent World) experience.  With hordes of different custom created worlds out there, the amount of fun one gets for the basic cost of the game is basically unlimited.  This also goes for the custom created Modules, of course, but Persistent Worlds where there are lots of players really changes how the game feels.<br/>\n<br/>\nIt completes it imo.<br/>\n<br/>\nI play on the World of Greyhawk.  It is a Persistent World that is based on the original World of Greyhawk intellectual property of Gary E. Gygax, the creator of D&amp;D (some say co-creator).  It is a pretty hardcore world, but it contains most of the D&amp;D modules that a lot of us grew up playing in Pen and Paper (PnP) and is quite nostalgic in that sense (though it is based in the more recent timelines of Greyhawk, so there is that).  It is probably not the first stop for a beginner, as it is a rather difficult environment, harsh and challenging (even for those of us who consider themselves experienced).  <br/>\n<br/>\nWhatever you do choose to do, I hope it leads to hours and hours of fun and excitement, as it has for me all these many, many years.<br/>\n<br/>\nNWN is an exception, a jewel, a bright star, that stands out from all others as a game.  There will most likely never again be a game quite like it in our lifetimes.  It's worth a play, and even more worth a stay.<br/>\n<br/>\nOne thing does have to be said here - if you are planning to do the OC, then go into SoU and HotU, you should be aware that the OC does NOT go into SoU!  Basically, SoU is another version of the OC, in that it is for beginning characters.  It was made due to a screaming majority asking for better RP elements, storyline, etc.<br/>\n<br/>\nHotU can be played from both the OC and from SoU, dependingly.  It is basically your \"Epic Adventure\" in a nutshell - and it does accomplish this.<br/>\n<br/>\nWhatever you do or decide, I wish you fun!  I am very confident that NWN can provide you with exactly that, regardless of the form that one is used to.  There is a flavor for everyone.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "charleswatkins",
      "avatar": "no_avatar.png",
      "timestamp": "7:08 PM - Dec 22, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've been going through pages and pages of builds and am starting to see why you guys are so into it. But I figure I need some gameplay to really appreciate what you are doing, so I'm just going to start with some basic characters.<br/>\n<br/>\nI gave up on the Ranger/Cleric and am now looking at Rogue/Cleric along the lines of jimbobslimbob's Shadow Heretic. We need a front line smasher and a Scythe swinging Priest sounds like fun.<br/>\n<br/>\nFor my partner, we'll try a Wizard/Bard and maybe later get him into Arcane Archer. Can't find many Wizard/Bard builds, so I'm wondering if there's a problem.<br/>\n<br/>\nSince we won't need Tomi or Linu, we can take Daelan and Grimgnaw as our Henchmen.<br/>\n<br/>\nCheers! Now I'm off to study Feats. Suggestions?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:10 PM - Dec 22, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Rogue/Cleric can work well together. One of the greats is the Shadow Priest build. It's a level 40 build, however.<br/>\n<br/>\nI would not recommend a Wizard/Bard. Wizard uses Int as a primary stat, and Bard uses Cha. These are not complementary. <br/>\n<br/>\nSorcerer/Bard is (both utilize Cha).<br/>\n<br/>\nSee how that works?<br/>\n<br/>\nAs for AA, one only needs Bard for a good AA. Sprinkle in some Fighter, and you have a super Archer!<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:51 PM - Dec 22, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"25933\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=25933&amp;sid=d5a131c0fb100a53f19f7aa551db4ca3#p25933\">↑</a><div class=\"responsive-hide\">Dec 22, 2021</div></cite>The Prelude (I seriously cannot believe that Mick died there, but perhaps he got critted).</div></blockquote>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-2-hp-per-level-challenge-t2355412.html\" rel=\"noreferrer\" target=\"_blank\">Here is the story</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:50 AM - Dec 23, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Web is correct that a Bard is very good for the OC, as is a Paladin, really. <br/>\nAll those persuade/diplomacy checks are their bread and butter plus they both have awesome abilities. <br/>\n<br/>\nThe old ECB had a specific section for level 28 builds made with HotU in mind but later that was rounded to level 30, as we have here. <br/>\nIf you go through the OC you will probably want to hear the end of the tale too, so a trip to the Underdark is natural. <br/>\nIn the OC/HotU you will also meet the most mentally stable character of any Bioware game, ever. Aribeth. <br/>\nShe is an Elf, but actually a half-elf. <br/>\nAnd she is obviously a Paladin of Tyr. <br/>\nOh wait, she is actually a blackguard! <br/>\nScrap that, she is definitely a Paladin of Tyr and your true love! <br/>\nOr she isn't...<br/>\nTrust me, better stick with Dickin, he's far better and way more sane than any Paladin in NwN!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}