{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "117",
  "name": "NWN2 Custom Class Spellsword Request",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/nwn2-custom-class-spellsword-request-t2354605.html",
  "author": "Kitty",
  "avatar": "10577588_1510287072.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "Kitty",
      "avatar": "no_avatar.png",
      "timestamp": "5:42 PM - Sep 25, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi there!<br/>\n<br/>\n A server I play on recently added this custom PRC class..\n<blockquote><div>\n<blockquote><div>Abjurant Champion<br/>\n<br/>\n (PRESTIGE CLASS: This class is not available at character creation and must be unlocked by meeting special requirements, listed below.)<br/>\n<br/>\n The abjurant champion focuses his arcane abilities both to augment his personal defense and to hinder enemy spellcasters. Perfectly suited for martial stalwarts who dabble in magic, this class offers characters the ability to improve their combat skills in ways neither soldiers nor spellcasters can.<br/>\n<br/>\n Class Requirements:<br/>\n<br/>\n - Base Attack Bonus: 5<br/>\n - Spellcasting: Must be able to cast first level spells<br/>\n - Skills: Concentration 4 ranks<br/>\n - Feats: Combat Casting, Martial Weapon Proficiency<br/>\n<br/>\n Class Features:<br/>\n<br/>\n - Hit Die: d10<br/>\n - Base Attack Bonus: High.<br/>\n - High Saves: Fort, Will.<br/>\n - Weapon Proficiencies: Weapon and Armor Proficiency: Argent savants gain no proficiency with any weapon or armor.<br/>\n - Skill Points: 2 + Int Modifier.<br/>\n - Class Skills: Concentration, Craft Alchemy, Craft Armor, Craft Weapon, Lore, and Spellcraft.<br/>\n - Spells per Day/Spells Known: At each level an abjurrant champion gains new spells per day (and spells known, if applicable) as if he had also gained a level in an arcane spellcasting class to which he belonged before adding the prestige class level. He does not, however, gain any othis benefit a character of that class would have gained (such as the bonus feat sometimes gained by a wizard). If he had more than one arcane spellcasting class before becoming an argent savant, he must decide to which class to add each level for the purpose of determining spells per day and spells known.<br/>\n<br/>\n - Abjurant Armor: At 1st level any time you cast an abjuration spell that grants you an armor bonus or shield bonus to AC, you can increase the value of the bonus by your abjurant champion class level. Abjurant champions rely on shield and similar spells instead of actual armor.<br/>\n<br/>\n - Arcane Boost (Attack): At 2nd level you can increase your attack bonus twice per day by your class level for 3 rounds.<br/>\n<br/>\n - Arcane Boost (Saving Throws): At 2nd level you can increase your saving throws twice per day by your class level for 3 rounds.<br/>\n<br/>\n - Arcane Boost (Resistance): At 3rd level you can increase your energy resistance twice per day by your class level for 3 rounds.<br/>\n<br/>\n - Extended Abjuration: At 4th level you depend on your abjuration spells to protect you in combat. Double the duration of abjuration spells you cast, as if you had applied the Extend Spell feat to them (but without any change in level or casting time).<br/>\n<br/>\n - Arcane Boost (Damage): At 5th level you can increase your physical damage twice per day by your class level for 3 rounds.<br/>\n<br/>\n - Arcane Boost (AC): At 5th level you can increase your armor class twice per day by your class level for 3 rounds.</div></blockquote>\n</div></blockquote>\n\n Now, it seems to me like this class could be very broken if powerbuilt to be a spellsword of some description. I'm not the best builder however, so I thought I'd bring it here and see if anyone can come up with something absurd to demonstrate the benefits of this class! <br/>\n<br/>\n Oh, I didn't see the build request guidelines when I first posted this, so..<br/>\n<br/>\n<span style=\"color:#ECF3F7\">1) PvM or PvP - Builds that are maximized for PvM are often not maximized for dueling with other PCs.</span><br/>\n<br/>\n Both, ideally!<br/>\n<br/>\n<span style=\"color:#ECF3F7\">2) Level cap - What is the maximum level that the build (or server) will likely reach?</span><br/>\n<br/>\n 30<br/>\n<br/>\n<span style=\"color:#ECF3F7\">3) Race preference - Unless a class demands a specific race or races, Human will be assumed. Otherwise, specify the your favorite.</span><br/>\n<br/>\n The character I'd like to build this with would probably be a tiefling. <br/>\n<br/>\n<span style=\"color:#ECF3F7\">4) Class preference - Describe which class(es) you have been considering so far and why. Your own concept is key to building what will do the job and be the most fun for you to play.</span><br/>\n<br/>\n This custom class, obviously! Other than that, whatever works. <br/>\n<br/>\n<span style=\"color:#ECF3F7\">5) Melee preference - A few options to consider are: dual-wielding vs. one-hand with shield, high AC dexterity-based vs. high-damage strength-based, sneak attacks (stealth), taunting, specialized attacks (e.g. whirlwind, knockdown, called shots, sneaks, death attacks... you name it!).</span><br/>\n<br/>\n Melee with buffs and spell support as needed within the confines of the build. I'd imagine one hand with a shield is probably the way to go here but perhaps with some of this classes buffs for AC you could even roll with a two-hander. <br/>\n<br/>\n<span style=\"color:#ECF3F7\">6) Range preference - DEX archery or Zen Archery (WIS)</span><br/>\n<br/>\n N/A<br/>\n<br/>\n<span style=\"color:#ECF3F7\">7) Weapon preference - Which weapon type would you enjoy using the most?</span><br/>\n<br/>\n A scimitar I suppose if I'm using a one-hander, otherwise a greatsword or something!<br/>\n<br/>\n<span style=\"color:#ECF3F7\">8) Maximum item enhancement - In the setting where you intend to play this character, what is the highest enchantment (or bonus) that is likely to be used on equipment?</span><br/>\n<br/>\n +6 generally<br/>\n<br/>\n<span style=\"color:#ECF3F7\">9) Spellcasting - If you are requesting a build that is likely to use magic, explain its general use. Will it be used primarily to add enhancements to a physical base attack (i.e. for buffing), to cast strong offensive spells or a balance of both areas of expertise? If arcane-based, would you prefer to be able to cast spells reliably while wearing armor? Is indispellability of buffs an important consideration?</span><br/>\n<br/>\n I'm looking for a spellsword so I think I'm primarily looking to be tough in melee, so a buffer I guess. Unless there's potential for more than that. I'm not a great builder, that's for you folks to figure out! ♥ <br/>\n<br/>\n<span style=\"color:#ECF3F7\">10) Custom factors - Are there any special conditions that will affect how the build will work where you intend to play it? A PRC server is one example of a custom environment. Many servers have their own modifications to the standard game which will factor into the devising of a solid character build. Also, some community modules set their own rules</span><br/>\n<br/>\n There are some spell changes on this server and quite a lot of bug fixes, but it's hard to find a complete list of them. <br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:10 AM - Sep 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A few more questions...<br/>\n<br/>\n How many levels of the PRC class are allowed during pre-epic levels?  Typical for prestige is 10.<br/>\n Is either Palemaster or RDD a viable class on your server?<br/>\n I have no clue about the features of the tiefling subclass.  Explain, please. I'd at least need to know the starting ability bias and class skills.  Any other affinities or bonuses would also be helpful when alloting skills.  If there are any bonus feats, list those as well.<br/>\n Are there any level-up class restrictions like a minimun number before multiclassing?<br/>\n<br/>\n I'm inclined to suggest a bardic version so that you could \"theoretically\" qualify for the BAB prereq by level 8 instead of 11, have a decent skill set (to compensate somewhat for the poor skill base of the subclass) and regular tumble dumps.  You'd be needing at least CHA 11 plus enough CHA for whatever spell level you figure could be reached.  Naturally, equipping armor (and/or shield) will force you to use only Still spells for offensive casting so that feat will be required.  Bard 16 would allow access to all level spells, but whether you could even fit that many arcane levels is problematic at this point.<br/>\n<br/>\n I'm assuming that the term \"<em>Base Attack Bonus: High</em>.\" means it's a 4/4 combat class like fighter, barb, ranger, etc. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kitty",
      "avatar": "no_avatar.png",
      "timestamp": "12:31 PM - Sep 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You can take as many as you want before pre-epic levels I suspect, whatever the default allowed by NWN is.<br/>\n Palemaster and RDD are unchanged from the vanilla game so yes, I'd expect they are very viable.<br/>\n<br/>\n Tieflings are identical to the vanilla except they no longer have a -2 penalty to charisma. Class skills and the like are basically all the same. This server has vanilla classes that are almost entirely unchanged apart from some exploit fixes, and then it has newly added classes, like this one. There aren't any level up restrictions that I know of. <br/>\n<br/>\n BAB High means exactly what you think it does, yes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:13 PM - Sep 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have no information about tieflings since neither I nor any of the vets of the ECB ever use or play with the PRC (AFAIK, anyway). Here at the guild, \"vanilla\" means AD&amp;D 3.0, the version that is installed with v1.69. No PRC. No CEP.  No CPP. No custom mods at all.  Your racial choices here are human, elf, dwarf, half-elf, half-orc, halfling and gnome. You'll need to list the racial features here if you want a more detailed and worthwhile suggestion.<br/>\n<br/>\n Without full discIosure, I recommend you build something like bard12/Abjurant Champ8/RDD10 for offense or bard12/Abjurant Champ8/PM10 to tank for party play.  Final CHA will need to be at least 14 to cast Lvl 4 spells. Pre-epic split would be bard8/AC8/RDD4 or bard8/AC8/PM4.  Either combo will result in an APR of 4 with the RDD version a significantly higher BAB.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kitty",
      "avatar": "no_avatar.png",
      "timestamp": "2:16 PM - Sep 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, derp.<br/>\n<br/>\n I'm a total newb, I just realised this isn't the NWN2 version of the ECB forum. That explains why you don't have a clue what I'm talking about when I say tieflings! :D Disregard this topic entirely, then.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:19 PM - Sep 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You may get some build help either on the NWN2 GoG forum or the NWN2 wiki site.  Sorry we couldn't help you. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />  Good luck!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}