{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "018",
  "name": "Durik Stormbreaker - Barbarian 30 / Ranger 9 / Bard 1",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/durik-stormbreaker-barbarian-30-ranger-9-bard-1-t2356230.html",
  "author": "wildleaf",
  "avatar": "10747696_1523894257.png",
  "replies": "4",
  "views": "1.3K",
  "posts": [
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "8:34 AM - May 10, 2024",
      "content": "<div>I don't recall seeing a Barbarian build quite like this. It probably exists but my search revealed nothing. Allow me to present Durik Stormbreaker, who wields a Double Axe with ITWF, Dev Crit, and EDR III. Bard is nabbed towards the end for the very important Appraise skill which you will find very useful after slaughtering a dungeon and selling all the loot. You can also grab Tumble (not necessary, Barbarian no care about being hit) and UMD. If you don't want Dev Crit you can grab toughness and some save boosting feats, or whatever you like. Don't overthink it (I didn't), this is a Barbarian we are talking about.<br/>\n<br/>\nBarbarian(30), Ranger(9), Bard(1), Dwarf<br/>\n<br/>\nSTR: 18 (26)<br/>\nDEX: 8<br/>\nCON: 18 (22)<br/>\nWIS: 8<br/>\nINT: 12<br/>\nCHA: 6<br/>\n<br/>\nDwarf: (Darkvision, Defensive Training vs. Giants, Stonecunning, Hardiness vs. Poison, Hardiness vs. Spells, Offensive Training vs. Goblinoids, Offensive Training vs. Orcs, Skill Affinity: Lore)<br/>\n01: Barbarian(1): Weapon Proficiency Exotic<br/>\n02: Barbarian(2): {Uncanny Dodge I}<br/>\n03: Barbarian(3): Weapon Focus: Double Axe<br/>\n04: Barbarian(4): STR+1, (STR=19)<br/>\n05: Barbarian(5)<br/>\n06: Barbarian(6): Blind Fight<br/>\n07: Barbarian(7)<br/>\n08: Barbarian(8): STR+1, (STR=20)<br/>\n09: Barbarian(9): Improved Critical: Double Axe<br/>\n10: Barbarian(10)<br/>\n11: Barbarian(11)<br/>\n12: Barbarian(12): CON+1, Power Attack, (CON=19)<br/>\n13: Barbarian(13)<br/>\n14: Barbarian(14)<br/>\n15: Barbarian(15): Cleave<br/>\n16: Barbarian(16): CON+1, (CON=20)<br/>\n17: Barbarian(17)<br/>\n18: Barbarian(18): Great Cleave<br/>\n19: Barbarian(19)<br/>\n20: Barbarian(20): CON+1, (CON=21)<br/>\n21: Ranger(1): Epic Damage Reduction I, Epic Weapon Focus: Double Axe, {Dual Wield}<br/>\n22: Barbarian(21)<br/>\n23: Barbarian(22)<br/>\n24: Barbarian(23): STR+1, Great Strength I, (STR=22)<br/>\n25: Barbarian(24): Terrifying Rage<br/>\n26: Ranger(2)<br/>\n27: Ranger(3): Great Strength II, (STR=23)<br/>\n28: Ranger(4): STR+1, (STR=24)<br/>\n29: Ranger(5): Epic Prowess<br/>\n30: Ranger(6): Overwhelming Critical: Double Axe<br/>\n31: Ranger(7)<br/>\n32: Ranger(8): STR+1, (STR=25)<br/>\n33: Ranger(9): Devastating Critical: Double Axe, {Improved Two-Weapon Fighting}<br/>\n34: Barbarian(25)<br/>\n35: Barbarian(26)<br/>\n36: Barbarian(27): CON+1, Epic Damage Reduction II, (CON=22)<br/>\n37: Barbarian(28): Thundering Rage<br/>\n38: Barbarian(29)<br/>\n39: Bard(1): Epic Damage Reduction III<br/>\n40: Barbarian(30): STR+1, (STR=26)<br/>\n<br/>\nHitpoints: 696<br/>\nSkillpoints: 215<br/>\nSaving Throws (Fortitude/Will/Reflex): 28/15/15<br/>\nSaving Throw bonuses: Spells: +2, Traps: +5, Poison: +2<br/>\nBAB: 30<br/>\nAB (max, naked): 42 (melee), 30 (ranged)<br/>\nAC (naked/mundane items only): 17/25 (useless stat)<br/>\n<br/>\nAppraise 42(43), Discipline 43(51), Intimidate 43(41), Lore 2(6), Open Lock 1(0), Perform 5(3), Spellcraft 3(4), Tumble 40(39), UMD 35(33)<br/>\n<br/>\n01: Discipline(4), Intimidate(4), Open Lock(1), Save(10), <br/>\n02: Discipline(1), Intimidate(1), Save(13), <br/>\n03: Discipline(1), Intimidate(1), Save(16), <br/>\n04: Discipline(1), Intimidate(1), Save(19), <br/>\n05: Discipline(1), Intimidate(1), Save(22), <br/>\n06: Discipline(1), Intimidate(1), Save(25), <br/>\n07: Discipline(1), Intimidate(1), Save(28), <br/>\n08: Discipline(1), Intimidate(1), Save(31), <br/>\n09: Discipline(1), Intimidate(1), Save(34), <br/>\n10: Discipline(1), Intimidate(1), Save(37), <br/>\n11: Discipline(1), Intimidate(1), Save(40), <br/>\n12: Discipline(1), Intimidate(1), Save(43), <br/>\n13: Discipline(1), Intimidate(1), Save(46), <br/>\n14: Discipline(1), Intimidate(1), Save(49), <br/>\n15: Discipline(1), Intimidate(1), Save(52), <br/>\n16: Discipline(1), Intimidate(1), Save(55), <br/>\n17: Discipline(1), Intimidate(1), Save(58), <br/>\n18: Discipline(1), Intimidate(1), Save(61), <br/>\n19: Discipline(1), Intimidate(1), Save(64), <br/>\n20: Discipline(1), Intimidate(1), Save(67), <br/>\n21: Discipline(1), Save(71), <br/>\n22: Discipline(1), Intimidate(2), Save(73), <br/>\n23: Discipline(1), Intimidate(1), Save(76), <br/>\n24: Discipline(1), Intimidate(1), Save(79), <br/>\n25: Discipline(1), Intimidate(1), Save(82), <br/>\n26: Discipline(1), Save(86), <br/>\n27: Discipline(1), Save(90), <br/>\n28: Discipline(1), Save(94), <br/>\n29: Discipline(1), Save(98), <br/>\n30: Discipline(1), Save(102), <br/>\n31: Discipline(1), Save(106), <br/>\n32: Discipline(1), Save(110), <br/>\n33: Discipline(1), Save(114), <br/>\n34: Discipline(1), Intimidate(9), Save(109), <br/>\n35: Discipline(1), Intimidate(1), Save(112), <br/>\n36: Discipline(1), Intimidate(1), Save(115), <br/>\n37: Discipline(1), Intimidate(1), Save(118), <br/>\n38: Discipline(1), Intimidate(1), Save(121), <br/>\n39: Appraise(42), Discipline(1), Perform(5), Spellcraft(3), Tumble(40), UMD(35), <br/>\n40: Discipline(1), Intimidate(2), Lore(2), <br/>\n<details><summary>Spoiler</summary>In the twilight years of the Urth, when the sun waned and the shadows of forgotten gods stretched across the land, tales wound through the mountain passes and deep valleys—dark tales of a once-sacred druid's cove now fallen into shadow. Whispers spoke of a necromantic cult, vile worshippers of forbidden powers, who had descended upon the lands. They had slain the forest guardian, a being as old as the hills and as wise as the stars, and planned to use his body in a grim rite to summon their dark lord from the abyss.\nDurik Stormbreaker, of the mountain folk, learned of these whispered horrors not from idle gossips milling in market squares, but from the lips of a dying man, one of the last acolytes of the guardian, who had escaped the slaughter only to find death in the cold arms of the highlands. The message was a burden, heavy as the stone of Durik's own hearth, and it carried a plea for justice.\nAs the moon carved silhouettes of clawed hands from the black mountains, Durik approached the accursed cove. The air was thick with a miasma of decay; the trees stood like sentinels of despair, their branches twisted in agony, mourning their fallen protector in silent vigil. The soil itself bore the sickness of the dark magic that seeped through the forest’s veins, a corruption palpable as the chill of approaching winter.\nDurik, bearing his twin-headed axe Twin Howl—a weapon of renown that echoed with the spirits of ancient warriors—felt the weight of his ancestors’ valor stirring within the steel. The weapon seemed to keen softly, as if sensing the proximity of death and the unhallowed rituals that tainted the once sacred ground.\nWith every step into the cove, Durik's resolve hardened. The earth was slick with the residue of dark magik, each footfall a defiance against the encroaching shadow. The deeper he ventured, the stronger the presence of evil became, a thickening gloom that sought to choke the very breath from his lungs.\nAt the heart of the cove, under a canopy that blotted out the stars, the cultists had gathered. Arrayed in robes as dark as the new moon, they chanted from texts that blasphemed the natural order. The guardian's corpse, lay at the center of their circle, his body desecrated, poised to become the vessel for their dark lord’s entrance into the world.\nDurik’s approach was heralded by a gust of wind—a mournful wail through the trees that silenced the cultists’ chants. They turned, their eyes glinting with the madness of their devotion. Durik felt the stirrings of rage, a tempest in his blood that had been called forth by countless battles, yet never had the call been so righteous.\nWith a roar that echoed the thunder of his mountain home, Durik unleashed the fury of Twin Howl. His roar was not merely a battle cry but a sonic force, imbued with the essence of the axe’s legacy, shattering the concentration of the cultists and fracturing the stones beneath their feet.\nThe battle was a tempest, Durik’s axe arcs of lightning, cleaving shadows and flesh alike. Each cultist that fell severed a thread of the dark weave that held their spell together. As Durik fought, the spirit of the slain guardian seemed to stir, the winds rising in a chorus of ancient oaks, lending strength to his blows.\nAt last, as the final cultist lay defeated, the forest seemed to exhale, a slow release from the grip of corruption. The body of the guardian was freed from desecration. Durik stood alone amidst the carnage, his breath heavy with the scent of pine and blood.\nHis task complete, the mountain son turned homeward, the weight of the axe in his hand a reminder of the eternal vigilance required to guard against the darkness.\n</details></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:20 AM - May 23, 2024",
      "content": "<div>I get a glass cannon feeling when I imagine this character running around in light or no armor wielding a big weapon.<br/>\nThe AC and will/Reflex saves are abysmal, and the dual wield AB is so-so. But you have terrifying rage and dev crit for crowd control and quick kills.<br/>\nIt is relevant to add that DR is 16/-, Dev crit DC is 38 and TR DC is 41 +1d10. (If I'm not mistaken)<br/>\n<br/>\nWith such a build, how well will it cope, and is a strong attack really the best defense?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:22 AM - Sep 25, 2024",
      "content": "<div>All things Mick said stand of course, but if we accept this as a thematic/roleplaying build instead it is good &amp; follows the concept of berserkers well enough. Heck, one could say that this is the dwarven brother of Daelan Red Tiger! Terrible defences as Mick noted in his post but a unique weapon &amp; lots of hit points &amp; DR along with Terrifying rage. Now, for some constructive criticism:<br/>\n<br/>\na) Change the split to Barbarian 29/ Ranger 10/ Bard 1<br/>\nYou lose no epic feats or DR but gain an epic Ranger bonus feat that can be used for Epic Toughness, for +18 hit points net. Hit points are in concept, right?<br/>\nb) Thundering rage is a terrible feat, luckily you can choose to take Mighty rage, instead. In addition to helping you max your AB/DMG/HPs without magic, this feat can effectively double your auras (AFAIR at least) making your Terrifying Tage even better!<br/>\nc) I know you gave a reason for the points in Appraise but a real Berserker would use those points for Taunt instead!  A rare ability that could make you extra helpful at parties too. <br/>\n<br/>\nHave fun &amp; thanks for the build.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:48 AM - Sep 26, 2024",
      "content": "<div>What you could do that might help with AC - though I concede you're regarding it as a \"useless stat\" - is drop Thundering Rage and take Armour Skin as your Barbarian BF.<br/>\n<br/>\nRegarding Mighty Rage: a few years ago Max and I had a discussion about its merits or otherwise - I'll see if I can dig it up.<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: Found it! It comes about halfway down the first page (I know Empyre told me how to link to an individual post, but I can't find it atm): <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=23830#p23830\" rel=\"noreferrer\" target=\"_blank\">Red-Harvest</a></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:43 AM - Sep 27, 2024",
      "content": "<div>Yes, Armour Skin would be a better passive choice than Mighty Rage &amp; Max is mostly correct but not entirely. There are situations (such as low-magic PWs/Modules where it is justified). Moreover, as Mighty Rage is a separate aura that is also getting enhanced by Terrifying Rage, you now have all enemies do double will save checks! And that's for both getting feared &amp; for your AB/Saving Throws! And the penalties (-4AB/-4 Saves) stack! Of course, the combination also gives you +12STR/+12CON/+7 Will. <br/>\n<br/>\nHere's an excerpt from the Neverwinter Nights Wiki: <br/>\n\"<em>When mighty rage and normal rage are both active, there are two auras each of which will trigger a will save to avoid the associated negative effects (the penalty to attack roll and saves stacks in this case)</em>.\"<br/>\n<br/>\nHere's how to do it: You first activate Mighty Rage &amp; then your Terrifying Rage.<br/>\nGame Tip: Your auras are moving with you. So, after you have engaged your opponent for a couple of rounds then move slightly outwards &amp; then inwards again probably triggering another dual save. Is this cheap? Yes, it is, but no more than HiPS or Trap stacking or Dev Crit or Dragons doing the exact same thing to you (unintentionally). <br/>\n<br/>\n<br/>\nHmm, now I'm thinking of building another Barb 28/ Bard 2/ RDD 10, like the Prophet, but also with CON 21 &amp; Mighty-Terrifying Rage (forget EDR III) plus Dev Crit for good measure. I would then give him a heavy flail &amp; name him Wrecking Ball or something...</div>"
    }
  ]
}