{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "362",
  "name": "Versatile-Sneaky-Strengthy-Armory-Leathery-Dude.. halp plz.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/versatile-sneaky-strengthy-armory-leathery-dude-ha-t2348629.html",
  "author": "C1QP0X",
  "avatar": "no_avatar.png",
  "replies": "7",
  "views": "465",
  "posts": [
    {
      "author": "C1QP0X",
      "avatar": "no_avatar.png",
      "timestamp": "5:45 AM - Jan 19, 2014",
      "content": "<div>My vision is a level 20 strength-based melee character build using the classes rogue, fighter and assassin. The idea is to be versatile in the sense he can choose between plate/tower and leather as needed. I'm sure it certainly won't be the most awesome build of all time but like all builds, it will have its uses and then other times, not so much. I've played one in the past and did quite well but that wasn't basic nwn, it was on the Ravenloft server where feats are more plentiful. Anyways, have at it folks!  <br/>\n<br/>\nBtw, whatever race you guys think is best</div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "9:30 PM - Jan 19, 2014",
      "content": "<div>Best race is typically human (extra feat, extra skills).  To maximize death attack you probably should dual-wield.  If you can use full plate and have sufficient strength, there is little reason to go down to leather as this would decrease your AC with no effect on movement speed.  A good split would be fighter 4/rogue 8/assassin 8 which keeps your AB high enough for four standard main hand attacks.  Suggested feats (in no particular order) would be: blind fight, weapon focus, weapon specialization, ambidexterity, two weapon fighting, improved two weapon fighting, expertise, improved expertise, improved critical, power attack, cleave.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:02 AM - Jan 20, 2014",
      "content": "<div>Ambidexterity requires at least 15 DEX, so if you want to be STR-based, that will weaken your character. Also, having a lower DEX will lower your stealth. If you go DEX-based instead, your stealth will be better, your AC while wearing leather will be better, and Ambidexterity will come naturally without diverting points away from your primary ability (DEX), so your AB will be better, but you will do less damage and you won't be able to carry as much. You could take another approach, and go STR-based sword-and-board and forget stealth, which is my style.<br/>\n<br/>\nAlso, with only 8 levels of Assassin, and 10 being the maximum possible pre-epic, your Death Attack will not have a very good DC, which will make it hard to successfully paralyze an opponent. I would therefore recommend dropping Assassin and going with Rogue 16 / Fighter 4. This would get you 3 Rogue feats: Crippling Strike, Improved Evasion, and either Opportunist or Skill Mastery, depending on whether you plan to set traps. For 2 of the 3 feats you save by not dual-wielding, I recommend Knockdown and Improved Knockdown. Even though it means getting Weapon Spec really late, I recommend spreading Fighter levels out, like 3, 8, 13, and 19, for Discipline skill dumps.<br/>\n<br/>\nFor your weapon, you have options. With its 18-20 critical threat range, a scimitar does good damage against enemies who are vulnerable to critical hits, but enemies who are invulnerable to criticals ans sneaks are often also resistant to slashing and piercing, so  blunt weapon would be better against them. If you choose to use a blunt weapon, you still have a choice to make. A warhammer will allow you to keep your shield, but a heavy flail will do more damage. There is yet another option. You could take your last Fighter level at 18 instead of 19, and then take Weapon Focus, Improved Critical and Weapon Spec on scimitar AND take Weapon Focus and Weapon Spec (but not Improved Crit) on either warhammer or heavy flail. That way, you could switch to the right weapon for the enemy you face.<br/>\n<br/>\nIf you go with WhiZard's suggestions, you might be better off replacing Expertise and Improved Expertise with Knockdown and Improved knockdown, or splitting the difference and taking Expertise and Knockdown.<br/>\n<br/>\nIf you take Power Attack and Cleave, then get Cleave as soon as you can because that extra attack is a really big deal early on.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "C1QP0X",
      "avatar": "no_avatar.png",
      "timestamp": "2:58 AM - Jan 20, 2014",
      "content": "<div>Thanks a lot guys. You guys are really helping me \"get back in there\" I've been away from nwn forever, seems like I used to be able to hop in a character building module, start from scratch and come up with something that's both viable and making sense from a roleplaying perspective as well. I really appreciate all the help. Btw, I had a ranger/sorcerer in mind as well because I really, really like the versatility and the dual buffed panthers while exploring dungeons. Could either of you suggest a good spread for that combination as well as starting stats? I can't remember how I pulled that one off.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:57 PM - Jan 20, 2014",
      "content": "<div>Well, summons suck in NWN, even buffed they barely stand a chance, so I wouldn't recommend that in a million years. It would only work at low levels, and at low levels maybe a mephit with DR and regeneration is much more suited for the job.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:40 AM - Jan 21, 2014",
      "content": "<div><blockquote><div><strong>C1QP0X wrote:</strong> I can't remember how I pulled that one off.</div></blockquote>\nLet me suggest a self buffed druid in panther wildshape form, with a panther companion buffed with Greater magic fang, awaken, bulls strength and stoneskin. You can also add summoned and charmed animals to your pack. Of course the wildshape forms get old once you get elemental shape.<br/>\nAdding one or more levels of wizard or sorcerer to get a panther familiar slows down the druid leveling and gives a weak panther, but I must admit that 3 big black cats can look cool for RP purposes.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:56 PM - Jan 21, 2014",
      "content": "<div>I must admit that 3 big black cats look like a tasty meal for a Dragon <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Templar",
      "avatar": "10235261_1528181864.jpg",
      "timestamp": "10:51 PM - Jan 27, 2014",
      "content": "<div>Summons work well due to being another target that is not you. Also buffed they server as semi decent partners. so many servers have changed the summons that it is honestly going to be per your server at how effective they actually are.</div>"
    }
  ]
}