{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "295",
  "name": "Thayan Knight",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/thayan-knight-t2354293.html",
  "author": "TheSupremeForce",
  "avatar": "10235216_1520203711.jpg",
  "replies": 12,
  "posts": [
    {
      "author": "TheSupremeForce",
      "avatar": "10235216_1520203711.jpg",
      "timestamp": "1:46 AM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I'm looking to play a Thayan Knight (shocking, I know).  I'm hoping to hear a few approaches to doing this, and anything a little \"different\" would be especially appreciated.  <br/>\n<br/>\n Quick Breakdown:<br/>\n<br/>\n<strong>Thayan Knights</strong> While the Red Wizards are not opposed to blasting their opponents with deadly spells or shredding the minds of their enemies with dark magic, there are times when they need protectors who have mastered the art of swordplay. These protectors are the Thayan Knights, familiar with magic and loyal to none but the tattooed mages.<br/>\n<br/>\n The Thayan Knights act as bodyguards and enforcers for the Red Wizards and as an extension of their reach. They lead common Thayan troops into battle and help guard the wizard enclaves. Although they are referred to as knights, they have no code of conduct, and the only rule that binds them is that their lives are worth nothing compared to the safety of the Red Wizards. Almost all Thayan Knights are fighters, although monks and rangers have been known to pursue this career. Barbarians are typically too reckless to concentrate on defense, and the Red Wizards consider other individuals too weak for the duties of a Thayan Knight.<br/>\n<br/>\n Race: Human<br/>\n Required Class: Fighter, Ranger, Monk, or Barbarian<br/>\n Base Attack Bonus: +5<br/>\n Skills: Intimidate 2 ranks, Lore 2 ranks<br/>\n Social Status: No slaves<br/>\n Feats: Iron Will, Weapon Focus (longsword)<br/>\n Alignment: Any nongood<br/>\n Special: Sworn allegiance to the Red Wizards of Thay<br/>\n<br/>\n --------------------<br/>\n<br/>\n<span style=\"color:#4C5D77\">1) PvM or PvP - Builds that are maximized for PvM are often not maximized for dueling with other PCs.</span><br/>\n - PvM (PvP can happen, but I don't focus on that sort of thing)<br/>\n<span style=\"color:#4C5D77\">2) Level cap - What is the maximum level that the build (or server) will likely reach?</span><br/>\n - The current level cap is 20.  Raising the cap into the low epics is possible someday, but this character is unlikely to have to worry about it.  <br/>\n<span style=\"color:#4C5D77\">3) Race preference - Unless a class demands a specific race or races, Human will be assumed. Otherwise, specify the your favorite.</span><br/>\n - Has to be Human<br/>\n<span style=\"color:#4C5D77\">4) Class preference - Describe which class(es) you have been considering so far and why. Your own concept is key to building what will do the job and be the most fun for you to play.</span><br/>\n - I'm considering tweaking Valerfor's Shadow Knight <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2351793/The-Shadow-Knight-Fighter-6-Rogue-4-Blackguard-10#.U-YVXfldXRm,\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... -YVXfldXRm,</a> but I wanted to open the door for other possibilities.  <br/>\n - A fighter base seems the obvious bet.<br/>\n - I'd have no issues with playing a character who was predominantly a ranger, monk, or even barbarian, however.  <br/>\n - Any sort of multiclass between these classes is fine.  Rogue splashes would also be viable.  <br/>\n - I could get away with making a neutral character, so Co(Whomever) is on the table.  <br/>\n - Aside from ranger levels, no other casting class is an option.  <br/>\n - I'm not inclined to use weapon master, because the server is undead heavy (along with several other things that laugh off crits and sneak attacks).  <br/>\n<span style=\"color:#4C5D77\">5) Melee preference - A few options to consider are: dual-wielding vs. one-hand with shield, high AC dexterity-based vs. high-damage strength-based, sneak attacks (stealth), taunting, specialized attacks (e.g. whirlwind, knockdown, called shots, sneaks, death attacks... you name it!).</span><br/>\n - One-hand with shield, strength-based is most likely.  I don't imagine sneaking up on things is going to be his go-to option, since he's required to throw himself between Red Wizards and danger without self-regard.  Anything that helps with that would be useful (ie knockdown, taunting).  <br/>\n<span style=\"color:#4C5D77\">6) Range preference - DEX archery or Zen Archery (WIS)            </span><br/>\n - I don't imagine using a feat on Zen Archery.  <br/>\n<span style=\"color:#4C5D77\">7) Weapon preference - Which weapon type would you enjoy using the most?</span><br/>\n - Longsword is required unless I wind up with a monk.  <br/>\n<span style=\"color:#4C5D77\">8) Maximum item enhancement - In the setting where you intend to play this character, what is the highest enchantment (or bonus) that is likely to be used on equipment?</span><br/>\n -  +2 equipment is common enough, and can be crafted.  This includes bonuses to ability scores (though it does cost gold and xp). I MIGHT achieve <span style=\"color:#000000\">+3 at some point (unless I get REALLY lucky and hit a +4 with something).   </span><br/>\n<span style=\"color:#4C5D77\">9) Spellcasting - If you are requesting a build that is likely to use magic, explain its general use. Will it be used primarily to add enhancements to a physical base attack (i.e. for buffing), to cast strong offensive spells or a balance of both areas of expertise? If arcane-based, would you prefer to be able to cast spells reliably while wearing armor? Is indispellability of buffs an important consideration?</span><br/>\n - This is only an issue if I go Ranger, and ranger spellcasting is pretty straightforward.  <br/>\n<span style=\"color:#4C5D77\">10) Custom factors - Are there any special conditions that will affect how the build will work where you intend to play it? A PRC server is one example of a custom environment. Many servers have their own modifications to the standard game which will factor into the devising of a solid character build. Also, some community modules set their own rules</span><br/>\n - There's a limit of One prestige class per character.<br/>\n - Getting a handful of levels under my belt shouldn't take long, but then it will slow down, so I'm unlikely to get much out of a build that can't survive at early-ish levels.    <br/>\n - Medium armor gives a ten percent movement speed penalty.  Heavy armor gives a twenty percent penalty.  It also takes time to remove or put on armor.  Running in slow motion does annoy me at times, but mounts are readily available, so at least I wouldn't be a snail in areas where I can be mounted.  I'll make it work (though I must admit that I've been tempted to go monk heavy at times just for the freedom of moving quickly).      <br/>\n - Immunity items are hard to come by, so somewhat respectable saving throws would be nice.  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:28 AM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I take it you are going to play this in a heavy RP world force?<br/>\n<br/>\n Anyway i have played in \" Thain \" so i am familiar with the limitations of a 20 lvl environment and the rp restrictions/ requirements of it. From what you are describing in your post it seems that you will be better served by a Blackguard or a  Champion Of Torm build, the later in case you can go neutral aligment, with the entry class being of course the Fighter. Mick has his \" Brawler Champion \" and i have my \" Shadow Knight \" in the lvl 20 section, have you looked at them?<br/>\n<br/>\n If you require something else, just let us know.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSupremeForce",
      "avatar": "10235216_1520203711.jpg",
      "timestamp": "3:09 AM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for reminding me of the Brawler Champion.  I knew there was a second option in that section that had slipped my mind (aside from the Shadow Knight).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:37 AM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">From the description, it looks like Thayan Knight is a prestige class. If so, you've listed the requirements, but not what feats or other specials the class gets.<br/>\n If not, I'll see what I can come up with in a Monk-heavy build. Monk will not only give you high speed but some immunities and good saves. DEX-based would give you better AC while STR-based would give you better damage. I am not saying that Monk is your only option, nor even the best option, but it is an option.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSupremeForce",
      "avatar": "10235216_1520203711.jpg",
      "timestamp": "2:04 PM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thayan Knight is not actually a prestige class on the server.  It's considered a faction (there are some other requirements to get into the group, but they're not build based).  I'm definitely interested in a monk-heavy build.  Even if I don't use it for this character (which I might), I've wanted to try a monk for years now, but never followed through.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:33 PM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">True Monk or the cheese variety (kamas) force?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSupremeForce",
      "avatar": "10235216_1520203711.jpg",
      "timestamp": "8:06 PM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Either or both.  It just can't be a monk/cleric or any of that type of cheese.  Bonus points if it's the sort of cheese I can slide into an existing non-good monk order.  That's not actually enforced on the server, so it's not a deal maker/breaker by any means.  <br/>\n<br/>\n These are the existing, applicable monk orders.  I'm listing them in case anyone wants to try that route, but again, it's not enforced on the server anyway.  The first two would be the most obvious, since the Long Death has a heavy presence in Thay, as does Bane (Iron Gauntlet).  Heavy monk is also good.  <br/>\n Monks of the Long Death may multiclass freely as blackguards, assassins, and fighters.<br/>\n Monks of the Iron Gauntlet may multiclass freely as assassins and fighters.<br/>\n Monks of the Old Order may multiclass freely as rogues, sorcerers and shadowdancers, but must maintain more monk levels than their combined levels of other classes.<br/>\n Serpent Guards can multiclass freely as assassins, fighters and rogues.<br/>\n<br/>\n Thanks again!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:27 PM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It appears that you will be in a low-magic environment, so an unarmed Monk will be better than a kama Monk. I suggest Monk 16 / Fighter 4. The Monk gets the best unarmed damage at level 16, 1d20, the most powerful weapon in the game. The 4 levels of Fighter will bring you BAB to just enough to get 1 more attack per round, 6 instead of 5. There is 1 more question before we continue: STR or DEX? DEX-based would give you better AC while STR-based would give you better damage.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSupremeForce",
      "avatar": "10235216_1520203711.jpg",
      "timestamp": "10:52 PM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm leaning strength.  I've had more success killing things quickly in the low-magic, pre-epic environment than I've had success outlasting things via dex.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:39 PM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Empyre speaks true, unarmed (Monk 16/ Fighter 4) is by far the best option in low magic lvl 20 restricted environment. I would go strength based as well.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:45 PM - Aug 10, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here you go. This will meet the requirements for the Thayan Knight faction at level 7.<br/>\n<br/>\n Level 20 Thayan Monk (Monk 16 / Fighter 4)<br/>\n Human, Lawful Non-Good<br/>\n Playable 1 - 20<br/>\n<br/>\n Abilities:<br/>\n STR: 15 (20)<br/>\n DEX: 14<br/>\n CON: 14<br/>\n WIS: 14<br/>\n INT: 12<br/>\n CHA: 8<br/>\n<br/>\n Leveling Guide:<br/>\n Human: (Quick to Master)<br/>\n 01: Monk(1): Dodge, Luck of Heroes, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n 02: Monk(2): {Deflect Arrows}<br/>\n 03: Fighter(1): Blind Fight, Weapon Focus: Unarmed<br/>\n 04: Monk(3): STR+1, (STR=16)<br/>\n 05: Monk(4)<br/>\n 06: Monk(5): Iron Will<br/>\n 07: Monk(6): {Knockdown, Improved Knockdown}<br/>\n 08: Fighter(2): STR+1, Power Attack, (STR=17)<br/>\n 09: Monk(7): Lightning Reflexes<br/>\n 10: Monk(8)<br/>\n 11: Monk(9): {Improved Evasion}<br/>\n 12: Monk(10): STR+1, Improved Critical: Unarmed, (STR=18)<br/>\n 13: Monk(11)<br/>\n 14: Monk(12)<br/>\n 15: Monk(13): Toughness<br/>\n 16: Monk(14): STR+1, (STR=19)<br/>\n 17: Monk(15)<br/>\n 18: Fighter(3): Called Shot<br/>\n 19: Fighter(4): Weapon Specialization: Unarmed<br/>\n 20: Monk(16): STR+1, (STR=20)<br/>\n<br/>\n Stats:<br/>\n Hitpoints: 228<br/>\n Skillpoints: 130<br/>\n Saving Throws (Fortitude/Will/Reflex): 17/16/16<br/>\n Saving Throw bonuses: Spells: +2, Mind Effects: +2<br/>\n BAB: 16<br/>\n AB (max, naked): 22 (melee), 18 (ranged)<br/>\n AC (naked/mundane armor/shield only): 21/26<br/>\n Spell Casting:<br/>\n Alignment Changes: 0<br/>\n<br/>\n Skills:<br/>\n Concentration 23(25), Discipline 23(28), Heal 17(19), Intimidate 2(1), Listen 23(25), Lore 2(3), Spellcraft 9(10), Tumble 20(22)<br/>\n<br/>\n 01: Concentration(4), Discipline(4), Heal(2), Listen(4), Lore(2), Spellcraft(2), Tumble(4)<br/>\n 02: Concentration(1), Discipline(1), Intimidate(1), Listen(1), Tumble(1)<br/>\n 03: Concentration(1), Discipline(1), Spellcraft(1)<br/>\n 04: Concentration(1), Discipline(1), Listen(2), Tumble(2)<br/>\n 05: Concentration(1), Discipline(1), Listen(1), Spellcraft(1), Tumble(1)<br/>\n 06: Concentration(1), Discipline(1), Intimidate(1), Listen(1), Tumble(1)<br/>\n 07: Concentration(1), Discipline(1), Listen(1), Spellcraft(1), Tumble(1)<br/>\n 08: Concentration(1), Discipline(1), Heal(2)<br/>\n 09: Concentration(1), Discipline(1), Listen(2), Tumble(2)<br/>\n 10: Concentration(1), Discipline(1), Listen(1), Spellcraft(1), Tumble(1)<br/>\n 11: Concentration(1), Discipline(1), Listen(1), Spellcraft(1), Tumble(1)<br/>\n 12: Concentration(1), Discipline(1), Heal(2), Listen(1), Tumble(1)<br/>\n 13: Concentration(1), Discipline(1), Listen(1), Spellcraft(1), Tumble(1)<br/>\n 14: Concentration(1), Discipline(1), Heal(2), Listen(1), Tumble(1)<br/>\n 15: Concentration(1), Discipline(1), Listen(1), Spellcraft(1), Tumble(1)<br/>\n 16: Concentration(1), Discipline(1), Heal(2), Listen(1), Tumble(1)<br/>\n 17: Concentration(1), Discipline(1), Heal(2), Listen(1), Tumble(1)<br/>\n 18: Concentration(1), Discipline(1), Heal(2)<br/>\n 19: Concentration(1), Discipline(1), Heal(2)<br/>\n 20: Concentration(1), Discipline(1), Heal(1), Listen(3)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSupremeForce",
      "avatar": "10235216_1520203711.jpg",
      "timestamp": "12:25 AM - Aug 11, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks to the both of you (and to Mick Dagger for the third concept I considered).  I might end up rolling up all three builds at some point, so we'll see what happens.  I don't think anyone's running a monk based Thayan Knight at the moment, so I'll start with that one.  <br/>\n<br/>\n Thanks again, everyone.  I'm glad that I rediscovered this place.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:54 PM - Aug 11, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>TheSupremeForce wrote:</strong><hr/>Thanks to the both of you (and to Mick Dagger for the third concept I considered).<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">   You're welcome ;)</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}