{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "734",
  "name": "The Mage Hunter (Monk 32/Fighter 6/Assassin 2)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-mage-hunter-monk-32-fighter-6-assassin-2-t2355279.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 26,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:51 AM - Jan 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong>The Mage Hunter</strong><br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_b9173cf5f931bc6076daa5867384c628.jpg\" />\n</dl>\n</span><span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://www.pinterest.fr/pin/753649318864372130/\" rel=\"noreferrer\" target=\"_blank\">https://www.pinterest.fr/pin/753649318864372130/</a></span><br/>\n<br/>\nHaven't played a proper primary monk with its crazy spell resistance, so I thought I would try something new.<br/>\n<br/>\nCouldn't find a lot of builds with this class combo in the epic character search engine in the archives surprisingly so I might have stumbled on something unique, the closest being TyrTemplar's Death Dealer - Ultimate Outlaw Monk 24/Fighter 6/Assassin 10<br/>\n<details><summary>Spoiler</summary>ECB Archives Search Engine:\nStonedeath fighter 8 / monk 2 / assassin 30 (dwarf?) by KingHarbromm\nDwarven Mafia monk 9 / fighter 6 / assassin 25 (dwarf) by Kaliban99\nShifty Shiv monk 10 / fighter 6 / assassin 24 (dwarf) by Kaliban99\n\nUsing DoesntPlayAnymore's search engine of more up to date builds up to about mid 2019:\nAsn 18 / Mnk 16 / Ftr 6 - Grimgnaw - by Maximillian Kane on Jul 8 12 8:26 PM\n&amp; tapatalk search of the forum didn't come up with anything else as far as I checked\n</details>\nI know Web has his Monk 38 / Assassin 2 spell immune killer build but I do find it a bit hard to play non full APR (ie BAB &lt;25) combat builds if they aren't clerics with divine power<br/>\n<br/>\n<strong>Edit 3/1/2020: </strong>Anyway I made this stealthy killer, with 400+hp, AC 33 naked, Base AB 38, +100 monk speed, spell resistance 56, ITWF Kama, Improved Knockdown, Mind Immunity, Resist Energy: Fire/Acid to help mitigate against fire/acid mage shields if you can't Mord them, UMD in the build also to help kill em, funny how a mage hunter uses magic to kill magic users, but I guess that's the way things are.<br/>\n<strong>Edit: 3/1/2020: </strong>Adjusted the build slightly to take Assassin 1 at Lvl 21 rather than Lvl 22.<br/>\n<details><summary>Spoiler</summary>Monk(32), Fighter(6), Assassin(2), Human\nAlignment - Lawful Evil\nSTR: 14\nCON: 12\nINT: 14\n\n01: Monk(1): Two-Weapon Fighting, Ambidexterity, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}\n03: Monk(2): Toughness, {Deflect Arrows}\n05: Monk(3)\n07: Monk(5)\n09: Fighter(3): Resist Energy: Fire\n11: Monk(7)\n13: Monk(9): {Improved Evasion}\n15: Monk(11): Resist Energy: Acid\n17: Monk(13)\n19: Monk(15)\n21: Assassin(1): Epic Weapon Focus: Kama\n23: Monk(18)\n25: Monk(20)\n27: Monk(21): Improved Spell Resistance I\n29: Monk(22)\n31: Assassin(2): {Uncanny Dodge I}\n33: Monk(25): Improved Spell Resistance III, Improved Spell Resistance IV\n35: Monk(27)\n37: Monk(29)\n39: Monk(31): Improved Spell Resistance VII\n\nSkillpoints: 289\nSaving Throw bonuses: Mind Effects: +2, Poison: +1\nAB (max, naked): 38 (melee), 35 (ranged)\nSpell Casting: \n\n\n01: Disable Trap(1), Discipline(4), Hide(4), Listen(4), Move Silently(4), Open Lock(1), Set Trap(1), Tumble(4), Save(2), \n03: Discipline(1), Hide(2), Listen(2), Move Silently(2), Tumble(2), Save(4), \n05: Discipline(1), Hide(2), Listen(2), Move Silently(2), Tumble(2), Save(6), \n07: Discipline(1), Hide(1), Listen(1), Move Silently(1), Tumble(1), Save(10), \n09: Discipline(1), Save(16), \n11: Discipline(1), Hide(3), Listen(3), Move Silently(3), Tumble(3), Save(14), \n13: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(19), \n15: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(25), \n17: Discipline(1), Hide(1), Listen(1), Move Silently(1), Tumble(5), Save(26), \n19: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(32), \n21: Disable Trap(1), Hide(1), Listen(1), Move Silently(1), Search(7), Set Trap(4), UMD(24), Save(3), \n23: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(3), \n25: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(9), \n27: Discipline(1), Hide(2), Listen(2), Move Silently(2), Tumble(5), Save(8), \n29: Discipline(1), Hide(2), Listen(2), Move Silently(2), Save(12), \n31: Hide(1), Listen(1), Move Silently(1), Search(6), UMD(10), Save(3), \n33: Craft Trap(3), Discipline(1), Hide(1), Listen(1), Move Silently(1), \n35: Craft Trap(3), Discipline(1), Hide(1), Listen(1), Move Silently(1), \n37: Discipline(1), Hide(1), Listen(1), Move Silently(1), Tumble(5), \n39: Craft Trap(3), Discipline(1), Hide(1), Listen(1), Move Silently(1), </details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:04 AM - Jan 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, it is a bit better at making more attacks (ITWF) and a bit higher AB.<br/>\n<br/>\nBUT!<br/>\n<br/>\nYou are far from the mark of 67 SR which is what you need to be totally immune to magic spells.  In fact, with 50 SR (32 levels monk, + 8 SR improved spell resistance), you are much too low.  It will be more than enough for those pesky, irritating little spellcasters who pop off things like Melf's Acid Arrow, MM, etc.<br/>\n<br/>\nBut when the Bosses come out, they will probably not even sneeze much at that SR.  In a Low Magic Environment where Spellcaster levels are lower, it would do fine.<br/>\n<br/>\nI'm thinking of Bigby's here.  Pretty much the end of any major melee time if one gets whacked with one.<br/>\n<br/>\nKamas can be nice (especially Keen ones!), but they really have problems catching up to the level 20 Monks 1-20 base damage.  I guess it is environment dependant here.  Any environment that does not really double down on mean, keen Kama machine! type weapons will ultimately fall away from the damage potential of bare fists (unless there are no good Monk gloves, that is).<br/>\n<br/>\nAlso, you might want to consider moving that Epic Assassin level to pre-Epic in exchange for a Monk level (basically the same BaB progression, so you lose nothing there) in order to get UMD earlier.  This is what I did (level 7 I believe), and it is pretty remarkable to be able to use all those scrolls and wands, etc. pre-epic (very helpful).<br/>\n<br/>\nThe 2nd level of Assassin is a bit late IMO.  You really start to need that Uncanny Dodge right around the time you have more Dex bonus than Plate and Shield can compensate for.  Not sure if level 31 is optimal for that - in my build, I took the 2nd level of Assassin at level 25, I believe - for the Traps and the UMD, and the Uncanny Dodge, naturally.<br/>\n<br/>\nI'm also thinking that maybe taking Fighter first may be better - that extra feat is mighty tasty!<br/>\n<br/>\nResist Fire and Resist Acid puzzle me.  First of all, you have Improved Evasion, 50 SR, and Uncanny Dodge with a very high Dex.  It is very unlikely that you will take any damage from fire and acid much - just get a wand of lesser breach for those pesky elemental shields (not that resist fire and acid will help much there, anyway).  Other than that, if something is really radiating, then just pop out a missle weapon and go to town - the dex on this build is made for it!<br/>\n<br/>\nSo perhaps those two feats might be replaced with something else more useful.<br/>\n<br/>\nOther than that, nice build!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "4:00 AM - Jan 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">WebShaman, <br/>\nIf Orion drops an assassin level in pre-epic as you suggest, the build will drop from 16 BAB to 15 BAB pre epic and lose the extra attack.  <br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:54 AM - Jan 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, I see, he is trying to keep the BaB attack.<br/>\n<br/>\nWell, that does move UMD into Epics, then.<br/>\n<br/>\nThat seems a bit harsh to play.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "12:50 PM - Jan 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, dropping 1 BAB drops from 4 APR 3, so it is significant.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:26 PM - Jan 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Not really.<br/>\n<br/>\nMy build compensates for that with Circle Kick (and Improved Disarm).  Though it does not have as many attacks as ITWF, it has enough to be viable.  <br/>\n<br/>\nThis build here does rely on the number of attacks it can generate.  While significant, it is not really threatening <em>anything!</em>  No Dev Crit, no massive criticals offered by a low crit range, no Disarm - just KD, if one chooses to spam it.<br/>\n<br/>\nAnd the attack AB is going to go down fast with each swing - one is going to need some really good Kamas to compensate, or some scroll UMD for Divine Power (along with something to generate damage - kamas themselves don't do much, the str here is rather insignificant, so one is going to need some good kamas with extra damage like Flameweapon and/or Darkfire, as well as some other added damage to compensate here).<br/>\n<br/>\nThis build is like the Woody Woodpecker build...hehe.  Peck, peck, peck, peck.  Only it slashes.  Woody Woodslasher!<br/>\n<br/>\nIn other words, this build will be mostly relying on items to pep it up.<br/>\n<br/>\nOh, and this is supposed to be a Mage Killer.<br/>\n<br/>\nThis is the SR stuff :<br/>\n<blockquote><div>d20 + caster level + spell penetration  vs. SR<br/>\n<br/>\nFor a level 40 caster, the maximum possible roll is 66, meaning a spell resistance of 67 renders a creature immune to PC-cast spells that check spell resistance.</div></blockquote>\n<br/>\n<br/>\nSo we have 50 SR of this Mage Killer, vs a 40 level Caster with Epic Spell Penetration.  That is a minimum of 47 vs 50 (assuming a roll of 1 on d20).  This means that a roll of 4 or higher (iirc) will beat this SR.<br/>\n<br/>\nThose are not very good odds IMO! <br/>\n<br/>\nSo I would suggest more investment in Improved SR feats in Epic.  Each one is worth 2, so that is 2 more pips on the d20 needed by the Caster to beat it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:56 AM - Jan 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Web<br/>\n<br/>\nThanks for your thoughtful comments, particularly Web with your detailed thoughts. This is the first time I have attempted a build with improved spell resistance this high.<br/>\n<br/>\nZanithar has it correct, I am trying to preserve the BAB as much as possible so this guy has some threatening combat ability with non-mages too. <br/>\n<br/>\nThe assassin levels are taken epic to preserve the AB and add UMD to the build. The Assassin level is taken at 31 to obtain UMD 33 modified ASAP, which allows unrestricted spell casting from scrolls without failure in modules where this is enabled. I understand in WoG currently there is no spell failure from UMD so a lower UMD amount is more than adequate and that level can be taken earlier for faster uncanny dodge, but I've designed this in case it wants to be ported to other modules.<br/>\n<br/>\nI think any 8-10 attack per round build with some decent AB, crazy speed and a touch of UMD is going to threaten enemies. I also believe I have to go dex rather than strength with this build, otherwise the AC will be bad, but I'm happy to be corrected. <br/>\n<br/>\nI understand Monk is the only class which can obtain the improved spell resistance feat either as an epic feat or bonus feat.<br/>\n<br/>\nI have reset my goals for Base AB 38+, BAB 26+, ITWF Kama, WS/EWS, stealth/UMD/Tumble/Discipline/Listen and enough spell resistance (rather than the immunity achieved from SR 67+). <br/>\n<br/>\nI had an excess of feats pre-epic to use, so I chose the Resist Energy feats. They stack with damage reduction from items. <br/>\n<br/>\nSo a Resist Energy: Acid feat (5/-), combined with an amulet of acid resistance (20/-) will mean 25/- acid damage reduction. Or with a ring of elemental resistance (15/-) it means 20/- acid damage reduction. It reduces the amount those acid shields might do to you which is a way I have died playing those 10 APR builds as a monk, although a decent caster will do a decent amount of damage to you. Ideally you want to breach or Mord such defenses, but perhaps there might be a situation where I cannot do so. If I wanted to go hardcore I could take multiple Epic Energy Resistance: Acid feats instead but I wanted spell resistance instead. Such feats also work against spells such as darkfire and flame weapon (hence the Resist Energy: Fire feat), or added elemental damage from weapons. <br/>\n<br/>\nI'll edit the main post to improve SR to 56. That way the level 40 caster with epic spell penetration has to roll a 10 or more (45% chance of spell resistance). A level 40 caster without any spell penetration feats will need to roll a 16 or more (75% chance of spell resistance). A spell sword or UMD user cannot use any offensive targeting spells against this guy.<br/>\n<br/>\nI believe a level 40 caster with epic spell penetration deserves to get some spells off by the way, with the amount of investment in those feats and caster levels. It does make the modules created interesting to play against. <br/>\n<br/>\nOne further comment is that if I can get the SR close to 50/50 for bosses, then he can use UMD + greater spell mantles (on a sequencer if possible) + a potion of speed or even better a mass haste scroll and charge in at the speed of light at +100 monk speed, potentially stealthed/invisible, with TT or Divine Power active . <br/>\n<br/>\nEven if its 50/50 for the caster to get that Bigby's to penetrate, he then has to content with the spell mantle whilst he gets his mord scroll/spell breach scroll off then starts mowing into the mage with 10 APR / round. A spell like Epic Warding or Time Stop is going to be a problem which hopefully you can just run into the shadows with your crazy speed, go into stealth mode and wait it out a bit, then sneak up on those mage bastards again.<br/>\n<br/>\nThis is not an attractive opponent for a mage to face, although a good one certainly has a fighting chance to win.<br/>\n<br/>\nI am not sure what happens to the removal of the speed cap with monk speed if you use stealth mode, it would be interesting to know how that plays if you have mass haste or expeditious retreat active and how fast a +100 monk speed character would be moving. If anyone knows feel free to post up your experience with this.<br/>\n<br/>\nAnyway keen to know what your thoughts are again with this modification, appreciate your suggestions as always<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:05 AM - Jan 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I can answer that question.<br/>\n<br/>\nYour Monk moves, hidden and silently, faster than a Barbarian can run!<br/>\n<br/>\nIt's crazy good.<br/>\n<br/>\nI like that the SR is being bumped up.  It just makes more sense IMO.<br/>\n<br/>\nAssassin=Monk in BaB progression - so just swapping out Monk and Assassin pre-epic should make no difference.<br/>\n<br/>\nI understand now why you put the last Assassin level at 31 - and I agree with this for environments that have a high UMD check.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:13 AM - Jan 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"18172\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18172&amp;sid=9f99f0c45eb47d98539bd15b3a041605#p18172\">↑</a><div class=\"responsive-hide\">Jan 03, 2020</div></cite>[...]<br/>\nAssassin=Monk in BaB progression - so just swapping out Monk and Assassin pre-epic should make no difference.\n</div></blockquote>\nThanks for clarifying RE the monk speed.<br/>\n<br/>\nRE the BAB progression you are not quite correct Web. <br/>\n<br/>\nAssassin 1, 5, 9 etc and Monk 1, 5, 9 etc etc gain no BAB.<br/>\nOther levels in between gain BAB.<br/>\n<br/>\nZanithar is correct, if I only take two assassin levels and put one pre-epic, I will lose one BAB and one attack / round, from a Monk 15 [-4 BAB from Monk 1, 5, 9 and 13] / Assassin 1 [-1 BAB from Assassin 1] / Fighter 4 pre-epic level split.<br/>\n<br/>\nThis is from the guide to <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/maximising-ab-in-builds-a-guide-t2355202.html\" rel=\"noreferrer\" target=\"_blank\">maximising AB in builds</a> I wrote recently:<br/>\n<blockquote><div><strong>Maximising the The Base Attack Bonus (BAB)</strong><br/>\nThe Base Attack Bonus is determined by the base attack bonus of the classes in question, up and including to level 20 (also known as 'pre-epic'), then +1 BAB every odd level starting from level 21 up to level 40. So the only controllable factor is the BAB of the classes involved up to level 20. <br/>\n<br/>\nBAB is added to characters up to level 20 in the following way:<br/>\n<br/>\nFull BAB or combat classes (fighter, barbarian, paladin, ranger, blackguard, champion of torm, dwarven defender, weapon master, arcane archer, purple dragon knight) obtain 1 BAB / level pre-epic<br/>\n<br/>\n3/4 BAB classes or middle classes (rogue, monk, bard, cleric, druid, assassin, shadow dancer etc) obtain 1 BAB / level except the first level every four levels. This means BAB is not gained at level 1, 5, 9, 13 and 17, pre-epic, but gained at other levels.<br/>\n<br/>\nIe. the first level of a middle class taken pre-epic means 1 BAB is not gained, the next three levels of that middle class gains 1 BAB / level, then the next 1 level does not gain 1 BAB etc etc. <br/>\n<br/>\nThese rules only apply to individual classes. So a Rogue 2 / Monk 1 / Cleric 1 would have a BAB of 1 (not gaining 3 BAB with Rogue 1 Cleric 1 and Monk 1), whereas a Rogue 4 would have a BAB of 3 (not gaining 1BAB with Rogue 1). All things equal, this is a 10% chance to hit and crit between those two builds.<br/>\n<br/>\n1/2 BAB classes or non-combat classes (wizard, sorcerer, palemaster) gains 1 BAB every second level. So a Wizard 2 and a Wizard 3 both have a BAB of 1, as Wizard 1 and Wizard 3 do not gain BAB.<br/>\n<br/>\nThe pre-epic split, of the first 20 levels is the most important factor in determining BAB. <br/>\n<br/>\nIn general, maximising the amount of Full BAB classes pre-epic maximises the ultimate BAB and AB. However sometimes this is not always ideal. <br/>\n<br/>\nFor example, a player may want to make a Fighter / Bard / Red Dragon Disciple, but not want to take more than 6 levels of fighter and not more than 10 levels of Red Dragon Disciple (RDD). In addition, that player may want to access bonus feats granted by the fighter class which are only available in Epic levels, such as Epic Weapon Specialisation. <br/>\n<br/>\nTherefore to maximise BAB with a Fighter 6 / Bard 24 / RDD 10 build, the best BAB achievable is 26, which is achieved by:<br/>\n<br/>\n- taking Fighter 4 / Bard 12 / RDD 4 or Fighter 5 / Bard 11 / RDD 4 or Fighter 5 / Bard 12 / RDD 3 pre-epic (up to level 20) to obtain a pre-epic BAB of 16<br/>\n- other classes at other levels for +10 AB over 20 levels regardless of classes chosen, to get to 26.<br/>\n<br/>\nMaking a build where the pre-epic class split is Fighter 4 / Bard 6 / RDD 10 is tempting to access the enormous +8 strength bonuses of the class but the eventual pre-epic BAB will be 15 (not gaining BAB with Bard 1, 5 and RDD 1, 5 and 9), therefore losing AB long-term, and also the character doing one less attack per round permanently.<br/>\n<br/>\nIf I take another example, say a Fighter 24 / Bard 6 / RDD 10 build, to maximise BAB, one will want to take Fighter 20 pre-epic to obtain a pre-epic BAB of 20 and eventual level 40 BAB of 30. <br/>\n<br/>\nHowever for game play reasons that player may want a few Bard levels pre-epic for say, skill dumps into Tumble, Perform and Spellcraft and to use Bard Song for a party. In this case a Fighter 17 / Bard 3 split with total levels of 20 would obtain a pre-epic BAB of 19 and eventual level 40 BAB of 29 which is not far off a BAB of 30. Such sacrifices are legitimate, they preserve the character of the build in the first 20 levels, and lets face it, the first 20 levels is more than half the module in many cases (for example HoTU goes to level 28, and Aielund goes to 36-38).<br/>\n<br/>\nWhat would lead to the lowest AB however, is to try to take a Fighter 5 / Bard 5 / RDD 10 split pre-epic which would lead to a pre-epic BAB of 25 (by not gaining BAB with Bard 1, Bard 5, RDD 1, RDD 5 and RDD 9), and also losing one attack per round permanently.<br/>\n<br/>\nAs one can see changing the pre-epic split of a class can greatly alter the ultimate power of a build by up to 5 BAB in these examples which is essentially a 25% reduction in the chance to hit and crit as well as losing one attack per round. So understanding the mechanics how the pre-epic split works is important in maximising BAB and eventual AB for a level 20+ build.</div></blockquote>\nThe <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Base_attack_bonus\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki: Base Attack Bonus</a> might be helpful too for more details<br/>\n<br/>\nHope that explains things adequately<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:43 AM - Jan 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, looking at the conundrum in pre-epic kind of makes putting an Assassin level in there baseless.<br/>\n<br/>\nDrats!<br/>\n<br/>\nThanks for the insight.<br/>\n<br/>\nSo this has made my build better!  I have moved the Assassin levels into Epic levels (where the Bab issue does not exist) and improved the BaB pre-epic to 16!<br/>\n<br/>\nThank you for this insight and discussion, Orion and Co.!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:31 PM - Jan 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Might be worth mentioning, might not, but to be fair, Orion has called this the Mage <em>Hunter</em>, not the mage <em>killer</em>. So he'd be perfectly in-character to find one, then simply point and say, \"He's over there,\" to his buddies.<br/>\n<br/>\nJust saying...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:52 PM - Jan 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, but who is the Hunter, and who the Prey?<br/>\n<br/>\nHmmm?<br/>\n<br/>\nAnyway, I am interested in seeing how the playtesting is going with this build!<br/>\n<br/>\nWith mine, I ran into a stumbling block today.  I think UMD can get her out of it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "2:46 PM - Jan 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote:</cite>Yes, but who is the Hunter, and who the Prey?<br/>\n<br/>\nHmmm?<br/>\n<br/>\nAnyway, I am interested in seeing how the playtesting is going with this build!<br/>\n<br/>\nWith mine, I ran into a stumbling block today.  I think UMD can get her out of it.</div></blockquote>What was it?<br/>\n<br/>\nSent from my Pixel 3 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:15 PM - Jan 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Maskalene.<br/>\n<br/>\nHe's a beast!  <br/>\n<br/>\nWe fought to a standstill, my magic immune to his pummel immune...my regen to his regen.  I fought him for 5 hours RT before leaving...he was still alive.  I got him down to Badly Wounded many, many times, only to have him totally regen up in a couple of round as I was taking care of my own wounds.<br/>\n<br/>\nWith an AC of over 80, verse my AC of 73, it was a whiff-fest!  I think only a Bard type with both songs (and lingering song) might be able to actually hit him with anything other than a 20.<br/>\n<br/>\nI know his secret weakness now though...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:47 AM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Web<br/>\n<br/>\nGreat to hear Maskalene is a total monster and a challenge I will face later on the server, perhaps in a party to begin with :)<br/>\n<br/>\nMy playtesting is quite enjoyable. Early monk is really bad, it's only when one gets a bit more BAB for the extra attacks then some added damage from WS that the build starts to become quite powerful, I think that occurred for me when I got to Monk 2 / Fighter 4. Four attacks per round at level 6 is no joke, heh :) <br/>\n<br/>\nBefore then I think I just made use of the fighter level and equipped some armor and shields and a longsword or something. <br/>\n<br/>\nRight now he's level 16 (Monk 12/Fighter 4). I'm glad I made him dex based. Right now I'm not actually missing the extra damage I would have got from strength, probably because of Weapon Specialization, and some +3 kamas. The AC from dex is quite handy as well. <br/>\n<br/>\nStealth and monk speed is super fun at the level I'm at. I stealth into a mob, assassinate a mage quickly in the backlines in a few flurries with improved knockdown (3 attacks, 3 attacks, 2 attacks) at the moment) then charge out with +40 monk speed with a huge mob of angry meleers hot on my tail, pop around a corner, stealth, and these guys are scratching their heads wondering what happened. Any further mages left behind, the mob is spread out, and confused, searching for me, are more vulnerable. Can rinse and repeat. <br/>\n<br/>\nIf I was super smart I would also lay a whole bunch of electrical traps for the angry mob to run into when I escape to speed up the process.<br/>\n<br/>\nLater on when those mages are given true sight the stealth may not be quite as effective but I believe the +100 monk speed will always be effective :)<br/>\n<br/>\nThanks for helping me with this build Web, its much appreciated. Picked up a holy gem on WoG last night adventuring with a friend by the way. Happy days.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:48 AM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"18225\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18225&amp;sid=861a8ee230f894ae329cc73ec677a962#p18225\">↑</a><div class=\"responsive-hide\">Jan 05, 2020</div></cite>Might be worth mentioning, might not, but to be fair, Orion has called this the Mage <em>Hunter</em>, not the mage <em>killer</em>. So he'd be perfectly in-character to find one, then simply point and say, \"He's over there,\" to his buddies.<br/>\n<br/>\nJust saying...</div></blockquote>\nHehe that's called the 'Mage <em>Scout</em>' which is what most of us mere mortals do :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:36 AM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, because it is <em>soooo</em> hard to find the mage!<br/>\n<br/>\n\"you mean that one, over there, spitting spells at us like a cobra?  That one?  Are you sure?\"<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:54 AM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Touche, Web!<br/>\n<br/>\n\"Will you just stop charging in everywhere like a loon? Quiet, hide, blend in. No, idiot, red dragon armour isn't exactly 'blending in'. Stop it. Right, you go in because you're dispensable, you flank and do horrid things to him. and I'll be crying quietly in a corner. Got it? Good. Let's go.\"<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:40 AM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">*Barbarian charges in, raging, bashes WDK's big toe  making him roar out, and then proceeds to make frozen dinners out of said Barb*<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:04 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Quivering palm can be a good mage killer. (If you can land the hit). Challenges his weak <span style=\"text-decoration:line-through\">will</span> <em>fort</em> save. One hit also means minimal damage from damage shields.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:20 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It is worth a try, of course.<br/>\n<br/>\nOne only gets one shot!<br/>\n<br/>\nChoose it wisely...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:29 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've been using dev crit scimitar, haste, UMD for mind blank/improved invisibility/greater spell mantle then charge in. Improved Knockdown if possible.<br/>\n<br/>\nI wonder if one could add in monk speed and spell resistance too? Would that be kinda broken? Bit rough on the AC though with a STR monk?<br/>\n<br/>\nPalemasters could be immune to dev crit but then hopefully won't have enough caster levels to penetrate. Just a thought.<br/>\n<br/>\nAlso do you keep the spell resistance as a monk if you equip full plate and shield? Mind immunity as well?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:53 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I believe that what is lost when a monk wears armour and/or carries a shield is the monk speed, the Wis and level-based AC (and here that's a colossal -14 AC if you don full plate before adding on the plate's AC), and the UBAB progression. I don't think it disables anything else. But it's enough.<br/>\n<br/>\nStunning Fist can also be handy with mages, btw - stops them casting for 3 rounds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:02 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"18264\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18264&amp;sid=5a43a266831917c6dd4ca2b082e56506#p18264\">↑</a><div class=\"responsive-hide\">Jan 07, 2020</div></cite>It is worth a try, of course.<br/>\n<br/>\nOne only gets one shot!<br/>\n<br/>\nChoose it wisely...</div></blockquote>\nI have used it a from time to time when a group of enemies with a single mage spawn in, just to avoid the damage shields.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:33 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I normally blow the damage shield(s) off with a Wand of Lesser Breaching, or a scroll.<br/>\n<br/>\nUMD ftw!<br/>\n<br/>\nBut one does have QP, so...no reason not to try.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:44 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Stunning Fist can also be handy with mages, btw - stops them casting for 3 rounds.</div></blockquote>\n\nStunning Fist got nerfed by Beamdog. It now only lasts 1 round.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:55 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"18292\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18292&amp;sid=5a43a266831917c6dd4ca2b082e56506#p18292\">↑</a><div class=\"responsive-hide\">Jan 08, 2020</div></cite><blockquote><div>Stunning Fist can also be handy with mages, btw - stops them casting for 3 rounds.</div></blockquote>\n\nStunning Fist got nerfed by Beamdog. It now only lasts 1 round.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk</div></blockquote>\nWell that's just downright unfriendly. There were so many things Beamdog could have done to make life better, but instead it appears they've focused on \"fixing\" stuff that didn't need to be fixed. Lovely.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}