{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "205",
  "name": "Book of Mages.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/book-of-mages-t2354459.html",
  "author": "Valehand",
  "avatar": "10235276_1510287070.gif",
  "replies": 3,
  "posts": [
    {
      "author": "Valehand",
      "avatar": "no_avatar.png",
      "timestamp": "12:38 AM - Aug 16, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello all I a few months ago needed help with a paladin for Arelith a level 30 server, thank you for Valerfor and everyone for helping, it proved to have an excellent tale indeed (minus having to kill 10 out of 20 players because they accused me of being a heretic and began hunting me down, never will I go alone xD. They were the heretics ...I hope xD.) Now, I've run into a new interest. I wanted to try a mage character, a magic user, a wizard. Now, hear me out, it's not as easy for me to do this and that, and just dump into INT for the rest of the game. No, I'm at a pretty big stump. After countless trial and errors (20 or so.) I came to one conclusion soloing is not practical unless one uses this one thing to his advantage, Conjuration. Without the summon you cannot solo anything, even a group setting is almost pointless at low levels due to the influx of running out of spells. So, I've come for the experts help again, ...I literally cannot think beyond the first 3 levels. I wanted to make something good for not only PvE but PvP as well, even if it's just that support hitting guy in order to help kill the enemy, via barrage of magic missles which I got up to 12-16 dmg per missle once, but that's not a great achievement considering the counters. My other problem is whether or not if I should break into another class as well.<br/>\n Wizard/?/?<br/>\n Level 30<br/>\n Race: Human<br/>\n Weapon: (None but due to wanting to use spells it's probably a quarterstaff or something.)<br/>\n Level One: Conjuration<br/>\n Level Two: ??<br/>\n Level Three: Greater Spell Focus: Conjuration.<br/>\n<br/>\n Any help you guys are capable of offering?<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:37 AM - Aug 16, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I never play casters myself, but this sounds like a job for The Melee Mage:<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build301814.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 01814.html</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valehand",
      "avatar": "no_avatar.png",
      "timestamp": "5:37 PM - Aug 16, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>I never play casters myself, but this sounds like a job for The Melee Mage:<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build301814.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 01814.html</a></div></blockquote>\n<div align=\"left\">The build seems good, but it's kinda the opposite of what I'm attempting to do... I had two ideas in mind, but I think I figured out how to make this one on my own ^^, thank you. You seem like the melee type is their the possibility you could help me with it?</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:30 PM - Aug 16, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I don't play on PWs so my skill is not on par with those who do. My strategy is simply to make an overwhelmingly powerful build (which I do reasonably well), equip myself with the best equipment I can get my hands on, and charge into battle. It is only recently that I have even bothered to use Knockdown, which helps tremendously. My point is that I am not the best person to teach you how to melee in PvP.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}