{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "343",
  "name": "THE DWARVEN WALL - REVISED",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-dwarven-wall-revised-t2350205.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": 12,
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:43 PM - Feb 18, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Similar to Mick Dagger's  thread about the \"Kukri Master\" i decided to do a revision of the classic \" <strong>Dwarven Wall </strong>\".<br/>\n<br/>\nThis toon is very old school when Dev. Critical was everything and all tried to put it inside their builds with different combinations.<br/>\n<br/>\nIt is also one of the characters that  qualifies for the \"pure builds\" somehow as it takes all 30 levels of a prestige class, fortunately unlike many other prestige classes the Dwarven Defender<br/>\n<br/>\nactually takes some benefits from these last levels, unlikely say the Blackguard or the Weapon's Master where their benefits stop at 28th level for both.<br/>\n<br/>\nWhile this build lacks a full tumble class it has comparable AC due to Defensive Stance and the awesomeness of the Defensive Awareness provides it with a very solid defesnse.<br/>\n<br/>\nHere is a Classic old beater that has Massive HP's and Damage Reduction and the good old Dev. Critical all in one build. I tried to make him as best as i could while maintaining this old feel  <br/>\n<br/>\n<br/>\n<strong>THE DWARVEN WALL</strong><br/>\n<br/>\n<strong>(FTR 8/ COT 2/ DD 30)</strong><br/>\n<br/>\n RACE: Dwarf Only<br/>\n<br/>\n ALIGNMENT: Lawful Neutral<br/>\n<br/>\n PLAYABILITY: PvM 1-40<br/>\n<br/>\n STARTING STATS:<br/>\n STR  - 16<br/>\n DEX -  13<br/>\n CON - 18<br/>\n INT  - 13<br/>\n WIS - 08<br/>\n CHA - 06<br/>\n<br/>\n ENDING STATS:<br/>\n STR  -  26<br/>\n DEX  -  13<br/>\n CON  - 22<br/>\n INT   - 13<br/>\n WIS  - 08<br/>\n CHA  - 06<br/>\n<br/>\n<br/>\n Hit Points: 740 → 820 (D. Stance)<br/>\n<br/>\n<br/>\n Skill Points: 129<br/>\n<br/>\n Discipline: 43 (51)<br/>\n<br/>\n Heal: 6 (5)<br/>\n<br/>\n Tumble: 21 (22)<br/>\n<br/>\n Concentration: 43 (49)<br/>\n<br/>\n<br/>\n Saving Throws (Fort/Ref/Will): 33/ 20/ 20 → 35/ 22/ 22 (saves Vs spells) → 39/ 24/ 24 (D. Stance)<br/>\n<br/>\n Naked / Armored AC: 17/ 28/ 32  (Full Plate &amp; Tower Shield) → (D. Stance)<br/>\n<br/>\n<br/>\n BAB: 30<br/>\n<br/>\n AB: +42/ +37/ +32/ +37  (Warhammer)<br/>\n<br/>\n DMG: 1D8 +10 / 19-20 x3  (Warhammer)<br/>\n<br/>\n Devastating Critical  DC: 38 → 39 (D. Stance)<br/>\n<br/>\n Damage Reduction: <strong>30/ –</strong><br/>\n<br/>\n<br/>\nLEVELING GUIDE:<br/>\n<br/>\n01) FTR (01): Expertise, WF: Warhammer<br/>\n02) FTR (02): Power Attack<br/>\n03) FTR (03): Cleave<br/>\n04) FTR (04): WS: Warhammer<br/>\n05) FTR (05): <br/>\n06) FTR (06): Dodge, Toughness<br/>\n07) FTR (07): <br/>\n08) FTR (08): Blind Fight<br/>\n09) DD (01): KD<br/>\n10) DD (02): <br/>\n11) DD (03): <br/>\n12) DD (04): IKD<br/>\n13) DD (05): <br/>\n14) DD (06): <br/>\n15) DD (07):IC: Warhammer<br/>\n16) DD (08): <br/>\n17) DD (09): <br/>\n18) DD (10): Imp. Expertise<br/>\n19) CoT (01): <br/>\n20) CoT (02): Great Cleave<br/>\n(<strong>Strength 18 &amp; Constitution 21 at this point</strong>)<br/>\n21) DD (11): EDR I<br/>\n22) DD (12): <br/>\n23) DD (13): <br/>\n24) DD (14): EDR II, EDR III<br/>\n25) DD (15): <br/>\n26) DD (16): <br/>\n27) DD (17): Great Strength I<br/>\n28) DD (18): EWF: Warhammer<br/>\n29) DD (19): <br/>\n30) DD (20): Great Strength II<br/>\n31) DD (21): <br/>\n32) DD (22): Overwhelming Critical<br/>\n33) DD (23): Great Strength III<br/>\n34) DD (24): <br/>\n35) DD (25): <br/>\n36) DD (26): Devastating Critical, AS<br/>\n37) DD (27): <br/>\n38) DD (28): <br/>\n39) DD (29): Great Strength IV<br/>\n40) DD (30): Epic Prowess<br/>\n<br/>\n<br/>\n<strong>DEFENSIVE STANCE</strong>  15 uses/ Day grants  +2 to all saves &amp; 2 STR/ 4 CON/ 4 AC<br/>\n<br/>\n<strong>DEFENSIVE AWARENESS</strong>  Makes him <strong>Immune to Sneak Attacks</strong> while he is attacking something<br/>\n<br/>\n* Build Edited after Maximillian Kane &amp; Empyre's suggestions to better reflect both its defensive &amp; dwarven origins, various improvements to skill-set, weapon choices and feat order were made.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:26 AM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have a somewhat similar build of my own (Ftr 12 Rog 2 DD 26). I read a guide in the old guild by Thax, which sort of disagrees with the order you take your feats. The \"bread and butter\" of DD is the Damage Reduction. It's what makes him what he is. Anyway, the guide basically said that if you want to make use of the class to its best, you need to not only take EDR feats but take them as soon as possible. The CON investment means that you won't have a high DC to your DevCrit, so prioritizing it in this case I would say is not optimal. On the other hand, I play on WoG too and I know that there, it's most useful when taken early on. What I don't know is, does taking DC before the EDR feats come in this build as a WoG-biased choice or is it due to something else?<br/>\n<br/>\nI would change only the order you take the feats in epics and the stat point distribution to have EDR 3 ASAP. As for the rest, it looks good. The only feat I would probably change would be SF<img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />iscipline. I'd take Expertise in its place to save up Defensive Stance uses for more important battles. Other than that, I'd give him a Dwarven Waraxe for style points.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:33 PM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh yes, the power one can gain from taking 4 less DD levels is indeed splendid, i just could not do it for theme reasons.<br/>\n<br/>\nNice catch on the weapon choice but i wanted a bigger threat range as you can imagine while maintaining the big base damage of the Bastard, and since the original too had a sword..<br/>\n<br/>\nAs far as EDR goes the funny thing is that the original went as fast as he could for Dev. critical too but due to unoptimized stats he couldn't do it till the 36th level, so i think i managed quite well on that.<br/>\n<br/>\nGood point the expertise option Max, although what kept me from taking it was that it cancels out the defensive stance. Still a good option early on when your stances are few i suppose.<br/>\n<br/>\n<br/>\nThanks for the input man, all good points.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:23 PM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, Expertise does cancel Defensive Stance, but they aren't meant to be used simultaneously, they're meant to be used instead of one another. There's no such thing as too many DS uses, and Expertise allows you to go through mobs without wasting any in cases where you need AC but can afford the loss in AB, which we both know on WoG is VERY USEFUL. In that Diablo-themed mod you advertised, I reckon the same is true.<br/>\n<br/>\nAnyway, I'd still recommend going for EDR before DevCrit. 9 points of DR right from the start of epics will allow you to stand in front of your enemies for MUCH LONGER. If you equip a belt of Damage Resistance, you'll only be damaged on Crits. As Thax used to say, if you want to kill things fast, go for Weapon Master or RDD, Dwarven Defenders are good at tanking.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:27 PM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I made some extensive testing in no less than three seperate test modules i have for that purposes, with Tony's AI included of course.<br/>\n<br/>\nWhile the original version is a tad stronger offensively, the revised one is much more focused and better flavoured.<br/>\n<br/>\nI forfeit the spellcraft ranks for concentration since he doesn't have the mobility of other characters (he is a friggin wall heh) and i hate it when i loose 6 AC from taunting. Nobody Taunts a Dwarf!<br/>\n<br/>\nThe saves are good anyway and boosted further by that (in)famous Dwarven resilience.<br/>\n<br/>\nTook expertise instead of SF in Discipline and three lvls earlier too. Now he can be even more tanky all day long. Scrap that, now he has Improved Expertise!<br/>\n<br/>\nChanged weapon to a Battleaxe, don't know what i was thinking by this sacrilege with the Bastard sword..<br/>\n<br/>\nTook EDR feats first, he gains a massive ammount of damage reduction between levels 21st - 24th so he can tank even better, he has written the word \" barricade \" on his forehead.<br/>\n<br/>\nMake no mistake though, he still has 42 AB &amp; IKD &amp; Dev. Critical. He is no slouch.<br/>\n<br/>\nWhat, you want more? I should change the name to \"Dwarven Pantzer\" after all these..<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:48 PM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey dude, it's getting there!<br/>\n<br/>\nI would swap Improved Critical with KD. gaining a 5% chance of critting isn't as useful as knocking someone down (especially mages). Hell, you might even consider taking it even earlier and delay Cleave. The usefulness of Cleave depends on how often you expect / plan to be surrounded by 2 or more foes. If you are one that treads carefully (I'm not, just saying), then its usefulness is decreased. If you're a bit of a maniac such as yours truly, then you can keep it as is. Regardless, I think at least IC should be delayed for earlier KD.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:32 PM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just for comparison: The original <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/dwarven-wall-fighter-8-dwd-30-champion-of-torm-2-t515466.html\" rel=\"noreferrer\" target=\"_blank\">Dwarven Wall</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:58 PM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here's some sweeping changes that you might like or you might hate. Bastard sword was better for Dev Crit, or scimitar would be even better, but since you're sacrificing some threat range to better fit the dwarven theme, you might as well go for dwarven waraxe and drop Dev Crit for more strength.<br/>\n<br/>\nTo do this, take Weapon Proficiency Exotic and Weapon Focus: Dwarven Waraxe at level 1, Expertise at level 18, and Improve Expertise instead of Great Cleave at level 20. Then take Epic Weapon Focus at level 21, and use the DD feats at levels 24, 28, and 32 for EDR, which should allow you to get 6 Great Strength feats.<br/>\n<br/>\nI also would swap Blind Fight with Improved Crit.<br/>\n<br/>\nI was thinking \"Is there any way to get Expertise earlier?\" and realized that yes there is: Take your 8th level of Fighter at level 8 instead of level 18.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:26 AM - Feb 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great Cleave is a requirement for Devcrit and so can't be dropped, are you suggesting he foregoes Devcrit altogether?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:03 AM - Feb 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong>since you're sacrificing some threat range to better fit the dwarven theme, you might as well go for dwarven waraxe <strong>and drop Dev Crit</strong> for more strength.</div></blockquote>Emphasis added.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:06 PM - Feb 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sorry, I missed that.<br/>\n<br/>\nI guess I see why DevCrit isn't as desirable in this build given the low STR score. I would say dropping it wouldn't be that bad, but it's also nice to have it against low-fortitude types like Wizards. I guess it's not that bad. Good enough to be listed as a tweak at least.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:33 PM - Feb 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good suggestions from both of you.<br/>\n<br/>\n<br/>\nI edited the build one last time to reflect upon those improvements, taking the 8th FTR level before i start the DD and thus moving way earlier both the blind fight &amp; (improved) knockdown feats.<br/>\n<br/>\nI also changed the weapon to Warhammer since it's damage and crit. range are similar to Battleaxe but bludgeoning type is the least resisted among all three. By the level you get the Dev. Critical you will have a keen Warhammer<br/>\n<br/>\n anyway be it single player module or in a Persistant World.<br/>\n<br/>\n<br/>\nAbout Dev. Critical, the DC is perfectly fine and you will see many one-hit KO's by it. A level forty warrior type with 22 CON in a server (or module) without arbitrary set attributes will have a modified 28 fort save. <br/>\n<br/>\nHe will still fail his save at least half the times against the Dwarven Wall. And STR is a primary attribute to raise for the Dwarven Wall so the gap will be even wider than this example.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:23 AM - Feb 21, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good work, this is definitely a great improvement!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}