{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "582",
  "name": "Sword of the Dracolich (Sorcerer 20 / RDD 10 / PM 10)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/sword-of-the-dracolich-sorcerer-20-rdd-10-pm-10-t2355484.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 13,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:22 PM - May 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong><span style=\"font-size:150%;line-height:normal\">Sword of the Dracolich</span></strong><br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202005/10759084_35237a8f25588d504568ed3988bdf4a0_t.jpg\" />\n</dl>\n</span><br/>\n<span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://i.pinimg.com/originals/ca/1f/76/ca1f763aab51b067dd5637376c8825fc.jpg\" rel=\"noreferrer\" target=\"_blank\">https://i.pinimg.com/originals/ca/1f/76 ... 8825fc.jpg</a></span><br/>\n<br/>\nThis is an interesting, complex and rich build draft that I wanted to share.<br/>\n<br/>\nI have been trying to add to Grizzled_Dwarflord's excellent damage shield / palemaster builds (Mestil's Pale Emissary and Mestil's Half-Dead Juggernaut) for some time. <br/>\n<br/>\nIn this build draft I use sorcerer instead of wizard to access RDD to boost strength and AB and create a greatsword wielding sorcerer / palemaster build with a very useful melee attack (Str 38 capped at 50, mundane AB 40, damage 2d6 + 21-&gt;30 capped) as well as CL 20 sorcerer 9 spells, 0-1-2 casting and craft wand. I envisage this character to wear robes, cast (extended) damage shields and unload pain with a greatsword buffed with flame weapon, keen edge and GMW +5 and 50 strength. In summary, a crit/sneak immune 38-&gt;50 STR CL 20 spellsword with effective damage shields.<br/>\n<br/>\nFor those who are not familiar, damage shield spells (Mestil's Acid Sheath, Elemental Shield, Death Armor) deal damage each time an enemy hits the character. The damage output from the shields is actually outrageously higher against melee mobs than the build's greatsword hitting with 50 strength, keen edge/flame weapon, and higher than spamming empowered IGMS whilst hasted (average damage 420 / round - 7 x 20 x 1.5 x two casts / round). The damage shield damage output is in fact as outrageously high as anything else in the game I can think of. This is counterbalanced by the fact one will be taking damage each time you are hit and is only effective against melee opponents.<br/>\n<br/>\n<details><summary>Spoiler</summary>CL20 Mestil's Acid Sheath acid 1d6 + 40 / hit , \nDeath Armor tickles em with magical 1d4+5. \nAdd them together and this is 68 to 81 damage / hit received by an enemy. \n\nThen multiply that again by the number of opponents you are facing. \n\n- 4 warriors with 4 attacks / round hitting you -&gt; 1088 to 1296 damage per round. \n- Drink a potion / round, add approximately 400 damage / round\n\n\nThis does approximately assuming each attack hits and sneak damage is applied each hit:</details>\n<br/>\nAs a result crit/sneak immunity is essential against decent opponents and I put PM 10 in this build as a result. Furthermore, additional protections against melee damage are desirable and include spells (ghostly visage, stoneskin/greater stoneskin/premonition, shadow shield), items (ie greater swordsman's belt/greater archer's belts). <br/>\n<br/>\nLow AC and no concealment is the intended modus operandi. However AC / Concealment (ie from improved invisibility) is not completely useless, as they can used to either increase or decrease the damage received at the expense of your damage output (which is already extreme). The usefulness of this is that it allows one to adjust the 'setting' of the damage shields, because one can have such low AC and defenses that one dies before one can heal enough, especially if PM 10 crit/sneak immunity is not yet obtained or only low level healing potions are available. <br/>\n<br/>\nDamage shields are not effective against archers or casters, or enemies immune to acid/fire. The low AC will in fact make one less effective against them. For these opponents, a greatsword with outrageous RDD strength, up to 50, plus Sorc 9 spells (ie summons, greater sanctuary, metamagic for 0-1-2 IGMS/Bigby's 6) and Sorc 1-4 wands (ie. ILMS/Evards etc) is the intended strategy, plus switching to a higher AC strategy boosted by RDD 10's and PM 10's +4 and +6 AC, and 50% concealment from improved invisibility if one can implement this in time. Knockdown is also in the build to deal with spellcasters if one wishes to save on spells, and blind fight to help hit through concealment.<br/>\n<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202005/10759084_11d22d07b71034b36422aabaecf6190c.jpg\" />\n</dl>\n</span><br/>\n<span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://cache.desktopnexus.com/thumbseg/35/35801-bigthumbnail.jpg\" rel=\"noreferrer\" target=\"_blank\">https://cache.desktopnexus.com/thumbseg ... mbnail.jpg</a></span><br/>\n<br/>\nCL 20 sounds worrying but damage shields do not have to worry about spell penetration and are essentially removed by breaches/Mord's regardless of caster level. Undispellability for the shields seemed nice against druids, bards and clerics but enough caster levels to ensure they last long enough seemed far more important. Regarding other offensive spells, spell penetration with AOE Mords in the build is much kinder, because Mords can lower SR by 10, for effective SP of 30+1d20 against Mord'ed opponents. Max toolset is 32 so 5% failure - rolling a 1 for spell pen- against max toolset SR against a Mord'ed opponent. <br/>\n<br/>\n<details><summary>Spoiler</summary>Sorcerer(20), Red Dragon Disciple(10), Pale Master(10), Human\nAny non-good (neutral for smite / alignment spell immunity)\nNot intended for PvP\nSTR: 16 (38)\nCON: 16 (18)\nINT: 8 (10)\n\n01: Sorcerer(1): Weapon Proficiency Martial, Blind Fight\n03: Sorcerer(3): Weapon Focus: Greatsword\n05: Sorcerer(5)\n07: Sorcerer(7)\n09: Sorcerer(9): Craft Wand\n11: Red Dragon Disciple(1)\n13: Red Dragon Disciple(3)\n15: Red Dragon Disciple(5): Empower Spell\n17: Red Dragon Disciple(7): (CON=18)\n19: Pale Master(1)\n21: Red Dragon Disciple(9): Epic Weapon Focus: Greatsword, (INT=10)\n23: Pale Master(3)\n25: Pale Master(5)\n27: Pale Master(7): Great Strength I, (STR=31)\n29: Pale Master(9)\n31: Sorcerer(11)\n33: Sorcerer(13): Great Strength III, (STR=35)\n35: Sorcerer(15)\n37: Sorcerer(17)\n39: Sorcerer(19): Great Strength IV, (STR=37)\n\nSkillpoints: 105\nSaving Throw bonuses: Spells: +6\nAB (max, naked): 40 (melee), 22 (ranged)\nSpell Casting: Sorcerer(9)\n\n\n\n01: Concentration(2), Lore(4), Open Lock(1), \n03: Concentration(1), Lore(1), \n05: Concentration(1), Lore(1), \n07: Concentration(1), Save(2), \n09: Save(6), \n11: Discipline(2), Search(8), \n13: Discipline(2), \n15: Discipline(2), \n17: Discipline(2), \n19: Save(2), \n21: Discipline(6), \n23: Save(3), \n25: Save(4), \n27: Spellcraft(5), \n29: Concentration(3), \n31: Concentration(3), \n33: Spellcraft(5), \n35: Concentration(1), Save(2), \n37: Concentration(3), \n39: Concentration(1), Save(2), </details>\n\nI wanted enough HP in the build from level 1, it being a damage shield build and all. I dump Int to boost Cons, but there is enough for two useful skills, concentration, spellcraft (implosions I worry about) and a little search and lore for RDD requirements. With low AC and no discipline a knockdown immunity item will be essential. Perhaps in an environment without such knockdown immune items, 25 ranks of discipline could be put into the build by level 22 (taken out of spellcraft, concentration and search) which combined with the RDD strength might be enough. Or even taking that RDD 10 level a bit later in the build to dump discipline even further, but I am a bit wary of making this build mature too late, by which time many modules will be over.<br/>\n<br/>\nThere are elements in this Sorc/RDD/PM build which remind me of Valerfor's Andariel - Maiden of Anguish Bard/RDD/PM build, with high RDD str combined with 3 APR. In comparison it exchanges some combat prowess, skills including UMD and EMA/EW for sorc 9 spells, metamagic feats, craft wand and damage shields. <br/>\n<br/>\nThere aren't any similar builds in the archives or guild filter search, there are two builds which use Sorc / RDD / PM but have different class splits and intentions and are not really similar to this build:<br/>\n<details><summary>Spoiler</summary>Sorc 3 / PM 27 / RDD 10 sorcerer 3 / pale master 27 / red dragon disciple 10 (half-orc?) by Aerdoan -&gt; this is more a pale master build. in my mind I am confused as to why sorc rather than bard which would provide better AB, better HP, better skill dumps, more skill points.</details>\n\nOverall I think this is a very fun, complex, and rich approach to a sorcerer spellsword which I have started playtesting and already made adjustments. I hope I wrote this in an understandable way. It took me a little time to understand GDL's original Mestil's Pale Emissary and Half-Dead Juggernaut damage shield strategies, but once I understood its power, I very much wanted to see if I could incorporate it into other builds with additional features as well, in a way it looks to me this build draft blends together concepts from both GDL's Mestil builds with Valerfor's Andariel in a very nice way. I have playtested this to level 8 in a challenging low-mid magic environment and it is doing fine so far and am looking forward to sharing more information when this gets to epic levels. <br/>\n<br/>\n<strong>Edit (1/6/20): </strong>Added discipline to the skill schedule, thanks Ten Pura!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "8:11 AM - Jun 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hail Orion!<br/>\nI like this build. I see that you're delaying RDD progression until you get Mestil's, but wondering about the 2 PM levels in pre-epic. You trade +1 Fort, +1 Reflex and 2 skill points for +2 Will. I don't see a discipline dump or similar. I'm sure it's something I'm not seeing.<br/>\n<br/>\nStill, this looks fun! A hit-me mage with 40 unbuffed AB? Nice!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:59 AM - Jun 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Ten Pura <br/>\nThanks for commenting and your interest!<br/>\nThe 2 PM levels in pre-epic were to boost the Fort save and Will save up <br/>\nIn the CBC it says its fort and will increased by two and reflex is lower with those two levels, it seemed like a good deal, a free great fortitude and iron will feat in exchange for a little delayed RDD 10 goodness! But as one knows I was taught the CBC is not perfect, I'll see what the actual result is when I get there given you got different numbers, PM has fort and will as primary saves, and the first two levels always seem to give the best bonuses to the primary saves so it seemed to make sense at the time.<br/>\nBecause PMs tend not to be particularly mobile I thought getting that fort save up was pretty important in case one gets hit by an implosion and I've had times when mind affecting spells have bothered me often the buffs etc on my PMs get dispelled. Reflex I thought one could just wear having a low reflex to fit everything in, there is a pixie who can help disable traps at least and spellcraft to help boost saves against spells. <br/>\n<br/>\nGood thoughts regarding discipline. It may be worth dropping ranks in spellcraft, search and concentration a little a little and put points in discipline with all that strength, even with knockdown immunity, it will help protect against getting disarmed and archer's called shots, also some enemies have custom abilities which force discipline rolls. <br/>\nHope you don't mind me doing a little math in this post. 105 skill points -&gt; Discipline 25(39) Lore 8(8) = 72 skill points left, so maybe Concentration 32(36) Spellcraft 30(30) Search 8(8) Open Lock 1(0) might be a better skill breakdown. I'll make some adjustments to the skill schedule.<br/>\n<br/>\nOh yes and I am super excited. A crit/sneak immune 50 strength greatsword sorcerer running at PvM melee mobs with all the damage shields, then switching to Bigby's 6 for those darn spell casters, spamming darkness / ultravision against those darn archers, and IGMS 0-1-2 against those darn physical immunes... can make a bunch of wands too... if one gets dispelled one can rebuff...<br/>\nDefinitely not for PvP, any UMD user could just breach the shields, but in PvM seems like very fun.<br/>\n<br/>\nOnce again appreciate your comments, I think they have improved the build for sure, hope everyone is staying safe.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "5:44 PM - Jun 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hail Orion!<br/>\nI've taken another look at the saves and see that I was shorting the 2 PM levels of +3 Fort, which makes the trade +1 Reflex and 2 skill points for +2 Will and +2 Fort.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:56 PM - Jun 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Ten Pura, thanks for checking!<br/>\nI'll keep the 2 PM levels pre-epic and see how the numbers look when I hit lvl 20! <br/>\nThanks again.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "11:35 AM - Jun 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi. I like this build. I have a similar build but Bladeweaver on BSK (F/Sorc/RDD) which gives magic damage, but doesn't have the PM immunities/AC. Still, I find this build very interesting. A few details I wonder about:<br/>\nFirst, I would probably drop 2 STR for INT and thus get a lot of useful skill points. But, that's more of a personal preference.<br/>\nSecond, why spend a feat on silent spell? I would rather use it on imp crit or something? What am I missing? I'm sure you have a good reason, I just can't see it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:04 PM - Jun 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey there Cornflower! Glad to see you active again and to hear of your own experience with Bladeweaver!<br/>\n<br/>\nMore skill points are certainly of value, I wanted the AB 40 just as a benchmark, also damage increases for two handed weapons are best with even strength attribute modifiers (ie 26-30-34-38-42)<br/>\nA detection skill would be nice but for some reason I can manage without it for now I have got this guy to level 23 so far but whether that is optimal I am unsure. <br/>\nI could drop epic prowess and drop str by 1 add a great strength feat in epics and increase Int by 2 for +43 skill points to squeeze it in. <br/>\nPM gets listen as a class skill, and RDD spot as a class skill. There seems to be plenty of AB.<br/>\nThe low Int conversational stuff with your familiar is kind of amusing (\"Me thinks you do boo boos\" or something like that) until one gets RDD 9 and one gets +2 int but I can live without that<br/>\n<br/>\nSilent spell is there for metamagic for some extra IGMSs for the Ext Haste - Time Stop - IGMS - IGMS combo. <br/>\nIt is a little feat starved, so I compromised Maximize Spell assuming I might need to use Mord's more often to lower spell resistance. <br/>\nIf you don't need craft wand then that could be swapped for Maximize.<br/>\nImproved Critical would be interesting but I thought the build would get more value from a metamagic feat<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:12 PM - Jun 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A damage shield build with AB 40 and AC 20, suffering a caster level of 20.<br/>\nWhat if my own Spellsword of Bahamut casts Greater dispelling (or Mords) at it, following up with Bigby 6  and  closing in for melee...<br/>\nThen what?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:57 AM - Jun 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Mick!<br/>\nI love your competitive spirit!<br/>\n<br/>\nMords/Bigby 6 is a problem for anyone and bigby 6 a problem for anyone without knockdown immune boots.<br/>\nBigby 6 is one of the most powerful PvP spells in the game as i think AC or concealment doesn't matter, there will always be a strength check if spell penetration is sufficient. Interestingly the 38-50 strength provides some resistance to the strength check if KI is not available but I wouldn't risk it.<br/>\nI think the build is more worried about Bigby 7, a grapple check will seriously trouble this build with the low ac. <br/>\n<br/>\nGreater sanctuary can be a good get out of jail card. I find it the best counter to Time Stop Mord IGMS spam mages with true seeing use in PvM at the start of fights, but one will need to be prepared beforehand. <br/>\n<br/>\nThe build can also cast these spells of its own, but I think neither this build or your spellsword will be able to compete with a dedicated caster of course in PvP I suspect it turns into a competition as to who gets the time stop off first.<br/>\n<br/>\nPvP is a different world to PvM. This build will probably do better than Spellsword of Bahamut against PvM melee mobs in fact I have been scything through them with the shields, having watched GDL do the same with his Mestils Half Dead Juggernaut on WoG, I just get to also whack casters and archers with a big greatsword and RDD strength and it is very satisfying. Caster levels are good enough I find, getting extended mestils earlier than 23 would have been nice but would have cost AB.<br/>\n<br/>\nIt might even do better against hard to hit big crit dealing scythe wielders (ie. 150-200 damage), with the shields although the epic warding in Bahamut will help. There are a few ultra high level bosses on WoG I had in mind when I made this, namely WDK and AoO I was planning to solo, I probably won't finalise this build until I get the privilege of that experience and I better share some shots of it when I get there!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "4:18 AM - Jun 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good!<br/>\nMy concern is still the low AC and the almost, but not quite pedestrian caster level.<br/>\nI once made a build,  the Trancending Knight, that suffered dispellability and mediocre AB, but it had BAB 16 and full attack shedule. And it led me to build the Spellsword of Bahamut.<br/>\nI try to point at a weakness in your build here Orion.<br/>\nThat being said: Spellswords  are not easy.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:32 AM - Jun 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh I love the challenge Mick. <br/>\nSpellsword are about balance.<br/>\nIf one can balance a spellsword well, in my mind, they have demonstrated a degree of mastery in building. <br/>\nCompromises simply have to be made, even undispellability has to be quite late epics in most cases. <br/>\nPutting 20 levels of a non caster class very seriously pushes the limits! <br/>\nHere I think I have made something that could work well within those limitations.<br/>\n<br/>\nIf I can relieve you a little of your concern, RE the low AC and caster levels, the playstyle evolves over time.<br/>\nIt starts as a low AC high strength high Con sorc. Pretty standard, powerful and easy to play can carry a mountain of loot. <br/>\nCan even save spells by using a summon, flanking and smacking em with a greatsword, throwing out a taunt or two even. <br/>\nWith ghostly visage/death armor one can tank and annihilate little melee mobs easily but not the bigger mobs yet or one will die.<br/>\nOne starts taking on bigger mobs with elemental shield / stoneskin and finally Mestil's. <br/>\nRDD gets introduced and that greatsword does quite a bit of damage as well, it gets 3 APR<br/>\nThe caster levels then don't progress as much but with RDD 10 then PM 10 plus the shields (which spell penetration doesn't matter) one is a handful for melee mobs, plus scrolls and sequencers can be used for shadow shield and premonition. <br/>\nThe power continues to grow until 40. <br/>\nI expect the best part will be when PM 10 is obtained, crits do hurt until then, and one has to adjust to a higher AC and concealment strategy until then against big critters and sneakers. <br/>\nThen with crit sneak immunity it becomes smooth sailing, damage shields to annihilate for all enemies melee mobs, similar to shapechange iron golem with the shields, but with a huge rdd boosted greatsword and spellcasting. <br/>\nThere is funnily enough, +10 AC from RDD and PM combined, which helps a little with reaching PM 10 but getting there I think is the challenge, but not too dissimilar to a dragon shape druid build who gets that feat lvl 28-36, PM 10 is obtained at 30. Eventually time stop Mord and emp IGMS, to top it off.<br/>\n<br/>\nThey can greater dispel me sure with a ?20% chance (havent done the math) but i can still smack em a good one, or recast shields etc and even if I got CL24+ as a spellsword Mords will always make me suffer. Against dispellers one goes light with buffs at the start, spam out a few grease spells to make enemies blow dispels on em, and save the big stuff mid battle when the dispels have all been used. Its a challenge and a fun challenge, it makes one think for sure! the closest to an andariel type (RDD/PM) spellsword I could make and it's a fun puzzle, a fun building challenge and play style challenge too, and very different from much of what is out there!<br/>\n<br/>\nAnyway just thinking about this makes me want to playtest this build a bit more. How exciting!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "1:02 PM - Jul 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Orion, there used to be two builds similar to this... Think it was Grimnir that made em…   had a great two part story to go with it.<br/>\nWere two of my favorite spellswords for awhile...  Cant get a link to it at the moment (at work), but if I find it I'll post it later...<br/>\nwas a Sorc 20/10 RDD/10 CoT   and a Sorc 20/PM 10/ CoT 10  pair of builds if I recall correctly...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:50 PM - Jul 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>conlaoch wrote: <a data-post-id=\"21107\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21107&amp;sid=68073cb944e247bd38b564da7bc14c84#p21107\">↑</a><div class=\"responsive-hide\">Jul 02, 2020</div></cite>Orion, there used to be two builds similar to this... Think it was Grimnir that made em…   had a great two part story to go with it.<br/>\nWere two of my favorite spellswords for awhile...  Cant get a link to it at the moment (at work), but if I find it I'll post it later...<br/>\nwas a Sorc 20/10 RDD/10 CoT   and a Sorc 20/PM 10/ CoT 10  pair of builds if I recall correctly...</div></blockquote>\nWould they be the <a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build227074.html\" rel=\"noreferrer\" target=\"_blank\">Deathknight of Torm</a> (the PM build) and <a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build227075.html\" rel=\"noreferrer\" target=\"_blank\">Torms Golden Girl</a> ? And you're right, both are Grimnir's.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "12:56 PM - Jul 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Those are the ones....  well worth looking if only for the story...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}