{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "534",
  "name": "Need dissection of reciprocal damage build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/need-dissection-of-reciprocal-damage-build-t515332.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:53 AM - Jul 19, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I am currently attempting to build a character based on damage shields.<br/>\n<br/>\nThe first one I've made is a 26Wiz/10PM/4Barb gnome with maxed Discipline and Skill Focus: Discipline (perhaps Epic SF as well).<br/>\n<br/>\nThe testing has shown that the gnome never gets KD'd unless confronting the larger race sizes like dragons.  It makes perfect sense that the size advantage, especially if empowered with IKD, would be a problem to win the Disc check.  My gnome occasionally gets KD'd by those guys but, TBH, it doesn't really seem to matter.  The foes can kill themselves just as easy against the shields while my PC is prone as while it remains standing.  The only issue would occur if this gnome would get KD-spammed by several flanking attackers and basically \"KD-locked\" where the HPs would start to drain away faster than the kills would occur.  I haven't experienced this yet although have killed about 6 flankers easily while just standing inert without casting.  What is such a huge advantage in that situation is that the reciprocal damage acts like AoE damage since each flanker is taking damage in the same round. Of course, crits are not a consideration. <br/>\n<br/>\nSo the two immediate questions are:<br/>\n<br/>\nWould it be more beneficial to opt for a larger class, like human, to better avoid the KD yet give up some Con (I am currently sporting a 950 maxed buff HP level with the gnome build) and gain another point in Disc skill? <br/>\n<br/>\nor<br/>\n<br/>\nMight it be better to just ignore the Discipline skill completely (making room for another feat or 2 like Spell Focus) and allow unlimited KDs in the hopes that, should the HPs drop too low, my PC will eventually \"revive\" to emergency heal?<br/>\n<br/>\nThe build seems very effective even with the KD eventuality but perhaps I am missing something very basic.<br/>\n<br/>\nComments?<br/>\n<br/>\nP.S.  I've found several similar reciprocal damage builds on the ECB but none with Barb which I selected to use Rage to get the Con to the level I have reached, a bump to Str (re: +1Disc), the extra HPs from 4 barb levels and the -2AC to help to get hit more often.  None of the examined builds seem to boost Con as high as this one (Con=32) but have a combat methodology akin to my own.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "1:56 PM - Jul 20, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A few considerations:<br/>\n<ol style=\"list-style-type:decimal\">\n<li>availability of KD immunity would obviously remove the KD issue; KD immunity in my experience is often available in one form or another<br/>\n[/*:m]</li>\n<li>being prone means you are easier to hit: lost dex and dodge AC if any, +4 AB for melee attackers. That is a desirable effect for a build focusing on reciprocal damage; of course BW's implementation of prone also brings disadvantages which are not there in PnP (inability to perform any action)<br/>\n[/*:m]</li>\n<li>gnome means +1 AC because of small size. Dwarf would still net you a bonus to Con without raising your AC, but it nets an XP penalty with your class combo. If you were to go Wiz 26/FTR 4/PM 10 the XP penalty would be gone, you would get +3 feats (to be spent on EDR I-III eg) and you would get rid of the size malus vs KD.<br/>\n[/*:m]</li>\n<li>barbarian grants you UD which is not generally desirable for a reciprocal damage build since it protects AC (assuming a positive dex modifier, of course)<br/>\n[/*:m]</li>\n<li>there is the possibility that a KD lock will result in your character being killed despite the reciprocal damage shields firing off more often because you ar eeasier to hit (dispellable btw) since you will anyhow lose HPs and cannot heal, so having a certain degree of protection from it is not a bad idea. Medium size race + maxed out discipline + ESF discipline even in a non STR build will definitely help. It also helps, evidently, having DR: spells, EDR I-III, EW are all your friends. Possibly even EER since often times enemies have a degree of elemental damage. The PM levels already take care of crits, so you are generallly not looking toward big HPs hits and your huge pool of health should grant you enough time to get rid of your enemies[/*:m]</li></ol>[/list]<br/>\n<br/>\nIn conclusion, personally, I'd get discipline and ESF: Discipline with a Dwarf, either taking the XP penalty or going FTR 4 unless KD immunity is easily available, of course. I tend to favor defense, hence the conservative choice. Choosing to forego discipline is a possibility anyhow, to be evaluated according to environment and personal preference.<br/>\n<br/>\nI guess you are familiar with Dwarflord's <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build252820.html\" rel=\"noreferrer\" target=\"_blank\">Mestil's Pale Emissary: Wizard 26 / Fighter 4 / Pale Master 10</a>, which is a different builds from your but still a nice reference build for anyone.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:42 PM - Jul 20, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>KailPendragon wrote:</strong><br/>\n -- clip --<br/>\nIn conclusion, personally, I'd get discipline and ESF: Discipline with a Dwarf, either taking the XP penalty or going FTR 4 unless KD immunity is easily available, of course. I tend to favor defense, hence the conservative choice. Choosing to forego discipline is a possibility anyhow, to be evaluated according to environment and personal preference.<br/>\n<br/>\nI guess you are familiar with Dwarflord's <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build252820.html\" rel=\"noreferrer\" target=\"_blank\">Mestil's Pale Emissary: Wizard 26 / Fighter 4 / Pale Master 10</a>, which is a different builds from your but still a nice reference build for anyone.</div></blockquote>\nI think you nailed it in one go there, Kail.<br/>\n<br/>\nI had steered away from dwarf because those builds were based around DwD which really didn't seem optimal for a reciprocal set-up, better for a wall.  But it would indeed solve the size &amp; Str/Discipline issue while attempting to win those KD checks.  BTW, I completely missed that build you referenced figuring it was another wall variant so mucho gracias for that link.  It will be my next stop.  Fighter will open up another feat or 2 that will come in handy, as well.<br/>\n<br/>\nTBH, the primary reason I chose barb for tertiary was due to the rage allowing me to cap the Con boost with a mundane config while lowering the AC to compensate some for the size.  But since the AC is so pitiful, even hasted, it turns out not to be a critical issue.  I am almost always hit.  UD really has no noticeable effect because there isn't enough Dex to matter.  My Dex buffs are primarily to boost reflex saves for applicable spells.<br/>\n<br/>\nMy chief hurdle has been KD specialists with serious casting ability, i.e. Ancient Dragons.  IIRC that dragon breath is unlimited, so after getting KD'd the blokes just stand there with their foot on my throat belching their noxious fumes on my poor, decrepit gnome form.  Oh, and BTW, a rule of which you are probably fully aware, I never forget to cast some anti-fear protection anymore whiles slapping them with a rolled up newspaper *lol*<br/>\n<br/>\nWell, I am off to reconfigure a bigger and better sacrificial lamb now, thanks to your indulgence.<br/>\n<br/>\nGratz, amigo!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}