{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "127",
  "name": "Sunburst versus Mass Blindness/Deafness",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/sunburst-versus-mass-blindness-deafness-t2355512.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:31 AM - Jul 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Both are level 8 spells, both lots of blind enemies. Sunburst will blind non undead too according to the wiki.<br/>\n<br/>\nHowever sunburst has a huge number of additional advantages - party friendly, colossal area of effect (10m radius vs 3.3m radius for mass blindness/deafness), damage against undead, some damage against non undead, chance to kill vampires, permanent duration blindness.<br/>\n<br/>\nThe only positive for Mass Blindness only seems the fortitude save rather than reflex save, meaning it is more effective against evasion users who require to fail two reflex saves to have blindness (evasion - sunburst doesn't hit and no chance of blindness). However I am unsure if this is necessarily a positive as there are plenty of enemies ie warriors, clerics and mages who have low reflex saves to use sunburst against, fort is a strong save for warriors and divine casters, perhaps only a situational advantage.<br/>\n<br/>\nOverall it looks like sunburst is a way better spell, curious that it isn't discussed as much as firebrand even. If they can't see you they can't hit you with spells or arrows, or move to your location to melee attack you <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nOf course this pales in comparison to the overpowered cleric Word of Faith spell which is a party friendly colossal radius spell which will blind anyone without a save, as long as spell penetration is sufficient. I think lets not go there.<br/>\n<br/>\nAnyone got any experience with sunburst and non undead and finding it useful? It seems like a very powerful spell on par with the big stuff like Wail, Wilting and firebrand.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:19 PM - Jul 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'd take sunburst over mb/d every time. Sunburst is a great spell against undead. It is a DC spell with a reflex save. It does far more damage than eg. firebrand. <br/>\nEven with a sorcerer and limited spell selection, sunburst is on my spell lvl 8 list together with horrid wilting and greater sanctuary. Early on premonition is on that list too, but it soon becomes obsolete when +5 weapons start to pop up. Bigby 8 can be replaced by both B7 and B9. Mind blank can be substituted by lesser mind blank, clarity and protection from alignment.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:31 PM - Jul 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Would this be an example, Mick?<br/>\n<br/>\n[url=<a class=\"postlink\" href=\"http://Here\" rel=\"noreferrer\" target=\"_blank\">http://Here</a> is something to look forward to. Quite the opposite of a hilltop, but even so:  Defender of the Crow_0002a.jpg (947.48KiB)   Defender of the Crow_0003.jpg (945.01KiB)  It is from Aielund second act, the Isle of the dead dungeon. And it is from the solo run with my Evil Speed Caster, but obviously before she multiclasses.  [-] Spoiler     There are some rooms where you spawn a Warlord Mummy when you pick a magical weapon from a sarcophagus. There was a loop that let me pick the weapon and replace it and pick it and so on and spawn the room full of Warlord Mummies. I finished them all with a couple of castings of Sunburst and maybe a Firebrand to finish off any stragglers. I would not dare to try that stunt with a fighter type.   If nothing else, it was a fine picture of the mummies.]Sunburst[/url]<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Ooh, well that didn't work! Let's try something else...<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/shh-tell-no-one-t2355040.html\" rel=\"noreferrer\" target=\"_blank\">Sunburst</a><br/>\n<br/>\nHope that's better! It's on post #8, btw.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:29 PM - Jul 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That is a fabulous screenshot Mick has taken, thanks for linking it Stag. I have to stick it somewhere in the spellcasters guide I wrote!<br/>\n<br/>\nRe the blindness vs non undead I'll have to test out. Trouble is, things die so rapidly to time stop emp IGMS and emp Firebrand doesn't matter about blinding em if they are dead :)<br/>\n<br/>\n<strong>Edit:</strong> Actually I asked BlackCobra in game a moment ago, he told me Sunburst is fabulous for parties to blind non undead enemies, and mass blindness/deafness isn't comparable so theres a good answer there :)<br/>\nThanks Mick for sharing your lvl 8 sorc spell list. Actually that is a good topic to discuss! :) Might start another thread<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}