{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "187",
  "name": "About to load Aielund for the first time...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/about-to-load-aielund-for-the-first-time-t2354490.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "20",
  "views": "2.6K",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:26 PM - Jan 12, 2016",
      "content": "<div>Hi All,<br/>\n<br/>\n 'The time has come, the walrus said...' As many of you know, I've only ever played the OC, SoU and HotU before (no, sorry, I did Aribeth Redemption once) and, wanting to grow as a player, as well as assorted harangues from the big boys in the playground, I believe now's the time to try something different: so I thought, Aielund has been recommended plenty of times, let's try that. If I remember correctly, that can take me from L1 all the way to 40? And who knows, I might actually start seeing the benefits of Knockdown and its more butch brother!<br/>\n<br/>\n Now, given that it'll be very new for me, and the aforesaid wanting to improve as a player before I can really profess to be a genuine 'builder', I'm asking for help here, if you don't mind. I have in mind a Strength-based, Good or Neutral aligned Monk (obviously, for those who've read my previous ramblings) - preferably unarmed, but flexible on that, maybe with CoT (particularly for saves) or Fighter (Ranger if kamas), and either Rogue or Shadowdancer (still trying to improve my sneaking). I would intend to wear only robes and be human - although I could push it to Half-Orc if that would help with STR, although I appreciate that DEX and/or WIS would need to be quite high for AC.<br/>\n<br/>\n I don't know where it stands on the high-low magic index, nor whether Dev Crit works, so I'm floundering a bit - not just being lazy, I promise!<br/>\n<br/>\n Is this the sort of thing that might work in the Aielund environment - and, more importantly to me at least, can anyone provide me with a prototype, please?<br/>\n<br/>\n Still here, still annoying...<br/>\n<br/>\n Thanks in advance, you lovely people!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:13 AM - Jan 13, 2016",
      "content": "<div>Aielund is low magic at low levels and fairly high magic at high epic levels. Your final level will be somewhere above 35. I prefer to use a build that works well at all levels.<br/>\n The selection of monk gear is quite good. I prefer the unarmed route for this series. You can bring henchmen along with you, so you don't have to rely on soloing everything, unless you want that extra challenge. In fact, going with a party adds a lot to the story. Just remember to equip them well.<br/>\n One tip: Save frequently!   ;)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:21 AM - Jan 13, 2016",
      "content": "<div>Dev Crit has been disabled in the Aielund Saga for years, so you would be better off with a DEX-based Monk. Here's a build I plan to play in the Aielund Saga after I update from the old version I have with Dev Crit not yet disabled. Shadowdancer is in the build for Defensive Roll, so I can qualify for Epic Dodge. Sneaking is not my style, but you can adapt it for stealth by dropping Listen and Heal and lowering Lore to get enough points to max out Hide and Move Silently. As usual, click the word Spoiler to see the build.<br/>\n<br/>\nSpoiler [+]<br/>\n<br/>\n Nimble Fist (Monk 25 / Fighter 10 / Shadowdancer 5)<br/>\n Human, Any Lawful<br/>\n Playable 1 - 40, PvM<br/>\n<br/>\n Abilities:<br/>\n STR: 14<br/>\n DEX: 18 (34)<br/>\n CON: 12<br/>\n WIS: 8<br/>\n INT: 12<br/>\n CHA: 8<br/>\n<br/>\n Leveling Guide:<br/>\n Human: (Quick to Master)<br/>\n 01: Monk(1): Luck of Heroes, Strong Soul, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n 02: Monk(2): {Deflect Arrows}<br/>\n 03: Monk(3): Weapon Finesse<br/>\n 04: Monk(4): DEX+1, (DEX=19)<br/>\n 05: Monk(5)<br/>\n 06: Monk(6): Weapon Focus: Unarmed, {Knockdown, Improved Knockdown}<br/>\n 07: Monk(7)<br/>\n 08: Monk(8): DEX+1, (DEX=20)<br/>\n 09: Monk(9): Blind Fight, {Improved Evasion}<br/>\n 10: Monk(10)<br/>\n 11: Monk(11)<br/>\n 12: Monk(12): DEX+1, Improved Critical: Unarmed, (DEX=21)<br/>\n 13: Monk(13)<br/>\n 14: Monk(14)<br/>\n 15: Monk(15): Toughness<br/>\n 16: Fighter(1): DEX+1, Dodge, (DEX=22)<br/>\n 17: Monk(16)<br/>\n 18: Fighter(2): Iron Will, Mobility<br/>\n 19: Fighter(3)<br/>\n 20: Fighter(4): DEX+1, Weapon Specialization: Unarmed, (DEX=23)<br/>\n 21: Shadowdancer(1): Great Dexterity I, {Hide in Plain Sight}, (DEX=24)<br/>\n 22: Shadowdancer(2): {Darkvision, Uncanny Dodge I}<br/>\n 23: Fighter(5)<br/>\n 24: Fighter(6): DEX+1, Great Dexterity II, Epic Weapon Focus: Unarmed, (DEX=26)<br/>\n 25: Shadowdancer(3)<br/>\n 26: Shadowdancer(4)<br/>\n 27: Shadowdancer(5): Epic Dodge, {Defensive Roll}<br/>\n 28: Fighter(7): DEX+1, (DEX=27)<br/>\n 29: Fighter(8): Epic Weapon Specialization: Unarmed<br/>\n 30: Monk(17): Great Dexterity III, (DEX=28)<br/>\n 31: Monk(18)<br/>\n 32: Monk(19): DEX+1, (DEX=29)<br/>\n 33: Monk(20): Great Dexterity IV, (DEX=30)<br/>\n 34: Fighter(9)<br/>\n 35: Fighter(10): Epic Prowess<br/>\n 36: Monk(21): DEX+1, Great Dexterity V, (DEX=32)<br/>\n 37: Monk(22)<br/>\n 38: Monk(23)<br/>\n 39: Monk(24): Great Dexterity VI, (DEX=33)<br/>\n 40: Monk(25): DEX+1, Armor Skin, (DEX=34)<br/>\n<br/>\n Stats:<br/>\n Hitpoints: 420<br/>\n Skillpoints: 248<br/>\n Saving Throws (Fortitude/Will/Reflex): 27/24/34<br/>\n Saving Throw bonuses: Spells: +4, Mind Effects: +2, Traps: +1, Death: +1<br/>\n BAB: 26<br/>\n AB (max, naked): 42 (melee), 39 (ranged)<br/>\n AC (naked/mundane armor/shield only): 37/37<br/>\n Spell Casting: <br/>\n Alignment Changes: 0<br/>\n<br/>\n Skills:<br/>\n Discipline 43(45), Heal 23(22), Hide 10(22), Listen 43(42), Lore 43(44), Move Silently 8(20), Spellcraft 19(20), Tumble 40(52)<br/>\n<br/>\n 01: Discipline(4), Hide(2), Listen(4), Lore(4), Move Silently(2), Spellcraft(2), Tumble(4)<br/>\n 02: Discipline(1), Hide(1), Listen(1), Lore(1), Move Silently(1), Tumble(1)<br/>\n 03: Discipline(1), Listen(1), Lore(1), Spellcraft(1), Tumble(1)<br/>\n 04: Discipline(1), Hide(1), Listen(1), Lore(1), Move Silently(1), Tumble(1)<br/>\n 05: Discipline(1), Listen(1), Lore(1), Spellcraft(1), Tumble(1)<br/>\n 06: Discipline(1), Hide(1), Listen(1), Lore(1), Move Silently(1), Tumble(1)<br/>\n 07: Discipline(1), Hide(1), Listen(1), Lore(1), Move Silently(1), Tumble(1)<br/>\n 08: Discipline(1), Hide(1), Listen(1), Lore(1), Move Silently(1), Tumble(1)<br/>\n 09: Discipline(1), Hide(1), Listen(1), Lore(1), Move Silently(1), Tumble(1)<br/>\n 10: Discipline(1), Hide(2), Listen(1), Lore(1), Tumble(1)<br/>\n 11: Discipline(1), Listen(1), Lore(1), Spellcraft(1), Tumble(1)<br/>\n 12: Discipline(1), Listen(1), Lore(1), Spellcraft(1), Tumble(1)<br/>\n 13: Discipline(1), Listen(1), Lore(1), Spellcraft(1), Tumble(1)<br/>\n 14: Discipline(1), Listen(1), Lore(1), Spellcraft(1), Tumble(1)<br/>\n 15: Discipline(1), Listen(1), Lore(1), Spellcraft(1), Tumble(1)<br/>\n 16: Discipline(1), Heal(2), Lore(1)<br/>\n 17: Discipline(1), Listen(2), Lore(1), Tumble(2)<br/>\n 18: Discipline(1), Heal(2), Lore(1)<br/>\n 19: Discipline(1), Heal(1), Lore(1), Save(1)<br/>\n 20: Discipline(1), Lore(1), Spellcraft(1), Save(1)<br/>\n 21: Listen(4), Lore(1), Tumble(4)<br/>\n 22: Listen(1), Lore(1), Spellcraft(2), Tumble(1), Save(1)<br/>\n 23: Discipline(3), Lore(1), Save(1)<br/>\n 24: Discipline(1), Lore(1), Spellcraft(1), Save(1)<br/>\n 25: Listen(3), Lore(1), Spellcraft(1), Tumble(3)<br/>\n 26: Heal(5), Listen(1), Lore(1), Tumble(1)<br/>\n 27: Heal(2), Listen(1), Lore(1), Spellcraft(1), Tumble(1), Save(1)<br/>\n 28: Discipline(4), Lore(1)<br/>\n 29: Discipline(1), Lore(1), Save(2)<br/>\n 30: Discipline(1), Listen(3), Lore(1), Tumble(3)<br/>\n 31: Discipline(1), Listen(1), Lore(1), Spellcraft(1), Tumble(1)<br/>\n 32: Discipline(1), Listen(1), Lore(1), Spellcraft(1), Tumble(1)<br/>\n 33: Discipline(1), Listen(1), Lore(1), Spellcraft(1), Tumble(1)<br/>\n 34: Discipline(1), Lore(1), Save(2)<br/>\n 35: Discipline(1), Lore(1), Spellcraft(1), Save(2)<br/>\n 36: Discipline(1), Listen(3), Lore(1), Tumble(3)<br/>\n 37: Discipline(1), Heal(2), Listen(1), Lore(1), Tumble(1)<br/>\n 38: Discipline(1), Heal(3), Listen(1), Lore(1)<br/>\n 39: Discipline(1), Heal(3), Listen(1), Lore(1)<br/>\n 40: Discipline(1), Heal(3), Listen(1), Lore(1)</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:56 AM - Jan 13, 2016",
      "content": "<div>Thanks Both,<br/>\n<br/>\n @ Empyre, splendid build, which I shall steal immediately - great AC, AB over 40, more than respectable saves - nothing dramatically weak, well-rounded starting stats - even I can see the advantages of DEX over WIS in a DEX build! Like you, I'm not a sneaker by inclination, but I'm trying to improve - hence my looking to Shadowdancer for HiPS (btw, am I limited to a given number of uses of HiPS in a daily cycle?), rather than going Rogue for UMD. I'll probably sacrifice some Heal and Lore for a boost to Move Silently and Hide, but I won't be maxing them. My only questions in the feats are: 1) Strong Soul - is that a bonus for resistances? Never used it before, so thought I ought to know. 2) I know lots of folk prefer Expertise over Mobility, is there a particular reason why you've gone the other way here? That's not a leading question - I quite like Mobility myself, it's just <em>there</em>, you don't have to turn it on. 3) Now, I'd always taken Power Attack as merely a step to other things, but I was talked around on that by others (predominantly Max, if memory serves), particularly for DEX builds. So, given that you've left it out, was I right all along?<br/>\n<br/>\n @ Mick, having just been Balduring, I realise how much I'd missed playing with others (oo-er), so companions (never liked the term 'henchmen') would be nice to have again. I always liked Linu and Deekin in the OC/SoU/HotU, but everyone seemed to make such crappy AI choices - 'there's one goblin - quick, fireball!' - that I decided to try soloing (that and I hate dropping and/or killing a companion I've emotionally invested in, blouse that I am). So, is the AI better in Aielund, or will I have to get used to the old 'shaking head and closing eyes in resigned fashion while preparing to reload' mode again?<br/>\n<br/>\n Oh, and looking through various recent-ish posts, Valerfor seems to have gone missing. Hope he's ok - does anyone know?<br/>\n<br/>\n Cheers once again, comrades!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:01 AM - Jan 13, 2016",
      "content": "<div>If you sneak around to avoid combat, you're missing out on the experience points you would have gotten for killing those enemies. The NWNWiki mentions nothing about limitations on HiPS usage, so unless it is something that the Aielund Saga limits that I don;t know about because I never tried it, you're fine there.<br/>\n Strong Soul gives +1 to Fortitude and Will saves, and saves against death magic. In the final battle, you need a good will save. On the other hand, by then you'll be immune to mental effects because of Monk 20, so it would be fine to drop that for Power Attack, which would help you bash locks. I might even try to think of something to replace Iron Will.<br/>\n Dodge and Mobility are requirements for Shadowdancer.<br/>\n The AI is better in the Aielund Saga, for example, both henchmen and enemies will use Taunt. You also have more dialog options on what instructions to give them. Still, don't expect geniuses.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:21 PM - Jan 13, 2016",
      "content": "<div>Many thanks.<br/>\n<br/>\n Any sneaking I plan on doing would be to get in optimum position for baddy-thumping or checking the lay of land, not to avoid combat - I don't like the idea of leaving live foes behind me, that would just be asking for trouble.<br/>\n<br/>\n If you're thinking of replacing Iron Will, would the aforementioned Expertise be a reasonable option - or maybe Spring Attack?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:51 AM - Jan 14, 2016",
      "content": "<div>Spring Attack lets you move around in combat without getting attacks of opportunity, but you won't get those anyway because of your high Tumble skill. Expertise requires 13 INT, but this build has only 12 INT. You won't get that mental effects immunity until level 33, so I guess you're better off with better Will saves after all, unless somebody comes up with an obviously better choice. Stealthy? Skill Focus: Discipline? Called Shot? Great Cleave? Extra Stunning Attacks?</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:31 AM - Jan 14, 2016",
      "content": "<div>For goodness' sake, I wasn't complaining! If there's nothing that leaps out to say \"Me! Me!\", then one of your now innate knowledge probably got it right first time. The supposedly helpful suggestions stemmed from both 'duh-ness' due to lack of recent game-time and a genuine nosiness - if I ever want to be a decent builder, questioning the bosses must surely be the right way to complete my apprenticeship!<br/>\n<br/>\n Regardless: have now done the requisite downloads - bloody scary, given the total collapse of NwN last time I tried one - which seem to have worked, so am now in launch mode...a new world beckons...<br/>\n<br/>\n Actually, must give a hat-tip to someone called Ahti Lilura, whose Aielund installation blog was marvellous - probably ought to thank them direct, as I don't know if they look on here.<br/>\n<br/>\n You do realise, of course, that further dumbo questions will now be raised, given my unfamiliarity with the saga? Sorry all - I know it's a Build site, but I get excited, and you've all been there - and it's the playing that's the true joy, yes? (Yes, I'm on the sipping whisky again...)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:32 AM - Jan 14, 2016",
      "content": "<div>For what it's worth...<br/>\n<br/>\n One practice you may find handy is making a copy of four of the NWN folders: hak, override, tlk and texturepacks.  I'm referring to the list of filenames, not the files themselves.  Just create a pure, unformatted text file in each of those folders with a name that indicates the current date.  You can do this easily at command prompt level. Do this before loading new CC and after adding each successive one.  As each new content compilation is added make a new text file with the new date in the name or some logical sequence notation if you happen to load more than one CC project in a single day.<br/>\n<br/>\n Then, if you ever notice the game is not running properly, crashing or creating corrupt files, by running a diff between the offending list and the previous one, you can easily identify which files did the damage.  To resurrect proper functionality, then you can create temp folders and begin moving the candidate offenders one-by-one out of their respective custom folders until the game regains status quo.  This is so much easier than doing a full reinstall, patching and scratching your head wondering what screwed up your NWN installation. This doesn't guarantee you'll find the intruder, but will narrow down the search significantly.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:00 AM - Jan 14, 2016",
      "content": "<div>Thanks Hip! However, I fear I may have buggered it up prior to your suggestions. I did everything I was supposed to do - promise - but every time I try to load NwN I'm now getting a \"Has encountered a problem and had to close\" message. Not happy, my friends. Not happy at all,<br/>\n<br/>\n And the thanks I recently imparted to my 'friendly-helper' they can now stuff where the sun don't shine. Grrr.<br/>\n<br/>\n And rest...and again...and try again later. (I would say 'try tomorrow', but it's 3 am here, so that's going to help no one)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:09 PM - Jan 14, 2016",
      "content": "<div>Yeah. Most of us have been there before, not that it's any particular consolation for you.  :(<br/>\n<br/>\n One needs to take precautions to lessen the potential time/effort-wasting to get back to full functionality again, hence my prior suggestion.<br/>\n<br/>\n I even know there are some members of the community who have written local bat executables to temporarily repopulate custom folders module-specifically when there are conflicts between the haks, etc. and then toggle back and forth according to what they want to play.  It CAN get hairy depending on how many custom modules you like to play in parallel, a strategy I strongly discourage based on my own frustrations over the years trying to do just that. <br/>\n<br/>\n When CEP began to upgrade, they made no accommodation for legacy requirements which created LOADS of problems and disgruntled downloaders.  The user would have to hunt down the specific file(s) not carried over and install it or couldn't play earlier CEP versions. I haven't upgraded to the latest CEP myself (I think it's 2.6 now unless there's a beta but I am still operating with only 2.3) so they MAY have addressed the backward compatibility issue in a newer version.  Dunno.  Others may chime in to clarify that business.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:15 AM - Jan 17, 2016",
      "content": "<div>Hi there.<br/>\n<br/>\n Sorry, I've not been in touch - been sulking the last couple of days.<br/>\n<br/>\n Many apologies, but I haven't got the faintest notion of half of what you said, Hip - the tech stuff is not my forte. However, I did note that the CEP I downloaded (possibly even installed) was indeed 2.6, so alas, that didn't sort the 'backward compatibility issue' (an expression I will be using as often as possible, regardless of context!). Tomorrow I shall eradicate the allegedly Aeilundified version, and try to reboot my saved elsewhere NwN - though I'm not holding out much hope.<br/>\n<br/>\n All in all, I'm beginning to wonder whether NwN is worth all the hassle. Not the playing, which is great, but every single time I try to load anything other than the OC I end up in a clustercrap of bother.<br/>\n<br/>\n Maybe I just need to sleep on it.<br/>\n<br/>\n ~ Night time, good for sneaking up on evil ~</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:59 AM - Jan 17, 2016",
      "content": "<div>Apologies for the cryptic explanation, Stagmeister.  I am also not tech-savvy, merely picking up bits of information as I read as much pertaining to NWN as time permits.<br/>\n<br/>\n Since your installation is causing problems (that is an understatement according to your description), should I be faced with the same issues and not able to determine the source of the trouble... I'd need to do a clean reinstall.  For the first step, make sure you apply the Critical Rebuild of v1.69.  I suspect you already know this but it never hurts to reinforce the fact one more time.  Try playing a few minutes of the OC and each expansion to hit the ground running before trying community modifications.<br/>\n<br/>\n Then, just as a test, hunt around until you find another module that runs off of CEP 2.61.  Try to find one that requires as few other custom resources as possible.  It doesn't need to be anything special really.  We want to confirm that the latest CEP package installed correctly. If the game runs smooth with one CEP module, it should run fine universally. Aeilund has quite a few additional customizations so I would be interested to find out, assuming there might be a repeat of the fatal issue the second time around, whether it was one of the Aielund-specific haks/overrides that cause the original malfunction.  Baby steps is how a neurotic copes with the delusion of control. <br/>\n<br/>\n Only then would I begin installing the full Aielund package.  If the CEP-only content worked fine (essentially I mean the game starts normally, graphics seem normal, character movement is robust, etc... you know the drill), then applying the remainder of customizations should work fine.  If not, try reinstalling just the Aielund package again.  That's the best strategy IMO.  At least installing piecemeal you'll learn more about the possible source of corruption should it fail again.<br/>\n<br/>\n I can sympathize with your frustrations.  The problem arises because when content designers test their CC for release, they are limited to only their own hardware/OS configurations to access whether it is installing and working as intended.  The portion of the user community with different rigs are the beta testers which is why you'll see version upgrades uploaded occasionally that may address reoccurring issues.  But it's not like they are concerned with lost sales like BioWare was, so support will never be as comprehensive as a programming staff would provide.  There is detailed installation instructions specifically dedicated to Aielund linked on the Vault DL page.  I espect you also are aware of this.  It is well written and concise.<br/>\n<br/>\n Fact: There is still activity on the BSN NWN legacy game boards, most of which is focused on custom content and scripting... a venue that is probably the best place to resolve issues related to installing CC.  They may even have documented common problems and FAQ for you there.  It's always nice to have a viable alternate knowledge base.<br/>\n<br/>\n With all that said, I hope you stick with it.  There is so much great SP content and PW experiences to enjoy for a game so inexpensive and timeless, it will always be the best bargain going.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:58 AM - Jan 17, 2016",
      "content": "<div>Here's a link to the Bioware's subforum for NWN: <a class=\"postlink\" href=\"http://forum.bioware.com/forum/43-neverwinter-nights/\" rel=\"noreferrer\" target=\"_blank\">http://forum.bioware.com/forum/43-neverwinter-nights/</a><br/>\n How about installing an older version of CEP 2.x, like the 2.3 that Hip mentioned, and then installing 2.61 afterwards/? If the problem is missing files, doing this should ensure that you have them. This would be in addition to doing what Hip suggested.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:31 PM - Jan 17, 2016",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong><hr/>How about installing an older version of CEP 2.x, like the 2.3 that Hip mentioned, and then installing 2.61 afterwards/? If the problem is missing files, doing this should ensure that you have them. This would be in addition to doing what Hip suggested.<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">We must be on the same wavelength with regards to this, Empyre, because that's actually what I would have done... me being skeptical about versions of CEP higher than v2.3. <br/>\n<br/>\n I have zero experience dealing the newest CEP versions so didn't want to further muddle the procedure for Stagmeister.  I've been operating under the assumption that when v2.4 was released, the many issues/complaints users had with it MUST have alerted the CEP team to its intrinsic limitations (like backward compatibility) which they surely addressed in the later/latest upgrades. Or perhaps my rose-colored glasses are blurring my view? :P<br/>\n<br/>\n Aielund originally used v2.3 (or even lower) when offered on the IGN Vault, didn't it?  At least that's been my best recollection.  You've played this series a lot, so what do you remember?<br/>\n<br/>\n It's possible that the latest Aielund-specific hak was released to take advantage of some new content of v2.61.  It would handy to know how long v2.61 has been available if for no other reason than to get a sense of how long the beta period has been.  I don't think it's been very long, probably only months.  Thing is... a smaller community of users in today's climate means fewer reports coming into the team about issues needing to be addressed.   Another consequence of a dwindling player base. :(</div></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:42 PM - Jan 17, 2016",
      "content": "<div>Cheers, All.<br/>\n<br/>\n I shall endeavour to follow said diagnostics (it's all sounding a bit 'House' now, so I might as well join in when I can - and maybe we can play backward compatibilty bingo while we're at it. Sorry, renowned facetiousness trickling out now <img class=\"img-emoji\" src=\"emoji/6.gif\"/>). However, does/would CEP2.3 still exist out there? I got my downloady advice from the aforementioned Ahti Lilura Aielund blog, which was very recent and took me direct to relevant NwN Vault files Maybe that'll teach me to stay on site!<br/>\n<br/>\n So, would the best route be for me to try a CEP2.3 download, followed by a piece-by-piece series of haks and all the other malarkey (bmus, ems, etc) until it breaks - sorry, works? I'm obviously feeling more positive today, so am prepared to give it a whirl. (It appears I'm more guinea pig than miniature giant space hamster.)<br/>\n<br/>\n ~Squeak!~</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:01 PM - Jan 17, 2016",
      "content": "<div>Yeah, that's what I (and apparently Empyre as well) would do in a similar situation. I've never had any problems with v2.3 whether SP or PW.  I recommend doing a manual install.  IMO that's the most bug-free method.  Just decompress the 7z compression anywhere you like, then move the contents of each folder into the corresponding folder in your ../NeverwinterNights/NWN game folder.  Don't recall anymore if I had to create any new folders, but if so, just name them exactly as they are in the 7z archive (it may be case-sensitive so make it exact).<br/>\n On the Vault, it's <a class=\"postlink\" href=\"http://148.251.86.81/sites/all/modules/pubdlcnt/pubdlcnt.php?file=http://148.251.86.81/sites/neverwintervault.org/files/project/206/files/cep_23_full_c.7z&amp;nid=206\" rel=\"noreferrer\" target=\"_blank\">here</a>.<br/>\n<br/>\n Keep us posted as to your progress, eh?<br/>\n<br/>\n edit: Ummm... I just realized they posted two different versions of v2.3 on the new Vault.  One filename has the trailing _c and the other doesn't.  Both are 7z compressions. What I recommend is the one WITHOUT the installer so if the link I provided uses the installer, DL the other one and drag the files around yourself.  Apologies for being so foggy on the exactitudes but with so many versions available today it is hard to keep track without a roadmap.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:08 AM - Jan 18, 2016",
      "content": "<div>I just looked in the nwn folder inside my downloads folder, and the latest version of cep I find is cep_v2.exe dated 4/19/2008, which could be the day I downloaded it, not the day it was released. Then again, all my aielund-related stuff is also dated in April 2008, an old version from before horses were added and before dev crit was disabled.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:24 PM - Jan 18, 2016",
      "content": "<div>Thanks, Both,<br/>\n<br/>\n Have located v2.3 (the one with the _c is the one your link goes to, Hip, so your edit was well-made!). I would put the link here, but still deficient in that bit of 'how-to' knowledge - something for another day. The address, however, is <a class=\"postlink\" href=\"http://neverwintervault.net/Have\" rel=\"noreferrer\" target=\"_blank\">neverwintervault.net/project/nwn1/hakpak/combined/cep-23-cep24 </a>Have things I need to do now, but will go for another loading later. I'll keep you posted...<br/>\n<br/>\n<em>EDIT:</em> Looks like the address comes up as a link anyway - if only everything was so easy!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:17 PM - Jan 18, 2016",
      "content": "<div>A jolly huzzah to one and all!<br/>\n<br/>\n Have got Aielund up and running now. As it transpired, the core of the problem lay in my HotU load: there was a Temp folder with nothing in it, which I'd always just ignored before - I mean, why bother if it's just an empty folder? Ha! I actually read the Readme file, and that said it could be an issue, so bin it. I did, and the game loaded (yeah!)...but not Aielund (boo!). I got a 'missing required talk table' message. Now, even I in my numptytude reasoned that it was probably the tlk files, but I knew I'd loaded them - so, puzzled I was, puzzled! However, all it took - and I suppose it's obvious to those who've been around a bit - was for me to take the indivdual files from the tlk folder I'd installed as a folder (thereby creating a talk talk folder, I suppose, which the game didn't recognise, or maybe just didn't like 80s synth-based music...I digress) and drop them into the pre-existing tlk folder. Et voila! (or viola, if you like your chamber music) My L1 toon bestrides Aielund like a...wet bloke in a frock with a rucksack.<br/>\n<br/>\n And the moral of the story is...read Readme files, take baby steps when you haven't a clue what you're doing (after all, I only got the thing working at all because I thought I'd give it one more try, having binned the failed one, before taking all the sage advice above), and don't lose heart.<br/>\n<br/>\n Btw, Empyre and Hip, the CEP2.61 clearly works, so you might want to give it a whirl. And please don't think this has been an utter waste of your time and efforts on my behalf, because it really, really hasn't. As ever, I've learned a lot that will be invaluable in the future (thereby avoiding me asking the <em>same</em> dumb question: there will, of course, be others), as well as lifting my overall understanding of how the beast works. Hopefully it will be of use to others, too. So huge thanks.<br/>\n<br/>\n I'm sure I'll be pestering you again soon about the plot, why I'm dying all the time, etc, so apologies in advance. Looking forward to giving it a good go, though!<br/>\n<br/>\n Finally, just for fun, the game is now throwing me the same 'Neverwinter Nights has to close' message as before, but now after I hit Quit, which is nice!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:03 AM - Jan 19, 2016",
      "content": "<div>Well, now that's a relief, isn't it?  Persistence and attention to detail pays off, eh?  Very pleased to hear the good news so we can put another thread to bed with success.<br/>\n<br/>\n Not reading a Readme is like not reading the instructions before trying to assemble one of those appliances that comes in a hundred pieces a box that your wife just had to buy to fill some void in her life. <img class=\"img-emoji\" src=\"emoji/8.gif\"/>  Worse thing is when the kids decide watching your feeble attempt is the evening's entertainment.<br/>\n<br/>\n But I'll be passing on v2.61 for the time being.  I always live by the tenet \"If it ain't broke don't try to fix it.\".  Should CEP tech ever paint me into a corner the way Microsoft has, well, then I'll need a shot or two of Jack to get me across the abyss. <br/>\n<br/>\n Cheers!</div>"
    }
  ],
  "author-color": "#AA0000"
}