{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "057",
  "name": "Help with a wizard for World of Greyhawk",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/help-with-a-wizard-for-world-of-greyhawk-t2354728.html",
  "author": "Skeleton Pope",
  "avatar": "no_avatar.png",
  "replies": "5",
  "views": "724",
  "posts": [
    {
      "author": "Skeleton Pope",
      "avatar": "no_avatar.png",
      "timestamp": "6:39 AM - Aug 08, 2017",
      "content": "<div>Greetings, after fiddling with my last wizard/bard I decided that the combination was a bit to much work to get going and it lacked the staying power a extremely rest restricted server like world of greyhawk needs.<br/>\n<br/>\nSo currently I am trying to figure out a wizard build that can solo the entire server, if its even possible. I know the bosses are nasty but I think it might be feasible with the proper split.<br/>\n<br/>\nI know many of the folks here are World of Greyhawk veterans, and I have no idea the extent of the defensive stats these legendary epic bosses have on the server. Whether I need spell penetration, crit immunity etc.<br/>\n<br/>\nWoG is decidedly low magic, with a +6 weapon being a legendary item of great power. Im unsure if items like crit immunity exist, but I do know that haste is a property one can gm buy at higher levels.<br/>\n<br/>\nDevastating critical is around, so I would like to include 10 Pale master if possible to stop that in its tracks. Polymorphs are great but sometimes you just need to stay in caster form. Again I don't know what kind of spell pen is needed against some of the stronger mobs, but it seems that WoG doesn't like to 'cheat' stats. So I think beating toolset sr might be enough. <br/>\n<br/>\nExpertise has been fixed to no longer work while casting, so its not as much of an autoinclude.<br/>\n<br/>\nCraft wand is a necessity as it is really good on the server and helps with longevity. I would like to include armor in there, but that would probably mean sacking tumble (or maybe not). Traps don't seem super important as a wizard can rely on the pixie to deal with them or just feeding summons onto them with a wand if I spot them. UMD seems like a necesity, as the server is low magic but has an abundance of varied items for its magic level and that would let me keep my gear diverse.<br/>\n<br/>\nThus I think, assuming that its not to feat intensive, a Wizard/palemaster/bard might be my best option, but its the feat intensity might not make it feasible. Im open to dropping palemaster entirely, and relying on golem form to stop dev criticals but the safety net of palemaster is hard to give up.<br/>\n<br/>\nSo a gnome or dwarf Wizard 26/bard 4/palemaster 10 with spell penetration feats would be capable of beating the sr levels I need, achieve heavy armor, and have discipline/tumble/UMD. I think the AC could become very respectable with this setup and WOG tensers or damage shield/polymorphs would allow it to conserve spells. I don't know if the palemaster crit immunity persists through shapechanges, but if it does death slaad form is an interesting grab. Dwarf could reach a more comfortable early str but gnome has alot of interesting strengths to it. The shield bracers on the server make shields less attractive. I believe Elven chain exists on the server to so that could be a good way to pick up some extra AC with UMD before autostill comes into play.<br/>\n<br/>\nAnother interesting split is Wizard 29/bard 3/champion of torm 8<br/>\n<br/>\nAnyway, this is my ramblings on where I should go with this character. I hope you guys aren't to confused and can help me make something capable of soloing the toughest server I've found.<br/>\n<br/>\nRequirements:<br/>\nCraft Wand<br/>\nHigh AC<br/>\nSaves<br/>\nWizard<br/>\nMust use casting to deal with tough battles.<br/>\n<br/>\nIf anyone has experience with the toughest fights on this server, I know its considered bad form to spoil things but a little nudging in the right direction build wise would be extremely appreciated. I'll start posting builds I come up with when I have them fully mathed out, feedback is always appreciated.</div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "7:26 AM - Aug 08, 2017",
      "content": "<div>I assume you want a fully fledged caster and not a spellsword.<br/>\n<br/>\nIf so the 2 builds that instantly spring to mind are both by GDL,  The War Wizard (W35F2Ro3) and Mestil's Pale Emmisary W26F4PM10)<br/>\n<br/>\nTyr also has a sorcerer/bg/pm if memory serves (also in the old ecb builds) im pretty sure its called the Sorceror King, and Mick has hia Evil Speed Caster (So35/BG2/Mo3) that can be found in the level 40 builds section <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/evil-speed-caster-sorc-35-monk-3-bg-2-t2319013.html\" rel=\"noreferrer\" target=\"_blank\">here</a><br/>\n<br/>\nI'm posting from my phone so I can't link the older builds but if you download the old ECB search from Neverwintervault.org you should have no trouble finding them.<br/>\n<br/>\nIf not I'll post them when I get home.<br/>\n<br/>\nHave fun !</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:20 AM - Aug 08, 2017",
      "content": "<div>WoG doesn't have many Dev. Critters but the ones it has they are nasty... What it does have (in spades) are Weapon Masters, and they hit hard, very hard. Tyr's build is nice but he gets his first auto-still feat in 33rd level and that kind of hurts for WoG. Anyway, take a look at my Abjurant Champion Pope, you might like him.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-abjurant-champion-wizard-26-ftr-6-cot-8-t2354353.html\" rel=\"noreferrer\" target=\"_blank\">the-abjurant-champion-wizard-26-ftr-6-c ... 54353.html</a></div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "11:29 AM - Aug 08, 2017",
      "content": "<div>I was going to suggest that one along with your <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/battle-sorceress-sorcerer-26-pal-4-cot-10-t2354359.html#unread\" rel=\"noreferrer\" target=\"_blank\">Battle Sorceress</a> but I wasn't sure if he was looking for a spellsword or a pure caster.</div>"
    },
    {
      "author": "Skeleton Pope",
      "avatar": "no_avatar.png",
      "timestamp": "6:06 PM - Aug 08, 2017",
      "content": "<div>Hey guys, thank you for the suggestions! Yeah Valerfor those weapon masters even without dev crit are really nasty customers. I wanted to do a pure caster which made me consider sorc for the ammo but in an environment where xp and gold is infinite i feel wizard is a better choice.</div>"
    },
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "2:56 PM - Aug 18, 2017",
      "content": "<div><blockquote><div><cite>Skeleton Pope wrote:</cite>\nHey guys, thank you for the suggestions! Yeah Valerfor those weapon masters even without dev crit are really nasty customers. I wanted to do a pure caster which made me consider sorc for the ammo but in an environment where xp and gold is infinite i feel wizard is a better choice.\n</div></blockquote>\n\nBoth are good on WoG - just depends on playstyle.  Don't forget about the Craft Wand / Potion / Scroll enhancements there that help make up for the rest restrictions (if you have the gold and xp to spare).</div>"
    }
  ]
}