{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "015",
  "name": "Poisons: a mini-guide",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/poisons-a-mini-guide-t2355100.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "6",
  "views": "3.7K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:31 AM - Jul 10, 2019",
      "content": "<div><strong><span style=\"font-size:175%;line-height:normal\">Poisons: a mini-guide</span></strong><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201907/10759084_a4641ebfa9a71f31bd36e680e954c0cc.jpg\"/><br/>\n<span style=\"font-size:50%;line-height:normal\">Source: <a class=\"postlink\" href=\"https://www.istockphoto.com/au/illustrations/poison\" rel=\"noreferrer\" target=\"_blank\">https://www.istockphoto.com/au/illustrations/poison</a></span><br/>\n<br/>\n<br/>\nIt is time to take on a new challenge - poisons! I thought I'd start the discussion by writing up a guide on the topic. There will be players and builders with much more experience using poisons than me, and their input would be valuable as perhaps there will be things to add or change.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">The Basics</span></strong><br/>\nPoisons were added with the Hordes of the Underdark expansion. <br/>\n<br/>\nAll melee weapons, and ranged ammunition (arrows, bolts, bullets and shuriken) can be coated with poison to force an opponent to make up to two fortitude saves or suffer two instances of damage (called primary and secondary respectively) to an ability score. Bows, crossbows and slings cannot have poison applied to them.<br/>\n<br/>\nIn more detail, the effects of poisons are in two phases. Firstly is applying the poison. If the opponent is hit by a poisoned weapon or ammunition (or affected by the Poison spell), the opponent needs to pass a fortitude save or the poison will be applied. If the poison is applied the primary ability damage will be applied. The second phase occurs after 1 minute if the poisoning was successful. A second fortitude save will need to be made at the same difficulty. If the opponent succeeds this the poison is removed without any further ability point damage. If the opponent fails this the secondary ability damage be applied. Both primary and secondary ability damage will persist on the opponent until removed by a spell such as restoration, or resting.<br/>\n<br/>\n<strong>Standard poisons types</strong><br/>\nThe three standard poison types are spider venom (strength), giant bee (constitution) and centipede (dexterity). They come in six different strengths listed below, and according to the Wiki they do 1d2 damage on both primary and secondary phases.<br/>\n<br/>\nApplying poisons is difficult. It requires a high dexterity modifier to apply the most powerful poisons. <br/>\n<br/>\nThe applier has to pass a DC check with the formula (<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Poison_%28item%29\" rel=\"noreferrer\" target=\"_blank\">Source: NWN Wiki: Poison (item)</a>):<br/>\n<br/>\n10 + d10 + dexterity modifier vs. poison's apply DC (which is 2 DC higher than the save DC)<br/>\n<br/>\nTherefore the apply DC and save DC (fortitude) for each poison would be:<br/>\n<br/>\n- weak DC 18 / 16<br/>\n- mild DC 20 / 18<br/>\n- average DC 22 / 20<br/>\n- strong DC 24 / 22<br/>\n- very strong DC 26 / 24<br/>\n- deadly DC 28 / 26<br/>\n<br/>\n<strong>Other poisons</strong><br/>\nModule creators can add further poison types which will affect various ability scores with varying severity. <br/>\n<br/>\nFor example the '<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Large_scorpion_venom\" rel=\"noreferrer\" target=\"_blank\">Large scorpion venom</a>' has a save DC of 18, with 1d6 strength primary damage and 1d6 strength secondary damage.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Bebilith_venom\" rel=\"noreferrer\" target=\"_blank\">Bebilith venom</a> has a save DC of 20 with 1d6 constitution primary damage and 2d6 constitution secondary damage.<br/>\n<br/>\nThe list of other poisons is very long. It can be read on the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Poison\" rel=\"noreferrer\" target=\"_blank\">Poison Wiki Page</a>. <br/>\n<br/>\nSuch poisons appear much more potent to me than the standard poison types. I have been informed by a player such poisons are quite effective. I would suggest using these if you can, over the standard poisons, unless others comment otherwise. <br/>\n<br/>\n<strong>The best poisons are non-standard c<strong>onstitution poisons / paralysis / instant death</strong></strong><br/>\nConstitution poisons drop HP by Level x Constitution modifier, and fortitude saves. This makes any further poisoning attempt more likely to succeed. This could be useful for a particularly difficult boss.<br/>\n<br/>\nOther poisons provide paralysis and chance of instant death, which could be useful as well. Low DCs could be managed with a 'roll of 1s' by doing lots of attacks to eventually inflict primary poison damage. For example the Carrion Crawler Juice only has a DC of 13 but a chance for 10 rounds of paralysis. If one lands 20 hits with it, eventually one fortitude save will be failed with a '1' roll.<br/>\n<br/>\nHere is the list of some of the strongest poisons in my opinion, sorted from lowest DC to highest<br/>\n<br/>\n<table class=\"post_content_table\"><tbody><tr><td>Carrion crawler brain juice</td>\n<td>paralysis (10 rounds)</td>\n<td>none</td>\n<td>13</td>\n</tr>\n<tr><td>Phase spider venom</td>\n<td>2d6 constitution</td>\n<td>2d6 constitution</td>\n<td>15</td>\n</tr>\n<tr><td>Sassone leaf residue</td>\n<td>2d12 acid</td>\n<td>1d6 constitution</td>\n<td>16</td>\n</tr>\n<tr><td>Iron golem fumes</td>\n<td>1d4 constitution</td>\n<td>death</td>\n<td>17</td>\n</tr>\n<tr><td>Wyvern poison</td>\n<td>2d6 constitution</td>\n<td>2d6 constitution</td>\n<td>17</td>\n</tr>\n<tr><td>Dark reaver powder</td>\n<td>2d6 constitution</td>\n<td>2d6 constitution</td>\n<td>18</td>\n</tr>\n<tr><td>Bebilith venom</td>\n<td>1d6 constitution</td>\n<td>2d6 constitution</td>\n<td>20</td>\n</tr>\n<tr><td>Black lotus extract</td>\n<td>3d6 constitution</td>\n<td>3d6 constitution</td>\n<td>20</td>\n</tr>\n<tr><td>Deathblade</td>\n<td>1d6 constitution</td>\n<td>2d6 constitution</td>\n<td>20</td>\n</tr>\n<tr><td>Pit fiend ichor</td>\n<td>3d6 constitution</td>\n<td>death</td>\n<td>21</td>\n</tr>\n<tr><td>Epic wyvern poison</td>\n<td>2d6 constitution</td>\n<td>2d6 constitution</td>\n<td>26</td>\n</tr>\n</tbody></table>\n<br/>\n<br/>\n<strong>Self poisoning</strong><br/>\nIt is not possible to self-poison on a DC check in the usual NWN environment. The Wiki describes this as a bug. <br/>\n<br/>\nI have done in game testing with the Pretty Good Character Creator Module, with a level 7 bard with Dex 8 failing 50 applications of deadly centipede venom on her dagger. Not once did she poison herself.<br/>\n<br/>\nCertain modules and persistent worlds may have fixed this bug. For example I have been informed by a player in World of Greyhawk self-poisoning is possible when a DC check is failed when applying poisons. <br/>\n<br/>\n<strong>Use poison feat available to Blackguard and Assassin classes</strong><br/>\nBlackguards and Assassins get the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Use_poison\" rel=\"noreferrer\" target=\"_blank\">Use Poison</a> feat at level 1, which allows them to apply poisons automatically without needing a DC check.<br/>\n<br/>\n<strong>Duration of poisons on items</strong><br/>\nPoisons will only be active on weapons or ammunition for 3 rounds. A player cannot apply more than one poison to a weapon or ammunition. Based on in-game testing I have done, weapons and ammunition which already have the 'On hit: Ability Drain' property cannot be poisoned. <br/>\n<br/>\nCertain modules and persistent worlds have modified poisons to be longer lasting. For example:<br/>\n<blockquote><div><strong>DM Raine wrote:</strong><br/>\n<br/>\n[li]~~Poisons: Greyhawk has a slightly more robust Poison system. Poisons applied to weapons now last 10-15 rounds (mileage may vary), and some of the more rare Poisons have higher DCs[/li]<br/>\n<br/>\nSource: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/worldofgreyhawkfr/listing-of-greyhawk-feat-changes-t331.html\" rel=\"noreferrer\" target=\"_blank\">https://www.tapatalk.com/groups/worldof ... -t331.html</a>\n</div></blockquote>\n<strong><a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Poison_%28spell%29\" rel=\"noreferrer\" target=\"_blank\">Poison (Spell - Cleric / Druid)</a></strong><br/>\nIf spell resistance is passed, this spell forces an opponent to make a fortitude DC save of 18 or suffer 1d6 strength and have the poison applied. If the poison is applied, after 1 minute a further fortitude save of 18 will need to be made or a further 1d6 strength damage will be applied, following which the poison is removed.This is the same as the large scorpion venom. The wiki states the spell does not require a successful melee touch attack despite the description. <br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Practical aspects</span></strong><br/>\n<strong>Is the target poison immune?</strong><br/>\nI would recommend checking if your opponent is poison immune. I've had a look through the NWN wiki regarding various classes and monsters.<br/>\n<br/>\nNotable poison immune player classes are Druids (Venom Immunity, level 9) and Monks (Diamond body, level 11). <br/>\n<br/>\nNotable poison immune monsters are Undead, Constructs, Elementals, Oozes (ie Gelatinous Cubes, Ochre Jellies), some Outsiders (ie Vrocks, Pit Fiends, Quasits) and Cobras.<br/>\n<br/>\nThis still leaves a large number of opponents who are vulnerable to poisons. The best targets are going to be those with low Fortitude saves, which would be rogue and mage types. Dragons are not poison immune, and one could feasibly pepper a Dragon multiple times with poisoned ammunition before engaging in hand to hand combat. <br/>\n<br/>\n<strong>Using the poison just before combat</strong><br/>\nBecause of the short duration of poisons on items, poisons would have to be applied just before combat. Due to time constraints and complexity I do not believe it is practical to poison other teammates weapons or ammunition. <br/>\n<br/>\nFor poisons to be usefully applied just before combat a high chance of success is needed, otherwise the character will be wasting a number of rounds of combat simply to poison their weapon. <br/>\n<br/>\nIf a character has the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Use_poison\" rel=\"noreferrer\" target=\"_blank\">Use Poison</a> feat, then poison application will always be successful and a dexterity check is not required.<br/>\n<br/>\nIf a character does not have the Use Poison feat, to have a 80% chance of successful application of a poison a player's dexterity would have to be at the following values for each poison (if my maths is correct):<br/>\n- Dexterity 20 for weak poisons (ie DC 18 vs 10 + d10 + 5)<br/>\n- Dexterity 24 for mild poisons (ie DC 20 vs 10 + d10 + 7)<br/>\n- Dexterity 28 for average poisons (ie DC 22 vs 10 + d10 + 9)<br/>\n- Dexterity 32 for strong poisons (ie DC 24 vs 10 + d10 + 11)<br/>\n- Dexterity 36 for very strong poisons (ie DC 26 vs 10 + d10 + 13)<br/>\n- Dexterity 40 for deadly poisons (ie DC 28 vs 10 + d10 + 15)<br/>\n<br/>\nIf a character wants a 90% chance of successful application, then add a further 4 dexterity to the score.<br/>\n<br/>\nTherefore poisons in practice are only are limited to in usefulness to Blackguards, Assassins and characters with high dexterity scores. High dexterity characters who want to use poisons additionally should consult the list above as to the strength of the poison they could use reliably based on their dexterity score and also the list of non-standard poisons, their save DC and estimate what they would be able to reliably use.<br/>\n<br/>\n<strong>Making best use of the 3 rounds in which the poison is active on the weapon or ammunition</strong><br/>\nTo get as much usage as possible for the poisons over those 3 rounds, having high attack rolls and high numbers of attacks per round would be favorable. This forces multiple fortitude saves over the 3 rounds which have to be passed or the opponent is poisoned. Once the opponent is poisoned, the player can attempt to poison other targets until the poison expires. Each round is divided into three flurries, so in theory up to 9 opponents could be poisoned.<br/>\n<br/>\nHere are a few examples of methods high attack rolls and/or high numbers of attacks per rounds can be achieved <br/>\n- Kama wielding Monks (up to 5-6 attacks per round with the main weapon, up to 7-8 attacks per round with flurry and haste)<br/>\n- Rapid shot ranged builds (up to 5 attacks per round with rapid shot, 6 attacks per round with rapid shot and haste)<br/>\n- Pre-epic BAB 16+ builds (eg. Full BAB classes such as Fighters, Rangers, or 3/4 BAB classes with at least 4 preepic levels in a full BAB class)<br/>\n- Clerics with Divine Power (for pre-epic BAB 16+) divine favor and other AB buffs, with  Zen Archery as well<br/>\n- Attacking from Stealth or Invisibility, Flanked opponents,  Knocked down or stunned opponents, opponents who are Taunted or have their AC reduced by other means (ie Curse Song)<br/>\n<br/>\nDual wielders will want to poison their main weapon which is the source of most of the attacks per round rather than their off-hand weapon, which provides no more than 2 attacks per round (with Improved Two Weapon Fighting).<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Countering poisons</span></strong><br/>\nBeing poisoned in the first place can be avoided with poison immunity feats or items. <br/>\n<br/>\nIf this is not possible high fortitude scores and bonuses to saves against poisons (eg. Assassins) can be useful, as well as not being hit by opponents with poisons through strategy and/or high AC.<br/>\n<br/>\nPoisons can be removed with heal kits or by using the Neutralise Poison spell. Ability score losses can be reversed with the Lesser Restoration / Restoration / Greater restoration spells.<br/>\n<br/>\n<em>Edits: grammar fixes to make the text clearer, added image source details, updated article with details of in-game testing, added comment from WoG player RE self-poisoning being possible on their persistent world server. added more detail on primary and secondary poison ability damage phases. added detail on standard poisons vs other poisons, added Poison spell details, restructured the article with headings to make it easier to read, added reference to DM Raine's post on poisons on World of Greyhawk, added list of the strongest poisons in the game (from the Wiki)</em></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:39 AM - Jul 11, 2019",
      "content": "<div>Nice guide Orion, too bad the poisons are such a fuss for no tangible benefit. <br/>\n<br/>\nThey kept the vanilla DCs of 3E DM's guide in a game that goes all the way to forty level! The DC's should have been doubled dammit!<br/>\n<br/>\n\"Rant mode goes ON about a number of stuff, including luck of proper mithril armour, useless dirty fighting, parry, holy avenger nerf, stupid companion A.I.\"...<br/>\n<br/>\n<br/>\nStill, one of the best RPG's ever made though.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:06 PM - Jul 11, 2019",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nNice guide Orion, too bad the poisons are such a fuss for no tangible benefit. <br/>\n</div></blockquote>\nThe is definitely true for the standard poisons. 1d2 ability score damage sucks even in pre-epic levels.<br/>\n<br/>\nThe standard 3 round duration also sucks. WoG increased the duration to 10-15 rounds which makes poisons very strong, if you play on that PW.<br/>\n<br/>\nBit of theory crafting here. There are a few 'non standard poisons' that look pretty nasty. And for low DC poisons if you can get a whole bunch of attacks in, eventually the enemy will roll a 1... :)<br/>\n<br/>\nI think constitution poisons are the best of the bunch. They drop HP by level x modifier change, and drop fortitude saves as well for further successful poison attempts and a higher chance of secondary ability damage. <br/>\n<br/>\nThese are the best of the non-standard poisons... in order of lowest DC to highest. I've added this to my post as well for convenience/readability.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/moghedien-melody-of-the-dark-bard-26-bg-4-rdd-10-t2350150.html\" rel=\"noreferrer\" target=\"_blank\">Moghedien</a> is gonna slay everyone without poisons, but for a little extra power on top of an overpowered build, with her levels in Blackguard she can also add some Black lotus extract / Pit fiend ichor or Epic wyvern poison to drop their HP further, drop fortitude saves and increase the chances of her devastating criticals succeeding... without needing a Dex DC check...<br/>\n<br/>\nThanks for contributing to the discussion. This is a long neglected topic which I thought it was time to write up to hear everyone's thoughts.<br/>\n<br/>\n<table class=\"post_content_table\"><tbody><tr><td>Carrion crawler brain juice</td>\n<td>paralysis (10 rounds)</td>\n<td>none</td>\n<td>13</td>\n</tr>\n<tr><td>Phase spider venom</td>\n<td>2d6 constitution</td>\n<td>2d6 constitution</td>\n<td>15</td>\n</tr>\n<tr><td>Sassone leaf residue</td>\n<td>2d12 acid</td>\n<td>1d6 constitution</td>\n<td>16</td>\n</tr>\n<tr><td>Iron golem fumes</td>\n<td>1d4 constitution</td>\n<td>death</td>\n<td>17</td>\n</tr>\n<tr><td>Wyvern poison</td>\n<td>2d6 constitution</td>\n<td>2d6 constitution</td>\n<td>17</td>\n</tr>\n<tr><td>Dark reaver powder</td>\n<td>2d6 constitution</td>\n<td>2d6 constitution</td>\n<td>18</td>\n</tr>\n<tr><td>Bebilith venom</td>\n<td>1d6 constitution</td>\n<td>2d6 constitution</td>\n<td>20</td>\n</tr>\n<tr><td>Black lotus extract</td>\n<td>3d6 constitution</td>\n<td>3d6 constitution</td>\n<td>20</td>\n</tr>\n<tr><td>Deathblade</td>\n<td>1d6 constitution</td>\n<td>2d6 constitution</td>\n<td>20</td>\n</tr>\n<tr><td>Pit fiend ichor</td>\n<td>3d6 constitution</td>\n<td>death</td>\n<td>21</td>\n</tr>\n<tr><td>Epic wyvern poison</td>\n<td>2d6 constitution</td>\n<td>2d6 constitution</td>\n<td>26</td>\n</tr>\n</tbody></table></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:41 PM - Jul 11, 2019",
      "content": "<div>And If you have 15 levels of Bard &amp; curse-song, you can add +2, on these DC's.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:39 PM - Jul 11, 2019",
      "content": "<div>I'm really going to have to play Moghedien in WoG, I think the early levels are going to be tough but if I can get through it it is such a lovely build plus now I can take advantage of my new knowledge on poisons...<br/>\n<br/>\n<em>Addit: One of my friends on WoG tells me his assassin has bags full of poison at the ready, so at least on that server it appears to be useful for that class... sounds like a good friend for Moghedien to have!</em><br/>\n<br/>\n<br/>\n<em>Further edit: A new adventure begins! Here is the Moghedien build being started in Ruskis....</em><br/>\n<em><img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201907/10759084_a07749a4a0860b6ab9c1b7e966e68115_t.jpg\"/></em><br/>\n<br/>\n<br/>\n<em><strong>Heroic badger power! Having access to Summon Creature I does make things a little easier. I buff him with my song and shoot the nasty zombie with my heavy crossbow with 8 Dex (thank god for bard song). </strong></em><br/>\n<em><strong>Once my friend's time in this world is over, it is hit and run tactics with a heavy crossbow against the undead.</strong></em><br/>\n<em><img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201907/10759084_d28c36ae44ec9a75dbeef6fc088c494c_t.jpg\"/></em></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:03 PM - Jul 11, 2019",
      "content": "<div>You started from Ruskis? Let's see if you can find the treasure then ;)<br/>\n<br/>\nAlso, awesome picture the one you have chosen for her portrait man.<br/>\n<br/>\nGood luck.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:37 AM - Jul 12, 2019",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nYou started from Ruskis? Let's see if you can find the treasure then ;)<br/>\n<br/>\nAlso, awesome picture the one you have chosen for her portrait man.\n</div></blockquote>\n\nOh no a challenge. I'm just happy to survive fighting large crabs right now let alone find some pirate treasure!<br/>\n<br/>\nThanks for the feedback. I went through about 300 odd portraits I have installed on NWN and this was the one that most resonated with me in terms of the build you made - strong, poetic, enchanting, graceful and dark, single wielding a scimitar - lets just say I'm flattered you like it!</div>"
    }
  ]
}