{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "355",
  "name": "Halfling Katana SD",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/halfling-katana-sd-t2349324.html",
  "author": "Mae",
  "avatar": "10235276_1510287070.gif",
  "replies": 11,
  "posts": [
    {
      "author": "Mae",
      "avatar": "no_avatar.png",
      "timestamp": "12:08 AM - Jan 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello. This is odd, considering the fellow latest request, but I've been pondering over a character I can't seem to build. On Arelith, Katanas are small weapons. Note, that they are not finesse-able. I'd like to play a Halfling that uses one, and can still sneak. On Arelith SD get +1 Hide per SD level, and Shadow Evade is 3 rounds per SD level. Damage output isn't a concern of mine as long as I have high AC.<br/>\n<br/>\nEDIT: Also a good alignment is optimal to me.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:14 AM - Jan 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The fact that you want a Halfling Shadowdancer tells me that you want to be DEX-based, but then you chose a weapon that is not finessable, which doesn't make sense. Since you are taking Exotic Weapons anyway, you might as well choose 1 or 2 kukris instead. With that substitution, I think I can make a pretty good build for you, a Rogue / Fighter / Shadowdancer with Epic Dodge and probably also Self Concealment 5.<br/>\n<br/>\nIf you insist on a katana, I might be able to salvage it with a Bard / RDD / SD with Epic Dodge, but probably not SC5..<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:17 AM - Jan 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I agree with Empyre, if it's not finesseable, then you should build for Strength, and if you build for Strength, average AC is the best you can hope for, not to mention Halflings get a penalty to their starting STR. So basically, what you want is impossible, no wonder you're having trouble building it. Honestly, either drop Halfling for Elf and then you can build for Strength or swap the weapon for Kukris and build for Dexterity and high AC. You can't have both, man. The way it sits, I suggest you take his advice and use Kukris instead.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mae",
      "avatar": "no_avatar.png",
      "timestamp": "5:20 PM - Jan 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I did try this and build for strength. RDD is not an option on Arelith, it requires a 5% roll of a level 26+ character. Neither is switching to Elf, or to Kukris. I realize what I'm working with here, but I have a strict interpretation of this character.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://puu.sh/6EXCo/d2138e3f2c.jpg\" /><br/>\n<br/>\nThis is what I came up with. I need help improving it. Currently it has a DC 37 Shadow Daze, and with IE I can reach 64 AC. Since I get +1 from Dodge, and +1 from Halfling. This is with all gear and buffs that I could remember to put on.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:47 PM - Jan 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">39 AB is very low. That's what happens when you split between STR and DEX. You AC isn't that bad, but if you'd put all the increases to DEX, again it'd be much bigger. I also don't like the spread. I don't see ANY benefits from so many SD levels. Shadow Daze isn't exactly something you wanna focus on. By not going more Rogue, you're forfeiting SA dice, access to feats such as Improved Evasion and Crippling Strike every 3 levels instead of 5 and UMD dumps. By not taking 6 Fighter you're also giving up a feat. If you are going to insist on so many SD levels, then IMO the build will be weak. I'd do this: Rogue 19, SD 5 Fighter 6, using SD just for Defensive Roll (because you need at least 3 to take the class). IIRC HiPS is disabled on Arelith too, right?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mae",
      "avatar": "no_avatar.png",
      "timestamp": "9:08 PM - Jan 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">HiPs is disabled. The Shadow Dancer levels benefit with 1 stealth/level. The levels primarily were for that, Shadow Evade, and Shadow Daze. Shadow Evade has had its duration increased significantly so it's quite useful. Self Concealment 5 also isn't possible on Arelith. It is a level 30 capped server. Off the top of my head it isn't, at least. Starting with 22 Dex as a Halfling with gifts, I'd get 29 end game without Great Dexterity feats. If I took the feats for it, I have 3 remaining for Self Concealment.<br/>\n<br/>\nI'm willing to expand into other builds, but I am set on the Katana and Halfling part. I'd like some sneaking ability. However, it isn't essential. I'd also like to have at least 55 AC (buffed.)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:59 PM - Jan 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's the problem cuz I don't know how much AC you'd actually have Buffed on your server because I don't know what buffs or items are available. So, let me ask you a very simple question: what AC would you reach with a Katana / Large Shield and Full Plate with a +1 DEX modifier, the best Dodge boots, etc...?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mae",
      "avatar": "no_avatar.png",
      "timestamp": "10:13 PM - Jan 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Helmets give +3 AC with no other stat bonuses. You can get them with stat, but that's the best AC bonus helmets.<br/>\nBest Large Shields give +3 AC. <br/>\nBoots give +1 AC. (As well as usually +1 to 2 abilities.)<br/>\nArmor usually gives +2 AC. <br/>\nAll the other items are usually Ability/Ability/Skill/Skill.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:19 PM - Jan 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Dude, YOU do the math, and then tell me the number, then we can do something to improve it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mae",
      "avatar": "no_avatar.png",
      "timestamp": "10:45 PM - Jan 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I thought you'd asked of the values of the best items. I apologize. It seems that this forum isn't keen on being friendly, I will take my leave and seek elsewhere. Thank you for the help. It may be me, but I am getting a negative feeling from this thread in general. Apologies for spending time here and possibly wasting your time.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:05 AM - Feb 01, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I apologize if you felt I was being rude, I didn't mean to, I was just in a hurry. If you read this, I'm willing to help.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:46 AM - Feb 01, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">We're trying to help you, but you are making it hard for us.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}