{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "268",
  "name": "Return to Arelith, A decision division.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/return-to-arelith-a-decision-division-t2354342.html",
  "author": "TheInfragableKrunk",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "1.8K",
  "posts": [
    {
      "author": "TheInfragableKrunk",
      "avatar": "no_avatar.png",
      "timestamp": "4:15 AM - Nov 23, 2014",
      "content": "<div>I may like to go back to Arelith if I would it would not be to existing characters therefore I need to work out a new build. Before I left I had tinkered with two concepts that intrigued me but never came anywhere close to fruition. Help me refine them so I can choose one to focus on?<br/>\n<br/>\n Character 1<br/>\n Max Level 30<br/>\n Wizard/Assassin/(?)<br/>\n Svirfneblin <br/>\n<br/>\n Basic Concept:<br/>\n This character poses as a skilled enchanter while moonlighting as a ruthless infiltrator and murderer.<br/>\n<br/>\n Must be able to effectively use Spells from the Enchantment school.<br/>\n Must be able to survive short to moderate battles in hand to hand. (Long Enough To Escape)<br/>\n MUST be DEADLY striking from the shadows. (High Death Attack DC and Damage)<br/>\n Should be able to cast Spells while stealthed.<br/>\n May need to utilize RP skills such as persuade, intimidate and especially bluff. As well as typical Mage skills and stealth. <br/>\n<br/>\n About Svirfneblin: <br/>\n They gain +2 dex  +2 wisdom and -4 Charisma in addition to gnome standard +2 Con and -2 str. Darkvision and +4 Ac to all except giants at level 1 as well as Invisibility once per day and natural Spell Resistance as per level.<br/>\n<br/>\n Personal Preferences:<br/>\n Avoid the Monkeys<br/>\n Dual wielding (even if only partially skilled)<br/>\n<br/>\n History:<br/>\n This is a concept I've always loved. A combination rarely used on a race commonly overlooked. I played an early version years and years ago on a high magic open ended server the initial thought being \"Death Attack+High Int+TrueStrike.. yes please\". Unfortunately the environment rendered it weak. However Arelith seems to be a perfectish place to roll it out again, of course overcoming the level gap and learning curve of moving a Caster into Sneaker without lending an obvious hint that is what is happening will be difficult. Wizard of the people, Assassin when backs are turned.</div>"
    },
    {
      "author": "TheInfragableKrunk",
      "avatar": "no_avatar.png",
      "timestamp": "4:44 AM - Nov 23, 2014",
      "content": "<div>Max Level 30<br/>\n Barbarian/Blackgaurd/Sorcerer or Cleric<br/>\n Drow<br/>\n<br/>\n Drow bonuses +2 int +2 Cha in addition to elf properties ECL 4 <br/>\n<br/>\n Basic Concept: This build utilizes some Arelith Specific functions.<br/>\n Barbarian Drunken Strength (The barbarian gains a soft bonus to strength and looses dexterity based on CL and drunkenness)<br/>\n SF Necromancy: Undead Summons are stronger<br/>\n GSF Necromancy: May summon two Undeads simultaneously as henchman.<br/>\n ESF Necromancy: Casting any Undead Summon from any source creates two instead of one.<br/>\n<br/>\n What all that means is at ESF I could use BG's undead summon to create two Death Knights as HENCHMEN and still summon a Vrock or Succi as a standard summon.<br/>\n<br/>\n So this build is a Demon Commanding Lush with rage issues BUT WAIT THERE'S MOAR! I would like to incorporate Sorcerer With the infinite Spells per day variant to Max buff everything, Debuffs Enemies, Throw Spells for kicks and shuckles and eventually tie together Tenser's Transformation With Divine Shield and Might. (Fun combo BTW)<br/>\n<br/>\n So Nutshell the Nutshell: High to Max CHA, Barbarian Rage+ Drunken, Three BG Summons, Infinite Spells Per Day, and Tenser's B**** Slap Combo.<br/>\n<br/>\n Draw Backs: Like the previous build, a lot of moving parts to fit into a small place with no room for error. Long Cool down times on some essential spells. Easily Killed if caught I'll prepared. The \"Arcane vs Armor\" conundrum and Low STR on a melee build.</div>"
    },
    {
      "author": "TheInfragableKrunk",
      "avatar": "no_avatar.png",
      "timestamp": "4:51 AM - Nov 23, 2014",
      "content": "<div>Build One is a single target eliminator with good crowd control.<br/>\n Can potentially rise at a moments notice to action.<br/>\n Can potentially work well in PVP situations.<br/>\n Fun Technical play style. <br/>\n<br/>\n Build Two is a one man adventuring party.<br/>\n Can take on large enemies and groups.<br/>\n Can easily support any existing group.<br/>\n Does not need backup in average to difficult fights.<br/>\n<br/>\n Both have a fun concept and enough RPable skills to be enjoyable in the tavern.<br/>\n<br/>\n See what you have to say.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:29 PM - Nov 23, 2014",
      "content": "<div>Hmm, those are some challenging builds alright, but i do like their concept.<br/>\n<br/>\n 1) For your first character you said high damage, alright then Fighter (6) should solve this with his EWS in Short-Swords, plus you will have Wizard buffs in your disposal such as GMW and Flame Weapon. Assassin will add his sneak attack here as well. Therefore (<strong>Wizard 10/ Fighter 6/ Assassin 14</strong>) sounds about right? You will have 7d6 of sneak attack and your Death attack DC will be something like (27) unbuffed, (<strong>33</strong>) with maxed-out INT. If i am correct you can't have more than one buffs in your weapon in Arelith correct? That is why i did not go for Wizard 15 (GMW +5) but i suggest \"flame weapon\" instead. As for Bluff and Intimidate are Assassin skills so you will not have any problems with them since you will have enough skill points too with 16 INT. Spells like \"charm person\" or \"hold monster\" are in your disposal and although they will not have a high DC they have will saves which are the toughest to make. Now if you take ESF in enchantment school and buff your INT the DC for your \"Hold Monster\" spell will be a serious (<strong>30</strong>) which i believe is good enough. Again, i do not know enything about Arelith's enemies, just speculations upon my experience.<br/>\n<br/>\n Pre-Epic Feats: Weapon Finesse, Weapon Focus, Ambidexterity, TWF, ITWF, Blind Fighting, Toughness, SF: Enchantment, GSF: Enchantment, Scribe Scrolls, Weapon Specialization, Knockdown, Improved Knockdown,<br/>\n<br/>\n Epic Feats: Epic Weapon Focus, Epic Prowess, Armour Skin, Epic Weapon Specialization, ESF: Enchantment, Great Dexterity I,<br/>\n<br/>\n STR 10  DEX 18 (<strong>26</strong>)  CON 16  INT 16  WIS 10  CHA 04 - Swirfneblin,<br/>\n<br/>\n Your AB won't be that high, but you will attack flat-footed opponents since you are an Assassin, so it will be enough and those Fighter levels help a lot with the AB. This isn't a final build, just a rough start-tell me what you think of it.<br/>\n<br/>\n * Minor edit, i optimized dexterity a bit more.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:35 PM - Nov 24, 2014",
      "content": "<div>Here is an \"Arcane trickster\" of the evilish sort that I have come up with. I have given the assassin DA priority, but have wizard level 5 spells and extend spell for the short duration spells. There is dual wield and a <strong>fat</strong> bluff skill along with some rogue/wizard essentials. I hope it works on your server.<br/>\n<br/>\n Rogue(2), Wizard(9), Assassin(19), Swirfneblin<br/>\n Alignment: evil<br/>\n  <br/>\n STR: 11<br/>\n DEX: 19 (28)<br/>\n CON: 12<br/>\n WIS: 10<br/>\n INT: 16<br/>\n CHA: 4<br/>\n  <br/>\n 01: Rogue(1): Ambidexterity<br/>\n 02: Wizard(1): {Scribe Scroll}<br/>\n 03: Wizard(2): Weapon Finesse<br/>\n 04: Wizard(3): DEX+1, (DEX=20)<br/>\n 05: Wizard(4)<br/>\n 06: Wizard(5): Two-Weapon Fighting, Extend Spell<br/>\n 07: Rogue(2): {Evasion}<br/>\n 08: Assassin(1): DEX+1, (DEX=21)<br/>\n 09: Wizard(6): Blind Fight<br/>\n 10: Assassin(2): {Uncanny Dodge I}<br/>\n 11: Assassin(3)<br/>\n 12: Assassin(4): DEX+1, Knockdown, (DEX=22)<br/>\n 13: Assassin(5)<br/>\n 14: Wizard(7)<br/>\n 15: Assassin(6): Weapon Focus: Dagger<br/>\n 16: Assassin(7): DEX+1, (DEX=23)<br/>\n 17: Assassin(8)<br/>\n 18: Assassin(9): Improved Two-Weapon Fighting<br/>\n 19: Wizard(8)<br/>\n 20: Assassin(10): DEX+1, (DEX=24)<br/>\n 21: Assassin(11): Epic Weapon Focus: Dagger<br/>\n 22: Assassin(12)<br/>\n 23: Assassin(13)<br/>\n 24: Wizard(9): DEX+1, Epic Skill Focus: Bluff, (DEX=25)<br/>\n 25: Assassin(14): Great Dexterity I, (DEX=26)<br/>\n 26: Assassin(15)<br/>\n 27: Assassin(16): Armor Skin<br/>\n 28: Assassin(17): DEX+1, (DEX=27)<br/>\n 29: Assassin(18): Great Dexterity II, (DEX=28)<br/>\n 30: Assassin(19): Epic Prowess<br/>\n  <br/>\n  Hitpoints: 192<br/>\n Saving Throws (Fortitude/Will/Reflex): 11/14/26<br/>\n Saving Throw bonuses: Spells: +5, Mind Effects: +2, Traps: +2, Poison: +6<br/>\n Evasion<br/>\n<br/>\n BAB: 17<br/>\n AB : 31 (dagger), 28 (ranged)<br/>\n AC (naked): 28/28<br/>\n Spell Casting: Wizard(5), Assassin spell like abilities<br/>\n Death attack: DC 32, damage 11 d6<br/>\n<br/>\n Skillpoints: 233<br/>\n Bluff 33(40), Concentration 27(30), Hide 33(46), Move Silently 33(46), Open Lock 6(15), Search 8(11), Spellcraft 22(25), Spot 33(37), Tumble 30(39), remaining skillpoints 8<br/>\n<br/>\n 01: Bluff(4), Hide(4), Move Silently(4), Open Lock(4), Search(4), Spot(4), Tumble(4), Save(16), <br/>\n 02: Concentration(5), Spellcraft(2), Save(14), <br/>\n 03: Concentration(1), Save(18), <br/>\n 04: Concentration(1), Spellcraft(5), Save(17), <br/>\n 05: Concentration(1), Save(21), <br/>\n 06: Concentration(1), Save(25), <br/>\n 07: Bluff(6), Hide(6), Move Silently(6), Open Lock(2), Search(4), Spot(6), Tumble(6), <br/>\n 08: Bluff(1), Hide(1), Move Silently(1), Spot(1), Save(3), <br/>\n 09: Concentration(3), Save(5), <br/>\n 10: Bluff(2), Hide(2), Move Silently(2), Spot(2), Save(4), <br/>\n 11: Bluff(1), Hide(1), Move Silently(1), Spot(1), Save(7), <br/>\n 12: Bluff(1), Hide(1), Move Silently(1), Spot(1), Tumble(5), Save(5), <br/>\n 13: Bluff(1), Hide(1), Move Silently(1), Spot(1), Save(8), <br/>\n 14: Concentration(5), Spellcraft(5), Save(3), <br/>\n 15: Bluff(2), Hide(2), Move Silently(2), Spot(2), Save(2), <br/>\n 16: Bluff(1), Hide(1), Move Silently(1), Spot(1), Save(5), <br/>\n 17: Bluff(1), Hide(1), Move Silently(1), Spot(1), Tumble(5), Save(3), <br/>\n 18: Bluff(1), Hide(1), Move Silently(1), Spot(1), Save(6), <br/>\n 19: Concentration(5), Spellcraft(5), Save(1), <br/>\n 20: Bluff(2), Hide(2), Move Silently(2), Spot(2), <br/>\n 21: Bluff(1), Hide(1), Move Silently(1), Spot(1), Save(3), <br/>\n 22: Bluff(1), Hide(1), Move Silently(1), Spot(1), Tumble(5), Save(1), <br/>\n 23: Bluff(1), Hide(1), Move Silently(1), Save(5), <br/>\n 24: Concentration(5), Spellcraft(5), <br/>\n 25: Bluff(2), Hide(2), Move Silently(2), Spot(1), <br/>\n 26: Bluff(1), Hide(1), Move Silently(1), Spot(2), Save(2), <br/>\n 27: Bluff(1), Hide(1), Move Silently(1), Spot(1), Tumble(5), <br/>\n 28: Bluff(1), Hide(1), Move Silently(1), Spot(2), Save(2), <br/>\n 29: Bluff(1), Hide(1), Move Silently(1), Spot(1), Save(5), <br/>\n 30: Bluff(1), Hide(1), Move Silently(1), Spot(1), Save(8), </div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:08 PM - Nov 24, 2014",
      "content": "<div>Hmm, Mick i think arelith forces you to take at least three levels of any class if you start it, so in this case you need to change that to Rogue (3)/ Assassin (18), nothing major, sneak attack remains the same you just lose 1 DC from your DA which is very high anyway,</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:04 AM - Nov 25, 2014",
      "content": "<div>Alright, i was thinking hard for your second build request but no matter how hard i tried i hit a wall. That wall was the level cap of 30 levels on arelith. I suppose that technically we can build what you ask in those thirty lvls but it won't be nice, at all. You see to be an effective Barbarian you need at the minimum 15 lvls and to be able to summon an Epic Fiend you would need at least 13 lvls of Blackguard, now add to that the Sorcerer lvls and you get the idea... For sure you can build something like (Sorcerer 18/ BG 7/ Barbarian 5) and role-play that at the tavern but you won't be effective at all and the only powers you will ever posses would come from your Sorcerer lvls. The thing is that i am intrigued from the possibility to have a small army of summons at your disposal and having seen some really great Blackguards role-played in a couple of servers i knew that the concept had much potencial, so what could we do to make it viable? So i found a way to \" <em>cheat </em>\" the game into thinking you that you are a great spellcaster and with that discovery i was able to make a very cool Blackguard build that fits your theme nicely ;)<br/>\n<br/>\n The build i propose is a (<strong>Fighter 10/ Bard 4/ Blackguard 16</strong>) with the ability to summon 2 \" <em>Doom Knights</em> \" in addition to the \" <em>Epic Vrock</em> \" while he is using his powerful infernal powers to bring doom to his opponents! Let's see how it works,<br/>\n<br/>\n Pre-Epic Feats: Weapon Focus: Longsword, Weapon Specialization: Longsword, Improved Critical: Longsword, Power Attack, Cleave, Knockdown, Blind Fight, Spell Focus: Necromancy, Greater Spell Focus: Necromancy, Divine Might, Divine Shield,<br/>\n<br/>\n Epic Feats: Epic Weapon Focus: Longsword, Epic Weapon Specialization: Longsword, Epic Prowess, Armour Skin, Great Charisma [3], Epic Vrock,<br/>\n<br/>\n STR 16  DEX 10  CON 12  INT 16  WIS 08  CHA 18 [28] - Drow,<br/>\n<br/>\n This character in fact, despite his low strength has the same AB of mine or Mick's Assassin (31 Vs 31) due to the 26 lvls of full BAB classes in the build, and he can also self-buff his strength easily with both Blackguard's inheret Bull's strength and UMD or Bard spells. You will find it very easy to actually buff both your strength and your charisma to the max in game provided there are wands/ scrolls and some reasonable items that you can take. And that <strong>charisma </strong>once buffed It becomes <strong>40</strong>!) oh boy... <strong><em>Massive Divine Shield/ Might bonusses</em></strong> ! Damage with your main weapon even without the \" <em>ultra mode</em> \" isn't too shabby for a 30 lvl PW either, all thanks to Fighter's Epic Weapon Specialization and UMD (Flame Weapon), plus you will have a fair amount of Sneak attack too (i love Blackguards, so nice a prestige class) i believe it is 5d6 Sneak attack. Let's move now to the \" summons \" part of the build, the game allows you to take (SF: Necromancy and GSF: Necromancy) if you are a Bard or Sorcerer and that allows us to have (2) Doom Knights as Henchmen all day long (and we can buff them with UMD of course, in addition to the small bonusses Arelith gives to undead summons) and then we can also cast \" summon fiend \" for the Epic Vrock which will be very powerful by itself due to the 16 lvls of Blackguard. Bard also gives the ability to have full ranks in \" <em>tumble </em>\" skill for better AC, full ranks in \" <em>spellcraft </em>\" for better spell defences and full ranks in \" <em>Taunt </em>\" for greater attacking power. All those are in addition to the minor Bard song and spells that you get.<br/>\n<br/>\n All in all a very fun and powerful in my opinion build that also has so many role-playing possibilities that is staggering! My only gripe, i wasn't able to get you any Barbarian powers in there but those are bad imho (lowers your AC by a lot) and there is so much to RP in this build already that i think you will not miss them much. So, that's it and i hope you will like it!<br/>\n<br/>\n *Edit, boosted Intelligence a bit to have enough skill points for all those wonderful skills Bard offers, you can max your Dexterity in Full Plate very easily with just a potion.</div>"
    }
  ]
}