{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "879",
  "name": "What is a good Black Stone Keep built?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/what-is-a-good-black-stone-keep-built-t2355038.html",
  "author": "phmah2408",
  "avatar": "10758847_1515693635.jpg",
  "replies": "31",
  "views": "7.0K",
  "posts": [
    {
      "author": "phmah2408",
      "avatar": "10758847_1515693635.jpg",
      "timestamp": "5:16 PM - Feb 28, 2019",
      "content": "<div>Hi everyone,<br/>\n<br/>\nRecently I been playing this server for a couple weeks. I read about it and the more I read the more I worry about building characters. I don't want to waste my time building something that cannot be played dealing with the epic boss. I heard high AC built doesn't fair good in BSK, because boss has insane AB and AC and resistances? So what to built? PM has high AC option but Pale Master's suffer from damage vulnerabilities to Bludgeoning (50%), Divine (100%), and Positive (100%). So it's out of the consideration. Anyone has experience in that server and deal with bosses?? One thing I am lack of is party time. Sigh.... I am always doing solo. Recently I am making a crafter 21 Wiz 19 Bard. <br/>\n<br/>\nPlease make me a built that I can solo in BSK, I know it's not possible to solo in BSK but maybe something close to it. Thanks guys!</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "5:31 PM - Feb 28, 2019",
      "content": "<div>Can none of the usual suspects work?<br/>\n<br/>\nExalted Sorcerer? <br/>\n<br/>\nFighter14/Bard16/RDD10,<br/>\n<br/>\nCleric26/Bard4/RDD10?<br/>\n<br/>\nShadow Priest Cleric26/SD5/Monk9?<br/>\n<br/>\nDev crit viable? <br/>\n<br/>\nNeed High Saves? Paladin/CoT/WM?<br/>\n<br/>\nIf you give more concrete info, we might help you better? All of the above should work in most settings. <br/>\n<br/>\nDruid26+/Monk6+/Whatever(CoT/Fighter/Bard) Dragonshape. With some luck, your +6 DR and Hiiigh AC might carry you through?<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "phmah2408",
      "avatar": "10758847_1515693635.jpg",
      "timestamp": "5:51 PM - Feb 28, 2019",
      "content": "<div><blockquote><div><cite>Grimnir wrote:</cite>\nCan none of the usual suspects work?<br/>\n<br/>\nExalted Sorcerer? <br/>\n<br/>\nFighter14/Bard16/RDD10,<br/>\n<br/>\nCleric26/Bard4/RDD10?<br/>\n<br/>\nShadow Priest Cleric26/SD5/Monk9?<br/>\n<br/>\nDev crit viable? <br/>\n<br/>\nNeed High Saves? Paladin/CoT/WM?<br/>\n<br/>\nIf you give more concrete info, we might help you better? All of the above should work in most settings. <br/>\n<br/>\nDruid26+/Monk6+/Whatever(CoT/Fighter/Bard) Dragonshape. With some luck, your +6 DR and Hiiigh AC might carry you through?<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk\n</div></blockquote>\n\nHi Grimnir,<br/>\n<br/>\nThanks for the swift response. Dev critical has changed to 35% more damage instead of instant death. Btw have you played that server? I am new to that server so lots of details I might be missing out. High saves are good. They have lots of crazy items in BSK. Lots of elemental damage weaponary. +20 ab weapon enhancement can be crafted. But has to be made by a crafter. Not sure how many forge stones to do that. Anyway, i guess to solo, properly a Druid dragon or cleric or a wizard that has buffed epic mummy dust and it lvl up base on caster lvl if I am not wrong. <br/>\nHmmmm ... ???</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:53 PM - Feb 28, 2019",
      "content": "<div>BSK seems to be a relatively new PW, but has gained traction fast (here, at least). Please excuse if I omit anyone here, but 3 of our members who play there often and have some \"history\" are Eastern Promises, Cornflower and Valkos. It might be worth having a look at what they've had to say about the place.<br/>\n<br/>\nSorry I can't be more help.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "10:54 PM - Feb 28, 2019",
      "content": "<div>Smiters/divine damage tends to do well on the bosses there.<br/>\n<br/>\nKeep 1,000 greater restoration scrolls and you should be fine if your HP is high enough.<br/>\n<br/>\nI've only fought the \"main\" boss and the boss outside of the desert (forgot the area name... basically \"a door opens\"). <br/>\n<br/>\nThere are lots of people willing to discuss builds on the BSK forum though, so check that out too.</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "2:54 PM - Mar 01, 2019",
      "content": "<div>First, check out the Blackstone keep forums. There's an entire section dedicated to various builds.<br/>\n<br/>\nNow, I've been playing there for a year soon. I've tried out dozens of builds and the way it works is like this: Whenever you find a build that might work, the owner of the PW makes a nerf of some vital item you need to manage to solo. I've been desperately trying to come up with a build that can solo the final two quests, Blood Cult and The Seventh Shrine, but nothing really works. You can search this forum for \"Blackstone\" and you'll probably find my threads trying to find a build.<br/>\n<br/>\nTo be successful on Blackstone Keep you need to party up. One tank (typically a Dwarven Defender/Fighter kind of character with massive Damage Reduction) and one hitter (typically a Fighter/Weaponmaster kind of character with very high AB) accompanied by one Cleric with lots of heal spells might work.<br/>\n<br/>\nAnother thing is that if you don't reach AC70 fully geared, don't bother, go with DR and immunities instead.<br/>\n<br/>\nAnyway, here's my recommendation, based on my own (so far failed) attempts to solo those. Try to build the following toons (you need UMD to be able to use wands and other items, hence rogue/bard levels). Note that the builds listed below are examples. If you have a favourite build for a tank, try that. Now the exact build you can search either the Blackstone Keep forums or the full 40 builds on this forum.<br/>\n<br/>\nCrafter Toon - Bard/Fighter/RDD with Craft weapon/armor 80+ (with items)<br/>\nTank - Dwarven Defender/Fighter/Rogue with at least 24DR<br/>\nHitter - Fighter/Weaponmaster/Rogue with AB50+ (DEX-based WM is good according to what I've heard, I haven't tried it myself, I hate rapiers)<br/>\nCleric with craft wand/scribe scroll - Cleric/Paladin/Rogue or Cleric/Bard/RDD<br/>\nWizard/Sorcerer with craft wand/scribe scroll - Wiz/Rogue or some Sorc build<br/>\n<br/>\nThat way you will find lots of Forge Stones and you can craft wands and scrolls with your cleric or wizard to provide the other toons with stuff.<br/>\nThen you need to be lucky and find the proper items.<br/>\n<br/>\nAccording to rumour and also I've seen some of them, there are builds that can actually solo eqipped with the right gear, but I don't know the specs or equipment for that. Blood Cult for instance is supposed to be solo-able with a cleric using implosion and TimeStop scrolls. I haven't figured it out though. If you do, please tell me!<br/>\n<br/>\nAlso, there's a discord channel for Blackstone Keep you might use too.</div>"
    },
    {
      "author": "phmah2408",
      "avatar": "10758847_1515693635.jpg",
      "timestamp": "10:37 PM - Mar 01, 2019",
      "content": "<div>Cornflower, thanks for your great information. How does the forge stones work? Those gem stones are easy to figure out. Buy a craft-able weapon and right click on those gem stones onto the weapon. What about forge stones?? how does it works? How does everything add up? Hmm... is there a guide towards using them? Maybe you can? you have 1 year experience on crafting. Thanks Cornflowers! </div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "11:15 PM - Mar 01, 2019",
      "content": "<div>I don't play there. If there's a way to get +20 to hit, then Weapon Master suddenly come into play. Also RDD. +20 caps it off, So BAB all of a sudden seem like a good idea. <br/>\n<br/>\nAlso, see what you can get out of a Rogue29/ SD1 / CoT10. Or something like that. <br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:57 AM - Mar 02, 2019",
      "content": "<div>BSK isn't friendly to sneakers from what I hear, true sight &amp; damaging auras &amp; resistances etc.</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "7:19 AM - Mar 02, 2019",
      "content": "<div><blockquote><div><cite>phmah2408 wrote:</cite>\nCornflower, thanks for your great information. How does the forge stones work? Those gem stones are easy to figure out. Buy a craft-able weapon and right click on those gem stones onto the weapon. What about forge stones?? how does it works? How does everything add up? Hmm... is there a guide towards using them? Maybe you can? you have 1 year experience on crafting. Thanks Cornflowers! \n</div></blockquote>\n\nThe rule is not to talk about Forging on the forums. The owner of Blackstone is adamant that the only way to learn is to ask someone in game. So, if you find me in game, I will answer all your questions, for a price of course.<br/>\nStill, this much I can tell you. First you need to find the Forge. You will get some instructions on how it all works. You get some Forge Stones as reward from second half of quests, lvl 18ish and upwards. You can also find some Forge Stones in loot. There are many Forge Stones with various effects, some awesome, some useless. You need to ask in game to learn which stone makes what. But, you can theoretically make a weapon like this:<br/>\n+20AB<br/>\n+2d12 Fire damage<br/>\n+d6 Acid damage<br/>\n+d6 Electric damage<br/>\n+d6 Sonic damage<br/>\nkeen<br/>\n+2d12 massive criticals<br/>\n<br/>\nYou can also (theoretically) make an armor with stuff like:<br/>\n-40% weight<br/>\n+4 Strength<br/>\n+6AC<br/>\nfreedom<br/>\nknockdown immunity<br/>\n+2 universal saves<br/>\n+1 regeneration<br/>\n15% immunity bludgeon<br/>\n<br/>\nThere's a random element to Forging, but if you have 80+ craft weapon/armor, you will get best chances of high values.</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "7:21 AM - Mar 02, 2019",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nBSK isn't friendly to sneakers from what I hear, true sight &amp; damaging auras &amp; resistances etc.\n</div></blockquote>\nMany bosses are either immune to crits/sneaks or have true sight, massive resistances, etc.<br/>\nThat's why I don't have a sneaker, or indeed even a dex-based WM.<br/>\nAlso, end-game bosses have toolset-increased AB/AC at 105/85 or even worse.</div>"
    },
    {
      "author": "phmah2408",
      "avatar": "10758847_1515693635.jpg",
      "timestamp": "5:45 PM - Mar 02, 2019",
      "content": "<div>Cornflowers, you mentioned\n<blockquote><div>Hitter - Fighter/Weaponmaster/Rogue with AB50+ (DEX-based WM is good according to what I've heard, I haven't tried it myself, I hate rapiers)</div></blockquote>\nDoes it still hit hard with a dex based WM? How high the AC can get? Anyone can do a built on this one? Ohhh cornflowers also mentioned sneaker or dex based built aren't going to work for end bosses? Thanks!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:47 PM - Mar 02, 2019",
      "content": "<div>If you're interested in F /WM /Rogue builds, you could do a lot worse than having a look at Maximilian Kane's <strong>Drow Fencer</strong> (Fighter 14/ Rogue 19/ WM 7) in the Full Epic forum. It is a high AC (with Epic Dodge), high AB Dexer that has both WS and EWS to help with damage.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:55 PM - Mar 02, 2019",
      "content": "<div>For hitters Arcane archers get the best AB in the game.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "11:59 PM - Mar 02, 2019",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote:</cite>For hitters Arcane archers get the best AB in the game.</div></blockquote>If you can get a +20 bow. But they can be lousy to solo.<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:19 AM - Mar 03, 2019",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote:</cite>\nFor hitters Arcane archers get the best AB in the game.\n</div></blockquote>\n\nThat's an absolutely fine point - as is Grim's. Now, I think we've stumbled into this one before - and only a few weeks back. It would appear that BSK requires party play - gods forfend! Thus, you need a hitter and a tank as minimum. The hitter can be arcane, rather then mundane (one could argue that AA is both, but that's neither here nor there). Now, if you're taking two, why not bring along a cleric or bard to help everyone. You see where I'm going with this? Full party - yeah! (Maybe it's because I'm having to play Dragon Age or Baldur's again atm that's having this effect...)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "8:15 AM - Mar 03, 2019",
      "content": "<div><blockquote><div><cite>phmah2408 wrote:</cite>\nCornflowers, you mentioned\n<blockquote><div>Hitter - Fighter/Weaponmaster/Rogue with AB50+ (DEX-based WM is good according to what I've heard, I haven't tried it myself, I hate rapiers)</div></blockquote>\nDoes it still hit hard with a dex based WM? How high the AC can get? Anyone can do a built on this one? Ohhh cornflowers also mentioned sneaker or dex based built aren't going to work for end bosses? Thanks!\n</div></blockquote>\nWell.... Since your hit is based on STR bonus, obviously a dex-based WM will not make the same damage per hit as a str-based WM. Still, the dex-based WM will hit more often which should be good. On BSK (Blackstone Keep) it doesn't work that way since most monsters have massive Damage Resistance and immunities, not to mention some 10.000 hitpoints on end-game bosses. So, if you for instance make a monk which can get huge AC and decent AB but won't make much damage, you will pretty much spend all your time watching a fight between your toon and the boss where nobody can damage the other. That's why on BSK, most people build their WM:s on an str-based fighter.</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "8:18 AM - Mar 03, 2019",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>\n<blockquote><div><cite>Mick Dagger wrote:</cite>\nFor hitters Arcane archers get the best AB in the game.\n</div></blockquote>\n\nThat's an absolutely fine point - as is Grim's. Now, I think we've stumbled into this one before - and only a few weeks back. It would appear that BSK requires party play - gods forfend! Thus, you need a hitter and a tank as minimum. The hitter can be arcane, rather then mundane (one could argue that AA is both, but that's neither here nor there). Now, if you're taking two, why not bring along a cleric or bard to help everyone. You see where I'm going with this? Full party - yeah! (Maybe it's because I'm having to play Dragon Age or Baldur's again atm that's having this effect...)\n</div></blockquote>\nBSK is intentionally set up and maintained so that the final two quests and the 5 (or so) high-end areas require a party. In one case (the one which only opens twice a day), there are even switches far away from each other that needs to be switched simultaneously to open a door. So, in that case it's technically impossible to solo that area. You can't use the teleporting thingy to jump in or out of there either, so you HAVE to be a party.</div>"
    },
    {
      "author": "phmah2408",
      "avatar": "10758847_1515693635.jpg",
      "timestamp": "4:18 PM - Mar 03, 2019",
      "content": "<div>I am going to have a big problem here. Can’t commit to a party due to my little 9 months baby routine. Play when he is asleep and got to attend to him when he suddenly wakes up. Sigh... my party wouldn’t like me when it happens.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:48 PM - Mar 03, 2019",
      "content": "<div>Well, first and most importantly - congratulations on your baby! <span class=\"text-emoji\">🎂</span> <br/>\n<br/>\nSecondly, there's plenty of other stuff - be it modules or PWs - to keep you going until he gets into his routine (when he's about 10 <span class=\"text-emoji\">😉</span>). I'm sure you'll be able to get involved more then.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:33 AM - Mar 04, 2019",
      "content": "<div>It sounds like what you need is single-player.  Fear not, for there are many good single-player modules and campaigns to play.<br/>\n<br/>\nAs a follow-up for the OC, Aribeth's Redemption is a love story between your PC and Aribeth, and so it requires you to be Human, Elf, or Half-Elf, male, and non-evil (the closer to lawful-Good the better, but Chaotic Good works).  After a rather wordy beginning, there is plenty of hack-and slash to enjoy.  It will bring you to about level 26.<br/>\n<br/>\nAnother good follow-up for the OC is Mines of Twin Summit, which works for any race, gender, and alignment, and it takes you all the way to level 40.<br/>\n<br/>\nA follow-up for HotU for evil characters is The Gods Themselves, but it is much shorter than my next suggestion, the Sands of Fate, which is for non-evil characters and takes you all the way form the end of HotU to level 40.<br/>\n<br/>\nIf you haven't already, you owe it to yourself to play The Aielund Saga, which takes you from level 1 to level 36.  Everyone will reccomend that one to you, for good reason.<br/>\n<br/>\nThe Lord of Terror is a fun conversion of Diablo, which brings you from level 1 to about level 27.<br/>\n<br/>\nThe Eye of the Beholder is a conversion of a classic PnP campaign that takes you from level 2 (it will level you to 2 if needed) to level 23 or so.<br/>\n<br/>\nI don't remember what level you reach in the Adam Miller campaign or Saleron's Gambit, but they are each definitely pre-epic, and they each start at level 1.<br/>\n<br/>\nI have played each of these multiple times with different builds, with more still planned.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:55 AM - Mar 04, 2019",
      "content": "<div>I've also heard good things about Honor Among Thieves and Snow Hunt if you like rogue-type characters. Likewise, Crimson Tides of Tethyr gets good reviews.<br/>\n<br/>\nThen there's Swordflight, which now takes you up to about level 33 with the release of part 4, and is reckoned excellent and challenging. And I believe World of Greyhawk is available as a single player module (Max has a thread about it in the general discussion forum).<br/>\n<br/>\nAll in all, plenty to keep you occupied!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "phmah2408",
      "avatar": "10758847_1515693635.jpg",
      "timestamp": "11:01 PM - Mar 06, 2019",
      "content": "<div><blockquote><div><cite>Cornflower wrote:</cite>\n<blockquote><div><cite>phmah2408 wrote:</cite>\nCornflowers, you mentioned\n<blockquote><div>Hitter - Fighter/Weaponmaster/Rogue with AB50+ (DEX-based WM is good according to what I've heard, I haven't tried it myself, I hate rapiers)</div></blockquote>\nDoes it still hit hard with a dex based WM? How high the AC can get? Anyone can do a built on this one? Ohhh cornflowers also mentioned sneaker or dex based built aren't going to work for end bosses? Thanks!\n</div></blockquote>\nWell.... Since your hit is based on STR bonus, obviously a dex-based WM will not make the same damage per hit as a str-based WM. Still, the dex-based WM will hit more often which should be good. On BSK (Blackstone Keep) it doesn't work that way since most monsters have massive Damage Resistance and immunities, not to mention some 10.000 hitpoints on end-game bosses. So, if you for instance make a monk which can get huge AC and decent AB but won't make much damage, you will pretty much spend all your time watching a fight between your toon and the boss where nobody can damage the other. That's why on BSK, most people build their WM:s on an str-based fighter.\n</div></blockquote>\n\nHmmm...cornflowers, do you mean Dex-based WM is better than Str-based for BSK environment? Hit more often but lesser damage since it is dex based. Does it mean that it's going to take a longer time to finish up the boss??</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "12:35 AM - Mar 07, 2019",
      "content": "<div>If he only there to be a hitter, why DEX? I don't get it. If the boss will hit you no matter, then just go hitting power. 2h Scyther, or Greatsword perhaps.<br/>\n<br/>\nA Half-Orc Weapon master with +12 to STR  and +20 AB on his weapon will have 80 AB.  Sprinkle with CurseSong, Battletide and maybe even Taunt and your talking -12 AC. Unless he is just stupid AC wise, you'll rack upp damage in the thousands quite quickly. Fighter8/TumbleClass4/Weapon Master28. I need to use the CBC to calculate all the damage and such, but I built and played this guy. Crit with 16+/x5 sets it's mark for sure. <br/>\n<br/>\nWith a tank, say Bard14/DwD26 or maybe Bard16/DwD22/Fighter2 stick Curse song in there and there should be possibilities. Not sure how well you would fare with end-boss specialists tho.<br/>\n<br/>\nConsider Dragon? If boss can penetrate DR 40/+6 you can add DwD to it. Like Druid18/Monk4/DwD18. That would give you close to 1000 hp, DR 21/- and AC well into the 80ies.<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "2:33 PM - Mar 07, 2019",
      "content": "<div><blockquote><div><cite>phmah2408 wrote:</cite>\n<blockquote><div><cite>Cornflower wrote:</cite>\n<blockquote><div><cite>phmah2408 wrote:</cite>\nCornflowers, you mentioned<br/>\n<br/>\nDoes it still hit hard with a dex based WM? How high the AC can get? Anyone can do a built on this one? Ohhh cornflowers also mentioned sneaker or dex based built aren't going to work for end bosses? Thanks!\n</div></blockquote>\nWell.... Since your hit is based on STR bonus, obviously a dex-based WM will not make the same damage per hit as a str-based WM. Still, the dex-based WM will hit more often which should be good. On BSK (Blackstone Keep) it doesn't work that way since most monsters have massive Damage Resistance and immunities, not to mention some 10.000 hitpoints on end-game bosses. So, if you for instance make a monk which can get huge AC and decent AB but won't make much damage, you will pretty much spend all your time watching a fight between your toon and the boss where nobody can damage the other. That's why on BSK, most people build their WM:s on an str-based fighter.\n</div></blockquote>\n\nHmmm...cornflowers, do you mean Dex-based WM is better than Str-based for BSK environment? Hit more often but lesser damage since it is dex based. Does it mean that it's going to take a longer time to finish up the boss??\n</div></blockquote>\nNo, I wasn't clear. If you go dex-based, you will spend hours and hours watching a fight where nobody will hit each other. Go STR-based on BSK.</div>"
    },
    {
      "author": "phmah2408",
      "avatar": "10758847_1515693635.jpg",
      "timestamp": "8:46 PM - Mar 07, 2019",
      "content": "<div>Ok how about highest AB possible on WM? Any built?</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "8:50 PM - Mar 07, 2019",
      "content": "<div><blockquote><div><cite>phmah2408 wrote:</cite>Ok how about highest AB possible on WM? Any built?</div></blockquote>For a STR based it's 54 naked. The one I mention above. It's the highest unbuffed STR AB possible in NWN. For your environment with a +20 to hit, it's top STR based. <br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "phmah2408",
      "avatar": "10758847_1515693635.jpg",
      "timestamp": "8:53 PM - Mar 07, 2019",
      "content": "<div><blockquote><div><cite>Grimnir wrote:</cite>\n<blockquote><div><cite>phmah2408 wrote:</cite>Ok how about highest AB possible on WM? Any built?</div></blockquote>\nFor a STR based it's 54 naked. The one I mention above. It's the highest unbuffed STR AB possible in NWN. For your environment with a +20 to hit, it's top STR based. <br/>\n<br/>\nSent fra min SM-G950F via Tapatalk\n</div></blockquote>\nThanks Grimnir, do you have the details on the built? lvl 1 to 40? Thanks again!</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "8:57 PM - Mar 07, 2019",
      "content": "<div><blockquote><div><cite>phmah2408 wrote:</cite>\nGrimnir:\n<blockquote><div><cite>phmah2408 wrote:</cite>Ok how about highest AB possible on WM? Any built?</div></blockquote>\nFor a STR based it's 54 naked. The one I mention above. It's the highest unbuffed STR AB possible in NWN. For your environment with a +20 to hit, it's top STR based. <br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\nThanks Grimnir, do you have the details on the built? lvl 1 to 40? Thanks again!\n</div></blockquote>\n\nIt's in the old archive. But I was wrong above, it doesn't include Tumble Class. I think it is actually F6/CoT6/WM28.<br/>\n<br/>\nSearch Fighter/WM and look for my name. I think it's the King of Norse Legends.<br/>\n<br/>\n*EDIT*<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build215866.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 15866.html</a><br/>\nThere you go. Forget the hammer feats and go for Dev Crit. It can work with any weapon. Scimitar or Hammer for a 1hander, or a 2H weapon, preferably scythe or greataxe.</div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "8:39 AM - Mar 08, 2019",
      "content": "<div>Builds, adapted for Blackstone:<br/>\n<a class=\"postlink\" href=\"https://blackstonekeep.com/viewforum.php?f=25\" rel=\"noreferrer\" target=\"_blank\">https://blackstonekeep.com/viewforum.php?f=25</a></div>"
    },
    {
      "author": "Cornflower",
      "avatar": "10759006_1545641562.jpg",
      "timestamp": "8:45 AM - Mar 08, 2019",
      "content": "<div><blockquote><div><cite>Grimnir wrote:</cite>\n<blockquote><div><cite>phmah2408 wrote:</cite>\nGrimnir:\n<blockquote><div><cite>phmah2408 wrote:</cite>Ok how about highest AB possible on WM? Any built?</div></blockquote>\nFor a STR based it's 54 naked. The one I mention above. It's the highest unbuffed STR AB possible in NWN. For your environment with a +20 to hit, it's top STR based. <br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\nThanks Grimnir, do you have the details on the built? lvl 1 to 40? Thanks again!\n</div></blockquote>\n\nIt's in the old archive. But I was wrong above, it doesn't include Tumble Class. I think it is actually F6/CoT6/WM28.<br/>\n<br/>\nSearch Fighter/WM and look for my name. I think it's the King of Norse Legends.<br/>\n<br/>\n*EDIT*<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build215866.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 15866.html</a><br/>\nThere you go. Forget the hammer feats and go for Dev Crit. It can work with any weapon. Scimitar or Hammer for a 1hander, or a 2H weapon, preferably scythe or greataxe.\n</div></blockquote>\n\nChecked out that build. Why CoT levels? The DR is negligible (sp?). Divine wrath is once per day, so not much there either. I'm probably missing something relevant, though....</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "9:10 AM - Mar 08, 2019",
      "content": "<div><br/>\n<blockquote><div><cite>Cornflower wrote:</cite>\n<br/>\n<br/>\nChecked out that build. Why CoT levels? The DR is negligible (sp?). Divine wrath is once per day, so not much there either. I'm probably missing something relevant, though....</div></blockquote>\n\nWell, no tumble class if you want max AB. That's the only reason. CoT give you the same as Fighter would, but better saves for no cost. In most settings though, sprinkle in a few Rogue or Bard instead. You lose 1 Ab, and saves, but thats it.<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    }
  ]
}