{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "286",
  "name": "Lionheart (Wildwood Crusader-Paladin) Pal24 Ranger10 CoT6",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/lionheart-wildwood-crusader-paladin-pal24-ranger10-t2297873.html",
  "author": "TyrTemplar",
  "avatar": "no_avatar.png",
  "replies": "0",
  "views": "2.1K",
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "2:31 PM - Nov 15, 2012",
      "content": "<div>Slashing and Avenging with the Roar of a Lion PvP and PvM (1-40)<br/>\n<br/>\n<strong>LIONHEART (Wildwood Crusader)</strong><br/>\n<strong>By Tyr Templar*</strong>\n<blockquote><div>\n<strong>Author’s Note:</strong> This build, Lionheart (Wildwood Crusader) is one of several characters in my \"Tales of Robin Hood (Wildwood)\" series which I kicked off in 2007; a number of members worked with me on various characters throughout the series, with Lionheart in particular being co-authored by myself, Grimnir77 and Tattoed Monk, and first making its debut in the ECB on June 18, 2007. All characters are being revisited in light of the patch, with Friar Tuck, which was built at the time but never did get around to making its debut (on account of NWN2 among other things), finally coming out from my stable and into the Wildwoods so as to join the series proper. <br/>\n<br/>\nWhat follows is Lionheart, the Wildwood Crusader, whom I have taken the liberty to break up into two variants (on account of the changes to the holy sword): the first being an epic Ranger with two-weapon foci bolstered by Paladin’s DM/DS, etc. (King and Military leader going off to battle and the Crusades) the other sees Lionheart as a classic Crusader/epic Paladin(military) bolstered by Ranger Dual-Wield (returning from the field and restoring his throne). Either way, Ranger / Paladin makes for a deadly er Just and Divine combination, such that those who dare stand and plot against HIS England quite simply do not succeed, and just don’t live that long. This build is the Epic Paladin Version (to see the Epic Ranger version with links therein also to the original build, click: <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/lionheart-wildwood-crusader-ranger-pal4-ranger26-cot10-t2297872.html#p20339770\" rel=\"noreferrer\" target=\"_blank\">lionheart-wildwood-crusader-ranger-pal4-ranger26-cot10-t2297872.html#p20339770</a> ). Without any further ado, please meet:</div></blockquote>\n<br/>\n<strong><br/>\nLIONHEART (Wildwood Crusader)</strong><br/>\n<br/>\n<strong>Concept: The King who Roared</strong><br/>\nLionheart, being Richard I (or King Richard), a noble knight and gallant soldier, and rightful ruler of England who was also a crusader; he left his kingdom temporarily in the care of his relative, John (Sorcerer King, Wildwood Prince, placeholder ) while he sought answers and justice to alleged crimes committed abroad, meanwhile leaving his own kingdom open to crimes committed against his subjects by John and his own system of Sheriffs (and especially the Sheriff of Nottingham, Wildwood Tyrant, placeholder ). <br/>\n<br/>\nControversial yet charming, Lionheart endured much back-stabbing and constant threats, which he faced with the pride and persistence of a lion. He also enjoyed many an exciting adventure, was extremely well educated, and able to converse in many languages, but his true passion was that of a soldier, excelling in military matters from a very young age; his main concern at all times was that of his kingdom’s national security (and thus the comfort of his subjects), which was constantly under threat from foreign powers. For the people, then, Lionheart endured much personal hardship, including being kidnapped and held against his will by foreign powers. He had loyal supporters such as Robin Hood (as a “true-to-life” plate-wearing knight, in Wildwood Warrior: placeholder , or in accordance with the tales, as an archer, in the Wildwood Outlaw: placeholder ) and his merry band of the woods (including Friar Tuck, the Wildwood Monk: placeholder, Alan A. Dale, the Wildwood Minstrel: placeholder, Will Scarlett, the Wildwood Mercenary: placeholder), Little John, Wildwood Lieutenant: placeholder, and last but by no means least, the famous Lady Marian, a high borne intelligent noble who cared deeply about her people (Wildwood Maiden, placeholder). <br/>\n<br/>\nLionheart was able to escape his ordeal, no worse for the wear, being bent and determined on nothing more than returning to his throne and rescuing his kingdom from the evil forces who had taken over during his absence. England, he vowed, would be freed from her nightmare, and her enemies--including and especially Prince John “the Usurper,” in: Sorcerer King, Wildwood Prince: placeholder, and the Sheriff of Nottingham, as the Wildwood Tyrant: placeholder -- would suffer the full extent of his divine wrath. He was, after all, Lionheart, and his enemies would hear him roar. <br/>\n<strong><br/>\nLionheart, Wildwood Crusader (Epic Paladin version),<br/>\nPaladin(24), Ranger(10), Champion of Torm(6)</strong><br/>\n<br/>\n<strong>I. Attributes:</strong><br/>\nSTR: 16 (32)<br/>\nDEX: 8<br/>\nCON: 10<br/>\nWIS: 14<br/>\nINT: 10<br/>\nCHA: 16<br/>\n<br/>\nHuman, LG<br/>\n<br/>\n<strong>II. Level Guide:</strong><br/>\n01: Ranger(1): weapon proficiency exotic, power attack, favored enemy I, {Dual Wield}<br/>\n02: Ranger(2)<br/>\n03: Ranger(3): weapon focus: scimitar*<br/>\n04: Ranger(4): STR+1, (STR=17)<br/>\n05: Ranger(5): favored enemy II<br/>\n06: Paladin(1): knockdown<br/>\n07: Paladin(2): {Smite Evil}<br/>\n08: Champion of Torm(1): STR+1, (STR=18)<br/>\n09: Paladin(3): divine shield<br/>\n10: Champion of Torm(2): blind fight<br/>\n11: Champion of Torm(3)<br/>\n12: Paladin(4): STR+1, divine might, (STR=19)<br/>\n13: Champion of Torm(4): improved critical: scimitar<br/>\n14: Champion of Torm(5)<br/>\n15: Ranger(6): weapon focus: dire mace*<br/>\n16: Ranger(7): STR+1, (STR=20)<br/>\n17: Ranger(8)<br/>\n18: Ranger(9): improved critical: dire mace, {Improved Two-Weapon Fighting}<br/>\n19: Paladin(5)<br/>\n20: Paladin(6): STR+1, (STR=21)<br/>\n21: Champion of Torm(6): epic weapon focus: scimitar, epic weapon focus: dire mace.<br/>\n22: Paladin(7)<br/>\n23: Paladin(8)<br/>\n24: Paladin(9): STR+1, great strength I, (STR=23)<br/>\n25: Paladin(10)<br/>\n26: Paladin(11)<br/>\n27: Paladin(12): great strength II, (STR=24)<br/>\n28: Paladin(13): STR+1, (STR=25)<br/>\n29: Paladin(14)<br/>\n30: Paladin(15): great strength III, (STR=26)<br/>\n31: Paladin(16)<br/>\n32: Paladin(17): STR+1, (STR=27)<br/>\n33: Paladin(18): great strength IV, (STR=28)<br/>\n34: Paladin(19)<br/>\n35: Paladin(20)<br/>\n36: Paladin(21): STR+1, great strength V, (STR=30)<br/>\n37: Paladin(22)<br/>\n38: Paladin(23): armor skin<br/>\n39: Paladin(24): great strength VI, (STR=31)<br/>\n40: Ranger(10): STR+1, epic prowess, (STR=32)<br/>\n<blockquote><div>\n<strong>* Weapon Note:</strong> in this version of Lionheart (EPIC Paladin version), I selected scimitar and double mace since thirst is not an issue here (Paladin buffs instead, and loads of them, along with STR etc. of course, with each and all of them multiplying beautifully on a crit, hence the scimmy, medium-sized weapon enabling use of the big board (and plate, too), i.e. AC). Although the scimmy’s not necessarily “period correct” (being a weapon derived from the Far East), Richard was an avid traveler, the Crusades, battles and military affairs saw him travel and “adventure” to far-flung places on the globe, and while bastard sword was for knights the weapon of choice, Richard was a highly trained “soldier” / military leader, and would thus have come into contact with a variety of different weapons from all over the place during his military pursuits and travels. In terms of the dire mace, large double-bladed (dual wield) weapon delivering bludgeoning damage, thus enabling different damage types in turn. <br/>\n<br/>\nThat said, players are of course free to switch out to the bastard sword or otherwise, if desired.</div></blockquote>\n<strong>FE Note:</strong> Lionheart was concerned about Assassins and spies, and with good reason (he wound up being kidnapped!), which connotes Halflings and Elves (listen bonus v FEs, etc), but a good choice always for PvP is humans and dwarves. In terms of PvM/E, might I suggest sneak/crit immune (Undeads and Constructs), or otherwise as you prefer. <br/>\n<br/>\n--<br/>\n<strong><br/>\nIII. Basics:</strong><br/>\na. Hitpoints: 400 (408)<br/>\n<br/>\nb. Saving Throws (Buffed) [v Spells]<br/>\nFort: 31 (42) [45] <br/>\nWill: 24 (35) [38]<br/>\nReflex: 24 (35) [38] +2 Ranger Cat’s<br/>\n<br/>\nPaladin Immunities, spells (fear, disease, mind-spells, death magic, paralysis, slow, entanglement, Etc.)<br/>\nOther: Ranger Spells; Divine Grace (enhance with Charisma).<br/>\n<br/>\n(+1 Resistance, +1 Prayer, +4 Aura/Eagles', +2 Protection v Alignment, +3 Divine Wrath).<br/>\n<br/>\n<strong>IV. Combat Vitals:</strong><br/>\n<br/>\na. Attack Bonus:<br/>\nBAB: 30, AB (naked): 45 (melee), +3 Smite: 48 (-2 dual wield)<br/>\nSelf-Buffed AB: 63 (melee), +7 Smite (Aura/Eagle’s): 70 (-2 dual wield)<br/>\n<br/>\n[+2 Bull’s Str, +5 Divine Favor, +1 Prayer, +1 Bless, +1 Aid, +3 Divine Wrath, +5 GMW (or Holy Sword)]<br/>\n<br/>\nb. Damage:<br/>\n<br/>\n* i) Mundane Scimitar (Medium; Slashing Damage): <br/>\n1-6+11, +3 FE, +5 PA*, +30 Smite (crit: 15-20/x2)<br/>\n<br/>\nSelf-Buffed Damage: <br/>\n1-6+19, +3 FE, +5 Magic, +3 Sonic, +10 Divine, +1d6 Evil, +2d6 Undead, +5 PA*, +30 Smite (crit: 15-20/x2)](keen: 12-20/x2) <br/>\n<br/>\n<br/>\n* ii) Mundane Dire Mace (Large/Double-Sided; Bludgeoning Damage): <br/>\nMain-Hand: 1-8+11, +3 FE, +5 PA*, +30 Smite (crit: 19-20/x2)    <br/>\nOff-Hand: 1-8+5, +3 FE, +5 PA* (crit: 19-20/x2)<br/>\n<br/>\nSelf-Buffed Damage:<br/>\nMain-Hand (4 apr / 5 apr hasted):<br/>\n1-8+19, +3 FE, +5 Magic, +3 Sonic, +10 Divine, +1d6 Evil, +2d6 Divine Undead, +5 PA, +30 Smite (crit: 19-20/x2) <br/>\n<br/>\nOff-Hand (2 apr): <br/>\n1-8+12, +3 FE, +5 Magic, +3 Sonic, +10 Divine, +1d6 Evil, +2d6 Divine Undead, +5 PA* (crit: 19-20/x2)<br/>\n<br/>\nWhat? An evil sorcerer with epic warding or something  oppressing your people and doesn’t want to give you back your throne? <br/>\n<br/>\nNote: PA Mode (-5 ab) adds +5 damage (scimitar)/+10 damage (dire mace).<br/>\nOther: Ranger Spells; Paladin Spells; DM (enhance with Charisma); Lay-on-Hands (Self-Healing; Undead Harming); Turn Undead<br/>\n<br/>\n[+2 Bull’s, +5 Div.Favor (Magic), +1 Prayer, +3 Deafening Clang (Sonic/Thunderstone), +5 and 1d6 Evil Holy Sword (+5 GMW), +3 Div.Wrath (Divine), +7 Div.Might (Aura/Eagle’s; Divine), +2d6 Undead (Divine)]<br/>\n<br/>\n<br/>\n<strong>V. Defense Vitals:</strong><br/>\nAC (naked): 15<br/>\nSword/Board: AC 15, +8 Plate, +3 Tower: 26, +1 Prayer, +2 Cat’s, +2 PoA, +7 DS (Aura/Eagle’s): 38<br/>\nDual-Wielding/Light Armor: AC 15, +3 Studded Leather: 18, +1 Prayer, +2 Cat’s, +2 PoA, +7 DS: 30 AC<br/>\n<br/>\nOther: Ranger Spells; Paladin Spells; DS (enhance with Charisma)<br/>\n<br/>\n<strong>VI. Spell Casting:</strong> Ranger(2),Paladin(4)<br/>\n<br/>\n<strong>VII. Skillpoints:</strong> 155*<br/>\nDiscipline 42(53,+Prayer, Bull's: 56), Listen 43(45, +2 Prayer: 47, +3 FEs; Ultravision; Dispel; etc.), Spellcraft 15(15), Tumble 20(19)<br/>\n<br/>\n* Players should feel free to adjust their Lionheart to suit their own needs/environs, as always.<br/>\n<br/>\n--<br/>\n<br/>\n<strong>Series Note</strong>: STAY TUNED, Robin Hood Fans.</div>"
    }
  ]
}