{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "504",
  "name": "Arelith Build-Sorcerer/Paladin",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-build-sorcerer-paladin-t515434.html",
  "author": "CinnamonBear123",
  "avatar": "no_avatar.png",
  "replies": 9,
  "posts": [
    {
      "author": "CinnamonBear123",
      "avatar": "no_avatar.png",
      "timestamp": "4:57 PM - Sep 01, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Alright, so I've heard alot of good things about Sorcy/Pally and I need help creating one. I have no clue what abilities, feats, skills, etc. to take. /:.<br/>\nSo, help is appreciated. Thanks.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "2:18 AM - Sep 02, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Vague!  LOL<br/>\n<br/>\nSorc/pal has Charisma synergistically, but aside from that, they really are a specialist build so they require you to have some knowledge about what you want to do with the build.<br/>\n<br/>\nWhat do I mean?<br/>\n<br/>\nWell, a paladin is MELEE based.  Sorcs are CASTERS.  For every level a sorc ISNT a sorc, they are not as good as a pure sorc!  Obvious, but important.  Paladins have a nice class feat granting charisma bonus to saves.  In order to make a \"spellsword\" (caster with melee capability), you need 26-32 levels of sorc, imo.  I know some have gotten away with less, but it is a preference thing.  When you level this sort of character to lv 20, you either gimp the AB by taking more Sorc levls OR you gimp the spell casting early on (when the low level spells are most useful).  <br/>\n<br/>\nBasically, you have to decide, Do you want a caster or melee?  From your other post, you say you want Melee!  If you are new to the game (assumed, since there isnt much to go on in your post), the BEST melee caster is CLERIC.  I had a cleric guide on the old forums, not sure if it was transfered here or not.  If you truly want an arcane caster fighter, then maybe a Wizard/fighter is better to start with.  <br/>\n<br/>\nAnother reason I mention cleric and the others is, you put in the other post you dont want rdd.  The ONLY real reason to make a Paladin Sorc is for RDD10!  The idea then would be pal 15/rdd10/sorc15 sort of thing, though more pal would be much better (20/10/10).  <br/>\n<br/>\nWhen you think on it, let us know.  Maybe someone who is less \"rusty\" than I can throw one up for you!  (I could, but i may have forgotten a thing or 2 since I havent built in 2 years).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:43 AM - Sep 02, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=7&amp;t=102\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.44.forumer.com/viewt ... ?f=7&amp;t=102</a>The Spellsword of Bahamut<br/>\n<br/>\nthe above build already exists and takes advantage of the sor/pal combo to create a spellsword, take a look at it see if thats what you want.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CinnamonBear123",
      "avatar": "no_avatar.png",
      "timestamp": "5:11 AM - Sep 03, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Can't use that on arelith, due to yiu msut start with three levels in one class, and RDD requireing some certain requirements that I can't meet.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "6:49 PM - Sep 09, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Then please post all the pertinent info so that fellow guild members can help you with aimed suggestions.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=10&amp;t=138\" rel=\"noreferrer\" target=\"_blank\">Build request guidelines</a>.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:48 PM - Sep 10, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>CinnamonBear123 wrote:</strong>Can't use that on arelith, due to yiu msut start with three levels in one class, and RDD requireing some certain requirements that I can't meet. </div></blockquote>\n\nSo you need to make clear what these requirements are and make sure that you can't attain them by tweaking the aforementioned build. Otherwise, we will be just blindly guessing builds, and that is no fun at all.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "5:33 PM - Sep 10, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong>So you need to make clear what these requirements are and make sure that you can't attain them by tweaking the aforementioned build. Otherwise, we will be just blindly guessing builds, and that is no fun at all.<br/>\n</div></blockquote>\n\nWHAT?  Blindly guessing is what ECB has ALWAYS been about, despite my best efforts to edumicate!  We have ALWAYS had people say \"Want best melee build,\" \"want best AB build\",  or my personal favorite, \"Want the best build ever\"!  People think its all in the build!  WRONG!  It is \"WHAT DO I LIKE TO PLAY?  WHAT STYLE OF PLAY DO I REALLY ENJOY PLAYING?\"  When I did my cleric/hospi/heiro build on my old server, I knew EXACTLY how to play it.  I even walked a dude through a tutorial IN GAME showing him the most efficient way to use it.  Later he told me the character was strong, but he kept dying at places where he shouldnt have!  I designed him to solo a server that was based on GROUP EFFORT (meaning, the areas typically required 3 or more to venture to some areas).  I spent literally 2 weeks camped in an area that most HATED because of the difficulty, and I dont think my guy got hit one time, solo.  <br/>\n<br/>\nWe can give the BEST build in the world (for us), but if the player cant play it, it is meaningless.  I have always asked that requests come with some thought from the requesters side.  Think a bit, not on how to build the character, but WHAT DO YOU WANT TO ACCOMPLISH!  You may want a high AB build, but the answer to your question may mean that you NEED a base ab of 25 (meaning not high, or 3apr), yet, will have an overall consistantly higher AB (dont ask).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:19 PM - Sep 10, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's like sitting down in a restaurant and telling the waitress \"I want eggs.\".  Then when she brings you a plate of sunny-side-up, you send it back because you really wanted a Denver omelet.  If she continues to bring every possible egg-ish recipe in the joint and sets it down in front of you, the right order may eventually show up on the table.  Seems like making a production of something that should be pretty straight-forward. *sigh*<br/>\n<br/>\nWhat kind of eggs can the ECB cook up for you today?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "11:24 PM - Sep 10, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong>It's like sitting down in a restaurant and telling the waitress \"I want eggs.\".  Then when she brings you a plate of sunny-side-up, you send it back because you really wanted a Denver omelet.  If she continues to bring every possible egg-ish recipe in the joint and sets it down in front of you, the right order may eventually show up on the table.  Seems like making a production of something that should be pretty straight-forward. *sigh*<br/>\n<br/>\nWhat kind of eggs can the ECB cook up for you today? </div></blockquote>\nLOL  And after reading these sort of posts since 2004, I am the grumpy old waitress that says, \"Eggs!  What kind of eggs do you want, cuz I will bring you the special, which are snail eggs!\"  <br/>\n<br/>\nThere has always been the spoon feeders who support this sort of triviality.  You are not teaching anything.  You become a slot machine.   I have never understood why other builders would go about designing a build for someone without getting that person involved in the process.  There was one dude who would request 10 builds PER WEEK!  He did that for YEARS!  And people kept just putting up builds!  The dude never learned and was not appreciative (I never ONCE saw a thank you from him) and is probably still annoying people with his stupidity!  <br/>\n<br/>\nI was embarrased to NOT know what I was talking about (though I did ask questions).  To this day, I could care less about the math of it all (something that Maxi realy seems to love).  But I know building mechanics cold.  I have never used a program, nor would know how if I had one.  I can put a build together faster on paper (faster than me doing it on the computer).  I have spent countless hours in leveler mods to tweak builds, so much time, that now, I just tweak in my head.  Players dont have to know that much!  What they do HAVE to know is : WHAT DO I WANT TO PLAY?  or, WHAT PLAY STYLE DO I REALLY LOVE TO PLAY?  Caster? melee? ranged? spellsword?  sneaker?  woodpecker? (the last is a serious joke).<br/>\n<br/>\nSorry about the rant...  I just noticed a bunch of posts requesting info and none given by OP.  To that, I suggest load up a cleric and work to get 19 wisdom and as high str as you can figure out.  Then you will have a caster fighter par excellant!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Atypical",
      "avatar": "no_avatar.png",
      "timestamp": "7:15 AM - Oct 14, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just chiming in with the Arelith limitations to clear things up, as the build interests me as well.<br/>\n<br/>\nSpecific spell changes on the server are too numerous to type out, so <a class=\"postlink\" href=\"http://arelith.com/ph_magic.html\" rel=\"noreferrer\" target=\"_blank\">here is a link</a> to the page.<br/>\n<br/>\nSome specific changes that would affect this build are: no stacking weapon buffs (GMW + Keen + Holy Sword etc) and Darkfire, Flame Weapon, and GMW have been nerfed in damage / duration. All Bigby's spells have a reflex save (except Clenched Fist, which already had a Fort save) so you can't rely on them for no-save damage. Epic Spell focus in different schools provides a custom spell (-ward for Abjuration places a ward on the ground that acts as a Mass Hold Person spell, for instance) and some have been changed to give them other uses (Abjuration feat gives a bonus to dispel checks, Conjuration feat gives you buffed summons, etc) All casters can take Spell Focus feats.<br/>\n<br/>\nArelith is a level 30 server. You must take at least three consecutive levels in your base class before multi-classing and a minimum of three levels in any additional classes before returning to your base class or selecting a third class--which means no taking 1 token level in a class at 30 for a skill dump unless you took 3 levels in it earlier. Some prestige classes (RDD, Shifter) have difficult requirements, so very few people will be able to take levels in them. Shadowdancers do not get HIPS, though they get buffs to Shadow Evade and Hide / MS. <a class=\"postlink\" href=\"http://arelith.com/players_handbook.html#class\" rel=\"noreferrer\" target=\"_blank\">(link to class changes)</a><br/>\n<br/>\nIt's also a low-magic server, where you're very lucky if you find a +3 item. And it's a fairly slow-leveling server, so builds must be playable at low levels.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}