{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "020",
  "name": "The Holy Class: A Guide to Paladins",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-holy-class-a-guide-to-paladins-t515492.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": 14,
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:29 PM - Sep 21, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hail, mighty ECBers! <br/>\n<br/>\nI am bored out of my mind at work, so I thought I could use up the extensive free time my work gives me to write down a quick (according to my standards) guide to the Paladin class. My aim here is to explain the most useful class features and ways to use this class in a build, which are many. I hope I manage to cover all angles on this one, but we'll see. The only heavy restriction to combining Paladin in a build is, as Hip calls it, the Reinforced Steel Concrete Alignment (Lawful Good only), which makes you have to shift alignments if you are to combine them with Bard, Barbarian, Assassin, Blackguard, Druid and Pale Master. <br/>\n<br/>\nPALADIN CLASS FEATURES<br/>\n<br/>\nPaladins get many interesting bonus class features automatically and gain access to some nearly exclusive feats to be taken in general levels. They also have many very good offensive Clerical buffs and a few defensive ones (none that give meaningful AC, though, just immunities). Compared to Rangers, which are the other melee class with a few spells, the Paladin's spells are MUCH MORE USEFUL. I will discuss the automatic class features first, and then move on from there:<br/>\n<br/>\nAUTOMATIC CLASS FEATURES:<br/>\n<br/>\nLevel 1:<br/>\n<br/>\n- Divine Health: You are immune to disease. I guess that's OK, but certainly among the least useful features. Fits the stereotype of a Holy warrior, since some undead have Disease attacks.<br/>\n<br/>\n- Divine Grace: You add your CHA modifier to your saving throws. This feat is one of the trademarks of the class. It's very good, especially for high-charisma builds, like near-pure Sorcerers. Even if you're not focused on Charisma, as long as you can get Charisma-enhancing gear, you will benefit greatly from this. Negative modifiers won't be subtracted from your saves.<br/>\n<br/>\n- Lay on Hands: Once per day you can heal yourself. The number of HP healed is Class Level x CHA modifier, so if you have many pally levels, this feat is good, otherwise it's not. <br/>\n<br/>\nLevel 2:<br/>\n<br/>\n- Aura of Courage: You are immune to fear, which is great for a melee-based toon, as Will is their weakest save.<br/>\n<br/>\n- Smite Evil: A once-per-day attack (three times if you get the Extra Smiting feat) to which you add your CHA modifier to the attack roll and class level to damage. The interesting thing is that CoT levels also count to the damage SE does, so a Paladin 29 CoT 10 does 39 Bonus damage. I generally don't bother with this feat, as it only works on evildoers and also it has very few usages per day. However, if you truly focus on it, it can be devastating. You have to take a feat called Great Smiting, and go Pal 29 CoT 10 Anything 1 (Rogue or Monk would work) to have as many Class Levels count to damage as possible. An ideal Great Smiter with GS 10 will do 429 bonus damage on a successful smite. That's not a small feat. This feat DOESN'T WORK WITH RANGED WEAPONS!<br/>\n<br/>\nLevel 3:<br/>\n<br/>\n- Remove Disease: Well, let's see, you're already immune to disease and even that is not so great, so what would a once-per-day remove disease ability be? You're right if you answered WORTHLESS! Use this feat anytime you get a chance, which won't be many. You get to save one of your friends a remove disease scroll once a day, YAY!<br/>\n<br/>\n- Turn Undead: You can instantly destroy weak undead with this ability, and scare the crap out of stronger ones, which will flee in horror. You have to make a check to succeed and there is a limit to the HD of undead turned per attempt. I would say that it's an averagely useful feat to have, but it also serves as \"food\" for Divine Might and Divine Shield uses, so the more the merrier! You get 3 + CHA modifier Turn Undead attempts per day.<br/>\n<br/>\nLevel 5:<br/>\n<br/>\n- Summon Paladin Mount: It summons you a horse, that's all. Really, unless you're a Paladin / Purple Dragon Knight with maxed out Ride skills, just buy a damn horse, will you? If you are a Pal/PDK, I guess having a free once-per-day Heavy War Horse is cool.<br/>\n<br/>\nSELECTABLE CLASS FEATURES:<br/>\n<br/>\n- Divine Might: You can use a Turn Undead attempt to increase your Damage by an amount equal to your CHA modifier for a number of rounds equal to your CHA modifier. Damage type dealt is Divine. Requires Turn Undead, so you can take this after Paladin 3. Doesn't stack with itself.<br/>\n<br/>\n- Divine Shield: You can use a Turn Undead attempt to increase your AC by an amount equal to your CHA modifier for a number of rounds equal to your CHA modifier. AC gained is of the Dodge type. Requires Turn Undead, so you can take this after Paladin 3. Doesn't stack with itself.<br/>\n<br/>\n- Extra Turning: You gain an additional six Turn Undead attempts per day.<br/>\n<br/>\n- Extra Smiting: You gain an additional two Smite Evil attempts per day.<br/>\n<br/>\n- Great Smiting: This feat is selectable multiple times up to a maximum of 10 times. Each time you do, it adds 1x your total class level (Paladin + CoT) to your damage. A Paladin 29 / CoT 10 will do 39 bonus damage on a regular smite, 78 on a smite with 1 Great Smiting feat and a maximum of 429 with 10 Great Smite feats. Requires 25+ BASE Charisma to be available to take, so this feat is exclusive to CHA-based Paladins and CoTs (or BGs).<br/>\n<br/>\n- Taunt: Taunt is also a very important part of the Paladin's arsenal, but not a feature or feat. A few other classes can Taunt as well as the Paladin (Bards and Blackguards, mostly), because other taunters don't generally have any other reason to increase Charisma, even though Taunt is in their skillset. A Smiting Paladin/CoT with high CHA is the ultimate Taunter, not even Bards have a reason to go beyond 16 CHA.<br/>\n<br/>\nSPELLS<br/>\n<br/>\nI will only mention the good spells here, but you should know at what levels you get a new spell level. At level 4 you have lvl 1 spells (only if your Wisdom is 12 or higher, otherwise at level 6), at level 8 you get level 2 spells (only if your Wisdom is 14 or higher, otherwise at level 10), at level 11 you get your first 3rd level spell (only if your Wisdom is 16 or higher, otherwise at level 12), and finally at level 14 you get the first 4th level spell (only if your Wisdom is 18 or higher, otherwise at level 15). At level 15 you should have 2 lvl 1 spells and  1 of each spell level plus your bonus spell slots, at level 20 you have 3 of each spell level plus the bonus spells granted by your Wisdom score. So most of your spell slots become available on levels 15-20.<br/>\n<br/>\nLevel 1:<br/>\n<br/>\n- Bless: Grants you and all nearby allies +1 AB for 1 Turn per level.<br/>\n<br/>\n- Divine Favor: Gives you +1 AB and damage per 3 caster levels for 1 Turn (10 Rounds). Caps at +5 (level 15). Great spell if you have many Paladin levels, otherwise, not so great.<br/>\n<br/>\n- Protection From Alignment: Makes you immune to mind effects and grants bonuses to saving throws and DEFLECTION AC against the chosen alignment. Not so good if you don't have many spell slots. You are most likely going to be a meleer, so generally you shouldn't have the slots to waste with this but a Wisdom-based Zen Archer could, so I'll leave it here as reference.<br/>\n<br/>\n- Bless Weapon: Adds divine damage to your weapons when fighting undead. Good if you know you're gonna fight undead, but this spell should not be memorized unless you know for certain that you're fighting them. Carry a stack of scrolls around if you can.<br/>\n<br/>\n- Deafening Clang: Adds 3 Sonic damage to your weapon for 1 Round per level. Good spell to boost damage on melee weapons. There is a useless secondary effect that deafens opponents if they fail their save. Bah!<br/>\n<br/>\nLevel 2:<br/>\n<br/>\n- Aura of Glory: Great spell that adds 4 to your CHA score and heals all allies around you mildly. Lasts 1 Turn per level. Since many of your class features are CHA-based, you should have at least one copy of this spell a day unless your CHA is pathetic or you don't have enough Paladin levels.<br/>\n<br/>\n- Eagle's Splendor: Adds 1d4 +1 to your CHA score for 1 Hour per level.<br/>\n<br/>\n- Bull's Strength: Adds 1d4 +1 to your STR score for 1 Hour per level.<br/>\n<br/>\n- Aid: Adds +1 to AB and 1d8 HP for 1 Turn per level.<br/>\n<br/>\nLevel 3:<br/>\n<br/>\n- GMW (Greater Magic Weapon): Adds +1 per 3 caster levels to the enhancement of your equipped melee weapon. Caps at +5 (level 15) and lasts 1 Hour per level.<br/>\n<br/>\n- Prayer: Adds +1 to attack rolls, damage and saves of all surrounding allies and gives an equivalent penalty to all enemies in the area. Lasts 1 Round per level.<br/>\n<br/>\nLevel 4:<br/>\n<br/>\n- Freedom of Movement: Makes you immune to Paralysis, Slow and Entanglement effects. Lasts 1 Turn per Level.<br/>\n<br/>\n- Death Ward: Makes you immune to all Instant Death spells and effects except for Drown and Implosion. Lasts 1 Hour per level.<br/>\n<br/>\n- Holy Sword: Makes your weapon the Holy Avenger, with 1d6 divine damage vs Evil and 16 Spell Resistance. It also used to have a dispel on hit property, but AFAIK it no longer works. I don't remember ever having seen my buffed weapon dispel anything after 1.69, and pre 1.69 I just didn't know enough about the game to notice.<br/>\n<br/>\nHOW TO USE PALADIN IN A BUILD:<br/>\n<br/>\nWell, following the same guideline to my Cleric guide, I want to discuss the many ways you can use this class in your builds. Unlike Clerics, however, Paladin can be effective in a build with just a few levels as well as being the main class. <br/>\n<br/>\nAlso, defining the starting stats is in most cases the most challenging task when building a Paladin, especially a DEX-based one. You can't trash Wisdom because it's your casting stat, you can't trash Charisma because some of your most useful class features are Charisma-based. You can't trash Strength because Divine Might and Divine Shield require Power Attack, so at least 13 Strength is needed. You can't trash Dexterity because it's a DEX-based toon, so that leaves you with Constitution and Intelligence. You can't trash Constitution because you are a meleer, so you need HP, and you can't trash Intelligence because you already have very few skill points as it is, and if you want IKD or Expertise, you need at least 13 INT. You're gonna have to trash something, for sure. My advice in this case is to start with everything at 14 and trash CON. Paladins are generally not good for min-maxing because of their need of many stats, but they can make up for the gimped stats with their buffs.<br/>\n<br/>\n1- Just a few levels of Paladin: <br/>\n<br/>\nPaladins gain all their GOOD class features (except spells) on the first 3 levels, so there are many builds that can benefit greatly from taking the class. With just 1 level, you gain Disease Immunity and add CHA modifier to your saves, with 2 levels you gain Fear immunity and with 3 levels (taken on a General feat level) you can get Divine Might or Divine Shield, If you want both DM and DS, all you need are 4 levels (take lvls 3 and 4 on general feat levels). Using Paladin this way is most effective in high Charisma builds, but some melee toons can also benefit greatly from Fear immunity. I have a near-pure Sorcerer build which uses 3 Paladin levels to boost saves by 16 with capped CHA and to cap Dodge AC with Divine Shield (+16 Dodge AC, with +4 from haste you don't even need Dodge boots and can use a Boots of Striding, for example, to increase CON).<br/>\n<br/>\n2- More than a few levels of Paladin, but not the main class:<br/>\n<br/>\nIn this case, you take Paladin just to have access to a few spells and maybe attain requirements for a prestige class you want to focus on. If you have 14 Wisdom, you can go Paladin 8, for example, just to have access to Bull's Strength. Say you want to be a Dwarven Defender, which requires +7 BAB. It'd be silly to stop there when with 1 more level (granted that you have 14 Wisdom), you can access Bull's Strength. It is compromising stat-wise, but if you can afford it, why not? If you can't it's still preferable to trash Charisma, because Dwarves already have an innate penalty to that stat, so it's already half-gimped<br/>\n<br/>\n3- Paladin as the Main Class: <br/>\n<br/>\nIn this type of build, you aim to take advantage of all the Paladin goodies. You need at least 14 Wisdom to be able to cast all your spells. At least 14 Charisma would be excellent if you know that where you play you can find CHA-enhancing gear. If you are a strength-based toon, 14 Strength at least is mandatory, and 14 Intelligence is also nice because you need skill points and as I have mentioned before, it's a requirement for Expertise and IKD. You can trash DEX and CON if you must, but you can also start with 12 CON and 10 DEX, for example, and carry a couple of Cat's Grace potions around.<br/>\n<br/>\nAnother important discussion that we commonly see is: What is best, Strength-based or Charisma-based? Well, you can make a DEX-heavy Paladin, a Zen Archer, a CHA-based smiter or a Strength-based juggernaut, such is the versatility of this class. Still the most common choice you will find yourself having to make is STR x CHA. I cannot say that I have a specific preference, because it's mostly a choice of what suits your build best and it also involves environments and items available. To some builds, it may be more adequate to go CHA-heavy, while to others, STR-heavy is the best way to go, or even in some enviroments, the nature of the available items and enemies can determine which one is the best choice. So, rather than picking a particular side, I will try to show the pros and cons of each one and leave it up to you to decide:<br/>\n<br/>\nCHA-BASED<br/>\n<br/>\nCharisma based Paladins have higher saves, better chances of successfully Taunting anyone, more Turn Undead uses per day, which means more Divine Might and Divine Shield uses per day, better durations for these buffs and better enhancements given by them. So a CHA-based Paladin has better BUFFED AC and lower AB than their Strength counterpart. The damage lost from dropping STR is recovered with Divine Might as long as you have TU attempts. Smite Evil will have actually the same chance of hitting, because the CHA gain will be equivalent to the STR loss, so Smite Evil remains unaltered, although a CHA-based Paladin can take Great Smiting feats to make it do more damage.<br/>\n<br/>\nSTR-BASED<br/>\n<br/>\nStrength based Paladins have higher AB, and they do more damage all the time, rather than just when buffed. They can resist KDs, Disarms, and Called Shots better and their Taunting is less effective against those with higher Concentration scores, such as Clerics, Druids, Wizards and Sorcerers. Still a very good chance of Taunting anyone else. Divine Might will give much less bonus damage and the duration will be much lower as well, same with Divine Shield. <br/>\n<br/>\nSo basically, in builds that focus on saves, or in builds that need higher AC, you should go with CHA. For higher magic environments, where you can get +10 Dodge AC boots and perma-haste, a 6 CHA modifier is enough, so go STR-based, but that's generalizing, and in this case I strongly believe generalizations should be avoided and each individual situation analyzed separately by the builder.<br/>\n<br/>\nHOW TO PLAY A PALADIN<br/>\n<br/>\nNow I won't digress about builds that only partially take advantage of the class, but advice to these can probably be found somewhere in my ramblings <br/>\n<br/>\nLow Levels: 1-8 or 10<br/>\n<br/>\nThis is the stage when Paladins are most vulnerable. This happens because of the lack of min-maxing that all Paladins seem to suffer from. The Fighter-type AB hasn't kicked in yet, you don't have Bull's Strength yet and Taunts are still unreliable (but necessary) because the d20 factor is still heavily impacting the outcome. In this stage, defensive feats are most useful, because you can't just summon stuff like Clerics, Druids or Casters to get around your own weakness. You need to OUTLAST your foes or have tons of healing potions. The Expertise / Taunt combo can be very useful to make an enemy's AC hittable by your still low AB. For more details on how that combo works, check my Holy Weapon Master with Cheese build. For DEX-based Paladins it's even harder because Bull's Strength helps with damage, but not with AB, unless you leave Weapon Finesse for later, which is good, since your starting DEX will be lowish.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/holy-weapon-master-with-cheese-paladin-26-wm-13-monk-1-t515397.html\" rel=\"noreferrer\" target=\"_blank\">The Holy Weapon Master with Cheese</a><br/>\n<br/>\nEDIT: I will explain the interaction between Taunt and Expertise here. There's no need to ask you to go to another topic to read something when this is a guide to the class, aye? So, basically, Taunt / Expertise was a fortunate finding I had when I was playing my Holy Weapon Master with Cheese (above). Before this build, I truly had never bothered taking Expertise in a Pally build, but since it was a requirement for WM (and the build doesn't get Tumble AC for her entire life), I found myself using Expertise a lot. When I first Taunted my first enemy in Expertise WAAAAAAYYY back, I remember thinking: \"hmm, this is VERY USEFUL.\" Here is how it works:<br/>\n<br/>\nYou turn on Expertise and attack the enemy as you should, and instantly click on Taunt to set it up (the target must be aware of you, so no surprise Taunting is allowed). Now the Taunt icon will appear on the top left of your screen just to the right of the little sword icon that symbolizes you're fighting. You then click on the sword icon to get out of combat and that causes you to instantly start Taunting. You MUST let your toon attack FIRST so that Expertise mode is activated or you must turn on Expertise before clicking directly on your enemy to run up to him in Expertise mode (in other words, if you click on your enemy first and then activate Expertise, it will trigger, but it will only activate after the first attack, if you activate it before you click your enemy, you will already run up with the mode active). Now, during the whole round that it takes for the Taunt result to come up, Expertise mode is active. You then receive two consecutive messages: 1- Taunt: Success (Or Failure) and 2- Expertise Mode Deactivated. So, basically, Expertise only deactivates AFTER the Taunt result is out, which means you can get +5 AC for free while Taunting by having Expertise (since while you're Taunting you're not attacking). You still receive Sneak Attacks (but they're much less likely to hit with +5 AC). Let me clarify that, in order for you to Taunt, you HAVE TO get out of combat mode by actively clicking the sword icon on the top left of your screen. It's not like spells, which interrupt combat mode when you click to cast them: you must MANUALLY deactivate combat mode to begin the Taunt.<br/>\n<br/>\nThere is also another fortunate finding (exploit hehe) I came across regarding Taunt. Let me explain how I found out. Due to a sort of glitch in the NWN engine, if at some point while you are Taunting someone, an enemy around you performs an action that causes an Attack of Opportunity, then your Taunting gets interrupted and you get back into combat mode, delivering said AoO and from that point on you continue fighting normally (since to begin Taunting you must manually deactivate combat mode). After your Taunting gets interrupted, I noticed that the VERY NEXT TIME I tried to Taunt someone, the result would come out instantly, meaning you don't have to wait for a whole round (receiving Sneak Attacks and stuff) to reduce an enemy's AC. That was how I found out about this glitch. The good news is that you can also use it ACTIVELY, meaning that, if you know you have a tough battle ahead of you, you can plan ahead and start Taunting the last regular mob JUST BEFORE killing it, but instead of letting the whole round go by and the result come out, you can re-attack that enemy (probably killing it) before the round expires and then have an insta-Taunt up your sleeve for the next battle. Just make sure you don't Taunt anyone else before the tough battle you were saving it for arrives. A bit cheap, but very effective.<br/>\n<br/>\nMid-levels: 8 or 10 to 15<br/>\n<br/>\nThis stage of leveling is easier because you start acquiring combat feats, and you have some nice spells already. Your AB grows a lot here thanks to Divine Favor and GMW increases. At this point you shouldn't be having much trouble hitting anything. The main difficulty here is facing casters. They will be your bane for a while unless you catch them off-guard. Invisibility potions can help a lot, as well as Haste potions to make the most off of your buffs, so save up and buy as many as you can. If you don't take out a caster before they are able to buff or even start firing spells, you'll be in trouble. <br/>\n<br/>\nHigh-ish Paladin levels: 15-20<br/>\n<br/>\nYou start gaining many new spell slots, which can justify the taking of Extend Spell to better manage your very restricted spell options. Your buffs are already capped, so your AB from this point on is better than that of a Fighter of the same level, unless there are many over +5 items available where you play at this stage. Also, your Taunt modifier is high enough to be reliable against all but the most Concentration-heavy mobs. At this point all you need to do is kick butt. You're a meleer with very good offensive buffs, so prioritize getting AC gear and try to walk around with some immunity items for specific situations. Casters are still the type of mobs that will give you the most trouble. <br/>\n<br/>\nNot much else to say here, melee-based toons are quite easy to play. Paladin spellbook is simple and there's not much to choose from, so it's pretty straightforward.<br/>\n<br/>\nThere are a few builds that use Paladin differently and almost uniquely, but those are best to be looked at individually, like my Paladin Zen Archer or my Paladin / Druid with Dragon Shape (and one alignment shift). The first one I posted back in the old guild as a suggestion to a build request and is now in my Hard Drive awaiting my procrastination period to be over for some much needed tweaks, and the second one is pretty good except for the alignment shift, which has always bothered me, but nothing you can do there. Those builds differ too much from the \"average\" Paladin build to be added here, although the list of ways to use this class is so extensive that I might not have covered 30% of it.<br/>\n<br/>\nI will eventually talk about combos, but procrastination mode has already set in and it pains me to even think of the variety of possible combos with this class. The only two restrictive aspects of Paladin combos are the gimped stats and the alignment, but their class features are desired by many.<br/>\n<br/>\nI hope this guide is a good starting place for those who want to make holy warriors.<br/>\n<br/>\nEDIT: An Epic Paladin gains a bonus feat every 3 levels after 20, so 23, 26, 29, 32, 35, 38.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "7:34 PM - Sep 21, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice!  And I didnt see one reference to a Paladin/druid dragon shape build!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:31 PM - Sep 21, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>avado wrote:</strong>Nice!  And I didnt see one reference to a Paladin/druid dragon shape build!  </div></blockquote>\n\nRIGHT!! Thanks for reminding me! I have already edited the OP to include that one as well, but only a minor mention. Jeez I haven't touched that build in AGES!!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:47 PM - Jun 07, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hail, mighty ECBers.<br/>\n<br/>\nI have recently edited in a bit where I explain the Taunt/Expertise combo IN DETAIL as well as a fortunate finding I had about Taunt. Check out the OP right below the link to my Holy Weapon Master With Cheese build to read the latest info.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "7:06 AM - Apr 25, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for that one, too.<br/>\nAlready realized the problem that you cannot trash a single stat here. Still checking builds and the wiki. Last time I played a Pally was in ADnD 2E times...<br/>\nI will come back to all these guides.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:35 AM - Apr 25, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That is why Paladins often referred to as M.A.D. class (Multiple Attribute Dependant).<br/>\n<br/>\nYou can still play a great 2nd Ed. Paladin (Cavalier, Inquisitor, Undead Hunter) in Baldur's Gate II Enhanced Edition by the way ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "8:41 AM - Apr 25, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It does not belong here, but I still own the original BG II, one of my favorite games ever.<br/>\n<br/>\nM.A.D. indeed. Maybe I should have tried something else first... anyway, I have learned a few things already. I hope so, at least.<br/>\nI am eager to see stuff like DM and DS \"live\". Also would be something new to make use of these fancy full plates. Last time I did use a full plate and not sell it was when I had Imoen cast Limited Wish, chose the magical item and put the Field Plate+2 on Anomen...<br/>\n<br/>\nNow that I have found this page I want to try all classes, especially those I haven't tried before. <br/>\n<br/>\nGuides like this one are extremely helpful.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "12:33 PM - Apr 25, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey FG! I love BG 2 as well. In fact, I have made NWN adaptations for all those characters. Maybe you can \"kind of\" relive thise moments by playing them. PM me if you're interested and I can send you the builds.<br/>\n<br/>\nTake care!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "12:44 PM - Apr 25, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Didn't you post one or two of these here? I think I have seen either \"Imoen\" or \"Aerie\" or both somewhere here...<br/>\n<br/>\nBut let's go back to topic: paladins in NWN and with 3E. I am quite sure they can be fun to play as well when you know what you are doing (which is where this guide might come in handy).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "2:22 PM - Apr 25, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">One more thing I forgot to mention in this guide is that you should have your own \"REST ITEMS\" set. This means you should equip as many WIS-enhancing items as you can acquire and equip them before resting. Memorize some long-lasting buffs with the extra slots and rest. Buff yourself up with them, then swap to your combat items. Here's a rough list of these long-lasting buffs:<br/>\n<br/>\n1- Endure Elements / Protection from Evil / Bless<br/>\n2- Bull's Strength/ Eagle's Splendor / Aura of Glory/ Aid<br/>\n3- GMW / Magic Circle vs Alignment<br/>\n4- Death Ward / Freedom of Movement<br/>\n<br/>\nAll your \"regular\" slots should be saved for short-duration buffs, if possible. I would list them, but I ran out of time. <br/>\n<br/>\nCheers!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "5:08 PM - Apr 25, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Maximillian_Kane wrote:</cite>. I would list them, but I ran out of time. </div></blockquote>\nLOL.. should have made the reply with one of the long lasting buffs....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:27 PM - Apr 25, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Freaky Grandma wrote:</cite>\nDidn't you post one or two of these here? I think I have seen either \"Imoen\" or \"Aerie\" or both somewhere here...<br/>\n<br/>\nBut let's go back to topic: paladins in NWN and with 3E. I am quite sure they can be fun to play as well when you know what you are doing (which is where this guide might come in handy).\n</div></blockquote>\n\nI know this is off-topic, but there are a few more interpretations of BG (I and II) characters on about page 12 (only a guess, I'm afraid) of the Unfinalized Builds forum, under the name of <strong>Minsc!!! and other BG characters</strong> and pulled together by Mick Dagger. Indeed, hiding therein is my first ever build (with immense guidance from the great and good) - one Mazzy Fentan.<br/>\n<br/>\nI'll let you get back to pally chat now.<br/>\n<br/>\n<strong><em>EDIT: </em></strong>Just checked, and it is indeed on page 12 (I should probably get some betting done today, if my guessing is working that well)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:15 AM - Apr 26, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Is it that thread where Max made Khalid a 49ab weapon master with dev crit and called him \"average joe\"?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "12:36 PM - Apr 26, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>Is it that thread where Max made Khalid a 49ab weapon master with dev crit and called him \"average joe\"?</div></blockquote>\n\nHahaha! I remember that!<br/>\n<br/>\nBut no, it's not that topic.<br/>\n<br/>\nI did call him average joe because he's not maxed out for the class combo. I just made a similar toon on WoG who has 51 AB, UMD and Evasion. None of which average joe has at his disposal. <br/>\n<br/>\nHehe! Good times when we worked on those builds, brother!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:03 PM - Apr 26, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good times indeed!<br/>\n<br/>\nUnfortunately, we don't have more of that exquisite Royal Lochnagar, Stag drank it all :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}