{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "014",
  "name": "Nature's Strongest Defenders - A Guide to Druids",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/nature-s-strongest-defenders-a-guide-to-druids-t515540.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": 26,
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:36 PM - Oct 29, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hail, ECBers. Turns out today I'm at the office, stuck answering phones as my secretary won't be making it to work. Ah.. those hangover Mondays! Well, I'll not let that opportunity slide, I'll spend this time producing yet another guide to one of my favourite classes: Druids.<br/>\n<br/>\nAs the \"intro\" to this guide, let me tell you a bit about the strengths and weaknesses of the class:<br/>\n<br/>\n- Strengths:<br/>\n<br/>\n1- The MOST AMAZING STRENGTH or trait of the Druid class is that you can pump your casting stat (Wisdom), grab Zen Archery and be proficient in all areas of combat: Casting, Ranged combat and Melee combat. That happens because Druids use shifting to fight in melee, and all of their shapes override the character's Strength, Dexterity AND Constitution scores (I'm not talking about shifter shapes here, just Druid shapes), replacing them with the ones from the copied creature. This means you can have VERY LOW SCORES in all three of those stats without hurting your melee prowess, so your spells will have very high DCs thanks to the high Wisdom (which can be capped by Owl's Insight alone), and that will also make your ranged AB high and your melee AB will also be at the very least acceptable due to the high STR of your shapes (or DEX if you have Weapon Finesse, although you don't have many ways of buffing DEX as well as you can buff STR).<br/>\n<br/>\n2- Animal Companions are simply the most reliable summons you can find, and it takes a long time for them to become obsolete. The Druid has incredibly good buffs to make their companions very strong additions to their combat strategy. A high AC Druid can tank and let the companion kill pretty much anything in the way.<br/>\n<br/>\n3- Druid spells are also very good, and with the number 1 Strength I mentioned, any non-shifter Druid should have high DCs on their spells. Their buffs are also very useful, although with a limited scope. They have very interesting offensive spells in many forms, but my favourite are the disabling ones. I'll talk more in-depth about this later when I discuss spells.<br/>\n<br/>\n4- Many skill points per level, although not such a great selection of skills (but they can be saved up and spent on taking a level of another class ).<br/>\n<br/>\n- Weaknesses:<br/>\n<br/>\n1- No direct AB buffs. Even though I did say that Druids have a very acceptable AB throughout, it comes mostly from the high STR of their shapes. Druids can only buff Strength (very well, though), not AB, so around level 30 and then again closing to 40, the AB becomes less attractive, at level 30 because you don't have Dragon Shape yet and Elemental Shapes AB is really really bad at that stage, and approaching 40 because you can reach an AB in the mid-50s even in Dragon Shape, which isn't bad but isn't exactly top notch either. The fact that WF and EWF Unarmed don't work while shifted, which is essentially a bug, would help with that, so screw Bioware for not fixing this! BTW, just in case you're wondering, they DON'T WORK, I know your character sheet is showing them, but the character sheet LIES! Improved Critical (Unarmed), Epic Prowess and Overwhelming Critical (Unarmed) work.<br/>\n<br/>\n2- Healing is somewhat difficult to manage in melee, because you need to de-shift to cast any healing spell. Potions work while shifted, which is great if your server has them in abundance. Also, re-buffing can be a problem if you get dispelled for the same reason. The thing is that all creatures you transform into have much higher CON scores than you, so when you de-shift, the decrease in CON makes you come back with 1 HP most of the time when you're badly wounded while shifted. You don't die from this, but if any CON buffs expire just after you de-shift or you get hit before you manage to heal, then you die.<br/>\n<br/>\n3- Can't buff stats except STR and WIS (with a bit of CON and DEX on the side thanks to AoV and Blood Frenzy, but those don't last long) The only 2 stat buffs that are long-lasting are Bull's Strength and Owl's Insight. This somewhat limits the usefulness of DEX shapes, like the Air Elemental. If you could buff DEX like you can Strength, Weapon Finesse and Air Elemental Shape would be much more effective and attractive.<br/>\n<br/>\n4- Not all gear merges while shifted, which means that sometimes you THINK you have death immunity from a belt, then shift and find yourself dying from an instant death spell. Or another thing that's a pain in the ass is that sometimes if you have a pendant of Wisdom, for example, then you cast Owl's Insight and shift, if you get dispelled while shifted, you'll lose some of your memorized spells as the amulet doesn't merge with your shape. I'll talk about this more thoroughly later on when I talk about the shapes.<br/>\n<br/>\nAll in all, the Druid class has many tools to make very powerful characters overall.<br/>\n<br/>\nHOW TO USE DRUID IN A BUILD:<br/>\n<br/>\nI will state here that Druids can be used in three ways:<br/>\n<br/>\n1- Just to attain the requirements for the Shifter class:<br/>\n<br/>\nYou need 5 levels of Druid to become a shifter. If your intention is to go heavy on shifter, then you won't be using the Druid side of the build much, so aside from a few buffs, you'll just be a shifter. This doesnt mean that all shifter builds have to go low on Druid. In fact the most common spread for this class combo is Druid 22 Shifter 17 Monk 1. Consider Druid 22 as part of the 3rd group of builds.<br/>\n<br/>\n2- Just to get Dragon Shape:<br/>\n<br/>\nThis type of build was WAY MORE COMMON in the pre-1.69 patches. In the last patch, Dragon Shape came to need at least 18 levels of Druid, which ruined many of those builds, and worsened many others. In this type of build, Druid is a secondary class, the buffs are easily dispellable, but, as usual, the spell DCs are high and the focus of taking Druid is for Dragon Shape, but the combinations are somewhat limited because of the heavy Wisdom requirement and the increased levels needed. A Dragon with Epic Dodge is no longer possible without severely gimping its power, as the stat requirements are unattainable without dropping Monk. You'll need to take CoT levels for Great Wisdom feats and Rogue or SD levels for the other ED requirements. The loss of Monk AC and Attack Progression alone makes me think it's not worth it. You can still have a Dragon with all the arcane spells, but the AB would suffer some more and EW would only be taken at 39, but what would hurt the build most is that you'd only be able to take the cheesy Monk lvl at 40. So if you want a Dragon with Epic Warding, Druid 20 Bard 4 PM 16 is the way to go (no high-level arcane spells here).<br/>\n<br/>\n3- Druid as the main class:<br/>\n<br/>\nThis is the most recommended usage for the class. The buffs will be nearly if not completely undispellable, the spell DCs will be very high, which should be enhanced even further by Spell Focus feats. The animal companion will also be quite powerful for most of your leveling, and with a summoned creature to aid it and a few disabling spells (my favourites), it will wreak havoc with the regular mobs. In the early stages you can also use Animal Empathy to have an extra summoned creature, just in case 2 aren't enough ^^. I used to play on a server where you could charm Magical Beasts with high scores of Animal Empathy, so I had my pet Manticore walking around by my side killing everything on sight. The downside is that I'd have to kill it before resting or just drop her off somewhere far away enough from me so that I could rest, then rest and get her back. If you foget to do that, It's probably Dirtnap express for you, as you'll lose all your buffs, rest and then you'll stop dominating it, it'll turn hostile and attack, breaking your rest and probably killing you. The same goes for all Hostile animals charmed with Animal Empathy. I wish I could say this never happened to me, but it has, more often than I care to admit. It's so pathetic, I know, it's almost like I shouldn't be writing this guide, but reading one .<br/>\n<br/>\nAnyway, now we'll begin to understand this great class. We'll talk about the spells, then animal companions and then the shapes, and at the end I'll give a few pointers on how to play a Druid.<br/>\n<br/>\nTHE DRUID SPELLBOOK:<br/>\n<br/>\nDruids have MANY useless spells in their spellbook, especially in the lower levels, but as you advance in levels, you'll get much better ones. I'll go first into the main buffs and then offensive spells.<br/>\n<br/>\n- BUFFS:<br/>\n<br/>\n1- Long-term: Endure Elements (1), Barkskin (2), Bull's Strength(2), Ultravision (2), Protection from Elements(3), Stoneskin (4), Freedom of Movement (4), Death Ward(5), Owl's Insight (5), Spell Resitance (5), True Seeing (6), Greater Stoneskin(6), Premonition(8).<br/>\n<br/>\n- Endure Elements: Not a bad spell to have, especially early on, mainly because it lasts 24 hours regardless of level. Same goes for Protection from Elements.<br/>\n<br/>\n- Barkskin: The Druid signature buff, although it can be attained by Clerics with the Plant Domain. It gives +3 Natural AC till level 7, then +4 till lvl 12 and +5 from 13 on. If you play on a mid-magic setting, this means that the progression of this spell is better than Cleric buffs and any items that you may acquire at that stage, so it's a very good spell.<br/>\n<br/>\n- Bull's Strength: Good spell to boost carrying capacity and AB and damage for both you and your companion. The effect carries over to the shifted shapes.<br/>\n<br/>\n- Ultravision: Good spell to protect you against the effects of Darkness, but you still can't see anything in there.<br/>\n<br/>\n- Stoneskin: Good DR (10/+5) spell for the companion and summoned creature EARLY ON, and for you before you get Greater Stoneskin and Premonition. Later on it's less useful.<br/>\n<br/>\n- Death Ward: Makes the target immune to Death spells and effects, for you and your companion.<br/>\n<br/>\n- Owl's Insight: This spell is one of the reasons I say Druid-heavy is absolutely recommended. It gives +1 to Wisdom for every 2 levels of Druid and caps wisdom ALONE at 24 levels of Druid. It's one of the best spells in the game. The effect of this spell carries over to the shifted shapes, so if you have at least 1 level of Monk, you'll have up to +6 AC while shifted thanks to this great spell.<br/>\n<br/>\n- Spell Resistance: Gives 12 +1 every caster level to Spell Resistance. It's really good and doesn't cap, so the more levels in Druid, the higher your SR will be.<br/>\n<br/>\n- True Seeing: This spell gives sight of hidden and invisible creatures. It's especially useful for Druids, because their bonus AC in shapes is Dodge, so your AC will be significantly lower if you're caught flat-footed.<br/>\n<br/>\n- Greater Stoneskin: Better DR than Stoneskin (20/+5), but only works on yourself not on others.<br/>\n<br/>\n- Premonition: The best DR spell that you'll have access to. Gives 30/+5 DR for an hour per level. It's also a personal spell.<br/>\n<br/>\n2- Short-term: Blood Frenzy (2), Aura of Vitality (7).<br/>\n<br/>\n- Blood Frenzy: A mini-Barbarain Rage, this spell gives +2 to STR and CON, lowering AC by 1. Good spell to help cap Strength. All properties, including the AC penalty, transfer to the shifted shapes.<br/>\n<br/>\n- Aura of Vitality: This is a VERY GOOD SPELL, exclusive to Druids and Clerics with the War Domain. It gives 4 to STR, DEX and CON. <br/>\n<br/>\nAs far as buffs, these are your bread and butter. I have never played hiding and sneaking Druids, so One With the Land, Camouflage and Mass Camouflage were less useful to me, but you could use them to increase your stealth with the right build. There are also buffs for your companion that are definitely worth mentioning: Magic Fang (1), Greater Magic Fang (3) and Awaken (5).<br/>\n<br/>\n- Magic Fang: Gives +1 to AB and damage to your companion. Nothing special, but OK till you get GMF.<br/>\n<br/>\n- Greater Magic fang: +1 per 3 caster levels to AB and damage of your companion, this is nature's version of the Divine Favor spell applied to your companion. The weird thing about it is that if you (like me) buff from the radial menu, this spell can only be cast on yourself, even though it only affects the companion. <br/>\n<br/>\n- Awaken: Raises Strength and Constitution of the companion by 4, AB by 2 and Wisdom by 1d10 (good only for Will saves). The best thing is that this spell is PERMANENT. It lasts for as long as you have the companion by your side, even after rests. Better fir Single Player modules, because they save your character differently from servers. In online servers, everytime you log out, your companion gets unsummoned and you'll lose all the buffs you cast on him.<br/>\n<br/>\n- OFFENSIVE SPELLS:<br/>\n<br/>\nFor the sake of organization, I will divide these offensive spells into 3 types: Disabling Spells, Damage spells and Instant Death spells. There aren't that many useful ones, really, but this way you can organize your head better too .<br/>\n<br/>\n1- Disabling Spells: Entangle (1), Grease (1), Vine Mine (5), Stonehold (6), Nature's Balance (8), Storm of Vengeance (9).<br/>\n<br/>\n- Entangle: Holds the target still if it fails a save, but the target can still attack and cast spells at will. Negated by Freedom.<br/>\n<br/>\n- Grease: Slows any non-Druid target that walks over it, and if the target fails a reflex save, it also gets knocked down. Freedom and Immunity to knockdown negate each of the effects respectively. There is also a specific immunity to Grease, which negates both effects simultaneously.<br/>\n<br/>\n- Vine Mine: When you cast it, you have to choose one of 3 effects, the only one I've ever used is Entangle.<br/>\n<br/>\n- Stonehold: I just LOVE this spell! It paralyzes all targets in the area if they fail a save. The best thing about this spell is that targets need to make a WILL save. This spell, along with SoV, is the reason why I like the Conjuration school so much.<br/>\n<br/>\n- Nature's Balance: Reduces target creature's SR, helping your spells penetrate Spell Resistance.<br/>\n<br/>\n- Storm of Vengeance: If you read my Cleric guide, it's THE ULTIMATE STUNNER! Now not all Clerics have high Wisdom and I already said that, can you imagine what it's like with a VERY HIGH DC? Yes, AWESOME! You'll pretty much stun anything that's not immune to it or focused on saves. With this spell, you needn't fear being surrounded, you'll actually welcome it!<br/>\n<br/>\n2- Damage Spells: Flame Lash (2), Call Lightning (3), Flame Strike (4), Ice Storm (5), Inferno (5), Creeping Doom (7), Fire Storm (7), Harm (7), Sunburst (8).<br/>\n<br/>\n- Flame Lash: Worthless little Fire Damage spell. Only good to finish off Harmed opponents.<br/>\n<br/>\n- Call Lightning: This spell does VERY GOOD damage on a very large AoE, but only works outdoors.<br/>\n<br/>\n- Flame Strike: Does Fire and Divine damage to enemies in a small to average AoE.<br/>\n<br/>\n- Ice Storm: This spell is great as it has no save nor is it subject to Spell Resistance, does Cold and Physical damage.<br/>\n<br/>\n- Inferno: This spell is good if you like killing a monster in 1 year, rather than a few rounds. It has no save, which is great, but does 2d6 fire damage a round for 1 round per level. I'll be honest with ya, IMO Ice Storm or Empowered Call Lightning are much better to have at level 5 than this one. You can use it extended at level 6 for double damage (takes twice as long).<br/>\n<br/>\n- Creeping Doom: Good no-save spell that does more damage each round a creature is in the area of effect and also slows enemies. However, there is a bug with it that makes prone creatures get up and move out of the AoE, so it's less useful.<br/>\n<br/>\n- Fire Storm: Huge AoE spell cast around you that does Divine and Fire damage. Druids are THE ONLY CLASS that can cast Empowered Fire Storm, as it's a lvl 7 spell for them.<br/>\n<br/>\n- Harm: Great spell to kill high HP monsters nearly instantly. Many servers have nerfed it. Fully heals undead.<br/>\n<br/>\n- Sunburst: Good undead-damaging spell, pretty worthless against anything else.<br/>\n<br/>\n3- Instant Death Spells: Slay Living (5), Drown (6), Finger of Death (8).<br/>\n<br/>\n- Slay Living: Kills a single target if it fails a Fortitude save. Does 3d6 +1 per caster level Negative Energy damage if the target succeeds the save.<br/>\n<br/>\n- Drown: Living creatures take 90% of their current hitpoints in damage, leaving them near-dead. This spell is here because the damage is only applied if the target fails a save, so it works similarly to the instant death spells. The best thing is that this spell isn't subject to immunities, except for the fact that it only works on livin creatures, so Undead and Constructs are immune to it.<br/>\n<br/>\n- Finger of Death: Works the same as Slay Living, but has a higher DC because it's a higher level spell.<br/>\n<br/>\nSo basically there are 4 main schools in which you can have spell focus feats. My favourite is Conjuration, because not only it has the best spells (Grease, Stonehold and SoV), but Stonehold is a Will save spell, while SoV and Grease are Reflex, which allows you to attack the enemies weakest save most of the time. But Conjuration is also the school that's most affected by immunities, so if where you play they are abundant, you can choose another school, between Transmutation (for Drown DC), Necromancy (for Finger of Death and Slay Living) or my second favourite: Evocation for those juicy damage spells like Fire Storm. There are many REALLY GOOD damage spells from level 3 on, and you can always have a metamagic version of any of those in all levels from 3-9. They're all subject to Evasion (except for Ice Storm) and do half damage if a save is made, so a higher DC is very interesting to have. Not as interesting as a huge AoE damage and paralysis one, but interesting nevertheless.<br/>\n<br/>\nDRUID ANIMAL COMPANIONS:<br/>\n<br/>\n1- Brown Bear: This is the highest AB of all your companions, however, his AC is also the lowest. In vanilla NWN, that doesn't matter because the companion's AC is always gonna be low from a certain point on, so it's best to use them just to deal damage, and leave the tanking to either yourself or another summoned creature. The bear gains +1 STR for every level up to 20, so the AB will be very good if compared to the other companions.<br/>\n<br/>\n2- Dire Wolf: This is tied in second place as the best companion to have. The great thing about this companion is that it gets +1 to DEX increases every level up to 20, ending up with a much more acceptable AC than any other companion. They're a good choice if you have CEP enhancements that can further their DEX and equip them with cloth armor and AC items. Their AB isn't good, but in the higher levels, nor will the Bear's AB be, unless you go with a near-pure Druid build.<br/>\n<br/>\n3- Panther: This animal companion has the highest damage output of them all, thanks to the 10d6 Sneak Attack damage that they get from level 1-20 as a Rogue 1 level higher than the Panther (A lvl 6 Panther will have the same Sneak Attack dice and Uncanny Dodge bonuses as a lvl 7 Rogue). After lvl 20, the increase in Sneak Attack stops, but Uncanny Dodge continues to grow with levels.<br/>\n<br/>\nI have never played anything else in terms of animal companions. The other ones might be useful or have a useful feature, but I wouldn't know. Generally, I use the Dire Wolf in the very early levels, because the AC is good and it can tank when you still don't have buffs or melee prowess. Your physical stats are just pathetic, so after level 5 or 6, I switch up to Brown Bear, cuz I already have Barkskin and Wildshape, then at level 26 Druid I switch back to the Wolf (only if there is the CEP option to equip them). I only use the Panther on my Sneaky builds, like my Bane Crusher halfling Ranger / Rogue / SD. A companion that's proficient in hiding and does lots of Sneak Attack damage can be a nice addition to a sneaky guy.<br/>\n<br/>\nDRUID SHAPES:<br/>\n<br/>\nFirst and foremost, I will tell you that all Druid shapes follow the same rules: not all items merge on shifts. I will explain how it works, so that you can equip yourself properly. All \"armor\" items merge on shifts, which basically means Armor, Shield and Helm. Only the highest AC modifier among those items will be added to your AC in the shifted shape. That's easy enough, but what's really cool is that all properties of those items also merge when you shift. So if you, for instance, have an armor that gives you Haste, then you become Hasted when you shift. If your Armor has a +5 AC modifier, then that one will be added to your shifted AC. This means you can equip a shield that gives you, for example, +3 Strength and no AC. That will effectively increase your STR without diminishing your AC. I say diminishing because normally, Druids have at least 1 level of Monk, for Wisdom AC and Unarmed progression (too much to pass up). You lose those when you equip armor or shields, but when you shift, the shield merges and disappears for as long as you remain shifted. Then you get the properties from the shield but without the penalty. The risk of doing this is that if you de-shift to heal, for example, and get attacked, your AC will be very low because the shield will be equipped and you won't have Wisdom AC and you will very likely die, so use with caution.<br/>\n<br/>\n- WILDSHAPE: <br/>\n<br/>\nAllows you to transform into an animal of your choice between Brown Bear, Panther, Wolf, Boar and Badger. At level 12, these shapes receive an upgrade to Dire Bear, Improved Panther, Dire Wolf, Dire Boar and Dire Badger. To be honest, I'm not exactly an expert in these forms, as I have used ONLY THE BEAR. The thing is that the Bear has the highest AB because it has the highest Strength, and the difference in AC isn't as significant to justify going for anything else. So just in case you're wondering about these shapes, let me provide you with the link, so feel free to try out any other shape if you want to challenge yourself or for whatever reason, but IMO bear is the only one that's worth something.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Wildshape\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Wildshape</a><br/>\n<br/>\n- ELEMENTAL SHAPE:<br/>\n<br/>\nAllows you to transform into an elemental of your choice. Each type has a bonus special ability, except for the Earth elemental. These forms are very peculiar and excellent to have if you get them in pre-epic. I'll take a look at each one of them, without being too \"numbery\", but more in general terms of the characteristics of each shape. At level 20 these become slightly better as you take the form of elder elementals, but the difference is not much. All elemental shapes have immunity to critical hits, disease, mind-affecting spells, paralysis, poison, and sneak attack. <br/>\n<br/>\n1- Fire Elemental: This is IMO the most useless shape of all the four. It has lowish STR and DEX and a high CON score, which gives you more HP, but lowish AC. The good thing is that it does 1d6 bonus Fire damage each attack, which can be useful vs some undead and high DR monsters.<br/>\n<br/>\n2- Earth Elemental: This is the lowest AC shape, because of the low DEX, but is also the one with the highest STR, so the highest AB and damage of all. Can be very useful one on one if you can KD your opponent, but the low AC wll make it not worth the trouble when you get surrounded. <br/>\n<br/>\n3- Water Elemental: This shape is the most well-rounded of all, having the best AB/AC ratio of them all. The AC is MUCH better than that of the Earth elemental, but the AB is only a couple of points lower. The damage is also OK, lower than the Earth one, but not by much. It <br/>\nhas the Drown ability, but the DC is very low, so it's best to avoid it.<br/>\n<br/>\n4- Air Elemental: This is the highest AC shape of them all. It's a DEX-based shape, so if you have Weapon Finesse, this may be the best of them all. The damage is lowish, though, as any DEX build. If you fight a Dwarven Defender, for example, you won't be doing any damage with this shape. If the target has Greater Stoneskin, you also won't do any damage whatsoever except on criticals, until the spell expires. Has the Whirlwind ability, which makes all surrounding enemies make a Reflex save or fall prone. I don't like this much either, as the DC is bad and if you knock them down you still can't attack them for long.<br/>\n<br/>\nThese shapes are very good to get you from 16 to late 20s, then the AB becomes much less significant and they become more obsolete. What I suggest you to do when this happens is: to get through to the level when you get Dragon Shape, whatever it is in your build, use the Air Elemental shape to tank (preferably with Expertise) and let your companion do the damage, or use spells. The uses of these shapes in high epics are limited but not totally worthless. You can use the Air Elemental to tank and the Water Elemental and Earth Elemental to kill easy mobs (if there are any), saving up Dragon Shape uses for the bigger and tougher battles. The critical hit immunity can be good against devcritters, but your low AC compared to Dragon Shape means that you will get hit by regular blows more often.<br/>\n<br/>\n- DRAGON SHAPE:<br/>\n<br/>\nThis is probably the best Epic Feat in the game, or at least one of the top 5. The raw power of a Dragon is truly awesome! You get close to 1000 HP, +20 Dodge AC, 48 unbuffed STR (can easily get up to 60) and +6 Dragon Claws, plus True Seeing and DR of 40/+6, plus immunity to the element of your color and a Dragon Breath of the same element. The different shapes and immunities / breath properties are as follows: Red Dragon: Fire, Green Dragon: Acid, Blue Dragon: Electricity. The Red Dragon also receives +50% of Cold damage, which is a weakness that other Dragons don't have. All else is identical.<br/>\n<br/>\nNow I will talk about the bugged Character Sheet in NWN, and what it shows wrong, so that you can always know what your correct stats are in Dragon Shape:<br/>\n<br/>\n1- The character sheet shows Weapon Focus and Epic Weapon Focus (Unarmed) as if they worked, but due to a bug that was never corrected by Bioware, they DO NOT WORK! So don't take them. You can verify this with combat debugging.<br/>\n<br/>\n2- The character sheet doesn't show ANY size modifiers in ANY situation. In Dragon Shape, this means that your AC is 2 points LOWER than what's shown in your sheet. This also applies to AB, but there is yet another imprecision with Dragon AB, so read below to see about your AB. This is also true for Halflings (+1 AB and AC from size modifier aren't shown).<br/>\n<br/>\n3- The character sheet doesn't show the +6 Dragon Claws, so your AB in Dragon Shape is actually 4 points HIGHER than what the shit sheet shows (+6 from Dragon Claws, -2 from Huge size modifier).<br/>\n<br/>\nSo in summary, your AB/AC in Dragon Shape are +4/-2 from what the Character Sheet shows and WF / EWF don't work. Improved Critical (Unarmed) and Epic Prowess work as they should. If you want to do mental calculations of your AB in Dragon Shape, it's quite easy too. Take your BAB, add your Strength modifier (+25 with 60 STR), +4 from the Claws - Modifier, and +1 from Epic Prowess. That is your AB. An example: 25 BAB (if you go straight Druid) + 25 STR +4 +1 = 55 AB.<br/>\n<br/>\nHOW TO PLAY DRUIDS:<br/>\n<br/>\nFirstly, you should never put any points into your physical stats if you don't go for Shifter levels, unless you have them to spare or you need them to attain a certain requirement. You should nearly always start with 18 Wisdom and all your stat increases should be to Wisdom.<br/>\n<br/>\n- Levels 1-6: At this stage you're UTTERLY WORTHLESS. Without summons you simply can't survive. Thankfully, not only do you have summons, but the best ones too. You can use Animal Empathy to charm an animal, which added with a summoned creature and your companion, will make a little army for you to command. Stay away and just heal them and buff your companion, attacking with a sling if you want to annoy your enemies. Before you get Wildshape, no meleeing for you! Don't use Grease or Entangle because they will cause the animal dominated with animal empathy to turn hostile, as these spells affect allies too.<br/>\n<br/>\n- Levels 6-15: This is where you start to become better. Your Wildshape will allow you to have very good meleeing, but if you don't have any Monk levels, your AC will be low, so you should rely on casting and summoning mostly, unless you can KD and kill your opponents without getting attacked much. This is when you start to get nice buffs like Awaken and Greater Magic Fang for your companion, and Owl's Insight, Greater Stoneskin, Freedom, Death Ward for you, not to mention capping Barkskin at level 13. Still, rely on summons to do the damage and cast or snipe from afar. Animal Empathy is still useful to provide a meat shield and something to attack. It's better if your server has several levels of critters of the animal subtype.<br/>\n<br/>\n- Levels 16-30: After you get Elemental shape, your meleeing gains a good boost, mainly because of the much higher ACs of your shapes now. The Bear in Wildshape has a good AB, better even than some of your elementals, but the AC is just much lower. A bear will have about the same AC as an Earth Elemental, which is the lowest AC of them all, but -3 or -4 AB (I think it's -3, but I could be wrong). This stage is also when you get some good offensive spells (you already have the slots, but they're used for buffs). With the extra slots you'll get, your casting will receive a great boost. Now your summons are mostly sidekicks, but your companion is still a good source of damage, just make sure you leave him behind and attract all targets to you, then have him come from behind and wipe everything out. Summon elementals and cast Freedom on yourself and your companion, then paralyze everything with one well-placed Stonehold or Storm of Vengeance spell. You don't need many copies, as the DCs should be VERY HIGH. If you REALLY want to make sure, use two copies of either spell or one of each. Fight Undead with Mass Heal and Sunburst and use Fire Elemental shape to kill them faster, as many undead have fire damage vulnerability. Your AB becomes less attractive closing to level 30, before you get Dragon Shape, which incidentally means that if you delay it too much, you will have to suffer for many levels. I would have to say that save a few exceptions, let 33 be the latest level to attain Dragon Shape, as the growth in power of your enemies will make it very hard to level with your modest Elemental Shape AB.<br/>\n<br/>\n- Levels 31-40: This is the closing stage of your build. The fact is that after attaining Dragon Shape, you will be pretty close to full power, save very few exceptions. Your AB will be good enough up to level 37 or so, then you'll probably be locked in a few battles of 20s, as the enemies should have high enough ACs to cause you problems, around 70 or so. It's really hard to say this, because all is environment-dependant, but still, everywhere I played so far has been invariably the same dynamic.<br/>\n<br/>\nA few other pointers that can help you out and are most of the time overlooked by Druid players: Use the following items (in the following order) before shifting to enhance even more your combat prowess: Cat's Grace Potion, Dust of Disappearance, Potion of Aid, Potion of Bless. It may not seem like much of a difference, but if you don't get dispelled, you'll have +2 to AB, +1 or +2 to AC and 50% concealment out of these very simple items. Give preference to a Ioun Stone that gives you DEX, as you have other means to cap Strength. With that Ioun Stone active, you'll have another point of AC. So save them up and use them in tough battles to shift the momentum in your favor.<br/>\n<br/>\nLast, I'd have to say that the lower the magic setting, the more powerful an unaltered Druid with Dragon Shape will be. That's because of the partial merging of items in shifting and the bonuses given to them in their shapes. The more gimped all other items are, the stronger these bonuses will be in comparison. Inversely, the more powerful the items are, the bonuses will be weaker, and the bonuses lost by items that don't merge will be more significant.<br/>\n<br/>\nWell, I guess that's about it. At least I cannot think of anything else right now. If I do, I'll add it later. Hope you like and enjoy it.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "foojin",
      "avatar": "no_avatar.png",
      "timestamp": "10:19 PM - Oct 29, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Awesome! Been looking at druid for awhile and this will make things allot easier.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:12 AM - Oct 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Prospective shapechangers may find it useful to know that the attack of all unarmed shapes benefit from the DR buffs i.e. Stoneskin, Gtr Stoneskin, Premonition.  Although it does not increase the AB of the claws/bite as a typical weapon enhancement would, it cuts through the DR of foes by the penetration value (not the soak).  <br/>\n<br/>\nSo, for example, a druid's dire bear polymorph buffed with Stoneskin would be able to penetrate X/+5 DR of any foe until the spell effects expire by either the duration or collapse.  In the same respect, a druid (sorc or wiz) multiclass with access to Epic Warding would be able to cut through DR of X/+20.  Also, epic spells can be cast while in the polymorphed form.<br/>\n<br/>\nThis dynamic pretty much contradicts Max's claim that elemental polymorphs cannot cut through DR like a DwD would have.  Not innately, but with the appropriate buff, they can.<br/>\n<br/>\nAs for Dragon Shape (as Max has already intimated)...<br/>\n<br/>\nAs uber as it is in low- to mid-magic environments, it pales offensively when weapon enhancements (and item enhancements, in general) become excessive (especially the insane OnHit props on some servers) because the equipment merge is significantly limited compared to armed forms and limited to a +6 enhancement.  Also, while in polymorph state, casting from items is impossible, a situation which gives a huge advantage to all non-polymorphed toons.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "12:26 AM - Oct 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well done Max! <br/>\n<br/>\nNow where's that guide for shifters you promised *runs for cover*<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "2:31 AM - Oct 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I hope Thax doesnt stop by... he did one for the old guild (for Max, iirc).  It would be good if someone could find it and attach it as well.  Thax played druids like I played clerics, if you get my meaning!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:04 AM - Oct 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>This dynamic pretty much contradicts Max's claim that elemental polymorphs cannot cut through DR like a DwD would have. Not innately, but with the appropriate buff, they can.\n</div></blockquote>\n\nYou missed the point there Hip. First of all, I was talking about the AIR Elemental shape specifically (read again and you'll see). The Air Elemental will do 20 damage tops, sometimes even less, per hit. That's BUFFED NUMBERS. Now, DwD can get up to 27/- DR. That DR is NOT TEMPORARY, so you'll only be able to damage them with the AIR Elemental shape on criticals. Earth ones can and will damage them. It's not that the Elemental cannot PIERCE DR as in the enhancement, It's that it doesn't do enough damage to surpass what is absorbed per hit.<br/>\n<br/>\nAbout the rest, thanks for pointing it out. I indeed forgot to mention that part of Stoneskin, Greater Stoneskin and Premonition usefulness. You will be using these spells anyway for the DR property in your Human form, so when you shift they will cause that to happen even if you didn't intend that. But that information does add to the guide, so thanks mate! <br/>\n<blockquote><div>Well done Max! <br/>\n<br/>\nNow where's that guide for shifters you promised *runs for cover*</div></blockquote>\n\nYou'd better run for cover LOL. <br/>\n<br/>\nSeriously, though, I'm by no means an expert in playing shifters, although I do know a few ways in which they can be used effectively in a general kind of way. I've only played shifters when I was still an embrio builder, and even then the class didn't appeal to me much. I dream of the day when I actually have TIME to try out all class combos. So far I've not even been able to try out 60% of my own builds, let alone build anything new. I have many builds that I have not posted because I didn't consider them done waiting to be tweaked and played, but no time to play them. I've even gone as far as asking a guy to play some of my builds and tell me what he thought of them because of my lack of time. Sadly, he was a noob so I had to keep teaching him everything and he'd still screw up so our partnership didn't go as planned. He wasn't equipped to use my builds, let alone judge them heh.<br/>\n<br/>\nAnyways, just to mention all I know about shifters, which isn't much:<br/>\n<br/>\n1- There are two ways to use them: you either go for one specific shape or a couple of them or you go for a \"general shifter\", which uses all the shapes according to the situation.<br/>\n2- The shapes that people commonly go for are: Dragon Shape, Undead Shape, Construct Shape, Rakshasa (which merges all items, is immune to magic and can spam-cast empowered ice storm one after the other), Kobold Commando (Nice DEX shape with HiPS).<br/>\n3- Different shapes override different attributes, so, for instance, Risen Lord overrides STR, Kobold Commando overrides DEX (but not STR), so you can make combinations and pump up the stat which is not overriden by that shape so you can, for instance, get a Kobold Commando with DevCrit and Assassin levels.<br/>\n4- Shifter shapes receive their final upgrade at level 17, so there is no reason to level any further in that class other than increasing DCs of the special abilities used by creatures you shift into, like a Medusa's Petrifying Gaze.<br/>\n5- There seems to be a consensus that Shifters are better played as \"general shifters\" because their intent is to be versatile and that playing them that way is better in low magic environments. Inversely, Rakshasa shape can be used for higher magic environments to increase AC by a LOT. I played on a server where a typical Rakshasa had 102 AC as opposed to a Dragon Shape's 88. That was because all items merged and the items were pathetically strong. Other than spamming Empowered Ice Storms, Rakshasa-shaped Druid / Shifters are good for nothing, so if two of those were to engage in combat, it'd be a draw as they wouldn't have any way of killing each other because of the magic immunity.<br/>\n<br/>\nI think that's it. One of my favourite builds on the old guild was named Death Says Yip (Druid 7 Shifter 7 Assassin 26), where the guy did a very smart Kobold Commando shape build with lotsa Assassin levels and I think he was STR-based and very original.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:14 AM - Oct 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>avado wrote:</strong>I hope Thax doesnt stop by... he did one for the old guild (for Max, iirc).  It would be good if someone could find it and attach it as well.  Thax played druids like I played clerics, if you get my meaning!  </div></blockquote>\n\nWhy would you hope that? Thax's guide was how I learned to play Druids back in the day. Most of the stuff I already knew by then, but there were some interesting tactics I picked up from him. I don't believe his guide was written for me, I think it was there prior to me, but I did read it thoroughly and several times too. If someone takes the trouble of looking that up it'd be great, but then they should also bring in his Dwarven Defender guide, which I also read and recommend as a VERY GOOD one to everyone that tries to understand the class.<br/>\n<br/>\nBTW, I asked Kail to take a look at this guide before posting it, as I do acknowledge my own limited experience in building and playing Druids, mostly because of my aforementioned lack of time. When he said the guide was good, and only then, I went ahead and posted it. There are many new players here in this guild now, Marshall, Nwnwhiteboy, Empyre65, Rooky2k, etc.. All these guys don't have the tools that I had when I went through my learning process 5 years ago, as all those guides are gone now, because the old files are lost in Limbo. That's why I'm writing guides to the classes I know well. I do know Druids very well, but I haven't explored many varieties of builds with it, which is why I went to Kail, who's also had extensive experience with the class, to see if I had missed something. Turns out there was only a slight imprecision in my beta version of the guide, which I promptly corrected.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "RookY2K",
      "avatar": "no_avatar.png",
      "timestamp": "3:37 AM - Oct 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong> There are many new players here in this guild now, Marshall, Nwnwhiteboy, Empyre65, Rooky2k, etc.. All these guys don't have the tools that I had when I went through my learning process 5 years ago, as all those guides are gone now, because the old files are lost in Limbo. That's why I'm writing guides to the classes I know well.</div></blockquote>\n\nAs one of those new players, I will say thank you for taking your time to put together these guides. Your cleric guide was a huge help to me as I was learning to play that incredible class.  As I learn more, I'm trying to contribute.  But thank you again for taking your time to put these out.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Atypical",
      "avatar": "no_avatar.png",
      "timestamp": "4:30 AM - Oct 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong>I think that's it. One of my favourite builds on the old guild was named Death Says Yip (Druid 7 Shifter 7 Assassin 26), where the guy did a very smart Kobold Commando shape build with lotsa Assassin levels and I think he was STR-based and very original.</div></blockquote>\n\nThat build gets my vote, too. You're basically a typical druid until you get Kobold Commando, but at that point you just destroy things. Turns your dumped Dex stat into a damn good one, HIPS, Death Attack+Sneak Attack, Druid buffs, Animal Companion+Summon+Animal Handling... You're a 1-man army.<br/>\n<br/>\nMy one issue with it is the issue I have will all shifting builds: dealing with the inane way items get folded into forms.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:18 PM - Oct 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Awesome! Been looking at druid for awhile and this will make things allot easier.</div></blockquote>\n<blockquote><div>Well done Max!</div></blockquote>\n<blockquote><div>As one of those new players, I will say thank you for taking your time to put together these guides. Your cleric guide was a huge help to me as I was learning to play that incredible class. As I learn more, I'm trying to contribute. But thank you again for taking your time to put these out.</div></blockquote>\n\nYou're welcome, and thanks for the recognition. It's nice to have all your hard work acknowledged every once in a while, especially after you've spent 3 days cooking up this stuff, checking and re-checking NWN Wiki for mistakes or stuff you may have left out <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yankee",
      "avatar": "no_avatar.png",
      "timestamp": "3:29 PM - Nov 08, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Excellent guide! I look forward to playing my druid now without feeling completely in the dark. Thanks!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "9:09 PM - Feb 25, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here is a small section which pertains to the shapes available to non-shifter druids.  <br/>\n<br/>\nIt has been adjusted to reflect the stats for a typical level 30 build which is just about the lowest level where dragon shape will be available (and is a nice round number for calculations).  The default version of each shape has been ignored for this comparison.  I hope Max doesn't mind that I amended it to his guide section (though, if he likes to, he can tuck it in there among his Shapes discussion).  Seemed like the right topic for it to appear.   <br/>\n<br/>\n<strong>CHARACTERISTIC COMPARISON, DRUID SHAPES</strong><br/>\n<br/>\nExample: Lvl 30 PC - Dru 20/Mnk 6/CoT 4 (naked, buffed)<br/>\n<br/>\nApplicable feats: Flurry of Blows, Stunning Fist, Weapon finesse (dire badger AB &amp; air elemental AB), Imp Crit: Unarmed<br/>\nApplicable buffs: Max Bull's Strength, Aura of Vitality, Resistance, Barkskin,  Owl's Insight<br/>\n<br/>\nCommon Characteristics<br/>\nProgression: AB/AB-3/AB-6/AB-9/AB-12 (5 APR)<br/>\nSpell resistance:  32 (w/spell buff)<br/>\nStunning Fist DC: 40<br/>\nCritical hit: 19-20x2<br/>\n<div class=\"codebox\"><p>Code: <a href=\"#\">Select all</a></p><pre><code>SHAPE             AB          AC     SAVES (F/R/W)     HP*           DAMAGE              DR\ndire badger       27          52     28/22/37          478 (508)     7-14                N/A\ndire bear         34          45     28/20/37          498 (528)     16-23               N/A\ndire boar         33          49     27/19/37          448 (478)     14-21               N/A\nimp panther       32          49     27/21/37          458 (488)     13-20               N/A\ndire wolf         31          49     27/21/37          458 (488)     13-20               N/A\nfire elemental    31          49     34/23/37          638 (668)     13-27 + d8 fire     15/+3\nwater elemental   34          55     30/25/37          518 (548)     16-34               15/+3     \nearth elemental   35          49     30/19/37          518 (548)     18-36               15/+3\nair elemental     32          61     28/31/37          458 (488)     13-27               15/+3\ndragon            47 claw     72     35/32/37          768 (798)     30-49 claw          40/+6\n                  41 bite                                            24-43 bite\n\n*HP level with Bloody Frenzy applied shown within parenthesis\n</code></pre></div>\nCombat Adjustments (all shapes)<br/>\nFurry of Blows:  -2 to AB, +1 APR<br/>\nBlood Frenzy: +1 AB (exc. badger &amp; air elemental), +1 damage (min/max), +30 HP, +1 Will, -1 AC<br/>\n<br/>\nComments<br/>\nAll shapes except dragon will benefit from Stoneskin (and similar DR spells) by raising the creature weapon power to +5.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Vecho",
      "avatar": "no_avatar.png",
      "timestamp": "4:47 PM - Jul 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">One downside of animal companions and summon creature is that a animal companions or summon creature counts as a henchman, which will increase your CR and reduces your XP gained. We are talking about 30%-50% XP loss here, which is no insignificant, IIRC.<br/>\n So, if you can find a henchman better than animal or summon creature, which is quite common in Single Player Module, it is better to buff your henchman and ignore the animal companions and summon.<br/>\n But, it do feel good and more role play to fight with your animal companions as a druid.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:48 AM - Jul 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Vecho wrote:</strong><hr/>One downside of animal companions and summon creature is that a animal companions or summon creature counts as a henchman, which will increase your CR and reduces your XP gained. We are talking about 30%-50% XP loss here, which is no insignificant, IIRC.<br/>\n<br/>\n  </div></blockquote>\n Be careful trying to estimate XP loss due to increased party size, Vecho.  When the target CR is very low, the difference will not represent accurately what the percentage loss is.  Typically (and it depends a lot on how the XP rewards have been scripted), the loss is somewhere around 12-15% per party member.  But the level (HD) of the extra party members has a big impact as well, not only in figuring XP rewards but how encounters are triggered.<br/>\n<br/>\n As an example, suppose that your solo toon kills a creature for 4 XP.  The same action with companion summoned nets 3 XP.  Add an additional summon for the same encounter and the reward will be 2 XP.  50% XP loss?  Not exactly.  But here is what is happening...<br/>\n<br/>\n The 12% penalty is applied to 4 XP.  Which brings it down to 3.52 the result which always is rounded DOWN, hence 3.  Now the next penalty is applied to the 3 XP (not combined and applied together against the 4 XP as some might expect).  That brings it down to 2.64, rounded down to 2. <br/>\n<br/>\n What this means is that the penalty isn't as significant vs. higher CR kills since the rounding down has less effect (the effect of fractions will be absorbed for the most part) and more accurately approaches the 12% per unit.  But yes, if you are using your support help to kill a mob of goblins, the relative loss will appear to be very high.\n<blockquote><div>\n So, if you can find a henchman better than animal or summon creature, which is quite common in Single Player Module, it is better to buff your henchman and ignore the animal companions and summon.<br/>\n  </div></blockquote>\n<div align=\"left\">That's true but perhaps you don't want to risk losing your henchman permanently.  In some modules/environs, once a hench is dead, it's final.  Summons are expendable.  In others venues, the cost to resurrect them is prohibitive on your purse strings.  Still others will charge you an XP penalty to have them rejoin your party. The Biocampaigns were uncharacteristically-liberal by furnishing what amounts to god-like henchmen that can always be recalled free of charge or penalty. <br/>\n<br/>\n There's a stategy I always use when using a summon (using more than one, this works but it VERY hard to time just right): <br/>\n<br/>\n Let's assume you summon help for an extremely tough boss and you want the full Monty of experience from killing it.  Buff and send in your summon, using any ranged attack (weapon or spells) while your summon has the boss tied up.  As you watch the health of the boss, once it reaches Near Death... unsummon your companion and resume your normal attack (melee, range or spells) to finish it off.  Usually the summon will die before the boss has been injured so fatally but the method I just descibed always assures full XP.  With henchman you need to use a convo to dismiss them and in the heat of battle it is near impossible to do.<br/>\n<br/>\n One thing Max never mentioned about the animal companions is their one major drawback: They can ALL be feared... easily and often!<br/>\n<br/>\n They are weak-willed by nature and are worthless vs. mummies and any other NPC that has a fear aura or can cast any will-based spell on them.  Druids do not have Protection vs. Evil in the spellbook so there is no druid buff to protect them. And vs. dragon fear is even worse.  My clerics all immediately switch to Undead summon as soon as they are available.  Druids are stuck with animals for most of pre-epic unfortunately so, as powerful as they might seem, they serve little purpose when they are running in the opposite direction other than acting as an XP drain.  Once a druid reaches level 13, elemental summons are available so mind effects are no longer a concern and the intrinsic basic weakness of the animal companions permanently in the rearview mirror.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "1:14 PM - Jun 30, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Party_size_penalty\" rel=\"noreferrer\" target=\"_blank\">One year later, here is the exact mechanics of party size penalty:)</a><br/>\n Shortly: for killing a monster you get 4/(3+x) part of the full XP where \"x\" is the party size wich is 1 when you are alone.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orlouge",
      "avatar": "no_avatar.png",
      "timestamp": "11:47 PM - Nov 21, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Maximillian Kane wrote:</cite>\n5- There seems to be a consensus that Shifters are better played as \"general shifters\" because their intent is to be versatile and that playing them that way is better in low magic environments. Inversely, Rakshasa shape can be used for higher magic environments to increase AC by a LOT. I played on a server where a typical Rakshasa had 102 AC as opposed to a Dragon Shape's 88. That was because all items merged and the items were pathetically strong. Other than spamming Empowered Ice Storms, Rakshasa-shaped Druid / Shifters are good for nothing, so if two of those were to engage in combat, it'd be a draw as they wouldn't have any way of killing each other because of the magic immunity.\n</div></blockquote>\n\nLetting aside the fact that it is COMPLETELY UNACCEPTABLE that by 2018 there is no shifter guide posted by HIP, Kail or Max (and ima not run to find cover like Kail did but rather call the rest of the readers for a revolt with torches, so you guys better set aside your wives/kids and jobs to set straight life's priorities), I have some trouble understanding several issues with the quoted statement:<br/>\n<br/>\n1) Why would Rak be better at stacking AC than DS in high magic environments? Afaik all AC bonuses are turned into deflection when shifting so in the end it shouldn't matter the amount of sources as only the highest would be used. I know weapon merge (not sure if item merge as well) stacks for DEX and WIS bonuses, but given the \"pathetically strong\" statement I'm assuming you can cap the AC and scores with just the armor.  <br/>\n<br/>\n2) Even then, would 102 be a good AC in that environment? I mean, again it is difficult for me to imagine how with \"pathetically strong\" items hitting 102 AC would be a problem but I guess it's just an extreme interpretation of the expression from my side; nevertheless, wouldn't then other shapes be even better at stacking AC?<br/>\n<br/>\nBonus questions:<br/>\n<br/>\n3) Which is the best class, regardless the investment needed, to pump Raks AC? I'd say monk or heavy arcane route for EMA but perhaps I'm wrong.<br/>\n<br/>\n4) Has anyone aimed to build a CQC Rak? Like taking feats for pimping the staff combat? Dev crit Rak anyone?<br/>\n<br/>\nI'm sorry for annoying you guys with my love for Rak and thanks in advance for the incoming replies!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:48 AM - Nov 22, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orlouge wrote:</cite>\n<blockquote><div><cite>Maximillian Kane wrote:</cite>\n5- There seems to be a consensus that Shifters are better played as \"general shifters\" because their intent is to be versatile and that playing them that way is better in low magic environments. Inversely, Rakshasa shape can be used for higher magic environments to increase AC by a LOT. I played on a server where a typical Rakshasa had 102 AC as opposed to a Dragon Shape's 88. That was because all items merged and the items were pathetically strong. Other than spamming Empowered Ice Storms, Rakshasa-shaped Druid / Shifters are good for nothing, so if two of those were to engage in combat, it'd be a draw as they wouldn't have any way of killing each other because of the magic immunity.\n</div></blockquote>\n\nLetting aside the fact that it is COMPLETELY UNACCEPTABLE that by 2018 there is no shifter guide posted by HIP, Kail or Max (and ima not run to find cover like Kail did but rather call the rest of the readers for a revolt with torches, so you guys better set aside your wives/kids and jobs to set straight life's priorities), I have some trouble understanding several issues with the quoted statement:<br/>\n<br/>\n1) Why would Rak be better at stacking AC than DS in high magic environments? Afaik all AC bonuses are turned into deflection when shifting so in the end it shouldn't matter the amount of sources as only the highest would be used. I know weapon merge (not sure if item merge as well) stacks for DEX and WIS bonuses, but given the \"pathetically strong\" statement I'm assuming you can cap the AC and scores with just the armor.  <br/>\n<br/>\n2) Even then, would 102 be a good AC in that environment? I mean, again it is difficult for me to imagine how with \"pathetically strong\" items hitting 102 AC would be a problem but I guess it's just an extreme interpretation of the expression from my side; nevertheless, wouldn't then other shapes be even better at stacking AC?<br/>\n<br/>\nBonus questions:<br/>\n<br/>\n3) Which is the best class, regardless the investment needed, to pump Raks AC? I'd say monk or heavy arcane route for EMA but perhaps I'm wrong.<br/>\n<br/>\n4) Has anyone aimed to build a CQC Rak? Like taking feats for pimping the staff combat? Dev crit Rak anyone?<br/>\n<br/>\nI'm sorry for annoying you guys with my love for Rak and thanks in advance for the incoming replies!\n</div></blockquote>\n\nAs neither a druid nor shifter player, I still thought it might be worth noting that Hip did post Zelle's Guide to Shifters V5 further down in this sub-forum.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orlouge",
      "avatar": "no_avatar.png",
      "timestamp": "1:10 AM - Nov 22, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\n<blockquote><div><cite>Orlouge wrote:</cite>\n<blockquote><div><cite>Maximillian Kane wrote:</cite>\n5- There seems to be a consensus that Shifters are better played as \"general shifters\" because their intent is to be versatile and that playing them that way is better in low magic environments. Inversely, Rakshasa shape can be used for higher magic environments to increase AC by a LOT. I played on a server where a typical Rakshasa had 102 AC as opposed to a Dragon Shape's 88. That was because all items merged and the items were pathetically strong. Other than spamming Empowered Ice Storms, Rakshasa-shaped Druid / Shifters are good for nothing, so if two of those were to engage in combat, it'd be a draw as they wouldn't have any way of killing each other because of the magic immunity.\n</div></blockquote>\n\nLetting aside the fact that it is COMPLETELY UNACCEPTABLE that by 2018 there is no shifter guide posted by HIP, Kail or Max (and ima not run to find cover like Kail did but rather call the rest of the readers for a revolt with torches, so you guys better set aside your wives/kids and jobs to set straight life's priorities), I have some trouble understanding several issues with the quoted statement:<br/>\n<br/>\n1) Why would Rak be better at stacking AC than DS in high magic environments? Afaik all AC bonuses are turned into deflection when shifting so in the end it shouldn't matter the amount of sources as only the highest would be used. I know weapon merge (not sure if item merge as well) stacks for DEX and WIS bonuses, but given the \"pathetically strong\" statement I'm assuming you can cap the AC and scores with just the armor.  <br/>\n<br/>\n2) Even then, would 102 be a good AC in that environment? I mean, again it is difficult for me to imagine how with \"pathetically strong\" items hitting 102 AC would be a problem but I guess it's just an extreme interpretation of the expression from my side; nevertheless, wouldn't then other shapes be even better at stacking AC?<br/>\n<br/>\nBonus questions:<br/>\n<br/>\n3) Which is the best class, regardless the investment needed, to pump Raks AC? I'd say monk or heavy arcane route for EMA but perhaps I'm wrong.<br/>\n<br/>\n4) Has anyone aimed to build a CQC Rak? Like taking feats for pimping the staff combat? Dev crit Rak anyone?<br/>\n<br/>\nI'm sorry for annoying you guys with my love for Rak and thanks in advance for the incoming replies!\n</div></blockquote>\n\nAs neither a druid nor shifter player, I still thought it might be worth noting that Hip did post Zelle's Guide to Shifters V5 further down in this sub-forum.<br/>\n<br/>\nCheers\n</div></blockquote>\n\nIm quite aware of it and I already read it, but its Zelle's guide, not his nor Kail nor Max guide. Shifters are one of Hips fav classes, Kail has posted several shifter builds and Max well he seems to understand very well the game so it's a pitty none of them has given their personal insight into the class. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:59 AM - Nov 22, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orlouge wrote:</cite>\n<blockquote><div><cite>Stagmeister wrote:</cite>\n<blockquote><div><cite>Orlouge wrote:</cite>\n<br/>\n<br/>\nLetting aside the fact that it is COMPLETELY UNACCEPTABLE that by 2018 there is no shifter guide posted by HIP, Kail or Max (and ima not run to find cover like Kail did but rather call the rest of the readers for a revolt with torches, so you guys better set aside your wives/kids and jobs to set straight life's priorities), I have some trouble understanding several issues with the quoted statement:<br/>\n<br/>\nI'm sorry for annoying you guys with my love for Rak and thanks in advance for the incoming replies!\n</div></blockquote>\n\nAs neither a druid nor shifter player, I still thought it might be worth noting that Hip did post Zelle's Guide to Shifters V5 further down in this sub-forum.<br/>\n<br/>\nCheers\n</div></blockquote>\n\nIm quite aware of it and I already read it, but its Zelle's guide, not his nor Kail nor Max guide. Shifters are one of Hips fav classes, Kail has posted several shifter builds and Max well he seems to understand very well the game so it's a pitty none of them has given their personal insight into the class. \n</div></blockquote>\n\nOoh, you're almost as needy as me! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /> It may be that they have other things to do, or even want to do. I don't know, some people, eh? If you're that big a fan of the Rakshasa, why not try coming up with your own guide - others have done so to great effect?<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orlouge",
      "avatar": "no_avatar.png",
      "timestamp": "11:41 AM - Nov 24, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\n<blockquote><div><cite>Orlouge wrote:</cite>\n<blockquote><div><cite>Stagmeister wrote:</cite>\n<br/>\n<br/>\nAs neither a druid nor shifter player, I still thought it might be worth noting that Hip did post Zelle's Guide to Shifters V5 further down in this sub-forum.<br/>\n<br/>\nCheers\n</div></blockquote>\n\nIm quite aware of it and I already read it, but its Zelle's guide, not his nor Kail nor Max guide. Shifters are one of Hips fav classes, Kail has posted several shifter builds and Max well he seems to understand very well the game so it's a pitty none of them has given their personal insight into the class. \n</div></blockquote>\n\nOoh, you're almost as needy as me! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /> It may be that they have other things to do, or even want to do. I don't know, some people, eh? If you're that big a fan of the Rakshasa, why not try coming up with your own guide - others have done so to great effect?<br/>\n<br/>\nCheers\n</div></blockquote>\n\nWe should wear fluorescent vests as in France and start a mass protest until Hip, Kail and Max make a shifter guide!<br/>\n<br/>\nWHO ARE WE?! GUILD MEMBERS! <br/>\nWHAT WE WANT? SHIFTER GUIDE! <br/>\n<br/>\nAnyone interested in joining our protest?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "7:46 PM - Nov 25, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orlouge wrote:</cite><blockquote><div><cite>Stagmeister wrote:</cite>\n<blockquote><div><cite>Orlouge wrote:</cite>\n\n\nIm quite aware of it and I already read it, but its Zelle's guide, not his nor Kail nor Max guide. Shifters are one of Hips fav classes, Kail has posted several shifter builds and Max well he seems to understand very well the game so it's a pitty none of them has given their personal insight into the class. \n</div></blockquote>\n\nOoh, you're almost as needy as me! <img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji39.png\" /> It may be that they have other things to do, or even want to do. I don't know, some people, eh? If you're that big a fan of the Rakshasa, why not try coming up with your own guide - others have done so to great effect?<br/>\n<br/>\nCheers\n</div></blockquote>\n\nWe should wear fluorescent vests as in France and start a mass protest until Hip, Kail and Max make a shifter guide!<br/>\n<br/>\nWHO ARE WE?! GUILD MEMBERS! <br/>\nWHAT WE WANT? SHIFTER GUIDE! <br/>\n<br/>\nAnyone interested in joining our protest?</div></blockquote>\n\nLOL! I could join the protest if you'd like heheh!<br/>\n<br/>\nSeriously, though. I think the most qualified person to fulfill this mission is Hip. I thank you for the compliments, they're appreciated. But I have never played a shifter, not even in Single Player, not even in Level up mods, so I'm really in no position to offer any insights into the class, except for the very few things I heard other people say about them. I know they tend to have sub-par AC on WoG, and Hip once told me they excell in low magic, because the DR that some forms provide is quite powerful in places where +3 is the most you can have.<br/>\n<br/>\nI have built a couple of Druid / Shifters, including a NWN adaptation of Cernd from Baldur's Gate, but those builds are much more Druid-playstyle than Shifter. The reason is that the requirement of 5 Druid levels to take the first Shifter doesn't interact well with the Rule of 4 for BAB buildup, so if you go Druid 5 Shifter 10 Monk 5 pre-epic, you lose 3 BAB points compared to a Druid 12 / Monk 4 / Shifter 4, or Druid 16 / Shifter 4. That already handicaps the build severely for me to explore a pre-epic shifter playstyle. Also, Druid spells are pretty much useless before level 7, and their best spells start showing up at 6th spell level, another incentive to go Druid-heavy pre-flop. So by the time you get your Shifter levels up to par, you haven't really used any of the shapes, because they were too low level for the enemies you were facing.<br/>\n<br/>\nSo, let's protest!<br/>\n<br/>\nWHO WILL WRITE THIS GUIDE? I want to learn too!<br/>\n<br/>\nTake it EZ!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orlouge",
      "avatar": "no_avatar.png",
      "timestamp": "4:14 AM - Nov 26, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Maximillian_Kane wrote:</cite>\n<blockquote><div><cite>Orlouge wrote:</cite><blockquote><div><cite>Stagmeister wrote:</cite>\n<br/>\n<br/>\nOoh, you're almost as needy as me! <img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji39.png\" /> It may be that they have other things to do, or even want to do. I don't know, some people, eh? If you're that big a fan of the Rakshasa, why not try coming up with your own guide - others have done so to great effect?<br/>\n<br/>\nCheers\n</div></blockquote>\n\nWe should wear fluorescent vests as in France and start a mass protest until Hip, Kail and Max make a shifter guide!<br/>\n<br/>\nWHO ARE WE?! GUILD MEMBERS! <br/>\nWHAT WE WANT? SHIFTER GUIDE! <br/>\n<br/>\nAnyone interested in joining our protest?</div></blockquote>\n\nLOL! I could join the protest if you'd like heheh!<br/>\n<br/>\nSeriously, though. I think the most qualified person to fulfill this mission is Hip. I thank you for the compliments, they're appreciated. But I have never played a shifter, not even in Single Player, not even in Level up mods, so I'm really in no position to offer any insights into the class, except for the very few things I heard other people say about them. I know they tend to have sub-par AC on WoG, and Hip once told me they excell in low magic, because the DR that some forms provide is quite powerful in places where +3 is the most you can have.<br/>\n<br/>\nI have built a couple of Druid / Shifters, including a NWN adaptation of Cernd from Baldur's Gate, but those builds are much more Druid-playstyle than Shifter. The reason is that the requirement of 5 Druid levels to take the first Shifter doesn't interact well with the Rule of 4 for BAB buildup, so if you go Druid 5 Shifter 10 Monk 5 pre-epic, you lose 3 BAB points compared to a Druid 12 / Monk 4 / Shifter 4, or Druid 16 / Shifter 4. That already handicaps the build severely for me to explore a pre-epic shifter playstyle. Also, Druid spells are pretty much useless before level 7, and their best spells start showing up at 6th spell level, another incentive to go Druid-heavy pre-flop. So by the time you get your Shifter levels up to par, you haven't really used any of the shapes, because they were too low level for the enemies you were facing.<br/>\n<br/>\nSo, let's protest!<br/>\n<br/>\nWHO WILL WRITE THIS GUIDE? I want to learn too!<br/>\n<br/>\nTake it EZ!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk\n</div></blockquote>\nWell, welcome to this side of the angry mob! Bring your torch and lets chant some slogans til Hip and Kail come to the rescue! xD<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:27 PM - Nov 26, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The only problem we've got is that Hip went to the store to get some bread and milk 18 months ago and hasn't come back yet. Meanwhile, Kail appears every so often, but largely in HiPS mode (no relation to other Hip, I presume...)<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orlouge",
      "avatar": "no_avatar.png",
      "timestamp": "8:13 PM - Nov 26, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nThe only problem we've got is that Hip went to the store to get some bread and milk 18 months ago and hasn't come back yet. Meanwhile, Kail appears every so often, but largely in HiPS mode (no relation to other Hip, I presume...)<br/>\n<br/>\nCheers\n</div></blockquote>\n\nDoes anyone knows Hip IRL? Like someone should call him home and tell his wife about the forum kids that he left orphan!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:27 AM - Jul 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Maximillian Kane wrote:</cite>\n<blockquote><div><strong>avado wrote:</strong>I hope Thax doesnt stop by... he did one for the old guild (for Max, iirc).  It would be good if someone could find it and attach it as well.  Thax played druids like I played clerics, if you get my meaning!  </div></blockquote>\n\nWhy would you hope that? Thax's guide was how I learned to play Druids back in the day. Most of the stuff I already knew by then, but there were some interesting tactics I picked up from him. I don't believe his guide was written for me, I think it was there prior to me, but I did read it thoroughly and several times too. If someone takes the trouble of looking that up it'd be great, but then they should also bring in his Dwarven Defender guide, which I also read and recommend as a VERY GOOD one to everyone that tries to understand the class.</div></blockquote>\nFound both: <br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/request306817.html\" rel=\"noreferrer\" target=\"_blank\">All you need to know about Druids: Epic Character Builders Forum Archives</a> by Thaxll'ssyllia<br/>\n<a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/request306326.html\" rel=\"noreferrer\" target=\"_blank\">Dwarven Defender Guide: Epic Character Builders Forum Archives</a> by Thaxll'ssyllia<br/>\n<br/>\nTime for me to have a little read and get educated!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:00 PM - Jul 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Many thanks, Orion.<br/>\n<br/>\nDigging out Thax's DwD Guide was yet another thing on my to-do list. I know it's what first got me playing and building with the class more effectively. I think we can probably find it a home of its own here - after all, and please don't take this the wrong way, it takes a particular sort of weirdo (and I include myself in that) to be searching for info on Druids and DwDs at the same time.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:11 PM - Jul 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Came across Thax's guide when I was looking for ways to ensure my own build was optimised. I then had a look at Max's guide and saw his comment wanting the DD guide. I'm pretty good with the google searches so I added the DD link for the greater good <br/>\n<br/>\nI'm nearly level 40 druid by the way, so I'll be ready to post my finalised build in the Epic Level 40 section soon :) Happy times! I probably should wander into Undermountain before I do the write up. I want to know about all the fuss about the Drow / Orcus / WDK etc...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}