{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "108",
  "name": "Giving feedback to others",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/giving-feedback-to-others-t2355438.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 17,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:26 AM - Apr 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Webshaman wrote:\n<blockquote><div><blockquote><div>I have been a consistent contributor here for about 12 months now, with over 1000 posts, and I have noted the change.\n</div></blockquote>\nFor some reason, I knew this was coming.<br/>\n<br/>\nI abhor reasoning like this. It is unnecessary and uncalled for.<br/>\n<br/>\nOrion, I have enjoyed your posts, and some of your builds.  You like to contribute, and I think that is a good thing.  But using this as a reason...you could have just left all that out and just said \"I have noticed...\" and yeah, perhaps your right, I dunno. But the rest...yes, you have contributed, been involved, etc, but that in and of itself is not a valid argument imo. It does not add any weight to your argument in my opinion.<br/>\n<br/>\nBut this really is the internet, and having a thick skin is very helpful. I don't think Yunim meant anything posted maliciously.  Rather, he is just posting from his experience and opinion.  In fact, I put a lot of faith in Yunim's posts, because from a building aspect for perfecting a build, he is usually right.  I've learned a hell of a lot from his posts, and I for one am grateful that he posts what he does.<br/>\n<br/>\nI often think he voices what others think but remain silent about.  It is one of the reasons I stopped posting, for the most part, about any part of a build - it just seems to lead to trouble. More trouble than it is worth, because I end up spending more time in trying to format it to avoid anyone reacting negatively to it than the actual information itself!<br/>\n<br/>\nI like to help out where I can, and do, but to be quite frank, I think that perhaps we should have two different sections for builds, one PG orientated, and one \"other\" - so as to put a weight on what is important to the build itself at the beginning.  I will freely admit that I am a PGer and love running builds that are really well put together (as I have done in the past) because this is how I learn.  I want to see how the build performs in an actual environment, what the parts do, how it works.<br/>\n<br/>\nI don't see the suggestion as being negative in this case.  He states his opinion, and offers his advise in support of that.  It is not derogatory, it is not negatively framed, it is just what it says.<br/>\n<br/>\nWhy is it \"wrong\" to say \"I don't see the point\"?  and then offer support for that?  And then he makes a suggestion as to how one could build it to accomplish his view.<br/>\n<br/>\nAnyway, this is probably going to blow up and what do I know?  I probably shouldn't have even posted this much.</div></blockquote>\n\nI've moved this discussion to here. I thank Web for opening up this discussion.<br/>\n<br/>\nReally this is about feedback giving, not about Yunim's advice per se its just when I answered with the words \"Because its fun\" it immediately hit a nerve.<br/>\nAnd of course when one has 1000+ posts in 12 months it is human because the exposure is enormous.<br/>\nI apologise I brought it up in my build post and moved it here as a result.<br/>\n<br/>\nThe facts are facts.<br/>\nI post a lot of build drafts and receive a lot of feedback. More than anyone else in the last 12 months.<br/>\nIn addition I have posted more guides than anyone else in the last 12 months.<br/>\nMost of the feedback is very helpful and useful, critical and led to improvements.<br/>\nOtherwise why would I keep contributing if it was a waste of time?<br/>\nHowever a minority is quite unhelpful, denigrating, irrelevant and does not help the OP or the build in question. <br/>\nRacist jokes were made on one occasion. Thread hijacking is much more frequent then when I started to the extent it is frustrating.<br/>\nI have asked for feedback regarding certain matters to have such questions drowned out by highly irrelevant discussions which should be moved elsewhere.<br/>\nThe sheer numbers and output are just facts. I am highly passionate about building and understanding what makes a build great and I wish to keep working hard on this. <br/>\n<br/>\nThe moderators have asked us to treat each other excellently.<br/>\nThey in fact have gone beyond that, and asked us to \"grow up\".<br/>\nI have received private messages from guild members after receiving very withering and unhelpful criticism requesting that I keep trying to post builds<br/>\nMessages were such as 'its not about what is the most powerful' but also what is most fun<br/>\nI get a lot of private messages about feedback about build drafts I write, which is fine, but I hope people can feel comfortable posting on the forum as well.<br/>\n<br/>\nThis is what led to the discussion -&gt; the question was why divine might, and I just wrote it is fun, the build is strong enough, shoot some yellow arrows when saving spells<br/>\nAnd it hit a nerve which a vocal minority seem not to understand.<br/>\nThe purpose of what we do here is for fun, to bring joy and light into others lives<br/>\nIts why I contribute because that is what I enjoy<br/>\nI respect technical expertise but I also respect imagination, creating something that is fun<br/>\nPowerbuilding is just one part of that<br/>\nCreating a realistic character with personality and background that people can relate to is another<br/>\nIt is the essence of PnP DnD<br/>\nBut I do respect people other people are not as keen on that and that is fine<br/>\n<br/>\nI think if members feel they wish to give feedback then it is as simple as treating the other person excellently<br/>\nThis is my suggestion. Happy to hear others regarding this. <br/>\n<br/>\nSay something positive, try to understand their perspective. Say something like \"I like the AB\" or \"I like the saves\" etc etc.<br/>\nI like the character concept, I can relate to this. I like the artwork that was posted. <br/>\nIt makes the other person feel like you understand the perspective of the OP. <br/>\nThat you value the fact they have taken the time to contribute, potentially spend hours preparing a post for us to share this concept and enjoy<br/>\nAnd that is the point, they have prepared a post <em>for us</em> to enjoy. <br/>\nIt has to be genuine and real. If you honestly cannot say anything nice or constructive about a build draft, then why comment at all?<br/>\nFollowing which one can make suggestions as to what you would do differently and why you would do such things.<br/>\nThere is no \"best\" answer to this question, it is simply what is best for the individual playing the build and depends on the environment.<br/>\n<br/>\nYunim made an excellent comment some time ago, about how he felt he has to min-max every build he posts here <br/>\nAnd neglect certain feats such as Epic Fortitude, Epic Skill Foci, Epic Energy Resistances which he would put in his builds which are all excellent choices to balance builds out<br/>\nI feel like he shouldn't have to have felt this way<br/>\nBecause we post here for fun. We enjoy sharing fun builds with others<br/>\nWe play NWN for fun. If you're experienced enough to provide feedback, then try to make it fun for the receiver too.<br/>\nThey spend hours working on this stuff conceptually, acknowledge that<br/>\nEncourage people to post their ideas, builds etc etc<br/>\nI enjoy reading builds, new ideas, new concepts, different ways at looking at things<br/>\nI don't want people to stop posting their original ideas because of fear of withering criticism<br/>\nLike I don't mind seeing an AB 36 build or something like that. Sure it doesn't sound optimal, but I am curious what the person values to have the AB at 36.<br/>\nOr is there something in the build that makes the AB 36 work? Like does the build utilise Taunt and Curse Song for effective +11 AB, maybe that AB is much better than the numbers on the page?<br/>\nLikewise I dont want the criticism discussion to turn into a slug fest distracting from the building itself<br/>\n<br/>\nAnyway some thoughts. Sorry Web but the thick skin stuff is an excuse. <br/>\nIf feel you are good enough to give feedback, then you will be good enough to treat others excellently.<br/>\nThis is my suggested way and maybe others have other ideas, other perspectives.<br/>\nI am of course very interested to hear it<br/>\nWe shall improve and do better.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:41 AM - Apr 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I disagree that having thick skin is an excuse.<br/>\n<br/>\nRather, with a medium as this, where we have very poor ways of expression other than words and a few emotes...<br/>\n<br/>\nIt is really easy to misunderstand, misconstrue, and/or project meaning and innuendo into words written.<br/>\n<br/>\nIt happens quite easily, more easily than one may wish - because as the writer, I may have an idea/ideas in my head when writing a post, and the words put down may not exactly convey what I am thinking, or come across poorly.<br/>\n<br/>\nEspecially when there is past weight of emotion involved.<br/>\n<br/>\nSo yeah, I think having a thick skin is a necessary thing to have when being a part of an internet community, first and foremost.  It helps provide a much needed \"buffer\" against slights, real or imaginary, and just deal with what is being presented.<br/>\n<br/>\nI do believe in being excellent to each other - it is a worthy goal imo.  But I would hope that we do not smother ourselves trying not to somehow slight one another, to the point where we cannot offer advice at all.  Because without feedback occurring, we will not grow.  Our builds will not benefit from the experience(s) of others.  It will merely be an offering to the void.<br/>\n<br/>\nI don't think that was the intention of this forum.<br/>\n<br/>\nSo yes, by all means, let us be excellent to one another, but also, let us grow fabulously thick skins as well!  I, for one, demand hard feedback to anything that I post, that I may learn from the feedback.  And I have plenty to learn, especially in these hallowed halls.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:01 AM - Apr 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Any feedback you get from me is always intended to be helpful, and never an attack.  I used to be like you,. posting lots of builds, but then I was discouraged from \"flooding\" the forums with so many builds.  I don't want to do that to you.  Keep building builds as long as it remains fun for you do to so.  Remember that what looks like an attack might just be poorly-worded constructive criticism.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:03 AM - Apr 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Man, the like button is gone, again.<br/>\n<br/>\nI hate tapatalk.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:11 AM - Apr 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for your words Empyre65<br/>\nI will like Empyre65's response on your behalf Web :) <br/>\nof course it deserves a like too from  me btw <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "11:25 PM - Apr 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you want to play a particular build for fun then you should play it, don't let anybody stop you from playing what you enjoy. However, if you post those builds online you should be prepared to receive feedback, especially considering that they are usually posted on the subforum dedicated to giving people build feedback.<br/>\n<br/>\nIn the comment you are referring to I also said that I don't see the point in making unique builds for the sake of making unique builds.<br/>\n[<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-astonishing-half-elven-prodigy-fighter-12-bard-t2355332-s10.html#p18863\" rel=\"noreferrer\" target=\"_blank\">the-astonishing-half-elven-prodigy-figh ... tml#p18863</a>]<br/>\nAll of my builds, minmaxed or balanced, are fully optimised with practically no wasted class levels, abilities, or feats. This isn't directed specifically at Orion taking Divine Might on his Sorc38/Cler1/Pal1, it applies to a lot of builds on the ECB. Plenty of builds on the ECB max out STR or DEX at the cost of HP, saves, or skills, but then they are not optimised with regards to the class spread or feats. So you end up with builds that are weaker than fully minmaxed builds, yet are not as flexible as more balanced builds. Even when I do make niche builds, such as smiting dire bears, there are usually very few ways to improve them because they are fully optimised.<br/>\n[<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/min-max-druid-bear-form-build-possibility-t2355283.html#p18283\" rel=\"noreferrer\" target=\"_blank\">min-max-druid-bear-form-build-possibili ... tml#p18283</a>]<br/>\n<br/>\nI could post builds that meet all of my personal standards, but not only are those standards fairly strict they also vary considerably between different environments. The main reason I post minmaxed builds online, both on the ECB and on the Blackstone Keep forums, is because it makes things easier for any potential readers. People who follow these build guides do so because they want to play decent builds even if they don't know how to make decent builds themselves, or at least not for their specific environments. Experienced builders won't have a problem reading a minmaxed build and either adapting the build or being inspired by it to make their own build. Inexperienced builders will mainly be looking for a strong, optimised build that they can play with few changes, a minmaxed build is usually best for that. Making a minmaxed build more balanced is a lot easier than minmaxing a balanced build.<br/>\n<br/>\nSomething else to consider is that the ECB mainly deals with PvM builds, and PvM is a lot more forgiving on mediocre builds than PvP is. If I only posted builds that I actually consider decent then I would barely post at all. For example, a Monk4/Pal6/Ass30 is one of the best PvM DPS builds on BSK.<br/>\n[<a class=\"postlink\" href=\"https://blackstonekeep.com/viewtopic.php?f=25&amp;t=3777\" rel=\"noreferrer\" target=\"_blank\">https://blackstonekeep.com/viewtopic.php?f=25&amp;t=3777</a>]<br/>\nThis is a fully minmaxed version, the version I personally use drops 2 STR and 1d6 Death Attack for Blind Fight and 120 HP. On any other server this would be a terrible build, and in fact it doesn't even meet my own standards for BSK builds with regards to minimum AB. However, because it is built for PvM (and very restricted PvM at that) it works extremely well. This takes me to another point, that just because your build works well in the environment you play in doesn't mean it's good in general, but that is veering far from the topic of this discussion.<br/>\n<br/>\nAs I stated in the other thread, I will avoid posting feedback on Orion's builds in the future since that is the easiest way to avoid any further disagreements. I will also continue to post minmaxed builds online since I think it's better for readers, not because of any criticism I would receive from posting more balanced builds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "12:58 AM - Apr 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think everyone needs to remember that written responses don't always convey the emotion that they were written with, and as such can be subject to misunderstandings.<br/>\n<br/>\nThat said unless a response is overly aggressive or abusive, we need to take a deep breathe and consider the intent behind what has been posted - robust discussion and debate is never a bad thing if it is kept civil.  No one should feel that they can't comment or question, it is how we learn.<br/>\n<br/>\nOne other thing to consider is that with all the turmoil going on in the world at the moment, worry and anxiety that has been bottled up in the real world can subconsciously manifest itself in places that are least expected, such as posts on this forum.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "1:34 AM - Apr 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think one of the things that we have to keep in mind when critiquing a build/offering advice on improvements to a build is that there are often two different possibilities (at least) when looking over a build that has been submitted.<br/>\n1. The best way to tweak the current build, optimizing it in terms of feat selection, order of selection, skill point distribution etc, keeping the classes as listed, OR<br/>\n2. Finding a way to do what the listed build is doing, either differently and/or better. Different classes...similar end results...<br/>\n<br/>\nOften I think we find ourselves doing #2, when it is #1 that we should be looking at. Just recently I had a response to a build all typed up...and then I realized, \"this build that I'm suggesting isn't that much like what was posted at all, not really\". Different third class selection, etc...it was how I\"d be currently building a stealth build, NOT an analysis/improvement of what was posted. I went back and changed what I was writing.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:31 AM - Apr 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Yunim wrote:</strong><br/>\nAs I stated in the other thread, I will avoid posting feedback on Orion's builds in the future since that is the easiest way to avoid any further disagreements. I will also continue to post minmaxed builds online since I think it's better for readers, not because of any criticism I would receive from posting more balanced builds.</div></blockquote>\nDiscuss this via PM if you want to sort this out. I have already sent you a PM. <br/>\n<br/>\nOn the topic of PMs, if you think a comment might be overly harsh but needed send the message via PM.<br/>\nOther guild members have done this in the past to excellent results and relationships preserved. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "4:20 AM - Apr 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm against sending build feedback via PM because giving honest criticism is not just for the benefit of the builder to improve their build or their building skills. It serves as a warning for any inexperienced builders who might be unaware of the problems with the build. The ECB is THE place to go for NWN builds on the internet, outside of server-specific buillds posted on server-specific forums. On multiple servers, both PvM and PvP, I have seen the ECB recommended to many people looking for decent builds, with the possible disclaimer that those builds will need to be modified for their particular environment. Experienced builders will be able to see the flaws in the builds posted here, and they might even have their own ways to work around those flaws. However, not everybody who sees these builds is an experienced builder. Normally I add a disclaimer on builds I post that require specific conditions to be worth playing, and sometimes I will even recommend choosing other builds that are better in their own way.<br/>\n<br/>\nHow would you feel if you levelled your Sorc38/Cler1/Pal1 on a tough PvM server, only to discover that your friend playing a Sorc36/Pal3/Monk1 has a much easier time due to their fear immunity, Evasion, and higher AC. Both builds are CHA based, high AC, nuke mages with Divine Shield but the Sorc36/Pal3/Monk1 has a significant advantage in some respects, and pointing that out should be encouraged on a forum dedicated to decent NWN builds. You are obviously an experienced player on WoG and have a good grasp of the tactics that can help when playing this particular build on WoG, but not everybody who reads your build will be aware of those tactics. I myself have levelled builds to 40 (usually the first chars I make on a server) that are absolutely terrible compared to what I could have made if I had known more about the server, so I can imagine this hypothetical frustration.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "4:51 AM - Apr 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I debated responding because the resulting drama frustrates me and I do not play this game to have to deal with drama or frustration, I have real life for that.  But why not, I can just pass on responding further if needed I suppose.<br/>\n<br/>\nFirst, I feel your contributions are valuable <em class=\"mention\">@Orion</em>.  I also feel the sheer quantity of builds is a little overwhelming, but you do an excellent job of balancing the discussion forums which I have always appreciated,<br/>\n<br/>\nNow, on to the flip side I suppose,  I have stopped offering feedback on your builds/posts because I was at the point where I felt I needed to spend an inordinate amount of time reviewing and re-reviewing my posts simply  to ensure your would not find some way to take offence.   <br/>\n<br/>\nI tried a number of ways to approach it which just seemed to escalate the resulting drama rather than defuse it.  I feel I needed to constantly tip toe around my responses and apologise for your assumptions and that I was forced into a specific response template of your choosing to offer any dissenting or opposing opinion.  So, I stopped offering feedback.<br/>\n<br/>\nIn weighing it out, quite honestly, your contributions outweigh mine so my feedback is not a huge loss.  I am a believer in the idea that if you assume the responsibility then you should also have the lion share of the control of direction.<br/>\n<br/>\nI do miss adventuring with you and debating with you but I do not miss the drama.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:06 AM - Apr 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great to hear from you Zanithar!<br/>\nI hope you have fond memories of the times we partied together on WoG as well and talking shop about builds, life and Arelith etc.<br/>\nLow level monks are rough to level up so you have my respect there!<br/>\n<br/>\nI agree with you all the responses and drama is getting to the stage I feel fed up with contributing things to the forum as well. <br/>\nWe come here for fun, to get things out of it. There are lots of great tips regarding clerics and barbarians I remember you helping me with.<br/>\nI do feel strongly I want this place to be fun again.<br/>\n<br/>\nWe can reconnect via PM if you like my door is open. <br/>\nAs Empyre65 and Gkorjax have pointed out sometimes things are conveyed and miscommunicated in a bad way<br/>\nI think PM could have been utilised more often in this circumstance<br/>\n<br/>\nAs mentioned I post a lot. I think there is a dose dependent response after a while with the bad responses. <br/>\nEven if its 90% good and 5-10% bad the 5-10% does wear you down eventually. <br/>\nBut to be honest its worse, I would say its more like 20-40% of responses are completely unhelpful to the builder or the OP, confrontational or poorly considered, and a lot of thread hijacking about matters irrelevant to the build -&gt; start a new thread.<br/>\nIt does annoy me a lot and the moderators have their limits as well in terms of what they have on their plate.<br/>\n<br/>\nThis isn't directed at Zanithar or any one individual at all but just a general comment and observation<br/>\nI think members have to remember it takes quite a bit of time to prepare something to share for us to read post up something<br/>\nBut I don't think its hard to spend 5-10 mins to prepare something thoughtful if you wish to post in response on the forum, out of respect for the person putting in hours of work to contribute something, even if the post seems bad. The ECB is aiming for excellence in building and excellence to treatment of other guild members of course. <br/>\nIf one is time poor or thinks they are providing difficult feedback that could offend, PM is there. I believe difficult conversations are usually better managed in private.<br/>\nPM can also be used for fun conversations as well.<br/>\n<br/>\nAnd complements are good too! What has happened to the culture - \"I like this this sounds powerful\" \"I like that that seems fun\"? <br/>\nI believe a well considered and thoughtful complement takes a lot of skill to give to another person, and if in doubt, a better choice than searching for flaws constantly at exclusion of the bigger picture like the perfectionists we are, it encourages them to contribute and become part of the community and continue contributing rather than wish they could be else where. <br/>\n<br/>\nClassical conditioning learning process or more colloquially Pavlov's dog for those who want to read up on it! <br/>\nCreate a positive feedback loop rather than a negative one where the person eventually decides to disengage but mix the important feedback in there, it takes a lot of skill to give feedback well in my opinion, I am not the master at it but I will keep working at it, hence me opening the discussion here.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:11 PM - Apr 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Years ago, somebody came on my Doom server and started picking my maps apart, pointing out all sorts of flaws.  It was brutal.  I was loving it because it was a gold mine of valuable feedback.   I was sad that he left before seeing and criticizing all of my maps.  The experience made me a better mapper.<br/>\n<br/>\nSure, it feels good when somebody says \"This is great, I love it!\", but it is not useful feedback unless they are specific about what exactly they like about it.  On the other hand, saying \"I hate this\" without being specific is both hurtful and useless.<br/>\n<br/>\nSaying \"Grow a thicker skin\" is rather crude, but underneath that is some good advice.  If you consistently take offense where none is intended, you are the one who is not being excellent to others.  You are pushing away people who are trying to give you valuable feedback.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:40 PM - Apr 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Empyre65 I will explain this in more detail via PM. There has been a noticeable change I have noticed in the forum over the last 3-4 months and it is time I explained this to you.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "1:13 AM - Sep 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">My comment is probably not needed. And a comment from me might probably not add much more then what has amready been said.<br/>\n<br/>\n<br/>\nThat said. I like, agree with a lot of what has been said.<br/>\n<br/>\nAnd its made me think a lot. And I have learned from what has been said here.<br/>\n<br/>\nI think that its not a either or issue.<br/>\n<br/>\nI think that its good to have BOTH a thick skin, be able to take criticism, and to offer both compliments, criticism, help people in a more constructive way.<br/>\n<br/>\nI like that build drafts, ideas, unfinished, completed builds are posted here.<br/>\n<br/>\nI like constructive criticism, feedback on those builds and my builds.<br/>\n<br/>\nI learn a lot from that.<br/>\n<br/>\nAs far as myself, I try not to get offended at critique of my builds.<br/>\n<br/>\nAt times I may disagree with the critique. At times I may talk to much.<br/>\n<br/>\nAnd at times I will have to go back to the drawing board after critque received.<br/>\n<br/>\nBut I appreciate that, because it helps me build better.<br/>\n<br/>\nThat said I do notice that sometimes we get caught up in either only pointing out flaws, an or not only slightly optimizing the build, keeping the CORE, skeleton, framework, etc, of the build the same, not letting, not giving people what they want.<br/>\n<br/>\nYes some builds ideas may not be optimal. They may want A and B and C. And while that may be watered down too much, balanced too much, may not be as optimal, we should let a person have that kind of build, and maybe try to help them to try to improve that build, while keeping the core, skeketon, framework, most of the build almost the same.<br/>\n<br/>\nThat said, I do appreciate that some want to get the best builds possible, and so want to see builds get critiqued, improved, so they can play either their own powerful build or someone else's powerful build.<br/>\n<br/>\nBasically there is nothing wrong with the different approachs, constructive criticism, compliments, etc, as long as there is a BALANCE of those things, and as long as things dont go too far, and as long as respectful, constructive.<br/>\n<br/>\nI try, we all try to do that, but dont always succeed.<br/>\n<br/>\nThe main things I would ask to summarize my too long post.<br/>\n<br/>\n1. Be respectful. I can, and we can all use more improvement in this area.<br/>\n<br/>\nAnd I try, and will continue to try to do that.<br/>\n<br/>\n2. Find something good about the build that like.<br/>\n<br/>\nComplimenting before even giving, or receiving constructive criticism, helps.<br/>\n<br/>\nI try to do that, and will continue to try to do that.<br/>\n<br/>\n3. If someone has A and B and C in their build, let them have their build, even if watered down, not optimal, and if they, you want, you can show them how to optimize that, while keeping the build intact. <br/>\n<br/>\n4. Lets try to work it out so that builders get their cake, A and B and C and get to eat it too.<br/>\n<br/>\n5. Lets stop trying to tell them that they must choose either A or B or C and discard the other 2 letters.<br/>\n<br/>\n6. Lets not get offended, and have thick skins, whether we are posting a build, or whether we are trying to help.<br/>\n<br/>\n7. Discussion, debate is good, but if it gets too heated, or starts getting dramatic, either please use PM, an or drop it, agree to disagree, move on, an or come back to it later, after cool down has happen.<br/>\n<br/>\n8. Please ask for clarification, accept clarification.<br/>\n<br/>\n9. And as important as being respectful, FORGIVE. we are not perfect. We are human. That does not mean being ok with disrespect, abuse, and letting that happen nonstop, a lot.<br/>\n<br/>\nInstead Im talking about if you post a build, and someone critiques it, and you either dont like the feedback, or get offended, either forgive an or let it pass.<br/>\n<br/>\nThere are times once in a while that I sometimes get annoyed, bothered, etc, by criticism of a build or Idea of mine. But instead of holding that against the person, I forgive, forget, that, and because of that, people that have bothered me in the past have helped me after that, and I have appreciated that.<br/>\n<br/>\nIf I, we keep these things in mind, try to do these things, it will improve things. It wont make things perfect. There will still be problems. But we can get along at least a little tiny bit better.<br/>\n<br/>\nI know I have learned a lot from this thread, and know I have a lot to work on, improve on.And I will try to do that.<br/>\n<br/>\nIf I have given offense to the Original Poster an or anybody else here, then I am truly sorry, and thats not my intent<br/>\n<br/>\nAlso I hope that what I have said here is not viewed as offensive, complaining, dramatic, etc.<br/>\n<br/>\nI hope this helps and is received in a the positive way I am intending this.<br/>\n<br/>\nAnd if what I am saying here is problematic, offensive, then I'm sorry, and please forgive <br/>\n<br/>\nJust my too long 2 cents.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:44 AM - Sep 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Can I ask if you are not a native english speaker?<br/>\n<br/>\nOften times, when someone is not a native speaker of a language, information and intent can be hard to both construe and import.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "1:46 PM - Sep 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If I could offer my 2 cents...<br/>\n<br/>\nA long time ago, there used to be an ECB in the Bioware forums. I was a newbie back then, and my builds got DESTROYED by the elders of the time. Of course, when someone offers that kind of feedback, AT FIRST it's a bit disheartening, because you're emotionally invested in your builds, and it may be difficult to have your beloved builds picked apart and scrutinized to the limits. <br/>\n<br/>\nBut, as a result of that, ALL MY BUILDS became better, improved considerably, and I as a builder grew as well. Today I can say that I'm \"on the other side\" of that gap, giving feedback to people and with a firm grasp on what makes a build good. So let me offer a bit of advice for newer players on how to react, when GETTING feedback, not giving it.<br/>\n<br/>\n1- ASK MORE, DEBATE LESS. Basically, stop trying to defend your flawed builds, because that's not going to help you grow.<br/>\n<br/>\n2- READ MORE GUIDES. This one would be excellent for Artorius, for example. Before building a character, you MUST understand the game. If you could start playing a game and make the most uberly powerful build of all time in your first 3 months, the game would be rubbish, and there wouldn't be a guild devoted to discussing builds. Many of the things that Artorius doesn't know or didn't know up until recently are in guides written by me or other elders in the Game Guides section. Just recently, he posted a new topic asking about BAB from levels 21-40, when the information has been in the Game Guides section for at least 5-6 years. Read . More . Guides.<br/>\n<br/>\n3- KNOW HOW MUCH YOU DON'T KNOW AND LEARN TO DEAL WITH IT MORE CONSTRUCTIVELY. Yes, we all have to start somewhere, and it's ok and expected that a novice builder will post a flawed build, then get pretty much heckled for it. Yes, in a perfect world, we would all understand each other, but if you post builds, especially builds that aren't optimal, then you should be ready for criticism. Moreso if you don't read guides and build a toon that has many flaws that it wouldn't have if you had taken the time to read. <br/>\n<br/>\nBack when I sarted, there were very few guides available. Now we have many great guides written by the good elders of this guild. I constantly refer to HipMaestro's Guide for trapping, especially after I take a break from the game and forget a lot of the things I knew like the back of my hand. <br/>\n<br/>\nAnyway, does it have to be fun? Yes, but it has to bring GROWTH to the build and the builder. And growth often happens outside the comfort zone. Today, in hindsight, I'm thankful for all the negative feedback I received. And also, Orion, when you become a better builder and the same experts that were picking your builds apart start looking at your builds and going: \"Great build!\" It's a great feeling! And someday you yourself will look at your first builds and go: \"why the F.... did I do this?\" LOL!<br/>\n<br/>\nCheers!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:34 PM - Sep 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This so reminds me of a Webdesign forum I am a member of and Mod (and have been since the 80s).<br/>\n<br/>\nWe used to have threads like these often - mostly due to \"new\" designers (or those who called themselves designers, or thought that they were designers) - due to constructive feedback that they had received on their new, proud, awesome construct that they had posted for feedback.<br/>\n<br/>\nMostly, though, the postings were really just pontificating their own greatness, and they would get crushed by the feedback they were receiving from real professionals in the business, and that had been in the business for years.<br/>\n<br/>\nThen they would bawl out the \"nasty, unfair, blah blah\" feedback they had received.<br/>\n<br/>\nObviously, they were not realizing that many were attempting to actually help, aid, and truthfully offer feedback on the said posting.<br/>\n<br/>\nI can say that at least we did not back down on that website (it still exists to this day) to \"PC niceness\".  Honest feedback, done by experts with years of experience is a godsend, and is rarely had, especially for free.<br/>\n<br/>\nNow, I do not mean being really nasty and offensive here.  There is a difference between wanting to hurt and bestow misery, and real, honest feedback.  The first is just immature and entirely unnecessary, narcissistic.  The second is worth it's weight in gold.<br/>\n<br/>\nI personally dislike having gold wrapped up in some sort of concealing wrappings.  Just give it to me straight, and help me on my path to better understanding.  Anyone willing to do this for me already has won - you have my complete attention.<br/>\n<br/>\nOh, and how I became a member of that webdesign forum?  Well, I just got out of my design school and I was hot to show what I could do, strut my stuff, show off.  I got ripped to shreds.<br/>\n<br/>\nIn hindsight, my stuff was truly beginners stuff, amaturish.  Full of mistakes that beginners and amatures make.  It was then that I realized how much more I had to learn and grow.  To those who helped me see this and help me on my path, I am immensely grateful, to this day.<br/>\n<br/>\nThis place (ECB forum) is much like that - there are members here that have a firm grasp on building good, solid (I would even say amazing, awesome, etc) builds for NWN.  That they are also willing to impart this knowledge is a godsend to the NWN Community imo.  Not only do they post builds, they help others improve builds, provide others with builds, and even impart their hard-won knowledge in the form of guides, comments, and so on.<br/>\n<br/>\nThat's gold, folks, and should be recognized as such.<br/>\n<br/>\nTo this day, I have not seen one member here post only to hurt and bestow misery.  Quite the contrary, in fact.<br/>\n<br/>\nMax summed it up pretty well here.<br/>\n<br/>\nAnd of course, let us not forget the founding members advice here : be excellent to each other.<br/>\n<br/>\nI like that.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}