{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "300",
  "name": "Build request",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/build-request-t2354282.html",
  "author": "campgod",
  "avatar": "no_avatar.png",
  "replies": 18,
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "5:54 AM - Jul 29, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello everyone, I was thinking about another build. Not sure if it can even be done because it seems like it would need a lot of feats...but that is why I am asking you the masters...lol.<br/>\n So I was thinking of a two-bladed/double axe Dev-crit wanna be sneak. Like a Fighter/WM/With cheese (one lvl of SD or so) or a Halfling with duel-wield daggers (Sai which is in the dagger family on this server can be forged to be like longswords pretty much but needs weapon Pro:Extoic) with Dev-crit.(not sure if I can get enough base stat for good AB with weapon Fin. and have Dev crit?)<br/>\n For PvP, LvL40, I can top out 3 or 4 Stats on gear (+12), Dev-crit is nerfed so it does Double the crit damage instead of death. The server is called Sinfar. I would like as much AC as I can but have good Ab as well. I know its one or the other but...yeah. After +6 items and stat buffs most have at LEAST 55 or higher AB for the PvP games. But most have around 60 and some tanks have 70 AC. So I know theres a few options here but I am looking for a few set-ups. once again thank you for your guys time.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:38 PM - Jul 29, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A couple questions first, campgod...<br/>\n<br/>\n When you say \"sneak\" do you mean stealthy, high-sneak attack or both?<br/>\n<br/>\n Does HiPS even work for PvP on your server? Often if they've nerfed DevCrit they will nerf HiPS as well. Just asking.<br/>\n<br/>\n Are there any items that bestow crit immunity floating around?<br/>\n<br/>\n But you are going to have to decide on PvP or PvM since it will be next to impossible to optimize an all-purpose build. And if PvP, what sort of opponents? WM is pretty much wasted vs. PMs and some polymorph builds (elder elementals, risen lord, etc.). You decide.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:05 PM - Jul 29, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You can't have everything in one build. There is always a trade-off. To get one thing, you have to give up another thing.<br/>\n I could build you a STR-based Human dual-wielder with Dev Crit in 2 ways that I can think of off the top of my head: Rogue / Fighter / WM for more AB and more crits from WM and Tumble AC form Rogue, but the stealth would be poor to nonexistent, or Bard / Fighter / RDD for AB and damage from the RDD STR, and +4 AC from RDD, and Tumble AC from Bard, and no stealth.<br/>\n I could build a DEX-based Halfling dual-wielder with good DEX AC, stealth, and Sneak Attacks, but no Dev Crit, but maybe with Epic Dodge: Rogue / Fighter / SD or Rogue / Fighter / WM (if HiPS is nerfed or disabled).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:07 PM - Jul 29, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would suggest you have a look here for anyone interested, before you even think of attempting a build, Sinfar is a PW that has a lot of altered spells/feats and/or classes.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://forum.sinfar.net/viewtopic.php?f=2&amp;t=5520\" rel=\"noreferrer\" target=\"_blank\"><span style=\"font-size:100%;line-height:normal\">[url=http://forum.sinfar.net/viewtopic.php?f=2&amp;t=5520#p40048]Sinfar - A Beginners Guide</span></a>[/url]<br/>\n<br/>\n By the way i am not sure if that is the correct link Campgod, please correct me if i am wrong. I just found the forums with google-fu and begin reading them some.<br/>\n<br/>\n<br/>\n Here is one question i have for you,<br/>\n<br/>\n What is the total bonusses you can have in your weapons at lvl 40? I am asking this because if you can have something absurd like 8d12 elemental damage in your blades, then it's dexterity's playground for sure.<br/>\n<br/>\n Also keep in mind that in PvP, no matter how cool you might want to look we gernerally never neglect armour class except if you have something similar with the WoG's shield bracers. If for example there are +6 tower shields there, then the 9 AC missing is very hard to justify.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "12:35 AM - Jul 30, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong><hr/>A couple questions first, campgod...<br/>\n<br/>\n When you say \"sneak\" do you mean stealthy, high-sneak attack or both?<br/>\n<br/>\n Does HiPS even work for PvP on your server? Often if they've nerfed DevCrit they will nerf HiPS as well. Just asking.<br/>\n<br/>\n Are there any items that bestow crit immunity floating around?<br/>\n<br/>\n But you are going to have to decide on PvP or PvM since it will be next to impossible to optimize an all-purpose build. And if PvP, what sort of opponents? WM is pretty much wasted vs. PMs and some polymorph builds (elder elementals, risen lord, etc.). You decide.</div></blockquote>\n<div align=\"left\">Sorry I meant the one lvl of SD just to disengage if need be nothing to fancy or high sneak. HiPS is only nerfed as in you must be 5 feet away before going into HiPS or they will still see you and there is a cool down of 12 sec after coming out of it. No crit immune items but yes there are some that play heavy PM casters and some shifters. Not to many Risen Lords however because Heal/mass Heal gets them down quick. I would like a build for PvP.<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "12:41 AM - Jul 30, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>You can't have everything in one build. There is always a trade-off. To get one thing, you have to give up another thing.<br/>\n I could build you a STR-based Human dual-wielder with Dev Crit in 2 ways that I can think of off the top of my head: Rogue / Fighter / WM for more AB and more crits from WM and Tumble AC form Rogue, but the stealth would be poor to nonexistent, or Bard / Fighter / RDD for AB and damage from the RDD STR, and +4 AC from RDD, and Tumble AC from Bard, and no stealth.<br/>\n I could build a DEX-based Halfling dual-wielder with good DEX AC, stealth, and Sneak Attacks, but no Dev Crit, but maybe with Epic Dodge: Rogue / Fighter / SD or Rogue / Fighter / WM (if HiPS is nerfed or disabled).</div></blockquote>\n<div align=\"left\">If you dont mind I would like to see the first two you mentioned. I have played a few sneaks but was looking for some out the gate hard hitting as most of the dev-critters hit very hard and offen and by the time you blink...your dead. just trying to see if there is a way I can get on them first to maybe kill them before they me. HiPS comr from one lvl of SD or 9 lvls of assassin.<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "12:54 AM - Jul 30, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you Valerfor, yes that is the link....sorry I should of posted that first. You can forge a +6 enchanment on any weapon...but there is a PP system they have for forgeing. It all depends on your weapon on how many enchants it can take. Some weapons have a min. of two PP which only allows you to put +6, but then theres others that can have +6,keen and a top of 1d12 ele damage bonus. Like the Sai (in the dagger family) Can hold 7 PP which allow you to put +6 enhancement, keen, 1d12 massive crit, 1d4 ele damage, which is a lot. it all depends on the weapon. Sorry its prob a lot of looking into as far as the server has done...if you cant/dont want to take the time I understand. Thank you guys for all your time though. As far as AC goes, you can get +5 for armor,shield(if using one),necklace(nat)boots(dodge)and another item for the deflection.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "1:08 AM - Jul 30, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">here is a more direct link for the changes they have done if anyone wants.<br/>\n<a class=\"postlink\" href=\"http://forum.sinfar.net/viewtopic.php?f=2&amp;t=682\" rel=\"noreferrer\" target=\"_blank\">http://forum.sinfar.net/viewtopic.php?f=2&amp;t=682</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:53 AM - Jul 30, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>campgod wrote:</strong><hr/><div align=\"left\">Sorry I meant the one lvl of SD just to disengage if need be nothing to fancy or high sneak. HiPS is only nerfed as in you must be 5 feet away before going into HiPS or they will still see you and there is a cool down of 12 sec after coming out of it. No crit immune items but yes there are some that play heavy PM casters and some shifters. Not to many Risen Lords however because Heal/mass Heal gets them down quick. I would like a build for PvP.<br/>\n  </div>\n</div></blockquote>\n<div align=\"left\">But PvP vs. WMs (or any DevCrit build for that matter) means non-caster and safety. Besides they usually just shift into construct or rak when they spot clerics. Anyhoo...</div>\n\n Sorry, campgod... but I have no time to research server tweaks. My time is full enough \"as is\".  It's up to the requester to describe what changes will impact their build in the original post. Distill it down to basics.  Revealing changes bit-by-bit can become frustrating and a waste of the guild's time.  But all this has been already documented in the Request Guidelines that I am sure you are well aware by this time.<br/>\n<br/>\n I would bag the idea of stealth altogether. What you ask is between a rock and a hard place. In order to qualify for DevCrit and develop a respectable DC, you must max STR with ability mod and items. That's far from a DEXer stealth build, neede to win detection checks. I'd consider a bard/rdd/wm except you'll run out of feat space to develop 2-wpn fighting enough. Along with the commitment to STR (am assuming this is in essence a high-damage build request since DevCrit does not kill), comes the typical power vs. agility conflict.<br/>\n<br/>\n So let's examine the +6 environment.<br/>\n<br/>\n Non-DEXer, non-buffed AC will be limited to 10 +1(DEX) + 14plate(armor AC) +6(nat AC from item)+6 (defl AC from item) +6 boots(dodge AC) +1 dodge(feat) +2(armor skin) +4 (tumble)= 50, 54 hasted (tower shield would add +9 in this environment). Means you'll be getting hit at least 10% of the time by any AB of 35 or better while only reciprocating with 5%... HALF. Going with Imp Expertise (AC 64 hasted) pretty much concedes you will be hitting only on 20's since even with a +6 weapon and +6 from capped STR for 45AB-ish typical WM would attack around 40AB or thereabouts with the minimum 2-wpn penalty in force. The good news is that every hit will be a crit. If what you say about 70AC is accurate, then logic dictates that scythe is the best 2-hand WoC (i.e. the highest crit multiplier weapon w/the highest base damage). At least you wouldn't need to soak the extra DEX into feats that will adversely affect your DC. But, regardless of the weapon, the goal is high-damage according to your DevCrit requirement.<br/>\n<br/>\n So, with all that declared, I recommend a ftr/WM5 battle cleric w/div shield to help even the AC battle a bit (and div might, if there's room). I'm figuring you'll be able to cap CHA as you stated. The full BAB free attack from DP is a bonus. No monk cheese? Monk will only net 4 tumble AC since the WIS AC (and monk AC with enough levels) is lost with armor along with the progression from non-monk weaponry. Throw the cheese in the dumpster.<br/>\n<br/>\n Div shield will provide +6 dodge minimum (if base CHA set to 10), excluding Emp Eagle buffs (+3 dodge &amp; div damage). I'd only consider WM7 if you are going against more pedestrian (i.e. 60-ish) ACs. In the case of unreachable ACs, crit range means zilch and that includes wasting of a feat on Imp Crit.<br/>\n<br/>\n So that is my recommendation. If you would like me to hash one out you can compare with others, fine. Some players are not comfortable with playing a self-buffer, so a lot depends on your own play style whether you will get the potential out of it or not. And maybe spells and feats have been toyed with to gimp a battle cleric. Dunno.<br/>\n<br/>\n Further questions in regards to possible server tweaks: What's the dodge cap... 20?  Do items floating around contain damage reduction and/or resistance to divine damage?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:05 AM - Jul 30, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If it is only 1d12 elemental damage then it's alright, that means Strength &amp; EWS work as normal, well they work even better in lower still magic worlds but that's okay too. On the other hand i noticed that almost all things have been nerfed somewhat, the armor bonusses from RDD/PM, the Monk's speed, the tumble AC from tumble ranks, shapeshifters, damage shields and so on, while a few others have been strengthen a bit. Namely Shadow Evade, Arrow of Death and most importantly Barbarian's Rage. So, if you take a build like my \"Dragon Prophet\" and optimize it for PvP (It's almost there anyway), it will have a ridiculous high AB &amp; damage whhile offfering still a high AC. What i want to ask you is, if you are set in that you want a dual-wielder wm/sneak, or you are open to different suggestions like the Barbarian.<br/>\n<br/>\n Take a look at this build by Mick also, he is offering a super-high AB, dual-wield Weapons Master here and although he doesnt have Dev Crit, i think he can kill so fast that you won't mind anyway.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2353598/Kukri-Saint-Fighter-12-WM-25-Rogue-3#.U9g2PrH5dn8\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... 9g2PrH5dn8</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:25 PM - Jul 30, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">^<br/>\n |<br/>\n |<br/>\n what Valerfor just mentioned.  <br/>\n<br/>\n IMO the nerfed DevCrit is just costing too much. Cleave and Grt Cleave are just wasted feats in PvP (as well as WM's Mobility for that matter). You could make up that amount of DevCrit damage in many different ways, maintain a competive AC rating and the stealth (and/or HiPS) with lighter armor (or none, figuring there are +6 robes available) and still be able to use your WoC. Only problem I see are monks who will close ground much faster, perhaps too fast to detect in time.  But that's one of the by-products of your weapon preference.<br/>\n<br/>\n Has Greater Sanctuary been nerfed on your server (in regard to PvP)?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:01 PM - Jul 30, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">From what i see, the duration has been changed to 30 seconds HipMaestro, also True Sight has been nerfed to the ground (duration of only 3 rounds). Something relevant that i saw in the changes is that no shield users basically loose only 4 AC compared to the normal sword &amp; board users. Also Clerics have been nerfed major time. Below are some relevant quotes.<br/>\n<br/>\n<strong>Santuary, Greater Sanctuary:</strong><br/>\n The duration is set to 30 seconds.<br/>\n<br/>\n<strong>True Seeing:</strong><br/>\n The duration is set to 3 rounds.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">No shield or monk AC bonus:</span></strong><br/>\n A character with no shield and that is not focusing on monk abilities gets +2 ac, plus an additional bonus for the weapon in the left hand depending upon its size category (+1 tiny, +2 small, +3 Medium).<br/>\n An unarmed character get +5 ac.<br/>\n<br/>\n<strong>Divine Power:</strong><br/>\n Grants +6 strength, and +1 temporary HP/caster level.<br/>\n Does not stack beyond +12 strength from item bonuses.<br/>\n<br/>\n<strong>Implosion:</strong><br/>\n The DC bonus has been removed and has been lowered by 5<br/>\n<br/>\n<span style=\"color:#0000FF\">Magic Vestment applies to the character, and not the armor/shield. Can not be applied to armor/shields.</span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "10:01 PM - Jul 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Valerfor is correct....Thanks for looking nto that Valerfor. I m open to any build really, I was just trying to get an idea out there and go from there. Thanks you guys for your time. Any other ideas are always welcomed as always.<br/>\n Mick's build is a good looking build. The Kukri's cant hold to many enchants. I could but +6 and some 1d4 ele damage but it wony hit keen as well. Well maybe I could do a +5 with keen but then no ele damage. Is losing on AB woth the keen? Is there another weapon you would pick? Handaxes can hold a little more but then I lose the crit range all together.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:18 PM - Jul 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>campgod wrote:</strong><hr/>\n Mick's build is a good looking build. The Kukri's cant hold to many enchants. I could but +6 and some 1d4 ele damage but it wony hit keen as well. Well maybe I could do a +5 with keen but then no ele damage. Is losing on AB woth the keen? Is there another weapon you would pick? Handaxes can hold a little more but then I lose the crit range all together.</div></blockquote>\n<div align=\"left\">Like any PvP recipe it depends on the opposing ACs you are anticipating.<br/>\n  <br/>\n  Hittable only on natural 20s means crit range is neutralized so the highest base/multiplier combo is best.  For easier to hit foes, the more crits, the more damage per attack as that wider crit range begins to come into play.  For those ACs in the middle that are tough to hit but not impossible without naturals, determine the likely AC min-max and select the best fit of base/multiplier weapon for your AB.  There is no ideal selection for all situations.  There is an expression <em>\"horses for courses\"</em> used in race handicapping.  A horse that can dominate in one environment may fail miserably under another. Same philosophy applies here.  Build specifically for the type of opponent you intend to duel (including WoC) and use another build optimized for the others, </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:23 PM - Jul 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">yeah that's true. Thing is you just never know what you will face, all depends on who is brining what. That is why I like this game, there isn't a best of all build, everyone has a weak spot.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:30 PM - Jul 31, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for all the info HipMaestro, All items in the game are crafted ones that you can forge. Now I do not mind buffing myself at all, say if I went with your Battle Cleric build. One question though, Is it true you have to have at least 26 lvls so I wouldn't be dis-spelled? I know for sure people throw out dis-spells like crazy on people cause of scrolls and potion users.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:06 AM - Aug 01, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If i may put my 2 copper pieces here...<br/>\n<br/>\n HipMaestro's Cleric build is probably the most powerful, but it requires some knowledge of the tactics and maybe in the PvP arena you won't have the time to buff up. That's especially true if we consider the major nerfings at the duration of most spells that don't allow you to pre-buff and enter the fight.<br/>\n Now Mick's build has an AB of 51 or 49/49 while dual - wielding and it has already incorporated in it the feat for exotic weapons so you don't have to change anything at all. What does that mean for you? It means that you can substitute the kukris for <strong>any exotic weapon </strong>(including double-axe or dual--sword) and with the informtion you provided you can have a final (without buffing), constant AB while dual-wielding of 61/61 (49 +6 Str + 6 Ench). Assuming that the best tanks as you said have 70 AC there and most builds have somethinhg like 60-65 AC, with that AB and seven attacks/round you are going to <strong>literally carve them in pieces. </strong>Also you are part rogue and so you have umd, think smart. Keen can be added by a scroll, no need to incorporate that into a keen-able weapon, so you save enhancements for more damage bonuses. Don't bother with overwhelming critical crap, just add elemental bonuses into your weapons or something similar that gets multiplied by your weapon master enhanced precision. Heck, with this build's AB and with the aid of Dodge feat that it already has, you can activate Expertise all the time and still hit your opponents most of the time and hereby gain +6 AC Vs one opponent (that is all you need in a PvP fight).<br/>\n<br/>\n Hope i helped some.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:00 AM - Aug 01, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>campgod wrote:</strong><hr/>Thanks for all the info HipMaestro, All items in the game are crafted ones that you can forge. Now I do not mind buffing myself at all, say if I went with your Battle Cleric build. One question though, Is it true you have to have at least 26 lvls so I wouldn't be dis-spelled? I know for sure people throw out dis-spells like crazy on people cause of scrolls and potion users.</div></blockquote>\n<div align=\"left\">I'll try to hash a battle cleric out to compare with the other builds suggested so far.  Perspective is a good thing ;)<br/>\n<br/>\n The common number of cleric levels used in multiclass builds are typically: Clc 24 (dispel control w/full spell repertoire), Clc 15 (maximum self-buffing effects, not durations though w/up to level 8 spells) or 1 low-WIS non-caster level (or 2 for both feats) for divine AC &amp; damage boosts (as well as a few handy domain masteries) in CHA-focused builds.  Clc24 buffs are only dispelled by a Mord.  With each 1 Clc level less than 24 comes a 5% better chance to dispel via Greater Dispelling until reaching Clc 18 which becomes gradually able to be dispelled by a standard Dispel magic cast... and so on until anyone can dispel your buffs. Sounds like it's going to be important to include at least 24 levels on your server or you'll spend your time buffing instead of fighting.<br/>\n<br/>\n Also, if there are raw scrolls available for scribing, I would fit in Scribe Scroll.  With the Gtr Sanctuary nerf Valerfor described, I would be scribing a boatload of that spell on parchment.  You want to buff with complete autonomy whenever possible and break losing combat trends.  Entering any PvP area without pre-buffing is usually a recipe for failure anyway.  Never wander unbuffed.  And forget about standard Sanctuary.  It's too low level of a spell to win the Will save reliably, especially trying to run past mobs who seem to have an uncanny talent for rolling naturals. ;)</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "8:09 PM - Aug 01, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great thank you guys for all your help! Going to start building Micks build with the changes we talked about and cant wait to see the Cleric build as well!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}