{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "524",
  "name": "Goblin Worg Raider (Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/goblin-worg-raider-arelith-t515428.html",
  "author": "Nives",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "730",
  "posts": [
    {
      "author": "Nives",
      "avatar": "no_avatar.png",
      "timestamp": "3:32 PM - Aug 28, 2011",
      "content": "<div>Allways wanted to make a Goblin worg raider, and i found this was the closest thing to it that i could find. having the dire wolf as a worg while you run around with a scimatar just looks cool ^^ so yeah. basicly a rp build and i allways thougt it was sad none ever made any on arelith. Craft wand can be exchanged for something else if you want, i just thougt it was nice to be able to have a solid income in gold for wands. the wolf should be able to take some hits while you flank the enemy and deal like 140 damage (masterly damask with essences on a favoride enemy) on a critical to the enemies. if you want to take advangde of the ranger's duel wield, i supose you could do the same build just with two handaxes insteath of scimatar.<br/>\n<br/>\nRace: goblin (base race halfling and -2 charisma)<br/>\nClasses: 23 ranger, 7 weapon master.<br/>\nAb with a plain scimatar and +12 str: 42<br/>\nAc: 11 naked<br/>\nend base stats:<br/>\nstr 24<br/>\ndex 13<br/>\ncon 14<br/>\nint 13<br/>\nwis 14<br/>\ncha 6<br/>\n<br/>\nFeats:<br/>\nAnimal companion (dire wolf)<br/>\nBane of Enemies<br/>\ncraft wand<br/>\nDogde<br/>\nepic weapon focus (scimatar)<br/>\nexpertise<br/>\nFavoride enemies: Aberrations, Dwarves, Elves and humans.<br/>\nGreat Strenght III<br/>\nImproved Critial (scimatar)<br/>\nMobillity<br/>\nSpring attack<br/>\nweapon focus weapon (scimatar)<br/>\nweapon of choice (scimatar)<br/>\nWhirlwind attack<br/>\n<br/>\nSkills<br/>\nDicipline 40<br/>\nHeal 35<br/>\nListen 35<br/>\nspot 35</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:00 PM - Aug 28, 2011",
      "content": "<div>It's not a bad idea but we need to see a more complete build in this subforum.  Concepts are better addressed in the Build Request subforum.<br/>\n<br/>\nPlease post only <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=21&amp;t=7\" rel=\"noreferrer\" target=\"_blank\">properly-formatted, complete and tested builds</a> in the Builds section.  Avoid including any item enhancements as it can't be evaluated and compared with other ECB builds.  Otherwise, there is little guild members can do to help you improve your build.  You can use a tool like <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=21&amp;t=8\" rel=\"noreferrer\" target=\"_blank\">Kamiryn's CBC</a> using the halfling race and make the appropriate adjustments to the output to reflect the custom race(s) available on Arelith.  You must have Excel loaded on your machine to use it, however.  If not, you will need to generate the Level-up guide, Skill allocation and final AB/AC/saves/HPs manually... very tedious.<br/>\n<br/>\nAll the best in your building ventures and Welcome to the new Epic Character Builders Guild!</div>"
    },
    {
      "author": "Nives",
      "avatar": "no_avatar.png",
      "timestamp": "7:33 PM - Aug 28, 2011",
      "content": "<div>Thanks for the help ! <br/>\nThougt i don't want to spend to much time on it, as it was more the concept that interested me. haha<br/>\nso you can move it, or delete it. depending on what you fell like.</div>"
    }
  ]
}