{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "154",
  "name": "Quickslot bars: how do you manage them?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/quickslot-bars-how-do-you-manage-them-t2355257.html",
  "author": "233",
  "avatar": "10714033_1519247364.jpg",
  "replies": 20,
  "posts": [
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "10:33 PM - Dec 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello all!<br/>\nI would like all of you (Woggers or not) to share how do you manage the quickslot bars!<br/>\nThis is important, especially when the \"pause\" function is disabled, and you have to avoid panic while searching for that \"heal\" spell when you are low on HP and surrounded by enemies! :)<br/>\nI hope to learn something from you ;)<br/>\n<br/>\nI always use the first bar for potions (max 2 slots), 2 hand weapon, sword and board, ranged weapon, soaking damage belts (swordsman/brawler/archer), other belts if needed (for example, belt of guiding light) and usable feats (e.g. knockdown/expertise/bard or curse song).<br/>\nPower attack is only used to bash doors, so it can be placed at the far right/left of the shift or CTRL bar.<br/>\n<br/>\nIf I use spellswords, I generally leave one of the SHIFT/CTRL bars for the long-term buffs, and the other one for spells usable while fighting or immediately before the fight (heal, SoV, divine power/favor). The more a spell is used, the more is placed into the centre of the bar.<br/>\n<br/>\nNow on to you ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "10:41 PM - Dec 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Aquarius,<br/>\n<br/>\nI use the radial menu for things like power attack and knock down and anything that can be accessed pretty easily.<br/>\n<br/>\nRegards,<br/>\nEltalstro<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:20 PM - Dec 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Aquarius<br/>\n<br/>\nThanks for posting and starting the discussion<br/>\nIts pushed me to think in a structured way how I want to run my quickbar<br/>\nThis is a general idea how I run my quickbar, I don't follow these guidelines strictly, but my game play would be optimal if I did<br/>\n<br/>\nStandard bar: <br/>\nF1-F4 - commonly used feats / spells / abilities (ie Improved Knockdown, Improved Disarm, Bard Song, Stealth Mode / Detect Mode, Taunt, Divine Favor etc etc)<br/>\nF5-F11 - less commonly used but important feats / spells abilities / weapons (ie Expertise, summons including wands, melee weapons / ranged weapons, clarity potions, cure potions/potions of heal, divine might)<br/>\nF12 - screenshots (Steam uses F12 as the screenshot button, so I leave this empty. press H before taking screenshots to remove the GUI for a better screenshot, then press H again to reactivate the GUI)<br/>\n<br/>\nF1-F4 I use the keyboard to be faster, it gets tedious if you are against a knife wielding rogue you want to use improved disarm multiple times (for that sweet +8 AB)<br/>\n<br/>\nCtrl bar:<br/>\nBuffs (spells and items, sequencers)<br/>\nUncommonly used items/spells (for example, rod of resurrection)<br/>\n<br/>\nShift bar:<br/>\nMore buffs, if this is required<br/>\nEquipment swapping ie belts<br/>\nUncommonly used items/spells<br/>\nSometimes if I have a lot of scrolls/spells/pots in a bag, I put the bag in the quickbar to quickly access, for example mords scrolls  etc<br/>\n<br/>\nIn WoG and some other modules there is a rod of extended buffing, which allows multiple buffs to be cast outside of combat very quickly, which will reduce the number of quickbar slots you need to use for such buffs.<br/>\n<br/>\nI find it valuable to have a few things easily accessible on the quickbar for emergencies:<br/>\n<br/>\n- Potions of Heal / Cure Critical (depending on what level you are)<br/>\n- Clarity potions - for mind immunity against certain opponents, or if your mind immunity buff (ie lesser mind blank) gets dispelled<br/>\n- Invisibility potions - to escape<br/>\n- Potions of speed - also to escape<br/>\n- Wands of summoning / summon scrolls - to create a meatshield so you can escape<br/>\n<br/>\nLess common stuff I dont use often (ie Power Attack) I put on the radial menu<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:04 AM - Dec 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">NWN is a single-player game for me, so I can always pause.  I use the quickbar slots for convenience, not necessity.  I put Knockdown / IKD on F1 in place of stealth, which I never use.  I put other often-used feats like Power Attack or Flurry of Blows on F4 and F5, the end and beginning of those sets of 4 F keys.  I usually click on the rest of the slots instead of using the F keys.  Most of those slots are for swapping weapons.  I do frequently use the last few slots for often-used inventory items, like a Lens of Detection, for example.  I rarely (but not never) bother with the Shift and CTRL quickbars.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:37 AM - Dec 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Okay.<br/>\n<br/>\nThis is actually a really important point, along with using the WASD keys for movement and \"dial-a-spell\" Numpad mastery!<br/>\n<br/>\nI put all my most important feats, items, etc on the first Quickbar row.  They are then referenced 1 for 1 with the F buttons at the top of your keyboard.<br/>\n<br/>\nThis makes it really easy to spam KD, Disarm, Called Shot, etc - just hit that F key with your left hand, while you click on the enemy with your right on the mouse.<br/>\n<br/>\nThe other Quickbar rows are just set with whatever I want on them - they are equally fubar to reach in a stress situation - though to be honest, nothing critical should be on them, but sometimes one just has too much stuff to fit on the first bar.<br/>\n<br/>\nIf an Archer, you will want to master WASD movement (or a Monk with Monk speed, for that matter!) so you can effectively \"kite\" your opponents.  The big difference between this way and just using the mouse is that you can \"run and gun\" WITHOUT having to turn, stop, and shoot at your enemy!  That is right, done properly, your character will keep moving and will miraculously shoot out of their back.<br/>\n<br/>\nWorks with Wands as well.<br/>\n<br/>\nNUMpad spellcasting is done with the Numpad.  The radials correspond directionally to each number.  So you can easily \"dial-a-spell\" by just memorizing the button combinations.  This will work for other things as well on the radial, and is one of the only ways left to \"spam\" the counterspell feat (since it cannot be put on a Quickslot due to cheats).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "8:54 AM - Dec 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good tips, Webshaman. WASD when playing zoomed in also adds to immersion imho. Using no map and sneaking in WASD in unfamiliar territory is fun. I've thought about installing a 1st person camera mod and playing WASD style but have never got around to it.<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:23 AM - Dec 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll have to test out the NUMpad spell casting! Great tips Web!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:38 PM - Dec 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is a good discussion.<br/>\nWe probably do many things intuitively and right, but even so I believe there are things we can learn from each other.<br/>\nFor me the normal F-keys (no shift/ctrl) have the functions I use most often and that need to be readily available. That's not different from the rest of you.<br/>\nNumber 2 for me is the ctrl-F row. I just find it easier to hit the ctrl key than the shift key when in the middle of something.<br/>\n<br/>\nWhat I put on the differeent F-keys depends of course on what kind of character I play. A fighter type will have the most important combat feats on F1 - F4. A scout will have Detect Mode there (unless an elf). A stealth character will have stealth on F1. A HIPS'er will also have the attack icon on F2, not because I attack from the function keys, but because pressing it in combat disengages from combat and enables stealth immediately.<br/>\n<br/>\nWith trappers I sometimes put the crafting symbol on F6. When pressing that I come to the crafting dialogue. Craft trap is the bottom dialogue choice, often number 6 (don't have to move the finger far from F6). I use this to speed up crafting traps. If electric traps is option 2 in the next dialogue, and I want to craft average traps (option 2 on the next dialogue again), I can then craft an average electric trap in an instant by pressing F6, 6 with my right hand followed by 2, 2 with my left in quick succession.<br/>\n<br/>\nI usually quick-slot some healing- and clarity potions on F10 - 12. For multiplayer it can be a good idea to have healing kits there as well so you can help fallen comrades that are about to bleed to death.<br/>\n<br/>\nWith casters I put the most important combat spells on the normal F-keys. I put long term buffs on the shift-F row. There are too few quickslots to cover everything when I play casters. Sorcerers want \"every\" spell available with different meta magic.  Characters with more caster classes, like the \"Spirit and Steel\" have just too many spells available to cover with quickslots. So speeding up the radial menu with the keypad can be necessary sometimes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:20 PM - Dec 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">All this sage and sensible discussion is grand, but I'm a lazy sod and hate to click more than I need to (yes, <em>that </em>lazy). Thus my love for innate feats/actions rather than ones I have to actively choose. I therefore tend to use only one line of quickslots (and not playing casters really helps with this), so it's mostly knockdown and stealth that dwell there, the rest being pots, kits, a ranged weapon (if a melee build), and a variety of belts/ boots/ weapons/ etc, depending where I find myself.<br/>\n<br/>\nStill, everyone else comes up with really good advice! A discussion well-raised, Aquarius! (Even if it shows my own troglodyte tendencies yet again.)<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "5:59 PM - Dec 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well.. I play mostly caster types and do things similar to Web and Mick..  <br/>\n<br/>\nThe normal F-keys are my most used attack spells,   Ctrl is always buffs and status fixers (potions of restoration etc) . Shift is (first half) leftover attack spells or long lasting summons, second half is misc things I need but dont want to search for.<br/>\n<br/>\nI never did learn how to ten-key, so never mastered the dial-a-spell radial menu.  So mostly keep my attack spells on an Fkey.   As I dont use Steam, F12 is always an invis of some kind...  just so I can \"exit stage left...\" as quickly as possible...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "8:09 PM - Dec 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Wow, what a great amount of replies!<br/>\nThe thread derives from a conversation Orion and me had through PM, and many people have provided their point of view.<br/>\n<br/>\nThere is a huge amount of knowledge underneath all your replies, and I need time to think what I can steal from you ;)<br/>\n<br/>\nThe numericpad management is nice, although I need time to practice on it. As of now, I only use 0-7-6 for greeting others in the server (greet in NWN:EE).<br/>\nI always use \"point and click\" also to move, instead of WASD keys....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "8:40 PM - Dec 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I remember a player on an RP PW I used to play on somehow had text emotes at the ready. I asked him how he did it but I can't remember. You'd be in the middle of a super tense fight just trying to stay alive and text would appear above his PC like: \"swings his great axe with reckless abandon!\" or \"charges into the fray bellowing a dwarven war cry!\"<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:33 AM - Dec 10, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It was done with a Custom Text Micro:<br/>\n<br/>\n<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Custom_text_macro\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Custom_text_macro</a><br/>\n<br/>\nI use them all the time on my characters.<br/>\n<br/>\nI would suggest putting /tk so that you do not shout.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "9:52 AM - Dec 10, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">YES! Thanks, Webshaman. Wait, did you ever play on Layonara? <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:16 AM - Dec 10, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Not that I am aware of...<br/>\n<br/>\nNWN Sleepplaying, perhaps? <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "10:19 AM - Dec 10, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote:</cite>Not that I am aware of...<br/>\n<br/>\nNWN Sleepplaying, perhaps? <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /></div></blockquote>Lol! I've woken up with my laptop oppen, game still going and my toon patiently waiting to proceed on a number of occasions.<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:42 PM - Dec 10, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Who knows what atrocities occurred?<br/>\n<br/>\nThe Shadow knows! Ahahahahahahaha...oh, ermm...wrong umm...yeah.<br/>\n<br/>\nWe now return to your regularly broadcasted thread!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "3:14 PM - Dec 10, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Pay no attention to the WebShaman behind the curtain.....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:22 PM - Dec 10, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>eltalstro wrote: <a data-post-id=\"17887\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17887&amp;sid=a10d3793de600d03f12e2c37357a1f64#p17887\">↑</a><div class=\"responsive-hide\">Dec 10, 2019</div></cite><blockquote><div><cite>webshaman1 wrote:</cite>Not that I am aware of...<br/>\n<br/>\nNWN Sleepplaying, perhaps? <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /></div></blockquote>\nLol! I've woken up with my laptop oppen, game still going and my toon patiently waiting to proceed on a number of occasions.<br/>\n<br/>\nSent from my G3125 using Tapatalk</div></blockquote>\nOne of the nice things with Baldur's Gate I remember was that if I forgot to hit pause and went off to do something else or dozed off, after a few minutes I'd hear a strident \"Bored!\" from Imoen and that shaped my ideas up pdq<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "7:49 PM - Dec 31, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">One quick bar trick I practice involves Lore Potions, or Identify etc. When getting ready to Identify a haul I'll clear my F1 slot and fill it with the inspect action. Then I'll organize my inventory so that all the new items are in one page. Finally, I will drink the lore potion/cast identify then rapid-fire press F1-&gt;Click Item-&gt;Press Escape-&gt;Repeat. Gotta save that gold at lower levels!<br/>\n<br/>\nSent from my SM-G955U using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:51 AM - Jan 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Holy moly!<br/>\n<br/>\nAnd I thought I was miserly!<br/>\n<br/>\nI dub thee Scrooge!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}