{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "243",
  "name": "THE ABJURANT CHAMPION: (WIZARD 26/ FTR 6/ COT 8)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-abjurant-champion-wizard-26-ftr-6-cot-8-t2354353.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": "16",
  "views": "18.2K",
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:42 AM - Dec 17, 2014",
      "content": "<div>This particular build is a tool of war, plain and simple he is a devastating spell-sword that has no weaknesses. Count the tools at his disposal, fully undispellable arcane caster that has access to both - best epic spells in the game, and then can penetrate SR 32 in a roll of just \"2\", but also he is epic focussed in the school of his choice! And as if those were not enough, he is claded in plate mail and shield, fully capable of unleashing his destractive spells while wearing the heviest of the armours, and he is a master of swords too, with epic specialization and improved knockdown to name a few of his skills. Amongst the spell-swords he is the only one undispellable caster that can look straight in the eyes - and not falter, the dragonic champions of both spell and blade with a natural AB of 39 and 4 attacks/ round. Good saves that become great against magical spells hurled from his enemies, and more skill points than you might know what to do with them, the \"Abjurant Champion\" is a cutting-edge weapon ready to be unleashed. Have fun and good hunting!<br/>\n<br/>\n<strong>THE ABJURANT CHAMPION - (WIZARD 26/ FTR 6/ COT 8)</strong><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i1375.photobucket.com/albums/ag474/valerfor/Dwarf_Wizard_zps2f646522.jpg\"/><br/>\n<br/>\nRACE: Dwarf<br/>\nALIGNMENT: Lawful Neutral (Smite proof)<br/>\nPLAYABILITY: PvM 1-40<br/>\n<br/>\n<strong>STARTING/ ENDING STATS:</strong><br/>\nSTR – 18 (<strong>28</strong>)<br/>\nDEX – 08<br/>\nCON –14<br/>\nINT  – 16 (<strong>20</strong>)<br/>\nWIS – 08<br/>\nCHA – 06<br/>\n<br/>\nHit Points: 364<br/>\n<br/>\nSkill Points: 260 <br/>\n<br/>\nConcentration: 42 (44)<br/>\nDiscipline: 43 (52)<br/>\nSpellcraft: 42 (47)<br/>\nAppraise: 4 (9) cc<br/>\nSpot: 43 (42)<br/>\nTumble: 20 (19) cc<br/>\nLore: 36 (43)<br/>\nHeal: 7 (6)<br/>\n<details><summary>Spoiler</summary>01: Appraise(2), Concentration(4), Heal(4), Lore(2), Spellcraft(4), Save(2), \n03: Concentration(1), Heal(1), Lore(1), Spellcraft(2), \n05: Concentration(1), Spellcraft(1), Save(5), \n07: Concentration(1), Spellcraft(1), Tumble(5), Save(1), \n09: Concentration(1), Spellcraft(1), Save(9), \n11: Concentration(1), Discipline(1), Save(10), \n13: Concentration(2), Discipline(1), Heal(1), Lore(2), \n15: Appraise(1), Discipline(1), Spot(1), Save(3), \n17: Discipline(1), Spot(1), Tumble(5), Save(1), \n19: Discipline(1), Spot(1), Save(9), \n21: Concentration(1), Spellcraft(12), \n23: Concentration(1), Lore(4), Spellcraft(1), \n25: Concentration(1), Lore(2), Spellcraft(1), Save(2), \n27: Concentration(1), Spellcraft(1), Tumble(5), \n29: Concentration(1), Lore(5), Spellcraft(1), \n31: Concentration(1), Discipline(11), \n33: Concentration(1), Lore(2), Spellcraft(1), Save(3), \n35: Concentration(1), Spellcraft(1), Save(13), \n37: Concentration(1), Spellcraft(1), Tumble(5), Save(13), \n39: Concentration(1), Spellcraft(1), Save(23), \n</details>\n<br/>\nSaving Throws (Fort/Ref/Will): 27/ 21/ 22 → 38/ 32/ 33 (saves Vs spells)<br/>\n<br/>\nNaked AC/ Armored AC: 15/ 26 (Full plate and Shield)<br/>\n<br/>\nSelf-Buffed AC: 53 (Full plate and Shield) <br/>\n<br/>\n<br/>\nBAB: 26 (Four attacks)<br/>\n<br/>\nAB: +39/ +34/ +29/ +24 (Battleaxe)<br/>\n<br/>\nDMG: 1d8 +15 / 19-20 x3 (Battleaxe)  <br/>\n<br/>\nSpell Penetration: 30 +1d20 +10 (Mord's)<br/>\nSpellcasting: Wizard 9th Circle of spells (Undispellable)<br/>\nEpic Warding: 1300 Dmg Absorption Shield, Lasts 26 Rounds<br/>\nEpic Mage Armour: +20 total AC, Lasts 26 Hours, +5 Dodge AC stacks<br/>\n<br/>\nLEVELING GUIDE:<br/>\n01) Wizard (01): Still Spell, Scribe Scrolls, Pixie Familiar<br/>\n02) Fighter (01): WF: Battleaxe<br/>\n03) Wizard (02): Extend Spell<br/>\n04) Wizard (03): {INT +1}<br/>\n05) Wizard (04):<br/>\n06) Wizard (05): SF: Evocation, Empower Spell<br/>\n07) Wizard (06):<br/>\n08) Wizard (07): {INT +1}<br/>\n09) Wizard (08): GSF: Evocation<br/>\n10) Fighter (02): Blind Fighting<br/>\n11) Fighter (03):<br/>\n12) CoT (01): Spell Penetration, {STR +1}<br/>\n13) Fighter (04): WS: Battleaxe<br/>\n14) CoT (02): Knockdown<br/>\n15) CoT (03): Greater Spell Penetration<br/>\n16) CoT (04): Improved Knockdown, {STR +1}<br/>\n17) CoT (05):<br/>\n18) CoT (06): IC: Battleaxe, Toughness<br/>\n19) CoT (07):<br/>\n20) Fighter (05): {STR +1}<br/>\n21) Wizard (09): EWF: Battleaxe<br/>\n22) Wizard (10): Great Intelligence I<br/>\n23) Wizard (11):<br/>\n24) Wizard (12): Armour Skin, {STR +1}<br/>\n25) Wizard (13):<br/>\n26) Wizard (14):<br/>\n27) Wizard (15): Great Strength I, Great Intelligence II<br/>\n28) Wizard (16): {STR +1}<br/>\n29) Wizard (17):<br/>\n30) Wizard (18): Auto Still I<br/>\n31) Fighter (06): EWS: Battleaxe<br/>\n32) Wizard (19): {STR +1}<br/>\n33) Wizard (20): Auto Still II, Auto Still III<br/>\n34) Wizard (21):<br/>\n35) Wizard (22):<br/>\n36) Wizard (23): Epic Mage Armour, Epic Warding, {STR +1}<br/>\n37) Wizard (24):<br/>\n38) Wizard (25):<br/>\n39) Wizard (26): Great Strength II, ESF: Evocation<br/>\n40) CoT (08): Epic Prowess, {STR +1}<br/>\n<br/>\nEdit by Mick Dagger: Added skills schedule</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:34 PM - Dec 17, 2014",
      "content": "<div>A dwarven invoker armed with beard and battleaxe!<br/>\n I like the build. A good BAB and strength with casting in full armor. You beat standard toolset SR except on a roll of 1. ESF evocation gives a spell DC that can get the job done in most cases, especially if you buff/max intelligence.<br/>\n A well conceived spell-Axe!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:43 PM - Dec 17, 2014",
      "content": "<div>Thanks Mick, the work involved in this case was a lot but i feel it was worth it at the end. After i posted my \"eldritch disciple\" build, i tinkered again and again with the build's structure, changing the level order, the race and all that is involved till i finally got a fourth attack with the same ab and another epic spell, which i felt it was a big improvement considering how \"tight\" these (26/xx/yy) builds are. I should do an update to the \"eldritch disciple\" as well now that i am thinking of it, and i will as soon as i finish my new smiter. Anyway, long story-short i then considered to change the classes from sorcerer to wizard and with that i choose to go with a dwarf as well not that charisma wasn't a factor in the build, and the results amazed me! This build not only achieves a really good unbuffed ab for a spell-blade but it also makes the acquisition of the epic spells and auto-still feats a cake. By the time you hit level 33 you can cast all your spells in full plate and by the 36th level you have both of your epic spells as well. That being said, i would like to say something about the stat arrangement of this build. If someone feels like he wants to play it more safely and he isn't an adept in handling mage-knights then he can start with 16 strength and 18 constitution gaining a total of \"80 hp's and 2 fort\" and loosing only \"1 ab and dmg\" from his attacks. It is more than a fair trade i think.<br/>\n<br/>\n Now, about the evocation focus of this build, the reason was twofold. First it was for the theme of being a war-mage and all and nothing feels more flashy and destructive than multiple fireballs and lightnings strikes coming from your fingertips. The real reason though is that i always go with selected schools based on the maximum dc that i can have with my spells. For example necromancy in NwN1 is always the most powerful school of magic but when you cannot have a close to maximum dc it is often better if you select a magic school that focuses on a weaker save than fortitude. Evocation does exactly that and it even has a couple of tricky spells that can stun-lock enemies forever. Pay careful attention to spells like \"thunderclap\" that has three simultaneous saves and practically it is guaranteed to have an effect on the battlefield. Another very powerful stun-lock effect is \"bigby's clenched fist\", normally people don't use that one but it is an evocation spell that has a saving throw for the stun effect of it (not for the dmg part) and when you have to make such a save every round a single failure often means to lose the fight. Sunburst is another very powerful \"aoe\" spell that has a reflex save and permanently blinds your opponents plus it destroys undead and even \"firebrand\" is very destructive when you lose your save against it. Last one spell that i wanted to mention is \"prismatic sprey\" i think this spell needs no explanation but in case you have not used it before, then you should start now if you have an evocation focus. Most often than not when i play in epic levels (this is where the spell dc's matter the most) i meet powerful giants and dragons and undead sorcerers as enemies that have really good fortitude and will saves but really weak reflex ones. Having an evocation focus can have a devastating effect on these foes, yes-you have your no-save spells at all (igms, ice storm, bigby's vi and vii, e.t.c) but you also have use for some others now. Ultimately though it is just a matter of preference, you can choose your spell focus freely of course, i just made an argument for the evocation focus based on my experience. Otherwise, necromancy has and will always be a very strong contender with multiple save-or-suck effects.<br/>\n<br/>\n If however, you use your spell slots only for no-save spells and buffs, then you can always change the spell-focuses with \"maximize spell\", \"craft wands\" and \"epic spell penetration\", those would be my choices. I hope i did not make you all bored with my long monologues at least ;)<br/>\n<br/>\n  </div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "9:03 AM - Jan 04, 2015",
      "content": "<div>I'm just making sure I understand you correctly; when you say focus, you mean taking spell focus in schools as a Generalist, and not choosing to be an Evoker or Necromancer and limiting other schools of magic - correct?<br/>\n<br/>\n I'm playing this guy now, I'm liking him a lot! Very inspiring :D<br/>\n<br/>\n<br/>\n -JimDandy</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:25 PM - Jan 04, 2015",
      "content": "<div>Well, you can make him an illusionist and you will only miss a couple of spells from the Enhancement school. Traditionally War Wizards dislike this school anyway, and the 9 extra spell slots will come in handy. The spell focusses are indepentent of that choice, chose a school and focus on it, i suggest either Necromancy orr Evocation for him. If you like the theme \"Master Of Dark Arts\" it is perfectly suitable to make him an Illusionist with ESF in Necromancy for example. Then dye your full plate in black and unleash hell with both Axe and spells!<br/>\n<br/>\n I am glad that you like him ;)</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "7:17 PM - Jan 07, 2015",
      "content": "<div>I'd consider swapping levels 21 and 31 to get EWS in earlier (EDIT: I see now that it would make it hard to keep the Discipline skill somewhat up to date). The idea of no-save spells is appealing as it frees up feat slots for more combat oriented ones. Also, I'm toying with a Human version for an additional feat and more skill points (not much to do with those, honestly). Couple of questions:<br/>\n<br/>\n 1: To your knowledge, is there a list of the no-save spells? I wondered, too, if your definition of no-save spells include the spells where the target take half damage on a successful save (and some spells read \"partial\") as it's still guaranteed a result (unless it's a successful reflex save and the target has improved evasion, I suppose).<br/>\n 2: Would you consider Power Attack and Cleave (and even Great Cleave) to be worthwhile investments? I could imagine quite a few smackdowns after AoE spells.<br/>\n<br/>\n<br/>\n -JimDandy<br/>\n<br/>\n PS: Where I play, the Heal skill is useful, so I swapped Lore for Heal. In the Human version, I could do both as there's not much to spend the points on.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:59 PM - Jan 07, 2015",
      "content": "<div>Right Jim, the seperation in the Fighter levels was made for the Discipline dumps. As for the Human vversion you would gain simply a feat more and 43 skill points that you don't really need them in this build. Two more feats would be useful but one more is half-way stuff, i suppose you could use it for \"maximize spell\" or \"craft wands\". Skill points you have already more than you need and you don't even need to cc skills for rogue abilities because you have the Pixie who will take care of all your rogue needs. Therefore, it is in my opinion that unless you need to be Human for RP purposes or personal preference, staying as a Dwarf is much better. Sad thing that Dwarfs make better Mages than Elves eh? Or anyone else for that reason, except maybe Gnomes for PvP (they escape evard's).<br/>\n<br/>\n Power attack and Cleave, i do not think they would do much in this build, remember you have your spells too. I am sure taking them in a Fighter but here if i had two more feats i would consider taking \"Gsf\" in another spell school or something similar.<br/>\n<br/>\n Now to your last and more important question, i am gonna give you a good list and always consider your server's alterations okay?<br/>\n<br/>\n a) Magic Missile --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Magic_missile\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Magic_missile</a><br/>\n b) Melf's Acid Arrow --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Melf%27s_acid_arrow\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Melf%27s_acid_arrow</a><br/>\n c) Negative Energy Burst (No save for Strength Dmg) --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Negative_energy_burst\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Negative_energy_burst</a><br/>\n d) Ice Storm (No save - No evasion) --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Ice_storm\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Ice_storm</a><br/>\n e) Isaac's Lesser Missile Storm --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Isaac%27s_lesser_missile_storm\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Isaac%27s_les ... sile_storm</a><br/>\n f) Bigby's Interposing Hand (+10 unccaped AC for you) --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Bigby%27s_interposing_hand\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Bigby%27s_interposing_hand</a><br/>\n g) Bigby's Forceful Hand (The so-called Rogue's Bane) --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Bigby%27s_forceful_hand\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Bigby%27s_forceful_hand</a><br/>\n h) Isaac's Greater Missile Storm --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Isaac%27s_greater_missile_storm\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Isaac%27s_gre ... sile_storm</a><br/>\n i) Bigby's Grashping Hand (Another very nasty hand) --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Bigby%27s_grasping_hand\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Bigby%27s_grasping_hand</a><br/>\n j) Bigby's Clenched Fist --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Bigby%27s_clenched_fist\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Bigby%27s_clenched_fist</a><br/>\n k) Horrid Wilting (This has a save but no evasion and hits for magical Dmg) --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Horrid_wilting\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Horrid_wilting</a><br/>\n l) Bigby's Crushing Hand --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Bigby%27s_crushing_hand\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Bigby%27s_crushing_hand</a><br/>\n m) Mord's Disjunction (On every major opponent) --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Mordenkainen%27s_disjunction\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Mordenkainen%27s_disjunction</a><br/>\n n) Black Blade Of Disaster (Use with Greater Sanctuary) --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Black_blade_of_disaster\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Black_blade_of_disaster</a><br/>\n o) Wail Of the Banshee (This has a save but it's guaranteed at least some will die, especially if you have Esf) --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Wail_of_the_banshee\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Wail_of_the_banshee</a><br/>\n<br/>\n p) Shapechange (Golem form) --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Shapechange\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Shapechange</a><br/>\n q) Elemental Shield --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Elemental_shield\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Elemental_shield</a><br/>\n r) Mestil's Acid Sheath --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Mestil%27s_acid_sheath\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Mestil%27s_acid_sheath</a><br/>\n<br/>\n s) Time Stop (Needs no explanation) --&gt; <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Time_stop\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Time_stop</a><br/>\n<br/>\n There are other spells as well but those are really good no matter your school focus. Your spell focus will indicate some other spells that you will have a relatively good DC and you should pick them. The rest of your spells should be for self-buffs and back-up good old blasting. Such spells are \"True Sight\", \"Mind Blank\", \"Shadow Shield\", \"Protection from Spells\", Spell Mantle\", \"Protection from Elements\" and so on.</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "6:38 PM - Jan 08, 2015",
      "content": "<div>Terrific information, this is! I've been having a blast playing my first serious spellblade.<br/>\n<br/>\n I ended up being able to pick a Tiefling subrace where I play, so I get all the Human benefits as we talked about, and ability score modifiers of +2 DEX, +2 INT, -2 CHA, and 5 resistance to cold, fire, and electricity (ECL +1). That tipped it over from Dwarf for me, and it fits my RP feelings.<br/>\n<br/>\n I decided to pick up Craft Wand after reading about all the fantastic spells I can prepare (and at such high caster levels!). Wands are rare where I play, and only the character that created the wand can use it, so this ended up being a huge boost to the arsenal of the character. I felt I could ditch some CON because of the resistances and the backups in Craft Wand, so stats are:<br/>\n STR 18 (40)<br/>\n DEX 10<br/>\n CON 12<br/>\n INT 18 (20)<br/>\n WIS 8<br/>\n CHA 6<br/>\n<br/>\n Thanks for the list of spells and the feedback that helped me make this my own character where I play. :) I'll try out that Half-orc monk of yours next *grins*.<br/>\n<br/>\n<br/>\n -JimDandy</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:00 PM - Jan 08, 2015",
      "content": "<div>Glad to be of assistance,<br/>\n<br/>\n By the way, Craft Wands is a very nice feat to have, all those buffs at 15th CL for free and then you keep the spell-slots for other uses, good choice!<br/>\n<br/>\n * I think you meant (30) STR and not (40)! Right? That should give you (1AB) more as well, making him a natural (40AB) spell-sword, excellent!</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "9:29 PM - Jan 08, 2015",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>Glad to be of assistance,<br/>\n<br/>\n By the way, Craft Wands is a very nice feat to have, all those buffs at 15th CL for free and then you keep the spell-slots for other uses, good choice!<br/>\n<br/>\n * I think you meant (30) STR and not (40)! Right? That should give you (1AB) more as well, making him a natural (40AB) spell-sword, excellent!</div></blockquote>\n<div align=\"left\">30 STR, correct - I was thinking 40 AB :)</div></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "9:17 PM - Jan 09, 2015",
      "content": "<div>I have always wanted to play a \"spell-sword\" and was looking at this one and your \"BATTLE SORCERESS: (SORCERER 26/ PAL 4/ COT 10)\" what's really the main difference and what do you like the best?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:06 PM - Jan 09, 2015",
      "content": "<div>This one is a brutally efficient spell-sword plain and simple. If you like Wizards over Sorceress then this is the build for you. If however you do like the \"I need a spell and i need it now\" feauture that Sorceress has then she is better. The Sorceress has less knoown spells but she can cast them without mercy whenever she wants them. It is simply a personal preference, and I for example like to play both styles equally. Note however, that when the \"<strong><span style=\"color:#800080\">BATTLE SORCERESS</span></strong>\" is buffed, her stats are <strong>all higher</strong> than the \"<span style=\"color:#0000CD\"><strong>ABJURANT CHAMPION'S</strong></span>\" exluding his <strong>ESF and Combat Feats.</strong> He is taking everything earlier though and he has more Constant Power so to say. Different builds for different tastes but both equally devastating for their opponents, and that is what makes them fun to play.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:38 PM - Jan 09, 2015",
      "content": "<div>Ok thanks, I'll give them both a try lol. Starting with him first.</div>"
    },
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "6:00 AM - Jan 12, 2015",
      "content": "<div>This is the most fun character I've leveled up in a while, I have to say! I was wondering, however, what are the pros and cons of high AB vs multiple attacks - isn't the 4th attack always kind of weak? Is it a reliable crit-change, perhaps with True Strike? Just wanting to understand this as I'm playing this build and wondering what I like the best about it :)<br/>\n<br/>\n Thanks!<br/>\n<br/>\n -Jim</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:24 AM - Jan 12, 2015",
      "content": "<div>It's good to play a strong spell-sword eh? ;-)<br/>\n<br/>\n And No, the more attacks you have the better it is, no-matter-what. That's because NWN 1 works in \"Timed Attacks\" you will know them better as \"Flurries\". Each Round consists of 3 such flurries and your attacks are always divided by that number with the extra attacks going first. If you have 4 attacks then your character will do a rapid two-attack motion and then continue with the third and finally with your forth attack. Now a character that has 4 normal attacks and can haste himself like this one, will attack like this: 2 - 2 -1. So what you see is a very effective Twin Double-Strike attack attack followed by your last Fifth attack at the end. Your last attack usually won't hit, correct, but it pushes the first four of them into twin-attack sequences and because of your high-ab for a spell-sword, most of them hit their targets making you happy. Or perhaps, i don't know what i am talking about, it's late... :-)<br/>\n<br/>\n  </div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "10:52 PM - Jan 12, 2015",
      "content": "<div>I am enjoying playing this toon as well. I lvled him pretty fast, there wasn't much trouble with this one.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:06 PM - Nov 27, 2015",
      "content": "<div>Here the other day I tried to puzzle together a spellsword. I didn't have The Abjurant Champion in mind at all, but what I ended up with was very close, so I see no reason to post it as a unique build.<br/>\n<br/>\nSpoiler [+]<br/>\n<br/>\n Fighter(5), Wizard(27), Champion of Torm(8), Human<br/>\n  <br/>\n STR: 18 (30)<br/>\n DEX: 8<br/>\n CON: 12<br/>\n WIS: 8<br/>\n INT: 16 (19)<br/>\n CHA: 8<br/>\n  <br/>\n 01: Fighter(1): Expertise, Weapon Focus: Scimitar, Knockdown<br/>\n 02: Fighter(2): Power Attack<br/>\n 03: Fighter(3): Cleave<br/>\n 04: Fighter(4): STR+1, Weapon Specialization: Scimitar, (STR=19)<br/>\n 05: Wizard(1): {Scribe Scroll}<br/>\n 06: Wizard(2): Toughness<br/>\n 07: Wizard(3)<br/>\n 08: Wizard(4): STR+1, (STR=20)<br/>\n 09: Wizard(5): Empower Spell, Still Spell<br/>\n 10: Wizard(6)<br/>\n 11: Champion of Torm(1)<br/>\n 12: Wizard(7): STR+1, Spell Penetration, (STR=21)<br/>\n 13: Champion of Torm(2): Blind Fight<br/>\n 14: Champion of Torm(3): {Smite Evil}<br/>\n 15: Champion of Torm(4): Greater Spell Penetration, Improved Critical: Scimitar<br/>\n 16: Wizard(8): STR+1, (STR=22)<br/>\n 17: Champion of Torm(5)<br/>\n 18: Champion of Torm(6): Maximize Spell, Improved Knockdown<br/>\n 19: Champion of Torm(7)<br/>\n 20: Fighter(5): STR+1, (STR=23)<br/>\n 21: Wizard(9): Epic Weapon Focus: Scimitar<br/>\n 22: Wizard(10): Great Intelligence I, (INT=17)<br/>\n 23: Wizard(11)<br/>\n 24: Wizard(12): STR+1, Armor Skin, (STR=24)<br/>\n 25: Wizard(13)<br/>\n 26: Wizard(14)<br/>\n 27: Wizard(15): Great Intelligence II, Great Intelligence III, (INT=19)<br/>\n 28: Wizard(16): STR+1, (STR=25)<br/>\n 29: Wizard(17)<br/>\n 30: Wizard(18): Great Strength I, (STR=26)<br/>\n 31: Wizard(19)<br/>\n 32: Wizard(20): STR+1, Automatic Still Spell I, (STR=27)<br/>\n 33: Wizard(21): Automatic Still Spell II<br/>\n 34: Wizard(22)<br/>\n 35: Wizard(23): Automatic Still Spell III<br/>\n 36: Wizard(24): STR+1, Epic Prowess, (STR=28)<br/>\n 37: Wizard(25)<br/>\n 38: Wizard(26): Epic Spell: Epic Mage Armor<br/>\n 39: Champion of Torm(8): Great Strength II, Epic Weapon Specialization: Scimitar, (STR=29)<br/>\n 40: Wizard(27): STR+1, (STR=30)<br/>\n<br/>\n Hitpoints: 318<br/>\n Saving Throws (Fortitude/Will/Reflex): 26/22/21<br/>\n Saving Throw bonuses: Spells: +9<br/>\n<br/>\n BAB: 26<br/>\n AB: 40 (melee)<br/>\n AC (naked/mundane armor &amp; shield): 15/26<br/>\n<br/>\n Spell Casting: Wizard(9)<br/>\n<br/>\n<br/>\n Skillpoints: 271<br/>\n Concentration 43(44), Discipline 42(52), Heal 27(26), Search 17(21), Spellcraft 43(47), Spot 42(41), Tumble 20(19)<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  </div>",
      "author-color": "#AA0000"
    }
  ]
}