{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "744",
  "name": "lvl 1-20 sneak :)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/lvl-1-20-sneak-t2355277.html",
  "author": "NWNewbie",
  "avatar": "no_avatar.png",
  "replies": "7",
  "views": "2.0K",
  "posts": [
    {
      "author": "NWNewbie",
      "avatar": "no_avatar.png",
      "timestamp": "11:24 AM - Dec 24, 2019",
      "content": "<div>Im currently playing on POTM and I would like to play a dungeon rogue ( clear locks and traps/set traps)  that uses 2 whips ( will be possible on the server next patch). Im completly new to the game and dont want to end up doing beginner mistakes that will gimp my char as it climbs the levels.  Id love for it to be a dwarf rogue, there iven is a subrace that gives +2 Dex +2 Con -4 Int -4 Cha as a dwarf, but perhaps the int penalty would make the build a bit weak? The server is quite low magic and I have not seen a single + stat item ingame so far.<br/>\n<br/>\nAny help is apreciated</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:09 PM - Dec 24, 2019",
      "content": "<div>Welcome to the guild!<br/>\nPOTM is indeed low magic. I have not played there in quite a while, but I did enjoy the horror setting and the company of some very good roleplayers.<br/>\nAs for character building, the PW has some custom features. Some of the skills are different and you get a lot of extra feats. The idea behind the latter is that you should have enough feats for necessary combat feats and feats selected on basis of RP choices.<br/>\nWith the low magic, strength based characters are often better than dexterity based ones. Self buffers benefit from their access to magic. Monks benefit from their many supernatural abilities etc. <br/>\nI have little to no experience with rogues there though.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:00 PM - Dec 24, 2019",
      "content": "<div>Seasons Greetings NWNewbie<br/>\n<br/>\nI know nothing about the POTM server except the information that has been posted but based on the information from your post and Mick Dagger's response I have created this build<br/>\n<details><summary>Spoiler</summary>Rogue(14), Fighter(4), Champion of Torm(2), Dwarf\nSTR: 16 (20)\nCON: 16\nINT: 14\n\n01: Rogue(1): Luck of Heroes\n03: Rogue(2): Weapon Focus: Whip, {Evasion}\n05: Fighter(2): Two-Weapon Fighting\n07: Fighter(4): Weapon Specialization: Whip\n09: Rogue(5): Iron Will\n11: Rogue(7)\n13: Champion of Torm(1)\n15: Rogue(10): Knockdown, Crippling Strike\n17: Rogue(12)\n19: Champion of Torm(2): Blind Fight\n\nHitpoints: 204\nSaving Throws (Fortitude/Will/Reflex): 16/8/18\nBAB: 16\nAC (naked/mundane armor/shield only): 17/26\nAlignment Changes: 0\nDisable Trap 23(27), Discipline 22(27), Hide 15(18), Listen 23(22), Move Silently 15(18), Open Lock 23(26), Search 8(10), Set Trap 23(28), Tumble 20(23), UMD 22(20)\n\n02: Discipline(5), Save(5), \n04: Disable Trap(1), Hide(1), Listen(1), Move Silently(2), Open Lock(1), Search(1), Set Trap(1), Tumble(1), UMD(1), \n06: Discipline(1), Save(4), \n08: Disable Trap(4), Listen(4), Open Lock(4), Set Trap(1), Tumble(3), Save(1), \n10: Disable Trap(1), Listen(1), Open Lock(1), Set Trap(1), Tumble(1), UMD(5), Save(1), \n12: Disable Trap(1), Hide(1), Listen(1), Move Silently(2), Open Lock(1), Set Trap(1), Tumble(2), Save(2), \n14: Disable Trap(2), Listen(2), Open Lock(2), Set Trap(2), Tumble(2), \n16: Disable Trap(1), Hide(3), Listen(1), Move Silently(2), Open Lock(1), Set Trap(1), Tumble(1), \n18: Disable Trap(1), Listen(1), Open Lock(1), Search(1), Set Trap(1), Save(5), \n20: Disable Trap(2), Listen(2), Open Lock(2), Set Trap(2), UMD(5), </details>\nStrength based for better damage output in a low magic environment as per Mick Dagger's information.<br/>\nMaxed disable trap / open lock / set trap as you have recommended, perhaps I have gone overboard with those skills but I would need to know more about your environment before I would feel comfortable adjusting them down (to invest further into stealth).<br/>\nUMD 20 to use scrolls/wands/special items and Tumble 20 for +4AC<br/>\nFighter levels for discipline skill dumps (to give you resistance you being knocked down or disarmed), also so you can equip shields and medium/heavy armor if you wish, also to make it easier to access improved two weapon fighting, and weapon specialisation is handy to deal more damage<br/>\nCoT for a slight boost to saves and further discipline skill dumps<br/>\nListen skill to detect enemies around corners<br/>\nStealth so you can sneak attack em <br/>\nImproved knockdown so you can sneak attack em after you've bashed em on the floor, which will be significant with 6 attacks per round (7 if you are hasted) and 7d6 sneak attack / hit<br/>\nLuck of heroes, Iron Will and Slippery Mind to try to mitigate the biggest weakness of the build, the will save. Dwarf also grants +2 to saves against spells/spell like abilities so in practice the will save I have got up to 10<br/>\n<br/>\nIf you choose the subrace with the build I designed you will gain about 20hp perhaps but lose slightly over 40 skill points, and you would have to give up stealth skills as a result, also improved knockdown<br/>\n<br/>\nThe Will save being poor is normal for rogue builds, like I mean its one of the most powerful classes in the game, we can't give it everything. That being said I do play a lot of low save builds, mentored in part by other players, particularly Gkorjax. The big way I manage a poor will save is clarity potions, UMD, items or party members. I dont know if you have easy access to clarity potions, or if you are playing in a party with wizards who can cast lesser mind blank on you or you have access to lesser mind blank scrolls/wands, or even if there are fear immunity belts or mind immunity items, it doesn't sound like it, and with the bonuses in the build in practice the will save ends up around 10 which isn't too bad considering<br/>\n<br/>\nI'll stop there I'm postulating with a bit of missing information here, but made my best guess at what might suit, and perhaps others /myself might refine it further based on any further information I receive</div>"
    },
    {
      "author": "NWNewbie",
      "avatar": "no_avatar.png",
      "timestamp": "1:34 PM - Dec 24, 2019",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote: <div class=\"responsive-hide\">Dec 24, 2019</div></cite>Welcome to the guild!<br/>\nPOTM is indeed low magic. I have not played there in quite a while, but I did enjoy the horror setting and the company of some very good roleplayers.<br/>\nAs for character building, the PW has some custom features. Some of the skills are different and you get a lot of extra feats. The idea behind the latter is that you should have enough feats for necessary combat feats and feats selected on basis of RP choices.<br/>\nWith the low magic, strength based characters are often better than dexterity based ones. Self buffers benefit from their access to magic. Monks benefit from their many supernatural abilities etc. <br/>\nI have little to no experience with rogues there though.</div></blockquote>\nThank you for the welcome and I agree about POTM!<br/>\n<br/>\nCan I be so brave to ask what a POTM monk build would look like? Ive been playing with the tought of one aswell :)</div>"
    },
    {
      "author": "NWNewbie",
      "avatar": "no_avatar.png",
      "timestamp": "1:35 PM - Dec 24, 2019",
      "content": "<div>Thanks!!<br/>\n<br/>\nIll give it a shoot :)<br/>\n<br/>\nAgain, thank you so much for helping a newbie</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:13 PM - Dec 24, 2019",
      "content": "<div>I have not played for very long at all on PoTM so this is more supposition than fact.  I have played on other level limited and customised servers however both RP and Action.<br/>\n<br/>\nRavenloft is an undead setting which generally means much of your opponents will be immune sneak attack.  If this is the case, this is a large impact to a Rogue build which relies on sneak attack to make that build effectively compete with other melee builds.  As such, a strength rogue or fighter/rogue blend is likely to be more effective than straight rogue for melee combat.<br/>\n<br/>\nWith respect to monks, monks tend to be “forgotten” on most persistent worlds, primarily because they are very equipment dependant and equipment for monks is just for monks.  Most other equipment can be used by many/most/all classes.  From my limited understanding, Ravenloft is no different and Monk is not a viable “primary class” build there.<br/>\n<br/>\nAs Ravenloft is a RP server, I suspect people will tell you “any class /build will work”.  In my experience this is rarely the case.  I suspect that both Rogue and Monk will be challenging and frustrating for a new player and perhaps challenging and frustrating for a knowledgeable player :)<br/>\n<br/>\nI do not want to dissuade you, but I suspect neither is a great choice for a new player on that server.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:37 PM - Dec 24, 2019",
      "content": "<div>If there are lots of undead, what about a Cleric 17 / Rogue 2-3 type build, rogue is just for skill dumps, cleric 17 for level 9 spells. If you can get away with Rogue 2 you could add a level of fighter for a bonus feat<br/>\nPerhaps if you go human + have Int 14, you will get 5 (2 from cleric, 2 from int, 1 from human) skill points per level, allowing you to max Disable Trap, Open Lock, Set Trap, then spread the remain points into concentration, search tumble and UMD. Your BAB will be 14 but divine power can boost it up<br/>\n<br/>\nEdit Paladin 17 rogue 3 would be good too possibly even better if you don't mind being lawfully good alignment - fear immune disease immune, divine damage freedom death ward spells plus good saves and BAB 19 buffable with bulls strength eagles splendor and aura of glory</div>"
    },
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "2:47 PM - Dec 25, 2019",
      "content": "<div><blockquote><div><cite>NWNewbie wrote: <div class=\"responsive-hide\">Dec 24, 2019</div></cite><blockquote><div><cite>Mick Dagger wrote: <div class=\"responsive-hide\">Dec 24, 2019</div></cite>Welcome to the guild!<br/>\nPOTM is indeed low magic. I have not played there in quite a while, but I did enjoy the horror setting and the company of some very good roleplayers.<br/>\nAs for character building, the PW has some custom features. Some of the skills are different and you get a lot of extra feats. The idea behind the latter is that you should have enough feats for necessary combat feats and feats selected on basis of RP choices.<br/>\nWith the low magic, strength based characters are often better than dexterity based ones. Self buffers benefit from their access to magic. Monks benefit from their many supernatural abilities etc. <br/>\nI have little to no experience with rogues there though.</div></blockquote>\nThank you for the welcome and I agree about POTM!<br/>\n<br/>\nCan I be so brave to ask what a POTM monk build would look like? Ive been playing with the tought of one aswell :)</div></blockquote>\nFor a POTM monk, my personal preference would go to something like this (take into account that POTM has lots of modifications over standard NWN, so some things like the number of feats might surprise you):<br/>\n<br/>\nMonk (20)<br/>\nRace: Silvanesti elf (best race in the server for dex based monk IMO with +2 DEX +2 INT -2 CON -2 CHA and the usual elf feats +darkvision, +1 spellcraft, and being dex based means we can use guns to great effect)<br/>\nBackgrounds (select after character creation in starting area): stalker (or whatever the one that gives you +1 hide and move silently is called), hunter (+1 move silently, +1 spot)<br/>\n<br/>\nSTR: 12<br/>\nDEX:17 (22)<br/>\nCON:12<br/>\nINT:16<br/>\nWIS:14<br/>\nCHA:6<br/>\n<br/>\n01: Blind fight<br/>\n02: Weapon finesse<br/>\n03: Exotic Weapon Proficiency<br/>\n04:<br/>\n05: Weapon focus: Flintlock<br/>\n06: Delven's Maneuver<br/>\n07:<br/>\n08: Gearling's Superposed Loading Technique<br/>\n09: Shrouded Dance<br/>\n10:<br/>\n11: Improved critical: Flintlock<br/>\n12: Careful handling<br/>\n13:<br/>\n14: Point Blank Shot<br/>\n15: Weapon Focus: Unarmed<br/>\n16:<br/>\n17: Expertise<br/>\n18: Improved Expertise<br/>\n19:<br/>\n20: Martial Supremacy<br/>\n<br/>\nSkills: Tumble 20 (26), Parry 23 (29), Discipline 23 (24), Hide 23 (30), Move Silently 23(31), Spot 23 (28), Spellcraft 1 (5) Disable traps 1 (4) Set traps 9 (15)<br/>\n<br/>\nThis build is made with PVP in mind because while PVP is relatively rare in the server, the PVP fights you might get into will likely have much more consequences than any other encounter in your character's life. <br/>\n<br/>\nFor PVE, you'll want to use your fists most of the time, but for PVP, guns are insanely good, especially as a monk, as you are very fast, enabling you to kite melee characters, and to use the great range from the guns for corner sneaking to great effect. Thus stealth is an essential part of your PVP strategy, and will also help you survive in PVE. <br/>\n<br/>\nSet traps gear is plentiful, so even with only 15 modified ranks in the skill, you can gear yourself up and set deadly traps. Again, extremely useful for PVP, if you know you're going to be attacked. Can also be used in PVE of course.<br/>\n<br/>\nParry is garbage in normal NWN, but in this server, every 5 modified ranks gives 1 shield AC until you get to 30 parry, so it's essential, except for sword and board builds that do not take the shield parry feat (Ravenloft custom feat, like many used in the above build).<br/>\n<br/>\nNow if you'd prefer to build a more \"traditional\" monk (ie: no guns) or if you don't want to build for PVP, go for STR based (more unarmed damage, and more ways to boost STR than DEX for more melee AB in this server), and replace all the gun and ranged feats by improved disarm, toughness, dodge, and then save feats or energy resistance feats. If you're feeling particularly evil, you can take the voracious feat for additional strength and constitution, but beware: the life expectancy of a cannibal can be very short, as getting caught eating people tends to have heavy RP consequences. You may even consider crossclassing taunt (using the taunt+expertise combo of course), as there are lots of gear for that too, as well as feats and backgrounds, and while other classes have it as a class skill and could do it for you, I've found that people don't use it most of the time (and as a monk, that -6 penalty to ennemy AC can really make a huge difference).<br/>\n<br/>\nAlso, don't take improved critical: unarmed, as one ring you will want to acquire will give you this feat + weapon specialization: unarmed.<br/>\n<br/>\nMonk is viable, and is said to be the most potent melee class at high level, but until you get some levels under your belt, it's going to be very challenging. I would not recommand it for your first character in POTM, unless of course you are looking for a challenge<br/>\n<br/>\nThough, take what I say with a grain of salt, because the highest level character I've played there was level 8.</div>"
    }
  ]
}