{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "212",
  "name": "PM30/?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pm30-t2354451.html",
  "author": "campgod",
  "avatar": "no_avatar.png",
  "replies": "7",
  "views": "975",
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "12:00 AM - Jun 20, 2015",
      "content": "<div>Hello everyone, here once again to ask for guidance. I am looking to build a PM on my server with the sole purpose for the summon. Here are some of the changes.<br/>\n  <strong><span style=\"font-size:150%;line-height:normal\">Epic Dragon Knight:</span></strong><br/>\n<strong>Spell change:</strong> Dragon depends on alignment and class in the case of palemaster.<br/>\n --&gt;Spell Focus Conjuration: +2 Constitution, Dexterity, Stength. Duration x2.<br/>\n --&gt;Greater Spell Focus Conjuraton: +4 Constitution, Dexterity, Stength. Duration x3.<br/>\n --&gt;Epic Spell Focus Conjuration: +6 Constitution, Dexterity, Stength. Duration x4.<br/>\n Dragon is hasted.<br/>\n Dragon is immune to Word of Faith.<br/>\n<strong>Spellcraft:</strong> The modified spellcraft check will be added to the dragon's total HP, added to it as temporary hitpoints.<br/>\n<br/>\n Epic Dragons: A level 40 dragon will join the caster. Cleric = Lvl 40, atleast 30 wisdom. Druid = lvl 40, atleast 30 wisdom. Palemaster = lvl 30, atleast 30 in either charisma, intelligence or wisdom. Sorcerer = lvl 40, atleast 30 in charisma. Wizard = lvl 40, atleast 30 in intelligence.<br/>\n<br/>\n So with that being said, what should I go with for the other 10 lvls? just 10 straight lvls of a caster to buff up the dragon or should I mix the other 10 with another combo? Also if you could help me with the starting stats for whichever combo as well. Thanks for your time everyone.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:10 AM - Jun 24, 2015",
      "content": "<div>There is a build called the Undead Lord (or something similar) which was one of the first NWN builds posted in the ECB, which is a spellsword Fighter 4 / Wizard 6 / PM 30 or something similar. You should be able to find it in the Search Engine. I just looked at it, it's listed as build by cdualdep or something similar :D</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "1:42 AM - Jun 24, 2015",
      "content": "<div>Yeah thanks Max, I looked at that one. Not really looking for a fighter type PM just more of a caster. I saw an old build in the ESE and its wiz35/B3/SD2 has the INT that I need 34-36 I think it was. Just going to lvl that then re-build it as a wiz PM and see what I can make out of it.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:43 AM - Jun 25, 2015",
      "content": "<div>With 30 PM levels, you aren't going to be much of a caster, because all spell damage and durations are based on the original caster class, not PM levels. The only thing you gain by going with 30 PM levels is spell slots, nothing more. For example, your GMW will only add a +2 bonus to the weapon and last 6 hours a day, your IGMS will only release missiles based on the number of wizard levels you have, so on and so forth. The build you want might be impossible to achieve.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:44 AM - Jun 25, 2015",
      "content": "<div>I have a Wizard 29 PM 10 Assassin 1 if you're really into PMs and necromantic types.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:34 PM - Jun 26, 2015",
      "content": "<div>I was just going PM 30 for a lvl 40 Dragon knight summon I get on my server really, just to see what it can do. In PvP I see some people go for the Wiz 40 to get there Dragon knight and it seems to do alright. With a PM 30 a get a lvl 40 Dragon Knight that looks like an undead Dragon Lich type. So I was just wondering what a good build might be a good build with a lvl 30 is all. I think I saw your build. Didn't it have Zen arch with it? Thank you for your help.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:48 PM - Jun 28, 2015",
      "content": "<div>No, not that one, campgod.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "5:45 AM - Jun 29, 2015",
      "content": "<div>Yeah, I would like to take a look, TY</div>"
    }
  ]
}