{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "446",
  "name": "Norfilmar Rydo(smtin), bard6/RDD10/AA24",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/norfilmar-rydo-smtin-bard6-rdd10-aa24-t2292285.html",
  "author": "Nemusator",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "1.2K",
  "posts": [
    {
      "author": "Nemusator",
      "avatar": "no_avatar.png",
      "timestamp": "11:22 PM - Oct 11, 2012",
      "content": "<div>A friend of mine thought of the build idea, Raven that is. He never made his build, but I altered his version, and made mine. One of my favorites. <br/>\n<br/>\n<br/>\n<br/>\nECB Build Model: RDD/AA concept, bard6, RDD 10, AA 24<br/>\n<br/>\nRACE: Half-Elf<br/>\n<br/>\nALIGNMENT:Neutral good<br/>\n<br/>\nPLAYABILITY:  Good<br/>\n<br/>\nSTARTING STATS:<br/>\n<br/>\nSTR - 10<br/>\nDEX - 16<br/>\nCON -16<br/>\nWIS -8<br/>\nINT -12<br/>\nCHA -12<br/>\n<br/>\nENDING STATS: * without items *<br/>\n<br/>\nSTR -18<br/>\nDEX -30<br/>\nCON -19<br/>\nWIS -8<br/>\nINT -14<br/>\nCHA -14<br/>\n<br/>\nBASIC STATS:<br/>\n<br/>\n- Hit Points: 552 * unbuffed *<br/>\n<br/>\n<br/>\n- Skills: concentration 22, discipline 47, listen 43, lore 16, taunt 42, tumble 100 ( there is a natural bonus on Antiworld ), UMD 10<br/>\n<br/>\n- Saving Throws (Fort/Ref/Will): 26/32/20 *without items*<br/>\n<br/>\n- Naked AC: 38 ( 39 if you count dodge )<br/>\n<br/>\n- BAB: 26<br/>\n<br/>\n- AB: 63<br/>\n- AC: 65 and +1 from mage armor spell <br/>\n<br/>\n- Spellcasting: Bard’s cantrips, level I and II spells <br/>\n<br/>\nLEVELING GUIDE: 1-5 bard, 6-9 RDD, 9-19AA, 20RDD, 21AA,22-26RDD, 27-39 AA, last level bard for tumble and discipline dump. <br/>\n<br/>\n1-Weapon proficiency, martial  ( resistance, cure minor wounds, flare, daze )<br/>\n2- ( amplify, mage armor, light ) <br/>\n3- point blank shot ( balagarn’s iron horn )<br/>\n4- DEX +1 ( clarity, silence )  8 skill points into: discipline, listen, lore, perform and tumble<br/>\n5- 8 skill points into: discipline, listen, lore, perform and tumble (PFA, Bull’s strength )<br/>\n6- Blind fight<br/>\n7-<br/>\n8-DEX +1<br/>\n9-Weapon focus longbow<br/>\n10-<br/>\n11-<br/>\n12-DEX +1, dodge<br/>\n13-<br/>\n14-<br/>\n15-improved critical longbow<br/>\n16-DEX +1<br/>\n17-<br/>\n18-rapid shot<br/>\n19-<br/>\n20-<br/>\n21-Great dexterity I<br/>\n22-<br/>\n23-<br/>\n24-DEX +1, Great dexterity II<br/>\n25-<br/>\n26-<br/>\n27-Great Dexterity III<br/>\n28-DEX +1<br/>\n29-Great Dexterity IV<br/>\n30-Epic Weapon Focus Longbow<br/>\n31-<br/>\n32-DEX +1<br/>\n33-Armor Skin, Epic prowess<br/>\n34-<br/>\n35-<br/>\n36-DEX +1, EER Cold I<br/>\n37- Great Dexterity V<br/>\n38-<br/>\n39-EER Cold II<br/>\n40-CON +1 ( final skill points distribution: discipline 43, listen 43, perform 8, concentration 20, taunt 40, tumble 40, UMD 8<br/>\n<br/>\nSAVES: Fortitude 28<br/>\n           Reflex 38<br/>\n           Will 20 ( only + 2 to fort via items )<br/>\n<br/>\nGear: Mastery stag helmet ( +3 to constitution and some discipline boost ), Cloak of protection ( +5 to ac ), Amulet of natural armor ( +5 to ac ), Boots of the sun soul ( +3 to dexterity, + 5 to AC ), Belt of agility ( + 5 to dexterity ), Bracers of dexterity ( +5 to dexterity ), Longbow ( +10 mighty, +5 bludgeoning attack bonus), Arrow maker ( arows&gt; + 1d6 sonic damage, + 5 attack bonus ), Enchanted tunic ( +5 to ac + 2 to fortitude saving throws ).<br/>\n<br/>\nSIMILAR BUILDS: Haven’t seen any builds of this type.<br/>\n<br/>\nSPECIAL NOTES:  Fun build<br/>\n<br/>\n7- FINAL NOTES: <br/>\n1. You could drop some Great Dexterity feats and grab more of the useful EER Cold feats.<br/>\n2. This is a pain to mages... Unless they actualy know how to properly play a mage and have those chain lighting spells....<br/>\n3. I played almost identical build on Antiworld for quite a long time and am very satisfied with the results<br/>\n4. I know I could make this better, there is no a releveling option for a RDD on our server, and I can’t redo my own characters <br/>\n5. Imunity to imbued arow aoe effect is sure nice.<br/>\n6. Overal a nice and interesting AA build!<br/>\n7. I hope that you will have as much fun as I did with this thing!--------------------<a class=\"postlink\" href=\"/attach/view/ma/845224_fc1f5316e524997180b94635b328491b\" rel=\"noreferrer\" target=\"_blank\">Click here to view the attachment</a></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "9:51 AM - Oct 12, 2012",
      "content": "<div>Nemusator, better with the build format, and see you llike those screen shots, don't you?! (very cool); I quite like idea of Drake STR when it comes to bows with the Mighty property. Checked the Pulse / Build Search Generator and see 10 RDD/AA builds in the Guild as follows, <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/buildsearch/\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhawk/buildsearch/</a> <br/>\n<br/>\nDevastating Arcane Archer bard 5 / red dragon disciple 10 / arcane archer 25 (elf) by Tulians<br/>\n Devastating Longbowman bard 6 / red dragon disciple 4 / arcane archer 30 (elf) by King Ubu<br/>\n Sniper Draconis bard 6 / red dragon disciple 10 / arcane archer 24 (elf) by Big Meph<br/>\n Power Archer bard 6 / red dragon disciple 11 / arcane archer 23 (elf) by Dimundome<br/>\n The Real True Ultimate Archer bard 7 / red dragon disciple 10 / arcane archer 23 (elf) by Thorsson64<br/>\n Drakebow bard 7 / red dragon disciple 10 / arcane archer 23 (elf) by Nimueh_Leafbow<br/>\n Dragon Scaled Shards, Rysta'tia Magicia bard 7 / red dragon disciple 10 / arcane archer 23 (elf) by Drosettia<br/>\n Draconic Archer bard 8 / red dragon disciple 10 / arcane archer 22 (elf) by Sir Nahme<br/>\n Thunderstorm bard 8 / red dragon disciple 10 / arcane archer 22 (elf) by plan__b<br/>\n The Vanquisher bard 12 / red dragon disciple 10 / arcane archer 18 (elf) by Giantevilhead <br/>\n<br/>\nMost of which are quite old and focus on Dev.Crit with the bow, interesting concept (albeit a low DC, when shooting from a distance, trade off being a lower AB than I'd like to see on an archer and AC, but playable enough PvM) with another going the Con angle (for EDR). I like that you're shooting for the DEX instead (as that's what an archer needs and, apart from the eternal nitpik (uncanny dodge), when shooting from a distance as opposed to getting into the fray, not a biggie). So, yes, yours is unique, a different angle from that which has come before (nicely done! But next time, you can pull em all up and show how it is that yours differs, right? And yes it does!). <br/>\n<br/>\nHaving a difficult time reading it due to the format, though. Much better, but let's make it even more readable so as to permit others here to comment, yes? Take a look over at the \"Builder's Tools\" section where you'll find a character generation spread sheet (assuming you don't want to write everything out by hand) which will in turn lay it all out nicely for you. Also, set out your base stats (i.e., AB and damage with a mundane bow) and skills (an item that gives 100 to tumble? That's pretty cool; is that available to everybody or just good looking snipers with dragon wings  (Keep in mind it's lost when caught flat-footed but since you're an archer sniping from a distance shouldn't be an issue, and must say a nice bonus in turn. I want one, too!  ). <br/>\n<br/>\nBy all means, feel free to put all that in as it relates to the world you're playing on if you like (maybe a note at the end of the build, along with reasonable equipment like +5 items or even the stats if taken to the level cap; not everyone does this, but many do so up to you). However, it's important to set out the cold, hard unadjusted stats first (remember, not every place does what your world does, so players will want to know in turn what it is that your character can do, to which they will then play on other worlds and add equip't and \"gifts\" as are or may be available to them in turn. I mean, a good looking drake sniper needs to get out there and explore different places, different worlds, yes?). In turn, unadjusted stats (no world-specific gifts, no magic and no equipment- i.e., BAB 26, +10 DEX MOD (@30 Dex), +3 WF/EWF, +1 EP, + 11 from AA's enchant arrow (22 levels AA for e.g.) = AB 51 +2 Bard Song (i.e., singing in the shower with a bow if go 8 bard instead of 6 or 7, yes?). Now, bring on all your buffs, etc (bards are great, I think so, too).<br/>\n<br/>\nOK, level split: Thinking 22 AA (+11 enchant arrow and bonus feat), 10 RDD for all the drake goodies and 8 Bard for a better song (+2 AB/Damage, some HP and +1 skill boost across the board). Run Bard 5 with the lore as you've done, getting your \"first wave\" of RDD goodies by taking it to 4 as you've done, qualify and grab your AA 1 through 10 (which takes you to level 19), grabbing an RDD at 20 then a Bard at 21 (skill dumps), finish your RDD for all that drake goodness (to level 26), running AA 11-13 followed by another bard at level 30 (skill dumps). AA 14-22 thereafter (levels 31-39) and finish with Bard 8 at level 40 for the final skill dump, along with the better song and other bard goodies, putting that stat point into CHA instead of CON (which gives you nothing more than a CON 18 does); this, to  gain access to 3rd Lvl. Bard spells instead, such as wounding whispers. OK, not exactly going to bring down a raging barbarian or boss with it, but access to 3rd Levl. bard spells (all fun aside, there's some really good ones in there, see:  <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Category:Bard_spells\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Category:Bard_spells</a>  ) . Better than an extraneous point in CON which isn't doing anything for you.  <br/>\n<br/>\nJust a couple more things: why aren't you taking Called Shot (instead of Dodge)?You're an archer, keeping your distance and CS will help keep it that way (applies a penalty to an opponent that slows them down and unless nerfed on your world it is accumulative. A beautiful thing!). Highly recommend it. Also recommend training up your UMD also (repeat after me: there is no such thing as too much UMD; youre a bard, so put that great skill to good use. Not only enhancing playability/versatility but helping to shore up your will save, etc., which is a beautiful thing, too, right?). Oh, and just curious as to why 16 hard points in Lore? Only need 8 for RDD prereq. Wouldn't take it beyond the prereq., unless it's a requirement on your world or RP ... <br/>\n<br/>\nFinally, as to dropping DEX I wouldn't do that. No such thing as too much AB either (and this is just as if not even more important when it comes to an Archer). If you don't hit, you don't damage (would be especially bad for a sniper, yes?). I'd be inclined to raise DEX to 32 (or more) myself (if you hit, you damage. It's that simple, and especially nice with drake STR coming in on a mighty bow particularly if others are running around with a tumble bonus, yes?). I know some worlds implement cold penalties on RDDs and assume that's what you're wanting protection against, but wouldn't take it below 30 DEX, though: a Naked AB 53 (51+2 Song) is really quite decent, bring on the bard goodies (and full-train UMD versatility) and looks to be a fun, playable and effective build overall. Look forward to seeing it re-worked/re-formatted and GOOD JOB. Nicely done!! <br/>\n<br/>\nShoot ON! ~ Tyr<br/>\n<br/>\nEDIT: Just thought to add, as it pertains to your world's Tumble bonus, can for your world's purposes further tweak what I suggested above by taking Bard at 20 instead of 21, running RDD thereafter instead. This, for BAB progression (BAB 27, Nat. AB 52+2 Song\" 54, Mundane Bow, then add your buffs and equipment), thus gaining another AB for you without any costs as it pertains to your world. Ordinarily, take Bard at 21 for the dumps (i.e., the tumble), but on your world it seems there's no need to delay same in your specific case and something to keep in mind, yes? Other worlds, they'll enjoy that dump when playing your build (but don't need it if going straight 40 either, preferring AB instead).</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "4:07 PM - Oct 12, 2012",
      "content": "<div>Welcome nemusator to join our ranks as character builder. I see that Max, Tyr and Hip already have provided some good advice as to posting builds.<br/>\nA warning about character screens. They can serve as illustrations for your characters, but are often bugged and show numbers that are wrong, so you can not use them as build-documentation. <br/>\nI want to add that build concepts should be posted in the Build request/Unfinalized builds forum for further discussion and refinement before being posted here. That way this forum will be easier to browse for finalized builds. Builds posted here should match the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/character-builds-posting-rules-t515321.html\" rel=\"noreferrer\" target=\"_blank\">Character Build Posting Rules</a><br/>\n<br/>\nGood luck with your builds! I hope they may lead to some good discussions and spark new ideas</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:19 PM - Oct 12, 2012",
      "content": "<div>I echo all TyrTemplar has commented on your build posting progress, Nemusator.  Try and make it a priority to mimic  the standard build template in your submissions and you will get more responses.  Called Shot should be a staple of any archer,  AA or otherwise.  And thanks to TyrTemplar for blowing the dust off those old RDD/AA DevCrit builds.    I also see that Mick stopped by while I have pounding away at my keyboard so many helpers are beginning to appear to make your visit the most productive.  (If Kail shows, it's heart attack time.   )<br/>\n<br/>\nA few points/tips from a grouchy dwarf to display your ideas better on the ECB boards:<br/>\n<br/>\n1. If you know for sure or suspect that the build has not been optimized fully (you mentioned it couldn't be releveled to accomplish that),  then either make the necessary adjustments manually or post it in the Unfinalized section where it will be optimized by the guild, or at least provided with suggestions to do so.  The toon you played is not as important as the build you post so be certain to refine the details as best you can before posting for review.<br/>\n<br/>\n2.  PLEASE PLEASE include the class split in the title.  Be as descriptive and unique as possible.  Even the name you used for the toon on the server is better than \"RDD/AA concept\".  Until I noticed the screen shot I didn't even know what the split was though I suspected that another bard dump was in there somewhere.   By using the screenshot it is possible to make a guess on the leveling order, but most us do not have time to work backwards trying to analyze a build.<br/>\n<br/>\n3.  Leveling guide.  At the beginning of each line, label the class level used.  Something like 5-Bard(5) and then 6-RDD(1) and so on, makes it easier for other to determine how to juggle feats around if needed.  You appear to have duplicated level 9 for both RDD &amp; AA, a typo which wouldn't happen if you placed one class per line.  Refrain from cluttering up the leveling guide with skill point assignments and spell selection.  There is just no room for them in a highly skilled build like a rogue to include everything on a single line.  Make a separate 1-40 list dedicated solely to the level-by-level skill allocation so that others will hit the ground running if they choose to use your build. Place the spell selection information in its own section.  Some folks even specify the number of slots for each spell level but that is never necessary.<br/>\n<br/>\nThose are the most glaring areas that should be addressed as you move forward.  You are gradually getting the hang of it so stick with it. The more builds you read in the ECB the easier it will become to provide a fully-functional build.<br/>\n<br/>\nOne initiative you would very wise to pursue is furnishing a high-level view of the server that you design your builds to be played within, Antiworld according to your sig, if that's it.  Post it in the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/persistent-worlds-f60569.html\" rel=\"noreferrer\" target=\"_blank\">Persistent Worlds</a> section right here in the ECB.   Furnish as much detail as possible about tweaks the server may have made that would effect the character building process.  The typical max enhancement level (or \"Magic Level\" by some), whether there are permahaste items and or items that grant immunity to spells, immunity to critical hits, whether they use a forge to add properties there... this type of information would be very helpful to understand why your builds have been designed the way they are.  And it would give you a chance to advertise your world a bit more.  Just a suggestion.  Our membership has continued to grow for at least 2 years now so there are always \"new eyes\" checking out the place.</div>"
    }
  ]
}