{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "826",
  "name": "A build request for greyhawk",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/a-build-request-for-greyhawk-t2355150.html",
  "author": "sataricon",
  "avatar": "10759088_1568407219.jpg",
  "replies": "2",
  "views": "164",
  "posts": [
    {
      "author": "sataricon",
      "avatar": "10759088_1568407219.jpg",
      "timestamp": "8:01 PM - Sep 02, 2019",
      "content": "<div>So i'm planing on playing on greyhawk and this is the first PW i ever join.<br/>\n I've been told that this server is hard so i came seeking help.<br/>\n<br/>\nI want a build that can give me someone who just finished the OC + both expansions a fighting chance.<br/>\nI read about tactics and i'll learn all of them in due time but i just don't want to have a build that was a self challnge for some one <span class=\"text-emoji\">😂</span><br/>\n<br/>\nI don't know if it's ok to ask such a favor here or not.<br/>\nI tend to solo in most online games so that will make things much harder for me i guess.<br/>\n<br/>\nMelee or ranged or magic i did play a sorc in the OC then a mix between bard and RDD &amp; COT.<br/>\n<br/>\nthankx in advance,</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:15 AM - Sep 03, 2019",
      "content": "<div>heading off to work so I'm going to be brief<br/>\n<br/>\ntactics - Max's guide on playing well. its here in the ECB forum somewhere. ranged weapon to agro them, run back a bit, then take out enemies one by one, if you can. 'Pull and Slay or Run away'<br/>\n<br/>\nstrong classes - spoke to a few players about this cleric and druids with dragon shape are probably the strongest classes on the server. animal domain clerics and druids have slightly stronger summons, which helps with early levels but become weaker later on. spellcasters are strong if you are good at them. a bard/rdd/cot will be tough to level up at the beginning but then will bloom later. undispellable buffs are very valuable, every second man and his dog casts greater dispelling (im exaggerating but you get the idea)<br/>\n<br/>\nskills - UMD is valuable. consider open lock (1 point plus tools) as bashed chests sometimes have their contents degraded. listen or spot skills are valuable as almost every enemy seems to use stealth. search to 10 modified to find hidden entrances and doors</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:18 AM - Sep 03, 2019",
      "content": "<div>Why don't you try this one?<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/firewing-of-corellon-bard-8-cot-22-rdd-10-t2355058.html\" rel=\"noreferrer\" target=\"_blank\">firewing-of-corellon-bard-8-cot-22-rdd-10-t2355058.html</a></div>"
    }
  ]
}