{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Mid Epic - Level 30 Builds",
  "forum_id": "005",
  "id": "008",
  "name": "Hin Slinger rogue/monk/ftr?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/hin-slinger-rogue-monk-ftr-t2354761.html",
  "author": "tal02",
  "avatar": "10235447_1565972826.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "tal02",
      "avatar": "no_avatar.png",
      "timestamp": "4:37 PM - Oct 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I would like to create a Halfling slinger.<br/>\n<br/>\nPrimary focus, DPS (sneaks?) + Speed (movement)<br/>\n<br/>\nIf I could cleric it (travel trickery domain) I would, but it seems complicated to combine with a sneak attack class.<br/>\n<br/>\nThoughts?<br/>\n<br/>\nedit: basically making the slinger decent, I'm open to other class options, just thought the above made sense?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:21 PM - Oct 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi there, tal02 - just a couple of quick questions if that's okay?<br/>\n<br/>\nFirst of all, did you mean to put this in the Mid Epic (level 30) section, or in the Build Request one? If it's a request for a level 30 build, it still really belongs in the Unfinalized/Request forum. I'm sure Hip would move it there if he was around, but he's not atm, so we'll deal with it here.<br/>\n<br/>\nWhich brings me to a second question - is it for a level 30 character (for example, for using in Arelith), or a full 40 levels? Quite important to know!<br/>\n<br/>\nIn principle Rogue/Monk/Fighter is a great combo, but if you want to be stealthy, Shadow Dancer might appeal instead of either Monk or Fighter. Or if you want to get in touch with your evil side, there's Assassin to consider. I assume the Fighter levels would be primarily for taking WS/EWS, for a little more punch in your damage, but it's never going to be huge.<br/>\n<br/>\nAnyway, just a few thoughts to be going on with!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "tal02",
      "avatar": "no_avatar.png",
      "timestamp": "6:23 PM - Oct 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh shoot, I did put it in the wrong place, sorry about that. it is for lv 30, you're right on all the other points, does give me food for thought. thank you!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:16 PM - Oct 24, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was hoping someone who knew better than I would come along here, but just as a thought - I had a go at an Arelith hin build for MaaterOfNotAlot which is a Rogue 16/ Fighter 4/ CoT 10, which you can find on page 2 of the Build Requests/Unfinalized Builds sub-forum under the heading \"Help with Arelith Halfling Rogue\". Now, it makes use of the +2 Dex and +2 Int gifts at the beginning, and is a kukri dual-wielder, but there's plenty of scope to adapt it, if it's the sort of thing you're looking for?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "tal02",
      "avatar": "no_avatar.png",
      "timestamp": "2:59 AM - Oct 27, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi stagmeister, thanks for checking. looking at the kukri build, it is definitely mechanically superior. I was going for something not quite that good considering I want to focus on a sling. elf archers have the arcane archer builds. hin slingers don't, but I was looking at how to make them feasible.<br/>\n<br/>\nI'm assuming the following<br/>\n-rogue sneaks for dmg<br/>\n-something for speed<br/>\n-something for.... I don't know. that's the limit of my skill :D<br/>\n<br/>\nwould it be appropriate for me to post this in the correct thread? that might be the cause :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:22 AM - Oct 27, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, slings or not, you can't go wrong (especially in a low-magic server) with fighter's ws/ews for a constant +6 dmg right? And that's not even counting the extra attack/ round the full bab fighter class will bring to the mix..<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}