{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "163",
  "name": "Caster cleric with Zen archery ",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/caster-cleric-with-zen-archery-t2355170.html",
  "author": "eltalstro",
  "avatar": "10758878_1582351977.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "12:11 AM - Sep 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Is this a waste of a feat or does it have merit? I'm playing DOD at the moment with a high WIS cleric with one level of monk and one of paladin. Went with low STR, but no divine might stifles the damage from Zen archery, but then I keep coming back to \"well this is an offensive caster what's the point of even using the bow?\"<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:28 AM - Sep 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Firstly I have not played a lot of cleric builds so I am a little hesitant to comment but based on what I understand of mechanics and what I have read (and been told by other players), it is great feat for high wisdom Cleric builds if there is space.<br/>\n<br/>\nIt would be of high value if:<br/>\n<br/>\n- you have good bows / crossbows / slings / other ranged weapons<br/>\n- you have good ammunition<br/>\n- there are restrictions on spell casting such as rest restrictions<br/>\n- you do not want to face an opponent in melee (ie enemies with petrify abilities such as basilisks/medusae, devastating critical enemies etc)<br/>\n- you want to deal with smaller enemies without blowing your spells<br/>\n<br/>\nWith 10 great wisdom feats the zen archer cleric could have a base wisdom of 38, capped wisdom of 50. Demolition man has an AB of 43 which is the AB of a solid warrior build. Add cleric AB buffs and every arrow/bolt is going to hit your opponent. The only issue is going to be 'how to increase damage dealt per hit' without excessively damaging that sky high AB<br/>\n<br/>\nI am working myself on a zen archer cleric build that I would like to play in this forum and I am very fortunate the forum is happy to humour me for now with my many, many drafts :) RE the damage question I am looking at divine might and devastating critical (or both). Divine favor is given for free to clerics and adds up to +5AB and +5 magical damage per hit so that is a powerful ability to assist if you can get enough castings of it.<br/>\n<br/>\nI have been told crossbows do not suffer from reduced damage from strength penalties, which is something you could consider until you get divine power.<br/>\n<br/>\nHope that helps<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:56 AM - Sep 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And don't forget ranged attacks of any description are very useful for separating individuals from mobs so you can deal with them more easily - possibly leaving your prime target isolated and unknowing before you unleash godly might upon them. It will always help if you can hit your target, of course, or they'll just laugh at you.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}