{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "267",
  "name": "Spammers--to whom do we report them for removal?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/spammers-to-whom-do-we-report-them-for-removal-t2302138.html",
  "author": "TyrTemplar",
  "avatar": "10235222_1510287070.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "1:15 PM - Dec 08, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Ladies and Gents,<br/>\nIt is with regret that I must point out, which many if not most here have already noticed, that there is a spammer among us who seems bent and determined to continue such wrongful spamming conduct, despite being put clearly on notice in said spammer's \"introduction\" thread that such activities (spam) are in violation of the ECB's rules and not welcome here anymore than they are most other forums, which remove such materials and typically ban spammers/offenders for reasons which are or should be obvious, and which I believe is necessary and proper. <br/>\n<br/>\nThat this individual refuses to cease and desist from such conduct, despite being called out for it by a member here (and politely so, I might add) is such that I in good faith believe further action is necessary, and especially since that offender has posted nothing but (and solely) spam here, and continues despite notice to do so. Time to escalate the matter and bring it to the next level for proper action. In Kail's temporary absence, I am wondering to whom at PhPBB I should report the spam so as to have it removed, with potential consequences for the spammer as well. <br/>\n<br/>\nThanks in advance. <br/>\n<br/>\nTyr, Esq.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:38 PM - Dec 08, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I believe it to not be an individual at all, but a bot. I do not know who, besides Kail, can moderate these forums.<br/>\n<br/>\nEDIT: I looked in the members list (It's only 9 pages), and Kail is the only one whose name appears a different color from anyone else, so I conclude that he is the only moderator here.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "4:44 AM - Dec 10, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Empyre. Appreicate you taking the time to sort out the list. No links to other assistance, then? Oh, Kail, you old dragon, do come back soon (note: going to send him a note via Bio-board, and bring it to his attention). Also know both WoG and the ECB are hosted same forums, so perhaps tracking down a mod over at WoG might be able to help us out when it comes to such things as well, at least point us in the right direction if in future it should be needed. Wonderful thing about the guild is that we're a pretty great community, it being quite rare that moderation is ever necessary, mods instead fully contributing and building themselves (always been good that way, always; well, once \"he who shall not be named\" went away, which I shall not get into other than to say that this is a great place for that, and always has been that way; then, of cousre it is: we all just love NWN and building of course, something we all share!). <br/>\n<br/>\nAh, but this spam thing presents for us a bit of a problem in turn while Kail is away, as can't exactly \"police\" that one ourselves. And a bot you say? Could very well be, and in which case would be easy enough to rectify, but for our lack of admin privileges. Heard the bots are getting \"better\" at getting around secruity/sign-up protocols designed to keep them out, which seems to be the case here then; then again, so, too, are many anti-spam laws in many places toughening up, some with real teeth, too! I'll see what I can do on my end to get the stuff removed, etc., sending a note to Kail as said (do hope all is well with him, meantime, not like him to be away this long; sure that he'll return soon, do so hate to bother him about this, but don't want to see our boards junked-up either).<br/>\n<br/>\nThanks again, Empyre. <br/>\nTyr<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:44 AM - Dec 19, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I don't think this is the work of a bot.  The ID's registration form seems, ummm... human.   <br/>\n<br/>\nUnfortunately, the abuse reporting link at forumer is all but dead (re: <a class=\"postlink\" href=\"http://help.forumer.com/home\" rel=\"noreferrer\" target=\"_blank\">http://help.forumer.com/home</a>)<br/>\n<br/>\nThe last time I corresponded with forumer it took over 2 months just to get a reply and even through today they haven't restored my full forum services properly (which is the main reason I decided not to accept admin rights when Kail suggested it eons ago).  Forumer has a well-styled, professional-looking home page with links that go nowhere.  Perhaps the venture is running on fumes?  Dunno.  Maybe one of you will have better luck connecting with a rep than I have.<br/>\n<br/>\nI made a single plea to the spammer for the sake of ethics and decency.  Let's see if it stuck or not.  The best tactic is... just... don't read the post.  Easier said than done, though, especially for our members not using English as their primary language making spam detection less obvious.<br/>\n<br/>\nSry, Tyr.  Wish I could help more.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}