{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "174",
  "name": "Nimble Mystic Dragon – Druid (28), Monk (9), Rogue (3)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/nimble-mystic-dragon-druid-28-monk-9-rogue-3-t2354876.html",
  "author": "Caliax",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "3.4K",
  "posts": [
    {
      "author": "Caliax",
      "avatar": "no_avatar.png",
      "timestamp": "1:42 PM - May 07, 2018",
      "content": "<div><strong>Nimble Mystic Dragon – Druid (28), Monk (9), Rogue (3)</strong><br/>\nDisclaimer: This is my first ever build so please feel free to jump in with any corrections or critiques! <br/>\n<br/>\nPlayable PvM 1-40, untested PvP. It probably works best as a level 40 build in a fairly low magic environment because not all items merge when shifting, and because much of its power arrives late. Tested in the \"Pretty Good Character Creator\" module as well and it does quite well but struggles to hit Prismatic Dragons, especially when not fully buffed.<br/>\n<br/>\nI wasn’t able to find any builds with this same level split on these forums or the old ECB archive. However, from the ECB archive, this build was inspired by Xylophone’s “Mystic Druid” (28 Druid, 10 Monk, 2 SD) as well as Chiibo’s “Nimble Dragon” (30 Druid, 9 Monk 1 Rogue), hence the name. <br/>\n<br/>\nAs with those builds, this one attempts to combine shapeshifting with some stealth (and counter-stealth) for scouting purposes. Here I have tried to get the “best of both worlds” so to speak, i.e. the high AB and Uncanny Dodge of the Mystic Druid with the Rogue skills of the Nimble Dragon. This build also takes an Epic Spell focus to boost some spell DCs, which neither of the other builds do, and grabs Improved Expertise to help you reach 87 AC self-buffed in dragon form if necessary.<br/>\n<br/>\nThe split shown has been calculated to maximise the benefits of each class as much as possible – 28 Druid for Infinite Elemental Shape, undispellability and 2 epic bonus feats, 9 Monk to get (Improved) Knockdown, unarmed attack benefits, the AC boni, speed and Improved Evasion for free, and 3 Rogue for UMD, Uncanny Dodge and +2d6 sneak attack. <br/>\n<br/>\nWithout further ado, here's the build:<br/>\n <br/>\nHuman, Lawful Neutral<br/>\n<strong>*Note: this build has a 20% XP penalty from level 33 onwards*</strong><br/>\n<br/>\n<strong>ABILITIES (ending)</strong><br/>\nSTR: 8<br/>\nDEX: 10<br/>\nCON: 10<br/>\nWIS: 18 (32)<br/>\nINT: 16<br/>\nCHA: 8<br/>\n<br/>\n<strong>Notes on abilities:</strong>\n<ul>\n<li>16 INT has been chosen to maximise skill points – see the skill guide further down for details. If you would rather have additional HP in human form, you can change this to 14 INT and 14 CON at the cost of some skills. </li>\n<li>Alternatively, if you want to use Shadowdancer instead of Rogue, I would suggest DEX 14, INT 14 and CON 10. You will lose some skills as well, of course. </li>\n</ul>\n<strong>BASIC STATS</strong> (unbuffed, human form)<br/>\nHitpoints: 314<br/>\nSkillpoints: 356<br/>\n<br/>\nSaving Throws (Fortitude/Will/Reflex): 22/33/16<br/>\n<br/>\nBAB: +25<br/>\nAB: 25/22/19/16/13<br/>\nAC (naked/naked with capped Wisdom): 32/38 (42/48 in Improved Expertise mode)<br/>\nDamage: 1d10 -1 fists<br/>\n <br/>\n<strong>Dragon Shape Unbuffed Stats</strong>:<br/>\nHitpoints: 854<br/>\nSTR: 48<br/>\nDEX: 36<br/>\nCON: 32<br/>\n<br/>\nAB: 49/46/43/40/37 (factoring in the +6 claws and -2 size modifiers)<br/>\nAC 65 (75 in Improved Expertise mode)<br/>\n<br/>\n2d8+19 damage (+2d6 sneak attack, 19-20 x2 Crit)<br/>\nSaves (Fortitude/Will/Reflex): 33/33/29<br/>\n<br/>\n<strong>Dragon Shape Self-Buffed Stats (no items):</strong><br/>\nHitpoints: 975<br/>\nSTR: 60<br/>\nDEX: 40<br/>\nCON: 38<br/>\nWIS: 44<br/>\n<br/>\nAB: 55/52/49/46/43 (factoring in the +6 claws and -2 size modifiers). Subtract 10 per attack for Improved Expertise mode.<br/>\nAC: 77 (87 in Improved Expertise mode)<br/>\n2d8+25 damage (+2d6 sneak attack, 19-20 x2 Crit)<br/>\nSaves (Fortitude/Will/Reflex): 37/41/32<br/>\n<br/>\n<strong>LEVELLING GUIDE</strong> (Classes, ability increments, feats):<br/>\n1 Druid (1): Expertise, Extend Spell<br/>\n2 Druid (2):<br/>\n3 Druid (3): Spell Focus: Conjuration*<br/>\n4 Druid (4): +1 wis (19)<br/>\n5 Druid (5):<br/>\n6 Druid (6): Improved Expertise<br/>\n7 Druid (7):<br/>\n8 Druid (8): +1 wis (20)<br/>\n9 Druid (9): Empower Spell<br/>\n10 Druid (10):<br/>\n11 Druid (11):<br/>\n12 Druid (12): +1 wis (21), Greater Spell Focus: Conjuration*<br/>\n13 Druid (13):<br/>\n14 Druid (14):<br/>\n15 Druid (15): Blind Fight<br/>\n16 Druid (16): +1 wis (22)<br/>\n17 Druid (17): <br/>\n18 Druid (18): Improved Critical – Unarmed Strike<br/>\n19 Druid (19):<br/>\n20 Druid (20): +1 wis (23)<br/>\n21 Monk (1): Epic Spell Focus (Conjuration)* {Cleave, Evasion, Monk AC bonus}<br/>\n22 Rogue (1):<br/>\n23 Druid (21):<br/>\n24 Druid (22): +1 wis (24), Great Wisdom I (25)<br/>\n25 Druid (23):<br/>\n26 Druid (24): Great Wisdom II+ (26)<br/>\n27 Monk (2): Great Wisdom III (27)<br/>\n28 Druid (25): +1 wis (28)<br/>\n29 Druid (26): {Infinite Elemental Shape}<br/>\n30 Druid (27): Great Wisdom IV (29)<br/>\n31 Rogue (2): <br/>\n32 Monk (3): +1 wis (30)<br/>\n33 Monk (4): Epic Prowess <strong>{XP penalty starts here}</strong><br/>\n34 Monk (5): <br/>\n35 Monk (6): {KD, IKD}<br/>\n36 Monk (7): +1 wis (31), Armor Skin<br/>\n37 Monk (8):<br/>\n38 Rogue (3): {Uncanny Dodge}<br/>\n39 Druid (28): Epic Spell (Greater Ruin), Dragon Shape+<br/>\n40 Monk (9): +1 wis {Improved Evasion}<br/>\n <br/>\n* = Can be replaced for a spell focus in a different school of your choice if desired.<br/>\n+ = Druid bonus feat<br/>\n<br/>\n<strong>Notes on levelling guide:</strong>\n<ul>\n<li>The levelling guide above is designed to maximise your pre-epic BAB and spellcasting power, whilst postponing the XP penalty until as late as possible. </li>\n<li>If you’d rather avoid an XP penalty whilst still getting many of the benefits of this build (including Improved Evasion and Uncanny Dodge), you could go with two levels of Assassin instead of the three Rogue levels (i.e. 28 Druid, 10 Monk, 2 Assassin), but this will require heavy alignment switching. You'll also get fewer skills and only 1d6 death attack. </li>\n<li>You could also go with two levels of Shadowdancer as per the Mystic Druid, but this requires two extra feats and more DEX investment. </li>\n</ul>\n<strong>SKILLS SUMMARY</strong><br/>\nConcentration 43 (43)<br/>\nDisable Trap 1 (4)<br/>\nDiscipline 43 (42)<br/>\nHeal 17 (28) <br/>\nHide 43 (43)<br/>\nListen 43 (54)<br/>\nMove Silently 43 (43)<br/>\nSpellcraft 42 (45)<br/>\nTumble 40 (40)<br/>\nUMD 41 (40)<br/>\n <br/>\n<strong>Notes on skills:</strong>\n<ul>\n<li>Concentration and Spellcraft are self-explanatory. Increase these on every Druid level, and Concentration on every Monk level as well.</li>\n<li>Tumble at 40 is mainly for the AC, whilst UMD 41 gives you a skill check of 40 which should let you use any scrolls and most other items you may find lying about.</li>\n<li>Discipline is to be maxed every Monk level. This is mainly to help avoid being knocked down while spellcasting in your human form, as not many things will be able to knock you down once you shift to a dragon.</li>\n<li>Stealth skills have been prioritised over thieving skills – if you prefer certain thieving skills or just don’t like the idea of a sneaky dragon build you can swap these out to suit.</li>\n<li>A Heal value of 17 is chosen so that you will have a skill check of 34 with capped Wisdom, which will mean you can heal any poison or disease in combat while buffed with Owl's Insight. Note that due to your Druid and Monk levels, you yourself will be immune to both effects, so you may prefer to allocate these points elsewhere if you are playing solo.</li>\n</ul>\n <br/>\n<strong>Build Strengths:</strong>\n<ul>\n<li>Druid offensive spellcasting – with ESF Conjuration and buffed with Owl’s Insight you will be asking your opponents to make DC 42 Storm of Vengance saves, DC 41 Bombardment saves, DC 39 Stonehold saves, DC 38 Vine Mine (Entangle) saves, and DC 34 Grease saves, in addition to your no-save spells like Harm and Creeping Doom.</li>\n<li>Synergy between Druid shapeshifting and Monk AC and speed bonuses. The monk levels also help give this character quite high AC and unarmed AB while in dragon form. You also get 9 Stunning Claws per day at DC 41 unbuffed (DC 47 buffed) while in Dragon Shape. </li>\n<li>A high degree of versatility - stealth, UMD and a little bit of sneak attack make this a fun build to play. Elemental Shape gives you a bit of variety and helps you survive until you get Dragon Shape. Improved Expertise mode helps you to tank, especially while in human form, or you can switch it off for a better AB in Dragon form.</li>\n</ul>\n <br/>\n<strong>Build Weaknesses:</strong>\n<ul>\n<li>20% XP penalty from level 33 onwards. This can be delayed to level 35 if you are happy with a modified UMD rank of 35, which should still allow you to use most scrolls you come across. </li>\n<li>Low saves, especially Reflex and especially in human form. Save-boosting gear can help with this, as can the immunities you get while in your Dragon form. Improved Evasion also helps minimise the impact of those low Reflex saves. </li>\n<li>Poor physical stats while in human form. Improved Expertise can help with this but still, try to stay out of melee while you are casting.</li>\n</ul>\n <br/>\n<strong>Equipment Wishlist:</strong>\n<ul>\n<li>Armour or a shield with bonus AC to be applied while shifted. Remember to unequip the shield whenever you're in human form! Same goes for the armour if it's anything heavier than monk robes. </li>\n<li>Helmets, robes or shields which boost your saves. </li>\n</ul>\n <br/>\nAnyway, as mentioned this is my first build so any and all thoughts are welcome!<br/>\n <br/>\nThanks,<br/>\nCaliax</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:17 PM - May 07, 2018",
      "content": "<div>A well concieved build, and good documentation!<br/>\n<br/>\nIt is a tempting tweak to take great wisdom at lvl 21 and postpone the epic spell focus, so you can take druid 28 and dragon shape as bonus feat at lvl 31. The ending spellcraft will be lower, but playability in epic levels will improve with an earlier dragon shape.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Caliax",
      "avatar": "no_avatar.png",
      "timestamp": "3:34 PM - May 07, 2018",
      "content": "<div>Thank you Mick for your kind words and I agree, the extra power boost would definitely be welcome earlier in the build. <br/>\n<br/>\nHow about this: following your suggestion, Great Wisdom I comes in at level 21. Druid 23, Monk 8 to level 31, then take the first Rogue level at 32, which allows you to get Dragon Shape as a bonus feat on 33, while still keeping the extra Spellcraft and taking ESF: Conj as the later bonus feat? <br/>\n<br/>\nYou do have to wait a lot longer to get UMD and the extra +2 to DCs, but the XP penalty only starts 1 level earlier and 16 Druid/4 Monk pre-epic is probably more playable than straight Druid due to the extra AC (from Tumble as well as the Monk boni).</div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "8:20 PM - May 11, 2018",
      "content": "<div>Hey Caliax!<br/>\n<br/>\nThis is what I call starting with a BANG! You've officially impressed me. Good job, brother! <br/>\n<br/>\nNow, as for the build itself, there are a couple of alternatives I could suggest, which would make the build more playable, slightly stronger (better saves), and wouldn't interfere with the level 40 power:<br/>\n<br/>\nSince you're Human, you'll only get XP penalty when you get the first Rogue level. But, you can AND SHOULD take Monk pre-epic to build the saves. It'll be slightly more challenging casting-wise because you'll only get those juicy level 9 spells later, but easier in shift-and-kick-the-crap-out-of-everything. Here's how:<br/>\n<br/>\nMonks have 3 strong saves (Fort, Will and Reflex), and your character will build his saves class-based in pre-epic and regardless of class after level 20. So, by taking 4 or 8 Monk levels pre-epic, you'll have slightly higher saves at 40, retaining everything else. For more info on this, I'd refer you to my Complete Guide to the Basics of Building, stickied in the Game Guides section.<br/>\n<br/>\nAlso, earlier KD means you'll have ways of disabling mages (and other troops) and beat them up alongside your companion. This signifies a change in how you'll play the build, doing A LOT MORE melee fighting and A LOT LESS casting in the first 28 levels or so. At level 28, you should arrive at Druid 20 / Monk 8 regardless. This could allow you to take Dragon Shape with your Druid 24 bonus feat, instead of Druid 28, but would delay indispellability, which can be a hurdle if you don't know the proper tactics to avoid dispels. <br/>\n<br/>\nBecause you're going to have Monk AC shifted, this also means that you won't need Improved Expertise that much in Human form, which you do the way you went Druid 20 in the first 20 levels. So, you could drop it (as 87 AC in DS is mostly overkill) and take either Weapon Finesse (for better AB in Air Elemental Form), or Zen Archery to become a really competent archer with your 32 WIS score. Both of these would be nice alternatives to the build, rather than actual improvements. They'd depend on playstyle.<br/>\n<br/>\nBut, the build looks good the way it is as well. These tweaks I suggested would slightly increase the level 40 power of the build without changing much else. <br/>\n<br/>\nAs for how you should play this build, buy Divine Power Scrolls, use them before shifting and WATCH THE 7-ROUND SLAUGHTER!! Lol. And for armor, go with Robes, then get DEX items to compensate for the non-Heavy-Armor. My Champion of the Wilderness suffers from the same problem, but still, 18 WIS AC (achievable with just Owl's Insight after Druid 24 and Owl's Insight + potion of Owl's Wisdom before that), surpasses everything any heavy armor can possibly give you. <br/>\n<br/>\nEDIT: I forgot! Get yourself 1 rank in Open Locks at level 1 no matter what. Cast Aura of Vitality, drink a Cat's Grace potion and shift into a DEX shape (E.G.: Air Elemental) and you'll be able to open locks up to DC 35 or so (depending on Cat's Grace rolls).<br/>\n<br/>\nSent from my iPad using Tapatalk</div>",
      "author-color": "#00AA00"
    }
  ]
}