{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "101",
  "name": "Let's talk Paladin and Rogue",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/let-s-talk-paladin-and-rogue-t2355596.html",
  "author": "webshaman1",
  "avatar": "10759110_1577099721.jpg",
  "replies": 26,
  "posts": [
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:40 PM - Oct 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">So many of you know my reluctance (to put it mildly) to put Paladin and Rogue levels together.<br/>\n<br/>\nI have been thinking about this.<br/>\n<br/>\nIn PnP, I think things are a bit more concrete (especially 3.0) and there are valid reasons against putting these two Classes together.  One of them is the fact that there are other classes that have access to UMD and Tumble that do not have Sneak Attack.<br/>\n<br/>\nIn NWN, however, we do not have this luxury.  There is only Rogue, Bard, and Assassin.  And of these three, only Rogue is a possibility without an alignment change.<br/>\n<br/>\nSo it is with a heavy RP heart that I say that Rogue and Pally combinations should be considered valid combinations in NWN.<br/>\n<br/>\nOf course, should one be playing in an altered environment where one can get Tumble and UMD without Sneak Attack (the PRC, for example) then it should be avoided.<br/>\n<br/>\nYour comments and opinions are welcome.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:30 PM - Oct 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">*<em>rubs forehead, headache imminent</em>* You just bloody had to, didn't you, Web? <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:39 PM - Oct 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's more about how NWN has made access to UMD and Tumble a 3 class show and gimped certain Classes (by this I mean both skills in one class).<br/>\n<br/>\nIn the PnP version (3.0), one really doesn't have this conundrum.<br/>\n<br/>\nKnockdown is purely a NWN creation - the feat itself does not exist in PnP.  That it is a \"select at will\" action, I really do not have a problem with it.<br/>\n<br/>\nAs for UMD and Tumble (at least one can get cross-class tumble) these are skill things, not feats (but you know that).<br/>\n<br/>\nI am aware of the Tumble thing, of course.<br/>\n<br/>\nWith the limitation as well of 3 Classes per build (max amount one can have), which also does not exist in PnP, this makes the equation even more sordid.  Getting things \"squeezed in\" is a fundamental part of building in NWN - and with such limitations as the above, we have to make sacrifices for playability imo.<br/>\n<br/>\nI wish we had more options, more class slots, etc.  But we do not.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "9:16 PM - Oct 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ok Web! Here's my 2 cents.<br/>\n<br/>\nI don't particularly view people as absolutely good or bad, so the alignment system is something I tend to pretty much ignore unless it's a restriction for something I want to do,  in which case it pisses me off and does nothing else. Like when I wanted to make a Paladin Dragon Shaper. Why isn't it possible to have a guy who started as a paladin, but then felt wrong about what he was doing, and found solace with nature?<br/>\n<br/>\n<br/>\nSo, to me, Paladin / Rogues are very viable, and I don't feel guilty at all about using the combo. It depends on how black and white one is in determining what a paladin would or would not do, how strict one wants to be. To me, characters are people, and I don't like the book telling me what I can or cannot build. I think people are colorful, and have multiple facets, aspects, etc, and more importantly, they CHANGE through the course of their lives, mature, and start seeing things in a whole new light when they have the experience. So, your interpretation could very well be that the character started as a rock-solid paladin, but he matured and became more flexible as time went by.<br/>\n<br/>\nOne thing I would like to mention, mildly related to the topic at hand, is that I NEVER understood why HarperScouts don't get UMD as a class skill. They get Craft Harper Item, for the love ov god! If they did, it'd kind of solve your dilemma.<br/>\n<br/>\nCheers!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:19 PM - Oct 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, the Harper Agent (scout) should get UMD in my opinion as well.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:02 PM - Oct 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm sorry, Max, but I have a problem with the \"Paladin who grew up\" concept. Their particular - class-specific - powers are granted by their god, so they should lose those powers should their belief waver. No more DM or DS, smiting or freedom from fear and disease, and the CHA becomes effectively redundant. Simple as that. \"You're not with me anymore? Fine, I'm taking the toys away.\" Gods are buggers like that.<br/>\n<br/>\nIf anything, you could have someone grow up to <em>become</em> a Paladin, through a growing conviction. And that's surely more likely in a person's development, until the desire for carpet slippers and a warm (and/or stiff) drink takes over, anyway, and convictions become more \"meh\". Which, btw, would allow for early \"naughty\" behaviour. The other option is to treat the fledgling Pally as a youthful extremist, which could get a bit dodgy...<br/>\n<br/>\nOh, and I agree about HS and UMD.<br/>\n<br/>\nThere, another penny spent!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "11:24 PM - Oct 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What about a character who has grown up as an orphan on the street before they got rescued by a priest of what ever Deity? And later remembers some stuff they have learned during that time... wouldn't they use everything they have against devils, demons, necromancers and what ever evil they fight? They may see some skills as gifts from their God which they got for using.<br/>\n<br/>\nPersonally I don't see anything wrong with a Paladin who not only has Tumble and UMD, but also can remove and set traps (the latter you could also get from Ranger levels so why not). But I dislike the idea of a pally type using Pickpocket (stealing is a big NO for such a character, of course), Sneak Attacks and such, and I wouldn't have a Pally use things like Bluff either (unless, maybe it would be the only way to save someone else's life). It also depends on the Deity, the local law of the world the Pally lives in and so on.<br/>\nOne could even argue if a Paladin should fight with a ranged weapon (there actually were people in history who thought that bows were for cowards and/or peasant's weapons), even though that's absolutely legit. <br/>\nMatter of taste and up to the individual player, really.<br/>\nIf the game allows it, I am OK with it. Also, computer games, especially solo and not on a server are not the same as PnP. RPing and character decisions always will be more or less limited. You may pick from many options, but you can't decide freely what you do or say. One may want to use everything one has here. (Or not, if one wants an extra challenge.)<br/>\n<br/>\n(Says the person who had trouble with the first fight at the Friendly Arm in BG I, because I didn't want Montaron and Xzar in my group so that it was just my CG ranger and Imoen, lol...)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "0rangeAGENT",
      "avatar": "10759393_1603651917.jpeg",
      "timestamp": "11:34 PM - Oct 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I could see a Paladin/Rogue combo as a spy who is loyal to a LG nation/theocracy moving against or keeping an eye on other less benevolent nations or individuals.  Or even as a counter spy defending his nation.  Even Pick Pocket could be interpreted as “Slight of Hand”.  Remove weapons or potions from an opponent that you know is evil, while you chat them up during a social event.<br/>\n<br/>\n(I am NOT thinking of James Bond, by the way.  I don’t think he comes close to god-fearing Lawful Good.)<br/>\n<br/>\nHaving said this, I’m not sure how it’d apply to this game, but certainly in a PnP campaign.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "11:43 PM - Oct 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">None of the Rogue abilities are evil.  Personal opinion aside there is no D&amp;D or NwN reason why a Paladin cannot/should not be a Rogue.<br/>\n<br/>\nEven on RP / Lore heavy servers, Paladin / Rogues are allowed and played ... divine might is a solid addition to Dexer damage.<br/>\n<br/>\nI much prefer lawful interesting over the all too often lawful stupid myself.  I find a gritty “force of will” style sneaker scout / hidden weapon paladin far more interesting than a shiny knight and I really like the opportunity for people to play interesting characters.<br/>\n<br/>\nMechanics aside I do not have a problem with a Paladin / Rogue and I find they make interesting characters.  Paladins have spies and well, some of them ... are Paladins.  You will not see them until your evil is extinguished quietly in an alley somewhere.<br/>\n<br/>\nThis is how I see a Paladin / Rogue:<br/>\n<br/>\n<a class=\"postlink\" href=\"https://dresdenfiles.fandom.com/wiki/Donald_Morgan\" rel=\"noreferrer\" target=\"_blank\">https://dresdenfiles.fandom.com/wiki/Donald_Morgan</a><br/>\n<br/>\nGritty, gothic, worn but unbroken ... interesting.  There is no “Grey” and only a tiny sliver of “White” in a world of “Black”.<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:49 PM - Oct 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Freaky Grandma wrote: <a data-post-id=\"22473\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=22473&amp;sid=3e99453c08bffef278022b0f974eeb8e#p22473\">↑</a><div class=\"responsive-hide\">Oct 30, 2020</div></cite>\n(Says the person who had trouble with the first fight at the Friendly Arm in BG I, because I didn't want Montaron and Xzar in my group so that it was just my CG ranger and Imoen, lol...)</div></blockquote>\nQuick aside and tip for BG1...<br/>\n<br/>\nIf you don't want Xzar and Montaron, just pop down to High Hedge from the area of Gorion's death (saving first, 'cause you're really not ready for waylays yet), drop straight down and pick up Kivan nice and early, then pop back again. You'll get him as a L2 character while the pair of you are still L1. Very handy with a bow. And don't forget to recruit the two Zhents to nick their gear before letting them go again. Obviously not a good idea for a Pally, but s/he shouldn't be travelling with evil types anyway (he says trying to find some relevance to the thread).<br/>\n<br/>\nCheers<br/>\n<br/>\nI will have more to add on the actual business at hand, but I'm due to speak with elderly ma in a few minutes, so need to \"prepare\" myself.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:16 AM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>None of the Rogue abilities are evil. Personal opinion aside there is no D&amp;D or NwN reason why a Paladin cannot/should not be a Rogue.</div></blockquote>\n\nIt does not have to be about evil - neutral (non-good) will serve as well.  Pick Pocket, Sneak Attack, etc are definitely not in alignment with a Paladin's Code of Honor.  This is not debatable, btw.  It is a fact.<br/>\n<br/>\nThat NWN is rather limited in comparison to PnP, I can see making some exception due to not including a class with compatibility with Paladin (if only Harper Scout had UMD, it would be right there).<br/>\n<br/>\nBut anyway, for NWN and building, I think we should just let it slide under the radar.  Maybe give it a frown or two.  I mean, Bioware totally screwed Paladins up for NWN anyway.  Like falling from grace, etc.  I really wish they had been given more work (and for christ's sake, give Holy Avenger back it's bite!)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "12:22 AM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote:</cite>\nIt does not have to be about evil - neutral (non-good) will serve as well.  Pick Pocket, Sneak Attack, etc are definitely not in alignment with a Paladin's Code of Honor.  This is not debatable, btw.  It is a fact.\n</div></blockquote>\n\nStating your opinion is fact does not make it fact nor does it make it non debatable.<br/>\n<br/>\nI suspect if they were not in alignment with a Paladin‘s Code of Honor, it would be mentioned in lore ... somewhere, anywhere?  Likely more than once since they are base classes.<br/>\n<br/>\nThat is the cool thing about games, they all have rules, some enforced mechanically and some suggested strongly via lore.<br/>\n<br/>\nBut, I can agree they obviously don’t fit your idea of what a Paladin’s Code represents.<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:24 AM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've already posted the links to all the references and rules governing this for 3.0 in other threads where this was debated.<br/>\n<br/>\nI'm not stating an opinion.<br/>\n<br/>\nYou are.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "12:28 AM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So, you start a thread on the topic, do not post your references.  Respond with “I did it elsewhere”.  <br/>\n<br/>\nFair enough, it is your thread and your narrative ... carry on.<br/>\n<br/>\nI’ll carry on playing Paladin Rogues.<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:31 AM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Go dig it up - I'm not doing your work for you.<br/>\n<br/>\nYOU asserted that rogue stuff is compatible with Pally regardless of source.<br/>\n<br/>\nThe onus of proof is on you.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "1:35 AM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The absence of any lore or rule is difficult to prove but sure, I can give it a go.<br/>\n<br/>\n3.0 and 3.5 were the move away from the Lawful Stupid characters including Paladin to the a more dynamic Lawful Good including paladins and their code of conduct.  <br/>\n<br/>\nWith the move to 3.0 we see backstab being replaced with sneak attack which is a combat ability just like knockdown or disarm.  With the move to 3.5 we see pickpocket being replaced with sleight of hand.  Each of these is to bring the class skill/feat descriptions more inline with the class alignment positioning and multiclassing options.  Things like backstab and pickpocket have negative connotations, giving rise incidentally to positioning like this thread.  These are corrected in 3.0 and 3.5.<br/>\n<br/>\nEdition 3.0 / 3.5 (NwN &amp; Expansions source)<br/>\nPlayers handbook 3.0 and 3.5<br/>\n- nothing under paladin indicating it cannot take rogue as a multiclass<br/>\n- nothing under the paladins code of conduct indicating anything related to rogue skills or abilities, or rogues<br/>\n- nothing under rogue indicating it is a non-lawful or non-good class nor anything indicating that a rogue cannot use their abilities if they are lawful and or good.  In fact it specifically states they can be any alignment.<br/>\n- nothing under sneak attack indicating it is a non lawful nor non good attack, blends in well with the fact rogues can be lawful good.  It is just an attack that leverages the vulnerabilities of your opponents body to do more damage.<br/>\n- nothing under pick pocket indicating it is an evil or even neutral act.  This falls well in line with the fact that rogues can be lawful good<br/>\n<br/>\nDMs guide 3.0 and 3.5<br/>\n- nothing about incompatibilities between rogue and paladin or lawful good and rogue skills.  Nothing indicating any incompatibilities between paladin code of conduct and rogue abilities.<br/>\n<br/>\nBook of Exalted deeds 3.5<br/>\n- nothing indicating rogue abilities are not in line with a lawful good alignment or a paladins code of conduct.<br/>\n- exalted rogue states as fact/ specific ruling that a lawful good rogue is “as dependable as a paladin” and sneak attack as no “more evil than bull rush or trampling attacks” or any other form of violence.  It is all in how you apply the violence. It also makes reference to the lawful stupid code of honor as not limiting the lawful good rogue.<br/>\n<br/>\n<br/>\nThat should probably do it.<br/>\n<br/>\nAs I said, nothing in rules or lore stating it is not an acceptable combination.<br/>\n<br/>\nFact ... not opinions stated as fact with no references.<br/>\n<br/>\nAnd, I want to call this out,  I stated my opinion, you countered with what I believed was a made up fact, I again countered with my opinion (belief) and indicated is bad form to use “fact” in a discussion without backing it up with some proof.  The important bit here is that you introduced it and positioned it as fact.  Fair enough, but it is also fair .. I think .. that if you are going to claim you win a discussion with an unsubstantiated fact, that it is then your responsibility to do your own work and substantiate it.  Making it my job to prove/disprove your unsubstantiated fact is counter productive to a discussion and bad form.  Otherwise we fall into the internet discussion with everyone tossing around opinions not so cleverly disguised as unsubstantiated “facts” and I hope that does not happen here.  It takes significant effort to disprove what someone else can claim as a fact with no effort whatsoever. <br/>\n<br/>\nUpdate: a point of clarification.  Lawful Stupid is a cultural term hailing back to a time when players and DMs interpreted a Paladin code of conduct so rigidly it impacted the ability to play dynamic characters properly.  It was a common term for people and or campaigns that played Paladins ... poorly.  <br/>\n<br/>\nThis was understood as an issue and corrected as subsequent editions were released.  Offering a more dynamic paladin including non human paladins, paladins with different (individual) code of conducts and ultimately non good Paladins. <br/>\n<br/>\nIt was not meant as a derogatory argument attack.  It is an actual cultural term and real issue at the time. <br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:57 AM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This, I think, is the thread where the issue last raised its ugly head, and where Web gives his references (starting on page 2, iirc). <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-knight-errant-paladin-9-rogue-5-champion-of-to-t2355524.html\" rel=\"noreferrer\" target=\"_blank\">The Knight Errant</a><br/>\n<br/>\nCheers (and remember, no more discussion of this within that thread, lest the moderator's hammer fall)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "7:44 AM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the link to prior discussion. I reviewed them and I think my findings are pretty specific to dismantling the argument at hand.<br/>\n<br/>\nIf the one thing that cannot be explained away is sneak attack and the rules clearly state sneak attack is to be considered no different than bull rush or trample then it should put the facts to bed nicely.<br/>\n<br/>\nI am good with completing my involvement with the discussion here.<br/>\n<br/>\nWeb, let me know if you want a SS<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Leyoz",
      "avatar": "no_avatar.png",
      "timestamp": "3:55 PM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"> I my opinion Paladin and rogue mix extremely well as a thief catcher type concept. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:01 PM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"22466\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=22466&amp;sid=643d60089666f48dee74bc95db11247f#p22466\">↑</a><div class=\"responsive-hide\">Oct 30, 2020</div></cite>So many of you know my reluctance (to put it mildly) to put Paladin and Rogue levels together.<br/>\n<br/>\nI have been thinking about this.<br/>\n<br/>\nIn PnP, I think things are a bit more concrete (especially 3.0) and there are valid reasons against putting these two Classes together.  One of them is the fact that there are other classes that have access to UMD and Tumble that do not have Sneak Attack.<br/>\n<br/>\nIn NWN, however, we do not have this luxury.  There is only Rogue, Bard, and Assassin.  And of these three, only Rogue is a possibility without an alignment change.<br/>\n<br/>\nSo it is with a heavy RP heart that I say that Rogue and Pally combinations should be considered valid combinations in NWN.<br/>\n<br/>\nOf course, should one be playing in an altered environment where one can get Tumble and UMD without Sneak Attack (the PRC, for example) then it should be avoided.<br/>\n<br/>\nYour comments and opinions are welcome.</div></blockquote>\nTo offer a little clarification here, I think, before we continue hurtling down the same old rabbit hole. The OP (above) accepts - however reluctantly - the validity of Pally/ Rogue combos <em>in NwN</em>. The question is both deeper and more esoteric at the same time, bringing up the construction of Paladin, Rogue, and other classes, by Bioware and its inheritors. Perhaps the question should be flagged with the Beamdog wombles, as they're really the only ones who can do anything about it now (unless someone like Yunim can tell me different, 'cause he's good at that sort of thing)?<br/>\n<br/>\nJust wondering...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:29 PM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">With respect to PnP Rogue Paladins  multiclass has never been discouraged.  With respect to NwN, UMD is a pretty powerful thing in most modules.  <br/>\n<br/>\nOn Arelith, which has provided substantial class and balance customisations they made some interesting changes.  There are other persistent modules I have played with more class customisations but they all tended to abandon the balance.<br/>\n<br/>\nFirst, they made bards allowed to be lawful,  this resulted in every spell caster dipping bard and every melee dipping rogue.  From a balance perspective it worked.  From a RP perspective, on an RP heavy persistent module, it really didn’t.  Nobody RPd their bard dips and it felt odd having to “be a bard” as a cleric for example.<br/>\n<br/>\nBard paladins were fun though, brought a light hearted approach to Paladins, the slang term for them is Bardadin if you were curious.<br/>\n<br/>\nThey then introduced a generic class called specialist with no RP connotations. Which I think solved the issue elegantly.  All those bard dips could be specialist dips and still net UMD. <br/>\n<br/>\nRogue was never a big deal really, rogue has always been positioned as a pretty generic multi-class with whatever and go class requiring no RP elements unless you decide to create some around it.  They can be scallywags, politicians, underworld figures, Robin Hood, the joker, etc.  They actually get, in my opinion if not fact, the widest possible RP breadth in PnP.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "11:59 PM - Oct 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I figured I would drop this in here for future reference on the thread.  Book of Exalted Deeds, Chapter 1: The Nature of Good, Page 19.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:43 AM - Nov 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am not talking about evil - I ame talking about going against the Code of Honor that a Paladin has to follow. I have explicitly stated this in my posts in the links that Stag kindly dug up.<br/>\n<br/>\nI have already looked through your reference, way before this was posted.  It states right before that in black and white \"<em>Even lawful good rogues are not bound to an abstract and impractical <strong>Code of Honor </strong>that would limit their use of sneak attacks beyond the general limitations on violence discussed earlier in this chapter\".</em><br/>\n<br/>\nNote that we are not talking about a Rogue here, we are talking about a Paladin, who has a Code of Honor.<br/>\n<br/>\nSo, you have obviously read it, you even understand it (I am certain that you can read and comprehend what is written), and you are being ingenius and deceptive by ignoring that which negates your own position in the same information you post to shore it up!<br/>\n<br/>\nI get it, you are so fixated in your opinion that you will not budge, and the more facts put before you (even those you post! against your position) will only further entrench your belief.  <br/>\n<br/>\nSince there is no way to get you to see the facts before your eyes, there is no reasoning with you.  If, on the other hand, you are capable of reason, and realize that the information you have posted undermines your own position, then I would be more than willing to accept that and we can move on.  Otherwise, it is quite pointless to continue with you.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:58 AM - Nov 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So, the \"Code of Honor\" statement, I considered it  I did ponder if <em>an abstract and impractical Code of Honor</em> related in any way to the Paladin Code of Conduct. So, I decided to take a look and then did some searching for it across the core books and found it is not referenced in any way outside of this description.  No link what so ever any where related to Paladin.  And yet your stated position is now that in addition to a Code of Conduct that is inline with lawfulness and goodness, a Paladin also has to follow an  an abstract and impractical Code of Honor.<br/>\n<br/>\nReference: From Paladin in the 3rd edition players handbook:<br/>\n<em>Paladins must be lawful good, and they lose their<br/>\ndivine powers if they deviate from that alignment. Additionally,<br/>\npaladins swear to follow a code of conduct that is in line with lawfulness<br/>\nand goodness.</em><br/>\n<br/>\nSo, lets look at the actual facts as we have compiled them so far then compare them to the facts you told me it was my responsibility to find and prove/disprove.<br/>\n<br/>\nActual Facts:<br/>\n1. There are no published facts anywhere indicating that any of the feats or skills you have identified as not usable by a Paladin are, in fact, not useable by a Paladin for alignment or 'Code of Conduct' reasons.<br/>\n2. We know the Paladin 'Code of Conduct' states that a Paladin must follow a Code of Conduct that is inline with lawfulness and Goodness.<br/>\n3. We know that a Paladin has to be lawful good.<br/>\n3. We know that a rogue has no alignment restriction nor any alignment based restriction relative to using their skills/feats.<br/>\n4. We know 'specifically' that an Exalted, Lawful Good  Rogue exists. <br/>\n5. We know that Sneak Attacks are no more evil than any other combat feat out there and that Lawful Good rogues should not be tied to an abstract and impractical Code of Honor that prevents them from using sneak attacks.<br/>\n<br/>\nNow, lets look at a summary of the known items you have positioned as factual and the findings related them.  I will specifically call out that I could be wrong in this list as apparently it was my responsibility to go find your list of facts and then also my responsibility to validate them.  So please let me know if I misunderstood anything here or missed anything.<br/>\n<br/>\n1. We know that you believe that a Paladin has to follow an abstract and impractical Code of Honor.  Searching for such a thing across all the core books and Book of Exalted Deed finds no reference to any such thing.  Although Paladin's do have to follow a Code of Conduct that is inline with lawfulness and goodness.  I suppose it is possible this is the same as an abstract and impractical Code of Honor, but I really believe that to be unlikely.  If we do choose to make that unsupported logical leap, I feel it leaves Paladin's poorer for it.  So, I position this statement as a false fact until you can produce a single factual reference.<br/>\n<br/>\n2. We know that you believe that there is a list of feats and skills that a Paladin cannot use.  Searching for such a list of things across all the core books and Book of Exalted Deeds finds no such list.  In specific I believe you noted Pick Pocket and Sneak Attack.  So, I decided to challenge my bias a bit and see if I could find anything relating to either of these that supported your \"facts\".  I found nothing relating to Picket Pocket (nor Sleight of Hand).  I did find something relating to Sneak attack indicating it is no more evil than any other feat and that a Lawful Good Rogue should feel free to use it.  Although a Rogue is not a Paladin, a Paladin is not Lawful Good++ either so I feel this combined with no such forbidden list proves this is a false fact.   Also, we are talking about multiclassing a Rogue with a Paladin so I would submit it does offer some value.<br/>\n<br/>\nReference:  <strong> Pick Pocket, Sneak Attack, etc are definitely not in alignment with a Paladin's Code of Honor.  This is not debatable, btw.  It is a fact.</strong><br/>\n<br/>\nSo, I have three questions here.  The first is, why is this a fact?  I asked it already once before and you told me to go figure it out on my own.  As you can see from the above no such thing exists anywhere officially.  But you are repeatably positioning it as a fact and not an opinion so, show me the fact ... where is it?  Second, and I do admit this is more for the sake of my curiosity,  what other skills and feats do you believe are on the secret Paladin's cannot use list? Third, what is the Paladin's Code of Honor exactly, as far as I can tell there is no such thing and as it seems to be the underpinning of your entire argument, I think it would be useful to see some official reference to it.<br/>\n<br/>\n3. I am going to lump this together because it rambles a bit and does not appear to fold back into anything of substance.  It is not my intention to cherry pick to support my argument so please feel free to note anything I missed and remember I did ask you previously to identify your position/facts and your response was \"find out on your own\". <br/>\n<br/>\nReference: <strong>I have no problem with a LG Rogue.  I have no problem with a Rogue/CoT - it works together quite well imo.  But Paladin and Rogue just does not work, due to Sneak Attack and the mentality that is behind it, and how a Paladin works.  This is not an Alignment issue, it is an issue with the core of both Classes.  One that will take advantage of an opponent and strike, and another that will not.  One that must follow his Code of Conduct, and one who can ignore such at will.</strong><br/>\n<br/>\nWhere is the Paladin Code of Conduct you have found?  The one I found is that <br/>\nRefence: Player's Handbook 3rd Edition: <em>Paladins must be lawful good, and they lose their<br/>\ndivine powers if they deviate from that alignment. Additionally,<br/>\npaladins swear to follow a code of conduct that is in line with lawfulness<br/>\nand goodness.</em><br/>\nSo you appear to have no problem with a Lawful Good Rogue, but your position is that a Paladin must follow their Code of Conduct which is ... to follow a code of conduct that is in line with lawfulness and goodness.<br/>\n<br/>\n<br/>\n<em>Striking an opponent when they cannot defend themselves.  This is anathema to what a Paladin is, stands for, and believes in...</em><br/>\n<br/>\nThis is invented, nowhere does it state paladins cannot use sneak attack, nowhere does it state a paladin cannot take advantage of weakness or vulnerability, in fact nowhere does it state this is anathema to what a Paladin stands for.  This I believe ties back to the Lawful Stupid idea.  There is a whole list of Lawful stupid things I remember from those days.<br/>\n<br/>\nWhat it does state is that Good character must respect life accept surrender and offer Mercy.<br/>\n<br/>\nReference: Book Of Exalted Deeds:<br/>\n<em>Good characters<br/>\nmust offer mercy and accept surrender no matter how<br/>\nmany times villains might betray that kindness or escape from<br/>\ncaptivity to continue their evil deeds. If a foe surrenders, a good<br/>\ncharacter is bound to accept the surrender, bind the prisoner,<br/>\nand treat him as kindly as possible. (See Mercy, Prisoners, and<br/>\nRedemption in Chapter 2 for more about the proper treatment<br/>\nof prisoners.)</em><br/>\n<br/>\nAlso in the Book of Exalted Deeds we see the much debated:<br/>\n<em>Even lawful good rogues are not bound to an<br/>\nabstract and impractical code of honor that would limit their<br/>\nuse of sneak attacks beyond the general limitations on violence<br/>\ndiscussed earlier in this chapter. The use of sneak attacks<br/>\nis no more evil than the use of a bull rush or trampling maneuver</em><br/>\n<br/>\nSo, we know the Paladin Code of Conduct requires them to follow a code of conduct that is in line with lawfullness and goodness.  We know a Lawful Good rogue is free to use Sneak attack, an ability no more evil than bull rush or trampling maneuver.<br/>\n<br/>\nSo, again I ask.  Show me a reference to sneak attacks being anathema to a Paladin's Code of Conduct or Lawful Good even show me a reference to this abstract and impractical Code of Honor mentioned under Exalted Rogue as applying in any way to a Paladin.  Otherwise, this is a false fact.<br/>\n<br/>\nNow this is the one I really struggle with:<br/>\n<br/>\n<strong>Now, I did not make the rules, anymore than you did.  And yes, one can make up any homebrew rules one wants (it is D&amp;D) - this is what you are doing. <br/>\n<br/>\nBut in the rules as written (pretty much what we have to go by when there is a dispute), it doesn't work.<br/>\n<br/>\nYou are not describing a Paladin.  You are describing more along the lines of a CoT, or honorable Fighter, or X.  But not a Paladin.<br/>\n<br/>\nA Paladin does not deviate from his Code of Conduct.  Doing so results in penalty, grob discrepancies resulting in a Fall. I think this is where you are having the problem here - a Paladin is more than just a Fighter with a bunch of abilities baked in.  It is a living example of Law, Good, and whatever is in it's Code of Conduct.  There is a valid reason why it has to be Lawful and Good aligned.  It is what separates it from the CoT, as well.</strong><br/>\n<br/>\nYou keep claiming there are rules regarding this.  Provide them.  In the rules as written. Where?  What rule?  <br/>\n<br/>\nA Paladin does not deviate from his Code of Conduct.  Show me a reference to their Code of Conduct as you outline that supports your position.<br/>\n<br/>\nThis is my reference again, as written, in the Player's Handbook:<br/>\n<em>Paladins must be lawful good, and they lose their<br/>\ndivine powers if they deviate from that alignment. Additionally,<br/>\npaladins swear to follow a code of conduct that is in line with lawfulness<br/>\nand goodness.</em><br/>\n<br/>\nI have shown you mine, now show me yours.  Not piecing together a bunch on unrelated stuff, a reference to an actual spelled out Code of Conduct.<br/>\n<br/>\nYou keep claiming there are written rules and you have them but you want me to find them.  I have jumped through your hoops, I am done.  Either actually provide something of substance which I can then consider or stop claiming your opinion as facts and rules<br/>\n<br/>\nFurther, I find it difficult to believe that in 20 years, this issue has never been noticed or addressed anywhere in the rules and the designers and contributors expect the definition of a Paladin's behaviour to be coupled together from cross class snippets to counter the fact all the mechanics and rules allow Paladin / Rogue combination.  It is an interesting conspiracy theory but I expect someone, somewhere would have noticed this an made an official ruling on multiclassing Paladin / Rogue if it was an issue.<br/>\n<br/>\nI'll end my discussion with this.  The base of your argument is weak, you keep claiming things as facts and rules you refuse to  provide support reference for and do not appear to exist anywhere.  When challenged, you double down on your position and state it is not your responsibility to provide support for your own statements. Either provide your references proving your rules and facts are such or accept your position has no actual supporting rules and facts and thus lacks merit entirely.<br/>\n<br/>\nNow, as before, lets address your non discussion based responses:<br/>\nSo, I understand it is easy to speak for another's motivations and position, I consider it a weak argument and pretty insulting to essentially state both sides of the argument speaking for both people in an attempt to validate a weak and/or untenable position.  I also understand how easy it is to provide a small piece of the context and argue to that rather than the entire thing and addressing it as a whole.  As I understand how easy it is to claim rules exist, lists of things exist, ruling on combinations that oppose the basic mechanics of both the PnP and NwN games exist.  This is excellent, and a basis for a discuission, but you have to actually provide them.  This is why I provide actual references and back up my statements because without the actual backup, the points have no merit no matter how many times you claim them as fact.<br/>\n<br/>\nAlternatively lets have a hypothetical discussion about why you feel the game mechanics are wrong.  It would be an interesting discussion I am certain.<br/>\n<br/>\nFinally, I do not need to nor wish to stoop to the level of speaking on behalf of and to the motivation of another person in the discussion, it is not particularly difficult I just find it distasteful and petty.    I prefer to discuss the facts on their own merits rather than speaking for you, I would ask you to do the me the same courtesy.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "11:39 AM - Nov 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Let us talk <strong>Code of Conduct</strong> for a moment.<br/>\n<br/>\nI wanted to keep this separate from my response to Webshaman but I believe it is an important thing.<br/>\n<br/>\nIn 3.0 and 3.5 and moving forward, many barriers to rigid RP were removed.  I noted this early with the shift in feat/skill naming and descriptions.  <br/>\n<br/>\nOne of the Paladin specific interesting things  was the idea of a Code of Conduct.  The position in this thread is based upon an idea of a universal \"Code of Conduct\" which all Paladins must follow and implies it is a rigid , unbending thing that requires a Paladin to behave in a way that bypasses even the base core rules as outlined in the system.  I refer to this by the cultural reference of the time ... the Lawful Stupid Paladin and this is something that has been specifically addressed/dismantled in 3e and moving forward.<br/>\n<br/>\nThere are a few references to Code of Conduct in the Players Handbook.<br/>\nReference: Player's Handbook 3e <br/>\nPaladin References:<br/>\n<strong>Alignment: Paladins must be lawful good, and they lose their<br/>\ndivine powers if they deviate from that alignment. Additionally,<br/>\npaladins swear to follow a code of conduct that is in line with lawfulness<br/>\nand goodness.</strong><br/>\n<br/>\n<strong>A paladin must be of lawful good alignment<br/>\nand loses all class abilities if she ever willingly commits an evil act.<br/>\nAdditionally, a paladin’s code requires that she respect legitimate<br/>\nauthority, act with honor (not lying, not cheating, not using poison,<br/>\nand so forth), help those in need (provided they do not use the help<br/>\nfor evil or chaotic ends), and punish those who harm or threaten<br/>\ninnocents.</strong><br/>\n<br/>\nGeneric \"Lawful Evil\" Villain reference:<br/>\n<strong>Lawful Evil, “Dominator”: A<br/>\nlawful evil villain methodically takes<br/>\nwhat he wants within the limits of his<br/>\ncode of conduct without regard for<br/>\nwhom it hurts. He cares about<br/>\ntradition, loyalty, and order but not<br/>\nabout freedom, dignity, or life. He<br/>\nplays by the rules but without mercy<br/>\nor compassion. ... <em>this is a snippet from a full paragraph</em></strong><br/>\n<br/>\nEx-Cleric reference:<br/>\n<strong>A cleric who grossly violates the code of conduct required by his god<br/>\n(generally by acting in ways opposed to the god’s alignment or<br/>\npurposes) loses all spells and class features, except for armor and<br/>\nshield proficiencies and proficiency with simple weapons. He<br/>\ncannot thereafter gain levels as a cleric of that god until he atones<br/>\n(see the atonement spell description, page 201).</strong><br/>\n<br/>\nI have always seen the \"Code of Conduct\" as a thing that defines a divine character, well any character really as you see there is a call out for a Villain above, but ... in the case of the Divine characters it gets even more interesting for me.<br/>\n<br/>\nA \"Code of Conduct\" is both a rigid and flexible thing.  It is rigid because in the case of a Divine character it is ... usually ... tied directly to a Deity and a particular alignment limitation, portfolio(s), goal(s), opposing Dieties, Friendly Dieties, Deity particular hatred, etc. <br/>\n<br/>\nClerics I have always seen as the more rigid Divine class, they draw their power from worshipping a specific Deity and buying into that Deities \"stuff\", they are human and they make mistakes and if they are bad enough ... Ex-Cleric but they do get an alignment range or some wiggle room.<br/>\n<br/>\nPaladin's add something even more interesting to mixture in 3e.  A Paladin is not tied to a specific Deity, a Paladin is a force of divine righteousness with their own individually specific \"Code of Conduct\" not necessarily tied to a specific Deity and/or Deities it is derived simply from their belief in their own Righteousness.<br/>\n<br/>\nReference Players Handbook 3e:<br/>\n<strong><br/>\nReligion: Paladins need not devote themselves to a<br/>\nsingle deity—devotion to righteousness is enough. Those<br/>\nwho align themselves with particular religions prefer<br/>\nHeironeous (god of valor) over all others, but some paladins<br/>\nfollow Pelor (the sun god). Paladins devoted to a god are<br/>\nscrupulous in observing religious duties and are welcome in<br/>\nevery associated temple.<br/>\n</strong> <br/>\n<br/>\nThis, offers immense RP opportunity and versatility.  I feel people easily get stuck in a narrow idea of what a Paladin is, perhaps even seeing them as an even more restricted version of a cleric. <br/>\n<br/>\nThis is very much not the case.  A Paladin is a free entity working on the behalf of their righteous belief in their own particular version Lawfulness and Goodness.  They can and should do things Clerics cannot and should not do.  They can and should even do things that oppose their Deities as long as those things align with Lawfulness and Goodness.  It is a delicate balance between the Paladin's sense of divine mandate, their Deity or Deities and even the Laws of the place the live in.  In the end though, their Righteous belief sits at the top of the priority pile. <br/>\n<br/>\nThere is no concept of \"Code of Honor\" that a Paladin has to follow in 3e.  There is an individually defined \"Code of Conduct\" as defined not by a Global definition for all Paladins nor a Deity but by the Paladin themselves and what defines their Righteous belief of what is Lawful and Good and what that represents.  You can \"choose\" to be Lawful Stupid but you are no longer \"required\" to be and that little difference makes all the difference in the world.  It still gives me a little rush of excitement about the PnP possibilities and what the represents each time I think about it.<br/>\n<br/>\nSimply put, Paladin's as of 3e, gained even more individual character and RP flexibility than Clerics.  Lawful Stupid was put to bed firmly, Paladin's quite simply rock RP wise in 3.0e+<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "kfor85",
      "avatar": "10759362_1598639921.jpg",
      "timestamp": "4:15 AM - Nov 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">WoG wants me to build a paladin with the weapon of choice of a rogue though? What kind of trickery is this?! :D<img class=\"post-image\" loading=\"lazy\" src=\"//uploads.tapatalk-cdn.com/20201113/58f10370d354c3b0e3ccc73dec107f24.jpg\" /><br/>\n<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:44 AM - Nov 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's a Longsword for a Halfling, you know :D<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}