{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "695",
  "name": "The Champion of Brandobaris  (Cleric 30 / CoT 6 / Rogue 4)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-champion-of-brandobaris-cleric-30-cot-6-rogue--t2355340.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 13,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:12 PM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">This is a bit of a crazy build, not sure its been done:<br/>\n<br/>\nEDR III halfling cleric tank, 500+hp<br/>\nHigh cleric (30 CL) - to prevent buffs getting dispelled/some mord resistance<br/>\nDex based protected by evasion uncanny dodge from rogue<br/>\nBase AB 37 melee, 35 ranged<br/>\nUMD 33/Tumble 40/Max conc/Spot 40(48)/search<br/>\nGreat saves F 32(41) W 29(38) R 31(40) - saves against spells are in () brackets<br/>\n<br/>\nDesigned for party enjoyment, (who doesn't love a Buffer and Tank) but enough in it to solo.<br/>\n<br/>\nThe Str 6 I really dont like but I didn't really want to drop the dex or int any further.<br/>\n<br/>\nJust wondering if you guys had your thoughts were on what I should do with the Str score, leave it because it won't matter with extended divine power?<br/>\n<br/>\nAlso any other possible tweaks.<br/>\n<br/>\nI could go Cleric 26/CoT 10/Rogue 4 for more saves / +1 AB / +1 AC but I do want high caster levels to make them last long, and have some resistance from low CL Mords.<br/>\n<br/>\nOh and I've ignored discipline in this build. Its not really going to help against knockdown anyway, so this guy is gonna need some knockdown immunity regardless of the discipline score.<br/>\n<details><summary>Spoiler</summary>Cleric(30), Champion of Torm(6), Rogue(4), Halfling\nSTR: 6\nCON: 15 (21)\nINT: 14\n\n01: Rogue(1): Blind Fight\n03: Cleric(2): Weapon Finesse\n05: Cleric(4)\n07: Cleric(6)\n09: Rogue(2): Empower Spell, {Evasion}\n11: Cleric(9)\n13: Cleric(11)\n15: Cleric(13): Weapon Focus: Shortsword\n17: Cleric(14)\n19: Cleric(16)\n21: Cleric(17): Great Constitution I, (CON=21)\n23: Cleric(19)\n25: Cleric(21)\n27: Cleric(23): Epic Damage Reduction II, Great Wisdom I, (WIS=18)\n29: Cleric(25)\n31: Champion of Torm(2): Epic Weapon Focus: Shortsword\n33: Champion of Torm(4): Great Dexterity II, Epic Damage Reduction III, (DEX=20)\n35: Champion of Torm(6): Epic Prowess\n37: Rogue(4)\n39: Cleric(29): Great Dexterity IV, Armor Skin, (DEX=23)\n\nSkillpoints: 214\nSaving Throw bonuses: Spells: +9, Fear: +2\nAB (max, naked): 37 (melee), 35 (ranged)\nSpell Casting: Cleric(9)\n\n\n01: Disable Trap(1), Open Lock(1), Search(4), Set Trap(1), Spot(4), Tumble(4), UMD(4), Save(21), \n03: Concentration(1), Save(20), \n05: Concentration(1), Spellcraft(5), Save(21), \n07: Concentration(1), Save(27), \n09: Search(7), Spot(7), Tumble(6), UMD(7), Save(13), \n11: Concentration(1), Save(13), \n13: Concentration(1), Save(19), \n15: Concentration(1), Spellcraft(5), Save(20), \n17: Concentration(2), Save(19), \n19: Concentration(1), Save(25), \n21: Concentration(2), Spellcraft(5), Save(7), \n23: Concentration(1), Save(13), \n25: Concentration(1), Spellcraft(5), Save(14), \n27: Concentration(1), Save(20), \n29: Save(27), \n31: Spot(11), Save(19), \n33: Spot(1), Save(25), \n35: Spot(1), Save(31), \n37: Spot(2), Tumble(20), UMD(13), Save(5), \n39: Concentration(4), Spellcraft(1), Save(1), </details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:00 PM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The strength will be capped with Divine power, so I guess you answered that question yourself.<br/>\nYou can always buff with bull's for when you're out of combat and need carrying capacity. It will of course help when you wear light armor or robes and get weight reduction property on the shield and \"everything\" else. <br/>\nAnd you will need bags of holding, but even they can add up to some weight, even if they are only 1 lb each. So you may want bags with only 10% = 0,1 lb weight as a DM gift <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\nAs for damage, you have too rely on your attack spells and buffs.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:54 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ummm...can he even carry a mace if he gets dispelled?<br/>\n<br/>\n6 Str!? <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\nAfter level 4...or more (because, let's face it, BS does not last all that long, so you will be looking for extended BS at 3rd level spell slots), things should get real nice...until you run out of Wisdom at level 11.<br/>\n<br/>\nHooboy.<br/>\n<br/>\nYou don't get full spells until level 30 (19 Wisdom) right?<br/>\n<br/>\nI don't know...even with +12 to Wis from items, that only gets a 28 Wisdom.  Not too many spellslots for extended DP.<br/>\n<br/>\nGonna have to hunt for bonus spellslots on items, I guess.<br/>\n<br/>\nIs there anyway maybe to reverse the Con/Wis gain?  Do Wis before Con?<br/>\n<br/>\nThat would give access to level 9 spells, more spellslots, and that means more extended DP!<br/>\n<br/>\nJust some thoughts...still marveling at that 6 Str!<br/>\n<br/>\nHow would you even RP that?  <br/>\n<br/>\n\"Yeah, yeah, watcha staring at, high pockets?  I have withered limbs.  Had'em since birth!  Come over here and I'll give ya a good thrashin'!\"<br/>\n<br/>\nSo we need a name for this build - Withered Wee One!<br/>\n<br/>\nJust kiddin'!<br/>\n<br/>\nGive this build to KoL in the build challenge...hehe.  He'll go mad!  Isn't that the lowest Str one can get?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:23 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh Web my dear, this is a cleric. Piece of pie to level, even with the initial rogue level slowing down development.<br/>\n<br/>\nAs Mick wrote, wear light armor. <br/>\n<br/>\nThis answers some of your questions :)<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202002/10759084_9e49d7fe238f049c9bd653d9fa114566.jpg\" /></dl>\n</span><br/>\n<br/>\nI'm not using a sling by the way, the sling I put there for LOLs with the -2 damage from strength.<br/>\n<br/>\nUse a heavy crossbow till finesse and bull's strength :) Crossbows don't take Str penalties into account when calculating damage, so they are easily the best weapons until one gets bull's str.<br/>\n<br/>\n<strong>Edit:</strong> In more detail, this character is<br/>\n- encumbered at 60lbs (cannot run)<br/>\n- <strong>heavily encumbered at 70lbs (</strong>cannot walk at normal speed<strong>)</strong><br/>\n<br/>\n<strong>Edit 2: </strong>level 4 now as well. Two spell slots for bulls strength so he doesn't have to randomly drop pieces of cooked food on the floor to walk normally when picking up potions, rings or amulets LOL<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "1:37 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I suggest dropping DEX by 2 in order to even out your CON and WIS. -1 AB and -1 AC vs 40 HP and another level 7 slot when fully buffed is a decent trade in my opinion. This would also allow you to access level 7 and 8 spells earlier by reshuffling ability increases and feats, although you may have to delay EDR3 in order to achieve that. Even if you stick with your current abilities I would still recommend delaying EDR in order to reach level 7 spells at level 15.<br/>\n<br/>\nI would delay your first CoT level to level 19 even though it means delaying your Spot dump. Despite not having access to level 7 and 8 spells your Cleric levels are more important early on since they give increased duration, extra slots, and better buffs. Also I would move your second Rogue level to level 13 in order to get level 6 spells as soon as possible. In addition to Extended Haste it has Harm, Heal, and Greater Sanctuary.<br/>\n<br/>\nThis build doesn't have Silent Spell, possibly the most important metamagic feat for a healer. I'm not sure what I would recommend dropping for it, probably Empower Spell or Scribe Scroll.<br/>\n<br/>\nA very minor thing, I would drop 2 Search or Spot ranks to increase your UMD to 36. However I know this is a WoG build so I'm not sure if 35 UMD is needed there.<br/>\n<br/>\nEverything else looks great. Extended Divine Power will cover the low STR at higher levels although the early levels will be rough.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:06 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for reading this draft and the comments:<br/>\n<br/>\n<em class=\"mention\">@webshaman1</em> <br/>\n- As discussed cleric is easy to level, its a powerhouse class, he's lvl 4 already<br/>\n- I've followed Mick's suggestions for light armor. Have abandoned the concept of a shield until now.<br/>\n- Heavy crossbow / Short Sword is what I am using<br/>\n- 1d6 sneak is helpful<br/>\n- Spot is great in this build combined with the small stature, this little fellow can see things from a mile away.<br/>\n- I built him as a party tank + buffer, most of the buffs are spell levels 1-6 so I've prioritised a few levels of EDR before higher level spells<br/>\n- I like the Withered Wee One RP idea. Or maybe the crippled hobbit cleric tank? I shall have to develop this idea and others further!<br/>\n<br/>\n<em class=\"mention\">@Yunim</em> <br/>\n- Great suggestions as always<br/>\n- As discussed early levels are fine, its a cleric, the powerhouse class of low-mid magic<br/>\n- Agree with CT 1 at level 19, better to rush Cleric 15 before taking CT 1, this is something I will change in my build<br/>\n- Tried to fit silent spell into the build. Do you think Silent Spell &gt; Empower Spell here? Keen to hear from some more dedicated cleric players.<br/>\n- I like scribe scroll on clerics for heal scrolls, Summon IX scrolls etc (share it with your UMD teammates who will LOVE you). I wish SoV could be scribed.<br/>\n- UMD 33 I just arbitarily place on my builds for casting all spells without failure in case that is in place in the module played. I write the builds so it can be as optimal as possible in all locations (single player / PW -&gt; thats why I try to avoid/minimise exp penalties for single player modules where exp can be limited) it can be adjusted as desired. On WoG even less is enough, modified 30 is more than enough.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:10 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Two spell slots for bulls strength so he doesn't have to randomly drop pieces of cooked food on the floor to walk normally when picking up potions, rings or amulets</div></blockquote>\n\nOh no!  No respectable Halfling would drop food for ANYTHING!!<br/>\n<br/>\n\"It wasn't on the floor for longer than 5 seconds!  I swear!\" *stuffs ration in mouth*<br/>\n<br/>\n*eyes bulge*<br/>\n<br/>\n\"Is...is that dog hair?\"<br/>\n<br/>\nThis character cannot leave Hommlet until it is level 4.  That's a lot of frogs! :D<br/>\n<br/>\nI have played many Clerics, even ones with 8 Str (see Smooth Archer for details).  I know it is possible to survive low level even with light or no armor.  Environment depending, of course.<br/>\n<br/>\nJust...6 Str...omg.<br/>\n<br/>\nIf your buffs get blasted off in the middle of combat and you get encumbered because of that...ouch!  I have had it happen before with 8 Str...6 is worse.<br/>\n<br/>\nI would really suggest getting some str boosting gear pronto because of the above.  I was always worried about keeping my carried weight below pre-buff carry limit to prevent it from happening.<br/>\n<br/>\nNot an easy task with 8 Str.  With 6...*pulls hair*<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:16 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Since you don't have Ice Storm and your DCs are low, Empower is only really useful for ability buffs on this build. If you want to keep Scribe Scroll then I would definitely drop Empower for Silent. Extend Spell will cover low duration buffs, Silent Spell will help with spellbook management.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:21 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What about Empowered BB?<br/>\n<br/>\nThose are really fantastic for blocking areas off!<br/>\n<br/>\nThen just lure the poor basterds in!<br/>\n<br/>\nIf one really wants to have fun, run in a circle around it...hehehe.  Multiple run throughs by opponents kills quickly.<br/>\n<br/>\nI suppose one could get by with just normal BBs...but Empowered ones are \"teh chizz\".<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:38 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Empowered Blade Barrier can be useful even with a low DC but it's not worth giving up Silent Spell on a healer build. The main offensive spells for this build are Harm, Heal, and Word Of Faith. Combined with melee that should be enough to deal with most enemies.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "6:18 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You know what my advice is going to be ;)<br/>\n<br/>\nThis build has too many stats to cap (Wis/Dex/Con/Str with a side of Cha) and any Deep Cleric build with too many stats to cap needs to be War Domain.  It is also worth considering Strength domain if you want a solid Divine Power stack but I’d probably still go Travel or Trickery first.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "11:41 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think I would do something like this:\n<details><summary>Spoiler</summary>Cleric(30), Champion of Torm(8), Rogue(2), Dwarf\nSTR: 14 (24)\nCON: 17 (21)\nINT: 14\n\n01: Rogue(1): Blind Fight\n03: Cleric(2): Weapon Proficiency Exotic\n05: Cleric(4)\n07: Cleric(6)\n09: Cleric(8): Empower Spell\n11: Cleric(10)\n13: Cleric(12)\n15: Cleric(14): Weapon Focus\n17: Champion of Torm(1)\n19: Champion of Torm(2): Improved Critical\n21: Cleric(17): Epic Damage Reduction I\n23: Cleric(18)\n25: Cleric(20)\n27: Cleric(22): Epic Damage Reduction III\n29: Cleric(24)\n31: Cleric(26): Great Wisdom III, (WIS=19)\n33: Champion of Torm(6): Great Strength II, Epic Weapon Focus, (STR=20)\n35: Champion of Torm(8): Epic Prowess\n37: Rogue(2): {Evasion}\n39: Cleric(29): Great Strength IV, Armor Skin, (STR=23)\n\nSkillpoints: 202\nSaving Throw bonuses: Spells: +2, Poison: +2\nAB (max, naked): 36 (melee), 25 (ranged)\nSpell Casting: Cleric(9)\n</details>\nThat said, deep cleric builds with 19 wisdom (generally considered a battle cleric) are a challenge at several levels:<br/>\n1. You need to delay your high level cleric spells on a Cleric focused build to spend the bonus feats on Wisdom.  This is a QOL issue and, to be fair,  not generally something I would consider important assuming you reach a solid end point advantage.<br/>\n2. You sacrifice too many melee class feats (Fighter/CoT) which damages/limits your battle cleric capabilities.  This is a build flaw and this is more difficult to justify than a levelling QOL issue.<br/>\n<br/>\nEssentially, the build lacks a Battle Cleric AB and extra feat benefits (knockdown, improved critical,  Devcrit) and lacks a caster cleric DC and I am not sure what it gains in return.<br/>\n<br/>\nFurther, a Dex build in this case subtracts more than it adds IMO as you do not reach the level needed to make wearing DEX armor useful and you have another physical stat you need to cap whilst leaving you woefully underrepresented in Strength.  With a Strength build, you net the same AB and more importantly Damage.  You can also wear heavy armor, a tower shield and wield a weapon without consuming your entire capped strength weight allocation.<br/>\n<br/>\nAnyway, my two cents.  I personally would build this as 24 Cleric or possibly a 26 Cleric for a Battle Cleric build or I would go Zenarchery/Casting (Monk) and stand toe to toe with EDR. Defensive Casting whilst I tanked. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:51 PM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh yes you did ask me why I went dex halfling.<br/>\nI remember now.<br/>\nIt was because the base AB for human was 35 with Str, I wanted it closer to 38 if possible.<br/>\n<br/>\nI tried dwarf but that would have meant fighter/assassin to avoid multiclass penalties (your draft which is a fine PW draft, has 20% exp penalties from level 4 to the end which is fine in a PW, exp penalties are not attractive for single player module users. if I'm playing a SP module and see an exp penalty build I immediately discard it).<br/>\n<br/>\nSo I went halfling because it allowed me to go cleric/rogue/CoT no multiclass penalties.<br/>\nDex was logical for more AB, I got +2 AB pretty much for taking halfling race (+1 from +2 dex, +1 from small stature).<br/>\nHitting 37 AB which was acceptable to me.<br/>\nAlso Brandobaris for Travel / Trickery.  Cleric buffs apply to ranged weapons on WoG.<br/>\nSide effect of a much higher reflex save combined with evasion (the original draft's reflex score is 8 higher than yours).<br/>\nThe saves looked like a paladin's saves which is nuts.<br/>\nOverkill? a Reflex save 40 vs spells would mean for a spell to do 50/50 damage to me, it would need a DC of 50? Does that even exist?<br/>\n<br/>\nAnyway once the CLs are higher, Str will be capped for extended periods and carry problems will not be an issue, particularly if I have light armor equipped and a large shield with weight reduction.<br/>\nIt serves to some extent as a better party tank with the higher reflex score<br/>\nNot as good as a soloist, as you mention damage would be better going Str.<br/>\n<br/>\nI wish I could have fit improved knockdown but no space really. <br/>\n<br/>\nEpic dodge would have been interesting. Can one go Epic Dodge / EDR III / Cleric undispellable with lvl 9 spellbook? [<strong>Edit:</strong> had a muck about. not a good idea.]<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "1:14 PM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, Epic Dodge is Rogue 13  and unidispellable w/ 9th level spells is 24 Cleric and you would have your 9th level spells at 17-20th level instead of 30th level.  So, that leaves 13 more levels to play with.  With Epic Dodge, you are in better shape tank wise.  Otherwise, I suspect you are better of with a high base AC on your armor/shield over a middling DEX bonus, or a massive Wisdom and a monk level.<br/>\n<br/>\nI would then be tempted to explore Monk (9), SD(5), Cl (26) for a Battlecleric/Tank.  Mostly because, of all the classes, Cleric is the one that can handle no UMD.  If UMD is essential and you are really focused on a Dex build BattleCleric then 26 Cleric / 13 Rogue / 1 Ranger or 1 Monk would do the trick I suspect.<br/>\n<br/>\nBut, I think you will find a deeper cleric build using Wis for AC (and AB) will get you closer to where you want to be.  You would be amazed at what a 38 Cleric w/ Spell Resistance up and EDR III can handle whilst tossing solid DC save or die spells out in melee range.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}