{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "137",
  "name": "The Iron Warlock: Sorcerer 32 / Paladin 1 / Dwarven Defender 7",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-iron-warlock-sorcerer-32-paladin-1-dwarven-def-t2355373.html",
  "author": "grizzled_dwarflord",
  "avatar": "10758933_1548854436.jpg",
  "replies": "11",
  "views": "4.0K",
  "posts": [
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "10:35 AM - Feb 24, 2020",
      "content": "<div><strong>Sometimes you just want a little strange.  I thought to myself, “Self, we need a challenge.  Let’s take a dwarf and add two classes that are least favorable, and then let’s give him a 20% xp penalty, and then let’s make sure we start him with an 8 Strength. Further, let’s get a 22 Con but take no more than 7 Dwarven Defender levels.  Yeah…. Let’s put that in our pipe, self, and smoke it.”</strong><br/>\n<strong> </strong><br/>\nThe result is a virtual Ion Cannon.  High saves, high hit points, 12/- damage reduction, and a near unending supply of tactical nuke rounds.  With the exception of autofail, he’s practically immune to Implosions and Wails and Dev Crit, he cannot be flanked or sneaked from the flanks, he can penetrate max toolset SR, maintains a high Concentration to ensure maximum sorcerous delivery, grabs Craft Wand for ultimate utility and, if all else fails, can turn on Epic Warding and let the moths draw hither.<br/>\n<strong> </strong><br/>\n<strong>Title: The Iron Warlock</strong><br/>\nAKA: <em>The Ion Cannon, Dwarflord Messiah, </em><br/>\nClasses: Sorcerer32 /DwD7 / Paladin1<br/>\nRace: Dwarf<br/>\nAlignment: Lawful Good<br/>\nXP Penalty: 20% beyond 13<sup>th</sup> level<br/>\nPlayable: 1-40 PvM<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Attributes</span></strong><br/>\nStr8<br/>\nInt14<br/>\nWis8<br/>\nDex14<br/>\nCon18 (22)<br/>\nChr13 (24)<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Level Guide</span></strong><br/>\n1 Sorcerer1, Expertise<br/>\n2 Sorcerer2<br/>\n3 Sorcerer3, Dodge<br/>\n4 Sorcerer4, Chr14<br/>\n5 Sorcerer5<br/>\n6 Sorcerer6, Toughness<br/>\n7 Sorcerer7<br/>\n8 Sorcerer8, Chr15<br/>\n9 Sorcerer9, Craft Wand<br/>\n10 Sorcerer10<br/>\n11 Sorcerer11<br/>\n12 Sorcerer12, Empower Spell, Chr16<br/>\n13 Paladin1<br/>\n14 Dwarven Defender 1<br/>\n15 Sorcerer13, Silent Spell<br/>\n16 Dwarven Defender 2, Chr17<br/>\n17 Dwarven Defender 3<br/>\n18 Sorcerer14, Maximize Spell<br/>\n19 Sorcerer15<br/>\n20 Dwarven Defender 4, Chr18<br/>\n21 Dwarven Defender 5, Great Chr I, <em>Defensive Awareness II</em><br/>\n22 Sorcerer16<br/>\n23 Sorcerer17<br/>\n24 Sorcerer18, Great Con I, Con20<br/>\n25 Sorcerer19<br/>\n26 Sorcerer20<br/>\n27 Dwarven Defender 6, ESF: Concentration, <em>DwD Reduction</em><br/>\n28 Sorcerer21, Con21<br/>\n29 Sorcerer22<br/>\n30 Sorcerer23, Epic Damage Reduction I, Epic Mage Armor<br/>\n31 Sorcerer24<br/>\n32 Sorcerer25, Chr20<br/>\n33 Sorcerer26, Epic Warding, Epic Damage Reduction II<br/>\n34 Sorcerer27<br/>\n35 Sorcerer28<br/>\n36 Sorcerer29, Epic Damage Reduction III, Great Chr II, Chr22<br/>\n37 Sorcerer30<br/>\n38 Sorcerer31<br/>\n39 Dwarven Defender 7, Great Chr III<br/>\n40 Sorcerer32, Great Chr IV, Con 22<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Combat Vitals</span></strong><br/>\nAB: 21/16/13<br/>\nNaked AC: 16<br/>\nHP: 502<br/>\nDR: 12/-<br/>\nBuffed AC with no items: 47 (EMA, Haste, Expertise)<br/>\n<strong><span style=\"text-decoration:underline\"> </span></strong><br/>\n<strong><span style=\"text-decoration:underline\">Saves     vs Spells        with +12 Charisma</span></strong><br/>\nFort: 34      (45)               40 (51)<br/>\nReflex: 25  (36)               31  (42)<br/>\nWill: 29      (40)               35  (46)<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Skills</span></strong>\n<ul>\n<li>Concentration: 43 (59)</li>\n<li>Spellcraft: 43 (45)</li>\n<li>Tumble: 20</li>\n<li>Spot: 41 (40)</li>\n<li>Craft Weapon: 5 (7)</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Spells Known    </span></strong>                                                                                                                   <strong><span style=\"text-decoration:underline\">Castings</span></strong><em><span style=\"text-decoration:underline\">(w/+12 Chr)</span></em><br/>\n0: All<br/>\n1: (5), Magic Missile, Mage Armor, Shield, Prot. From Evil, Endure Elements                         (10)<br/>\n2: (5), Death Armor, Cat’s Grace, Endurance, Bulls Strength, Eagles Splendour                  (9)<br/>\n3: (4), Haste, Prot. From Elements, Greater Magic Weapon, Dispel Magic                            (9)<br/>\n4: (4), Improved Invis, Stoneskin, Elemental Shield, Issac’s Lesser                                           (9)<br/>\n5: (4), Mestils Acid Sheath, Lesser Spell Mantle, Lesser Mind Blank, Energy Buffer            (9)<br/>\n6: (3), Isaacs, Greater Stoneskin, True Seeing                                                                                 (8)<br/>\n7: (3), Shadowshield, Spell Mantle, Bigby’s Grasping Hand                                                         (8)<br/>\n8: (3), Greater Sanc, Premonition, Bigby’s Clenched Fist                                                            (8)<br/>\n9: (3), Time Stop, Mord’s Disjunction, Shapechange                                                                     (8)<br/>\nEpic: Epic Mage Armor, Epic Warding<br/>\n <br/>\n<strong>Note</strong>: <em>The above spell set is just a template.  As a sorcerer, you can discard spells that you no longer need on Level Ups and choose a new one.  I do this with utility spells and craft wands from those spells, and then discard those spells later in favor of a direct combat/defense spell.  Invisibility, Knock, Find Traps, Flame Weapon, Lesser Breach, Identify, etc, are all worthwhile candidates for spells you may choose at one point in your career, craft wands of these, and then cast off later.</em>                                                                         <br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Builder’s Commentary</span></strong><br/>\nThere are no builds in the Old Guild or the New using these classes, so this may be a first.  If one exists somewhere, Moderators, please provide credit to the author.  This build is a strange duck, to say the least.  At first glance one thinks, “What on earth?”  But when you get into the weeds he performs remarkably well and even has some RP potential.  This is not a DC caster.  He relies on direct damage spells and damage shields.  One might ask, “Why? Why even the DwD levels?  I just really wanted <em>Defensive Awareness II</em>, and once you get that at DwD5, one might as well go to DwD6 for 3/- DR.  The last DwD level is just to max out Spot.  Regarding skill point allocation: On Sorcerer Levels max Concentration and Spellcraft.  On Defender Levels max Concentration and Spot.  Drop your Tumble ranks (cross-classed) in between.  It should be noted that this is not a hit-me-mage, though that is a style he can adopt if needed.  I did want him to have some AC to mitigate criticals.  There is no discipline in the build, but you would only need to be concerned about Knockdown, so make sure to find that immunity if available.  Unlike other munchkin builds, paladin is taken early on to get those save bonuses up front.  This build was tested in the Halls of Advanced Training, and I’ll be giving him a whirl from the ground up out at me ole’ stompin’ grounds.  Thoughts and comments are welcome.            </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:02 PM - Feb 24, 2020",
      "content": "<div>Jebus, just call it the Warlock (or Witch) Warcannon!<br/>\n<br/>\nFire up the damage shields!  Bring the cannons to port!<br/>\n<br/>\nFire away!<br/>\n<br/>\nA Sorc with EDRIII and cannot be sneaked!  Just wow!  12 DR on top of whatever else it can add...hooboy.<br/>\n<br/>\n<em>\"The spells fly out like bullets</em><br/>\n<em>Upon their deadly course</em><br/>\n<em>Screams of pain and agony</em><br/>\n<em>Rent the silent air</em><br/>\n<em>Amidst the dying bodies</em><br/>\n<em>Blood runs everywhere</em><br/>\n<em>The figure stands expressionless</em><br/>\n<em>Impassive and alone</em><br/>\n<em>Unmoved by this victory</em><br/>\n<em>And the seeds of death he's sown</em><br/>\n<em>Sworn to avenge</em><br/>\n<em>Condemn to Hell</em><br/>\n<em>Tempt not the spell</em><br/>\n<em>All fear the Warlock well\"</em></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:11 PM - Feb 24, 2020",
      "content": "<div>Thanks for posting this build up GDL<br/>\nThere is a lot I like about it.<br/>\nIts a great party tank with so much HP, DR, outstanding saves and excellent caster levels on all the buffs.<br/>\nIt uses the DD class well to invest into the spot skill to protect against sneak attacks from stealth, and is immune to sneak attacks from flanking.<br/>\nIt even somehow squeezes in 3 APR / round, although I am curious how you will make use of this<br/>\nYou could increase BAB by 1 with a Sorc 14 DD5 Paladin 1 pre-epic split if AB is going to be useful in this build.<br/>\nMaybe you could take ESF: Concentration earlier in your build by swapping it with a Great Charisma<br/>\nWith the great saves if you can find an item which grants evasion this would be highly valuable.<br/>\n<br/>\nSince your return to activity I also think this might be the first dwarf build you have made too<br/>\nSo I am glad the messiah has finally returned</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "5:46 PM - Feb 24, 2020",
      "content": "<div>I would have never thought of using DD for that.. I'd have tried PM for the sneak immunity.. but that would lower the caster level by 3.  The AC would be a bit higher from boneskin and also the paralysis immunity..   This one would be a stronger caster.<br/>\n<br/>\nDid Beamdog ever fix the PM levels not adding to daily castings for a Sorc or Bard?</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:40 PM - Feb 24, 2020",
      "content": "<div>Next thing dwarves start drinking tea</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:45 PM - Feb 24, 2020",
      "content": "<div>Aye, but proper builder's tea that you can melt a spoon in - none of your bone china sipping camomile malarkey. A good mug of tea with a cigar is a damned fine way to start your day of random slaughter (maybe with some toast and marmalade - the bitter, Seville stuff, of course).</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "2:23 PM - Feb 25, 2020",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote: <div class=\"responsive-hide\">Feb 24, 2020</div></cite>Next thing dwarves start drinking tea</div></blockquote>\nLong as we dont see them in Tutu's with ribbons in their beards....</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "7:05 PM - Feb 25, 2020",
      "content": "<div><em class=\"mention\">@webshaman1</em> , Just to be clear to the lay reader/player, this is not a power build by any stretch of the imagination (I know you know this but others may not since you have a penchant for hyperbole).  On the contrary, any pure sorc or near pure sorcer (see Exalted variations) will outgun this Dwarven Warlock, both in PvM and PvP.  I think most variations of Mestil-type builds -- Half-Dead Juggernaut, Pale Emissary, etc -- are also superior to this one (but don't confuse superior with being able to beat him in PvP, for that is a different matter and one that I would be inclined to place money on this Warlock).  So this is not a power build and there are plenty of sorcerer builds, or hit-me-mages, that are superior in PvM.  This one is just a different, unique in some respects (there are very good reasons why one was never made or posted before), and illustrates that even after 20 years we can still come up with new concepts and variations.  <br/>\n<br/>\nBut it should also be noted that he is not immune to sneak attacks.  Indeed, he can be sneaked just like anyone else -- from stealthed, HiPSed, knockdowned, immobilized, incapacitated, etc.  He's only protected from flanking sneaks.  His AC is not as high as I would like it either, so he is still susceptible to Critical hits.  There really wasn't room for Auto Still.  I had to discard Improved Expertise as well.  For those environments where Craft Wand is nerfed then that's your throw-away feat to grab Improved Expertise.<br/>\n<br/>\nTo illustrate the sheer power of a sorcerer when Metamagic is used properly, here is an example of a spell set:<br/>\n6th: 8 Issacs Greater<br/>\n7th: 8 Silenced Isaacs Greater<br/>\n8th: 8 Empowered Isaacs Greater<br/>\n9th: 8 Maximized Isaacs Greater.<br/>\n...Just to illustrate pure fire power.  This is why pure and near pure sorcerers are so deadly (and why Monks exist).<br/>\n<br/>\n<em class=\"mention\">@Orion2019</em> , regarding the BAB and three attacks, that is just happenstance.  I have no plans, nor should anyone really, on trying to capitalize on it.  The AB is dreadfully low to be of any really value.  The idea here is for the Warlock Messiah to use a Mage Staff for good properties, or any martial weapon really.  But good catch on the ESF: Concentration.  I did have it moved in one of my drafts but it must have regressed back when I was trying to fit in Auto Stills.  It should be at Level 27 now.<br/>\n<br/>\nI will have to correct you on one thing, though.  This is not my first dwarven build since my return.  Let me direct you to the following:  <br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-dragonwrought-dwarflord-fighter26-bard4-rdd10-t2355262.html\" rel=\"noreferrer\" target=\"_blank\">Dragonwrought Dwarflord</a><br/>\nand <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/runes-desolation-wizard-26-fighter-6-divine-champi-t2355263.html\" rel=\"noreferrer\" target=\"_blank\">Runes &amp; Desolation</a><br/>\n<br/>\n<em class=\"mention\">@conlaoch</em> , you are right about the PM vs Defensive Awareness.  However, PM immunities trump this, IMO, in PvM.  And no, Beamdog hasn't fixed PM spell progression.  It's still on their list so I'm the under impression they want to try and make it a thing.</div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "9:00 AM - Feb 26, 2020",
      "content": "<div>GDL,<br/>\nThis is a nice build. I might swap Stoneskin for Ice Storm since the build already has Epic Warding, Premonition, and Greater Stoneskin to provide DR. This would give it another no save damage dealer at a different spell level.<br/>\n<br/>\nAs for the updates to PM, I've looked at how it's currently implemented. Beamdog would have to change the engine or re-write all the spell scripts. The current exposed function that most default spell scripts use to determine caster level \"GetCasterLevel()\" simply returns the number of levels in the casting class and has many bugs. This is the reason PM levels aren't counted, and the reason you can't dispel the Bull's Strength from a character with 24 levels of Blackguard.<br/>\n<br/>\nRe-coding the engine side of the function may be easy or not depending on the data arrangement engine-side.<br/>\n<br/>\nOne of the big overall packages re-wrote all the scripts to make it more like PnP, but that completely re-balances the game (and makes summon spells useless at level 1 due to AI response).<br/>\nEdit: As <em class=\"mention\">@webshaman1</em> pointed out, this references the PRC.<br/>\n<br/>\nFixing PM would open up so many character builds, though.</div>"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "4:32 PM - Feb 26, 2020",
      "content": "<div><em class=\"mention\">@Ten Pura</em> is that code publicly available?<br/>\n<br/>\nSent from my SM-G955U using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:41 PM - Feb 26, 2020",
      "content": "<div>Well, the PRC Team have already coded it (along with RDD, et al) to do what it should, so in that sense the coding is openly available to all.<br/>\n<br/>\nI seem to recall that it was also done soley for PM and RDD for the old NWN - probably kicking around somewhere.  I don't know how much work would be required to get it to work with the new changes BeamDog have done.<br/>\n<br/>\nNote that the PRC Team is back and working again on the PRC.</div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "7:25 PM - Feb 26, 2020",
      "content": "<div><em class=\"mention\">@wildleaf</em> The Aurora engine code? Officially, no. I haven't looked for an unofficial version.<br/>\n<br/>\nIf you're talking about the spell scripts, yes. All of the spell scripts (with original author comments!!) are included in the game editor.<br/>\n<br/>\nAnyways, back to Dwarven Defencerer.<br/>\n<br/>\nEdit:<br/>\n<em class=\"mention\">@webshaman1</em>  The PRC solution was to re-write every spell script. I didn't like their other changes to the spell scripts, so I uninstalled the PRC.</div>"
    }
  ]
}