{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "091",
  "name": "Why No Cleric/Ranger Builds?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/why-no-cleric-ranger-builds-t2355667.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "8",
  "views": "1.2K",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:16 PM - Feb 09, 2021",
      "content": "<div>This might be a very dumb question, but I wondered whether there was a particular reason why there don't appear to be any Cleric/Ranger builds in either our database or the archive?<br/>\n<br/>\nAt least superficially there seems to be a synergy between the two classes - as far as Wisdom goes, anyway. And Cleric/Rangers were always reckoned to be an almost OP class in Baldur's and Icewind. Am I missing something obvious?<br/>\n<br/>\n(I realize this might be something of a spoiler for what I'm looking to do in my next build, but if it's a dead-end I'd rather know in advance.)<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:13 PM - Feb 09, 2021",
      "content": "<div>There is Mick's build Night Ranger (Ranger2/Cleric8/Assassin30) here - <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build257638.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 57638.html</a><br/>\n<br/>\nImo, Cleric/Ranger looks yummy on the surface, but the ingredients are not so delicious.  It would seem that Wisdom and Cha are both nicely used by both Classes, and it is true.  But synergy-wise, it really isn't.<br/>\n<br/>\nBoth Classes really benefit the most when many levels are taken in them.  Ranger for the FEs and BoE, and Cleric of course for Spells, etc.  That makes them actually anathema to each other, when one peeks under the hood.<br/>\n<br/>\nTbh, there are just better \"synergy\" Classes that work with Ranger or Cleric better.<br/>\n<br/>\nI suppose one could go for a mainly Cleric with some Ranger for Dual Wielding (but the light armor requirement certainly is not good here for a Cleric) - as one starts to really look at both of the Classes, it becomes more obvious that they are not really synergetic.<br/>\n<br/>\nWhat does the Ranger Class bring to Cleric, other than the above Dual Wield and martial weapons?  Some extra skills, perhaps (like set trap and animal empathy)?  And Cleric spells far outstrip Ranger spells.  And if we turn the equation over (mainly Ranger, some Cleric), what does Cleric bring to the Ranger Class?<br/>\n<br/>\nI think those (and probably others as well) are the reasons there are not many builds with Cleric and Ranger.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:47 PM - Feb 09, 2021",
      "content": "<div>Thanks Web!<br/>\n<br/>\nDon't know why my search didn't unearth Mick's build (I searched for 1-40 Ranger, 1-40 Cleric, 1-40 any other class, and received a big fat \"0 matches found\"), but ta for digging it out.<br/>\n<br/>\nGood to know - I shall train my less than gimlet gaze somewhere else.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "6:57 PM - Feb 09, 2021",
      "content": "<div>Cler38/Monk1/Rang1 is a fairly common PvP build, although I'm not sure if one has been posted on the ECB.<br/>\nA Rang/Cler/Monk with BoE (eg Rang23/Cler16/Monk1 or Rang26/Cler13/Monk1) can also have decent AB and damage, but due to the low level buffs they're much rarer than more reliable melee builds.<br/>\n<br/>\nOutside of those two build ideas I can't think of any cases where a Cler/Rang is actually worth making.<br/>\nFor Cleric builds (and most builds in general really) it's almost always better to go Figh4 instead of Rang9 for dual-wielding feats, especially since caster levels are fairly important.<br/>\nOn the other hand, for Ranger builds you need a minimum of Rang21 for BoE and a minimum of 12-15 Cler levels before the buffs are even worth considering which seriously limits the number of viable builds.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:20 PM - Feb 09, 2021",
      "content": "<div>Thanks Yunim - it looks like it's a combo I'll have to return to when I'm feeling particularly perverse(so probably not long, then)!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:19 AM - Feb 10, 2021",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Feb 09, 2021</div></cite>There is Mick's build Night Ranger (Ranger2/Cleric8/Assassin30)</div></blockquote>\nWell, basically it is an assassin build.  So probably not what Stag is looking for. Ranger and cleric are only there to fill the 10 levels you cannot take with prestige classes and are chosen just for a free off hand attack and some minor buffs.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:41 AM - Feb 10, 2021",
      "content": "<div>Yes, true, but it does illustrate why Ranger/Cleric does not work well together despite what appears to be obvious synergy on the surface.<br/>\n<br/>\n<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:38 AM - Feb 10, 2021",
      "content": "<div>Sadly, the best use of Ranger on a caster cleric build is a bonus feat that can be used for Greater and Epic Spell Foci and a class that dips Discipline if you are on a module with no immune knockdown items.  It is useful for a 1 level exchange.<br/>\n<br/>\nOtherwise, you are better off with Fighter, CoT, Paladin , Blackguard, Rogue, ShadowDancer, Assassin or Monk for a melee cleric and in many cases even on a caster cleric.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:52 PM - Feb 10, 2021",
      "content": "<div><blockquote><div><cite>Zanithar wrote: <div class=\"responsive-hide\">Feb 10, 2021</div></cite>Otherwise, you are better off with Fighter, CoT, Paladin , Blackguard, Rogue, ShadowDancer, Assassin or Monk for a melee cleric and in many cases even on a caster cleric.\n</div></blockquote>\nDon't forget bard!</div>",
      "author-color": "#AA0000"
    }
  ],
  "author-color": "#AA0000"
}