{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "654",
  "name": "Good Ranger Build - LVL 20 | Aragorn or Legolas Style?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/good-ranger-build-lvl-20-aragorn-or-legolas-style-t2355403.html",
  "author": "Deniedz",
  "avatar": "10759246_1584458497.jpg",
  "replies": "18",
  "views": "1.7K",
  "posts": [
    {
      "author": "Deniedz",
      "avatar": "10759246_1584458497.jpg",
      "timestamp": "4:12 PM - Mar 17, 2020",
      "content": "<div>Hi guys.<br/>\nFirst of all I would like to congratulate you for this wonderful forum, it is so nice to see so many people still discussing and love one of the most beautiful role-playing games ever created. Thank you.<br/>\n<br/>\nAs per request, since I'm not good at building characters, if possible I would like to have a build for a server that is just being born.<br/>\n<br/>\nThe server is low magic, I don't know exactly, but I believe with maximum bonus +3 weapons. As you may have guessed, the level cap is 20, and there is only one rule, the prestige classes, if you wanted to take it, must have at least 10 levels. To be clear, the administrators want to avoid taking for example 1 level of shadowdancer just to have the advantage of hips.<br/>\n<br/>\nThat said, the class I love most, especially for roleplay is the <strong>Ranger</strong>, but let's say that the forest classes have more fun. I really like the style of Legolas, with bow and double swords if necessary, but I am open to any suggestions. Even to a druid fighter maybe.<br/>\n<br/>\nAs a good elf I hate dwarves, and I prefer the race to be <strong>human</strong> or <strong>elven</strong>.<br/>\nI'm a purist, I don't even like classes based on dexterity with sword and shield or in general shields.<br/>\nDo you think you can make a good build?<br/>\nAh, even a coffee thanks. : D: D Joke, sorry for too many requests.<br/>\n<br/>\n<strong>Thank you all for your attention! &lt;3</strong></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:25 PM - Mar 17, 2020",
      "content": "<div>So, to sum things up, an Archer that can dual wield, level 20 limit, right?<br/>\n<br/>\nSound like a Fighter/Bard/AA.<br/>\n<br/>\nDon't we have such a build in the Pre-Epic builds?</div>"
    },
    {
      "author": "Deniedz",
      "avatar": "10759246_1584458497.jpg",
      "timestamp": "4:30 PM - Mar 17, 2020",
      "content": "<div>Hi webshaman1 and thank u. I guess I haven't found any, but maybe I haven't looked very well. I mostly searched builds with the <strong>ranger</strong>.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:31 PM - Mar 17, 2020",
      "content": "<div><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/dual-purpose-warrior-fighter-8-bard-3-aa-9-t2349714.html\" rel=\"noreferrer\" target=\"_blank\">dual-purpose-warrior-fighter-8-bard-3-a ... 49714.html</a><br/>\n<br/>\nThat one is really good!<br/>\n<br/>\nJust drop one fighter level and add 1 AA - that should complete the 10 levels thing.</div>"
    },
    {
      "author": "Deniedz",
      "avatar": "10759246_1584458497.jpg",
      "timestamp": "4:33 PM - Mar 17, 2020",
      "content": "<div>Yes, I had seen this, but use a full plate and a war hammer and a tower shield lol ... it's not really in my style: D</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "5:17 PM - Mar 17, 2020",
      "content": "<div>Ranger9/bard1/Aa10.<br/>\nRanger takes care of dual-wield, AA takes care of archery. <br/>\nPretty sure Fighter would be better, like Fighter 6/Bard4/AA10.<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:31 PM - Mar 17, 2020",
      "content": "<div><blockquote><div><cite>Deniedz wrote: <div class=\"responsive-hide\">Mar 17, 2020</div></cite>Yes, I had seen this, but use a full plate and a war hammer and a tower shield lol ... it's not really in my style: D</div></blockquote>\nMick does say in his build that you can choose any other one-handed melee weapon ('though obviously not from the exotic range), so a scimitar or longsword is equally viable. You also don't need to don heavy armour or wear a shield, but that might be more of an issue, as your AC will be severely gimped in melee. Equally, I'm not sure dropping a level of Fighter would be better than dropping one of Bard. With one you lose a bonus feat, with the other your skills dumps will be further apart and you lose a level of song. Hmm...<br/>\n<br/>\nIf you'd prefer a Ranger dex build who both shoots and dual-wields you also run into issues. Yes, your archery will be better and so will your natural AC, but the number of feats at your disposal will be sorely diminished. You'll have 7. That will cover Weapon Finesse (to improve your melee AB), 2 Weapon Focuses (Longbow and Shortsword are your best bet), Blind Fight, Knockdown, and probably Improved Critical in both your chosen weapons. That's 7, and you lose out on Improved Knockdown. You'd also need at least 9 levels of Ranger to get ITWF, and if you want AA, then that leaves 1 level to qualify for the class. If, as I presume, you'd prefer Elf, then you'd need to take Wizard to avoid an xp penalty, which would mean any Tumble AC would have to be cross-classed, so ending in +2AC rather than +4. Also, with no Uncanny Dodge or Evasion you're particularly susceptible to sneaks, which is a huge bummer in Dex builds.<br/>\n<br/>\nYou present a worthy challenge, Deniedz! We'll work on it...<br/>\n<br/>\nOh, and welcome to the Guild!<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: Ninja'd by Grimnir - but more importantly, as a massive Dwarf fan, I'm losing sight of why I'd want to help...<span class=\"text-emoji\">😉</span></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Deniedz",
      "avatar": "10759246_1584458497.jpg",
      "timestamp": "5:39 PM - Mar 17, 2020",
      "content": "<div>First of all thank you guys for the answers. <strong>Stagmeister</strong>, of course what I wrote is my dream, but I am aware of the limits of dreams in Nwn <span class=\"text-emoji\">😂</span> <br/>\nObviously in a game like this, you cannot be strong both in swords and with a bow, and you cannot also have a good defense, I am aware that something must be given up. What I would like is a <strong>Hunter</strong> who is supportive of the bow for others, but who can go in melee with the two swords when he is alone. It is obviously <strong>not a PVP build</strong>, but a very role-playing game, so if I had to choose between the two weapons, I prefer to be stronger in melee, and use the bow only in some situations. Thanks anyway to everyone for the interest.<br/>\n<br/>\n<blockquote><div><cite>Deniedz wrote:</cite>EDIT: Ninja'd by Grimnir - but more importantly, as a massive Dwarf fan, I'm losing sight of why I'd want to help...<span class=\"text-emoji\">😉</span></div></blockquote>\nAhaha... \"What about side by side with a friend?\" </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:54 PM - Mar 17, 2020",
      "content": "<div>Good stuff, Deniedz - that helps clarify things - and probably means AA isn't for you in this instance. More a stealthy type, but not really a sneaker. I assume from your Aragorn reference you'd be okay with human (given that Numenorian isn't exactly an option), but would prefer an elf.<br/>\n<br/>\nRight, to the workshop!<br/>\n<br/>\nEDIT: \"Aye, I could do that.\"</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "6:00 PM - Mar 17, 2020",
      "content": "<div>6 fighter levels nets you Heavy Armour and an extra feat compared to Ranger. AND 3 extra bard levels. Ranger will come out ahead when it comes to skillpoints. <br/>\n<br/>\nAnyhow. 6-4-10 would be my bet. Maybe even 8-2-10 if you need the feat. I'll take a look.<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:08 PM - Mar 17, 2020",
      "content": "<div>Full Ranger might be better here.<br/>\n<br/>\nIF +3 is really the highest, Blade Thirst AND FE bonuses are gonna really rock!<br/>\n<br/>\nRanger also gets Aid, Freedom, and Greater Fang for Animal Companion, not to mention One with the Land, gr. Camo for unparalleled sneaking.<br/>\n<br/>\nCat's Grace to boost Dex. <br/>\n<br/>\nIn a really low magic environment, going all in will be worth it imo.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:25 PM - Mar 17, 2020",
      "content": "<div>I've been seeing what I can do with a Ranger 10/ CoT 10, but sometimes simple is best. I'll keep going, but Web makes good points.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:25 PM - Mar 17, 2020",
      "content": "<div>This is from my Banebow - I took the first 20 levels from it.<br/>\n<br/>\nElf<br/>\n<br/>\nStr : 10<br/>\nDex : 18 - 23<br/>\nCon : 12<br/>\nInt : 14<br/>\nWis : 14<br/>\nCha : 8<br/>\n<br/>\nFE : + 4 Dam<br/>\n<br/>\nFEATS<br/>\n<br/>\n1: Ranger 1 Weapon Focus, Longbow, FE (Whatever)<br/>\n2: Ranger 2<br/>\n3: Ranger 3 Point Blank Shot<br/>\n4: Ranger 4 Dex + 1<br/>\n5: Ranger 5 Favored Enemy - (Whatever)<br/>\n6: Ranger 6 Rapid Shot, Animal Companion (Brown Bear)<br/>\n7: Ranger 7 <br/>\n8: Ranger 8 Dex + 1<br/>\n9: Ranger 9 Improved Critical Longbow, Improved Two-Weapon Fighting<br/>\n10: Ranger 10 FE - (Whatever)<br/>\n11: Ranger 11<br/>\n12: Ranger 12 Dex + 1, Weapon Finesse<br/>\n13: Ranger 13<br/>\n14: Ranger 14<br/>\n15: Ranger 15 Toughness, FE (Whatever)<br/>\n16: Ranger 16 Dex + 1<br/>\n17: Ranger 17 <br/>\n18: Ranger 18 Weapon Focus Shortsword<br/>\n19: Ranger 19<br/>\n20: Ranger 20 Dex + 1, FE (Whatever)<br/>\n21: Ranger 21 Epic Ranger, Bane of Enemies</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:38 PM - Mar 17, 2020",
      "content": "<div>Sorry, couldn't help myself - here's a build showing the versatility of the dwarfs. It's a lovely build I've played in several environments now and doesn't get enough love. Elves schmelves. <span class=\"text-emoji\">😜</span><br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/wulgar-ironbow-fighter-16-dwarven-defender-19-harp-t2354617.html\" rel=\"noreferrer\" target=\"_blank\">Wulgar Ironbow</a></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:38 PM - Mar 17, 2020",
      "content": "<div>If Human, you could add 3 or 4 levels of Rogue for Uncanny Dodge and Tumble skill dumps and/or 4 levels of Fighter for more feats and Weapon Spec.  Doing so would dilute your Ranger, though.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Deniedz",
      "avatar": "10759246_1584458497.jpg",
      "timestamp": "7:52 PM - Mar 17, 2020",
      "content": "<div><blockquote><div><cite>Stagmeister wrote: <div class=\"responsive-hide\">Mar 17, 2020</div></cite> Scusa, non ho potuto fare a meno di me stesso - ecco una build che mostra la versatilità dei nani. È una build adorabile che ho giocato in diversi ambienti ora e non ho abbastanza amore. Elfi schmelf. <span class=\"text-emoji\">😜</span> <br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/wulgar-ironbow-fighter-16-dwarven-defender-19-harp-t2354617.html\" rel=\"noreferrer\" target=\"_blank\">Wulgar Ironbow</a></div></blockquote>\n\nMy browser refuses to open any Dwarven link! <span class=\"text-emoji\">😝</span><br/>\n<br/>\nThanks again guys, and thanks<strong> webshaman1 </strong>so suggest yourself to do a pure class anyway, is it more functional?<br/>\n<br/>\n<strong>Empyre65</strong>, in fact adding some thief level would be part of my idea of the game, but when would you take them? As a rule of the server, unfortunately, I can't make 1 thief then Ranger (the idea of this server is that they want to avoid all the bad things out of roleplay, like just taking 1 class immediately to get some advantages), would you mind giving me a complete variant of the build?</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:21 PM - Mar 17, 2020",
      "content": "<div>Well, Ranger is a class one either exploits for TWF when one does not have the Dex to do it, or for Spell Focus reasons.<br/>\n<br/>\nOR<br/>\n<br/>\nOne invests heavily into it, to get the best out of it.<br/>\n<br/>\nThat's my train of thought on the Ranger Class (which I love, but alas, poor Ranger Class, you get no love!)<br/>\n<br/>\nIn a low magic environment, however, the Ranger does have alot to offer - especially in the spells department (and the Animal Companion).  This change rather slantedly towards going full Ranger (when one has only 20 levels).<br/>\n<br/>\nAs an Elf, you will have a natural affinity for Dex, which is not a bad thing at all for an Archer.  It's just that Rangers make terrible Archers.  But in an environment like the one you have described, it should actually shine (I rather suspect the Barb is going to be awesome as well).<br/>\n<br/>\nIt can go bow, it can do twf, it can go sword and board.  Choosing the right Animal Companion is probably going to be the hardest part - because do you go full in with a Bear or Wolf to distract the m0bs from your Ranger, or do you aggro the mobs to you and let your mighty stealth Panther rip them to shreds with sneaks?<br/>\n<br/>\nIt's a tough decision.<br/>\n<br/>\nI personally would go Panther, give it GMF, Cat's Grace, some Freedom, and lay down some Grease and Entangle, and lure the enemy to you with a bow, and then tell your Panther to rip them up!<br/>\n<br/>\nShould work out pretty well.<br/>\n<br/>\nYou will have an FE bonus of +5 damage to FEs to really lay the hurt down, and it is not weapon specific (meaning it will work with your bow and with the shortsword(s) ) - to that you will have 5 of them, which should get most of the \"good ones\" in there (good ones being those which are prevalent and/or crit and sneak immune, as the case may be).<br/>\n<br/>\nI think at that level, your spells may even be non-dispellable - though since the opponents could be over 20 (and some probably will be), that may not always apply.<br/>\n<br/>\nAll-in-all, in an environment such as yours, trying to remain faithful to what you are looking for, Ranger may just be the ideal choice.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "8:43 AM - Mar 19, 2020",
      "content": "<div>I get nostalgic about this. Mye very first character in the OC was just this. An Elven Ranger, switching bow and dual swords. I still have it on file. I would make it different today, of course, but it should be fun.<br/>\n<br/>\nI need too make this build, for myself if nothing else. Great thread.<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:24 AM - Mar 19, 2020",
      "content": "<div><blockquote><div><cite>Deniedz wrote: <div class=\"responsive-hide\">Mar 17, 2020</div></cite><blockquote><div><cite>Stagmeister wrote: <div class=\"responsive-hide\">Mar 17, 2020</div></cite> Scusa, non ho potuto fare a meno di me stesso - ecco una build che mostra la versatilità dei nani. È una build adorabile che ho giocato in diversi ambienti ora e non ho abbastanza amore. Elfi schmelf. <span class=\"text-emoji\">😜</span> </div></blockquote>\n</div></blockquote>\nI must say...</div>",
      "author-color": "#AA0000"
    }
  ]
}