{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "021",
  "name": "HiPS mechanics questions",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/hips-mechanics-questions-t2356236.html",
  "author": "TheSquid",
  "avatar": "10759318_1592552655.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "5:36 PM - May 30, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello, I have some doubts about Hide in Plain Sight (HiPS).<br/>\nI understand that if A is casting a targeted spell at B and B enters stealth mode with HiPS, then A stops casting the spell. A PC can \"dodge\" magical attacks in this way. I think this works exactly the same as when one breaks line of sight by e.g. hiding behind a corner.<br/>\n<br/>\n1. What if A has very high detection scores and can see B at the first check? I imagine this does not matter, as the check will not happen instantaneously. I welcome confirmation of this.<br/>\n2. What if, in addition, A has Keen Senses?<br/>\n2b. Is there a difference between Listen and Spot here? I think in some cases one cannot directly target a character who is only heard, right?<br/>\n3. What if A has (vanilla) True Seeing? I suspect the trick does not work at all in this case, but again I welcome the experts' take. <br/>\n<br/>\nMany thanks!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:47 PM - May 30, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here is a link to the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Talk:Hide_in_plain_sight\" rel=\"noreferrer\" target=\"_blank\">talk page</a> of the HIPS topic in the NWNWiki.<br/>\nThere, some of your questions are discussed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "11:30 PM - May 30, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks. I remembered to check the wiki but not the talk page. Only question 3 remains open I guess (I can't find an answer in the page at least), but TheKrit's answer suggests that True Seeing will allow the caster to keep sight on you and therefore not interrupt the spell.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:34 PM - Jun 03, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nope.<br/>\n<br/>\nVanilla TS will still not stop the Action Queue from being emptied - but it does mean that the target will be immediately acquired again, afterwards. This will seem like in melee that it is not interrupted (the Combat AI is far, far quicker than a Human is) but for spells, it will disrupt the casting - note that this does require that one use advanced HiPS spamming techniques, however.<br/>\n<br/>\nAdvanced HiPS spamming : you put Attack (the Sword Icon on the radial) and HiPS adjacent on the Quickbar, and using the corresponding F keys, you toggle between them (if in combat, otherwise, just toggle the HiPS button when against a vanilla TS opponent who is spellcasting). This will cause the Action Queue of your opponents to empty (though if they have vanilla TS, they will immediately re-acquire you as a target).  By doing this, you can disrupt enemy spellcasters with vanilla TS from casting spells at you.<br/>\n<br/>\nOh, you need to have the cursor on the enemy in question (nearby, preferrably) so that you can go back to \"attacking\" so that you can complete the cycle.  Attack [break Attack], HiPS, Attack [hit Attack again], HiPS, rinse, repeat.  Just tap the Attack with one finger of the left hand, for example, then HiPS with the other, and continue again with the other finger in cadence - dum dum dum.<br/>\n<br/>\nI myself as a caster have had this happen many, many times (in an environment where vanilla TS is available and no cooldown for HiPS exists for enemies).  It was impossible to target with a spell without it getting disrupted.  What one can do is target the area NEAR the enemy in question.<br/>\n<br/>\nIt's one of the main reasons why there is often a cooldown timer put on HiPS in online environments - even vanilla TS will not prevent the Action Queue emptying.<br/>\n<br/>\nOn WoG, for example, we have a cooldown timer for HiPS (for both Players and Opponents).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "4:43 PM - Jun 03, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, that is very interesting. Now i kinda want to try it vs one of WoG's Big Bad True Seeing endgame enemies.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:50 PM - Jun 03, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It works kind of ok, but you have to keep in mind that on WoG, you have the cooldown timer (important to keep in mind here).<br/>\n<br/>\nThough you can still clear the queue by using it, it will \"fail\" (HiPS) until the timer expires, meaning you will get pummeled if you mess up the rhythm (because you are usually surrounded by enemies).  It is not wise to drop out of combat in the middle of a bunch of high level baddies doing their best to reduce you to a pulp with prejudice...<br/>\n<br/>\nHad this experience against Trok&amp;Co (Stone giant boss) with one of my HiPSer PCs once.<br/>\n<br/>\nOtherwise, it works quite well...just don't mess up (and saying that to a human is like...yeah.  You know you are going to).<br/>\n<br/>\nHowever, I have found that if you combine this with high AC, Epic Dodge, and 50% Concealment, you normally do quite well...hey, I wonder if my Deadly Nightshade build does this...(yes, that is tongue in cheek and a shameless plug, all in one!) - of course, she never gets targeted by spells unless the enemies are absolutely desperate (which, come to think of it, they usually are! :D )<br/>\n<br/>\nOops, I did it again! O_o<br/>\n<br/>\nI wish that we had the ability to post videos - you would think in this day and age that it should be possible, considering that TikTok&amp;Co do it all the time!  A video showing this would be worth a thousand words typed in this format imo.<br/>\n<br/>\nYeah, we are old and using ancient technology!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}