{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "208",
  "name": "Is investing in persuade worth it in the SoU/HotU/Sands of fate saga?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/is-investing-in-persuade-worth-it-in-the-sou-hotu--t2354693.html",
  "author": "samurainostalgique",
  "avatar": "10235276_1510287070.gif",
  "replies": 2,
  "posts": [
    {
      "author": "samurainostalgique",
      "avatar": "no_avatar.png",
      "timestamp": "11:02 AM - Apr 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">And if it is, assuming the PC has it as a class skill and has low charisma, how many ranks should one buy to get the most benefits?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:19 PM - Apr 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've yet to invest a single point in Persuade in all the environments I've played because that skill requires no training.  For the most part, only warrior BAB types do not have it a class skill so there will usually be a dump class mixed in there somewhere but I'd still not sacrifice skill ranks while there are combat-related skill needs pending.<br/>\n<br/>\nInstead, I become a collector for those rare situational convos, equipping all the +skill/+CHA gear I have like Mask of Persuasion, Dwarven Mirth, Balduran's plate, Ammy of the Master... whatever is sold or dropped randomly (and a stack of Eagle pots).  CHA seems to be one of the easiest abilities to cap regardless of the module.  Especially in HotU, the rare persuasions (and there are very few) can be easily bolstered by Deekin's song (and the same goes for +skill effects with Appraise checks).  Naturally, you'll want to be sure to remove all gear using -CHA props at the same time.<br/>\n<br/>\nYou'll have a leg up with sorc builds, bard casters and divine feat types that focus on CHA.  Empowered self-buffers have another few points to help reach the ability cap.<br/>\n<br/>\nUnless there are ultra high Persuade checks in the critical path of the main quests (which would be fairly ridiculous designing that way IMO) of Sands of Fate (sry, never had the pleasure), I am betting exactly the same dynamic exists as in all the other content.<br/>\n<br/>\nThen again, a pure rogue has more skills than it knows what to do with so... why not splurge on social talents a bit? <img class=\"post-image\" loading=\"lazy\" src=\"http://static.yuku.com/domainskins/bypass/img/smileys/ohwell.gif\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:21 PM - Apr 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Lore or even Appraise is more useful in that series of campaigns.<br/>\n<br/>\n On the other hand, I have been finding the 3 social skills useful in the Aielund saga.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}