{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "150",
  "name": "Two-hand weapons and shield AC: CBC bug?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/two-hand-weapons-and-shield-ac-cbc-bug-t2355341.html",
  "author": "233",
  "avatar": "10714033_1519247364.jpg",
  "replies": 8,
  "posts": [
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "11:50 PM - Feb 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello all!<br/>\nI have been designing and revising many 2-hander and palemaster builds in the last one month and a half, and half-orc fighters I would like to play.<br/>\nUsually, before using the CBC I draft the builds in paper, so to be forced to calculate parameters (and learn something new).<br/>\n<br/>\nHowever, it seems to me that the AC calculated by the CBC sheet gives everywhere +3 AC from tower shields (provided that the pc has the proficiency), <span style=\"text-decoration:underline\">regardless of</span> the fact that he/she has taken:\n<ul>\n<li>weapon focus in large weapons (or medium for little races); or</li>\n<li>feats related to \"dual wielding\".</li>\n</ul>\nDoes this make sense? Am I thinking something wrong?<br/>\n<br/>\nIf so, it would be less misleading if, when the above feats are taken, CBC's AC would not consider the \"3\" AC from tower shield.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:35 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The CBC AC gives the largest AC value possible in mundane gear regardless of whether your build actually uses armor or a shield. The only thing that matters is if it's possible for your build to uses armor or a shield.<br/>\n<br/>\nThe CBC is an incredibly useful tool but unfortunately it's not perfect.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:51 AM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">We should put a list out of imperfections in the CBC.<br/>\nOne day someone motivated with excel proficiency might be interested to fix them.<br/>\n<br/>\nThe list so far:<br/>\n- AC calculations in two-handed/dual wielding builds (automatic +3 AC from mundane tower)<br/>\n- Incorrect Spellcasting class for pale master (it takes the first qualifying class for the bonus PM spells, rather than the class with the highest caster level)<br/>\n- Small stature characters are calculated to be able to finesse rapiers AB wise when they in fact, cannot finesse them.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "5:00 PM - Feb 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The prerequisites for Resist Energy feats are not accurate in the CBC, although since the prerequisites are fairly complex that's not too surprising.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "7:29 AM - Feb 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am working on fixing these bugs in the CBC.<br/>\nDon't know if I will be able to complete the work, I have so far solved two issues:<br/>\n- AC calculations in two-handed/dual wielding builds (automatic +3 AC from mundane tower)<br/>\n- Small stature characters are calculated to be able to finesse rapiers AB wise when they in fact, cannot finesse them.<br/>\n<br/>\nThe first fix leverages on the chosen \"weapon focus\" feat and race, to obtain the weapon and understand if it is a two-hand weapon or not. For this I need your help to review the table I prepared, maybe something is wrong. I attach to this post the spreadsheet added to the CBC.<br/>\nI need to hone it: do you agree that, if two or three weapon focus feat are taken both in one and two-hand weapons-, the AC displayed in the output sheet should be the lesser one available?<br/>\n<br/>\nFor the other issues, I have some questions:<br/>\n- Incorrect Spellcasting class for pale master (it takes the first qualifying class for the bonus PM spells, rather than the class with the highest caster level) ---&gt; when is the check on caster level performed? only when reaching the first level of pale master? <br/>\nOr is it a dynamic check, that can change class if two \"caster classes\" are chosen? for example, wiz + bard + PM  class split--&gt; lv6 WIZ, then add 1 PM level, after that levels 8 times as bard: Finally some pm levels are added. <br/>\nThe bonus spells granted by PM are only for WIZ, the greatest class when having selected PM for the first time, or  then for Bard, as it has more levels than WIZ (8 versus 7)?<br/>\n<br/>\n - The prerequisites for Resist Energy feats are not accurate in the CBC, although since the prerequisites are fairly complex that's not too surprising. --&gt; examples? this seems more difficult, but I I would like to try at least.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:39 AM - Feb 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I believe during in game testing the check to the incorrect caster class is undertaken dynamically.<br/>\n<br/>\nI will describe what happened to me in game:<br/>\n<br/>\n<blockquote><div>I went Wizard 3 -&gt; PM 1.<br/>\nBonus spell level to Wizard.<br/>\nThen I went Sorc 3 (so Wizard 3 -&gt; PM 1 -&gt; Sorc 3)<br/>\nBonus spell level to Sorc, removed Bonus spell level to Wizard.</div></blockquote>\nHope that makes sense, please reply if it doesn't.<br/>\n<br/>\nAs for resist energy, I believe Yunim can provide more details on this. I haven't encountered any problems with Resist Energy + CBC yet.<br/>\n<br/>\nI believe the prerequisites [before leveling] are base fort save + cons modifier (not including CoT, Divine Grace/Dark Blessing, Great Fortitude/Epic Fortitude/Luck of Heroes bonuses) = 8+.<br/>\n<br/>\nThis is all I have from the NWN:Resist Energy Talk page, which I'm sure you have read knowing you Aquarius<br/>\n<blockquote><div>My Fighter just hit level 12, my base Fortitude save is 14. Resist Energy does not show up as a selectable Feat if I click on my portrait to level up. It will *only* show up if I open my Character Sheet to level up. 24.6.99.30 19:54, 28 September 2006 (PDT)\n<ul>\n<li>It's working for me with either method. (By the way, a level 12 fighter has a base fortitude save of 8. The 14 you see includes modifiers.) You could always submit a bug report to BioWare, but it might help if you could narrow down the cause. --The Krit 18:55, 29 September 2006 (PDT)</li>\n</ul>\n<ul>\n<li>The base fortitude save is not important. Important is the modified fortitude save (without temporary modifications or items) before you level up. Level 12 fighter with CON 10 (has fortitude save 8 after level up) can't take Resist Energy but the same fighter with CON 12 can. Made a few tests myself but never saw a difference between leveling up from character sheet or by clicking the portrait (did not know you actually could level up by clicking the portrait - played NWN for years now and I'm still learning something new).--Kamiryn 00:30, 30 September 2006 (PDT)</li>\n</ul>\n<ul>\n<li>I have the same problem. Only when levelling through the character sheet can I choose Resist Energy. I tried with different classes at different levels to no avail. My version is 1.68, nothing in the override. --201.221.29.184 October 2007</li>\n</ul>\n</div></blockquote><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "5:24 PM - Feb 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Unfortunately the Resist Energy prerequisites are a lot more complex than just base fortitude + CON modifier. Currently the CBC only accounts for base fortitude (from classes only), and even then it's not completely accurate. There are cases where the CBC says that Resist Energy is illegal when it is actually a selectable feat and cases where the CBC says that Resist Energy is legal when it is not a selectable feat. I just did some testing to see what affects it, I might have missed some cases though.<br/>\n<br/>\nIf Base Fortitude + CON Modifier + CHA Modifier + Feats + Race Bonus = 8 before feat selection then Resist Energy is selectable, but unfortunately it's still more complex than that.<br/>\n<br/>\nWe all know that levelup is split into three key parts: ability increase, skill selection, and feat selection. There are more parts to levelup such as spell selection or animal companion / familiar selection but they're not relevant for discussing Resist Energy, and technically skill selection doesn't matter either. These parts happen consecutively and so earlier parts will influence later parts. Levelup does not finish until all of these parts are complete, so fortitude increases do not happen until the end of the levelup process (ie after feat selection).<br/>\n<br/>\nAlso relevant is how RDD levelling currently works in NWN EE 1.79, although I believe that this is a bug so I won't describe how to do it. On most levels the RDD ability increase happens at the end of the levelup process (ie after feat selection). However, if you increase your abilities through RDD on a level where you have access to an ability increase (eg taking your 7th RDD level at level 12) then you are able to force the RDD abilities to increase in the ability increase stage of levelup. This means that you can potentially get +1 skill point from taking RDD9 on an ability increase level. This also means that at level 12, 24, and 36 you can qualify for feats such as Dev Crit earlier than you should be able to. This is relevant here since an RDD can use the increased CON of RDD7 to choose Resist Energy at level 12 even if they should not be qualified for Resist Energy until the end of the levelup process.<br/>\n<br/>\nBase Fortitude<br/>\nThis is just the fortitude from class levels, everyone here should be familiar with how this works. However note that the fortitude increase from class levels happens AFTER the feat selection stage. For example, a Figh6 will have 5 base fort AFTER the feat selection stage, but BEFORE the feat selection stage they will only have 4 base fort. A Figh5/Monk1 that takes Figh5 at level 6 will have 6 base fort before the feat selection stage. A Figh5/Monk1 that takes Monk1 at level 6 will have 4 base fort before the feat selection stage.<br/>\n<br/>\nCON Modifier<br/>\nPositive or negative, it will affect your eligibility for Resist Energy. CON increases (in particular at level 12) happen before the feat selection stage and so it is possible to meet the requirements by increasing CON at the same level that you take Resist Energy. It is possible to make a Bard5/RDD7 or Sorc5/RDD7 that is both able and not able to take Resist Energy at level 12, depending on whether you use the RDD bug to increase CON during the ability increase stage or not.<br/>\n<br/>\nCHA Modifier<br/>\nIf positive, the CHA save bonus from Divine Grace counts towards the prerequisites. This does not work if you take Pal1 on that level, since technically you don't get Divine Grace until after levelup (and therefore after feat selection). This also doesn't work if you increase CHA during the ability increase stage, in that respect increasing CHA differs from increasing CON during the ability increase stage. The CHA save modifier from Dark Blessing, positive or negative, does not affect qualifying for Resist Energy in any way.<br/>\n<br/>\nFeats<br/>\nEpic Fortitude, Great Fortitude, and Strong Soul all count towards qualifying for Resist Energy, although if you have access to Epic Fortitude then you should be taking Epic Energy Resistance instead of Resist Energy. Luck Of Heroes does not count towards the Resist Energy prerequisites.<br/>\n<br/>\nRace<br/>\nThe +1 save bonus halflings get from Lucky counts towards qualifying for Resist Energy.<br/>\n<br/>\nCoT Saves Bonus<br/>\nThe save bonus that CoTs receive from Sacred Defense does not count towards qualifying for Resist Energy.<br/>\n<br/>\nI might have missed some cases but I think that covers everything about the Resist Energy prerequisites. I don't know how much would need to be changed in order to make the CBC completely accurate but I imagine that it would take a lot more effort than it's worth. Everyone should test their build after using the CBC anyway so any problems with Resist Energy should be caught during the testing stage.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "9:29 PM - Feb 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">@ Yunim: thank you for having provided more explanations, I agree with you; fixing (or better, trying to fix) this issue would be very complicated, hence given the advantages and downsizes I'll leave it as it is.<br/>\n<br/>\n@ Orion: ok for the dynamic check.<br/>\nI am analyzing the formulas used by Kamiryn, there is a continuous reference to other sheets, but I think I might be able to understand it.<br/>\nOn the basis of your explanations, it seems to me that the check works as follows:\n<ul>\n<li>ordinary situation: there is a caster level (Wiz/Sorc/Bard) greater than the other/others, so all the bonus spell slots are assigned to it;</li>\n<li> bad situation: when two or more arcane caster classes have the same level and they are higher than the other third one (assuming that one could really build a WIZ/SORC/BARD), the system chooses one of the classes. But which one?</li>\nI think that it simply chooses on the basis of the alphabet: the check first relates to bard, then sorcerers, and finally wizard. This could explain why, in your example, bonus spell slot were assigned to the sorcerer instead of the wizards (who previously was the higher caster class).Best would be to test a bard vs a sorcerer: if, when levelling as bard2/sorc2/PM1, the spell slots are assigned to bard, the check works alphabetically.</ul><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:55 PM - Feb 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think this is a great discussion and it shows the depth of your understanding of how the NWN engine is programmed and works.<br/>\nAs for the CBC it is a very useful tool made by Camiryn, a dedicated NWN custom content maker. If you plan on changing anything in the CBC, you should contact Camiryn and bring forth what you want to change. That has worked well with other proposed changes in the past.<br/>\nOther than that I second Yunim when saying: <em>Everyone should test their build after using the CBC anyway... </em><br/>\nAt least that is what I do.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}