{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "485",
  "name": "Non-Monk Shifter Advice",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/non-monk-shifter-advice-t2176893.html",
  "author": "Demos",
  "avatar": "10235222_1510287070.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "10:28 PM - Nov 27, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I'm looking to run a shifter, and as usual, I want to try something different.  Instead of Monk, I want to use Rogue and grab Epic Dodge.  There are 2 builds in the forum already set up this way:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build117710.html\" rel=\"noreferrer\" target=\"_blank\">The Scamp by Zelle Qyllvan (Druid 6/Shifter 17/Rogue 17)</a><br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build209339.html\" rel=\"noreferrer\" target=\"_blank\">The Grifter (Rogue 19/Druid 5/Shifter 16) by ragnaroque</a><br/>\n<br/>\nThe build I'm leaning closer towards is Zelle's.  I am going to focus on the Risen Lord but want the Epic Humanoid shapes as backup.  Here is my proposed build.<br/>\n<br/>\nDisclaimer: I'm not a Shifter expert by any stretch of the imagination.  Heck, this is the first one I'm playing...ever...lol.<br/>\n<br/>\nDruid(6), Shifter(17), Rogue(17), Human<br/>\n<br/>\nSTR: 10<br/>\nDEX: 16 (26)<br/>\nCON: 14<br/>\nWIS: 14<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Rogue(1): Alertness, Blind Fight<br/>\n02: Druid(1)<br/>\n03: Druid(2): Weapon Finesse<br/>\n04: Druid(3): Dex+1, (DEX=17)<br/>\n05: Druid(4)<br/>\n06: Druid(5): Knockdown<br/>\n07: Rogue(2): {Evasion}<br/>\n08: Shifter(1): Dex+1, (DEX=18)<br/>\n09: Shifter(2): Weapon Focus: Shortsword<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "AnotherSquarehead",
      "avatar": "no_avatar.png",
      "timestamp": "11:39 PM - Nov 28, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah, I like Rogue/Shifters; I had a blast running one through HotU and even sailed through the Grimgnaw gang (with some luck and a UMD'ed Bigby's Forceful Hand    ).<br/>\n<br/>\nOkay, I just have a couple of quick points. Since many (12 of 29) of your shapes will override constitution, I'd probably start with less CON and a 17 DEX to speed the road to Epic Dodge. To help hit points, Toughness is great for shifters (those extra HP's stay, regardless of shape). While Finesse will really help early levels (before solid shifter options), it might be worth dropping Weapon Focus: Shortsword to get Toughness.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "10:09 PM - Nov 29, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Feat selection is the key.  You are right about that much, Demos.  And it is within the shapes themselves where the major feats are managed so learn all your greater wildshapes cold before planning the feat schedule.<br/>\n<br/>\nNow, IMO, a shifter should be played EXCLUSIVELY as shifter rather than trying to add some versatility to a druid build.  Otherwise, the true benefit of the class itself is diluted and/or limited (i.e. dragon build).  Just my opinion from experience... for what it's worth.<br/>\n<br/>\nIt's a shame you must \"waste\" feats on Finesse &amp; KD since your back-up form is the only form that can use finesse and gets it automatically along with HiPS while shifted and minotaur gets KD.  The unfinessable scythe AB will be based off of STR 21 + 5 (or higher with high magic environments) + RL boost though the AC will be similar to a WIS build.<br/>\n<br/>\nI wouldn't compromise the overall build just to be able to hit a few foes with a shortsword at low levels.  Too feat-starved IMO.<br/>\n<br/>\nDon't under-rate wyrmling.  With the 5 forms available, the breath weapon will do unlimited uses of damage of an element that will always be effective.  That's where I would automatically drop finesse for expertise and knockdown for imp expertise and use the epic minotaur if you REALLY REALLY must KD someone.  A low-level wyrmling, especially the fire, lightning &amp; gas ones, will have uber AC with high DEX &amp; Imp Expertise even at very low levels. \n<blockquote><div>\nAnd speaking of clerics, how is Turning resolved if a cleric tries to turn my Undead Shape.  Is there any immunity available against Turning?  Protection from Good/Evil?  Mind Blank?  Again, shifter n00b here.</div></blockquote>\nNo resistance or immunity unless you find custom items that grant them.  Sry.  <br/>\n\"The Risen Lord briefly glimpses a duegar cleric in the distance... SHIFT! Dammit, shift you fool!\"    RL = insta-turn bait. Trust me.<br/>\n<br/>\nI do enjoy experimenting with oddball shifter builds myself, sacrificing the strength of the class to gain some unique potential (like Doctor Fuzzy, my shifter cleric experiment).<br/>\n<br/>\nBTW, unless epic traps have been customized on your planned server, in this build you will need only 36 unmodified ranks of Disable Trap to disarm them.  If you plan to recover epic traps, you will need a modified level of 48 which typically means skill foci feats and/or elevated INT.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "3:26 AM - Nov 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the replies guys.<br/>\n<blockquote><div><strong>AnotherSquarehead wrote:</strong>Okay, I just have a couple of quick points. Since many (12 of 29) of your shapes will override constitution, I'd probably start with less CON and a 17 DEX to speed the road to Epic Dodge. To help hit points, Toughness is great for shifters (those extra HP's stay, regardless of shape). While Finesse will really help early levels (before solid shifter options), it might be worth dropping Weapon Focus: Shortsword to get Toughness.</div></blockquote>\n\nGood call.  I'll see how I can tweak the stats around.  I like the Toughness in place of WF: Shortsword suggestion.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong>Now, IMO, a shifter should be played EXCLUSIVELY as shifter rather than trying to add some versatility to a druid build.  Otherwise, the true benefit of the class itself is diluted and/or limited (i.e. dragon build).  Just my opinion from experience... for what it's worth.</div></blockquote>\n\nI agree, and that's how I'm planning on playing the build.  My primary form is going to be the Risen Lord shape with the Humanoid shapes as backup.  With 5 levels of Druid up to that point, and only 6 in total, there is very little Druid in me I can rely on besides a few minor buffs and a temporary meatshield.  <br/>\n<blockquote><div><strong>HipMaestro wrote:</strong>It's a shame you must \"waste\" feats on Finesse &amp; KD since your back-up form is the only form that can use finesse and gets it automatically along with HiPS while shifted and minotaur gets KD.  The unfinessable scythe AB will be based off of STR 21 + 5 (or higher with high magic environments) + RL boost though the AC will be similar to a WIS build.<br/>\n<br/>\nI wouldn't compromise the overall build just to be able to hit a few foes with a shortsword at low levels.  Too feat-starved IMO.</div></blockquote>\n\nSo I can drop WF: Shortsword (and EWF: Shortsword) for Toughness and Improved Critical: Scythe.  Since I am playing this from level 1, I chose Weapon Finesse purely for ease of play.  KD/IKD on the otherhand, I won't say are \"wasted\" because 1) the Risen Lord and Humanoid shapes don't get it and 2) IKD is a good source for my 9d6 sneak attacks.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong>Don't under-rate wyrmling.  With the 5 forms available, the breath weapon will do unlimited uses of damage of an element that will always be effective.  That's where I would automatically drop finesse for expertise and knockdown for imp expertise and use the epic minotaur if you REALLY REALLY must KD someone. </div></blockquote>\n\nThe 2 PW's I normally play on do not allow Expertise mode on while spellcasting (takes you out of Expertise mode when you cast a spell).  Does this type of scripting also apply to the wrymling breath weapon?  Granted you can turn it back on right after the breath weapon fires...<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong><br/>\nBTW, unless epic traps have been customized on your planned server, in this build you will need only 36 unmodified ranks of Disable Trap to disarm them.  If you plan to recover epic traps, you will need a modified level of 48 which typically means skill foci feats and/or elevated INT.</div></blockquote>\n\nGood to know, but yes, trap DC's are highly variable, at least on one of the PW's.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:45 AM - Nov 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>The 2 PW's I normally play on do not allow Expertise mode on while spellcasting (takes you out of Expertise mode when you cast a spell). Does this type of scripting also apply to the wrymling breath weapon? Granted you can turn it back on right after the breath weapon fires...\n</div></blockquote>\n\nIf it`s WoG then you CAN use the Dragon Breath (and I presume Wyrmling one as well) while in Expertise mode. Tested and confirmed<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:58 PM - Nov 30, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Demos wrote:</strong><br/>\nI agree, and that's how I'm planning on playing the build.  My primary form is going to be the Risen Lord shape with the Humanoid shapes as backup.  With 5 levels of Druid up to that point, and only 6 in total, there is very little Druid in me I can rely on besides a few minor buffs and a temporary meatshield. \n</div></blockquote>\nFrom Druid 1 to druid 4 I would use Sling/Animal pal in a DEX build.  Good enough AB and will hit undead nicely also.<br/>\n<br/>\nAt druid 5, you get bear form (or whatever form you prefer).  So when I refer to pure shifter I mean pure shifter.  The first polymorph form is at druid 5.  There is some merit to taking Imp Crit: Unarmed for this and future claw/bite attacks but not absolutely necessary.  <br/>\n<br/>\nAt rogue 1 (toon 6), stick to bear form with the added 1d6 sneak.  I always enjoyed the dual-bear druid attack in early levels.  Fun stuff.   <br/>\n<br/>\nAt shifter 1. Wyrmling.  That's what I mean about playing pure shifter.  Pure shifter means using as many forms as possible and selecting the best one for the situation.  Forget about human form entirely except for buying supplies and wooing. Making any accommodation for unshifted forms works for all builds EXCEPT shifter.  It just makes the overall build, an extremely feat-starved one (except shifter/fighter or shifter/CoT), that much weaker when you finally begin to achieve the focus form(s) and can really use the benefit from the more productive ones.<br/>\n<br/>\nAlso, it looks like you are not really focusing your secondary form on humanoid (3 different forms), but rather, specifically kobold commando.  That's why shortsword foci makes some sense if you feel you will be running into significant number of clerics and pallies.  But that is the only humanoid form that will be benefiting from those foci/imp crit, though even that one will override your allocated DEX with its own (DEX 22/DEX 25).  The +9/+13 BAB from commando will more than compensate from the lost DEX, attack-wise.  As stated previously, most DEX-based shifter forms get finesse automatically.\n<blockquote><div>\n<blockquote><div><strong>HipMaestro wrote:</strong>It's a shame you must \"waste\" feats on Finesse &amp; KD since your back-up form is the only form that can use finesse and gets it automatically along with HiPS while shifted and minotaur gets KD.  The unfinessable scythe AB will be based off of STR 21 + 5 (or higher with high magic environments) + RL boost though the AC will be similar to a WIS build.<br/>\n<br/>\nI wouldn't compromise the overall build just to be able to hit a few foes with a shortsword at low levels.  Too feat-starved IMO.</div></blockquote>\n\nSo I can drop WF: Shortsword (and EWF: Shortsword) for Toughness and Improved Critical: Scythe.  Since I am playing this from level 1, I chose Weapon Finesse purely for ease of play.  KD/IKD on the otherhand, I won't say are \"wasted\" because 1) the Risen Lord and Humanoid shapes don't get it and 2) IKD is a good source for my 9d6 sneak attacks.\n</div></blockquote>\nDropping one of the weapon foci will depend on how much divine pressure you may incur.  It is VERY tough to focus in more than one weapon with a shifter without sacrificing feats of more over-ranging value.   That's the cost of ED and the feat-starved class that is required. <br/>\n<br/>\nI still assert weapon finesse is totally wasted unless you insist on using a finessable melee weapon for the first 4 levels.  If the first 4 levels are that difficult to warrant compromising the overall build... ummm... I am speechless.    <br/>\n<br/>\nI can see some benefit from KD though, TBH, my Risen Lords never waste time KDing anything.  It just wastes a round without doing any damage. They are killing dynamos. With x4 crits, the scythe usually kills in one hit anyway and with 9d6 sneaks that will pretty much be a certainty.  With UMD, scrolls of Keen Edge and Darkfire/Flame weapon will boost it even further.  You won't be KDing any bosses.  Really can't see where KD is much use for a RL.  <br/>\n<blockquote><div><blockquote><div><strong>HipMaestro wrote:</strong>Don't under-rate wyrmling.  With the 5 forms available, the breath weapon will do unlimited uses of damage of an element that will always be effective.  That's where I would automatically drop finesse for expertise and knockdown for imp expertise and use the epic minotaur if you REALLY REALLY must KD someone. </div></blockquote>\n\nThe 2 PW's I normally play on do not allow Expertise mode on while spellcasting (takes you out of Expertise mode when you cast a spell).  Does this type of scripting also apply to the wrymling breath weapon?  Granted you can turn it back on right after the breath weapon fires...\n</div></blockquote>\nI believe Max resolved this issue.  Shifter is often nerfed on some low- to mid-magic servers due to its unbalancing potential.  Nerfing the breath attack though, would be silly IMO, and I would build a shifter elsewhere.  Not a trivial issue when trying to level a shifter.<br/>\n<blockquote><div><blockquote><div><strong>HipMaestro wrote:</strong><br/>\nBTW, unless epic traps have been customized on your planned server, in this build you will need only 36 unmodified ranks of Disable Trap to disarm them.  If you plan to recover epic traps, you will need a modified level of 48 which typically means skill foci feats and/or elevated INT.</div></blockquote>\n\nGood to know, but yes, trap DC's are highly variable, at least on one of the PW's.</div></blockquote>\nI find it hard to believe that any decent environment would screw with epic trap defaults.  But you would know better.  <br/>\n<br/>\nAt minimum, I'd at least slide 5 points over to Set Traps since your rogue is DEX based and will end up with a very high DC on non-epic traps.  That would only net a loss of -3 Disable with the synergy intact.  Against PvP traps, you'd need to invest into skill foci for Search and Disable and even that probably would NOT help against a serious trap setter.  Even server-designed Deadly Trap DCs would have to be raised at least 20 points to get any use of the maxed Disable levels you have.  Unlikely (or perhaps ridiculous is a more accurate adjective).  I would advise to start checking your game log to see what DCs are being used for traps on your server.  Offsets are usually consistent across the full range of traps.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}