{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "001",
  "name": "Knockdown and the Vagaries of Game Mechanics",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/knockdown-and-the-vagaries-of-game-mechanics-t2355540.html",
  "author": "ratty_uk2011",
  "avatar": "no_avatar.png",
  "replies": "40",
  "views": "5.2K",
  "posts": [
    {
      "author": "ratty_uk2011",
      "avatar": "no_avatar.png",
      "timestamp": "7:27 PM - Aug 15, 2020",
      "content": "<div><em><span style=\"color:#FF0000\">EDIT by Stagmeister 12/12/20: Changed title and stickied.</span></em><br/>\n<br/>\nThis isn't explained well in the WIki, so grateful for any insight please.<br/>\n<br/>\nWhat does an opponent need to roll, and what are the opposed checks that take place to I k/d my char?<br/>\n<br/>\nSet in a context, this is a B26/BG4/RDD 10 I play on WoG.    AC was 71 and Discipline 83 at the time I was sat on my arse,</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:18 PM - Aug 15, 2020",
      "content": "<div>Was it from a big, scary Dragon?<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:23 PM - Aug 15, 2020",
      "content": "<div>I've been IKDed by a scary Dragon AS a Dragon (World Ender) with a very high Disc and an AC of over 100.<br/>\n<br/>\nScary Dragon just spams IKD, and on a 20, hits.<br/>\n<br/>\nUsed to KD my Dragon a little too often for my tastes.<br/>\n<br/>\nThankfully, KD immune items are available. <br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "stephenratcliffe809",
      "avatar": "10759100_1561880327.jpg",
      "timestamp": "8:41 PM - Aug 15, 2020",
      "content": "<div>Hey Webby<br/>\n<br/>\nYes - Draggy is the Boss in question.<br/>\n<br/>\nI'm OK with being hit on a natural 20, but when I look at the combat log, I'm not seeing any check for the attack roll vs my Discipline to resist the k/d effect.<br/>\n<br/>\nSent from my SM-T810 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:47 PM - Aug 15, 2020",
      "content": "<div>Yeah, Draggy will knock you the fuck down!<br/>\n<br/>\nHave you got logging enabled?<br/>\n<br/>\nAfter taking a look at it, I changed GDL's World Ender to have 3 Rog levels for UMD (Thieves Hood, Imm KD) and to get Uncanny Dodge.<br/>\n<br/>\nHe is one nasty critter!<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:17 AM - Aug 16, 2020",
      "content": "<div>Hi Ratty_uk2011 / Stephenratcliffe809!<br/>\n<br/>\nI think your question is an excellent one. <br/>\nRE knockdown mechanics, AC is only valuable to determine if a discipline check occurs or not. <br/>\nIf the attack hits (either equalling the AC or higher, or rolling a natural 20) then the check occurs.<br/>\nThe subsequent discipline check and rolls do not show in the combat log. The wiki does not have information on the discipline rolls.<br/>\n<br/>\nIf I would hazard an educated guess based on my experience, I believe it to be Attacker's AB roll (including -4AB) +1d20 + modifiers (ie size difference including improved knockdown modifier) = Discipline DC.<br/>\nThe player then rolls Discipline skill +1d20 to see if they resist the knockdown or get knocked down.<br/>\nThat way the situation where an 83 discipline character can still be knocked down by a 70 AB roll attack if the attack hits (ie a 20), the discipline roll is low and the attacker's knockdown roll is high.<br/>\nLike Web writes I always try to obtain knockdown immunity if I can and not rely on discipline.<br/>\n<br/>\nMore information however is appreciated though, I am very interested.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:40 AM - Aug 16, 2020",
      "content": "<div>Ok, let us take a deep look into this :<br/>\n<br/>\nDragotha <blockquote><div>\nUndead ancient red dragon<br/>\n<br/>\nStr 42 (+16)<br/>\nDex 16<br/>\nCon 27<br/>\nInt 26<br/>\nWis 27<br/>\nCha 27<br/>\n<br/>\nSaves<br/>\n<br/>\nFort 28<br/>\nRefl 23<br/>\nWill 28<br/>\n<br/>\nAB +50<br/>\nAC 45 (49) (size -4) +2 Armor Skin (51)<br/>\nHp 518<br/>\n<br/>\nDisc 75<br/>\nListen 55<br/>\nSpot 55<br/>\n<br/>\nSR 26<br/>\n<br/>\nImmune cold, elec, fire<br/>\n50% Piercing, slashing<br/>\nDR +3 (soak 20)<br/>\n<br/>\n56 hits<br/>\n53 hits<br/>\n49 misses<br/>\n52 misses<br/>\n<br/>\nDragotha +50 AB</div></blockquote>\n\nSo he looks like he has a pretty high AB, right?  Plus with his IKD (I think it is IKD), the size modifier against a medium type is going to be substantial.  A bonus in any regards.  Assuming he rolls a 20 for his to hit, we add that to his AB.  It's gonna be pretty high.<br/>\n<br/>\nHere are the related information regarding how it all works :<br/>\n<br/>\nSkill Check - <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Skill_check\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Skill_check</a><br/>\n<blockquote><div>d20 + skill ranks + ability modifier + feat bonuses + skill modifiers + miscellaneous modifiers</div></blockquote>\n\nDifficulty Class - <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Difficulty_class\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Difficulty_class</a><br/>\n<br/>\nSo the DC will be the Attack roll, with any bonuses figured in (mainly the size category modifier here).<br/>\n<br/>\nAs I said - check the logs.  It will not tell you the DC vs Disc roll, but it WILL tell you the Attack roll that caused the Knockdown.<br/>\n<br/>\nIn my cases, I realized that since a 20 always hits, I could ignore the AC question here.  Instead, it was more that +20 was being added to the Knockdown DC, plus whatever other modifiers (in this case, the Size modifier).</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:04 AM - Aug 16, 2020",
      "content": "<div>Thanks for getting the enemy details<br/>\nIt is tricky without the DC vs Discipline Roll details<br/>\n<br/>\nI will try to figure out the math here (this is very rough just treat it as an approximation):<br/>\n- Dragotha AB of 50, -2 huge size modifier = AB 48, max attack roll 68 against medium characters<br/>\n- Improved knockdown -&gt; -4AB so max attack roll with IKD is 64.<br/>\n<br/>\n- Discipline modifiers -&gt; Huge vs Medium +8 DC, improved knockdown modifier +4 DC = +12 DC (bigger than huge with IKD - see WhiZard's opinion)<br/>\n<blockquote><div><a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Talk:Improved_knockdown\" rel=\"noreferrer\" target=\"_blank\">Bigger than huge? </a><br/>\nHow does this feat function if you are already considered to be huge in size (as in dragon shape)? There is no size category higher than huge listed for modifiers to knockdown discipline checks, so is there no change, or does your opponent still lose 4 from their discipline check? 74.131.48.90 08:41, January 26, 2010 (UTC)<br/>\n<br/>\nI believe there is provision for one size larger than huge within knockdown. WhiZard 10:10, January 26, 2010 (UTC)</div></blockquote>\n- So if the DC was the Attack Roll alone, the maximum DC would be 76, which would not be enough for a discipline score of 83 in Ratty_UK's case.<br/>\n<br/>\n- It would make sense from what I observe and what other players observe in terms of the lack of knockdown resistance from the discipline skill that an extra roll is added and I am guessing +1d20</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:11 AM - Aug 16, 2020",
      "content": "<div>Actually it might not be too hard to test this out.<br/>\n<br/>\nIn Pretty Good Character Creator, one can generate a fighter opponent who will attempt to knock the player down.<br/>\nMake note of the fighter opponents AB in the combat log.<br/>\nSet the players AC low so the fighter will always hit, and have some physical immunity item for durability. Make sure the fighter doesn't have dev crit.<br/>\nThen an item to boost the discipline skill to a desired amount, vary this upwards over a series of attempts until knockdown is always resisted.<br/>\n<br/>\nI might do a test with a level 20 character and see how it goes.</div>"
    },
    {
      "author": "ratty_uk2011",
      "avatar": "no_avatar.png",
      "timestamp": "5:49 PM - Aug 16, 2020",
      "content": "<div>Thanks both!<br/>\n<br/>\nIt was the 1d20 on the I k/d vs Disp check that I was missing in my mental calculations. <br/>\n<br/>\nI'll go back for round two, and post the combat log in as much of a spoiler-free way as I can.</div>"
    },
    {
      "author": "ratty_uk2011",
      "avatar": "no_avatar.png",
      "timestamp": "12:58 PM - Aug 19, 2020",
      "content": "<div>Righty ho.<br/>\n<br/>\nEquipped with some Epic Discipline Gloves to test things, I now have Disp 93.<br/>\n<br/>\nCombat log doesn't show the opposed skill check calculation, just the \"Resisted\" message.    So at least there is something going on under the hood.<br/>\n<br/>\nBut I'm not sure where the attack vs skill check trigger comes from.  At the time I had an AC of 70 and Dragon was Cursed Song and Taunted, so I'd expect to be hit only on a natural 20.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:07 PM - Aug 19, 2020",
      "content": "<div>Told you those Gloves would make the difference! <span class=\"text-emoji\">😁</span><br/>\n<br/>\nI see a Tumble : *success* in there.  And I see 18+37=55 *hit*  I think you were flatfooted.</div>"
    },
    {
      "author": "ratty_uk2011",
      "avatar": "no_avatar.png",
      "timestamp": "2:52 PM - Aug 19, 2020",
      "content": "<div>\"A character or creature that is caught unawares or otherwise unprepared is considered to be flat-footed. A flat-footed character loses his dexterity, dodge, and tumble bonuses\"<br/>\n<br/>\nThat's not a bad shout Webby!  <br/>\n<br/>\nQuick maths is -(+2 + 12 + 8), so -20 AC easilly.     Bard Song counts as Dodge bonus of course.<br/>\n<br/>\nLooking at Wiki, Taunting definitely leaves you flat-footed.   And it doesn't say so, but maybe casting Divine Might or Divine Sheild also.<br/>\n<br/>\nI think we are gradually unpacking this question :)<br/>\n<br/>\n  </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:19 PM - Aug 19, 2020",
      "content": "<div>And that is how you absolutely know that the AI cheats.<br/>\n<br/>\nIt \"sees\" this, and reacts far faster than a human could (assuming that a human could even notice that the creature in question was, actually, flatfooted because alot of creatures have no animations for some actions that indeed leave them flatfooted).<br/>\n<br/>\nEspecially with the \"we are all standing around here, and damage numbers are floating above our heads\" and how in the HELL am I supposed to know when and what attack sequence I am on?<br/>\n<br/>\nBut the AI always knows, and makes no mistakes in that regard.<br/>\n<br/>\nWhich means that we should also have access to such \"bot behavior\" for ourselves.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "3:51 PM - Aug 19, 2020",
      "content": "<div>Orion is right about how Knockdown works: AB Roll + Size Modifier vs Discipline + 1d20, ties result in Knockdown being resisted.<br/>\nSo either WoG has changed the size modifier bonus (easily done in EE), EE has changed how Knockdown works, or the AB/Discipline used in Orion's calculations are inaccurate.<br/>\nAre you certain that your Discipline was 83? For example, if it's 83 with Bard Song but Bard Song ran out during the fight then it might be possible to get KDed on a low Discipline roll.<br/>\n<br/>\nLooking at your screenshot, Razorfang has +42 AB, +38 AB with IKD. A 20 on the attack roll give a Discipline DC of 58 + Size Modifier. Assuming that Razorfang is huge and your character is medium, that's a Discipline DC of 70 (74 if your character is small). So you should be able to resist any IKD attempts from Razorfang with 69 Discipline (73 if your character is small). This is assuming that Razorfang doesn't have access to any AB buffs or STR/Discipline decreasing debuffs.<br/>\n<br/>\nTaunt causes your character to become flatfooted but Divine Might and Divine Shield don't. You may become flatfooted right after using those feats if you don't attack straight away, but you won't be flatfooted while using them.<br/>\n<br/>\nCounting flurries is possible to do, although I usually only use it for tough opponents. Fighting weak opponents with melee builds is usually just point and click, even on builds that require buffs. If I'm playing a sneaker with a flurry attack schedule of 2/2/1 with Haste, then I try to KD on the third flurry to get 4 Sneak Attacks instead of 3. Flurry counting is also useful for deciding when to use combat feats/modes, cast spells, or use items.</div>"
    },
    {
      "author": "ratty_uk2011",
      "avatar": "no_avatar.png",
      "timestamp": "1:32 PM - Sep 23, 2020",
      "content": "<div>OK, to return and add some observations since:<br/>\n<br/>\n* Acc to combat log, Boss in question has attack sequence of +53/48/43/38   and I can see that reduce to +49 etc when it attempts an IKd<br/>\n* It's a +/- 10 minute fight, so plenty of time to observe the behaviour and results data<br/>\n* I have Disp of 93 (Bard Song active plus Epic Disp gloves) but still keep getting knocked on my arse<br/>\n* I can accept being hit on a natural 20 or when flatfooted (Taunting) thus loosing Dodge AC<br/>\n* Combat log doesn't show the opposed calculation though, so I have no idea of the maths<br/>\n* I never see an attempt resisted - this I know does trigger a message<br/>\n* Consequently I have no idea what's going on \"under the hood\"<br/>\n* I have no reason to believe WoG has modified the script for this feat.<br/>\n<br/>\nBut, and this is a big but, it doesn't matter.  Why?<br/>\n<br/>\nBecause the AI is cheeseybuggedcheat - I've run the Boss in question ten times in the past weeks, testing this,     I ALWAYS see the above, but AI NEVER EVER even attempts an IKd if I'm wearing a Kd immunity item. <br/>\n<br/>\nSo Thieves Helmet all the time from now on and save the skill points for something else.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "5:24 PM - Sep 23, 2020",
      "content": "<div>I just did three tests with a Human using IKD on another human. None of the tests suggest that another 1d20 is rolled for the attacker after the initial attack. I suggest asking if Knockdown has been modified on the WoG forums. Another possibility is that the boss has some kind of OnHit: Knockdown effect, or that Knockdown has been changed for that particular boss (which I believe is possible with NWNX).<br/>\n<br/>\nWhen IKD spamming the attacker has an AB schedule of +62/+59/+56/+53 / +50/+47/+64 / +59/+62/+57. So the possible AB values for crits/hits/resists ranges from 49 to 84. Due to the IKD modifier this results in a Discipline DC range of 53 to 88.<br/>\nThe observed AB ranges for the categories is listed beside them, since the attacker is using IKD there is a bonus +4 to the DC.<br/>\n<br/>\n60 Discipline<br/>\nExpected Min Hit/Crit AB: 58 (60 + 1 vs 58 + 4)<br/>\nExpected Max Resist AB: 76 (60 + 20 vs 76 + 4)<br/>\nIKD Attempts - 184<br/>\nIKD Crits - 22 [AB Range: 67 - 84]<br/>\nIKD Hits - 66 [AB Range: 59 - 82]<br/>\nIKD Resists - 87 [AB Range: 50 - 72]<br/>\nIKD Misses - 9<br/>\n<br/>\n70 Discipline<br/>\nExpected Min Hit/Crit AB: 68 (70 + 1 vs 68 + 4)<br/>\nExpected Max Resist AB: 86 (70 + 20 vs 86 + 4)<br/>\nIKD Attempts - 94<br/>\nIKD Crits - 4 [AB Range: 77 - 83]<br/>\nIKD Hits - 10 [AB Range: 71 - 80]<br/>\nIKD Resists - 73 [AB Range: 50 - 84]<br/>\nIKD Misses - 7<br/>\n<br/>\n80 Discipline<br/>\nExpected Min Hit/Crit AB: 78 (80 + 1 vs 78 + 4)<br/>\nExpected Max Resist AB: 96 (80 + 20 vs 96 + 4)<br/>\nIKD Attempts - 108<br/>\nIKD Crits - 0<br/>\nIKD Hits - 1 [AB Range: 80]<br/>\nIKD Resists - 101 [AB Range: 50 - 82]<br/>\nIKD Misses - 6</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:05 PM - Sep 23, 2020",
      "content": "<div>There have been no changes to KD or IKD on WoG that anyone is aware of.  It is vanilla.<br/>\n<br/>\nNWNX is not active on WoG (it is on Windows 10, which NWNX does not currently support).<br/>\n<br/>\nThe Boss in question most likely does not have OnHit: KD, at least not that I am aware of.  I have been hit by that Boss before and there was no KD message or effect (a rare string of 20s, as that character has Epic Dodge and the Boss in question will only do an Improved KD on the first, highest AB attack when AC is too high like in my case).</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "6:53 PM - Sep 23, 2020",
      "content": "<div>I tested again with a Dragon Shape build using IKD on a human with 60 Discipline. There's still nothing to suggest that the IKD DC gets an extra 1d20, so this seems to be a WoG problem rather than a NWN problem.<br/>\n<br/>\nAB when IKD spamming (Claws): +52/+49/+46 / +43/+40/+37 / +34/+31. Bite attacks have 6 less AB, so the possible AB values for crits/hits/resists ranges from 27 to 72. Huge size and IKD results in a Discipline DC range of 39 to 84.<br/>\n<br/>\n60 Discipline vs Dragon (Huge)<br/>\nExpected Min Hit/Crit AB: 50 (60 + 1 vs 50 + 12)<br/>\nExpected Max Resist AB: 68 (60 + 20 vs 68 + 12)<br/>\nIKD Attempts - 216<br/>\nIKD Crits - 12 [AB Range: 57 - 69]<br/>\nIKD Hits - 43 [AB Range: 50 - 70]<br/>\nIKD Resists - 154 [AB Range: 29 - 62]<br/>\nIKD Misses - 7</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:23 PM - Sep 23, 2020",
      "content": "<div>Thanks, Yunim.</div>"
    },
    {
      "author": "ratty_uk2011",
      "avatar": "no_avatar.png",
      "timestamp": "8:58 AM - Sep 24, 2020",
      "content": "<div>And from me for the work Yunim <span class=\"text-emoji\">😀</span><br/>\n<br/>\nI will go back to this in a few days - there's some other monsters with Ik/d on WoG, so let me try this Discipline issue elsewhere.   This *should* confirm if it's this specific monster build property or not.<br/>\n<br/>\nIt is peeving that the opposed check for K/d isn't shown in the combat log though.  Bah!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:35 PM - Sep 24, 2020",
      "content": "<div>In the offline WoG, I encountered a monster a map or two West in the Shield Lands in a barn that knocked me down a lot.  I think it was called a famine spirit.  With a helmet of +4 Discipline and some STR gear, on top of my RDD STR, I was able to sometimes resist his knockdown.  I found out later that I had knockdown immunity boots in my inventory that I could have used.  *Facepalm*</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:27 AM - Dec 10, 2020",
      "content": "<div>Remember guys, some of these (in fact, a lot of these) mishaps, are due to the old engine. How many times do the enemies happen to completely ignore the rules of the game, surely it has happened to a  lot of you by now, in various PW/modules. Enemies that hit you behind \"solid walls\", enemies that stand-up immediately after being knocked down, then do some weird animation of sitting-down again, only to be able to hit you back or cast spells back at you while they should just be prone! Enemies that just-won't-die, enemies that detect you through the greater sanctuary, etc. <br/>\n<br/>\nTell you what, I'm not a game developer but I think that most of these come from bad detection collision in the game engine &amp; there should also be limitations due to the fracture of the game rounds, too. I did several tests in-game with the wail of the banshee, for example, my test grounds were the old open fortress of the knight Arbas. There are more than 40 creatures in there waiting for you when you activate all the location triggers. I went there, multiple times too, with my melee-Sorceress &amp; stopped the time &amp; then unload three consecutive Wails upon them. Only 7-10 creatures actually died. The \"upper\" creatures, those waiting for you in the towers &amp; the balcony did not get affected at all. They did die, only when I specifically targetted them with FoD, however. The same thing happened when later tested that with Underdark's Kuo-Toa army. I unleashed 6-7 Wails, I think, but after the first one that killed a dozen of them, only 1-2 additional creatures died. Strange, isn't it? As if, you need to kill them \"in flurries\" kinda, does this makes sense to you? Or maybe they were \"out of range\" despite the optical effect shown. Some of you might have experienced what I am talking about or have tested that themselves. The AoE spells losing their \"potency\" when repeated consecutively. Target spells, however, have none of these problems. Isaack's storm will work every time correctly, as far as I can tell. Same with FoD. <br/>\n<br/>\nAnyway, remember it's a 20-years-old engine trying to do advanced stuff (especially with Tony's AI). </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:49 AM - Dec 10, 2020",
      "content": "<div>I think what happens with mass stuff \"all at once\" can overload the combat/AI routines and I believe there is a \"goto routine\" that saves cycles by front loading rolls.<br/>\n<br/>\nI say this because a lot of repeat 20/1 rolls that I often see (that I have been paying close attention to this year) occurs when there is lag.<br/>\n<br/>\nBy this, I mean like 3~4 20s in a row (I have seen 6 in a row so far as the most rolled) and series of 1s as well.<br/>\n<br/>\nThis also seems to happen with treasure scripts as well - sometimes it \"goes crazy\" and drops some wild stuff all at once (probably multiple rolls of extreme variables).<br/>\n<br/>\nThe KD when under Fear, etc bug almost always occurs - i.e. the buggers get up and move faster than your character can (even when Hasted OR A HIGH LEVEL MONK!!!!!) and one loses valuable time trying to chase them down...I fucking hate that!<br/>\n<br/>\nI normally have to break combat and using WASD keys, run quickly ahead to get in a flurry before they head off somewhere else.<br/>\n<br/>\nThe same does NOT happen for your character when Feared, KDed, etc - the enemy has no problems hitting you halfway across the screen in melee!<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "3:50 PM - Dec 10, 2020",
      "content": "<div>The AI isn't bound by all of the rules that affect players, but Tony K AI makes it worse by lacking checks that prevent some of that behaviour which the default AI has. Although Tony K AI does make for a more challenging PvM experience the AI cheating can get pretty annoying. Some of the problems are due to NWN bugs but in my experience the actual combat engine works pretty well. Combining Knockdown with other disabling effects (including itself) has always been buggy, even for players. Spells are a mixed bag, partly due to poorly written scripts and partly due to buggy functions.<br/>\n<br/>\nFor example, Wail has both a distance component and a creature cap. The spell only affects creatures in a radius of 10m from the spell target, but that 10m includes height so creatures on towers or platforms may be out of reach of the spell. The creature cap (equal to your caster level) increases whenever the spell chooses a new target rather than when the spell actually attempts to kill a new target, so both the caster and allies within a 10m radius will count towards the creature cap. There is also a consistent issue with GetFirstX() functions not working properly on creatures that are standing in AOEs, although that particular bug might not affect Wail. It does mean that some AOE spells (Ice Storm, IGMS, Mass Heal, etc) will randomly fail when used on creatures standing in auras.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:32 PM - Dec 10, 2020",
      "content": "<div>@ Web, I thought it was bad practice/technique to use GoTo routines anymore, but yeah, we're talking 20 years ago, so it would be normal at that time...<br/>\nI have seen that repeated 20's &amp; 1's behavior as well, unfortunately, you are not alone. <br/>\n<br/>\n<em class=\"mention\">@Yunim</em>, an interesting insight into the engine's behavior, what you say makes complete sense to me &amp; answer a lot of questions that were \"bugging\" me for many years, thanks!</div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "6:41 PM - Dec 10, 2020",
      "content": "<div>I would like this to be fixed if at all possible. I'd love to see the day when Creeping Doom actually becomes useful! Right now, all KDed / Held opponents just walk out of the AoE...</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:34 PM - Dec 10, 2020",
      "content": "<div>This thread is so full of useful information, that it needs to be stickied imo.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:35 PM - Dec 11, 2020",
      "content": "<div>I agree although we might have to change its title name (I don't know if that's possible) probably. <br/>\n<br/>\nHere we go deep into the game's mechanics, instead of just brushing it.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:16 PM - Dec 11, 2020",
      "content": "<div>Oh, gods, that would be me, then, I suppose. <span class=\"text-emoji\">🙄</span><br/>\n<br/>\nI'll see what I can do (assuming consent from the rest of the triumvirate, of course).<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:35 PM - Dec 12, 2020",
      "content": "<div>How's that?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:53 AM - Dec 13, 2020",
      "content": "<div><blockquote><div><cite>Stagmeister wrote: <div class=\"responsive-hide\">Dec 12, 2020</div></cite>How's that?</div></blockquote>\nYou rock man, as always!</div>"
    },
    {
      "author": "MentalDekay",
      "avatar": "10759116_1563898639.jpg",
      "timestamp": "4:56 AM - Dec 13, 2020",
      "content": "<div>Honest question.. Would we love this ~20 year old game so much if it didn't have these \"character traits\"? <br/>\n<br/>\nAlso.. I do hardware not software (so don't call me an expert!), but I was in school when this game was being made. We were taught that goto statements became taboo with the rise of C as a thing that only lazy coders used as crutches stuck in their misguided thinking from the days of Pascal and Fortran. Of course that is for \"real programming\" (i.e. compiled languages) not scripting languages (where such practices are more accepted), which is what I'll assume the game designers used to stitch together game engine functions. If the gotos are in the compiled actual engine (is this what Web calls 'hardcoded'?), then I'd hypothesize that the game engine designers were also artists that picked up C/C++ in their evenings, on the job, or more likely both. Finally, I'm sure that business pressures forced upon even the most undisciplined coders lead to then rolling a 1 for their DC check when they deciding if they use such mechanisms... if such things aren't \"hardcoded\" in corporate enterprises...</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:54 AM - Dec 13, 2020",
      "content": "<div>Hardcoded means parts of the programming in the NWN Aurora Engine that we cannot access with \"hacking\" into it ala NWN Extender (for example).<br/>\n<br/>\nA good example of this is the Holy Avenger Dispel code (which is something that we cannot access).<br/>\n<br/>\nBeamDog has made some of the previous hardcoded stuff accessable (probably what was allowed in the agreement to be able to do NWN EE) - like additional weapon feats (CEP weapons, etc).<br/>\n<br/>\nNow, I do not really know if there are GoTo subroutines in NWN - I used this term as an example, because after a year of observations of how the Dice Roller is working, it became very apparent that it \"stutters\" under stress (meaning tends to repeat itself, instead of being really random), especially when it is lagging hard.<br/>\n<br/>\nI personally would not be all that surprised, however, if there were - Stratovarious (creator and lead of the PRC) said that Bioware's coding is monstrously bad (especially when it comes to optimization, which the PRC did to a lot of stuff).  And if anyone should know, it would be him and Virusman.  Probably The Crit as well.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:29 PM - Dec 13, 2020",
      "content": "<div>You don't have to look any further than the Pathfinding issues (that also, so frequently lead to flat-footed ) as a testament to this. <br/>\n<br/>\nAbout the Beamdog situation, they should have made an official patch themselves with all these fixes instead of letting PW developers do that, each one implementing different rules than the others. Because now, we don't have a reference point except the same old 1.69 that has it's own issues. How hard would it be to implement a few new classes &amp; feats into the basic game &amp; fix some useless skills (parry, I'm looking at YOU) alongside the release of the \"remastered\" version?</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:32 PM - Dec 13, 2020",
      "content": "<div>We don't know what the contractual conditions are for BD.<br/>\n<br/>\nI suspect they disallow adding new classes, feats, etc to the game (otherwise I think we would have seen some already).<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:38 PM - Dec 13, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Dec 13, 2020</div></cite>We don't know what the contractual conditions are for BD.<br/>\n<br/>\nI suspect they disallow adding new classes, feats, etc to the game (otherwise I think we would have seen some already).\n</div></blockquote>\nBut I'm talking about them implementing it to the game. <br/>\nThey did it just fine on BG 2 EE anyway, adding a bunch of 3E classes (SD, DWD, etc.) even though it was an anachronism for an AD&amp;D 2nd Edition game. So, why should be harder to do that on NWN EE?</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:46 PM - Dec 13, 2020",
      "content": "<div>BG was not the same as NWN - totally different story (tongue in cheek here).<br/>\n<br/>\nThat BD was even able to do NWN EE is a miracle - only made possible iirc because Atari was out of the way.  <br/>\n<br/>\nAnyway, without being able to actually see the conditions that BD agreed to abide by (or getting official info about this from BD themselves), the question(s) are moot.  We can only go by what we have seen so far (and what we have not).<br/>\n<br/>\nI don't know how closely you have followed all the \"suggestions\" that BD got bombarded with - I followed them closely at first (especially the increasing level, allowing for an extra class slot, and of course multi party control).  It became quite obvious that these things were not going to be worked on, and I believe firmly that this is due to contractual conditions stipulated in the agreement.<br/>\n<br/>\nWith weapon feats, they did an \"end around\" imo - meaning they unmasked a bit of hardcoding to allow for such things without actually implementing new feats.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:09 PM - Dec 13, 2020",
      "content": "<div>Yeah, they were bombarded with about a thousand suggestions &amp; they choose to implement not one of them.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:30 PM - Dec 13, 2020",
      "content": "<div><blockquote><div><cite>Valerfor wrote: <div class=\"responsive-hide\">Dec 13, 2020</div></cite>Yeah, they were bombarded with about a thousand suggestions &amp; they choose to implement not one of them.</div></blockquote>\nAnd that is where I ask \"I wonder why that is\"...</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:00 PM - Dec 13, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Dec 13, 2020</div></cite><blockquote><div><cite>Valerfor wrote: <div class=\"responsive-hide\">Dec 13, 2020</div></cite>Yeah, they were bombarded with about a thousand suggestions &amp; they choose to implement not one of them.</div></blockquote>\nAnd that is where I ask \"I wonder why that is\"...</div></blockquote>\nIf I were feeling cynical, and I often am, I'd say that in order to bring along a very well established community you need to make yourself look inclusive - \"We're listening. Your views are important to us...\" and all that crap. Of course, that includes zero commitment to do anything about them. And, if you make it an open consultation, you can always come back with the invariably true defence that there were contradictory views expressed.<br/>\n<br/>\nOr it could be something else entirely <span class=\"text-emoji\">😇</span><span class=\"text-emoji\">😈</span><br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    }
  ]
}