{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "240",
  "name": "Godly Trapsmith - Cleric 38 / Rogue 2",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/godly-trapsmith-cleric-38-rogue-2-t2276369.html",
  "author": "magaiti",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "2.3K",
  "posts": [
    {
      "author": "magaiti",
      "avatar": "no_avatar.png",
      "timestamp": "6:26 PM - Jul 30, 2012",
      "content": "<div>Godly Trapsmith<br/>\n<br/>\nThis is a \"Max possible Disable Traps\" build.<br/>\n<br/>\nIt is playable 1-40 PvE as a mediocre melee cleric build, and its main weakness is lack of discipline.<br/>\nIt will gain superb rogue skills at level 22 and later at level 40.<br/>\n<br/>\nBy level 40 it will hit 93 in Disable Traps skill without items, which will allow it to handle traps with DC up to 113.<br/>\n<br/>\nThat goes up to 116 with +5-6 INT from items, and can further be increased by up to +29 from items and/or effects like bard song (The build can boost itself by +21 so another +29 will hit the skills cap of +50).<br/>\n<br/>\n<br/>\nCleric(38), Rogue(2), Human<br/>\n<br/>\nSTR: 14<br/>\nDEX: 8<br/>\nCON: 14<br/>\nWIS: 15 (20)<br/>\nINT: 16 (32)<br/>\nCHA: 8<br/>\n<br/>\nThe skill can be raised by another 1 by going 18 starting INT, but that 6 ability points required will weaken the build greatly.<br/>\nI suggest going with 14.8.10.14(19).18(34).8 if you really want it.<br/>\n<br/>\n<br/>\n01: Cleric(1): Weapon Proficiency Martial, Extend Spell, Domain Trickery, Domain War<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Empower Spell<br/>\n04: Cleric(4): INT+1, (INT=17)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): Skill Focus: Disable Trap<br/>\n07: Cleric(7)<br/>\n08: Cleric(8): INT+1, (INT=18)<br/>\n09: Cleric(9): Knockdown<br/>\n10: Cleric(10)<br/>\n11: Cleric(11)<br/>\n12: Cleric(12): INT+1, Blind Fight, (INT=19)<br/>\n13: Cleric(13)<br/>\n14: Cleric(14)<br/>\n15: Cleric(15): Expertise<br/>\n16: Cleric(16): INT+1, (INT=20)<br/>\n17: Cleric(17)<br/>\n18: Cleric(18): Improved Critical<br/>\n19: Cleric(19)<br/>\n20: Cleric(20): INT+1, (INT=21)<br/>\n21: Cleric(21): Great Intelligence I, (INT=22)<br/>\n22: Rogue(1)<br/>\n23: Cleric(22)<br/>\n24: Cleric(23): INT+1, Great Intelligence II, Great Wisdom I, (WIS=16), (INT=24)<br/>\n25: Cleric(24)<br/>\n26: Cleric(25)<br/>\n27: Cleric(26): Great Intelligence III, Armor Skin, (INT=25)<br/>\n28: Cleric(27): INT+1, (INT=26)<br/>\n29: Cleric(28)<br/>\n30: Cleric(29): Great Intelligence IV, Great Wisdom II, (WIS=17), (INT=27)<br/>\n31: Cleric(30)<br/>\n32: Cleric(31): INT+1, (INT=28)<br/>\n33: Cleric(32): Great Intelligence V, Great Wisdom III, (WIS=18), (INT=29)<br/>\n34: Cleric(33)<br/>\n35: Cleric(34)<br/>\n36: Cleric(35): INT+1, Epic Skill Focus: Disable Trap, Great Wisdom IV, (WIS=19), (INT=30)<br/>\n37: Cleric(36)<br/>\n38: Cleric(37)<br/>\n39: Cleric(38): Great Intelligence VI, Great Wisdom V, (WIS=20), (INT=31)<br/>\n40: Rogue(2): INT+1, {Evasion}, (INT=32)<br/>\n<br/>\n<br/>\nHitpoints: 396<br/>\nSkillpoints: 391<br/>\nSaving Throws (Fortitude/Reflex/Will): 24/15/27<br/>\nSaving Throw bonuses: Spells: +10<br/>\nBAB: 25<br/>\nAB (max, naked): 27 (melee), 24 (ranged)<br/>\nAC (naked/mundane armor/shield only): 19/30<br/>\nSpell Casting: Cleric(9)<br/>\n<br/>\n<br/>\nSkills:<br/>\nConcentration 42(44)<br/>\nDisable Trap 43(69)<br/>\nHeal 43(48)<br/>\nOpen Lock 43(42)<br/>\nSearch 43(54)<br/>\nSet Trap 5(6)<br/>\nSpellcraft 42(53)<br/>\nSpot 43(48)<br/>\nTumble 40(39)<br/>\nUMD 36(35)<br/>\nremaining skillpoints 10<br/>\n<br/>\nSkills placement guide:<br/>\nAt level 1 put 1 into Disable Trap (cc) in order to get Skill Focus: Disable Trap.<br/>\nUntil level 22, max only Concentration and Spellcraft, and save all the rest.<br/>\nAt level 22, max Disable Trap, Open Lock, Search, Tumble, UMD. Put 5 into Set Trap for synergy bonus.<br/>\nUntil level 40 continue to max Concentration and Spellcraft. Put spare points into Heal.<br/>\n<br/>\n<br/>\nDisable Traps calculation:<br/>\n43(ranks) + 13(foci) + 2 (Synergy with Set Trap) 14 (38-39 INT, assuming we cast Empowered Fox's cunning for +6-7) + 20 (Trickery Domain Power, it actually gives (Cleric Lvl /2 + 1) + 1 (Prayer) = 93</div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "1:40 PM - Aug 13, 2012",
      "content": "<div>Wow! That's the smartest cleric one is likely to see. <br/>\n<br/>\nI don't know what other build objectives there are here, but, FWIW, a bard 30/cleric 8/rogue 2 gives a slightly higher disable traps total. Using your calculations above, I get set traps of 97 with trickery and bard song. <br/>\n<br/>\nI don't know about the overall practicality of such dedicated trap-setting builds, but a build with high trap-setting skill (and/or skill mastery) could basically have a store of epic and deadly traps that he sets under opponents' feet right during combat, dealing respectable piercing, elemental, negative, and divine damage while bypassing spell resistance and spellcraft bonuses to saving throws. If one could work in at least one level of HiPS into the mix, that could be an effective tactic against foes without true sight or maxed detect skills...</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:19 PM - Mar 14, 2016",
      "content": "<div>Other than trying to figure out the highest theoretical DC that can be disabled, this build really achieves little beyond building a typical formidable high-level priest and yet with all those epic levels devoted to INT, casting prowess is sorely diminished (no SpF feats, no penetration feats i.e. 39-58 vs. 45-64 when dealing with high-level monks, clerics, druids).  WIS 20 is only \"ok\" for a casting cleric.<br/>\n<br/>\n And Mr. Zork is quite right. Bardic trickery rogues are the highest possible disablers.  Work them out for yourself and you will quickly see the light. Dedicated DEXers with SkF + ESkF are the highest possible setters and they ALWAYS need mastery for dueling and mob control.<br/>\n<br/>\n Now to bring up a common mistake made by inexperienced ultra trapper designers... <em>Search</em>.  In other words, a toon can't disable a trap it hasn't spotted yet, therefore the final Search competency for this particular build would be:<br/>\n<br/>\n 43(ranks) + 19 INT (am giving the benefit of the doubt when assuming the INT cap can be reached) + 20 (Trickery) + 1 (Prayer) + d20 onheartbeat =<strong> 84-103</strong> (add +2 if elf)<br/>\n<br/>\n The builder also forgot to add the Take 20 to the Disable calculation so I'll list it here for comparison...<br/>\n 43(ranks) + 2 Synergy  + 19 INT (am giving the benefit of the doubt when assuming the INT cap can be reached) + 20 (Trickery) + 1 (Prayer) + 13 (focus) + Take20 = <strong>118</strong><br/>\n<br/>\n So, the DC which can be disabled is that DC able to be detected by Search or 84-103.  Therefore all skill focus feats are wasted in this example (i.e. 105 will disable all traps which are detected within this build).<br/>\n<br/>\n But what's the point in a build like this anyway?  There's not even Skill Mastery to do the disabling during combat (i.e penalize the skill by 1-19 points).  The lofty disable values only have merit in PvP  (no environments I have ever played have added any more than 10-20 points to default disable DCs for epics. never.) so if this build focuses on dueling another trapper (which is the only reason you'd be encountering DCs higher than Epic 58's in the first place) you'll need to be disabling them faster than he can set them and that won't happen.  Since this \"godly\" trapsmith will have lame trapsetting skill and DC, its pedestrian AC rating will fall quickly to range attacks by a vastly-superior DEX-focused Epic Dodge archer trapsetter.<br/>\n<br/>\n Yes. MrZork distilled it down in his first statement:  \"Smartest cleric\" around.  Just not one that has much common sense when it comes to dealing with traps.   Sense would have been easy to acquire, too.  Just set up a custom module with graduated custom trap DCs and test and test and test some more.<br/>\n<br/>\n<br/>\n<br/>\n  </div>"
    }
  ]
}