{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "204",
  "name": "ECB Party Play",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ecb-party-play-t2354667.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": "17",
  "views": "789",
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:35 PM - Feb 24, 2017",
      "content": "<div>Hail, mighty guildsmates!<br/>\n<br/>\n So, recently, I've been thinking about the repercussion of some of our posts in people's NWN play over the years. I was skimming through the WoG forums, and I found a post by Campgod saying how he got to the forums by searching for builds by GDL and myself. Then he found his way here and we interacted a lot. There was also another newer player on WoG who found the server through the ECB and was playing my Demolition Man build, then another one who I met in-game and was playing a variant of Valerfor's Iron Fist build.<br/>\n<br/>\n However, in all these years as a member of this guild, one thing has always bugged me. I've known some of you guys for so long, discussed hundreds of builds with you, but we've never actually played together! I've only played this game alongside 4 of our members: Valerfor, BlackCobra, Conlaoch and HipRedux. Don't you guys find this odd? I would love to play alongside one of Mick's Assassins (as long as his blade is pointed at the enemy LOL), or TyrTemplar's renowned meleers, and see how much progress Stagmeister has made since his OC days (or are you still playing that crap? LOL) the same was I was able to see one of HipRedux's resourceful Rogue builds in action about 5 years after we met in the old ECB :D. It was long overdue!<br/>\n<br/>\n So I feel like this is an anomaly that needs to be rectified. I formally invite all ECB members who are still around, both older and newer members, for a live session of play. I would prefer it if we played on WoG, as I love that server, and I think it's as balanced as a server can be, but I'm actually open to play anywhere, even SP modules hosted by one of you guys (my internet connection is crap, so I can't do it). Anyone is welcome to join. If you're a newer player, you can pick up a trick or two along the way :D.<br/>\n<br/>\n What say you, fearless adventurers?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:56 PM - Feb 24, 2017",
      "content": "<div>Hi Max,<br/>\n<br/>\n A splendid idea - and thanks for the invite! I have a few RL issues at the moment, but will be more than pleased to join you when they're resolved.<br/>\n<br/>\n As to my \"OC days\", cheek! Actually, I got somewhat obsessed with Aielund over the course of the last year - in fact, I hijacked your Aielund thread in the Modules forum to raise issues and discussions about it. Hope you don't mind.<br/>\n<br/>\n By and large I remain a knuckle-running melee man with a proclivity for monks and CoTs, but have been experimenting with ranged attacks (Wulgar - one of Hip's builds), assassins (Kama Shinobi - one of Mick's), and even clerics (in that instance, not especially well. Managed the singular honour of ballsing-up playing Mith's Blood and Faith. But I'll be trying it again soon ere long).<br/>\n<br/>\n I do occasionally still pop back to the OC - it's like watching a loved childhood movie again, so why not? And Hip has recently provided us with the restrictions placed upon us by the original 2002 game, which makes it more of a challenge (check it out in the Modules forum, if you like).<br/>\n<br/>\n Anyway, I've started blathering now, so I'll go.<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:25 PM - Feb 24, 2017",
      "content": "<div>I realize this may sound tantamount to heresy considering our new residence was contrived by Kail who was a staunch WoGger with many build recommendations based on that environment and pantheon, but nonetheless...<br/>\n<br/>\nWhen is the last time you've played around with Funky's <strong><a class=\"postlink\" href=\"http://highergroundpoa.proboards.com/\" rel=\"noreferrer\" target=\"_blank\">Higher Ground</a> </strong>PW?  <br/>\n<br/>\nThat's where I usually head these days when not committed to one of our LAN group's outings because it suits my personal situation much better than WoG's current status.  The situation would be shorter sessions, usually with pre-epic builds because it's too hard to arrange for extended periods to get very far into epic.  The server almost never goes down and when it does, there is an upgrade or maintenance announcement a few days in advance and always at least a handful of players around the same level to welcome another partymate.  ATM I keep about 4 toons of various levels ready for participation but am always willing to start a new one when the need arises (those low level builds can really pile up if you let them!).  <br/>\n<br/>\nBasically, I like to be able to log for a few hours once in a blue moon and have some party fun.  Solo play I reserve for SP modules only which is really not Dungeons and Dragons gaming (no DM man!) so the immersion is based on RPG value rather than my true interest.<br/>\n<br/>\nJust a thought...</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:38 AM - Feb 25, 2017",
      "content": "<div>Sure ot would be great to meet up with you guys in game. <br/>\n My schedule is a bit limited though. My time zone is CET (GMT+1) which differs between 6 and 9 hours from the american zones. I can play from 8pm to 12pm CET some nights. That is late night in Asia and afternoon in America.<br/>\n But let's see what we can do!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:47 PM - Feb 25, 2017",
      "content": "<div><blockquote><div><strong>Stagmeister wrote:</strong><hr/>Hi Max,<br/>\n<br/>\n A splendid idea - and thanks for the invite! I have a few RL issues at the moment, but will be more than pleased to join you when they're resolved.<br/>\n<br/>\n As to my \"OC days\", cheek! Actually, I got somewhat obsessed with Aielund over the course of the last year - in fact, I hijacked your Aielund thread in the Modules forum to raise issues and discussions about it. Hope you don't mind.<br/>\n<br/>\n By and large I remain a knuckle-running melee man with a proclivity for monks and CoTs, but have been experimenting with ranged attacks (Wulgar - one of Hip's builds), assassins (Kama Shinobi - one of Mick's), and even clerics (in that instance, not especially well. Managed the singular honour of ballsing-up playing Mith's Blood and Faith. But I'll be trying it again soon ere long).<br/>\n<br/>\n I do occasionally still pop back to the OC - it's like watching a loved childhood movie again, so why not? And Hip has recently provided us with the restrictions placed upon us by the original 2002 game, which makes it more of a challenge (check it out in the Modules forum, if you like).<br/>\n<br/>\n Anyway, I've started blathering now, so I'll go.<br/>\n<br/>\n Cheers</div></blockquote>\n<div align=\"left\">Hey Stag!<br/>\n Sorry you can't make it. Get to work on those issues ASAP and let us know when you're done. It'd be great to have you along. The offer stands.<br/>\n<blockquote><div>I realize this may sound tantamount to heresy considering our new residence was contrived by Kail who was a staunch WoGger with many build recommendations based on that environment and pantheon, but nonetheless... When is the last time you've played around with Funky's Higher Ground PW? That's where I usually head these days when not committed to one of our LAN group's outings because it suits my personal situation much better than WoG's current status. The situation would be shorter sessions, usually with pre-epic builds because it's too hard to arrange for extended periods to get very far into epic. The server almost never goes down and when it does, there is an upgrade or maintenance announcement a few days in advance and always at least a handful of players around the same level to welcome another partymate. ATM I keep about 4 toons of various levels ready for participation but am always willing to start a new one when the need arises (those low level builds can really pile up if you let them!). Basically, I like to be able to log for a few hours once in a blue moon and have some party fun. Solo play I reserve for SP modules only which is really not Dungeons and Dragons gaming (no DM man!) so the immersion is based on RPG value rather than my true interest. Just a thought...</div></blockquote>\n\n Hey dude. I have never played there, but I went to the website and there seems to be too many custom modifications that I dislike. I didn't have much time to look deeper into this (last minute trip came up, I'm leaving tonight), but I was reading the books of class changes and some of the stuff just looks iffy to say the least (balance-wise). Legendary Levels, SD being immune to death magic and becoming ethereal (WHAT?), PM STR halving bone armor bonus, etc... The server might be nice to play on, with cool quests and all, but I have to be honest to say that I'm not eager to try it out based on what I read. As I said, WoG is my preferred server, firstly because you're familiar with it, which would make the situation somewhat easier, and second because the only major changes that impact gameplay are not done to classes (Most remarkably the upgraded Crafting and Summoning systems). Basically, as far as classes go, they're pretty much the same as vanilla NWN, which provides a solid ground for us to play our builds without fear of finding out that they don't actually work as intended due to some custom implementation. The ONLY custom change that affects classes is Cleric Domain Restriction based on Race, God and Alignment. But, since I'll be the Cleric, that won't be an issue LOL.<br/>\n<br/>\n Also, apparently there was a problem with Raine's system and NWN that was making it quite buggy, but it seems to have been resolved. BC and I have been adventuring almost every weekend for at least 2 months and there have been almost no issues. About sessions, WoG has many short quests and some long ones. There's plenty to keep us busy. If you want to level from 1-40 doing only short quests, it may not be possible, as two of the higher epic quests are quite long, but there are two epic bosses who are just around the corner and can be done in a couple of hours as well. And we can make this a regular thing, like every Saturday, for example. The idea is to play a party (we could even do a theme party if you're up for it) of toons that we save up exclusively for that purpose. We could even make a party of \"Favorites\", where we play our favorite ECB builds. Are you up for it?<br/>\n<blockquote><div> Sure ot would be great to meet up with you guys in game. My schedule is a bit limited though. My time zone is CET (GMT+1) which differs between 6 and 9 hours from the american zones. I can play from 8pm to 12pm CET some nights. That is late night in Asia and afternoon in America. But let's see what we can do! </div></blockquote>\n\n I'm terrible with time zones, so let me just say that right now it's 9:41 AM here in Rio de Janeiro (take a look at the time I made this post and you can figure out the difference LOL). I normally have time to play on Saturdays, but not today because of the trip I mentioned above. Does that work for you guys? We could start next Saturday if you guys are available. Saturday afternoon would be perfect for me, evening is fine too. I'm 3-5 hours ahead of US time zones, so something like 5 PM my time might fit everyone's schedule. It'd probably be 6-7 PM Mick's time and like 2 PM Hip's time.<br/>\n<br/>\n What do you guys think?</div></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:30 PM - Feb 25, 2017",
      "content": "<div>Max, you are such a terrible person...<br/>\n Would you make me re-install <em>that </em>game again?! You have no shame...<br/>\n<br/>\n Anyway, it would be cool if each one of us played a character based on his/her \"fame\" as a builder or preference.<br/>\n Say, i would make a kensai, you would play a cleric-man-chicken-of-doom, stag an angry monk with some really hot fists, mick an assassin/ninja (do not exist)/ shinobi, hip a thief/something, you get the idea..</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:24 PM - Feb 25, 2017",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>Max, you are such a terrible person...<br/>\n Would you make me re-install <em>that </em>game again?! You have no shame...<br/>\n<br/>\n Anyway, it would be cool if each one of us played a character based on his/her \"fame\" as a builder or preference.<br/>\n Say, i would make a kensai, you would play a cleric-man-chicken-of-doom, stag an angry monk with some really hot fists, mick an assassin/ninja (do not exist)/ shinobi, hip a thief/something, you get the idea..</div></blockquote>\n<div align=\"left\">*EVILOL*<br/>\n One more falls into the trap!!!!!! Come, FOOLS! You have no idea what I have in store for you! MWAHAHAHAHAAHA!!</div></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:34 PM - Feb 25, 2017",
      "content": "<div>Love it! <img class=\"img-emoji\" src=\"emoji/13.gif\"/> However, the monk slot should, I believe, go to the thus far absent Empyre. I know - I'll be a spellchucker!...Ah. Might put that in the \"worst idea of the year\" bucket. I'd actually be more than happy to be a dwarven doorstop. And yes, that means I did pay some attention to what Max had to say about my DwD/WM concept, as well as learning a lot from mucking around with GDL's Hearth Guard (which I still need to finalize - as a tribute to the Grizzled one).<br/>\n<br/>\n That would also give a nicely rounded 6, which seems to be a D&amp;D magic number. That said, I might be late on parade. Dragging the bags you sprightly lot left behind. But I'll get there.<br/>\n<br/>\n Oh, and I'm at GMT 0. Thus, 3 hours ahead of Max. Maybe 25 bushels lower than Hip, 8.3965 degrees latitude west of Mick (if you take the Piccadilly Line), and the square root of pi on the circumference of Val's aromatherapy candles. Or something like that.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:31 PM - Feb 25, 2017",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>Max, you are such a terrible person...<br/>\n Would you make me re-install <em>that </em>game again?! You have no shame...<br/>\n<br/>\n Anyway, it would be cool if each one of us played a character based on his/her \"fame\" as a builder or preference.<br/>\n Say, i would make a kensai, you would play a cleric-man-chicken-of-doom, stag an angry monk with some really hot fists, mick an assassin/ninja (do not exist)/ shinobi, hip a thief/something, you get the idea..</div></blockquote>\n<div align=\"left\">The only thing I fear with this \"fame\" party is that everything will be too easy. If everyone plays a powerbuilt toon, we will storm through the server at the speed of light! Hell, my Clerics can solo pretty much everything there is on WoG, except maybe Lolth cuz she's too far away, not exactly power-wise. But imagine a team with a best build of each specialist builder playing together. That's onslaught!</div></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:52 PM - Feb 25, 2017",
      "content": "<div>Shouldn't that just get the site architects to up their content? They've clearly had it too easy for too long (says the OC aficionado) and need to earn their corn!<br/>\n<br/>\n On the other hand, it could go the other way around. Mick as Paladin, Hip as a half-orc Barbarian, Val as Druid, Max as Sorceror, Empyre as Wizard/Rogue (I'm only guessing here - you lot have pretty well done them all). And full-on role play, just to make it sting that little bit more.<br/>\n<br/>\n I'm aware that I'm commenting on something I wouldn't be able to join for a while, so have the luxury of taking the piss. Odd, how excitement takes one, isn't it?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:46 AM - Feb 26, 2017",
      "content": "<div>I'm afraid I need to bow out, not to be anti-social, but because I am afraid to commit to being there at a certain time on a regular basis because my schedule is so chaotic.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:12 PM - Feb 26, 2017",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong><hr/>I'm afraid I need to bow out, not to be anti-social, but because I am afraid to commit to being there at a certain time on a regular basis because my schedule is so chaotic.</div></blockquote>\n<div align=\"left\">Hey Empyre! You don't HAVE to be there every session, but if you can join occasionally, it would work well. The only thing that would be hard is if you're gone too long, because there's a 4-level gap rule for parties. So as long as you're within 4 levels of the rest of the group, you should be fine.<br/>\n<br/>\n @Stag<br/>\n<br/>\n Dude, the server is hard, but we are ECB elite, so we are more than up to the challenge. These days I played with a newer player who made a toon on WoG. He died SO MANY TIMES and even caused me to die a couple of times. If you don't know a lot about the game, WoG is BRUTAL. The bosses there are insanely well-built, and if you play like you do in the OC you might not even make it past the first encounter. I remember some of the HotU battles, where I ran into the hordes of evil with my summoned Air Elemental and came out unscathed. LOL. It's not even the same game.</div></div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "11:52 PM - Feb 26, 2017",
      "content": "<div>And Stag, if you do go the caster route, make sure you remember that WoG is full PvP.<br/>\n<br/>\n Gotta be careful where you drop those fireballs !</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:07 PM - Mar 05, 2017",
      "content": "<div>So, have you guys given up on the idea? C'mon, guys! Let's not let it die!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:56 PM - Mar 05, 2017",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><hr/>So, have you guys given up on the idea? C'mon, guys! Let's not let it die!</div></blockquote>\n<div align=\"left\">Oh, boo, hiss! I was looking forward to logging on and hearing of your collective exploits! Shame <img class=\"img-emoji\" src=\"emoji/2.gif\"/></div></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "4:54 AM - May 20, 2017",
      "content": "<div>It would be interesting to hear how you all make out as a full-on party going 1st to 40th on WoG.  I have to admit, that as someone who has done close to that a few times over the years, I find the idea of a bad-ass gang taking on the place, fairly exciting.   Most of the folks I run with, while much better builders then me by light years, have a sort of laid back play style, we tend to play a much more \"seat of our pants\" style.<br/>\n<br/>\n I'll be looking for you all out there, and will be checking as Stag said to logging in and hearing of your exploits.   <img class=\"img-emoji\" src=\"emoji/1.gif\"/></div>"
    },
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "6:39 AM - Jun 29, 2017",
      "content": "<div>Hey, checking in and seeing if this really took place (or is taking place)?  I got NWN installed again so I might be game if the timing works out. </div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:16 AM - Jul 01, 2017",
      "content": "<div>That would be a good time now, myself i re-installed Neverwinter Nights to show it to a couple of my friends and i don't know what to do with it.<br/>\n Unfortunately though, Max is skipping class again, who knows when he will show up again...</div>"
    }
  ]
}