{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "754",
  "name": "Corellon's Divine Warrior (Bard 24 / AA 15 / Cleric 1)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/corellon-s-divine-warrior-bard-24-aa-15-cleric-1-t2355254.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "4",
  "views": "210",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:59 AM - Dec 05, 2019",
      "content": "<div>This build looks at trying to make an equally effective melee warrior and ranged archer with added divine damage and Bard buffs.<br/>\n<br/>\nHaven't made many major class bards, any suggestions / comments appreciated.<br/>\n<br/>\nI took cleric 1 for divine might cheese. Allowed me to squeeze in more bard levels and undispellable (eventually).  Took domains war for battle mastery and protection for that sanctuary spell thingo. They scale with charisma<br/>\n<br/>\nHalf-elf dodges multiclass penalties but then one has to take weapon proficiency martial to get a weapon focus into shortbow/longbow - so losing a feat.<br/>\n<br/>\nDesigned it for WoG but happy to adjust it for elsewhere too<br/>\n<details><summary>Spoiler</summary>Bard(28), Arcane Archer(11), Cleric(1), Elf\nSTR: 14 (24)\nCON: 12\nINT: 14\n\n01: Bard(1): Point Blank Shot\n03: Bard(3): Weapon Focus: Longbow\n05: Bard(5)\n07: Bard(7)\n09: Arcane Archer(1): Weapon Focus: Scimitar\n11: Bard(10)\n13: Bard(12)\n15: Arcane Archer(3): Improved Critical: Scimitar\n17: Arcane Archer(5)\n19: Arcane Archer(7)\n21: Cleric(1): Divine Might, Domain War, Domain Protection\n23: Bard(14)\n25: Bard(16)\n27: Bard(18): Epic Weapon Focus: Scimitar\n29: Bard(20)\n31: Bard(22)\n33: Bard(24): Great Strength I, (STR=22)\n35: Arcane Archer(10)\n37: Bard(25)\n39: Bard(27): Great Charisma III, (CHA=18)\n\nSkillpoints: 256\nSaving Throw bonuses: Mind Effects: +2\nAB (max, naked): 38 (melee), 38 (ranged)\nSpell Casting: Bard(6)\n\n\n01: Discipline(4), Open Lock(1), Perform(4), Search(1), Taunt(4), Tumble(4), UMD(4), \n03: Discipline(1), Listen(1), Perform(1), Taunt(1), Tumble(1), UMD(1), \n05: Discipline(1), Perform(1), Search(1), Taunt(1), Tumble(1), UMD(1), \n07: Discipline(1), Perform(1), Search(1), Taunt(1), Tumble(1), UMD(1), \n09: Search(1), Save(5), \n11: Discipline(1), Perform(1), Taunt(1), Tumble(1), UMD(1), Save(1), \n13: Discipline(1), Listen(1), Perform(1), Taunt(1), Tumble(1), UMD(1), \n15: Listen(1), Save(5), \n17: Save(17), \n19: Save(29), \n21: Save(39), \n23: Discipline(1), Listen(2), Perform(1), Taunt(1), UMD(1), \n25: Discipline(1), Listen(3), Perform(1), Taunt(1), \n27: Discipline(1), Perform(1), Taunt(1), Tumble(5), \n29: Discipline(1), Listen(3), Perform(1), Taunt(1), \n31: Discipline(1), Listen(1), Perform(1), Taunt(1), Save(2), \n33: Discipline(1), Listen(3), Perform(1), Taunt(1), \n35: Listen(1), Save(5), \n37: Discipline(4), Perform(4), Taunt(4), Tumble(5), \n39: Discipline(1), Listen(1), Perform(1), Search(1), Taunt(1), </details>\n<strong>Edit 6/11/19:</strong> posted a small update to increase bard levels, including Bard 12 / AA 8 pre-epic split. Ending AB is 38 both melee and ranged which should be satisfactory in theory with curse song, bard song and taunt. Ending Cha of 18 when capped will get to 30, allowing a 10 round DM to boost damage output. Nice to do piercing (bow), slashing (scimitar), bludgeoning (from the song), fire (from flame weapon), divine (from divine might) from attacks :)</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "2:11 PM - Dec 05, 2019",
      "content": "<div>Looks nice Orion.. I havent played any high level bards, but they are casters.<br/>\n<br/>\nI'd drop one of the Improved Crits and pick up Craft Wand.   Cant have too many Endurance's in your pocket...<br/>\n<br/>\n\"Is that a Wand in your pocket, or are you just glad to see me.....\"<br/>\n<br/>\nWith 50 charges my dear... its going to be way longer then 4 hours....</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:51 PM - Dec 05, 2019",
      "content": "<div>Bard, Cleric and Arcane Archer are all power classes. It is interesting to see how much one can squeeze out of an over-stretched build. <br/>\nAA gives a reasonable ranged AB with a low dexterity. AA also boosts BAB so the naked mele AB becomes good for a support character. The build is feat starved and you offer yourself the luxury of both a ranged and melee focus, meaning you have to take important pre epic feats in epic levels.<br/>\nTaking 20% xp penalty from level 21 and spending 4 feats (PA, DM, 2x GCha) for a Divine might with a base charisma of 18 is extravagant. Ok Cleric also gives you AP Heavy, so the cost is maybe only 3 feats and the xp penalty.<br/>\nI would like to see IKD and AS here, and Craft wand for the WoG experience.<br/>\nEven with 24 caster levels, what makes the build possible is the boost from songs, but it matures late. Martial focus comes late and heavy armor comes later. On top of that you have to focus on archery before you can be any good at it.<br/>\nNarrowing the focus down to two of the three (melee, archery, divine) opens up for much stronger builds that also become much more comfortable to level up.<br/>\nWhat I try to do here is to measure the build up to ECB standards.  But I often play flawed builds myself just for the challenge. This build has several assets. It may be rewarding to find ways to overcome its flaws. And doing that can improve our player skills.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:36 PM - Dec 05, 2019",
      "content": "<div>Thanks Mick for having a critical look at the build<br/>\nI was pretty tired after my long drive and didn't write many explanatory notes<br/>\n<br/>\nThis build I am very much trying to push these power classes to the limit, by making a build effective in all four domains (melee, ranged, spell casting/other class abilities/divine damage, skills), kind of like an 'ultra hybrid' type build, without the expectation of being a master of any. If I did limit myself to two as you suggest (ie ranged / divine I suspect would be the strongest) it would make the build easier and open up other feats like rapid shot, knockdown/improved knockdown, extend spell/craft wand etc, but then I guess I would lose the original vision with the build<br/>\n <br/>\nOne of the things I'm trying to make such a 'tetra-hybrid' work is the Bardic power<br/>\nWith curse song and taunt, this build can decrease AC to opponents by 11, creating an effective +11 to base AB. Even curse song alone is powerful with -5 to AC. An Base AB of 39 looks ok for a largely non full BAB build, but when boosted to 44 - 50 with those two abilities it looks fantastic.<br/>\n<br/>\nWith such a powerful effective AB boost I added divine damage to 'strengthen' the build further by adding extra damage to both melee and ranged<br/>\nMy lack of playing major bard class characters is showing here however, and perhaps I should invest more in Bard earlier and try to get the Curse song a bit faster than I do.<br/>\n<br/>\nI believe the build is better served by going one handed and shield rather than greatsword.<br/>\nWith elf there would be longsword or rapier to choose from, right from level 1, and the shield will be very valuable early on with the limitation to medium armor until level 21. In addition there will be bard spells for summon creature / bulls strength etc.<br/>\nI should consider increasing the starting dexterity to 16 to increase ranged prowess right from the beginning. To achieve this I would have to drop my starting str to 14 and cha to 14. I could potentially drop epic weapon focus: longbow and take bard levels earlier to strengthen the bard song faster<br/>\nOnce arcane archer is obtained, for ultimate late game power I would choose scimitar for the crit range and the ability to 'keen weapon' it with the bard spells, although a Keen rapier would do the same thing<br/>\n<br/>\nAnyway I will take some time to work on a second draft and edit it into the main post to reduce thread spam<br/>\nThanks again for your comments Mick, also to Conaloach for your witty comments, it is funny but I can't upvote it in case there are kids reading our thread</div>"
    },
    {
      "author": "ratty_uk2011",
      "avatar": "no_avatar.png",
      "timestamp": "12:21 PM - Dec 06, 2019",
      "content": "<div>I’d go the scimitar route myself since it gives you slashing damage option instead of two piercing weapons<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    }
  ]
}