{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "000",
  "name": "Rules for Epic Build Posts",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/rules-for-epic-build-posts-t2355887.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "0",
  "views": "1.7K",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:03 PM - Jan 01, 2022",
      "content": "<div>Hello Everyone.<br/>\n<br/>\nNow we've been going for ten years, and have a lot of newer Guild members, we thought it would be helpful to post the rules for posting builds in this full epic forum here as well as having them reside in the Rules and Tools section. <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/character-builds-posting-rules-t515321.html\" rel=\"noreferrer\" target=\"_blank\">Build Posting Rules</a>.<br/>\n<br/>\nSome things are more malleable these days, and some are redundant (Hip's helpful advice on linking to referencing builds being one). We're working on this, and looking to update our build archive as well, though we could do with a little technical help in updating <em class=\"mention\">@DoesntPlayAnymore</em> 's 2018 upgrade.<br/>\n<br/>\nHowever, the core elements hold true. The build must be <strong>legal.</strong> It must be a <strong>complete and tested </strong>build (the CBC is <em>not</em> a trainer module, btw). It should <strong>follow the Levelling/Skills templates </strong>(yes, both are required). It must have an original title (enabling any build search to work), and be <strong>an original build</strong>. This does not mean it must not share the same classes or even levels of them as earlier builds, but it does mean it must be easily discernible from those builds. This should be evidenced in the build description when referencing other builds.<br/>\n<br/>\nAs Kail says, \"Keep present that if all of the above points are not followed, the thread will be moved to the Build Request Forum, locked or edited so as to be in line with the rules.\" And please remember, the builds in this section are for others to use - new or experienced - so must be demonstrably robust and defensible by you, its author, lest the entire Guild lose its credibility. We have a responsibility, good people!<br/>\n<br/>\nFinally, I know you don't have to be reminded, but I'm doing it anyway...<strong>Everyone is expected to be aware of and observe these rules</strong>.<br/>\n<br/>\nThanks all.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    }
  ],
  "author-color": "#AA0000",
  "pinned": true
}