{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "030",
  "name": "Two friends party",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/two-friends-party-t2354764.html",
  "author": "Fatnoob",
  "avatar": "10235447_1565972826.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Fatnoob",
      "avatar": "no_avatar.png",
      "timestamp": "3:43 PM - Oct 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello. 9 years ago me and my friend played NWN Three Towns Server and we are a but more about powergaming. <br/>\nWe didn't came so far so we are still actually fresh to the game. <br/>\nWe request a good setup so we can do fine  in a 2 man party. <br/>\nI think of a fighter which is able to take damage and heal and a another class for my friend which makes more damage and are able to buff and cast spells. But it can be a melee too, a a Monk? <br/>\n<br/>\nTo be honest we are open for any suggestions!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:19 PM - Oct 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Is this for a LAN party over some modules like Aielund Saga or for a team for PW's and if the later which one?<br/>\n<br/>\nIt will help if we knew the environment you are gonna play (low/ mid/ high magic, etc).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Fatnoob",
      "avatar": "no_avatar.png",
      "timestamp": "5:23 AM - Oct 24, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">We are gonna play until lvl 40 epic. Its online on the server Three Towns.  Three Towns is a custom made module and its made for powergaming. <br/>\nNo rules for builds and magic. Thank you for your time.<br/>\nGreetings from Oscar.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:34 AM - Oct 24, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Alright Oscar, based on the little you have told me,<br/>\n<br/>\nOne of the most successful characters and relatively easy to level is a (FTR/ BARD/ RDD), very solid warrior with huge strength, lots of combat feats, several immunities and high AC. If the server supports Devastating Critical then you can have that too with a powerful DC for it, as well. There are simply no downsides with this build, except if you count the ugly wings on your back (especially if you are a Dwarf, ugh). A fine companion for that character (and for any melee toon as well), would be a Sorcerer or an Arcane Archer that \"shoots\" spells or arrows with deadly precision behind him and in the case of Sorcerer, buff him/her as well. A Cleric would be fine too. <br/>\n<br/>\nAnother possibility and if you want something more \"classic\" would be a Dwarven Defender coupled with one of the above \"support\" classes. If your server has several tough traps &amp; locks then you might consider a Rogue/ Fighter/ Shadowdancer as well for support with UMD to cover any missing buffs if scrolls available.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}