{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "351",
  "name": "I need a build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/i-need-a-build-t2349806.html",
  "author": "Sycostick",
  "avatar": "no_avatar.png",
  "replies": "4",
  "views": "371",
  "posts": [
    {
      "author": "Sycostick",
      "avatar": "no_avatar.png",
      "timestamp": "6:39 PM - Feb 09, 2014",
      "content": "<div>I had took one years ago and made it my own... I dont remember all the skill and prereqs and the sort so I need help.<br/>\nCan someone make me a Rogue/assassin/ Shadowdancer<br/>\nBut I want ranged, so probably best to be elf. I remember being a paid assassin on a rp server and would stalk targets, being able to one shot them.<br/>\nIve spent the last few hours trying to create one, but its not doing what I want.. Its just been way to long since Ive played to remember all the feats and how everything works lol.<br/>\nDefinitely longbow, I remember having more assassin then anything, but the build at the time might not have been as good as it could have been.<br/>\nAlso wouldnt mind some pickpocket, but if that ruins the overall build its not a biggy.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:44 PM - Feb 09, 2014",
      "content": "<div>Show us your build, then perhaps we can help you make it work. More assassin than the other classes sounds right.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:03 AM - Feb 10, 2014",
      "content": "<div>I don't mind building it for you, but I need more to go on than just the classes. For starters, is it lvl 40? If not, what is it?<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/tiny-reaper-rogue-13-shadowdancer-1-assassin-26-t515504.html\" rel=\"noreferrer\" target=\"_blank\">The Tiny Reaper</a><br/>\n<br/>\nYou could also use Grim's build as a basis and just change the melee combat feats for ranged combat feats. Be mindful that Dodge and Mobility are requirements for SD so you have to keep those.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:14 AM - Feb 10, 2014",
      "content": "<div>If you'd like, I could post a Rogue 16 / Wizard 2 / Arcane Archer 22 I played. I know that it's not the classes you asked for, but it's a pretty good archer, and the Rogue skills can be tweaked to fit your style. Another idea would be Bard / Assassin / AA.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Sycostick",
      "avatar": "no_avatar.png",
      "timestamp": "1:17 AM - Feb 10, 2014",
      "content": "<div>actually that tiny reaper build looks cool, and should be easy enough to switch out feats for longbow. Thanks alot guys. It will be awhile before I get up to see some real damage on the server im playing on. Especially now that im in jail for 2 RL days lmao. But Im going to go for it and let you all know. I have to tweak alittle bit for sub race and server rule set but should work out good.</div>"
    }
  ]
}