{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "121",
  "name": "How \"where you play\" impacts \"how you build\" - a reflection on build choices for different environments",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/how-where-you-play-impacts-how-you-build-a-reflect-t2355537.html",
  "author": "Maximillian_Kane",
  "avatar": "10758866_1605883460.jpg",
  "replies": "3",
  "views": "704",
  "posts": [
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "10:44 PM - Aug 14, 2020",
      "content": "<div>Hail, mighty ECBers!<br/>\n<br/>\nSo, after a very long time away from the game, I've started playing Single Player modules again, because my connection is too crappy for me to have any fun online. If you remember the start of the LOTR first book, Bilbo Baggins named his book of adventures \"There and back again\". This name would be very appropriate for this post, as it's exactly how I feel about NwN. I started with the OC, then SoU, then HotU, then Aielund, then a Brazilian PW with serious balance issues, then WoG, with a little SoF and Diablo LoT inbetween, and now I'm back where I started, playing SoU for the 100th time. I plan to try out the MTS module using my Valen Shadowbreath build. We'll see how that plays out when we get there. <br/>\n<br/>\nFor now, I started thinking about how I learned how to build, with the help of ECB elders back in the day, who put up with my \"active learning\" process, and had the patience to endure it without bickering with me because I wasn't ready to take in their advice. Then how I went to play on the Brazilian PW, where I instantly became a \"celebrity\" when my comrades saw my ECB-knowledge-level builds solo every area that they were having trouble with. I must say they were mostly playing pure yardstick builds, so it really wasn't that difficult. They started asking me for build advice, and to make builds for them. At that time, I had an OK knowledge of the game to make some types of builds, and I kind of knew what builds would excel there just based on what I knew about the server, the magic level and available items. It was a very imbalanced server, with loads of immunities and where many spells didn't work properly. Building for that environment was easy, and knowing what builds would do well was even easier. <br/>\n<br/>\nFinally, I found the server that changed my entire experience in the game, not just because it's a great server, but also because it's hard and balanced at the same time. World of Greyhawk. When I say it's balanced, I'm not saying it from a subjective opinionated standpoint, but from a point of objective criteria. WoG is the only server I've ever played on where you can play a HOST of different builds, each associated with a different playstyle, and be able to succeed.  Just to be clear, I'm not saying it's the only one out there, but it is the only one I've played in. Ok, maybe there's one type of playstyle that you can't play on WoG, and that's a damage-dealing spellcaster, throwing Fireballs, Lightning Bolts and Meteor Swarms at the enemies. Monsters there have way too much HP for you to be able to kill things with spells. You can kill any ONE monster with spells, but you'd need to use your whole spellbook every encounter, even against basic mobs. <br/>\n<br/>\nAnd now, after a couple of years away from the game, I'm back playing SoU. And amazingly enough, I'm still having fun! But, it's inevitable to notice the difference in \"CR\" from playing on a PW like WoG and playing this module again. Also, it has made me realize how this difference affects your building priorities. And for the purposes of this thread, I'd like to point out why balancing is such a HUGE issue in this game. I'm not considering my personal opinion on balance, though, it's just an objective analysis of my experience in playing these different settings.<br/>\n<br/>\nFirst and foremost, what feats do you choose when you play in an environment where mobs can hit you sometimes in the early levels, but then later on they just miss unless they roll really high? Also, what feats will you prioritize if you can 1-or-2-shot almost all mobs? Well, for starters, Cleave is wondrous, because you find yourself surrounded on a regular basis, and having an extra attack every round is the best thing you could ask for, right? How about we take it a step further? Great Cleave! OH - MY - GOD! You walk in, get surrounded, the first killshot triggers the first GC, and then it becomes a chain reaction. 2 rounds later, a pile of corpses surrounds you. I remember when I was playing only SP and learning how to build, ALL my Fighters used to get Cleave at level 1, and Great Cleave ASAP just because it was so useful! And I know it looks like I'm being ironic, but I swear I'm not! If you're playing the OC, SoU and HotU, these are CLEARLY some of the best feats you can take, just because they'll get maximum value. I still remember that battle in Cania (in HotU) where you face a Swarm of Devils (or Demons). They just dropped like flies with my +10 Bastard Sword infused with a shitload of bonus damage by Rizolvir. <br/>\n<br/>\nSimilarly, I didn't understand back then why people liked Expertise so much. Why would you want to lose AB to gain AC when they only hit you on 20s? That didn't make any sense to me at all. I only took it on WM builds because it was a requirement. Otherwise, I never bothered with it. Knockdown also didn't make much sense, because most of the times the monsters wouldn't live long enough for me to reap the benefits of KDing anything. So, even though I took these feats, mostly just because people in the ECB seemed to think they were good, and because I had the feats to spare, I didn't actually get to use them much in game. I didn't really understand the value they could potentially have. When I started playing in Aielund, that changed a little bit, because I started needing the defensive boost from Expertise, and KDing some mages before they were able to get their first spell off was the only was to get past some encounters. <br/>\n<br/>\nSo, for fighter-types at least, I think the conclusion is that the easier the setting, the more valuable feats like Cleave and Great Cleave, Improved Critical, etc... become. Inversely, the more challenging the environment, the more you'll need to have \"tools\" in your tool belt at your disposal to overcome the challenge. Then Expertise, KD, and even Disarm become more valuable. <br/>\n<br/>\nThe same goes for skills like Taunt. Why waste a turn taunting if you can reliably hit your target on all but natural 1s? However, the effect of Taunt when the enemy AC is more competitive has the potential to be immense! It's hard to justify investing 43 skill points into Taunt if you really won't need it. That opens up room for you to invest on social skills like Persuade or Intimidate, or on utility skills like Lore or Heal, which WILL be more useful on easier settings. Wouldn't you rather heal 15 more hit points with every healing kit, or be able to ID those items instead of having to pay for it at the shop than be able to lower the AC of enemies that you can hit anyway? OF COURSE! Same goes for skills like Listen or Spot. If nobody hides in the whole module, why would you even consider spending points on them? Or stealth skills if everyone has True Seeing? If you can bash ALL doors, and chests with no penalty, why invest in Open Locks?<br/>\n<br/>\nThat leads to another interesting conclusion. The more \"complete\" a module is, the more value not only skills have, but also classes that grant a lot of skill points per level become. If every skill is useful, then you WILL know first hand the meaning of tradeoff. That is one thing that WoG does brilliantly. If you bash a chest, there's a chance the contents will be damaged and you won't get the full reward (or sometimes you'll get no reward at all). There are unbashable, unopenable with Knock spell doors scattered throughout the server, where it makes sense they would be, and the Find Traps spell just FINDS the traps, it doesn't DISABLE them, so Disable Traps becomes very valuable too. <br/>\n<br/>\nI guess the main conclusion I've reached so far is that as members of the ECB guild, we should strive to have a diverse experience, and shouldn't be content to just play where it's easy, no matter how good the story is. It's this diversity of experience that will make us truly EPIC character builders! Thoughts? Comments?<br/>\n<br/>\nCheers!</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:39 AM - Aug 15, 2020",
      "content": "<div>Hey Max - thanks for this!<br/>\n<br/>\nI will, of course, have comments (you'd expect no less from me I'm sure), but am out of time currently - maybe tomorrow, my friend.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:07 AM - Aug 15, 2020",
      "content": "<div>I personally find that a beefy Fighter type almost always benefits from Cleave/Great Cleave, even where m0bs have high hps and DR.<br/>\n<br/>\nEspecially at lower levels, but also at higher ones.<br/>\n<br/>\nOne thing I have noticed, is when KD immune stuff is present, I personally tend to skimp on Disc - especially with Fisters (Monk).  On WoG, there is Disarm, but it is not all that prevalent (but it is there, so...).  I find on WoG, that having Concentration is much more important due to the fact that everyone and their mother will Taunt you if you do not.  This was pretty much a first for me, for in most Mods and PWs, m0bs rarely Taunt.  Discipline I find one can do without if one has a really high AC.<br/>\n<br/>\nCrit Immune and DR + Regen is an incredible bulwark against damage.  In most Mods, I never really had to worry about it - most of the time, one gets 3 Greater Belts of each kind and one is good to go.  But WoG has some really hard hitting critters, and for the level high ABs, so getting critted really hurts!  If one is Crit Immune, packing some DR and Regen really makes things much easier imo.<br/>\n<br/>\nDue to fail on a 1, I have come to be a very wary saving thrower.  It is inevitable (and all too often at the first save) that I roll a 1.  And I have even documented this, time after time.  It must just be my really bad luck.  So I am a great believer in Immunities.  No save needed, no chance for failure.<br/>\n<br/>\nDue to WoG, I have found out that ED is incredibly OP.  Rolled a 20?  Still missed, you luckless bastard!  Due to my luck, I often get 20ed multiple times in a row - and I have documented this as well.  I believe my record was 6 20s rolled against me in a row, followed by 5 20s afterwards.  So anything that can cut those down, is a godsend.<br/>\n<br/>\nI now have a hard time playing most SP Mods - they are just too easy.  Not meaning I am a great player, it is just that WoG has a very demanding environment for a solo player (which I am most of the time).<br/>\n<br/>\nI used to play Wizards, and only Wizards.  And I will admit, I still love Wizards.<br/>\n<br/>\nBut since WoG, I have become addicted to Monks.  SR Monks that can just zip along to anywhere in a fraction of the time anybody else can?  Yeah, that is my thing.  The speed is mindboggling, and I cannot really play a \"slower\" character afterwards without trying to \"urge\" it along.  It is like it is in a pool of sticky molasses.<br/>\n<br/>\nWoG got me to finally break a long standing taboo of mine and I finally started to play Bards.  I have never really liked Bards, but I was very surprised at how ungodly OP they are.  They bascially rip WoG up at their leisure.  Sing (and with LI it becomes somewhat mega-broken), then Sing again for any party/summons to get that sweet boost for them from your first Song, then Curse your enemies so they become discombobulated, and then to add insult to injury, Taunt them as they are already weakened skill wise to add further misery!<br/>\n<br/>\nMadness.<br/>\n<br/>\nDoing this tactic in a SP Mod just...I mean, it is OP.  And there is little that I have seen done to prevent this set of tactics.<br/>\n<br/>\nSo in retrospect, I am not sure that WoG is really balanced.  It is just that the work done on the mod prevents the normal type of tactics from dominating to an extreme, like it often does elsewhere.  I would say that a lot of balancing work has been done to make the playing field more level, and that the balancing was done by some very knowledgeable individuals.<br/>\n<br/>\nThat said, I am not really sure it is possible to balance NWN, especially on a PW, and still be fun.  All these years, and I think WoG is the closest anyone has come yet.  So there is that.  There are some very clever and sly mechanics and nerfs used, that on the surface look like advantages to the Players, but are not (the crafting system, for example). <br/>\n<br/>\nAnyway, I really do think that Environment impacts how one builds.  Dirtnapping, certain items only obtainable by defeating opponent X, etc certainly are motivators to find ways to avoid/obtain such things.  Which invariably leads to builds that can accomplish this.<br/>\n<br/>\nStill, it always nags me a bit.  There seems to be building blocks of feats, skills, etc that are \"necessary\" for any build to really thrive.  Things like AB, AC, DR, and feats and skills that help keep those things up and viable.  Uncanny Dodge, Evasion, and just things like that that seem to be a sort of \"glue\" that can really make a big difference in how the build performs.  I've recently done some Devastating Critical builds, and unless one really has a build that has a high AB, it just seems that there is a lot of investment for little return.  And for that investment, one looses alot on the way in terms of that \"glue\" that I have mentioned.  <br/>\n<br/>\nI guess in an environment where things are easy to hit with a relatively low AB, it is of little consequence.  But in an environment like WoG, Dev Crit seems to be a niche thing to me - only really viable/useful for a high AB character (one that not only can generate lots of crit threats, but generate a high enough DC to actually be a serious threat).  And even then, when the crit threat is taken away by crit immunes, what is left?  One will really need that high AB to be successful, and then there is the whole defense thing to consider when one can't quickly remove the threat with a successful Dev Crit.  At least, this seems to be my experiences with different Dev Crit builds (both melee and ranged).<br/>\n<br/>\nThis is a pretty cool topic, imo.  I am interested in what others will post here.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:16 PM - Aug 15, 2020",
      "content": "<div>Hi Max and Web<br/>\n<br/>\nI think you both have covered this really comprehensively, I have found I have very little to add, except it reminded me of some screenshots I took in a very challenging but fun run that I did with a high level fighter/bard/palemaster (similar to GDL's Charnel Lord, played by Aquarius), high level druid/monk/CoT (similar to Max's Champion of the Wilderness, played by TheSquid) and a high level sorceress (similar to cdaulepp's Exalted Sorceress, except with divine shield/animal domain-&gt; Ehlonna's Arch-Magus, played by me)<br/>\n<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202008/10759084_c50a806b21a66692a0ed13db3a52e964_t.jpg\"/><br/>\nThere is so much going on in this screenshot. <br/>\nThree Epic Spells - Dragon Shape, Epic Warding and Mummy Dust. <br/>\nLevel 9 spells of Storm of Vengance, Wail of the Banshee, two Summon IXs<br/>\nThere is also two greases, Bigby's 7, improved invisibility and barkskin, create undead<br/>\nAll these drow are spell resistant (SR 11 + Character level according to the wiki), so the spells we used as players will thankfully penetrate but without our near pure caster builds I am guessing this fight would be a serious struggle. (and hence my near pure caster bias, if I am facing a level 40 drow with SR 51, if my main role is to be a spell caster I want lots of caster levels for penetration, a different topic, but evidence the environment I play in changes how I build)<br/>\n<br/>\nThis is a very challenging fight of course but without the challenge factor, there would be no need for the players (and NPCs) to use some of the most powerful builds conceived by the ECB in a party and all these amazing abilities.<br/>\nAs pointed out, an appropriately balanced challenging module uses as many features available to players out of necessity and it creates a very rich experience<br/>\nI never used Set Trap, for example, until I played WoG, (via the Bioware Campaigns-&gt;Aielund-&gt;WoG route, a little similar to Max).<br/>\nI also could have used a few more AoE spells such as spam a few more darkness spells (I did initially but they got dispelled), maybe put an Evards on that Bigby'ed Drow Priestess but that is again evidence the challenging environment encourages learning and more diverse ideas<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202008/10759084_39efc984de0049f8e8482f606c2f374a_t.jpg\"/><br/>\n<br/>\nThis is a bonus one. I love the explosions. Can you guess the spells for fun? The answers are in the spoiler box.<br/>\n<br/>\n<details><summary>Spoiler</summary>SoV, Wail of the Banshee, Firestorm, Stonehold, Grease, Barkskin/Improved Invisibility/Ultravision.</details>\n\nAgain without the challenge and balance we don't get this awesome experience, everything just dies without needing to do a lot<br/>\nBut with the challenge and balance to the module it becomes great fun<br/>\nWith all the druid disables by the way, I would have loved to be a rogue with lots of sneak attack in this shot that is my thought looking at it again</div>"
    }
  ],
  "author-color": "#00AA00"
}