{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "758",
  "name": "Grandmaster of the Darksteel Fist",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/grandmaster-of-the-darksteel-fist-t2355249.html",
  "author": "webshaman1",
  "avatar": "10759110_1577099721.jpg",
  "replies": "3",
  "views": "150",
  "posts": [
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:19 PM - Nov 30, 2019",
      "content": "<div>Grandmaster of the Darksteel Fist<br/>\n<br/>\nDarksteel - has the unique property of absorbing all magical energy.<br/>\n<br/>\nHe had always known that he was different.  Born into a poor family, already hopelessly overwhelmed with mouths to feed, his first memory was a reminder of this - as he was torn from suckling at his mother's teat, to only taste watered gruel from then on.  That he survived his early childhood was a wonder.  Sickly, scrawny, his nose always running, his belly distended from the starvation, only his eyes showed his difference.  Burning with an inner fire that would not be denied.<br/>\n<br/>\nAt 3 he was tested, as was the custom in his tribe, by the village Eldars.  They recoiled in fear and loathing at what they discovered, and pronounced the child Cursed.  It was not long thereafter that he was sold to Slavers, for a pence.  It was better than death, thought the Eldars.<br/>\n<br/>\nThey would be proved wrong.<br/>\n<br/>\nHis life as a sex slave was brutal, and without compassion.  He was a thing to be used, in any way or fashion, and then forgotten.  He could not recall all the faces, leering, sweating, swearing...it was a blur, those early memories.  They got stuffed down deep...deep, into that crevice that would later spawn The Beast.  But that was later...<br/>\n<br/>\nHe was passed from Owner to Owner, as they got tired of their new toy.  Or perhaps it was the Curse, that caused this.<br/>\n<br/>\nOnly the cruel Gods knew, and they laughed at his railments against his inescapable Fate.  He stuffed it all down, into a crevice, away from himself, away from his sanity, for surely, he would become some maddened, sickened thing.  In time, it coelesced, and took form, that space.  It became The Beast.<br/>\n<br/>\nHe was 8.  Or so he believed.  He was not sure, never having been schooled, never having access to any type of writings, let alone a calendar.  But time can be measured in seasons, and as they passed into one another, from cold to warm, he marked his life accordingly.  It had been a particularly trying evening, even for his standards.  Still, the Master seemed exhausted from his exertions, and drugs, so he gathered his tattered limbs around himself in a fetal position, rocking back and forth, crooning a sing-song, almost silent scream at the existence that he had, his body burning agony.<br/>\n<br/>\nThe Master did not stir.<br/>\n<br/>\nIn a sort of shock, his attention wandered, his body afire with pain, but he was used to that by now.  But the Master did not move, did not complain, did not NEED.  He noticed, that the Master's body lie motionless.<br/>\n<br/>\nHe knew that curiousity was only a path to pain, and punishment, but something, something deep and dark within him, beckoned him to move closer.  <br/>\n<br/>\n\"Look\", it whispered caressingly, \"the Master moves not.  Find out why\".<br/>\n<br/>\nHe ignored the promptings, having heard such much of his life.  He knew it only led to more pain.  But this time, the promptings became more persistent, more...pressing.<br/>\n<br/>\nSighing, ignoring the agony that movement caused in his young, tattered body, he moved slowly, silently to the Master's body.<br/>\n<br/>\nIt was still.  Deathly so.<br/>\n<br/>\nThe voice from within laughed.  The whispering became insistent, more powerful.  Hypnotic. It crooned.<br/>\n<br/>\n\"Search the Master!\", it demanded.<br/>\n<br/>\nHe complied, finding a key that he knew would unlock his shackles, and various coins, and a few gems.<br/>\n<br/>\nHe stuck them in his thin shift, which he gathered around him, and fled, into the night, the way free.<br/>\n<br/>\nSweet, fresh air!  The night caressed his skin, and his senses never felt so alive!  Exhilerated, the very thought of freedom was like an elixir.  His euphorium did not last long, for he was as a babe to the ways of the streets.<br/>\n<br/>\nThose who prey upon others know easy prey when they see it.  Licking thick lips, some destitute men, hard times bonding them together, spied him.  In an instant they were upon him, fist and boot quickly extinguishing any resistence.  They left his broken and torn body in the gutter, food for the rats, gutteral laughs at his cries, grunts, and exclamations of glee at the found wealth.<br/>\n<br/>\nThey soon fell to infighting among themselves, him forgotten.<br/>\n<br/>\nHe remembered cold.  Numbing, chilling to the bone, cold.  Beyond shiver, beyond breath, beyond life.  All consuming, he succumbed.  But The Beast was not done, not yet.<br/>\n<br/>\n\"Get UP!  Crawl, wurm!  CRAWL!\", it left no room for discussion.<br/>\n<br/>\nHe complied.  Why not?  It did not matter, anymore.<br/>\n<br/>\nStones, then some sort of wood met his exertions.  He remembered no more.<br/>\n<br/>\nHe awoke to coarse fibres scraping against his flesh.  He was no longer cold, and he hugged those rugged blankets to his boney frame, the minimal warmth like a susbstaining ember, binding him to life.<br/>\n<br/>\nHe was too weary for tears, for any emotion whatsoever.<br/>\n<br/>\nThe Man with the Strange Face sat on his bed. His face had no memorable marks, nothing remarkable about it at all.  Totally mundane.  Forgettable, it seemed to slide from memory.<br/>\n<br/>\nHe turned his attention to his bed.<br/>\n<br/>\nIt was an old, wooden sty, filled with old, rotten straw and covered in a roughly sewn patchwork blanket, that was little more than pieces of discarded, rotten cloth, sacks, and whatnot, that bed.  But it was better than a stone floor.<br/>\n<br/>\n\"Eat\", said the Man with a Strange Face, in a flat, emotionless voice.  A watery gruel of some tasteless germ was spooned into his mouth.  He swallowed it down, like it was ambrosia.<br/>\n<br/>\n\"Tomorrow, begins your training.  It will be hard.  Prepare yourself, if you are to survive\", came that flat voice.  It carried no amount of care, or hope, nor human feeling.<br/>\n<br/>\nThe months that followed were a blur.  If he had thought his previous existence was hard, he had been sorely mistaken!  The exercises, the lessons, were excruciating, any fault, real or imaginined, was instantly and brutally penalized.  His body was broken down, then rebuilt.  His mind shattered, then remade.<br/>\n<br/>\nHe often whimpered, in the dark, when he though himself alone, and unwatched.  But The Beast was always there, to mock him, to torment him.<br/>\n<br/>\n\"You will never be free, until you embrace ME!\", it shouted, in the corridors of his mind.  But still he resisted, why he did not know, and how, it was a mystery even to himself.<br/>\n<br/>\nThe years went by, one into the next.  He was 14.  Or so he was told.  And why should he doubt?  He did not know.<br/>\n<br/>\nHis final test.  He was to infiltrate a known brothel, and deal with a certain Patron.  This Patron was known to have a hunger for young flesh, succulent male flesh.  And though he had suffered long years of abuse, somehow his body was unblemished, his face angelic.  The Curse.<br/>\n<br/>\nIt was easy.<br/>\n<br/>\nThe Patron had tried to stop him, of course.  Weaves of strange bands, colors, and strength were called into existence, but they just slid from his body as if he was oiled, impervious.  His hands struck, and inside, something dark, something monstrous, echoed the violence, enjoyed it, relished it!<br/>\n<br/>\n\"Kill him!\", it roared!<br/>\n<br/>\nHe complied.<br/>\n<br/>\nThe Patron lay crushed at his feet, his skull a lumpen mass of flesh, blood, bone, and brain.  His bones had been broken, his limbs a grotesque effiggy.  <br/>\n<br/>\nGuards rushed into the room, their faces echoed the horror in the recesses of his mind.  What was he?<br/>\n<br/>\nIt was instinct, or perhaps training, or perhaps something else, that guided his fists.  On that night, the Brothel died!  There was only one lone survivor, and HE disappeared, into the night, leaving such a carnage, such an orgy of violence behind, that the city buried it under propaganda and subterfuge.<br/>\n<br/>\nStill, to this day, inhabitants whisper of the Night Terror.  <br/>\n<br/>\nHe was again moved.  Brought aboard a vessel of woood, he would bear the trip of months in the hold, a slave always.  He saw sunlight again, what he was sure was months later.  Still, he was not sure about the passage of time.  Only the darkness was his companion, whispering dark comfort in the otherwise stiffling still air of the hold.<br/>\n<br/>\nHe would later feverently wish he had remained there.<br/>\n<br/>\nOn the tropical island (this he found out later...much later), the seasons were unknowable.  Time passed, he knew this.  But how much, he knew not.  Day, nigh, day, night...how many?  Too many to count.<br/>\n<br/>\nThe Cowled One in Scarlet instructed him.<br/>\n<br/>\nIt was a cruel Master, one that drove him on, not only bodily, but also, for the first time, spiritually.  The Cowled One could grasp his Soul, carve it, mark it, form it.<br/>\n<br/>\nPain unlike anything he had ever known (and he had thought to have known everything there was to know) he experienced.<br/>\n<br/>\nThey tortured his body, his mind, his very soul.  They twisted him, carved him, formed him anew.<br/>\n<br/>\nOr so they thought.<br/>\n<br/>\nIn his anguish, his pain, he sought sanctuary.  Only The Beast answered his tortured screams, his hoarse cries, caressed his sweating brow, crooned in his ear;<br/>\n<br/>\n\"I will always be by you\", it stated, as if it had all the time in the world.<br/>\n<br/>\nAnd it did.<br/>\n<br/>\n\"Accept me.  Breathe me in\", it whispered.<br/>\n<br/>\nHe complied.<br/>\n<br/>\nHis final test came, conducted by The Cowled One in Scarlet.  He was ready.  He knew this.  He simply knew.<br/>\n<br/>\nHe, and it, were one.<br/>\n<br/>\nHe could hear the silence.  <br/>\n<br/>\nHe could see the darkness.<br/>\n<br/>\nHe was a Force of One!<br/>\n<br/>\nHis fists were as weapons, rending steel as paper, his body stronger than the strongest armor, his will was The Beast reborn!<br/>\n<br/>\nHis soul, like diamond!<br/>\n<br/>\nThe Cowled One in Scarlet realized the mistake, but alas, too late!  Broken, that corpse in scarlet, more blood than fabric lay.  Realized dreams had turned to nightmare.<br/>\n<br/>\nThey tried to stop him.  Futilely<br/>\n<br/>\n.  Bodies lie like stewn wheat, broken and torn.  All of them.<br/>\n<br/>\nHe was finally FREE!<br/>\n<br/>\nAnd he would never again be bound!<br/>\n<br/>\n<br/>\n<br/>\n<br/>\nMonk 38/Assassin 2<br/>\n<br/>\nElf<br/>\n<br/>\nStr 10<br/>\nInt 14<br/>\nWis 14<br/>\nDex 20<br/>\nCon  6<br/>\nChr  8<br/>\n<br/>\n1 Disarm<br/>\n2<br/>\n3<br/>\n4<br/>\n5<br/>\n6<br/>\n7<br/>\n8<br/>\n9<br/>\n10<br/>\n11<br/>\n12<br/>\n13<br/>\n14<br/>\n15<br/>\n16<br/>\n17<br/>\n18<br/>\n19<br/>\n20<br/>\n21<br/>\n22<br/>\n23<br/>\n24<br/>\n25<br/>\n26<br/>\n27<br/>\n28<br/>\n29<br/>\n30<br/>\n31<br/>\n32<br/>\n33<br/>\n34<br/>\n35<br/>\n36<br/>\n37<br/>\n38<br/>\n39<br/>\n40<br/>\n<br/>\nOk, now this is the feats I am looking at :<br/>\n<br/>\nBlind Fight<br/>\nCicle Kick<br/>\nImproved Disarm<br/>\nImproved Spell Resist X<br/>\nToughness<br/>\nWeapon Finesse<br/>\n<br/>\nAll points into Dex.<br/>\n<br/>\nAnd these are the skills :<br/>\n<br/>\nConcentration max<br/>\nListen Max<br/>\nSet Trap<br/>\nTumble Max<br/>\nUMD<br/>\nHide<br/>\nMS<br/>\nSpot<br/>\nSearch<br/>\n<br/>\nI chose Assassin because there is no XP penalty, and 2 levels of Assassin because it then gets Uncanny Dodge, which allows retaining the Dex AC (not to mention UMD).<br/>\n<br/>\nYou may be asking \"why Circle Kick?  Isn't that broken?\" - well, BeamDog fixed it so that one would not target an opponent out of range and therefore stand there like a punch dummy.  However, it does what it is supposed to do - attack another target WITHIN THE ROUND THAT IT ACTIVATES!<br/>\n<br/>\nThat would normally be a huge malus and no-no, but guess what?  It allows one to do MULTIPLE DISARM ATTACKS ON DIFFERENT OPPONENTS in one round!<br/>\n<br/>\nWhich is a HUGE advantage if surrounded!<br/>\n<br/>\nThus, Improved Disarm in the build.<br/>\n<br/>\nIME (In my experience), I have never seen a PW that designs Monsters and Enemies to be resistent to Disarm - meaning that when disarmed, opponents rarely have the same AB with back-up weapons (if any besides bare fists).  Of course, non-disarm environments will cause suffering here (as well as non-disarmable opponents).<br/>\n<br/>\nSo, this build is to be tailored for WoG - I am not sure when, exactly, the Assassin levels should be taken.  Discipline is not necessary, as GDL has so eloquently pointed out, in an environment with KD immunity and very little Disarm, it is just a skill sink that can better be used elsewhere.<br/>\n<br/>\nNote that I have tested A build of this on the offline Mod, and it is, to put it succinctly, nasty.<br/>\n<br/>\nHehe...<br/>\n<br/>\nHelp me make it truly fearsome!<br/>\n<br/>\nI hope you liked the background story.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "6:31 PM - Nov 30, 2019",
      "content": "<div>Your AB is already low even before the Disarm penalty is applied, so I would recommend dropping a couple of SR feats to get AB feats.<br/>\n61 SR gives immunity to level 40 casters without Spell Penetration feats, 67 SR gives immunity to level 40 casters with Epic Spell Penetration. At the very least you could drop a monk level and go for Monk37/Ass3 or Monk37/Ass2/SD1.<br/>\n<br/>\nBear in mind that I've never played WoG so this might be bad advice for that server.<br/>\nIf casters on WoG have very high caster levels then you might want to stick with Monk38/Ass2. 4 AB isn't too much of a loss if most mobs have low AC and low Discipline.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:08 PM - Nov 30, 2019",
      "content": "<div>Hmm. The towels for my head are still being steam-cleaned, but I'll get back to this one, which seems to give both a fair bit of scope and hardly any at the same time.<br/>\n<br/>\nYou'll probably have thought of it already, but just in case...Monk 35/ SD 5 gives you both HiPS and access to Epic Dodge. You would have to sacrifice UMD and sneak attack, though. And if you weren't looking for an elf, a hin Monk 30/ Rogue 5/ SD 5 would also work with some balancing of CON and STR. And I appreciate you want SR as high as you can get it. Aargh - nurse, those towels!<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Ninja'd by Yunim, but I'll leave this anyway. And forgot to mention: quality, if sordid, back-story!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:54 PM - Nov 30, 2019",
      "content": "<div>Really great story!</div>",
      "author-color": "#AA0000"
    }
  ]
}