{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "103",
  "name": "Jack of All Trades - Bard 16 / Rogue 16 / Fighter 8",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/jack-of-all-trades-bard-16-rogue-16-fighter-8-t2343394.html",
  "author": "Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": 9,
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:04 AM - Oct 06, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hail, mighty ECBers!<br/>\n<br/>\n WoG is down again, so I was working on a build with my friend BlackCobra, who also checks these forums on a regular basis and whom I'd like to thank for the input that helped me rethink this build as for the feat selection order, as well as some other aspects. I've had this guy on Limbo for quite a while, but something didn't seem right to me, something was off, except I couldn't tell what. He has 361 skillpoints, which is as high as any toon can possibly get, but they are simply not enough. He has SO MANY SKILLS to choose from, that not even 500 skill points would be enough. And this is the whole concept of the build, to be so versatile that you can do almost anything. The skill and feat selection had been made, but the leveling order was bothering me. I took a fresh look at it with BC and we were able to improve playability on it by A LOT without jeopardizing level 40 power, which is one of my characteristics as a builder. Those who have seen my builds know what I mean, those who haven't, I basically always make the choice that accounts for the best level 40 result and then challenge myself figuring out a way or ways to play the build and get there.<br/>\n<br/>\n The name here describes him well: He sets Epic Traps, has Epic Dodge, Crippling Strike, WS/EWS on his Rapier, 4 APR, level 16 Bard Song and Curse Song (with Lingering Song), UMD, Tumble, Taunt (and Expertise for the combo), Hide and Move Silently maxed out. With some CHA gear, he can cast all Bard spells, etc.., all while retaining an unbuffed AB of 40, which for a self-buffer isn't bad at all, and a pretty good AC (in the 70's with gear, although I haven't made the proper calculations).<br/>\n<br/>\n I couldn't afford Spellcraft, which I would've loved to have maxed out, there just weren't enough skill points. Other skills that I would've loved to invest in would be Craft Trap and Listen, but they had to be left out as well. Still, the result is pretty optimized according to my standards, which don't count very low HP as a weakness. Low HP to me means that you can't afford to make mistakes, you need to react fast, and that gives you an adrenaline rush and makes you have to play better. Also, there's gear and spells to address that particular one and reach the 400 HP mark.<br/>\n<br/>\n With 12 base STR plus a Bull's Strength spell and an Ioun Stone, you're able to carry around a Tower Shield, while dressed in your little robe, for the best possible AC. You need to shortcut the shield and remember to remove it while buffing. Since this guy shouldn't do much (or any) casting in combat, that's not a problem. All in all, a well-rounded character that can fit well into most playing styles.<br/>\n<br/>\n EDIT: I should probably mention there's a 20% XP penalty involved from level 22 on (one fortunate side effect of the rearranging of feats and levels BC and I did, it used to start at level 16, stop at 18 and restart at 22, I managed to eliminate the 1st XP penalty by anticipating Fighter levels, which also allowed me to anticipate some important combat feats such as Weapon Finesse and IKD)<br/>\n<br/>\n The Jack of All Trades<br/>\n<br/>\n Rogue(16), Bard(16), Fighter(8), Human<br/>\n<br/>\n Alignment: Any non-lawful<br/>\n<br/>\n Playable: 1-40 PvM, untested PvP (probably bad here)<br/>\n<br/>\n STR: 12<br/>\n DEX: 16 (30)<br/>\n CON: 8<br/>\n WIS: 8<br/>\n INT: 14<br/>\n CHA: 16<br/>\n<br/>\n Human: (Quick to Master)<br/>\n 01: Rogue(1): Expertise, Blind Fight<br/>\n 02: Fighter(1): Weapon Finesse<br/>\n 03: Bard(1): Weapon Focus: Rapier<br/>\n 04: Bard(2): DEX+1, (DEX=17)<br/>\n 05: Bard(3)<br/>\n 06: Bard(4): Knockdown<br/>\n 07: Rogue(2): {Evasion}<br/>\n 08: Bard(5): DEX+1, (DEX=18)<br/>\n 09: Bard(6): Curse Song<br/>\n 10: Fighter(2): Improved Knockdown<br/>\n 11: Bard(7)<br/>\n 12: Rogue(3): DEX+1, Improved Critical: Rapier, {Uncanny Dodge I}, (DEX=19)<br/>\n 13: Bard(8)<br/>\n 14: Bard(9)<br/>\n 15: Bard(10): Extend Spell<br/>\n 16: Fighter(3): DEX+1, (DEX=20)<br/>\n 17: Rogue(4)<br/>\n 18: Bard(11): Lingering Song<br/>\n 19: Bard(12)<br/>\n 20: Fighter(4): DEX+1, Weapon Specialization: Rapier, (DEX=21)<br/>\n 21: Rogue(5): Armor Skin<br/>\n 22: Bard(13)<br/>\n 23: Rogue(6)<br/>\n 24: Rogue(7): DEX+1, Great Dexterity I, (DEX=23)<br/>\n 25: Rogue(8)<br/>\n 26: Rogue(9)<br/>\n 27: Rogue(10): Great Dexterity II, Improved Evasion, (DEX=24)<br/>\n 28: Rogue(11): DEX+1, (DEX=25)<br/>\n 29: Rogue(12)<br/>\n 30: Rogue(13): Epic Dodge, Defensive Roll<br/>\n 31: Bard(14)<br/>\n 32: Bard(15): DEX+1, (DEX=26)<br/>\n 33: Fighter(5): Epic Weapon Focus: Rapier<br/>\n 34: Fighter(6): Epic Weapon Specialization: Rapier<br/>\n 35: Fighter(7)<br/>\n 36: Fighter(8): DEX+1, Great Dexterity III, Epic Prowess, (DEX=28)<br/>\n 37: Rogue(14)<br/>\n 38: Rogue(15)<br/>\n 39: Rogue(16): Great Dexterity IV, Crippling Strike, (DEX=29)<br/>\n 40: Bard(16): DEX+1, (DEX=30)<br/>\n<br/>\n Hitpoints: 232<br/>\n Skillpoints: 361<br/>\n Saving Throws (Fortitude/Will/Reflex): 18/19/33<br/>\n Saving Throw bonuses: Traps: +3<br/>\n BAB: 26<br/>\n AB (max, naked): 40 (melee), 37 (ranged)<br/>\n AC (naked/mundane armor/shield only): 30/33<br/>\n Spell Casting: Bard(6)<br/>\n Alignment Changes: 0<br/>\n<br/>\n Disable Trap 42(46), Hide 43(53), Move Silently 43(53), Open Lock 1(11), Perform 27(30), Search 20(22), Set Trap 33(45), Spot 42(41), Taunt 43(46), Tumble 40(50), UMD 27(30)<br/>\n<br/>\n 01: Disable Trap(4), Hide(4), Move Silently(4), Open Lock(1), Search(4), Set Trap(4), Tumble(4), UMD(4), Save(15),<br/>\n 02: Save(20),<br/>\n 03: Hide(2), Move Silently(2), Perform(6), Taunt(6), Tumble(2), UMD(2), Save(7),<br/>\n 04: Hide(1), Move Silently(1), Perform(1), Taunt(1), Tumble(1), UMD(1), Save(8),<br/>\n 05: Hide(1), Move Silently(1), Perform(1), Taunt(1), Tumble(1), UMD(1), Save(9),<br/>\n 06: Hide(1), Move Silently(1), Perform(1), Taunt(1), Tumble(1), UMD(1), Save(10),<br/>\n 07: Disable Trap(1), Hide(1), Move Silently(1), Search(5), Set Trap(6), Tumble(1), UMD(1), Save(5),<br/>\n 08: Hide(1), Move Silently(1), Perform(2), Taunt(2), Tumble(1), UMD(1), Save(4),<br/>\n 09: Hide(1), Move Silently(1), Perform(1), Taunt(1), Tumble(1), UMD(1), Save(5),<br/>\n 10: Save(10),<br/>\n 11: Hide(2), Move Silently(2), Perform(2), Taunt(2), Tumble(2), UMD(2), Save(5),<br/>\n 12: Disable Trap(5), Hide(1), Move Silently(1), Set Trap(5), Tumble(1), UMD(1), Save(2),<br/>\n 13: Hide(1), Move Silently(1), Perform(2), Taunt(2), Tumble(1), UMD(1), Save(1),<br/>\n 14: Hide(1), Move Silently(1), Perform(1), Taunt(1), Tumble(1), UMD(1), Save(2),<br/>\n 15: Hide(1), Move Silently(1), Perform(1), Taunt(1), Tumble(1), UMD(1), Save(3),<br/>\n 16: Save(8),<br/>\n 17: Disable Trap(2), Hide(2), Move Silently(2), Set Trap(5), Tumble(2), UMD(2), Save(4),<br/>\n 18: Hide(1), Move Silently(1), Perform(3), Taunt(3), Tumble(1), UMD(1), Save(1),<br/>\n 19: Hide(1), Move Silently(1), Perform(1), Taunt(1), Tumble(1), UMD(1), Save(2),<br/>\n 20: Save(7),<br/>\n 21: Disable Trap(5), Hide(2), Move Silently(2), Set Trap(2), Tumble(2), UMD(2), Save(3),<br/>\n 22: Hide(1), Move Silently(1), Perform(3), Taunt(3), Tumble(1), UMD(1),<br/>\n 23: Disable Trap(2), Hide(1), Move Silently(1), Search(1), Set Trap(4), Tumble(1), UMD(1),<br/>\n 24: Disable Trap(1), Hide(1), Move Silently(1), Search(5), Set Trap(1), Tumble(1), UMD(1),<br/>\n 25: Disable Trap(2), Hide(1), Move Silently(1), Search(5), Set Trap(1), Tumble(1),<br/>\n 26: Disable Trap(7), Hide(1), Move Silently(1), Set Trap(1), Tumble(1),<br/>\n 27: Disable Trap(1), Hide(1), Move Silently(1), Set Trap(1), Spot(6), Tumble(1),<br/>\n 28: Disable Trap(1), Hide(1), Move Silently(1), Set Trap(1), Spot(6), Tumble(1),<br/>\n 29: Disable Trap(1), Hide(1), Move Silently(1), Set Trap(1), Spot(5), Tumble(1), Save(1),<br/>\n 30: Disable Trap(1), Hide(1), Move Silently(1), Set Trap(1), Tumble(1), Save(7),<br/>\n 31: Hide(1), Move Silently(1), Perform(2), Taunt(9), Tumble(1),<br/>\n 32: Hide(1), Move Silently(1), Taunt(1), Tumble(1), Save(3),<br/>\n 33: Save(8),<br/>\n 34: Save(13),<br/>\n 35: Save(18),<br/>\n 36: Save(23),<br/>\n 37: Disable Trap(7), Hide(5), Move Silently(5), Spot(12), Tumble(5),<br/>\n 38: Disable Trap(1), Hide(1), Move Silently(1), Spot(8),<br/>\n 39: Disable Trap(1), Hide(1), Move Silently(1), Spot(5), Save(3),<br/>\n 40: Hide(1), Move Silently(1), Taunt(8),<br/>\n<br/>\n There are some similar builds in the engine, but the ones that go with Human (for the skill points) are STR-based (hence no Epic Dodge, which is a vital part of this guy's combat strategy with the low HP). The ones that are DEX-based go for Halfling and have less skill points while getting better combat stats. Oh well, you can't have it all, but this guy certainly tries. Anyway, here's a list of similar concepts:<br/>\n<br/>\n Raucuous Raider by Mithdradates STR-based Human.<br/>\n The Halfling Mousquetaire by lendorallen STR-based Halfling<br/>\n Dashing Bladesinger by CaZinO DEX-based ELF (huge XP penalty)<br/>\n Bloodaxe the DEXtrous by Grimnir77 DEX-based Dwarf build, which doesn't exactly make the best use of the skillpoints or starting stats due to CHA penalty and all, but does have higher HP<br/>\n<br/>\n Versatile Bladedancer by Xylophone DEX-based Halfing, very similar but goes with CoT instead of Fighter (so no EWS).<br/>\n<br/>\n There are no similar builds to this guy in the sense that none have Epic Dodge AND are Human for the optimal usage of the skillpoints. Mith's build is Human, but is STR-based. Very good build, but different for not being able to have ED and also having to remove plate AND shield to buff, which is always a pain.<br/>\n<br/>\n Dashing Bladesinger is somewhat similar too from the DEX focus, same as Bloodaxe, but they both use other races, so have fewer skillpoints, one has less starting CHA and the other huge XP penalty to go with. In that sense, this Jack of All Trades offers a smoother run and more versatility.<br/>\n<br/>\n Versatile Bladedancer is close too as the above, but uses CoT instead of Fighter, losing two feats (Human and Fighter 1) and the possibility to get EWS and gaining some saves while avoiding XP penalty altogether for being a Halfling (still not enough to tip the scales in favor of CoT IMO).<br/>\n<br/>\n Anyway, I hope you like this guy, and any constructive criticism is appreciated. Thanks!<br/>\n<br/>\n EDIT II: If the low HP thing bothers you too much, here is what you can do: get rid of Extend Spell and take Toughness, then take 4 points from STR and put them into CON. This will most likely condemn you to use a Large Shield for you whole life, but that's no big deal. The net gain of these changes is 120 HP, the loss is basically 1 AC and Extend Spell. I find both of those a bit more useful (and I plan to counter that particular weakness with gear where I play). Still, worth the mention.<br/>\n<br/>\n EDIT III: AB and AC Calculations:<br/>\n<br/>\n AB:<br/>\n<br/>\n 26 BAB<br/>\n +4 WF/EWF/EP<br/>\n +10 DEX<br/>\n +6 Capped DEX (Gear / spells)<br/>\n +5 GMW<br/>\n +2 Bard Song<br/>\n +1 Bless Potion<br/>\n +1 Aid Potion<br/>\n +5 (Curse Song Debuff)<br/>\n +2 War Cry<br/>\n +6 (Taunt Debuff)<br/>\n ----------------<br/>\n 68 effective AB<br/>\n<br/>\n You can enhance it even more if you feel the need with True Strike scrolls, Prayer scrolls, Divine Power scrolls, etc..<br/>\n<br/>\n AC:<br/>\n<br/>\n 10 Base<br/>\n +10 DEX<br/>\n +8 Tumble<br/>\n +3 Tower Shield<br/>\n +4 Haste<br/>\n +5 Bard Song<br/>\n +1 Mage Armor<br/>\n +5 (Shield AC modifier from a magical shield)<br/>\n +5 (Natural AC modifier from amulet)<br/>\n +5 (Deflection AC modifier from ring)<br/>\n +5 (Deflection AC modifier from robes)<br/>\n +4 (Dodge AC modifier from boots, could be +5 but on WoG there is an item that is very good and worth losing 1 AC for)<br/>\n +6 (DEX gear and spell enhancements)<br/>\n +2 (Curse Song debuff)<br/>\n +10 (Bigby level 5 debuff from scroll)<br/>\n +5 (Expertise)<br/>\n -----------------<br/>\n 73 AC with standard +5 items, 78 with Expertise, 83 with Bigby level 5 debuff, 88 with both, in case it's really necessary.<br/>\n<br/>\n There are other ways to enhance your AC indirectly in some situations (like Prayer scrolls debuff, Battletide scrolls), but they'd be minor and subject to SR, among other things. Nonetheless, Improved Invisibility will give you 50% Concealment, and Epic Dodge will let you avoid the first attack each round, so you'll be quite hard to hit!<br/>\n<br/>\n Take it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:06 PM - Oct 06, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Bard 16 is about the point of diminishing returns so that's about as optimized as you can make this.  Oh... so close to Bard 20 and Lasting Inspiration but sadly, no way Jose'.  Just love that feat <br/>\n<br/>\nAs much of a fan of UMD that I am, this particular build really doesn't need it with the arcane proficiency already established.  Yes, those monk robes and boots are probably dangling out there, but otherwise, unless there is a particular item you are targeting, I don't see where it will gain that much for you.  Scrolls of Divine Favor perhaps?  Or Prayer or Battletide scrolls for a few rounds?  Kind of an expensive level of existence IMO. But you are the WoG expert with deep pockets, not I. <br/>\n<br/>\nUmmm...  PvP?<br/>\n<br/>\nDon't waste your time... at least not against a serious trapper.  Even with Skill Focus/Epic Skill Focus in maxed (43) Search, you have no hope of spotting any PvP epic traps and probably not many non-epic ones either.  Strong/deadly Fire, for example will have a detect DC near 90 and epics will be at least 110 to spot.  Actually, the fact is... epic trappers will hardly ever spot another epic trapper's traps so keep a badger or boar running ahead if you can manage it... hehehe.   A divine trickery trapper with lots of INT and OwtL in effect stands the best chance to spot PvP traps, but it's an uphill battle and a huge feat commitment to do so. <br/>\n<br/>\nAnd less than 400 HP for melee?  Even with ED, one lucky swipe of a scythemaster will about cook your bacon.  Stick to PvM with this one, Max.  It appears to be a very good one for that!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:48 PM - Oct 06, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Hip, thanks for the comments!<br/>\n<blockquote><div>Bard 16 is about the point of diminishing returns so that's about as optimized as you can make this. Oh... so close to Bard 20 and Lasting Inspiration but sadly, no way Jose'. Just love that feat </div></blockquote>\n\nMe too, but in this build there was just no room. Everything in NWN is a tradeoff.<br/>\n<blockquote><div>As much of a fan of UMD that I am, this particular build really doesn't need it with the arcane proficiency already established. Yes, those monk robes and boots are probably dangling out there, but otherwise, unless there is a particular item you are targeting, I don't see where it will gain that much for you. Scrolls of Divine Favor perhaps? Or Prayer or Battletide scrolls for a few rounds? Kind of an expensive level of existence IMO. But you are the WoG expert with deep pockets, not I. </div></blockquote>\n\nYes, this is a WoGism for sure. In higher-magic worlds, I would probably take more UMD, in lower-magic, less. Here's a rough list of the things that this toon will gain from UMD: Flame Weapon wand, Divine Power scrolls, IGMS scrolls, Greater Spell Mantle scrolls, a certain pair of boots that can only be used by Clerics, Premonition scrolls. Obviously we're talking epics for those items. Before that, a scroll of Elemental Swarm can make a huge difference in the success of a mission. In sum, on WoG you'll get your due reward for each UMD point up to 30, and you'll also NEED every bit of it, with the TOUGH well-thought of bosses that can cause you SERIOUS problems.<br/>\n<br/>\nAnd about PvP, don't worry, I never build for PvP. I only play PvM and that's what I prefer anyway.<br/>\n<br/>\nThanks for the input!<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:13 AM - Oct 07, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nYes, this is a WoGism for sure. In higher-magic worlds, I would probably take more UMD, in lower-magic, less. Here's a rough list of the things that this toon will gain from UMD: Flame Weapon wand, Divine Power scrolls, <span style=\"color:#0000FF\"><strong>IGMS scrolls, Greater Spell Mantle scrolls</strong></span>, a certain pair of boots that can only be used by Clerics, Premonition scrolls. Obviously we're talking epics for those items. Before that, a scroll of Elemental Swarm can make a huge difference in the success of a mission. In sum, on WoG you'll get your due reward for each UMD point up to 30, and you'll also NEED every bit of it, with the TOUGH well-thought of bosses that can cause you SERIOUS problems.\n</div></blockquote>\nMost arcane scrolls can be used by a bard without any UMD unless the server has created custom scrolls with non-default class limitations.  Default IGMS &amp; GSM are examples of bard-usable scrolls as are Evard's, True Strike, Time Stop &amp; Wail among others.  Premonition is one of the exceptions. So, it comes down to how many divine spell items are available and which ones as to whether UMD has all that much value to an arcanist.  It appears that WoG has lots of items available so, as you've mentioned, there is significant value.<br/>\n<br/>\nHowever, I disagree that high UMD and high-magic environments is synonymous.  Relative value is server-specific (just like on WoG).  Many high-magic servers provide loads of non-class-specific custom items that cast high-level arcane and divine spells.  I recall items that contain over 10 charges of Time Stop, gloves that cast Level 40 IGMS OnHit and a Level 40 Destruction OnHit staff, all without any class limitation not to mention the item forges that have become a tell-tale characteristic of those kinds of servers (BTW, does WoG use an item forge?).  Actually, in high-magic realms, creature blueprints have been enhanced with such elevated SR &amp; saves, caster class dispel and breach spamming, that most PC spells and buffs have little sustained effect at all.   So, UMD is not always the uber skill worth investing points in when skills more valuable (like Spellcraft!) are being deprived.  Designers try all kinds of strategies to achieve class balance and nerfing the value of UMD is one of these.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:24 AM - Oct 07, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Agreed.<br/>\n<br/>\nWell, I found my home in WoG, as it's the place that comes closest to balancing the game I have ever seen. There are many custom features there, one of which is class-specific scrolls and wands. So if a Wizard creates a FW wand, only Wizards and Sorcerers can use them unless they have UMD. Same with scrolls. There are Druid-only scrolls, Cleric-only, etc, all of which are only available to the class that created them or a class with UMD. And Time Stop, Mord's scrolls are not available for sale at stores. You need to buy them from a player (and it's VERY HARD to find a player willing to sell them). Wand trading, on the other hand, is pretty common.<br/>\n<br/>\nAbout the forge, there is a forge, yes, but not like Rizolvir's. The forge in question is at the end of a tough dungeon, guarded by some dangerous monsters and you need to insert a normal weapon there. It gives the weapon +2 enhancement and 1d6 elemental damage. You can access that forge at around lvl 18 solo and maybe 15 in a party. AND it's once per reset, so no accumulating weapons! Most good items are at the hands of really well-conceived bosses that are TOUGH to kill. You should come play there with me man, I'd be happy to show you around. The server is so well structured that it has a nice RP feel, so many quests that you can level from 1-40 only doing missions and SO MANY areas!<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:12 PM - Mar 23, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><hr/>.<br/>\n EDIT: I should probably mention there's a 20% XP penalty involved from level 22 on (one fortunate side effect of the rearranging of feats and levels BC and I did, it used to start at level 16, stop at 18 and restart at 22, I managed to eliminate the 1st XP penalty by anticipating Fighter levels, which also allowed me to anticipate some important combat feats such as Weapon Finesse and IKD)<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Actually, it's from Level 23 on but who's counting?  I think you've done a great job to delay it that late.  Congratulations!</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "5:43 PM - Mar 16, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think i'm gonna have to try this one on WoG Max.<br/>\n<br/>\n Nice build...<br/>\n<br/>\n Only thing I'd change, and this is a WoGism as well.   I love craft wand.  I find it more useful then just about any other skil.<br/>\n<br/>\n I solo most of the time though, so a wand of Improved Invis/Invis has saved my arse more times then I can count.  And a wand of sonic boom does damage and stuns, and what rogue doesn't just love a stunned enemy?<br/>\n<br/>\n So most likely I'll drop extend spell and take craft wand.  For those that dont play on WoG, a wand there is created class specific, but they always have 50 charges.  And the spell level scales with the character level.<br/>\n<br/>\n Scanning over the bard spell list, I'm seeing a wand of...<br/>\n<br/>\n Sonic boom, grease, invis, summon 3 &amp; 4, darkness, bull and cats...     LOL.... got me drooling now...<br/>\n<br/>\n great job Max... cya in WoG<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:42 AM - Mar 19, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey con!! Good to see you back in action!<br/>\n<br/>\n I just wonder if losing a feat is worth it for spells which you can buy wands for. I would gladly make these wands for you, if the price is right :D. I mean even Paladins can make wands of Holy Sword that only they can make, but the spells you mentioned are basically generic ones that can be crafted by Druids, Wizards, Sorcerers and Clerics.<br/>\n<br/>\n Anyway!<br/>\n<br/>\n See you on WoG!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "alessiaccio",
      "avatar": "10758936_1531050487.jpg",
      "timestamp": "3:17 PM - Aug 26, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Woah, this build is amazing Maximillian! It would be still effective if i trade 4 points in STR for 2 in INT to take the spellcraft skill?<br/>\nWhat are the good and the bad sides to that?<br/>\nThanks!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "1:15 PM - Nov 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>alessiaccio wrote: <a data-post-id=\"12820\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=12820&amp;sid=d3990f0b88fef1d35e3d9eb19432b279#p12820\">↑</a><div class=\"responsive-hide\">Aug 26, 2018</div></cite>Woah, this build is amazing Maximillian! It would be still effective if i trade 4 points in STR for 2 in INT to take the spellcraft skill?<br/>\nWhat are the good and the bad sides to that?<br/>\nThanks!</div></blockquote>\nHey man!<br/>\n<br/>\nSorry for replying only 2 years later. I had quit the game when you posted, so I wasn't checking the forums. I doubt it'll be helpful 2 years later, but FWIW it might help others with similar ideas.<br/>\n<br/>\nI went with 12 STR because my plan was to carry around a Tower Shield to maximize my AC, and I didn't want to be encumbered all the time. If you lower STR, you'll most likely have to equip a small shield at most because of the low STR, which costs you 2 AC. If you don't see it as a problem, go for it!<br/>\n<br/>\nCheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}