{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "181",
  "name": "Ranged Assassin - a Dumb Idea?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ranged-assassin-a-dumb-idea-t2355025.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "14",
  "views": "409",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:28 PM - Feb 10, 2019",
      "content": "<div>I've been mulling around all sorts of ideas about builds (you see what happens when I still can't actually play the game!), and one that popped its head up was a sniper assassin. I'd be thinking an Elf Bard/ AA/ Assassin (no xp penalty due to 2 prestige classes). However, a few questions spring to mind before I go wasting years of my life on this.<br/>\n<br/>\nFirst, having noticed that there is no such build available through Hip's ECB Guild Filter, is it just a pants idea? <br/>\n<br/>\nSecond (and let's assume I'm ok to continue after the first question), would it require a meat-shield companion - which kind of goes against the \"lone assassin\" ethic?<br/>\n<br/>\nThird, other than for RP reasons, would Rogue be a more sensible option than Assassin (no DA, but retain sneaks and get Evasion, more skill pts etc)? I appreciate I may have to switch to Half-Elf for this.<br/>\n<br/>\nFourth, while I know the first 5 levels at least would need to be Bard, so I'd need a minimum of 11 Charisma, thus certainly impacting on min/max-ing, but what sort of split might be best - given that I'd be going heavy in either Ass or AA (probably AA)? My current thinking is something like Bard 9/AA 22/Ass 9, but more than happy to change that.<br/>\n<br/>\nFifth and finally, would it make more sense to drop Ass for SD? This would enable more AA levels (assuming I'd only be using SD for HiPS, thus requiring only 1 or 2 levels). I could still RP a vengeful outsider taking out old foes - real and perceived - but wouldn't need to be an evil-weevil?<br/>\n<br/>\nAny and all advice welcome!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:29 PM - Feb 10, 2019",
      "content": "<div>I have played a Rogue / AA with great success before, but the third class had to be Wizard because Elf and 2 base classes.  In fact, I posted such a build recently:<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/elven-guardian-rogue-17-wizard-1-arcane-archer-22-t2355003.html\" rel=\"noreferrer\" target=\"_blank\">elven-guardian-rogue-17-wizard-1-arcane ... 55003.html</a><br/>\n<br/>\nI have never been impressed with either of the evil-only classes.  They both seem meh to me, but others like them, so different strokes for different folks.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:54 PM - Feb 10, 2019",
      "content": "<div><blockquote><div><cite>Empyre65 wrote:</cite>\nI have played a Rogue / AA with great success before, but the third class had to be Wizard because Elf and 2 base classes.  In fact, I posted such a build recently:<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/elven-guardian-rogue-17-wizard-1-arcane-archer-22-t2355003.html\" rel=\"noreferrer\" target=\"_blank\">elven-guardian-rogue-17-wizard-1-arcane ... 55003.html</a><br/>\n<br/>\nI have never been impressed with either of the evil-only classes.  They both seem meh to me, but others like them, so different strokes for different folks.\n</div></blockquote>\n\n\"Normal\" me agrees with you here - you know my natural dwelling-place ain't that far from your own - but I'm trying to have a go at something different, with a role-play focus, so I'm still unsure. Although I am thinking more about an AA/SD/Bard to give better results. However, the question still remains - is a ranged assassin a dumb idea, or can it work well?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:59 PM - Feb 10, 2019",
      "content": "<div>First Stag, I will point you to the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/a-shot-in-the-dark-bard-5-aa-9-assassin-26-t2354966.html\" rel=\"noreferrer\" target=\"_blank\">A Shot In The dark thread</a> from january. <br/>\nThe Idea is not bad at all. I posted an Assassin heavy build there, and it works well. <br/>\nBoth AA and Assassin are classes that work at their best with many class levels. In the build I posted, I chose to focus on Assassin and use AA to boost AB and base damage some, and not have to rely on a +5 bow to piece premonition.<br/>\nYou know me; I don't use meat shields for stalkers. I used stealth, corner hiding and speed once i got haste. Corner hiding is much easier when you attack from some distance and have a head start.<br/>\nAs for Rogue versus Assassin as main class. <br/>\nRogue is a great class and all with skill points galore and many useful bonus feats. And SA does just as much damage as DA. And you can take Rogue at level 1 with the boost to skillpoints, and early SA. Rogue even gets evasion and can qualify for ED all on its own.<br/>\nWhat assassin gets is the paralysis, the undispellable Improved invisibility and Great dexterity as an epic bonus feat. The high dexterity makes it possible to end up with a warrior like AB.<br/>\n<br/>\nIf you want AA to be the main class for your archer, then Bard/AA builds have great flexibility. You can pick almost any 3rd class, if you want any at all. In such a build both Rogue and SD have more to offer than Assassin.<br/>\nA high AA class will give the damage you need. You may add fighter for EWS, but you don't need it.<br/>\n<br/>\nBard/AA/SD is the only practical HIPS AA (Sorcerer and Wizard based builds are not). I have played several of those AA builds using HIPS for crowd control, and I can recommend it. 10 levels of SD also let you have ED for your archer. 10 SD levels take away some of the AA sting, but adds a lot to defense.<br/>\n<br/>\nEeevil or not? Bard/AA can be as good or bad as you wish.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:35 PM - Feb 10, 2019",
      "content": "<div>Oh bloody hell, Mick, I forgot all about the Shot in the Dark thread, so thank you for the reminder (gods, I'm getting old. Or stupid. Or both.).<br/>\n<br/>\nI know the meat shield question was more about my own insecurities than anything. You are, of course, right.<br/>\n<br/>\nOh, sod it, you made it too easy for me to go a different route - be it SD or Rogue - and I'm in a contrary frame of mind. What you haven't done is say Bard/Ass/AA (and heavy on the AA) is an idiotic idea, so I'm going for it - for RP reasons as much as anything. I'll be putting something up for stoning soon.<br/>\n<br/>\nWhat's more worrying is that I've now got 3 or 4 other Assassin builds floating around in my head - you are a corrupting influence, Henry Wotton (even got me citing Wilde's \"Picture of Dorian Gray\" now!).<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:51 PM - Feb 10, 2019",
      "content": "<div>Now, let me really make your head spin - what about Bard/Barbarian/AA? Barbarian for 10% extra speed and Uncanny dodge, and the occasional rage to add some damage with your mighty bow!?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:03 PM - Feb 10, 2019",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote:</cite>\nNow, let me really make your head spin - what about Bard/Barbarian/AA? Barbarian for 10% extra speed and Uncanny dodge, and the occasional rage to add some damage with your mighty bow!?\n</div></blockquote>\n\nYou're really not helping here, you know that, don't you?<br/>\n<br/>\nI'd thought about Monk for speed and evasion, but that, as with your tantalising suggestion, would most likely mean Half-Elf to negate the xp penalty (module-player, you know how it is). I'm not sure about Barb - mostly because I'm not entirely sure how rage would work on a ranged attack.<br/>\n<br/>\n<span class=\"text-emoji\">😖</span> (result of spinning head)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:02 PM - Feb 10, 2019",
      "content": "<div>You might be better off going Assassin-heavy, rather than AA-heavy.  Like Mick said, get enough AA to penetrate Premonition and you get some extra AB, too.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:51 AM - Feb 11, 2019",
      "content": "<div><blockquote><div><cite>Empyre65 wrote:</cite>\nYou might be better off going Assassin-heavy, rather than AA-heavy.  Like Mick said, get enough AA to penetrate Premonition and you get some extra AB, too.\n</div></blockquote>\n\nOh, you're probably right, but I've just worked up a 53 AB (38 Dex, Elf) - I think - Bard 9/ AA 22/ Ass 9 that I'm struggling to ignore. On the other hand, with Bard 8/ AA 9/ Ass 23 with 36 Dex, I'm looking at 46 AB (I think), but have 7 more d6 DA/ Sneak Attack (12 over 5) with 36 DC. Sorry, bit whiskyed-up now (incoming birthday), so sums may be awry...<br/>\n<br/>\nCheers!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:06 PM - Feb 11, 2019",
      "content": "<div>In a build with Bard/Assassin/AA, you don't have to take more than 5 levels of Bard. You then take Assassin, and then AA once the AB is high enough. That works the same way no matter if you want to focus on AA or Assassin in the long run.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:13 PM - Feb 11, 2019",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>Sorry, bit whiskyed-up now (incoming birthday), so...<br/>\n<br/>\nCheers!\n</div></blockquote>\n\nHappy Birthday!  <span class=\"text-emoji\">🙂</span></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:52 PM - Feb 11, 2019",
      "content": "<div>Thanks, Mick! It's actually tomorrow, but friends couldn't make drinks on a Tuesday, so...<br/>\n<br/>\nAnyway, bit of a sore head today. So, to help me work through it I had a crack at pulling together a Bard 6/ AA 25/ Ass 9. (I get what you said about not needing more than Bard 5, but given that they'd have to be the first 5 levels in order to get the requisite 8 in Hide and MS, and that neither AA nor Ass has Spellcraft as a class skill, I decided to pop another level in at 37 to get +8 to saves vs spells, as well as topping-off Tumble as I finished Ass levels at 32.)<br/>\n<br/>\nIt was very much a curate's egg - good in parts. I went with stats of Str 12, Dex 18(34), Con 12, Wis 8, Int 14, Cha 12. This all resulted in a perfectly respectable +55 AB with +13 EA and 17d6 Imbue Arrow explosion, 32 naked AC, 258 skill points - so I could max Hide, MS, Spell, Spot, Tumble and UMD, with a few for Perform for the nursery rhyme rather than song. Reflex save was strong (37). HPs could have been worse (370 with Toughness, which could be swapped for something more useful like Expertise or Finesse to help with any melee). I got PBS, Rapid Shot, Called Shot, WF, Imp Crit and Blind Fight, and in Epic: 6 Great Dex, EWF, EP and Armour Skin.<br/>\n<br/>\nHowever, the other 2 saves were crap at best (F 20, W 18). With no Evasion and a stinky Fort save, I really couldn't get caught in melee. But the real kicker was Death Attack. Only 5d6, and with a DC of 21. Kind of ruined the point of taking Assassin at all.<br/>\n<br/>\nSo, I'm now going to follow sage earlier counsel from both Empyre and yourself and go more Ass-heavy (which is not the same as having a fat arse). I'm off to try a Bard 6/ Ass 23/ AA11 to see what happens...<br/>\n<br/>\nCheers!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:06 PM - Feb 11, 2019",
      "content": "<div>Alright, I've had a blast at the aforementioned Bard 6/ Ass 23/ AA 11 for compare and contrast purposes. I've also just had a look back at Mick's build from the Shot in the Dark (Bard 5/ Ass 26/ AA 9), and I'm pleasantly surprised with what I've cobbled together. It needs tuning, but it's still not too shabby.<br/>\n<br/>\nI started with the same stats as above, but took Dex up to 36 at the expense of Armour Skin. This time, obviously, the AB took a hit: +49 with +6 EA and 10d6 Imbue Arrow explosion. Naked AC dipped 1 to 31 (+1 Dex, -2 AS). Other than the Reflex save (38), the rest remained crap (F20, W17), with +8 vs spells and +11 vs poison. The skill points remain the same and are distributed similarly (a few minor differences). With Toughness, I had 342 HPs. The only differences in feats was the loss of AS, but got Great Dex VIII.<br/>\n<br/>\nBut Death Attack was significantly better - 12d6 with a DC of 35.<br/>\n<br/>\nSo, I guess the big question is AB or DA - where would you go?<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:03 PM - Feb 11, 2019",
      "content": "<div>An AB near 50 is more than good enough for an assassin<br/>\nI built with 3 more Assassin levels and Int 16 for 2d6 better DA damage and DC 39. I also got the bonus feat on Assassin 26. But there was no late Bard for a skill dump and no Spellcraft bonus to saves for me.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:04 PM - Feb 11, 2019",
      "content": "<div>An interesting exercise, whichever way we go. It's certainly a do-able build, but it's really not for me. However, I've a few more potential Assassins to play around with (currently ignoring Mick's Barbarian suggestion for now) and thereby irk the great and good amongst us - hoorah!<br/>\n<br/>\nOh, and as a btw, the B6/ AS23/ AA11 build can get +9 vs spells if you take the finally Bard level at 40.<br/>\n<br/>\nI've enjoyed this - cheers!</div>",
      "author-color": "#AA0000"
    }
  ],
  "author-color": "#AA0000"
}