{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "376",
  "name": "NE Druid(Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ne-druid-arelith-t2345683.html",
  "author": "Azshanola",
  "avatar": "no_avatar.png",
  "replies": 0,
  "posts": [
    {
      "author": "Azshanola",
      "avatar": "no_avatar.png",
      "timestamp": "12:22 AM - Nov 16, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello! I've come here, curious about druids. Now I know obviously that monk-druid is one of the best ways to go, at least with the restrictions on Arelith. You can get up to 70 AC  with dragon shape iirc and with how low magic the server is, it can be pretty cheesy. Regardless, I've an interest in making a NE druid. Now obviously this takes away the chance of monk-druid but is there another way to build this? I don't care whether it's spellcaster or based around wildshape. I just enjoy the idea of a druid that embodies the idea of survival of the fittest. Elf or human would be the races I'd want to go for, the usual Arelith restrictions. 3 levels in a class before you can leave it, level 30, low magic, etc. I'd like a build that sticks with the RP, but also one that is hopefully strong. If neither of these works out well, oh well the idea is scraped. This is more of an exercise in finding out whether or not it is plausible. <br/>\n<br/>\nIn addition, on Arelith there's a special type of druid called \"Totem Druid\". The effects are as follows:<br/>\nOn making a bargain, your PC permanently loses 4 points of Strength, Dexterity and Constitution. However, from that point on, their animal companion, all summoned non-undead creatures (bar Elemental Swarm, but including epic summons) and wildshape forms (but not elemental, shifter, or epic feat forms) all become the totem form.<br/>\nIt is perfectly OK to take a feat and later make a totem bargain that reduces characters abilities beneath the prerequisites for that feat. It will cause no problems to legality of the character.<br/>\nIn addition, their wildshape ability gets significantly stronger, and grows stronger the more druid levels the character has.<br/>\nFinally, depending on the totem animal, the PC gains a boon that depends on the species of totem animal.<br/>\n<br/>\nThese are the boons:<br/>\nWolf (predator): +2 str, +2 dex, +2 spot, +2 hide, +2 move silently<br/>\nPanther (sneak): +4 dex, +4 hide, +4 move silently<br/>\nSpider (cunning): +2 int, immunity: poison, immunity: paralysis<br/>\nParrot (beauty): +4 cha<br/>\nEagle (nobility): +2 cha, +8 spot<br/>\nBear (brawn): +4 str, +4 con<br/>\nRaven (wisdom): +4 wis, +10 lore<br/>\nBat (mystery): True Seeing<br/>\nRat (creativity): +4 int, immunity: disease<br/>\nSnake (grace): +2 dex, +2 cha, immunity: disease, immunity: poison<br/>\n<br/>\nAll stat bonuses are applied as 'soft' bonuses, which means they apply when wildshaped as well as in human/elf/etc form, they count toward the +12 cap, and, they do not count toward feat requirements.<br/>\n<br/>\nI was thinking something like Snake, Panther, Spider or even Bat, as far as what I think is suitable for the character.<br/>\n<br/>\n<strong>Oh! And of course, forgot to mention it before. RDD and shifter are locked unless you get them out of a roll so, they're out of the question. </strong><br/>\n<br/>\nThanks in advance for the information at the very least!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}