{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "872",
  "name": "PW - Paladin/CoT(?)/WM Smite Build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pw-paladin-cot-wm-smite-build-t2355052.html",
  "author": "jpsweeney94",
  "avatar": "no_avatar.png",
  "replies": 0,
  "posts": [
    {
      "author": "jpsweeney94",
      "avatar": "no_avatar.png",
      "timestamp": "10:20 AM - Mar 22, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello all, hope I'm posting in the right place. Im looking for a Paladin/WM high smite damage build for the PW I play. I assume I will also want to do CoT? How much in either direction? Don't really know the ins and outs of paladin and CoT. <br/>\n<br/>\n<strong>Desired Build</strong>: 7 levels of WM and the rest in pally and/or CoT // Epic Build level 40<br/>\n<strong>Weapon</strong>: Scythe<br/>\n<strong>Focus</strong>: High smite and crit damage, but not at the expense of being a complete glass cannon. So not 100% set on getting up to smite 10, unless feasible. If possible, id also like to be able to cast all paladin spells... so 14 wisdom I believe? <br/>\n<strong>Race</strong>: Human, but willing to adjust if necessary.<br/>\n<br/>\nSome things to note about the PW I play in is that we mostly do PvM.. not really much PvP so my focus will be against NPC bosses and fairly large mobs. Usually traveling with at least 1 or 2 party members sometimes larger, but id like the ability to play on my own as well. AC is somewhat important so like I said, can't completely ignore those benefits. <br/>\nHere's a list of some of the gear I will have to give you an idea of what stats I will be able to max etc... (I believe I can do up to +12 on any stat from items). But I have plenty of other options available:<br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Scythe</span></strong> <br/>\n1d10 negative<br/>\n1d6 sonic vs Elf<br/>\n1d6 positive vs human<br/>\nEB +4<br/>\nEB vs Elf +5<br/>\nEB vs human +5<br/>\nStr +2<br/>\nKeen<br/>\nMC 1d8<br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Armor</span></strong><br/>\nAC +4<br/>\nAC vs Orc +5<br/>\n+6 soak 5<br/>\nCon +5<br/>\nRegen + 3<br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Helmet</span></strong><br/>\nAC +4<br/>\nImmunity: Mind Affecting<br/>\nRegen +2<br/>\nTrue Seeing<br/>\n<br/>\nDon't want to go on and on with items so just to summarize I can also get an ammy with +5 AC and elemental resistances; belts/helmets with improved evasion, immunity to knockdown, damage resistances; rings with immunity to death magic, mind affecting, ability increases etc. Generally speaking I should have no problem maxing out up to 2 ability scores with items... and a decent amount in other abilities. Please let me know if you need more details!<br/>\n<br/>\nThanks! :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}