{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "636",
  "name": "Alpha Strike Build? Ideas for Max Damage First Round Unarmed Build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/alpha-strike-build-ideas-for-max-damage-first-roun-t2355429.html",
  "author": "CZero",
  "avatar": "10759266_1585974228.jpg",
  "replies": "13",
  "views": "581",
  "posts": [
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "9:35 AM - Apr 06, 2020",
      "content": "<div>So, like the title says, I'll be editing this as I journey on my quest for squeezing out every last bit of damage on that first round with my bare fists!<br/>\n<br/>\nWelcome to ideas and if there's already a guide, I'll search and find them and post them in here as well.<br/>\nThis is my first post, but I plan to make it into a full build once I've tweaked it to my liking.<br/>\n<br/>\nOnly real guidelines are that it'll be unarmed only, and I'm not looking for DPS, just straight out damage on the first hit or flurry of hits.<br/>\n<br/>\nDivine Might + Smite + Sneak?</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:59 AM - Apr 06, 2020",
      "content": "<div>Well, DA on the first hit with the highest DC possible on an opponent that can be paralysed by it is probably one of the highest potentials, I think.<br/>\n<br/>\nThough certainly a Smiter with all the bells doing a first attack will probably be able to post the most damage (especially if it crits! O_o)<br/>\n<br/>\nWhat about with Improved PA active?  And a Cleric/Monk with DP, perhaps?  <br/>\n<br/>\nLet me see - at the most, 5 attacks in one flurry.  For that, we would need 13 attacks in one round.  Thinking about how to obtain that with Unarmed Attacks, because two-weapon is out.<br/>\n<br/>\nWe would need Haste, of course.  FoBs I think is a no brainer here.  Throw in perhaps Circle Kick for an extra attack.  I think DP is going to be necessary here, to get more attacks...iirc.<br/>\n<br/>\nNot sure if we can get 13 attacks with Unarmed.  Might have to settle for 10, which would mean at most 4 attacks in the first flurry.<br/>\n<br/>\nAfter we figure out how many attacks we can do in the first flurry, then it is a matter of comparing bonuses and what is possible with them.<br/>\n<br/>\nDivine Might + Smite is going to mean some Cha, which would take away from Str here - so there is that.  Are we also comparing hit chances, or just the result if everything hits?<br/>\n<br/>\nIf the latter, then we want Improved Power Attack on, right?  And level 20 Monk for that d20 damage.  Are we going max damage on the hit(s) as well?<br/>\n<br/>\nAre we going from a nekkid build, or can we add in all the bells and whistles (like extra attacks)?  Just wondering what the parameters are here.</div>"
    },
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "11:16 AM - Apr 06, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Apr 06, 2020</div></cite>Well, DA on the first hit with the highest DC possible on an opponent that can be paralysed by it is probably one of the highest potentials, I think.<br/>\n<br/>\nThough certainly a Smiter with all the bells doing a first attack will probably be able to post the most damage (especially if it crits! O_o)<br/>\n<br/>\nWhat about with Improved PA active?  And a Cleric/Monk with DP, perhaps?  <br/>\n<br/>\nLet me see - at the most, 5 attacks in one flurry.  For that, we would need 13 attacks in one round.  Thinking about how to obtain that with Unarmed Attacks, because two-weapon is out.<br/>\n<br/>\nWe would need Haste, of course.  FoBs I think is a no brainer here.  Throw in perhaps Circle Kick for an extra attack.  I think DP is going to be necessary here, to get more attacks...iirc.<br/>\n<br/>\nNot sure if we can get 13 attacks with Unarmed.  Might have to settle for 10, which would mean at most 4 attacks in the first flurry.<br/>\n<br/>\nAfter we figure out how many attacks we can do in the first flurry, then it is a matter of comparing bonuses and what is possible with them.<br/>\n<br/>\nDivine Might + Smite is going to mean some Cha, which would take away from Str here - so there is that.  Are we also comparing hit chances, or just the result if everything hits?<br/>\n<br/>\nIf the latter, then we want Improved Power Attack on, right?  And level 20 Monk for that d20 damage.  Are we going max damage on the hit(s) as well?<br/>\n<br/>\nAre we going from a nekkid build, or can we add in all the bells and whistles (like extra attacks)?  Just wondering what the parameters are here.</div></blockquote>\nI like the thought process!<br/>\nYes, definitely can use haste plus other bells and whistles as long as they are able to feasibly be obtained in game on a normal run through or PW with a little dedication. Full lvl 40 build as well.<br/>\nI did consider quivering palm, but I think ultimately it's about posting big numbers right out of the bat.<br/>\nWhether the monk just runs up in plain sight or does it from stealth really makes no difference either and is allowed.<br/>\n<br/>\nI do agree that the addition of cha into the mix begins to make things difficult.<br/>\nI was thinking 16 lvls minimum of monk for the 1d20 is a must, then the rest gets interesting as you could go towards buffs, or maybe even barbarian with thundering rage? I just am not certain if you can add massive criticals to gloves as I'm not overly experienced with monks.<br/>\nRelying on crit damage is ok too as it's more going for highest dmg readout we can get.<br/>\n<br/>\nThis is a pure focus with zero survivability. Depending on results, that can come later =D</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:34 PM - Apr 06, 2020",
      "content": "<div>Can those fists cast spells? If so, that opens up for some really heavy area of attack spells.<br/>\nThe vanilla version of Harm can do some serious damage to high HP bosses. It is a spell, OK, but you have to land a melee touch attack for it to work.<br/>\n<br/>\nWeb pointed at smiters and a sneak (death-) attackers. They can dish out some heavy punches. However, smiters work better with weapons, because you can keen them and also use the Weapon master class for more impressive crits. Weapon master also let you max damage with their ki attack.<br/>\n<br/>\nAnother damage dealer is Ranger-heavy Ranger/Fighter, with Bane weapon and EWS.<br/>\n<br/>\nYou may also want to look at the Paladin/RDD combination (with Sorcerer of Bard to qualify for RDD). It can go heavy on both strength and charisma and has spells that improve both AB and damage.<br/>\n<br/>\nBuilds with HIPS will in many situations let you repeat the alpha strike.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:46 PM - Apr 06, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Apr 06, 2020</div></cite>\nIf the latter, then we want Improved Power Attack on, right?  And level 20 Monk for that d20 damage.  Are we going max damage on the hit(s) as well?\n</div></blockquote>\nEr, you get d20 damage at Monk 16, Web (unless you're a hin or gnome, when it's d12, as Empyre reminded me some time back). Monk 20 gives immunity to mind-affecting spells and DR 20/+1. I'm sure that was just a slip of the keyboard.<br/>\n<br/>\nI have zero expertise in DP types, so will pass no further comment.<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: Ninja'd by Mick, but I'll let my post stand - I wanted to ask something else anyway. Is where you're planning to play Dev Crit enabled or not, CZero? That could make a big difference.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "4:08 PM - Apr 06, 2020",
      "content": "<div>Just running some rough, theoretical numbers, a dedicated smiter puts out the most damage in the first hit.<br/>\n<br/>\nA dedicated sneaker should come close on average damage, but unless the sneaker has some impossibly good rolls, is unlikely to break 500 in the first flurry, while the smiter should hit around 800 on a crit.<br/>\n<br/>\nThis all assumes both characters are naked, only buffed with Bull's Strength and self-buffs, all hits in the first flurry connect, that the target is evil (smiteable), and probably a bunch of other stuff I've forgotten to mention.<br/>\n<br/>\nSo if you don't mind only being able to do crazy damage against evil things (and really underwhelming against others), go dedicated smiter. Otherwise, a Rogue 37/Monk 1/Assassin 1 (I know it's only 39 levels, but the last one doesn't matter) with all the sneak attack you can put in it is the best unarmed, first flurry damage.<br/>\n<br/>\nAgain, all this goes out the window when you involve weapons.<br/>\n<br/>\nI don't have my desktop with me to generate a full build right now, sorry.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "7:20 PM - Apr 06, 2020",
      "content": "<div>Are you maximising damage for a particular opponent or are you just aiming for a theoretical maximum? Maximising damage is a lot harder than maximising AB or AC due to how many variables are involved and how many potential damage sources there are.<br/>\nWhat's your opponents AC? Are they immune to Sneak Attack or critical hits? Do they have any DI/DR? Do they have concealment or Epic Dodge? Can you KD them to generate more Sneak Attacks? Can you smite them? Will you be using enchanted gear/gloves or be completely naked?<br/>\n<br/>\nThere's no point aiming for Monk16 when you get the unarmed APR increase with Monk1. It's very unlikely that those 15 levels are worth using to increase your base damage from 1d6 to 1d20.<br/>\n<br/>\nI'll focus on 3 minmaxed builds for 3 categories: Pal29/CoT10/Monk1, Monk4/Figh8/BG28, and Rog33/Figh6/Monk1. Note that it's probably possible to improve upon all 3 builds in their respective categories, but I don't think it's worth doing if this is just theory-building.<br/>\n<br/>\nIf your opponent is evil then a smiter has the best damage. A minmaxed Pal29/CoT10/Monk1 is one of the highest damage dealers with a +429 damage Smite Evil, although it's possible to improve upon this (eg Pal19/CoT20/Monk1).<br/>\nI'll assume it has +12 STR, +12 CHA, and Haste.<br/>\nSelf-buffed AB for the first round with Flurry Of Blows (split into flurries) is +56/+53/+50 / +47/+44/+41 / +56/+51 (+14 Smite Evil).<br/>\nSelf-buffed AB for the first flurry with IPA is +48/+45/+42 (+14 Smite Evil).<br/>\nSelf-buffed damage is 1d6 + 12 (+429 Smite Evil) Physical + 19 Divine + 5 Magical (19-20/x2).<br/>\nThe Divine and Magical damage both ignore DI/DR, so even monsters with 100% DI to all damage types will take 24 damage per hit.<br/>\nMinimum non-Smite damage is 37, minimum non-Smite damage is 74.<br/>\nMinimum Smite Evil damage is 466, minimum Smite Evil critical is 932, add 10/20 when using IPA (476/952).<br/>\nAssuming that all attacks hit and don't crit (which is a bad assumption), and that all three Smites are used with FoB, that is a minimum of 1583 damage in one round.<br/>\nAssuming that all attacks hit and don't crit (bad assumption), and that all three Smites are used in your opening flurry with IPA, that is a minimum of 1428 damage in your opening flurry.<br/>\n<br/>\nIf your opponent is good then a smiter has the best damage. A minmaxed Monk4/Figh8/BG28 has a +308 damage Smite Good and a +9d6 Sneak Attack (average of 31.5 damage per Sneak Attack).<br/>\nI'll assume it has +12 STR, +12 CHA, and Haste.<br/>\nSelf-buffed AB for the first round with Flurry Of Blows (split into flurries) is +42/+39/+36 / +33/+30/+27 / +42/+37 (+14 Smite Good)<br/>\nSelf-buffed AB for the first flurry with IPA is +34/+31/+28 (+14 Smite Good).<br/>\nSelf-buffed damage is 1d8 + 17 (+308 Smite Good) (+9d6 Sneak Attack) Physical + 14 Divine (19-20/x2).<br/>\nThe Divine damage ignores DI/DR, so that's a minimum of 14 damage per hit regardless of how tough the opponent is.<br/>\nAverage non-Smite Sneak Attack damage is 67, average non-Smite Sneak Attack critical is 102.5.<br/>\nAverage Sneak Attack Smite Good damage is 375, average Sneak Attack Smite Good critical is 718.5, add 10/20 when using IPA (385/738.5)<br/>\nAssuming that all attacks hit and don't crit (bad assumption), that all three Smites are used with FoB, that you generate Sneak Attacks on your first flurry, and that you KD on the first flurry to get all 8 Sneak Attacks, that is an average of 1460 damage in one round.<br/>\nAssuming that all attacks hit and don't crit (bad assumption), that all three Smites are used in your opening flurry with IPA, and that you generate Sneak Attacks on your first flurry, that is an average of 1155 damage in your opening flurry.<br/>\n<br/>\nIf your opponent is neutral but is vulnerable to sneak attacks then a sneaker is best. A minmaxed Rog33/Figh6/Monk1 has a +27d6 Sneak Attack, which gives an average of 94.5 damage per Sneak Attack.<br/>\nI'll assume it has +12 STR and Haste.<br/>\nSelf-buffed AB for the first round with Flurry Of Blows (split into flurries) is +44/+41/+38 / +35/+32/+29 / +44/+39.<br/>\nSelf-buffed AB for the first flurry with IPA is +36/+33/+30.<br/>\nSelf-buffed damage is 1d6 + 22 (+27d6 Sneak Attack) Physical (19-20/x2).<br/>\nAverage Sneak Attack damage is 120, average Sneak Attack critical is 145.5, add 10/20 when using IPA (130/165.5)<br/>\nAssuming that all attacks hit and don't crit (bad assumption), that you generate Sneak Attacks on your first flurry, and that you KD on the first flurry to get all 8 Sneak Attacks, that is an average of 960 damage in one round with FoB.<br/>\nAssuming that all attacks hit and don't crit (bad assumption), and that you generate Sneak Attacks on your first flurry, that is an average of 390 damage in your opening flurry with IPA.<br/>\nEven if we assume that you do maximum damage on every hit (190/200 with IPA) those numbers become 1520 in one round or 600 in your opening flurry, which are both lower than the corresponding minimum damage a Pal29/CoT10/Monk1 does.<br/>\n<br/>\nIf your opponent is both neutral and has Sneak Attack immunity then things become more interesting, but at that point the best build depends on your opponent. The classes to focus on are Monk (obviously), Cleric, Fighter, Paladin, Ranger, Blackguard, and CoT.</div>"
    },
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "12:39 AM - Apr 07, 2020",
      "content": "<div><blockquote><div><cite>Yunim wrote: <div class=\"responsive-hide\">Apr 06, 2020</div></cite>Are you maximising damage for a particular opponent or are you just aiming for a theoretical maximum? Maximising damage is a lot harder than maximising AB or AC due to how many variables are involved and how many potential damage sources there are.<br/>\nWhat's your opponents AC? Are they immune to Sneak Attack or critical hits? Do they have any DI/DR? Do they have concealment or Epic Dodge? Can you KD them to generate more Sneak Attacks? Can you smite them? Will you be using enchanted gear/gloves or be completely naked?<br/>\n<br/>\nThere's no point aiming for Monk16 when you get the unarmed APR increase with Monk1. It's very unlikely that those 15 levels are worth using to increase your base damage from 1d6 to 1d20.<br/>\n<br/>\nI'll focus on 3 minmaxed builds for 3 categories: Pal29/CoT10/Monk1, Monk4/Figh8/BG28, and Rog33/Figh6/Monk1. Note that it's probably possible to improve upon all 3 builds in their respective categories, but I don't think it's worth doing if this is just theory-building.<br/>\n<br/>\nIf your opponent is evil then a smiter has the best damage. A minmaxed Pal29/CoT10/Monk1 is one of the highest damage dealers with a +429 damage Smite Evil, although it's possible to improve upon this (eg Pal19/CoT20/Monk1).<br/>\nI'll assume it has +12 STR, +12 CHA, and Haste.<br/>\nSelf-buffed AB for the first round with Flurry Of Blows (split into flurries) is +56/+53/+50 / +47/+44/+41 / +56/+51 (+14 Smite Evil).<br/>\nSelf-buffed AB for the first flurry with IPA is +48/+45/+42 (+14 Smite Evil).<br/>\nSelf-buffed damage is 1d6 + 12 (+429 Smite Evil) Physical + 19 Divine + 5 Magical (19-20/x2).<br/>\nThe Divine and Magical damage both ignore DI/DR, so even monsters with 100% DI to all damage types will take 24 damage per hit.<br/>\nMinimum non-Smite damage is 37, minimum non-Smite damage is 74.<br/>\nMinimum Smite Evil damage is 466, minimum Smite Evil critical is 932, add 10/20 when using IPA (476/952).<br/>\nAssuming that all attacks hit and don't crit (which is a bad assumption), and that all three Smites are used with FoB, that is a minimum of 1583 damage in one round.<br/>\nAssuming that all attacks hit and don't crit (bad assumption), and that all three Smites are used in your opening flurry with IPA, that is a minimum of 1428 damage in your opening flurry.\n</div></blockquote>\nSo, let's narrow this down to vs evil opponents only and can use smite evil. This will fit thematically with what I am trying to achieve.<br/>\nI have some reading to do on how to min/max a build, but I like the idea of 1 monk / pal19 / CoT 20.<br/>\nCan use gloves and would be expected to do so for the extra damage.<br/>\nFor equipment I expect to get +12 cha and +12 str from items.<br/>\nWould it make sense to focus more on CHA for this build to max smite damage?<br/>\nAlso think that taking as many levels of Greater smite as possible would be preferable as well.<br/>\n<br/>\nQuestion, you have to burn a feat on weapon focus melee weapon for CoT, correct?</div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "12:41 AM - Apr 07, 2020",
      "content": "<div>Can you even use all 3 smite evils in a single flurry? I didn't think that was possible.</div>"
    },
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "12:48 AM - Apr 07, 2020",
      "content": "<div><blockquote><div><cite>Ten Pura wrote: <div class=\"responsive-hide\">Apr 07, 2020</div></cite>Can you even use all 3 smite evils in a single flurry? I didn't think that was possible.</div></blockquote>\nIf I'm not mistaken you just queue it up before first one goes off. I do this with called shot, imp KD, etc. Activate ability, click mob, repeat 2 more times before you get to them and next 3 attacks do KD or called shot, etc.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:23 AM - Apr 07, 2020",
      "content": "<div>Even if you narrow it down to a smiter, if you want the highest damage possible I'd need to know more about the environment you play in and your potential opponents. Bear in mind that Divine Wrath is a once per day feat and Smite Evil has three uses per day, after those feats are used up the build won't be anything special.<br/>\n<br/>\nWhat magic level is available? +5EB /+5AC? You've said that +12 STR/CHA is available, will you be able to get +12 DEX/CON/WIS or Haste as well?<br/>\nWhat sort of opponents will you be facing? Low AC or High AC? Will Bludgeoning DI/DR be a problem? Is critical hit immunity common? Is dispel an issue for low level buffs?<br/>\nYou said you only care about the first hit at level 40, so I'm assuming that playability or survivability aren't things you care about? You also want to focus on burst damage over consistent damage? Do you want the best damage for the first round or for the first flurry?<br/>\n<br/>\nPal29/CoT10/Monk1 is my default smiter, modifying it to fight unarmed is very easy. If you want to play a balanced build that can also do a lot of damage I'd recommend a balanced Pal29/CoT10/Monk1. If you want to minmax purely for damage then other Pal/CoT or Pal/CoT/Monk builds will be better, although how much better depends on both the opponent and available equipment. It's effectively a choice between better Paladin buffs and a better Divine Wrath, there is no singular best unarmed smiter.</div>"
    },
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "4:21 AM - Apr 07, 2020",
      "content": "<div><blockquote><div><cite>Yunim wrote: <div class=\"responsive-hide\">Apr 07, 2020</div></cite>Even if you narrow it down to a smiter, if you want the highest damage possible I'd need to know more about the environment you play in and your potential opponents. Bear in mind that Divine Wrath is a once per day feat and Smite Evil has three uses per day, after those feats are used up the build won't be anything special.<br/>\n<br/>\nWhat magic level is available? +5EB /+5AC? You've said that +12 STR/CHA is available, will you be able to get +12 DEX/CON/WIS or Haste as well?<br/>\nWhat sort of opponents will you be facing? Low AC or High AC? Will Bludgeoning DI/DR be a problem? Is critical hit immunity common? Is dispel an issue for low level buffs?<br/>\nYou said you only care about the first hit at level 40, so I'm assuming that playability or survivability aren't things you care about? You also want to focus on burst damage over consistent damage? Do you want the best damage for the first round or for the first flurry?<br/>\n<br/>\nPal29/CoT10/Monk1 is my default smiter, modifying it to fight unarmed is very easy. If you want to play a balanced build that can also do a lot of damage I'd recommend a balanced Pal29/CoT10/Monk1. If you want to minmax purely for damage then other Pal/CoT or Pal/CoT/Monk builds will be better, although how much better depends on both the opponent and available equipment. It's effectively a choice between better Paladin buffs and a better Divine Wrath, there is no singular best unarmed smiter.</div></blockquote>\nThanks Yunim, I figure with 3 smites available, the first flurry will use them all up and I think that's the part I'd like to focus on.<br/>\nAlso, I tried a build on a test character at lvl 40 and was only able to get up to greater smite IX, so I must have lvled up with wrong mix or at wrong levels.<br/>\nThis was 1 monk / 19 pal / 20 CoT.<br/>\nI play on A Dawn of Heroes PW which has a Nordock ruleset and gear.<br/>\nHaste is plentiful, Maxing stats is doable, and survivability isn't something I'm worried about.<br/>\nAs for what type of foes, I would leave that open as this character is the smiter of any evil foe and that shouldn't matter.  AC will probably be 40-50's on mobs and 65 for boss.<br/>\n<br/>\nBasically, if I can walk up and smack something dead and walk away to fight another day, then the build is golden, it's definitely a singularly focused build with playability out the window.<br/>\nAlso, on this PW the following changes affect this build I think, but won't affect the first flurry, of course:\n<ul>\n<li><strong>Divine Might:</strong> duration increased to x1.5 charisma modifier rounds.</li>\n<li><strong>Divine Shield:</strong> duration increased to x1.5 charisma modifier rounds.</li>\n<li><strong>Divine Wrath:</strong> daily uses increased to 3. Duration increased to turns instead of rounds (PURE modifier, bonus from different sources are not considered).</li>\n</ul></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "6:10 AM - Apr 07, 2020",
      "content": "<div>This is a rough build guide for a fully minmaxed Pal29/CoT10/Monk1. Other fully minmaxed Pal/CoT/Monk builds, such as Pal19/CoT20/Monk1 or Pal24/CoT15/Monk1, are built in practically the same way. It can self-buff to +13 AB, so you will reach the AB cap if the available gloves are +7 AB or above.<br/>\n<br/>\nIf I'm understanding the changes correctly, Divine Might lasts for 21 rounds and Divine Wrath has 3 uses per day and a duration of 8 turns (instead of 14 turns). This is a nice improvement to the build and means it will still be useful even after smiting. With the increased duration it's tempting to get Divine Shield too, but this would require lowering your offence slightly.<br/>\n<br/>\nThe build is designed to be played as a normal sword and board Paladin up to level 32, when it finally gains access to Monk unarmed APR. If you want to play unarmed from level 1 then the feats will need to be rearranged. You can move the Monk level anywhere from level 21 to 40, it's even possible to move it to pre-epic levels but that wouldn't result in a fully minmaxed build.<br/>\n<br/>\nThe levels and feats can be rearranged depending on what you prioritise, but you can't make many changes to the feat selection if you want a fully minmaxed build. I chose to focus in scimitars for the increased crit range, but any simple or martial melee weapon will work. Even without IC: Scimitar the threat range is larger than your unarmed threat range, and with a keened scimitar there is a significant difference. Knockdown can be swapped for Divine Shield or IPA but personally I'd recommend sticking with KD. You can drop two ability feats and end with 18 STR in order to gain two epic feats, but this won't give you a fully minmaxed build. For example, this would let you pick up Divine Shield and ESF: Discipline.<br/>\n<br/>\nIf you want more skills (such as Spot or Taunt) you will need to make a more balanced build.<br/>\n<br/>\nSince it's just a rough build I didn't bother with a full skill progression.<br/>\n<br/>\n===<br/>\n<br/>\nClass: Paladin 29 / Champion Of Torm 10 / Monk 1<br/>\nRace: Human<br/>\nAlignment: Lawful Good<br/>\nPlayability: 32-40 PvM<br/>\n<br/>\nSTR: 15 (20)<br/>\nDEX: 8<br/>\nCON: 8<br/>\nWIS: 14<br/>\nINT: 8<br/>\nCHA: 18 (26)<br/>\n<br/>\n01: Paladin(1): Power Attack, Weapon Focus: Scimitar<br/>\n02: Paladin(2)<br/>\n03: Paladin(3): Divine Might<br/>\n04: Paladin(4): CHA+1, (CHA=19)<br/>\n05: Paladin(5)<br/>\n06: Paladin(6): Knockdown<br/>\n07: Paladin(7)<br/>\n08: Paladin(8): CHA+1, (CHA=20)<br/>\n09: Paladin(9): Blind Fight<br/>\n10: Paladin(10)<br/>\n11: Paladin(11)<br/>\n12: Paladin(12): CHA+1, Extra Smiting, (CHA=21)<br/>\n13: Paladin(13)<br/>\n14: Paladin(14)<br/>\n15: Paladin(15): Weapon Focus: Unarmed<br/>\n16: Paladin(16): CHA+1, (CHA=22)<br/>\n17: Paladin(17)<br/>\n18: Paladin(18): Improved Critical: Unarmed<br/>\n19: Paladin(19)<br/>\n20: Champion of Torm(1): CHA+1, (CHA=23)<br/>\n21: Champion of Torm(2): Great Charisma I, Epic Prowess, (CHA=24)<br/>\n22: Champion of Torm(3)<br/>\n23: Champion of Torm(4): Epic Weapon Focus: Unarmed<br/>\n24: Champion of Torm(5): CHA+1, Great Charisma II, (CHA=26)<br/>\n25: Champion of Torm(6): Great Smite I<br/>\n26: Champion of Torm(7)<br/>\n27: Champion of Torm(8): Great Strength I, Great Smite II, (STR=16)<br/>\n28: Champion of Torm(9): STR+1, (STR=17)<br/>\n29: Champion of Torm(10): Great Smite III<br/>\n30: Paladin(20): Great Smite IV<br/>\n31: Paladin(21)<br/>\n32: Monk(1): STR+1, (STR=18)<br/>\n33: Paladin(22): Great Smite V<br/>\n34: Paladin(23): Great Smite VI<br/>\n35: Paladin(24)<br/>\n36: Paladin(25): STR+1, Great Smite VII, (STR=19)<br/>\n37: Paladin(26): Great Smite VIII<br/>\n38: Paladin(27)<br/>\n39: Paladin(28): Great Smite IX<br/>\n40: Paladin(29): STR+1, Great Smite X, (STR=20)<br/>\n<br/>\nDisable Trap 1(0), Discipline 43(48), Open Lock 1(0), Pick Pocket 1(0), Set Trap 1(0), Spellcraft 1(0), Tumble 35(34)<br/>\n<br/>\n===<br/>\n<br/>\nNaked Stats<br/>\nHitpoints: 358<br/>\nSkillpoints: 88<br/>\nSaving Throws (Fortitude/Will/Reflex): 35/31/30<br/>\nSaving Throw bonuses: <br/>\nBAB: 30<br/>\nAB (max, naked): 39 (melee), 30 (ranged)<br/>\nAC (naked/mundane armor/shield only): 18/27<br/>\nSpell Casting: Paladin(4)<br/>\nAlignment Changes: 0<br/>\n<br/>\nBuffed Stats (Assuming +12 STR, +12 CON, +12 CHA, +5 AB gloves, +5 AC items, and Haste)<br/>\nAB: 30 (BAB) + 11 (STR) + 4 (Feats) + 5 (AB Bonus) + 1 (Aid) + 1 (Bless) + 5 (Divine Favor) + 1 (Prayer) + 5 (Divine Wrath) = +63 (+14 Smite Evil)<br/>\nAC: 10 (Base) - 1 (DEX) + 2 (WIS) + 7 (Tumble) + 20 (AC Bonus) + 4 (Haste) = 42 (+12 with maxed DEX and WIS) (+11 if you decide to add Divine Shield)<br/>\nHP: 398 (Base) + 200 (CON) = 598<br/>\nFortitude: 23 (Base) + 5 (CON) + 14 (CHA) + 5 (CoT Bonus) = 47 (52 with Divine Wrath)<br/>\nReflex: 18 (Base) - 1 (DEX) + 14 (CHA) + 5 (CoT Bonus) = 36 (41 with Divine Wrath)<br/>\nWill: 16 (Base) + 2 (WIS) + 14 (CHA) + 5 (CoT Bonus) = 37 (42 with Divine Wrath)<br/>\n<br/>\nSelf-buffed damage: 1d6 + 12 (+429 Smite Evil) Bludgeoning, 19 Divine, 5 Magical (19-20/x2)<br/>\nThe Bludgeoning damage is subject to DI/DR, both the Divine and Magical damage bypass it.<br/>\nMinimum non-Smite damage: 37 (13 Bludgeoning, 19 Divine, 5 Magical)<br/>\nMinimum non-Smite critical: 74 (26 Bludgeoning, 38 Divine, 10 Magical)<br/>\nMinimum Smite Evil damage: 466 (442 Bludgeoning, 19 Divine, 5 Magical)<br/>\nMinimum Smite Evil critical: 932 (884 Bludgeoning, 38 Divine, 10 Magical)</div>"
    },
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "9:33 AM - Apr 07, 2020",
      "content": "<div><blockquote><div><cite>Yunim wrote: <div class=\"responsive-hide\">Apr 07, 2020</div></cite>This is a rough build guide for a fully minmaxed Pal29/CoT10/Monk1. Other fully minmaxed Pal/CoT/Monk builds, such as Pal19/CoT20/Monk1 or Pal24/CoT15/Monk1, are built in practically the same way. It can self-buff to +13 AB, so you will reach the AB cap if the available gloves are +7 AB or above.<br/>\n<br/>\nIf I'm understanding the changes correctly, Divine Might lasts for 21 rounds and Divine Wrath has 3 uses per day and a duration of 8 turns (instead of 14 turns). This is a nice improvement to the build and means it will still be useful even after smiting. With the increased duration it's tempting to get Divine Shield too, but this would require lowering your offence slightly.<br/>\n<br/>\nThe build is designed to be played as a normal sword and board Paladin up to level 32, when it finally gains access to Monk unarmed APR. If you want to play unarmed from level 1 then the feats will need to be rearranged. You can move the Monk level anywhere from level 21 to 40, it's even possible to move it to pre-epic levels but that wouldn't result in a fully minmaxed build.<br/>\n<br/>\nThe levels and feats can be rearranged depending on what you prioritise, but you can't make many changes to the feat selection if you want a fully minmaxed build. I chose to focus in scimitars for the increased crit range, but any simple or martial melee weapon will work. Even without IC: Scimitar the threat range is larger than your unarmed threat range, and with a keened scimitar there is a significant difference. Knockdown can be swapped for Divine Shield or IPA but personally I'd recommend sticking with KD. You can drop two ability feats and end with 18 STR in order to gain two epic feats, but this won't give you a fully minmaxed build. For example, this would let you pick up Divine Shield and ESF: Discipline.<br/>\n<br/>\nIf you want more skills (such as Spot or Taunt) you will need to make a more balanced build.<br/>\n<br/>\nSince it's just a rough build I didn't bother with a full skill progression.<br/>\n<br/>\n===<br/>\n<br/>\nClass: Paladin 29 / Champion Of Torm 10 / Monk 1<br/>\nRace: Human<br/>\nAlignment: Lawful Good<br/>\nPlayability: 32-40 PvM<br/>\n<br/>\nSTR: 15 (20)<br/>\nDEX: 8<br/>\nCON: 8<br/>\nWIS: 14<br/>\nINT: 8<br/>\nCHA: 18 (26)<br/>\n<br/>\n01: Paladin(1): Power Attack, Weapon Focus: Scimitar<br/>\n02: Paladin(2)<br/>\n03: Paladin(3): Divine Might<br/>\n04: Paladin(4): CHA+1, (CHA=19)<br/>\n05: Paladin(5)<br/>\n06: Paladin(6): Knockdown<br/>\n07: Paladin(7)<br/>\n08: Paladin(8): CHA+1, (CHA=20)<br/>\n09: Paladin(9): Blind Fight<br/>\n10: Paladin(10)<br/>\n11: Paladin(11)<br/>\n12: Paladin(12): CHA+1, Extra Smiting, (CHA=21)<br/>\n13: Paladin(13)<br/>\n14: Paladin(14)<br/>\n15: Paladin(15): Weapon Focus: Unarmed<br/>\n16: Paladin(16): CHA+1, (CHA=22)<br/>\n17: Paladin(17)<br/>\n18: Paladin(18): Improved Critical: Unarmed<br/>\n19: Paladin(19)<br/>\n20: Champion of Torm(1): CHA+1, (CHA=23)<br/>\n21: Champion of Torm(2): Great Charisma I, Epic Prowess, (CHA=24)<br/>\n22: Champion of Torm(3)<br/>\n23: Champion of Torm(4): Epic Weapon Focus: Unarmed<br/>\n24: Champion of Torm(5): CHA+1, Great Charisma II, (CHA=26)<br/>\n25: Champion of Torm(6): Great Smite I<br/>\n26: Champion of Torm(7)<br/>\n27: Champion of Torm(8): Great Strength I, Great Smite II, (STR=16)<br/>\n28: Champion of Torm(9): STR+1, (STR=17)<br/>\n29: Champion of Torm(10): Great Smite III<br/>\n30: Paladin(20): Great Smite IV<br/>\n31: Paladin(21)<br/>\n32: Monk(1): STR+1, (STR=18)<br/>\n33: Paladin(22): Great Smite V<br/>\n34: Paladin(23): Great Smite VI<br/>\n35: Paladin(24)<br/>\n36: Paladin(25): STR+1, Great Smite VII, (STR=19)<br/>\n37: Paladin(26): Great Smite VIII<br/>\n38: Paladin(27)<br/>\n39: Paladin(28): Great Smite IX<br/>\n40: Paladin(29): STR+1, Great Smite X, (STR=20)<br/>\n<br/>\nDisable Trap 1(0), Discipline 43(48), Open Lock 1(0), Pick Pocket 1(0), Set Trap 1(0), Spellcraft 1(0), Tumble 35(34)<br/>\n<br/>\n===<br/>\n<br/>\nNaked Stats<br/>\nHitpoints: 358<br/>\nSkillpoints: 88<br/>\nSaving Throws (Fortitude/Will/Reflex): 35/31/30<br/>\nSaving Throw bonuses: <br/>\nBAB: 30<br/>\nAB (max, naked): 39 (melee), 30 (ranged)<br/>\nAC (naked/mundane armor/shield only): 18/27<br/>\nSpell Casting: Paladin(4)<br/>\nAlignment Changes: 0<br/>\n<br/>\nBuffed Stats (Assuming +12 STR, +12 CON, +12 CHA, +5 AB gloves, +5 AC items, and Haste)<br/>\nAB: 30 (BAB) + 11 (STR) + 4 (Feats) + 5 (AB Bonus) + 1 (Aid) + 1 (Bless) + 5 (Divine Favor) + 1 (Prayer) + 5 (Divine Wrath) = +63 (+14 Smite Evil)<br/>\nAC: 10 (Base) - 1 (DEX) + 2 (WIS) + 7 (Tumble) + 20 (AC Bonus) + 4 (Haste) = 42 (+12 with maxed DEX and WIS) (+11 if you decide to add Divine Shield)<br/>\nHP: 398 (Base) + 200 (CON) = 598<br/>\nFortitude: 23 (Base) + 5 (CON) + 14 (CHA) + 5 (CoT Bonus) = 47 (52 with Divine Wrath)<br/>\nReflex: 18 (Base) - 1 (DEX) + 14 (CHA) + 5 (CoT Bonus) = 36 (41 with Divine Wrath)<br/>\nWill: 16 (Base) + 2 (WIS) + 14 (CHA) + 5 (CoT Bonus) = 37 (42 with Divine Wrath)<br/>\n<br/>\nSelf-buffed damage: 1d6 + 12 (+429 Smite Evil) Bludgeoning, 19 Divine, 5 Magical (19-20/x2)<br/>\nThe Bludgeoning damage is subject to DI/DR, both the Divine and Magical damage bypass it.<br/>\nMinimum non-Smite damage: 37 (13 Bludgeoning, 19 Divine, 5 Magical)<br/>\nMinimum non-Smite critical: 74 (26 Bludgeoning, 38 Divine, 10 Magical)<br/>\nMinimum Smite Evil damage: 466 (442 Bludgeoning, 19 Divine, 5 Magical)<br/>\nMinimum Smite Evil critical: 932 (884 Bludgeoning, 38 Divine, 10 Magical)</div></blockquote>\nWow thanks, I will play around with this and give you feedback.</div>"
    }
  ]
}