{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "221",
  "name": "Noob joining the community / Guide Request !!!",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/noob-joining-the-community-guide-request-t2354535.html",
  "author": "Orlouge",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "521",
  "posts": [
    {
      "author": "Orlouge",
      "avatar": "no_avatar.png",
      "timestamp": "6:30 AM - May 11, 2016",
      "content": "<div><em>*Moved from Bioware Legacy Builds subforum* admin</em><br/>\n<br/>\n Hi everyone. I'm not sure if anyone reads this anymore, but here I come.<br/>\n I'm an almost 30 years old guy who played this game long long time ago, but not that often thus never got an in depth grasp of the game. Now that I'm almost done with climbing the RL ladder I have chance to devote my time on the childhood list of things I always wanted to do, and NWN has always been there.<br/>\n I have come to this community since - while I did not have the chance to play as often as I would like to - I did spend some time luriking at builds websites, where I even remember Pendragon flaming a guy who claimed his dragon shifter build was better than what the community at that website had posted, and despite I've always been silent, I've been an avid reader of Pendragon, HipMaestro, Max Kane, and other contributors; but now I have the time to interact with this awesome community. I must say it was difficult to find the community since at the time it was at another website (had even filters for searching builds by class) and now I'm living in China (censorship takes on even the neverwintervault...).<br/>\n Moving to the request, I think before requesting a specific build I would like to ask for an insight on each class strenghs and weaknesses, either on PvM and specially in PvP, and either for Low-Mid-High magic environments. I know most of you guys must be bored of the PvP since it seems (as HipMaestro said) is all reduced to who casts the Time Stop first, but given I haven't saw that yet with my own eyes I hope you understand my naive enthusiasm.<br/>\n I will make you laugh a bit with my perception of classes so you can enlight this poor noob with some knowledge:<br/>\n - Arcane Archer: haven't explored this class much. Seems to me only good to buff ranged attack dmg.<br/>\n - Barbarian: I haven't explored this class much. Seems to me only as food for mages with some DR in the rage.<br/>\n - Bard: Useful to access RDD and PM with better BAB than others, but (if I don't recall wrong) useless beyond 8 levels given song can get max benefits for combat within those levels. Usefull for skill dumps and UMD.<br/>\n - Blackguard: I cannot understand why would anyone pick this class besides stacking BS or rollplay. Cha to savings can be get by Pally earlier.<br/>\n - CoT: useful for feats, and Divine W. I was surprised to see Max Kane spent time making a build with cheese for it. <br/>\n - Cleric: well, in my few time playing the game I spent most of the time playing high DC caster cleric, and I finished the campaigns just stacking SoVs, but I was not aware Clerics had enough tools to beat high ACs until I read Max Kane guide. Can Clerics beat the highest achievable AC in the game? Which class achieves the highest AC?<br/>\n - Druid: my platonic love. I wonder why no one speaks about creeping doom spell. No SR or Saves allowd capped at 1000 dmg sounds good either in PvM and PvP (with bigby ofc). And above all, grants access to shifter which by roleplay is what I like the most.<br/>\n - DwD: good for stacking DR with RL form. Besides that no idea.<br/>\n - Fighter: for feat starved builds.<br/>\n - Harper:  no clue<br/>\n - Monk: in NWN wikia says it can achieve something like spell immunity stacking SR. What's the cons of going for that? Besides that, I'm well aware of the cheese he brings to the table.<br/>\n - Paladin: smite evil, +saves, and some buffs, but can't think of it like a strong class. Maybe I feel too naked without respectable spellbook.<br/>\n - PM: the immunities it has are obviously strong, but for example - in the undead lord build - Im not sure why would the creater keep going for it ISO feats on fighter. Just for the AC? Wouldn't it be stronger with more feats?<br/>\n - PDK: this can't be seriously useful in single player or PvP. I mean, havent explored it, but has anyone make something respectable out of this?<br/>\n - Ranger: free DW feats, some spells and good BAB. Any other uses?<br/>\n - RDD: free stats, immunities, AC sounds respectable enough to me.<br/>\n - Rougue: skills dumps, SA, UMD, evasion, uncanny dodge.<br/>\n - SD: HiPS, Devensive Roll. Anything else?<br/>\n - Shifter: aaaaaaah.... my rollplay love. I try to take outsider for rakshasa, undead for RL, but I don't think it will be suited for PvM if I don't have full druid spellbook or for PvP at all :(<br/>\n - Sorcerer: can cast = good for me. I have seen the exalted sorceress build and played it in a PvP server, but has anyone tried to get divine shield with this?<br/>\n - WM: for devastating critical lovers, and in my oppinion only good for people who can beat undeads with spells.<br/>\n - Wiz: Spellcasting cheese.<br/>\n After you finish laughing at me, if you ever manage, please try to give this poor noob a better insight on the use of each class, or maybe make a guide with the usefulness of each class in the guide section so it will be easier for noobs to understand the builds they see.<br/>\n Again, happy to meet you all!<br/>\n Cheers<br/>\n  </div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:39 AM - May 14, 2016",
      "content": "<div>Welcome to our little gathering, Orlouge.  Yes, we are small in numbers but large in dedication.  Or perhaps maniacal would be a better adjective?<br/>\n<br/>\n A pretty big bite to try to digest in a single topic so I suggest at least stopping by the <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Main_Page\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki</a> for a more in-depth exam of the class articles, and then ask questions from that point on.  The game is just too big and there are so many customizations being used that there is no real clear-cut absolute nowadays.  Nonetheless, I'll address a few that come to mind.<br/>\n<br/>\n Yeah, PvP vs. PvM.  Well, I have yet to see a single worthy DEDICATED PvP build posted within the ECB and I mean EVER!  Typically, a contributor will claim that a particular build is suitable for PvP but without defining a specific type of adversary, in detail, any PvP build is nothing more than an experiment.  For PvP, you MUST build to dominate a specific combo and/or feat combination or you will always lose more than you will win.  How will a WM DevCritter fare against a PM or Risen Lord?  Pretty poor.  How will any fighter type fare against a hi-level Bigby/IGMS caster?  About as good.  So define the build you are planning to contest and I (and no doubt other guild members) can devise the most effective counter.  Then describe another foe type and plan to optimize another build for that one.  Rinse and repeat.<br/>\n<br/>\n In the same respect... know your hostiles in PvM, cold.  Take any STR build against a mob of Crippling Strike stealthers with advanced AI and you will have huge problems surviving. Just one example, but you get the idea, eh?<br/>\n<br/>\n Now, just briefly, as to your list of classes...<br/>\n<br/>\n In general, all prestige serve as one way to avoid XP penalty within environments where experience is tough/slow to gain, but usually at the cost of prereqs that may be difficult to accrue.<br/>\n<br/>\n AA - the \"king/queen\" of all AB.  An AA will hit when other classes must rely on rolling 20's vs. exalted AC.  Besides that, they need no magical weapon or ammo.  The damage automatically increases by 1 along with the AB for every 2 levels of AA.  An AA can penetrate up to +15 DR with mundane equipment.  Only Epic Warding defies this potential.<br/>\n Barb - best in mid-magic with Terrifying Rage/maxed Intimidate.  Ability boosts are easily negated in environments where ability caps are reachable with equipment/buffs.<br/>\n Bard - Bard song/curse song undispellable.  The classic party enhancer. One of the \"skilled\" classes, dumps to Tumble, Taunt, Spellcraft, UMD, etc.<br/>\n BG - used in place of pally to avoid XP penalty and gain sneaks which stack with rogue &amp; assassin; you'd be surprised at how much fun an evil toon is to play.<br/>\n CoT - the \"king/queen\" of saves especially when combined with pally; excellent smiter<br/>\n Clc - the most overpowered melee class, hands-down.  Higher AB potential than a WM and irresistable divine damage. Potential severely diminished on high-magic.<br/>\n Dru - CD is not party friendly.  If you want to destroy your entire party quickly, cast Extended CD and then \"accidentally\" allow them to melee attack enemies caught in the cloud (i.e.RIP); a \"poor man's\" version of a casting cleric but without the self-buffing potential and a significant alignment restriction; furry pals to play with<br/>\n DwD - By level 5 cannot be flanked; the \"wall\" with EDR feats; dwarves are hairy but cute nonethless, ask any dwarf.<br/>\n HS - 2 cheese bonus feats in epic, usually either Grt CHA or Grt DEX depending on the build; dumps to Disc, Tumble, and stealth like a bard but no UMD<br/>\n Mnk - monk SR cannot be breached so any spell that checks SR fails against a monk focused on SR; the overpowered monk attack progression is legendary; WIS synergy with several other classes<br/>\n Pal - a CHA-based class, which is why you see DvM &amp; DvS in most of those builds; Alignment is a severe restriction unless playing where it can be toggled by the player using a manager or scripted legal shifts<br/>\n PM - I may be in the minority but PM10 is the only advantage I see.  Worthless class anywhere Crit Immune prop occurs on items (mostly belts and armor from my experience); spellcasting is atrocious since penetration is so poor even with 30 levels; pretty much limited to learning spells from scrolls. Never figured the combat potential other than as a party wall.   Can't hit much of anything and gimped APR; often banned along with DevCrit on mid-magic or lower.<br/>\n PDK - yeah, the PDK 3 low-STR irresistable Auto-fear DC 127 vs. Will exploit.  What a waste of a valuable class slot IMO.  Won't affect mind-immunes like undead. constructs, elementals, etc. so what's the point, wh?<br/>\n Rgr - BoE along with enough FEs will help a dedicated Dexer do respectable damage and a bit more AB vs FEs.; a way to get ambidexterity without DEX 15.<br/>\n RDD - ask Empyre.  He specializes in RDD builds.<br/>\n Rog - IMO the single-most useful class for a designer of NWN builds... solves so many problems and without prereqs or alignment restrictions.<br/>\n Shf - My fav, too.  Unfortunately, the merge gimps the class too much on high-magic to take it seriously and that includes Dragon Shape's puny +6 DR penetration when other toons are using +10 to +20 weapons.<br/>\n WM - the \"king/queen\" of intrinsic melee AB (self-buffing Clc higher potential); problem is... after WM19 all the bonus feats suck.; should be called \"CM\" (crit master).<br/>\n<br/>\n I am intentionally bypassing the sorc vs. wiz debate because the few times I've tried sorc, I felt it cramped my tactical style in most situations so will leave it to others to deliberate on the benefits.   I also find losing all the bonus feats a serious gimp to an aspiring high-level caster.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:37 AM - May 14, 2016",
      "content": "<div>RDD is indeed a favorite of mine. Ten levels of RDD gives you +8 STR (+4 AB and damage), +2 CON (+40 health and +1 Fortitude saves), +2 INT (more skill points), +2 CHA, +4 AC (often forgotten), and immunity to Fire, Paralysis, and Sleep. You also get wings that some people love and some people,hate, and dragon breath that is generally considered unimpressive in epic levels.</div>",
      "author-color": "#00AA00"
    }
  ]
}