{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "264",
  "name": "Embarrassed",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/embarrassed-t2317143.html",
  "author": "10235326",
  "avatar": "no_avatar.png",
  "replies": 2,
  "posts": [
    {
      "author": "10235326",
      "avatar": "no_avatar.png",
      "timestamp": "5:02 AM - Jan 26, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Wow, I feel really dumb. <br/>\nSo I was bored today and decided to take a foray back into NWN playing on some old PWs. I immediately went back to the Epic Character Builders search engine to bring back some build ideas. All day I've been using this archive: <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/buildsearch/\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhawk/buildsearch/</a> and forums while thinking this community of builders has unfortunately been looong dead and gone. I just randomly stumbled across these forums from a Google search and after my initial joy I thought this looked familiar. So I entered a typical login name and password I use and sure enough I've been here before. D'Oh! Can't believe I forgot!<br/>\n<br/>\nAnyways, on to a real question I have. <br/>\nI've never played a Dragon Shape build before but I would like to try one on my PW. I've been looking through that old archive and realized that most of those builds are 5+ years old and some are probably illegal after 1.69.  So I'm wondering what the best current Dragon Builds are (if there are any)? <br/>\n<br/>\nSorry if this is a noobish question, or the improper place to post...or if this has been addressed somewhere else. I've been out of the game for awhile.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:39 AM - Jan 26, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is the perfect place to post this question, mate. Welcome to the new ECB. I have to tell you that the Dragon Shape builds pre-1.69 are probably all illegal because as of 1.69 18 levels of Druid are necessary to obtain it, whereas before only 14 were required. I have one such build, which is inspired by many others but it's not very playable for the non-experienced, so I wouldn't recommend it to you. However, it can serve you as a rough guide. What I would suggest in order to make this build more playable would be to drop 4 Druid levels for 4 Monk levels, and go 12 Druid 4 Monk 4 CoT pre-epic. That way you will have Wisdom bonus to AC from the start. Also, you won't need KD and IKD, which you can then swap for Disarm. If you feel comfortable with your NWN skills and Druid usage in general, then you can try to use it as described in the build's original post.<br/>\n<br/>\nThe last thing is, I wrote a guide on druids, to which I will also refer you the link. So here it goes:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/champion-of-the-wilderness-druid-28-cot-10-monk-2-t515398.html\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.44.forumer.com/champ ... 15398.html</a> is the link to the build<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/nature-s-strongest-defenders-a-guide-to-druids-t515540.html\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.44.forumer.com/natur ... 15540.html</a> is the link to the guide.<br/>\n<br/>\nHave fun, brother!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "10235326",
      "avatar": "no_avatar.png",
      "timestamp": "8:00 PM - Jan 26, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah, thank you Maximillian!<br/>\n<br/>\nI've been pondering some combination of Druid/Monk/ClassX (maybe Cleric, DD, PM, CoT, Shifter, etc.). I'll take a look at your build and see what I can do. Dragon Shape by level 31 is nice. <br/>\n<br/>\nI'm confident in my NWN playing skills, however I haven't played a Druid-based character in forever. I actually found and read that Druid guide yesterday as well. Very well written mate!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}