{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "247",
  "name": "what class is a Cleric killer?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/what-class-is-a-cleric-killer-t2195463.html",
  "author": "Templar",
  "avatar": "10235261_1528181864.jpg",
  "replies": 19,
  "posts": [
    {
      "author": "Templar",
      "avatar": "10235261_1528181864.jpg",
      "timestamp": "8:08 AM - Jan 31, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">so ... i was thinking, cleric is usually the recognized power build without doing much to it.  typically the same for mages...<br/>\n<br/>\nSo if you were going to make a toon that was going to specifically be built to kill clerics... what would it be? another cleric? a wizard? pure? mostly pure? your thoughts?<br/>\n<br/>\nMy own thoughts are that the only one with a real chance to kill a cleric taking out the suprize factor is a wizard or another cleric but I've limited pvp experience as I focus on PvE mostly.<br/>\n<br/>\nYour thoughts?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:59 PM - Jan 31, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">With default DevCrit available?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Templar",
      "avatar": "10235261_1528181864.jpg",
      "timestamp": "9:55 PM - Feb 01, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">unavailable sadly<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:30 AM - Feb 02, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Templar wrote:</strong>unavailable sadly</div></blockquote>\nThen you are going to need to define the specific environment since it is not a vanilla one.  There is no \"magical\" recipe and it requires the build user to be comfortable with the combat strategy or even the most \"uber\" build will fail miserably.<br/>\n<br/>\nI would expect, though, that some sort of high level STR monk spamming IKD would cause some major problems along with high saves, high SR, &amp; all the other typical monk boni.  At least it wouldn't need to be concerned with damage shields or Time Stop. Or are you talking about something other than a pure cleric?<br/>\n<br/>\nClerics come in all sorts of flavors so you would probably need to design one to counter a specific cleric build.  Harmer, Battle Priest, Blade Spawner, Imploder... there are too many different approaches to playing cleric to expect a one-size-fits-all counter.  Then chuck the countless customizations available (like DevCrit bans!) into the mix and the design would need to deal with all those potentialities.<br/>\n<br/>\nWhen I use to duel regularly I always built to win against a single build.  When they showed up with a variant, I would usually bring a slightly modified version.<br/>\n<br/>\nI also do not know what you mean by \"no surprize factor\". Wuts dat?  Walk twenty paces, turn and attack?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "furate",
      "avatar": "no_avatar.png",
      "timestamp": "1:29 AM - Feb 02, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">templar is probably speaking of arelith, where the pvp rules prevent surprise?<br/>\n<br/>\nlike hipmaestro said, you can't just ask \"what beats clerics\" and then add factors in later. \"no devcrit\" and so on. you need to specify -everything- beforehand because all the little details matter. depending on restrictions on level, feats, items the answer will be very different. along with what spells have been changed and how and so on.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "6:38 AM - Feb 05, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">To beat a cleric?  You could try Prayer.. oh wait.  My bad.  The gods are on their side.  <br/>\n<br/>\nYou just have to beat their SR (if they have it up).  Breech or dispel their buffs.  Then take them down from a DISTANCE (because, up close, even with all spells gone, they can still cast 2 and get back much of their damage potential).  Of course, they also could have Hold Person mem'd, which would mess you up without appropriate protection (dont ask me! I have yet to cast that spell).  <br/>\n<br/>\nSo isnt that special!  A sorc or a wizard      That said, having played a few clerics, after level 30, even with casters against me (pvm) i had few spells actually hit my toons...  so maybe PRAYING is best!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Demos",
      "avatar": "no_avatar.png",
      "timestamp": "3:35 AM - Feb 08, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong><br/>\nI would expect, though, that some sort of high level STR monk spamming IKD would cause some major problems along with high saves, high SR, &amp; all the other typical monk boni.  At least it wouldn't need to be concerned with damage shields or Time Stop. </div></blockquote>\n<br/>\nNot that it would be a given but this probably gives you the best chance.<br/>\n<br/>\nAssuming a lev 30 world like Arelith, a pure cleric can beat an SR of 50, 56 with the penetration feats.  A lev 30 monk has a base SR of 40 and can take up to 6 Improved Spell Resistance feats.  This gets you up to an SR of 52, so you're fine if you're not fighting a pure caster cleric (SR wise, you could drop 1 Improved Spell Resis and grab Epic Weapon Focus if you want to risk 5% of spells getting through).  Against a pure caster, he/she will have a 25% getting spells through so hope those IKD's land quick.  <br/>\n<br/>\nAnother anti-cleric option is the Arcane Archer.  Something like a Fighter 5 / Bard 6 / AA 19 or Monk 6 / Wiz 5 / AA 19 (not sure of the optimal 30 level spread, but AA 19 gives you the last available AB bonus) with Rapid Shot, Called Shot, 14d6 imbue arrow damage (clerics aren't known for their reflex save).  The Fighter option gives you WS/EWS while the Monk version can get you faster movement, free IKD and WIS AC bonus.<br/>\n<br/>\nI'm sure there are other options as well.<br/>\n<br/>\n<strong>EDIT</strong>: Corrected SR penetration numbers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:56 PM - Feb 08, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Templar wrote:</strong>so ... i was thinking, cleric is usually the recognized power build without doing much to it.  typically the same for mages...</div></blockquote>\nI believe you answer your own question. You can beat a caster cleric with a better caster and a buffer cleric with a debuffer. The arcane spell repertoire has what it takes to kill most things, also clerics. First of all, never leave home without your buffs up. Use Breach/Mord and Bigby to debuff and stop, IGMS to wear down HPs and haste/TS to buy you enough time. Against an \"econo cleric\" meleer you can also try the shapechange/damage shield combo, preferably after dispelling him. GS/BBOD will work as long as you are undispellable and your opponent forgot to memorize dismissal. Against a counterspeller, a hasted sorcerer  can pour out spells at a high rate and will either outpace or outlast a cleric of equal level.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "furate",
      "avatar": "no_avatar.png",
      "timestamp": "1:30 AM - Feb 09, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">it all depends on the variables. if the bigbys have a save from the servers side like arelith then they might not and pure blaster sorceror could be countered by having lots of scribe scrolled heal spells for example. if it even gets to that, an in your face cleric who is also built for it well enough could kill the sorceror before getting damaged too much..... question is not how to beat caster clerics they are easy you just get saves to resist implosion and youve beat them.... arcane archer works wonders as well as the monk though that might have a hard time hitting the ac but the cleric will eventually die<br/>\n<br/>\nnone of the above are what you would call \"\"hard\"\" counters to a cleric built to fight not cast spells but sure enough they have a chance.... there are no real \"\"hard\"\" counters it all comes down to what exactly the build is and who plays their build better.... i would go with dragonshaper and a wizard or sorceror for having the best chances...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:22 AM - Feb 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>furate wrote:</strong> if the bigbys have a save /.../ like arelith...</div></blockquote>\nThis is a general discussion forum thread and the OP did not mention any setting other than vanilla NWN pvp.\n<blockquote><div>pure blaster sorceror could be countered by having lots of scribe scrolled heal spells for example.</div></blockquote>\nA hasted sorcerer spamming Time Stop will not give the cleric time to act.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "furate",
      "avatar": "no_avatar.png",
      "timestamp": "5:19 PM - Feb 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">actually they did. look at the OP's second post, dev crit not available... clearly not vanilla.<br/>\n<br/>\nyes, if timestop can be spammed in the setting that the OP wants to know the counter in<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:07 PM - Feb 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, \"OP\" can be interpreted as either Original Post or Original Poster depending on context.  In Mick's case, I suspect he means the former, in which case he is quite correct. \n<blockquote><div><strong>Templar wrote:</strong>so ... i was thinking, cleric is usually the recognized power build without doing much to it.  typically the same for mages...</div></blockquote>\n...the discriminating word here being \"usually\".  <br/>\n<br/>\nUnless one is a regular player of Arelith, \"usually\" does not equate to the Arelith server.  Later on in the thread, we have been given a few clues as to the scope of the original question, but unfortunately not enough to make a quantitative suggestion (IMHO).<br/>\n<br/>\nIf Templar is still visiting us, I would suggest editing the topic title to read as \"[Arelith] what class is a Cleric killer?\"<br/>\n<br/>\nThat would avoid any innate confusion in a General Discussion forum.  I believe someone already started an Arelith-only topic in the PW section.  Either in that one or another Arileth-related PW topic would have been more appropriate (again, IMHO).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Hafen",
      "avatar": "no_avatar.png",
      "timestamp": "1:02 PM - Aug 13, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have got cleric 19/5 fighter/2 rogue and i can said, my AC is equal to the warriors AB only with vestment which cannot be dispelled. (IC 42 AC which i cannot loose by spell breach or dispel spells). <br/>\nFully buffed (but not hasted) her AC is 46, ab 40-43. <br/>\n<br/>\nShe can use scrolls and wands. Without dispel most meleers cannot almost touch her, do not forget I can dispel you too, and then just one spell and you die (harm). The only issue with meleers are timestop scrolls or random critical on natural 20 passing through AC and 50% conceal....<br/>\n<br/>\nThe biggest problem i encoutered are AA, who are faster than my character. They usually shot her without much troubles no matter what spells I put up. But, i met these pesky archers only in the area with brigdes (vault for Templar he will know) where they could run all around on narrow path and shoot from two or three screens away.<br/>\n<br/>\nThe nemesis are wizards. Maximized IGM, timestop, Great ruin/hell ball, IGM to finish off. If cleric survives, just add IGM before can cast heal spell. <br/>\n<br/>\nCleric versus cleric: spell breach scrolls and wands are neccesary. The fastest way to kill anyone is to remove negative protection, harm, and poke it. <br/>\n<br/>\nPerhaps barbarian fear shout could work well, but i have never encoutered it.<br/>\n<br/>\nThat said, I am newbie in pvp and my character is not fully optimized, many errors and such i did in past and lack top gear. But i manage to win if not outnumbered for now (the fact i buffed myself and just watch most meleers trying to hit me without any success leaves me no mood to play meleer<img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /> ).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "furate",
      "avatar": "no_avatar.png",
      "timestamp": "7:02 PM - Aug 18, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">any good melee build would destroy that cleric build though, 46 ac is not very much   more or less mundane melee ers can get 46-50 ab with just +12 strength for example, not to mention dispels will completely destroy any offensive capabilities you have<br/>\n<br/>\nany good weaponmaster build will win against a battlecleric like that, if he has a few mords scrolls<br/>\n<br/>\nharm is good no doubting that, but a wand or potion of negative energy ward will allow your enemy to buff himself with it faster than you can dispel it<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:18 PM - Sep 11, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would definitely say that there's nothing better to kill a Cleric than another Cleric, perhaps a better built Cleric<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "furate",
      "avatar": "no_avatar.png",
      "timestamp": "11:14 AM - Sep 16, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">there are definitely better options, depending on the server<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:14 AM - Sep 27, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just too general a question to serve up any viable all-encompassing answer.  On some high-magic servers, cleric levels are wasted when ability and skill caps can easily be met and immunities to divine spells abound.  Typically, any class that is able to use a standard non-nerfed Timestop via class or UMD and wins the first casting will always win a duel for what should be obvious reasons. But vs. seriously save/SR-twinked monsters, any casting class is futile.<br/>\n<br/>\nThe answer MUST be tempered according to what items are available on the server, even for PvP.  In general, AA's can hit just about anything and with enhanced arrows can cause havoc from screens away, well out of casting range.  And there are a handful of DevCrit AA's out there that do not need to be concerned about damage.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "King Midas",
      "avatar": "no_avatar.png",
      "timestamp": "8:09 PM - Sep 16, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">On Arelith you can only cast time stop once.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Templar",
      "avatar": "10235261_1528181864.jpg",
      "timestamp": "6:12 PM - Sep 19, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for all the input! I will continue to suggest these and other tactics. we have a drow rebelion against the priestess's of lolth in the plans<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:26 AM - Apr 27, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This question reminds me of a question often asked back then in WoTC OP Forums, but for Wizards instead.<br/>\n<br/>\nWell at least for this one, a Clerc's and generally everything's killer is just a Sorcerer, DnD is/was/will be like this forever, in NwN nothing can opose Time Stop +3 IGMS Maxed, except perhaps Puff the magic dragon<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}