{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "011",
  "name": "The power of malevolence: A practical guide to the Blackguard Prestige Class, for the builder",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-power-of-malevolence-a-practical-guide-to-the--t2355083.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "2",
  "views": "8.7K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:52 PM - Jun 22, 2019",
      "content": "<div><span style=\"font-size:175%;line-height:normal\"><strong>The power of malevolence: A practical guide to the Blackguard Prestige Class, for the builder</strong></span><br/>\n<br/>\nGreetings to all ECB'ers!<br/>\n<br/>\nI am writing this guide because I have not found any practical guides regarding the use of the Blackguard Prestige Class in Neverwinter Nights 1, and I have played quite a few hours using Blackguard class characters. There are plenty of information on the basic statistics of what is required to become a Blackguard and the stats / abilities obtained however not a lot of detail on how this could be applied in-game. My focus will be on the practical application of Blackguard in game rather than getting bogged down in the stats and abilities. If you want to read that, the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Blackguard\" rel=\"noreferrer\" target=\"_blank\">Neverwinter Nights Wiki page</a> is a great resource. <br/>\n<br/>\nAs always, I have no doubt there are much more experienced Blackguard'ers out there, and if you are one of those, feel free to comment on this post! Perhaps I have missed something vital or you disagree with something I have written. I'm totally fine with it. I hope you enjoy what I hope is a unique contribution that adds to your knowledge of NWN 1.<br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:175%;line-height:normal\">Roleplaying a Blackguard Effectively</span></strong><br/>\nNeverwinter Nights is an RPG - a roleplaying game. It is important to know what a Blackguard should be and what it isn't. It is important to get an accurate image of the True Black Knight to ensure you role play your character correctly. <br/>\nThere are many misconceptions about what a Black Knight is in modern day culture. A true NWN Blackguard is pure evil, malevolent, totally embracing the forces of darkness to achieve malicious type goals such as the total annhilation of her former homeland because they executed a naive elf cleric. Here are some pictures so you get a visual of what is expected (and they say, a picture says a thousand words): <br/>\n<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_287447eb2b3bee5687749b467c25ff37_t.jpg\"/><br/>\n<em><span style=\"font-size:50%;line-height:normal\">Source: <a class=\"postlink\" href=\"https://sigil-nwn2.fandom.com/wiki/Blackguard\" rel=\"noreferrer\" target=\"_blank\">https://sigil-nwn2.fandom.com/wiki/Blackguard</a></span></em><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_98df4788b771fc92a050b3ab38005153.jpg\"/><br/>\n<span style=\"font-size:50%;line-height:normal\"><em>Source: <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Aribeth_de_Tylmarande\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Aribeth_de_Tylmarande</a></em></span><br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">What a Blackguard is not:</span></strong><br/>\nThis guy, although he is called a 'Dark Knight' and does breaks the law, he definitely tries too hard to be good. He's definitely more chaotic good than true evil:<br/>\n<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_a6e623a2998ba8da27183660d7134457_t.jpg\"/><br/>\n<br/>\n<span style=\"font-size:50%;line-height:normal\"><em>Source: <a class=\"postlink\" href=\"https://www.polygon.com/2019/3/13/18263948/the-dark-knight-trilogy-imax-batman-anniversary-tickets\" rel=\"noreferrer\" target=\"_blank\">https://www.polygon.com/2019/3/13/18263 ... ry-tickets</a></em></span><br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Maybe he is a Blackguard but he's a little too comedic for our tastes...</span></strong><br/>\nThis is for our Monty Python fans out there. Please note, the video may not be suitable for young audiences or to watch at work. <br/>\n<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/s35rVw1zskA\" style=\"background:url(https://i.ytimg.com/vi/s35rVw1zskA/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><br/>\n<a class=\"postlink\" href=\"https://www.youtube.com/watch?v=s35rVw1zskA\" rel=\"noreferrer\" target=\"_blank\">The Black Knight - Monty Python</a><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_80aac59366fd5de4ba73a68a676230e4.jpg\"/><br/>\n<span style=\"font-size:50%;line-height:normal\"><em>Source: <a class=\"postlink\" href=\"https://www.pinterest.com.au/pin/781022760347707998/\" rel=\"noreferrer\" target=\"_blank\">https://www.pinterest.com.au/pin/781022760347707998/</a></em></span><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_f57647628fc6c935db89d5c04d6d3ce6.jpg\"/><em><span style=\"font-size:50%;line-height:normal\">Source: <a class=\"postlink\" href=\"https://www.thetimes.co.uk/article/monty-python-scripts-pink-knight-comedy-would-now-have-no-place-in-pecking-order-xdxp7vxbc\" rel=\"noreferrer\" target=\"_blank\">https://www.thetimes.co.uk/article/mont ... -xdxp7vxbc</a></span></em><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_54a9e437ae342b847b141fb876b5e8f5.jpg\"/><br/>\n<em><span style=\"font-size:50%;line-height:normal\">Source: <a class=\"postlink\" href=\"https://www.pinterest.com.au/pin/433330795377636430/\" rel=\"noreferrer\" target=\"_blank\">https://www.pinterest.com.au/pin/433330795377636430/</a></span></em><br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:175%;line-height:normal\">What does Blackguard give you, that is useful</span></strong><br/>\nBlackguard provides enhancement of combat abilities of characters, of which the following I have found most useful:<br/>\n- A prestige class that does not affect the multiclass XP penalty<br/>\n- Free access to simple weapons, martial weapons, light armor, medium armor, heavy armor and shields with a single level. Unlike Champion of Torm (CoT), you do not need to take a weapon focus in a melee weapon, and you get access to the heavy armor feat, which CoT does not.<br/>\n- Maximal base attack progression which allows some classes (ie Monk, Bard and Cleric) to access the maximal attacks per round with at least 4 pre-epic levels<br/>\n- Access to Dark Blessing at level 2, which adds your charisma bonus to all saving throws. This stacks with the saving throw bonus from Paladins (Divine Grace), and does not count to the +20 cap for saving throws (unlike Champion of Torm).<br/>\n- With at least 3 levels, access to Divine Might and/or Divine Shield abilities (which add your charisma bonus to damage and armor class respectively). This very useful for characters with high charisma who want these abilities but who do not have access to these feats (such as Bards or Sorcerers)<br/>\n- Ability to cast two summons, one undead and one outsider. These are excellent 'cannon fodder' which can soak up damage from spells or other abilities, or distract enemies while you sneak attack them. You can cast one of each per day, but they cannot exist at the same time. If you take the Epic Fiendish Servant Feat, your outsider summon will scale as you advance in Blackguard levels. <br/>\n- Ability to cast Bull's Strength, which will stack with other versions of Bull's Strength (ie you can stack Cleric and Blackguard Bull's Strength for a double bonus)<br/>\n- Ability to sneak attack, which is very strong if you do a lot of attacks (such as a Monk build)<br/>\n- Access to Taunt, Discipline and Persuade as class skills<br/>\n<br/>\n<strong><span style=\"font-size:175%;line-height:normal\">What does Blackguard give you, that is not useful</span></strong><br/>\n- The Inflict Serious Wounds and Inflict Critical Wounds are pretty much useless for a combat focused character, as it is a melee range touch attack, your attacks will do much more damage and will not provoke an attack of opportunity, and there is a will save for half damage (DC 10 + Blackguard level + constitution modifier). It is also pretty much useless for a caster, as it is a melee range touch attack, and requires you to have a high enough attack bonus for it to land, and undoubtly you will have other spells which will deal more damage. <br/>\n- Contagion sounds cool in theory, but I have never found this ability useful in game<br/>\n- Having to be Evil means you are very susceptible to the Paladin's and Champion of Torm's 'Smite Evil' ability. For example during Aielund Act 3, there are a group of angels in a tomb who did a huge amount of damage to me as an Evil character with these abilities (I pretty had to try to get them to focus my companions and run away whenever they tried to attack me) <br/>\n- If you have a negative Charisma modifier, you will lose points on your saving throws as unlike Divine Grace, Dark Blessing will cause this to occur.<br/>\n<br/>\n<strong><span style=\"font-size:175%;line-height:normal\">What might be useful but I am unsure</span></strong><br/>\n- Use poison is almost certainly very strong but I haven't had time to play test this sufficiently. I have written a <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=15445#p15445\" rel=\"noreferrer\" target=\"_blank\">mini-guide on the topic of poisons</a>. If you have found use poison helpful, please leave a comment, as this would be helpful for other NWN players to know.<br/>\n<br/>\n<strong><span style=\"font-size:175%;line-height:normal\">When to take Blackguard and what classes work well</span></strong><br/>\nHere a few classes that I think work well with Blackguard (and I will put a few points as to why):<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Combat focused Cleric with Trickery Domain (ie Strength, Dexterity or Charisma based builds, Wisdom?)</span></strong><br/>\n- Cleric provides tremendous enhancement of combat ability with Divine Favor, Bless, Aid, Divine Power, Battletide, Bull's Strength, Endurance and many other abilities. Both Cleric and Blackguard can access Divine Might and Divine Shield, which Cleric can buff the Charisma statistic even further with Eagle's Splendor. A primary class Blackguard that uses cleric for buffs will run into trouble against enemies who can dispel your buffs however. This is because of low cleric caster levels. (ie it is not hard for a level 40 wizard to remove level 8 cleric buffs)<br/>\n- Blackguard levels add to your BAB allowing you to not have to rely on Divine Power as much to maximise your attacks per round. There is great synergy between the Sneak Attacks of the blackguard and the invisibility provided by the Trickery Domain. For example you could cast invisibility 5-6x / day and sneak up to high priority enemies such as Mages and eliminate them rapidly, then cast invisibility again to escape. Rinse and repeat. I've posted a potential Cleric/Blackguard/Monk build here. <br/>\n- The Bull's Strength provided by Blackguard stacks with that provided by Cleric. <br/>\n- I am unsure how a Wisdom based Blackguard Cleric would work, but I suspect you would want to take the Zen Archer feat and shoot them with a bow. With sneak attacks from Blackguard and your Divine Might and Divine Favor buffs this might not be terrible.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Bard</span></strong><br/>\n- Bard/Blackguard is pretty popular in conjunction with Red Dragon Disciple (RDD). A common primary blackguard build is Bard 8/RDD 10/BG 22. If you want to go primary bard, then you could go Bard 26/BG 4/RDD 10.<br/>\n- At least 4 levels of Blackguard pre-epic will allow you to access the maximal number of attacks per round as a Bard.<br/>\n- Blackguard provides Dark Blessing and access to Divine Might and Divine Shield, which combined with the Bard's naturally high Charisma statistic, and the Bard's ability to cast Eagle's Splendor is quite strong. Blackguard also provides extra hitpoints, access to martial weapons, medium armor, heavy armor and shields.<br/>\n- Bard provides multiple casts of invisibility which synergises extremely well with Blackguard Sneak Attack provided you have the Still Spell feat to avoid Arcane spellcasting failure.<br/>\n- Bard provides a whole bunch of other abilities such as Keen Weapon, Bard Song, Curse Song, Mage Armor, Bull's Strength etc which is super strong in any build, as well as access to the Red Dragon Disciple Class, which provides tremendous immunities, natural AC, and +8 to Strength +2 Constitution +2 Intelligence and +2 Charisma. <br/>\n- Unlike Paladin, a Bard/Blackguard does not require any alignment changes to be valid.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Monk</span></strong><br/>\n- A single level of Monk, after level 1, provides Cleave for free (a pre-requiste), and allows you to skill Hide 5 ranks as a class skill. So if you are an evil character, Monk gives you access to Blackguard pretty much for free.<br/>\n- At least 4 levels of Blackguard pre-epic will allow you to achieve the maximal attacks per round as a Monk, and provides sneak attack. An improved Knockdown (or simply your summon distracting them) plus 7-10 sneak attacks can be lethal. If you do 7-10 attacks, even 1d6 sneak attack is very powerful, not to mention Use Poison (which I haven't tried, but in theory this is extremely powerful). <br/>\n- It provides you access to heavy armor, shields, simple and martial weapons although these will disable your Monk abilities and is not great synergy as such. <br/>\n- Dark Blessing could be bad if you have a negative charisma modifier, as unlike Divine Grace which Paladin's get for free at level 1, Dark Blessing reduces your saves when you have a negative Charisma modifier.<br/>\n- The Evasion feat Monk gets for free, which synergises well with Dark Blessing, if you have a positive Charisma modifier<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Paladin</span></strong><br/>\n- The main downside is the need to change alignment from Lawful Good to Evil, which could be difficult. I understand some servers will not allow characters who have classes that require alignment change to be loaded into their modules.<br/>\n- Both Divine Grace and Dark Blessing stack, meaning you get +2 to saves per Charisma modifier point if you have a positive Charisma modifier.<br/>\n- The Paladin abilities Eagle Splendor and Aura of Glory can further buff your Charisma, making your saves, Divine Might and Divine Shield even stronger.<br/>\n- Bull's Strength (Paladin) and Bull's Strength (Blackguard) also stack.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Sorcerer</span></strong><br/>\n- A sorcerer will have naturally high Charisma. Two levels of Blackguard provide Dark Blessing, which will add +1 to saves per Charisma modifier point. A single point in Paladin would be potentially a much easier investment however, if you meet the pre-requisites.<br/>\n- In theory Divine Might and Divine Shield could be very strong with such a high Charisma modifier. I haven't tried it, however HipRedux has posted a Sorcerer 22/Blackguard 11/Monk 7 build which may interest you, which I have listed at the end of this post. <br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Rogue</span></strong><br/>\n- This is a nice combination as it provides good BAB progress pre-epic, allowing access to 4 attacks per round with four pre-epic levels, as well as Bull's Strength and Use Poison, access to most weapons, armor and shields and an extremely powerful sneak attack.<br/>\n- Blackguard provides access to Divine Might but such classes will usually not have high Charisma scores.<br/>\n- Dark Blessing could be bad if you have a negative charisma modifier, as this would reduce your saves.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Fighter / Ranger / Barbarian</span></strong><br/>\n- Essentially Blackguard gives you Bull's Strength, and access to sneak attack without damaging your BAB at pre-epic levels. Sneak attack and an effective knockdown ability is pretty lethal with a high attack bonus. This is an ok combo, but I personally think at epic levels I would encourage considering Assassin or Rogue levels, as these classes you choose at Epic levels does not affect BAB progression, only character progression does, and these classes would probably provide so much more including Tumble and Use Magic Device. <br/>\n- Ranger is quite interesting in that you get ambidexterity/two weapon fighting for free at level 1 and improved two weapon fighting for free at level 9. Multiple attacks synergise well with sneak attack. However rangers tend to benefit from high levels in their primary class and to be honest you probably would gain more from Assassin or Rogue which would strengthen sneak/death attack faster.<br/>\n- Dark Blessing could be bad if you have a negative charisma modifier, as this would reduce your saves.<br/>\n- Blackguard provides access to Divine Might but such classes will usually not have high Charisma scores.<br/>\n<br/>\n<strong><span style=\"font-size:175%;line-height:normal\">Using Blackguard as a minor class</span></strong><br/>\nProbably the optimal way to use Blackguard as a minor class, is to take <span style=\"text-decoration:underline\">four levels pre-epic </span>(ie before level 21). Four levels of Blackguard is kind of a nice sweet spot. This allows you to take advantage of its maximal BAB progression pre-epic (which allows you access to four attacks per round for medium BAB progression primary classes such as Cleric, Monk and Bard) provides access to Dark Blessing and Bull's Strength, provides access to Divine Might (and/or Divine Shield), and gives you 1d6 sneak attack, which is strong in multiple attack builds (ie Monk), less strong in builds with less attacks per round. <br/>\n<br/>\nFor a sorcerer (I must confess I have not taken a sorcerer character that high level) I would humbly suggest only taking two levels for Dark Blessing, in characters that cannot take a single level of Paladin, for the saves and ability to skill discipline as a class skill, as I would not want to weaken that characters spell casting significantly. <br/>\n<br/>\n<strong><span style=\"font-size:175%;line-height:normal\">Using Blackguard as a primary class</span></strong><br/>\nPrimary class Blackguard gives you a bonus feat and 1d6 sneak attack every 3 levels after level 10, as well as Epic Fiendish Servant at Level 16 (you can only take this as a bonus feat at level 16 onwards). So good levels to stop leveling Blackguard as a primary class when designing builds are levels 16, 19, 22, 25 and 28 . You gain very little by leveling Blackguard to 30. Having high levels (compared with a minor class) in Blackguard means your sneak attacks are strong and your fiendish servant is a useful summon throughout the game.  I would argue levels 22, level 25 and level 28 are suitable sweet spots to stop leveling Blackguard. Level 22 allows you to skill Armor Skin, Epic Prowess, Epic Fiendish Servant, Epic Weapon Focus as bonus feats (ie for free). Level 25 gives access to the improved sneak attack feat as a bonus feat, if you do not get sneak attack from rogue, for 9d6 sneak attack total, and your Epic Vrock is just a little stronger. Level 28 gives you 11d6 sneak attack (with two improved sneak attack bonus feats) and a slightly stronger Epic Vrock.<br/>\n<br/>\n<strong><span style=\"font-size:175%;line-height:normal\">Gameplay as a Blackguard</span></strong><br/>\nYou can play a minor class Blackguard with a focus on any attribute that your primary class needs, but obviously you will want to have a reasonable charisma score to take make adequate use of Dark Blessing, Divine Might and Divine Shield. I would suggest 14 as an absolute minimum with a view to increasing it further to at least 16, and further buffing it with items / spells / other buffs.<br/>\n<br/>\nA primary class Blackguard can focus on Strength, Dexterity (if you use melee weapons you will want Weapon Finesse), Charisma, Hybrid Strength/Charisma or Hybrid Dexterity/Charisma. Strength will increase your AB, Damage and carrying capacity. Dexterity will increase your AB, Armor Class and Reflex saves. Charisma will increase your damage and armor class but only when DM and DS are activated. Regardless of how you manage your build, a Primary Blackguard will want a reasonable charisma score regardless of how you manage your Blackguard's attribute score to make use of Dark Blessing, Divine Might and Divine Shield. The worst thing is to not invest enough into charisma with these abilities, and have them last such a short duration you have to cast it multiple times or run out of casts.<br/>\n<br/>\nBlackguards play best when they can use their sneak attack ability. This can be achieved through:<br/>\n- your enemy focusing another target, such as your summon, or a companion<br/>\n- your enemy being knocked down, which could be through your own knockdown ability, your summon's knockdown ability (the Vrock/Epic Vrock has knockdown as a feat) or a companion<br/>\n- magical invisibility which could be provided from Bard, Cleric, Assassin, potions or items<br/>\n- stealth which could be provided from Rogue, Monk, Assassin or Shadowdancer - this is probably the least useful way to get your sneak attacks in, unless you have Hide in Plain Sight.<br/>\n- <strong>ranged weapons</strong> (this is not obvious, but can be very useful!)<br/>\n<br/>\nIn addition, before you start hitting them, you will want to use Divine Might and Divine Shield if your charisma is sufficiently high, to deal extra damage and increase your tankability. <br/>\n<br/>\nBuilds that have multiple attacks take enormous advantage of both the sneak attack damage and the additional divine damage from Divine Might. This is why builds that involve high numbers of attacks per round such as dual wielding / improved two weapon fighting (ITWF) or monk builds (or dual kama ITWF monk builds) tend to be mean any enemy vulnerable to sneak attacks essentially dies to your blows in one or two rounds. You totally mow them down like the big bad sneaky Blackguard you are. This obviously depends on how much sneak attack you have. Even if you have 1d6 sneak attack from taking Blackguard as a minor class, an additional 6d6-10d6 damage is no joke, its like the damage from a level 7 to level 15 Ice Storm spell or a level 8 flame arrow being added to your damage per round to your opponent. Or 3-8 hit die.<br/>\n<br/>\nBuffs from the Cleric and Bard classes are very strong in allowing your Blackguard to 'stand and fight' for long periods. These are spells such as Ghostly Visage, Improved Invisibility, Ethereal Visage, Mage Armor, Shield, for example. You could also conceivably cast your spells / Divine Might / Divine Shield whilst invisible, cast your summon to draw aggression, then break invisibility to annhilate high value targets with sneak attacks. The main downside for a primary Blackguard is that such abilities can be easily dispelled by enemy spell casters. For a secondary Blackguard this is less of a problem, particularly <br/>\n<br/>\nAgainst enemies who are immune to sneak attack your attack power is substantially diminished and you will have a tougher time. This is obviously more of a problem for primary class Blackguards than minor class Blackguards. You will be relying on your Divine Might/Divine Shield, other class abilities and your basic combat ability to win fights. <br/>\n<br/>\nAgainst enemies with Smite Evil you will need to be very careful. One or two Smite Evil's against you could be the death of you!<br/>\n<br/>\n<strong><span style=\"font-size:175%;line-height:normal\">Blackguard builds</span></strong><br/>\nHere are a quite few sample Blackguard builds in our forum that I would suggest are worth a read!<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Pre-epic character level 20 builds</span></strong><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/divine-bomber-bard8-aa9-bg3-t2350273.html\" rel=\"noreferrer\" target=\"_blank\">Mick Dagger's Divine Bomber - Bard 8/Arcane Archer 9/Blackguard 3</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-shadow-knight-fighter-6-rogue-4-blackguard-10-t2351793.html\" rel=\"noreferrer\" target=\"_blank\">Valefor's The Shadow Knight - Fighter 6/Rogue 4/Blackguard 10</a><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Epic character level 40 builds: </span></strong><strong><span style=\"font-size:150%;line-height:normal\">Minor class Blackguard </span></strong><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/moghedien-melody-of-the-dark-bard-26-bg-4-rdd-10-t2350150.html\" rel=\"noreferrer\" target=\"_blank\">Valefor's Moghedien Melody of the Dark Bard - Bard 26/BG 4/RDD 10</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/evil-speed-caster-sorc-35-monk-3-bg-2-t2319013.html\" rel=\"noreferrer\" target=\"_blank\">Mick Dagger's Evil Speed Caster - Sorcerer 35/Monk 3/BG 2</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/black-arrow-strike-the-heart-with-evil-bard-10-bla-t2354997.html\" rel=\"noreferrer\" target=\"_blank\">EasternPromises's Black Arrow Strike the heart with Evil - Bard 10/BG 3/Arcane Archer 27</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/death-metal-bardbarian-barbarian-16-blackguard-4-b-t2354991.html\" rel=\"noreferrer\" target=\"_blank\">EasternPromises's Death Metal Bardbarian - Barbarian 16/BG 4/Bard 20</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/strange-craze-sorcerer-22-bg-11-monk-7-t2354683.html\" rel=\"noreferrer\" target=\"_blank\">HipRedux's Strange Craze - Sorcerer 22/BG 11/Monk 7</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/tiamat-s-claw-druid-28-monk-7-blackguard-5-t515338.html\" rel=\"noreferrer\" target=\"_blank\">Kail Pendragon's Tiamat's Claw - Druid 28/Monk 7/Blackguard 5</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/deathbringer-of-the-underdark-rogue-19-fighter-17--t2342776.html\" rel=\"noreferrer\" target=\"_blank\">Bru's Deathbringer of the Underdark - Rogue 19/Fighter 17/BG 4</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/funeral-march-bard-26-blackguard-4-pale-master-10-t515385.html\" rel=\"noreferrer\" target=\"_blank\">Kail Pendragon's Funeral March - Bard 26/BG 4/Pale Master 10</a><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\"><strong>Epic character level 40 builds: </strong>Major class Blackguard </span></strong><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/valen-shadowbreath-fighter-12-blackguard-25-bard-3-t2268773.html\" rel=\"noreferrer\" target=\"_blank\">Maximillan Kane's Valen Shadowbreath - Fighter 12/BG 25/Bard 3</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/paragon-of-pain-bard-8-rdd-10-blackguard-22-t2354371.html\" rel=\"noreferrer\" target=\"_blank\">Mick Dagger's Paragon of Pain - Bard 8/RDD 10/BG 22</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-antipaladin-infernal-devastator-ftr-8-rog-4-bg-t2351520.html\" rel=\"noreferrer\" target=\"_blank\">Valefor's Lord Soth (The Antipaladin): Infernal Devastator - Fighter 8/Rogue 4/BG 28</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/champion-of-gruumsh-barbarian-10-rogue-2-blackguar-t2351878.html\" rel=\"noreferrer\" target=\"_blank\">Mick Dagger's Champion of Gruumsh - Barbarian 10/Rogue 2/Blackguard 28</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-unholy-black-knight-fighter-8-wm-7-bg-25-t2354281.html\" rel=\"noreferrer\" target=\"_blank\">Magaiti's The Unholy Black Knight - Fighter 8/Weapon Master 7/BG 25</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/unholy-hurricane-of-death-c-13-m-2-bg-25-10-attks--t2355065.html\" rel=\"noreferrer\" target=\"_blank\">Orion's Unholy Hurricane of Death - Cleric 13/Monk 2/BG 25</a><br/>\n<br/>\nI hope you have enjoyed this post as much as I have in creating it and hopefully it gives you some insight into this interesting class! Happy building!<br/>\n<br/>\n<em>Edit: figure out how to embed the youtube video, added a link to poisons guide</em></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:14 AM - Jun 24, 2019",
      "content": "<div>Blackguards are solid. They do not have the \"WoW\" factor of AA's or WM's but they work \"behind the scenes\" to reinforce every build's weak points. <br/>\nStackable Bull's strength, taunt skill, sneak attack, d10, full BAB, awesome bonus epic feats, free heavy armour proficiency &amp; the strongest summon in the game some of their perks.</div>"
    },
    {
      "author": "demoix",
      "avatar": "10759054_1550229973.jpg",
      "timestamp": "2:14 PM - Mar 18, 2020",
      "content": "<div>Amazing, many useful information. One of my favorite class</div>"
    }
  ]
}