{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "005",
  "name": "Building and Playing Arcane Casters - A Detailed Guide",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/building-and-playing-arcane-casters-a-detailed-gui-t2355599.html",
  "author": "Maximillian_Kane",
  "avatar": "10758866_1605883460.jpg",
  "replies": "4",
  "views": "7.4K",
  "posts": [
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "4:33 AM - Nov 01, 2020",
      "content": "<div><div align=\"center\"><strong>Building and Playing Arcane Casters</strong></div>\n<div align=\"justify\">Authors:</div>\n<div align=\"justify\">Maximillan Kane</div>\n<div align=\"justify\"><em>A long-time Neverwinter Nights player and elder at the ECB guild (Epic Character Builders for Neverwinter Nights), both by age and seniority. An extensive career as a Neverwinter Nights player, which dates back to 2006, and the ECB a couple of years later as a prolific builder and guide writer. Has played on various environments, and now plays mostly at the World of Greyhawk (WoG) Action Server for NWN 1.69.</em></div>\n<div align=\"justify\">Orion</div>\n<div align=\"justify\"><em>A long time NWN Player since Diamond Edition, but extremely active since obtaining a copy of EE in early 2019. Interests include writing guides, writing character builds, module creation, assisting and playing on persistent worlds and supporting others who share these interests through as the administrator of the NWN Workshop Forums Website. Over 150 builds designed and 12 guides in the ECB forums in a little over 12 months, and numerous level 40 characters on the World of Greyhawk (WoG) Action Server.</em></div>\n<div align=\"justify\"> </div>\n<div align=\"justify\"><strong>Building for the Environment</strong></div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Before we get on to the specifics of this guide, there are a few things that I’d like to mention. Let me start by making a few comments on how the environment where you play affects how you build your character. If you’re going to play the OC or SoU, follow up with HotU and then stop, then you should build something that peaks around level 27, since that’s about the level you’ll be when you finish HotU. In these environments, which I’ve played a lot in early in my NWN career, some feats like Spell Penetration might be more valuable, since the maximum value for Spell Resistance (SR from now on) in the toolset monsters is 32. However, in worlds where you reach level 40 and there aren’t custom monsters with custom SRs (i.e. Drow), these feats might be totally useless, as your caster levels alone might exceed that amount in some cases. And in others you might need just a little push to have 100% success rate on penetrating their SR, which can be done with Spell Breach, Greater Spell Breach and Mordenkainen’s Disjunction (Mord’s from now on).</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Similarly, if you play on a PW that has many custom modifications, like Arelith, some of the things we suggest may not apply or work differently. There, Shadowdancer (SD from now on) doesn’t get Hide in Plain Sight (HiPS from now on) at level 1; if you take a class, you need to take 3 levels in a row of that class, and it caps at level 30, both of which restrict multiclassing possibilities. I believe Assassin also gets HiPS as a class skill, and Devastating Critical (DevCrit from now on) is disabled. So, in those environments, none better than you, the player, to know how these custom modifications will affect the build. If you’re new to the server, it may be a good idea to ask for advice in the forums before starting a character that might be illegal or not adaptable to those settings.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">If you play in a server or module with very high-magic (lots of immunities, including Critical Hit immunity, +10 or so enhancement on items, etc..), that may also affect the effectiveness of the strategies and builds outlined here. I have played the Mines of Twin Summit modules, for example, and the level of magical items is off the charts. You can cap pretty much all stats and still be immune to most things (if not all). In this case, those PM damage-reflecting builds won’t be as effective, because everyone can be immune to critical hits, and monsters have lots of immunities and resistances, so the shields won’t do as much damage. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">The environment may also affect skills, like crafting, if a custom crafting system is in place for the world you play in, or Spot, if True Seeing has been changed to add to it instead of automatically seeing everything. If there are a lot of hard-to-find secret doors and traps in the module / PW, then Search becomes almost mandatory. If there are locked chests or doors with high unlocking DCs that aren’t opened by a simple casting or scroll of Knock, then Open Locks becomes very attractive. If the module has trap-crafting materials and recoverable Epic Traps, then Set Traps increases in value. If the module includes hard-to-overcome social checks, and failing those can either get you stuck in a quest or deny you access to a quest, then skills such as Bluff, Persuade or Intimidate also become important to invest in.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">In a nutshell, it’s important to know where you play and how it’ll affect each of the builds or strategies described in this guide. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">I will say that, having played in very different environments, from low to high magic, with different custom modifications, my preference lies in low-to-mid magic environments, where items typically have at most +5/+6 enhancement and no more than 3 properties. On WoG, for example, if you’d like to be immune to something, you’ll need to give up stats in exchange, like swapping a Belt of Fire Giant Strength for a Belt of Guiding Light so you can be immune to Death. I think that tradeoff maintains usefulness of some class features, while keeping them in check so they’re not overpowered.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\"><strong>Dedicated Casters</strong></div>\n<div align=\"justify\"><strong> </strong></div>\n<div align=\"justify\"><em><span style=\"text-decoration:underline\">Playing Wizards vs Playing Sorcerers:</span></em></div>\n<div align=\"justify\"><span style=\"text-decoration:underline\"> </span></div>\n<div align=\"justify\">            The first thing I’d like to say, is that most of my experience playing Arcane Casters has been with Wizards. I have played 2 Sorcerer builds, but I didn’t adjust very well to the lack of versatility they suffer from, nor to the fact they gain the next spell level one level later than other caster classes. Also, I was a bit lost leveling up, as I never knew which spells to add to my arsenal and which ones to replace. Anyway, I would like to offer a more detailed comparison between the two classes and make some considerations about game mechanics and how they interact with each class:</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">1-    <strong>Versatility:</strong> In terms of versatility, the Wizard is much more versatile than the Sorcerer just because they have access to every spell in the game. For Wizards, the more meta-game knowledge you have of the server, the more you will thrive in it, as you will know what works where and will always make sure you have that spell at your disposal. Although, sometimes, to attain the meta-game knowledge you need, you might literally have to die a lot trying strategies until you figure out something that works for each encounter. Alternatively, you can be in a party with another player and get ideas by watching them play. Also, Wizards get Scribe Scroll for free, which helps close the “spell-per-day” gap they have in comparison to the Sorcerer, and a free metamagic feat every 5 levels of Wizard for the first 20 levels (4 total, which if taken in epics CAN be used to take an epic feat such as Great Intelligence).</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">For Sorcerers, versatility can be a tremendous issue (especially when soloing in hard places like WoG), both for their limited number of known spells, but also because of their lack of bonus feats. I will say that a good Sorcerer builder and player NEEDS to keep versatility in mind when they select their spells at level up. Here are a few things you need to keep in mind when selecting those very few known spells that Sorcerers have: <strong>defensive buffs (DR for melee but also immunities)</strong>, <strong>disabling spells</strong>, <strong>damage spells (both for single targets and mob control, with different damage types)</strong>, <strong>no-save spells</strong>, <strong>utility spells, </strong>and <strong>insta-kill spells</strong> should all be a part of any dedicated caster’s arsenal.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">I should also probably state that Sorcerers can mitigate their early versatility constraints by A LOT with the use of Craft Wand. They can take Craft Wand, then craft wands of certain situational spells they wish to have, but not necessarily at all times, or spells that become obsolete after a while (Find Traps, Identify, Knock, Summon Creature, Ghostly Visage, Ultravision, Lesser Spell Breach, etc…) and then unlearn said spells in favor of better more long-lived ones. In some environments, these wands are then rechargeable via Magic Electrifier, so they may live happily ever after. Take into account spells that have a duration when crafting wands, as the Caster Levels are generally much lower when casting from wands. There are also places with their own customized crafting systems, like WoG.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">The same can be done to a MUCH lesser extent with Scribe Scroll and the higher level spells, but the cost of time and annoyance may be too high. Just keep in mind that for the purposes of penetrating SR and getting dispelled, the scrolls won’t be as useful due to the nerfed caster levels they invariably come with. That being said, scrolls like Summon Creature IX or Gate can be crafted if one feels the need to learn other spells and still make use of these. The limitations to this are that you’d technically need to craft all the scrolls you’d need for the rest of your life before you choose to unlearn the spell. A Sorcerer would basically need to pause their life for 1 level, spend all the XP and gold, farm more, spend more, farm more, etc…. until they feel that they have enough copies of that scroll. Most of the time, that feat (and the time it’d take) might be better spent elsewhere. For that reason and a few others, Scribe Scroll is much more useful for Wizards, because they can just memorize a bunch of spells in-between adventures, then re-memorize their “default” spells, rest and then go back to adventuring the next day, and as long as they know the spell, they can craft it whenever. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">2-    <strong>Flexibility: </strong>This is where Sorcerers are vastly superior to Wizards because of the way both their castings are structured. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Sorcerers need to LEARN spells once every level-up, however, Sorcerers gain new spell levels on EVEN levels, except for level 1. So, they’ll know 2<sup>nd</sup> level spells only at level 4, instead of 3 like most classes. They can also unlearn some spells in favor of others every time they level up in the class. Then they get a certain number of spells per day (more than the Wizard) of each level, which they can use as they please with all the spells they know. To be a little more descriptive, let’s see an example: Imagine your Sorcerer knows 3 level 7 spells, 4 level 6, 4 level 5 and 5 level 4 spells. When your Sorcerer uses a level 7 spell slot, he/she has the option to spend it on:</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">·        Any of the 3 level 7 spells</div>\n<div align=\"justify\">·        Any of the 4 level 6 spells extended, stilled or silent</div>\n<div align=\"justify\">·        Any of the 4 level 5 spells empowered</div>\n<div align=\"justify\">·        Any of the 5 level 4 spells maximized</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Basically, the only restriction they have of casting spells is if the spell is not affected by a certain metamagic feat. That’s just TOO GOOD! </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Wizards, on the other hand, need to MEMORIZE spells, which means they need to pre-select what they think they’ll need the following day. Then when they rest and go adventure, if they need another spell, tough luck. Once a spell is memorized, there is literally NOTHING that will change it for another spell. That’s a severe limitation to consider, especially if one isn’t familiar with the server one is playing on. The main way for Wizards to overcome this limitation is knowledge. That’s why I NEVER use a Wizard as my first build in ANY server or module I play. It’s just too frustrating. Once you get your bearings playing other toons, and find out about immunities, items, vulnerabilities, you can successfully play your first Wizard. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Imagine if you memorize a bunch of Fire spells to fight a Frost Giant army. You’re doing pretty well all the way to the boss battle. But, when you get to the Frost King, he has a Ring of Fire Resistance that absorbs 30 damage, and all the Fire spells you cast at him do 0 to 10 damage! There’s no improvising spells with Wizards, so in that situation, you’d either die or flee and come back another day to try out a different strategy. However, you CAN and SHOULD scribe LOTS of scrolls exactly for that purpose. There’s no limit to this, but you can scribe 20 scrolls of Summon Creature 9 (I normally carry 50 copies, but I’m a hoarder LOL) and restock on them between adventures, then you won’t need to memorize these spells. </div>\n<div align=\"justify\">Because Wizards have fewer spells per day than Sorcerers, they need to incorporate scrolls as part of their arsenal. This will help A LOT. I remember once I was killing the White Dragon King (a TOUGH high-level boss on WoG) with one of my Wizards, and I ran out of IGMS (Isaac’s Greater Missile Storm, for future reference) spells. I think I had memorized something like 10 copies, some empowered and some regular ones, but I didn’t have Maximize Spell or Still Spell because I was playing a spellsword. Luckily, I was able to beat him spending many of the 30 IGMS scrolls I had crafted beforehand. After the battle, I spent the next two days re-crafting the scrolls I used to replenish the stock. This is a very important lesson to learn when you’re playing a Wizard. Preparation, Preparation, Preparation.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">3-    <strong>Metamagic: </strong>Although metamagic feats are useful and important to both classes, Sorcerers can benefit WAY more from them than Wizards, because of the way their casting is structured. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Regardless of whether one is playing a Sorcerer or a Wizard, one should always consider taking:</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">·        At least 1 metamagic feat that allows casting at 1 level higher (Extend, Still or Silent spell), but the ideal is 2 (Extend Spell +1 more because not all spells are extendable);</div>\n<div align=\"justify\">·        Empower spell to be able to cast spells 2 levels higher;</div>\n<div align=\"justify\">·        Maximize Spell to be able to cast spells 3 levels higher. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Quicken Spell is just too costly and by looking at every spell level you can consider casting a quickened version of a spell, there’s always a better “empowerable or maximizable” alternative for that same level. This is commonly referred to as spellbook management. Having the ability to cast a spell at different levels increases the number of copies of that spell that you can cast per day. That applies to all your spells, except level 9, of course. In the case of Wizards, you need to pre-select how many copies of the spell you want to memorize. For Sorcerers, you can just “wing it as you go”. If you know the spell and have slots of that level left, you can cast it.</div>\n<div align=\"justify\">For example, let’s presume you’re in need of MANY copies of Firebrand to fight Frost Giants. As a Level 16 Sorcerer, with access to 8<sup>th</sup> level spells, you can use:</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">·        All your level 5 slots for Firebrand</div>\n<div align=\"justify\">·        All your level 6 slots for Silent or Stilled Firebrand</div>\n<div align=\"justify\">·        All your level 7 slots for Empowered Firebrand</div>\n<div align=\"justify\">·        All your level 8 slots for Maximized Firebrand</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">That is simply too good. And to make it even better, if in a pinch you come to need a level 6 Bigby instead, you CAN cast it, no problem, as long as you have the slot and know the spell. Finally, if you fight Fire Giants in the next adventure, you can do the same thing with Cone of Cold and Ice Storm, and still use some IGMSs or any other spell you need in a pinch!</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">4-    <strong>Class combos</strong>: Because their casting stat is Charisma, and there are a number of REALLY USEFUL feats and special abilities tied to Charisma, there are MANY MORE possibilities / benefits for multi-classing Sorcerers than Wizards. E.G.: Paladin Divine Grace or the BG Dark Blessing, Divine Might / Shield. So, with just 3 levels of Paladin and Divine Shield, a Sorcerer with 32 CHA will get +11 to all saves, +11 Dodge AC, Martial Weapon Proficiency and Heavy Armor Proficiency. They can still take any other class for skill dumps and make very effective builds. However, they don’t have many skill points, because their INT is generally low (14 tops) and they don’t get many skill points per level. If in terms of class features, the Sorcerer completely outclasses the Wizard for multi-classing, in terms of skill points and feats, they have a really hard time. It’s extremely difficult to build a good Sorcerer spellsword, and even when you do, you’ll feel like there were a lot of feats and skills that you wanted to include in your build, but had to leave out.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Wizards don’t get that kind of juice of great boons with just a few levels of any class, as their casting stat is INT and there are nearly no class special abilities based on it. The only class ability that is INT-based is Death Attack, which might seem to have a synergy, but it’s predominantly tied to Assassin Levels, so it’s really not good at all (for dedicated casters). So, because Wizards will have a high, or higher than average INT, their best friends for multi-classing are classes with a lot of skill points and class skills to spend on. That’s why there’s no high-level Wizard that doesn’t have a few Rogue levels, where they can spend those plentiful skill points to make use of traps, stealth and UMD trinkets. SD is another very common class for HiPS with just one level. And then there’s the aforementioned Assassin, which is seen as an option for Evil-aligned Wizards instead of Rogue, or alongside it. And finally, there’s Fighter for the Heavy Armor Proficiency and bonus feats. So a typical dedicated caster Wizard will be something like Wizard 35 / X 3 / Y 2, Wizard 35 / X 4 / Y 1, or Wizard 38 / X 1 / Y 1 depending on alignment and classes chosen. Basically, insert 2 of the 4 aforementioned classes in the template that’s more optimal for that class combo and have fun! Keep in mind that, depending on the classes you choose, you might have to x-class some skills to achieve requirements (Wizard / Fighter / Shadowdancer being the perfect example of HEAVY investment).</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">5-    <strong>Spells: </strong>Obviously, if you’re building and playing a dedicated caster, your bread and butter are your spells. As a Wizard, you can choose a school of spells to specialize in. That will give you one extra spell per day at each level, which is nothing to sneeze at, but you also won’t be able to cast spells of the opposed school. For Spellswords, the choice is easy: Illusion, as you lose Enchantment spells, which are mostly DC spells anyway,, ,and your casting stat will be low, so you wouldn’t use them. You also lose Mass Haste, but you have Haste, so no big loss there, it’s a no-brainer. For dedicated casters, Necromancy could be an interesting option, as you lose access to Divination spells. Premonition and True Seeing being the honorable mentions. If there are items with the True Seeing property, then there’s only 1 big loss. These are the only 2 schools you should really focus on, if at all, Illusion being the most common one. But because there are no benefits other than an extra spell per day, going with a generalist is also a very viable option for dedicated casters. For spellswords, like I said, Illusion is not only recommendable, but pretty much the only choice that makes sense.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Orion is much more qualified to give you hints about spells for Sorcerers, and he has already given a very comprehensive guide on how to pick spells, so I don’t have much to add there. What I do have to say about spells is more “generic”. It has to do with what information you should know about your offensive spells in order to select which spells to learn as a Sorcerer, and which spells to memorize for specific encounters as a Wizard.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">·        Does the spell have a save? If so, <strong>which save does it attack?</strong></div>\n<div align=\"justify\">·        Is the spell affected by Immunities? Which immunity negates it?</div>\n<div align=\"justify\">·        Is the spell affected by SR?</div>\n<div align=\"justify\">·        If the spell has different simultaneous effects, which immunities negate each effect?</div>\n<div align=\"justify\">·        If certain spells produce status effects, what do these effects do to the enemy? </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Orion did hint at this when he discussed spells in his guide, when he said which immunities affect some of the spells, but I wanted to use this as a building reflection. The part in boldface is for the other half of the equation, which he didn’t mention, but I’m sure he knows and considers, which is: <strong>Which enemy types are more likely to be susceptible to which kinds of spells? </strong>Answering this question is the most vital skill to learn as a dedicated caster. If you’re casting Reflex-save spells against Rogues, you’re doing it wrong. </div>\n<div align=\"justify\">Basically, here’s a rough list:</div>\n<div align=\"justify\">·        <span style=\"text-decoration:underline\">Arcane casters</span>: Generally Fortitude is their weak save and Will is the strong one. Reflex depends.</div>\n<div align=\"justify\">·        <span style=\"text-decoration:underline\">Melee STR builds</span>: Will and Reflex are generally pretty bad, Fort is great.</div>\n<div align=\"justify\">·        <span style=\"text-decoration:underline\">Sneaky types</span>: Reflex is their best save, Will is generally the weakest, Fortitude depends. They also have Evasion, which means they won’t take damage if they succeed a Reflex save.</div>\n<div align=\"justify\">·        <span style=\"text-decoration:underline\">Monks:</span> All 3 saves are strong (And they have insane SR AND Evasion as well). They are your bane, and you need to live with it. (Use Epic Warding and Damage Shields and let those 7-APR assholes suicide on you LOL).</div>\n<div align=\"justify\">·        <span style=\"text-decoration:underline\">Paladins and Blackguards</span>: Fortitude is the strongest save, but all saves are high (or at least have the potential to be high if their CHA is enhanced). Reflex is normally the weakest.</div>\n<div align=\"justify\">·        <span style=\"text-decoration:underline\">Divine Casters</span>: Typically, they have very high Will and an OK Fortitude save, Reflex is normally their weakest.</div>\n<div align=\"justify\">·        There are also some monster types that are immune to a lot of things, have high Spell Resistance or even Spell Immunity, which you need to know the specifics before facing them. Undeads and Constructs are immune to death and mind effects, some races have innate Spell Resistance, such as the Drow, and Rakshasa are basically impervious to magic. It doesn’t mean that a mage can’t beat them, it just means that a mage needs to think outside the box to beat them.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Saves in a build are determined by which levels you take in which order in pre-epics, and progress at a constant pace from level 21 on, similar to what happens with BAB. Stats also influence how high a save can go: (WIS for Will, CON for Fortitude and DEX for Reflex), however, the bulk of the saves comes from the classes and class features.  This type of information can be useful in both PvM and PvP. A Stone Giant Shaman would be a Divine Caster with insanely high STR and CON most likely, so you can get an idea of which spells would work well against them by having these guidelines in your head when you cast. In general, the difference between enemy weak saves and strong ones is way higher than the difference in DC from your spells with and without Spell Focus feats, so it pays to cast spells that attack their weak saves more than it does spells that you have focus on. Sometimes, a REALLY TOUGH battle can be completely cheesed by a single spell, like Orion exemplified in his guide with that dragon battle and Bigby 6 rendering it completely useless. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\"><em><span style=\"text-decoration:underline\">Summary:</span></em></div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">As a rule of thumb, when building a dedicated Arcane Caster you want high Caster Levels (anything under 35 is normally too low, but there are a few exceptions), a somewhat high CON score to make up for the sufferable HP and a HIGH casting stat with the Spell Focus feats to go with it. You might be asking yourself: which school should I focus on? I’ll list them below in my particular order of preference:</div>\n<div align=\"justify\">1.     <strong>Necromancy</strong>: Easily the most common school of focus for those juicy insta-death spells. Also the simplest one to play. Use insta-death spells on low-fortitude enemies and watch them die.</div>\n<div align=\"justify\">2.     <strong>Illusion</strong>: Also has some nice insta-death spells (Phantasmal Killer at level 4 and Weird at 9). Not as good as Necromancy for insta-kills, but a good second alternative. It also has a nice spell that most people don’t use, called Mass Blindness / Deafness, which can make a very complicated battle very simple. Gnomes get Spell Focus: Illusion for free, so it’s a great choice for a Gnome mage.</div>\n<div align=\"justify\">3.     <strong>Transmutation</strong>: If you want to become an expert petrifier, then Transmutation is the way to go. The best thing about this school is that there aren’t any immunities that affect Flesh to Stone. If you cast the spell and they fail the save, they’re done. As for weaknesses, the fact that it’s a level 6, single target spell and you don’t have any good spells that involve DCs from levels 7-9. There are GREAT spells, just none affected by Spell Focus.</div>\n<div align=\"justify\">4.     <strong>Enchantment</strong>: If you want to control the minds of the weak and use them against their masters, then Enchantment is the way to go. The reason this school is so low on the list is that the spells generally also affect the party, so if you want to cast them in battle, you can’t be of Neutral alignment, and need to use Protection from your own alignment on your party to keep them safe from your mayhem. But it’s extremely fun to fight using Dominate Monster on a really powerful brute and then use him to attack its master. Awesome school to use in solo play, since the party limitation doesn’t apply.</div>\n<div align=\"justify\">5.     <strong>Evocation</strong>: Focusing on this school of magic gives your damage spells higher DCs, but because of Evasion and Improved Evasion, and the fact that most of them are Reflex saves, it’s probably not a good bet to go with this school. On the positive side, there are some really fun spells with unpredictable effects, like Great Thunderclap and Prismatic Spray. It could be fun to build an Evoker, but it’s probably not very powerful. Also, the best spell in this school is Divine: Implosion.</div>\n<div align=\"justify\">6.     <strong>Conjuration</strong>: This school basically specializes in disabling opponents. It’s also the school that is the most affected by immunities. It might be number 1 or a close runner-up if it weren’t for the fact that its best 2 spells are divine: Storm of Vengeance and Stonehold. For Arcane practitioners, we have Grease, Evard’s Black Tentacles and Stinking Cloud, but they’re all low level (the highest is Evard’s, a level 4 spell), so your DCs will be 5 points lower than Necromancy spells. The spells are GREAT, and you should definitely use them, but the decision to specialize in this school is questionable at best IMO. My Edwin Odesseiron build focuses on this school, but that’s because he was a Conjurer in Baldur’s Gate, not because it’s the best choice. Sadly, Summon Creature spells aren’t affected by Spell Focus.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">The last thing to say about the Spell Focus feats is that, after you build a mage that specializes in one school, it might be fun to build the next one specializing in another one and try out new stuff. This is why we end up finding out the best spells to use in different situations, and how we have fun playing casters.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Spell Penetration feats are OK if you’re planning on facing customized monsters with high SR which you have no other way of killing (i.e.: damage shields for monks). Otherwise, they’re basically a waste. There are generally not many considerations regarding race, because the class combos normally involve a prestige class, but if you’re playing somewhere with limited XP and non-respawnable monsters (i.e. a Single Player module), then you might consider going Elf, Gnome or Human. Gnome gets a much needed 2 to CON, but starts with -2 STR. </div>\n<div align=\"justify\">AB for dedicated casters is irrelevant. You shouldn’t even take it into consideration. A few dedicated casters also opt to choose Automatic Still Spell (autostill) as part of their strategy. What that does is allow you to cast spells in full platemail armor and shield, so you’ll have that extra protection and still have all your spells at your disposal. It’s a viable alternative if you can spare the feats. However, for dedicated casters, I consider it an expensive investment. There are only so many feats you can take, and you’ll need Extend + Still, Empower, Maximize, Craft Wand, Spell Focus, Greater Spell Focus, Epic Spell Focus, and many Great Intelligences or Great Charismas to increase your spell DCs. Being that Autostill requires spending 3 epic feats, if you go that route, you’ll worsen your casting by quite a bit. For some builds, it makes sense, for most I find it too expensive. It also depends on what items are available where you play. If -% Arcane Failure is common, then it becomes less worth it. For spellswords, it’s a completely different story, but we’ll talk about them when we get to that part of the guide.</div>\n<div align=\"justify\">Here are a few examples of dedicated caster builds for reference: </div>\n<div align=\"justify\"><a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build231822.html\" rel=\"noreferrer\" target=\"_blank\">The War Wizard by Grizzled Dwarflord</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build301814.html\" rel=\"noreferrer\" target=\"_blank\">Melee Mage by WebShaman</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21323#p21323\" rel=\"noreferrer\" target=\"_blank\">The Gnomish Necromancer by Orion</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/edwin-odesseiron-the-conjurer-wizard-38-druid-1-as-t2355571.html\" rel=\"noreferrer\" target=\"_blank\">Edwin Odesseiron by Maximillian_Kane</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/jan-jansen-the-gnome-mage-thief-tinkerer-wizard-35-t2355572.html\" rel=\"noreferrer\" target=\"_blank\">Jan Jansen by Maximillian_Kane</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/exalted-sorceress-sorcerer-38-paladin-1-monk-1-t515460.html\" rel=\"noreferrer\" target=\"_blank\">The Exhalted Sorceress by cdaulepp</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/speed-caster-sorceror-36-monk-3-paladin-1-t515365.html#p46\" rel=\"noreferrer\" target=\"_blank\">Speed Caster by WhiZard</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21636#p21636\" rel=\"noreferrer\" target=\"_blank\">Ehlonna's Arch-Magus by Orion</a></div>\n<div align=\"justify\"><strong>Damage-reflecting Pale Master (PM) builds</strong></div>\n<div align=\"justify\"><strong> </strong></div>\n<div align=\"justify\">I decided to give these guys a special section in this guide because they certainly are unique enough to deserve it. These builds are mostly dedicated casters who worsened their casting prowess to attain the great immunities that 10 levels of PM grant, most remarkably, becoming immune to Critical Hits. They specialize in one specific strategy, which is to take damage, mitigate it through the use of items / DR spells, while having Mestil’s Acid Sheath, Elemental Shield and Death Armor on at the same time, punishing all who dare to attack them without breaching these protections first. These tactics are very effective in PvM against most enemies, but they are also extremely vulnerable to Spell Breach, Greater Spell Breach and Mord’s. In order to be successful playing them, you need to know how to bait dispels and breaches from your opponents before you engage them, or how to properly disable a caster on sight before they get a chance to react. We’ll talk more about these “tactics” when we discuss playing tips. They’re also quite ineffective against long-range attackers, since the shields only do damage in melee.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Typically, they will be Wizard or Sorcerer 26 / PM 10 / X 4 or Wizard or Sorcerer 29 / PM 10 / X 1 (there are also Bard / PMs, but these are outside the scope of this guide). I’d say that although these builds can be made with both Wizard and Sorcerer, they’re more commonly seen with Wizard, and for good reason. Let’s get a little deeper into the specifics to understand why:</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">·        When you take levels in PM, you gain SPELL SLOTS as though you’re taking levels in your main casting class at half-speed, meaning every PM level counts as ½ a Wizard or Sorcerer level as far as spell slots are concerned. Wizards can learn Arcane spells from scrolls, which means that even if they can’t choose spells when gaining levels, they can learn them later, provided they’re able to find or buy said scrolls. As a Sorcerer, you won’t learn ANY new spells, but you’ll be able to use meta-magic versions of the spells you already know at higher levels. Just to illustrate how big a difference that can make, a Wizard 14 / PM 7 can have level 9 spells, whereas a Sorcerer 14 / PM 7 can’t even have level 8 spells. They can cast using level 8 slots, but they won’t know any level 8 spells. So, that’s one reason why most of these builds use Wizard instead of Sorcerer.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">·        Another important observation is that PM levels DON’T COUNT as Caster Levels for the purposes of penetrating Spell Resistance, spell durations, damage calculations, etc... That means that these builds will probably require that you include Spell Penetration, Greater Spell Penetration and Epic Spell Penetration if you want to be able to cast against spell-resistant enemies. Epic Warding is also vital in this type of build to soak up the damage you’ll be taking. Then, those extra feats you get every 5 levels as a Wizard really come in handy to cater to such heavy demands. That’s another reason for PM builds normally going Wizard.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">The reason this combo is so common and good is that for a non-PM Wizard or Sorcerer to achieve the same results, they’d need to buff up with the damage shields and then cast Shapechange Iron Golem, which is a level 9 spell. That in itself is a problem, as it means one fewer Time Stop. The second problem is that when you’re polymorphed, many items you’re equipped with don’t merge, so you may lose boni to your casting stat from an amulet, cloak or ring, which will result in you losing spell slots. Also, while polymorphed, you can’t cast any other spells or use wands, only potions are available. And finally, getting dispelled while shifted is a HUGE issue, since you need to de-shift to rebuff, and then recast Shapechange, etc… It becomes quite impractical to use often, but can be used in very specific situations. For these PM 10 builds, they can just use this strategy every single encounter after they get Deathless Mastery (immunity to Critical Hits) while still being able to cast while they’re getting hit, generating attacks of opportunity, making their enemies die faster.</div>\n<div align=\"justify\">Another important decision when you’re building one of these guys is “how much you want to worsen your casting to become better at tanking and reflecting”. The reason I say this is because many of these builds stop building up their casting stat at 20 and stick to casting no-save spells, and build up their CON score to the limits, which raises their HP and Fortitude save by A LOT. However, as a caster, you also lose A LOT by doing this. You lose a lot of versatility and flexibility, because you won’t be able to successfully use DC spells. On the other hand, you “free up” 3 feats, since it doesn’t make sense to take Spell Focus when your casting stat stops at 20. In a nutshell, you become a better tank and a worse caster, meaning you cast like a spellsword, but don’t fight like one. There’s also the option to relinquish some casting prowess to get your CON high enough to take the Epic Damage Reduction feats (EDR from now on), which reduce a total of 9 points of physical damage per attack and stack with all other forms of reduction. That’s a good compromise if you want to be a competent caster and a competent tank as well, without giving up too much on one side or the other. It’s mostly a matter of personal preference and environment that will define which alternative will be best for your builds.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">There are also a few builds that go completely overboard and take more than 10 PM levels. There’s even one that goes Wizard 9 / Fighter 1 / PM 30 to get that Lesser Demilich summon. However, those are concept builds and generally much worse than the others. You also don’t necessarily become better at what you do by going this route, because Bone Skin keeps raising your AC, and typically in this kind of build, you WANT to get hit. One of the most common things for these builds to do is cast spells or drink potions in melee so to give attacks of opportunity to their enemies in order to kill them faster. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Summarizing, for these builds it’s more common and easier to go Wizard instead of Sorcerer for the reasons stated above. You should consider taking the Spell Penetration line of feats to compensate the lower caster levels. You should also use Mord’s scrolls or Greater Spell Breach scrolls to lower enemy SR when trying to cast against enemies with high Spell Resistance.  Epic Warding is also a must-have to soak up damage. Epic Mage Armor is optional for flexibility, especially in equipment slots. You must decide whether you want to go the CON-Tank route or the Casting Route. CON is better at surviving, whereas Caster is more versatile and flexible, but has fewer HP and lower Fortitude saves.</div>\n<div align=\"justify\">Here are a few examples of those builds to take a look:</div>\n<div align=\"justify\"><a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build252820.html\" rel=\"noreferrer\" target=\"_blank\">Mestil's Pale Emissary by Grizzled Dwarflord</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/mestil-s-half-dead-juggernaut-wizard-26-pale-maste-t2355300.html#p18491\" rel=\"noreferrer\" target=\"_blank\">Mestil's Half-Dead Juggernaut by Grizzled Dwarflord</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/xzar-the-necromancer-wizard-29-pale-master-10-assa-t2355554.html#p21745\" rel=\"noreferrer\" target=\"_blank\">Xzar, the Necromancer by Maximillian_Kane</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-dark-sorceress-sorcerer-28-pm-10-bg-2-t2355478.html\" rel=\"noreferrer\" target=\"_blank\">The Dark Sorceress by Orion</a></div>\n<div align=\"justify\"><strong>Arcane Spellswords / Spellbows</strong></div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Ladies and gentlemen, hold your horses, for we have arrived! This is the most extensive part of the guide, where we will discuss the nearly limitless possibilities of combining Wizard or Sorcerer with other classes to have both combat and casting prowess. The idea of combining the two is to make use of the staple spells of the Arcane classes, like Time Stop, IGMS, Mord’s, Bigby Hands, damage shields, as well as buffs like Bull’s Strength, Cat’s Grace, Shadow Shield, Premonition, Shield, Mage Armor, Greater Magic Weapon, Flame Weapon, Keen Edge (for Slashing weapons), etc. This means that they retain many of the Wizard or Sorcerer’s useful spells that don’t require a save, and also have combat prowess attained through other classes. They aren’t as good as dedicated builds in any of those areas (combat builds are better at combat, casting builds are better at casting), but they don’t lose that much in comparison to what they gain in the process for each of these areas. </div>\n<div align=\"justify\">That said, most spellswords share the following characteristics:</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">·        They mature late (after level 30, generally, they start coming together). That means they’ll struggle for 2/3 or more of their life and then become monsters.</div>\n<div align=\"justify\">·        They MUST invariably delay their arcane casting prowess to build up BAB in pre-epics. This may not seem like much, but it means you’ll have to find a way to survive and progress with under-level spells and being easy to dispel. If ONE Greater Dispelling hits you, most or all your buffs will go “poof”.</div>\n<div align=\"justify\">·        They won’t have as many attacks per round as a Fighter, even when they reach their full potential, unless Tenser’s Transformation has been altered to its original PnP version where you play. Of course they can Haste themselves for tough fights, but their caster levels will be low, so it won’t last long.</div>\n<div align=\"justify\">·        Because of all the aforementioned characteristics, most Arcane spellswords are advanced builds, and require extensive knowledge of the server and use of consumables to overcome the early and even mid-life, where they’re vulnerable to dispel and mostly unable to cast reliably as a part of their strategy. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">That’s because of what they strive to achieve, which is basically 20+ levels in a caster class and the ability to fight as an average Fighter. An average fighter is more than enough to deal with mobs and conserve the spells for the tough bosses. However, that depends on which implementation of Tenser’s Transformation is in place where you play.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">If Tenser’s Transformation is the Default NWN implementation, which is basically a Polymorph spell into a mostly underwhelming Doom Knight, that will severely hinder these builds’ meleeing capabilities. Their STR is SET to 20 (when typically, their original STR is much higher), and they lose many boni from items that don’t merge into polymorphs. Don’t get me wrong, they’re still GREAT builds, just not OVERPOWERED, basically. With the PnP version of Tenser’s, where they get 2 extra attacks, a boost to their own stats and AB, it makes them virtually unstoppable in melee combat, although unable to cast spells when they are tensered. Still you’ll cut through the mobs much more efficiently, and have the option to fight in melee against some bosses.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">In order to organize the extensive amount of content we need to go through, we’ll subdivide this section into smaller sections, and even then, there might be builds that fit multiple sections or none at all. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">·        <strong>STR-Based Spellswords</strong></div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">These builds are very prolific, perhaps even the most common of their kind. They are fully-armored Juggernauts, with high STR, average CON, and enough INT or CHA to cast 9<sup>th</sup> levels spells. Most commonly at 19-20, depending on feat constraints. They are REALLY strong from around level 30 on, but also EXTREMELY hard to level up in most cases, especially solo in tough environments. What happens to them is that, in addition to all limitations described above, they suffer from an additional limitation: Arcane Spell Failure! This is a NIGHTMARE that will haunt these builds until they get Automatic Still Spell III, which invariably comes late in the build because they must build BAB in pre-epic. Just as an example, I’m playing my Draconic Arcanist build on WoG now, it’s currently level 28 (Wizard 15 / Bard 3 / RDD 10), and I still haven’t even taken Autostill I. They’re the next feats I’ll take, but I still feel they’re long overdue.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Walking around in Full Plate / Tower Shield without Autostill makes casting in combat very difficult, sub-optimal at best. Basically, you won’t be able to reliably use damage spells for a long time, and you’ll need to memorize all your short-term buffs metamagicked with Still Spell, then they won’t last very long because of your low caster levels. That means you might need to rebuff in the middle of tough encounters, and we’re not even considering the possibility of you getting dispelled, which is VERY likely to happen. This means you’ll need to approach all encounters with caution, use dispel-baiting tactics, and only buff in very specific encounters and only after baiting said dispels. And if you make a mistake and get caught in a vulnerable situation, it may be dirtnap express for you. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">I know it can be hard, so here are a few hints to help you play one of these builds until they become a force to be reckoned with:</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">·        I suggest memorizing 2 copies of each long-term buff, because of the low caster levels, so you can rebuff at least once before resting again.</div>\n<div align=\"justify\">·        You should probably do as I do, and quickslot the armor and shield, because you’ll be removing them after EVERY REST to buff with your long-term buffs, and then in the middle of the day to rebuff when there are no enemies nearby. That makes it MUCH easier to remember whether you have or haven’t unequipped them (there’s a blue line around the item to indicate it’s equipped), rather than opening your inventory every time you need to buff. At least in NWN 1.69, there’s a display bug sometimes that shows you still equipping an item when it’s not really equipped, then you might click to unequip it because you see your character holding it, and end up equipping it instead and failing a spell as a result.</div>\n<div align=\"justify\">·        If possible, buy a few wands from friends to help you through, since your weapon buffs will be sub-par at best for quite a long time. </div>\n<div align=\"justify\">·        Try to get your hands on good items ASAP, especially defensive items, like a good armor and a good shield so you don’t need to rely so much on your buffs.</div>\n<div align=\"justify\">·        USE CONSUMABLES. I can’t stress that enough. They are VITAL to level this kind of build. </div>\n<div align=\"justify\">·        Equip items that give bonus spell slots before resting, then memorize your long-term buffs, buff up and swap gear for more combat prowess after you’re buffed. The same is true for stat-enhancing items. I have a Bag of Holding where I put my “Resting Items” and another one for my “Combat Items”. I equip the items, rest, buff up, swap to combat and go adventure. It’s a bit of a nuisance sometimes, but makes you much more effective!</div>\n<div align=\"justify\">·        If you’re building a Wizard spellsword, select Illusion as your school of focus. You won’t lose any meaningful spells that you’d be interested in casting and you’ll have an extra spell per day on every level. Sweet!</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">But, if for most of their lives these builds are vulnerable and should be played cautiously, not all is bad news. After they mature, they become powerhouses that have tools to overcome ANY encounter. They can cast very competently, and fighting in melee will help them conserve their spells for tough battles. Then, when in those tough battles, they have the option to fight in melee if the situation calls for it, or cast spells if the battle can be won in such fashion. Their final power is definitely worth the tough leveling process they must endure.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Among these builds there are great examples of really well-constructed builds that make the most out of the package. And, as you can see, there are plenty of strategies / options to choose from. </div>\n<div align=\"justify\">Here are some examples of such builds:</div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-abjurant-champion-wizard-26-ftr-6-cot-8-t2354353.html\" rel=\"noreferrer\" target=\"_blank\">The Abjurant Champion by Valerfor</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/draconic-arcanist-wizard-26-bard-4-rdd-10-t2344104.html\" rel=\"noreferrer\" target=\"_blank\">The Draconic Arcanist by Maximillian_Kane</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.nwnworkshop.org/forums/topic/sword-of-the-dracolich-sorcerer-20-rdd-10-pm-10/\" rel=\"noreferrer\" target=\"_blank\">Sword of the Draco Lich by Orion</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/spellsword-of-bahamut-sorc-26-paladin-4-rdd-10-t515415.html\" rel=\"noreferrer\" target=\"_blank\">Spellsword of Bahamut by Mick Dagger</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/strange-craze-sorcerer-22-bg-11-monk-7-t2354683.html\" rel=\"noreferrer\" target=\"_blank\">Strange Craze by HipRedux</a></div>\n<div align=\"justify\">·        <strong>DEX-Based Melee Spellswords</strong></div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">These builds are completely different from the aforementioned juggernauts, because they can wear robes. It may not seem like much at first glance, but it actually makes a huge difference. Primarily if where you play there are some really nice Wizard robes that give bonus spells per day. Where a STR-based Spellsword would equip them before resting and be forced to memorize either a long-term buff or a Summoning spell, a DEX-based spellsword could wear those all day long, which means they can memorize ANYTHING in those slots. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Another advantage some of these DEX builds have over their STR counterparts is the combination of Epic Mage Armor and Epic Dodge for phenomenal defenses, enhanced by the 50% concealment bonus from Improved Invisibility. I would say that STR-based spellswords are more offensive, and DEX-based spellswords are more defensive. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">They’re also more “utilitarian”, since you typically see a lot more Rogue levels in those builds (need at least 13 for Epic Dodge), that means a much smoother skill progression in pre-epics (when building BAB), and a few skill dumps in epics to round up the build. That completely changes the playstyle from the previous group, as it allows you to use traps and sneaky tactics from level 1, ensuring a much smoother leveling process. Stealth skills make it easier for you to relinquish the use Invisibility spells in favor of Darkness (and Extended Darkness at level 3), and Sneak Attack allows you to make the most use of them to really bring the pain to non-sneak immune enemies. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">With Wizard, there are actually 2 ways to make a DEX-based spellsword. The first one is a fully-fledged caster with Rogue as a way to build BAB and get Epic Dodge. The second one uses Wizard as a “support class” for the sneakiness (typically 10 levels), and make a Rogue character with spells to complement their strategy. That works very well with Assassin and Rogue as the main class. What this can do for you is give you many instances of 10 and 20-round Darkness spells (normal and Extended) to make sure you can continue to surprise your enemies, and god help their souls if you catch up with them in there. Also, in the case of Assassin, using the 2 bonus feats from Wizard 5 and 10 to get 2 Great Intelligences and boost DA DC by a little. Your DC still won’t be anything spectacular, but it’ll be high enough to be effective against mages, who are your main concern. I must say that when I built the first one of its kind (Nathyrra, the Henchwoman from the OC), I thought she’d be weak. As I played her to level 40 on WoG, I was ASTONISHED at how effective she was! I basically learned a completely new playstyle with her, and she did phenomenally well in many battles that I thought for sure she wouldn’t be able to solo. Of course, there were still a couple of battles that she couldn’t solo, but that’s true for most builds, especially sneaky types. If anything, she outperformed many of her sneaky peers in many battles.</div>\n<div align=\"justify\">I haven’t seen many DEX-based Sorcerer spellswords, mostly because the Wizard casting stat in INT, which synergizes extremely well with what these builds are looking to accomplish in terms of skills and playstyle. Orion was able to find one, which is quite well conceived and unique. It’s is a concept build that attempts to interpret the Baldur’s Gate ruleset for NWN, very hard to play and level, but has some cool synergies and nice stats for a Spellsword (except for 10 INT, which I confess made me flinch LOL). </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">So, here are some of these builds for reference:</div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=305#p305\" rel=\"noreferrer\" target=\"_blank\">Nathyrra by Maximillian_Kane</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/imoen-the-mage-thief-wizard-23-rogue-16-sd-1-t2355566.html\" rel=\"noreferrer\" target=\"_blank\">Imoen by Maximillian_Kane</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build315872.html\" rel=\"noreferrer\" target=\"_blank\">Shadow of Magic by Dramonin</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build239855.html\" rel=\"noreferrer\" target=\"_blank\">Duskblade Adept by Nimueh_Leafbow</a></div>\n<div align=\"justify\">·        <strong>DEX-Based Arcane Archer Spellbows</strong></div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Please know that, since we’re discussing SPELLbows, builds that have fewer than 10 levels in a caster class (i.e. Rogue 10 / Wizard 1 / Arcane Archer 29 and the like) will be outside the scope of this guide. These builds are also very common, like melee juggernaut spellswords. Similarly to the DEX-based melee spellswords, these spellbows must choose how many levels of caster they wish to take, knowing there’s going to be a tradeoff. The better your casting is, the worse your sniping is and vice-versa, since AAs gain AB every 2 levels, always on odd numbers (1, 3, 5, 7, 9, etc…). So, you can go heavy on the archer route, and have Wizard spells for utility, or you can do the opposite, go heavy on the casting side, but have sniping as a backup plan or a way for conserving spells. Also, you can use both classes as support for a 3<sup>rd</sup> class, like Assassin, to try to paralyze your opponent from a close distance. We’ll see some very different combos in the examples of builds I selected at the end of the section.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Since you shouldn’t be meleeing much as an Archer, Epic Dodge doesn’t make that much sense for them in general. Called Shot, on the other hand, is mandatory. You can use Called Shot – Leg to reduce enemy speed, and Called Shot – Arm to reduce enemy AB. In general, you want to use the leg version to keep enemies at a distance. If you set a green carpet of death (traps), you can then call the attention of many monsters at the same time and then watch them die all at once when the first guy steps into the trap. It’s nice to use a summoned creature first, since they’ll clump together to attack it, and once it’s dead they’ll run as a group and follow you to their deaths.</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">In terms of power, these builds are very good for party play, since they’ll have someone tanking for them while they snipe or cast from a distance. They may be tough to solo, but certainly not more than STR-based Spellswords. Because they’re DEX-based, they can wear Robes, and because they don’t get in range of opponents, they can equip a Piercing DR belt and pretty much nullify damage from archers for most of their pre-epic lives, except on criticals, which hurt A LOT. They can also summon to tank for them, while they rain down arrows from afar. And, of course, many of them can make good use of traps. The reason I say they’re difficult to play is because there comes a time in their lives when their spell power, sniping power or both haven’t yet matured, so they’ll need to use a lot of scrolls to summon creatures to tank for them, because the creatures they can summon from their own spells are much lower level and will get vaporized almost instantly. After that tough period in their lives, which they can survive if played properly, they start maturing as casters or archers, depending on which route you choose to go. For Archers, their damage output starts to become quite fearsome with the bonus provided by Enchant Arrows. For Casters, they start getting access to higher-level spells, and become way more versatile in ways of dealing with enemies. Still, epic levels for these builds, especially the archer-focused, can be tough to solo, because from a certain point on, summoned creatures won’t be able to tank as efficiently, as enemies will be a lot stronger. If they pull enemies from the pack 1 by 1, they will normally be able to control them with Called Shots to the legs, which will reduce their speed to almost zero and they’ll likely die before they get within range. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">As for tips for playing these builds, I have never actually played any, so I wouldn’t know from firsthand experience, but I’ve played alongside a few, and let me tell you, it was fabulous!</div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">For these builds there are many possibilities for a 3<sup>rd</sup> class. One could add Rogue for UMD, Evasion and a bit of Sneak Attack damage, Fighter for extra combat feats and more pre-epic BAB, SD for HiPS, Assassin for UMD and Death Attack, Monk to break the Speed cap and be able to run like hell, etc… It depends on a number of variables, like if you’re going to solo, or play in a party, if you’re going the Archer route or the Caster route, what you want your build to be able to do, so on and so forth. Like in the previous section, it’s much more common to see Wizard rather than Sorcerer in this type of build, as they cast with INT and typically these builds want to have more skill points to spend so they can add traps and even stealth to their combat strategy. Orion was able to find a single Spellbow which uses Sorcerer to qualify for RDD and boost STR to get DevCrit on the bow. It’s a pretty clever concept, and was very well-executed. </div>\n<div align=\"justify\"> </div>\n<div align=\"justify\">Here are a few examples of such builds for you to take a look:</div>\n<div align=\"justify\"><a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build166734.html\" rel=\"noreferrer\" target=\"_blank\">Devastatingly Charming Archer by Herbie Shimmer</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build294099.html\" rel=\"noreferrer\" target=\"_blank\">Boccob's Magic Arrow by Kail Pendragon</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build219560.html\" rel=\"noreferrer\" target=\"_blank\">Arcane Retribution by Christian.schnabel</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build151895.html\" rel=\"noreferrer\" target=\"_blank\">Fading Archer by yrtsns</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build201898.html\" rel=\"noreferrer\" target=\"_blank\">Blackbow by Nimueh_Leafbow</a></div>\n<div align=\"justify\"><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-sniping-sneaky-magical-bastard-a-wog-spellbow--t2354891.html\" rel=\"noreferrer\" target=\"_blank\">The Sniping Sneaky Magical Bastard by traballacoilupi</a></div></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "4:34 AM - Nov 01, 2020",
      "content": "<div>·        Dual-caster Spellswords<br/>\n <br/>\nThis is my favorite type of build, and the one I have the most experience in building and playing. Despite the fact there aren’t many dual-caster builds possible, there are many different interpretations one can make using two casting classes. The goal in this type of build is to combine class features and spells from Divine and Arcane nature to perform amazing combos. This makes these builds extremely powerful, because some metamagic feats and class features apply to both casting classes, so they can benefit on both sides. <br/>\n <br/>\nFor example: Druids or Clerics with the Animal Domain can summon more powerful creatures with the Summon Creature line of spells. Wizards and Sorcerers have that spell too, so a Wizard / Cleric with the Animal domain or a Wizard / Druid will get improved summons regardless of whether they cast the spell from their Divine or Arcane book. The same holds true for the Wizard Scribe Scroll feat. It can be used to create scrolls from Arcane or Divine nature! Imagine having a host of self-crafted Mass Heal scrolls to fight Undeads! Wouldn’t it be great? These guys can do it!<br/>\n <br/>\nBecause this guide is for Arcane spellswords, I won’t focus on what’s potentially the most powerful dual-caster spellsword: Cleric / Druid / Monk. You can make a Wizard or Sorcerer / Druid or a Wizard or Sorcerer / Cleric. Again, Wizards are the most common choice because of versatility and the bonus feats and features that the class brings. Wizard bonus feats can be used to enhance INT if taken in epics, which means you won’t need to spend stat increases to be able to cast 9<sup>th</sup> level spells, and Scribe Scroll can be excellent to make the leveling process a cakewalk. Also, in Wizard builds one can generally trash CHA at pretty much zero expense, whereas in a Sorcerer build, if you do decide to trash INT, you’ll be severely hindering your skill points. For that reason, if you make a Sorcerer / Cleric or a Sorcerer / Druid, you might have to play them in a party where there’s a Rogue to handle traps, locks, find secret doors, etc.... Since these builds will normally be stat constrained, they need to min-max to get their casting stats up to decent levels. They have 2 casting stats, and in the case of Clerics, they also need a main physical stat to invest in (STR or DEX). Druids don’t need to worry, because they can fight shifted, with shapes that overwrite all their physical stats. For the same reason, these builds are hard to equip properly. You need to max out both casting stats, if possible, and you need to increase your physical stats too. In low and mid-magic worlds, this will require ingenuity, and a combination of items and buffs.<br/>\n <br/>\nThese builds share some of the characteristics described in previous sections with other spellswords, but some other unique features that are exclusive to them:<br/>\n <br/>\n·        They mature late, but they’re not hard to level because you always start leveling the divine casting class first to build BAB, and both Clerics and Druids are easy to level. <br/>\n·        They lag somewhat while they build their Arcane casting up in their 20s and early 30s. That isn’t as terrible as it sounds, because you can use Wizard or Sorcerer spells as many copies of Invisibility, Improved Invisibility, and other support spells, like you would with a Sneaky Spellsword, and fight smart to overcome challenges.<br/>\n·        They normally end up having more Arcane levels than Divine, both because high-level arcane spells are better, but also because arcane-exclusive Epic Spells (Epic Mage Armor and Epic Warding) are also better.<br/>\n·        They are VERY dispellable. If I’d have to say ONE major problem for this kind of build, it’s that you need to be worried about being dispelled for their whole lives. You MUST be proficient in dispel-baiting tactics and have a SOLID meta-game knowledge of your server so you don’t get “surprised” and end up getting stripped of your goodies often. You should also carry scrolls to rebuff in case things go wrong. <br/>\n·        They have trouble casting against Spell Resistant enemies. Because they have 2 casting classes, even though they will have access to most or all spells from both sides, they’ll invariably have trouble penetrating Spell Resistance due to their low caster levels. This will affect them more than other spellswords, because they need to invest many levels into both casting classes, which means they’ll be very evenly spread, whereas other spellswords could have 26 or even 29 Caster levels and penetration feats. This makes Spell Penetration feats generally, but not always, a bad idea for these builds, as they won’t raise your caster levels to a point which will allow you to penetrate anything that’s the over Max Toolset SR of 32. You just have to adjust and use other strategies against spell-resistant enemies, and stick to casting against those that don’t resist your spells.<br/>\n·        They can use SPELL COMBOS! Either combos with other spells or with class features, to attain PHENOMENAL results. Just as an example, imagine a high-Wisdom pure Cleric. If you cast Blade Barrier, it’ll do A LOT OF DAMAGE, but then the enemy will just move out of range of the spell and not get damaged any longer. Now imagine you cast Bigby 7, holding the target in place, and then Blade Barrier! They won’t be able to move, and Blade Barrier will eat through any DR spell they have and kill them rather quickly. Another example, this time with a Druid class feature. As most experienced Dragon Shapers know, nearing 40<sup>th</sup> level, Dragon Shape starts having trouble hitting high-AC mobs and bosses. A Wizard / Druid could cast Extended Tenser’s Transformation (only where the PnP version is available), then shift to Dragon Shape and have 40 rounds of enhanced AB while in DS. Together with Bless / Aid potions, this could get their AB to the mid-60s, where a “typical” Druid will have 54-57 AB. That’s a HUGE DIFFERENCE.<br/>\n <br/>\nAs you can see, there are plenty of reasons to combine a Divine casting class and an Arcane casting class in a build. What I’m going to say next might sound exaggerated, but I believe that in 98% of the cases, if not all, the 3<sup>rd</sup> class for such builds should be Monk. Since they’re combining Divine casting (WIS-based) with Arcane casting (INT or CHA-based), you’ll always have a “good” WIS score. There’s also Zen Archery, which transforms WIS into your combat stat as well, and with just a couple of Monk levels, they can get AMAZING benefits: Wisdom AC bonus (which stays even when you’re flat-footed), Cleave, Evasion, Deflect Arrows (only at Monk 2), Monk Speed (only at Monk 3), and Monk Attack Progression. I don’t see any build, even if one of these features isn’t used (in High-WIS Zen Archers, Monk attack progression doesn’t apply to bows), where another class would come even close to bringing as many benefits. It’s just SO MANY GOODIES for just a couple of levels. And with 2 Caster classes, you don’t really need UMD that much, so the usefulness of Rogue, Assassin, or Bard isn’t as relevant as in other builds. <br/>\n <br/>\nNow we come to the fun part: thinking about different ways to combine these classes with each other, and creating builds that, despite sharing the same 3 classes, are COMPLETELY from each other different in practice. My main experience has been with Wizard / Clerics. I have made 3 builds with Wizard / Cleric / Monk, each of them exploring a different synergy and using a different combat style. <br/>\n <br/>\nIn this section, unlike the previous ones, where many class combos were possible, I’m going to explore each build a little more in-depth, as the differences between them lie not in the classes they use, but the end to which they use them:<br/>\n<br/>\n1- The Speedy Sniper (Cleric 26 / Wizard 11/ Monk 3): This build was inspired by WhiZard’s Speed Caster, where he used Monk just to break the speed cap and make his character the Arcane Speedy Gonzalez. I took that idea into this class combo and made a Speedy Gonzalez Cleric Zen-Archer. The idea is to use Expeditious Retreat and Mass Haste to be “fast as lightning”, and Clerical buffs to bring the pain. If it looks like they might manage to come too close, cast ER, then Mass Haste, or 2x ER, and run like hell out of the way before they have a chance to know what happened. It almost feels like cheating LOL. The Wizard spell slots are almost exclusively reserved for variations of Haste effects, so Levels 1 and 2 will be Expeditious Retreat (normal and extended), 3 and 4 will be Haste (normal and extended), 5 can be Extended Improved Invisibility for practically permanent 50% concealment, and 6 will be Mass Haste.<br/>\n<br/>\n2- Aerie, the Wingless Avariel (Cleric 18 / Wizard 20 / Monk 2): First and foremost, the latest version of this build is posted at the bottom, which is why the title is different. Unlike the previous build, this one is a fully-fledged divine caster with high Cleric spell DCs, Spell Penetration to be able to penetrate Max Toolset SR, because she has low caster levels on both classes, but she relies more on casting offensively, and sniping as a backup plan. She also has a full Arcane Spellbook at her disposal. I know I said it was a bad idea to take Spell Penetration, in general, but she’s the reason I said not always. This build will be extremely effective against most enemies, with her hefty bag of tricks and combos but might struggle against spell-resistant high-level enemies, like the Drow. Her low CLs mean she won’t be able to penetrate their SRs, and at those high levels, Summoned Creatures don’t tank as effectively. Where the Speedy Sniper could just run and reposition before anything bad happened, this gal will need to use up a lot of resources to deal with these enemies. She can succeed, but it’ll be harder for her than for the others. On the other hand, against anything else, she’s probably the most resourceful one. She takes Animal Domain for improved summons, and with Scribe Scroll, she’ll need at least 40-50 scrolls of Summon Creature 9 spells, and possibly a wand of Improved Invisibility to give them concealment, so they last longer. Basically, playing her you should hide behind a Summoned Creature and then cast or snipe according to the situation. She has all the spell combos at her disposal: “Bigby 7 or 9 + Blade Barrier + Evard’s Black Tentacles” will annihilate non-evasion enemies with no DR. Haste + Time Stop + Implosion + Implosion (repeat if necessary) will almost surely insta-kill a tough mage boss before he gets his first spell off. No immunities apply against Implosion, and with her 42 DC, they will likely fail. Haste + Time Stop + SoV + SoV will stun large groups of non-immune enemies while a Summoned Creature goes to town on them. All in all a very well-rounded character to play, but she doesn’t have Epic Spells, which could be considered a weakness.<br/>\n<br/>\n3- The Magical Master (Wizard 23 / Cleric 15 / Monk 2): Again, the final version of this build is more towards the end of the topic. And now we come to that which I believe is the most powerful build in Neverwinter Nights. Of course, not taking into account items or severe farming, but what this guy can do, I believe no other build can. He uses Cleric just to be a competent self-buffer, focuses on DEX as his combat stat, and gets a full Wizard spellbook, Epic Mage Armor and Epic Warding. Why do I say he’s the most powerful build in NWN? Offensively, he has 61 fully-buffed AB, all Wizard spells, albeit with low DCs, damage shields and Epic Warding to kill enemies tanking if necessary, and he has 8 attacks per round hasted, with a Kama (buffed with FW, Keen Edge and GMW) and in Flurry of Blows mode, with damage bonus from Divine Favor, Battletide and Prayer. Defensively, he has Monk AC, EMA and EW, Expertise (although this feat is not essential), and can cast Bigby 5 against non-SR foes to reduce their attack by a further 10 if necessary. He has low HP, but because of his high AC, there are very few enemies that can hit him consistently. Against spells, he can craft Spell Mantle Scrolls and make sure that casters will need to target him with Dispel before they can actually use spells against him, which will buy him enough time to get one of his combos off. He doesn’t have 9<sup>th</sup> level Cleric spells, but there are no spells that don’t require a save at level 9, so it’s not really a big loss due to his lowish Wisdom score. Before his Wizard casting matures, he’s somewhat vulnerable, but as long as you play him carefully, you should be OK. Remember, you have Scribe Scroll. Use it.<br/>\n<br/>\nThese builds, despite having the exact same classes, have completely different approaches and goals. Two of them are snipers, but one uses it as its main combat strategy, and relies on speed for defense. The other one uses sniping as a way to conserve spells, and relies on casting for crowd control and summons to do damage. And then there’s the melee monster, who might not seem like much at first sight, but can do some pretty amazing things. I don’t want to spoil it for you, because I want you to have a chance to play him and literally come up with combos, instead of serving them to you on a silver platter. Part of the fun in playing him is trying out new strategies in new encounters.<br/>\n<br/>\n4- TheSquid’s Wood Witch (Wizard 21 / Druid 18 / Monk 1): I believe this build was also played by WebShaman to level 40. This build combines Wizard and Druid to make a Dragon Shaper with amazing Arcane powers. It has access to the whole Druid spellbook with high DCs, and Dragon Shape, plus all the Wizard staple spells, but can’t use DC spells on the arcane side, pretty much like all builds of this kind. It’s a beautifully well-thought out, powerful build that can use Tenser’s Transformation to enhance DS AB, which is the main problem Dragon Shapers face in late epics. It also allows much better use of Elemental Shape to save up Dragon Shape uses for tougher battles, although with only 18 Druid levels, they also have limited uses / day. Although I plan to play this build one day, I haven’t yet, which means I don’t know many of the combos it can perform. It’ll be fun to explore!<br/>\n <br/>\nThis concludes the Spellsword/Spellbow section of this guide. Next, in the last part, we’ll discuss playing tips, which will allow you to use them in-game much more effectively.<br/>\n<br/>\nA Few Tips on How to Play Casters:<br/>\n <br/>\nWe’ve reached the final section of this guide. Some of the things mentioned here will sound familiar, because they’ve been mentioned before, but now we’ll get a bit more specific:<br/>\n <br/>\n1.     Know thy saves, immunities, and vulnerabilities: Much of what’s important to know about these two items has been talked about, but there is more to be discussed. First, let’s discuss saves: you should always cast spells that TARGET your enemy’s weaknesses. What that means is that you should use will-save spells against will-weak enemies, reflex-save spells against reflex-weak enemies, and fortitude-save spells against fortitude-weak enemies. But the same thinking applies to no-save spells, therefore the choice of which spell to use follows the same logic for Bigby Hands, for example. To illustrate this, let’s take Bigby 6 vs Bigby 7. Bigby 6 knocks the target prone via an opposed check to the enemy’s STRENGTH, so it’s a GREAT WAY to disable casters and DEXers (provided they aren’t KD-immune), and a TERRIBLE way to attack warriors and other high-STR enemies. Bigby 7, on the other hand, makes a GRAPPLE CHECK, using your Caster Level as part of the equation, against enemy AC, so a Bigby 7 Hand cast by a character with 38 Caster Levels will be much more effective than one cast by a spellsword with 26 Caster Levels. This also means that STR-based characters are much more likely to be successfully grappled by the hand than an epic-dodging, high-AC DEXer, who would, in turn, be more susceptible to a Bullrush by a Bigby 6 Hand. So, as you see, the logic is simple, but the application of that logic requires knowledge of how each spell works, which can be found on the Wiki, but comes mostly from experience, observation, and trying out different ideas. As for immunities, you need to know what your enemies are immune to in order to select which spells to memorize as a Wizard, or to cast, as a Sorcerer. You do that by reading the combat log: “If you are in a party, and someone attempts a Knockdown (you can see the message on top of their head whether they hit or not, and whether the Knockdown was successful or not), the attack hits, it doesn’t say resisted, but the enemy still stands, you make a mental note that this enemy is immune to Knockdown, and therefore will be (at least partially) unaffected by some of your spells: Bigby 6, Grease, Great Thunderclap all have an effect negated by that immunity.” There is valuable information in the combat log. Sometimes it’s worth scrolling up after a fight to take a look at some specific stuff. That will give you the knowledge to at least know that some strategies won’t work. You might not know what does work, but you’re that much closer to finding out.<br/>\n <br/>\n2.     Spell Economy: Playing Arcane casters, especially Dedicated Casters, one thing you must consider is efficiency. This means that, in rest-restricted modules or PWs, where you need to have enough spells to last you through the day, you must not only cast the right spells in terms of attacking weaknesses, but also use the ones that’ll be the most efficient. This will affect whether you’re able to successfully level a caster. If you plan to use AoE spells, a good setup would be to cast Haste on yourself and try to round up many enemies in that AoE, either by doing it yourself or by using summoned creatures. This could be a risky strategy, because if you get caught in a bad position, you could get killed. But the times it does work out, it’s truly amazing. It maximizes how many enemies you can hit with each spell, allowing you to have spells for more encounters. Suppose you need 3 Firebrand spells to kill each Frost Giant, and you need to face 15 Frost Giants in a cave. You have 8 level 5 spells to spare, and have spent all your other slots on previous encounters. If you round them all up, you’ll kill them with just 3 spells, and have 5 spells left for the next encounter. If you take the safer route and take them on 5 at a time, you’d need 9 spells to take them out, so you’d be one short. That’s to kill the same 15 Frost Giants. Sometimes, the riskier play is the way to go. <br/>\n <br/>\nAnother very important part of the equation are consumables. If on one hand you need to conserve your spells, on the opposite end of the spectrum, you should incorporate consumables into your strategy for maximum efficiency. This includes, but isn’t restricted to, crafting wands and scribing scrolls, as well as buying them when you find them available. You never know when you’ll be caught with your pants down and need to resort to consumables to pull through. A mage with 50 scrolls of IGMS has a much higher chance of getting out of a bad situation than a mage with 5 scrolls. This also means that if you’re playing a mage on a PW, you might have to take occasional “crafting breaks”, where you either replenish or just build up your supply of consumables. It’s not as bad as it sounds, and doesn’t need to happen very often, but if you don’t do that, you might find yourself dying a lot more than you need to. I personally find dying more annoying than crafting breaks. Just saying!<br/>\n <br/>\n3.     Spell Combos: Here we’ll discuss a few strategies involving spells that will aid you tremendously in your leveling process:<br/>\n <br/>\n·        Animate Dead + Negative Energy Burst (preferably from Wands): Early in your career, this is one of the best combos to ensure an easy leveling process. You summon a Skeleton Warrior or Chieftain, buff it up with Improved Invisibility, Stoneskin, Bull’s Strength, Greater Magic Weapon, Flame Weapon and then from a distance, while the skelly rounds up the enemies, you heal it, slightly damage all the enemies (unless they’re undead. Don’t use against Undead), and at the same time lower their STR, and most likely their AB, unless they have Weapon Finesse. This combo works from level 9 (when you get Animate Dead), until about level 12 or 13, when the skelly can’t handle the increasing difficulty of the enemies you face. But during those few levels it’s sweet!<br/>\n <br/>\n·        Bigby 7 or 9 + Empowered Evard’s Black Tentacles: The damage potential of this combo is absolutely insane. You can cast Empowered Evard’s on an area, and hold key enemies in place using some iterations of Bigby Hands. There are 2 main situations where this combo won’t work: When enemies have high DR (then the tentacles won’t do enough damage) or when enemies are of small size (Small creatures are immune to Evard’s). If the target has Freedom of Movement, instead of being Held (unable to do anything), it’s instead Immobilized by the hands (it can still cast and attack, but can’t move), so it will continue to take damage from Evard’s, even though it has the immunity to counteract the paralysis effect from both spells. If they want to get out of the AoE, they’d have to cast dispel on themselves to get rid of the Immobilization effect, and then walk out of the area. However, because the damage is so massive, they generally won’t live long enough to do it.<br/>\n <br/>\n <br/>\n·        Protection from Alignment + Confusion / Mass Charm: The main issue with Enchantment spells is that they affect everybody in the AoE, so, if you have party members or non-immune summons fighting some monsters and you cast these spells, your party members will also be affected and probably pissed off at you. The way to circumvent this nuisance is to avoid playing a Neutral mage on a party. Pick either Good or Evil and then cast protection from your own alignment on your party members, and they’ll be immune to your mind spells. If you’re Evil, you’ll get a double whammy and give them immunity to enemy mind spells as well, as long as they’re not dispelled. <br/>\n <br/>\n·        Time Stop / IGMS, IGMS, rinse and repeat: Yes, I know, this combo is like a win button for any battle, and it’s undeniably effective. But you need to understand that it’s only useful in very specific circumstances (against single, very powerful enemies without any minions around), and also that in order to do this combo, especially as a Wizard, you need to pre-memorize spells, which means you’ll have fewer spells to deal with previous encounters. The ideal situation would be to rest before a REALLY TOUGH single boss with no minions, and then just blast it into oblivion, but in most cases, you’ll probably need to face multiple encounters on the way to that boss, and potentially some underlings in the same room as the boss, so it’s not as much of a win button as it may seem at first glance. It’s an AMAZING combo, but it needs all the stars to be aligned for you to pull it off properly. <br/>\n <br/>\n <br/>\n·        Epic Warding (or any of the other DR spells) + Mestil’s Acid Sheath + Elemental Shield + Death Armor + Shapechange Iron Golem: This combo is SO GOOD that there are builds made around it, like we saw in the damage-reflecting PM builds section. However, the only benefit they have over a generic mage is that they don’t need the Shapechange spell, since you only want it because you become immune to critical hits, which they already are. But, adding Shapechange to the combo makes it usable by any mage who is willing to re-memorize all the spells they’ll lose from bonus slots granted by items when they polymorph. That is in fact the biggest problem with this otherwise great combo. It’s very effective against high-AB hard-hitting bosses who aren’t resistant to Acid, Fire or Magical damage. It’s a great way to deal with Monks, since they’re Spell Resistant, but they have 7 attacks per round, so they’ll really hurt themselves trying to punch you to death.<br/>\n                                                            <br/>\n4.     Dispel Baiting: Now we will talk about what it possibly the most important aspect of playing casters. I’ll try to be as thorough as I can to explain the different types of tactics to use versus the different types of dispels. But first, let me start by classifying dispels into 2 main groups: Dispels and Breaches. I’m doing this because there are different tactics to bait each of these two types of dispels.<br/>\n <br/>\n·        Dispels: Dispels are Lesser Dispel (level 2), Dispel Magic (Level 3), and Greater Dispelling (Level 6). They make a Caster Level check against your caster level to try to remove all your buffs. A separate check is made to remove each buff you have, so some buffs may be removed and other buffs may remain. There is a maximum Caster Level of 15 for Greater Dispelling, which means the maximum possible result on this check is 35 (1d20 + 15) on the dispeller’s end. This is then opposed by 12 + Caster Level of the caster who cast the spell on the dispelee’s end, with the ties counting in favor of the dispeller. On EE, I believe this was changed to 11 + Caster Level. This means that if you have 24 or more (25 or more on EE) Caster Levels, you’ll be effectively immune to dispels from the three sources listed above (at least regarding your buffs). For AoE effects, there is a bonus involved, which means that AoE spells are much more likely to be dispelled than buffs. The bonus is CRAZY HIGH, so this means that your AoE effects WILL ALWAYS BE DISPELLED.<br/>\n <br/>\n·        Breaches: Breaches are basically dispels that cannot be resisted in any way, but that focus only on protective spells, so your offensive buffs are safe from this line of spells. There are two Breach spells: Lesser Spell Breach (level 4, removes 2 protections), and Greater Spell Breach (Level 6, removes 4 protections). They also reduce the target’s Spell Resistance by a little bit (2. Basically, here’s how they work: There is a priority list that these spells take into account, and they’ll start up at the top and work their way down to the bottom of the list until they remove the maximum number of spells listed in the description of each spell. Below is the list of spells for you to try to learn:<br/>\n <br/>\n <br/>\n                                       1.           Greater Spell Mantle<br/>\n                                       2.           Premonition<br/>\n                                       3.           Spell Mantle<br/>\n                                       4.           Shadow Shield<br/>\n                                       5.           Greater Stoneskin<br/>\n                                       6.           Ethereal Visage<br/>\n                                       7.           Globe of Invulnerability<br/>\n                                       8.           Energy Buffer<br/>\n                                       9.           Greater Sanctuary<br/>\n                                       10.      Minor Globe of Invulnerability<br/>\n                                       11.      Spell Resistance<br/>\n                                       12.      Stoneskin<br/>\n                                       13.      Lesser Spell Mantle<br/>\n                                       14.      Mestil’s Acid Sheath<br/>\n                                       15.      Mind Blank<br/>\n                                       16.      Elemental Shield<br/>\n                                       17.      Protection From Spells<br/>\n                                       18.      Protection From Elements<br/>\n                                       19.      Resist Elements<br/>\n                                       20.      Death Armor<br/>\n                                       21.      Ghostly Visage<br/>\n                                       22.      Endure Elements<br/>\n                                       23.      Shadow Conjuration (Mage Armor)<br/>\n                                       24.      Negative Energy Protection<br/>\n                                       25.      Sanctuary<br/>\n                                       26.      Mage Armor<br/>\n                                       27.      Stone Bones<br/>\n                                       28.      Shield<br/>\n                                       29.      Shield of Faith<br/>\n                                       30.      Lesser Mind Blank<br/>\n                                       31.      Ironguts<br/>\n                                       32.      Resistance<br/>\n <br/>\nAs you can observe in the above list, you don’t really need to memorize the whole list if you find what the logic is in this list: The most important types of effects that the breaches try to remove are: DR spells, Spell Protections and Elemental DR, with an exception made to Damage Shields, which are really low on the list, and Mind Blanks, which are pretty much neglected in comparison to other buffs. AC enhancements aren’t particularly high on the list either, except for Shadow Shield, but I think SS is there more for the death immunity aspect than for the AC buff. The list goes from higher level to lower level as well, but always prioritizing the 3 types of protections listed above.<br/>\n <br/>\n·        Mordenkainen’s Disjunction: This spell combines both of the previous effects into one spell. It dispels everything with a maximum Caster Level of 40, and breaches up to 6 spell protections at once. It also lowers your Spell Resistance by 10. This makes it EXTREMELY POWERFUL, so you should always try to avoid getting hit by it if possible. If there is ANY good news about this spell is that because it combines Dispels and Breaches into one, it can also be baited by both types of tactics. And since enemy AI will always start with their highest level spell to try to dispel you, you can use that to your advantage.<br/>\n <br/>\nNow that we’ve taken a look at how these different types of dispels, let’s talk about how to make your enemies waste these dispels on stupid shit rather than your all-important and juicy buffs, shall we? This is what we call dispel baiting. One more relevant piece of information that needs to be mentioned is that some enemy dispellers have multiple instances of dispels and/or breaches to cast.<br/>\n <br/>\n·        How to bait Dispels: There are 3 basic methods I know of to bait dispels. I find two of them to be reliable and one works on occasion.<br/>\n <br/>\n1)    Casting AoE spells that stay in place for a while (Grease, Evard’s, Stinking Cloud, etc..) while remaining out of sight from the dispeller: If you cast an AoE spell, you will be seen by pretty much everyone, so when I say remaining out of sight, I don’t mean being invisible, just to be clear. You have to be like around a corner or behind something, so that you have line of sight of the point from which you want the AoE spell to be centered at, but you don’t have direct line of sight to the enemy dispeller (they can’t see you). The spell needs to hit the enemy for this to work. Then they’ll dispel the AoE effect. This type of baiting ONLY WORKS on Dispels, not on Breaches!<br/>\n <br/>\n2)    Letting the enemy dispeller see you for a millisecond, then retreating out of their sight, quickly summoning a creature between you and them, and casting a couple of AoE spells around them, possibly from wands, as you need to be extremely fast. To use this method, you need to be hasted and the enemy can’t be hasted, so you can get far enough so it doesn’t detect you and breaks aggro. I don’t find this method to be very reliable, because when you attract their aggro, you’ll need to “get lucky” that the enemy AI doesn’t see you when you retreat and retargets to the summoned creature and AoE effects around it. Most of the time, however, once you attract their aggro, it’s very difficult to “shake them off”. Sometimes it works, sometimes it doesn’t. This method also only works on Dispels, not Breaches. I would resort to this method in areas where there are no obstacles or choke points only, like plains or vast grasslands. Otherwise, the method below is much more reliable.<br/>\n <br/>\n3)    Summoning a creature while you remain unseen by the enemy (from around a corner or behind something) and then quickly buffing it using a scroll or wand of Stoneskin, for example, then telling the summoned creature to hold ground. Then quickly running out of sight so that when the enemy dispeller approaches the summoned creature, they don’t retarget to you. If you stay where you are, there’s a huge chance that the enemy will retarget. After that, you can tell the summoned creature to attack, and watch its health bar,. When it dies, you can repeat the process if that enemy has more than one dispel. This method works on both Dispels and Breaches. You need to have a keen eye to gauge distance and line of sight correctly. You also need to be aware that when the summoned creature dies, the enemy will come for you next.<br/>\n <br/>\n·        How to bait Breaches: There are a couple of ways to bait breach spells that can work effectively for you:<br/>\n <br/>\n1)    Item 3 from the previous section.<br/>\n <br/>\n2)    The other method I know to bait breaches can be risky depending on how strong you are, how high your concentration is, and who you’re facing. Basically, if you’re going to fight an enemy that you know will try to breach you, you can go into the fight unbuffed (provided it’s fresh after a rest), and buff yourself with some stupid things just to get breached (like using a wand of Stoneskin on yourself), and then when the enemy runs out of dispels, you buff “for real” and whoop their behinds. This requires knowledge of the settings, as well as a rest area close to a tough fight that is winnable without buffs.<br/>\n <br/>\n3)    Knowing your enemy will attempt to breach you, you can cast a few “unnecessary” buffs that are ranked higher on the breach list than the ones you already have so that they breach those instead of the ones you don’t want to lose. This is basically more of a failsafe in case the previous methods don’t work. There are a few buffs that you can’t protect this way, like Premonition and Greater Spell Mantle. But, on the other hand, it’s extremely effective to keep your damage shields from getting breached, since the highest-ranked damage shield is just number 14 on the list. Suppose the enemy casts Greater Spell Breach on you and you have Greater Spell Mantle and Premonition active, when you get breached, these will be removed no matter what. Suppose you have Shadow Shield and then nothing else, except damage shields and some low-level buffs. Greater Spell Breach removes 4 spells, so you’ll lose Greater Spell Mantle, Premonition, Shadow Shield and Mestil’s Acid Sheath. However, Stoneskin and Greater Stoneskin are both ranked higher on the list than Mestil’s Acid Sheath, so by having them active, even though they’re not really doing anything when Premonition is on, you protect your damage shields from getting breached. Similarly, Spell Mantle is ranked higher than Shadow Shield, so it would “absorb” one of the Breaches, but you can’t really protect it because it’s the 4<sup>th</sup> on the list. If you cast Spell Mantle on yourself, you’d be protecting Stoneskin or Greater Stoneskin from getting breached, but not Shadow Shield. Nonetheless, it’s always a good idea to have a backup plan.<br/>\n <br/>\n <br/>\n5- Sneaky Casting: This specific technique is quite formidable if you need to cast single-target disabling spells on multiple enemies, but can’t be seen while doing it. As we all know, when you cast an offensive spell, your invisibility fades, and everyone can see you instantly. But, if you cast Darkness around yourself and it doesn’t hit any enemies, that won’t cause your invisibility to dissipate. After that, you may cast as many single-target spells from the fog as you like. Only the enemy you’re aiming at will aggro you. The rest will remain oblivious to your presence, unless they wander into the Darkness. I would summon a creature inside the darkness just to be safe and tell it to hold ground before starting the mayhem. Mind you, this sounds like an excellent combo, but it’s extremely hard to pull off, because monsters don’t stand still most of the time. They wander a lot, and may step into your darkness, which will make them go into combat mode.<br/>\n<br/>\nI believe this concludes the guide. I hope it sheds some lights on a few strategies I use build and level my arcane casters. If you have anything else to add, please don't hesitate to post it here, and i'll edit this post to include the information.<br/>\n<br/>\nTake it EZ!</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:04 PM - Nov 01, 2020",
      "content": "<div>I can't pretend to have taken it all in, Max, but detailed and comprehensive it certainly is! It's amazing what you can knock off in 10 minutes  <span class=\"text-emoji\">😉</span>.<br/>\n<br/>\nBut seriously, thank you very much for this - and to Orion, of course - I'll be trying to get my head around it for a while, I suspect. The problem then will be, should I ever actually embark on a casting career (or a casting weekend, anyway), I'll know who to blame for my deficiencies!<br/>\n<br/>\nThanks again, Max.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:38 PM - Nov 02, 2020",
      "content": "<div>Arcane spellcasting is a huge topic. Here Max, you and Orion have dug deep and provide a lot of useful information that we all can learn from.<br/>\nThank you for sharing!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "joseantoniomuel",
      "avatar": "no_avatar.png",
      "timestamp": "8:51 AM - Nov 24, 2020",
      "content": "<div>A well of wisdom max, thanks for sharing this awesome guide</div>"
    }
  ],
  "author-color": "#00AA00"
}