{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "282",
  "name": "Build Testing",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/build-testing-t521806.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": "3",
  "views": "1.0K",
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:52 PM - Nov 05, 2011",
      "content": "<div>Hail, ECBers.<br/>\n<br/>\nI have built over 30 toons in my life, which to you may not be much, but to me is plenty, considering that I have so little time to play and also the long breaks I have taken from the game. I do have enough time to post because my work allows me to have lots of free time with SOOO many interruptions, which makes online play impossible, as there is no pause. I guess I could play Single Player modules, but that bores me nowadays, as my builds are normally too powerful for these environments aimed at less experienced players. <br/>\n<br/>\nAnyway. This excessive free time for some things, like building and posting, when combined with the lack of free time to actually play the game, leaves me with many untested builds (many have NEVER gone out of the Training Mod for a spin on any server). I was wondering if anyone here would be in the opposite situation, with lots of time to play and not so much time, patience or knowledge to build. If so, I would love to show you my builds that have never seen the light of day so that you can play them and tell me your thoughts. I know that playstyle is a very important factor, and that one same build can be a monster in the hands of one player and not so effective in the hands of another with a different playstyle, but I'm confident I have a good variety of builds so that I will have a good toon for each different type of player to play.<br/>\n<br/>\nSo, if you're reading this, and are interested in a partnership, either PM me or post here.<br/>\n<br/>\nThanks in advance!<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:42 PM - Nov 05, 2011",
      "content": "<div>After I finished last post, I thought I should at least mention some of these builds that I have made and never or hardly ever played. So here's a list of all I could think of:<br/>\n<br/>\n- Paladin 29 / CoT 10 / Monk 1 - Zen Archer with high WIS, Divine Might, average CHA and very high saves. Most glaring weakness is lack of skill points.<br/>\n<br/>\n- Fighter 14 / WM 7 / Rogue 19 - DEX-based meleer with ED, SC5, WS, EWS and high SA damage. Damage to creatures with SA and Crit immunity is low, but UMD can supply some.<br/>\n<br/>\n- Bard 20 / RDD 10 / PM 10 - High AC defensive melee build with somewhat limited offensive power. Has Lasting Inspiration, Curse Song and all Bard spells, but only 3 APR with a not-so-high AB.<br/>\n<br/>\n- Ranger 8 / Wizard 10 / Assassin 22 - Sneaky guy with loads of Invisibility and Improved Invisibility spells, as well as True Strikes, to ensure many chances of paralyzing enemies. DA DC is only average, though, so you need to know who to attack for maximum effectiveness.<br/>\n<br/>\n- Cleric 26 / Monk 6 / CoT 8 - Dual-Kama wielder with very high AB and AC, 10 APR, highish saves and full Clerical goodness. Also not so good on skill points and no UMD, sadly.<br/>\n<br/>\n- Monk 20 / Cleric 15 / SD 5 - High-speed puncher with all Monk immunities and goodies, 1d20 damage fists (or 2d6 if you go with Halfling), HiPS, Epic Dodge and very high AC (and AB as well, as is customary in Cleric 15 builds). Dispellability will be the biggest issue here, and not-so high duration of the buffs could also be a problem if your attention is scarce.<br/>\n<br/>\n- Monk 9 / Fighter 9 / Assassin 22 - Also a puncher, but with Death Attack and Stunning Fists. highish AB for a sneaker, but not that high all things considered, WS and EWS (Unarmed) and 6 chances to paralyze an opponent at the start of combat (3x Stunning Fists + 3 DA on the first flurry).<br/>\n<br/>\n- Fighter 12 / Rogue 2 / Dwarven Defender 26 - High DR and competitive AC build with DevCrit taken in the end. AB is somewhat on the low side, but UMD scrolls can help a bit. The lack of STR (26 final only) due to the investment in CON for EDR is what lowers your AB, as you have full BAB. UMD helps a bit with scrolls and wands, especially if you can trade with a Cleric for a GMW, a Divine Favor and a Darkfire wands. Then you'll be awesome!<br/>\n<br/>\n- Rogue 14 / Fighter 8 / Dwarven Defender 18 - DEX-based build with ED, 18/- points of DR, high AC and UMD. Good SA damage towards the late 20s, early 30s, full Set Traps and Stealth skills. Weakness I guess would be damage, but it does get WS / EWS and UMD to help out with that.<br/>\n<br/>\n- Sorcerer 26 / Bard 4 / RDD 10 - Spellsword with UMD, full Arcane spells and Auto-Still 3. Lowish AB for a meleer, but loads of True Strikes and other buffs to help a bit. Very good AC.<br/>\n<br/>\n- Fighter 12 / WM 25 / Rogue 3 - Classic high AB melee build with loads of feats and possibilities. Lack of skill points is the main weakness, low will save is also a PITA. I've played this one in a high magic unbalanced Brazilian PW, but only once from 1-39 before I decided to abandon that wretched server.<br/>\n<br/>\n- Ranger 23 / Rogue 16 / SD 1 - Highish AB and AC dual-wielding stealther with ED, BoE and HiPS. Very hard to level early on, so playability or lack of will therefore be the main weakness. I have also played this guy once through Aileund a long time ago. He becomes quite a beast after lvl 23, but before then you really gotta tread carefully and use summons (or henchmen )<br/>\n<br/>\n- Bard 11 / Blackguard / 19 / SD 10 - Very high AC stealther with ED, Divine Shield and HiPS. 6D6 SA and a crappy summon to help you generate sneaks. Buffs don't last for long and are quite dispellable, so pick a few and have multiple stances memorized. Is feat and skill starved, but gets HiPS at lvl 8 and ED at 27.<br/>\n<br/>\n- Cleric 38 / Monk 1 / Rogue 1 - Wisdom-based Zen Archer / Caster with very high DC evocation spells, full Clerical goodies and a very good AC as well. Low skill points is the main weakness.<br/>\n<br/>\n- Sorcerer 35 / Paladin 3 / Rogue 2- Near-pure arcane caster with Divine Shield (+16 AC with capped CHA, which alongside Haste caps Dodge AC), adept of casting in full plate and shield and with focus on instant death spells. DCs aren't as high because ending CHA is only 30 base, but not so gimped either, especially with Epic Spell Focus: (Necromancy). His AB is very gimped, only 22 BAB and a very bad combat stat, but he's supposed to kill things with spells, and to melee, you need either Tenser's Transformation or Shapechange, although no items merge when you cast either spell.<br/>\n<br/>\n- Paladin 20 / Druid 18 / Monk 2 - Full BAB Dragon build. Extremely dispellable but far from gimped even when dispelled. I think it reaches 68 AB in DS, with Divine Favor on, although I could be wrong, as I haven't touched that build in ages. The weakness here would be the alignment shift, which is also why I've never taken it out of the oven (so to speak), but it's a very good build to have in the Training mod just for fun. Hardish to level, but not so much that it's unplayable. The Ranger Rogue SD build is far worse as far as playability goes.<br/>\n<br/>\nNot to mention the ones I'm actually playing, like my Magical Master, Holy Weapon Master With Cheese, Shadow Priest, HOOD and Champion of the Wilderness builds. So far, on WoG, here's their status:<br/>\n<br/>\n- Magical Master - Level 39<br/>\n- Holy Weapon Master With Cheese: Level 37<br/>\n- Champion of the Wilderness: Level 37<br/>\n- Shadow Priest: Level 24<br/>\n- HOOD: Level 21<br/>\n<br/>\nWell, as you can see, having built so many toons that I am not able to play has somewhat diminished my desire to build, as I already have so many of them that I want to try out and no time to do it. That is very frustrating, but I'm only 32 years of age and I don't wanna wait for my retirement to be able to play them. Again, if any of you is interested in playing any of these builds and exchange ideas with me, it'd be the closest I can get to playing them myself, and it'd be great.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "3:24 AM - Nov 06, 2011",
      "content": "<div>Contrary to what Mr Kail might suggest, lack of skills is NOT a deficiency!  It is called ROLE PLAYING!  LOL<br/>\n<br/>\nSeriously, there is no such thing as THE perfect build, so you can NEVER have everything (though I came close with my PRC cleric, imho.  at least for me and my play style).  Tumble is really the ONE essential skill I would consider (for the +8 AC), and even that i have forsaken at times (see above line).  I know you guys are all about spot and listen, but clunking through the world in full plate with a tower, i resigned to the fact that I was a sitting target!  LOL  the \"essentials\" were Concentration (so I wouldnt miss casting), Lore (for PRC spells.. every 10 gave you +1 memorized EPIC spell), Spellcraft (+ to saves and in PRC they allowed you to LEARN epic spells) - interesting how a human cleric gets 3 per level?  LOL  <br/>\n<br/>\nYou work around what you need (immune to KD was big, for example).  <br/>\n<br/>\nThe whole thing is, if you consider lack of skills as THE con, then it aint no con at all!  (and YES, I played exclusively Half-orcs at the end of my career, and NONE were wizard-like)!<br/>\n<br/>\nGood suggestion Max!</div>"
    },
    {
      "author": "RookY2K",
      "avatar": "no_avatar.png",
      "timestamp": "8:44 AM - Nov 06, 2011",
      "content": "<div>Heya Max!  Ok, Obviously I have nowhere near the NWN (or D&amp;D) experience that you do, but I have a ton of RPG experience, and it is translatable. If you want someone to playtest builds for you, I'd be way more than willing. We'd have to talk to figure out what you are looking for in terms of usable input, but that could be easily worked out. I plan on trying out WoG in the near future.. I'm just in the middle of finishing the Aielund SP campaign.  Once I finish that, I'm switching to multiplayer. So, in short, respond here or by PM with your interest level. <br/>\n<br/>\nV/r<br/>\n<br/>\nMe</div>"
    }
  ]
}