{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "248",
  "name": "The need for AC - How much is enough?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-need-for-ac-how-much-is-enough-t2350346.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": 12,
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:36 PM - Feb 21, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">As per topic title,<br/>\n<br/>\nAnd since i have seen my fair share of players &amp; player builds on WoG and some other places too,i wanted to ask each one of you - How much AC do you need to make you feel comfortable?<br/>\n<br/>\nAnd i don't mean comfortable by meaning \"i never get touched\" but at what point do you feel there is a good chance for your characters to enter combat without the need to worry every few seconds about their well-being.<br/>\n<br/>\nI ask this because i see a raising tendency over the years for very high AC toons (PM's apart) and the general feeling that every build must have improved expertise and/or a T. Shield to make it work.<br/>\n<br/>\n<br/>\nTo give some guidelines since the topic can have a very wide range of answers depending on the environment let me specify some things first.<br/>\n<br/>\n1) This is intended for low-to-medium magic PW's like {WoG/Kharindale/Three Towns/The North} and not high magic ones, since there the general rules of character building tend to fall apart.<br/>\n<br/>\n2) Let's limit the answers to the forty level since there is when a build is completed and let's include magic items (up to +5/+6) too, since most of the builds are meant to fight while equipped with them. <br/>\n<br/>\n<br/>\nI seek in depth answers if possible and not one-liners please<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:44 PM - Feb 21, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I will start the topic by saying that myself i am comfortable with 60 AC at level forty.<br/>\n<br/>\nI do expect to be hit by bosses and some hard champions but in general, in WoG (level+20) is enough if you don't rush headlong to every encounter.<br/>\n<br/>\nI have lead to forty characters with AC below that, but they had some other means of absorbing damage and some hefty HP's too. <br/>\n<br/>\nRemember that in WoG we do have some nice shield bracers (+4/+6 shield AC) that help to equalize the AC of 2-handed characters.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:43 PM - Feb 21, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice topic there, man!<br/>\n<br/>\nI generally aim not just for AC, but for AB to AC ratio. That's just the best possible offense or defense you can get without hampering the other side.<br/>\n<br/>\nI, however, because of my semi-suicidal playstyle and need to feel the adrenaline rush of trying out something deemed impossible or very hard to achieve by the \"average player\". Therefore, if possible, I try to aim at AT LEAST 65 maximum achievable AC on builds that are supposed to have lower AC and above 70 in builds that are supposed to have a higher AC.<br/>\n<br/>\nHere are some of the stats of some of my level 40 characters on WOG:<br/>\n<br/>\nMaximillian Kane - AC 77 (82 with Expertise), AB 61 - My Magical Master build<br/>\nNatalya Salomon - AC 73 (78 with Expertise), AB 63 - My Holy Weapon Master With Cheese build<br/>\nMelvin Manhoef - AC 71 (but has Epic Dodge, no Expertise), AB 63 - My Shadow Priest build<br/>\nAegis Silverwolfe - AC 82 (In Dragon Shape, 87 in Expertise), AB 56 (63 with Divine Wrath for a few rounds and Bless and Aid potions) - My Champion of the Wilderness build<br/>\n<br/>\nSo, as you can see, I aim for the highest possible AC without giving up offense for it. Since I'm a bit impatient and tend to tackle things head on and try out bold strategies such as rush in, KD, kill. BUT, I must say that partly the reason for this is that my toons have relatively low HP, so they can't withstand that much punishment without taking a dirtnap. In characters with higher HPs, I could live with less, but I just don't like to <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:18 AM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I guess that makes justice to your name dude!  (MAXimillian Kane)<br/>\n<br/>\nOkay those are perfect reasons for wanting so high an AC, anyone else want to share his opinion?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:36 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Valerfor wrote:</strong><br/>\nDrow ARCHmage with 13 AC</div></blockquote>\n(I borrow this one from another topic.) Pretty much how I like to play mages in PvM. AC vary between 9 and 12. 13 is a bit over the top. It makes crowd control more of a challenge. Can't just stand there in the middle of things like an exalted sorcerer.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:03 PM - Feb 22, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice to see you playing it hard Mick!<br/>\n<br/>\nThat means you don't even do EMA?<br/>\n<br/>\nHow about your melee toons?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:49 PM - Apr 21, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Valerfor wrote:</strong><br/>\nHow about your melee toons?</div></blockquote>\nMost of them have a naked AC between 28 and 36. Some have Expertise. Some cross class Tumble. In low magic settings buffs are important. In high magic settings the sum of AC bonus from different sources soon makes the physical defence almost impregnable, no matter what.<br/>\n<br/>\nThis topic reminds me of how I once wanted to see if I could make a toon with a self buffed AC above 100. I guess I succeeded, but for obvious reasons, I never play it. After all, AC is not everything.   <br/>\n<br/>\n<br/>\n\t\tSpoiler<br/>\n<br/>\n\t\t\t[+]<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>The Boneguard</strong><br/>\n<br/>\nBard 11/ PM 28/ Cleric 1<br/>\nTheme build, AC – low playability<br/>\nElf, non good, non lawful<br/>\n<br/>\nAttributes<br/>\nStr 13<br/>\nDex 18 (31)<br/>\nCon 6<br/>\nInt 13<br/>\nWis 8<br/>\nCha 16 (19)<br/>\n<br/>\nLevel Guide<br/>\n1 Bard 1 Curse song<br/>\n2 Bard 2<br/>\n3 Bard 3 Dodge<br/>\n4 Bard 4 Dex 19<br/>\n5 Bard 5<br/>\n6 Bard 6 Expertise<br/>\n7 Bard 7<br/>\n8 PM 1 Dex 20<br/>\n9 PM 2 Improved Expertise<br/>\n10 PM 3<br/>\n11 PM 4<br/>\n12 Bard 8 Empower spell, Cha 17<br/>\n13 PM 5<br/>\n14 PM 6<br/>\n15 PM 7 Power attack<br/>\n16 PM 8 Cha 18<br/>\n17 PM 9<br/>\n18 Cleric 1 Divine shield<br/>\n19 PM 10<br/>\n20 Bard 9 Cha 19<br/>\n21 PM 11 Armor skin<br/>\n22 PM 12<br/>\n23 PM 13 Energy resistance Acid<br/>\n24 PM 14 Great dex I, Dex 22<br/>\n25 PM 15<br/>\n26 PM 16 Epic mage armor<br/>\n27 Bard 10 Great dex II<br/>\n28 PM 17 Dex 24<br/>\n29 PM 18<br/>\n30 PM 19 Great dex III, Hellball<br/>\n31 PM 20<br/>\n32 PM 21 Dex 26<br/>\n33 PM 22 Great dex IV, Epic warding<br/>\n34 PM 23<br/>\n35 PM 24<br/>\n36 PM 25 Great dex V, Greater ruin, Dex 29<br/>\n37 PM 26<br/>\n38 PM 27<br/>\n39 PM 28 Great dex VI, Mummy dust<br/>\n40 Bard 11 Dex 31<br/>\n<br/>\nSkills<br/>\nTotal skillpoints 157<br/>\nPerform 14 (18)<br/>\nTumble 40<br/>\nSpellcraft 42 (43) [45]<br/>\nTaunt 43 (47-53)<br/>\nLeftover 18<br/>\n<br/>\nSaves<br/>\nFort: 20<br/>\nRefl: 29<br/>\nWill: 24<br/>\n<br/>\nAttack<br/>\nAB: 22/17/12 (33/28/23) (Empowered Bull’s, GMW, War Cry, Bard song) [41/36/31] [Curse song, Taunt]<br/>\nDamage: Rapier 1d6 +1(18-20/x2), Buffs +11<br/>\n(If you take W. finesse instead of Dodge, you get AB 31 (42) [50], making the character a bit easier to play normally).<br/>\n<br/>\n<strong>AC<br/>\nAC in Robes and Towershield, unbuffed: 50 (Base 10, Armor skin 2, Bone skin 16, Tumble 8. Dex bonus 10, Dodge 1, Shield 3)<br/>\nBuffs and active feats: 51 (Epic mage armor 20, Improved expertise 10, Divine shield (with empowered eagle’s ) 8, Empowered cat’s 4, Haste 4, Bard song 2, Mage armor 1, Curse song 2)<br/>\n<br/>\nTotal AC: 101</strong><br/>\n<br/>\nTo achieve this you must roll high cat’s and eagle’s so you get Dex 38 and Cha 26. (You get several attempts because of the extra spellslots from Cha and PM levels.)<br/>\nThe dodge AC is geared towards it’s capped max (20) with EMA 5, DS 8, Haste 4, Bardsong 2 and MA 1<br/>\nUnfortunately EMA and MA don’t give shield AC.<br/>\n<br/>\nOther defensive features<br/>\nHP: 195, Bard song adds 8<br/>\nEpic warding<br/>\nImproved invisibility (50% concealment)<br/>\nWounding whispers<br/>\nPM immunities<br/>\nDomain powers: War – small DR, Protection – sanctuary (9 rounds)<br/>\n<br/>\nOther features<br/>\nPM special touch attacks<br/>\nUndead summons: Warrior lord, Alhoon elder, Wraith, Skeleton chieftain<br/>\nBard spells essential for the build: Cat’s, Eagle’s, Haste, MA<br/>\nOther bard spells: Bull’s, GMW, Imp. Invisibility, War cry, Wounding whispers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "4:45 PM - Apr 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Does anyone have numbers the are shooting for in lvl 30 builds?  Max I like how you showed the ratios.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:41 PM - Apr 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Doing this for lvl 30 isn't hard but what is the general level of items that are we talking about?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "10:51 PM - Apr 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">+3 to ac to armor and shield +3 ab to weapons.  If you plan it right and get the best items you may be able to get +12 to two attributes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:27 AM - Apr 24, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ouch!<br/>\n<br/>\nOnly +3 items for a lvl 30 PW? Then this environment clearly supports best DEX-based sneaks &amp; Clerics along with Spellswords. Generally in these kind of worlds you want to have a trick up your sleeve, such as Divine Shield OR Epic Dodge OR something similar, OR be a Cleric. Hmm, +12 to two stats eh? I suppose that Monks (with clothes) will do good as well there, especially Cleric/Monks...<br/>\n<br/>\nBut to give you an example, i will say that a Ftr/ Rog/ CoT for example-and i choose this because it is both nowhere forbidden &amp; classic- will have an AC while in Full plate &amp; Shield of 45. But this character if build right will also have a good AB and Expertise as well, so it is 50 AC with Expertise ON. Now a Ftr/ Bard/ RDD (if it is allowed), will have assuming the same equipment +4 AC more than that and Haste will add another 4 AC.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "lightningkmf",
      "avatar": "no_avatar.png",
      "timestamp": "7:04 PM - Apr 24, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for a nice insightful post.  Two of the ideas that you had were similar to ones I was thinking about as well.  I have been thinking a cleric24/monk6 seems really strong.  I also feel like a bard 16/ftr4/CoT10 is an incredible  duelist. He manages to have good offensive power if you go strength based while still having a good defense. If you bars song, curse so g, taunt, improved expertise you get some pretty strong bonuses that can't be dispelled.  They could try and make their character go deaf in a Pvp situation but pve it's not an issue. If they do it in Pvp you have umd and can just dispel it off them.  <br/>\n<br/>\nFor a more defensive approach to the blade singer concept you could go bard16/SD10/monk4 (Bards can be lawful on Arelith).  This guy can get +4 ac from SD, monk wis ac, and most importantly epic dodge.  The thing I don't like about this one though is you need so many different stats.  Dex,Con,Wis,Cha and you don't want 8 strength either.  This one will have a damage problem I think. You also won't be able to win every saving throw like the COT variant can.  When getting gear u will either have to decide between +CON or + WIS (you will obviously do +DEX).  If u do wis you can get an additional 6 ac taking advantage of monk lvls.  Con will make you more resistant to damage spells the just try and widdle you down as well as some added fort.  You have to wonder though, if your not taking advantage of the monks ac then was it worth giving up your shield and all the feats from ftr cot.  I feel like this one sounds really nice at first glance wit when you delve into it, it's a case of trying to much in one build. <br/>\n<br/>\nThere is also the classic Ro13/Ftr10/WM7.  It's not a unique or novel build at all but there is a reason for that.  It's built as a dexter and gets ED.  It's not uncommon for Dexters to suffer from low damage values.  The WM levels help you here.  If you want you can get epic traps from your rogue levels. In my opinion the bard 16/CoT10/ftr4 is a little bit better.<br/>\n<br/>\nThanks for the dialog and if you disagree with anything I stated please let me know! I love discussing builds and build composition.  Which do you like the most? Any I listed or something else entirely? IMO it's a tough call between the Cleric 24/monk 6 and the Bard16/Cot10/Ftr4<br/>\n<br/>\nedit:  I wanted to add one more into the mix.  Bard16/PM10/Ftr4.  Compared to the CoT variant, you would be loosing 5 feats including epic weapon spec, 2 BAB not including loss of strength which you would suffer from having less epic feats, and the + 5 sacred defense  bonus.  The two big things you would get in return are an immunity to critical hits and +6 ac.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:45 AM - Apr 25, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The classic as you said Rog 13/ Wm 7/ Ftr 10 sounds pretty solid and the Bard 16/ Ftr 4/ CoT 10 with lingering &amp; curse song is sure strong as well. I won't say anything about clerics, they are a category of their own especially in low magic worlds like yours. The last choice Bard 16/ PM 10/ Ftr 4 it will cost you much though. I simply cannot see that character having more than three attack/ round if you want a late tumble dump and no matter how much he can buff or de-buff others his actual AB will be pretty low, abysmal i would dare say. If you want a defensive brick that others cant hurt, you better go all the way down the road and make him a Bard 8/ PM 16/ Ftr 6 or something similar with EMA as well, then nothing short of spells will ever kill you.<br/>\n<br/>\nYou forgot one other choice as well, Ftr 16/ Bard 4/ RDD 10 should be super solid as well but something tells me that is forbidden? Consider another choice as well, Monk 25/ Ftr 5, the last lvl taken in an epic general feat lvl in order to get EWS. Should be good as well if you can manage to buff his attributes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}