{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "948",
  "name": "(Anphillia) Human Blackguard, Level 16",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/anphillia-human-blackguard-level-16-t2354919.html",
  "author": "VXer",
  "avatar": "10758931_1531210879.png",
  "replies": 6,
  "posts": [
    {
      "author": "VXer",
      "avatar": "10758931_1531210879.png",
      "timestamp": "8:10 AM - Jul 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi all, trying to work out a solid Blackguard build (Level 16 PW server) for Anphillia.<br/>\n<br/>\nThere's a few criteria to take into account:<br/>\n<ul>\n<li>Paladins cannot be a part of Axfell, Blackguards cant be a part of Cleaven. So no Paladin/Blackguard mixes for the double-saving throws.</li>\n<li>You can only \"bank\" (i.e. leave unspent for next level) as many skill points as your INT modifier, plus one (minimum of one, so you can always invest in cross-class skills). Additional skill points will be distributed to your skills arbitrarily. So no dips for skill points, unfortunately.</li>\n<li>The PvP interaction is between player factions, while PvE is for the environment/NPCs around us. The necessity for PvE isn't too much of a requirement but it's worth noting.</li>\n<li>Uses the CNR crafting system and it's relatively low magic (Best I've seen is +4 vs Racial, with a flat +2 Attack/Enhancement Bonus)</li>\n<li>[Edit] Forgot to include: Monk has RP restrictions applied, has to be part of a monastic order and due to the tiny Monk dip (2+ levels), it's off the table as well.</li>\n</ul>\n\nBased on the level limit and the progression for APR being very tightly tied to the level range, I was thinking of a Fighter/Ranger/Blackguard mix if only to push for 16 BAB, though I'm not against giving up that 4th attack if the bonuses are worth it.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://anphillia.pw/w/index.php/Subraces\" rel=\"noreferrer\" target=\"_blank\">Subraces</a> of Anphillia include some stat/skill additions for races; Human gets some mechanical increases on top of their already decent racial bonuses for a low level setting so I would appreciate the good ol' reliable Human for race choices. Just for reference on the Subraces that hold the most relevance (which include Quick to Master and the Human bonus feat):\n<div class=\"codebox\"><p>Code: <a href=\"#\">Select all</a></p><pre><code>Nordsman\n+4 Dodge AC vs Giants\n-1 Appraise\n-1 Spellcraft\n-1 Lore</code></pre></div>\n<ul>\nNordsman is relevant due to the presence of Ogres and Giants in several areas. There's enough where that +4 Dodge AC is almost entirely worth it and a -1 Appraise, -1 Lore doesn't affect a melee character that much. (Lore is near useless as most items are auto-ID'd). The -1 Spellcraft, without the ability to properly skill dump does cause some grief as the best applicable cross-class skill is 9 Ranks but I know it's total ranks for Spellcraft. At least it's not affecting the 5 total ranks into Tumble, ha!</ul>\n<div class=\"codebox\"><p>Code: <a href=\"#\">Select all</a></p><pre><code>Highlander\n+2 saves vs fear\n-2 Pick Pocket\n-2 Open Lock</code></pre></div>\nBeing a melee class, the lower Will saves (Even with Blackguard bonuses) will hurt. I haven't run into enough Fear effects besides a few boss creatures so I'm unsure on the real value here.<br/>\n<br/>\nThe approach I had previously worked on looks a little bit like the Shadow Knight by Valefor, before the skill banking restrictions were turned on which ... was a real bummer, let me tell you.<br/>\n<br/>\nI \"want\" to maintain the full 10 Blackguard, but based on restrictions I can live with 7 Blackguard minimum (I miss out on +1d6 Sneak Attack, Inflict Critical Wounds and the Vrock).<br/>\n<br/>\nOne other thing of note: The success of melee characters is veered heavily to Sword&amp;Board (Improved Expertise) tanking, which I despise because of how dull that becomes. It also restricts the INT score to 13+ and forces 2 feat choices that restrict choices (I'm already having to take Power Attack and Cleave).<br/>\n<br/>\n--<br/>\n<br/>\nThis is what I had come up with before (I'm aware it's not ECB format, needs some tender editting). I haven't broken down skills in the revision and I'm unsure what to take to fill the gap (Level 5 - 6) leading to Blackguard. Ranger seems like the smart choice to hit 5 Hide and maintain BAB requirements) but as previously said I could delay blackguard by 3 levels to really skim some value from a different class.<br/>\n<br/>\n<table class=\"post_content_table\"><tbody><tr><td><strong>Character Level</strong></td>\n<td><strong>Class</strong></td>\n<td><strong>Class Level</strong></td>\n<td><strong>Ability Point Increase</strong></td>\n<td><strong>Feats</strong></td>\n</tr>\n<tr><td>1</td>\n<td>Fighter</td>\n<td>1</td>\n<td></td>\n<td>Power Attack, Cleave, Weapon Proficiency (Exotic)</td>\n</tr>\n<tr><td>2</td>\n<td>Fighter</td>\n<td>2</td>\n<td></td>\n<td>Blind-fight</td>\n</tr>\n<tr><td>3</td>\n<td>Fighter</td>\n<td>3</td>\n<td></td>\n<td>Weapon Focus (Dwarven Waraxe)</td>\n</tr>\n<tr><td>4</td>\n<td>Fighter</td>\n<td>4</td>\n<td>Strength (+1)</td>\n<td>Weapon Specialization (Dwarven Waraxe)</td>\n</tr>\n<tr><td>5</td>\n<td>?</td>\n<td></td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>6</td>\n<td>?</td>\n<td></td>\n<td></td>\n<td>Expertise? Other?</td>\n</tr>\n<tr><td>7</td>\n<td>Blackguard</td>\n<td>1</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>8</td>\n<td>Blackguard</td>\n<td>2</td>\n<td>Strength (+1)</td>\n<td></td>\n</tr>\n<tr><td>9</td>\n<td>Blackguard</td>\n<td>3</td>\n<td></td>\n<td>Improved Critical (Dwarven Waraxe)</td>\n</tr>\n<tr><td>10</td>\n<td>Blackguard</td>\n<td>4</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>11</td>\n<td>Blackguard</td>\n<td>5</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>12</td>\n<td>Blackguard</td>\n<td>6</td>\n<td>Strength (+1)</td>\n<td>Feat (If CHA, Div. Might/Shield, otherwise?)</td>\n</tr>\n<tr><td>13</td>\n<td>Blackguard</td>\n<td>7</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>14</td>\n<td>Blackguard</td>\n<td>8</td>\n<td></td>\n<td></td>\n</tr>\n<tr><td>15</td>\n<td>Blackguard</td>\n<td>9</td>\n<td></td>\n<td>Feat (If CHA, Div. Might/Shield, otherwise?)</td>\n</tr>\n<tr><td>16</td>\n<td>Blackguard</td>\n<td>10</td>\n<td>Strength (+1)</td>\n<td></td>\n</tr>\n</tbody></table>\nSince it is low magic I didn't focus much on obtaining Divine Might/Shield due to the short duration/bonuses, but they are an option as changes occur. Any feedback is appreciated, would love to improve upon this somehow.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:02 PM - Jul 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm certainly no expert in Blackguards, and that restriction on skill dumps is a bummer as far as Tumble goes in particular. Even so, and ignoring everything else, you'll certainly be wanting to take Knockdown and possibly its improved cousin (IKD in particular if you're facing lots of giants). For a possible 3rd class, Ranger, Monk or Rogue (Bard if CHA) still seem sensible options.<br/>\n<br/>\nAnyway, that's a starter for you, I hope<br/>\n<br/>\nEDIT: Mind you, in low magic, Cleric might not be a bad idea<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "VXer",
      "avatar": "10758931_1531210879.png",
      "timestamp": "12:41 PM - Jul 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, right. Monk - Can't take Monk due to multiclass restrictions. Totally forgot that condition! Quick edit to original post to reflect that.<br/>\n<br/>\n Anphilllia is basically an Action-PvP server method acting (Buffalo Bill style) as an RP PW so I guess that puts Monk off the table. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "VXer",
      "avatar": "10758931_1531210879.png",
      "timestamp": "2:16 AM - Jul 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Regarding cleric - it's something I've considered, but given that I'm not completely up to scratch regarding the spell changes and their durations I'm not entirely comfortable with the idea just yet. Maybe on another build request :) <br/>\n<br/>\nIf I take Rogue, it'll be for 2 levels to grab Evasion. I won't have the Reflex save to completely benefit from it but I'll have to push it to 8 Blackguard (no net loss for Sneak Attack damage, but I lose the Vrock summon) due to Base Attack Bonus requirements of +6 BAB and 5 Fighter/2Rogue doesn't benefit me, whereas 6 Fighter/2 Rogue will net me a feat. <br/>\n<br/>\nThat'll require me to move to 6 Fighter to gain the BAB requirements, but it does net me an additional feat to grab Knockdown/Improved Knockdown and decide if I'm going for Improved Expertise tanking, or fluff it up with Divine Might/Shield instead.<br/>\n<br/>\nIt'll put me at 15 BAB, so I'm at a net loss of -1 AB and -1 APR overall, but perhaps a little more solid for those tradeoffs.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:55 PM - Jul 11, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you dual-wield, you could get 3 attacks in the main hand and 2 in the off hand. Maybe you can't spare the 3 feats for that, but it is something to think about.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "VXer",
      "avatar": "10758931_1531210879.png",
      "timestamp": "2:49 AM - Jul 12, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Short answer is no, that won't work too well. <br/>\n<br/>\nI'd be taking up to -6 (-10 for offhand) penalty to hit anything depending on the weapon used. A light-handed offhand weapon would make that -4/-8 but it's still a serious loss. Second to that, if I don't have Improved Two Weapon Fighting I only get 1 Offhand Attack, not 2 so net APR is the same as a 16 BAB build I had originally, but with massive attack bonus penalties.<br/>\n<br/>\nAt that point, -1 AB and -1 APR is a godsend compared to that kind of drop and loss of 5+ AC without the tower shield :P <br/>\n<br/>\nI can take the feats with some serious MAD, but then I run into the following issues: <br/>\n<br/>\nFirst and foremost, due to restrictions I can't cheese Monk for easy Cleave qualification which means I absolutely need the 13+ STR. This is pretty much the lynch pin for why I've been fumbling around on the character build for a while now. <br/>\n<br/>\nThe real problem is 15+ DEX, 13+ STR, 13+ INT, (12+ CHA due to Dark Blessing) for the build to work. The dexterity can be levelled up as I progress (Start at 12, get to 16 by 16th level, grabbing ITWF at level 15) to minimize MAD issues but the stats are still really thinly spread out and there's not alot of wiggle room to patch up the borked starting attributes :)<br/>\n<br/>\nI'm feat starved in the current iteration as a melee class, grabbing the required feats (Power Attack, Cleave) and the mostly important aspects (Weapon Focus, Knockdown, Blindfight, Imp. Crit). The most I could do is remove Exotic Proficiency out of that lineup and ignore the Expertise line for late-game Improved Two-Weapon Fighting. Due to the stat shake up I'd most likely need to drop another feat to try grab Weapon Finesse so I'm no so thinly spread across the stat distributions and instead focus on Dexterity and Finessable Weapons.<br/>\n<br/>\nFeats to drop here would include: Improved Critical or Knockdown tree (in which case, there's 2 feats freed up but it's a chunk of utility/effectiveness I'd lose for some AB value). Cannot give up Blind-fight, that's crazy talk :) <br/>\n<br/>\nAs a closing point though: The DEX approach \"can work\", it's just super restrictive. I'm feeling a Scale Mail vibe with Rapier/Shortsword or Dual hand axes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "10:08 AM - Jul 13, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">With a Fighter4/Rngr2/BG10 build you would get most of what you want.<br/>\nPA/Cleave<br/>\nBlindFight<br/>\nWF<br/>\nWS<br/>\nAnd that ends Fighter at 4.<br/>\n2Ranger to qualify for BG.<br/>\n<br/>\nNow fill in with KD/IKD. <br/>\nDivine Might and Divine Shield.<br/>\n<br/>\nShould be okay, get Taunt skill up to compensate the Expertise guys. <br/>\n<br/>\nIn a server like that I woul seriously consider Fighter/Rogue/SD combo for HiPS abusing.<br/>\n<br/>\n<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}