{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "233",
  "name": "Not sure where to post this, so...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/not-sure-where-to-post-this-so-t2354411.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "2",
  "views": "505",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:59 PM - Apr 05, 2015",
      "content": "<div>Hello again, one and all,<br/>\n<br/>\n I thought, given my state of purdah before resuming actual gameplay, I'd have a look at constructing another L40 PvM build, being mindful of Maximilian Kane's prompt on Jaquerez's recent Half-Orc Barbarian request about keeping the flame alight (or something along those lines). So this is by way of a warning to those of you who have been helpful in the past - I will doubtless be calling on your expertise before dropping it on the general populace, so now would be the time to change your names/addresses/etc. Given that I'm (currently) not a member of a Persistent World, I'll be starting with either the OC or SoU, and I'll be looking to construct a strength-based, mundane, non-sniping, relatively 'good' assassin. In essence, attempting to foil all those foes with true seeing - which, in effect, is all those who are worth a damn.<br/>\n<br/>\n I suppose I could simply have a stealthy ranger or finessed rogue, but I've never really looked properly at the assassin class before, and I relish a challenge!<br/>\n<br/>\n Anyway, consider your splendid selves alerted for (more) dumb-ass questions and drafts. Oh, and if someone could help point me to where I should post such questions and drafts I'd be grateful (within the bounds of reason and physical pain). Ta.<br/>\n<br/>\n I await sniggering and derision with a wry grin!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:56 PM - Apr 05, 2015",
      "content": "<div>Replying to myself seems a bit odd, but I'm still trying to master the art of editing...<br/>\n<br/>\n Anyway, I confess I hadn't read Mick Dagger's excellent guide to assassindom, but I have now. For the purposes of what I was looking to do it looks like a non-starter. I'd need bucketfuls of Intelligence (to make use of the Assassin's innate abilities), Dexterity (ditto), Strength and Constitution (to cover the True Seeing malarkey and not die). And that's just too much.<br/>\n<br/>\n Maybe a Barbarian/Assassin/RDD build could work - but I'll have to look at that more carefully.<br/>\n<br/>\n So, for now, the Guild can sleep safely without the threat of lunatic requests from Stagmeister. Yet...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:39 PM - Apr 06, 2015",
      "content": "<div>Hail, Stagmeister! I'd like to make a few comments for you to think about.<br/>\n<br/>\n After reading Mick's Assassin guide, and getting to know the class, I presume you know that the higher the Assassin level, the higher the Death Attack DC. Also, since Assassin is a Prestige Class, you can have a MAXIMUM of 30 levels of it. The last thing you may want to know when building this toon is that Epic Assassins (over 10 levels) get 1 feat every 4 levels after 10, so at 14, 18, 22, 26 and 30. But they also gain Death Attack sneak dice every odd level, (1, 3, 5, etc..) same as Rogue.<br/>\n<br/>\n Now what you need to do is define a MINIMUM of Assassin levels that you'll want for your build and check out the Search Engine to give you ideas on what has already been built. You can look into common and not-so-common class combinations that synergize with Assassin and select the secondary and tertiary classes of the build to fit your concept.<br/>\n<br/>\n One last thing is: THE OC IS TERRIBLE!! LOL! Dude, you will get literally ZERO feedback on how good your build is by facing those easy-ass monsters. Also, the magic level is a bit distorting (thinking you can have a +10 weapon with all kinds of properties, etc.. makes me want to throw up). It becomes more about the items than the build itself. You can overwhelm the OC with just about anything you make.<br/>\n<br/>\n If you wanna challenge yourself but don't feel ready to play online yet, try Aielund. It's fun, the storyline is 1000x better and the balance is way better too.<br/>\n<br/>\n EDIT: There's a button on the bottom left corner that says edit. You click it and edit. Easy. However, sometimes, mine doesn't open, so what you do is return to the previous page on your browser and click again. Then it should open up correctly. :D<br/>\n<br/>\n Take it EZ!</div>"
    }
  ],
  "author-color": "#AA0000"
}