{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "730",
  "name": "The Hidden Elf Mage (Wizard 35 / Rogue 3 / SD 2)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-hidden-elf-mage-wizard-35-rogue-3-sd-2-t2355288.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "18",
  "views": "2.3K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:59 AM - Jan 11, 2020",
      "content": "<div>I thought it would be finally time to take the plunge and try to play a primary wizard.<br/>\n<br/>\nThankfully there are a handful of active wizard players in this forum who I can get advice from.<br/>\n<br/>\nThought I would try to make a Wizard with HiPS with a bit of rogue to make full use of all those sweet skill points (438 of them in total), useful for parties and detecting things coming towards you stealthily to kill you.<br/>\n<br/>\nAlso traps kill you, so I made him an elf, and put his disable trap, search, listen and spot scores up nice and high to work well in conjunction with those keen senses.<br/>\n<br/>\nHe could use a pixie for disable trap but I have been advised sometimes pixie goes splat pretty easily. He'll save the pixie for any chest or door that he can't open with knock.<br/>\n<br/>\nCouldn't settle on a spell focus or a school, so I'm going generalist. <br/>\n<br/>\nSurprised I haven't found any with this exact class combo. <br/>\n<br/>\nI found a few Wizard 38 / SD 2 builds in the ECB archives, and Kalistez's Wizard/Shadowdancer/Monk thread the ECB Tapatalk Forum<br/>\n<br/>\nAnyway here it is, happy to receive any advice as I'm a player new to the class essentially. <br/>\n<br/>\nI'll probably test this one in WoG soon.<br/>\n<details><summary>Spoiler</summary>Wizard(35), Rogue(3), Shadowdancer(2), Elf\nSTR: 10\nCON: 12\nINT: 18 (38)\n\n01: Rogue(1): Toughness\n03: Wizard(2): Blind Fight\n05: Wizard(4)\n07: Wizard(6)\n09: Wizard(8): Spell Penetration\n11: Wizard(10): Silent Spell\n13: Wizard(12)\n15: Wizard(14): Dodge\n17: Wizard(16)\n19: Wizard(18)\n21: Shadowdancer(1): Great Intelligence I, {Hide in Plain Sight}, (INT=24)\n23: Wizard(20): Great Intelligence II, (INT=25)\n25: Wizard(22)\n27: Wizard(24): Great Intelligence IV, (INT=28)\n29: Shadowdancer(2): {Darkvision, Uncanny Dodge I}\n31: Wizard(27)\n33: Wizard(29): Great Intelligence VII, Epic Spell: Epic Warding, (INT=33)\n35: Wizard(31)\n37: Wizard(33)\n39: Wizard(35): Great Intelligence X, Epic Spell Penetration, (INT=37)\n\nSkillpoints: 438\nSaving Throw bonuses: Spells: +11, Mind Effects: +2\nAB (max, naked): 20 (melee), 23 (ranged)\nSpell Casting: Wizard(9)\n\n\n01: Disable Trap(4), Hide(4), Listen(4), Lore(4), Move Silently(4), Open Lock(1), Search(4), Set Trap(4), Spot(4), Tumble(4), UMD(4), Save(7), \n03: Concentration(1), Lore(1), Save(11), \n05: Concentration(1), Save(21), \n07: Concentration(1), Save(31), \n09: Concentration(1), Save(43), \n11: Concentration(1), Save(55), \n13: Concentration(1), Save(67), \n15: Concentration(1), Save(79), \n17: Concentration(1), Save(93), \n19: Concentration(1), Save(107), \n21: Hide(1), Move Silently(1), Spot(1), Save(19), \n23: Concentration(1), Spellcraft(1), Save(7), \n25: Concentration(1), Spellcraft(1), Save(23), \n27: Concentration(1), Spellcraft(1), Save(39), \n29: Hide(8), Listen(20), Move Silently(8), Search(9), Spot(8), Tumble(10), \n31: Concentration(1), Craft Trap(5), Spellcraft(1), Save(5), \n33: Concentration(1), Spellcraft(1), Save(27), \n35: Concentration(1), Spellcraft(1), Save(49), \n37: Concentration(1), Spellcraft(1), Save(74), \n39: Concentration(1), Spellcraft(1), Save(100), </details></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:10 AM - Jan 11, 2020",
      "content": "<div>This build suffers from a lack of meta-magic!<br/>\n<br/>\nWizards traditionally \"suffer\" from lack of spell slots, so tend to relay on meta-magical feats to compensate.<br/>\n<br/>\nStill (or Silent), Extend (which I consider absolutely necessary in an Wizard build) and Maximise.<br/>\n<br/>\nThen one has the bases covered (one has Normal, Stilled, Empowered and Maximised IGMS, for example).<br/>\n<br/>\n<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:18 AM - Jan 11, 2020",
      "content": "<div>I am also not sure I understand what SD is accomplishing here.<br/>\n<br/>\nWith Craft Wand, one has basically unlimited HiPS that always works!  Gives 50% Concealment as well!<br/>\n<br/>\nAnd Invis  and Gr. Sanc!<br/>\n<br/>\nI feel that those two SD levels could be better used somewhere else.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:18 AM - Jan 11, 2020",
      "content": "<div>Thanks for the feedback. Much appreciated.<br/>\nI have silent and empower spell already.<br/>\nI can drop the stealthy feat for maximise spell.<br/>\nSo I can do the normal, silent, empowered and maximised IGMS you have suggested :)</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:20 AM - Jan 11, 2020",
      "content": "<div>I thought invisibility purge, see invisibility and dispels (even AOE dispels) might be a problem with simply relying on invis from wands for HiPS<br/>\n<br/>\nGrizzled_Dwarflord posted his <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-rogue-immaculate-rogue19-cleric20-shadowdancer-t2355278.html\" rel=\"noreferrer\" target=\"_blank\">Hin Immaculate</a> (Rogue 19/Cleric 20/SD 1) build recently if you recall. I believe it also uses crafted invis wands until HiPS is available.<br/>\n<br/>\nYunim did post previously one could potentially dodge Mord's with HiPS.<br/>\nNot sure my ping is low enough from Australia to do that but I'll give it a shot!<br/>\n<br/>\nPlease keep going with the feedback, much appreciated :)</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "5:56 AM - Jan 11, 2020",
      "content": "<div>I assume that this build is made for WoG so some of the things I write below might not apply since I haven't played on the server myself. I have played plenty of mages in the past though, and I've got a PvP Rog/Wiz/SD planned for the server I'm currently playing on. There are a few things I would change about the build, but a DC mage with HiPS, Rogue skills, and Keen Senses is a very strong build on most servers.<br/>\n<br/>\nThe best level spread for this type of build is Rog3/Wiz36/SD1, currently you're using the second SD level to make your skill progression smoother even though it doesn't really add anything useful. If you change the pre-epic spread to Rog1/Wiz18/SD1 you will get +1 Reflex and early HiPS at the cost of 1 AB (which is near useless for you anyway). This will also mean that you can take a second rogue level near 30 to max UMD and then the final rogue level at 40 to max all skills.<br/>\n<br/>\nI suggest changing the starting stats to 8STR/14DEX/14CON. In my opinion 40 HP is more important for a mage than carry capacity or AC, especially since this is an elf rather than a gnome.<br/>\n<br/>\nYou should swap Blind Fight, Stealthy, and Epic Spell Penetration for Epic Spell Focus in a school. If mobs on WoG have very high saves then this might be a bad suggestion, but making a DC mage that doesn't max DCs is a huge waste. Evocation and Necromancy are the standard spell schools for single focus mages but the most effective will depend on your server. If you're not planning on being a DC mage then you should change your focus to a CON based nuke mage.<br/>\nI would also suggest swapping EMA for Epic Skill Focus: Concentration, since in my experience if you're getting hit at all then you've messed up somewhere. Even if you build for AC you'll struggle to reach even 65 AC in a +5 AC environment, so it's usually better to (ab)use summons and DC spells when fighting rather than AC tank.<br/>\nFor metamagic feats you take Silent Spell and Empower Spell which are great, but I would try to fit in Maximize Spell and possibly Extend Spell too by dropping spell penetration feats. If you're committed to just 2 metamagic feats then Silent and Empower are probably the best choice for this build.<br/>\nIf you decide to keep the spell penetration feats, move SPen to level 3 and GSPen to level 6. Spell penetration is most useful at early levels and become less effective as your caster level increases and you gain access to breach spells. If you decide to keep Epic Spell Penetration then move it from level 39 to level 21, by the time you get it in this build it's practically useless.<br/>\n<br/>\nFor skills, I suggest increasing Set Trap to 40/41 (for 16/14 DEX) so that you can set epic traps on a 20. I also think you should aim for 36 or 41 UMD rather than 34, but that's mainly because I prefer getting more than the bare minimum required for scroll use. Personally I would drop one of Listen or Spot and max Search instead, but I don't know if that would be worthwhile on WoG. You should try to streamline your skill progression and reduce the number that you save every level, but overall your skills are well chosen.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "6:10 AM - Jan 11, 2020",
      "content": "<div>Regarding choosing SD in a mage build, this might be a case of choices that aren't good on WoG but are great elsewhere.<br/>\nI've played on plenty of servers where See Invisibility is freely available but vanilla True Seeing isn't, both in PvM and PvP. In those environments the only way to reliably avoid detection is to use stealth rather than invisibility. Stealth and invisibility might have similar effects against some enemies but there are enough differences for HiPS to be useful. Especially since it's near-instantaneous, can't be counterspelled, and never runs out, even if it's not always effective in PvM due to NPC detect.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:22 AM - Jan 11, 2020",
      "content": "<div>Well, of course, customizing your Mage (this is a Mage build, btw) to the environment is a must!<br/>\n<br/>\nNo way to argue that one.<br/>\n<br/>\nI just do not see HiPS as useful in most environments, as HiPS gets nuked.  Either it is on a cooldown, or everyone and their brother has TS.<br/>\n<br/>\nIn an environment where that is not so, then by all means, take that 1 SD level.  Pump that HS and MS.  Mages have skill points to burn, baby!<br/>\n<br/>\nIF we are talking about WoG (looks around the corner to see if Mick is coming), where HiPS is on a cooldown timer, and where real TS is present in some creatures (as I have recently found out), HiPS is a less interesting feat imo.  Normally, one can \"spam\" the HiPS on the quickbar to \"break\" the spell focus of a creature, for a variety of reasons (like avoiding Mord's, Greater Ruin, etc).<br/>\n<br/>\nOn WoG, the Big Bosses will not be impressed by your HiPS, because of the cooldown timer and real TS.  They are mostly Hasted (and some perma), so they will have two castings per round, which basically makes \"breaking\" spell focus much harder.<br/>\n<br/>\nAlso, since most of the Big Bo's have major magical DR, your IGMS spam (which is already nerfed by limiting the number of missles) just sting a bit - I once unloaded over 39 IGMSs at a certain Big Boss on WoG, and it just tickled it.<br/>\n<br/>\nI consider spell penetration feats on WoG for a high level Mage a must!  All have powerful SR, that normally needs to be brought down with Mord's, etc before showboating damage spells, or they will pelter off.<br/>\n<br/>\nSo for an environment like WoG, I don't see wasting a level for SD here.  I can do it better with Gr. Sanc scrolls.  Impr. Invis wands.  That is what a Wizard is, flexible, being able to use spells and resources to get the task done.  <br/>\n<br/>\nNow, I am not against taking a level of SD.  Pop it in there, sure.  I just do not see the need.  The Rogue is goodness, and I can see the reason for taking it.  Assassin would do practically the same, for 1 less level (cement that AC!, get Tumble, get UMD), involve no XP penalty, dependingly, but has to be evil.<br/>\n<br/>\nTake a level of Cleric, instead, for that sweet Animal Domain.<br/>\n<br/>\nAnd so on.<br/>\n<br/>\nIf one is going to keep the SD, by all means do so, and pump that HS and MS.</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "8:50 AM - Jan 11, 2020",
      "content": "<div>Very rich in skill points!  Nice!  I won't argue the merits of Shadowdancer.  Those have been thoroughly discussed.  I would suggest dropping 2 Great Intels for  ESF: Concentration and either Maximize Spell or Epic Fort.  <br/>\n<br/>\nThat's it, that's all I got.  </div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:47 PM - Jan 11, 2020",
      "content": "<div>Thanks WebShaman, Yunim and GDL for your insightful comments and suggestions to a wizarding newbie.<br/>\n<br/>\nSD provides HiPS which is supposed to help survival against mobs, the common way I have erm... died, taking on too many at once, and usually its not the boss, its some preceding mob before the boss that I've underestimated heh.<br/>\n<br/>\nIt synergises well with Wizard with minimal Rogue investment, with so many skill points to put into stealth as a class skill combined with wearing robes with no stealth penalties, and I can achieve the desired outcome with a single SD level. <br/>\n<br/>\nI don't think it will be perfect (nothing is) however it just might increase my odds of survival to get away from a mob if only some of them have detection skills and they aren't that threatening.<br/>\n<br/>\nI like Yunim's suggestion of Wizard 36 / Rogue 3 / SD 1 split on a persistent world, I can leave the Wizard 35 / Rogue 3 / SD 2 split as a variant for players who want to take this character on a single player module usually where the journey ends at level 30-40 odd, that extra caster level helps with spell penetration and spell duration.<br/>\n<br/>\nI also like the idea of having a spell focus, and I can live without Blind Fight if I can detect them before they see me.<br/>\n<br/>\nI like Web's idea of Epic Spell Penetration for a character who's primary trade is casting spells<br/>\n<br/>\nI'm still used to building combat builds so the BAB 20 and starting dex 16 with a ranged attack (which can be buffed quite well on WoG with say GMW/Tensors) is a crutch really, to save spells particularly in a party where the fighters are doing the job, I'm plinking away for moral support heh. I know a base ranged AB of 23 is awful really, might be 50/50 to hit against a mob perhaps, and 5% against a boss<br/>\n<br/>\nAny advice on whether spell focus evocation vs necromancy? What do you guys prefer?<br/>\n<br/>\nAlso -&gt; stealth + black blade of disaster?</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:40 PM - Jan 11, 2020",
      "content": "<div>Here is the problem (I'll lay it out for you) :<br/>\n<br/>\nRight now  I am playing a HiPSer on WoG.<br/>\n<br/>\nHS and MS are over 60 each.<br/>\n<br/>\nIt doesn't help.<br/>\n<br/>\nSome opponents just have true TS.  Either that, or they can detect sneakers like no tomorrow. <br/>\n<br/>\nMy character is a Dexer, has dex items, and extra HS and MS stuff.<br/>\n<br/>\nYour Wizzie isn't going to get anywhere near that.<br/>\n<br/>\nSo, against those m0bs (and yes, we are talking m0bs here) with true TS, they are going to spot you.<br/>\n<br/>\nI wasn't even in a really high area (shattdos).<br/>\n<br/>\nDrow were HiPSable - haven't tried a Priestess yet tho.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:05 AM - Jan 12, 2020",
      "content": "<div>I find detection does depend on distance. Meaning the closer I am to the target, the more likely I can detect things.<br/>\n<br/>\nI believe the inverse will be true, and I will be able to stealth better from quite some distance away, particularly if I can detect them before they detect me, it provides a tactical advantage.<br/>\n<br/>\nIf I'm around a corner or something, this removes the spot/hide check, meaning instead of two detection rolls, the enemy only has one. <br/>\n<br/>\nAnd I believe enemies detected with listen only can go hidden even without HiPS, unlike spot.<br/>\n<br/>\nI also find listen takes a bit of time before I detect enemies. I've read stuff that spot is faster in detecting enemies and better for spellcasters.<br/>\n<br/>\nI find those Kobold Commandos in Critwall pretty annoying to fight. Its kind of what I'm looking for, except I swap the high stealth bonuses from dexterity, with the reduced ability of enemies to detect me from a distance. <br/>\n<br/>\nLots of hide and move silently bonus gear for elves too, like cloak of elvenkind (+10 to hide), boots of elvenkind (+5 or +10 to move silently cant remember), and UMD can help with camouflage (+10 to hide), one with the land (?+4 can't remember) etc... I think HiPS is at least trying out, and if I've made a mistake then well I'll learn from it heh :)</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "4:13 AM - Jan 12, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Jan 11, 2020</div></cite>So, against those m0bs (and yes, we are talking m0bs here) with true TS, they are going to spot you.<br/>\n<br/>\nI wasn't even in a really high area (shattdos).\n</div></blockquote>\nAhh, what Webs is talking about is Tremor Sense -- no, that's not right.  I think it might be called Blind Sense.  It's a Monster Feat (not available to PCs), but it's the creature's ability to detect other creatures through a variety of senses -- scent, echo location, vibrations, etc.  It's not true sight in that sense of the word, but they don't have to make Listen on Spot checks as long as you are within a 60' radius.  So like in Shattodos, those Scorps and other things use this to simulate their ability to see in the infrared spectrum, or something like that.  I believe Trogs, whom historically were blind, also have this ability.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:15 AM - Jan 12, 2020",
      "content": "<div>Certainly makes sense!<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:35 AM - Jan 12, 2020",
      "content": "<div><blockquote><div><cite>grizzled_dwarflord wrote: <div class=\"responsive-hide\">Jan 12, 2020</div></cite>Ahh, what Webs is talking about is Tremor Sense -- no, that's not right.  I think it might be called Blind Sense.  It's a Monster Feat (not available to PCs), but it's the creature's ability to detect other creatures through a variety of senses -- scent, echo location, vibrations, etc.  It's not true sight in that sense of the word, but they don't have to make Listen on Spot checks as long as you are within a 60' radius.  So like in Shattodos, those Scorps and other things use this to simulate their ability to see in the infrared spectrum, or something like that.  I believe Trogs, whom historically were blind, also have this ability.</div></blockquote>\nAgree with Web, makes sense for sure. <br/>\n<br/>\nI was sneaking up stealthily into a Bandit camp at low levels as dexer (different build), whole bunch of bandits unaware, and then this Attack Dog starts chasing me :)<br/>\n<br/>\nSounds like a nice example there. I think its good NWN coded for that possibility.<br/>\n<br/>\n(Probably shouldn't carry all that food around whilst sneaking I guess... I was told to bring a packed lunch...)</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "7:13 AM - Jan 12, 2020",
      "content": "<div>The other caveat to add, and I should have mentioned it in my previous post, is that there actually is a \"true\" true sight, but it is rare and limited to some baddies like dragons (they see through everyone's bullcrap), I believe some Ogre Mage Highlords have it, some extra planar baddies, and a few others.  Normal True Seeing, via the spell or an item, grants Detect Invis, Ultravision, and +20 to Spot.... so in a place like WoG it is possible to stealth past folks who have active True Seeing active.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "9:55 AM - Jan 12, 2020",
      "content": "<div>Do mobs on WoG have higher SR than the toolset max of 32? If not then I would suggest skipping ESPen even if you decide to stick with GSPen. If the module has been altered to give mobs higher SR, as long as it isn't monk SR it can be breached and so shouldn't be a problem. Monks are the hardest opponents for mages but they can usually be dealt with by using summons and damage shields if their SR is too high.<br/>\n<br/>\nBlindsight functions pretty much identically to vanilla True Seeing, it allows monsters to ignore darkness, invisibility, and stealth. Greater Sanctuary is the only way to avoid those mobs in vanilla NWN.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "10:14 AM - Jan 12, 2020",
      "content": "<div>I looked at the WoG site and it said that HiPS is on a timer and can only be used once per 6 seconds. It might take some adapting to if a player is used to constant HiPS spamming, but being limited to once per round isn't much of a nerf. Constant HiPS spamming is only useful when fighting ranged attackers or spotters, using it once to cause an action cancel is enough against most other opponents. Since you can only attack or cast spells at the start of the round you shouldn't need to use HiPS more than once per round, you can simply disengage and run until the start of the next round. I've played on servers where HiPS has restrictions on distance or was limited to once per 3 rounds and didn't have a problem, so once per round should be enough for most opponents.</div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "12:25 AM - Jan 14, 2020",
      "content": "<div>Orion,<br/>\nVery nice build.<br/>\n<br/>\nIn line with some of the previous comments, I recommend dropping Stealthy to take Spell Penetration sooner, if Spell Penetration is the route to take. If you're aiming for max level 40 power, drop Spell Penetration altogether and pick up either Spell Focus: Evocation or Spell Focus: Necromancy. With the Epic version of these, your DC spell of choice (Meteor Swarm or Wail of the Banshee) would have a DC 39 before +INT items.<br/>\n<br/>\nIf high SR is a concern, use Empowered Evard's Black Tentacles, Time Stop, summons, and shields. At lower levels, buffing up that Wolf or Spider does nasty things to almost everything. Also, the knockdown effect from Grease does not check SR (only the slow).<br/>\n<br/>\nFor skills, if you take 6 ranks Spellcraft at level 3, you would get a +2 save vs. spells without impacting the build in any way. At level 16, another 3 ranks into Spellcraft bumps the build to +3 save vs. spells. These work their way out at level 22, where you would only take 16 ranks in Spellcraft.<br/>\n<br/>\nIf you had more Rogue levels, I would recommend going Necromancer for the extra spell slot. In this build, it's a long time between Disable Trap skill dumps to go without the Find Traps spell.</div>"
    }
  ]
}