{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "474",
  "name": "Advice wanted on smooth-leveling Druid/Monk/Shifter",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/advice-wanted-on-smooth-leveling-druid-monk-shifte-t2203026.html",
  "author": "MrZork",
  "avatar": "no_avatar.png",
  "replies": 6,
  "posts": [
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "11:49 PM - Feb 23, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Concept/Goals<br/>\nI am looking to play a good shifter build (1.69 legal) that has a wide variety of epic shapes and gets them fairly early on. Though I am not religious about it, the theme was to focus more on the shapes and to be satisfied with only getting a few buffs out of the druid casting. The pre-epic split I am favoring is 8/8/4 druid/shifter/monk (to maximize AB for a monk shifter). I also favor somewhat stealthy builds with decent spot and listen skills, which should be pretty easy to do with monk and shifter levels.<br/>\n<br/>\nThe more ephemeral goal for this build is to be playable all the way through. In other words, I am trying to avoid a build of the \"kinda lame until the last few levels when Dragon Shape and one monk level rain down melee goodness\" variety. Obviously, builds tends to be more effective at higher levels and I certainly understand that good things come to those who wait, but I plan to have fun playing (not just grinding) all through pre-epics, too. <br/>\n<br/>\nEnvironment<br/>\nI should also mention that the intent is for pair play in PvM environments. My partner likes to do most of the melee work while I typically play a wizard of some sort to take care of crowds and buff. In this case, we've made some changes so I can try out a shifter, which will mean I will wade in to the melees as well. Her fighter-type will take on a few rogue levels for a bit more versatility and we will get by with less buffing than usual. Basically, this will see play in MP modules (probably get started by trying out the Prophet series), so I am expecting that basic survival will not be an issue. But a fun build that doesn't sacrifice too much in overall power would be nice. Unfortunately, I don't have much of a feel for the magic available in the modules we will play, so I can't be sure it will be low, which is where shifter builds shine.<br/>\n<br/>\nBuild<br/>\nWhat I have put together is below, warts and all. It has a somewhat similar level split as several builds on the search engine. But, while 6 monk levels seems like a popular cutoff (Improved Knockdown and speed) most of the builds there with 15 pre-epic BAB end up with around 17 levels of druid, at the cost of shifter levels. I am a fan of the higher-level druid spell buffs, and I could easily give up one of the epic shapes. But, I don't want to sacrifice the shapes' special ability effectiveness, which is often built on shifter levels (e.g. illithid mind blast and inertial barrier, etc.). Admittedly, even with this build's relatively shifter-heavy split (and high wisdom) many of those DCs and damages (chaos spittle and azer chieftain fire stream) are still lousy, but I think it would be fun to play the build for its variety, rather than just choosing the wickedest melee form available at each level.<br/>\n<br/>\n<strong>Druid(9), Monk(6), Shifter(25), Lawful Neutral Human</strong> <br/>\n<br/>\nSTR: 8<br/>\nDEX: 12<br/>\nCON: 12<br/>\nWIS: 18 (34)<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Druid(1): <strong>Luck of Heroes ?</strong>, <strong>Blind Fight</strong>, {Nature Sense}<br/>\n02: Monk(1): {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n03: Druid(2): <strong>Alertness</strong><br/>\n04: Druid(3): WIS+1, (WIS=19)<br/>\n05: Druid(4)<br/>\n06: Druid(5): <strong>Zen Archery</strong><br/>\n07: Shifter(1)<br/>\n08: Shifter(2): WIS+1, (WIS=20)<br/>\n09: Shifter(3): <strong>Lightning Reflexes</strong><br/>\n10: Shifter(4)<br/>\n11: Shifter(5)<br/>\n12: Shifter(6): WIS+1, <strong>Toughness</strong>, (WIS=21)<br/>\n13: Monk(2): {Deflect Arrows}<br/>\n14: Shifter(7): {Humanoid Shape}<br/>\n15: Druid(6): <strong>Extend Spell</strong><br/>\n16: Druid(7): WIS+1, (WIS=22)<br/>\n17: Monk(3)<br/>\n18: Shifter(8): <strong>Improved Critical: Unarmed</strong><br/>\n19: Monk(4)<br/>\n20: Druid(8): WIS+1, (WIS=23)<br/>\n21: Shifter(9): <strong>Great Wisdom I</strong>, (WIS=24)<br/>\n22: Shifter(10)<br/>\n23: Shifter(11)<br/>\n24: Shifter(12): WIS+1, <strong>Undead Shape</strong>, (WIS=25)<br/>\n25: Shifter(13): <strong>Great Wisdom II</strong>, (WIS=26)<br/>\n26: Shifter(14)<br/>\n27: Monk(5): <strong>Epic Prowess</strong><br/>\n28: Shifter(15): WIS+1, (WIS=27)<br/>\n29: Shifter(16): <strong>Construct Shape</strong><br/>\n30: Shifter(17): <strong>Great Wisdom III</strong>, (WIS=28)<br/>\n31: Shifter(18)<br/>\n32: Shifter(19): WIS+1, <strong>Great Wisdom IV</strong>, (WIS=30)<br/>\n33: Shifter(20): <strong>Dragon Shape</strong><br/>\n34: Shifter(21)<br/>\n35: Shifter(22): <strong>Great Wisdom V</strong>, (WIS=31)<br/>\n36: Shifter(23): WIS+1, <strong>Armor Skin</strong>, (WIS=32)<br/>\n37: Monk(6): {Knockdown, Improved Knockdown}<br/>\n38: Druid(9): {Venom Immunity}<br/>\n39: Shifter(24): <strong>Outsider Shape ?</strong><br/>\n40: Shifter(25): WIS+1, <strong>Great Wisdom VI</strong>, (WIS=34)<br/>\n<br/>\n<strong>Unshifted</strong><br/>\nHitpoints: 400<br/>\nSkillpoints: 301<br/>\nSaving Throws (Fortitude/Will/Reflex): 28/35/26<br/>\nSaving Throw bonuses: Spells: +8, Mind Effects: +2, Fear: +2<br/>\nBAB: 25<br/>\nAB (max, naked): 25 (melee), 38 (ranged)<br/>\nAC (naked/mundane armor/shield only): 34/34<br/>\nSpell Casting: Druid(5)<br/>\nAlignment Changes: 0<br/>\n<br/>\nAnimal Empathy 11(10), Concentration 30(31), Discipline 40(39), Heal 15(27), Hide 39(40), Listen 21(35), Lore 13(15), Move Silently 39(40), Spellcraft 38(40), Spot 15(29), Tumble 40(41)<br/>\n<br/>\nSuggestions?<br/>\nSo, that's what I came up with. I haven't played it through yet, but I see some weaknesses and I am hoping some of the more experienced builders can give me some pointers. <br/>\n<br/>\nFor one thing, I don't really think I have a very strong mix of pre-epic feats, even though there is basically a rationale for each choice. E.g., Zen Archery is for leveling and having a ranged attack that can actually hit something, even when it's just to soften up the baddies before shifting and wading into melee; Lightning Reflexes is to make sure the monk Evasion feat isn't wasted on an otherwise marginal reflex save; etc. But, I am wondering if there aren't better choices I am missing. For example, perhaps trading one of those (or Luck of Heroes) for Expertise might be a better idea?<br/>\n<br/>\nIn epic levels, I guess the big question is whether to trade two or three shifter levels (and the accompanying epic feat) for druid levels to get some extra buffing ability. Really, I don't see much use for Outsider Shape with so few caster levels to make the rakshasa's ice storm effective. My intent isn't for this to be a casting build, really. But, I have to say I am feeling kinda dumb building a druid without Energy Buffer, Heal, Creeping Doom, etc. This build barely gets Owl's Insight and, as I say, I could drop the extra feat and Outsider Shape wouldn't really be missed. But, the extra shifter levels are valuable, too. They contribute an extra d6 of damage on a few attacks or an extra 1 or 2 on DCs in a way that may not be dramatic like another cool spell, but they add up.<br/>\n<br/>\nThoughts?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:56 AM - Feb 24, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm not sure I am following you here MrZ.    <br/>\n<br/>\nYou mean you intend to purposely nerf your potential (and your partner's) by refraining from druid buffing?  I was about to suggest using a minimum of 13 levels of druid and culturing one unarmed and one armed shape but any recommendations would likely be biased towards maximizing the build.  Shifters are innately a feat-starved class so throwing them (the disposition of feats, I mean) around loosely just makes the final build weak as hell.<br/>\n<br/>\nI don't think \"fun\" toon building really needs any help, do you?  There is a drastically different metric at work in the planning process, no?<br/>\n<br/>\nIf it is just a matter of easy leveling, take Expertise/Imp Expertise and plan on wyrmling breath instead of archery (you use the same AC method later on if/when you ever get to ancient dragon shape breath). Then have some fun managing the improved wildshapes until humanoid is available.  The rest is sort of automatic IMO.  Choose a focus or two and build towards it/them.  You can always play with the little-used shapes (like basilisk, harpy, etc.) for giggles but still have your mainstay as a hole card when needed.<br/>\n<br/>\nDunno.  I am having a hard time getting a handle on what you really need for playing these few modules.  Prophet is basically mid-magic, I guess.  Dunno there either.  Been a while.  Need some clarification, please.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "9:09 AM - Feb 24, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I didn't mean to deliberately nerf the build or the party.  I would use what buffs I had, but there would be fewer of them. I was thinking that getting shifter levels earlier (and getting more of them by the end) would benefit several of the shapes' special abilities and that that might be a workable trade for less druid buffing ability. In fact, it may not be a good trade and, as indicated, my normal inclination is to get access to higher level spells (particularly when the build has high wisdom anyway). But, getting level 7 spells would mean giving up two epic shifter feats (assuming I keep the 6 monk levels), in addition to any shifter-level-related benefits and from the wisdom drop (affecting both AC and stunning fist DC). So, the extra druid buffing does come with a price and my shifter-inexperienced eye didn't recognize it as an automatic win.<br/>\n<br/>\nAnyway, I guess the whole post was poorly defined on my part. I was a little worried that I was missing something obvious in the build that someone might point out. As a random (not necessarily good) example of some advice: \"Construct shape is a waste. Iron golem is built with the wrong immunities and a wimpy gas attack; the only ranged damage attack is stone golem and a bugged script nerfs even that; and the demonflesh golem is ugly and his momma dresses him funny.\" (Sorry, I didn't have anything true to post about the last one. :)<br/>\n<br/>\nBut, you know, you're right.  I know enough that the build isn't going to be a total disaster and I should have waited until I had a more specific question before asking about the build. I am not worried about surviving any normal MP module and this is my \"learning\" build for shifters that actually have to level up from scratch. That's why I want a diverse build - to get a feel for the strengths (and weaknesses) of the various forms, instead of concentrating on only a couple and not learning much about the others. So, I should just play it and see what works and come back with questions when/if I have a better sense of what I is missing or what I want the build to do better.<br/>\n<br/>\nBTW, thanks for the advice regarding buffing, expertise, etc. I may go the expertise route in this build and I will re-evaluate the viability of a the shifter-heavy build versus druid buffing once I get a better feel for how this plays.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:29 PM - Feb 24, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think I see where you are going with this now, MrZ.<br/>\n<br/>\nHere is as close to an all-purpose, learning build as I can get.  It doesn't focus as a powerbuild would, but should be serviceable throughout if druid buffing is applied.  Haven't checked if there is a clone in the old ECB but I doubt they built any training versions like this. Take note (below) of my comments abouts dragon shape because I think this could be made even more fluid if dragon shape is totally ignored.  Anyway...<br/>\n<br/>\nBuffing is crucial to unarmed forms to gain DR-piercing, so Stoneskin will be available by Level 12 (Grtr version &amp; Premonition MUCH later), Spell Res/Owl's Insight/Death Ward by Level 26. AoV/True Sight comes in very late unfortunately.  But this is par for the course trying to build WIS to 30 without CoT.<br/>\n<br/>\nA problem with any Monk 6 build is that typically the last dump level comes in very late, usually too late to be of much benefit except on an epic server.  IKD is a HUGE help in early-mid epic!  Therefore I set this up for regular tumble/discipline dumps and to accrue IKD by Level 25 with the final goal of Imp Evasion and extra speed boost very late. I also like to use stunning fist a lot in combo with Owl's Insight with all unarmed shapes.  The DC will always be the same regardless of chosen shape.  Think it over.<br/>\n<br/>\nFeel free to swap skill points around as you see fit.  Right now it is set up as a \"roguish\" skill set and with some offensive spell support with max Conc.  (With Imp Expertise, the unmorphed druid can cast spells with relative impunity, if necessary.  Harm/heal should work decent enough.) There are plenty of points available to custom sculpt your skill set.  Personally, I like a few points in Search early on when traps can do the most proportionate damage, but haven't allocated any here.  Too lazy. <br/>\n<br/>\nThe token weapon focus was inserted specifically for the drider spear but you can easily sub any feat without affecting the build all that much.  It just gives you a chance to see the focus show up while in combat debugging which doesn't work with unarmed. It is the easiest shifter weapon to focus so there it is.<br/>\n<br/>\nNow, about dragon shape *sigh*<br/>\n<br/>\nLevel 33 is not bad in the build you furnished, but is still going to be a long wait.  <br/>\n<br/>\nHere is what I would do if I was in experimental mode like you are planning to do:  Scrap the whole shifter DS plan altogether.  If you REALLY want to play an early dragon, use druid/monk/CoT and get one by level 28.  The breath weapon won't be as good as it will be with many shifter levels but it really doesn't matter when stunning fist DC is up around 50.  They will all die stunned!  That's my own opinion, of course.  Seven levels is really not much when it comes to learning to play a big dragon with a butt that won't fit through any doors and gets stuck behind placeables all the time, assuming the modules you have chosen to play will get you to Level 40 anyway.  My 2 centavos for what they are worth nowadays.<br/>\n<br/>\nGood luck, amigo! <br/>\n<br/>\n<span style=\"color:#0000FF\">Druid 15/Shifter 16/Monk 9, Human LN only<br/>\n<br/>\nSTR: 8<br/>\nDEX: 10<br/>\nCON: 10<br/>\nWIS: 18 (32)<br/>\nINT: 16<br/>\nCHA: 8<br/>\n<br/>\n01: Monk(1): Alertness, Blind Fight<br/>\n02: Druid(1)<br/>\n03: Druid(2): Extend Spell<br/>\n04: Druid(3): WIS+1 (19)<br/>\n05: Druid(4)<br/>\n06: Druid(5): Expertise<br/>\n07: Shifter(1)<br/>\n08: Monk(2): WIS+1 (20)<br/>\n09: Druid(6): Improved Expertise<br/>\n10: Shifter(2)<br/>\n11: Shifter(3)<br/>\n12: Druid(7): WIS+1 (21), Toughness<br/>\n13: Monk(3)<br/>\n14: Shifter(4)<br/>\n15: Shifter(5): Imp Crit: Unarmed<br/>\n16: Shifter(6): WIS+1 (22)<br/>\n17: Shifter(7)<br/>\n18: Monk(4): WF: Spear<br/>\n19: Shifter(8)<br/>\n20: Druid(8): WIS+1 (23)<br/>\n21: Monk(5): Grt WIS I (24)<br/>\n22: Shifter(9)<br/>\n23: Shifter(10)<br/>\n24: Shifter(11): WIS+1 (25), Undead Shape <br/>\n25: Monk(6) <br/>\n26: Druid(9)<br/>\n27: Shifter(12): Grt WIS II (26)<br/>\n28: Druid(10): WIS+1 (27)<br/>\n29: Monk(7)<br/>\n30: Shifter(13): Outsider Shape, Construct Shape<br/>\n31: Druid(11)<br/>\n32: Druid(12): WIS+1 (28)<br/>\n33: Shifter(14): Grt WIS III (29)<br/>\n34: Monk(8)<br/>\n35: Shifter(15)<br/>\n36: Shifter(16): WIS+1 (30), Grt WIS IV (31), Epic Prowess <br/>\n37: Druid(13)<br/>\n38: Druid(14)<br/>\n39: Druid(15): Dragon Shape<br/>\n40: Monk(9): WIS+1 (32)<br/>\n<br/>\nHP: 360<br/>\nSaves (F/W/R): 26/33/22 (35/42/31 vs. spells)<br/>\nOther save bonuses: Mind Effects: +2, Fear: +2<br/>\nBAB: 25<br/>\nAB (max, naked): 26 (melee), 26 (ranged)<br/>\nAC (naked/mundane armor/shield only): 30/30<br/>\nSpell Casting: Druid(8)<br/>\n<br/>\nConcentration 43(43), Discipline 43(42), Hide 43(43), Listen 43(56), Move Silently 43(43), Spellcraft 42(45), Spot 39(52), Tumble 40(40), remaining ---&gt; 8</span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "1:04 AM - Feb 27, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, HipMaestro! There is a lot there that I can put to use.   I may run a couple variations through a leveler and see what impact some changes will have on the build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "4:21 AM - Feb 27, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There are also alternatives to monk.  I did pretty well with rogue going in the brown bear shape and using knockdown (to help trigger SA) early on.  Check out the strength smother, as it does seem to fit your description.  Low buffs, good SA with STR damage, and quick to get shifter shapes.  <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build284801.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 84801.html</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "2:53 AM - Feb 28, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Very interesting build, WhiZard. I must say that I like the stealthy characters and there is something both appealing and somewhat amusing about some of the larger shapes creeping around and getting in sneak attacks. ;-)<br/>\n<br/>\nIs there any concern about crit (and sneak) immune foes? I suppose the build has the same tools against such opponents as other shifter builds...<br/>\n<br/>\nI notice that it would be possible to (roughly) trade some sneak damage in return for +3 AB by shifting pre-epic levels (trading rogue for druid) to get rogue 4/Druid 8/Shifter 8 pre-epic and taking Epic Prowess. Of course, winding up at Ro16/Dr8/Sh16 means weaker (11d6) sneaks and the great sneak ability is the allure of the build, but hitting more often (especially on the KD attempts) might be a help.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}