{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "169",
  "name": "Holy Weapon Master With Cheese: Paladin 26/WM 13/Monk 1",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/holy-weapon-master-with-cheese-paladin-26-wm-13-mo-t515397.html",
  "author": "Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": 16,
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:06 PM - Aug 06, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Well, as in my first run at the ECB in the old Bioware guild forums, I will begin my postings with this one. It's gone through an incredible metamorphosis throughout its carreer, given the several different environments I've played her in. Now I am playing her in WoG, and once again I've had to adjust. So, I will basically give you a build core here, argue some points about it and then let you decide which course is best suited for your playstyle. Ladies and getlemen, The Holy Weapon Master With Cheese!<br/>\n<br/>\nPlayable 1-40 PvM, preferably in a party, Untested PvP.<br/>\n<br/>\nPaladin(26), Weapon Master(13), Monk(1), Human<br/>\n<br/>\nSTR: 14 (26)<br/>\nDEX: 13<br/>\nCON: 10<br/>\nWIS: 14<br/>\nINT: 13<br/>\nCHA: 14<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Paladin(1): Weapon Focus: Battleaxe, Expertise<br/>\n02: Paladin(2): {Smite Evil}<br/>\n03: Paladin(3): Dodge<br/>\n04: Paladin(4): STR+1, (STR=15)<br/>\n05: Paladin(5)<br/>\n06: Paladin(6): Mobility<br/>\n07: Paladin(7)<br/>\n08: Paladin(8): STR+1, (STR=16)<br/>\n09: Paladin(9): Improved Critical: Battleaxe<br/>\n10: Paladin(10)<br/>\n11: Paladin(11)<br/>\n12: Paladin(12): STR+1, Spring Attack, (STR=17)<br/>\n13: Paladin(13)<br/>\n14: Paladin(14)<br/>\n15: Paladin(15): Whirlwind Attack<br/>\n16: Weapon Master(1): STR+1, Weapon of Choice: Battleaxe, (STR=18)<br/>\n17: Weapon Master(2)<br/>\n18: Weapon Master(3): Power Attack<br/>\n19: Weapon Master(4)<br/>\n20: Weapon Master(5): STR+1, (STR=19)<br/>\n21: Paladin(16): Divine Shield<br/>\n22: Weapon Master(6)<br/>\n23: Weapon Master(7)<br/>\n24: Paladin(17): STR+1, Divine Might, (STR=20)<br/>\n25: Paladin(18)<br/>\n26: Paladin(19)<br/>\n27: Paladin(20): Extend Spell<br/>\n28: Paladin(21): STR+1, (STR=21)<br/>\n29: Paladin(22)<br/>\n30: Paladin(23): Knockdown, Armor Skin<br/>\n31: Paladin(24)<br/>\n32: Weapon Master(8): STR+1, (STR=22)<br/>\n33: Weapon Master(9): Improved Knockdown<br/>\n34: Weapon Master(10)<br/>\n35: Paladin(25)<br/>\n36: Weapon Master(11): STR+1, Great Strength I, (STR=24)<br/>\n37: Monk(1): {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n38: Weapon Master(12)<br/>\n39: Weapon Master(13): Great Strength II, Epic Weapon Focus: Battleaxe, (STR=25)<br/>\n40: Paladin(26): STR+1, Epic Prowess, (STR=26)<br/>\n<br/>\nHitpoints: 398<br/>\nSkillpoints: 174<br/>\nSaving Throws (Fortitude/Will/Reflex): 22/20/22<br/>\nSaving Throw bonuses: <br/>\nBAB: 30<br/>\nAB (max, naked): 44 (melee), 32 (ranged)<br/>\nAC (naked/mundane armor/shield only): 23/32<br/>\nSpell Casting: Paladin(4)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 40(40), Discipline 43(51), Intimidate 4(6), Taunt 43(45), Tumble 40(41)<br/>\n<br/>\nWell, I am a fool for level 40 power, I admit. It`s kind of like a beautiful woman, you know it`s gonna be trouble, but temptation is just stronger. I can`t bring myself to alter the spread and make her worse for the sake of playability, and although it is quite hard to level up, it`s feasible. If you want a smoother run, team up with a tank. He takes the damage and you dish out sick amounts of damage in very little time. However, if playability or anything else (like higher AB) is more important in your book, let`s discuss alternative spreads or feat selections that won`t break the build`s core:<br/>\n<br/>\n- Pal 20 WM 19 Monk 1 - +2 AB than this one, same number of feats, somewhat easy to dispel, same playability.<br/>\n- Pal 23 WM 16 Monk 1 - +1 AB than this one, same number of feats, 5% chance of being dispelled, same playability.<br/>\n- Pal 19 WM 19 Monk 2 - +2 AB than this one, same number of feats, easily dispellable, much more playable, loses 1 lvl 3 and 1 lvl 4 spell.<br/>\n- Pal 19 WM 19 Rogue 2 - +2 AB than this one, same number of feats, easily dispellable, much more playable, loses 1 lvl 3 and 1 lvl 4 spell, loses Taunt for UMD.<br/>\n- Pal 25 WM 13 Monk or Rogue 2 - -1 AB than this one, loses Epic Prowess, undispellable, much more playable, same spells, and for the Rogue alternative, Taunt for UMD.<br/>\n<br/>\nThere is also the discussion of the great number of pre-epic feats taken in epics. I have never thought much of that. Honestly, it adds versatility at the cost of +3 STR modifier. Yes, it'd be nice to have higher AB and more damage, but not at the cost of versatility. Allow me to illustrate:<br/>\n<br/>\nTaunt is for meleers and Rogue-types (although you do get sneaked when taunting). They generally have low Concentration, and so after a few levels when the d20 luck factor becomes less fundamental, you will pretty much succeed in every attempt against these types.<br/>\n<br/>\nKD/IKD is for mages / casters. They have high Concentration, and therefore are less succeptible to Taunting, but generally, their Discipline is low, and so they will get KDed with ease unless they're immune to it. If you don't want these, feel free to get another 2 STR for +1 modifier.<br/>\n<br/>\nDivine Might is a core part of the build, since its main goal is to take advantage of the synergies between WM crit enhancements and the Paladin's damage buffs, which are all, except for Smite Evil, multiplied on criticals. That is also why at least 24 Paladin levels are so important IMO. Being dispelled REALLY HURTS your strategy and the whole purpose of the build.<br/>\n<br/>\nDivine Shield is also important, given that it spends most of its natural life without Tumble AC. It makes a HUGE difference. It skyrockets the AC to 61 after you get Armor Skin and permahaste, and even if it`s only for 8 rounds, it`s renewable. All you need is +6 CHA to make sure you`ll cap the stat. A Nymph Cloak +5 is more than enough, cuz only when you roll a 1 on Eagle`s Splendor will you end up with a +7 CHA modifier for the day. Not a big loss and certainly not worth wasting another item slot with CHA-gear when you could get something else.<br/>\n<br/>\nExtend Spell may seem out of place there, it was originally Extra Smiting, but Extend makes A LOT MORE SENSE. Firstly, it allows your Divine Favor to last twice as long, because the default non-extended one will generally run out before any battle is won, forcing you to recast or do without it for the remainder of the battle. Secondly and most importantly, it not only increases the duration of the Divine Favors but it also increases the NUMBER of Divine favors you can have to an amount enough to last you through the day. As is today I have 3 regular Divine Favors and 2 Extended Divine Favors, except when I fight the undead, then I exchange one regular Divine Favor for Bless Weapon.<br/>\n<br/>\nAnd there are a few fortunate findings that I didn't predict when building, like the interaction between Taunt and Expertise. Taunt cancels Expertise, but only after the result is out, so basically, the whole time you're taunting, you have +5 Ac at no cost, then the result of the Taunt arrives (Taunt:sucess) and right afterwards (Expertise Mode Deactivated), so you click on Expertise and attack again, it will reactivate Expertise, but since the target is taunted, you will get +5 AC and +1 AB for 5 rounds. BTW, I know that Taunt decreases AC by UP TO 6 based on the difference between your Taunt check and the opponent's Concentration check, but if you do as I said above and use it on low-concentration enemies, that difference will nearly always be 6 or more.<br/>\n<br/>\nThe weapon to use is also debatable. If you choose a Scimitar, you can get a wider threat range, and increase your DPS in general by a little bit, but when I first drafted this build, it had higher CHA and lower STR, so the AB wasn't as good as it is now. That meant that the extra threat range wasn't as useful because on 13s you'd normally miss if not with your higher attack each round. Since then I have changed it to a full STR build, and having a Scimitar as your weapon of choice became a viable option once more, but I just love the 190 damage criticals too much to go back! Basically with the Scimitar, you will do better DPS to mobs, as they have lower ACs in general, but with the Battleaxe, you will do more damage to bosses, who have higher ACs, so the increased multiplier and higher weapon damage will be more significant in boss situations. And here is how I think: mobs will die anyway, they will very rarely present problems to you, but bosses on the other hand are tougher, so I would rather have the upper hand against those.]<br/>\n<br/>\nFinally, I will explain the logic of the level up. I started with Paladin 15 for 2 reasons: at 15th level you get your first lvl 4 spell and your Divine Favor caps; and to get Improved Critical asap. I could've gone Pal 12 then WM 7, but there is no point in having a wider threat range if you don't have all the damage buffs to multiply. Then I went for Divine Might and Divine Shield to complete the core of the build by taking Paladin on all General Feat levels, and WM on the rest to get the critical enhancements. After getting the increased threat range, my priority was to be undispellable as soon as possible, and by taking Paladin I also completed my spellbook at lvl 20. At Paladin 24 I was undispellable, and left the rest of the Paladin levels to be taken for Taunt updates. Then I took the rest of the WM levels to round up the build, leaving Monk for 37th for the earliest possible Max Tumble AC, Cleave and Evasion, which is also very important to this build. The EWF and EP feats aren`t at all needed, you can hit mostly anything after lvl 8, when you get Bull`s STR. If you`re having trouble hitting, then you probably need better gear.<br/>\n<br/>\nAnyway, as Kail usually says: constructive criticism is always appreciated. I am very short of time now, and there are too many builds I want to post, not to mention, look at everyone else`s. I will get to it as soon as possible. For now, this will have to do.<br/>\n<br/>\nTake it EZ folks!!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:09 AM - Aug 07, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would like to see how you plan to slot your spells, Max.  <br/>\n<br/>\nYou didn't mention Aura of Glory which has a decent duration at Pally 26 and more reliable than depending on an Eagle's dice roll.  It's the low innate CHA that causes me concern.  The only way I ever use a Nymph cloak is if trying to get a date with one of the tavern waitresses and then *whoosh* off it comes when I score.  Those single-attribute items are anemic, as I would always prefer either one that combines an ability with AC or else a property like Freedom that is difficult to find on other items.  As you say, you can just keep using turning attempts up to keep it active, and this pally will have lots of them. <br/>\n<br/>\nBut you are the WoG expert so know better than I what items are proliferated there and the best way to equip your critter.<br/>\n<br/>\nAs for non-epic feats in epic, that seems to be pretty much par for the course with WM unless you augment with fighter levels.  I'm guessing WoG has very few, if any, concealed types or I would have seen Blind Fight in the mix somewhere.  I seldom go anywhere without it myself.  You  may have discussed the Pros &amp; Cons of that feat before but, alas, I missed that episode.<br/>\n<br/>\nOtherwise, except for the typical pally steel-reinforced concrete alignment restriction (<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />), it looks altogether solid and well-prepared. I've learned a lot from your expose' accompanying the build itself as you usually provide.<br/>\n<br/>\nLooks like a sweet build for goody two shoes, though!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:15 AM - Aug 07, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Heya Hip, thanks for stopping by! Allow me to answer your inquiries:<br/>\n<blockquote><div>I would like to see how you plan to slot your spells, Max. <br/>\n<br/>\nYou didn't mention Aura of Glory which has a decent duration at Pally 26 and more reliable than depending on an Eagle's dice roll. It's the low innate CHA that causes me concern. The only way I ever use a Nymph cloak is if trying to get a date with one of the tavern waitresses and then *whoosh* off it comes when I score. Those single-attribute items are anemic, as I would always prefer either one that combines an ability with AC or else a property like Freedom that is difficult to find on other items. As you say, you can just keep using turning attempts up to keep it active, and this pally will have lots of them.</div></blockquote>\n\nWell, I didn't mention it directly, but how else could you cap an attribute with a +5 cloak? I use both Eagle's Splendor and AoG, but the latter has a steady +4 to CHA bonus, so it's not variable. Funny you'd ask about my spellbook, I sent this build to Mithril Jack the other day and I explained some of the combos to him, and also the spellbook. So i will just copy/paste it for you here. Let me note that I'm too lazy to do a progressive as-you-gain-new-spells diagram, so I will count on your ability to read between the lines and prioritize. For Example, as lvl 4 Spells, I have Freedom, Death Ward and Holy Sword. If you only have 1 lvl 4 spell and you are fighting monsters that can't paralyze you or instantly kill you, you obviously won't use Death Ward or Freedom, instead you will get Holy Sword. So basically I will presume you will have 20 Pally levels and I will use two lists: before and after Extend Spell, because it drastically changes your spells:<br/>\n<br/>\nBefore:<br/>\n<br/>\n1- Protection from Alignment (1), Bless (1), Bless Weapon (1) (against undead only, otherwise get another Divine Favor instead), Divine Favor (1 or 2).<br/>\n2- Aura of Glory (1), Bull's Strength (1), Eagle's Splendor (1), Aid (1)<br/>\n3- Greater Magic Weapon (1), Prayer (2)<br/>\n4- Holy Sword (1), Death Ward (1) (if u have Death Magic Immunity from an item, take another Holy Sword), Freedom of Movement (1) (if u have Freedom from an item, take another Holy Sword).<br/>\n<br/>\nAfter:<br/>\n<br/>\n1- Protection from Alignment (1), Bless Weapon (1) (against undead only, otherwise get another Divine Favor instead), Deafening Clang (1) (If your weapon doesn't have elemental damage already, otherwise get another Divine Favor), Divine Favor (1, 2 or 3).<br/>\n2- Extended Bless (1), Eagle's Splendor (1), Extended Divine Favor (2) (I had capped STR by then so no Bull's here. If needed, preferably drop Extended Bless)<br/>\n3- Greater Magic Weapon (1), Extended Aura of Glory (1), Extended Aid (1)<br/>\n4- Death Ward (1) (if u have Death Magic Immunity from an item, take another Holy Sword), Holy Sword (1), Extended Prayer (1). (you should have an item with freedom by then, so you drop it)<br/>\n<br/>\n<blockquote><div>But you are the WoG expert so know better than I what items are proliferated there and the best way to equip your critter.<br/>\n<br/>\nAs for non-epic feats in epic, that seems to be pretty much par for the course with WM unless you augment with fighter levels. I'm guessing WoG has very few, if any, concealed types or I would have seen Blind Fight in the mix somewhere. I seldom go anywhere without it myself. You may have discussed the Pros &amp; Cons of that feat before but, alas, I missed that episode.</div></blockquote>\n\nYou needn't argue about the usefulness of Blind Fight, I try to use that in most of my meleers. But this is sadly a feat-and-skill-starved build, so you need to be able to prioritize. It's perfectly tweakable into the build if you feel you need it. You can either drop IKD or Extend Spell, but both these feats have a higher priority as far as my playstyle goes. I do run into many concealed monsters in WoG, and they are a pain to deal with, but the lack of Blind Fight just makes killing them last longer, not at all undoable. So far I have not encountered concealed bosses, but I presume that they would be my bane .<br/>\n<blockquote><div>Otherwise, except for the typical pally steel-reinforced concrete alignment restriction (<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />), it looks altogether solid and well-prepared. I've learned a lot from your expose' accompanying the build itself as you usually provide.\n</div></blockquote>\n\nThanks, if you want I can send you the e-mail I sent Mithril Jack as well, it depicts with a little more depth how to play the build. Let me know if u do.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mithril Jack",
      "avatar": "no_avatar.png",
      "timestamp": "4:50 PM - Aug 09, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Heya Max,<br/>\n<br/>\nThis looks like a solid build with a very well thought out guide to playing it. Most of my comments were already stated by HipMaestro and answered by yourself. Here are a couple of thoughts though:<br/>\n<br/>\n1) You might consider focusing in hammer rather than battle axe. Same damage and crit range, more effective against crit-immune undead and other slashing/piercing resistant creatures. I know, with the buffs that are at your command you won't have trouble hurting your opponent, but they are short duration and in an extended battle it might help. True, the hammer can't be keened by a spell, so I guess it depends on whether you'll have access to a friendly spellcaster or not. Anyway it's just a thought.<br/>\n<br/>\n2) Another level spread that you might consider for the sake of playability is Pal 26/WM 7/Mnk 7, with 4 levels of monk taken pre-epic. This would result in -2 AB, better saves, +20% speed, tumble dumps spread out over the life of the build, and it would net you one extra feat, which you could use for Extra Smiting, Toughness, or ESF:Taunt. I especially like that last option, but YMMV.<br/>\n<br/>\nAnyway great build and thanks so much for sharing it with us!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:58 PM - Aug 09, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>1) You might consider focusing in hammer rather than battle axe. Same damage and crit range, more effective against crit-immune undead and other slashing/piercing resistant creatures. I know, with the buffs that are at your command you won't have trouble hurting your opponent, but they are short duration and in an extended battle it might help. True, the hammer can't be keened by a spell, so I guess it depends on whether you'll have access to a friendly spellcaster or not. Anyway it's just a thought.<br/>\n</div></blockquote>\n\nIt's an option, and a valid one, but I prefer the Battleaxe because of its accessibility to Keen Edge, either by a spell, wand or a scroll, and pretty much anyone you team up with that can buff you with said spell will be wise to do so, as the result is very good. About undead, you are a Paladin, you can turn them (turn undead is not just for DM and DS), you can and with your Charisma and Pally level you definitely should, but for constructs and other crit-immune it could work. It will also depend on item availability on the server you play. When I went for battleaxe, it was because I was playing the Aielund Saga and there was this COOL +8 Keen Battleaxe with 2d6 Divine damage bonus. I couldn't pass that up!<br/>\n<blockquote><div>2) Another level spread that you might consider for the sake of playability is Pal 26/WM 7/Mnk 7, with 4 levels of monk taken pre-epic. This would result in -2 AB, better saves, +20% speed, tumble dumps spread out over the life of the build, and it would net you one extra feat, which you could use for Extra Smiting, Toughness, or ESF:Taunt. I especially like that last option, but YMMV.\n</div></blockquote>\n\nDude, I'm Brazillian, what the hell does YMMV mean?? LOL I do know the English language very well, but that's just asking too much, hell it ain't even in Kail's forum acronyms topic!!<br/>\n<br/>\nWell, I honestly don't dwell over playability all that much, and I already suggested an alternative to make it more playable losing only 1 AB by going Paladin 25 Monk or Rogue 2 Wm 13. I just can't see myself spending so many GENERAL feats in WM requirements to take only 7 lvls of it (although I do have WM 7 builds, but they have either Fighter or CoT lvls). IMO this build is just a game of priorities. You weigh what you think is more important and list it down. You can do that if you want, but I wouldn't. To me, playability is in both the choices when building but also about the choices in-game. I seem to be doing fine or at least ok with it. I occasionally die just because I've played her so many times that I get kinda bored a bit and then I leave her on a shelf for a long time and when I play her I'm still rusty and I screw up. I can honestly tell you that most if not all of my deaths have come from in-game mistakes, forgetting to rebuff, not healing soon enough, forgetting to cast a spell or use an item, etc., basically not paying enough attention. When I do everything \"by the book\" I hardly ever die! But like avado says, a build is just a rough guide. If playability is a big issue for you, then you should consider either not playing a build like this one or making the changes you suggested. Tweaks can and should be made to suit your playstyle. As for mine, I'm happy with it as is. Anyway, thank you for taking the time to look into it. I like your suggestions, as alternatives for different playstyles, and they should definitely be in the topic for other players that are considering trying this toon out.<br/>\n<br/>\nBTW, did u get to use the BIC file I sent you in a training module just for the kicks?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:07 AM - Aug 10, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong>\n<blockquote><div>2) Another level spread that you might consider for the sake of playability is Pal 26/WM 7/Mnk 7, with 4 levels of monk taken pre-epic. This would result in -2 AB, better saves, +20% speed, tumble dumps spread out over the life of the build, and it would net you one extra feat, which you could use for Extra Smiting, Toughness, or ESF:Taunt. I especially like that last option, but YMMV.\n</div></blockquote>\n\nDude, I'm Brazillian, what the hell does YMMV mean?? LOL I do know the English language very well, but that's just asking too much, hell it ain't even in Kail's forum acronyms topic!!</div></blockquote>\n\nYour Mileage May Vary, Max.  But I did do a double-take myself within the context of the topic *LOL*<br/>\n<br/>\nI'll PM Kail with it just in case we get more Brazilians here *poke*<br/>\n<br/>\nI also agree with your WM split reasoning.  Either WM 5 to get the multiplier \"cheese\" (pretty expensive way to go without fighter levels) or 13+ to get some of the \"meat\" of the class.  Use your imagination to decide which level of WM will get the \"wine\", maybe 28.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mithril Jack",
      "avatar": "no_avatar.png",
      "timestamp": "1:13 AM - Aug 10, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">YMMV = \"Your mileage may vary\", or it all depends on personal playing style and environmental considerations.<br/>\n<br/>\nAs you may know, I do a <strong>lot</strong> of soloing with a crappy computer with lag issues, so any adjustment that can be made to make it easier to level I'm all for. I do think that your version is great.<br/>\n<br/>\nI recently had to reformat my hard drive. NWN and the CEP were, of course, one of the first things to be reinstalled, but I haven't yet taken the time to reinstall a trainer mod or even the CBC. All this is a rather long winded way of saying that I haven't given the BIC file that you sent me a test drive yet, but I will soon.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:27 PM - Aug 10, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This may sound like a stupid question, and correct me if  have missed something essential: Where is the cheese?<br/>\nIs this build better than a plain Paladin/Fighter/Rogue build, or in other words; is WM worth the feat investment?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:53 PM - Aug 10, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Mick Dagger wrote:</strong>This may sound like a stupid question, and correct me if  have missed something essential: Where is the cheese?<br/>\nIs this build better than a plain Paladin/Fighter/Rogue build, or in other words; is WM worth the feat investment?</div></blockquote>\nI was assuming the cheese was the monk dump to grab a few \"free\" feats &amp; extra +4 tumble AC in epic.  Unless going robed (not likely), it will miss the WIS/Monk AC and unless fisted or with kama will not get the monk progression.  For me, WM cheese would be WM 5 (if anything) to get the multiplier which is unavailable via Ftr but as far as I am concerned there is no way to even vaguely construe inserting the WM class as any kind of cheese due to the painful commitment to the prereqs and subsequent limitations it will cause.  <br/>\n<br/>\nI will await Max's explanation along with you, Mick.  And BTW, Welcome aboard!  Don't forget to avail the guild of an intro just in case others may have missed you!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:04 PM - Aug 10, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>This may sound like a stupid question, and correct me if have missed something essential: Where is the cheese?<br/>\nIs this build better than a plain Paladin/Fighter/Rogue build, or in other words; is WM worth the feat investment?</div></blockquote>\n\nHello, Mick, I second what Hip said, welcome.<br/>\n<br/>\nTwo very valid questions, you ask. Hip is correct to assert that the cheese in this case refers to the cheesy Monk level at 37 to get Cleave, Evasion and +8 Tumble AC (not +4, although I understand that if I had cross-classed Tumble I would get +4, so an \"extra\" +4 if compared to the same build cross-classing Tumble). However, Hip is wrong to say that WM 5 is all you need: WM 7 is vital to this build, as the extra +2 threat range granted by Ki-critical is a key part of the combat strategy, especially if you go for a Battleaxe.<br/>\n<br/>\nTo say that a build is better than a Paladin Fighter Rogue is an overstatement, but it has its pros and cons if compared, and certainly is not that much worse:<br/>\n<br/>\n- It doesn't get XP penalty, while the other one is very likely to, although it can be avoided, but avoiding XP penalty will limit your options in leveling and possibly delay feats or hurt BAB.<br/>\n<br/>\n- Pal/Ftr/Rog gets UMD, WS and EWS and is MUCH LESS feat and skill starved, but doesn't necessarily get Expertise and doesn't get SWF, ESWF, Increased Multiplier and Ki Critical.<br/>\n<br/>\nThe critical hit enhancements of the WM are AMAZING if combined to the Paladin's Damage buffs. Let's make a quick comparison here between a critical hit from a PalFtrRog and this guy:<br/>\n<br/>\nPalFtrRog<br/>\n<br/>\n1-8 from Battleaxe normal damage<br/>\n3 from Deafening Clang<br/>\n5 From Divine Favor<br/>\n8 from Divine Might<br/>\n5 from GMW<br/>\n1-6 vs Evil from Holy Sword<br/>\n6 from WS/EWS<br/>\n+11 STR<br/>\n+1 Prayer<br/>\n<br/>\n41-53 damage x3 = 123 - 159 on a critical hit. <br/>\n<br/>\nAssuming you get Improved Critical, you will crit on 18-20 (15% chance) with a keen Battleaxe. Notice how I gave you +3 STR bonus compared to mine, as I do take loads of Pre-Epic feats in Epics.<br/>\n<br/>\nThis toon:<br/>\n<br/>\n1-8 from Battleaxe normal damage<br/>\n3 from Deafening Clang<br/>\n5 From Divine Favor<br/>\n8 from Divine Might<br/>\n5 from GMW<br/>\n1-6 vs Evil from Holy Sword<br/>\n+8 STR<br/>\n+1 Prayer<br/>\n<br/>\n32-46 damage x4 = 128 - 184 on a critical hit.<br/>\n<br/>\nYou will crit on 16-20 (25% chance) with a keen Battleaxe.<br/>\n<br/>\nIf the weapon has its own damage bonus, and most servers do have these weapons, or with STR-enhancing items, you can count on a larger difference in critical hit damage between these builds. Also, you're more likely to crit with this toon by 10%. I'd like to seize this oportunity to correct a bit of wrong information that I gave in a previous post. Deafening Clang will work on a weapon with Elemental Damage, as I have a Battleaxe with electrical damage bonus and I tested it yesterday and they do stack. However, I am not sure if it'll work on a weapon that already has Sonic damage type, does anyone happen to know this?<br/>\n<br/>\nYou may think, in general terms, that the PalFtrRog does more damage per round, but the thing is that it's also much more likely that the opponent is able to heal while you are doing that damage, whereas this toon will kill enemies that get down to half life in 1 hit whenever she scores a critical hit, not giving them time to heal. If you play or have ever played in WoG, I killed Arbas yesterday in 1 round, scoring a lucky streak of critical hits and using one Smite Evil to finish him off. That guy is not that hard to kill, but he has around 500 HP, and to be able to whack him in just 1 round is quite a feat! An ancient Green Dragon named Emeraxis the Great lasts 2-3 rounds agains this toon at lvl 27. The dragon has 1k HP and one Heal spell memorized that he can very seldom cast, as the Concentration DC for such a huge amount of damage is enormous. That dragon has 40/+6 DR and still takes over 130 damage per crit!<br/>\n<br/>\nNow onto the second question, Mick. Is it worth the investment in WM? I honestly don't know the answer to that, I think it's debatable, and the correct answer to that is either personal preference, or a mixture of playstyle with item availability. You may argue that the WM investment is too high, that perhaps a Paladin Fighter Rogue is a better alternative. Perhaps it is, perhaps it depends on the way you play, perhaps it depends on WHERE you play, but what you cannot deny is that the synergy between the damage buffs and the increased critical hit threat range and multipliers exists. Whether the cost is too high, it's up to each individual to decide. To me, personally, it's not. I like playing this build a lot, even if I am a little overburned with it at the moment, but last night I did take her out for a spin and had a good time while doing it ^^.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:34 PM - Aug 10, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you to both Max and Hip for your warm welcome! <br/>\nI will try to write an intro <br/>\n<br/>\nYour comparison of the two builds is instructive Max, showing how the builds differ in damage dealing. The fighter version having more base damage, and your build excelling with crits. Btw, you were too generous giving me +3 from strength, I only calculated in +2 from a strength of 30 starting out like you did with str 14 and taking G str VI. <br/>\nRogue has evasion at lvl 2 and tumble as class skill, and you will get cleave from a fighter feat, probably very early in the build, adding that extra attack all the way. I was thinking of Paladin 16/Fighter 4 pre epic. That gives better fort saves and weaker refl saves. The AB of both builds would be identical +44.  Your build will get the WM boost to AB a little earlier than the extra str bonus of the fighter build. One would have to buy 4 extra G str feats, WS, EWS and Cleave. I would also try to get Blind fight. One could skip feats like Dodge, Mobility, Spring attack and WWA. There would then be enough bonus feats with Pal 26 /Fighter 6, leaving plenty of room for flexibility.<br/>\nIf you are willing to live with 20% xp penalty, you could take a rogue level eg at level 22 for an earlier skill dump, adding tumble AC and whatever rogue skills you prefer. Leaving out WM let you start with a lower dex freeing buy points for other stats. Taking int 14 adds one more full skill to the build. There are many tempting rogue skills. UMD comes to mind. If you have access to dex items to cover the dex armor bonus of a full plate, you can also start out with con 12 or 14 for better HP.<br/>\n<br/>\nPaladin/fighter/rogue is a very different build concept and you have demonstrated that it will not have that which is the very idea of your build, the juicy heavy hitting crits. <br/>\nIn a way I like your idea.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:35 PM - Aug 11, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yo Max!<br/>\n<br/>\nHave been trying to play this build but running into a problem.<br/>\n<br/>\nI only get the 5 turn attempts for Divine/Might-Shield which leaves me exhausted of those boosts about halfway through most battles.  And yes, I pre-buff with Eagle's &amp; AoG beforehand but it doesn't change the turn attempts, just duration.  So far, I haven't found any better than a +1 Nymph cloak which makes no difference (even a +2 would yield a grand total of one more turn attempt/day so I could use the divine boosts 3x each per day, at least an even number of attempts).<br/>\n<br/>\nSo what I did was drop the Grt Strength feats for -1AB and took Blind Fight &amp; Extra Turning and now it seems to last me through the battles well enough with 11 turnings with that one lost AB not appearing to matter much, at least not as much as running out of turn attempts midstream. <br/>\n<br/>\nSo... is there some sort of trick to buffing the Cha modifier enough so that turn attempts increase adequately?  If I play a module, I can simply buff and then reload and the additional turn attempts appear on the quickslot but this is not possible on a server.<br/>\n<br/>\nYou are the expert playing this critter, so I bow to your experience to handle this situation.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:02 AM - Aug 12, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, Hip, to be honest with ya I don't think I've ever played in a low magic environment, but I guess that if there are weaker items, then the monsters will also have lower ACs, so it wouldn't hurt to lower ending STR to 22 or even 20 and spend these 4-6 points boosting your charisma. The thing with this build is that there are many nice to haves that you cannot acquire due to feat starvation, so you end up with lots of requirements and very few carefully selected combat feats. In that sense, Mick's build would be a lot easier to play, but it is as I said, there are no building stretches that you cannot make up for with good in-game decision-making. This is definitely NOT a build to play when your attention is scarce, AKA when you're sleepy or distracted, or when you don't have a choice about which enemies to face and how to face them. It amazes me, though, that you've been able to get her to that level in such a short stretch of time. She gets Divine Might at lvl 24 and the Great Strengths way in the end of the build. I have been playing her on WoG for a few months now and I just reached level 30.<br/>\n<br/>\nMy character looks at yours in a bar table and ask the bartender: \"I'll have what he's having!\"<br/>\n<br/>\n@ Mick<br/>\n<br/>\nYou are correct, but if you play on a server where items can replace the fundamental things that UMD could grant you, it's not all that useful. In WoG it is, as the wand system is usable and abusable, but the good things that it'd grant are not all that needed, even though they're extremely useful. The other day I scored a critical hit on a fully buffed Smite Evil. 250 damage in one single hit, followed by 190 damage on the third attack that round. In 1 round, I killed the boss. This is one of the cool things about this build: her critical hits are SOOOO powerful, that you kinda feel like you're playing roulette. If you land two of them in a row, any complicated or quite impossible battle can last 10 seconds. If you team up with a tank, you can beat anything up, no matter how strong or powerful, since no DR in the world can soak in that kind of damage. Hell, you can even kill a caster with Epic Warding in 2 hits ^^, because EW will soak up 50 physical damage, but what about the other 70-130 damage you still do? And most casters aren't known for their physical toughness <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:46 AM - Aug 12, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Heya, Max!<br/>\n<br/>\nTBH, I pre-leveled and had one of the kids rush me through the waypoints to get to the nastier critters to see how the finished build would fare. Most hostiles in those areas have HPs over 700, obsessive AC, insane SR and some will DevCrit you if you let them hang around long enough.  Once I made the swap to get more turning attempts I was able to keep the divine boosts up long enough to dispatch them even though it was a slightly lower AB.  Just grabbed whatever equipment was easily available (the kids wanted to twink my PC with equipment they were muling, but that wouldn't be a fair test for me IMO, with stuff that would take me a year to find, craft or afford).  So, in that context, being relatively handicapped without uber equipment enhancements, the build performed very well.  You are right about dealing with high DR creatures.  It's borne to handle those guys. <br/>\n<br/>\nI just thought perhaps there was a mystical buffing technique where I wouldn't need to spend the feat to increase turning attempts.  I guess not, though. <br/>\n<br/>\nI have historically steered away from Cha-based classes and feats (you may recollect my skepticism to play sorc, eh?) so have little experience how to manage those effectively, though am beginning to get adjusted.  I may just add this to my repertoire in future building ventures since you have provided a good example of how powerful they can be.<br/>\n<br/>\nThanks for posting the build and for the accompanying expose'.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:04 AM - Aug 12, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>I just thought perhaps there was a mystical buffing technique where I wouldn't need to spend the feat to increase turning attempts. I guess not, though.</div></blockquote>\n\nWell, I wouldn't call it mystical, but if you increase your CHA score instead of taking Extra Turning, your buffs will last longer and you will have more turn undead attempts, which, just in case you don't know, you get 3 plus your character's CHA modifier. By buffing charisma you increase the number of Turn undead uses, you increase the .duration of each buff and you increase your saving throws. So IMO that ET feat is an utter waste. Lower your AB by 2, raise your CHA by 2, you get -1 TU attempt, but better saves and +2 rounds on each divine buff, which added together will account for more buffed time than the ET feat with the same CHA item.<br/>\n<br/>\nGlad you're beginning to enjoy the holy classes, thy path to redemption is before thee <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:41 PM - Jun 24, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey guys!<br/>\n<br/>\nHere's the revisited build for comparison! <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:42 PM - Jun 24, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Paladin(26), Weapon Master(13), Monk(1), Human<br/>\n<br/>\nSTR: 14 (22)<br/>\nDEX: 13<br/>\nCON: 10<br/>\nWIS: 14<br/>\nINT: 13<br/>\nCHA: 14 (18)<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Paladin(1): Expertise, Dodge<br/>\n02: Paladin(2): {Smite Evil}<br/>\n03: Paladin(3): Weapon Focus: Battleaxe<br/>\n04: Paladin(4): STR+1, (STR=15)<br/>\n05: Paladin(5)<br/>\n06: Paladin(6): Knockdown<br/>\n07: Paladin(7)<br/>\n08: Paladin(8): STR+1, (STR=16)<br/>\n09: Paladin(9): Mobility<br/>\n10: Paladin(10)<br/>\n11: Paladin(11)<br/>\n12: Paladin(12): STR+1, Spring Attack, (STR=17)<br/>\n13: Paladin(13)<br/>\n14: Paladin(14)<br/>\n15: Paladin(15): Whirlwind Attack<br/>\n16: Weapon Master(1): STR+1, Weapon of Choice: Battleaxe, (STR=18)<br/>\n17: Weapon Master(2)<br/>\n18: Weapon Master(3): Blind Fight<br/>\n19: Weapon Master(4)<br/>\n20: Weapon Master(5): STR+1, (STR=19)<br/>\n21: Paladin(16): Improved Critical: Battleaxe<br/>\n22: Weapon Master(6)<br/>\n23: Weapon Master(7)<br/>\n24: Paladin(17): STR+1, Power Attack, (STR=20)<br/>\n25: Paladin(18)<br/>\n26: Paladin(19)<br/>\n27: Paladin(20): Divine Might<br/>\n28: Paladin(21): CHA+1, (CHA=15)<br/>\n29: Paladin(22)<br/>\n30: Paladin(23): Divine Shield, Armor Skin<br/>\n31: Paladin(24)<br/>\n32: Weapon Master(8): CHA+1, (CHA=16)<br/>\n33: Weapon Master(9): Extend Spell<br/>\n34: Weapon Master(10)<br/>\n35: Paladin(25)<br/>\n36: Weapon Master(11): STR+1, Great Charisma I, (STR=21), (CHA=17)<br/>\n37: Monk(1): {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n38: Weapon Master(12)<br/>\n39: Weapon Master(13): Great Charisma II, Epic Weapon Focus: Battleaxe, (CHA=18)<br/>\n40: Paladin(26): STR+1, Epic Prowess, (STR=22)<br/>\n<br/>\nHitpoints: 398<br/>\nSkillpoints: 174<br/>\nSaving Throws (Fortitude/Will/Reflex): 24/22/24<br/>\nSaving Throw bonuses: <br/>\nBAB: 30<br/>\nAB (max, naked): 42 (melee), 32 (ranged)<br/>\nAC (naked/mundane armor/shield only): 23/32<br/>\nSpell Casting: Paladin(4)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 40(40), Discipline 43(49), Intimidate 4(8), Taunt 43(47), Tumble 40(41)<br/>\n<br/>\n<br/>\n01: Concentration(4), Discipline(4), Intimidate(2), Taunt(4), <br/>\n02: Concentration(1), Discipline(1), Taunt(1), Save(1), <br/>\n03: Concentration(1), Discipline(1), Intimidate(1), Taunt(1), <br/>\n04: Concentration(1), Discipline(1), Taunt(1), Save(1), <br/>\n05: Concentration(1), Discipline(1), Intimidate(1), Taunt(1), <br/>\n06: Concentration(1), Discipline(1), Taunt(1), Save(1), <br/>\n07: Concentration(1), Discipline(1), Taunt(1), Save(2), <br/>\n08: Concentration(1), Discipline(1), Taunt(1), Save(3), <br/>\n09: Concentration(1), Discipline(1), Taunt(1), Save(4), <br/>\n10: Concentration(1), Discipline(1), Taunt(1), Save(5), <br/>\n11: Concentration(1), Discipline(1), Taunt(1), Save(6), <br/>\n12: Concentration(1), Discipline(1), Taunt(1), Save(7), <br/>\n13: Concentration(1), Discipline(1), Taunt(1), Save(8), <br/>\n14: Concentration(1), Discipline(1), Taunt(1), Save(9), <br/>\n15: Concentration(1), Discipline(1), Taunt(1), Save(10), <br/>\n16: Discipline(1), Save(13), <br/>\n17: Discipline(1), Save(16), <br/>\n18: Discipline(1), Save(19), <br/>\n19: Discipline(1), Save(22), <br/>\n20: Discipline(1), Save(25), <br/>\n21: Concentration(6), Discipline(1), Taunt(6), Save(16), <br/>\n22: Discipline(1), Save(19), <br/>\n23: Discipline(1), Save(22), <br/>\n24: Concentration(3), Discipline(1), Taunt(3), Save(19), <br/>\n25: Discipline(1), Taunt(1), Save(21), <br/>\n26: Discipline(1), Taunt(1), Save(23), <br/>\n27: Concentration(3), Discipline(1), Taunt(1), Save(22), <br/>\n28: Discipline(1), Taunt(1), Save(24), <br/>\n29: Discipline(1), Taunt(1), Save(26), <br/>\n30: Concentration(3), Discipline(1), Taunt(1), Save(25), <br/>\n31: Discipline(1), Taunt(1), Save(27), <br/>\n32: Discipline(1), Save(30), <br/>\n33: Discipline(1), Save(33), <br/>\n34: Discipline(1), Save(36), <br/>\n35: Discipline(1), Taunt(4), Save(35), <br/>\n36: Discipline(1), Save(38), <br/>\n37: Concentration(3), Discipline(1), Tumble(40), <br/>\n38: Discipline(1), Save(3), <br/>\n39: Discipline(1), Save(6), <br/>\n40: Concentration(4), Discipline(1), Taunt(5), <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}