{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "157",
  "name": "NWN1 EE / Question",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/nwn1-ee-question-t2355256.html",
  "author": "n3xu5",
  "avatar": "no_avatar.png",
  "replies": "1",
  "views": "177",
  "posts": [
    {
      "author": "n3xu5",
      "avatar": "no_avatar.png",
      "timestamp": "10:22 PM - Dec 07, 2019",
      "content": "<div>I picked up the NWN1 EE for the PS4 and am trying to play thru the original campaign first, then HOU/SOTU.<br/>\n<br/>\nThe build I'm trying to follow picked fighter (1), and then bard (2)... problem is bard cannot be chosen on level 2.<br/>\n<br/>\n1. Can anyone please explain why and if there's a reference guide I can read up on regarding class progression/caps/restrictions?<br/>\n2.  Can I carry over my character from the OC to HOU/SOTU and what would the level caps be? <br/>\n<br/>\nThanks in advance! </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:57 PM - Dec 07, 2019",
      "content": "<div>Hello N3xu5, and welcome to the Guild!<br/>\n<br/>\nFirst off I'd better confess that I don't play EE or on PS4, so things may be different there - others will know better.<br/>\n<br/>\nHowever, in ordinary, vanilla rules, there should be no problem with taking Fighter at level 1 and Bard at level 2 provided you haven't picked a lawful-aligned character (Bards can't be lawful). If you took them the other way around, that would be ok, but you'd need to start with a Charisma of 11. You'd gain skill points, but lose on stat points (unless you intend to be particularly charismatic, of course).<br/>\n<br/>\nAs far as carrying characters over from the OC to the expansions (which I initially did), you <em>can</em>, but it isn't advisable. SoU is designed to start with a level 1 character, much as the OC is, and you finish the OC at about level 17/18. You'd finish SoU at about level 13/14, so to play one after the other will make you massively overpowered. You <em>can</em> go from the OC straight to HotU (which ends at around level 28), but it's designed to be a follow-up to SoU.<br/>\n<br/>\nIf you want to take your character up to level 40, I'm afraid you'll have to download some modules or get into a Persistent World (where you can play with others). For modules, I'd suggest the OC and then into the Mines of Twin Summits trilogy, or SoU/ HotU then Sands of Fate - and we can give you details of them another time if you're interested.<br/>\n<br/>\nHope this helps a bit.<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: Sorry, nearly forgot, the NwN wiki will help with some knowledge of what works and what doesn't, but, particularly if you're playing a Bard, I'd also recommend having a read of Mick Dagger's guide to the class in our Game Guides forum. In fact, what sort of overall build are you looking for?</div>",
      "author-color": "#AA0000"
    }
  ]
}