{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "696",
  "name": "Order of the Dwarven Fist (Fighter 12 / Monk 2 / Dwarven Defender 26)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/order-of-the-dwarven-fist-fighter-12-monk-2-dwarve-t2355339.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "3",
  "views": "849",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:41 AM - Feb 04, 2020",
      "content": "<div><strong><span style=\"font-size:150%;line-height:normal\">Order of the Dwarven Fist</span></strong><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202002/10759084_94733acc32decff9b710c2afc77f0783.png\"/><br/>\n<br/>\n<span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://cdn.themis-media.com/media/global/images/quizzes/cat_img/287.png\" rel=\"noreferrer\" target=\"_blank\">https://cdn.themis-media.com/media/glob ... mg/287.png</a></span><br/>\n<br/>\n<strong>Lore:</strong><br/>\nThe monks of the Order of the Dwarven Fist have an unusual upbringing.<br/>\n<br/>\nFirstly prospective candidates are sent out, into the Underdark, amongst the ruddy dwarven fighters, clad in armor, equipped with tower shield, to help defend their cities.<br/>\n<br/>\nBut to prove their worth to the Order, they must abandon all thoughts of equipping that noble dwarven waraxe and rely on the <strong>power of the fist</strong>.<br/>\n<br/>\nWhich makes such candidates popular amongst the dwarven legion commanders, with their lawful nature and martial arts prowess, any post-battle tavern brawl usually ends with the Order candidates cleaning house and Order restored.<br/>\n<br/>\n...<br/>\n<br/>\nAnd once they have proven their worth with adequate military progression, they are finally accepted into the Order, finally earning their robes, and the power of the Monk Brotherhood....<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>Build notes:</strong><br/>\nThis build takes ideas from Cinnabar Din's classic build, <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build249432.html\" rel=\"noreferrer\" target=\"_blank\">The Resistor</a>, but makes adjustments:<br/>\n<br/>\n- makes it an unarmed dex-based Monk for 6-8 APR<br/>\n- takes Monk early pre-epic, to allow the player to equip medium armor and shield for better defensive capabilities, before finally donning their robes, and adding 1 BAB.<br/>\n- takes DD 26 (18/-) and EDR III (9/-) for near maximum physical damage reduction (27/-)<br/>\n- takes epic energy resistances 20/- in Acid, 10/- in Fire and 10/- Electricity (rather than 20/- fire, acid and cold)<br/>\n- takes resist energy feats in Cold and Sonic to cover the other elements<br/>\n- puts Int up to 14 for more skill points and for improved knockdown<br/>\n- takes great fortitude, epic fortitude and luck of heroes (rather than iron will / lightning reflexes) to try to boost the fortitude save for resistance against dev crit and implosion with a fort 37(42) save. Add more resistance with a few cons / fortitude boosting items on top of it, good luck to those guys killing you. I thought this balanced the build a little nicer compared with taking more epic energy resistances.<br/>\n<br/>\nIt loses UMD and a little sneak attack, and the will and reflex saves are not quite as good. <br/>\n<br/>\nThe base AB is still 40. The Monk UBAB makes it better.<br/>\n<br/>\nAs a soloist, this guy is almost certainly going to have clarity potions highly visible in the quickbar, no different to most non-UMD fighters. But give this guy an item with mind immunity, or that casts protection vs evil / lesser/greater mind blank and you are pretty much going to go into cruise control.<br/>\n<br/>\nIn a party this guy is where he truly shines, with 728hp (capped at 968hp), buffed with will protectors as described above, buffed with bull's/cats, buffed with cleric bonuses / bardic bonuses, with evasion/reflex 23(28) he can dodge a few fireballs and tank those dev crits and implosion users, if he rolls a 1, just res this guy and he will be at it again. <br/>\n<br/>\nHis dexterity AC will be protected with dwarven defensive awareness I, and sneak attacks will be difficult against this guy with a both high spot score (listen is not effective, a successful spot check is required to stop sneaks from stealth), defensive awareness II (which gives flanking immunity, no sneak attacks from that) and a high discipline score to resist knockdowns if knockdown immunity is not available.<br/>\n<br/>\nFor style points he can also eventually use deflect arrows with a 95% success rate (DC 20) whilst tanking it up, the animation for that ability is simply awesome. Not that those arrows were ever going to damage him in the first place.<br/>\n<br/>\nOne can equip a kama by taking exotic weapon proficiency early on, or dropping 1 BAB for an early monk level (which increases saves in exchange), but fists have a certain style to them.<br/>\n<br/>\nPre-epic, damage resistant enemies (ie ghostly visage with +1 soak 5) might be a pain without monk gloves, but you can carry around a spare enchanted shortsword/handaxe to give these guys the smackdown then switch back.<br/>\n<br/>\nOr if you want to cheat the Order, just keep that enchanted shortsword/handaxe equipped whilst the Brotherhood is not looking (they will never know...) until they award you those gloves.<br/>\n<br/>\nOverall the numbers look great, it looks novel, very difficult to kill, and enough AB to play solo, so I'm going to share this one with you guys, in fact, I might start play testing this soon. <br/>\n<br/>\nAppreciate any feedback on suggested tweaks/improvements!<br/>\n<details><summary>Spoiler</summary>Fighter(12), Dwarven Defender(26), Monk(2), Dwarf\nAny Lawful\nSTR: 14\nCON: 18 (22)\nINT: 14\n\n01: Fighter(1): Luck of Heroes, Blind Fight\n03: Fighter(3): Weapon Focus: Unarmed\n05: Fighter(5)\n07: Fighter(7)\n09: Dwarven Defender(1): Improved Knockdown, {Defensive Stance}\n11: Dwarven Defender(3)\n13: Dwarven Defender(5)\n15: Dwarven Defender(7): Resist Energy: Cold\n17: Dwarven Defender(9)\n19: Fighter(9)\n21: Fighter(11): Epic Energy Resistance: Acid I\n23: Dwarven Defender(11)\n25: Dwarven Defender(12)\n27: Dwarven Defender(14): Epic Energy Resistance: Electricity I, Epic Energy Resistance: Fire I\n29: Dwarven Defender(16)\n31: Dwarven Defender(18): Epic Energy Resistance: Acid II\n33: Dwarven Defender(20): Epic Fortitude\n35: Dwarven Defender(22): Epic Damage Reduction II\n37: Monk(2): {Deflect Arrows}\n39: Dwarven Defender(25): Great Dexterity I, (DEX=21)\n\nSkillpoints: 176\nSaving Throw bonuses: Spells: +5, Traps: +1, Poison: +2\nAB (max, naked): 40 (melee), 37 (ranged)\nSpell Casting: \n\n\n01: Discipline(4), Lore(2), Open Lock(1), Search(2), Spellcraft(2), \n03: Discipline(1), Lore(1), Search(1), Spellcraft(1), \n05: Discipline(1), Lore(1), Search(1), Save(2), \n07: Discipline(1), Search(1), Save(6), \n09: Discipline(1), Spot(12), \n11: Discipline(1), Search(1), Spot(1), Save(2), \n13: Discipline(1), Spot(1), Save(6), \n15: Discipline(1), Spot(1), Save(10), \n17: Discipline(1), Spot(1), Save(14), \n19: Discipline(1), Save(19), \n21: Discipline(1), Save(25), \n23: Discipline(2), Spot(5), Save(3), \n25: Discipline(1), Spot(2), Save(7), \n27: Discipline(1), Spellcraft(5), Spot(1), Save(1), \n29: Discipline(1), Spot(1), Save(5), \n31: Discipline(1), Spot(1), Save(9), \n33: Discipline(1), Spot(1), Save(3), \n35: Discipline(1), Spot(1), Save(7), \n37: Discipline(1), Tumble(15), \n39: Discipline(1), Search(1), Spot(1), </details></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:20 PM - Feb 04, 2020",
      "content": "<div>I have combined these classes before in my Order of the Stone Fist, but went with Monk 20 / Fighter 6 / DD 14 for 1d20 fists and other Monk goodies like +4 AC (and more frequent Tumble skill dumps), monk speed, spell resistance 30, and immunity to disease, poison, and all mental effects.  With only 2 levels of Monk, your fists do only 1d6 damage, same as a kama, so you might as well dual-wield kamas for 2 more attacks.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:49 PM - Feb 04, 2020",
      "content": "<div>Hail Empyre65! Thanks for reading through this build draft and commenting!<br/>\n<br/>\nImproved two-weapon fighting (ITWF) Kama is always attractive in a low monk build, particularly in a BAB 30 build dex build for those two extra attacks.<br/>\nNot only these are two attacks, the kamas free up the glove slot for something else, they can have flame weapon/keen edge/GMW cast on them as well.<br/>\nAs mentioned, a high Monk (16+) enjoys those powerful 1d20 fists plus all those other goodies.<br/>\nI enjoyed reading through your Order of the Stone Fist build, and thanks for linking it for me to read.<br/>\n<br/>\nI believe ITWF Kama comes with downsides as well in this particular build. <br/>\nTo implement them in this instance, it would cost either 4 additional pre-epic feats (weapon proficiency exotic, two-weapon fighting, ambidexterity, improved two-weapon fighting) or -1 BAB by taking Monk 1 pre-epic (to avoid taking weapon proficiency exotic) and the three two weapon fighting feats.<br/>\nThere is -2 AB on top of this for dual wielding, which if flurry of blows is additionally used, a further -2 AB, which drops that base 40 AB down to base 36-38 in practice.<br/>\nBeing tiny weapons, they make the character susceptible to improved disarm attempts, which with a large weapon, provide a +8 bonus to AB to your opponent (compared with -4 AB if this character was wielding a large weapon or was unarmed). In some ways, if you resist the improved disarm attempt wielding a tiny weapon it is better for your opponent, as they will continue to enjoy massive (up to +40%) boosts to the chance to hit you and critical hit you.<br/>\nIn certain environments (ie against undead) bludgeoning damage is more favorable than slashing.<br/>\nSome environments have rust monsters who can instantly destroy your equipped kama instantly if you hit them, whilst an unarmed monk will have no difficulty dealing with them. <br/>\nOf least importance for this build with all these resistances, deflect arrows cannot be used unless you have a free hand, so a dual wielding kama monk will have this feat disabled.<br/>\n<br/>\nBecause I designed this fellow to tank for parties, providing the occasional improved knockdown and have enough AB to solo effectively, I chose to not go down this path and took more defensive pre-epic and epic feats. I believe the ITWF Kama suggestion has merit if one wishes to play a more offensively focused build. <br/>\n<br/>\nIf one goes down this path for this build, I would drop LoH for exotic weapon proficiency, great fortitude/resist energy x2 for ambidexterity/TWF/ITWF, and four of the epic energy resistance feats to boost up dexterity so the character can compensate for the -2 AB penalty for dual wielding. I think this is a very viable option to the player and thanks for suggesting it.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:17 PM - Feb 07, 2020",
      "content": "<div>I didn't link my Order of the Stone Fist build because I was scolded once for putting a link to another build in somebody's build thread, which is apparently a big no-no.  Since you expressed a desire for a link, here it is: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=238#p238\" rel=\"noreferrer\" target=\"_blank\">Order of the Stone Fist</a>.</div>",
      "author-color": "#00AA00"
    }
  ]
}