{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "190",
  "name": "\"Pure\" Shifter?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pure-shifter-t2354483.html",
  "author": "Phalanxx",
  "avatar": "10235276_1510287070.gif",
  "replies": 8,
  "posts": [
    {
      "author": "Phalanxx",
      "avatar": "no_avatar.png",
      "timestamp": "3:47 AM - Dec 14, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I've read as many of the guides I could find on this site and others, but I don't feel like I know NWN to be able to build a \"pure\" shifter.<br/>\n<br/>\n I've played RPGs for years and played alot of the sneaky/stabby variety of things, occasionally the failry straight forward fighting type of characters (more than a few monks), and thought I'd like a bit of a change.  I realized that I've never really played a druid or shifter style character, and thought I'd give it a whirl.  I love the description of a pure shifter in this guide:  <a class=\"postlink\" href=\"http://www.gamefaqs.com/pc/188666-neverwinter-nights/faqs/27914\" rel=\"noreferrer\" target=\"_blank\">http://www.gamefaqs.com/pc/188666-never ... faqs/27914</a>  Where the idea is that you change your form based on the situation.  I also quite like the idea of a bad-ass dragon form, I have to say.<br/>\n<br/>\n I guess that (at least initially), I will be playing through the OC, SoU and HoTU.  Given time/enjoyment/etc I may try out some of the very interesting sounding extend campaigns like \"The Aielund Saga\", etc.<br/>\n<br/>\n So my goals are a) play something different (primarily shifter, with some druidness built in), and b) get to Dragon form, if possible.<br/>\n<br/>\n From what I can tell most of the builds that involve a Monk preclude the Dragon form.  It's not clear to me if you can actually get to Dragon form at all in a SoU/HotU playthrough at all (and certainly not in just the OC).<br/>\n<br/>\n Also I should point out that I'm basically a NWN n00b, so would need details on which feats &amp; skills to take at each level.<br/>\n<br/>\n Any and all advice appreciated!  Thanks in advance.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:35 AM - Dec 14, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've never played a shifter, so I can't help with that, but there is something I can help you with. The OC and SoU happen at the same time to two different heroes, and they both start at level 1. HotU follows SoU.<br/>\n I'd take one build through the OC and the Aribeth's Redemption series, an action adventure / love story between your character and Aribeth that takes you to about level 27.<br/>\n Then play a <strong>different build</strong> in SoU, then a bridge module like The Nether Scrolls (a great module, but optional), and then HotU, and finally the Sands of Fate series, which will take you all the way to level 40.<br/>\n You mentioned the Aielund Saga, and I wholeheartedly agree. It's a must-play, and it will take you from level 1 to level 36.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "4:04 PM - Dec 14, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have played general shifters a coouple of times. IMO they are best in low magic environments with few immunities on items and not more than +3 on weapons and armor.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:18 PM - Dec 14, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>I have played general shifters a coouple of times. IMO they are best in low magic environments with few immunities on items and not more than +3 on weapons and armor.</div></blockquote>\n<div align=\"left\">Which means none of the modules I mentioned would be good for a Shifter.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:36 AM - Dec 15, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you want to focus on dragon shape use druid/CoT/monk.  Druid/shifter/CoT misses out on the creature merge with monk attacks and AC.  Druid/shifter/monk will never reach WIS 30 within 30 levels.  Shifter dragon breath weapon is better but all else the same. Better to go the well-rounded shifter and learn how to use all the special abilities before deciding on a specialty.  I've played scores of shifters in diverse environments and they can at least be a handy party member vs. certain kinds of attacks (like vs. mobs of greater basilisks and medusae).<br/>\n<br/>\n @Mr. Dagger: a cleric 10+/shifter will hold its own very well solo in mid-magic.  Risen Lord's +5 scythe and every shape using creature weapons will pierce stoneskin (et al.) when buffed with same.  Also, Rak's unlimited ice storms is nothing to sneeze at.<br/>\n<br/>\n edit: BTW, there is a challenging way to play OC-HotU combo.  After completing the OC, use a trainer (or just before your last character export in OC, execute console control) to de-level to 14-15.  That will hit HotU about right and allow your toon to party up with Deekin before he mucks up his bardic prowess with RDD levels.  <strong>Lasting Inspiration</strong> Rocks! :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:11 AM - Dec 15, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>BTW, there is a challenging way to play OC-HotU combo.  After completing the OC, use a trainer (or just before your last character export in OC, execute console control) to de-level to 14-15.  That will hit HotU about right and allow your toon to party up with Deekin before he mucks up his bardic prowess with RDD levels.  <strong>Lasting Inspiration</strong> Rocks! :)<br/>\n  </div></blockquote>\n<div align=\"left\">If you do that, that NPCs who are supposed to recognize you as the hero from SoU won't recognize you, because you are NOT the hero from SoU. They also won't recognize you as the hero from the OC, becaues you aren't supposed to be.<br/>\n<br/>\n I guess you could play SoU, de-level to level 1, play the OC, de-level to level 15, and then play HotU, but it is easier and more fun to use 2 different builds.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:37 PM - Dec 15, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>@Mr. Dagger: a cleric 10+/shifter will hold its own very well solo in mid-magic.  Risen Lord's +5 scythe and every shape using creature weapons will pierce stoneskin (et al.) when buffed with same.  Also, Rak's unlimited ice storms is nothing to sneeze at.<br/>\n  </div></blockquote>\n<div align=\"left\">The AC is generally worse for shifters, that only merge one AC type, than for characters that can get AC from several different sources. Wisdom based monk build is an exception, especially when buffed to max with owls insight. Shifter builds suffer from a low BAB and have few ways of buffing AB, unless the shape has a high inherent AB, like the dragon shape<br/>\n Clerics are almost always overpowered, especially pre-epic and in low-/ mid-magic environments<br/>\n I agree with you that some focused shifter builds can be very powerful, and even more so in low-/ mid-magic settings. I will add the kobold/assassin to the list. It has HIPS and a +10 bonus to both stealth skills. It can be strength based since the shape does not override strength, for a higher AB and dev crit, or intelligence based for an unbuffed DA DC of 48-49 and skillpoints galore.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:34 PM - Dec 15, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/><div align=\"left\">If you do that, that NPCs who are supposed to recognize you as the hero from SoU won't recognize you, because you are NOT the hero from SoU. They also won't recognize you as the hero from the OC, becaues you aren't supposed to be.<br/>\n I guess you could play SoU, de-level to level 1, play the OC, de-level to level 15, and then play HotU, but it is easier and more fun to use 2 different builds.</div>\n</div></blockquote>\n\n The synchronization prereq is all in your head, Empyre.  If a player hasn't tried SoU yet, they will miss the back story... so go play it. With any toon you want.  Is the background necessary for HotU? Meh.  Once you've played through SoU once you'll get the gist.  SoU is particularly unforgiving and tedious for intentionally-gimped pre-epic builds preparing for epic superiority.<br/>\n<br/>\n Deekin treats any toon as a long, lost pal. The convos are written that way.  There are no convo variables set on the PC that are carried forth from SoU to HotU.  It's the OC-based henchmen that seem to be suffering from amnesia and some continuance of their backstories.<br/>\n<br/>\n Besides, the campaigns are easy enough to serve as a good mid-level testing ground for build concepts being considered for PWs and harder environments.  Gotta start somewhere.<br/>\n<br/>\n It really doesn't matter where you pull your pre-designed toon from for HotU as long as the level approximates what comes out of SoU... like I said 14-15 is about right.<br/>\n Even if SoU produces a lower level toon (if you skip through some of SoU sidequests, for example), the HotU starting script will autolevel up to... ummm... I think it's Level 15<br/>\n but haven't opened HotU with a low-level toon in a long time so forget the target level.  De-level an SoU toon to begin the OC?  Sorry. I don't get the point.  <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n @Mick:  ....that's the reason for the cleric/shifter concept which I haven't tried before and has been working extremely well.  It's all about buffs.  I settled on a dexer Risen Lord which gains at least +10 dex AC, AC that cannot be lost when flanked since it is part of the merge.  AC total with the equipment from OC-HotU produces a buffed defense around 55-58 AC depending on when the buffs begin to fall off.  That seems more than enough for any mid-magic settings, especially when you factor in the crit/sneak immunity.  The monk shifter is so prescription and stale I don't even consider it anymore.  But that's me.  Neophyte shifters need lots of play-testing to learn all the special abilities.<br/>\n<br/>\n Divine Power, Divine Favor and Empowered Bull's (not to mention those inappropriate +10 weapons that take most of the challenge away) raise the BAB/AB near to around a pure fighter's. Full BAB free attacks from haste or DP function just the same as any non-morphing toon so it hits a lot with scary damage.  Notice that I do not compare it to WM AB. But then again, I don't know of any Palemaster/WM builds for the immunities.  If there are, they probably use daggers :P<br/>\n<br/>\n The only problem I have testing RL in SP is that I cannot party with a magic user to inflict critical wounds or target my RL with NER/NEB when the health falls, which isn't very often. Don't like to keep morphing and remorphing during combat just to heal.  Of course, when I spot cleric mobs, the bane of all RLs, I unmorph quickly.<br/>\n<br/>\n Don't know how much you folks have played dragon shape, but I hate it.  That fat draconic butt is always getting stuck and impeded underground and inside buildings.  Even iron golem is no picnic to navigate around your own party trying to stay in effective tanking position. IMO those are outdoor-only shapes. Thax always seemed to have success designing/playing with elder elementals and other unarmed forms, but I found them very limited and unprepared to hit enemies without the weapon merge (like you explained).  The dragon's +6 claws do doodly squat vs. Epic Warding.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:51 PM - Dec 15, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you hate SoU so much, then just make a new character and go straight to HotU, where you will be leveled up to 15, as you said. When you are playing single-player, don't design your build for level 40 supremacy because most of the time, you will not be at level 40. Make the build playable throughout, and SoU will be as fun as the rest of the chain of campaigns (SoU, Elder Scrolls [optional, but fun], HotU, Sands of Fate). The OC is fun, too, but if you follow it with HotU, you're doing it wrong.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}