{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "308",
  "name": "Build category scope(s)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/build-category-scope-s-t515329.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": "4",
  "views": "552",
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:03 PM - Jun 29, 2011",
      "content": "<div>I haven't noticed this clarified anywhere so I suppose I should just ask...<br/>\n<br/>\nThere are 3 build category sub-forums... 20, 30, 40.<br/>\n<br/>\nAre these only intended to contain builds which are designed at those exact levels or also to contain builds for all the increments?<br/>\nFor example, the builds for 30... would they include all builds level 21 through 30 or just those at 30?<br/>\n<br/>\nThe reason being is that many modules are designed to achieve levels in between these, like the OC would use a level 18 build, SoU a level 14 build, etc.  Other community-made modules have their own level cap as well.  I've found that in almost all cases, the most effective build is one that is maximized for a certain level, give or take a level or 2 at most (merely ignoring the last few levels of a 20, 30 or 40 build just doesn't make it in most cases).<br/>\n<br/>\nFor PWs, it is typically not an issue since they usually max at 40 (even as high as 60) and these would be using the standard level 40 build.<br/>\n<br/>\nWondering what was planned here.  Tx.</div>"
    },
    {
      "author": "Dinichthys",
      "avatar": "no_avatar.png",
      "timestamp": "4:26 PM - Jun 30, 2011",
      "content": "<div>Kail will have to give you the skinny, but my understanding is they'd go to level 20, 30, or 40. If someone needs something for a specific module/server that stops at an in-between level, then they'd ask for it in the Build Request forum.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "6:25 PM - Jul 01, 2011",
      "content": "<div>They are supposed to be builds hitting the lvl 20-30-40 mark specifically.<br/>\n<br/>\nThe rationale of those categories is one of epic vs preepic PWS (hence lvl 20 capping) and, in epic, the fact that many PWs have been design to cap specifically at lvl 30. Adapting a lvl 20 build to lvl 18 eg is not usually a big issue and so people playing the OC  can easily look at the lvl 20 capped build and adapt them or just play them straight out of the box or ask for help at the build request forum (which is open to all level intervals). I do believe that those three categories better help in getting reference builds for all environments (possibly we could add a lvl 10 builds category?), but anyone please feel free to chime in and add some additional perspective. Everything is just being born and so is easily adjustable.<br/>\n<br/>\nThank you for your feedback.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:28 AM - Jul 02, 2011",
      "content": "<div>Gotcha, Kail.  I see where you are going with this rationale.<br/>\n<br/>\nIt is much easier to compare similar builds with a common metric as you have indicated.  The only real issue arises when the last level or 2 establishes critical feats or proficiencies which would not be made available unless the PC actually reaches that level.  Sometimes it takes some significant re-juggling to obtain the best fit while sacrificing the least in an abridged version.  These are generalities, though, so can likely be addressed on a per-build or per-request basis.<br/>\n<br/>\nNever realized PWs capped epic at less than 40.  I haven't played all that many myself and tend to stick with those that my acquaintances frequent, so it is interesting to learn of other customs.</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "11:34 AM - Jul 02, 2011",
      "content": "<div><blockquote><div><strong>HipMaestro wrote:</strong>Gotcha, Kail.  I see where you are going with this rationale.<br/>\n<br/>\nIt is much easier to compare similar builds with a common metric as you have indicated.  The only real issue arises when the last level or 2 establishes critical feats or proficiencies which would not be made available unless the PC actually reaches that level.  Sometimes it takes some significant re-juggling to obtain the best fit while sacrificing the least in an abridged version.  These are generalities, though, so can likely be addressed on a per-build or per-request basis.</div></blockquote>That was my thought, addressing those builds giving issues on a specific basis while mantaining categories which make generic reference frames (which is so much more \"tidy\" too).<br/>\n<blockquote><div>Never realized PWs capped epic at less than 40.  I haven't played all that many myself and tend to stick with those that my acquaintances frequent, so it is interesting to learn of other customs.</div></blockquote>Well, rare cases apart, PWs go for lvl 20-30 or 40. Lvl 40 capping is the most common but lvl 20 ones have not been lacking and lvl 30 while in a minority are far from being unheard of.</div>"
    }
  ]
}