{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "781",
  "name": "'Yellow Mage' Two-Bladed Spell-sword Improved Disarmer (Cleric 15 / Bard 15 / RDD 10)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/yellow-mage-two-bladed-spell-sword-improved-disarm-t2355218.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "4",
  "views": "283",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:13 AM - Oct 28, 2019",
      "content": "<div>This is a ridiculously ambitious build I have concocted.<br/>\n<br/>\nFirstly its a MAD build (Multi-attribute dependent). Str for AB. Dex for dual wielding feats. Cons needed for HP for melee. Wisdom for cleric spells. Int for skills and improved disarm. Charisma for divine damage.<br/>\n<br/>\nNone of my starting stats, incredibly, are more than 14. Normally that is a red flag for a build. I'm choosing to take RDD cheese to compensate for this. Lets see if I can make this work.<br/>\n<br/>\nSecondly not only have I made a 'Yellow Mage' (well a cleric/bard, wasn't sure what colour it was gonna be, but it wasn't gonna be red), but made him a Two-bladed sword wielder with ITWF with improved disarm. <br/>\n<br/>\nThe idea of Improved Disarm is to taking advantage of the large weapon size of the two-bladed sword and the extra attacks.<br/>\n<br/>\nWith Divine Favor / Divine Power / Other Cleric buffs / Bard song / Curse song / Taunt and Improved Disarm and Base AB 38 he should be able to hit enemies and remove their weapons.<br/>\n<br/>\nMaking combat a little easier for you. Maybe you could pilfer their weapons and run off too, once your tumble skill is high enough :)<br/>\n<br/>\nWith Divine Might Divine Favor and 28 base strength potentially cappable to 40 he should be able to do some damage. <br/>\n<br/>\nAnyway the big weakness is most buffs  are dispellable, but there is enough left over (Taunt / Divine Might / Bard Song / Curse Song / RDD goodness) to deal with whatever problems enemies might cause you.<br/>\n<br/>\nBut without a knockdown skill if this guy encounters a real mage he might have to run for the hills.<br/>\n<br/>\nMaybe I should drop Blind Fight for knockdown?<br/>\n<br/>\nHealth I got up to about 370 odd and I'm loathe to lower HP any further he probably does need toughness.<br/>\n<br/>\nI could have dropped taunt and cross-classed the set trap skill to be able to set deadly traps<br/>\n<br/>\nAnyway wondering what you guys thought. Could be garbage, but it could be good too?<br/>\n<details><summary>Spoiler</summary>Cleric(15), Bard(15), Red Dragon Disciple(10), Human\nSTR: 14 (28)\nCON: 10 (12)\nINT: 12 (14)\n\n01: Bard(1): Power Attack, Blind Fight\n03: Cleric(1): Weapon Proficiency Exotic, Animal Domain, Plant Domain\n05: Bard(3)\n07: Red Dragon Disciple(1)\n09: Red Dragon Disciple(3): Ambidexterity\n11: Red Dragon Disciple(5)\n13: Red Dragon Disciple(7): (CON=12)\n15: Cleric(4): Improved Two-Weapon Fighting\n17: Bard(4)\n19: Cleric(7)\n21: Red Dragon Disciple(9): Epic Weapon Focus: Two-Bladed Sword, (INT=14)\n23: Cleric(9)\n25: Cleric(11)\n27: Cleric(13): Improved Disarm\n29: Cleric(15)\n31: Bard(6)\n33: Bard(8): Toughness\n35: Bard(10)\n37: Bard(12)\n39: Bard(14): Great Strength I, (STR=27)\n\nSkillpoints: 227\nSaving Throw bonuses: \nAB (max, naked): 38 (melee), 28 (ranged)\nSpell Casting: \nBard(5) 5/4 4/5 4/4 4/4 4/3 3/2\n\n\n01: Concentration(4), Discipline(3), Lore(4), Open Lock(1), Perform(4), Save(7), \n03: Concentration(1), Lore(1), Save(2), \n05: Concentration(1), Discipline(1), Lore(1), Perform(2), UMD(3), Save(2), \n07: Concentration(1), Search(8), \n09: Concentration(1), Save(4), \n11: Concentration(1), Save(10), \n13: Concentration(1), Save(16), \n15: Concentration(1), Save(22), \n17: Concentration(1), Perform(3), Tumble(15), UMD(12), \n19: Concentration(1), Save(6), \n21: Concentration(1), Discipline(6), Save(6), \n23: Concentration(1), Save(10), \n25: Concentration(1), Save(18), \n27: Concentration(1), Save(26), \n29: Concentration(1), Save(34), \n31: Concentration(1), Discipline(1), Taunt(5), \n33: Concentration(1), Discipline(4), Perform(2), \n35: Concentration(1), Discipline(1), Taunt(5), \n37: Concentration(1), Discipline(1), Tumble(5), \n39: Concentration(1), Discipline(1), Perform(3), Taunt(2), </details></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:05 PM - Nov 02, 2019",
      "content": "<div><blockquote><div><cite>Orion2019 wrote: <div class=\"responsive-hide\">Oct 28, 2019</div></cite>This is a ridiculously ambitious build I have concocted.<br/>\nAnyway wondering what you guys thought. Could be garbage, but it could be good too?</div></blockquote>\nThis \"yellow mage\" is original in more ways than just the new name. The weapon choice and the synergy with Disarm is a great idea for a dual wielder. DM is almost over the top, but it works.<br/>\nYou blend 3 power classes here: <br/>\nCleric has the strongest buffing spells. RDD is the character builder's wet dream. Bard is the master of performance.'<br/>\nYour build is feat starved and you keep taking pre-epic feats throughout the epic levls. <br/>\nIn a way you break many principles for power building, but the power of the 3 classes more than compensates for that, and it ends up being really powerful after all.<br/>\nThe build has something in common with both Mith's \"Blood and Faith\" and my own \"Spirit and Steel\".<br/>\nBut to be able to have both RDD10 and a strong Bard song, you have to do with 15 Cleric levels. <br/>\nYou will find many self buffing power builds with 15 Cleric levels. Most AB and AC buffs will give a +5 bonus and DP will last long enough for most battles. You have to do without the level 9 spells though, and you must be prepared to be dispelled.<br/>\nTaking 3 classes means you have to make a choice between them when deciding what to develop first.<br/>\nIMO Cleric comes first. And I would choose a Cleric 12/ Bard4/ RDD4 pre epic split. With Bard at lvl 1, 7, 12 and 17 and RDD at level 16 and 18 - 20.<br/>\nIn epic I would take Cleric at 21, 23 and 24 and RDD at 25, 26 and 28 - 31. So Bard would come last at 22, 27, and 32 - 40<br/>\nAs for feats, I would rather see Extend Spell than Toughness. And I would weight Empower and AS against PA and DM. I would also love to see  IKD in there as well. But that would probably mean no Disarm feats, and that is asking too much here.<br/>\nThe choice of a double weapon can feel a bit limiting when you need a shield for AC. But with the buffs available here you can easily pick up a Bastard sword and swing it successfully, only 1 AB below  what you have when you wield your Double sword.<br/>\nYou pick many great skills. I miss Spellcraft for this \"mage\". You will probably be able to land most attacks without the help from Taunt. <br/>\nThe target for UMD depends on what gear that is available. Bards only need 10 modified UMD to be able to use all scrolls without failure even on the most difficult settings.<br/>\n<br/>\nAll in all a fine build. Now test it and see if you want to post it in the 40s.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:45 PM - Nov 02, 2019",
      "content": "<div>Thanks Mick for your very thoughtful post regarding a very 'out of the box' build<br/>\n<br/>\nI thought it would be fun in a persistent world party situation, where there are super powerful mages/cleric, fighter RDDs in a party, everyone expects that stuff, and...<br/>\n<br/>\nyou rock up with a: <br/>\n<br/>\n<em>Party member: \"?what yellow mage two-bladed sword improved disarmer with divine damage? who are you?\"</em><br/>\n<br/>\n<em>You: \"Yup and optimised by the ECB\"</em><br/>\n<br/>\nIts sort of like when you rock up to a costume party with the most outrageous costume that fits the rules, you know a 'trend breaker'<br/>\n<br/>\nI digress<br/>\n<br/>\nI like the idea of advancing cleric levels earlier to get the buffs faster, even if they are undispellable.<br/>\nI'll just have to get disarm and improved disarm later on in the build which I don't believe to be a major issue, there are so many feats this build needs to fit in.<br/>\nI thought about Blind Fight vs Knockdown, and I believe this build needs Knockdown to deal with spell casters, if they have improved invisibility up, I simply will have to use UMD and Mord them unfortunately II is not breachable<br/>\nI like the idea of extend spell but I do want to get the HP as close as I can to 400 for a dedicated melee'er who can get dispelled.<br/>\nTo incorporate extend spell and keep toughness I could drop the AB down to 37. Normally I am not keen on dropping the AB too much but I suspect this build can manage in a mid-magic environment with all the buffs available. I will consider this<br/>\nI could drop Taunt down to about 20 (kind of a cross class maximum) and put some points in spellcraft to help identify spells being cast &amp; get some saves against them which is a good idea<br/>\nThanks for your point on bastard swords and tower shields, I had forgot about that!<br/>\n<br/>\nThanks again Mick!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:06 AM - Nov 03, 2019",
      "content": "<div>Here's a build from the Legacy Forum for compare and contrast purposes for you, Orion. It's focus is different, though it has the same class split. but it might be interesting.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/blade-juggernaut-cleric-15-bard-15-red-dragon-disc-t515452.html\" rel=\"noreferrer\" target=\"_blank\">Blade Juggernaut</a><br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:41 PM - Nov 03, 2019",
      "content": "<div>Thanks Stag<br/>\nWhat a fascinating little Gnome two handed scimitar build cdaulepp created!<br/>\n<br/>\nI think with Improved Knockdown and Blind Fight that build would be a monster with its Dev Crit...</div>"
    }
  ]
}