{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "007",
  "name": "Maximising AB in builds: A Guide",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/maximising-ab-in-builds-a-guide-t2355202.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 11,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:29 AM - Oct 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><span style=\"font-size:175%;line-height:normal\">Maximising AB in builds: A Guide</span><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Why am I writing this?</span></strong><br/>\nWhen I started writing builds I had no idea how valuable AB was or how to maximise it. As such my earliest builds had terrible AB and struggled to hit things. I have spent a considerable amount of time learning about how to optimise ending AB in builds, and I feel I am now at a stage where I can say I have mastered this skill close to the best of my ability, as evidenced by a number of builds which I have recently made which have ending ABs of 45 to 50, still with reasonable balance. I wish to put this knowledge in a written form, so that I can organise my thoughts, others can learn from it, or best case scenario, others can teach me new tricks to do it even better!<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Why is the Attack Bonus (AB) important</span></strong><br/>\nQuite simply one needs to hit enemies to do damage. Therefore the Attack Bonus (AB) is one of the most important combat stats in the game. 1 AB might not sound like much, but when close to an opponents armor class (AC), it is a 5% increased chance to both hit the opponent and critically hit the opponent (for more information, read <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Attack_bonus\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki: Attack Bonus</a> and <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Threat_roll\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki: Threat Roll</a>) on all your attacks. <br/>\n<br/>\nIn addition, all combat abilities are activated at a cost to AB, for example a Knockdown attempt reduces the AB by 4 and activating Expertise mode reduces the AB of all attacks by 5. Attempting to Knockdown an opponent with Expertise (or Power Attack) active means attacking with -9 to the attack roll. <br/>\n<br/>\nTo make the most out of a combat character maximising the AB is imperative. One needs AB to hit opponents to do damage, and to use special combat abilities. Opponents can only be defeated if damage is dealt.<br/>\n<br/>\nAB is not everything. Ideally a combat character needs to be able to stand and fight in combat for prolonged periods before retreating to heal or buff and repeat the process. There are certain suggestions to achieve this, such as trying to achieve a base HP goal of 400-500 for dedicated melee characters, 300 for ranged characters, support characters or spell casters, at level 40. Or trying to maximise AC through Tumble / Armor Skin / Shield usage or other means. Or Feats such as self-concealment or UMD/Assassin 9 for Improved Invisibility for 50% concealment.<br/>\n<br/>\nA good build tries to create a balance between attack (AB, Damage, Crit Chance, Taunt, Set Trap), defense (HP, AC, DR, Concealment, Saves, Immunities, Concentration/Discipline) and special features (ie Skills such as Disable Trap, Open Lock, Heal/Lore etc), in a quantity that is sufficient to achieve the task in the environment in question, and enjoyably. But one needs to hit the opponent to do damage and defeat the opponent, so many combat builds are judged on their AB score when determining the quality of the build. <br/>\n<br/>\nA characters ability to hit an opponent in a round depends on more than AB, although AB is the focus of this guide. <br/>\n<br/>\nHitting an opponent in a round depends on:<br/>\n- The Character's AB (the sources of which will be described shortly)<br/>\n- The Character's number of attacks / round, the more attacks the more chances to hit/round, which can be modified by a large number of factors, including BAB, Dual Wielding, Improved Two-Handed Fighting, Monk Unarmed BAB, Rapid Shot/Flurry of Blows, Divine Power (if BAB is 25 or less)/Haste<br/>\n- The opponent's AC (which can be reduced with Taunt, Stuns/Paralysis, Curse Song, increasing your 'effective' AB)<br/>\n- Concealment of the opponent for example Improved Invisibility for 50% concealment, which can be mitigated by Blind Fight, and if magical in nature, potentially removed by a spell such as Mordenkainen's Disjunction<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Where does AB come from</span></strong><br/>\nAs discussed maximising AB is the focus of this guide. It is important to understand where AB comes from.<br/>\n<br/>\nA characters usual AB is the summation of:<br/>\n<br/>\n- The Base Attack Bonus (BAB)<br/>\n- AB Bonuses from feats (such as Weapon Focus, Epic Prowess, Small Stature, Superior Weapon Focus or Enchant Arrow)<br/>\n- AB Bonuses from ability modifiers (for example a Strength Melee Warrior with 30 Strength will have an additional +10 to AB, from a +10 strength modifier)<br/>\n<br/>\n- AB Bonuses from activated abilities (such as Bard Song, Bless/Aid, Divine Favor, Smite Evil or a large weapon user using Improved Disarm on a tiny weapon user)<br/>\n- AB Bonuses from items (such as a +5 Greatsword adding +5 AB to attacks, or indirectly from +ability items such as a Gauntlets of Ogre Power adding +1AB via a +1 Str modifier from +2 Strength gain)<br/>\n- AB Penalties from feats or conditions (such as -4 AB for using Knockdown or -5AB activating Expertise mode, or being afflicted by Curse Song)<br/>\n- AB Bonuses from certain conditions (such as +2 AB from flanking an opponent or +2 attacking an opponent who doesn't have Blind Fight from stealth)<br/>\n<br/>\nThis guide focuses on the first three factors (BAB, Feat bonuses and Base Ability Modifiers) <br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">What is a 'adequate AB' and what is a 'great AB', and what should I aim for, with level 40 builds</span></strong><br/>\nWhen it comes to what AB one wishes to achieve, there was a <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/attack-bonus-ab-goals-t2355144.html\" rel=\"noreferrer\" target=\"_blank\">discussion</a> in this forum recently about this in terms of AB goals for level 40 characters. <br/>\n<br/>\nMithdradates wrote this post in terms of goals for warrior builds, to TyrTemplar:<br/>\n<blockquote><div><strong>Mithdradates wrote</strong> <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build241416.html\" rel=\"noreferrer\" target=\"_blank\">in May 2006</a>:<br/>\n<br/>\nI'll echo Grim's sentiment about droping your wisdom and raising your dexterity instead. A 32 AB is pretty low, typically you can think of ABs as follows:<br/>\n&lt;=37 low<br/>\n38-40 average support character<br/>\n40-42 good support character, low warrior<br/>\n42-44 average warrior<br/>\n&gt;=45 good warrior.<br/>\n(different builders have different scales, but this should be fairly standard)</div></blockquote>\n\nWhich Mick Dagger has kindly clarified to assist me there are certain caveats for different classes:<br/>\n<blockquote><div><strong>Mick Dagger <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/attack-bonus-ab-goals-t2355144.html#p16433\" rel=\"noreferrer\" target=\"_blank\">wrote</a>:</strong><br/>\n<br/>\nI assume you talk about PvM and not PvP here.<br/>\nAs for spellswords; it is hard to get any better than AB +40, but try to get as close as possible.<br/>\nClerics are a spacial case, because they can easily buff the AB to the cap.<br/>\nBards have a great AB boost from the songs and taunt.<br/>\nPaladins can live with a little lower AB because of their spells. That gives room for some charisma.<br/>\nStealth characters that hit flat footed creatures generally have a lower AC to beat.<br/>\nWeaponmasters should have very high AB, not only to hit ther target. They have an extended critical threat trange and want to hit with rolls within that range, I mean what use is a range from 12 to 20 if you only are able to hit on 18 or better. They also want a high AB to be able to confirm their critical threats so they actually land critical hits.<br/>\netc.etc...</div></blockquote>\nAchieving such goals such as a level 40 base AB of 40 or more does require a degree of focus, which is the purpose of this guide.<br/>\n<br/>\nI will now go through each of the following to discuss how AB can be optimised with each method (BAB, Feats and Base Ability Scores)<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Maximising the The Base Attack Bonus (BAB)</span></strong><br/>\nThe Base Attack Bonus is determined by the base attack bonus of the classes in question, up and including to level 20 (also known as 'pre-epic'), then +1 BAB every odd level starting from level 21 up to level 40. So the only controllable factor is the BAB of the classes involved up to level 20. <br/>\n<br/>\nBAB is added to characters up to level 20 in the following way:<br/>\n<br/>\nFull BAB or combat classes (fighter, barbarian, paladin, ranger, blackguard, champion of torm, dwarven defender, weapon master, arcane archer, purple dragon knight) obtain 1 BAB / level pre-epic<br/>\n<br/>\n3/4 BAB classes or middle classes (rogue, monk, bard, cleric, druid, assassin, shadow dancer etc) obtain 1 BAB / level except the first level every four levels. This means BAB is not gained at level 1, 5, 9, 13 and 17, pre-epic, but gained at other levels.<br/>\n<br/>\nIe. the first level of a middle class taken pre-epic means 1 BAB is not gained, the next three levels of that middle class gains 1 BAB / level, then the next 1 level does not gain 1 BAB etc etc. <br/>\n<br/>\nThese rules only apply to individual classes. So a Rogue 2 / Monk 1 / Cleric 1 would have a BAB of 1 (not gaining 3 BAB with Rogue 1 Cleric 1 and Monk 1), whereas a Rogue 4 would have a BAB of 3 (not gaining 1BAB with Rogue 1). All things equal, this is a 10% chance to hit and crit between those two builds.<br/>\n<br/>\n1/2 BAB classes or non-combat classes (wizard, sorcerer, palemaster) gains 1 BAB every second level. So a Wizard 2 and a Wizard 3 both have a BAB of 1, as Wizard 1 and Wizard 3 do not gain BAB.<br/>\n<br/>\nThe pre-epic split, of the first 20 levels is the most important factor in determining BAB. <br/>\n<br/>\nIn general, maximising the amount of Full BAB classes pre-epic maximises the ultimate BAB and AB. However sometimes this is not always ideal. <br/>\n<br/>\nFor example, a player may want to make a Fighter / Bard / Red Dragon Disciple, but not want to take more than 6 levels of fighter and not more than 10 levels of Red Dragon Disciple (RDD). In addition, that player may want to access bonus feats granted by the fighter class which are only available in Epic levels, such as Epic Weapon Specialisation. <br/>\n<br/>\nTherefore to maximise BAB with a Fighter 6 / Bard 24 / RDD 10 build, the best BAB achievable is 26, which is achieved by:<br/>\n<br/>\n- taking Fighter 4 / Bard 12 / RDD 4 or Fighter 5 / Bard 11 / RDD 4 or Fighter 5 / Bard 12 / RDD 3 pre-epic (up to level 20) to obtain a pre-epic BAB of 16<br/>\n- other classes at other levels for +10 AB over 20 levels regardless of classes chosen, to get to 26.<br/>\n<br/>\nMaking a build where the pre-epic class split is Fighter 4 / Bard 6 / RDD 10 is tempting to access the enormous +8 strength bonuses of the class but the eventual pre-epic BAB will be 15 (not gaining BAB with Bard 1, 5 and RDD 1, 5 and 9), therefore losing AB long-term, and also the character doing one less attack per round permanently.<br/>\n<br/>\nIf I take another example, say a Fighter 24 / Bard 6 / RDD 10 build, to maximise BAB, one will want to take Fighter 20 pre-epic to obtain a pre-epic BAB of 20 and eventual level 40 BAB of 30. <br/>\n<br/>\nHowever for game play reasons that player may want a few Bard levels pre-epic for say, skill dumps into Tumble, Perform and Spellcraft and to use Bard Song for a party. In this case a Fighter 17 / Bard 3 split with total levels of 20 would obtain a pre-epic BAB of 19 and eventual level 40 BAB of 29 which is not far off a BAB of 30. Such sacrifices are legitimate, they preserve the character of the build in the first 20 levels, and lets face it, the first 20 levels is more than half the module in many cases (for example HoTU goes to level 28, and Aielund goes to 36-38).<br/>\n<br/>\nWhat would lead to the lowest AB however, is to try to take a Fighter 5 / Bard 5 / RDD 10 split pre-epic which would lead to a pre-epic BAB of 25 (by not gaining BAB with Bard 1, Bard 5, RDD 1, RDD 5 and RDD 9), and also losing one attack per round permanently.<br/>\n<br/>\nAs one can see changing the pre-epic split of a class can greatly alter the ultimate power of a build by up to 5 BAB in these examples which is essentially a 25% reduction in the chance to hit and crit as well as losing one attack per round. So understanding the mechanics how the pre-epic split works is important in maximising BAB and eventual AB for a level 20+ build.<br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Increasing AB through feats</span></strong><br/>\nCertain feats add to AB. To maximise AB one should generally try to fit as many AB increasing feats as practical into builds. There may be trade offs for this, so it is important to consider the trade-offs carefully.<br/>\n<br/>\nSmall races (halfling, gnome) gain 1AB through the small stature feat, but lose 2 base strength. Therefore, if one doesnt take into account weapon size/dual wielding, overall AB for these races is the same as other races for strength builds and better for dexterity and wisdom based zen archers. Therefore small stature is a consideration when maximising AB in dexterity and Zen archer builds.<br/>\n<br/>\nDwarves have attack bonuses against goblins and orcs. In certain environments this is quite favourable and will increase damage output. <br/>\n<br/>\nAll classes have access to the weapon focus, epic weapon focus and epic prowess feats. Taking these feats adds up to 4AB, or +20% chance to hit and crit.<br/>\n<br/>\nSpecial classes have special feats which can increase the AB further. These classes are: <br/>\n- Weapon Master (superior weapon focus, melee weapons only, up to +7 AB at level 28) and <br/>\n- Arcane Archer (bows only, enchant arrow up to +15 AB at level 29). <br/>\n<br/>\nSuch bonuses are maximised by a large investment in the class, for example a Fighter 12 / Rogue 3 / Weapon Master 25 for could get +6 AB from superior weapon focus and +4 AB from other feats, whereas a Fighter 30 / Rogue 3 / Weapon Master 7 would only gain +1 AB from superior weapon focus and +4 AB from other feats.<br/>\n<br/>\nRangers have the Bane of Enemies feat which can be obtained from Ranger 21 onwards, which adds +2 to AB and +2d6 damage against favored enemies. Druids have the Nature's Sense feat obtained for free which grants +2 AB when fighting outdoors. Paladins, Champions of Torm and Blackguards have the Smite Evil feat which can increase AB situationally when using it, by adding the character's charisma modifier to the Smite attempt. Disarm and Improved Disarm can situationally increase AB when the player's weapon size is considerably larger than the opponents (for example, a large weapon such as a great sword, attempting to disarm a dagger wielder would gain +8 AB). The Point Blank Shot feat can situationally increase AB by +1 and removes the -4AB penalty at short range for ranged characters.<br/>\n<br/>\nMelee Dexterity Builds will require the Weapon Finesse feat to use their Dexterity score (if its dexterity modifier is higher than their strength modifier) to determine their melee AB. Ranged Wisdom Builds will require the Zen Archery feat to use their Wisdom score to determine their ranged AB.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Maximising AB through ability scores</span></strong><br/>\nEssentially three ability scores can contribute to AB. These are: <br/>\n- Strength (melee only), <br/>\n- Dexterity (ranged, melee with the Weapon Finesse feat) and <br/>\n- Wisdom (ranged only with the Zen Archery feat). <br/>\n<br/>\nCharisma based smiters can also add their charisma modifier when smiting enemies with Smite Evil or Smite Good, but I am choosing to not focus on these, as this is situational AB only, and their AB can be increased through Strength or Dexterity.<br/>\n<br/>\nTo maximise AB through ability scores, one should aim to get an even ending base ability score as high as practical whilst maintaining appropriate balance to ensure a build is enjoyable to play in terms of defense, damage and other features. <br/>\n<br/>\nThis is achieved in the following ways:<br/>\n- race choice (half-orc for Str, halfling/elf for Dex)- class choice (ie RDD for up to +8 extra base Str)<br/>\n- starting stats (up to 18 for all classes except the above examples who can go up to 20)<br/>\n- stat gain via leveling (up to +10 to level 40)<br/>\n- stat gain through epic feats (Great Strength, Great Dexterity and Great Wisdom), or classes (such as up to +8 Str from RDD)<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Racial Choices to maximise ability scores</span></strong><br/>\nRacial choices to increase Str or Dex have costs associated with them. Half-orc suffers from -2 Int and -2 Cha, Elf -2 Con and Halfling -2 Str. <br/>\n<br/>\nAs a result Half-orc is actually not the most powerful race for Str builds due to overall balance issues which I mentioned before, is important to assist with making playable and enjoyable builds. The +2 Str is offset by losing 4 stats points elsewhere, most notably Int, meaning Half-orc requires significant investment to access combat feats such as Improved Knockdown, Expertise and Improved Disarm, to have adequate skill points, and to access the Weapon Master class (which requires both Dex 13 and Int 13 as pre-requisites). <br/>\n<br/>\nI believe Dwarves (who get +2 con and situational AB bonuses, fighter as a favored class) are usually the strongest strength builds where the charisma score and skill points are not important. All strength melee builds will benefit from the extra health and fortitude save from constitution to allow them to fight for longer periods, it helps with accessing feats such as Epic Damage Reduction (which requires a constitution score of 21), and the situational bonuses and extra saves against spells are quite handy. Fighter is also very attractive to take as either a major or minor class for bonus feats, weapon/armor proficiencies feats and weapon specialisation/epic weapon specialisation feats.<br/>\n<br/>\nI think Humans are the most powerful with Str builds where charisma is important (ie. Paladin) and/or other factors are useful such as skill points are needed, feats are limited (for example, non-fighter combat builds) or multiclass penalties need to be minimised or avoided. <br/>\n<br/>\nOther races are still useful for strength builds, even Gnomes with a -2 Str penalty, they can wield scimitars or rapiers in two hands for additional strength damage whilst using the largest critical hit range weapon in the game and equalising up for the AB lost from a lower Str score with the small stature feat.<br/>\n<br/>\nHalflings are probably the most powerful race for Dex builds where tiny weapons are dual wielded (daggers, kukri) or shortbows/slings used due to the AB bonus from small stature. However they cannot dual wield small weapons without AB penalties (such as shortswords and kamas) and cannot wield large weapons such as Heavy Crossbows or Longbows.<br/>\n<br/>\nI think Elves are strongest for Dex builds when small weapons (ie. Kamas, shortswords) are dual wielded as they are normal sized there are no AB penalties. Also where medium sized finessable weapons (ie. Rapier) are used with a shield, longbows or heavy crossbows are used, or access to the Arcane Archer class is desired. <br/>\n<br/>\nHumans are good when skill points are needed or multiclass penalties need to be minimised. Gnome gets a AB bonus from small stature.<br/>\n<br/>\nAll races can become strong Zen archers. Humans are a strong choice due to clerics and druids not being a favored class for most races, and their bonuses generally exceed that of half-elf, unless Arcane Archer is desired. Halfling and gnome get AB bonuses from small stature.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Starting stats, stat gain via leveling and stat gain through epic feats</span></strong><br/>\nThe stat which determines the characters AB ideally should be maximised. I would recommend a starting Strength, Dexterity or Wisdom score of 16 to 18 in the stat that contributes to AB. <br/>\n<br/>\nThe exact stat score one starts on depends on: <br/>\n- how 'multiple attribute dependant' a build is, <br/>\n- whether the total stat gain over the life of the build from stat gain from leveling and number of Great Strength/Great Dexterity/Great Wisdom feats one is able to include ends on a odd (ie. +17) or even number (ie +16), this is because one wishes an ending stat score (stating stat score + gains) to be even. <br/>\n<br/>\nA minimally attribute dependant build would be a sword and shield strength fighter. Such a build could quite happily start with a starting Strength Score of 18, as that fighter's most important stats are Strength, Constitution, and Intelligence (to access Improved Knockdown and other feats), and other stats such as Dexterity, Wisdom and Charisma could be set to 8. <br/>\n<br/>\nA strength melee based sword and shield fighter / cleric / rogue build would need to spread their stats across strength, constitution, wisdom, intelligence (charisma is optional) meaning only dexterity and charisma can be set to 8. In such a build, a starting strength of 16 might be optimal to allow investment in other stats.<br/>\n<br/>\nAt the extreme a dual wielding strength/charisma Paladin/Rogue/Monk cannot afford an ultra high strength score, as every stat is important to that build (Strength for damage/AB, Dexterity to access improved two weapon fighting, Constitution for HP, Wisdom to cast paladin spells/Monk Wis AC, Intelligence for rogue skills, Charisma for saves/divine damage from divine might). A starting score of 14 for every stat could even be considered in this case. It would be fair to argue such a build is spread too thin across too many domains, except perhaps in very high magic environments where all these stats could be maximised with ease.<br/>\n<br/>\nAttribute modifiers advance at even numbers of attribute scores. So a Strength of 16 has an attribute modifier of 3, Strength of 17 has an attribute modifier of 3 and Strength of 18 has an attribute modifier of 4. In AB terms, there is no difference between Str 16 and Str 17, only a boost to weight carrying capacity. If the stats gained over the lifetime of a build finish on an odd number (for example, +10 Str from regular stat gains and +7 Str from seven Great Strength feats), then the optimal starting strength would actually be 17, and another stat could be boosted (for example, constitution for health, or intelligence for skill points). If they finish on an even number (for example a pure cleric zen archer with +10 Wis from regular stat gains and +10 Wis from ten Great wisdom feats) then ideally the starting stat should start on an even number.<br/>\n<br/>\n<strong>Great Strength, Great Dexterity and Great Wisdom Feats</strong><br/>\nMaximising stat gains through epic feats requires an understanding of what feats are desirable in a build, and making an effort to take these feats as pre-epic feats, or bonus epic feats as much as possible. This is particularly true for strength builds, as no class can take Great Strength as a bonus epic feat. An understanding of what classes can take what feats, particularly epic feats, as bonus feats is very valuable. <br/>\n<br/>\nThe following is a generalisation and only my opinion. All combat builds will generally want to take Weapon Focus, Blind Fight, Epic Weapon Focus and Epic Prowess to obtain +4AB. Melee builds will additionally want at least Knockdown. Melee strength builds will want Armor Skin unless they have Tumble as a class skill, or they play in a high magic environment. Ranged builds will want Rapid Shot and Called Shot. Zen archers will require the Zen Archery feat. <br/>\n<br/>\nAll of these feats discussed except Epic Weapon Focus, Epic Prowess and Armor Skin can be taken pre-epic. Finding ways to fit these feats into builds as epic bonus feats, particularly for strength builds, is very valuble. <br/>\n<br/>\nThe classes that can take these three feats (Epic Weapon Focus, Epic Prowess and Armor Skin) as bonus feats include:<br/>\n- Fighter<br/>\n- Paladin<br/>\n- Barbarian<br/>\n- Champion of Torm<br/>\n- Blackguard<br/>\n- Dwarven Defender<br/>\n- Weapon Master<br/>\n<br/>\nClasses that can take some of these feats as bonus feats include:<br/>\n- Arcane Archer<br/>\n- Ranger<br/>\n- Red Dragon Disciple<br/>\n- Cleric<br/>\n- Monk<br/>\n<br/>\nIn addition one should consider other features such as whether Devastating Critical is taken, Epic Damage Reduction, Epic Energy Resistance, Epic Dodge, Epic Weapon Specialisation, Epic Spell Foci and Epic Skill Foci, and how such feats can ideally be taken as bonus feats whilst preserving the epic general feats for attribute increases to maximise AB. <br/>\n<br/>\nFor example, Fighters, Paladins, Champions of Torm, Blackguards, Dwarven Defenders and Arcane Archers can take Overwhelming and Devastating Critical as bonus feats. By taking such feats as bonus feats, it frees up general feats which can be used to maximise the number of Great Strengths possible and the resultant AB.<br/>\n<br/>\nDexterity and Wisdom based builds have the added luxury of being able to take Great Dexterity or Great Wisdom feats as bonus feats. The classes that can do this are:<br/>\n<br/>\n- Arcane Archer (Great Dexterity)<br/>\n- Assassin (Great Dexterity)<br/>\n- Bard (Great Dexterity/Great Charisma)<br/>\n- Harper Scout (Great Dexterity/Great Charisma)<br/>\n- Champion of Torm (Great Wisdom)<br/>\n- Cleric (Great Wisdom)<br/>\n- Druid (Great Wisdom)<br/>\n- Shifter (Great Wisdom)<br/>\n<br/>\n<strong>Red Dragon Disciples</strong><br/>\nRed Dragon Disciples provide up to +8 strength with 10 levels along with a whole host of other abilities, and as such are one of the most powerful classes to assist strength builds to maximise their AB (along with Weapon Master).<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Sample build where AB is maximised very well</span></strong><br/>\nAs mentioned at the beginning, Mithdradates wrote advice to TyrTemplar on TyrTemplar's first build posted in the ECB forum, and I understand both worked together to make quite a large number of very strong builds over a number of years.<br/>\n<br/>\nThe example I've chosen is a very lovely build TyrTemplar wrote called <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build255434.html\" rel=\"noreferrer\" target=\"_blank\">The Dark Prince (The Impaler) Dev Crit Version</a> (Fighter 8 / Rogue 10 / Blackguard 22). <br/>\n<br/>\nIt features a BAB of 29, Base AB of 45, takes seven Great Strengths (every epic general feat was a Great Strength), and has a whole bunch of goodies including Blind Fight, Improved Knockdown, WF/EWF/EP, WS/EWS and Devastating Critical. <br/>\n<br/>\nIt is also balanced by having over 400hp, and over 200 skill points including rogue class to access Tumble and UMD as class skills.<br/>\n<br/>\nBy taking all epic feats as bonus feats, TyrTemplar was able to take the maximum strength gain possible with this class combination (+17), which when added to a starting strength of 17, meant the build's final strength modifier was the highest possible (+12) for the class combinations. By taking three rogue levels pre-epic TyrTemplar was able to retain the build's character early on at the cost of only 1 BAB and adding some roguish skills, and being able to take a fighter epic bonus feat immediately with one level of fighter at epic levels.<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Finally...</span></strong><br/>\nThanks for reading this guide. Hope you got something out of it and hope it helps with your building!<br/>\n<br/>\nPlease feel welcome to write comments, I am constantly looking at ways to improve and learn NWN is a very complex environment and even taking such a small topic, to do it justice has actually taken quite a bit of thought! <br/>\n<br/>\nWriting is a challenging skill and writing guides does take some time too! And if I can do that better too it would be much appreciated!<br/>\n<br/>\n<br/>\n<strong>Edit 1 16/10/2019: </strong>added Stagmeister's suggestions<br/>\n<strong>Edit 2 17/10/2019:</strong> added Empyre65 and Mick Dagger's suggestions<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:29 AM - Oct 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">\"<em>Please feel welcome to write comments, I am constantly looking at ways to improve and learn NWN</em>\"<br/>\n<br/>\nVery good, continue like that...<br/>\nIn my building time I was reading every site there is, including PvP NwN forums but also low &amp; high-magic.<br/>\nFor example, NwNKnights was a PvP 1-20 level PW that had many nice builds &amp; most importantly, tactics that you won't see mentioned often if at all. <br/>\nAnother example was \"Antiworld\" another PvP server but with little modifications to the base NwN engine (which is what I'm looking for). <br/>\nFrom recent PWs, Sword Coast has a nice forum with builds for a relative high-magic environment, you'll see new ways of thinking there, like \"Ews, is it useful?\", because the bonus a small in comparison to the weapon buffs, etc. <br/>\nIn the opposite direction, you have PWs like Ravenloft, Prisoners of the Mist (awesome server, btw) a low-magic 1-20 level PW that oozes with atmosphere &amp; entirely new building environment there, same thing goes for \"Thay\" &amp; a number of other such PWs. <br/>\nThere are other worlds of course that change too many things (Arelith) in the name of balance or role-playing, something that isn't necessary in my opinion but whatever...<br/>\nPoint is, you have to take knowledge whenever you can, if that means you'll need to \"scout\" for it, so be it. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:08 PM - Oct 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A pretty comprehensive Guide, Orion, well done!<br/>\n<br/>\nJust to prove I've read it, I've a few wee suggestions/thoughts for possible inclusion, if that's okay?<br/>\n<br/>\ni) In the Maximizing the BAB section, CoT is also a full BAB class.<br/>\nii) In the Increasing AB through Feats section, it might be worth mentioning Weapon Finesse for dexers and Bane of Enemies for Rangers.<br/>\niii) When talking about AB and APR, there could be mention of Monk progression and keeping Cleric to a pre-epic BAB of 15 or under, if that could be easily done and without distracting too much from the essence.<br/>\n<br/>\nJust thoughts. Thanks for the read!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:41 PM - Oct 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You might want to also mention that in epic levels, the BAB increases on every odd level, no matter what classes you take.  Thia knowledge doesn't help maximize your AB, but it still pertinent to a discussion of AB, and it is nice to know.<br/>\n<br/>\n<span style=\"font-size:75%;line-height:normal\">Edit: Corrected where I said AC when I meant AB.</span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:05 PM - Oct 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A comprehensive and very good guide!<br/>\nI like the way you rewrite the \"rule of 4\", pointing out the critical levels of the 3/4 and 1/2 BAB classes and when they get +0 and +1 BAB pre epic. For beginners it may sound odd that in some cases adding a level of wizard can give a BAB increase when adding a level of a 3/4 class does not. When I review a build, I usually count those +0 BAB levels and subtract their number from 20. That is the quickest way for me to spot pre epic BAB.<br/>\nAPR is related to BAB, even if there are other factors at work too. I agree with mentioning monk progression. Explaining the grouping of attacks in flurries is related to APR, but maybe that is branching it out too much.<br/>\nYou can add Harper scout to the list, it can take both great charisma and great dexterity with its bonus feats in epic levels. And you can add Point blank shot to the AB enhancing feats.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "10:22 PM - Oct 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have yet to fully read the guide, as the section \"Starting stats, stat gain via leveling and stat gain through epic feats\" engrossed me.<br/>\n<br/>\nThank you for this guide!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:48 PM - Oct 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">On Ranger's Bane of Enemies: +2AB &amp; 2D6 + (Ranger level/5, +1). <br/>\nFor example: 35th level Ranger: +2AB &amp; 2D6 +8 Dmg versus FE's.<br/>\n<br/>\nThere is also flanking for a situational +2AB (with an animal companion, epic vrock, epic shadowlord, etc.) &amp; Taunt for up to +6AB, of course. <br/>\nAlso, inside Time Stop, you practically have infinite AB, opponents can't defend against you &amp; they lose all tumble, dexterity &amp; shield adjustments. <br/>\n<br/>\nLastly, if you plan your build correctly, you can cram an incredible amount of stuff inside &amp; still have a respectable AB.<br/>\nCase in point, a warrior with 600 hp's &amp; EDR 3, EWS &amp; Dev Crit, Crippling Strike &amp; Evasion, full tumble &amp; UMD, with all saves &gt;26, that's also a deadly trapper, can have 42AB (30STR/ 21CON).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:18 PM - Oct 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just because I can ask, I will. Let's see what the Dev Crit DC is for that build, Valerfor? No point having it if it's never going to land, or only land on mobs. Actually, that's probably a topic for a discussion in itself. Clearly, if Dev Crit is disabled/ nerfed wherever you're playing, then that's one thing, but I'm interested - given the amount of feat investment entailed - at what stage is Dev Crit more expensive than it's useful? Anyway, for elsewhere...<br/>\n<br/>\nOh, I do love mucking about with stuff!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:03 AM - Oct 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"17338\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17338&amp;sid=0500d51db9dbcd6d8c70c58a27dd7a89#p17338\">↑</a><div class=\"responsive-hide\">Oct 16, 2019</div></cite>Just because I can ask, I will. Let's see what the Dev Crit DC is for that build, Valerfor? No point having it if it's never going to land, or only land on mobs. <br/>\n<strong>Dev Crit DC= 40 (46) &amp; I bet it's gonna land on quite a few of them!<br/>\n</strong><br/>\nOh, I do love mucking about with stuff!<br/>\n<strong>Who doesn't? </strong><img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /></div></blockquote><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:35 AM - Oct 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Top banana - thanks big V!<br/>\n<br/>\nStill might bring this up as a topic somewhere - Dev Crit is always held up as almost an apotheosis for STR builds, much as Epic Dodge is for Dexers, so should probably be drilled into a bit more.<br/>\n<br/>\nCheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "4:11 AM - Jul 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I now wonder, what is adequate AC in a lvl 40 playing environment? And what’s the highest useless AC?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:16 AM - Jul 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>darktooth wrote: <a data-post-id=\"21263\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21263&amp;sid=0d8dd010ca0ad83c9c6cbab779fd971f#p21263\">↑</a><div class=\"responsive-hide\">Jul 16, 2020</div></cite>I now wonder, what is adequate AC in a lvl 40 playing environment? And what’s the highest useless AC?</div></blockquote>\nI think this is a good question.<br/>\nMy answer is it depends on the environment.<br/>\n<br/>\nSome environments AC is important.<br/>\nFor example, when I started playing World of Greyhawk, Knight_ofLimbo taught me about a Character Level +20 approximate formula.<br/>\nSo a level 30 character should aim for 50 AC, a level 40 character 60 AC for AC to be useful. Not hard and fast but approximate.<br/>\n<br/>\nOther environments I hear AC is completely irrelevant as the enemies AB is so high there is no way anyone can get enough AC.<br/>\nIn these environments, damage reduction (or 'soak'), damage resistance (ie. greater swordsman's belts), critical hit/sneak immunity (ie. palemaster 10+, equipment), concealment (ie. 50% concealment from improved invisibility) and epic dodge (a feat for dexterity builds) are more important. Epic Damage Reduction I-III, Barbarian Damage Reduction and Dwarven Defender Damage Reduction are considered sources of damage resistance, are additive with each other and equipment providing damage resistance.<br/>\n<br/>\nOr AC could be so completely overpowered that nothing will hit you anyway, except on a 20 roll. So it helps to look at the attack rolls in the log in your environment to see how much AC you want to have in a particular moment. If an enemy has AB of 20 attacking you with a flanking attack, then an AC of 40+ (41+ on hardcore or higher where critical hits are possible) will mean they cannot hit you except on a 20, and boosting AC further is probably not necessary against that particular enemy.<br/>\n<br/>\nFrom a building perspective, I tend to look at a strength warrior wearing full plate and using a tower shield, with Dex 12 (either base or buffed), with Tumble 20 crossclassed and armor skin as a baseline. This would have a mundane AC of 10 + 8 + 3 + 1 + 4 + 2 = 28. In a +5 environment this would be 53 AC (from +5 armor, shield, deflection, natural and dodge). AC could be considered low if it goes below mundane 28, and adequate (or high) if it goes above. The factors mentioned previously should be considered too (ie damage resistance, concealment) as well as UMD to supply additional AC, soak and concealment.<br/>\n<br/>\nOther builders might have other viewpoints. I don't think there is any right or wrong here. <br/>\nCertain classes get enormous boosts to AC. Palemaster (up to +16) and RDD (up to +8) are good examples. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}