{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "226",
  "name": "Whip master?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/whip-master-t2354429.html",
  "author": "campgod",
  "avatar": "no_avatar.png",
  "replies": "7",
  "views": "4.3K",
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "12:26 AM - May 09, 2015",
      "content": "<div>Hello all, I was thinking of a whip master build and was hoping you guys could help me out a bit? On the server i play on I can duel wield whips and was wanting to make a whip master sort of a toon.<br/>\n The whips damage looks super weak, how can I make it worth while? I am guessing it would have to be some sort of Dex with SA or DA attack to make it worth it? Any ideas?<br/>\n (PvP, lvl 40) I have no preferences on class/race or Str/Dex build. thanks for your time</div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "4:25 AM - May 09, 2015",
      "content": "<div>There is this build by Avado in the search engine<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build206145.html\" rel=\"noreferrer\" target=\"_blank\">Dwarf Assassin Whip Master</a><br/>\n<br/>\n It's not dual wield and it takes a couple of ISA feats which as i understand don't work with Assassin Death Attack but it may be worth a look.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:19 PM - May 09, 2015",
      "content": "<div>I know when a player is bored (or had too much nwn) - they start making whipmasters ;-)<br/>\n<br/>\n More seriously now, a whipmaster is the same as any other build with dual-wield, only he has worse stats because the weapon is crap. Take for example mick's dual-wield kukri weapon master and just replace kukri(s) with whip(s).</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "3:17 AM - May 11, 2015",
      "content": "<div>LOL, great ty guys. So Val, is it really a waste of time you think?<br/>\n  </div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:36 AM - May 11, 2015",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/> Take for example mick's dual-wield kukri weapon master and just replace kukri(s) with whip(s).</div></blockquote>\n\n No!<br/>\n I forbid that<br/>\n Lol</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "7:52 AM - May 11, 2015",
      "content": "<div>Unless it is a +10 Vorpal (DC-26) with +20 Divine damage, keen, hasted and +5 regenerating, it's only value is for free disarm.<br/>\n<br/>\n Which still makes it marginally better than the shuriken.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:35 AM - May 11, 2015",
      "content": "<div>Well, i am ashamed to admit that once i made a Barbarian with focus on Clubs. CEP 3.0 makes some additions to the textures of the weapons and you could have a club that was looking properly war-like (ehm) it looked like a baseball bat as others were saying. It was a great laugh, with the proper wooden round shield and all and somehow i managed to get him to forty level (with the help of my team). Now,  when you get to forty level in WoG you can ask the lead DM for your epic weapon (after you pay 2 mil gp) which is unique and personally crafted for your hero and all, so - long story -short, as other people were asking for bastard swords and greataxes and kukris, i asked for a club... The expression on the virtual face of the DM alone, was worth it i guess... But yeah, unless you really have a purpose with that weapon choice of yours, and you really enjoy  to play Zorro/Castlevania and the like, i guess it's one of the worst choices you could make, if not the absolute worse. Even a staff-master will be better.<br/>\n<br/>\n Have fun ;-)</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "6:30 PM - May 11, 2015",
      "content": "<div>LOL, ok. Yeah I have some cool looking whips in the bank...but yeah, not sure they will ever be used lol.</div>"
    }
  ]
}