{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "046",
  "name": "Devastating Critical: A Commentary",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/devastating-critical-a-commentary-t2355299.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:33 PM - Jan 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong>Devastating Critical: A Commentary</strong>\n<blockquote><div><cite>Stagmeister wrote:</cite>[Devastating Critical], it's the pinnacle of a strength-based build. But it's all about balance. Dexterous types have Epic Dodge as their summit, those squishy mages and their ilk (and yes, I'm including those supposedly holy types here) get an assortment of insta-death spells, this is just us grunts saying, \"see how you like it, sunshine.\"<br/>\n<br/>\nAnd even where it's not forbidden or nerfed, folk can defend against it. A good fortitude save is a start, but those casters have some nasty defences they can throw up, and it won't work as a first (ie most likely to hit) attack on a build with ED - and that's leaving aside crit-immune types. The list goes on...<br/>\n<br/>\nSpell-chuckers: whingers, the lot of 'em. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\nAnd that's the essence of my argument, Shia. I keep meaning to bring the whole thing about Dev Crit up on a thread in the General Discussion forum, but other things always seem to get in the way. Life, eh?</div></blockquote>\n<blockquote><div><cite>NWN Wiki wrote:</cite><ul>\n<li>This feat is often banned from online persistent world multiplayer servers as some consider it overpowered.</li>\n</ul>\n</div></blockquote>\n\nDevastating critical is considered the pinnacle of a strength-based build, on par with Epic Dodge for dexterity types, Dragon Shape for Druids &amp; Shifters, and Epic Mage Armor / Epic Warding for Mages.<br/>\n<br/>\nThere are some downsides to devastating critical however. Here is a brief discussion and some tips. <br/>\n<br/>\nSome of this is simply my opinion and can be subject to further debate in the thread.<br/>\n<br/>\n<strong>Pre-requisites</strong><br/>\n<br/>\nStrength 25+<br/>\nPower Attack<br/>\nCleave<br/>\nGreat Cleave<br/>\nImproved Critical [both melee and ranged weapons]<br/>\nOverwhelming Critical<br/>\n<br/>\nA level of monk will save only one feat (cleave) as power attack is required to be taken to obtain great cleave.<br/>\n<br/>\n<strong>Recommended</strong><br/>\n<br/>\nBase AB 40+ (at level 40)<br/>\nWeapon with 18-20 or 19-20 threat range <br/>\n- 15-20 / 17-20 with improved critical, 12-20 / 15-20 with keen<br/>\n<br/>\nBase Strength 28+ (for base Str 40 when capped) -&gt; Fort save 39-45 or die at level 40<br/>\n<br/>\n<strong>Likely base fortitude saves of opponents at level 40</strong><br/>\n<br/>\nHigh save: 22 + cons modifier + save feats<br/>\nLow save 12 + cons modifier + save feats<br/>\n<br/>\n(pre-epic multiclassing ie Fighter/Cleric can modify this slightly, also module designers/DMs can modify this as well)<br/>\n<br/>\n<strong>Mechanics</strong><br/>\n<br/>\nAny opponent who receives a critical hit must make a fortitude save or die.<br/>\nThe DC is 10 + 1/2 attacker character level + strength modifier.<br/>\nAn opponent rolling a 1 will fail the fortitude save roll and die.<br/>\n<br/>\n<strong>Landing critical hits</strong><br/>\n<br/>\nThe attack roll firstly needs to land in the threat range.<br/>\nThe attack must hit. <br/>\nConcealment (ie 50% from improved invisibility) must be beaten. <br/>\nThe attack roll has to either be a 20, or the attack roll plus the attack bonus plus modifiers (ie +2 AB from flanking) beating the opponents AC.<br/>\nA threat roll will then occur. The threat roll plus AB plus modifiers must beat the opponents AC. Rolling a 20 with a threat roll will not lead to a critical hit, if the AC is not beaten.<br/>\nThe opponent must be susceptible to critical hits. Critical immune enemies (palemaster level 10 or higher, undead) will not receive a critical hit.<br/>\n<br/>\n<strong>Countering devastating critical</strong><br/>\n<br/>\nCritical hit immunity from Palemaster (or items from your environment)<br/>\nCritical hit immunity from extremely high AC<br/>\n- important to note a character will lose all their dexterity AC (unless they have uncanny dodge), dodge AC and tumble AC if they are flatfooted, always make sure you are doing something in combat<br/>\nHigh fortitude saves (will not prevent a '1' roll which is an automatic fail)<br/>\nEpic dodge to remove the first attack, which is the most likely to critical hit<br/>\n<br/>\nRanged weaponry (if they are melee)<br/>\nBigby's hand spells, if you can beat their spell resistance<br/>\nDeath armor/Elemental Shield/Mestil's Acid Sheath/Wounding Whispers then Shapechange -&gt; Iron Golem<br/>\nCritical immune summons (elementals, undead) to tank<br/>\nLots of stacked traps<br/>\n<br/>\nLet other party members deal with the problem<br/>\n<br/>\n<strong>When to take devastating critical in strength builds</strong><br/>\n<br/>\nIf you have adequate AB (base 40+ if possible)<br/>\nIf you have enough feats (6 feats is a large investment)<br/>\n<br/>\n<strong>Is it overpowered?</strong><br/>\n<br/>\nDefinitely<br/>\n<br/>\n<strong>Are other things overpowered?</strong><br/>\n<br/>\nDefinitely<br/>\n<br/>\n(eg. in a non rest restricted environment, a wizard/cleric can simply cast haste or drink a potion of speed, cast Greater Sanctuary, then cast Wail of the banshee / Implosion then Greater Sanctuary in one round. Repeat until you run out of spells, then rest again. Unlimited death dealing. )<br/>\n<br/>\n<strong>Should it be nerfed?</strong><br/>\n<br/>\nProbably not, give those beefcakes some fun.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:41 AM - Jan 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The main problem with enabling Dev Crit is that the entire server/environment needs to be balanced around it.<br/>\n<br/>\nFor PvM, any major mobs will need either high fortitude saves (making DC casters less effective) or immunity to critical hits (which affects most non-casters). Higher AC isn't an effective counter for PvM since raising mob AC will negatively affect most non-casters. Even if mob saves are high enough to resist Dev Crit, unless the server has changed 1's to not cause auto-fails then eventually a Dev Crit will trigger and kill anything that isn't immune to critical hits. This means that for big bosses to actually be threatening the only choices are to remove auto-fails, make them all immune to critical hits, or edit/remove Dev Crit.<br/>\n<br/>\nMost PvP environments nerf Dev Crit but they usually nerf other OP feats and spells too. Altering or removing Dev Crit, Epic Warding, Greater Sanctuary, Harm/Heal, HiPS, IGMS, Time Stop, and True Seeing are usually among the first changes PvP servers make due to how unbalanced they are in vanilla NWN.<br/>\n<br/>\nA human Figh14/WM25/Bard1 dual-wielding kukris is a fairly simple build that shows how powerful Dev Crit can be. In addition to high AB, high damage, and UMD, with +12 STR it also has a 48 DC Dev Crit and a 13-20 threat range (10-20 with keened kukris). A maxed Implosion can be cast twice a round and has a 48 DC, the main difference being Spellcraft boosts saves against Implosion so Dev Crit is harder to resist.<br/>\n<br/>\nHere is a list of the average number of critical hits per round from the build for the important AC range.<br/>\n<iframe allowfullscreen=\"\" data-s9e-mediaembed=\"imgur\" onload=\"var c=new MessageChannel;c.port1.onmessage=function(e){var d=e.data.split(' ');style.height=d[0]+'px';style.width=d[1]+'px'};contentWindow.postMessage('s9e:init','https://s9e.github.io',[c.port2])\" scrolling=\"no\" src=\"https://s9e.github.io/iframe/2/imgur.min.html#ZZiI24T\" style=\"border:0;height:400px;max-width:100%;width:542px\"></iframe><br/>\nThe key is \"Ha_Ke\" = hasted + keened kukris, \"Ha_NK\" = hasted + non-keened kukris, \"NH_Ke\" = non-hasted + keened kukris, \"NH_NK\" = non-hasted + non-keened kukris.<br/>\nThis assumes +12 STR but only +0 weapons, if +X weapons are available in your environment then add X to the AC (eg. with +5 kukris the AC range is 46-85). Concealment and Epic Dodge aren't factored into this calculation, just AC.<br/>\n<br/>\nWhen hasted and using keened kukris, against creatures with 42 AC or less the build does an average of 3.85 critical hits per round. This decreases to 2.0725 against creatures with 61 AC, which is slightly better than the 2 per round from Implosion. This also shows why increasing AC isn't a viable tactic to deal with Dev Crit in PvM. In order to reduce the average number of critical hits per round to less than 1 a creature needs an AC of 67 (72 in a +5 EB environment), which seriously restricts the number of viable PvM builds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:24 AM - Jan 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>This means that for big bosses to actually be threatening the only choices are to remove auto-fails, make them all immune to critical hits, or edit/remove Dev Crit.</div></blockquote>\nWe really need a module designer or a DM to respond here :) <br/>\n<br/>\nHere are some extra ideas to counter the Dev Crit warrior you have made:<br/>\n<br/>\n-&gt; give the monster ITWF dev crit dual kukri as well with a fortitude score of 70<br/>\n-&gt; give the monster improved disarm, so those kukris are never in your hand<br/>\n-&gt; make the monster a huge rust monster so the kukris become rusted remains<br/>\n-&gt; give the monster so much AC that you will never crit<br/>\n<br/>\nOr just make the boss a permahasted mage with True Sight: <br/>\n- Time Stop / Mord / Time Stop / Bigby 9 then IGMS until the fighter is dead, bye bye fighter<br/>\n<br/>\nPretty sure I've encountered module AI's smart enough to cast bigby's on me regularly. <br/>\n<br/>\nBigbys is a nightmare. <br/>\n<br/>\nSuccessful Bigby's on a solo fighter = usually equals dead fighter.<br/>\n<br/>\nAlthough I understand a possible counter to this is to carry a few Mord's scrolls around to self-Mord yourself... only to get Bigby'ed again I guess...<br/>\n<br/>\nOr be a monk with extreme spell resistance as <em class=\"mention\">@webshaman1</em> and others have been investigating<br/>\n<br/>\n<br/>\nOn the topic of mages hehe, this is a reddit post you might find interesting:<br/>\n<br/>\n<br/>\n<iframe allowfullscreen=\"\" data-s9e-mediaembed=\"reddit\" onload=\"var c=new MessageChannel;c.port1.onmessage=function(e){style.height=e.data+'px'};contentWindow.postMessage('s9e:init','https://s9e.github.io',[c.port2])\" scrolling=\"no\" src=\"https://s9e.github.io/iframe/2/reddit.min.html#neverwinternights/comments/eejj11/playing_a_wizard_in_a_party_in_nwn_1/fcou31b\" style=\"border:0;height:165px;max-width:800px;width:100%\"></iframe><br/>\n<br/>\n<br/>\nAnyway I'm not going to pretend its overpowered, it is absolutely overpowered for sure!<br/>\n<br/>\nJust other stuff is overpowered too. <br/>\n<br/>\nAnd I'm cool with that :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:26 AM - Jan 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>-&gt; give the monster ITWF dev crit dual kukri as well with a fortitude score of 70<br/>\n -&gt; give the monster improved disarm, so those kukris are never in your hand<br/>\n-&gt; make the monster a huge rust monster so the kukris become rusted remains<br/>\n-&gt; give the monster so much AC that you will never crit<br/>\n<br/>\nOr just make the boss a permahasted mage with True Sight: <br/>\n- Time Stop / Mord / Time Stop / Bigby 9 then IGMS until the fighter is dead, bye bye fighter\n</div></blockquote>\n\nWe have all these on WoG, btw (not so sure about the Fort of 70 ;) ), and the Devver has no kukris.<br/>\n<br/>\nWe do not have Rustzilla yet, despite my best efforts.  But we do have...improved Rusty 2.0.  In hordes.<br/>\n<br/>\nThe main problem with Dev Crit is it threatens insta-bork on a 1.  Fail the save, and bam!  And since it can be threatened indefinitely (no charges, no spell slot limitations, etc), eventually that 1 is gonna roll.<br/>\n<br/>\nMake the AC too high, and no one is hitting the Boss, except with 20s.  Perhaps a dexxer, but no-one else.<br/>\n<br/>\nMaking immunity to crits available to everyone, and bleh.  Giving immunity to crits to every boss, m0b, and his uncle is also meh.  Congrats, you just made Rogues &amp; Co. very unhappy.<br/>\n<br/>\nImproved Disarm makes players howl \"Mah favorite [insert whatever it is that is so important] is GONE!!!  WTF!!!\"<br/>\n<br/>\nRusties are worse.  Rustzilla would make peeps avoid the area worse than they do The Ghost Tower of Inverness and the Deck of Hazards!<br/>\n<br/>\nDev Crit is very difficult to balance, and it is primarily one of the reasons it gets tossed.<br/>\n<br/>\nFor me personally, I prefer environments where it is active - provided that the builders have not gone totally insane with trying to \"proof\" everything against it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:42 AM - Jan 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">People choose what and how they approach balancing things.  DevCrit is one of those things that needs to be modified for PvP balance along with a broader list found above.  PVE is a different thing and balancing it is a little more flexible.<br/>\n<br/>\nIt is, very much, one of those key decisions that sets the tone (box) of a server.  As such it is an easy choice to drop letting other things set that tone.  WoG is the first server I have played on where it was not removed or modified.   Like most things ... some pros and some cons ... I like different boxes to play in though, it makes me try different things and refreshes my interest.  <br/>\n<br/>\nIt also makes me appreciate some of the builds touted as “best of breed” that have previously left me thinking WTF ...<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "torchlord1",
      "avatar": "no_avatar.png",
      "timestamp": "2:52 PM - Dec 26, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Making immunity to crits available to everyone, and bleh.  Giving immunity to crits to every boss, m0b, and his uncle is also meh.  Congrats, you just made Rogues &amp; Co. very unhappy.\n</div></blockquote>\nSomeone in AvlisNWN Discord posted that there is an option to enable Rogue Crits on EE. <br/>\n<table class=\"post_content_table\"><tbody><tr><td>NWNX_TWEAKS_SNEAK_ATTACK_IGNORE_CRIT_IMMUNITY</td>\n<td>true or false</td>\n<td>Allow sneakattacks on creatures that are immune to critical hits.</td>\n</tr>\n</tbody></table>\n<a class=\"postlink\" href=\"https://nwnxee.github.io/unified/dark/group__tweaks.html\" rel=\"noreferrer\" target=\"_blank\">NWNEE Tweeks</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}