{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "689",
  "name": "Arelith Inquiry - Paladin / CoT (+ Rogue or Bard?)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-inquiry-paladin-cot-rogue-or-bard-t2355349.html",
  "author": "a_wild_hedgehog",
  "avatar": "10759227_1581366274.png",
  "replies": 5,
  "posts": [
    {
      "author": "a_wild_hedgehog",
      "avatar": "10759227_1581366274.png",
      "timestamp": "9:14 PM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Howdy Guys!<br/>\n<br/>\nI've been lurking here for a while and appreciated how knowledgeable you guys are with the NWN engine. So, I wanted to get some insight from the experts here (Who were also, hopefully familiar with the Arelith PW server changes on classes, feats and skills) on what would be the most \"Optimal\" route so to speak in building out this Paladin CoT character I have in mind.<br/>\n<br/>\nFirst, I'll put the main split I was thinking of (Max level is 30):<br/>\n<br/>\nPaladin 17/CoT10/3 (Bard or Rogue)<br/>\n<br/>\nRequirements:<br/>\nMust be Human<br/>\nNeeds to use two-handed weapon (Greatsword)<br/>\nI'm avoiding use of WM intentionally- I want higher/consistent AB and Saves and not be as feat starved<br/>\nClasses must have 3 levels invested, minimum, and in order.<br/>\n<br/>\nI guess my biggest question is, how could I expect play with such a build to look? Would it be more worthwhile to invest in more Paladin, or in more CoT? One of the main reasons I have the bard/rogue at the end is for some of the skill investments to be made in Tumble and Lore (Which have an effect on the scrolls you can use). I feel thematically, Bard may make more sense near the end of the training journey as the Paladin/CoT is out there experiencing crazier adventures. I could get away with dipping into Rogue instead though, as he finds himself in more 'exotic' locations requiring a nuanced touch from dungeoneering. <br/>\n<br/>\nWhat would I be trading for levels in Rogue, versus Bard? What would I be trading for more CoT, or more Paladin? Should I go as much as possible in on Strength, or should I invest more on Charisma? Should I have a minimum amount of Charisma? What would you say are the optimal feats to take for PvE (and worse case scenario, PvP against evil characters)<br/>\n<br/>\nMy end-game goal is, I'd like for him to be one charismatic son-of-a-gun leader who can dish damage to evil using his Greatsword while living to tell the tale.<br/>\n<br/>\nAny insight is super appreciated! Thanks all.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:35 PM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I will offer more detailed advice later today when I am a little less pressed for time but I can answer one quickly now.<br/>\n<br/>\nRogue nets you evasion and uncanny dodge.  Bard is generally used because it is the only class that offers: Tumble, Discipline, UMD and Spellcraft.  Although, the newish Specialist Class was added specifically to remove the requirement for everyone to bard dip (for RP reasons this was often a stretch but mechanically so powerful it was difficult to dismiss and still compete).<br/>\n<br/>\nAlthough Discipline is less important these days with the customisations to the effects, this is why most builds contain Bard or a discipline class and rogue.<br/>\n<br/>\nIn this case, mechanically, the argument for rogue is massive.  Between Paladin and CoT saves, evasion becomes a core strength.  Likely a cornerstone of the build (evasion offers protection against the majority of single shot big damage things in the game).<br/>\n<br/>\nMeaning as a Paladin/CoT, there is no mechanical advantage to Bard over CoT (as a class dip, deeper investment in Bard offers something different).  RP, of course, is a different thing.  However, it is worth noting there is an NPC in the Radiant Heart who has an entire conversation around why Paladins make the best rogue types ;)<br/>\n<br/>\nI’ll offer more advice on Class composition later.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:39 PM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I’ll drop this here for your review:<br/>\n<br/>\n<br/>\n<a class=\"postlink\" href=\"https://docs.google.com/document/d/1jmfEt04BUm5ucG_suxUxHQ_ZRmJuxyKBPmkiXZpQ3OU/edit?usp=sharing\" rel=\"noreferrer\" target=\"_blank\">https://docs.google.com/document/d/1jmf ... sp=sharing</a><br/>\n<br/>\nNot a CoT build, but worth reviewing as it will give a decent example of a similar composition.<br/>\n<br/>\nSent from my iPhone using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "a_wild_hedgehog",
      "avatar": "10759227_1581366274.png",
      "timestamp": "9:45 PM - Feb 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you so much for the feedback (And speedy, too)!<br/>\n<br/>\nI'm checking out the sheet you provided- It looks great, and I'm, relieved to know I think I was on the right track more or less with the actual 'start' of the build (Starting stats, chosen gifts, etc).<br/>\n<br/>\nThe NPC at the Radiant Heart, huh? Will have to check it out. ;)<br/>\n<br/>\nThanks again.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "6:58 AM - Feb 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Alrightie, so a few things here.  Generally Paladin and any other casting or hybrid casting class are classes you go deep or dip.  You would go deep for Dispel Resistance (Dispel has been increased in power on Arelith and of course, you can still be affected by Breaches) you would dip Paladin for Charisma bonus to saves.  Paladin is customised a smidge on Arelith and nets a CL+3 bonus if you hit level 21 in Paladin, giving you a bit more flexibility than most of the other classes where 26/27 is the goal for a deep build.  Also, Paladins generally want to hit 20th level because Holy Sword caps at 20CL on Arelith, however you have some flexibility on this because CoT levels stack with Paladin for capping Holy Sword.  Further, Abjuration offers an additional +1 to Holy Sword dispels per foci (you will have +2) and Greater Abjuration in conjunction with Shield (via potion/wand/spell/item) will negate IGMS, one of the few offensive spells that will punch through your Saves/Evade.<br/>\n<br/>\nThis is why you see Paladin(23)/Fighter(4)/Rogue(3) builds and is also why you see Paladin(27)/Rogue(3) builds.<br/>\n<br/>\nIn this case, we are looking at a significant CoT multiclass, yielding a decent Divine Wrath (which is cooldown not uses/day on Arelith).<br/>\n<br/>\nThis means you will not hit the 21 requirement for CL+3 and you will need to understand that your build will be very dispellable which for a Paladin means you will not be competitive in PvP against any knowledgeable opponent but will function well in PvE if you take caution to avoid being dispelled.<br/>\n<br/>\nAll the warnings and caveats out of the way, the build is pretty straight forward but the Paladin/CoT division of levels (preEpic) are designed very specifically to net all the Paladin feats that you cannot net using CoT (Divine Shield, Divine Might, SF: Abjuration, GSF: Abjuration).<br/>\n<br/>\nIf you would prefer something that is dispel resistant then I would suggest one of the following (Take appropriate Weapon Group Focus over a specific weapon since focus is no longer a requirement)\n<ol>\n<li>Classic Paladin(27)/Rogue(3) complete with immunity to IGMS via Abjuration Focus and solid dispel resistance with CL 30:\n<details><summary>Spoiler</summary><iframe allowfullscreen=\"\" data-s9e-mediaembed=\"pastebin\" scrolling=\"\" src=\"//pastebin.com/embed_iframe.php?i=bvFnL70S\" style=\"border:0;height:300px;resize:vertical;width:100%\"></iframe></details>\n</li>\n<li>Paladin(23)/Fighter(4)/Rogue(3) Martial Weapon Build (Consider taking Called shot or Knockdown, both have value since the Knockdown nerf) : <a class=\"postlink\" href=\"https://docs.google.com/document/d/1hgJNJYe33WahwE0UlNgRTc3mutD2U_WrNCtDx5c329A\" rel=\"noreferrer\" target=\"_blank\">https://docs.google.com/document/d/1hgJ ... CtDx5c329A</a>\n</li>\n<li>Paladin(23)/Fighter(4)/Rogue(3) Exotic Weapon Build: <a class=\"postlink\" href=\"https://docs.google.com/document/d/13jUtUZDDjXeMczqTveGLhre7CAeSwmnRRTq8Rs5592Y\" rel=\"noreferrer\" target=\"_blank\">https://docs.google.com/document/d/13jU ... Tq8Rs5592Y</a></li>\n</ol>\n\nIf you are keen on the COT build which I rather like but then I avoid PvP which I suspect is harder for a Paladin on an RP server:<br/>\nUPDATED: Forgot Blind Fight (Critical thing)\n<details><summary>Spoiler</summary>Paladin(17), Champion of Torm(10), Rogue(3), Human\nSTR: 15, +2 Gift (26)\nCON: 14\nINT: 14\n\n01: Paladin(1): Expertise, Improved Expertise\n03: Paladin(3): Weapon Focus\n05: Paladin(5)\n07: Paladin(7): {WIS+1}, (WIS=13)\n09: Paladin(9): Divine Shield\n11: Champion of Torm(2): Knockdown OR Called Shot\n13: Champion of Torm(3)\n15: Paladin(11): Spell Focus: Abjuration\n17: Champion of Torm(6): Improved Critical\n19: Paladin(13)\n21: Champion of Torm(7): Epic Weapon Focus\n23: Champion of Torm(9)\n25: Champion of Torm(10): Epic Prowess\n27: Rogue(1): Great Strength II, (STR=25)\n29: Rogue(3): {Uncanny Dodge I}\n\nSkillpoints: 183\nSaving Throw bonuses: \nAB (max, naked): 37 (melee), 25 (ranged)\nSpell Casting: Paladin(4)\n\n\n02: Save(25), \n04: Discipline(1), Heal(1), Taunt(1), Save(17), \n06: Discipline(1), Heal(1), Taunt(1), Save(21), \n08: Discipline(1), Heal(1), Taunt(1), Save(25), \n10: Discipline(1), Heal(1), Save(30), \n12: Discipline(1), Heal(1), Taunt(3), Save(33), \n14: Discipline(1), Heal(1), Save(39), \n16: Discipline(1), Heal(1), Save(42), \n18: Discipline(1), Heal(1), Taunt(3), Save(45), \n20: Discipline(1), Heal(1), Taunt(1), Save(49), \n22: Discipline(1), Heal(1), Save(55), \n24: Discipline(1), Heal(1), Taunt(4), Save(57), \n26: Discipline(1), Heal(1), Taunt(2), Save(61), \n28: Heal(1), Save(49), \n30: Discipline(4), Heal(1), Taunt(4), Save(55), \n</details>\nLet me know if you have any questions about the build or thoughts on what you may want to add/change and I can see about changing the build to meet your requirements.<br/>\n<br/>\nYou have a little play with Knockdown/Improved Critical if you want Improved Knockdown or Improved Disarm, you will need to drop Improved Critical.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:36 AM - Feb 11, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I read your original post on a larger screen with a bit more concentration.  Another option for you that is less martial BUT more dispel proof.  It gets you to 21 Paladin which nets +3 CL custom Paladin bonus AND I added Arcane Defense: Abjuration for another +2 CL getting you to 26 CL for the purpose of defending against Dispels.  This build is <strong>FAR</strong> more PvP friendly, night vs. day more friendly in fact.<br/>\n<br/>\nThe downside:<br/>\n1. Late Improved Expertise (You will need to be a little more careful levelling until you net Divine Shield which comes a little earlier in compensation)<br/>\n2. Loss of 2xGreat Str (1 AB/Damage)<br/>\n3. Loss of 1 of your offensive feats pre-epic meaning you choose between Knockdown, Called Shot or Improved Critical   (I would take Called Shot)<br/>\n4. Loss of Saves (Fortitude/Will/Reflex): -2/-1/-2  (Keep in mind, you get +6 to all saves, divine might damage and  divine shield AC when you cap Charisma at +12 and the bulk of this Charisma will depend on 2 paladin spells remaining undispelled)<br/>\n5. -2 AB/Damage on Divine Wrath (PvE situationally useful, of no use in PvP except against the PvP untrained)<br/>\n<br/>\nAdditional thoughts for this build:<br/>\nBy hitting Paladin 21, you receive a 3rd +1 WIS free meaning your starting Wisdom <strong>can</strong> be 11 rather than 12.  The downside to this is that you get level 4 spells at your 30th character level.  This extra point is not overly useful, mechanically I would drop it in Dex simply because that is the best mechanical option.  However, for quality of life, I would probably recommend keeping it in Wisdom, netting you level 4 Paladin spells at Character Level 20 rather than Character Level 30 and ending with 15 Wisdom at Character Level 30 which gets you 1 step closing to bonus spells so it is not all bad.<br/>\n<details><summary>Spoiler</summary>Paladin(21), Champion of Torm(6), Rogue(3), Human\nSTR: 15 +2 Gift (24)\nCON: 14\nINT: 14\n\n01: Paladin(1): Expertise, Weapon Focus\n03: Paladin(3): Power Attack\n05: Paladin(5)\n07: Paladin(7): {WIS+1}, (WIS=13)\n09: Paladin(9): Divine Might\n11: Champion of Torm(2): Improved Expertise\n13: Champion of Torm(3)\n15: Paladin(11): Arcane Defense: Abjuration\n17: Champion of Torm(6): Called Shot / Knockdown / Improved Critical\n19: Paladin(13)\n21: Paladin(15): Epic Weapon Focus\n23: Paladin(17)\n25: Paladin(19)\n27: Rogue(1): Epic Prowess\n29: Rogue(3): {Uncanny Dodge I}\n\nSkillpoints: 183\nSaving Throw bonuses: \nAB (max, naked): 36 (melee), 25 (ranged)\nSpell Casting: Paladin(4)\n\n\n02: Save(25), \n04: Discipline(1), Heal(1), Taunt(1), Save(17), \n06: Discipline(1), Heal(1), Taunt(1), Save(21), \n08: Discipline(1), Heal(1), Taunt(1), Save(25), \n10: Discipline(1), Heal(1), Save(30), \n12: Discipline(1), Heal(1), Taunt(3), Save(33), \n14: Discipline(1), Heal(1), Save(39), \n16: Discipline(1), Heal(1), Save(42), \n18: Discipline(1), Heal(1), Taunt(3), Save(45), \n20: Discipline(1), Heal(1), Taunt(1), Save(49), \n22: Discipline(1), Heal(1), Save(55), \n24: Discipline(1), Heal(1), Taunt(4), Save(57), \n26: Discipline(1), Heal(1), Taunt(2), Save(61), \n28: Heal(1), Save(49), \n30: Discipline(4), Heal(1), Taunt(4), Save(55), \n</details>\nOf the two builds, I would recommend this one.  A Paladin is highly dependant on spells staying up both in PvE and PvP, this build, although less martial and more feat starved is a more solid build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}