{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Rules and Tools",
  "forum_id": "000",
  "id": "009",
  "name": "ECB Guild Filter",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ecb-guild-filter-t2354531.html",
  "author": "HipRedux",
  "avatar": "10577588_1510287072.jpg",
  "replies": 8,
  "posts": [
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:03 PM - Apr 23, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">NOW AVAILABLE FOR DOWNLOAD!<br/>\n<br/>\n To access the filter project page in the Neverwinter Vault, navigate to<strong><span style=\"color:#0000FF\"> </span><a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/other/ecb-guild-filter\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#0000FF\">this project</span></a><span style=\"color:#0000FF\">.</span></strong><br/>\n<br/>\n Check out the tutorial I included inside the compressed file when you can. Please report any problems or errors either downloading or viewing the HTML. There is NO Javascript in the tutorial.  I suggest you make a dedicated folder, suitably-named, to include the spreadsheet and tutorial.<br/>\n<br/>\n Same goes for the spreadsheet itself.  There are so many columns, I seriously doubt that no errors happened while extracting the metadata and transcribing it, so if you catch any, use this topic to itemize them, please.<br/>\n<br/>\n I highly recommend that you SUBSCRIBE to the project for email notification. That way you will be kept current with the latest revision as I find time to include other builds like the Pre-epic and Bioware legacy ones and/or make corrections to the initial installment without needing to be checking this topic all the time.  I have no estimate on when updates will happen at this juncture but will post revision notices in this thread when they occur.<br/>\n<br/>\n For those of you who do not have a Microsoft Office package that contains Excel, there is also a comma-delimited (CSV) version posted on the same page.  You will not get the Autofilter or Comments, so the Tutorial will not be useful, I assume.  With the raw data, though, you can format within the limitations of whatever spreadsheet software you use.<br/>\n<br/>\n I hope the filter expands your ability to analyze build potential and makes it faster to research your own personal preferences.<br/>\n<br/>\n Later, amigos! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:16 PM - Apr 23, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thou art an splendid fellow, Hip. Congratulations on completing your great endeavour. As an Open Office user, I won't be able to use the tutorial, but I'm sure everything's better now in the world than it was yesterday.<br/>\n<br/>\n Cheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:05 PM - Apr 23, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>Thou art an splendid fellow, Hip. Congratulations on completing your great endeavour. As an Open Office user, I won't be able to use the tutorial, but I'm sure everything's better now in the world than it was yesterday.<br/>\n<br/>\n Cheers!</div></blockquote>\n<div align=\"left\">Thanks, Stagmeister!  I was able to finish it up before my schedule changes drastically.  A load off for sure.<br/>\n<br/>\n I would appreciate if you would try to import the CSV file into OO's spreadsheet.  I am most interested in knowing if the URLs import as active, clickable links or need to be reformatted in order to navigate to the website.  When you get a chance.  No hurry.<br/>\n<br/>\n I am unfamiliar with that product so can't suggest any way to set up similar functions like the Excel data.  Do you have that suite installed on a Mac?</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:15 PM - Apr 23, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Open Office is, in essence, and as far as I can work out, a free version of the the Microsoft Office suite provided by Apache (I think). So, no, not Mac - sorry.<br/>\n<br/>\n As you may have noticed, my tech expertise is lacking to the extent of redundancy. However...I do have a friend (odd though that may sound) who's due to pop round within the next week to fix some issues I'm having with my pc, so I'll flag this with him, too (along with Icewind fuzzy graphics, Java not being able to update and such like malarkey). He should be interested anyway - he's the bloke who first introduced me to NwN (even though he's never left the city of Neverwinter himself - I'll try to hook him into Aielund instead).<br/>\n<br/>\n Hopefully I'll have something to report back before you go off to consider the lilies, conquer a galaxy, or whatever it is that takes you from us. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:39 PM - Apr 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Hip,<br/>\n<br/>\n You'll be pleased to know that using Open Office doesn't affect the utility of the filters at all. Have done the downloads and, without any meddling on my part, everything works swimmingly. No reformatting, URLs work fine. Excellent work!<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Sorry, you mentioned the CSV file. Afraid I didn't use it - didn't need to!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:56 PM - Apr 30, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's really great news, Stagmeister!.... and I am glad you posted the information for others who have similar office resources.<br/>\n<br/>\n The comma-delimited CSV is made available mainly for MAC users who could still import the raw data into their own spreadsheet-of-choice and with some massaging would/should be able to get it to work just like Excel.  If I am ever able to construct an on-line SQL database (still a possibility), I will use the CSV to populate the SQL and, potentially, create a front-end user interface for inputing the same metadata by build owners that I gleaned manually.  But I am getting ahead of myself at this juncture.<br/>\n<br/>\n Just glad to hear, at least for your situation, that there were no barriers to gaining access.  And thanks for the kudos! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:56 PM - May 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hate to be a knuckle-runner, but how does one subscribe?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:45 PM - Jan 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The latest version of the Filter, v.02, is available on the NeverwinterVault.  It now includes all complete and tested builds regardless of the final level and many corrections made to the data of the initial release.  Thanks to Stagmeister for his tireless effort in sanitizing the data!  If you notice either errors in the worksheet data or have a problem downloaded or using either the Excel data or the CSV file, please post your comments within this thread.<br/>\n<br/>\nFor those of you not completely familiar with all the intricacies of the NWVault... each post contains a section entititled \"<strong>Permissions &amp; licensing:</strong>\" just after the list of files.  Immediately following that section are a few actions that all Vault members can pursue.  One of these is a link labeled \"<span style=\"text-decoration:underline\">Subscribe to: This post</span>\".  Click that link to be informed whenever that particular project changes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:45 PM - Jan 25, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Excellent work, Hip!<br/>\n<br/>\n I can confirm that the link given in the lead post still works fine and dandy, and that Open Office is still compatible with the revised version, for those who don't use Excel.<br/>\n<br/>\n An even more invaluable resource <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}