{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "825",
  "name": "The Luck Knight, Lucky Knight, Champion of Tymora.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-luck-knight-lucky-knight-champion-of-tymora-t2355146.html",
  "author": "BlueSasquatch",
  "avatar": "no_avatar.png",
  "replies": 19,
  "posts": [
    {
      "author": "BlueSasquatch",
      "avatar": "no_avatar.png",
      "timestamp": "6:37 PM - Aug 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Long time fan of NWN, played for years and then life got in the way. Picking up some D&amp;D 5E pen and paper with some local friends, has me wanting to play NWN again, so I installed a Diamond edition on the laptop to run through campaigns with, ideally play my 5e character through nwn, to see how I like it. I know it's hard to compare 3e and 5e, but would like to attempt something similar. Couldn't find a build that felt right, wanted to see if anyone would want to put together a basic guide for such a character.<br/>\n<br/>\n<br/>\nI actually RPed this character on a NWN server long ago, but I can't recall what build I used at all.<br/>\n<br/>\n<span style=\"text-decoration:underline\"><strong>The Luck Knight</strong></span><br/>\n<br/>\n<strong>Dogma</strong><br/>\nOne should be bold, for to be bold is to live. A brave heart and willingness to take risks beat out carefully wrought plans nine times out of ten. Place yourself in the hands of fate and trust your own luck. Bear and conduct yourselves as your own masters, showing your good or bad fortune as confidence in the Lady. Chase your own unique goals, and the Lady aids the chase. Without direction or goals, you soon know the embrace of Beshaba, For those on no set course are at the mercy of misfortune, which has no mercy at all.<br/>\n<br/>\nMy Character Back Story<br/>\n<br/>\n<span style=\"text-decoration:underline\">Sir Felix Bellator</span><br/>\nWashed ashore near a Temple to Tymora when he was a baby, no indication of lineage or signs of home, he was raised in the temple and developed a strong devotion to Tymora, considering himself blessed by her at birth. When he was old enough he joined the local militia, became addicted to gambling (although he views it as spreading Tymora's faith) and was kicked out of the militia and town after a mob formed over their distrust of him and his ability to frequently win games of chance. He continues to venture from town to town, in search of adventurers in need, and coin to be won, spreading the good word of his faith as a Champion of Tymora. <br/>\n<br/>\nFor RP purposes, my character is superstitious and cannot carry an even amount of coin, giving away one when needed to reach an odd number. He also will always strike an enemy an odd number of times, which can lead to taking another swing at that corpse. He flips a coin for non-vital decisions, or rolls a dice to help decide things, addicted gambler, overall optimistic and charismatic. Carries around good luck tokens. <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n1) Campaign Only, Original, then SOU and HOTU (I know SOU/HOTU are supposed to be played from level 1, so I may re-play the same character or try something different, for now its just the OC to relive) <br/>\n<br/>\n2) Level cap - Not sure what is likely in the Campaigns, 30 I think?<br/>\n<br/>\n3) Race preference - I went with Human for 5e but managed to get the DM to give me the Halfling Lucky Feat, which then allowed me to grab the Luck feat at level 4 for x2 the Luck. For this game, I figure that's not possible, so Halfling may be the way to go.<br/>\n<br/>\n4) Class preference - Torn between a Fighter and a Paladin, while Tymora isn't a deity that has Paladins specifically, she does have Fellows of the Free Fate (<a class=\"postlink\" href=\"https://forgottenrealms.fandom.com/wiki/Tymora\" rel=\"noreferrer\" target=\"_blank\">https://forgottenrealms.fandom.com/wiki/Tymora</a>) Possible Champion of Torm Combo? <br/>\n<br/>\n5) Melee preference - Longsword or Bastard Sword with a Shield, or Two handed even, would rather STR over DEX here. <br/>\n<br/>\n6) Range preference - DEX as a backup? Or just to bait them closer.<br/>\n<br/>\n7) Weapon preference - If I recall bastard is 1 or 2 handed, so probably bastard with a shield for when my luck runs out. <br/>\n<br/>\n8) Maximum item enhancement -Campaign, so +3 would be hard to find? <br/>\n<br/>\n9) Spellcasting - Indifferent,<br/>\n<br/>\n10) Custom factors - As luck-based as possible.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:26 PM - Aug 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">First of all, welcome aboard, Blue Sasquatch!<br/>\n<br/>\nSecond of all, love the thinking and the back-story - flavour is so important to a build that isn't just robotic.<br/>\n<br/>\nThird of all (don't worry, I've only got four of them), on the technical side, if you want a halfling then both long and bastard sword will be two-handed, so we might want to think about that one way or another. Also, and this is more about where you'll be playing, the Original Campaign will only get you to about level 17/18, while SoU and HotU will take you to about level 28. If you really want to have the big guns firing, you might want to think about following the OC with the Mines of Twin Summit modules (there's a thread with appropriate links in the Modules forum here), and SoU/HotU with Sands of Fate (likewise, see the Modules forum). Both of those avenues will get you comfortably to level 40, with time to enjoy it. However, if you want one story-arc to pan out and take you right up to level 36/37, then get the Aielund saga (also in the Modules forum).<br/>\n<br/>\nFinally, fourth of all, the build! I was immediately drawn to CoT and Rogue from your description of the character, and I know of few finer examples than one of Mick Dagger's builds here: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/halfling-champion-rogue-20-fighter-6-cot-14-t2354370.html\" rel=\"noreferrer\" target=\"_blank\">Halfling Champion</a><br/>\n<br/>\nThat said, it is Dex-based and dual-wields kukris, but is definitely worth a long hard look. If that doesn't appeal, I'm sure we can come up with something else.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BlueSasquatch",
      "avatar": "no_avatar.png",
      "timestamp": "7:55 PM - Aug 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Stag!<br/>\nHuman is preferred, but if Luck is the goal, Halflings have the LUCKY feat, which is what makes them a better fit for Tymora probably, just maybe a Dex based rather than STR based, which could work, more of a Swashbuckler of Tymora rather than a traditional Knight.<br/>\n<br/>\nI would like to play the OC first, and then consider re-using the character for the SoU/HotU, after which I'd look into the mods, it's been a good decade or more since I've played the campaign + expansions, I don't have tons of time to do so, I'm sure they would keep me quite busy, but I am excited that there are solid Mod content as well. This is also a pre-character trial for the release of NWN on xbox one, come December. <br/>\n<br/>\nCoT and Rogue with Fighter combo does make some good sense, If one went light armor and maybe rapiers or something else that could work, perhaps some Ranger instead of Rogue for the dual wield benefits, and more levels in fighter or CoT? (Is CoT limited to 10?)<br/>\n<br/>\nSkyrim is completely different but I had a human great-sword light armor build that was surprisingly alot of fun, mixed in rogue abilities (Play off of the \"legend of king arthur\" movie that came out a bit back)<br/>\n<br/>\nI had also considered Brawler Champion: Fighter 8, CoT 10, Monk 2 by Mick -- <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/brawler-champion-fighter-8-monk-2-cot-10-t2350552.html\" rel=\"noreferrer\" target=\"_blank\">brawler-champion-fighter-8-monk-2-cot-10-t2350552.html</a><br/>\nUses Bastard sword and heavy armor, has the CoT flavor for a Paladin or Champion of Tymora feel to it. That being said it is a CHA dump build, and I've gone with some CHA for my pen and paper version.<br/>\n<br/>\nJust wanting to make sure I'm not missing anything that would obviously be good for a Luck based character is all, been a while since I've played and I can't recall all the abilities/feats, etc<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:06 PM - Aug 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Got to dash (Real Life can be such a pain) - but just a couple of things:<br/>\n<br/>\nWhile you're right about halflings having the Lucky feat naturally, humans get an extra feat anyway, so can take Luck of Heroes - ain't balance a wonderful thing! However, neither should matter in practice should you take CoT to a reasonable degree, because the save bonuses can become astronomic. Oh, and while I think about it, no, CoT (as a prestige class) is limited to 10 levels pre-epic, but unlimited after that (so the max is 30 levels).<br/>\n<br/>\nAnd yes, Mick's Brawler Champion - and its Epic cousin - is a monumental build!<br/>\n<br/>\nThere will be more, but I have to go just now. Others will come in as well, I'm sure. Welcome back to the fold!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BlueSasquatch",
      "avatar": "no_avatar.png",
      "timestamp": "9:31 PM - Aug 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So the Halfling Lucky feat and the Luck of Heroes is the same feat? Can the Halfling have both? That is only my point, the Halfling with both is luckier than the Human with one.  And part of what I asked our DM for the 5e PnP session to allow was a Human with the Halfling Feat, so I could double down on the Luck. (Also for 5e the Halfling Luck is re-roll any 1 while the Luck Feat is 3 re-roll options, slightly different) <br/>\n<br/>\nDoes the CoT not have CHA based saves like the Paladin?<br/>\n<br/>\nI do like the Champion of Tymora class, over the Paladin, as the Deity is Chaotic Good, and Paladins always feel more Lawful Good to me. Deity of Luck/Trickery Domain just slightly less fanatic than a Paladin would be. Sad to say D&amp;D 5e does not have a CoT class, which has me going Fighter instead.<br/>\n<br/>\nFighter/Rogue/Champion of Tymora seems to make the most sense. Maybe Bard instead of Rogue to capitalize on some CHA<br/>\nSTR/CON with CHA as a 3rd, heavy armor and bastard sword w/optional shield. <br/>\nor<br/>\nDEX/CON with CHA as 3rd, light armor and I'm not sure what weapon, finesse weapons have never appealed to me, short of a pure rogue.<br/>\n<br/>\nI've never played a Bard. Or a Sorc which is CHA based, but RP wise no idea how to tie that one in.<br/>\n<br/>\nFighter/Champion of Tymora / Weapon Master perhaps - Being super good with a weapon \"Lucky hit!\"  <br/>\n<br/>\nWould be willing to sacrifice some optimization in exchange for some legit RP sense, basically anything construed as \"luck\" (Beating a dead horse over here)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:05 PM - Aug 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The CoT does not have charisma-based saving throws, but it gains a steady +1 to all of his saves every two levels.<br/>\nIt is possible to combine the two (Paladin &amp; CoT) &amp; create a character that only fails his saving throws on \"1\". <br/>\nThe luck feat in Neverwinter Nights works differently than what you have in 5e, it is not a re-roll.<br/>\nThe closest thing to a re-roll mechanism is the bard's song in Icewind Dale, more than one bards can co-operate for this &amp; eventually break the game like a chestnut. <br/>\nFighter/ Rogue or Bard/ CoT is the most versatile build in the game, it can cover almost everything. <br/>\nMick's Epic Brawler Champion is a very good build &amp; can easily be adapted to Halfling if you like to play one. <br/>\n<br/>\nYou can see all bonuses that Hins have, here =&gt;  <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Halfling\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Halfling</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:12 PM - Aug 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome to the guild BlueSasquatch!<br/>\n<br/>\nThe character you outline looks like a very fun character to roleplay. <br/>\n<br/>\n<details><summary>Spoiler</summary>\nThe concept of luck is not very well implemented as such in NWN. But many of the the rules that make up the game mechanics are based on dice rolls. (Attack rolls, saves rolls, DC checks, skill checks etc...)\nMost bonuses improve with higher character levels. But you can also do a lot by picking the right feats and skills.\n</details>\n\nI assume that you want your character to succeed most of the time, and roleplay that it is based on \"luck\". Of course we can skew the outcome with an appropriate build. We cannot make builds that are good at everything, or at least it takes us a little longer, but builds with a fairly good AB and AC combined with good saves can we do. <br/>\n<br/>\n<details><summary>Spoiler</summary>\nCharisma has impact on some game mechanics. It is the basis of magic for sorcerers and bards. It is important for several feats used by divine characters (paladin, CoT, cleric, blackguard). Charisma boosts saves for paladins and blackguards. It also boosts several \"social\" skills such as persuade and bluff.\n</details>\nNinja'd by Valerfor, but I post it anyway <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BlueSasquatch",
      "avatar": "no_avatar.png",
      "timestamp": "10:20 PM - Aug 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Valefor, <br/>\nHaven't heard them called Hins in ages. I'm indifferent to Human vs Halfling, I enjoy halfling for alot of builds, but for whatever reason, leaning towards Human with this guy. <br/>\n<br/>\nI suppose I've got the RP Character idea developed and am just looking for an optimal class to support it. Champion of Torm seems to be the best fit, just undecided on the rest.<br/>\n<br/>\nAny chance of a charismatic two-handed with light armor working well?<br/>\n<br/>\nMick,<br/>\nThanks, glad to see a forum still so active, I've fallen out of touch with my nwn rp group, gotta be going on 10-15 years now. r.i.p.<br/>\nFirst PnP session is this weekend, we have a new group of 5 with a seasoned DM, been tossing our characters back and forth for about a month now, so hopefully no one dies until a few sessions in! It's a character I've RPed before in a NWN server long ago, I've added some more detail since then, the route I have in mind is a typical heavy armor, longsword knight (5e doesn't have bastard swords I don't believe) that I am playing as a Fighter with Subclass Champion (Paladin seems to devout or not deity appropriate, which is why CoT feels so right to me, it's more of a laid-back Pally in my mind) while 5e doesn't have a Divine Champion option, the Champion subclass of Fighter really gives your guy some good melee and defense, which I will Roleplay as luck, such as escaping by the skin of my teeth (luck) or hitting those bad guys in weak spots so often. (critical, lucky hit) <br/>\n<br/>\nThe idea is just to play the NWN equivalent of that, so in a long winded reply, then yes the character to succeed most of the time and RP it as luck is the idea. I just don't need a 100% optimized build, if I can give some things up for an RP flair, I'm all for it. As much fun as it is to blow through dungeons, if you don't have to re-load a couple times, it loses some appeal IMO. <br/>\n<br/>\nAlso hoping in doing this it helps develop my PnP character more.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:32 PM - Aug 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Charismatic, big weapon, all sound good so far, but \"light armor\"?<br/>\nNo, that doesn't sound good in Neverwinter Nights world. You simply lose AC. <br/>\nOf course, you could use a chain shirt &amp; boost your dexterity to 18 with items &amp; overall the difference would only be 1 AC, that is your choice. <br/>\nOr you could of course make the smart move &amp; simply use an in-game character customizer &amp; make you look like you are wearing light armor but in fact you are wearing full plate &amp; keep the best AC. <br/>\nI do it in most of my module play, and I have posted a couple of pictures here about that.  <br/>\nLet me find them...Alright, here are some of them =&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/mines-of-twin-summits-1-2-and-3-t2354731-s100.html#p10560\" rel=\"noreferrer\" target=\"_blank\">mines-of-twin-summits-1-2-and-3-t235473 ... tml#p10560</a><br/>\n<br/>\nAs a side note, Stag might have some issues with this screenshot from Empyre =&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/mines-of-twin-summits-1-2-and-3-t2354731-s210.html#p11910\" rel=\"noreferrer\" target=\"_blank\">mines-of-twin-summits-1-2-and-3-t235473 ... tml#p11910</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BlueSasquatch",
      "avatar": "no_avatar.png",
      "timestamp": "11:45 PM - Aug 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Valefor,<br/>\nIt was just an idea, I'm fine wearing Heavy Armor and RPing as such - a Knight, it was just an idea, in Skyrim (different game but still race/class/swords, etc an Elder Scrolls game) I found two handed with light armor to work out well, mostly due to them not having an attribute system but just skill based. . <br/>\n<br/>\nI used to use a character and equipment developing tool, forget what it was called, but allowed for all sorts of customization, sticking with a vanilla playthrough for now. <br/>\n<br/>\nThe Light armor would just be a twist, to make them more of a Swashbuckler of Luck rather than a Knight, but then you just go Dex, and I just don't like the dex weapons as much for some reason. <br/>\n<br/>\nFighter/Champion of Tymora. . .Perhaps it doesn't need a 3rd class.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:07 AM - Aug 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Add rogue or bard, too much to gain to ignore them. <br/>\n<br/>\nAs a third choice, being lawful it makes perfect sense to add Monk instead, religious training, etc.<br/>\n<br/>\nFrom the full tumble alone, you will gain +4AC &amp; Monk will also makes your saving throws better. Cost is only 1AB over a \"pure\" warrior.<br/>\n<br/>\nI spend too much time on Morrowind, Oblivion not so much, Skyrim is probably the best of them but still...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:32 AM - Aug 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Take a look at this one and let us know what you think.\n<details><summary>Spoiler</summary>Fighter(14), Bard(16), Champion of Torm(10), \nAlignment: NG, CG, TN, CN\nSTR: 16 (32)\nCON: 14\nINT: 14\n\n02: Fighter(1): Weapon Proficiency Exotic\n04: Fighter(3): STR+1, (STR=17)\n06: Fighter(5): Lightning Reflexes\n08: Fighter(6): STR+1, Expertise, (STR=18)\n10: Champion of Torm(2): Blind Fight\n12: Bard(3): STR+1, Lingering Song, (STR=19)\n14: Champion of Torm(5)\n16: Champion of Torm(7): STR+1, (STR=20)\n18: Bard(4): Curse Song\n20: Champion of Torm(10): STR+1, Called Shot, (STR=21)\n22: Bard(5)\n24: Fighter(9): STR+1, Great Strength II, (STR=24)\n26: Fighter(11)\n28: Fighter(12): STR+1, Armor Skin, (STR=26)\n30: Fighter(14): Epic Will, Epic Prowess\n32: Bard(8): STR+1, (STR=27)\n34: Bard(10)\n36: Bard(12): STR+1, Great Strength V, (STR=30)\n38: Bard(14)\n40: Bard(16): STR+1, (STR=32)\nHitpoints: 416\nSaving Throw bonuses: Spells: +9, Death: +1\nAB (max, naked): 44 (melee), 29 (ranged)\nSpell Casting: Bard(5)\n\nAppraise 8(10), Discipline 43(54), Heal 10(9), Listen 43(42), Perform 28(30), Persuade 10(12), Spellcraft 43(45), Tumble 40(39), UMD 28(30)\n\n02: Discipline(1), Save(5), \n04: Discipline(1), Save(13), \n06: Discipline(1), Save(21), \n08: Discipline(1), Save(5), \n10: Discipline(1), Save(13), \n12: Appraise(5), Discipline(1), Listen(5), Perform(3), Tumble(5), UMD(5), \n14: Discipline(1), Heal(2), Save(2), \n16: Discipline(1), Save(10), \n18: Discipline(1), Listen(6), Tumble(5), UMD(5), Save(4), \n20: Discipline(1), Save(12), \n22: Discipline(1), Listen(4), Spellcraft(8), Tumble(5), UMD(5), \n24: Discipline(1), Save(8), \n26: Discipline(1), Save(16), \n28: Discipline(1), Save(4), \n30: Discipline(1), Save(12), \n32: Discipline(1), Listen(1), Perform(3), Tumble(5), \n34: Discipline(1), Listen(1), Spellcraft(5), \n36: Discipline(1), Listen(1), Spellcraft(5), Save(2), \n38: Discipline(1), Listen(1), Perform(3), Save(4), \n40: Discipline(1), Listen(1), Perform(6), Spellcraft(5), </details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BlueSasquatch",
      "avatar": "no_avatar.png",
      "timestamp": "12:42 AM - Aug 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Mick, that looks great! Can I ask why start with Bard and why 16 levels?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:49 AM - Aug 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">At lvl 1 you get 4 times as many skill point as usual. So I start with the class that gets most skill points per level. The gain here is 8 points compared with starting with fighter.<br/>\n16 bard levels is a sweet spot for the bard/curse song combo.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BlueSasquatch",
      "avatar": "no_avatar.png",
      "timestamp": "1:48 AM - Aug 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great to know Mick, thanks again! Like I said, I've never played bard before, not sure why but I always dismiss them as an option for some reason, perhaps I just never RP a bard, but I've narrow views of things sometimes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BlueSasquatch",
      "avatar": "no_avatar.png",
      "timestamp": "1:52 AM - Aug 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll have to review the Bard some and see how to RP it, what spells that could pass for luck, I suppose I can sing Tymors praises while i smite the enemy.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:12 AM - Aug 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The Bard's song can easily pass for luck, it confers significant bonuses for you &amp; your allies while its opposite, Curse song, makes your enemies \"unlucky\".<br/>\n<br/>\nYou can see what bonuses/penalties Bard's song/ Curse song provides here: <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Bard_song\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Bard_song</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:22 AM - Aug 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Better yet if you want to know about Bards... <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/master-of-performance-a-bard-guide-t2354698.html\" rel=\"noreferrer\" target=\"_blank\">Mick's Bard Guide</a><br/>\n<br/>\nMore to say, but no time atm - \"I'll be back\"<br/>\n<br/>\nEDIT: Taxi is late, so have a little time just to give a hat-tip to the last use of the dancing banana I can think of: it's the first post or two on page 2 of Mick's Guide. There is no better testament to a loved and missed companion...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:14 PM - Aug 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>BlueSasquatch wrote:</cite>\nGreat to know Mick, thanks again! Like I said, I've never played bard before, not sure why but I always dismiss them as an option for some reason, perhaps I just never RP a bard, but I've narrow views of things sometimes.<br/>\n//<br/>\nI'll have to review the Bard some and see how to RP it, what spells that could pass for luck, I suppose I can sing Tymors praises while i smite the enemy.</div></blockquote>\nIn the build I have used the fighter and CoT classes to take care of the \"knight\" part of the character, providing combat related feats etc. CoT contributes to luck by boosting the saves. I have taken 6 different saves boosting feats to contribute to luck as well. <br/>\nBard is there to represent the chaotic aspect of the character. I had no intention to create an artist of any kind. My intention was that you should roleplay him the way you have planned.<br/>\nThe songs are there (like Valerfor said) to manipulate luck. Several of the buffing and debuffing spells do the same.<br/>\nEarly on the bard levels contribute little to the character, except for adding skills and opening up for use of magic. Later on bard provides a powerful song and curse song. The spells come late and only a very few will have impact on the power of the build at that time, but many spells can add some flavour to gameplay. Bard and UMD opens up for use of scrolls and magic items early on. They can be roleplayed as lucky charms or things like that. <br/>\n<br/>\nEdit: If you are new to playing characters with bard in them, my bard guide (the one Stag promotes) will give some basic understanding of what the class has to offer.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BlueSasquatch",
      "avatar": "no_avatar.png",
      "timestamp": "3:57 PM - Aug 29, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Greatly appreciated guys! I read through the bard guide and it actually has me excited to play bard, really well done, I need to re-evaluate my stereotypes. <br/>\n<br/>\nMick, I love the fighter/COT for the Knight and the Bard for the Chaotic nature of the character/deity. The bard adds the flavor I was looking for. This will be used for the OC but out of curiosity, any general changes for SoU or HotU if I decide to remake him for those lines? <br/>\n<br/>\n<br/>\nAlso, if it's not to off-topic, I would love any discussion on how this character would be built as a level 20 in 5e, we are using the 5e handbook, Xanthar's Guide and the Sword Coast handbook as our bases. There is no divine champion/champion of torm class, Paladin isn't quite the direction I want to go with him, just like with NWN, we went fighter/cot instead of paladin, same general idea, but different feel to him.<br/>\n<br/>\nFor 5e I am looking at a Human Fighter with subclass Champion, and just 20 levels of that (and a Knight background), not very exciting but I did get the DM to bend the rules and grant my Human the Halfling Luck Feat, and for me to grab the standard Luck feat at level 4, to double down on Luck. . . The Eldrich Knight is Int based rather than CHA based, and I don't know how to pass off a Fireball spell as a good luck item, maybe a meteor from the sky. . . Xanthar's Guide has Cavalier which is a mounted warrior, but I don't see that being terribly useful. We are staying away from homebrew. . .Anyways this NWN version with the bard has me reconsidering maybe adding some Bard to 5e. Would love any feedback on that as well.<br/>\n<br/>\nThanks all!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}