{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Rules and Tools",
  "forum_id": "000",
  "id": "001",
  "name": "Character Builds Posting Rules",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/character-builds-posting-rules-t515321.html",
  "author": "KailPendragon",
  "avatar": "10235214_1540245864.jpg",
  "replies": "1",
  "views": "3.1K",
  "posts": [
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "3:20 PM - Jun 29, 2011",
      "content": "<div>These are the rules for posting builds in the Epic Character Builds page. Please read carefully all the points. We expect all the posters to be acquainted with the rules and to follow them.<br/>\n<br/>\n<br/>\n A. The build must be LEGAL<br/>\n<br/>\n B. It must be a complete and tested build <ul><li>A Trainer Module will be fine, though playing the build in a sample environment is better. Many posters find <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/other/tool/characterbuildcalculator-cbc\" rel=\"noreferrer\" target=\"_blank\">Kamiryn’s Character Build Calculator</a> spreadsheet to be a precious aid too.</li> </ul>\n C. All builds must have at the very least the following points:<br/>\n<br/>\n<br/>\n Title Field of the post - Build Name: Class/Level split (Try to be as economical as possible. Abbreviated Class names are fine)<br/>\n Race<br/>\n Alignment (Use \"Any\" for no restrictions)<br/>\n PvM/PvP nature of the build<br/>\n Playable range<br/>\n Starting/Ending Abilities<br/>\n Leveling Guide/Skill Schedule<br/>\n XP Penalty evidenced (if present)<br/>\n Skill Point Total and Distribution<br/>\n HP total (use max dice rolls)<br/>\n BAB/AB<br/>\n AC<br/>\n Saves (Fortitude/Reflex/Will)<br/>\n Description of aim/purpose of the build<br/>\n A tidy, essential, easy to read Format (see below)<br/>\n<br/>\n D. It must be an original build.<br/>\n<br/>\n • The build must stand out compared to similar ones because of some significant differences.<br/>\n • Similar builds should be researched using <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/buildsearch/\" rel=\"noreferrer\" target=\"_blank\">Character Build Search Engine</a> (courtesy of The_Krit) and browsing the most recent builds that have not made it yet into the search engine.<br/>\n • Links to similar builds must be given in the build’s post.<br/>\n • A build which ends up to be the same as an already exsisting one a few minor tweaks apart should not be posted. Such tweaks should instead be suggested as a reply post in the original build thread.<br/>\n<br/>\n E. It must have an original title<br/>\n<br/>\n • Please refrain from unduely quoting other builds in your title unless you are the original creator of aforementioned build. You are still allowed to point out such a connection in your post, if you so desire.<br/>\n • With the sheer number of builds in our index it can happen to unintentionally duplicate an already existing title. We do understand this and in such a case you will simply be asked to suggest a new, more creative title by one of the moderators.<br/>\n * Only ONE build per title please. No multiple level layout for alternative versions. If you need help to decide on the best variant, post as a work-in-progress in the Build Request section and then post the final, optimized version as a completed contribution.<br/>\n<br/>\n Keep present that:<br/>\n • if all of the above points are not followed in your build post, the thread will be moved to Build Request Forum, locked or edited so as to be in line with the rules (depending on the specific case).<br/>\n • if you forget any of the above points, please add them in a reply post or PM them to one of the moderators and they will then be edited in the original post<br/>\n<br/>\n Obviously the more information about your build you post the better it is for the reader and for members who will help refine it. Feel free to include all the information you deemed necessary after the main exposition of the build (see template below, for reference) like tactics, preferred spells, weaknesses, advantages, item wishlist (make it realistical, the usual reference is a +5 magical environment) and so on.<br/>\n<br/>\n A short story to introduce the mood of the build is always welcome but by all means not mandatory.<br/>\n<br/>\n<br/>\n **** **** **** **** BUILD TEMPLATE **** **** **** ****<br/>\n<br/>\n<br/>\n Here is a Build Template you can use when posting your builds (the graphic signs are used just to identify the content to be posted in each position).<br/>\n<br/>\n<br/>\n - (), (), ()<br/>\n ,<br/>\n ,<br/>\n<br/>\n<strong>Build Title and Final Class Split</strong><br/>\n<br/>\n ABILITIES(ending)<br/>\n STR: (...only if a different value by build's end)<br/>\n DEX: ()<br/>\n CON: ()<br/>\n WIS: ()<br/>\n INT: ()<br/>\n CHA: ()<br/>\n<br/>\n<br/>\n<br/>\n BASIC STATS<br/>\n Hitpoints:<br/>\n Skillpoints:<br/>\n<br/>\n Saving Throws (Fortitude//Will/Reflex):<br/>\n Saving Throw bonuses:<br/>\n<br/>\n BAB:<br/>\n AB:<br/>\n<br/>\n AC (naked/mundane armor and shield):<br/>\n<br/>\n LEVELING GUIDE (Classes, ability increments, feats)<br/>\n 01: ():<br/>\n 02: ():<br/>\n 03: ():<br/>\n 04: ():<br/>\n 05: ():<br/>\n ...<br/>\n ...<br/>\n ...<br/>\n 39: ():<br/>\n 40: ():<br/>\n<br/>\n SKILLS SCHEDULE w/Summary<br/>\n 01: ()<br/>\n 02: ()<br/>\n 03: ()<br/>\n ...<br/>\n 39: ():<br/>\n 40: ():<br/>\n<br/>\n<br/>\n<br/>\n Notes:<br/>\n • When dealing with RDD or Great ability increases, please indicate the new ability value on the relative level.<br/>\n • Optionally indicate Cleric chosen Domains on Cleric 1st lvl.<br/>\n • Optionally indicate Weapon of Choice on WM 1st lvl.<br/>\n • Indicate School of Specialization (if any) on Wizard 1st lvl.<br/>\n • Feel free to indicate the most notable bonus class related feats (eg: KD/IKD at Monk 6th lvl), but please don’t overdo it. Indicate them using curly brackets (\"{feat}\") to differentiate them from ordinary feats, like this: 06: Monk (6): Expertise {KD, IKD}<br/>\n • Feel free to add a skill by level guide, but make it a separate level by level guide.<br/>\n • Do not trust the Character Sheet for all your datas, it is often inaccurate. Check the combat logs, better if using debug mode.<br/>\n • <strong><a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/other/tool/characterbuildcalculator-cbc\" rel=\"noreferrer\" target=\"_blank\">Kamiryn’s CBC</a></strong> output with a few little tweaks gives optimal results (set Class feat display lvl at 3-4).<br/>\n<br/>\n<em>edit: per Hip 20161119 (relinked CBC to NWVault URL, 2 places; corrected several typos)</em></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:12 AM - Mar 25, 2016",
      "content": "<div>I decided to take this opportunity to clarify and append to Kail's original template.<br/>\n<br/>\n The section called <strong>\"SKILLS</strong>\" refers to final skill ranks and should include both allocated ranks and modified ranks (\"modified\" commonly shown within parenthesis).<br/>\n<br/>\n The section called \"<strong>LEVELING GUIDE</strong>\" includes all of the following: Ability increases, Feat Selections (Does not need to include class-specific feats unless you feel it has value.  We all know or should know that information since it is static and never changes.), skill allotments per level and alignment changes (if you are so inclined to build outside the limitations of AD&amp;D 3.0, i.e. post an illegal build).  It is less confusing if the skill allotment schedule is displayed separately and just after the class sequence schedule so you should have two tables numbered from 1 to 40 in your build posting.<br/>\n<br/>\n<strong>Referencing Related Legacy Builds</strong><br/>\n<br/>\n With our lost access to an on-line Search utility and database containing the legacy archive, we have a dilemma, but there is a somewhat round-about solution to furnish the same sort of linkage.<br/>\n<br/>\n The first step is to download the archive from the New Vault to your computer and run the search locally.  Complete instructions are described <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354480/How-and-Where-to-Access-Legacy-ECB-Archives\" rel=\"noreferrer\" target=\"_blank\">here</a>.</strong><br/>\n<br/>\n If you find one or more builds that contain similarities that compare favorably with the design you intend to publish, search the entire topic to determine the most recent version.  Be careful, though.  Sometimes topics are hijacked by other members trying to get free exposure on the heels of the originating author, so choose wisely. <br/>\n<br/>\n Once you have found a relevant post, highlight and copy JUST the class/ability/feat listing, the final skill set at Level 40 plus any analysis that defines AB, AC, APR, damage, DC... you know the drill. Paste it into Notepad or some plain text editor (NOT a Word Processor like MSWord).<br/>\n<br/>\n Next... type this into the Forumer editor somewhere below all your build and analysis details:<br/>\n<br/>\n XXX<br/>\n {spoiler}<br/>\n YYY<br/>\n {/spoiler}<br/>\n<br/>\n<em>where XXX is the title of the build being referenced<br/>\n and YYY is a blank line where you will paste the build<br/>\n and { } (braces) are replaced by open and close brackets</em><br/>\n<br/>\n Go back to Notepad and key CTRL-A (selects all text if it is no longer highlighted for some reason) then CTRL-C (this will override the formatted version that was in the buffer, MS calls it the \"clipboard\").<br/>\n<br/>\n Click on the blank line (described above) between the spoiler code.  Make sure a cursor is active and key CTRL-V (to paste).<br/>\n<br/>\n That should do it.  Now you can clean it up in the Forumer editor if any control characters slipped through. Not likely with Notepad strip, though.<br/>\n Rinse and repeat the steps for each relevant build.  What should show up after you save the edit is the title with the spoiler {+} immediately below it.<br/>\n<br/>\n I realize this seems like a lot of work because it is.  So make sure the builds you reference actually contribute something significant to the comparison.  We really do not need to see a list of every build published that uses class combo X/Y/Z. Just the ones that have some direct relationship to the one you plan to contribute.<br/>\n<br/>\n Hope this helps and good luck!</div>"
    }
  ],
  "pinned": true
}