{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "695",
  "name": "Nightslayer (Fighter 10 / Rogue 2 / Weapon Master 28)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/nightslayer-fighter-10-rogue-2-weapon-master-28-t2355342.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "26",
  "views": "1.5K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:18 AM - Feb 06, 2020",
      "content": "<div><strong><span style=\"font-size:150%;line-height:normal\">Nightslayer</span></strong><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202002/10759084_28423ad6f2f863dab996e1b500f089f4.bmp\"/><br/>\n<span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://i.pinimg.com/originals/9a/45/f2/9a45f2cfd3a3c2e69ab19de8c64e86a3.jpg\" rel=\"noreferrer\" target=\"_blank\">https://i.pinimg.com/originals/9a/45/f2 ... 4e86a3.jpg</a></span><br/>\n<blockquote><div><a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/general247382.html\" rel=\"noreferrer\" target=\"_blank\">Cinnabar Din</a> wrote: <br/>\nTaken from a post by Mithdradates [...]:<br/>\nOnce, you've fleshed out your build ask yourself<em> <strong>if I was going to <span style=\"text-decoration:underline\">take down</span> this build how would I do it? </strong></em>[...]<br/>\n<strong><em>You should be <span style=\"text-decoration:underline\">your build's worst enemy</span>.</em></strong></div></blockquote>\nOur dear colleague <em class=\"mention\">@webshaman1</em> has been working hard on a very special build and defeating a series of very serious challenges on his PW server.<br/>\n<br/>\n<em class=\"mention\">@Yogmister7</em> and I have been working on a special build of our own. It is called 'The Slayer of the Night'.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202002/10759084_f7d838ec04abeda7a75d3ef5db29600a_t.jpg\"/><br/>\n<strong>Features:</strong><br/>\n- Str 30, Dev Crit DC 40-46, Base AB 49, WF/EWF/IC/Ki Critical/WS/EWS: Greatsword, Blind Fight/Knockdown<br/>\n- 592hp, EDR III (9/-)<br/>\n- 159 skill points for UMD, Tumble, Discipline, Spot/Search<br/>\n<br/>\n<strong>The only solution our dear WebShaman? Run.</strong><br/>\n<br/>\nComments welcome, as always :)<br/>\n<br/>\nIf you have a better 'Slayer of the Night' feel free to post it up.<br/>\n<br/>\nMaybe if the DMs are smart they will review this thread and spawn a few 'Nightslayers' of their own? :)<br/>\n<br/>\n[This should <em>definitely </em>stimulate some more forum activity...]<br/>\n<details><summary>Spoiler</summary>Fighter(10), Rogue(2), Weapon Master(28), Dwarf\nSTR: 16 (30)\nCON: 18 (21)\nINT: 13\n\n01: Rogue(1): Expertise\n03: Fighter(2): Dodge, Mobility\n05: Fighter(4): Weapon Specialization: Greatsword\n07: Fighter(6): Whirlwind Attack\n09: Weapon Master(2): Knockdown\n11: Weapon Master(4)\n13: Fighter(7)\n15: Weapon Master(6): Cleave\n17: Weapon Master(8)\n19: Weapon Master(10)\n21: Weapon Master(11): Great Strength I, (STR=19)\n23: Weapon Master(13): Epic Damage Reduction I\n25: Weapon Master(15)\n27: Weapon Master(17): Great Strength III, (STR=22)\n29: Weapon Master(19): Overwhelming Critical: Greatsword\n31: Weapon Master(21)\n33: Weapon Master(23): Great Strength V, (STR=26)\n35: Weapon Master(25): Epic Weapon Focus: Greatsword\n37: Rogue(2): {Evasion}\n39: Weapon Master(27): Great Strength VII, (STR=29)\n\nSkillpoints: 159\nSaving Throw bonuses: Spells: +2, Poison: +2\nAB (max, naked): 49 (melee), 30 (ranged)\nSpell Casting: \n\n\n01: Disable Trap(1), Intimidate(4), Open Lock(1), Search(4), Set Trap(1), Spot(4), Tumble(4), UMD(4), Save(13), \n03: Discipline(1), Save(13), \n05: Discipline(1), Save(17), \n07: Discipline(1), Save(21), \n09: Discipline(1), Spot(1), Save(17), \n11: Discipline(1), Spot(1), Save(19), \n13: Discipline(1), Save(22), \n15: Discipline(1), Spot(3), Save(23), \n17: Discipline(1), Spot(1), Save(25), \n19: Discipline(1), Spot(1), Save(27), \n21: Discipline(1), Spot(2), Save(29), \n23: Discipline(1), Save(32), \n25: Discipline(1), Save(36), \n27: Discipline(1), Save(40), \n29: Discipline(1), Save(44), \n31: Discipline(1), Save(48), \n33: Discipline(1), Save(52), \n35: Discipline(1), Save(56), \n37: Tumble(36), UMD(31), \n39: Discipline(1), Spot(2), </details></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:55 AM - Feb 06, 2020",
      "content": "<div>Hmmm...interesting!<br/>\n<br/>\nThe EDR is not really a problem - Divine damage and Positive damage go through it (but, that is environment dependent).  Otherwise, not bad.  Good protection!  I guess it really depends on what is available UMD wise in the environment as to what can be done about damage.<br/>\n<br/>\nAC is really low.  I might be able to get you with a Stun fist, and definitely with a Quivering Palm, I think.  That fort save is not that high.<br/>\n<br/>\nYou have no Uncanny Dodge.<br/>\n<br/>\nSo if I am HiPSing...and you can't see or notice me...I believe that tumble AC is gone as well (flat-footed).  I suppose you could just do continual Whirlwinds (though with ED...it will miss).<br/>\n<br/>\nThat AB is nice.  With the right weapon, it will probably hit AC 75 (this AC is item dependent, but conforms to a +5 environment aka WoG).  With a 49 base AB, you should be able to get into hitting range, and crit range as well.  I don't know about the second attack at -5 AB, however.  That would put your base AB at 44.<br/>\n<br/>\nNote that Greatsword does not have a really good crit range...you will probably want a keen one.<br/>\n<br/>\nYou have a problem, tho.<br/>\n<br/>\nI sneak (you can't see me - unless there is true TS available ;) ) I hit, run.  Monk speed is so fast, you will not be able to really do anything about the hit and run - and the first successful attack will miss, anyway (ED).  Note that my build has HiPS.  Now, in an environment where HiPS is not nerfed, or on a timer (and no true TS), that means HiPS spamming.  Your build will not hit anything as it continually loses \"focus\".<br/>\n<br/>\nIF you roll a 1 - you will get paralyzed (Ass Death Attack)...so you will need some immunity to that.<br/>\n<br/>\nI can do this indefinitely, so...you will roll a 1.  No immunity...you are dead.<br/>\n<br/>\nIf I make a mistake, you might get me.  Bad luck for me.<br/>\n<br/>\nWhen it comes to UMD - any buffs I can blow off with pretty much impunity from a distance, because you cannot close the distance.  I might just decide to UMD you from a distance.  You have no spell immunity, and your Will saves are abysmal.<br/>\n<br/>\nRemember, my build does not really rely on magic at all (in buff form).  It benefits greatly from magic items, yes.  But magic buffs, if it has the right magical items, it does not need - though both DP and PnP TT are very helpful, of course (and all the other AB raising buffs).<br/>\n<br/>\nIt is hard to dispell what one cannot see, however.  Or target (HiPS).  <br/>\n<br/>\nYour spot is way too low.  And that Wis...your build will require real TS.  A boatload of immunities to protect from UMD scroll/wand/x against that Will save.  One Bigby will end your day.  <br/>\n<br/>\nInteresting would be a Timestop duel (assuming it is available for UMD).<br/>\n<blockquote><div>character attacking from shadows will always start first as his target cannot even see him </div></blockquote>\n\nThis lasts for the 1st round.  <br/>\n<br/>\nSo attacking, breaking off, HiPS, run...wait.<br/>\n<br/>\nRinse, repeat.<br/>\n<br/>\nYour build will need real TS to succeed at melee.  Ranged, it is a whole different contest.  Now, I can stay away from you until you run out of real TS uses, unless you have it on an item permanently.  You will need this to avoid getting nailed by ranged UMD spells.<br/>\n<br/>\nIn fact, your builds greatest weakness is spells.<br/>\n<br/>\nBut let us consider this with just the mundane items...hehe.<br/>\n<br/>\nI am going to HiPS you to death.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:09 AM - Feb 06, 2020",
      "content": "<div>Monk35/SD5 (and UMD variants) is one of the best defensive builds in NWN, period. Across every server I've played on I have never seen a PvP build that can RELIABLY kill a Monk/SD in 1v1 open world PvP. In a 1v1 duel situation where the builds are forced to fight this changes, but as long as the Monk/SD can run away almost all 1v1 fights will end in either a Monk/SD win or a draw.<br/>\n<br/>\nI think webshaman1 has already pointed out most of the key issues this build will have in a 1v1 duel situation. Your build has high AB, high damage, 9/- Physical DR and Dev Crit, but without vanilla True Seeing it can't reliably compete with HiPS spamming. Even if you rebuilt it as a spotter elf my money would still be on the Monk/SD.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:09 AM - Feb 06, 2020",
      "content": "<div>I have laid down the gauntlet to our dear WebShaman.<br/>\n<br/>\nWeb believes our build, whilst formidable, will be beaten by Nightshade (provided our build doesn't start off with a lucky dev crit).<br/>\n<br/>\nIt is time for others to step up to the plate and see who can defeat Nightshade :)<br/>\n<br/>\nThis is not the time for fence sitting. <br/>\n<br/>\nGet at that WebShaman, the elite builders of the ECB!<br/>\n<br/>\n<strong>Edit:</strong> <br/>\nUncanny dodge can be easily added by going a Fighter 12 / Rogue 3 / WM 25 level split, at the cost of 1 AB.<br/>\n<br/>\nAlso looks I was ninja'ed by Yunim. <br/>\nIn terms of environment, I agree with Yunim here that an open space Nightshade can run, but in a locked space, Nightshade will struggle. <br/>\n<br/>\nPut Nightslayer in a 2x2m locked cage with Nightshade, I believe Nightshade has no chance against this 600-840hp EDR III Base AB 49 massive crit monster. <br/>\nNightshade can tickle the Nightslayer with his divine damage gloves for 5 damage, but one dev crit = bye bye.<br/>\n<br/>\n<strong>Further edit:</strong><br/>\n<em class=\"mention\">@webshaman1</em> brings up death attack, but in an environment where freedom is available on items, equip one of those, and <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Talk:Death_attack\" rel=\"noreferrer\" target=\"_blank\">death attack is irrelevant</a>.<br/>\n<br/>\nI believe Web's suggestion that UMD is this builds weakness is correct and really the way Nightshade would (and should) deal with Nightslayer.<br/>\nMy favored solution for Nightshade to deal with Nightslayer would be Haste -&gt; Time Stop -&gt; Mords -&gt; Bigby's.<br/>\n<br/>\nHowever if Nightslayer gets the first attack in, he should <br/>\n1. Equip an item with True Seeing (they exist in WoG, I have 3 of them amongst my characters) <br/>\n2. Haste -&gt; Time Stop -&gt; Potion of True Strike (instant AB +75) -&gt; Attack -&gt; Time Stop -&gt; Potion True Strike -&gt; Attack [continue sequence] until Devastating Critical is landed. <br/>\n<br/>\nI think much depends on who gets the first Time Stop scroll off.<br/>\n<br/>\nIt is much easier for Nightshade once that Bigby's lands however, Nightslayer does not have that luxury to seriously use Bigby's against Nightshade.<br/>\n<br/>\nThe item with True Seeing has limitations including an abysmal AC but would be, in my view, the best way to deal with the HiPS in Nightshade's arsenal. <br/>\n<br/>\nI didn't go Scimitar based on feedback from Yogmister, he felt that a big two handed sword was necessary to penetrate any possible DR belts Nightslayer might have equipped, this was what scared him most when playing this Epic Dodging Monk/SD/UMD'er. <br/>\n<br/>\nNightshade might save a few dev crits and have a greater swordman's belt equipped, landing huge critical hit damage (x3) with two handed weaponmaster was felt to be the way to go, even if Dev crit doesn't occur, HP decimation will, finally ending the terror of Nightshade on the WoG PW server.<br/>\n<br/>\n<strong>Further Edit 2:</strong><br/>\nOne other thought. Spell resistance on items. I usually ignore this, but would this be useful against Bigby's scrolls? Is this property lowerable with Mords/Breaches? Something I will want to read up on.<br/>\n<br/>\n<strong>Further Edit 3:</strong><br/>\nAnd I will partially answer my question. Maybe. <br/>\n<br/>\nHighest SR in items is 32. Bigby's 9 scrolls have CL 20. <br/>\n<br/>\nSpell resistance check = d20 + caster level + spell penetration  vs. SR<br/>\n20 + d20 vs 32<br/>\n = need to roll 12 or more to equal or beat SR which leads to spell succeeding. <br/>\n<br/>\nSo the Nightslayer will need to equip a high SR item to defeat Nightshade.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:29 AM - Feb 06, 2020",
      "content": "<div><blockquote><div><cite>Yunim wrote: <div class=\"responsive-hide\">Feb 06, 2020</div></cite>Monk35/SD5 (and UMD variants) is one of the best defensive builds in NWN, period. Across every server I've played on I have never seen a PvP build that can RELIABLY kill a Monk/SD in 1v1 open world PvP. In a 1v1 duel situation where the builds are forced to fight this changes, but as long as the Monk/SD can run away almost all 1v1 fights will end in either a Monk/SD win or a draw.<br/>\n<br/>\nI think webshaman1 has already pointed out most of the key issues this build will have in a 1v1 duel situation. Your build has high AB, high damage, 9/- Physical DR and Dev Crit, but without vanilla True Seeing it can't reliably compete with HiPS spamming. Even if you rebuilt it as a spotter elf my money would still be on the Monk/SD.</div></blockquote>\nYunim, I want you to turn this around on its head and think from the perspective of the Monk35/SD5 massive ISR player.<br/>\n<br/>\nWhat am I scared of the most? What actually would do the best job of killing me?<br/>\n<br/>\nSuch a build might not exist, but it is an interesting intellectual exercise.<br/>\n<br/>\nWith all the failings of the Nightslayer you have brought up, I believe this is the best I can come up with, but I want to see what you can come up with, with your building knowledge and prowess. It doesn't matter if it fails, because it probably will.  But at least the Nightslayer has a chance, unlike many other builds. Even if it is 10% with Time Stop/True Strike cheese, its better than 0%.<br/>\n<br/>\n<strong>Edit:</strong><br/>\nOne other comment on HiPS<br/>\n<br/>\nIn detect mode, a player will detect stealth 5 times / second with 1d20 rolls + spot score vs hide.<br/>\nIn normal mode a player will detect stealth 5 times / second with 1d10 rolls + spot score vs hide.<br/>\nOn WoG HiPS is once every 6 seconds.<br/>\nTherefore detecting stealth is checked 30 times more often than one can HiPS, in a PvP situation in WoG.<br/>\n<br/>\nBoosting that spot score within 10-20 of Nightshade's Hide score will basically mean Nightshade is detected by Nightslayer and HiPS may be ineffective.<br/>\nI can boost spot a little higher by doing a F12/R3/WM25 at the cost of 1 AB, and dropping a little UMD, search, even the high value set trap/disable trap points.<br/>\nThe highest base modified Spot score is going to be 42, which could be boosted by items (ie Watchman's Helm) meaning that a True Sight item might not be completely essential, to defeat Nightshade's HiPS.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:33 AM - Feb 06, 2020",
      "content": "<div>One word: Mage</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "6:50 AM - Feb 06, 2020",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote: <div class=\"responsive-hide\">Feb 06, 2020</div></cite>One word: Mage</div></blockquote>\nSorry Mick, I believe we haven't given you appropriate context for you to participate.<br/>\n<br/>\nWebShaman has a special 'WoG Destroyer build' which he is using to defeat every challenge solo (the areas are designed to be challenging for a party).<br/>\n<br/>\nThis is a nearly spell immune Monk / SD with epic dodge and UMD.<br/>\n<br/>\nThis build is a slightly cheesy jab at Web to see if we can make a build that can actually kill his character.<br/>\n<br/>\nA mage unfortunately is not the solution, unless it has real true seeing, epic spell penetration, caster level 40 and rolls like a 20 to beat spell resistance with that Bigby's.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:24 PM - Feb 06, 2020",
      "content": "<div>The problem with your detect scenario is that HiPS causes you to drop out of combat, regardless of whether you make the check or not.<br/>\n<br/>\nSo you need vanilla TS.<br/>\n<br/>\nOn WoG, there is a set of +5 Robes with vanilla TS.  My Nightshade wears them (where needed).<br/>\n<br/>\nI will remind you that my build has Shadow Daze :<br/>\n<blockquote><div>Once per day the shadowdancer may inflict an illusory daze upon a target. This daze lasts for 5 rounds.<br/>\n<strong>Use:</strong> selected <br/>\nNotes Edit\n<ul>\n<li>Added in the expansion packs.</li>\n<li>This feat allows a will saving throw to negate the effect, with a DC of 10 + dexterity modifier + shadowdancer level.</li>\n<li>This ability can be used at long (40 meters) range. </li>\n</ul>\n</div></blockquote>\n\nThis targets your weak Will save with a very powerful DC Daze that will last 5 rounds.  This then brings up Quivering Palm <blockquote><div>If the character makes a successful attack after activating the ability, the target must make a fortitude save (DC 10 + half the monk's character level + the monk's wisdom modifier) or die. </div></blockquote>\n\nEven though Fort is your high save, the DC is going to be 10+17+2~3.  That is a DC of ~30.  Your Fort is 24.  I got an ok chance to nail you.<br/>\n<br/>\nAs for you going first, it is not going to happen.  Initiative (as it is figured in NWN) is Dex based.<br/>\n<br/>\nUnless you get a surprise round (and the opposite is realistically true), you will almost never beat my initiative roll.\n<blockquote><div>The roll is a d20 plus the character's dexterity modifier, plus bonuses from feats.</div></blockquote>\n\nYour Dex of 13 is...low.  +1 modifier.  Nightshade's Dex is really high.  Like, sky high.  All points in Dex.  Your build has no bonuses from feats.<br/>\n<br/>\nWe could decide to do this in a +5 item environment.  You want to confine the space - just make it a 1x1 cm square...hehe, just kidding!  You are trying to \"move the goal posts\" to your build's overwhelming advantage!  Just make it easier on yourself, and say the Nightshade has no legs and can't move.<br/>\n<br/>\nEven in a PnP arena, there is more space than 2x2.  I don't think you realize how fast a high level Monk really moves...<br/>\n<br/>\nEven if your build had vanilla TS, it is extremely vulnerable to Nightshade's ranged attacks (which are Dex based, and guess who is a Dex based build?)  One nice heavy xbow...ouch!  True, that EDR of +9 will tank most of it (unless the bolts also have elemental/divine/Pos/Neg damage).  Crits will HURT!  And as your build has no way to actually catch Nightshade, she can kite you all day.<br/>\n<br/>\nDown to the spell challenge.<br/>\n<br/>\nBasically, who gets off the Timestop first?  Nightshade (higher initiative means she goes first) assuming that is what we are doing (in any environment where Timestop is available in UMD form, is going to be advantageous to both as UMD users, so only Initiative is going to matter here).<br/>\n<br/>\nAs your build has a weak Will save...any hand spells targeting you that affect Will is going to be a huge threat.  In fact, any spell that targets your weak Will save is going to be a threat.<br/>\n<br/>\nI don't consider your Nightslayer to be a slayer at all.  It will only have a chance under select conditions that are advantageous to the build and disadvantageous to the Nightshade build.  That is not a condition of fairness.<br/>\n<br/>\nPerhaps another Nightshade? <span class=\"text-emoji\">😂</span><br/>\n<br/>\nTo kill Nightshade, you need Nightshade!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:18 PM - Feb 06, 2020",
      "content": "<div><blockquote><div><cite>Orion2019 wrote: <div class=\"responsive-hide\">Feb 06, 2020</div></cite><blockquote><div><cite>Mick Dagger wrote: <div class=\"responsive-hide\">Feb 06, 2020</div></cite>One word: Mage</div></blockquote>\nSorry Mick, I believe we haven't given you appropriate context for you to participate.<br/>\n<br/>\nWebShaman has a special 'WoG Destroyer build' which he is using to defeat every challenge solo (the areas are designed to be challenging for a party).<br/>\n<br/>\nThis is a nearly spell immune Monk / SD with epic dodge and UMD.<br/>\n<br/>\nThis build is a slightly cheesy jab at Web to see if we can make a build that can actually kill his character.<br/>\n<br/>\nA mage unfortunately is not the solution, unless it has real true seeing, epic spell penetration, caster level 40 and rolls like a 20 to beat spell resistance with that Bigby's.</div></blockquote>\nOK - got it<br/>\nMy suggestion was directed at killing the OP build with it's mediocre/low saves and everything.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:39 PM - Feb 06, 2020",
      "content": "<div>Normally you would be right Mick - of course.<br/>\n<br/>\nBut with what are you going to target those saves?  Not spells (well, you could, but the chance of actually landing any is remote - although possible).<br/>\n<br/>\nAbilities?  If you can't hit it, you can't affect it.<br/>\n<br/>\nI've been thinking about what would work.<br/>\n<br/>\nI am leaning towards some sort of Archer/Cleric combo that can Dev Crit at range - with sky-high pumped AB (so that the 2nd or 3rd hit is almost guaranteed).  The Fort save on Nightshade is not all that good.  The build will need some sort of high SR to avoid the UMD spell spam (assuming there is any - let's consider mundane stuff first).  I think this may be going in the right direction.<br/>\n<br/>\nBasically:<br/>\n<br/>\nSpeed and HiPSing needs to be nullified (Range plus spot, etc).  I think only a Cleric type will have a chance.<br/>\n<br/>\nHigh AB to nullify ED.<br/>\n<br/>\nThreat to weak save to kill fast.<br/>\n<br/>\nOne thing my build had a real hard time defeating was a high level Undead Caster/Monk regenerating beast, who attacked with fists.  Without the ability to breach shields, UMD Heal spells, etc, my build was :<br/>\n<br/>\n- Hardly able to hit due to very high AC (Epic Mage Armor).<br/>\n- What damage was done was undone by Regeneration.<br/>\n- Immune to Crits<br/>\n- Just as speedy and detecty<br/>\n- Dealt more damage to me than I to it.<br/>\n<br/>\nAll in all, only UMD saved me (Heals and Mass Heals against Undead = dead Undead).  Oh, and a Lesser Breach Wand.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:32 PM - Feb 06, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Feb 06, 2020</div></cite>Normally you would be right Mick - of course.<br/>\n<br/>\nBut with what are you going to target those saves?  Not spells (well, you could, but the chance of actually landing any is remote - although possible).<br/>\n<br/>\nAbilities?  If you can't hit it, you can't affect it.<br/>\n<br/>\nI've been thinking about what would work.<br/>\n<br/>\nI am leaning towards some sort of Archer/Cleric combo that can Dev Crit at range - with sky-high pumped AB (so that the 2nd or 3rd hit is almost guaranteed).  The Fort save on Nightshade is not all that good.  The build will need some sort of high SR to avoid the UMD spell spam (assuming there is any - let's consider mundane stuff first).  I think this may be going in the right direction.<br/>\n<br/>\nBasically:<br/>\n<br/>\nSpeed and HiPSing needs to be nullified (Range plus spot, etc).  I think only a Cleric type will have a chance.<br/>\n<br/>\nHigh AB to nullify ED.<br/>\n<br/>\nThreat to weak save to kill fast.<br/>\n<br/>\nOne thing my build had a real hard time defeating was a high level Undead Caster/Monk regenerating beast, who attacked with fists.  Without the ability to breach shields, UMD Heal spells, etc, my build was :<br/>\n<br/>\n- Hardly able to hit due to very high AC (Epic Mage Armor).<br/>\n- What damage was done was undone by Regeneration.<br/>\n- Immune to Crits<br/>\n- Just as speedy and detecty<br/>\n- Dealt more damage to me than I to it.<br/>\n<br/>\nAll in all, only UMD saved me (Heals and Mass Heals against Undead = dead Undead).  Oh, and a Lesser Breach Wand.</div></blockquote>\nWeb, I got it all wrong from the start.<br/>\nI suggested a mage build to take down the Fighter/ Rogue/ WM build posted in the original post, not the monk build.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:41 PM - Feb 06, 2020",
      "content": "<div>Well bless my stars and garters!<br/>\n<br/>\nI got it all wrong, then.<br/>\n<br/>\nHehe...sorry.<br/>\n<br/>\nYeah...that would definitely put a major cramp in Nightslayer!</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "3:58 PM - Feb 06, 2020",
      "content": "<div>I\"d just close a handcuff on the twerp (attached to my wrist as well), when he gets close to finish me off....<br/>\n<br/>\nI don't believe that there is much of a counter to this ancient build...that is, the high level monk, with two types of cheese. <br/>\nBetter players or environmental factors would play a role.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:00 PM - Feb 06, 2020",
      "content": "<div>Slippery wrists.<br/>\n<br/>\nWorks every time!</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "4:10 PM - Feb 06, 2020",
      "content": "<div>Didn't work for Frodo against Marv...<br/>\n<br/>\nI'm making an allusion to the movie Sin City</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "5:22 PM - Feb 06, 2020",
      "content": "<div>There are some issues with the offence of a Monk/SD but if properly built the defences are amazing. The build isn't completely invincible but most of the tactics that will work against it are either banned on PvP servers or are unreliable. It also depends on the size of the arena and whether the Monk/SD is actively trying to kill your build or just survive.<br/>\nMaking a build that a Monk/SD will struggle to kill isn't too hard, making a build that can reliably kill a Monk/SD is.<br/>\n<br/>\nQuivering Palm can only be used on lower level targets so in a 40 vs 40 PvP battle it won't work.<br/>\nDeath Attack actually isn't a problem for this build since you can spam WWA to prevent the paralysis roll. However, if you spam WWA then you won't be able to attack when the Monk/SD hits you and HiPS spam will gradually kill you before you can even land a hit.<br/>\nRegarding 32 SR, a Mords will reduce that to 22 SR at which point a Bigby9 scroll will have a 95% chance of beating your SR. If you have Freedom or Mind Spell Immunity and Mords scrolls then that will be less of a concern, but those buffs will have to be on items since a Mords will dispel them otherwise.<br/>\n<br/>\nI assume that you have never faced a HiPS build played by a competent player in PvP before? With +12 DEX a Monk/SD will have around 60 Hide/MS which can be beaten pretty easily by a dedicated spotter (assuming that there are an equal amount of Hide items and Spot items), but only a dedicated spotter can reliably spot a HiPSer. If you are not an elf spotter or if you do not have vanilla True Seeing then you will not touch a properly built HiPSer, even with a 6 second HiPS timer. If the HiPS timer was 2 or 3 rounds then you might have a chance, but due to how detect works you won't be able to spot a HiPSer with this build.<br/>\n<br/>\nAny decent melee build with access to Mords, vanilla Time Stop, and vanilla True Seeing will be able to kill it.<br/>\nFairly self-explanatory, True Seeing to prevent hiding in HiPS, Mords to dispel GSanc, Time Stop to stop time. Without True Seeing the Monk/SD can HiPS as soon as you start reading the scroll and you will struggle to detect them. This is less of an issue with a melee spotter, a properly built spotter should be able to detect the Monk/SD. Without Mords you can't dispel Gsanc, so you will either need to get lucky catching the Monk/SD out of GSanc or carry enough scrolls to keep time stopped until GSanc runs out. Without Time Stop this tactic is worthless. Since this is PvP the Monk/SD also has access to this tactic so it's not exactly reliable. Note that you can't simultaneously spam Time Stop scrolls and melee without messing up your timing, as soon as the first Time Stop is over the Monk/SD will be able to Time Stop you before you can use another scroll. Whoever casts Time Stop first wins, for obvious reasons this would not be a valid tactic on a balanced PvP server.<br/>\nExample builds: Cler28/Bard2/RDD10, Figh14/WM25/Bard1, Figh16/WM7/Wiz17.<br/>\n<br/>\nAttacking from stealth can potentially work if you get very lucky or are fighting in a small area.<br/>\nThis won't work if vanilla True Seeing is available or if the Monk/SD is able to run away. If the Monk/SD runs right past you while you are in stealth and you can click them before they zoom off you might be able to get 1 flurry in, if you can get past the high AC, 50% concealment, and Epic Dodge. Overall, not very reliable but it might work on a non-elf Monk/SD in an enclosed area.<br/>\nExample build: Rog13/Rang26/SD1.<br/>\n<br/>\nStacking 10 epic traps on one spot and luring the Monk/SD over them can work.<br/>\nYou have to stack enough traps for a OHK or it can just run away and heal. If the Monk/SD knows that you are using this tactic then there are multiple ways for them to disrupt it so it's still not a reliable tactic. It might work a few times but once the Monk/SD knows what you are doing and adapts to it you will have to get lucky to kill them.<br/>\nExample build: Rog19/Bard5/PM16.<br/>\n<br/>\nA high caster level mage with ESPen can potentially work.<br/>\nA pure Sorc40 or Wiz40 with ESPen has a 30% chance (potentially 20% chance) of beating the SR of a Monk35/SD5 and a 35% chance of beating the SR of a UMD variant. 38 or 39 caster levels are acceptable but I would avoid going below that, even though it means forfeiting 3 monk levels. You will need to have vanilla True Seeing or be an elf spotter in order to actually target the Monk/SD. Bigby6 is the only useful disabling spell against a Monk/SD and you will have to get past both SR and mantles in order to land it. If vanilla Time Stop is availably then alternating between Time Stop and nuke spells can work too. If the Monk/SD approaches in GSanc then you won't have any idea of where they are until they breach your shields and KD spam you to death.<br/>\nIf the Monk/SD has access to knockdown immunity, you lose. If you run out of Bigby6, you lose. If you don't have vanilla True Seeing or are not a dedicated spotter, you lose. If the area has plenty of corners that can be used to break your LoS, you lose. If you neglect discipline and fortitude, you lose.<br/>\nThis still isn't a reliable victory but it's probably your best option.<br/>\nExample builds: Sorc38/Pal1/Monk1, Sorc40, Wiz39/Rang1.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "6:21 PM - Feb 06, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Feb 06, 2020</div></cite>Slippery wrists.\n</div></blockquote>\nThat's a whole separate web site... $9.95 a month to view those pictures.....<br/>\n<br/>\nAlso an allusion to a whole different kind of Sin City....</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:17 PM - Feb 06, 2020",
      "content": "<div>Yeah Monk/SD like the Monk/Rak builds, they are extremely tough to kill, that being said, not impossible.<br/>\n<br/>\nWhenever you have problems with HiPS as a mage, summon a Mord's Sword, it is actually a helmed horror that has (Real) True sight.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:50 PM - Feb 06, 2020",
      "content": "<div>RE HiPS<br/>\nI speak specifically regarding the 6 second timer is on WoG and nothing else.<br/>\n<br/>\nIf you look at the NWN detect article you will notice a player checks spot/stealth 5 checks / second <br/>\nThis is in contrast with enemies/NPCs which check stealth much less frequently.<br/>\n<br/>\n5 checks / second x 6 seconds = 30 checks per HiPS attempt.<br/>\nIf spot is 50 vs 60 (I don't believe Web's build goes that high, but I am happy to be corrected because Web hasn't posted it yet) with 1d10 die and a 9 or 10 is needed to spot. (without detect mode)<br/>\n10% chance to detect per check. 90% not to detect.<br/>\nChance for Nightshade to successfully HiPS and remain unspotted for those 6 seconds = 34%.<br/>\nAdd more spot your chances go up.<br/>\nBut vanilla true seeing looks more reliable so I will ditch that idea.<br/>\n<br/>\nWeb goes ISR heavy, I believe the SR goes to 66 to counter epic spell pen casters (5% chance of successfully casting a spell). Casters are not really the solution to Nightshade.<br/>\n<br/>\nThe epic trap idea sounds sensible, and perhaps a large stack of epic frost traps (which don't take into account evasion) would do the trick. I don't believe Nightshade has a lot of search to ever get a search roll within 45.<br/>\n<br/>\nSome sort of 600 HP dev crit high AB EDR III monster with a greater brawlers belt / freedom / true seeing was the best I can come up with, lock Nightshade in a 2m x 2m cage, or Time Stop/True Strike cheese and get that dev crit or damage him sufficiently that he finally falls. <br/>\n<br/>\nAn archer was interesting and Yogmister7 thought that could work, With deflect arrows and epic dodge two arrows are going to miss/round. This uses up the first flurry assuming both arrows were going to hit.  Then an AA might have a base AB 50+ with rapid shot/haste have 6 APR, but the dev crit range is 19-20 (or 18-20 with a keen bow). Plus Nightshade can just run around a corner after that first flurry, then get the Bigby's ready.</div>"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "9:11 PM - Feb 06, 2020",
      "content": "<div>Is there a link to webshaman's build?<br/>\n<br/>\nSent from my SM-G955U using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "10:03 PM - Feb 06, 2020",
      "content": "<div>The build is a Monk34/SD5/Ass1 with Epic Dodge and high SR. I don't believe that webshaman1's specific build has been posted online but there are very few ways to make a decent Monk/SD so it's not hard to guess  what the build could be.<br/>\n<br/>\nYou're assuming that a Monk/SD will HiPS and then walk towards you in stealth mode to attack you. That might be how you use it in PvM and that might be how NPCs use it, but that is not how PvP HiPSers use HiPS. It is also why a 1 round HiPS timer does not matter at all to a competent player in PvP. Immediately after they HiPS you will have an action cancel, triggering this cancel is the key use of HiPS in PvP.<br/>\nHiPS actually works better on PCs than NPCs because of how often PCs detect. I have made 127 Spot elf builds that will sometimes lose track of 115ish Hide characters due to how detect works. Even if you have 80 Spot and are fighting a 60 Hide HiPSer, if you're not an elf it won't matter. If you don't have Keen Senses and are not in detect mode then your Spot is halved when rolling, not even 80 Spot will help you.<br/>\nIf a HiPSer attacks you you will have a -10 Spot modifier even if you don't fight back. The HiPSer will then disengage straight after the first flurry and run away. This negative modifier will last for 1 round, when the HiPSer is free to HiPS again. If the HiPSer is smart then they will also use summons such as Elemental Swarm to force you into combat even after they have disengaged. Elf helps here since they are in constant detect mode and so combat has less of an effect, although they will still have a -10 Spot modifier. A non-elf without vanilla True Seeing is not able to compete with a competently built and played HiPSer. If you don't build to fight a HiPSer you will lose, that's part of what makes the feat so OP and is why it gets nerfed on so many servers.<br/>\n<br/>\nArchers won't work since they have to deal with high AC, Epic Dodge, Deflect Arrows, 50% concealment, and UMD. You can build for detect or have vanilla True Seeing, but unless you're a Monk/AA the Monk/SD will be able to hit you in melee without HiPS spamming. A Monk/SD can use HiPS to cancel your attacks, run in IExp to get into melee range, and then use melee or UMD to finish the archer off. A Monk/AA is the best option since they have the AC to semi-tank the Monk/SDs AB but ultimately the Monk/SD can still win by (ab)using UMD.<br/>\n<br/>\nYou can have 67 SR and you can have Epic Dodge but you can't have both at the same time. A Monk35/SD5 will have 61 SR if it takes Armor Skin or 63 SR if it focuses on SR. A Monk34/SD5/Ass1 or Monk34/SD5/Rog1 will have 60 SR. A Sorc39/Pal1 with ESPen will have a 30% chance of beating the SR of a Monk34/SD5/Ass1. If vanilla True Seeing is available then that's probably your best bet against a Monk/SD in an enclosed area, although it's still not a reliable counter for reasons given above.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:33 PM - Feb 06, 2020",
      "content": "<div>I buggered up my math forgetting the stealther has a die to roll as well.<br/>\nJust equip an item with proper true seeing if you can, is the appropriate answer.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:13 PM - Feb 06, 2020",
      "content": "<div>Nightshade has over 60 HS and MS.<br/>\n<br/>\nWith the appropriate items...wow.  Would be much higher.<br/>\n<br/>\nI have found on WoG that one doesn't need a higher HS and MS, however.<br/>\n<br/>\nThere are those who can see you (due to Monster feats or vanilla TS), and those who can't.<br/>\n<br/>\nThose that cannot, around 65 HS and MS is more than enough.<br/>\n<br/>\nAnother thing that is interesting, is that the AI will not target Nightshade with spells.  Even when it could, theoretically, have a chance.<br/>\n<br/>\nI guess the chance is too low for the AI threshold to try it (sort of like with other Feats aka KD, etc).<br/>\n<br/>\nAt least, that has been my experience.<br/>\n<br/>\nWell, except Greater Ruin, of course.  I hate that spell!<br/>\n<br/>\nOh, and Nightshade can Set Traps as well.  <span class=\"text-emoji\">😁</span></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:31 AM - Feb 07, 2020",
      "content": "<div>Right I figured it out.<br/>\n<br/>\nPretty lady (or man).<br/>\n<br/>\nSet 50-100 epic frost traps. (Yunim's suggestion)<br/>\n<br/>\nSeduce Nightshade to the traps. <br/>\n<br/>\n(If Web is playing the character, seduction goes as follows: I have a spare Solid 5/- socket gem to trade with you, interested?)<br/>\n<br/>\nNightshade runs at the speed of light not detecting the traps in time.<br/>\n<br/>\nExplosion. <br/>\n<br/>\nJob done. No need for EDR III or Dev Crit.</div>"
    },
    {
      "author": "MentalDekay",
      "avatar": "10759116_1563898639.jpg",
      "timestamp": "2:40 AM - Feb 07, 2020",
      "content": "<div>Defence wins championships. Just sayin'.. <span class=\"text-emoji\">😁</span><br/>\n<br/>\nThe battle would be fun to watch tho.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:35 AM - Feb 07, 2020",
      "content": "<div>Just as long as I get the Solid gem, everything's good! <span class=\"text-emoji\">😁</span></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:36 PM - Feb 07, 2020",
      "content": "<div>Nightshade has completed her training, and conquered WoG!<br/>\n<br/>\nExpect the Build in these hallowed halls soon...</div>"
    }
  ]
}