{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "532",
  "name": "A decent shifter/druid build?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/a-decent-shifter-druid-build-t515372.html",
  "author": "Shahadet",
  "avatar": "10235222_1510287070.jpg",
  "replies": 6,
  "posts": [
    {
      "author": "Shahadet",
      "avatar": "no_avatar.png",
      "timestamp": "7:21 AM - Jul 25, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hey building maestros!<br/>\n<br/>\nI was talking to someone on the old forums (before they died) about the best way to build a shifter for a low magic world where max level is 22.<br/>\n<br/>\nShe recommended something along the lines of: Druid 9/Monk 2/Shifter 11, or Druid 10/ Monk 1/Shifter 11.<br/>\n<br/>\nThe Shifter 11 was to get to the epic Greater wildshape II forms (gargoyle,harpy,minotaur), with Undead shape as the epic feat to take, since it has no min Wisdom requirement.<br/>\n<br/>\nIf anyone else could give me some advice on how to go about building a solid shifter that is good at solo action, but also interesting to play in a party, that would be greatly and gratefully appreciated.<br/>\n------------------------------------------------<br/>\n<br/>\nSome more info (hopefully useful!):<br/>\n<br/>\n- I need to be able to solo effectively.  While playing with friends are fun, I am often times the only person on my server, and I'd like to level more than once every 2 months.<br/>\n<br/>\n- Roleplay is nice, but being a \"power gamer\" doesn't bother me - I like being an effective character, whether that be as a healing support guy for the party, or buffing myself and shifting into a good combat form on my own<br/>\n<br/>\n- the PW I usually play on is a \"low magic\" world.  Weapons are a max of +3, Armor only gets upto +5 if a character crafts it himself, stat boosting items only go upto +2, likewise for other items.  Item level restrictions are turned ON, so no 1st level characters wearing +5 armor.<br/>\n<br/>\n-----------------------------<br/>\n<br/>\nOkay, I think that's it - as I said above, so far I've figured on D9/M2/S11, to get 5th level druid spells, monk cheese + 2 stat dumps for Tumble and Discipline, and Shifter 11 to get to Epic wildshape II + Undead shapes.<br/>\n<br/>\nBut I'm totally amenable to hearing other build types.<br/>\n<br/>\nThanks!<br/>\n-S<br/>\n<br/>\n<br/>\n<br/>\nThanks!<br/>\n- a newbie character builder<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:26 PM - Jul 25, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just so that I have this clear myself, a few questions...<br/>\n<br/>\nYou are looking for a shifter build for a low-level world that has a 22-level cap on it... correct?<br/>\n<br/>\nThis is primarily for partied PvM? (i.e. no dueling)<br/>\n<br/>\nIf you have played this server before, how effective is spellcasting in general?  Are the Monster SRs, saves &amp; immunities such that spellcasting is a useful adjunct to the standard combat or have casters' effectiveness been seriously nerfed with uber monster modifications?<br/>\n<br/>\nAre there any shifter forms you feel you would enjoy playing more than others (other than the undead forms) or rather just allow the situation to dictate the best form?<br/>\n<br/>\nKeep in mind that though undead shape can become very powerful, they can be turned easily by clerics, at least that's been my own experience. So to that point, it is good to either develop a secondary attack to handle clerics or just avoid them altogether.  But with 22 levels, it will be tough to do that.  Other than confrontations with divine enemies, a Risen Lord is an excellent choice with the full merge repertoire.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Shahadet",
      "avatar": "no_avatar.png",
      "timestamp": "2:19 AM - Jul 26, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong>Just so that I have this clear myself, a few questions...</div></blockquote>\n\nHey Hip!  Thanks for responding - answers in line below....<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong>You are looking for a shifter build for a low-level world that has a 22-level cap on it... correct?</div></blockquote>\n\nCorrect - max level is 22, and looks to stay that way forever.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong>This is primarily for partied PvM? (i.e. no dueling)</div></blockquote>\n\nCorrect again - the world originators hate PvP and specifically outline the monsters/NPCs as the antagonists, with the players being the protagonists.  This goes inline with their \"No evil PCs allowed\" policy.  Not that this applies to a shifter, but there is also a \"No Pick Pocketting\" policy too.<br/>\n<br/>\nWhich isn't to say they haven't ever had evil PCs, but the DMs made sure that it was all part of the roleplay/story telling.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong>If you have played this server before, how effective is spellcasting in general?  Are the Monster SRs, saves &amp; immunities such that spellcasting is a useful adjunct to the standard combat or have casters' effectiveness been seriously nerfed with uber monster modifications?</div></blockquote>\n\nThis is an interesting question.  This particular server (which I have played before many times, and in fact is the only multiplayer NWN I've ever done), suffers from the classic case of \"in D&amp;D 3.5, spell casters are king\".  It's one of my main gripes with the server - that magic items that help other classes compete with those that can cast 9th level magic are simply unavailable, ensuring that the spell casters remain dominant....<br/>\n<br/>\nThe module builders have made SOME attempts to create maps and monsters that have high SR, good saves, some immunities, etc, but for the most part this is limited to the upper level maps (i.e. 15th-22nd level).  Also, enemy monsters with class levels (Cleric,Wizard, Druid) will pop up as well - you've never had a proper beat down until a Minotaur Apprentice knocks you down with Balagran's Horn several times, while other Minotaurs chop you into little pieces...<br/>\n<br/>\nThis server is pretty nifty in the sense that \"Nexus: the City between the Veils\" operates on this idea of a central city \"base\", surrounded by planar \"ocean gates\" that can be traversed - as a result, parties of adventurers can go to different lands that mimic Japan, frozen Jotunheim, medieval Italy/England, Arabia, etc....<br/>\n<br/>\nCertain of these lands/maps are easier than others, and players learn which ones they can handle at their current level.<br/>\n<br/>\nThere IS a predominance of critters that have the Undead/Elemental/Construct type, which makes relying on critical hits/sneak attacks very problematic.<br/>\n<br/>\nAnd I know of at least one map, where there are Gemstone Golems that just have plain old \"Spell Immunity\" - and they hit really hard too! <br/>\n<blockquote><div><strong>HipMaestro wrote:</strong>Are there any shifter forms you feel you would enjoy playing more than others (other than the undead forms) or rather just allow the situation to dictate the best form?</div></blockquote>\n\nI think I would enjoy having as many forms as possible to choose from, and allowing each tactical situation to dictate which form to use.  <br/>\n<br/>\nIn that regard, knowing what feats/skills to take to help make each of the forms useful is one of the things I'm still trying to grasp.  For example, the humanoid forms (Kobold/Drow/lizardfolk) seems kind of sketchy to me - I'm not sure if I understand the utility/power of these forms....<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong>Keep in mind that though undead shape can become very powerful, they can be turned easily by clerics, at least that's been my own experience. So to that point, it is good to either develop a secondary attack to handle clerics or just avoid them altogether.  But with 22 levels, it will be tough to do that.  Other than confrontations with divine enemies, a Risen Lord is an excellent choice with the full merge repertoire.</div></blockquote>\n\nThis is good to know, as there are in fact several maps on this server that have monster Clerics, all of whom are scripted to fire off \"Turn Undead\" as soon as they see one (as I have learned from using Animate Undead with my Wizard character - fortunately, the summoned Skeleton Chieftain has +10 turn resistance, so I have yet to lose it to a turn effect).<br/>\n<br/>\nBut that said, many of the higher level maps will probably require me to use an Undead form, as their immunity to getting Critical'd, immunity to death effects, and 50% slashing/piercing immunity gives them a HUGE advantage on many of the server's maps.<br/>\n<br/>\nSo - if you have some advice for how a Shifter can handle enemy Clerics/Wizards, I would definitely be most appreciative!<br/>\n<br/>\nThanks in advance for any build advice you give me!<br/>\n-S<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "5:12 PM - Jul 26, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A tough one. Level 22 cap is no good for shifters. Druid 10/Shifter 11/Monk 1 (Druid 10/Shifter 10 preepic) to get an extra AB point at the cost of delaying Monk until 22nd lvl or Druid 9/Shifter 11/Monk 2 for an earlier monk lvl  at the cost of -1 AB. I'd go with a starting spread like STR 12, DEX 14, CON 14, WIS 15, INT 14, CHA 8, pump  WIS up to 20 and I'd get myself Zen Archery, PBS and RS, Scribe Scroll or Craft Wand, Extend Spell, Blind Fight, Toughness and obviously Alertness. In epic lvl 21 Shifter 11 and grab Undead Shape of course and Monk at lvl 22 for skill dumps. <br/>\n<br/>\nUnrelated but using shifted shapes, Druid 20/Monk 2 with Weapon Finesse for Air Elemental wouldn't be a bad lvl 22 build at all. Wis pumping and Zen Archery here too, plus real caster power (at 21st lvl you can get ESF btw), great summons, a strong animal companion. Druid 21/Monk 1 to grab an epic spell (Mummy Dust or Dragon Knight) instead of ESF.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:13 PM - Jul 26, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There is a solid LN Human build with a STR9/DEX14/CON12/WIZ17(22)/INT14/CHA8, Druid 6/Shifter 11/Monk 5 split, that will provide Called Shot, KD/IKD &amp; Cleave for all forms as well as the monk progression for all unarmed shapes with the 10% speed boost.  There are a couple minor variants that can alter it to be more defensive by subbing Dodge/Mobility for the KD/IKD feats or even implementing Extend Spell to help the few short duration buffs last longer.  It's really a matter of what the specific environment provides that would determine which is of the most value to implement.  One major disadvantage of using a monk tertiary is that if there are uber weapon categories that can be merged that are not available within druid/monk wpn proficiency limits, you will be out of luck.  But monk is a \"natural\" tertiary, generally speaking.<br/>\n<br/>\nWhat one needs to keep in mind designing a shifter (aside from choosing a suitable tertiary class) is that most of the abilities get overwritten by the forms so it is best to set those initial levels only high enough to select the desired feats, then fill in any gaps as seems most productive (Int 13 raised to Int 14, for instance). The base pre-shifted AB will always be horrendous but will quickly adjust according to the strengths of each form. Within the scope of a 22 level cap build, the forms that would be most reliable (IMO) would be a wyrmling using Imp Expertise, a sneaking finessing kobold commando with full druid stealth buffs and a nasty Risen Lord scyther with access to a wide range of combat attacks (even whirlwind!).<br/>\n<br/>\nThe build I have in mind (*humming and chewing fingernails*) maxes Discipline, the stealth skills (Hide/Mv sil), the detection skills (Listen/Spot), spells saves (Spellcraft) and innate AC (Tumble) within the 22 levels.  I consider the approach as a basic template for shifters not dedicated to achieving any one specific goal (eg. Dragon form or Rak).<br/>\n<br/>\nDruid buffs are few but can still be used effectively to boost all the forms equally (eg. Resistance, Blood Frenzy, Bull's, Barkskin, Protect from Elements, Camouflage, One with the Land, etc).  Offensive casting as a druid shifter will be very limited with the low DCs.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "7:24 PM - Jul 26, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong>There is a solid LN Human build with a STR9/DEX14/CON12/WIZ17(22)/INT14/CHA8, Druid 6/Shifter 11/Monk 5 split</div></blockquote>Why not Druid 5/Monk 6? Free KD/IKD and +10% speed are a nice \"temptation\".<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:51 PM - Jul 26, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>KailPendragon wrote:</strong><blockquote><div><strong>HipMaestro wrote:</strong>There is a solid LN Human build with a STR9/DEX14/CON12/WIZ17(22)/INT14/CHA8, Druid 6/Shifter 11/Monk 5 split</div></blockquote>Why not Druid 5/Monk 6? Free KD/IKD and +10% speed are a nice \"temptation\".</div></blockquote>\nBecause of the dump to spellcraft with Druid @ Level 20 to gain +3 for saves, the extra buff slots on spell levels 2 &amp; 3 plus losing a BAB (Dru6/Shf10/Mnk4 vs. Dru5/Shf10/Mnk5 pre-epic). I wanted the last monk level dump to occur at 22 to achieve the highest possible Discipline check (and all the other skills) while retaining the good saves from a late druid dump.  It was a very tight fit, though. <br/>\n<br/>\nTBH, I had the split you are suggesting set up first for the exact reasons you outlined, but after testing it a bit decided the saves/slots/AB boost was handier.  Either config works well but the advantages in game play seemed to tilt it just slightly in the direction I've settled on.<br/>\n<br/>\nEssentially, it is a balancing act with little room to maneuver with either one of the KD/IKD or the Dodge/Mobility combo advantages sacrificed for the sake of some buffing flexibility.  I chose the offensive feats rather than the defensive primarily because both dodge AC boosts can be easily negated.  But I would surely like the benefit of Extend Spell for buff duration with only 5 or 6 druid levels. That is the hardest feat to wave bye-bye for me.<br/>\n<br/>\nSounds like you are leaning more toward tossing the late pre-epic druid dump in favor of gaining the 1 or 2 AC-related feats (or perhaps spell duration)/move speed and sacrificing 1AB/+3 saves/extra slots?  When I had that set-up in place, I chose Dodge/Extend Spell and ignored Mobility altogether, except I was losing on my reflex saves too often and the additional speed didn't seem a significant factor.<br/>\n<br/>\nAhh... decisions, decisions.  Ain't building just grand? <br/>\n<br/>\n<br/>\nedit: Oh, forgot to mention, in case other aspiring shifters were unaware... epic minotaur gets KD for free but with IKD it is an even more formidable form swinging a greataxe with the size bonus.   <br/>\n<br/>\nAlso, Kail's question forced me into more detailed introspection of the splits so I noticed that if a single point were moved from DEX to STR, the melee AB could be increased by 1 at the cost of losing a ranged AB and reflex save.  This applies mainly to the unshifted form with all the overrides in effect, but it could make toting those loads of gear and goodies slightly easier.<br/>\n<br/>\nedit 2:  A <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=25&amp;t=70\" rel=\"noreferrer\" target=\"_blank\">picture</a> is worth a thousand words and salvation from carpal tunnel.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}