{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "008",
  "name": "On the Subject of Shifters...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/on-the-subject-of-shifters-t2356302.html",
  "author": "webshaman1",
  "avatar": "10404082_1510287071.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:03 PM - Jan 31, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Having seen Web's revelation of the recent changes to Shifter: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/a-big-heads-up-regarding-shifter-changes-in-the-ne-t2356298.html\" rel=\"noreferrer\" target=\"_blank\">https://www.tapatalk.com/groups/nwnecbguild/a-big-heads-up-regarding-shifter-changes-in-the-ne-t2356298.html</a> , and in the absence of a Shifter Guide here (though I've just finished reading Mark Sword's Guide in the WoG archive, but that was written just prior to v1.64's release, so has doubtless changed since then, and probably dramatically in some cases), I thought now might be a good time to discuss the class in some more depth - because I for one have only played it once, and that was with a Minotaur/ Risen Lord build (though I confess that I'm contemplating going with an Epic Drow Warrior shape build in the not too distant future) - and I remain fairly clueless about everything other than the basics.<br/>\n<br/>\nSo, I know you need at least 5 levels of Druid for Wildshape and the Alertness feat before the class opens up. I also know armour always merges with the shape, while weapons and/or items only merge depending on the shape chosen, gloves/braces never do, and all AC bonuses from gear default to the highest single bonus, which is taken as Deflection AC whatever it was beforehand. Many of the shapes also override your PC's stats, some severally, and certainly in most cases you can trash Strength at least. Wisdom, Intelligence and Constitution appear to be the most useful stats to raise, and if you can afford it, some points in Dexterity or Charisma might be useful for a particular build. I don't believe Weapon Focus merges (though that might just be for unarmed builds), but Improved Critical does, as does Epic Prowess. I know even less about caster shapes than \"real\" casters (if that's even possible).<br/>\n<br/>\nBasically, any information about the class would be very helpful.<br/>\n<br/>\nThanks in advance!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BluntAxe",
      "avatar": "10759579_1725807854.jpg",
      "timestamp": "9:25 PM - Feb 01, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've only played one shifter and it was still druid heavy 28 druid 2 monk 10 shifter.<br/>\n<br/>\nIt was designed to get the outsider shape at level 24 or 25 and used the Rakshasa form. It played as a caster druid casting disabling/ area damage  spells and then changed to Rak form and cast infinite maximized ice storms <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:29 PM - Feb 01, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, that all got nerfed with EE, and now, super nerfed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "BluntAxe",
      "avatar": "10759579_1725807854.jpg",
      "timestamp": "9:40 PM - Feb 01, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I did enjoy the build but shifters have been so heavily nerfed over the years that I have avoided them.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:34 AM - Feb 05, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Is that it, then?<br/>\n<br/>\nThat they've been nerfed and aren't worth the hassle any more.<br/>\n<br/>\nSeems a bit of a sorry indictment...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:52 PM - Feb 05, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well...let me put it this way...<br/>\n<br/>\nRak has been nerfed into the ground.  Practically unplayable now, so there is really no reason to play it <em>UNLESS </em>one is playing in a very low magic environment (and none really come to mind atm).  It used to have the meta-magicable unlimited Ice Storm ability (kind of nice, because Ice Storm has no save), and with lots of Druido levels, one had a sizeable way to penetrate SR.<br/>\n<br/>\nThat got stomped on with EE (no more meta-magical Ice Storms) and now crushed, utterly (no more SR or damage bombs aka Ice Storms, due to splitting how Caster level for SR and Damage now work).  You're basically a big tiger dood that is totally vulnerable to blessed bolts, still retains immunity to all spells up to and including 8th level, but you basically have no way of damaging anything.  I guess you could fall on something and attempt to smother it...<br/>\n<br/>\nFacit - DoA.<br/>\n<br/>\nRisen Lord is still a very viable form (Undead) and is one of the favs.  It remains (we'll see if it stays that way) unchanged.<br/>\n<br/>\nDragon Shape is still a viable form - I am not sure how the Breath Weapon works now, though.  Especially for Dragons that have absolutely no Shifter in them...??<br/>\n<br/>\nKobold Kommando - still viable, and our resident Assassin guru Mick Dagger has some great builds based on this little guy.  With vanilla HiPS, it can be built into a real powerhouse.<br/>\n<br/>\nAs for most of the other forms, I suppose they are still viable for what they are used for - mainly as a \"stepping stone\" towards the other shapes in their final form.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}