{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "618",
  "name": "Arelith - Build request for some PC concepts.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-build-request-for-some-pc-concepts-t2355454.html",
  "author": "Elisturus",
  "avatar": "no_avatar.png",
  "replies": "18",
  "views": "2.3K",
  "posts": [
    {
      "author": "Elisturus",
      "avatar": "no_avatar.png",
      "timestamp": "6:09 PM - Apr 26, 2020",
      "content": "<div>Hello all, I'm new both to here and Aerilith, after playing for sometime I've come to realize that with all the unique changes made to the ruleset, and despite spending several hours pouring over the wiki, I lack the understanding to represent my PCs the way they should be in this PW. So I'd like to turn to others to request some aid in forming my PC's builds.<br/>\nTo make it clear, I'm not looking for a build to curbstomp everything I come across, I'm looking to maximize the builds in order to avoid reaching a point where I won't be able to do or take part in content (PvM and PvP) because my PC is too weak or not \"skilled\" enough.<br/>\nIe. Setting aside player skill, a fighter should be able to hold his own against most opponents, maybe he'd get taken down by a powerful mage or frenzied barbarian, or even another fighter who is a higher level, but against someone of the same level and similar gear, at worst it should be a toss up who wins. In other words, builds that can hold their own alone or in a group.<br/>\n<br/>\nLevel cap for all of them will be 30, and I don't mind making use of the the \"gifts\" bonuses at CC, which can give you +2 to any 1 stat (max 2) and/or a boost to certain skills or saves (ie. +2 to all saves) at the cost of increasing ECL (ECL does NOT affect level cap, you can still go to 30 but never beyond).<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Gifts\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Gifts</a><br/>\nPaths are also a thing, where classes can be further refined into something more specific, or even turn it into something else entirely, such as a bard taking the warlock path.<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Paths\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Paths</a><br/>\n<br/>\nRiding horses is a thing, and the minimum riding skill requirement is 6, higher skill level allows you to move slightly faster and also prevents you from being thrown off the horse, described as not being too much of a concern out of combat, but in a dangerous situation, someone with 6 ride will get tossed very easily. 30 is what the wiki says is a good number to be able to ride a horse in any situation. It is a useful skill to have a few points in overall IMO.<br/>\nAdditionally, scrolls in Arelith require lore not UMD, as such some PC could benefit from a higher lore beyond just IDing things. I'm also open to any suggestions for their crafting line (Arelith has a separate system for crafting which I am not too familiar with)<br/>\n<br/>\n1. PC RP concept is a follower of Gond that is a skilled blacksmith(forging in Arelith)/crafter in general, and wanderer (as most of Gond's faithful tend to be).<br/>\nDeweomer (Arelith's version of enchanting) craft is a must, along with the associated skills needed for that and forging. Having Gond as a patron god also means he gets the mundane dewomercraft tier, which frees up more levels for multiclassing. I am not sure if it's possible to also have him work on runecracft as well, the mechanics of it are a bit of a mystery to me.<br/>\n<br/>\nGift of the Crafter (minor gift, does not affect the +2 to 1 stat gifts).<br/>\nRace: Any, but Human would be preferred.<br/>\nClass: I would prefer to have him as a cleric or a favored soul of Gond (or something similar), but am fine with any multiclass that works with the build. My main issue is that I am unsure if I should build him as a battlecleric or a healer, but either one would work. One of my other PC concepts is a healer, so if that can be combined with this one that'd be fine.<br/>\nSkills: Craft mastery is a must, and if possible, a decent amount of riding skill for transport of self and materials, not combat. Discipline if he's a melee fighter. The rest can be anything.<br/>\nDomain: I am fine with any domain as long as it's it's not too far fetched that I can't fit it into the RP. Ie. if going the healer path protection domain makes sense, as a healer would be more focused on such things despite it not being one of Gond's domains. Likewise healing domain would not be necessary as he'd already be a practiced healer. Arelith however does offer extra party buffs for clerics that match domains with their chosen god when you use prayer. Not too sure on the mechanics there, but as a healer this \"may\" be useful.<br/>\nWeapons/Combat: Would like it if he could wield warhammers or at worst, hammers as it fits the RP best, but mostly for cosmetic purposes. Other then that everything is fair game.<br/>\nFeats: This is the area I am having most trouble with as I am not too familiar with Arelith's changes here. Feats that would improve his crafting capabilities would take priority, but not to the extent that every single crafting feat MUST be taken, just enough that he can stand with the best of them as a crafter, if they are needed at all(skill focus craft mastery?). Craft scrolls would be good as a healer and still/silent spell to increase castings.<br/>\nAlignment: This is flexible, but leading more towards neutral.<br/>\nStats: A decent amount of STR(12-14) to reflect both his choice of work as a smith, and to carry various things needed for said line of work, other then that whatever is required for him to make use of his abilities to the fullest. I am not sure if crafting has stat requirements of any sorts, nothing that I could find at least. I don't mind going into negative stats for unused skills. I normally have him at: 8 DEX and CHA as I seem him as more of a gruff, unshaven, kind of person, with scars and blemishes from his work at a forge.<br/>\n<br/>\nTo summarize. A follower of Gond who is a skilled cafter, that can handle his own or function well in a group either as a battler or healer are the main requirements.<br/>\n<br/>\n2. A healer through and true, I have seen some other nice healer builds as well on the forum, so this one is of a lower priority.<br/>\nOriginally the idea for this PC is an adorned of Ilmater who has taken a vow of peace (non violence), and so he uses his spells to support others along with appropriate summons to \"fight in his stead\" in self defence, which is more of a necessity because of the type of server. Not being able to attack at all would be insanely restrictive and cut me out from a lot of content so using third parties is him slipping through on a technicality.<br/>\nHowever none of this is  requirement, and the main idea is to create a healer type character. As stated above, if this can be combined with the follower of Gond PC, that would be fine.<br/>\n<br/>\n3. An Archmage. This does not have to strictly follow the wiz/soc line of spellcasting. The original concept is that he is a high elf planewalker with strong mastery over the arcane. <br/>\nAn explorer at heart he is more about the process of learning and accumulating power then anything else. He would in a sense be an excellent follower of Oghma (which he is), save for the fact that he would rather spend his time learning then teaching others as he believes there's always more to learn (high elves right?).<br/>\nThe original build was Wiz/Archmage, but seeing as how that is not possible in Arelith some major adjustments are required. Similar to the first PC, I would like him to be a crafter as well, but not as the primary focus. He is first and foremost a mage, the crafting is more of a hobby which he is skilled at because of what he does. I am not too familiar with the mechanics behind it, but I'm thinking of making him a runecrafter on top of that as I believe they benefit from a high INT and ability to learn multiple languages quickly.<br/>\n<br/>\nRace: High elf is preferred.<br/>\nClass: Arcane caster. I prefer wiz namely cause of the high INT and skills as he is ultimately that sort of character: Stoic, calculating, getting things done. But any arcane caster would work.<br/>\nSkills: The usuall skills associated with a spell caster (spellcraft, concentration, lore) and craft mastery.<br/>\nFeats: Craft scroll. Everything else is flexible. I'm not sure if the haste buff is readily available in Arelith or as an enchantment, and if there is a need for quicken/automatic quicken spell lines.<br/>\nAlingment: CN is usually what I go with, fits him best.<br/>\nStats: As mentioned above, a high INT matches him well, but that does not mean it has to be maxed out or the focus stat. Like the first PC, I don't mind negative stats as long as it fits the general concept (8 INT is a nono).<br/>\n<br/>\nIn summary, a skilled and powerful caster with a decent amount of skill in the more magical crafting arts, though not to the same extent as the first PC. He uses whatever spells he has at his disposal to do a multitude of things and go places few others can. The general idea would be \"Magic can do anything and everything\", but again the key point is that he can hold his own in battle, the method (direct attacks, summones, ect.) is flexible.<br/>\nArelith also has several paths for mages, such as a path that allows them to cast an unlimited number of evocation spells, but bars them from every other spell school, as well as a shadow mage that uses shadow spells (limits spell list) but they are more powerful and they can take shadowdancer without having to meet requirements.<br/>\n<br/>\n4. A survivor/Jack of all trades. The idea behind this PC is that he is always the last one standing in a party. Not because he is an overpowering tank with insanely high AC, but because he's smart, and skilled enough to know how and when to escape a bad situation.<br/>\nThe original build starts with a rogue for sheer utility, DEX focused with a bit of STR and a good amount of INT. He's a spelunker of sorts, the kind of person you'd want in your dungeon crawls because he'll be able to handle locks/traps and drop a heal (healers kit) or a raise from the shadows should the battle go south. Or maybe he'll just push someone into a trap to trigger it then heal them after.<br/>\nHe should be able to hold his own in terms of combat, like the others, as an attacker more then anything with high AB, sneak attack playing a key role there. I had originally envisioned him as an archer, but melee is fine too, as is dual wielding.<br/>\nArelith has some benefits to those who get ambidexterity. If I remember right it's focus weapon feats (with the exception of a WMs) on either a rapier of dagger, will net you the other for free. This includes improved crit if I am not wrong.<br/>\nHe's not a \"rogue\" in the thieving b****** kind of way, he's more about actual utility in various situations, not swiping stuff. <br/>\n<br/>\nRace: Originally an elf, I see him as a wood or wild elf in Arelith.<br/>\nClass: Rogue? But I am not against different class combinations including caster classes as long as it fits the concept. Also considering ranger, rangers have been changed somewhat in Arelith giving them more utility (6 skill points/level), ability to turn dominated animals (through animal empathy) into henchmen (max 2), can take AA without meeting the spellcasting requirements (though they need to meet the others) and they can also use the archer path, where they loose dual weilding feats, but gain more archery center abilities. Also HiPS in natural areas at level 16, though HiPS does have a cooldown (2 rounds) in Arelith. I still prefer corner sneaking, though it's not always an option.<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Ranger\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Ranger</a><br/>\nSkills: Stealth skills is a must, as is detection skills (spot, listen, search), heal as well lore (for reading scrolls). Tumble is also useful for AC, and to avoid attacks of opportunity, which also decreases the need for mobility feat (outside of requirements), he is supposed to be mobile even in combat, so I can see a use for this skill as well and discipline for the same reason, knockdown is very common. Outside of that I would say I'd place lockpick as a higher priority compared to disable/set trap. Other skills are up in the air if there's still points left.<br/>\nFeats: Anything that supports the build.<br/>\nAlignment: Leaning more chaotic.<br/>\nStats: Whatever works, I don't mind dropping CHA to 8 on this PC as a wild elf as it fits their RP well.<br/>\n<br/>\nIn summary, a skillful PC who can overcome situations in a variety of ways with high AB and good survivability. I don't expect him to be a match for a fighter or another more melee focused class, but he should be able to outflank them at the least.<br/>\n<br/>\n=======<br/>\n<br/>\nOkay, that was way longer then I thought it would be. Thank you in advance who takes the time to help me out with this!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:10 PM - Apr 26, 2020",
      "content": "<div>First of all - Hello and welcome to the ecbguild Elisturus!<br/>\n<blockquote><div><cite>Elisturus wrote: <div class=\"responsive-hide\">Apr 26, 2020</div></cite>Hello all, I'm new both to here and Aerilith, after playing for sometime I've come to realize that with all the unique changes made to the ruleset, and despite spending several hours pouring over the wiki, I lack the understanding to represent my PCs the way they should be in this PW. So I'd like to turn to others to request some aid in forming my PC's builds.<br/>\nTo make it clear, I'm not looking for a build to curbstomp everything I come across, I'm looking to maximize the builds in order to avoid reaching a point where I won't be able to do or take part in content (PvM and PvP) because my PC is too weak or not \"skilled\" enough.</div></blockquote>\nThat is a reasonable request and is part of what we are here for <span class=\"text-emoji\">😇</span><br/>\n<blockquote><div>Okay, that was way longer then I thought it would be. Thank you in advance who takes the time to help me out with this!</div></blockquote>\n\nYou seem to have a firm grasp on what you want from your roleplaying characters.<br/>\nSome of us ecb'ers are fairly seasoned roleplayers. Crafting a strong build is a different persuit though. Even so, the two tasks can be united.<br/>\n<br/>\nI am not very familiar with all the rule changes on Arelith. I have tried to make a couple of Arelith builds, but have to check the ruleset all the time.<br/>\nYou ask for two cleric builds, one mage and one rogue type build. From a power perspective, it is always easier to make a build based on what is powerful, given the circumstances. But here it seems that you want builds that are just <em>good enough</em>. Now it is also important to notice that not everything is <em>in the build</em>. It is very important how you actually <em>play</em> the character.<br/>\n<br/>\nHow you build should also reflect if you are going to PvP or PvM. PvM builds are made as general purpose builds that can handle different situations in a module or on a PW. PvP builds are far more tailored to beating a given opponent build.<br/>\n<br/>\nWhat I propose is that you start with one of your characters and try to build something. If some custom rule comes into play, make sure to comment on that, so we know. Then we can try to guide you through the building process - one build at the time.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "11:41 PM - Apr 26, 2020",
      "content": "<div>I’ll give you some options later today.  The sneak builds I like are pretty useless for PvP so I’ll need a little time to put something together for the Rogue build :). The general build meta and server meta is that a solid PvP build will function well in PvP and any build that functions in PvP will roll PvE.  In my experience, this is generally correct but I will, where useful, offer a PvP vs PvM option.<br/>\n<br/>\nDweomercraft and Runecrafting are two sides of the same coin on Arelith and your God bonuses are more flexible than just one god under current rule set.  You have the ability to worship one God and “attune” to another, meaning you offer a prayer to a god not your own for assistance in your current endeavour.  So pick your God for RP purposes and attune as needed for mechanical purposes.<br/>\n<br/>\nThe Dweomercraft is enchanting on Arelith, Runecrafting is the ability to apply certain exceptional magic items with a “free” enchantment.  The only requirement for this is Dweomercraft AND the ability to speak the language of the Rune.<br/>\n<br/>\nThis may help a bit with understanding it:<br/>\n<br/>\n<iframe allowfullscreen=\"\" data-s9e-mediaembed=\"pastebin\" scrolling=\"\" src=\"//pastebin.com/embed_iframe.php?i=qAqpqYX0\" style=\"border:0;height:300px;resize:vertical;width:100%\"></iframe><br/>\n<br/>\nI’ll also add, Arelith is exceedingly modified from base NwN and many of the base concepts in normal NwN do not apply or do not apply in the same fashion for Arelith. They also have a PGCC (character tester) server, so whatever people put together for you, you can build/test it prior to building it in Arelith.<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Elisturus",
      "avatar": "no_avatar.png",
      "timestamp": "12:27 AM - Apr 27, 2020",
      "content": "<div>That's fair enough, and with Arelith I believe the general thought is that PvM is actually tied in with PvP, as in it's created in such a way that if you can handle PvP then you'll be fine with PvM and vice versa (for the most part) with the exception of perhaps some high end boss monsters.<br/>\nFrom my own experience it feels like most PvM content is designed to be done with a party, even if it's just 2 rather then solo. Exception being of course if you're at a higher level then the area. The \"boss\" also tends to be significantly harder compared to the rest of the monsters, meaning that while you may be able to handle the regular mobs solo, the boss could still kick your ass without some backup. <br/>\n<br/>\nTo give you an example, the first \"dungeon\" I played at level 3, the mobs were easy enough to take on by myself even against 3 of them, but the boss was impossible. My weapons couldn't do any damage (it was a werecat so it had DR) and I needed alchemist fire to bring it down. Even then it was so powerful that 2 hits were enough to kill me the first time. This was on a rogue, I assume mages or STR focused melee builds would have an easier time due to magic damage an STR bypassing DR.<br/>\nIn that way, I believe the assessment that PvM and PvP can actually be tied together to be accurate, as the monsters seem to be built in a similar fashion, no one build can truly dominate everything, though some probably come close.<br/>\n<br/>\nI get what you mean though, specially about playstyle.  I'll start off with the cleric, since that RP appeals to me the most.<br/>\nI'd just like to say though, the main issues I'm having is due to the changes to spells and ruleset in general in Arelith makes the standard nuking techniques (ie. TS -&gt; GMS) somewhat ineffective.<br/>\nEven as a cleric this would apply, ie. Keen weapon, flame weapon, greater magic weapon can't be cast on a weapon that has already been enchanted. Meaning that if you have a +1 sword, none of those would work on it, so you'd either need a regular weapon and then use spells to beef it up, or you work on getting a weapon with +2, elemental damage, and keen on it (all of which require dewomercraft). There are other ways to do it though, through the crafting system, but this also makes the standard form of gameplay most people would be used to on NWN rather inefficient.<br/>\nAnd the real kicker is, that you get extra feats compared to vanilla NWN. This is supposedly done to allow you to take crafting feats alongside battle feats, at least that is what I've read. That on top of feat changes is what is causing me to bang my head against the wall as I don't actually know the feat gains/progression for classes.<br/>\n<br/>\nWell with the cleric of Gond, what I had in mind was something along the lines of:<br/>\n<br/>\nBattle cleric<br/>\nHuman<br/>\nGifts +2 STR, +2 WIS, Gift of the crafter<br/>\nCleric(16) CoT/Divine champion (10) Rogue (4)<br/>\n16(18) STR, 10 DEX, 12 CON, 15(17) WIS, 14 INT, 8 CHA <br/>\nSkills: Spot (as rogue/CoT), Craft mastery (max), Discipline (as CoT), Ride (15), Tumble (as  rogue).<br/>\nDomains: Travel, knowledge<br/>\nFeats: Expertise, Still spell(?), extend spell, empower spell scribe scroll, knockdown, improved knockdown, blind fight, toughness, weapon focus warhammer, improved crit, cleave, epic prowess, armor skin, epic weapon focus, uncanny dodge and evasion from rogue levels. Additional feats would go into STR.<br/>\n<br/>\n<br/>\nThe Extra STR and WIS coming from the gifts and WIS left at an odd number because the cap is 30.  Future points would be put into STR and the extra point into WIS, 9th circle spells seem rather pointless for a battlecleric.<br/>\nAfter ride has reached 15, further points go into lore.<br/>\nDomains are travel for haste, and knowledge, cause Gond. The only real benefit from the knowledge domain would be legend lore, which can be quite useful for scrolls. I do not mind swapping that for something else though.<br/>\nCoT will provide martial weapon, so he gets hammer that way, other feats focus more on extending the power/duration of the spell along with beefing up melee. Arelith has a system in place for \"needs\", food, water, rest, and you can only rest when your rest is at 50% or lower (90%) if you are in a resting zone like an inn or camp. So having still spell allow him to have extra castings of the shorter duration spells, though it would class with other spells in some cases, so I am not sure.<br/>\n<br/>\nThis is generally what I have in mind, but it has not been adjusted for Arelith's changes. Would be great if someone could actually go over it and tweak it.<br/>\n<br/>\n=====<br/>\n<br/>\nFor the healer version, I was thinking something like this build here: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-priestess-on-arelith-for-sucy-t2355312.html\" rel=\"noreferrer\" target=\"_blank\">the-priestess-on-arelith-for-sucy-t2355312.html</a><br/>\nFirst one, but to adjust it accordingly to get a bit more in terms of crafting, It makes use of Gifts for +2 CHA and WIS<br/>\nThe domains are great, but I was thinking of swapping one for travel and also thinking of taking -2 points from CHA and put it in INT instead to take crafting mastery. I'm not entirely sure what the 1 in open lock is about though.<br/>\nThe downside of combining this with the cleric of Gond however, is that he gives up certain things, like ride and crafting focus, which is why I'm leaning towards making him a battlecleric.<br/>\nPlus I don't really understand the mechanics of the healer, for example, why the high CHA? So I need a bit more research into this paticular build before I can really come up with anything in terms of combining combining it with the cleric of Gond.<br/>\n<br/>\nThanks in advance again!</div>"
    },
    {
      "author": "Elisturus",
      "avatar": "no_avatar.png",
      "timestamp": "12:37 AM - Apr 27, 2020",
      "content": "<div>The above post was directed at Mick, didn't see your post there Zanithar XD<br/>\n<br/>\nThat would be a great help though! Thanks loads, and yeah I agree with the PvP vs PvM bit. In respects to the gods, do you mean that I can select Gond as his god using the deity book and then attune to another god that matches the domains he uses or to attune specifically for crafting purposes VIA alters in game?<br/>\n<br/>\nThat makes more sense with dweomercraft, so a decent INT would still be good so you can pick up more languages I suppose. I'll need to read up on this a little more, and find that test server. Thanks!</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "2:44 PM - Apr 27, 2020",
      "content": "<div>Alright,<br/>\nSo, lets get started shall we :)<br/>\n<br/>\nThe Cleric healer path builds you have seen the Priestess thread for Arelith.  This is likely the strongest mechanically of all the builds you were considering with top tier power in PvE and PvP.  The one caveat is that the healer is built to support and if necessary escape from PvP over winning it solo this is also a \"last person standing\" build where you have more tools that any other build available to ensure you stay alive and keep others alive, if they go down you can collect their bodies and evacuate under the cover of chained Extended GSanc -&gt; Protection Feat -&gt; Extended GSanc in addition to Respite (a mini Timestop) and Lifeline a Just in Time Ressurrect.  There are two builds offered, one for group based PvP and one that is more resilient both solo and in single PvP.  Those builds can be found here: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-priestess-on-arelith-for-sucy-t2355312.html\" rel=\"noreferrer\" target=\"_blank\">the-priestess-on-arelith-for-sucy-t2355312.html</a><br/>\n<br/>\nFor a battle cleric there are a number of options, recently a new class has been added within the last week or two, the favoured soul which is essentially a sorcerer class alternative for a cleric, like a sorcerer it focuses on Charisma as the casting Stat and also offers the flexibility of any spell available being cast with total casts per level not to exceed number of available spell slots.  The cost is that the Favoured Soul does not receive the traditional Cleric Domains.  <br/>\n<br/>\nOne nuance of Arelith is that the dispel cap has been raised, another is that Fortitude/Will/Reflex saves can an are enhanced into the 35-50 range making DC based spells unreliable while requiring a deep commitment to Caster Level with 26+ Caster levels being the recommendation to prevent dispels.  This will not prevent breaches but with the Lore changes requiring a heavy investment in Lore to use scrolls scaled by level, far less people have the capability of casting Mordekainen's Disjunction making a 26+ Caster level investment even more useful than before.   There are builds out there with as low as 23 Caster Levels but those are susceptible to dispels so they need to offer very powerful tradeoffs to remain mechanically powerful.<br/>\n<br/>\nAlthough I do not have a practical knowledge of the new Favoured Soul Class I trust the following build/builder and his builds are a goto for me when I am looking for more information on something I lack experience with so, something more like the following would be my recommendation.  The cleric levels on this build are for the Heal/Death domain empowerment of both spell lists, if you want to drop that you can replace those levels with Favored Soul levels bringing the build back inline with a solid caster level but it is a rock solid Harm/Heal/Counterspell slinging PvP build as is: <a class=\"postlink\" href=\"https://docs.google.com/document/d/1Oi8gcv_qpN3JmjRCVFU_WMPir0I82Metc5A95B_GUEI\" rel=\"noreferrer\" target=\"_blank\">https://docs.google.com/document/d/1Oi8 ... 5A95B_GUEI</a><br/>\n<br/>\nIf it you are looking for inspiration, his build list can be found here: <a class=\"postlink\" href=\"https://drive.google.com/drive/folders/1iF3YBc-ivu4pdscZkv9IhR4Lzqn-iK8b\" rel=\"noreferrer\" target=\"_blank\">https://drive.google.com/drive/folders/ ... 4Lzqn-iK8b</a><br/>\n<br/>\nThis is a classic Strength based Battle Cleric, my personal recommendation would be to swap in War Domain in exchange of the current Trickery domain and swap the Conjuration Focus line for Transmutation if you read the healer thread above, you can see my reasoning: <a class=\"postlink\" href=\"https://docs.google.com/document/d/1SbG7i56SOaVFDoDLvB2BaVujzfDkuvDYL5qof5wxuTY\" rel=\"noreferrer\" target=\"_blank\">https://docs.google.com/document/d/1SbG ... 5qof5wxuTY</a><br/>\n<br/>\nI'll offer one more Cleric build, I built this as a HOrc Healer/Monk Dual Weapon QStaff(Simple) build using Divine Power/Favour and QStaff a monk unarmed BAB weapon on Arelith.  It is an absolute ball to play in PvP and PvM but is quite feat constrained.  It has immense equipment flexibility as it can obtain +11 to Str/Con/Dex self buffing.  I would probably not recommend it as a first character but honestly, it is a blast. <br/>\n<details><summary>Spoiler</summary>Healer(26), Monk(4), Half-Orc\nSTR: 18 (24)\nCON: 12\nINT: 14\n\n01: Monk(1): Expertise, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}\n03: Monk(3): Two-Weapon Fighting\n05: Healer(2)\n07: Healer(4)\n09: Healer(6): Extend Spell\n11: Healer(8)\n13: Healer(10)\n15: Healer(12): Greater Spell Focus: Transmutation\n17: Healer(14)\n19: Healer(16)\n21: Healer(18): Weapon Focus: Quarterstaff\n23: Healer(20)\n25: Healer(22)\n27: Healer(24): Epic Weapon Focus: Quarterstaff\n29: Healer(26): Armor Skin\n\nSkillpoints: 146\nSaving Throw bonuses: Spells: +6, Mind Effects: +2\nAB (max, naked): 29 (melee), 18 (ranged)\nSpell Casting: Healer(9)\n\n\n02: Save(30), \n04: Concentration(1), Heal(1), Lore(1), Spellcraft(7), \n06: Concentration(1), Heal(1), Spellcraft(1), Save(1), \n08: Concentration(1), Heal(1), Spellcraft(1), Save(3), \n10: Concentration(1), Heal(1), Spellcraft(1), Save(1), \n12: Concentration(1), Spellcraft(1), Save(5), \n14: Concentration(1), Spellcraft(1), Save(9), \n16: Concentration(1), Spellcraft(1), Save(13), \n18: Concentration(1), Spellcraft(1), Save(17), \n20: Concentration(1), Spellcraft(1), Save(21), \n22: Concentration(1), Spellcraft(1), Save(25), \n24: Concentration(1), Spellcraft(1), Save(29), \n26: Concentration(1), Save(34), \n28: Concentration(1), Save(40), \n30: Concentration(1), Discipline(24), Tumble(24), \n</details>\n\nCan you tell I like Cleric builds?<br/>\n<br/>\nA couple more to round out the fun.<br/>\n<br/>\nFor PvP Sorceror/Pa or BG is the goto as you have counterspells for days and can lay down immense spell damage as needed.  Alternatively a Wild Mage (Wizard path) can be quite fun but they have been somewhat nerfed of late.<br/>\n<br/>\nThis is the standard Wizard build, I should note there is no mechanical advantage to taking a Wizard over the Wild Mage path but as you will see there are some nuances with Wild Mage that may or may not be acceptable both from a risk perspective and an RP perspective.  <br/>\n<br/>\n<a class=\"postlink\" href=\"https://docs.google.com/document/d/1-0NEmYeuGJPLPvvDQ7heNgNzpjn1Cygv-MAH4y6wpUA/edit\" rel=\"noreferrer\" target=\"_blank\">https://docs.google.com/document/d/1-0N ... 6wpUA/edit</a><br/>\n<br/>\nThis is the standard Sorceror builds guide:<br/>\n<a class=\"postlink\" href=\"https://onedrive.live.com/view.aspx?resid=33CEDD5BA3AC2061!134&amp;ithint=file%2Cdocx&amp;app=Word&amp;authkey=!AEvZsmPg1PKR1Ec\" rel=\"noreferrer\" target=\"_blank\">https://onedrive.live.com/view.aspx?res ... mPg1PKR1Ec</a><br/>\n<br/>\n<br/>\nRogues are all over the place, there are lots of Roguish builds, my favourite personally is a Strength based Dual Weapon 17 ShadowDancer / 8 Fighter / 5 Rogue build but it is rubbish in PvP (Shadow is dispellable) and utter destruction in PvE (shadow blocks most attacks on you allowing you to go full offense and you have 100% uptime on Shadow Evade with 50% concealment, 12/+4 DR and +4 Dodge AC) but it definitely does not meet your PvP requirement.<br/>\n<br/>\nThis is the standard Rogue heavy build: <a class=\"postlink\" href=\"https://docs.google.com/document/d/1L2FrSbfsEqFo2Yx1ccRzOuANK1SAfzdhiHh7O87aRjo/edit?usp=sharing\" rel=\"noreferrer\" target=\"_blank\">https://docs.google.com/document/d/1L2F ... sp=sharing</a><br/>\n<br/>\nThis is a Dex Weaponmanster build with significant Rogue levels: <a class=\"postlink\" href=\"https://docs.google.com/document/d/1LHAe-nzwT4rQD8MsXP7xdbxWUikYYPG3_umdwWn5LTQ/edit?usp=sharing\" rel=\"noreferrer\" target=\"_blank\">https://docs.google.com/document/d/1LHA ... sp=sharing</a><br/>\n<br/>\nHopefully this gives you a nice cross section of available builds on Arelith, I personally would suggest the War/Protection Healer as a solid first level 30 build but I have a strong cleric bias and an even stronger Arelith custom Healer bias. </div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:48 PM - Apr 27, 2020",
      "content": "<div>Hello once more!<br/>\nI had a look at the battle cleric.<br/>\nStarting out with str 15 + 2, dex 10, con 14, wisdom 15 + 2, intelligence 14 and charisma 8, I was able to make a build ending on strength 28 and wisdom 18, and with a better constitution.<br/>\nI have started with cleric and went straight to cleric 12 before multiclassing, first with 3 levels of CoT (Champion of Gond) and then 3 levels of rogue before taking cleric to 14 at level 20.<br/>\nAs for feats: The weapon focus feat groups confuse me some. Do you take the 1H concussion feat for all blunt one-handers and later an epic counterpart? And do you still need WP martial to before you can wield the warhammer?<br/>\nNevertheless, the build I have started to make has so far 9 pre epic feats. I chose blind fight, expertise, extend spell, empower spell, KD and IKD. That leaves 3 feats for WF and other things.<br/>\nIn epic levels there are 8 feats, the four general feats and four CoT bonus feats. I have taken four Great strength, Great wisdom, EWF, AS and EP.<br/>\n<br/>\nNormally I would take Cleric straight to lvl 15, but with only 16 cleric levels in the build and the Arelith multiclass rules, I started multiclassing earlier, gaining access to some of the skills you want.<br/>\n<br/>\nAs for skills, there are 189 skill points. Discipline, spot and ride are class skills for CoT and can only come mid/late pre epic. Rogue has tumble and with only 4 class levels there can only be two dumps. I took one around level 17 and one at level 27.<br/>\nI am surprised that you have not listed concentration and spellcraft among the skills. Normally they are essential caster skills. With 189 skill points available that amounts to almost 6 full skills. Your list is spot, craft mastery, discipline, tumble, and then ride and lore as partial skills. There is still room for almost one more skill, and two if you are willing to prioritize.<br/>\nSo what do you think. Can this work for you?<br/>\n<br/>\nEdit: Ninjaed by Zanithar, but what he offers is different.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "2:53 PM - Apr 27, 2020",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote: <div class=\"responsive-hide\">Apr 27, 2020</div></cite>As for feats: The weapon focus feat groups confuse me some. Do you take the 1H concussion feat for all blunt one-handers and later an epic counterpart? And do you still need WP martial to before you can wield the warhammer?</div></blockquote>\nThere are a few nuances here.  The short answer is yes and yes.  The slightly longer answer is some weapons fall in more than one Weapon Focus Group as noted <a class=\"postlink\" href=\"http://wiki.arelith.com/Weapons#Weapon_Grouping_Summary_Chart\" rel=\"noreferrer\" target=\"_blank\">Here.</a>  Also, weapon proficiency is no longer an absolute requirement but you will be subject to large penalties for wielding a weapon lacking the proficiency even if it falls within your Weapon Focus Group, so martial proficiency would be needed.  The full weapon focus line has been customised to Weapon Group so it would be Improved Critical 1 Handed Concussion as well for example.</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "3:10 PM - Apr 27, 2020",
      "content": "<div><blockquote><div><cite>Elisturus wrote: <div class=\"responsive-hide\">Apr 27, 2020</div></cite>In respects to the gods, do you mean that I can select Gond as his god using the deity book and then attune to another god that matches the domains he uses or to attune specifically for crafting purposes VIA alters in game?</div></blockquote>\nYes, but not the <a class=\"postlink\" href=\"http://wiki.arelith.com/Deity#Domains\" rel=\"noreferrer\" target=\"_blank\">Domains</a>, that is very specifically a Cleric thing and locked in upon that class selection, the <a class=\"postlink\" href=\"http://wiki.arelith.com/Deity#Aspects\" rel=\"noreferrer\" target=\"_blank\">Aspect</a> is what attunement changes which is how you gain piety.  The <a class=\"postlink\" href=\"http://wiki.arelith.com/Deity#Benefits\" rel=\"noreferrer\" target=\"_blank\">Benefits</a> are universal across any Diety you select.<br/>\n<br/>\nThe key here is that the Diety system was heavily weighted towards certain Aspects/Benefits that was impacting the Roleplaying so the system was changed to allow it to be more supporting of the Roleplay by flattening the mechanical advantages.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:40 PM - Apr 27, 2020",
      "content": "<div>I have absolutely no experience with Arelith, but just wanted to register my vote of thanks, Zanithar, for both your experience there and your guidance to one of our new members.<br/>\n<br/>\nMuch appreciated.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:42 PM - Apr 27, 2020",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>I have absolutely no experience with Arelith, but just wanted to register my vote of thanks, Zanithar, for both your experience there and your guidance to one of our new members.<br/>\n<br/>\nMuch appreciated.</div></blockquote>\nAll good, happy to help, I quite like building and Arelith has a near overwhelming level of customisations so it can be challenging.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "11:06 PM - Apr 27, 2020",
      "content": "<div>I also wanted to add there are two ways to Full Dweomercraft.  One is using Craft Mastery, this is the mundane approach.  The other is being a high spell caster and having creation feat(s).<br/>\n<br/>\nA 24 cleric with scribe scroll or craft wand meets the requirement.  As Clerics are low in skill points and high in magic, this is the better approach for a cleric typically.<br/>\n<br/>\nMore can be read on that <a class=\"postlink\" href=\"http://wiki.arelith.com/Dweomercraft#Magic_Dweomercrafting\" rel=\"noreferrer\" target=\"_blank\"> http://wiki.arelith.com/Dweomercraft#M ... ercrafting</a><br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "12:00 AM - Apr 28, 2020",
      "content": "<div>In giving it some though Jack’s favored soul build although interesting is probably not the best “new player” build.  I’ll see about adding something like a 27 FS / 3 Pa and a 24 FS / 3 Pa / 3 Specialist build tonight, both will be melee weapon centric builds<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Elisturus",
      "avatar": "no_avatar.png",
      "timestamp": "4:48 AM - Apr 28, 2020",
      "content": "<div><em class=\"mention\">@Zanithar</em> <br/>\n<br/>\nThe main reason I like that \"priestess\" build is cause it fits the concept of a cleric of Ilmater very well. Being a heavy support it gives him an excuse to engage in PvM and PvP  without actually having to take up arms thus keeping in line with the whole do no harm creed.<br/>\nSome of the healer skills, like lifeline, seem a bit odd to me though. Perhaps it is due to my low level currently, but it seems like you have to get lucky with the timing more then anything. But the build itself is solid so I'll probably go with that for the healer.<br/>\nI tried out the favored soul build as well, the class itself would definitely work, but I am not to sure if that particular build would work for what I have in mind, and overall I think the cleric healer path has more advantages.<br/>\n<blockquote><div>This is the standard Wizard build, I should note there is no mechanical advantage to taking a Wizard over the Wild Mage path but as you will see there are some nuances with Wild Mage that may or may not be acceptable both from a risk perspective and an RP perspective.  <br/>\n<br/>\n<a class=\"postlink\" href=\"https://docs.google.com/document/d/1-0N\" rel=\"noreferrer\" target=\"_blank\">https://docs.google.com/document/d/1-0N</a> ... 6wpUA/edit</div></blockquote>\nThe wildmage would definitely be out for that particular PC, though the concept itself is interesting, I might try it on another PC one day, would be fun to play someone slightly off his rocker with this class. Specially with the wildsurge and inficasting.<br/>\nThat wizard build works well though, I'll probably roll with that.<br/>\n<blockquote><div>This is the standard Rogue heavy build: <a class=\"postlink\" href=\"https://docs.google.com/document/d/1L2F\" rel=\"noreferrer\" target=\"_blank\">https://docs.google.com/document/d/1L2F</a> ... sp=sharing</div></blockquote>\nThat one definitely works, though the BAB seems a bit on the low side for level 30 in Arelith, would he actually be able to hit anything at epic levels?<br/>\nThe WM build wouldn't work, not enough skils.<br/>\n<blockquote><div>\n Hopefully this gives you a nice cross section of available builds on Arelith, I personally would suggest the War/Protection Healer as a solid first level 30 build but I have a strong cleric bias and an even stronger Arelith custom Healer bias. <br/>\n</div></blockquote>\nYeah I'll probably start off with that, it sounds pretty solid and I can pick up more on the mechanics of Arelith before getting into the more complicated classes.<br/>\n<blockquote><div>There are a few nuances here.  The short answer is yes and yes.  The slightly longer answer is some weapons fall in more than one Weapon Focus Group as noted Here.  Also, weapon proficiency is no longer an absolute requirement but you will be subject to large penalties for wielding a weapon lacking the proficiency even if it falls within your Weapon Focus Group, so martial proficiency would be needed. The full weapon focus line has been customised to Weapon Group so it would be Improved Critical 1 Handed Concussion as well for example.</div></blockquote>\nRight. So basically it means I can take the focus feats and then get the martial proficiency automatically when I take CoT. Wouldn't be able to use a warhammer till then, but I can use another blunt weapon with simple prof in the mean time.<br/>\n<blockquote><div>Yes, but not the Domains, that is very specifically a Cleric thing and locked in upon that class selection, the Aspect is what attunement changes which is how you gain piety.  The Benefits are universal across any Diety you select.</div></blockquote>\nIf I am understanding this right, what you mean to say is that I could pick a god with war/protection domain on a battle cleric, and then swap attunements between W&amp;D and K&amp;I for when I want to battle and when I want to craft. So attuning to K&amp;I would give access to mundane dweomercraft to beef up his tier levels towards success rates, then switching back to W&amp;D to take advantage of the domain prayer buffs when I'm done? And there's no penalty for this, like with swapping worship of gods?<br/>\nNot sure if I am interpreting it right.<br/>\n<blockquote><div>I also wanted to add there are two ways to Full Dweomercraft. One is using Craft Mastery, this is the mundane approach. The other is being a high spell caster and having creation feat(s).<br/>\n<br/>\nA 24 cleric with scribe scroll or craft wand meets the requirement. As Clerics are low in skill points and high in magic, this is the better approach for a cleric typically.</div></blockquote>\nI was actually thinking of doing that for the mage build, but craft mastery would provide bonuses towards crafting skills like forging right?<br/>\nQuestion though, is there any way to squeeze in crafting skills so I could merge it with the cleric of Gond? I tried reworking it, and while it seems possible to get crafting skills, it doesn't seem like it would be at the same tier.<br/>\n<blockquote><div>In giving it some though Jack’s favored soul build although interesting is probably not the best “new player” build. I’ll see about adding something like a 27 FS / 3 Pa and a 24 FS / 3 Pa / 3 Specialist build tonight, both will be melee weapon centric builds</div></blockquote>\nI was thinking that too, though honestly I think I'd prefer to go with a cleric healer anyway. The FS would have better defensive capabilities though, with heavy armor and a CHA focus.<br/>\n@mick dagger<br/>\nThat build definitely works, but after reading up on things a bit more I'm now worried that the lower cleric level will make his buffs easy to dispell, does CoT levels count towards the DC? Cause otherwise I'd really prefer focusing on beefing up the cleric levels.<br/>\nThanks again for all the help both of you!</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "2:19 PM - Apr 29, 2020",
      "content": "<div>A few comments/responses:<br/>\n1. A 24 Ro/Fi nets some Arelith specific customisations like a flat +2 AB when coming out of stealth and a +2 AB with Rogue Weapons (which stacks for DR penetration).  They also get some serious Rogue specific throwables (Grenades) all of which close that gap rapidly.<br/>\n<br/>\n2. For the Weapon Focus stuff, yes.  You would take Weapon Focus Group: 1H Bludgeon start with Morningstar and switch to Warhammer (for Example) when you received Martial Proficiency.<br/>\n<br/>\n3. You do not have to worry about attuning for mundane dweomercraft, that is a \"Benefit\" and you get them all automagically.  This was put in for exactly what you are describing.  They do not want you to take Gond just because you want the K&amp;I benefit.  Take whatever Diety works for your RP, get all the benefits and \"Attune\" for your Piety restoration depending on what you are doing.  There is no penalty for Attuning, think of it as offering a quick prayer/tribute to a god for a blessing.  Ex: Perhaps you worship a Death God and are going on a Sea voyage, you would offer a quick sacrifice to the Sea God of your choice for safe passage.  It makes it an RP and Piety tool rather than a significant mechanical advantage tool.  Essentially far too many people were worshiping K&amp;I and Magic Gods for the mechanical advantage which was in turn damaging the RP.<br/>\n<br/>\n4. You could fit Mundane Crafting into a Cleric build with a 16 Int AND/OR a Human.  Crafting Mastery 30 is what you would need.<br/>\n<br/>\n5. I strongly recommend not taking anything less that 23 in a Casting class on Arelith and there should be a solid mechanical reason for taking anything less than 27.  Wizards for example take Wizard 26 / Specialist 4 to push a pre-epic feat into epic which offers a strong mechanical advantage.   Typical breakpoints for casting classes are: 30/27/26/24/23 .  It is rare for a mechanical builder to go under 23 and even 23 is ... challenging and not something you would generally have on a Cleric.  CoT levels do not count towards Caster Level.  I suspect the base FS build will end up similar to the base Sorceror build and be 27 FS / 3 Paladin OR Blackguard.  This is one of those things you ignore at your peril, that RP choice that changes your build from \"functional but not optimal\" to \"I hate this game why is it impossible\".</div>"
    },
    {
      "author": "Elisturus",
      "avatar": "no_avatar.png",
      "timestamp": "3:29 PM - Apr 29, 2020",
      "content": "<div>Yeah I totally get where you're coming from on that front. The healer build really makes things a lot easier, save for a little bit of issue with summons not being able to move through some transition areas on the same map, I'm finding that he's capable of doing a lot more then I could do with my rogue.<br/>\n<br/>\nSo the only thing your healer build would need is just the 30 points of crafting mastery, maybe I can move that around some on my crafter and go that route then. There's really so much to consider with Arelith builds.</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "3:37 PM - Apr 29, 2020",
      "content": "<div>If you follow that build, at level 24 when you take scribe scroll, you will have Magic Dweomercraft Tier 3 (the highest tier) from 24 pure caster levels and a crafting feat.  At that point Craft Mastery 30 just gives you more craft points which is a minor gain for the investment.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:01 PM - Apr 29, 2020",
      "content": "<div><em class=\"mention\">@Zanithar</em> : This thread makes me curious about how important crafting is for a happy RP life on Arelith. Can you just drop it and rely on other sources of good items. Can you buy items for a reasonable price? Are there guilds to join where items are shared between members? Can self buffers manage by buffing up mundane items? Are there class benefits that make up for low class equipment, etc?<br/>\nWhile I'm at it (derailing this thread): How important is PvP? Are you supposed to take part in it, or is it strictly by consent?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "11:36 AM - Apr 30, 2020",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote:</cite> This thread makes me curious about how important crafting is for a happy RP life on Arelith. Can you just drop it and rely on other sources of good items. Can you buy items for a reasonable price? Are there guilds to join where items are shared between members? Can self buffers manage by buffing up mundane items? Are there class benefits that make up for low class equipment, etc?<br/>\nWhile I'm at it (derailing this thread): How important is PvP? Are you supposed to take part in it, or is it strictly by consent?</div></blockquote>\n<em class=\"mention\">@Mick Dagger</em> <br/>\nCrafting is a skill everyone gets on a separate skill pool.  I would not say it is required and you will be unable craft everything you need.  It is designed to promote RP and player trading and behind it is an active economy.  The best items in the game are craftable and most are further enchant-able.  There is  even a custom class that “just” crafts called commoner.<br/>\n<br/>\nThere are absolutely player traders and stores , traders that move between the Underdark and the surface and good available through guilds and player stores.  There are crafting guilds, conflict guilds, racial guilds, religious guilds, settlement guilds they are called factions and you can belong to a bunch of them.<br/>\n<br/>\nSelf buffers can manage using spells but generally enchanting is the way to go then layer buffs on top. Any build can be an enchanter and there are mundane and magical paths to enchant.  If that is not your thing, you can commission terms via the player run economy or via your guild.<br/>\n<br/>\nThere are definitely class advantages that can make up for lack of equipment but given the robust economy it is usually a layer dropped items advanced into a layer or crafted/enchanted items and then into risky enchanting where equipment can be made more powerful at the risk of destruction.<br/>\n<br/>\nThe highest crafted equipment is typically would be +3, there are some racial/class limited +4 items and Armor has been adjusted to allow light/medium/heavy wears have a similar top end.  <br/>\n<br/>\nPvP is considered an important part of RP but the RP is supposed to make it fun for both parties.  PvP does not require consent, but it does require active RP, as such there is over active PvP on occasion but it is frowned upon and there are limits to PvP conflicts.   I played on Arelith actively for more than one year, PvP is not really my thing, I was involved in PvP about 6 times over that period.  PvP is a conflict resolution mechanism for the upper end RP though so, it can have ramifications at a guild/settlement level.  On the flip side, there are characters that PvP daily.<br/>\n<br/>\nArelith has boats, for example, and about 6 months back, a surface raiding party burned the Underdark boat which left it disabled until resources could be gathered to rebuild it.<br/>\n<br/>\nIt is an interesting place with a robust character drive economy, well balanced classes and reasonably balanced PvP.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    }
  ]
}