{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "573",
  "name": "The Knight Errant (Paladin 9 / Rogue 5 / Champion of Torm 26)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-knight-errant-paladin-9-rogue-5-champion-of-to-t2355524.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "31",
  "views": "4.2K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:21 PM - Aug 03, 2020",
      "content": "<div><strong><span style=\"font-size:150%;line-height:normal\">The Knight Errant (Paladin 9 / Rogue 5 / Champion of Torm 26)</span></strong><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202008/10759084_fa73d54bcaaa2ebd2661cee6de43ca59_t.jpg\"/><span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://i.pinimg.com/originals/d1/65/42/d1654292cc01f879866d887294e918ba.jpg\" rel=\"noreferrer\" target=\"_blank\">https://i.pinimg.com/originals/d1/65/42 ... e918ba.jpg</a></span><br/>\n<br/>\nFun idea here:<br/>\n- Paladin 9 for great saves, great immunities (ie fear/disease immunity), smite evil, divine might, divine shield, great proficiencies<br/>\n- Ultra high Champion of Torm 26 for incredible saves, lots of bonus feats and extra smite damage / level<br/>\n- Rogue 5 for Evasion, UMD, Tumble, a little sneak damage, disable and search trap skills<br/>\n<br/>\nThe character very good offensive abilities, with 30 Str (capped at 42), 18 Cha (capped at 30), mundane AB 43, all the combat feats one desires (WF/EWF/EP, IC, KD/IKD, D/ID, E, PA/Cleave), +15 to 24 str damage, 3d6 sneak attack damage, divine might for added divine damage +4-10 (depending if CHA is capped), power attack for +5 damage at the cost of -5AB, smite evil 3x/day with +4-10 AB and +35 damage, taunt for up to -6AC to enemies and divine wrath for +11 to AB/DMG, DR 20/+4 and hit the saves cap, lasting 4-10 rounds.<br/>\n<br/>\nThe character excellent defensive capabilities with 460hp (capped at 700hp), F42(54 - capped stats) W36(48) R38(50), Evasion, Divine Shield (for +4-10 AC as needed), Uncanny Dodge, +10 AC from Tumble 40 and Armor skin, UMD 33 to cast any spell one wishes from scrolls, wands etc for other defenses such as Mind Blank, Premonition, Improved Invisibility's 50% concealment. <br/>\n<br/>\n263 skill points, I put them in Discipline/Taunt/Tumble/UMD/DT/Search/Spot/Open Lock/Set Trap. He can disarm up to DC 58 traps (toolset epic traps) and detect up to DC 43 traps (toolset epic traps), open up to DC 53 locks with capped Dex and a +10 thieves tool, set deadly traps except deadly gas traps at level 17. The skill dumps I spaced out the best I could for playability. <br/>\n<br/>\nRole play wise this is an errant knight, shipwrecked from a quest and lost in a foreign land. He is searching for a way home, to serve his lord and lady and defend the realm again but he does not know where to go. The survival skills he is required to develop mean he has does a roguish nature, and combined with his natural tendency for lawful goodness means he wins the admiration of others without abusing this charm, returning all favors he receives out of a sense of fairness and justice.<br/>\n<br/>\nThere are about 14 builds with these classes (Paladin/Rogue/CoT), but only one that goes high CoT, <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/divine-generalist-rogue-5-paladin-7-champion-of-to-t2343426.html\" rel=\"noreferrer\" target=\"_blank\">Divine Generalist</a> by Bru, which is a dev crit build, uses a slightly different class combinations, it has less strength, AB, doesn't have extra smiting, improved disarm/expertise, but more HP and a better will save, skill schedule is different, I invest more in rogue skills, whereas there is more spellcraft investment for +4 to saves against spells. Divine Generalist has a huge skill dump of about 120 skill points at level 39, I spread the skill dumps out a bit more. I hit Str 30 for an even str modifier for maximal strength damage boosts.<br/>\n<br/>\n<details><summary>Spoiler</summary>Rogue(5), Paladin(9), Champion of Torm(26), Human\n\nDEX: 8\nWIS: 8\nCHA: 16 (18)\nHuman: (Quick to Master)\n02: Paladin(1)\n04: Paladin(3): STR+1, (STR=17)\n06: Paladin(5): Divine Shield\n08: Paladin(6): STR+1, (STR=18)\n10: Champion of Torm(2): Knockdown\n12: Champion of Torm(4): STR+1, Extra Smiting, Blind Fight, (STR=19)\n14: Champion of Torm(6): Disarm\n16: Champion of Torm(8): STR+1, Improved Disarm, (STR=20)\n18: Paladin(7): Divine Might\n20: Champion of Torm(10): CHA+1, Improved Knockdown, (CHA=17)\n22: Champion of Torm(12)\n24: Champion of Torm(14): STR+1, Great Strength I, Epic Weapon Focus: Greatsword, (STR=22)\n26: Champion of Torm(16)\n28: Champion of Torm(17): STR+1, (STR=24)\n30: Champion of Torm(18): Epic Will, Improved Critical: Greatsword\n32: Champion of Torm(20): STR+1, (STR=25)\n34: Champion of Torm(22): Armor Skin\n36: Champion of Torm(24): STR+1, Great Strength IV, (STR=28)\n38: Champion of Torm(25)\n40: Paladin(9): STR+1, (STR=30)\nHitpoints: 460\nSaving Throws (Fortitude/Will/Reflex): 41/36/38\nBAB: 29\nAC (naked/mundane armor/shield only): 19/30\nAlignment Changes: 0\nDisable Trap 34(38), Discipline 43(53), Open Lock 18(17), Search 21(23), Set Trap 14(15), Spot 21(20), Taunt 43(47), Tumble 40(39), UMD 29(33)\n\n02: Discipline(5), Taunt(5), Save(13), \n04: Discipline(1), Taunt(1), Save(19), \n06: Discipline(1), Taunt(1), Save(25), \n08: Discipline(2), Taunt(2), Save(1), \n10: Discipline(1), Save(7), \n12: Discipline(1), Save(15), \n14: Discipline(1), Save(23), \n16: Discipline(1), Save(31), \n18: Discipline(1), Taunt(10), \n20: Discipline(1), Spot(4), \n22: Discipline(1), Save(6), \n24: Discipline(1), Save(14), \n26: Save(24), \n28: Save(6), \n30: Discipline(5), \n32: Discipline(1), Save(7), \n34: Discipline(1), Save(15), \n36: Discipline(1), Save(23), \n38: Discipline(2), Save(3), \n40: Discipline(1), Taunt(11), \n</details>\n\nDev Crit, can be put in the build easily by putting Overwhelming Critical and Devastating Critical. I didn't pursue this as I find it more fun without dev crit these days. <br/>\n<br/>\nWith a Fort Save around 50 along with divine shield and expertise to increase AC to reduce the chance to crit, he probably isn't going to be afraid of dev critters who usually have DCs 38-50, plus he can disarm dev critters who don't come at him with a proper weapon.  <br/>\n<br/>\nI didn't pursue great smiting feats either, to get to Cha 25 would have been a substantial effort, then to give up remaining stat gains and only 4 bonus CoT feats total in epics.<br/>\n<br/>\n<strong>Acknowledgement</strong>: WebShaman for suggestions (change Rogue 3 level from 20-&gt;17, drop resist acid)<br/>\n<br/>\n<strong>Edits: </strong>Expertise at level 1. Starting Stats changed to Str 16 / Con 12 / Int 14 / Cha 16. Epic Will put into the build. Skill schedule adjusted based on information from <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/unravelling-the-world-of-nwn-traps-a-primer-t2176824.html\" rel=\"noreferrer\" target=\"_blank\">HipMaestro's Trapping primer</a>, <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Set_trap\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki: Set Trap</a> and <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Talk:Set_trap\" rel=\"noreferrer\" target=\"_blank\">Set Trap: Talk</a> pages to allow for detection and disabling of epic traps.</div>"
    },
    {
      "author": "MentalDekay",
      "avatar": "10759116_1563898639.jpg",
      "timestamp": "3:00 PM - Aug 03, 2020",
      "content": "<div>And Web blows a gasket for a Pal/Rog :D ..not to knock his point, just laughing at his zeal</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:09 PM - Aug 03, 2020",
      "content": "<div>Ah, I see MD has posted while I was looking for the link. Oh well, I'll post it anyway...<br/>\n<br/>\nYou do realize, of course, that you're reopening a very old can of worms here - the latest iteration of which can be found in Mick's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-holy-instigator-rogue-19-paladin-20-sd-1-t2355400.html\" rel=\"noreferrer\" target=\"_blank\">Holy Instigator</a><br/>\n<br/>\nGood luck!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:37 PM - Aug 03, 2020",
      "content": "<div>I guess MD and Stag liked the build draft? In a roundabout way via WebShaman? Uhhh thanks I guess :) <br/>\nIt's barely a rogue btw, about the same amount of rogue as GDL's <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build222567.html\" rel=\"noreferrer\" target=\"_blank\">Knight of the Quest</a>, its just a touch of rogue, a whole lot of CoT and Paladin<br/>\n<br/>\nBtw I did a bit more homework on <a class=\"postlink\" href=\"https://en.wikipedia.org/wiki/Knight-errant\" rel=\"noreferrer\" target=\"_blank\">Knight-Errants - Wikipedia</a> to read more. </div>"
    },
    {
      "author": "MentalDekay",
      "avatar": "10759116_1563898639.jpg",
      "timestamp": "3:51 PM - Aug 03, 2020",
      "content": "<div>Ya... sorry about that. I was getting a beating in a customer meeting, so my mind wandered when they went to lashing someone else..let's blame my trollage on that and a lack coffee having absorbed in the bloodstream.<br/>\n<br/>\nI like the build. Saves in the 30's and 40's! Whoop whoop! <br/>\n<br/>\nTho, as Orion points out, those first couple levels are going to be an uphill slog.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:11 PM - Aug 03, 2020",
      "content": "<div>Boys will be boys *sigh*<br/>\n<br/>\nConsider yourselves harshly scolded.<br/>\n<br/>\nI personally do like the Paladin/CoT synergy here.  The extra feats are put to good use imo.<br/>\n<br/>\nOne thing - level 17 you take resist acid.  I was thinking perhaps Great Cleave here, instead.  Especially in an environment where one can UMD and has access to Breaches ala Wand or Scroll.<br/>\n<br/>\nA build like this can make some pretty good use of Great Cleave (imo), and level 17 is ok.  One might want to introduce it earlier to get more bang for the buck.<br/>\n<br/>\nCleave and Power Attack are backwards at first level.  PA is a requirement for Cleave (I know, nitpicking here).<br/>\n<br/>\nThe breakdown is playable - and you do have room pre-epic for one more level of Rogue if you wished to (for the Tumble dump at level 17, for example).<br/>\n<br/>\nThe Rogue level at 20 seems a tick out of place - would maybe be better at like 23, to get that Tumble to 25 (assuming one does not wish to take it pre-epic at level 17, instead).  <br/>\n<br/>\nMechanically, I understand the choice of Rogue here.  With the alignment restrictions, Bard and Assassin are out.  Yeah, I'm grinding my teeth saying that.<br/>\n<br/>\nPeace, out.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:36 PM - Aug 03, 2020",
      "content": "<div>Thanks Web for your suggestions! I like the idea of dropping resist acid for great cleave!<br/>\nOrder of the feats could use a bit more thought as well. <br/>\nI think you are right about the Rogue 3 level at level 20 is not optimal.<br/>\nBecause I have a maximum of 10 CoT levels up to level 20 I might move Rogue 3 to 17. <br/>\nThen the rogue skill dumps are nicely spaced every 10 levels from level 7.<br/>\nThanks for your comments!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:10 PM - Aug 03, 2020",
      "content": "<div>I'm just having a random thought here, please feel free to dismiss it.<br/>\n<br/>\nWhat about Harper Scout instead of Rogue - all 5 levels taken in epic? Yes, you lose UMD, and it will cost a couple of feats (Alertness and Iron Will), but you have feats to burn (I for one am not a fan of Great Cleave except on a route to Dev Crit, and Toughness seems something of a luxury) and can take 2 Great CHAs as HS bonus feats, so freeing up either 2 general feats or stat bumps. You would need to take 10 levels of Pally pre-epic, meaning you could take a total of 22 or 24 CoT levels and 13 or 11 Pally.<br/>\n<br/>\nI haven't done any real working-out here, so I'm just bouncing the idea. And it seems to fit more comfortably with the Knight Errant concept.<br/>\n<br/>\nWhat do you think?<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:42 PM - Aug 03, 2020",
      "content": "<div>Hey Stag! Thanks for your interest!<br/>\nThere is good synergy with the two great charisma feats from Harper Scout along with the opportunity to put skill dumps in tumble and spellcraft. I think your suggestion could work. <br/>\n<br/>\nI like Rogue better though. I think it is much more powerful :) <br/>\nRogue at level 1 not only adds 24 skill points ([8-2]*4) but allows me to 'dump' the Wisdom statistic allowing me to invest more attributes elsewhere. There is excellent synergy with evasion and the very high saves. The extra sneak damage is handy. UMD is such a powerful ability, cast any spell he wants from scrolls, use a lot of normally restricted equipment, plus as Web mentions, the powerful wand of lesser spell breach if he finally gets his hands on it, for the use of smiting evil mages. There is access to disable trap skills, this guy doesn't really care with most traps, with evasion and high saves he can run over em without fear, but he wants to protect his teammates from harm. Uncanny dodge is nice.<br/>\n<br/>\nI do like Rogue from a RP perspective. This guy is lawfully good and a knight, but he has been forced to develop some survival skills in a foreign and hostile environment, shipwrecked, lost all his equipment and entourage, he has to scrape from the bottom to survive but at his core is a noble knight, lost without a liege and lady to serve, and on his battle to get home, he tries to uphold his noble values on a series of chivalric adventures to regain equipment more befitting a knight - to survive, to protect the innocent, to smite evil, and to find his way home and serve his nation once more.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:23 AM - Aug 04, 2020",
      "content": "<div>No problem, it's your build after all. <span class=\"text-emoji\">🙂</span><br/>\n<br/>\nAs you know, I tend more to the RP than the optimized, and from that angle I will still question your use of Rogue - particularly at level 1. That's done purely for utilitarian reasons, and is quite understandable as such, please don't try to kid me otherwise.<br/>\n<br/>\nI could buy a concept with Rogue at 1 if we take the character on a road to Damascus moment, but even then I don't see how you could take more Rogue levels (oh, damn it, I'm turning into Web).<br/>\n<br/>\nMerely posing questions!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:04 AM - Aug 04, 2020",
      "content": "<div>Actually Mick Dagger has already done the Paladin / CoT / Harper combination really well<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/harper-general-paladin-20-cot-15-harper-scout-5-t2355242.html\" rel=\"noreferrer\" target=\"_blank\">The Harper General</a><br/>\n<br/>\nSo its a good idea, and it been done already. As they say great minds think alike so your train of thinking goes along that lines. <br/>\n<br/>\nRegarding the Rogue/Paladin stuff -&gt; I don't have a problem combining the classes together. Rogues have no alignment restrictions, they can be lawful and good aligned and its in DnD for a reason, a reason being to allow for complex and interesting characters for players to create special and unique identities. I don't have fixed ideas on what a rogue is, my ideas are much more flexible, I believe each character and person has an individual identity, our identities are shaped by the work and roles we do, but not completely defined by them. The lack of alignment restrictions on rogues (as opposed to Bards, Barbarians, Assassins and Monks for example) is evidence in my opinion that the DnD system supports my ideas that rogues should be viewed as much more flexible.<br/>\n<br/>\nA lawful good rogue could be a secret service operative working on behalf of a nation, keeping its citizen's safe by gathering intelligence or performing special forces operations in dangerous situations. A paladin army will need someone to scout for them, open locks and disarm traps for them, for example, and a rogue working for those paladins is by nature, lawfully good, because they are serving the law, and the forces of good. Much more efficient is such an army with a skilled trap squad rather than using spells or running over the traps and taking damage.<br/>\n<br/>\nThe Rogue 1 fits in RP wise as well. We are not all fortunate to be born into a position of priviledge, and it might be as a young squire he started off as a rogue just to survive, just using less of the stealing and pickpocketing stuff, and more UMD/stealth/trap disarming/charm/diplomacy stuff. By chance he performs a great boon to a eminent knight (perhaps saving the life of this knights sister who gets lost in the backstreets), becomes his adopted squire and learns knightly ways -&gt; then gets shipwrecked on a quest in a foreign land, his noble mentor and benefactor perishing protecting the characters life. He needs to survive without knightly skills and equipment again, disable traps etc... you can see there is no Road to Damascus moment here, just a young person, just trying to find their way in this world, taking the opportunities that are given to him, and adapting to the needs of the situation. You can also see it allows for a very rich, complex and interesting character if one doesn't limits oneself from possibilities. </div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:47 AM - Aug 04, 2020",
      "content": "<div>For roleplay reasons, the game will treat you like you are what you took at level 1.  Not matter how much Paladin and CoT you have in your build, the NPCs will always call you a Rogue.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:43 AM - Aug 04, 2020",
      "content": "<div><blockquote><div><cite>Empyre65 wrote: <div class=\"responsive-hide\">Aug 04, 2020</div></cite>For roleplay reasons, the game will treat you like you are what you took at level 1.  Not matter how much Paladin and CoT you have in your build, the NPCs will always call you a Rogue.</div></blockquote>\nThe game will call you by the class you took at level 1, but it is simply sematic. It will treat you as a paladin/rogue.<br/>\nIf the character has a single level of paladin, and you talk to an NPC that has a paladin specific response or quest or reward, the NPC will search and identify that paladin, and you be treated as a paladin.<br/>\nThis is very apparent in WoG, where certain quests will enable paladin specific responses and give paladin specific quest rewards. <br/>\nIt probably also true in Aielund, where there is a paladin specific quest in Act II but I have not played Aielund for over 12 months.<br/>\nOn the plus side, if there are rogue specific quests or rewards, then they will be available to the character as well as the paladin ones. <br/>\nThis is also very apparent on WoG where there is a very prominent Thieves's Guild involved with running the city and a handful of rogue only merchants.<br/>\nIn the end the game will call you a rogue if that is the class you took at level 1, but it will treat you like a paladin/rogue. <br/>\nGranting rewards and benefits of both classes not just the class taken at level 1.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:38 AM - Aug 04, 2020",
      "content": "<div>The conflict of Paladin and Rogue is a quite simple one - SNEAK ATTACK.<br/>\n<br/>\nEverything else can be RPed and explained away - I should know, I'm pretty good at doing that!  But SA keeps getting in the way, especially in NWN where one cannot \"turn it off\" - the character will SA when the engine says it can, there is little the Player themselves can do to stop it.<br/>\n<br/>\nObviously, one can do something to control how often it will occur - but that is about all.<br/>\n<br/>\nNow, the Player's Handbook (3.0) says this about Paladins <blockquote><div>Background: <strong>No one ever chooses to be a paladin. Becoming a paladin is answering a call, accepting one’s destiny. No one, no matter how diligent, can become a paladin through practice.</strong> <strong>The nature is either within one or not, and it is not possible to gain the paladin’s nature by any act of will.</strong> It is possible to fail to recognize one’s own potential, or to deny one’s destiny. Some who are called to be paladins deny the call and pursue some other life instead.Most paladins answer the call and begin training as adolescents. Typically, they become squires or assistants to experienced paladins, train for years, and finally set off on their own to further the causes of good and law. Other paladins, however, find their calling only later in life, after having pursued some other career. All paladins, regardless of background, recognize in each other an eternal bond that transcends culture, race, and even religion. Any two paladins, even from opposite sides of the world, consider themselves comrades</div></blockquote>\n\nThe Block bolded are mine, to underline the main point here - Paladins are born to be what they are.<br/>\n<br/>\nNow for <blockquote><div>Sneak Attack: If a rogue can catch an opponent <strong>when he is unable to defend himself effectively from her attack, she can strike a vital spot for extra damage.</strong> Basically, any time the rogue’s target would be denied his Dexterity bonus to AC (whether he actually has a Dexterity bonus or not), or when the rogue flanks the target, the rogue’s attack deals extra damage. The extra damage is +1d6 at 1st level and an additional 1d6 every two levels thereafter. Should the rogue score a critical hit with a sneak attack, this extra damage is not multiplied.</div></blockquote>\n\nThat is the problem, there in bold.  Striking an opponent when they cannot defend themselves.  This is anathema to what a Paladin is, stands for, and believes in.<br/>\n<br/>\nThis is like a gun duel in the old West.  The two square off at high noon, both ready.  But the Paladin here, will never draw his gun first.  He will wait for (the villain) to go for his gun, before shooting him down with his greased lightning speed!<br/>\n<br/>\nOr the Paladin that disarms his foe, and allows him to either surrender or regain his weapon to fight on, instead of slaying the now unarmed foe.<br/>\n<br/>\nI have no problem with a LG Rogue.  I have no problem with a Rogue/CoT - it works together quite well imo.  But Paladin and Rogue just does not work, due to Sneak Attack and the mentality that is behind it, and how a Paladin works.  This is not an Alignment issue, it is an issue with the core of both Classes.  One that will take advantage of an opponent and strike, and another that will not.  One that must follow his Code of Conduct, and one who can ignore such at will.<br/>\n<br/>\nHere at the ECB we tend to deal with only the mechanics of builds.  And that is fine, I have no problem with that.  But one should feel really cheesey when one mixes Pally/Rog together for the above reason, just like we all say \"sprinkle in some Monk for some cheese\" (because yeah, it is cheesey), just like alignment changes are.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:28 PM - Aug 04, 2020",
      "content": "<div>Its good to explore why you feel uncomfortable with the concept of a paladin/rogue.<br/>\nI understand your main concern is that they shouldn't be sneak attacking. <br/>\nI personally have no problems with paladins using sneak attack.<br/>\nIt is probably good to explore that too.<br/>\n<br/>\nI view Paladins as protectors. They have sworn an oath to protect a country, or complete a quest.<br/>\nThere is a vicious battle, and a dangerous opponent decides to stop battling you and attack your vulnerable teammate instead.<br/>\nThis is a common occurrence in parties. It makes sense you protect your vulnerable teammate.<br/>\nYour vulnerable teammate could be innocent citizens of your realm you have sworn to protect or even the liege or lady you have vowed to protect with your life.<br/>\nMaybe they cannot protect themselves, you are their protector, this is your identity and purpose. Failing your oath is a fate worse than death itself.<br/>\n<br/>\nIf this dangerous opponent does not face you then as a paladin you will attack them with flanking attacks.<br/>\nYou will attempt to knock them down.<br/>\nYou will attempt to disarm them of their weapon, if you are able to.<br/>\nAnd if he is unable to defend himself effectively from your attack, you will strike a vital spot for extra damage, it is like aiming for a chink in their armor or a particular vulnerability.<br/>\nBecause the faster you dispatch your enemy the more likely you will fulfill your oath to protect, and the slower you dispatch your enemy, the more likely you will fail to fulfill your oath.<br/>\n<br/>\nThis dangerous opponent will not hesitate and will not stop until the individuals you have sworn an oath to protect have either been killed, or this dangerous opponent is killed.<br/>\nIn this situation, in your mind you do not hesitate to dispatch such vicious monsters. <br/>\nYou see a gap in their armor while you are flanking them. You target this and increase the damage you output. <br/>\nYou knock them to the ground. You know if they get up again they will attack those you are meant to protect. You also know such opponents will attack you on the ground, if you were in the same situation. You do not hesitate to attack such opponents on the ground, for if the situation is reversed they will do the same, so it is a fair engagement. And you strike them where it hurts.<br/>\nYou disarm them of their massive greataxe, but they have powerful vicious fists capable of crushing skulls -&gt; this is still a danger to those you are meant to protect. You fight them, and if they do not face you, you strike them where it hurts.<br/>\n<br/>\nIn essence a paladin can have sneak attack in my view. It is situational damage that targets vital parts increasing damage output. It makes them more effective protectors.<br/>\n<blockquote><div>This is like a gun duel in the old West.  The two square off at high noon, both ready.  But the Paladin here, will never draw his gun first.  He will wait for (the villain) to go for his gun, before shooting him down with his greased lightning speed!</div></blockquote>\nIf it is a practice duel amongst colleagues and friends this is fine and very noble. <br/>\nBut my Paladin will not if it counts. He is of high intelligence and understands his responsibilities to his nation and the people he serves. His chances of failure increase by allowing the villain to reach for his gun first, and he knows he has low dexterity to allow him to have high charisma. If the villain wins, his liege and lady is in danger, and the people of the realm face utter ruin. Too much is at stake. He will defend his nation with every ounce of his strength, power and capabilities.<br/>\n<br/>\nAnyway my thoughts :) Hope you enjoyed reading them</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:52 PM - Aug 04, 2020",
      "content": "<div>This is where we differ, and where the rules are on my side.<br/>\n<br/>\nNow, I did not make the rules, anymore than you did.  And yes, one can make up any homebrew rules one wants (it is D&amp;D) - this is what you are doing.<br/>\n<br/>\nBut in the rules as written (pretty much what we have to go by when there is a dispute), it doesn't work.<br/>\n<br/>\nYou are not describing a Paladin.  You are describing more along the lines of a CoT, or honorable Fighter, or X.  But not a Paladin.<br/>\n<br/>\nA Paladin does not deviate from his Code of Conduct.  Doing so results in penalty, grob discrepancies resulting in a Fall. I think this is where you are having the problem here - a Paladin is more than just a Fighter with a bunch of abilities baked in.  It is a living example of Law, Good, and whatever is in it's Code of Conduct.  There is a valid reason why it has to be Lawful and Good aligned.  It is what separates it from the CoT, as well.<br/>\n<br/>\nI can see a Paladin making an exception, and then repenting his action (we are mortal and make mistakes).  But Sneak Attack happens every time the Paladin is in such a position to cause one and attacks - it is not a mistake, it is a deliberate choice.  Continuing to use it is obviously a grob (meaning huge) discrepancy - and results in a Fall.<br/>\n<br/>\nI feel if one could somehow separate Rogue from Sneak Attack, it could work.  Perhaps Sneak Attack should be a feat.<br/>\n<br/>\nThese days, with 5e, I think the whole thing is now moot, anyway.  But earlier versions for Pally are even more restrictive iirc.</div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "1:34 PM - Aug 04, 2020",
      "content": "<div>Well, iirc in 3rd edition players handbook you are not allowed to take any more paladin levels after you multiclassed to something else (same goes for monks, and maybe druids too). 3rd edition pnp dnd is one thing, and nwn is another.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:51 PM - Aug 04, 2020",
      "content": "<div>Yes, a very good distinction.  NWN is like it's own homebrew.<br/>\n<br/>\nI mean, Bioware didn't even program in a Paladin falling.  So yeah, it is homebrew, no doubt about it.<br/>\n<br/>\nSo enough of the Pally/Rog stuff.  It's distracting from OP's post, anyway.  I humbly bow out.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:52 PM - Aug 04, 2020",
      "content": "<div>This is a very interesting discussion Web and thank you for trying to explain your position.<br/>\nI very much respect your interpretation.<br/>\n<br/>\nMy understanding is that you interpret the Code of Conduct of Paladins not allowing for sneak attack, so Rogue is not allowable in your view.<br/>\n<br/>\nI wanted to explore my own view on this, and I tried to find the DnD 3.0 comment on the Code of Conduct. The best I could find was a 3.5e version <a class=\"postlink\" href=\"https://www.d20srd.org/srd/classes/paladin.htm\" rel=\"noreferrer\" target=\"_blank\">here</a>.<br/>\nI expect it to be similar but if there is a 3.0e version I am happy to read it too.<br/>\n<blockquote><div><strong>Code of Conduct</strong><br/>\nA paladin must be of lawful good alignment and loses all class abilities if she ever willingly commits an evil act.<br/>\n<br/>\nAdditionally, a paladin’s code requires that she respect legitimate authority, act with honor (not lying, not cheating, not using poison, and so forth), help those in need (provided they do not use the help for evil or chaotic ends), and punish those who harm or threaten innocents.</div></blockquote>\nThen we can look at sneak attack which you have kindly supplied, with thanks:<br/>\n<blockquote><div><strong>Sneak Attack: </strong><br/>\nIf a rogue can catch an opponent when he is unable to defend himself effectively from her attack, she can strike a vital spot for extra damage. Basically, any time the rogue’s target would be denied his Dexterity bonus to AC (whether he actually has a Dexterity bonus or not), or when the rogue flanks the target, the rogue’s attack deals extra damage.</div></blockquote>\nThis is my interpretation. <br/>\n<br/>\nSneak attack is extra damage when an opponent is flanked or lost their dexterity bonus to AC. <br/>\n<br/>\nThe relevant parts of the code that apply to sneak attack are:<br/>\n- that she act with honor (not lying, not cheating, not using poison, and so forth)<br/>\n- help those in need (provided they do not use the help for evil or chaotic ends)<br/>\n- punish those who harm or threaten innocents<br/>\n<br/>\nSneak Attack as I have explained, can apply to points 2 and 3. By acting as a protector, one is helping those in need and punishing those who harm or threaten innocents. If an enemy decides to not target you and target innocents, you have every right to strike at their vulnerabilities, to knock them down, to disarm them and to dispatch them as fast as possible, and sneak attack assists with this. <br/>\n<br/>\nIs sneak attack acting with honor however? There is probably a lot of variance in one's belief system here. There are three examples (lying, cheating and using poison) given of dishonorable conduct. Sneak attack is not lying and not using poison, so those sections are not relevant. <br/>\n<br/>\nIs Sneak Attack cheating then? I do not believe this is the case. If a paladin has had special training to strike at vulnerabilities, then it is within the rules for the paladin to use this. If there is a gap in the opponents armor you can target, I do not see such an act as cheating, because your opponent might do the same to you, should you expose your own vulnerabilities to them. The same rules apply to them as they apply to you, no cheating involved. It is simply added damage, in a situation where the enemies defenses are reduced.<br/>\n<br/>\nOf course this is open to interpretation. Suppose one views Sneak Attack as cheating. Then what about Devastating Critical. Is that cheating? Or what about a Sorceress with a level of paladin, casting a Haste-Time Stop-Wail of the Banshee x2 combo. Two DC 45 fort saves or die Wail of the Banshee over a colossal area of effect targeting only enemies against 20-50 opponents, all of them dying, with no opportunity to respond. Is that cheating? Such acts are incredible powerful powerful acts, but they are within the rules and require substantial investment and I would not interpret them as cheating, or dishonorable, provided those 20-50 enemies were evil doers who would threaten the innocents you are meant to protect. In the context of these matters I view whether my paladin does an extra 3d6 damage or even 15d6 damage in certain situations relatively moot.<br/>\n<br/>\nI don't believe in right or wrong here, just different interpretations. Of course this is my interpretation of the matter and others interpretations will differ and so they should. Of course I respect that. There are consequences of that interpretation as well. It might include missing out on enjoying paladin/rogue builds that are very fun to play. A number of eminent builders Mithdradates, Grizzled_Dwarflord, TyrTemplar, Ithacan have all made Paladin/Rogues, for example. Joy and happiness are important things we need in this world right now, much more than ever.<br/>\n<br/>\n<strong>Edit:</strong> Double ninjaed :) with thanks</div>"
    },
    {
      "author": "MentalDekay",
      "avatar": "10759116_1563898639.jpg",
      "timestamp": "1:59 PM - Aug 04, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Aug 04, 2020</div></cite>I mean, Bioware didn't even program in a Paladin falling.  So yeah, it is homebrew, no doubt about it.</div></blockquote>\nBeamdog promised a hotfix for that in 1.7 or 1.99, if you buy a bunch of game soundtracks again.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:05 PM - Aug 04, 2020",
      "content": "<div><blockquote><div><cite>Orion wrote: <div class=\"responsive-hide\">Aug 04, 2020</div></cite>\nI don't believe in right or wrong here</div></blockquote>\nSorry, couldn't resist this one in a discussion about paladins... <span class=\"text-emoji\">😄</span><br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:13 PM - Aug 04, 2020",
      "content": "<div><blockquote><div><cite>Stagmeister wrote: <div class=\"responsive-hide\">Aug 04, 2020</div></cite><blockquote><div><cite>Orion wrote: <div class=\"responsive-hide\">Aug 04, 2020</div></cite>\nI don't believe in right or wrong here</div></blockquote>\nSorry, couldn't resist this one in a discussion about paladins... <span class=\"text-emoji\">😄</span><br/>\n<br/>\nCheers</div></blockquote>\nHah, that is the editor in you coming out. Sharp eyes!<br/>\nIn essence I am trying to say Web and I have different interpretations, they are allowed to be different we have our reasons for interpreting things differently, there is reasoning why in a role play sense I am completely comfortable with a paladin/rogue, we are all entitled to different views and I respect all different views on the matter!</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:29 PM - Aug 04, 2020",
      "content": "<div>Ok, if you wish to pursue this closer, so be it.<br/>\n<blockquote><div>- that she act with honor (not lying, not cheating, not using poison, <strong>and so forth</strong>)</div></blockquote>\n\nThere it is.  This is also <strong>FIGHT</strong> with <strong>Honor</strong>. Striking someone when they cannot defend against it is not fighting with honor.  Plain and simple.  I know, it really sounds like semantics, right?  But Paladins take this stuff <strong>seriously </strong>(and have to - their Code of Conduct demands it).  Only in the most desperate situation, where the greater good would be to use such a tactic would it be considerable.  And to be atoned for, afterwards.  And that is my point here - exception to the rule, not the rule itself. And atoned for, afterwards.<br/>\n<br/>\nYou will note that Blackguards get Sneak Attack.  There is a reason for this, and it points directly towards that Sneak Attack is not a \"good\", \"noble\", nor \"honorable\" thing to do.<br/>\n<br/>\nAlso, this is 3.5 Ed - so NWN2. To really come to terms with it, one actually has to go back to 2.0 and look at the Codes of Conduct there, especially for the Cavalier.<br/>\n<br/>\nWe shall ignore, for argument's sake, the multiclass restriction (let us go with the idea that NWN is homebrew).<br/>\n<br/>\nIt is only Sneak Attack that is the real problem here.  If it was just different in nature, I really wouldn't have a problem with it.  Such as Criticals.  No problem here.<br/>\n<br/>\nIt used to be even worse - it was called Backstab.  Ouch.</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "3:28 PM - Aug 04, 2020",
      "content": "<div>Just to jump in the mix....Paladins, according to this code, shouldn't take knockdown/improved knockdown, not to mention disarm/improved disarm.<br/>\n<br/>\nProne characters can't actively defend themselves! Disarmed characters are at a disadvantage! Beating up on an enemy that doesn't have a weapon?</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:57 PM - Aug 04, 2020",
      "content": "<div>Being KDed, Disarmed does not make one helpless.  Just because they are disadvantaged, does not make one helpless.  <br/>\n<br/>\nThey. can. still. defend. themselves.<br/>\n<br/>\nAlthough, yeah, if one has Sneak Attack, guess what?  It automatically fires when one is KDed.  Hmmm...<br/>\n<br/>\nBut it doesn't when Disarmed.<br/>\n<br/>\nIt may draw AoO, but that is as it is.<br/>\n<br/>\nYour post is more along the lines of Lawful Stupid Pally, than Lawful Good Pally.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:57 PM - Aug 04, 2020",
      "content": "<div>As mentioned I respect your interpretation on this matter Web.<br/>\nI have a different interpretation which I have explored in detail already and there is no need to repeat the details. <br/>\nThe essence is sneak attack is an action in which extra damage is applied when an opponent is flanked or lost their dexterity bonus to AC (ie sneak attack).<br/>\nIt can be honorable or can be dishonorable. It depends on the intent and purpose behind it. <br/>\nIf the purpose is to protect innocents or help those in need then there is no dishonor.<br/>\nIf the purpose is to perform evil deeds, then that is very dishonorable.<br/>\n<br/>\nThe Blackguard sharing sneak attack with rogue comparison I interpret differently. Blackguards also get Bull's Strengths and Martial Weapon Proficiency just like Paladins. This does not make Bull's Strength or Martial Weapon Proficiency dishonorable or evil. I believe the same should apply with sneak attack. <br/>\n<br/>\nWe can discuss this forever and search 2.0 rules or other DnD rules and still not agree. <br/>\nThe best outcome is simply respect each others viewpoints on the matter and we feel strongly about both viewpoints. <br/>\nI certainly respect your view on this matter as different as mine.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:19 PM - Aug 04, 2020",
      "content": "<div>Right, shall we draw a line under this one for now? The lessons of history and all that malarkey...<br/>\n<br/>\nLet's try something less controversial next, shall we? Like Discipline in DEX builds, or whether Assassins should have to be evil.<br/>\n<br/>\nHow about this: <em>@Orion</em> - go play the build. If you enjoy it, great. <em>@webshaman1</em> - don't play the build. Job sorted. My work here is done.<br/>\n<br/>\nCheers!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:03 PM - Aug 04, 2020",
      "content": "<div><blockquote><div><cite>Stagmeister wrote: <div class=\"responsive-hide\">Aug 04, 2020</div></cite>Let's try something less controversial next, shall we? Like Discipline in DEX builds, or whether Assassins should have to be evil.</div></blockquote>\nDiscipline in Dex build - Yes<br/>\nAssassins Evil - Yes</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:24 PM - Aug 04, 2020",
      "content": "<div>I am from way back then, the beginning of D&amp;D.  <br/>\n<br/>\nBack then, as Paladins became playable, it was an almost mythical thing to be - just look at the requirements :<br/>\n<blockquote><div>To become a paladin a character must be human, have a strength of not less than 12, a minimum intelligence of 9, a wisdom of 13 or more, a minimum constitution of 9, and not less than 17 charisma</div></blockquote>\n\nThis was way back in 1st edition, where one had to roll 3d6 for each Stat, without being able to move them around (i.e. you roll 3d6 for each stat, and the result for that stat is what you get).  Getting a 17 from 3d6 for Cha was hard.  <br/>\n<br/>\nOf course, the benefits were astounding - the Paladin really was the Archetype of Lawful and Good back then (in a time where Heroes were actually considered a Lawful and Good thing).<br/>\n<br/>\nBut I digress.<br/>\n<br/>\nThis is where it all began <blockquote><div>Law and good deeds are the meat and drink of paladins. If they ever knowingly perform an act which is <strong>chaotic in nature</strong>, they must seeka high level (7th or above) cleric of lawful good alignment, confess their sin, and do penance as prescribed by the cleric. If a paladin should ever knowingly and willingly perform on evil act, he or she loses the status of paladinhood immediately and irrevocably All benefits are then lost, and no deed or magic can restore the character to palodinhood; he or she is everafter a fighter. </div></blockquote>\n\nThieves (yes, back then they were named Thieves) were like this : <blockquote><div>The profession of thief is not dishonorable, albeit is neither honorable nor highly respected in some quarters. All thieves are neutral or evil, although they can be neutral good (rarely), and of lawful or chaotic nature. Most thieves tend towards evil.</div></blockquote>\n\nAnd of course, the Back Stab <blockquote><div>Back stabbing is the striking of a blow from behind.</div></blockquote>\n\nMulticlassing back then was very limited.<br/>\n<br/>\nNext came 2nd edition, and changed some things.  Especially Multi-Classing, but other things changed as well.  The Paladin still had the Chaotic act thing and was even stricter to what they could, and could not do <blockquote><div>If the paladin commits an evil act while enchanted or con-trolled by magic, he loses his paladin status until he can atone for the deed. </div></blockquote>\n, but Thieves were now Rogues (name change) <blockquote><div>Rogues are people who feel that the world (and everyone in it) somehow owes them a living. They get by day by day, living in the highest style they can afford and doing as little work as possible. The less they have to toil and struggle like everyone else (while maintaining a comfortable standard of living), the better off they think they are. While this attitude is neither evil nor cruel, it does not foster a good reputation.</div></blockquote>\n  They still retain the Backstab.<br/>\n<br/>\n3rd edition changed it to Sneak Attack.<br/>\n<br/>\nNow we come to the \"meat\" of the matter, and it is explained very well in The Book of Exalted Deeds <blockquote><div>In the D&amp;D universe, the fundamental answer is no, an evil act is an evil act no matter what good result it may achieve. A paladin who knowingly commits an evil act in pursuit of any end no matter how good still jeopardizes her paladinhood. Any exalted character risks losing exalted feats or other benefits of celestial favor if he com-mits any act of evil for any reason. Whether or not good ends can justify evil means, they certainly cannot make evil means any less evil. Some good characters might view a situation where an evil act is required to avert a catastrophic evil as a form of martyrdom: “I can save a thousand innocent lives by sacrificing my purity.” For some, that is a sacrifice worth making, just as they would not hesitate to sacrifice their lives for the same cause. After all, it would simply be selfish to let innocents die so a character can hang on to her exalted feats. Unfortunately, this view is ultimately misguided. <strong>This line of thinking treats the purity of the good character’s soul as a commodity (like her exalted feats) that she can just give up or sacrifice like any other possession</strong>. In fact, when an otherwise good character decides to commit an evil act, the effects are larger than the individual character. What the character sees as a personal sacrifice is actually a shift in the universal balance of power between good and evil, in evil’s favor. The consequences of that single evil act, no matter how small, extend far beyond the single act and involve a loss to more than just the character doing the deed. Thus, it is not a personal sacrifice, but a concession to evil, and thus unconscionable.</div></blockquote>\n\nThis same goes for any deviance from the Code of Conduct that a Paladin has.  I think the bolded part is the crux of the matter, and what you, Orion, are not understanding here.  You are treating this like it is a commodity, that can be given up to justify the inclusion of Sneak Attack here.<br/>\n<br/>\nIt can't, though.<br/>\n<br/>\nIt is an integral part of being a Paladin.<br/>\n<br/>\nThe reason(s) I have brought in previous editions here, is to give you an insight to how the Paladin works, where it came from (roots) and how it came to be what it is now.  The Codes of Conduct are largely left \"blank\" to allow for DMs to \"fill in the blanks\" without compromising their Campaigns, adventures, and campaign settings.<br/>\n<br/>\nNote that this whole \"debate\" is totally seperated from the mechanics that we normally are involved with here on the ECB.  This is more of a Role Playing Mechanic, to be honest, and I am really not sure if it belongs on the ECB.  Of course, that is not up to me to decide.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:27 PM - Aug 04, 2020",
      "content": "<div>As Stagmeister has ended this, I'm out.</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "6:12 PM - Aug 04, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Aug 04, 2020</div></cite>Being KDed, Disarmed does not make one helpless.  Just because they are disadvantaged, does not make one helpless.  <br/>\n<br/>\nThey. can. still. defend. themselves.<br/>\n<br/>\nAlthough, yeah, if one has Sneak Attack, guess what?  It automatically fires when one is KDed.  Hmmm...<br/>\n<br/>\nBut it doesn't when Disarmed.<br/>\n<br/>\nIt may draw AoO, but that is as it is.<br/>\n<br/>\nYour post is more along the lines of Lawful Stupid Pally, than Lawful Good Pally.</div></blockquote>\nI was discussing what is traditionally viewed in films and books as what a \"good\" guy does. It's traditional that the \"good guy\" doesn't attack the bad guy (or even any opponent) when the bad guy has lost his weapon. The good guy doesn't kick the bad guy when he's down. <br/>\nI just find it interesting where you draw your lines.<br/>\n<br/>\nI have no problem with Paladins having rogue levels and thus sneak attack damage, I view it that they put the hits in spots which aren't as well defended or as protected. I also have no problem with Paladins knocking the bad guys down, or knocking their weapons away.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:24 PM - Aug 04, 2020",
      "content": "<div>Alright, for those of you who didn't get the hint, I'll be plain. If people wish to pursue the principled discussion, fine, do so in the General Discussion forum. This is in the Build Requests/ Unfinalized Builds forum. Further comments not about the build itself here will be deleted.<br/>\n<br/>\nI trust that is clear enough.</div>",
      "author-color": "#AA0000"
    }
  ]
}