{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "026",
  "name": "Holy Homely Half-orc Harper (Cleric 26/Barbarian 9/Harper Scout 5)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/holy-homely-half-orc-harper-cleric-26-barbarian-9--t2356231.html",
  "author": "comrade_skade",
  "avatar": "10759704_1712677520.jpg",
  "replies": "7",
  "views": "896",
  "posts": [
    {
      "author": "comrade_skade",
      "avatar": "10759704_1712677520.jpg",
      "timestamp": "4:11 AM - May 15, 2024",
      "content": "<div>\"I'm Annie... Annie Hoke. From the House of Plenty in Shadowdale.\"<br/>\n<br/>\nIvan Blaine looked the half-orc woman up and down as she curtsied, and tried not to sneer. She had drab green skin, slick greenish-black hair, and a face like a potato with ears. Her voice was sweet enough, for a half-orc; but Ivan could tell the minute she spoke that keeping it that way took effort.<br/>\n<br/>\nThe Chaunteans were already not Ivan's favorite - too stick-in-the-mud, most of the priestesses didn't even flirt - but this was an exceptionally grim omen for the job.<br/>\n<br/>\n\"Duke Mourngrym said he'd also be sending a Harper. Where is he?\"<br/>\n<br/>\n\"That's me, sir.\"<br/>\n<br/>\n\"You?\" This time Ivan could not help sneering.<br/>\n<br/>\n\"Yes, sir. I'm an ordained priestess of Chauntea, and also apprenticed as a Harper scout.\"<br/>\n<br/>\n\"I don't believe you.\"<br/>\n<br/>\n\"You're welcome to begin the raid without me, then.\" Annie's voice shook despite the half a foot and hundred-odd pounds she had over Ivan, but she gave the ultimatum forcefully. She did not sound like she would back down.<br/>\n<br/>\nIvan looked past the half-orc's shoulder, through the oaks and maples cushioning the north road, trying to make out the silhouette of Castle Krag. That kid from Shadowdale might have been spinning tales. That stuff about fighting a demon from the plane of Shadow and being rescued by Elminster himself? That sounded fishy, and Ivan knew - from bitter experience - that most \"heroes\" were egotistical liars. There might not be a lich in there. There might not be anything but rusty old spears, cold forges, and the bones of Annie's brethren.<br/>\n<br/>\nStill... if there was a lich in there. On the off chance there was, he and Teurid needed a priest, or they would be screwed.<br/>\n<br/>\n\"Alright, fine. You get to be both our priest and our Harper delegation.\" Ivan looked over his shoulder at his companion, propped up snoring against a tree trunk. \"Rid? You approve?\"<br/>\n<br/>\nTeurid opened one eye and glanced about. \"Yah. Seems a'ight.\"<br/>\n<br/>\n\"You haven't even looked at her.\"<br/>\n<br/>\n\"Priests don' need to look good, mate.\"<br/>\n<br/>\n\"Isn't that how they turn undead?\"<br/>\n<br/>\n\"Tha's a myf... myfth... myth.\"<br/>\n<br/>\n\"Is he alright?\"<br/>\n<br/>\nIvan turned back to Annie. She had a doubtful look on her great big turnip face.<br/>\n<br/>\n\"Just drunk.\"<br/>\n<br/>\n\"Shouldn't we...\"<br/>\n<br/>\n\"Wait for him to sober up? Nah, he can hit a mouse at a hundred paces like this.\"<br/>\n<br/>\n\"What about when he's sober?\"<br/>\n<br/>\n\"Then he can't hit the broadside of a barn. Now come on, get your prayer book out and get praying.\" Ivan looked up at the sky, the tree shadows growing long, the blue of late autumn afternoon just starting to dim. \"We want to be done and out of here well before dark falls.\"<br/>\n<br/>\n///<br/>\n<br/>\nAnnie, at least, seemed to be a real priestess; though perhaps not of Chauntea, or at least not a stickler for rules. She wielded a scimitar alongside her shield, not a mace or a sickle, and wrapped it in magical flames the way Chaunteans were supposedly forbidden to. Ivan was not a stickler for anyone's rules, though, and the fiery glow was a boon in Castle Krag's dark corridors. True, Annie looked even more hideous by firelight, but Ivan could always complain about that later. To a pretty young barmaid in a friendlier town. After, well after, getting out of this place alive.<br/>\n<br/>\nKrag's courtyard had been full of orc skeletons. And those skeletons had risen to greet them, and Annie had not dispelled a single one. Ivan wondered. What kind of priestess wouldn't bother turning the most basic of undead? What kind of priestess claimed to be a Chauntean, but lit her sword on fire? What kind of priestess looked like a giant sack of green potatoes?<br/>\n<br/>\nWhat if she was actually a Zhent? Wouldn't that be an interesting story to tell -<br/>\n<br/>\n\"Stop.\"<br/>\n<br/>\n\"Huh?\"<br/>\n<br/>\n\"Trap.\" Annie gestured down in front of her. A line in the dust... a tripwire. She raised her hand and pointed along the floor, up the left wall, up to a straight, dark, and very narrow line in the ceiling.<br/>\n<br/>\n\"Back up.\" Annie backed up; so did Ivan, careful not to let her bump into him. \"Keep backing up. Okay, stop.\" About fifteen feet. \"Rid, hit that wire.\"<br/>\n<br/>\nThe elf grunted, pulled a dart from his belt - bows were a bad idea in these confines - and chucked it underhand. The dart followed a big, lazy arc and landed dead on the tripwire. Something snapped, loud and crisp.<br/>\n<br/>\nNot even half a second later, two enormous blades scythed out of the walls, cutting back and forth over the tripwire with slick rushing sounds. Ivan shuddered to imagine the mess they'd have made of a person, even one in full plate. Those things looked<em> heavy.</em><br/>\n<br/>\n\"Good eye,\" he grudgingly admitted.<br/>\n<br/>\n\"Tha's an easy one, though,\" Tuerid grumbled. \"Another foot and I'd ha' seen. Bu' yah. Harper is as Harper sees.\"<br/>\n<br/>\nIvan grunted agreement. \"Alright then. Let's get on with it.\"<br/>\n<br/>\n///<br/>\n<br/>\nThe lich, as it turned out, caught them by surprise.<br/>\n<br/>\nDeep in the heart of Castle Krag, there was a bridge over dark stagnant water, a strange white marble bridge that glowed with its own light. Mist swirled thickly over the water, and none of them could see where the bridge went - not even Teurid with his elven eyes.<br/>\n<br/>\n\"I can' see a damn thing past thirty feet,\" Rid slurred out. \"Ivan, wha' you think?\"<br/>\n<br/>\n\"Well, our lich hasn't shown up yet. Let's press on.\"<br/>\n<br/>\n\"Annie?\"<br/>\n<br/>\nIvan shot Rid a disgusted look, but the elf didn't seem to notice.<br/>\n<br/>\n\"Hmm...\" the half-orc woman seemed hesitant. \"Yes. Let's keep going.\"<br/>\n<br/>\n\"You getting second thoughts?\"<br/>\n<br/>\nShe sighed. \"Always, sir.\"<br/>\n<br/>\nMaybe she was just new to the priesthood, young and stupid. Good enough at magic, but green as... well, green as a half-orc. Maybe the House of Plenty were trying to cut costs.<br/>\n<br/>\n\"Let's go.\"<br/>\n<br/>\nBut the bridge ended at a wall, the same white marble with a big craggy hole in it. Rid poked at the hole with his foot, and wrinkled his nose. \"Rust monster used t' live here. Weird. Someone killed it probably.'\"<br/>\n<br/>\n\"So why -\"<br/>\n<br/>\nIvan heard Annie gasp before he heard the soft whooshing of air behind him. He spun around. The mist was clearing, and rising over the bridge on a cushion of ghostly fire was -<br/>\n<br/>\n\"Shit!\" The lich was approaching fast, and they had nowhere to run. Ivan could feel the thing's vile aura, little hints of laughing faces across his vision, unintelligible whispers in his ears. He grabbed for the potions at his belt, hands shaking to the rhythm of his chattering teeth. If he could just reach that little orange bottle, if Rid could resist the creature and get to his wands in time, if his stupid ugly priestess could just cast a decent turning -<br/>\n<br/>\nBut the last thing he witnessed, before sense abandoned him, was Annie <em>bellowing</em> like a mad bull and charging straight at the skeletal form, scimitar swinging in a wild brute arc of fire. Beautiful and doomed. He could almost have laughed.<br/>\n<br/>\n///<br/>\n<br/>\nIvan came to his senses slowly. His eyes were closed, and his left cheek felt covered in drool. Something was rocking him back and forth, but not in a pleasant way. It felt... Thumpy? Like an army marching.<br/>\n<br/>\nHe opened his eyes. Purple evening sky and trees swaying. He felt a surge of nausea and shut them again.<br/>\n<br/>\nLaughter somewhere behind. Teurid's. \"Wish you'd seen'er, mate. Green girl fights like a gods-damn demon outta the Abyss. She just went <em>laying</em> into that thing, <em>whooooo.</em> Never seen anythin' like it in all my three hundred years.\"<br/>\n<br/>\nAnnie made a snorting noise somewhere above him. This wasn't so bad, he thought. Kind of like riding a horse side-saddle. A big fat green draft horse with a face like... like...<br/>\n<br/>\n\"I don't seem so ugly now, do I, sir?\"<br/>\n<br/>\nNo, Ivan had to concede, she didn't. He could almost have laughed.<br/>\n<br/>\n---<br/>\n<br/>\nAn experiment in building a half-orc cleric with martial weapons, full Tumble AC, and no XP penalty. There are a number of possibilities here, e.g you can compromise Cleric dispel resistance to get Greater Rage, but the best is probably just taking Cleric 26/HS 5/Barb 9. Cleric and full Tumble should already give you all you need, and of course she's playable from early on; it's hard for a martial Cleric not to be. Just find a safe place to buff, and maybe lean on summons. Main skills after your first Harper Scout level will be Concentration and Tumble dumps, with little room for anything else, so spell saves will suck for a while... But that is okay, that's what your buffs are for.<br/>\n<br/>\nThis is, obviously, a bit of an RP build. A more powergame-y variant would take Strength domain, with Extend Spell and Combat Casting instead of Power Attack and Cleave, and maybe let Tumble lag a bit before Epic levels so that Concentration can be kept up. If you really want to focus on buffs it might be better also to take as many Cleric levels as possible, to e.g. maximize the effect of the Resist Magic spell.<br/>\n<br/>\nHalf-Orc - any non-evil<br/>\nStr 17 (28)<br/>\nDex 12<br/>\nCon 14<br/>\nWis 14 (20)<br/>\nInt 12<br/>\nChr 6<br/>\n<br/>\n1. Barbarian 1: 4 Discipline, 4 Lore, and 4 Search (save 8); Iron Will<br/>\n2. Barb 1, Cleric 1: 1 Lore, 5 Persuade (save 5), domains Plant and Animal<br/>\n3. Barb 1, Cleric 2: 1 Lore, 1 Persuade, 2 Search (save 4); Alertness<br/>\n4. Barb 1, Cleric 3: Wis 15; 1 Persuade (save 6)<br/>\n5. Barb 1, Cleric 4: 1 Persuade, 2 Search, (save 6)<br/>\n6. Barb 1, Cleric 5: save 9; WF Scimitar<br/>\n7. Barb 1, Cleric 5, HS 1: 10 Tumble (save 4); Favored Enemy (Undead)<br/>\n8. Barb 1, Cleric 6, HS 1: Wis 16; save 7<br/>\n9. Barb 1, Cleric 7, HS 1: save 10, Blind Fight<br/>\n10. Barb 1, Cleric 8, HS 1: 10 Concentration (save 3)<br/>\n11. Barb 1, Cleric 9, HS 1: save 6<br/>\n12. Barb 1, Cleric 10, HS 1: Wis 17; 5 Concentration (save 4); Power Attack<br/>\n13. Barb 1, Cleric 11, HS 1: save 7<br/>\n14. Barb 1, Cleric 12, HS 1: save 10<br/>\n15. Barb 1, Cleric 13, HS 1: save 13; Imp Crit: Scimitar<br/>\n16. Barb 1, Cleric 14, HS 1: Wis 18; save 16<br/>\n17. Barb 1, Cleric 14, HS 2: 10 Tumble (save 11)<br/>\n18. Barb 1, Cleric 15, HS 2: 6 Concentration (save 8); Cleave<br/>\n19. Barb 1, Cleric 16, HS 2: 1 Concentration (save 10)<br/>\n20. Barb 1, Cleric 17, HS 2: Wis 19; 1 Concentration, 4 Spellcraft (save 8)<br/>\n21. EPIC, Barb 1, Cleric 18, HS 2: 1 Concentration (save 10); EWF Scimitar<br/>\n22. Barb 1, Cleric 19, HS 2: 1 Concentration (save 12)<br/>\n23. Barb 1, Cleric 20, HS 2: 1 Concentration (save  14)<br/>\n24. Barb 1, Cleric 21, HS 2: Str 18; 1 Concentration, 5 Spellcraft (save 11); Great Str I (Str 19)<br/>\n25. Barb 1, Cleric 22, HS 2: 1 Concentration (save 13)<br/>\n26. Barb 1, Cleric 23, HS 2: 1 Concentration, 5 Spellcraft (save 13); Armor Skin<br/>\n27. Barb 1, Cleric 23, HS 3: 10 Tumble (save 5); Great Str II (Str 20)<br/>\n28. Barb 1, Cleric 24, HS 3: Str 21; 2 Concentration (save 6)<br/>\n29. Barb 1, Cleric 25, HS 3: 1 Concentration, 5 Spellcraft (save 3)<br/>\n30. Barb 2, Cleric 25, HS 3: save 8, Great Str III (Str 22)<br/>\n31. Barb 3, Cleric 25, HS 3: save 13<br/>\n32. Barb 3, Cleric 25, HS 4: Str 23; 5 Tumble (save 13)<br/>\n33. Barb 4, Cleric 25, HS 4: save 18; Great Str IV (Str 24)<br/>\n34. Barb 5, Cleric 25, HS 4: save 23<br/>\n35. Barb 6, Cleric 25, HS 4: save 28<br/>\n36. Barb 7, Cleric 25, HS 4: Str 25; save 33; Great Str V (Str 26)<br/>\n37. Barb 7, Cleric 25, HS 5: 5 Tumble (save 33); Favored Enemy (Constructs)<br/>\n38. Barb 8, Cleric 25, HS 5: save 38<br/>\n39. Barb 9, Cleric 25, HS 5: save 43; Great Str VI (Str 27)<br/>\n40. Barb 9, Cleric 26, HS 5: Str 28; 11 Concentration, 20 Spellcraft (15 remaining); Great Wis I (Wis 20)<br/>\n<br/>\nFinal stats:<br/>\n21 AC in plain clothes, 32 in full plate and tower shield<br/>\n3 APR (pre-epic BAB of 14)<br/>\n3 Rages/day in addition to the usual Cleric spells<br/>\nSaves: Fortitude 24, Reflex 19, Will 30 (+8 for spells)</div>"
    },
    {
      "author": "comrade_skade",
      "avatar": "10759704_1712677520.jpg",
      "timestamp": "5:06 AM - May 15, 2024",
      "content": "<div>... Of course, it's only after posting this whole thing that I remember Animal domain has Cat's Grace, which would allow bringing Dex down to 8 to add more Str and Wis. D'oh.<br/>\n<br/>\nEdit: also fixed the title now, SMH. This is what I get for posting late.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:04 PM - May 22, 2024",
      "content": "<div>I enjoyed reading the story. It explains well where you want to go with the build. <br/>\nHS is a fine alternative when you want a tumble prestige class, and SD or assassin are out of the question.<br/>\nThe alignment should be any non-lawful, non-evil, and Annie seems a bit on the chaotic side.<br/>\n Taking Barbarian rather than Cleric on level 20 will give +1BAB, but delays slightly becoming undispellable. <br/>\nHow does she play? Is it like any other combat Cleric?<br/>\nBy the way, I edited in the ending str and wis abilities.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "comrade_skade",
      "avatar": "10759704_1712677520.jpg",
      "timestamp": "8:33 PM - May 22, 2024",
      "content": "<div>Thanks Mick. TBQH she plays about the same as other half-orc Clerics I've tried, i.e. a bit worse than clerics of other races. Half-orcs are fun for roleplay, but the net stat reduction hurts in the long run, especially the reduced Int. Likewise the feat starvation, and low Concentration without Expertise to fall back on, and the reduced saves from low Spellcraft. Elf is a much better choice for a Cleric/HS build, since you can just take longsword or rapier focus for CoT.<br/>\n<br/>\nGood point about the BAB. I tend not to think too much about keeping it at the full 15 since a melee Cleric will use Divine Power for tough fights anyway, but yeah, every little bit helps.</div>"
    },
    {
      "author": "comrade_skade",
      "avatar": "10759704_1712677520.jpg",
      "timestamp": "5:50 PM - May 23, 2024",
      "content": "<div>Actually, I'm curious now why keeping BA at exactly 15 is a good thing. Looking at the charts here: <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Base_attack_bonus\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Base_attack_bonus</a> the same class mix should result in the same BAB at L40 as long as the BA is between 11 and 15. (Which we want so that we can exploit the Divine Power bug.)<br/>\n<br/>\nPersonally I think I'd rather get ninth circle spells earlier... To each their own I guess. Or am I misunderstanding how final AB is calculated?</div>"
    },
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "4:41 PM - May 24, 2024",
      "content": "<div>Usually it is recommended to keep BAB at 15 due to the fact that Divine Power counts towards the +20 cap to AB bonus. <br/>\nExample: you have 21 BAB with 11 pre-epic. You cast Divine Power for +9. With Divine Favor, GMW, and Bless you reach +20 for a total of 41 AB. Now if you use Aid/Prayer/Battletide, you will get no more bonus to AB <br/>\nIf instead you have 25 BAB with 15 pre-epic, you cast Divine Power for +5. With Divine Favor, GMW and Bless you still get to 41 AB. The difference is that now you can still get up to +4 bonus from other sources (weapons with more than +5 enchantment, or your own spells).<br/>\nI agree with your general point that you don't necessarily want to use your full kit in all fights, but if very strong weapons are available or if you think you will need every point of AB, it makes sense to aim for 15 pre-epic BAB.<br/>\nOn WoG, where I mostly play, I often go to 14 or even 13 in order to have better saves or whatever, but this is the trade-off.</div>"
    },
    {
      "author": "comrade_skade",
      "avatar": "10759704_1712677520.jpg",
      "timestamp": "4:48 PM - May 24, 2024",
      "content": "<div>Ohhh I see. Thank you, that is edifying! I'll have to see if it makes a difference next time I run a Cleric/Rogue/CoT or such.</div>"
    },
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "10:09 PM - Aug 03, 2024",
      "content": "<div>I really like her. Both RP and building. HS IS Always a fine class to add something spécial in a build.</div>"
    }
  ]
}