{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "003",
  "name": "Rapid Shot - yay or nay",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/rapid-shot-yay-or-nay-t2355756.html",
  "author": "TheSquid",
  "avatar": "10759318_1592552655.jpg",
  "replies": "0",
  "views": "2.5K",
  "posts": [
    {
      "author": "TheSquid",
      "avatar": "10759318_1592552655.jpg",
      "timestamp": "10:15 PM - Jul 19, 2021",
      "content": "<div>I looked into when one deals more (expected) damage shooting with a bow/sling with Rapid Shot active or not active.<br/>\nThere is a <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/rapid-shot-and-flurry-of-blows-t2206974.html\" rel=\"noreferrer\" target=\"_blank\">table</a> by WhiZard about this, but I took a slightly different angle.<br/>\n<br/>\nRapid Shot GOOD means that you deal more damage over one round, on average, by turning it on. Rapid Shot BAD means that shooting with it on will result in <em>less </em>expected damage (you will have one more attack but all your attacks will have a higher chance of missing).<br/>\n<br/>\n<strong>Case 0. Your enemy's AC is at least 20 more than your AB. </strong>In other words, all your attacks hit only on 20. Verdict: Rapid Shot <strong><span style=\"color:#0000ff\">GOOD</span></strong>. D'uh, one more attack <em>with no penalty whatsoever </em>is better than none. Still not an ideal situation to find yourself in.<br/>\n<br/>\n<strong>Case 1.  Your AB is at least as high as your enemy's AC.</strong> In other words, your best attack hits on any roll except 1, and your second-best attack hits on 5. Verdict: Rapid Shot <strong><span style=\"color:#0000ff\">GOOD</span></strong>. You should always have it on, regardless of who you are and if you are hasted or not.<br/>\n<br/>\n<strong>Case 2. You naturally have 4 APR and are not hasted.</strong> In other words, Rapid Shot gives you your only extra attack, and you move from four to five attacks per round. Verdict: Rapid Shot <strong><span style=\"color:#0000ff\">GOOD</span></strong>. The only case when you should in theory turn it off is if your enemy's AC is <em>exactly 18 more </em>than your AB. If you manage to determine that that is indeed the case, well done, you have scored a marginal advantage by turning RS off.<br/>\n<br/>\n<strong>Case 3. You naturally have 4 APR and have Haste. </strong>Verdict: Rapid Shot <strong><span style=\"color:#ff0000\">BAD</span></strong>. You should have it on if your enemy's AC is at most 5 more than your AB. If it's higher, turn it off.<br/>\n<br/>\n<strong>Case 4. You naturally have 3 APR and have either Haste or Divine Power. </strong>In other words, you already have a free attack, and RS gives you a second one. Verdict: Rapid Shot <strong><span style=\"color:#ff0000\">BAD</span></strong>. In this case you should also leave it on only if your enemy's AC is 5 more than your AB or lower.<br/>\n<br/>\n<strong>Case 5. You naturally have 3 APR and have both Haste and Divine Power. </strong>In other words, RS gives you a third free attack. Verdict: Rapid Shot <strong><span style=\"color:#ff0000\">BAD</span></strong>. You should never have it on, unless you are in the extreme Case 0 or in the very favorable Case 1.<br/>\n<br/>\nMy conclusions: \n<ul>\n<li>Rapid Shot is worth getting as a warrior in an environment where (perma-) Haste is rare, OR as a very high AB character (that is, you expect enemy AC to actually be lower than your AB)</li>\n<li>Rapid Shot is mostly not worth getting as a Cleric, unless you are an Arcane Archer and have therefore insane AB</li>\n</ul>\nI think my numbers are correct, but my analysis could be entirely off of course. I should mention that I have not included critical hits in my computations, but WhiZard claims that they don't change much, and if you do include them then enemy DR also starts mattering and it's a mess.</div>"
    }
  ]
}