{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "341",
  "name": "Thinking about a build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/thinking-about-a-build-t2350213.html",
  "author": "Moredhel",
  "avatar": "10235447_1565972826.jpg",
  "replies": 14,
  "posts": [
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "7:47 PM - Feb 18, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hey guys, first post here!<br/>\n<br/>\nI've recently started playing NWN again, and after fooling around with a monk (lvl 7) and a dualclass (rogue/ranger) I've searched the internet for fun builds. The Rogue/Cleric caught my eye, but I had something a little different in mind. The Rogue/Cleric I mostly saw was based on light armor and the longbow, whereas I want to add rogue for the search/disable trap/lockpick stuff and focus more on frontline combat. I haven't thought it all out yet, and I have no idea which stats should be high, but this is where I am so far @ start (if able, ofcourse):<br/>\n<br/>\nHuman Rogue<br/>\nSTR 14<br/>\nDEX 11<br/>\nCON 14<br/>\nINT 12<br/>\nWIS 16<br/>\nCHA 10<br/>\n<br/>\nnot knowing if DEX 11 is enough to start with to deal with traps and locks. I think I would add another lvl of rogue (2), followed by a lvl of cleric (rogue 2, cleric 1) at the end of the prelude. I do know that I will take the Magic and Trickery domains for the cleric part.<br/>\n<br/>\nNext, and this might be interesting from an rp-based view, is it funky to add a couple of lvls of blackguard (way) later on? I'm just imagining an evil man capable of dealing with traps, locks, the occasional backstab when his pet draws the attention and the ability to buff both himself and his partymembers!<br/>\n<br/>\nAny thoughts?<br/>\n<br/>\nThanks in advance,<br/>\n<br/>\nMoredhel<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:49 PM - Feb 18, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome to the guild Moredhel.<br/>\n<br/>\nAm i thinking right that you want this for the OC/SOU/HoTU?<br/>\n<br/>\nAlso, you want BG there mainly for RP reasons (and the coolness factor) or do you imagine a heavy armored anti-hero type of guy that taps on his unholy powers to further boost his damage?<br/>\n<br/>\n<br/>\n*The reason you saw LB focused builds using this combo is mainly cause a few levels of BG can enable the divine damage on archers and make them very powerful, especially when combine with cleric buffs.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "10:53 PM - Feb 18, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yup, for OC/SoU/HoTU <br/>\n<br/>\nAnd yup, I want the BG there to be the supreme bastard (I'm currently 2 rogue/2 cleric, chaotic evil) tapping into the cold void of death for more carnage<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:48 AM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I second the welcome to you, Moredhel.<br/>\n<br/>\nI was wondering how far do you actually want to go in learning the ropes of NWN character building. The thing is, you can play the OC with just about ANYTHING and be successful. But, there are other (more challenging and better constructed) modules out there that may require more optimized characters to be conquered successfully.<br/>\n<br/>\nA Cleric / Rogue / Blackguard with those starting stats will not really be very good. You have 10 Charisma, so Blackguard will only serve you to cost you some feats. You can take Assassin and be a stronger prick if you really want. I'd redo him as a STR build, with the following starting stats:<br/>\n<br/>\nSTR 14<br/>\nDEX 8<br/>\nCON 10<br/>\nINT 14<br/>\nWIS 16<br/>\nCHA 14<br/>\n<br/>\nThis way you'll gain +2 to all your saves from Blackguard.<br/>\n<br/>\nOf course you'd have to start over, but you're only level 4, so it won't be a big loss. If you want to learn more about building a strong character, <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/a-complete-guide-to-the-basics-of-character-building-t515440.html\" rel=\"noreferrer\" target=\"_blank\">THIS GUIDE</a> is the place to start.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:54 AM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The OC and SoU are both supposed to start at level 1. They happen concurrently to two different people. HotU is intended to be played with the character who finished SoU. If you insist on playing all three with the same character (bad idea), the best order is SoU then the OC and then HotU, because the OC will attempt to adjust to your too-high level.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:06 PM - Feb 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I see, so want a strong RP character then that has it all.<br/>\n<br/>\nIt's like that with everyone's starting character, i too wanted the same.<br/>\n<br/>\nWell, i could appoint you to a super powerful build that has all the techniques of character building implemented and finishes to a really high power level but i won't do that. You won't need it, not for there.<br/>\n<br/>\nWhat i will say to you is some basic principles instead and let you form your character based on these. Because you will enjoy it much more that way, same thing Max said.<br/>\n<br/>\n<br/>\nA) The OC ends at level 17, the SOU at level 13 and the HoTU at level 27. All values are approximately correct, although you can be one less or one more from that depending on what you will do.<br/>\n<br/>\n<br/>\n1) You won't be facing a lot of dispels if any at all, so 15 - 17 Cleric levels are in generall enough for everything and maxes out the bonusses for all the buff spells in his list (+5).<br/>\n<br/>\n2) You won't need more than 4 BG levels, if you want to go for more then the best is to go for 13 at least or else is suboptimal. 13 levels will give you the Epic Vrock.<br/>\n<br/>\n3) The rest of levels can be filled with Rogue. They won't be enough to take crippling strike for example but they wil give you skills and bonus dice of sneak attack.<br/>\n<br/>\n<br/>\nB) Keep in mind that the magic levels of the HoTU and even the OC at later levels are high enough that having haste and improved invisibility as domain powers are not essential.<br/>\n<br/>\nC) Good skills to look for are Persuade, Spellcraft, Tumble, Discipline and Concentration. Some of them are way more useful if you install Tony's AI 1.08 in your override.<br/>\n<br/>\nD) Good Henchman that fits you alignment is Grimgnaw. Buff him and he can tear everything apart on his own.<br/>\n<br/>\nE) Take a look at this if you want to enhance your playing experiance ---&gt; <a class=\"postlink\" href=\"http://nwvault.ign.com/View.php?view=Hakpaks.Detail&amp;id=7935\" rel=\"noreferrer\" target=\"_blank\">http://nwvault.ign.com/View.php?view=Ha ... il&amp;id=7935</a>  and this ---&gt; <a class=\"postlink\" href=\"http://nwvault.ign.com/View.php?view=Portraits.Detail&amp;id=192425&amp;id=6117\" rel=\"noreferrer\" target=\"_blank\">http://nwvault.ign.com/View.php?view=Po ... 25&amp;id=6117</a><br/>\n<br/>\nDon't forget to backup your override folder in case something goes wrong.<br/>\n<br/>\nF) Look at Max's guide for everything else.<br/>\n<br/>\n<br/>\nBased on that, make your own decisions and see where they will take you, don't be afraid if you do some small mistake, forge your own character so that you will be pround of him,<br/>\n<br/>\nand then come to where the real challenges are!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:22 PM - Feb 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You can, but where's the synergy? The thing that makes a toon powerful is exploring features that complement each other for each class. What do Clerics, BGs and Rogues have that complement one another?<br/>\n<br/>\nRogue goes well with Assassin, but for level 20 that's not really doable. Clerics need at least 15 levels to be good, BG needs 4 levels do yield its trademark DM / DS, which leaves just one level to take as another class. Rogue with just 1 level is sub-optimal. <br/>\n<br/>\nI'd have to say no to this request of yours, if anyone else wants to do it, go ahead, I won't. You should really read the guide I suggested to you. It's truly going to help you grow your knowledge of the game, which will make your request stuff that actually has some potential. Focus, man! You have a long way to go. <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "9:56 PM - Feb 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for replying, but I've deleted the post and created a new topic, focussing on a new build... I keep requesting things, eh?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:13 PM - Feb 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Moredhel wrote:</strong>Yup, for OC/SoU/HoTU <br/>\n<br/>\nAnd yup, I want the BG there to be the supreme bastard (I'm currently 2 rogue/2 cleric, chaotic evil) tapping into the cold void of death for more carnage </div></blockquote>\n<br/>\nYou don't need BG to roleplay a supreme bastard tapping into the darkest core of evil. You can do that with a cleric - pick your deity, alignment, spell-selection and whatnot. You can even do it with a plain fighter, if you just make the corresponding evil RP choices. <br/>\nIf you want to be cynical about it, the only thing you need to play evil is an avatar that acts evil. And since you want to play evil anyway, the only thing you get from picking BG is a set of class features that only has impact on game mechanics.<br/>\nJust my two cents...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "10:26 PM - Feb 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">True that, but being a blackguard is just the icing on the cake imho<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:47 PM - Feb 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you want to play a real BG and not just a build with some BG inside, then look nowhere else than Max's build for that dude with the tail from HoTU. Let me find it for ya..<br/>\n<br/>\nHere he is ---&gt; <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/valen-shadowbreath-fighter-12-blackguard-25-bard-3-t2268773.html\" rel=\"noreferrer\" target=\"_blank\">valen-shadowbreath-fighter-12-blackguard-25-bard-3-t2268773.html</a><br/>\n<br/>\n<br/>\nFrankly this build has style and power (32 Str + UMD + D. Might + Dev. Crit + 8d6 sneaks) both, I really don't get it that it doesnt have more views.<br/>\n<br/>\nI have a simillar build that is more classic (made for Lord Soth) but i have not post it yet - so i cannot recommended it, but Max's is a really good one.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:01 AM - Feb 24, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hehe, that was a good one, wasn't it?<br/>\n<br/>\nLet's not forget he also has an Epic Vrock meatshield at his disposal to generate Sneak Attacks, Improved Expertise, Taunt and Divine Shield. He can have VERY HIGH AC for a guy with a 2-hander when needed, and lower enemy AC to fight in Expertise without losing any AB.<br/>\n<br/>\nI still wanna play that guy eventually and level him to 40, I imagine the potential!<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Moredhel",
      "avatar": "no_avatar.png",
      "timestamp": "12:07 PM - Feb 24, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Heavy Flail, funny<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:38 PM - Feb 24, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, the weapon is because it's Valen Shadowbreath and that's his weapon, but it's by no means necessary if you're not going to name your character after him. Just pick something else as long as it doesn't require a feat.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:29 PM - Feb 24, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Heavy Flail Rocks!<br/>\n<br/>\nIt is the only 2-handed weapon that inflicts bludgeoning damage with the threat range of a greatsword!<br/>\n<br/>\nBut yeah, where Heavy Flail is, you can insert any other non-exotic weapon you want. Play him with a club and he will still be damn good with it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}