{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "972",
  "name": "Cleric with Warhorse Build Request",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/cleric-with-warhorse-build-request-t2354884.html",
  "author": "TacticalERK",
  "avatar": "10758915_1528181865.jpg",
  "replies": "14",
  "views": "370",
  "posts": [
    {
      "author": "TacticalERK",
      "avatar": "10758915_1528181865.jpg",
      "timestamp": "6:56 AM - May 19, 2018",
      "content": "<div>Can anyone recommend a Cleric/Paladin build with Resurrection and Summon mount (Warhorse)? I'd like to be able to heal party members as well. Playstyle will be mainly support, to keep party members alive and healed mainly, but extra buffs for party members would be great too. I'll be in the back of the fight.<br/>\n<br/>\nLevel 40<br/>\nPVE<br/>\nAny Armor<br/>\nAny Weapon<br/>\n<br/>\nSkills are somewhat limited on the server I play on.<br/>\n<br/>\nconcentration<br/>\ndisable trap<br/>\ndiscipline<br/>\nlore<br/>\nhide<br/>\nintimidate<br/>\nlisten<br/>\nmovesilently<br/>\nparry<br/>\nperform<br/>\npickpocket<br/>\nride<br/>\nspellcraft<br/>\nspot<br/>\ntaunt<br/>\ntumble<br/>\n<br/>\nThank you in advance!</div>"
    },
    {
      "author": "TacticalERK",
      "avatar": "10758915_1528181865.jpg",
      "timestamp": "5:32 AM - May 31, 2018",
      "content": "<div>Anyone still around these forums?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:42 AM - May 31, 2018",
      "content": "<div>Apologies, TacticalERK. I had seen your post, but I'm in no way qualified to give an opinion on either clerics or paladins, so figured someone who knew what they were talking about would help you out.<br/>\n<br/>\nRegardless, an albeit belated welcome!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "3:10 PM - May 31, 2018",
      "content": "<div>I think you should look through the builds and find a paladin/cleric build and talk about what you like/dislike about that build. People will be more likely to give advice if you bring something in yourself.<br/>\n<br/>\nYou also sound like you're setting yourself up for a support role, which clerics can do...but its hard to make a cleric that doesn't kick ass in a fight...</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:56 PM - May 31, 2018",
      "content": "<div>That's a good idea gkorjax - and if you're finding it a bit of a slog going through the Full Epic forum, TacticalERK, there's always HipRedux's ECB Guild Filter, which you can access through a thread in the Rules and Tools forum (along with the ECB Legacy Archive link). That way you can search directly for Pally/Clerics quickly and easily.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "6:53 PM - May 31, 2018",
      "content": "<div>Just as an example...  Here is a listing when I did a quick search in the old archives for anything with 18 levels of cleric and at least one of paladin.<br/>\nAs you can see these run a very wide gamut.  So a bit more information is in order.<br/>\n<br/>\nAre you planning on sitting in the back and using a bow and support spells? <br/>\nDivine Archerpaladin 1 / cleric 29 / champion of Torm 10(human)by jockeb<br/>\n<br/>\nor getting into combat?   <br/>\nSelf-Righteous Bastardchampion of Torm 14 / cleric 18 / paladin 8(human)by Mithdradates<br/>\n<br/>\njust enough paladin for fear immunity?   <br/>\nAny of the bunch with just 2 pally levels<br/>\n<br/>\n<br/>\nmixing paladin saves and BG saves and full cleric goodness?<br/>\nBlade of the Inquisitionpaladin 2 / cleric 35 / blackguard 3(human)by grizzled_dwarflord<br/>\n<br/>\n<br/>\nAs you can see in the list below.. lots of different way to go....  <br/>\n<br/>\nBlade of the Inquisitionpaladin 2 / cleric 35 / blackguard 3(human)by grizzled_dwarflord<br/>\nSelf-Righteous Bastardchampion of Torm 14 / cleric 18 / paladin 8(human)by Mithdradates<br/>\nTrue Champion of Tormcleric 20 / champion of Torm 18 / paladin 2(human)by evo_dragon<br/>\n26 cleric/10 CoT/4 paladincleric 26 / champion of Torm 10 / paladin 4(human)by Master Goodheart<br/>\nTorm's Devoutcleric 29 / champion of Torm 10 / paladin 1(human)by short_little_halfling<br/>\nDazzling Battle Clericcleric 23 / paladin 3 / champion of Torm 14(human)by Herbie Shimmer<br/>\nTorm's Smiting Handcleric 28 / paladin 2 / champion of Torm 10(human)by Jehoshua<br/>\nDivine Spellcasterpaladin 4 / champion of Torm 10 / cleric 26(human)by jedi1<br/>\nCrossbow Divinerpaladin 1 / cleric 29 / champion of Torm 10(human)by jockeb<br/>\nDivine Archerpaladin 1 / cleric 29 / champion of Torm 10(human)by jockeb<br/>\nSpellslingercleric 35 / fighter 4 / paladin 1(human)by BattleRaptor<br/>\nDivine Shield of Faithcleric 30 / paladin 1 / monk 9(human?)by Revenant Mattlov<br/>\nField Guardiancleric 38 / paladin 1 / monk 1(human)by Vulcano<br/>\nCheesely of the Divinecleric 32 / paladin 5 / rogue 3(human)by DaMouse404<br/>\n<br/>\n<br/>\n<br/>\nAnd that isn't even a search of the newer builds that Hip has in a spreadsheet..:)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:45 PM - May 31, 2018",
      "content": "<div>Never played a Pally before, but the name of Mith's alone kinda makes me want to - \"Self-Righteous Bastard\" just has that certain twang to it: we just don't have that sort of imagination any more. Thanks for scouting around conlaoch!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "9:42 PM - May 31, 2018",
      "content": "<div>hehe... just for fun....\n<table class=\"post_content_table\"><tbody><tr><td>Self-Righteous Bastard (CoT 14/Cleric 18/Pal 8) by Mithdradates</td>\n</tr>\n<tr><td><strong>Mithdradates</strong><br/>\n<br/>\nJoined: 04 Jul 2002</td>\n<td>Profile: Tuesday, 28 December 2004 05:47PM<br/>\n<strong>Playable from level 1 - 40 ..PvM or PvP Build</strong><br/>\n<br/>\nThe jagged stones on the coarse path dug into his hands as he slipped on a patch of ice, but the merchant did not notice as he hurried towards the temple of Lathander in some kind of loping gait that was a mixture of a run and a crawl. As he crested the top of the ridge, which the path meandered through, he crouched down low and paused to catch his breath. To steady himself and regain his bearings, he looked over frozen rocky terrain for the temple. He was in the foothills of the Spine of the World Mountains and the first snowfalls of winter had, covered the broken rocky terrain with a dusting of snow and ice. The icicles that coated the sides of the roughly hewn path glittered in the sunlight giving the rock the appearance of crystal. However this terrain was as dangerous as it was beautiful, the ice made the path slippery and treacherous and the glare from the reflected sunlight threatened to blind the merchant, beyond this was the threat of avalanche. Straining, he could make out the large stone structure of the temple with its crystal dome at the base of the ridge, about two stadiums in the distance, however the winding of the path would lengthen that descent. He paused, to rub some snow on his raw hands and knees and then scampered towards the temple. Somehow, the merchant managed to make his way down the slope and reach the temple, before collapsing on its steps. The guards lifted him and carried him into the temple, hurrying to bring him to Father Torin, the high priest of the Temple.  <br/>\n<br/>\nFather Torin was a tall thin man, and the loose fitting robe he wore exacerbated his appearance. In his youth he had been a mighty warrior, but his knee had been crippled battling frost giants and years of inaction had stripped the muscle from his frame. Leaning heavily on his gilded staff, the first snow always made his knee hurt, he stooped down over the merchant. Speaking a few words in deep baritone voice, which seemed unnatural for his appearance, he healed the Merchant’s wounds. Refreshed, the merchant stirred, starting from his prone position like a man waking from a nightmare. “Dr-dr-dragons!” he stammered.  <br/>\n<br/>\nFather Torin, put his finger to his lips to quiet the man and give the merchant a chance to gather his thoughts. Seeing the gaunt figure of the priest bathed in the multicolored refracted sunlight that entered the temple through its great dome ceiling, the merchant felt safe for the first time since his caravan had been attacked by a pair of white dragons. He had traveled north from Amn to trade for scrimshaw in the Ten Towns of the Dale. However, he had arrived late and hoping to make it south before the first snows fell, and made travel impossible, he set out on an old Dwarven trading route that cut through a spur the Mountain range. His caravan had been heavily armed and he felt sure that his guards could handle any threat. He had not counted on dragons. They had swept down out of the east in the early morning as the sun was beginning to rise and they were breaking camp, their icy breath devastating his guards. Even when the guards did manage to organize, they were no match for the beasts, who lifted the caravan trailers into the air only send crashing down in their ranks scattering the guards like chaff in the wind. The merchant who had been at the head of the caravan, managed to sneak away in the chaos of the battle and head north to the temple they had passed the day before. As the merchant finished his tale, Father Torin frowned and hobbled off from the main hall, to one of the meditation rooms.<br/>\n<br/>\nAs he walked, he could not help but wonder if this was his fault. Earlier in the year he had had a vision that the white dragons were rallying to attack the Ten Towns. He sent out a summons for warriors from Waterdeep to come and join his men in a preemptive strike against the beasts. While the strike had succeeding in killing the dragon matriarch, it was a pyrrhic victory at best. They had broken the dragons’ resolve to fight, but their own forces were shattered. Perhaps this raid was retribution for the paladins’ strike. Still he was not without hope, a detachment of knights from the city of Calimport had been on a pilgrimage to Waterdeep when the call for warriors had come and they decided to answer it. With some of their men too wounded to head south and their equipment damaged, they had decided to stay the winter at the temple. Father Torin, was now going to seek their leader.<br/>\n<br/>\nHe found him in deep prayer in the meditation room when he entered, but the warrior stirred at the sound of Torin’s staff on the cobble stone floor. This warrior was a tall muscular man with rich camel coloured skin and thick black curly hair that cascaded down his back. He looked young, as if he had not yet seen thirty winters, but the priest knew he was nearing forty years of age. As the warrior rose, the priest informed him of the situation. Listening carefully, the warrior informed the priest that he would set out alone to face the beasts. His men were still wounded, and he feared that this may be a trap to lure the paladins from the temple; if he alone fell, it would not sap the temple’s strength. For himself, he had Lathander’s favor and had faced dragons alone in the past. Besides the dragons may not be there when he arrived, and if that was the case they would have to wait until the thaw before they could track the beasts. His equipment had been damaged in the previous skirmish with the white dragons and he had to settle for some old weaponry in the armory. Donning a much patched suit of full plate, a mantlet and a notched-scimitar, he set out from the temple.<br/>\n<br/>\nThe priests of temple, had aided him on his way by teleporting him to the top of the ridge. Looking off into the distance, he could still make out the forms of the dragons, looting the remains of the caravan. He made his way towards the caravan, pausing as neared it call upon his god to strengthen his skill at arms and enchant his equipment. He felt his body surge with divine power, and saw the imperfections in his armor and blade fade away before his eyes. As he examined the fine edge of the temporarily restored weapon, he spoke an incantation which engulfed the blade in flames. White dragons love fire, he thought to himself as he hurried towards the caravan. <br/>\n<br/>\nThe horror of the massacre that had take place here had been dulled by the cold and ice. Twisted bodies and the remains of the caravan lay strewn about covered in thick ice. He guessed that this was the result of the dragon’s breath as opposed to the weather, it struck him as a very clean death. There were no pools of blood and gore, no acrid smell of burning flesh, just the frozen corpses that looked like some macabre sculpture of a battlefield. As he walked through the wreckage, he saw the cause of the destruction. Two white dragons, about twice the size of the caravan trailers, their scales glistening in the light from his weapon. One of them was gnawing casually on the arm of a guard, while the other was rifling through the remains of the caravan. The warrior guessed they were juveniles, the ones that he had faced earlier were larger. Still these were dangerous beasts, their claws were as long as his sword and their jaws could rend a man in two. They turned to look at him, with that look of disdain that only dragons seemed to be able to muster. The one closer to him, dropped his meal and hissed, “So, one of the self-righteous bastards from the temple, has decided to grace us with his presence. I thought they would have sent a whole division of knights to deal with us.”  <br/>\n“It hardly seems worth the challenge. Well do your worst, knight.” The second dragon scoffed.<br/>\nSelf-righteous bastard? Self-righteous Bastard?!? The audacity! The nerve! They didn’t even know him well enough to make a statement like that. Enraged, the warrior thought of a few choice epithets of his own, but discipline and experience cooled his temper. His first duty was to deny the dragons flight, hence reducing their advantage. As he recited his prayer, the wind began to blow faster and harder in chaotic patterns and the sky blackened as, green swirling mists seeped into the ether from some unknown source, only to coalesce in clouds and spew forth a deadly rain of acid that hissed and smoked as it dissolved anything it touched. A lightning bolt streaked from the mass of mystical weather to strike the dragon that had insulted him, drawing a roar of agony.  <br/>\n<br/>\nThe two beasts answered with a blast of cold from their gaping maws. The warrior ducked behind his mantlet as the blast approached. The ice pellets scattered off his shield like a thousand sling stones but the cold air snaked around the shield and swirled around his limbs, numbing them with its icy venom.  <br/>\n<br/>\nShivering, though more or less unscathed, he stepped out from behind his shield and invoked the name of his god again. This time the dragons were stricken blind, drawing another roar. The second dragon tried to fly, but as it raised into the air a lightning bolt from acid storm struck it, causing its muscles to spasm. The dragon crashed to the ground, its momentum sending it into a skid. The warrior raced towards the out of control beast as it came to the stop. With a mighty swing from his scimitar, he cut deeply into the exposed neck dazed dragon bathing himself with its spurting arterial blood. Leaving the beast in its death throws, he turned to the remaining dragon.<br/>\n<br/>\nUsing its own magic, the beast had freed itself from its blindness. The sight of it’s dying comrade and constant burn of the falling acid, drove the dragon into a frenzy and it charged towards the warrior. It took a mighty swing at the warrior, who ducked under his shield, beveling it to deflect the blow upwards. The shield held but the warrior’s arm felt numb, he could not deflect too many blows like that. As the dragon swung again, the man again readjusted his shield, but this time as the blow was deflected, the scimitar swung out carving deeply into the dragon’s wrist. The dragon recoiled, howling in agony. Even as it pulled back, another lightning bolt racked its body, causing it to bolt upright. Pressing the attack, the warrior strode forward and plunged his weapon into the dragon’s abdomen. Running across the breadth of the beast, the warrior dragged his blade across its belly opening the wound and spilling its innards onto the ground. It took all his speed to dive out of the way beast as it collapsed on the ground.  <br/>\n<br/>\nAs he regained his feet, he turned to regard his opponent. It struggled, trying to muster enough strength to mount a final attack. But as it clawed on the ground, it slipped on its own blood crashing back down. It stared at him with its rage filled blue eyes, and as their eyes met the warrior realized the dragon was not so much angry that it had been defeated as much as it was angry that a human had defeated it. As this realization dawned on him, a final lightning bolt from the cloud punctuated his victory. As he surveyed the corpses of the two dragons, he mused to himself, “Not too bad for a self-righteous bastard.”  <br/>\n<br/>\n<em>Overview</em><br/>\nI hadn't really done a pure battle cleric before, so I thought it would be fun to give it a try. I did do the Wilderness Preacher and Harbinger of Chaos builds but I don't consider those real battle clerics. There are many other builds with the same classes, but only Pius Custos by Soul Reaper is STR based. That particular build has only level 8 cleric casting, but does have level 4 paladin spells and a 1 point higher AB, but significantly lower saves. At any rate, this build was designed for scenarios where devastating critical has not been banned, low to mid-magic setting. With about +7 or +8 equipment, the pure fighter builds are on par with the cleric builds and start to surpass them as the equipment continues to improve. As someone who doesn't like to spend 10 minutes buffing before every encounter, I only included the more long-lived buffs in my AC and AB calculations.<br/>\n<br/>\n<em>Advantages</em><br/>\n-Devastating Critical on a weapon with a good critical range.<br/>\n-Level 9 Cleric Spells.<br/>\n-Level 2 Paladin Spells. Bless Weapon, Deafening Clang, Aura of Glory.<br/>\n-Good Saves. The 37 fortitude saving throw may seem a little low, but with both his charisma and constitution buffed he should be able to survive most devastating critical attempts.<br/>\n-40 AB. It could be better, but it's a lot higher than any of the similar charisma based builds. <br/>\n<br/>\n<em>Disadvantages</em><br/>\n-Not too many combat feats, only knockdown really. Of course, with this build it has to be expected.<br/>\n-Only extend spell for metamagic feats. Combat casting and improved combat casting would have been nice to make casting a little easier in combat.<br/>\n-Only 404 hitpoints. With endurance and aura of vitality he can increase that to 564, but that still is kind of low for a melee build.<br/>\n-Low spell DC. He can't really depend on his cleric spells for damage purposes.<br/>\n<br/>\n<strong>Self-Righteous Bastard</strong> (What else can you call a Paladin/Cleric/CoT?)<br/>\n<br/>\n<em>Race</em> Human<br/>\n<br/>\n<em>Alignment</em> Lawful Good<br/>\n<br/>\n<em>Base Attributes</em><br/>\nSTR 16 <br/>\nDEX 8 <br/>\nCON 12 <br/>\nWIS 14 <br/>\nINT 12 <br/>\nCHA 14<br/>\n<br/>\n<em>Leveling Guide</em><br/>\nLevels 1-4 Paladin<br/>\nLevels 5-12 Cleric<br/>\nLevels 13-16 Paladin<br/>\nLevels 17-29 Champion of Torm<br/>\nLevels 30-39 Cleric<br/>\nLevel 40 Champion of Torm<br/>\n<br/>\n<em>Final Level Distribution</em><br/>\nPaladin 8<br/>\nCleric 18<br/>\nChampion of Torm 14<br/>\n<br/>\n<em>Attribute Bonuses</em><br/>\n4, 8, 12, 16, 20, 24, 28 and 32 increase Strength<br/>\n36 increase Wisdom<br/>\n40 increase Charisma<br/>\n<br/>\n<em>Clerical Domains</em><br/>\nIf there are permahaste items available, war and trickery<br/>\nIf not, travel and trickery<br/>\n<br/>\n<em>Feats</em><br/>\nLevel 1: Weapon focus (Scimitar), Power Attack<br/>\nLevel 3: Divine Might<br/>\nLevel 6: Divine Shield<br/>\nLevel 9: Extra Turning<br/>\nLevel 12: Improved Critical (Scimitar)<br/>\nLevel 15: Knockdown<br/>\nLevel 18: Extend Spell, Cleave<br/>\nLevel 20: Great Cleave<br/>\nLevel 21: Epic Weapon Focus (Scimitar)<br/>\nLevel 22: Great Wisdom I<br/>\nLevel 24: Great Strength I, Great Wisdom II<br/>\nLevel 26: Overwhelming Critical (Scimitar)<br/>\nLevel 27: Great Wisdom III<br/>\nLevel 30: Great Strength II<br/>\nLevel 33: Devastating Critical (Scimitar)<br/>\nLevel 36: Great Wisdom IV<br/>\nLevel 39: Great Charisma I<br/>\nLevel 40: Epic Prowess<br/>\n<br/>\n<em>Final Attributes</em><br/>\nSTR 26<br/>\nDEX 8<br/>\nCON 12<br/>\nWIS 19<br/>\nINT 12<br/>\nCHA 16<br/>\n<br/>\n<em>Final Skillpoints:</em>172<br/>\nConcentration 42<br/>\nDiscipline 43<br/>\nSpellcraft 40<br/>\nTaunt 6<br/>\nTumble 20<br/>\n<br/>\n<em>Skill Progression</em><br/>\nLevel 1: Concentration 4, Discipline 4, Taunt 4, Tumble 2<br/>\nLevel 2: Concentration 1, Discipline 1, Taunt 1, Save 1<br/>\nLevel 3: Concentration 1, Discipline 1, Taunt 1, Tumble 1<br/>\nLevel 4: Concentration 1, Discipline 1, Taunt 1, Save 1<br/>\nLevel 5: Concentration 1, Spellcraft 2, Tumble 1<br/>\nLevel 6: Concentration 1, Spellcraft 3<br/>\nLevel 7: Concentration 1, Spellcraft 1, Tumble 1<br/>\nLevel 8: Concentration 1, Spellcraft 3<br/>\nLevel 9: Concentration 1, Spellcraft 1, Tumble 1<br/>\nLevel 10: Concentration 1, Spellcraft 3 <br/>\nLevel 11: Concentration 1, Spellcraft 1, Tumble 1<br/>\nLevel 12: Concentration 1, Spellcraft 1, Save 2<br/>\nLevel 13: Concentration 1, Discipline 3, Tumble 1<br/>\nLevel 14: Concentration 1, Discipline 3<br/>\nLevel 15: Concentration 1, Discipline 1, Tumble 1<br/>\nLevel 16: Concentration 1, Discipline 3  <br/>\nLevel 17: Discipline 2, Tumble 1<br/>\nLevel 18: Discipline 2, Save 2 <br/>\nLevel 19: Discipline 1, Tumble 1, Save 3<br/>\nLevel 20: Discipline 1, Save 6<br/>\nLevel 21: Discipline 1, Tumble 1, Save 7<br/>\nLevel 22: Discipline 1, Save 10<br/>\nLevel 23: Discipline 1, Tumble 1, Save 11<br/>\nLevel 24: Discipline 1, Save 14<br/>\nLevel 25: Discipline 1, Tumble 1, Save 15<br/>\nLevel 26: Discipline 1, Save 18<br/>\nLevel 27: Discipline 1, Tumble 1, Save 19<br/>\nLevel 28: Discipline 1, Save 22<br/>\nLevel 29: Discipline 1, Tumble 1, Save 23<br/>\nLevel 30: Concentration 14, Spellcraft 13<br/>\nLevel 31: Concentration 1, Spellcraft 1, Tumble 1<br/>\nLevel 32: Concentration 1, Spellcraft 3<br/>\nLevel 33: Concentration 1, Spellcraft 1, Tumble 1<br/>\nLevel 34: Concentration 1, Spellcraft 3<br/>\nLevel 35: Concentration 1, Spellcraft 1, Tumble 1<br/>\nLevel 36: Concentration 1, Spellcraft 2, Save 1<br/>\nLevel 37: Concentration 1, Spellcraft 1, Tumble 1, Save 1<br/>\nLevel 38: Concentration 1, Save 4<br/>\nLevel 39: Concentration 1, Save 7<br/>\nLevel 40: Discipline 11<br/>\n<br/>\n<em>Final Saves</em> (Vs. Spells)<br/>\nFortitude 37 (45)<br/>\nReflexes 27 (35)<br/>\nWill 33 (41)<br/>\n<br/>\n<em>AB and Damage</em><br/>\n<br/>\n(No buffs, regular scimitar)<br/>\n40/35/30/25 8+1D6 (15-20 X2)<br/>\nDevastating Critical DC 38<br/>\n<br/>\n(+8 CHA, +8 STR, [Aura of Vitality, Bull's Strength, Eagle's Splendor, Aura of Glory], Darkfire, Greater Magic Weapon, Bless Weapon) <br/>\n49/44/39/34 17+1D6 +5+1D6 Fire (+2D6 Divine Vs. Evil) (15-20 X2)<br/>\nDevastating Critical DC 42<br/>\n<br/>\n<em>AC</em> <br/>\n24 (full plate, tower shield, no buffs)<br/>\n36 (full plate, tower shield, +4 DEX, [Aura of Vitality], Vestments of Faith, Armor of Faith)<br/>\n<br/>\n<em>Hit Points</em> 404 (max every level)</td>\n</tr>\n</tbody></table></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:48 PM - Jun 01, 2018",
      "content": "<div>He needs at least five paladin levels for \"summoning mount\", so most of these builds are not eligible I'm afraid.<br/>\n<br/>\nThe \"Self-Righteous Bastard\" has, but...don't know man, call me a heretic but the build is old &amp; it shows. The final stats are fine &amp; dandy but look closer and you will find that at level 29th he still has only 8th paladin/ 8th cleric spellcasting. That's crippling for a build that is meant to be played up to that level.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:26 PM - Jun 01, 2018",
      "content": "<div>No heresy, I just liked the name!<br/>\n<br/>\nStill, it's good that someone's being grown-up about all this!<br/>\n<br/>\nOh, and I've had a quick look through Hip's Filter, and the only 3 that pop up with the requisite levels of Pally are: build 105, Divine Scout (by Whizard) - Pal 29/ Cleric 1/ CoT 10; build 219, Death Hunter (by Anuis) - Pal 9/ Cleric 7/ CoT 24; and build 236, Holy Paragon (by ockindal Linant) - Pal 19/ Cleric 11/ CoT 10.<br/>\n<br/>\nI know this iteration of the filter is now a year old, so I've checked what's come up since, and there's nowt.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:17 AM - Jun 02, 2018",
      "content": "<div>Didn't have enough time to prepare something better, so I took something proven from Cinnabar Din and polished it further instead. I changed the whole leveling process to make it more playable earlier and gave it more caster levels sooner in the build. Finally, I raised a bit Charisma to my own minimum standards and added Taunt to the skills repertoire. This build has \"summoning mount\" from level five, maximum Charisma &amp; Wisdom from level twenty-four &amp; till level thirty-one has already fifteen Cleric levels and twelve Paladin ones. Domain selection will depend a lot on the server but War &amp; Plant, for example, will give access to (cat's grace, barkskin &amp; aura of vitality) that are missing from the default Cleric's spell list. <br/>\n<br/>\nThe Order of the Rose is the most prestigious order of the knights of Palanthas in Dragonlance. One cannot simply advance directly into that order unless he has been first tested by the Order of the Crown &amp; the Order of the Sword, only then a promising knight can enter the Order of the Rose and become through many trials \"Lord of the Rose\".<br/>\n<br/>\n<br/>\nLORD OF THE ROSE<br/>\n(PALADIN 15/ CLERIC 15/ COT 10)<br/>\n<br/>\nRACE: HUMAN<br/>\nALIGNMENT: LG<br/>\nPLAYABILITY: PvM 1-40 LvL<br/>\n<br/>\nSTARTING/ ENDING STATS:<br/>\nSTR –  15 (<strong>26</strong>)<br/>\nDEX –  08<br/>\nCON – 12<br/>\nINT –   14<br/>\nWIS –  14 (<strong>18</strong>)<br/>\nCHA – 14 (<strong>18</strong>)<br/>\n<br/>\n<br/>\nHit Points: 410<br/>\n<br/>\nSkill Points: 215<br/>\n<br/>\nConcentration: 43 (44)<br/>\nDiscipline: 43 (51)<br/>\nHeal: 13 (17)<br/>\nSpellcraft: 33 (35)<br/>\nTaunt: 43 (47)<br/>\nTumble: 20 (19) cc<br/>\n<br/>\n<br/>\nSaving Throws (Fort/Ref/Will): 35/ 26/ 33 → 44/ 35/ 42 (Saves Vs Spells)<br/>\n<br/>\nNaked/ Armoured AC: 15/ 26 (Full Plate &amp; Shield)<br/>\n<br/>\n<br/>\nBAB: 28 (Four Attacks)<br/>\n<br/>\nAB: +40/ +35/ +30/ +25 (Longsword)<br/>\n<br/>\nDMG: 1d8 +8/ 19-20 x2 (Longsword)<br/>\n<br/>\n<br/>\nSpellcasting: Cleric 8<sup>th</sup> Circle of Spells/ Paladin 4<sup>th</sup> Circle of Spells<br/>\n<br/>\nImmune to Fear &amp; Disease/ Turn Undead Attempts 7 (13)<br/>\n<br/>\nLay on Hands: 100 (250) HP's/ Smite Evil: +4 (+10) AB, +25 DMG<br/>\n<br/>\n<br/>\nDivine Shield: 4 (10) AC for 4 (10) Rounds<br/>\n<br/>\nDivine Might: 4 (10) DMG for 4 (10) Rounds<br/>\n<br/>\nDivine Wrath: +5AB, +5DMG, +5 Saving Throws, DMG Reduction<br/>\n<br/>\n<br/>\nLEVELING GUIDE:<br/>\n01) Paladin (01): Power Attack, WF: Longsword<br/>\n02) Paladin (02): <br/>\n03) Paladin (03): Blind Fight<br/>\n04) Paladin (04): {STR +1}<br/>\n05) Paladin (05): Summon Mount<br/>\n06) Cleric (01): Knockdown<br/>\n07) Cleric (02): <br/>\n08) Cleric (03): {CHA +1}<br/>\n09) Cleric (04): Extend Spell<br/>\n10) Cleric (05): <br/>\n11) Cleric (06): <br/>\n12) Cleric (07): Empower Spell, {CHA +1}<br/>\n13) Cleric (08): <br/>\n14) Paladin (06): Divine Shield<br/>\n15) Paladin (07): <br/>\n16) Paladin (08): {WIS +1}<br/>\n17) Paladin (09): <br/>\n18) Paladin (10): Divine Might<br/>\n19) Paladin (11): <br/>\n20) CoT (01): {WIS +1}<br/>\n21) CoT (02): Great WIS I, Great CHA I<br/>\n22) CoT (03): <br/>\n23) CoT (04): Great WIS II<br/>\n24) Cleric (09): Great CHA II, {STR +1}<br/>\n25) Cleric (10): <br/>\n26) Cleric (11): <br/>\n27) Cleric (12): Great STR I<br/>\n28) Cleric (13): {STR +1}<br/>\n29) Cleric (14): <br/>\n30) Cleric (15): Great STR II<br/>\n31) Paladin (12): <br/>\n32) CoT (05): {STR +1}<br/>\n33) CoT (06): Great STR III, EWF: Longsword<br/>\n34) CoT (07): <br/>\n35) CoT (08): Armour Skin<br/>\n36) CoT (09): Great STR IV, {STR +1}<br/>\n37) CoT (10): Epic Prowess<br/>\n38) Paladin (13): <br/>\n39) Paladin (14): Great STR V<br/>\n40) Paladin (15): {STR +1}</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:23 AM - Jun 02, 2018",
      "content": "<div>Edit: The build referenced above is the \"Champion Protector - Cleric 15/ CoT 8/ Paladin 17\" from Cinnabar Din.</div>"
    },
    {
      "author": "TacticalERK",
      "avatar": "10758915_1528181865.jpg",
      "timestamp": "6:35 PM - Jun 02, 2018",
      "content": "<div>Thanks for the effort. I put this build together, but seem to be missing Resurrection and the ability to heal party members. I might not be looking in the right place to hotkey them though.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:53 PM - Jun 02, 2018",
      "content": "<div>Ressurection is a 7th level Cleric spell, Heal is a 6th level one. You also have other healing spells before those and also the \"heal\" skill which works in conjunction with the various healing kits. Below is a link with all the Cleric spells.<br/>\n<br/>\n <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Cleric\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Cleric</a></div>"
    },
    {
      "author": "TacticalERK",
      "avatar": "10758915_1528181865.jpg",
      "timestamp": "8:12 PM - Jun 02, 2018",
      "content": "<div>Thank you! This is my first spell caster and I didn't realize I had to memorize them first.</div>"
    }
  ]
}