{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "715",
  "name": "The Adamantine Gnomish Sorcerer Crafter (Sorcerer 29 / PM 10 / Wizard 1)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-adamantine-gnomish-sorcerer-crafter-sorcerer-2-t2355315.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 9,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:19 PM - Jan 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong>Edit: </strong>updated build design to Sorc 29 / PM 10 / Wiz 1.<br/>\n<details><summary>Spoiler</summary>Sorcerer(29), Pale Master(10), Wizard(1), Gnome\nSTR: 10\nCON: 18 (28)\nINT: 14\n\n01: Wizard(1): Toughness, {Scribe Scroll}\n03: Sorcerer(2): Extend Spell\n05: Sorcerer(4)\n07: Sorcerer(6)\n09: Sorcerer(8): Empower Spell\n11: Sorcerer(10)\n13: Sorcerer(12)\n15: Sorcerer(14): Maximize Spell\n17: Sorcerer(16)\n19: Sorcerer(18)\n21: Pale Master(2): Epic Skill Focus: Concentration\n23: Pale Master(4)\n25: Pale Master(6)\n27: Pale Master(8): Epic Damage Reduction II\n29: Pale Master(10)\n31: Sorcerer(20)\n33: Sorcerer(22): Great Constitution I, (CON=24)\n35: Sorcerer(24)\n37: Sorcerer(26): Epic Spell: Epic Mage Armor\n39: Sorcerer(28): Great Constitution III, (CON=27)\n\nSkillpoints: 172\nSaving Throw bonuses: Spells: +7, Mind Effects: +2\nAB (max, naked): 20 (melee), 19 (ranged)\nSpell Casting: Sorcerer(9),Wizard(1)\n\n\n01: Concentration(4), Disable Trap(1), Open Lock(1), Search(2), Set Trap(1), Spellcraft(2), \n03: Concentration(1), Search(1), Spellcraft(1), Save(1), \n05: Concentration(1), Spellcraft(1), Save(5), \n07: Concentration(1), Tumble(5), \n09: Concentration(1), Spellcraft(2), Save(2), \n11: Concentration(1), Spellcraft(1), Save(6), \n13: Concentration(1), Save(12), \n15: Concentration(1), Save(18), \n17: Concentration(1), Tumble(5), Save(14), \n19: Concentration(1), Save(20), \n21: Concentration(1), Listen(1), Spellcraft(2), \n23: Concentration(1), Listen(1), Save(2), \n25: Concentration(1), Listen(1), Save(6), \n27: Concentration(1), Listen(1), Tumble(5), \n29: Concentration(1), Listen(1), Tumble(1), \n31: Concentration(1), Spellcraft(3), \n33: Concentration(1), Spellcraft(3), \n35: Concentration(1), Search(1), Save(1), \n37: Concentration(1), Search(2), Save(1), \n39: Concentration(1), Search(1), Save(1), </details>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>Legacy post:</strong><br/>\n<br/>\n<br/>\nThis is an interesting idea I came up with this morning.<br/>\n<br/>\nBasically I noted that my current playstyle, largely relied on essentially 'no DC' spell casting, that is:<br/>\n- summons (including of course our favorite BBoD)<br/>\n- buffs<br/>\n- damage shields<br/>\n- a little bit of magic missile / ILMS<br/>\n- wands<br/>\n- some shapechange spell shenanigans <br/>\n<br/>\nOccasionally I would use a finger of death or two, or a fireball or two but nothing necessarily to write home about.<br/>\n<br/>\nIt also gets a bit annoying after a while with how fragile these characters are. I pretty much run around stealthed, invisible, shapechanged or greater sanctuaried.<br/>\n<br/>\nSo overall I felt I might be best served going down the constitution spell caster route. <br/>\n<br/>\nI also liked sorcerers due to the fact I don't have to think too much about preparing spells all day and they also get heaps of spells (6 per spell level) which is nice. <br/>\n<br/>\nAlthough occasionally I get annoyed when I don't have a certain spell available due to spell choices at each sorcerer level up, which wizard wins obviously from a versatility standpoint. <br/>\n<br/>\nThis little guy utilises GDL's epic skill focus concentration + palemaster 10 + EDR III + epic warding idea but adds dual spell casting (ie both sorcerer and wizard spellcasting). <br/>\n<br/>\nIt doesn't try at all to be a DC spell caster, which is fine by me to be honest. <br/>\n<br/>\nThe mechanics by which the build works is<br/>\n-&gt; qualify for PM asap with wizard, to ensure any spellbook advancement from PM is wizard based, which is far superior to sorcerer advancement with PM here.<br/>\n-&gt; then level sorc to undispellability-&gt; then level PM -&gt; then sorc for more caster levels<br/>\n<br/>\nIt finishes up with base 558hp (buffable to 798hp), epic damage reduction III, an 'undispellable' level 9 sorcerer spellbook with spell penetration 31+1d20, level 4 wizard spell book (to craft all the wands you want), crit immunity / sneak immunity / paralysis immunity, epic warding all the good stuff.<br/>\n<br/>\nI didn't fit maximise spell in the build but one could swap craft wand, great fortitude, epic mage armor or great charisma for this.<br/>\n<br/>\nA level 6 wizard spell book and a sorc 9 spell book which was my original idea, could be achieved by dropping str to 6, Int up to 16 and going Sorc 24 / PM 10 / Wiz 6 but when I looked at the stats it didn't seem worth it, particularly with the low wizard caster levels, to invest too much into wiz here.<br/>\n<details><summary>Spoiler</summary>Sorcerer(27), Pale Master(10), Wizard(3), Gnome\n\nDEX: 8\nWIS: 8\nCHA: 16 (20)\nGnome: (Defensive Training vs. Giants, Hardiness vs. Enchantments, Low-light Vision, Offensive Training vs. Goblinoids, Offensive Training vs. Reptilians, Skill Affinity: Concentration, Skill Affinity: Listen, Small Stature, Spell Focus: Illusion)\n02: Wizard(2)\n04: Pale Master(1): CON+1, (CON=19)\n06: Sorcerer(2): Greater Spell Penetration\n08: Sorcerer(4): CON+1, (CON=20)\n10: Sorcerer(6)\n12: Sorcerer(8): CHA+1, Empower Spell, (CHA=17)\n14: Sorcerer(10)\n16: Sorcerer(12): CHA+1, (CHA=18)\n18: Sorcerer(14): Maximize Spell (or Silent Spell)\n20: Sorcerer(16): CHA+1, (CHA=19)\n22: Sorcerer(18)\n24: Sorcerer(20): CON+1, Epic Damage Reduction I, (CON=21)\n26: Sorcerer(22)\n28: Sorcerer(24): CON+1, (CON=22)\n30: Pale Master(3): Epic Damage Reduction III, {Darkvision}\n32: Pale Master(5): CON+1, (CON=23)\n34: Pale Master(6)\n36: Pale Master(8): CON+1, Epic Fortitude, (CON=24)\n38: Pale Master(10)\n40: Sorcerer(27): CON+1, (CON=26)\nHitpoints: 558\nSaving Throws (Fortitude/Will/Reflex): 30/24/15\nBAB: 19\nAC (naked/mundane armor/shield only): 19/20\nAlignment Changes: 0\nConcentration 43(63), Disable Trap 1(3), Listen 41(46), Open Lock 1(0), Search 6(8), Set Trap 1(0), Spellcraft 38(40), Tumble 16(15)\n\n02: Concentration(1), Spellcraft(1), Save(4), \n04: Concentration(1), Listen(7), Spellcraft(1), Save(1), \n06: Concentration(1), Search(1), Spellcraft(1), Save(1), \n08: Concentration(1), Search(1), Spellcraft(1), Save(1), \n10: Concentration(1), Spellcraft(1), Save(3), \n12: Concentration(1), Spellcraft(1), Save(7), \n14: Concentration(1), Spellcraft(1), Tumble(5), Save(1), \n16: Concentration(1), Spellcraft(1), Save(5), \n18: Concentration(1), Spellcraft(1), Save(9), \n20: Concentration(1), Search(1), Spellcraft(1), Save(1), \n22: Concentration(1), Spellcraft(1), Save(5), \n24: Concentration(1), Save(10), \n26: Concentration(1), Save(16), \n28: Concentration(1), Tumble(5), Save(12), \n30: Concentration(1), Listen(1), Tumble(1), \n32: Concentration(1), Save(4), \n34: Listen(4), \n36: Concentration(1), Listen(3), \n38: Concentration(1), Listen(3), \n40: Concentration(1), Spellcraft(3), \n</details>\nAnyway thought I'd share this one. Still learning about all that arcane spell casting stuff so I'm sure there are things that can be better optimised.<br/>\n<br/>\n<strong>Edit:</strong> updated following suggestions from Yunim<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:26 AM - Jan 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Honestly I don't really see the point in Wizard here. With 3 caster levels you would be better off just carrying stacks of scrolls rather than using your Wizard spells, both offensively and defensively. Usually Sorc/Wiz builds aim for 20/20 to maximise the number of IGMS they can cast. In this case the only thing Wizard offers is very short buffs and very weak offensive spells. Most Sorc/PM builds either go Sorc29/PM10/Monk1 or Sorc29/PM10/Pal1, both of which can be built as CON focused nuke mages.<br/>\n<br/>\nI suggest dropping Great Fortitude for Maximize Spell. All casters need metamagic but Sorcerers get the most out of it due to their spontaneous casting. If possible you should try to fit in Silent Spell too, but you should be able to manage with Extend, Empower, and Maximize.<br/>\nSPen and GSPen should be moved to level 1 and level 3 respectively, the earlier you get them the more useful they are. I would personally move Toughness to level 18 and bump the other feats up since the HP gain is less noticeable at lower levels.<br/>\n<br/>\nYou should cross-class Tumble, either to 15 in order to avoid AoOs or to 20 for the full AC. It seems a waste to get EMA and then miss out on potentially 4 AC from Tumble.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:32 AM - Jan 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the comments Yunim!<br/>\n<br/>\nWiz is useful for crafting magic, you can craft whatever you want, whenever you want without releveling your sorc. The build title states crafter for that reason and not dual caster, technically it is a dual caster but wizard is more a handy appendage, like a decorative condiment where the main substance is sorcerer /PM. <br/>\n<br/>\nAdditionally it also provides some low level stuff whenever you want, like summon creature (useful as lightning rods against stealthers or distractions if you need time to escape), endure/resist/protect elements (lasts 24 hrs), darkness/ultravision, you don't have to run to the shops to buy it, particularly in environments where stocks of such things are limited, like WoG. It also frees up sorc spell slots so you don't need to necessarily memorize them in the limited sorc spell book.<br/>\n<br/>\nCraft Wand is very handy especially stuff like lesser breach or stoneskin which creates items of a caster level 7 I believe even though the CL is 3, turn one spell cast into 20-50. Great for parties, spam all those protection against elements and improved invis out for everyone, the undispellable sorc version for the dedicated meleers.<br/>\n<br/>\nMaximise is a reasonable suggestion which is why I included it as an option, for max IGMS I believe would be the main (and probably only?) reason for this in a no DC build. With only 6-7 spells per day lvl 9 spells careful consideration should be applied whether it is worth using that level 9 spell  / day if the environment is rest restricted or IGMS had been nerfed. I have not found IGMS as valuable as other spells in WoG at least, but put it in a different environment I'm sure it is worth it.<br/>\n<br/>\nWith the Tumble 15-20 I think you bring up a good suggestion for a pure soloist for 4AC however there is less skill points being a non human Int 14 caster, and it likely will be at the cost of dropping lore and lowering search and listen which are nice for party stuff (ie on the field identification, protection teammates against sneakers) which I believe is part of the builds appeal. I will see what I can reduce in exchange, but overall I suspect it might make less difference than we think particularly with undispellable improved invisibility and Damage reduction. <br/>\n<br/>\nI did consider third class single level cheese with monk (tumble/evasion/discipline) and Paladin (discipline/divine grace). Evasion is handy for sure. The saves less so than a usual sorc DC caster, being Con focused, but still handy.<br/>\n<br/>\nOverall this is designed as a great party tank, crit sneak immune with EDR III 550 hp and EMA/EW. with enough spell power and concentration to cast while tanking with those damage shields up, some useful skills for parties plus heaps of craft magic which is more flexible than the usual sorc<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "4:52 AM - Jan 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The main reason for Maximize Spell in this build is Ice Storm, it's definitely more useful than +2 Fort. Maximized IGMS isn't so important since Bigby9, Mords, and Time Stop are more useful against most opponents.<br/>\nSince you don't have Silent Spell the only useful level 7 slots are Bigby6/7, Shadow Shield, Extended True Seeing, Spell Mantle, and Maximized Ice Storm. If you did have Silent Spell then Silent IGMS would be better against some opponents, although that depends on how often you fight multiple opponents and how common Magic DR is on WoG.<br/>\nThe main advantages Sorcerers have over Wizards is being able to spontaneously cast the right spell at any spell level, which requires metamagic. No matter what spells you've used to buff or attack you should always have an offensive option available as a Sorcerer, especially if it's a nuke mage rather than a DC mage.<br/>\nFor a nuke mage the main ones are: 4 - Ice Storm. 5 - Silent Ice Storm. 6 - Empowered Ice Storm / IGMS. 7 - Maximized Ice Storm / Silent IGMS. 8 - Empowered IGMS. 9 - Maximized IGMS.<br/>\nOn top of damage spells you will also have to balance buffs and other support spells like the Bigby's line, that's why the flexibility metamagic gives is so useful. With this build you can leave out Silent and use level 5 for extended II / Elemental Shield and mantles, but if you drop Maximize too then your main level 7 spells with be Bigby7, Extended True Seeing, Shadow Shield, and Spell Mantle which is a pretty bad selection for a nuke mage.<br/>\n<br/>\nEven if you don't go for the full 20 ranks I would still advise getting 15 Tumble to avoid AoOs. If you want to trigger AoOs against your damage shields you can just turn off defensive casting or use a ranged weapon. Unwanted AoOs can be very dangerous when fighting hard hitting foes even for DR tanks, although if the mobs on WoG don't do much damage then this will be less of a concern.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:59 AM - Jan 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Yunim, that is a brilliant explanation for both the maximize / silent and tumble.<br/>\nTo be honest I have just been blindly getting tumble 40/20 for all my melee and ranged builds I have forgotten how valuable it can be, and I will find a way to get tumble 15+ into this guy. <br/>\nAgree the +2 fort is with dropping for either maximize and silent, and I'll try out maximize first<br/>\n<strong>Edit:</strong> updated <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "8:00 AM - Jan 26, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here's my 2 coppers (not that you need 'em):<br/>\n<br/>\nGet rid of Wizard.  It delays your Sorcerer spell progression.  Further, it doesn't add anything that you can't already do with Sorcerer and Craft Wand.  One of the nice things about Sorcerer is you're not locked in on your spell choices.  At each level up you can \"unlearn\" what you had and pick something else.  This makes Craft Wand a godsend for a Sorcerer who has so many great choices but a very finite amount they can pick.  Take ILMS.  You can learn this at Level 8, craft a Wand of it (13th level caster level), and then at Level 9 unlearn it and take Stoneskin (or vice versa).  You can do this over and over, and if you have access to a Magic Electrified, your wands are practically permanent.<br/>\n<br/>\nNow that you've removed Wizard, you can also remove 1 level of Sorcerer, and then add something with some synergy and actually contributes to your build balance.  Maybe 4 levels of CoT (to avoid xp penalty as gnome).  Granted you'll lose a feat to Weapon Focus, but you'll net an extra feat in epic that you can use for Epic Spell Penetration or EDR (and for some Discipline and/or Spot Dumps).<br/>\n<br/>\nNext, move Craft Wand to Level 6 or 9 and make sure to invest 5 skill points into Craft Weapon (I didn't see it in your Skill Guide)<br/>\nMove Spell Penetration and Greater Spell Penetration to Level 15 and 18 respectively (you won't need them right away because you'll be a near pure Sorcerer pre-epic.<br/>\n<br/>\nYou can then begin your Palemaster training around Level 21 and hit PM10 at Level 30.  So by then you may look something like Sorc18/CoT2/PM10.  And then you finish with more Sorc and your last two CoT levels.<br/>\n<br/>\nThere.  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:10 AM - Jan 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Tragically, I believe this build will not work as I originally intended on gameplay testing.<br/>\n<br/>\nIt has highlighted a limitation of the CBC which I designed this in.<br/>\n<br/>\nIn the CBC if the build is inputted as Wiz 3 / PM 1 / Sorc 24 / PM 9 / Sorc 3, then it states Lvl 4 wizard spells are possible.<br/>\n<br/>\nHowever in the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Pale_master\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki: Pale Master</a><br/>\n<blockquote><div>Upon reaching pale master levels 1, 3, 5, 7, and 9, the character gains new spells per day as if he had also gained a level in his highest caster class (bard, sorcerer or wizard). </div></blockquote>\nThis means that once Sorc is 4 or higher, then PM adds bonus spells to Sorc rather than Wizard, meaning it will never progress beyond lvl 2 wizard spells as originally designed.<br/>\n<br/>\nAnyway, moral of the story is I found a limitation of the CBC spreadsheet<br/>\n<br/>\nThe character is still alive and kicking on WoG, however the Wizard level cannot be removed.<br/>\n<br/>\nNot a complete loss, as this single level provides 'Scribe Scroll' for free as well as a few low level spells to muck around with (ie endure elements) or craft with (wands of summon creature I can be unusually useful). And honestly there have been so many occasions where I have 6-7 castings of Mords, Time Stop, Greater Sanc left over before resting etc etc that scribing such spells onto scrolls is definitely very very useful.<br/>\n<br/>\nThe build has been reworked to a Sorcerer 29 / PM 10 / Wizard 1 split.<br/>\n<br/>\nThe silver lining is I squeeze in more HP, plus silent and maximise spell, by dropping a few spell pen feats with the extra caster levels.<br/>\n<br/>\nWill edit the new design into the post.<br/>\n<br/>\nRE GDL's suggestion with craft weapon -&gt; I playtested craft weapon 5 in the WoG environment, unfortunately it didn't provide a lot (craft trap would provide more), however in other environments where bone wands are not easily accessible it certainly would be useful. It's an option.<br/>\n<br/>\nSingle points in disable trap and set trap have been very valuable for early leveling with Take 20 as I'm sure you are aware! :)<br/>\n<br/>\nHad a look at the ECB Archives, no Sorc / PM / Wiz builds with Sorc 24+<br/>\n<details><summary>Spoiler</summary>Dark Artist sorcerer 29 / pale master 10 / bard 1 (human) by mantis3\nDoom Lich sorcerer 28 / pale master 10 / blackguard 2 (human?) by Almalith\nThe Mage Tank sorcerer 29 / pale master 10 / monk 1 (human) by Aiki_Angel\nGrim Conjurer sorcerer 29 / pale master 10 / paladin 1 (gnome?) by yrtsns</details>\nLikewise nothing particularly in the Tapatalk forum but happy to be corrected for those more knowledgeable about our forum's history<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "1:05 PM - Jan 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"18669\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18669&amp;sid=4d23fd44f7d30e59363c5b248f203b22#p18669\">↑</a><div class=\"responsive-hide\">Jan 27, 2020</div></cite>RE GDL's suggestion with craft weapon -&gt; I playtested craft weapon 5 in the WoG environment, unfortunately it didn't provide a lot (craft trap would provide more), however in other environments where bone wands are not easily accessible it certainly would be useful. It's an option.<br/>\newise nothing particularly in the Tapatalk forum but happy to be corrected for those more knowledgeable about our forum's history</div></blockquote>\nIf I recall, doesn't the 5 points in craft weapon cause the game engine to start dropping large bones?  And those can be turned into blank wands via craft weapon.<br/>\n<br/>\nSo the 5 points gives you access to finding blank wands without going to town...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:05 PM - Jan 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That is correct, Conlaoch from skeletons I understand, otherwise they don't spawn. Wolves are dropping animal hides.<br/>\nI might stick a few points in the build later perhaps, 5 points is not a huge investment but I think I gotta kill skeletons to get those bones. Happy to be corrected here.<br/>\nAm finding scribe scroll very handy as a sorc too, it is common I have left over spells before I rest but perhaps dont want to quite shell out the cash for that big wand :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "3:09 PM - Jan 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah..   on a server that isn't rest restricted, scribe scroll is probably way overkill unless its for RP purposes.  But on a rest restricted server, scribe scroll lets you slowly build up a stock of spells for emergency purposes... and who doesn't want a scribed Time Stop as a spare....<br/>\n<br/>\nAssuming you have the Dragons Blood and a blank scroll....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}