{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "389",
  "name": "ENGINE OF DESTRUCTION!  FTR/Bard/PM",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/engine-of-destruction-ftr-bard-pm-t2339324.html",
  "author": "10235387",
  "avatar": "10235244_1510287070.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "10235387",
      "avatar": "no_avatar.png",
      "timestamp": "9:01 AM - Aug 04, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">After being slapped down by Mr. Kane for making incredibly weak builds, I'm trying to get more input from the pros in the community.<br/>\n<br/>\nI'm growing tired of playing classes that have to spend a ton of time buffing/resting, so I'm trying fighter types.  My concept is a High AB/High Damage/High DC Dev Critter who is, himself, immune to crits - a combo fighter/palemaster.  I've seen a handful on the search engine, with the typical level split being F20BRD4PM16 (presumably to max tumble and get epic spells), though I also saw a F26BRD4PM10 that (amazingly) had a lowish AB.<br/>\n<br/>\nI'd like to fit in Epic Weapon Specialization, Dev. Crit, max Tumble and Epic Warding with the ability to survive PvP (I'm going to try playing on servers when my wife goes on vacation this fall).<br/>\n<br/>\nQuestion 1 - is it worth going after a once per day ability like Epic Warding, or would I be better served keeping PM at 10 and going F26BD4, gaining extra fighter feats?<br/>\nQuestion 2 - if I have to choose between an extra +4 damage from EWS, an extra 3 AC from max tumble or having an Epic Spell, which one is the least useful?<br/>\nQuestion 3 - if the Epic Spell is not critical, is it worth it to go F22BD8PM10 for the better bard song, knowing that you'll never be able to cast bard spells?  <br/>\n<br/>\nThe character I have now I'm taking through the OC - my idea is to do pre-epic as a straight fighter, ultimately ending up as either F21BD4PM15 (assuming I can do the PM level and get the epic spell at the same time), or forego maxing tumble and end at F21BD3PM16.<br/>\n<br/>\nI'm 2-handing for max damage, using Heavy Flail simply because it has the same damage output as the Katana (which should be a two-hander in my book).<br/>\n<br/>\nSTR 18<br/>\nDEX 10<br/>\nCON 14<br/>\nWIS 8<br/>\nINT 14<br/>\nCHA 8<br/>\n<br/>\nAt Level 11, he has LOH, Strong Soul, PA, Cleave, GC, WF (Flail), EWS, KD, IKD and Great Fortitude, with STR pumped whenever possible.  Skill is only going into Discipline for now, saving the excess for Spellcraft and Tumble.  I'm debating about Iron Will/Epic Will - with this dude's saves being so low, will the +6 make a difference, or should I put those feats elsewhere?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:54 AM - Aug 05, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello, man.<br/>\n<br/>\nI apologize if it seemed rude to tell you that your builds were weak, but in my defense, they were. I didn't mean to be rude, just to tell you the truth. Maybe it sounded blunt because English isn't my first language, and tone in online communication is very hard to infer, so sorry if you felt slapped down, I truly didn't mean it. <br/>\n<br/>\nWell, I see you're taking a more thoughtful approach into building characters, which is great, but the problem is that the OC is a TERRIBLE toon-testing platform because it's designed for newbies, people who had never played the game and want to give it a try by pressing the recommended button at Character Creation. Basically, ANYTHING, no matter how weak or underpowered, will succeed in the OC battles. You won't know whether your build's AB is low because you'll hit on all your attacks except on natural 1s. You won't know whether your AC is low because opponents will miss on their attacks against you over 80% of the time regardless, etc... If it were even moderately difficult, it would scare people away from buying the game. That kind of setting is the last place to truly test out builds. A good place to start is the Aielund Saga, a custom-made module with much better balancing (even though items are a bit on the overpowered side), monster stats and enemy AI in general are much better. Here is a link to the topic here in the ECB. You should really give it a try:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/the-aielund-saga-t515487.html\" rel=\"noreferrer\" target=\"_blank\">The Aielund Saga</a><br/>\n<br/>\nJust to illustrate my point, I myself have been EXACTLY in the same position as you. Before I joined the ECB and had my world reshaped by the great advice (and slaps) I received from the elders, such as Cinnabar Din, Gimnir77, Thaxll'syllia (or however it's spelled), Avado, Magical Master, onion eater, Kail Pendragon, Mick Dagger and so many others (sorry if I forgot anyone), I made a Ranger build that I thought was GREAT. It was a Ranger 27/ Weapon Master 7 / Monk 6 build dual-wielding RAPIERS (yes, rapiers). Now I look at it and it makes me want to vomit. Here is what has changed between then and now:<br/>\n<br/>\nI know Rapiers are medium weapons and incur a -4 penalty while dual-wielding.<br/>\n<br/>\nI know Monks should nearly always wield Kamas because they're better than any weapon thanks to the improved attack schedule.<br/>\n<br/>\nI know Weapon Master is a bad class to add to a combo without either Fighter or CoT levels to help out with the feats, save a few exceptions. <br/>\n<br/>\nI didn't get Tumble, nor did I aim for Epic Dodge because I didn't even know what it was. Nowadays I would go Ranger 26 Monk 9 SD 5 dual-wielding Kamas with Epic Dodge. Many Favored Enemies, Bane of Enemies, the full package!<br/>\n<br/>\nNow, about this build you're trying to make, the first thing you need to ask yourself is, what is this class combo good at? The answer is, it's an immune to criticals devcritter with a high AC thanks to Bone Skin and an OK to good AB (over 45 unbuffed is considered the mark to hit for melee builds, you should aim for that, a couple of points less are fine). So, in that scenario, why would you improve your Fort save? You're immune to all death effects except implosion, so you are taking 3 feats to enhance a save that will nearly never be used. I hope you agree with this, that's a bad investment. So, my advice, get rid of the saves feats, you don't have evasion, saves are not your thing, not much to do about that (except getting immunity gear) . But, what do you want to do now with so many spare feats?<br/>\n<br/>\nThe answer could very well be versatility. Why not invest the feats on more than one weapon to have different damage types against different types of enemies? I'm thinking you could invest in focus in both Katana (or Bastard Sword, or even any Slashing weapon, like a Longsword if you don't want to take Exotic Weapons) and the Heavy Flail. You can use the Katana / Shield most of the time (if you play in any moderately difficult setting, odds are you'll NEED a shield), but when the enemy is Undead, you can switch to the flail, you don't need Devcrit on it because Undead are immune to it, and blunt weapons do full damage to them. Even without EWS, it's a 2-handed weapon, so it does 1.5x your strength modifier in damage, which makes up for the lack of EWS if you can't spare an epic feat. With your high AB, you should be able to KD them and make quick work of them.<br/>\n<br/>\nThen you can even invest in Disarm because 2-handed weapons make resisting Disarm that much harder, and that is what adds versatility to your toon. You will have many tools at your disposal to deal with each type of enemy differently. You won't gain anything by disarming a Wizard, but a Battle Cleric can be severely underpowered without his Darkfired, GMW'd Weapon to hit you. <br/>\n<br/>\nIn terms of build concept, you have to decide what you want to do. If you want to invest more on offense, then Ftr 26 Bard 4 PM 10 is your spread, if you want to invest in AC, then Fighter 20 / Bard 4 / PM 16. More Bard levels are a terrible idea here. The Bard Song only starts to get good at level 16, and you don't have room for 16 Bard levels in this build concept (if you want to see that other concept well-built, search this forum for the Skeletal Musician, but that's a whole different build than what you're aiming for here). Why not invest more in Bard? Because a temporary +1 AB (difference between the level 4 Bard Song and level 8 Bard Song) will cost you 2 EPIC FEATS (which can free-up 2 General Feats for 2 Great Strengths, hence granting you said AB all the time instead of just when the Bard Song is on, plus a +1 to damage). That's just a bad trade. Similarly, you should probably use the first spread (Ftr 26 Bard 4 PM 10), go Fighter 17 Bard 3 pre-epic (you'll lose 1 BAB, but you'll save up 2 pre-epic (Fighter 18 and Fighter 20) feats to take in epics, meaning you'll free up 2 general feats for Great Strengths, hence recovering 1 AB and gaining 1 Damage compared to going straight Fighter 20 pre-epic). Epic Warding isn't such a good idea because it'll last very little with only 4 Bard levels, so I'd stay with this spread and try to be more offensive.<br/>\n<br/>\nAnyway, just tossing out some ideas to get you started. I don't want to build it for you because then you won't learn, but if you draft a sketch (you should use the CBC for that, it makes things much simpler), I'll gladly help you tweak it.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "10235387",
      "avatar": "no_avatar.png",
      "timestamp": "3:39 AM - Aug 05, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong>Hello, man.<br/>\n<br/>\nI apologize if it seemed rude to tell you that your builds were weak, but in my defense, they were. I didn't mean to be rude, just to tell you the truth. Maybe it sounded blunt because English isn't my first language, and tone in online communication is very hard to infer, so sorry if you felt slapped down, I truly didn't mean it. </div></blockquote>\n\nNo offense taken - you were being truthful and I appreciate it!<br/>\n<br/>\nSo, in your opinion, I'm stronger going sword/board instead of using a 2-hander?  Maybe I'll look at Scimitar &amp; Mace or Morning Star as a combo.<br/>\n<br/>\nAppreciate the insight on Epic Warding - better to stay at PM10 and look at FTR 26. <br/>\n<br/>\nI'll play around and post the build with the suggested format.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:20 PM - Aug 05, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Theophilus_Fist wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong>Hello, man.<br/>\n<br/>\nI apologize if it seemed rude to tell you that your builds were weak, but in my defense, they were. I didn't mean to be rude, just to tell you the truth. Maybe it sounded blunt because English isn't my first language, and tone in online communication is very hard to infer, so sorry if you felt slapped down, I truly didn't mean it. </div></blockquote>\n\nNo offense taken - you were being truthful and I appreciate it!<br/>\n<br/>\nSo, in your opinion, I'm stronger going sword/board instead of using a 2-hander?  Maybe I'll look at Scimitar &amp; Mace or Morning Star as a combo.<br/>\n<br/>\nAppreciate the insight on Epic Warding - better to stay at PM10 and look at FTR 26. <br/>\n<br/>\nI'll play around and post the build with the suggested format.</div></blockquote>\n\nNo, mate. you misunderstood me.<br/>\n<br/>\nYou're stronger going for BOTH 1 and 2-hander with different damage types to ensure you can get around DR belts and stuff like that. If you're not dealing damage with one type of weapon, you switch to the other and problem solved. <br/>\n<br/>\nThis is the problem with playing in the OC: NOBODY has damage reduction there, but in servers it's very common. On WoG, where I play, there are MANY BOSSES with Greater Swordsman's Belts and Greater Archer's Belts (20 Damage Resistance vs Slashing and Piercing weapons respectively), so having focus on two different weapons (one blunt and the other slashing) will ensure you have ways of damaging them in melee regardless of DR. Not to mention some enemies can be disarmed and severely crippled with that, so you can affect the outcome of your attempts to disarm them by switching weapons (from 1 to 2-handed). In other words, Sword and Board should be your \"default mode\", and you can switch to 2-handed weapons depending on the situation.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}