{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "290",
  "name": "a little help with an old build of mine..",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/a-little-help-with-an-old-build-of-mine-t2354309.html",
  "author": "SmkNThDrkNght",
  "avatar": "no_avatar.png",
  "replies": "10",
  "views": "954",
  "posts": [
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "8:29 PM - Sep 02, 2014",
      "content": "<div>Ok so I've been away from the game for awhile and now that I'm able to play again I wanted to run around with one of my old builds. This one I posted a long time ago came to mind: <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build294407.html\" rel=\"noreferrer\" target=\"_blank\">The  M.G.K.M.</a><br/>\n<br/>\n *waits patiently for the laughter to subside* <br/>\n<br/>\n I obviously know that it's not s build living up to its full potential but it's going to be awhile before I'm able to dl the cbc again to tweak it properly. <br/>\n<br/>\n Requirements: <br/>\n I would like to keep the same classes.<br/>\n I know that there's other options but for rp purposes I'd like the harper bonus feats to remain Fe's.<br/>\n NOT a shifter looking for more of a spellsword .<br/>\n Prefer to stay undispellable. <br/>\n Dear lord help with my starting stats I can't for the life of me figure out what I was thinking or why nobody said anything before. <br/>\n Maybe blindfiight earlier, and zen archery isn't a must but depending on stat allotment could be nice to have.<br/>\n At this time it would be for PvM only (I do want to try out WoG eventually)<br/>\n As to race. I prefer elves (somewhere a grizzled ole  dwarflord just groaned) but knowing it's feat starved human will do fine.<br/>\n<br/>\n Thanks in advance.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:45 AM - Sep 03, 2014",
      "content": "<div>First of all, welcome to the forums darknight!<br/>\n<br/>\n Now to the build itself... You want to keep almost authentic the look of what you did in the past but with a good optimization, am i right?<br/>\n<br/>\n Levels must also remain the same since undispellable and HS plus WM yield a 28/5/7 split which is exactly what you did.<br/>\n<br/>\n From the first looks of it, you might want to start with: (STR 14  DEX 13  CON 12  INT 13  WIS 16  CHA 08), then you should focus on rising your strength with just two bumps in wisdom and let the two epic bonus Druid feats finish your wisdon to a nice, even 20. In place of zen archery and toughness you should take two additional Great Strength feats in order to help your AB since the original 34 is way to low even for a spell-sword. Keep blind-fight of course since it's not replace-able from true sight and get the rest of the combat feats as you have done. with those few changes your end-game raw stats should look like this: (STR 24  DEX 13  CON 12  INT 13  WIS 20  CHA 08). It is a significant improvement if i might say but you are still hampered from the presence of HS levels pre-epic and therefore you lose another valuable point of AB. It's alright though since this is a Role -Playing build primarily, and it should play nicely.<br/>\n<br/>\n * You might also want to look into Fighter instead of Weapon Master, yes i know i state the obvious but i just saw that you don't even have Heavy Armour proficiency and of course WM doesn't give any. The build would work so much more smoothly with Fighter instead of Weapon Master. And you could also change the Race to Elves since there would not be feat shortage of any kind. Just food for thought ;)<br/>\n  </div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "4:46 AM - Sep 03, 2014",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>First of all, welcome to the forums darknight! </div></blockquote>\n\n Thank you and thank you for the wonderfully helpful reply.  How bad of a trade off do you think it'd be to drop a level in druid to pick up one more level of wm pre epic for an extra bab (right term? I always screw them up) . I know I'd lose the druid bonus feat and delay the hs tumble a.c. bumb but might it be a wash ? It would get another +1 to reflex saves and another use per day of the ki damage thing. Could grab an int+1 so as not to leave skill points laying around and grab a great wisdom instead with the druid bonus feat.  Ending with d27/wm8/hs5 ... thoughts?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:27 AM - Sep 03, 2014",
      "content": "<div>I'm headed in the same general direction as Valerfor but it still is a nasty exercise no matter how you split it.  HS really mucks up the potential badly.  Anyhoo, trying to keep as close to your original class split which actually is about optimized \"as is\" seeing as how there's no room to extend spells so you'll still get some mileage out of Blood Frenzy and Creeping Doom...<br/>\n<br/>\n Elven Neutral build, STR: 14 (24), DEX: 13, CON: 12, WIS: 16 (19), INT: 13, CHA: 8.  That'll provide enough skillpoints to meet all the prereqs, max Disc, SpCrft &amp; Tumble with 46 to spread as you like.<br/>\n<br/>\n Elf is going to cost you zen archery in this build unless you start to prune away from AB &amp; damage (pretty silly, though, since you are taking FEs to boost anyway). There's really no point in trying to maintain two different sources of AB.  It's a losing battle using all feat-starved classes. IMO without a monk infusion of some sort, high-WIS is just wasted. Else, go human like you did before and use Owl's Insight to reach the ability cap.<br/>\n<br/>\n Pre-epic<br/>\n Bumps :: @4,8,16,20 +4STR, @12 +1WIS<br/>\n Druid 1-16 :: WF: Scimi, Dodge,Expertise,Mobility,Spring Attack,Whirlwind Attack<br/>\n WM 17-20 :: WoC, Blind fight<br/>\n BAB @16 is 4 APR<br/>\n<br/>\n Epic<br/>\n Bumps :: all to STR (+5)<br/>\n WM 21-23 :: EWF<br/>\n Druid 24-34 :: Imp Crit, Alertness, Iron will, Armor skin, bonus - Grt WIS<br/>\n HS 35-38 :: FE, Grt STR<br/>\n Druid 39 (spcrft dump) :: Epic prowess, bonus - Grt WIS<br/>\n HS 40 (disc dump) :: FE<br/>\n<br/>\n It still ain't pretty but reaches an unbuffed AB of 38 and AC 29 w/armor-shield.  Yeah, I know you won't be casting level 8 or 9 spells until the late bonus feats kick in.  It's possible to move the bonuses up some if you would rather delay the juicy WM boosts until later.  Your decision.  I'd just survive with Level 7 spells and use summons if needed in the interim.<br/>\n<br/>\n Hope the roleplay is worth it, SmkNThDrkNght.  Best I can scrape together on the fly.</div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "7:23 AM - Sep 03, 2014",
      "content": "<div>Yes hip it is worth it, I do love my roleplaying. And I do appreciate the build help.  <br/>\n<br/>\n I knew it wasn't power anything when I posted it back on the old forums (same with today)  but never expected 0 replies back then to it, it didn't even get ridicule. <br/>\n<br/>\n So you and valerfor have already breathed new life into a build at almost a decade old from its inception (on my x wives cpu) and for that I thank you sirs.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:52 PM - Sep 03, 2014",
      "content": "<div>You can certainly make that slight change in the Druid class levels darknight, the net resault will be the loss of 1 WIS point (ending in WIS 19) and the gain of 1 AB (Druid 12/ WM 8 pre-epic). From a spell-sword perspective it certainly is worth it, but from a role-playing one you might not find it worth the effort to delay those HS levels. The AB at this point (38) is solid enough for a spell-sword, so it is your call.<br/>\n<br/>\n Glad we have been of help,</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:45 PM - Sep 03, 2014",
      "content": "<div>You should use whatever priority you wish to sculpt a roleplay build to best suit your desires.<br/>\n<br/>\n Key interactions I see in the split chosen are:  <ul><li>reaching BAB 16 in pre-epic, not only for the best AB, but best APR</li> <li>infusing the increased multiplier and expanded crit range for your weapon as soon as possible (i.e.WM7)</li> <li>empowering the offensive capabilities with high-level divine spellcasting in time to deal with increased CR</li> <li>obtaining the best overall combat skill levels with some room to develop secondary skills a bit (stealth and detection prowess is beyond the scope of this build) </li> </ul> If you decide a high priority on HS, then take four levels in pre-epic.  It doesn' t matter how you spread them out, optimization is Dru16/HS4.  That'll drop AB one notch with APR now at 3.  Feat selection will need to modified, of course. WM will bloom in epic as a consequence.<br/>\n<br/>\n If waiting until epic levels for HS is acceptable, you can take the first HS at 21 if you sacrifice two of the WM prereq feats in pre-epic for the HS ones. Then HS will register it's influence RP-wise and get an early tumble dump (well, earlier than level 35 anyway).  However, WM will mature slower since you'll still need to fulfill prereqs, now in epic levels, as will the available spells. Spread the next 3 HS dumps out as preferred, saving HS5 for level 40.<br/>\n<br/>\n It's actually pretty cut-'n-dried when preferences have been as thoroughly detailed as you have done.  There's a cause-effect consequence for every choice you make that cannot be magically-avoided with some exploit... unless it's high magic PW with items that provide feats, abilities, extra spell levels, etc. that severely dilute class definition.  WoG is not that, though, and adheres to the AD&amp;D ruleset like it still matters (as I'm sure you are fully aware).<br/>\n<br/>\n  </div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "10:06 PM - Sep 03, 2014",
      "content": "<div>Thanks for checking that for me valerfor, I thought so but wanted someone who's been active lately to agree with it as I'm still fuzzy on some stuff.<br/>\n<br/>\n<br/>\n Hip excellent pointers given but in the end it is a rp build so don't worry anymore about it. <br/>\n<br/>\n As to WoG I wouldn't rp this build there it would have to be my favorite rp build <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build295817.html\" rel=\"noreferrer\" target=\"_blank\"> The Harper's Singing Shadow </a>.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:16 PM - Sep 03, 2014",
      "content": "<div>The Harper's Shadow is a really nice build ;)</div>"
    },
    {
      "author": "SmkNThDrkNght",
      "avatar": "no_avatar.png",
      "timestamp": "10:30 PM - Sep 03, 2014",
      "content": "<div>Thanks for that valerfor it's my pride and joy build, Rp or not.<br/>\n  While mgkm was the first one I threw together (but didn't post first) the 3 in between (I only posted 5)  were ok but had there flaws to. But The Harper's Singing Shadow is a nice mostly well rounded scout and is very fun to play.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:19 AM - Sep 04, 2014",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>The Harper's Shadow is a really nice build ;)</div></blockquote>\n<div align=\"left\">Yah. Me likes, too. <img class=\"img-emoji\" src=\"emoji/11.gif\"/>  Any bardic build with both Curse Song and Lasting Inspiration hits a sweet spot with me. <br/>\n<br/>\n Not to derail this discussion, butSmkNThDrkNght was spot on about having hard decisions to make when so many directions are open with lots of skills at hand.  I have a tendency to go aggressive, though, and would swap all or most of the concentration for Taunt.  If the environment provided some +Perform props on some items, the Taunt could be even more nasty to deal with and HiPS almost an afterthought with Invis/Imp Invis spells at hand.<br/>\n<br/>\n Well, back to the salt mine...<br/>\n  </div></div>"
    }
  ]
}