{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "038",
  "name": "Vicar of the Void: Cleric 35 / Monk 4 / Ranger 1",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/vicar-of-the-void-cleric-35-monk-4-ranger-1-t2355317.html",
  "author": "grizzled_dwarflord",
  "avatar": "10758933_1548854436.jpg",
  "replies": "39",
  "views": "9.5K",
  "posts": [
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "7:25 AM - Jan 26, 2020",
      "content": "<div><strong>Question</strong>: <em>If a wizard falls in the forest, does he make sound?</em><br/>\n<strong>Answer</strong>: <em>Not if a Vicar of the Void was there</em>.<br/>\n <br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10758933_f45690f917ab9e703c810e687631a936.jpg\"/><br/>\nOne-part faith, two parts mage killer, and all parts delicious, the Order of the Muzzlemancers were rare mystics from various faiths who shared a common enemy, and thus a common purpose: to bring order to chaos and to silence those who opposed them.  Amongst the clergy of Istus, they were reverently referred to as the Vicars of the Void.  When the Order finally revealed themselves, many of the most powerful witches and wizards, in their hubris, dared to oppose them, for in the <em>Annals of Istus</em> it was written that many of the world’s premier chaos wizards arrayed themselves against the Order and there were many battles.  But all the wizards, the warlocks, the witches and sorcerers, they all fell, one by one, two by two, three by three, they all fell without a sound.  The Order, it was said, has been lost through the sands of time, but it is rumored that some still walk the Prime, and that they are the only ones who foresee the great war against Chaos yet still to come.<br/>\n <br/>\n<strong>Title: The Vicar of the Void</strong>\n<ul>\n<li>AKA: <em>The Last Word, Voiceless Vicar, and the Arcane Silencer</em></li>\n<li>Classes: Cleric35/Monk4/Ranger1</li>\n<li>Race: Human (<em>Half-Elf,</em> <em>Gnome or Halfling is a good substitute</em>)</li>\n<li>Alignment: Any Lawful</li>\n<li>XP Penalty: None (<em>as human or half-elf</em>)</li>\n<li>Playable: 1-40, all Settings, all Environments</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Attributes</span></strong><br/>\nStr10<br/>\nInt14<br/>\nWis18 (36)<br/>\nDex10<br/>\nCon12<br/>\nChr8<br/>\n <br/>\n<strong>Major Domain</strong>: <em>Any Combination of Travel &amp; Trickery or both</em><br/>\n<strong>Minor Domain</strong>: <em>Magic, Knowledge, or Animal</em><br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Level Guide</span></strong><br/>\n1 Cleric 1, Skill Focus: Concentration, Extend Spell<br/>\n2 Monk 1 (<em>Evasion, Cleave</em>)<br/>\n3 Cleric 2, Silent Spell<br/>\n4 Cleric 3, Wis19<br/>\n5 Cleric 4<br/>\n6 Cleric 5, Zen Archery<br/>\n7 Cleric 6<br/>\n8 Cleric 7, Wis20<br/>\n9 Cleric 8, Craft Wand (<em>5 into Craft Weapon skill</em>)<br/>\n10 Cleric 9<br/>\n11 Cleric 10<br/>\n12 Cleric 11, Empower Spell, Wis21<br/>\n13 Cleric 12<br/>\n14 Cleric 13<br/>\n15 Cleric 14, Spell Focus: Evocation<br/>\n16 Cleric 15, Wis22<br/>\n17 Monk 2, (<em>Deflect Arrow</em>)<br/>\n18 Cleric 16, Greater Spell Focus: Evocation<br/>\n19 Cleric 17<br/>\n20 Cleric 18, Wis23<br/>\n21 Cleric 19, (<em>Spell Craft to 24</em>), Auto Silent I<br/>\n22 Cleric 20<br/>\n23 Cleric 21<br/>\n24 Cleric 22, Auto Silent II, Wis24<br/>\n25 Cleric 23, Auto Silent III<br/>\n26 Cleric 24<br/>\n27 Monk 3, Epic Skill Focus: Concentration, (<em>Monk Speed</em>)<br/>\n28 Cleric 25, Wis25<br/>\n29 Cleric 26, Great Wis I<br/>\n30 Cleric 27, Great Wis II<br/>\n31 Cleric 28<br/>\n32 Cleric 29, Great Wis III, Wis29<br/>\n33 Cleric 30, Great Wis IV<br/>\n34 Cleric 31<br/>\n35 Cleric 32, Great Wis V<br/>\n36 Cleric 33, Great Wis VI, Wis33<br/>\n37 Monk 4<br/>\n38 Cleric 34<br/>\n39 Cleric 35, Great Wis VII, Great Wis VIII<br/>\n40 Ranger 1, Epic Spell Focus: Evocation, Wis36 (<em>Skill Dump</em>)<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Combat Vitals</span></strong><br/>\nMelee BAB: 24/21/18/15/12 (<em>kama</em>)<br/>\nRanged BAB: 37<br/>\nFully Buffed Melee: 50/47/44/41/38/50/45*<br/>\nFully Buffed Ranged: 63/58/53/63/58 (<em>with Haste/Divine Power</em>)<br/>\nAC: 31 (naked and unbuffed)<br/>\nHP: 362<br/>\nSpell Resistance: 37 (via spell)\n<ul>\n<li>*<em>Note: The buffed melee attack schedule above is with a Kama, with 7 attacks per round. The above record is the true schedule taken from in-game combat logs and is not reflected on the character sheet (which will only show 5 attacks) and combines Monk Attack Schedule, Haste, Divine Power. One can gain 8 attacks by activating Flurry of Blows</em></li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Evocation DCs:</span></strong>\n<ul>\n<li>Hammers: 33 (39)</li>\n<li>Empowered Blade Barriers: 35 (41)</li>\n<li>Implosions: 41 (47)</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Skill Set: 225*</span></strong><br/>\nConcentration: 43 (58)<br/>\nTumble: 40<br/>\nSpellcraft: 38 (40)<br/>\nSpot 43 (56)<br/>\nListen: 43 (56)<br/>\nSearch: 6 (8)<br/>\nHeal: 5 (18)<br/>\nCraft Weapon: 5 (7)<br/>\nOpen Lock: 1<br/>\n<em>* There’s enough skill points here to customize any way you want.  The above is merely my vision.  But one could certainly dump points into discipline and siphon away from Spot/Listen</em><br/>\n<strong><span style=\"text-decoration:underline\"> </span></strong><br/>\n<strong><span style=\"text-decoration:underline\">Saving Throws</span></strong><br/>\nFort: 25 (33)<br/>\nReflex: 19 (27)<br/>\nWill: 37 (45)<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Base Spell Slots:</span></strong><br/>\n1<sup>st</sup>: 10<br/>\n2<sup>nd</sup>: 9<br/>\n3<sup>rd:  </sup>9<br/>\n4<sup>th:  </sup>9<br/>\n5<sup>th: </sup>9<br/>\n6<sup>th: </sup>7<br/>\n7<sup>th:   </sup>7<br/>\n8<sup>th:  </sup>7<br/>\n9<sup>th: </sup>7<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Strengths</span></strong>\n<ul>\n<li>Strong Caster Cleric with High DCs</li>\n<li>Auto Silence <em>(see commentary as to why</em>)</li>\n<li>Can stifle other casters with Silent Spell (<em>cast on himself or ally</em>)</li>\n<li>Evasion</li>\n<li>Undispellable Buffs</li>\n<li>High Concentration, Spot and Listen</li>\n<li>Can still melee the mobs</li>\n<li>Monk Speed Boost</li>\n<li>Craft Wands of Haste, Invis, Improved Invis, etc.</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Weaknesses</span></strong>\n<ul>\n<li>Opponents who have Auto Silent Feat Set or a retinue of Silent Spells metamagicked</li>\n<li><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/mestil-s-half-dead-juggernaut-wizard-26-pale-maste-t2355300.html\" rel=\"noreferrer\" target=\"_blank\">This Guy</a></li>\n<li>Low Reflex Save (mitigated by Evasion and Protection from Elements)</li>\n<li>Lowish Fort Save</li>\n<li>Not a meleer (but can get by with buffs)</li>\n<li>Soft in the middle against a dedicated and erstwhile melee opponent</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Skill Point Tips</span></strong>\n<ul>\n<li>On Cleric Levels: Concentration and Spellcraft, with a point here and there for Heal. Make sure your Spellcraft is at 24 Raw at Character Level 21</li>\n<li>On Monk Levels: Concentration, Tumble, Listen.  There’s enough points to max discipline if you don’t want to wait until Level 40 for the Ranger Spot dump</li>\n<li>Ranger: Concentration, Spot (if you forego-ed Discipline), and about 5 or 6 into Search.</li>\n<li>Cross Class: 1 for Open Lock, 1 for Search, during pre-epic.</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Builder’s Commentary</span></strong><br/>\nThe Vicar of the Void is a deadly caster cleric who makes his living by taking on mages, bards and other casters by casting his high-powered Silence on himself, and then either getting the enemy caster inside his silence radius by stealth (Invis), or by using Haste/Monk speed to close the gap before the enemy caster gets his spells rolling.  The most insidious way is to make your approach by Greater Sanctuary.  Once inside his Web of Silence, the enemy caster is helpless for he will not get a save against the Silence.  Globes are of no avail.  Mantles will work up unto a point, but by careful maneuvering the Silence radius can chew the mantle up as well.  The enemy casters’ mouths become vacuums, empty of sound, but the Vicar…. The Vicar needs no sound.  He can now just pummel the defenseless caster or drop an Implosion that he has no chance of succeeding a save, or crisscross the caster with Empower Blade Barriers.  For party play, it’s even more wicked to cast the Silence on a party member (speedy Monk being ideal) and have them rush the caster(s) to muffle their mouths while the Vicar unleashes holy hell on the unsuspecting casters.<br/>\n <br/>\nThe Vicar is further enhanced by high Spot and Listen skills, by a wide range of powerful and undispellable Cleric Buffs, and can maintain a high Zen Armor Class by wearing only robes and a high wisdom.  Curse Songs and Wounding Whispers will be useless against his Silence and Extended Silence (Void Mode).  I chose not to select any Epic Spells or Armor Skin.  I found Great Wisdoms added more value and synergy.<br/>\n <br/>\nIn my design and testing, I tried a number of combinations – a more melee focused version, a hybrid Rogue/CoT, and then finally the near pure caster.  Pound for pound, the near pure seemed to be the best.  It was just too strong.  The melee and hybrids tried to be too many things and in the end weren’t as effective. While other builds aim to be Spell-proof against casters, this build takes aim at casters in a different way—if they can’t cast a spell, you are, in effect, spell proof.  <br/>\n <br/>\nAdditionally, in my original prototype I took all Monk levels in Epic in order to preserve 1 BAB (15 vs 14).  I think it’s just the warrior streak in me that makes me that way, but as I considered it more during playtesting, I moved 2 Monk levels to pre-epic.  While I lost 1 BAB (<em>Disclaimer, this is not a melee build so there is little value in a BAB point</em>), I gained +3 to saves to boost his sluggish Reflex and Fort, as well as getting more mileage out of Evasion, Monk Wisdom AC, Monk attack schedule and Deflect Arrow.  <br/>\n <br/>\nOn a side note, the Vicar does receive 4 Stunning Fists a day whose DCs are, when Wisdom is maxed, 49.  However Stunning Fist has been nerfed in EE (1 Round duration) and using this ability in the above build is highly situational and not recommended for home use. But it’s there if you like to play with your prey.<br/>\n <br/>\nRegarding Domains, if you are in an environment where perma-haste is easily or even moderately accessible, the Travel Domain is superfluous.  In that case I would suggest Animal (<em>for Empowered Cat’s Grace and Improved Summons</em>), or Magic Domain for bonus spell slots from 1<sup>st</sup> through 5<sup>th</sup> <em>(and the Stoneskin is nice too!</em>) , or Knowledge for bonus spell slots 1<sup>st</sup>-4<sup>th</sup> and 6<sup>th</sup>.  If anyone wants to try this but you are limited by Domains and Racial choices, just let me know and I can rework a custom version.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:08 AM - Jan 26, 2020",
      "content": "<div>Awesome idea GDL, I cannot recall anyone else doing such a build, so this is great to read.<br/>\n<br/>\nI am curious about the choice of ranger.<br/>\nI take it was for the bonus feat for GSF: Evocation, plus the ability to dump into detect etc<br/>\n<br/>\nI think if you are prepared to drop that bonus feat, then rogue or assassin would provide more, particularly with UMD.<br/>\nThis includes Mords, Time Stop scrolls, as well as wands of Lesser Spell Breach if you have access to this. <br/>\nThe small amount of sneak attack combined with the high AB boosts of cleric and high number of attacks from Range or Monk UBAB is helpful as well particularly with lots of summons at your disposal.<br/>\nCleric 35 / Monk 3 / Rogue 2 (or Assassin 2) split if you want to keep the monk speed, or Cleric 35 / Monk 2 / Rogue or Assassin 3 to drop the monk speed for 2d6 sneak attack combined with 8 APR.<br/>\nAssassin 2 (compared with rogue 3) gets uncanny dodge but requires investment into hide/move silently and one to be evil. <br/>\nI like a Cleric 35 / Monk 3 / Rogue 2 or Assassin 2 split personally.<br/>\n<br/>\nThat's the only tweak I would suggest.<br/>\n<br/>\nI am curious about the Greater Sanctuary and Set Trap interaction by the way. If one sets a trap under such said mage's feet with Greater Sanctuary active, say a nice juicy deadly electrical trap, does the trap going off break Greater Sanctuary? Food for thought. Something I might play test in the future.</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "10:21 AM - Jan 26, 2020",
      "content": "<div>No UMD in this one, Orion, nice try though.  In a more Alchemist Gnome variation then maybe, but that's going to be a different build.  At some point I need to wean you from your UMD addiction.  The 1 Ranger level was just to nab Epic Spell Focus for Evo (it feels like cheating) at the cost of just one level investment (the skill set didn't play a part other than icing).  While UMD is nice in any build, it is not needed with a caster cleric.  If one drops Ranger, then one has to give up a Great Wisdom Feat (in order to grab Epic Spell Focus), which ultimately means two Great Wisdoms since an odd number has little value.  36 Wisdom was a must in this one ( I really wanted 38, the absolute max, but I was just a wee bit shy).</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:39 AM - Jan 26, 2020",
      "content": "<div>Thanks GDL. UMD is simply awesome, definite is much closer to cheating than that single ranger level you took for the bonus feat! :) <br/>\n<br/>\nYou are right of course, you have so much in your toolkit to deal with all sorts of problems without UMD in the build. I always look for more power I guess... :)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:15 PM - Jan 26, 2020",
      "content": "<div>Speaking as a non-caster, I'm hugely impressed with this one. She's a very clever and different take on being a mage-killer, who knows her job and just gets on with it without distraction but with a tight focus. As with many of the great builds, when you see it, it looks simple and graceful, but it's definitely not one you can just stumble across by accident.<br/>\n<br/>\nAnother feather in the Grizzled One's cap! (It could make the rest of us mere mortals despair at times)<br/>\n<br/>\nEDIT: For those not on WoG, would you recommend Maximize Spell instead of Craft Wand ('cause that feat seems almost mandatory there)?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "5:41 AM - Jan 27, 2020",
      "content": "<div><blockquote><div><cite>Stagmeister wrote: <div class=\"responsive-hide\">Jan 26, 2020</div></cite>\nEDIT: For those not on WoG, would you recommend Maximize Spell instead of Craft Wand ('cause that feat seems almost mandatory there)?</div></blockquote>\nwell, Craft Wand is not mandatory, it's just one of my personal preferences.  And it's not just WoG, but a number of environments it comes in handy.  It helps with spell book management.  For instance, I don't need to take up 3rd level spell slots with Protection from Elements when I can craft a wand of it and quick slot and cast it at my leisure, and then use that spell slot with something more pressing (like a Prayer or something).  However, if you were to substitute it, then Maximize is not a bad way to go.  You could Maximize Hammer of the Gods for 40 points of Divine Damage with a high DC per whack.  These would occupy 7th level spell slots which is perfect landing spot since 7th level spells are a wee bit lackluster.  There's not much else I would Maximize, though.  For instance, you don't want to Maximize Blade Barriers because that would take up Implosion slots.  Another substitute could be Toughness for a little extra cushion, or Blindfighting in the event you find yourself in melee more often than you care to be.<br/>\n<br/>\nOn a different note, I was never happy with the title, \"Muzzlemancer\".  If anyone has any better ideas I'm game.  I tinkered with things like Hell's Ventriloquist, The Voiceless Vicar, and the Vicar of the Void (and the Voidmancer), but that sounded to undeadish.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:04 AM - Jan 27, 2020",
      "content": "<div><blockquote><div><cite>grizzled_dwarflord wrote: <div class=\"responsive-hide\">Jan 27, 2020</div></cite>On a different note, I was never happy with the title, \"Muzzlemancer\".  If anyone has any better ideas I'm game.  I tinkered with things like Hell's Ventriloquist, The Voiceless Vicar, and the Vicar of the Void (and the Voidmancer), but that sounded to undeadish.</div></blockquote>\nHere are some ideas (some not serious):<br/>\nThe Silencer<br/>\nThe Mage Muffler<br/>\nSilent Death<br/>\nShhhh!<br/>\nOrder of the Mime</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:50 AM - Jan 27, 2020",
      "content": "<div>How about Ecclesiarch of Umbra?<br/>\n<br/>\nUmbral Voidmaster?  Voidmancer?<br/>\n<br/>\nUmbral Voidmancer.  I kind of like that.<br/>\n<br/>\nThe Umbral Silencer<br/>\n<br/>\nThe Umbramancer.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:48 AM - Jan 27, 2020",
      "content": "<div><a class=\"postlink\" href=\"https://en.wikipedia.org/wiki/Cone_of_Silence_%28Get_Smart%29\" rel=\"noreferrer\" target=\"_blank\">The Cone of Silence</a><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_7ed32ca78dae77eb809c949ac1a1afcd.jpg\"/></div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "9:13 AM - Jan 27, 2020",
      "content": "<div><em class=\"mention\">@Empyre65</em> , the Mage Muffler is good stuff.<br/>\n<em class=\"mention\">@webshaman1</em> , I had some Voidmancer ones in the original, but I dropped it.  It's a WoW class, I think, and has a lot of undead overtones.  Probably better reserved for a Cleric PM.  Wasn't Umbra a shifter dragon from Forgotten Realms, or am I misremembering?  <br/>\n<em class=\"mention\">@Orion2019</em> , the Cone of Silence reminds me of my other one I had discarded, the Sounds of Silence, and Silence is Golden, and Silent Knight, Holy Night.<br/>\n<br/>\nWhat about Murderess of Echoes?</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:26 AM - Jan 27, 2020",
      "content": "<div>@grizzled_dwarflord , and my ECB colleagues, in conundrums like these, I utilise searching for synonyms for the terms I wish to describe (for example if you like The Mage Muffler, then Synonyms for Mage and Synonyms for Muffler) and pick what feels right.<br/>\n<br/>\nSometimes other languages provide inspiration, particularly Latin. I have a Gladio Princeps In-Exilium build waiting in the wings to be posted one day, when I am ready, which to be sounds like a cool name but I want to work a bit more on the substance of such a build.<br/>\n<br/>\nAnyway I should put a serious suggestion down: maybe the Soundless Arcane Silencer?<br/>\n<br/>\nor Ordo Silentium.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:15 AM - Jan 27, 2020",
      "content": "<div><blockquote><div><cite>grizzled_dwarflord wrote: <div class=\"responsive-hide\">Jan 27, 2020</div></cite><blockquote><div><cite>Stagmeister wrote: <div class=\"responsive-hide\">Jan 26, 2020</div></cite>\nEDIT: For those not on WoG, would you recommend Maximize Spell instead of Craft Wand ('cause that feat seems almost mandatory there)?</div></blockquote>\nwell, Craft Wand is not mandatory, it's just one of my personal preferences.  And it's not just WoG, but a number of environments it comes in handy.  It helps with spell book management.  For instance, I don't need to take up 3rd level spell slots with Protection from Elements when I can craft a wand of it and quick slot and cast it at my leisure, and then use that spell slot with something more pressing (like a Prayer or something).  However, if you were to substitute it, then Maximize is not a bad way to go.  You could Maximize Hammer of the Gods for 40 points of Divine Damage with a high DC per whack.  These would occupy 7th level spell slots which is perfect landing spot since 7th level spells are a wee bit lackluster.  There's not much else I would Maximize, though.  For instance, you don't want to Maximize Blade Barriers because that would take up Implosion slots.  Another substitute could be Toughness for a little extra cushion, or Blindfighting in the event you find yourself in melee more often than you care to be.<br/>\n<br/>\nOn a different note, I was never happy with the title, \"Muzzlemancer\".  If anyone has any better ideas I'm game.  I tinkered with things like Hell's Ventriloquist, The Voiceless Vicar, and the Vicar of the Void (and the Voidmancer), but that sounded to undeadish.</div></blockquote>\nThanks for the explanation, Dwarflord - it's appreciated.<br/>\n<br/>\nAs to names: you could go all romantic poet with \"In Silence and Tears\" (Byron); or more churchy and hymny with \"Still Small Voice of Calm\" (from \"Dear Lord and Father of Mankind\"); or philosophical with \"(in silence,) the Voice of God\" (Soren Kierkegaard); or '80s pop with \"World, Shut Your Mouth\" (The Teardrop Explodes); or a horror movie misquote - \"The Silence of the Damned\"; or Shakespearean with \"The Rest is Silence\". Then there's always \"The Silence of the Grave\" (can't remember who first came up with that one). And maybe the Order could be the Order of the Unspoken Word.<br/>\n<br/>\nJust a few musings</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "1:39 PM - Jan 27, 2020",
      "content": "<div><blockquote><div><cite>grizzled_dwarflord wrote: <div class=\"responsive-hide\">Jan 27, 2020</div></cite> and Silence is Golden</div></blockquote>\nEvery time I hear that I remember...<br/>\n<br/>\nSilence is Golden.... Duct Tape is Silver...</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:10 PM - Jan 27, 2020",
      "content": "<div>And of course...<br/>\n<br/>\nThe Sisters of Silence</div>"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "3:10 PM - Jan 27, 2020",
      "content": "<div>The Last Word could be a cool epithet <br/>\n<br/>\nSent from my SM-G955U using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "4:32 PM - Jan 27, 2020",
      "content": "<div>I really like this build idea!<br/>\nUsing Silence to shut up mages is an old trick, but doing it with a silent spellcaster is new to me.<br/>\nAs for names, I like the \"Voiceless Vicar\" and \"Vicar of the Void\" from the original post.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:34 PM - Jan 27, 2020",
      "content": "<div>How about Umbral Voideka?<br/>\n<br/>\nVoideka Vicar?<br/>\n<br/>\nThe silent destroyer of Mages.<br/>\n<br/>\nShe hears the Silence.<br/>\nShe sees the Darkness.<br/>\n<br/>\nShe is the only one who can oppose the Arcane!<br/>\n<br/>\nShe is...a force of one!</div>"
    },
    {
      "author": "Knight_oflimbo",
      "avatar": "no_avatar.png",
      "timestamp": "9:14 PM - Jan 28, 2020",
      "content": "<div>This is the reason why raine/wise put a scroll of greater Sanct on every boss in WoG.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:14 PM - Jan 28, 2020",
      "content": "<div><blockquote><div><cite>Knight_oflimbo wrote: <div class=\"responsive-hide\">Jan 28, 2020</div></cite>This is the reason why raine/wise put a scroll of greater Sanct on every boss in WoG.</div></blockquote>\nOh heck. Talk about advance planning.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:04 AM - Jan 29, 2020",
      "content": "<div>Hmmm...so with the rules governing AoE dispels, one could blow that sucker right....off!<br/>\n<br/>\nIntriguing!</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:26 AM - Jan 29, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Jan 29, 2020</div></cite>Hmmm...so with the rules governing AoE dispels, one could blow that sucker right....off!<br/>\n<br/>\nIntriguing!</div></blockquote>\nI believe that is correct, a Greater Dispelling or Mord's AoE spell could attempt to strip two of the most powerful spell defences on the creature.<br/>\n<br/>\nA Greater Sanctuary scroll has a caster level of 18.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "1:34 AM - Jan 29, 2020",
      "content": "<div>An AoE Mords will breach Greater Sanctuary (unless the breach list is modified on WoG), the difficulty is in detecting GSanced creatures. If the bosses cast GSanc and then remain stationary then it shouldn't be a problem.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:45 AM - Jan 29, 2020",
      "content": "<div>Well now, there are ways and there are ways...to detect what is undetectable!<br/>\n<br/>\nAs Vasquez said \"I just need to know <strong>WHERE. THEY. ARE!</strong>\"<br/>\n<br/>\nOf course, that will probably start the arms race *sigh*  <br/>\n<br/>\nMoar Greater Sanctuary scrolls for...Bosses!<br/>\n<br/>\nHmmm...ok, the Caster level on the Scroll is 18.  Check.<br/>\n<blockquote><div>For an area of effect, the effect's creator and creatures possessed by Dungeon Masters (and Dungeon Masters themselves) automatically succeed in dispelling it. <em>All others make the equivalent of the following check <br/>\n</em><br/>\n<strong>Dispeller's caster level + dispeller's ability modifier + bonus  vs.  2 * (creator's ability modifier) + 20 + d100</strong><br/>\n<br/>\nThe bonus is \n<ul>\n<li>25 for <em>lesser dispel</em>,</li>\n<li>50 for <em>dispel magic</em>,</li>\n<li>75 for <em>greater dispelling</em>,</li>\n<li>100 for <em>Mordenkainen's disjunction</em>, and</li>\n<li>an additional 30 if the dispeller is a non-player character. </li>\n</ul>\n</div></blockquote>\n\nSo a Cleric of level 35 who casts Greater Dispelling as an AoE would have 35+27 (full +12 wis)+75 (137) vs 2x18+20+d100=57~156<br/>\n<br/>\nWhat is that, about a 80% chance?<br/>\n<br/>\nThat is not bad!</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:02 AM - Jan 29, 2020",
      "content": "<div>Just be mindful Web, that <em class=\"mention\">@MrZork</em>  informed me maybe 6 months ago the AoE dispel effect formula only applies to AoE spells such as grease, web, stonehold etc.<br/>\nThe standard formula I understand will work when attempting to strip individual buffs from enemies such as a greater sanctuary spell with an dispel cast in an AoE.<br/>\n<br/>\nA greater sanc scroll (CL18) could be dispeled by a cleric with AoE greater dispelling with a CL 15+ but it has a less than 50/50 chance and it only strips one buff at a time, meaning quite a few greater dispellings would have be cast<br/>\n<br/>\nMords cast in an AoE should be able to do the job more efficiently, if I am reading this correctly with 2 buffs removed at a time. <br/>\n<br/>\nGreater sanctuary is on the list of spells that can be breached I presume this effect is in place with AoE Mords?</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "4:49 AM - Jan 29, 2020",
      "content": "<div>Yes, in vanilla NWN AoE Mords breaches 2 spells without any saves or dice rolls. There are some spells above GSanc in breach priority, but if that's the only buff the creature has then it will be breached.<br/>\n<br/>\nAs a cleric there are multiple ways to detect GSanced creatures, the main two being auras and AoE spells. If they have SR you will see a message whenever they enter your Silence aura, if they don't have SR then the save roll from a Battletide aura will let you detect them instead.</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "6:40 AM - Jan 30, 2020",
      "content": "<div><blockquote><div><cite>Knight_oflimbo wrote: <div class=\"responsive-hide\">Jan 28, 2020</div></cite>This is the reason why raine/wise put a scroll of greater Sanct on every boss in WoG.</div></blockquote>\nI didn't build this with WoG in mind but rather all environments in general.  Indeed, the domain combination I have listed isn't even possible on WoG.  I believe the only races that can access both Trickery and Travel on WoG are halflings, elves, and the occasional half-elven bastard.<br/>\n<br/>\nBut there are ways to deal with any NPC who goes Greater Sanc on you before you can target them.  Just drop down some Empowered (and Silenced) Blade Barriers in the area you think they are.  Blade Barriers will ignore Greater Sanc.  There is also the Greater Dispel option targeting the area in question, or just pull out a Summons and go into Greater Sanc yourself.  Unless your opponent has more Cleric levels than you (unlikely), you can wait them out. </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:20 PM - Jan 30, 2020",
      "content": "<div>Is Mr.Zork right here?<br/>\n<blockquote><div>but if used as an area of effect, then it will attempt to remove all spells with an overlapping area of effect as <em><strong>well as one or two effects from each creature in the area</strong></em>. </div></blockquote>\n\nBecause what he says doesn't seem to be correct, according to the NWN Wiki.<br/>\n<br/>\nOr have they changed Dispel AoE on WoG?  I don't notice it as one of the spell changes mentioned.<br/>\n<br/>\nI suppose the only way to really test it would be to have a level 40 or so Spellcaster try to Dispel an effect on a Spellcaster of level 24 - because that should not be possible according to Mr.Zork.  If the AoE Dispel does strip it off, that would support what the wiki is saying.<br/>\n<br/>\nPerhaps he is referencing this?<br/>\n<blockquote><div>For an area of effect, the effect's creator</div></blockquote>\n\nThat may be what the issue is - for AoE from a Creator (re: opponent).  That would make more sense, I guess.</div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "11:53 PM - Feb 07, 2020",
      "content": "<div><blockquote><div>Once inside his Web of Silence, the enemy caster is helpless for he will not get a save against the Silence.  <strong>Globes are of no avail</strong>.  </div></blockquote>\nJust checking what this means. For sure, a (Minor) Globe of Invulnerability provides immunity against Silence, just as it does for any spell of low enough level that checks spell resistance. Silence is already enough of an exploit without granting it immunity to magic immunity!  ;-)</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "12:31 AM - Feb 08, 2020",
      "content": "<div>This build doesn't have UMD and so it can't use breach scrolls/wands, but Ethereal Visage, Minor Globe Of Invulnerability, Globe Of Invulnerability, and mantles can all be breached in vanilla NWN. Greater Shadow Conjuration: Minor Globe Of Invulnerability is the only way to deal with Silence that can't be breached.<br/>\n<br/>\nIt is also possible to make Silence affect monsters that have Level 9 Spell Immunity or bypass mantles, but that involves an exploit so it doesn't really count.</div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "1:54 AM - Feb 08, 2020",
      "content": "<div>True enough. But, there's always a wand of Minor Globe... ;-)<br/>\n<br/>\nBTW, is that exploit still active? I thought that was on Beamdog's fix list. Maybe I am thinking of CPP...<br/>\n<br/>\nAnyway, at the point that you have epic spells, there are usually other ways to deal with the NPC casters with ≤ level 9 spell immunity (at least the standard ones).</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "1:31 AM - Feb 09, 2020",
      "content": "<div>It still works, guess they haven't got around to it yet.</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "4:50 AM - Feb 09, 2020",
      "content": "<div><blockquote><div><cite>MrZork wrote: <div class=\"responsive-hide\">Feb 07, 2020</div></cite><blockquote><div>Once inside his Web of Silence, the enemy caster is helpless for he will not get a save against the Silence.  <strong>Globes are of no avail</strong>.  </div></blockquote>\nJust checking what this means. For sure, a (Minor) Globe of Invulnerability provides immunity against Silence, just as it does for any spell of low enough level that checks spell resistance. Silence is already enough of an exploit without granting it immunity to magic immunity!  ;-)</div></blockquote>\nI stand corrected.  Mr. Zork is correct.  I based my calculations from an older Wiki article that was never updated I suppose.  So Globes do offer some protection against Silence.  I've tested this offline in a basic EE PvE setting (PGCC EE version).  However, in PvE I highly doubt most casters are going to be throwing up Globes of Invulnerability from the get go.  In PvP that's a different story.<br/>\n<br/>\nSo to summarize, Globes (and Minor ones) do offer protection.  Spell Resistance offers protection up to a point, it just depends on the caster level of the Resistor vs the Vicar.  With 35 levels of cleric you'll win most run-of-the-mill versions.  Spell Mantles offer protection up to a point but these can be quickly chewed apart.<br/>\n<br/>\nIt goes without saying that the other protection is for casters to have prepared Silent spells and/or the Auto Silent line of feats.<br/>\n<br/>\nI've been running a halfling version of the Vicar on one of my favorite PWs and she has dominated casters.  With a high AC and 50% concealment she has the freedom to not worry too much about the mobs and press her attack hand to face with the caster(s) in question.  With Silent Aura active the enemy caster might get a spell off (typically a timestop or some such nonsense followed by a buff and summons), but once they're inside the Web of Silence, it's lights out.  They typically don't have a protection up that will grant them protection against an Implosion sporting 40+ DCs.    <br/>\n<br/>\nA couple people suggested that the build lacks UMD but I have yet to miss it.  Still, I'm considering an alternate version that takes 2 Monk Levels and 3 Rogue levels.  I still feel the 35 caster levels are non-negotiable.  In such a version the Wisdom score will have to be knocked down 2 points.  </div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "6:38 AM - Feb 09, 2020",
      "content": "<div>Here is a Hin Rogue variant.  The difference between this and the original:\n<ul>\n<li>Melee AB +1 increase</li>\n<li>Ranged AB +1 Increase</li>\n<li>Reflex Save +1 increase</li>\n<li>Saves vs. Spells +1 overall increase</li>\n<li>UMD</li>\n<li>Open Lock, Disable Trap and Search</li>\n<li>Uncanny Dodge</li>\n<li>2d6 sneak dice</li>\n<li>+3 AC (arguably the nicest pick-up)</li>\n</ul>\n<span style=\"text-decoration:underline\">What it loses:</span>\n<ul>\n<li>1 DC on all spells</li>\n<li>1 1st, 1 5th, and 1 9th level spell slot -- that's a Divine Favor, a Haste, and an Implosion</li>\n<li>Monk speed and Still Mind</li>\n</ul>\n\nMy 2 cents:  I prefer the original because I enjoy to concentrate all the raw power into Cleric casting.  However, this one certainly has its merits.  It certainly is a party of one.<br/>\n<br/>\n<strong>Title: The Vicar of the Void (<em>Rogue Hin Variant</em>)</strong>\n<ul>\n<li>AKA: <em>The Last Word, Voiceless Vicar, and the Arcane Silencer</em></li>\n<li>Classes: Cleric35/Monk2/Rogue3</li>\n<li>Race: Halfling (<em>Half-Elf,</em> <em>Gnome is a good substitute, but Human works best</em>)</li>\n<li>Alignment: Any Lawful</li>\n<li>XP Penalty: None (<em>as human or half-elf</em>)</li>\n<li>Playable: 1-40, all Settings, all Environments</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Attributes</span></strong><br/>\nStr10<br/>\nInt14<br/>\nWis18 (34)<br/>\nDex12<br/>\nCon10<br/>\nChr8<br/>\n <br/>\n<strong>Major Domain</strong>: <em>Travel</em><br/>\n<strong>Minor Domain</strong>: <em>Trickery</em><br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Level Guide</span></strong><br/>\n1 Cleric 1, Extend Spell<br/>\n2 Monk 1 (<em>Evasion, Cleave</em>)<br/>\n3 Cleric 2, Silent Spell<br/>\n4 Cleric 3, Wis19<br/>\n5 Cleric 4<br/>\n6 Cleric 5, Zen Archery<br/>\n7 Cleric 6<br/>\n8 Cleric 7, Wis20<br/>\n9 Cleric 8, Craft Wand (<em>5 into Craft Weapon skill</em>)<br/>\n10 Cleric 9<br/>\n11 Cleric 10<br/>\n12 Cleric 11, Empower Spell, Wis21<br/>\n13 Cleric 12<br/>\n14 Cleric 13<br/>\n15 Cleric 14, Spell Focus: Evocation<br/>\n16 Cleric 15, Wis22<br/>\n17 Monk 2, (<em>Deflect Arrow</em>)<br/>\n18 Cleric 16, Greater Spell Focus: Evocation<br/>\n19 Cleric 17<br/>\n20 Cleric 18, Wis23<br/>\n21 Cleric 19, (<em>Spell Craft to 24</em>), Auto Silent I<br/>\n22 Cleric 20<br/>\n23 Cleric 21<br/>\n24 Cleric 22, Auto Silent II, Wis24<br/>\n25 Cleric 23, Auto Silent III<br/>\n26 Cleric 24<br/>\n27 Rogue 1, Epic Skill Focus: Concentration<br/>\n28 Cleric 25, Wis25<br/>\n29 Cleric 26, Epic Spell Focus: Evocation<br/>\n30 Cleric 27, Great Wis I<br/>\n31 Cleric 28<br/>\n32 Rogue 2, Wis27<br/>\n33 Cleric 29, Great Wis II, Great Wis III<br/>\n34 Cleric 30<br/>\n35 Cleric 31<br/>\n36 Cleric 32, Great Wis IV, Great Wis V, Wis32<br/>\n37 Rogue 3<br/>\n38 Cleric 33<br/>\n39 Cleric 34, Great Wisdom VI<br/>\n40 Cleric 35, Armor Skin, Wis 34<br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Combat Vitals</span></strong><br/>\nMelee BAB: 25/22/19/16/13 (<em>kama</em>)<br/>\nRanged BAB: 38/33/28<br/>\nFully Buffed Melee: 51/48/45/42/39/51/46*<br/>\nFully Buffed Ranged: 64/59/53/64/59 (<em>with Haste/Divine Power</em>)<br/>\nAC: 34 (naked and unbuffed)<br/>\nHP: 314<br/>\nSpell Resistance: 37 (via spell)\n<ul>\n<li>*<em>Note: The buffed melee attack schedule above is with a Kama, with 7 attacks per round. The above record is the true schedule taken from in-game combat logs and is not reflected on the character sheet (which will only show 5 attacks) and combines Monk Attack Schedule, Haste, Divine Power. One can gain 8 attacks by activating Flurry of Blows</em></li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Evocation DCs:</span></strong>\n<ul>\n<li>Hammers: 32 (38)</li>\n<li>Empowered Blade Barriers: 34 (40)</li>\n<li>Implosions: 40 (46)</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Skill Set: 225*</span></strong><br/>\nConcentration: 43 (58)<br/>\nOpen Lock: 1 (3) (20 with Divine Trickery)<br/>\nDisable Trap: 5 (7) (25 with Divine Trickery)<br/>\nSet Trap: 1 (4)<br/>\nTumble: 40<br/>\nSpellcraft: 43 (45)<br/>\nSpot: 15 (35 with +12 Wisdom and Divine Trickery)<br/>\nListen: 5 (25 with +12 Wisdom and Divine Trickery)<br/>\nSearch: 5 (7) (24 with Divine Trickery)<br/>\nHeal: 1 (13)<br/>\nCraft Weapon: 5 (7)<br/>\nUMD: 30 (29)<br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Saving Throws</span></strong><br/>\nFort:    25 (34)<br/>\nReflex: 21 (30)<br/>\nWill:     37 (46)<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Base Spell Slots:</span></strong><br/>\n1<sup>st</sup>:  9<br/>\n2<sup>nd</sup>: 9<br/>\n3<sup>rd:  </sup>9<br/>\n4<sup>th:  </sup>9<br/>\n5<sup>th:  </sup>8<br/>\n6<sup>th: </sup>7<br/>\n7<sup>th:   </sup>7<br/>\n8<sup>th:  </sup>7<br/>\n9<sup>th:  </sup>6</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:04 AM - Feb 09, 2020",
      "content": "<div>3 Monk / 2 Assassin should get you there without dropping the monk speed and still mind. <br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "10:15 AM - Feb 09, 2020",
      "content": "<div><blockquote><div><cite>Zanithar wrote: <div class=\"responsive-hide\">Feb 09, 2020</div></cite>3 Monk / 2 Assassin should get you there without dropping the monk speed and still mind. <br/>\nSent from my iPhone using Tapatalk</div></blockquote>\nYes, that is a good alternative if one is not averse to being boxed into an Evil alignment.  </div>"
    },
    {
      "author": "Arkanis Gath",
      "avatar": "10759592_1664210509.jpg",
      "timestamp": "7:33 PM - Aug 21, 2023",
      "content": "<div>Probably a silly question but: Why not taking Protection domain? It offers minor globe of invulnerability wich can be used to exploit silence from the beginning? Casting Minor globe and then silence should work wonderfully, or viceversa (at least on vanilla). It makes you casting from your aura of silence without metamagic. </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:57 PM - Aug 21, 2023",
      "content": "<div>I don't know much about clerics, but I seem to recall that Minor Globe requires both a somatic and verbal element, which would render it useless if you're travelling around in silence. Also - and this is minor, I think, you can't use Craft Wand with Protection. Also, which current domain, with its incumbent benefits, would you lose?<br/>\n<br/>\nI will put up disclaimers about this, due to lack of cleric experience.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "10:46 PM - Aug 21, 2023",
      "content": "<div><blockquote><div><cite>Stagmeister wrote: <div class=\"responsive-hide\">Aug 21, 2023</div></cite>I don't know much about clerics, but I seem to recall that Minor Globe requires both a somatic and verbal element, which would render it useless if you're travelling around in silence. Also - and this is minor, I think, you can't use Craft Wand with Protection. Also, which current domain, with its incumbent benefits, would you lose?<br/>\n<br/>\nI will put up disclaimers about this, due to lack of cleric experience.</div></blockquote>\nIf you cast minor Globe before, the aura of silence is kept, but your toon is not silencied : <a class=\"postlink\" href=\"https://www.nwnworkshop.org/forums/topic/a-guide-to-nwns-silence-spell-for-new-and-advanced-players/\" rel=\"noreferrer\" target=\"_blank\">https://www.nwnworkshop.org/forums/topi ... d-players/</a></div>"
    },
    {
      "author": "Arkanis Gath",
      "avatar": "10759592_1664210509.jpg",
      "timestamp": "7:29 PM - Aug 22, 2023",
      "content": "<div><blockquote><div><cite>Stagmeister wrote: <div class=\"responsive-hide\">Aug 21, 2023</div></cite>I don't know much about clerics, but I seem to recall that Minor Globe requires both a somatic and verbal element, which would render it useless if you're travelling around in silence. Also - and this is minor, I think, you can't use Craft Wand with Protection. Also, which current domain, with its incumbent benefits, would you lose?<br/>\n<br/>\nI will put up disclaimers about this, due to lack of cleric experience.</div></blockquote>\nThe game let you cast Minor globe and then Silence creating an aura around you, but you are immune inside of it (Idk if in PnP was legal to do so). Viceversa you can cast Silence and then a silent Globe (yep, using metamagic ).<br/>\nI would lose travel domain if Perma-haste is permitted, otherwise probably Trickery, but I grant you it's a painful pedigree.<br/>\nI love the fact that this build have 3 levels of monk for Monk's speed becouse you can chase (in silence) superfast enemies, but for the same reason i hate that this build doesn't have \"Use magic device\" to cast Expeditious retreat, or Mass Haste from scrolls</div>"
    },
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "8:47 PM - Aug 25, 2023",
      "content": "<div>A variation with the New (Uber cheesy) option to use more than 3 classes. With two spell School Epic spécialisation and full umd :<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/5c-keeper-of-death-secrets-another-silencer-cleric-t2356137.html\" rel=\"noreferrer\" target=\"_blank\">5c-keeper-of-death-secrets-another-sile ... 56137.html</a></div>"
    }
  ]
}