{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Rules and Tools",
  "forum_id": "000",
  "id": "011",
  "name": "Question: reposting of builds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/question-reposting-of-builds-t515400.html",
  "author": "AnnoyingPony",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "1.2K",
  "posts": [
    {
      "author": "AnnoyingPony",
      "avatar": "no_avatar.png",
      "timestamp": "6:15 AM - Aug 09, 2011",
      "content": "<div>Can I repost builds that disappeared when Bioware took down the NWN site? I have a couple in a folder somewhere...</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:38 PM - Aug 09, 2011",
      "content": "<div>I would wait until our illustrious admin checks in, but I can at least venture an opinion that may coincidently reflect Kail's sentiments.<br/>\n<br/>\nThere are three categories of legacy builds that we can consider to re-post.<br/>\n<br/>\nIf they are non-40 builds, those are actually still archived by TK <a class=\"postlink\" href=\"http://nwvault.ign.com/View.php?view=Other.Detail&amp;id=1468\" rel=\"noreferrer\" target=\"_blank\">here</a> and an easy download to grab.  As with the ability to search those builds, well, they never were able to be searched (not with a class split search engine anyway) and I haven't read about any plans to modify the current WoG search engine to find those builds.  So, if those you saved are in that list, there is little to be gleaned unless there are some which you really would like analyzed further by the guild, but state your specific concerns about the build if/when you decide to do that, please.  Sometimes on the former ECB builds are further analyzed or tweaked to service one of servers that weren't in existence when it was submitted and discussed.  In that respect, at least, there would be value in giving the guild another glance at it.<br/>\n<br/>\nFor all the 40-level epic ones, the WoG search engine can find all of them.  TK took special care making sure to grab every build that was in place when the shut-down occurred.  Should you have a special interest to further discuss any of those builds, I suppose Kail wouldn't mind you re-posting them (again, wait for Kail to concur on this point), but it would require that the build be formatted properly according the current guidelines before re-displaying it in these forums.  Also, it will be difficult (and perhaps \"tedious\" is a better word) to include any of the former discussions which pertain to that build, containing points that have already been thoroughly evaluated.<br/>\n<br/>\nThe final category, which I actually would like to see posted if you saved any of those, are the epic builds that were built/posted by the Bioware folks that never were subject to the ECB either in format or by analysis.  Occasionally, those are referenced by others and have been made inaccessible since the legacy site was turned off. However, you may need to reformat those to allow easy evaluation, furnishing all the critical aspects of the build like the current submissions contain.  (Kamiryn's CBC can make this an easy task if you have Excel loaded on your machine.)<br/>\n<br/>\nAt the moment, the forum search doesn't seem to work very well (at least I haven't been able to decipher the secret formula to find builds yet  ) so visitors and guild members must scroll through all the builds to find those that interest them.  The list is relatively small now, but it will eventually become a chore like in the pre- and mid-epic builds of old.<br/>\n<br/>\nThat's my two centavos for what it's worth until Kail appears with his divine scepter.   Perhaps it may make your considerations easier to resolve.  And BTW... Welcome aboard, mate!</div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "6:53 PM - Aug 11, 2011",
      "content": "<div>Reposting one's own already published builds is of course allowed. I plan to repost my 1.69 legal builds or update them to 1.69 when possible for example and I wouldn't mind at all any old ECB guild member who's a member here too to do the same *coughs* Master Din *coughs* <br/>\n<br/>\nRegarding someone else's builds, I've been myself thinking about it. I'd say that if someone wants to repost BW featured epic builds, he's allowed to do that. Please give credit to the original author. I also encourage to take BW featured builds and revamp them (I did it with the Damage Adept in my <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build243505.html\" rel=\"noreferrer\" target=\"_blank\">Holy Reaper</a> build for example).<br/>\n<br/>\nRegarding ECB Guild builds by other authors, considering the current situation, I'm inclined to say to go ahead with reposting old builds of interest, possibly with a few personal tweaks, if the author seems to be a non active NWN user anymore (so leave alone the Dwarflord builds for the time being, for example). Credit to the original author (with links) is to be given, of course. Also, those poorly documented builds from the early stages of NWN and of the ECB Guild (I think we all can recognize them) can be reposted and improved in format/content. Again, credit is to be given where credit is due. <br/>\n<br/>\nPlease, anyone feel free to voice their take on the matter. Thanks in advance and thanks to the OP for bringing up the subject.</div>"
    }
  ]
}