{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "928",
  "name": "Ranged Spellcaster, probably Druid?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ranged-spellcaster-probably-druid-t2354946.html",
  "author": "fairouz33",
  "avatar": "10235276_1510287070.gif",
  "replies": 13,
  "posts": [
    {
      "author": "fairouz33",
      "avatar": "no_avatar.png",
      "timestamp": "10:34 AM - Oct 07, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hey guys, first post here. First off I just wanna say thanks for all the work. These builds and guides have been both very entertaining and helpful!<br/>\n<br/>\nI'm going to start my first SoU/HotU run soon, and I'm looking to build a ranged character. I'm leaning towards the druid. I've gathered mostly pure class levels are ideal for the caster classes. Druid seems to have a lot of good spells, but I'm wondering what the best dip options are for maximizing ranged to limit resting too much<br/>\n<br/>\nI've seen Cleric/Fighter x/4 builds for the BAB to get max attacks and Druid/monk varieties for shapeshifting wis bonuses, but haven't seen a straight D/F build. Is d/f x/4 good? or is there not much gained over a pure druid?<br/>\n<br/>\nI'm also open to ranger options. I like the idea of having a pet tank and healing it with feed pet.  <br/>\n<br/>\nInteresting ranged damage dealer builds?<br/>\n<br/>\nAlso are there any mods to remove pet or summons exp leeching?<br/>\n<br/>\nApologies if this has all been posted before. Thanks!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "6:32 PM - Oct 08, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Before the pros come to tell you the actual stuff, the best ranged spellcaster is probably a zen archer cleric. Look up Demolition Man in the lvl40 builds for a very good example.<br/>\nThe idea behind it is that Cleric allows you to \"cheat\" a lot when building a character. You can trash Str because Divine Power will set it at 18 if it's lower. You don't need to worry about BAB because of the same reason (DP sets it to max, and does it better than taking full BAB classes). You take zen archery and suddenly your casting stat is your attack stat too! You take a level of Monk, you now have Tumble and your casting and attack stat now adds to your AC! You can start with Str 8 Con 10 Cha 8 Wis 18 Int 14 Dex 14 (or trash Con too and go Dex 12 Int 16 for an extra maxed skill, or the other way around for +1 AC) and do fine. You can take almost all your levels as a Cleric and put every ability increase to Wis, getting very good attack scores and very good DC's on your spells that require a saving throw. Your Spell Resistance spell will give you very high SR because of all the Cleric levels, after a while, only breaches and mord's can get you. You have enough feats to be very good at your weapon of choice (WF, IC, EWF) and get the 3 spell focus feats in the school of your choice. Alternatively, you can forgo the weapon feats and get more metamagic. You'll still be an excellent shooter.<br/>\n<br/>\nA lot of clerical and druidic spells overlap. You won't be able to play with shapeshifting, but then again, bears, elementals and dragons are not too hot with a bow :) You do have summons, though, to help you out with the early levels, before your buffs start becoming strong.<br/>\n<br/>\nYou can fight with DP+DF, then Called Shot (leg) spam, or have fun with your awesome offensive spells (or both).<br/>\n<br/>\nSoU+HotU put you at ~ level 28 at the end, and they're easy, meaning you're pretty much free to experiment.<br/>\n<br/>\nEDIT: Oh, and if you decide to try this, read Maximillian Kane's guide to clerics in the appropriate section!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:10 PM - Oct 08, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>fairouz33 wrote:</cite>\n haven't seen a straight D/F build. Is d/f x/4 good? or is there not much gained over a pure druid?<br/>\n</div></blockquote>\nTake a look at Valerfor's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/green-knight-of-ehlonna-druid-28-ftr-4-cot-8-t2353943.html\" rel=\"noreferrer\" target=\"_blank\">Green Knight of Ehlonna</a> for a powerful Druid/Fighter. Not an archer, but powerful! Compare it with more traditional wisdom based Druid builds and see a completely different way to use the druid class.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:28 PM - Oct 08, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you want to make an archer, I can't see that Druid is worth the trouble. You get an animal companion and summoning spells that can serve as meat shields, and that's about it.  It is true that you can use wisdom as caster stat and archer stat, but like Mirnaia suggests, Cleric already does that better with the Divine Power and Divine Favor spells that add to AB and damage. <br/>\nThe most powerful archers are built with the Arcane Archer class. Max has built one with Cleric: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/sehanine-s-finest-cleric-15-bard-2-arcane-archer-2-t2182559.html\" rel=\"noreferrer\" target=\"_blank\"> Sehanine's finest</a>. Mind you it is not a Zen archer! (I believe you can avoid the xp penalty if you build it with Half-elf.)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "12:48 AM - Oct 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote:</cite>The most powerful archers are built with the Arcane Archer class. Max has built one with Cleric: <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/sehanine-s-finest-cleric-15-bard-2-arcane-archer-2-t2182559.html\" rel=\"noreferrer\" target=\"_blank\">Sehanine's finest</a>. Mind you it is not a Zen archer! (I believe you can avoid the xp penalty if you build it with Half-elf.)\n</div></blockquote>\n\nThat Cleric/AA build is awesome. However, it's not a caster, just a self-buffer, which is why I didn't recommend it. But it's really fun.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "fairouz33",
      "avatar": "no_avatar.png",
      "timestamp": "2:59 AM - Oct 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Damn I just played the OC with a cleric who was a better warrior than my warrior, and now it looks like I'll be playing another cleric who is a better ranger than a ranger lol.<br/>\n<br/>\ni think somebody shoulda realized \"oh hmm, i can cast all 20 of these buffs at once on myself and become god. this class might be overpowered.\" before the game got out the door lol. it seems kinda ridiculous to have like 4 buffs that all buff my AC and stack with each other. anyways i digress.<br/>\n<br/>\nThanks so much for the help guys! I'm looking through demo man, the green knight, and sehanine's now to see what seems like an interesting play through.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:56 AM - Oct 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Heed my advise and go play Aielund, you will have an interesting play through no matter what.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:11 AM - Oct 09, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If the Cleric / AA is too similar to what you just played, but you still want an archer, here is an archer I played in SoU, HotU, and the Sands of Fate series:\n<details><summary>Spoiler</summary>\nResourceful Archer 5b (Rogue 17 / Wizard 1 / Arcane Archer 22)\nPlayable 1 - 40, PvM\n\nSTR: 14\nCON: 12\nINT: 14\n\nElf: (Hardiness vs. Enchantments, Keen Sense, Low-light Vision, Skill Affinity: Listen, Skill Affinity: Search, Skill Affinity: Spot, Sleeplessness)\n02: Rogue(2): {Evasion}\n04: Rogue(4): DEX+1, (DEX=19)\n06: Rogue(6): Weapon Finesse\n08: Rogue(8): DEX+1, (DEX=20)\n10: Arcane Archer(1)\n12: Rogue(9): DEX+1, Improved Critical: Longbow, (DEX=21)\n14: Arcane Archer(4)\n16: Arcane Archer(6): DEX+1, (DEX=22)\n18: Arcane Archer(7): Called Shot\n20: Arcane Archer(9): DEX+1, (DEX=23)\n22: Arcane Archer(10)\n24: Arcane Archer(11): DEX+1, Great Dexterity I, (DEX=25)\n26: Arcane Archer(12)\n28: Arcane Archer(13): DEX+1, (DEX=26)\n30: Arcane Archer(15): Armor Skin\n32: Rogue(15): DEX+1, (DEX=28)\n34: Arcane Archer(18): Epic Prowess\n36: Arcane Archer(20): DEX+1, Great Dexterity IV, (DEX=31)\n38: Arcane Archer(21)\n40: Rogue(17): DEX+1, (DEX=34)\nStats:\nSkillpoints: 330\nSaving Throw bonuses: Spells: +2, Mind Effects: +2, Traps: +3\nAB (max, naked): 39 (melee), 53 (ranged)\nSpell Casting: Wizard(1)\n\nDisable Trap 43(47), Lore 43(45), Open Lock 43(55), Persuade 28(28), Search 43(47), Set Trap 5(19), Spellcraft 8(10), Spot 43(44), Tumble 40(52), UMD 40(40)\n01: Disable Trap(4), Lore(4), Open Lock(4), Persuade(4), Search(4), Set Trap(4), Spot(4), Tumble(4), UMD(4), Save(4)\n03: Disable Trap(1), Lore(1), Open Lock(1), Persuade(1), Search(1), Spot(1), Tumble(1), UMD(1), Save(7)\n05: Disable Trap(1), Lore(1), Open Lock(1), Persuade(1), Search(1), Spot(1), Tumble(1), UMD(1), Save(11)\n07: Disable Trap(1), Lore(1), Open Lock(1), Persuade(1), Search(1), Spot(1), Tumble(1), UMD(1), Save(15)\n09: Lore(1), Spellcraft(8), Save(12)\n11: Lore(1), Spot(1), Save(19)\n13: Lore(1), Spot(1), Save(7)\n15: Spot(1), Save(16)\n17: Disable Trap(5), Open Lock(5), Persuade(5), Search(5), Spot(1), Tumble(5), UMD(5)\n19: Spot(1), Save(6)\n21: Disable Trap(4), Open Lock(4), Search(4), Spot(1), Tumble(4), UMD(4)\n23: Disable Trap(2), Lore(1), Open Lock(2), Search(2), Spot(1), Tumble(2), UMD(1)\n25: Disable Trap(2), Lore(1), Open Lock(2), Search(2), Spot(1), Tumble(2), Save(4)\n27: Disable Trap(2), Lore(1), Open Lock(2), Search(2), Spot(1), Tumble(2), Save(8)\n29: Lore(1), Spot(1), Save(16)\n31: Lore(1), Spot(1), Save(24)\n33: Spot(1), Save(17)\n35: Spot(1), Save(27)\n37: Disable Trap(5), Open Lock(5), Search(5), Spot(1), Tumble(5), Save(21)\n39: Spot(1), Save(31)</details>\nSince you will be a Rogue, you can tell Dorna to level only as Cleric. She becomes quite powerful by the end, able to take on the end boss of SoU by herself, if you make sure she is as well-equipped as you are.<br/>\n<br/>\nYou might consider swapping when you take Rapid Shot and Improved Critical.<br/>\n<br/>\nI second that recommendation to also play the Aielund Saga. Everybody recommends it for good reason. It really is that good. There are several good builds for it in the Aielund Saga thread.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "fairouz33",
      "avatar": "no_avatar.png",
      "timestamp": "11:29 PM - Oct 17, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">OK quick update, in case anyone is looking for something similar and stumbles upon this thread. I did not end up trying Sehanine's Finest, simply because the first 15 levels are all cleric and I just played a cleric. I did try a few of the others posted here, and these were my findings.<br/>\n<br/>\nQuick Disclaimer  -- I only played these classes up til 15 or at 15<br/>\n<br/>\nMelee druids:<br/>\nthe Green Knight of Ehlonna -- at low levels it just seemed like playing a gimp druid or an ok fighter. Although I did just finish a melee self buffer cleric in the OC, so maybe my melee benchmark is skewed. But the animal companion goes from being pretty good to pretty wimpy. Spell progression is very limited in the lower levels. It plays like a decent fighter.<br/>\n<br/>\nI also tried druid/monk x/1 with a couple of variations. If you wait a while and take the monk level at 10 or later and save points for tumble, you can get like +8 ac and an extra attack per round in one fell swoop. It makes your bear form beastly. I think I had like 36-40 strength. This seems like a very optimized way to play a druid. Also not feat starved, feels pretty ok to take metamagic and melee feats within the 15 levels<br/>\n<br/>\nRanged characters:<br/>\nI did a plain jane druid with zen archery and focus on ranged feats. This was actually my favorite. The damage with archery was lower than the melee druid/monk, but it seemed more convenient. I didn't have to self buff as much, because I didn't end up taking as much damage. I could seamlessly switch between casting and sniping casters. It is a little feat starved to make it work, though. Ranged damage sucks until you get zen archery, and still isn't very good until like level 12. Once I had rapid shot, zen archery, improved critical, owl wisdom buff, and haste boots though it was respectable damage in a convenient format. I kinda feel like the dire wolf ends up being a better animal companion because of better scaling AC, and he seems to have better pathing than the bear? The melee druid can tank and use the bear more effectively for better damage though I think. I would like to figure out some way to improve on this build.<br/>\n<br/>\nI also tried the rogue/wizard/AA build that Empyre65 posted above, and it's a beast. The AA arrows + sneak attack is wonderful. Not really any spell casting, but called shot is kinda fun and the utility of the rogue is great with little to no self buffing. I surprised myself when I killed a dragon in like 6 seconds at one point with some lucky crit lol . I did not level this character up to 15, though. I just popped him in at 15 to a testing ground.<br/>\n<br/>\nThis build intrigued me so I rolled up a fighter/wizard/aa at 15 and he felt trash by comparison. The rogue version just seemed so much better. I didn't notice the improved BAB or damage from weapon spec or more AA levels that much on undead/constructs, but the lack of sneak attack was very noticeable on everything else.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "fairouz33",
      "avatar": "no_avatar.png",
      "timestamp": "10:45 PM - Oct 30, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In case anyone stumbles upon this and had similar questions to me, I wanted to follow up. First of all, I want to thank everyone for all the help, the really cool builds, and the Aielund recommendation. I have downloaded it and will probably start that next. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nI kinda feel that a lot of the builds on the site are optimized for max level play or for play on persistent worlds, etc. For actually leveling, I included my build that worked out for me to be more optimized and powerful within the HoTU module than the builds posted here that are probably technically more optimized and powerful in general. Also the build I ended up using is probably really simple compared to what is posted here, but it took me a long time to figure out what feats and skills were actually worthwhile in actual gameplay and how to organize it and when to get what, etc.<br/>\n<br/>\nSo my goal here is <br/>\n1. Damage dealing spells for AOE, druid has this in spades, <br/>\n2. ranged DPS for flexibly eliminating key targets while pet/henchmen hold the line and <br/>\n3. the flexibility to stomp anything in shapeshift form with a monk level.<br/>\n<br/>\nI wanted to include ranged DPS because I found shapeshifting as a druid was mildly cumbersome, even though it is very effective. My fat bear ass often precluded my pet or henchmen from pathing correctly into melee. Being in melee seems to necessitate more self buffing, which is especially obnoxious before permanent haste. You don't need a lot of defensive buffs when you're not really getting hit. This allowed me to use more slots for blowing things up. Lightning is just cooler. And shooting arrows between casting spells is a quicker transition than shifting and running in to melee.<br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Notes!<br/>\n<br/>\n</span><span style=\"text-decoration:underline\"><span style=\"text-decoration:underline\">Attributes</span></span><br/>\n</strong>I did 13 dex for rapid shot and 13 strength for mighty bows. Act 2 custom bow meant I could often kill single targets from range in 1-2 rounds.<strong><span style=\"text-decoration:underline\"><br/>\n<br/>\nFeats<br/>\n</span></strong>I structured this build with the cheesy goal of finishing the campaign in dragon form. It feels plenty powerful to level it that way. If I were not going to make it all the way to 30, I would honestly take more longbow stuff like improved critical and epic prowess and spell feats like spell focus evocation instead of the wisdom.<br/>\n<br/>\nSpell penetration as I understand is more level dependent than spell saves. Spell saves are helped by your massive wisdom score, thanks to owl's wisdom. That's why I went for penetrating spell resistance with feats. That said, spell focus: evocation would be an improvement for dealing with the pesky rogues or whoever has reflex saves. I would take this over great wisdom if you don't plan on making it to 30 for dragon. Reflex saves seem more common than spell resistance, but spell resistance seems more annoying when you do encounter it.<br/>\n<br/>\n<span style=\"text-decoration:underline\"><strong>Monk Level/Skills:<br/>\n</strong></span>I did monk at 12 for immediate gear availability starting HotU. You can move it to 17 for 1 extra point of tumble AC. You could also take an extra monk level in your 20's for 2-3 more tumble AC and the arrow defense, but it hardly seems necessary. /shrug<br/>\n<br/>\nI skipped monk in my SoU playthrough and took elf instead.<br/>\n<br/>\nI took lore and search for tedium reduction /slash/ quality of life.<br/>\n<br/>\n<strong><span style=\"text-decoration:underline\">Gear<br/>\n</span></strong>This build is also maximized for the available gear I found in HotU. You can get the monk haste robe, composite longbow, and gauntlets of ogre strength immediately. Otherwise you could take the monk level later at 17 and get another point of tumble AC. The fire berries are also early, and make the dire wolf hit hard enough to not miss the bear dps too much. Monk haste robe merges with shapeshift form. Haste boots and haste weapon do not. Monk haste robe actually leaves you with higher AC than the haste chain mail.<br/>\n<br/>\n<span style=\"text-decoration:underline\"><strong>Animal Companion</strong></span><br/>\nI chose the dire wolf for the scaling AC, and he tanks quite well. With magic fang &amp; fire berries, the wolf can solo a lot. I used a mod for henchman/pet management. The bear is also viable, I just found I had to heal him more often and he couldn't tank a whole room as well. Boujee standards, I know. I would rather have the wolf tank a whole room in a doorway while i mow it down with spells from behind than have the bear deal slightly more damage.<br/>\n<br/>\n<span style=\"text-decoration:underline\"><strong>Attributes</strong><br/>\n</span>I did 13 dex for rapid shot and 13 strength for mighty bows. Act 2 custom bow meant I could often kill single targets from range in 1-2 rounds.<br/>\n<br/>\n<br/>\n<span style=\"text-decoration:underline\"><strong>Comparison to Other Builds</strong></span><br/>\nWhile I loved the rogue/AA build that Empyre65 posted, this actually felt more powerful and flexible for my play through. I had more immunities, I had much better AoE, and I had the flexibility to tank and melee. The ranged DPS of the druid is not really that much less, especially on sneak/crit immune mobs. If I factor in pet melee, my regular auto attack DPS is comparable to the rogue/AA<br/>\n<br/>\nRogue/AA, ranger, fighter, and cleric/AA have more BAB, so they do get an extra attack over the druid. The buffed druid AB was comparable or higher, however, at some levels depending on gear due to owl's wisdom.<br/>\n<br/>\nWhile there is no cross class exp penalty with a human, there is unfortunately a big penalty to exp from using the summons that the druid class is based on using. This seems dumb when the cleric is more powerful in every way, but whatever. It's nice on modules that scale encounters up to your group size, but that does not appear to be the case for OC, SoU, or HotU.<br/>\n<br/>\n<br/>\n<details><summary>Spoiler</summary>\nDruid(29), Monk(1), Human\n    Abilies    STR: 13\n        CON: 10\n        INT: 10\n        \n1    Dr    01: Druid(1): Extend Spell, Point Blank Shot\n3    Dr    03: Druid(3): Rapid Shot\n5    Dr    05: Druid(5)\n7    Dr    07: Druid(7)\n9    Dr    09: Druid(9): Empower Spell\n11    Dr    11: Druid(11)\n13    Dr    13: Druid(12)\n15    Dr    15: Druid(14): Spell Penetration\n17    Dr    17: Druid(16)\n19    Dr    19: Druid(18)\n21    Dr    21: Druid(20): Great Wisdom I, (WIS=24)\n23    Dr    23: Druid(22)\n25    Dr    25: Druid(24): Great Wisdom III, (WIS=27)\n27    Dr    27: Druid(26): Great Wisdom IV, (WIS=28)\n29    Dr    29: Druid(28): Great Wisdom V, (WIS=30)\n31        \n33        \n35        \n37        \n39        \n        \n        Skillpoints: 165\n        Saving Throw bonuses: Spells: +6, Fear: +2\n        AB (max, naked): 20 (melee), 29 (ranged)\n        Spell Casting: Druid(9)\n        \n        \nSkills by Level    Dr    01: Concentration(4), Lore(4), Persuade(4), Spellcraft(4), Save(4), \n    Dr    03: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(6), \n    Dr    05: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(8), \n    Dr    07: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(10), \n    Dr    09: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(12), \n    Dr    11: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(14), \n    Dr    13: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(2), \n    Dr    15: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(4), \n    Dr    17: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(6), \n    Dr    19: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(8), \n    Dr    21: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(10), \n    Dr    23: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(12), \n    Dr    25: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(14), \n    Dr    27: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(16), \n    Dr    29: Concentration(1), Lore(1), Persuade(1), Spellcraft(1), Save(18), </details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:15 AM - Oct 31, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>fairouz33 wrote:</cite>\nI kinda feel that a lot of the builds on the site are optimized for max level play or for play on persistent worlds, etc. </div></blockquote>\nThat's exactly it fairouz, more precisely the majority of the ECB's builds perform the best when they are played in a persistent world with a maximum level of forty &amp; from low-to-medium magic environments. When the modules offer you with impunity magic items that negate most harmful effects on your character or go with ease above &amp; beyond what the magic system normally allows the players to do on their own, then the only difference practically comes from the increased Ab/Ac/Dmg of the build, and in that case, the (relative) simple weapon-master for example is way ahead of the competition. What use is to try &amp; have improved evasion in your build if a ring has that as (one) of it's properties? What use is a high will save if you can get your hands on the golden circlet at level seven? And so on... <br/>\n<br/>\n<br/>\nHeck, for those that remember...and that goes really back in time, there was a section in the old Nwn vault that allowed you to download ready characters with gear &amp; everything from uploaded .bic files. There was a dwarven-defender in the top-ten, purely with gear from HotU that through clever stacking of items was practically immune to everything except for two things. Melee &amp; magic damage &amp; he had 30/- resistance to melee as a DD. Not the most exciting thing to play and the most terrifying thing is that HotU gives you that kind of gear from level 24 onwards, which is really early for a game that is supposed to get to level 40.<br/>\n<br/>\n<br/>\nTry that on World of Greyhawk for example though &amp; the tables are turned, you need evasion in a ring? Sure...but that will take one ring slot for this thing alone. Do you want mind-effects immunity? Sorry...that won't happen except if you are smart &amp; stock on clarity potions &amp; these things have a really short operation time &amp; the casters will also try to disable your buffs. So better you have a good will save on your own, before you depend on items and temporary buffs. In persistent worlds like these, the qualities of the best builds here become very, very apparent.<br/>\n<br/>\n<br/>\nThat's long for an explanation, but I hope it was at least interesting to read ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:20 AM - Oct 31, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Also, Druid's stonehold is one of the best spells in the game, just keep yourself &amp; animal companion under the effects of freedom &amp; you can literally freeze whole armies in their tracks.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:36 PM - Oct 31, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\n<blockquote><div><cite>fairouz33 wrote:</cite>\nI kinda feel that a lot of the builds on the site are optimized for max level play or for play on persistent worlds, etc. </div></blockquote>\nThat's exactly it fairouz, more precisely the majority of the ECB's builds perform the best when they are played in a persistent world with a maximum level of forty &amp; from low-to-medium magic environments. When the modules offer you with impunity magic items that negate most harmful effects on your character or go with ease above &amp; beyond what the magic system normally allows the players to do on their own, then the only difference practically comes from the increased Ab/Ac/Dmg of the build, and in that case, the (relative) simple weapon-master for example is way ahead of the competition. What use is to try &amp; have improved evasion in your build if a ring has that as (one) of it's properties? What use is a high will save if you can get your hands on the golden circlet at level seven? And so on... <br/>\n<br/>\n<br/>\nHeck, for those that remember...and that goes really back in time, there was a section in the old Nwn vault that allowed you to download ready characters with gear &amp; everything from uploaded .bic files. There was a dwarven-defender in the top-ten, purely with gear from HotU that through clever stacking of items was practically immune to everything except for two things. Melee &amp; magic damage &amp; he had 30/- resistance to melee as a DD. Not the most exciting thing to play and the most terrifying thing is that HotU gives you that kind of gear from level 24 onwards, which is really early for a game that is supposed to get to level 40.<br/>\n<br/>\n<br/>\nTry that on World of Greyhawk for example though &amp; the tables are turned, you need evasion in a ring? Sure...but that will take one ring slot for this thing alone. Do you want mind-effects immunity? Sorry...that won't happen except if you are smart &amp; stock on clarity potions &amp; these things have a really short operation time &amp; the casters will also try to disable your buffs. So better you have a good will save on your own, before you depend on items and temporary buffs. In persistent worlds like these, the qualities of the best builds here become very, very apparent.<br/>\n<br/>\n<br/>\nThat's long for an explanation, but I hope it was at least interesting to read ;)\n</div></blockquote>\n\nWhile absolutely agreeing with all of this, it might be worth adding that there are many of us who don't play in PWs (for whatever reasons) and confine ourselves to SP modules. Thus, we spend a great deal of time pre-level 40 (and not reaching it at all in many cases), which means ongoing playability becomes very important. The builds I tend to favour are all playable throughout pre-epic levels as well as in the rarefied atmosphere of epic, and the best of our builders (and I'm not including me in that, btw!) create characters that are optimized throughout, rather than flowering only at 40.<br/>\n<br/>\nAnd, of course, we also have forums for level 20 and level 30 builds as well<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:03 PM - Oct 31, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A build that is optimized for level 40 power at the cost of being less playable on the way there is not an inherently bad build.  It is optimal for a PW where the real game starts at level 40 and leveling is just a preliminary, but not good for single-player where you spend most of your time below level 40, if you even get there at all.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}