{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "297",
  "name": "Tell us what you know about WoG, WoGGers!",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/tell-us-what-you-know-about-wog-woggers-t515422.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": 1,
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:35 PM - Aug 27, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I've been picking up on some of the tweaks about WoG piecemeal while reading some of the builds specifically designed to be used there.<br/>\n<br/>\nSo why hasn't it been described in brief in the PW section?<br/>\n<br/>\nI'm betting a great proportion of the guild plays there and knows enough to furnish an overview.  It would be helpful for those of us not familiar with its idiosyncrasies to be enlightened.  And please don't simply furnish a link to the website.  Been there, done that.  If/when I decide to play there I'll spend a few hours studying and thinking about the customizations.  There are too many PWs with websites to spend the time reading all their documentation as I hope you full-time employees and family-raisers will quickly agree.<br/>\n<br/>\nI'm implying a simple introductory overview which specifically addresses build considerations and nothing more.<br/>\n<br/>\nIt would be so much more efficient to post this information in the PW section BEFORE any dedicated build is submitted, both for the casual reader who is seeking to understand the rationale and for the dissector who may have something useful to offer if they understood the consequences.<br/>\n<br/>\nHow about it?  That rock poised at the top of the hill just needs one push to get it rolling, eh?<br/>\n<br/>\nCheers, mates!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:45 PM - Sep 05, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I agree, I'll try to come up with something,but Kail has been there so much longer than I that I think it should be he to do that. I'll give him a couple of weeks to do it and if he doesn't i'll pitch in the very little stuff that I know.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}