{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "523",
  "name": "custom class +30 lvls shifter Q,s",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/custom-class-30-lvls-shifter-q-s-t515432.html",
  "author": "magpie45",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "441",
  "posts": [
    {
      "author": "magpie45",
      "avatar": "no_avatar.png",
      "timestamp": "11:19 PM - Aug 30, 2011",
      "content": "<div>ok,playing a custom class fey on a server Pw,basically you have too take 10 lvls of the class before moving on too your other choice.<br/>\nMore info:Low magic,+3 is good!,no perma haste etc.<br/>\n<br/>\nBad news:stats are -10 too str!,-2 con ,+5 dex...so my char atm 1st lvl,can be changed has 6str,16 dex,17 wiz,rest 8!<br/>\nAlso,lots of undead about!<br/>\n<br/>\nthis can be changed though,feel free too advise<br/>\n<br/>\nWanted too go shifter,and have read up on them but have couple of Q,s.<br/>\n<br/>\nLvl spread=10 custom/5 druid/17 shifter...where do i put the other lvls?...druid or shifter?<br/>\n<br/>\nWhat about stats,boost dex or wiz?<br/>\n<br/>\nFeats,what are the must haves apart from extend,etc<br/>\n<br/>\nAny general advice too classes I have never played even once,more than welcome!,please help...in return i am very good at PRC warlocks!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:42 AM - Aug 31, 2011",
      "content": "<div>So is this targeted for a Level 40 build?<br/>\n<br/>\nMore levels in shifter really only increases things like breath weapon and Rak ice storms (besides access to the improved forms and durations, that is).<br/>\n<br/>\nIt would probably help to know what you get from that custom class, like feats or other benefits.<br/>\n<br/>\nYou should decide which form you will likely specialize in and then work backwards to enhance it the best you can. If, say, you got Undead Shape @shifter 10 and stopped there, you'd have 20 left for \"other\".  If you can get druid to at least 13 you'll begin to get some nice buffs like Aura of Vitality and they get even better ones with more druid levels (and the durations, of course).  So, a Risen Lord split might be something like custom 10/shifter 10/druid 20 which would give access to all spells though the buffs would be dispelled pretty easily. If you just want the ability to cast level 9 spells, you'd end up with a split more like custom 10/shifter 13/druid 17.  In either case, you'd probably want Extend and Empower thrown in there along with Expertise (and Imp Expertise, if there is room) for the breath weapons and or if you decide to elect Outsider Shape @WIS 25 perhaps Rak Ice Storms.<br/>\n<br/>\nIt's a tough call with that 10-level deficit from the custom class.  Normally, with that many levels in any class one would expect it to become the dominant class but I really know little about it so can't venture on how to exploit it better.</div>"
    },
    {
      "author": "magpie45",
      "avatar": "no_avatar.png",
      "timestamp": "9:37 PM - Aug 31, 2011",
      "content": "<div>Heres the details of the 1st 10 lvls,im still lvl one and took luck of heroes for my first lvl feat.<br/>\n<br/>\nHit Die: d4<br/>\nProficiencies: Creature Weapons, Simple Weapons<br/>\nSkill Points 4 + INT Modifier<br/>\nRequirements:<br/>\nRace: Feral Fey<br/>\n<br/>\nAbilities:<br/>\n<br/>\n    * Level 1. Favored Enemy: Fey; Fairy Bolt; Snack; Sneak Attack (1D6)<br/>\n    * Level 2. Weapon Finesse; Tribe Ability I<br/>\n    * Level 3. Weapon Focus: Dagger; Weapon Focus: Creature<br/>\n    * Level 4. Toughness; Stealthy<br/>\n    * Level 5. Improved Initiative; Sneak Attack (2D6)<br/>\n    * Level 6. Tribe Ability II; Skill Focus: Hide<br/>\n    * Level 7. Skill Affinity: Listen; Skill Affinity: Move Silently<br/>\n    * Level 8. Skill Focus: Search; Skill Focus: Spot<br/>\n    * Level 9. Skill Focus: Listen; Skill Focus: Move Silently<br/>\n    * Level 10. Sneak Attack (3D6); Tribe Ability III<br/>\n<br/>\nThe sneak attk is Blackguard,and tribe ability is dissapear,basically inv, an no.of times a day..im thinking of after lvl17 of shifter,rest of lvls into druid for more spells and buffs etc,they are VERY good at sneaking,combined with the Inv a number of times a day.And the fairy bolt is cold based,doing about 20 dam at lvl 10...the snack attk is like Vamp Reg. so ok at low lvls but of decreasing returns later on.<br/>\n<br/>\nSo,there you go,how can i break it!</div>"
    },
    {
      "author": "magpie45",
      "avatar": "no_avatar.png",
      "timestamp": "11:04 AM - Sep 01, 2011",
      "content": "<div>Oh ,i should add its a lvl40 build,low magic world...and I have never even made,much less played a Druid or Shifter before!</div>"
    }
  ]
}