{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "723",
  "name": "Min/Max Druid \" Bear form\" build? Possibility?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/min-max-druid-bear-form-build-possibility-t2355283.html",
  "author": "Z0RnN",
  "avatar": "no_avatar.png",
  "replies": 41,
  "posts": [
    {
      "author": "Z0RnN",
      "avatar": "no_avatar.png",
      "timestamp": "9:30 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi friends, im curious, about druids bear form, i simply fell in löve with it , slap that dark moon robe on it and go to town,(for example)<br/>\n<br/>\nHow would a build look like that makes the most out of \"bear form\", with speed,def/high hp? And lovely attack?, armor and gear choices?<br/>\n<br/>\nAll i see is focus on dragon form, and dragons are not my cup of tea, <br/>\n<br/>\nI play on the switch, so multiplayer/modules are not something to aim for, <br/>\nIm playing the so beloved OC that we all love, with the dlcs, and 10ish \" modules\", <br/>\n<br/>\nHavent found any ideas on the \"pure bear build\" so i thought, why not try here, share ur ideas, theorycrafting it is, and oh , its a lvl 40 build im looking for, <br/>\nBest would be when i finally unlock dragon shape, i can safely ignore it. <br/>\n<br/>\nBest reagards, Z0RnN , Sweden<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "9:34 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just make it like the dragon builds. It's all the same stuff that goes around. <br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "10:00 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Shifter forms and Elemental Shape are better than Wild Shape in almost all respects, so in terms of powerbuilding you would be better off focusing on a different form. However in the past I've played niche Wild Shape builds for the sake of playing a niche Wild Shape build, so I have a few suggestions. Note that almost all of them can be improved by focusing on a different form.<br/>\n<br/>\nDru/Ass DC assassin (even more useless in EE than it was in 1.69).<br/>\nDru/Bard/PM AC tank.<br/>\nDru/BG smiter.<br/>\nDru/CoT smiter.<br/>\nDru/Monk/Figh stunner.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:20 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello and welcome Z0RnN, I can see this is your first post to the ECB forum!<br/>\n<br/>\nGrimnir is correct in that Dragon Shape is much more powerful in combat, however Dragon Shape suffers problems going through standard doorways, and can only be used 3x / day which can be a problem in environments which are rest restricted. <br/>\n<br/>\nGrimnir is also correct in that any Druid/Dragon Shape build you can play the build in bear form anyway.<br/>\n<br/>\nEven if Dragon Shape/Elder Elemental Form is more powerful, I still enjoy playing my druids in bear form. <br/>\n<br/>\nFor some reason they have a certain personality that is undeniable magnetic.<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_82b48f3e32d90123b42daeda69ec563c.jpg\" />\n</dl>\n</span><br/>\n<em>This is from a forum post I made in the World of Greyhawk Tapatalk Forum 6 months ago</em><br/>\n<br/>\nIts particularly cute to watch them try to loot chests, pick up items, even open locks and disable traps! I hear its commonplace in countries like Canada for bears to break into cars for that delicious peanut butter sandwich...<br/>\n<br/>\nAnyway, you are asking for a min-maxed druid bear form. This is my thoughts from a technical standpoint. <br/>\n<br/>\n1. Dire Bear form -&gt; at least Druid 12, infinite wild shape is even better with Druid 22<br/>\n<br/>\n2. At least one level of Monk, for Monk UBAB for bears + Flurry of Blows which essentially doubles your attacks, Evasion, Wisdom AC, Monk Speed/Improved Knockdown (if you go that far)<br/>\n<br/>\n3. Buffs / Item bonuses. There is a lot to consider here. Only magical properties from Helmet/Armor/Shield transfer. Only the maximum bonus transfers (ie a +4 AC armor and +2 AC shield will transfer to +4 deflection AC). Everything else has to come from spell buffs (ie. Druid spells), UMD, Items or teammates.<br/>\n<details><summary>Spoiler</summary>a. Str with Bull's Strength / Blood Frenzy / Aura of Vitality spells + Str bonuses on helmet/armor/shield\nc. Con with Blood Frenzy / Aura of Vitality,  Bonuses on helmet/armor/shield, Endurance from potions/scrolls with UMD\ne. Deflection AC from equipped items, brooch of shielding (+4 AC)\ng. Dodge and other AC -&gt; Mage Armor cast from UMD or a teammate would give you least +2 AC (armor, dodge) maybe a bit more, also potentially Divine Shield\ni. Mind immunity -&gt; from items, clarity potions, lesser mind blank/mind blank scrolls with UMD\nk. Freedom -&gt; Freedom of movement spell from druid\nm. Divine Might/Divine Shield to add divine damage to attacks, or add dodge AC -&gt; due to alignment restrictions the best way to access this is probably Cleric, which has the side effect of giving you an extra spellbook, but you will lose access to the Thieves Hood which may or may be important in your environment or your discipline score. Blackguard or Paladin will require 3 levels of investment and alignment shifting if you take one level of monk as well.</details>\n\n4. Stats -&gt; only your Intelligence, Wisdom and Charisma scores transfer when you turn into bear form, so your Strength, Dexterity and Constitution stats shouldn't be your focus with starting stats or leveling.<br/>\n<br/>\nAnyway have a look at the technical details, and if wanted to tell us more about what you want in the build for example do you want to be able to use divine might for divine damage, post a reply and maybe I can flesh something out.<br/>\n<br/>\nAlso let me know if you want dragon shape or not, you can still play dragon shape builds but it might be reasonable to drop the idea of divine damage with your bear with the tremendous investment required to obtain dragon shape.<br/>\n<br/>\nAnd can you remind us the environment you plan to play this in and what is the highest level you expect to achieve in this environment.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Z0RnN",
      "avatar": "no_avatar.png",
      "timestamp": "10:59 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi guys, sry for late reply, thx for ur thoughts,  i know its not possible to make bear form on par with dragon shape, wich is a shame, reminds me of world of warcraft, when ppl say, why are you in that spec?, well, why, why is a great question that can make me go daydream for days..  and to orion, great effort there, im not sure of what i want to accomplish, my mindset might be stuck in wow pvp with an guardian druid bear that just shreds everything in its way...with millions of hp that just breaks opponenets down, something with bears,...gotta tell ya..<br/>\n<br/>\nMaybe post a build? Druid22? Monk1? Peanutbutter777?, level up progression?, <br/>\n<br/>\nWhen this game released, i sucked at games, i remeber buying nwn guide in the store since it looked cool, (still does), i also remember that i didnt understand anything in it, might be beacuse i didnt have the game, something about this game, tibia vibe, oldschool,  there i go again, with the daydreamin. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:09 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Z0RnN <br/>\nThe environment is important when designing builds<br/>\nAre you going to play the original campaign / shadows of undrentide and hordes of the underdark, or somewhere else.<br/>\nIf it's somewhere else is there something special about it, is there a particular level maximum (ie. Arelith max level is 30)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Z0RnN",
      "avatar": "no_avatar.png",
      "timestamp": "12:19 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Its on the nintendo switch, wifi only so multiplayer is not an option... ...tried it, but it was low frames, lag, and crashed, i might give it a shot later on , but as for now im stuck with oc, 2 dlcs, and 10 \"premium modules that were included, daggerford is the first of them, wish there were aelund saga aswell, my goal is always lvl cap, and i dont mind playing oc prelude with an lvl 40 on easy just for the heck of it, always cap, feel free to post some ideas on stats, a guided little tour, so i have something to try tm , gettin late now here in swe, or just something with druid in focus, always nice to see druid 20+ builds instead of that pesky shifter 20+ builds, i might be wrong, dragon might be fun, havent tried it....my plan is to spend allot of time back and forth in the modules i have to work with here on the switch, btw it has awsome controlls.. finnaly both hands can work, bck in db,bg computer times, i never knew were to put my left hand, no keys to press...höhö, <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "1:29 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you're happy to play at level 40 without levelling up from level 1 then I'd go with a Dru12/Pal3/CoT25 bear smiter.<br/>\nThis is a very gimmicky build, combining Wild Shape with Divine Wrath and Smite Evil, but it's one of the best bear builds that can be made. It has 4 shifts per day, 3 smites per day, and 1 Divine Wrath per day. It also requires two alignment changes (Lawful Neutral / Neutral Good to Lawful Good and back).<br/>\n<br/>\nThe build has high HP, extremely high saves, and immunities to disease, fear, and poison.<br/>\nDamage is surprisingly decent, although it requires +11 STR and +12 CHA to max out which is hard to achieve with vanilla item merging. With +11 STR, +12 CHA, Divine Might, and Divine Wrath, the damage is 1d8 + 16 (+ 308 Smite Evil) Physical + 26 Divine. Minimum smite damage is 325 Physical + 26 Divine, minimum smite critical damage is 650 Physical + 52 Divine. The Divine damage ignores DI/DR, so even the toughest enemies will take 26 damage per hit.<br/>\n<br/>\nThe main problems are low AB (and no real way to improve it in vanilla NWN), low AC, your attacks are +0 for DR purposes, and you're a shifter. Divine Wrath gives +11 AB but it's a once per day ability and it only lasts for 15 rounds. The only other way to increase your AB in vanilla NWN is through spells, since weapons don't merge for unarmed forms. Casting Stoneskin on yourself before shifting will make your attacks count as +5 for DR purposes, but once it wears off they will be back to +0 attacks.<br/>\n<br/>\nCalled Shot can be swapped for another feat such as Improved Critical: Scimitar if you want a different pre-epic feat.<br/>\n<br/>\nI didn't bother with the skill progression since it's just a rough draft, but you can max Discipline, Spellcraft, Tumble, put ranks into skills that require training, and almost max another skill such as Spot.<br/>\n<br/>\n===<br/>\n<br/>\nClass: Druid 12 / Paladin 3 / Champion Of Torm 25<br/>\nRace: Human<br/>\nAlignment: Lawful Good / Lawful Neutral / Neutral Good (requires 2 alignment changes)<br/>\nPlayability: 40 PvM / 40 PvP<br/>\n<br/>\nSTR: 14<br/>\nDEX: 8<br/>\nCON: 8<br/>\nWIS: 14 (16)<br/>\nINT: 10<br/>\nCHA: 18 (28)<br/>\n<br/>\n01: Druid(1): Blind Fight, Power Attack<br/>\n02: Druid(2)<br/>\n03: Druid(3): Weapon Focus: Scimitar<br/>\n04: Paladin(1): CHA+1, (CHA=19), *Alignment Change*<br/>\n05: Paladin(2)<br/>\n06: Paladin(3): Divine Might<br/>\n07: Druid(4): *Alignment Change*<br/>\n08: Druid(5): CHA+1, (CHA=20)<br/>\n09: Druid(6): Knockdown<br/>\n10: Druid(7)<br/>\n11: Druid(8)<br/>\n12: Druid(9): CHA+1, Improved Critical: Unarmed, (CHA=21)<br/>\n13: Druid(10)<br/>\n14: Champion of Torm(1)<br/>\n15: Champion of Torm(2): Toughness, Called Shot<br/>\n16: Champion of Torm(3): CHA+1, (CHA=22)<br/>\n17: Champion of Torm(4): Improved Power Attack<br/>\n18: Champion of Torm(5): Extra Smiting<br/>\n19: Druid(11)<br/>\n20: Druid(12): CHA+1, (CHA=23)<br/>\n21: Champion of Torm(6): Great Charisma I, Great Wisdom I, (WIS=15), (CHA=24)<br/>\n22: Champion of Torm(7)<br/>\n23: Champion of Torm(8): Epic Prowess<br/>\n24: Champion of Torm(9): CHA+1, Great Smite I, (CHA=25)<br/>\n25: Champion of Torm(10): Great Smite II<br/>\n26: Champion of Torm(11)<br/>\n27: Champion of Torm(12): Great Smite III<br/>\n28: Champion of Torm(13): WIS+1, (WIS=16)<br/>\n29: Champion of Torm(14): Great Smite IV<br/>\n30: Champion of Torm(15): Great Smite V<br/>\n31: Champion of Torm(16)<br/>\n32: Champion of Torm(17): CHA+1, (CHA=26)<br/>\n33: Champion of Torm(18): Great Smite VI, Great Smite VII<br/>\n34: Champion of Torm(19)<br/>\n35: Champion of Torm(20)<br/>\n36: Champion of Torm(21): CHA+1, Great Smite VIII, (CHA=27)<br/>\n37: Champion of Torm(22): Great Smite IX<br/>\n38: Champion of Torm(23)<br/>\n39: Champion of Torm(24): Great Smite X<br/>\n40: Champion of Torm(25): CHA+1, (CHA=28)<br/>\n<br/>\n===<br/>\n<br/>\nNaked Stats<br/>\nHitpoints: 376<br/>\nSkillpoints: 159<br/>\nSaving Throws (Fortitude/Will/Reflex): 45/44/39<br/>\nSaving Throw bonuses: Fear: +2<br/>\nBAB: 27<br/>\nAB (max, naked): 31 (melee), 27 (ranged)<br/>\nAC (naked/mundane armor/shield only): 9/20<br/>\nSpell Casting: Druid(6)<br/>\nAlignment Changes: 2<br/>\n<br/>\nBuffed Stats (While shifted, assuming that you have +11 STR, +11 CON, +12 CHA, one +5 AC item, and Haste)<br/>\nAB: 27 (BAB) + 16 (STR) + 1 (Feats) - 1 (Size) = +43 (+54 with Divine Wrath) (+58/+69 when smiting)<br/>\nAC: 10 (Base) + 1 (DEX) + 4 (Tumble) + 5 (AC Bonus) + 5 (Shape Dodge Bonus) + 4 (Barkskin) + 4 (Haste) - 1 (Size) = 32<br/>\nHP: 376 (Base) + 400 (CON) + 40 (Feats) = 816<br/>\nFortitude: 25 (Base) + 10 (CON) + 15 (CHA) + 12 (CoT Bonus) = 62 (70 with Divine Wrath)<br/>\nReflex: 19 (Base) + 1 (DEX) + 15 (CHA) + 12 (CoT Bonus) = 47 (55 with Divine Wrath)<br/>\nWill: 20 (Base) + 3 (WIS) + 15 (CHA) + 12 (CoT Bonus) = 50 (58 with Divine Wrath)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:34 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is a cool build idea Yunim and I think if Z0rnN is going to take a level 40 bear to overpower the original campaign this build is a great choice<br/>\nMonk would have been nice in shifted builds, but this build I think is going to do the job and is gonna be a lot of fun smiting those baddies<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Z0RnN",
      "avatar": "no_avatar.png",
      "timestamp": "9:48 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes there we have it, my vision was something in that way Yunim, the problem for me as that i dont understand much of nwn mechanics, for example aligment?, how do i control that? So i dont mess up?, and this about vanilla items, do u guys know what modules the switch has? Should i post the list on them? Maybe the required items can be found in any of those?, lets not carve the original campaign in too stone, maybe i have to try online? And wich module? .. anyways i will try this build so i have something to fiddle with, would be nice if the bears paws just could hit the enemys, 0 atk didnt sound so nice=) ,  the bear has good def, thats what we know, lets build on that, just like they design a tank in wow, to be able to do damage for leveling up, there is no way for me to get instant lvl 40, so i have to work for it, so its good to have some leveling plan from lvl 1, or 15, thats what the game can give me, havent had my coffe yet, so this smite word is circling around in my head, bear= bearclaws= smite? What trickery is this? Whats smite? ... have to google it, <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:16 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great to hear from you again.<br/>\n<br/>\nTry downloading the pretty good character creator module from the NWN Vault. Just search for it in a search engine (ie. Google, Bing etc) and running the module. You should be able to create Yunim's character and unleash the bear of divine destruction against the enemies of Neverwinter! <br/>\n<br/>\nTo load it into the module export the character then load it into the original campaign.<br/>\n<br/>\nOh and post us some screenshots. A bear crushing some of the nasty evil bosses with the Smite Evil feat ie Maugrim would be great fun<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:29 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you're interested in finding out more about smiting, what it does and what it doesn't, have a look at this template from Hip. <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-plight-of-smite-smite-evil-variants-t2303707.html\" rel=\"noreferrer\" target=\"_blank\">The Plight of Smite</a><br/>\n<br/>\nJust as an addendum, you'd ordinarily be finishing the OC at around level 17/18, or the two extensions at around level 27/28. Playing either at level 40 might give you a false sense of security.<br/>\n<br/>\nWelcome aboard, ZORnN!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Z0RnN",
      "avatar": "no_avatar.png",
      "timestamp": "11:47 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nope aligment change stops the wheel for me here, have no addons on the switch,nor console commands, guess im stuck at druid 3=), cant select pala, will continue my search on this one... atleast i can boost to instant level 15, i belive swith nwn1ee is very limited, pretty much vanilla stuff, modules i have are<br/>\nUndrentide,<br/>\nUnderdark<br/>\nDarkness over daggerford<br/>\nKingmaker<br/>\nPirates of the swordcoast<br/>\nShadowguard<br/>\nWitchs wake<br/>\nWyvern of cornmyr<br/>\nContest of champion 0492<br/>\nThe dark rangers treasure<br/>\nThe winds of eremor<br/>\nTo heir is human<br/>\n<br/>\nHow would a bear tank build look? That just soaks dmg, and just do enough dmg to keep progressing trough all this content?, bear form might be best if i build around that forms strenghts, beating on a zombie or dragon in 10minutes without loosing hp is always nice, i dont mind if it takes 10minutes to put them down... i also like passive buffs, like haste, that bear paw shows itself so much more often,  gonna check once more on shifter forms aswell, things is that none of those forms makes me tick.... the bear does=), <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:49 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh regarding creating the character in a custom module on Nintendo Switch, I have no experience with this but let us know if you have troubles Maybe a forum visit out there is willing to help you out. Forgot you were on a console! :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Z0RnN",
      "avatar": "no_avatar.png",
      "timestamp": "11:55 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah yes indeed, i am on the switch, it has it strenghts, and its weaknesses... am limited of what i can do.... but hey, i can sit on the toilet doing my thing while im speaking to aribeth, cant be beaten....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:15 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ahhh I've been ninja'ed by you Z0RnN! In case you don't know what that means feel free to ask Stag :) but its pointless to ask Mick because he's usually the Ninja'er (if such a term exists?)<br/>\n<br/>\nI would propose a simple druid / monk / champion of torm build if that is the case.<br/>\n<br/>\nYou will get dire bear form right from the get go at level 15.<br/>\n<br/>\nYou will also notice it has maxed stealth (a stealthy bear), maxed tumble (a ballerina bear), maxed discipline (boxer bear), maxed spellcraft (arcane bear) and maxed persuasion (persuasive bear).<br/>\n<br/>\nI have avoided building for maximum level 40 power so you can enjoy 'bear power' from the get go. I took knockdown and improved knockdown as feats so you can enjoy them earlier. <br/>\n<br/>\nHate to be the bearer of bad news... but hope you find it bearable... I mean bear with me... just getting my bearings... <br/>\n<br/>\n<strong>The Z0RnN's Bear Build (Druid 27/Monk 5/CoT 8)</strong><br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_8163754333bd2cf2c3706f58ba0da667.jpg\" />\n</dl>\n</span><br/>\n<span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://punpedia.org/bear-puns/\" rel=\"noreferrer\" target=\"_blank\">https://punpedia.org/bear-puns/</a></span><br/>\n<br/>\n<details><summary>Spoiler</summary>Monk(5), Druid(27), Champion of Torm(8), Human\nSTR: 8\nCON: 12\nINT: 16\n\n01: Druid(1): Toughness, Blind Fight\n03: Druid(3): Extend Spell\n05: Druid(5)\n07: Druid(7)\n09: Druid(9): Knockdown\n11: Druid(11)\n13: Druid(12)\n15: Champion of Torm(2): Lightning Reflexes, Improved Knockdown\n17: Champion of Torm(4): Improved Critical: Unarmed\n19: Monk(2): {Deflect Arrows}\n21: Druid(13): Great Wisdom I, (WIS=24)\n23: Druid(15)\n25: Druid(17)\n27: Monk(4): Great Wisdom IV, (WIS=28)\n29: Champion of Torm(8): Great Wisdom V, (WIS=30)\n31: Druid(19)\n33: Druid(21): Epic Prowess\n35: Druid(23)\n37: Druid(25)\n39: Druid(27): Great Wisdom VI, (WIS=33)\n\nSkillpoints: 328\nSaving Throw bonuses: Spells: +9, Mind Effects: +2, Fear: +2\nAB (max, naked): 27 (melee), 26 (ranged)\nSpell Casting: Druid(9)\n\n\n01: Heal(4), Lore(4), Persuade(4), Spellcraft(4), Save(16), \n03: Heal(1), Lore(1), Persuade(1), Spellcraft(1), Save(24), \n05: Heal(1), Lore(1), Persuade(1), Spellcraft(1), Save(32), \n07: Persuade(1), Spellcraft(1), Save(44), \n09: Persuade(1), Spellcraft(1), Save(56), \n11: Persuade(1), Spellcraft(1), Save(68), \n13: Heal(2), Lore(2), Persuade(1), Spellcraft(2), Save(1), \n15: Discipline(1), Save(10), \n17: Discipline(1), Save(20), \n19: Discipline(1), Hide(7), Listen(7), Move Silently(7), Persuade(6), Tumble(5), \n21: Persuade(1), Spellcraft(8), Save(2), \n23: Persuade(1), Spellcraft(1), Save(14), \n25: Persuade(1), Spellcraft(1), Save(26), \n27: Discipline(1), Hide(7), Listen(7), Move Silently(7), Persuade(2), Tumble(10), \n29: Discipline(1), Heal(2), Lore(3), \n31: Heal(1), Persuade(1), Spellcraft(1), Save(5), \n33: Persuade(1), Spellcraft(1), Save(17), \n35: Persuade(1), Spellcraft(1), Save(29), \n37: Persuade(1), Spellcraft(1), Save(41), \n39: Persuade(1), Spellcraft(1), Save(53), </details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Z0RnN",
      "avatar": "no_avatar.png",
      "timestamp": "12:28 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hehe will try this build, and to Stag, care to ellaborate more on this Ninja thingy?,  awsome that orion implemented the full guide on how to build it, i wonder why most builds not include gear choices? Like specific gear pieces to hunt for etc... like darkmoon robe or does boots that haste passive aswell... for example orions build here, the \"orion bearlicious\" build, gear pieces that synergy with the build? Amulets? Rings? ...<br/>\n<br/>\nQ: What do you call a bear that changes his mind every couple of minutes? A: A bi-polar bear. Or me, Z0RnN .<br/>\n<br/>\nTy guys for ur splendor, puttin so much time on me warms my heart, time is a delicate thing we humans can give eachother. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:34 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The best 'bear' pieces of equipment are good pieces of armor, shield or helmet.<br/>\nThese item slots are the only ones which transfer magical properties.<br/>\nThere are more details on this in the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Polymorph\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki: Polymorph</a><br/>\n<br/>\nBeyond that you will need to buff yourself with spells or items before you transform into a  bear.<br/>\nThe only item you can use when you are transformed are potions.<br/>\n<br/>\nThats why I included extend spell, in case you needed a spell such as bull's strength to last a long time.<br/>\n<br/>\nAnd solid point on the time, compassion thing etc... such values are quite undervalued in our world<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Z0RnN",
      "avatar": "no_avatar.png",
      "timestamp": "12:54 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey orion, aligment on bearbuild?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:09 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Lawful neutral<br/>\nSorry forgot that<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:11 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi ZORnN. Your alignment would be Lawful Neutral. Monks have to be Lawful, Druids have to be Neutral, and CoT has to be non-Evil.<br/>\n<br/>\nAs far as the ninja-ing goes, the bear necessities are that it's when someone else posts while you're composing your own post, so it takes you somewhat by surprise. I tend to type slowly, so suffer from ninja visitations more than most (I try to provide them with tea and biscuits to keep them friendly).<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: There's a prime example - Orion's just ninja'd me!<br/>\n<br/>\nOh, and you asked about why we don't include gear/kit. That's mostly because what's available will vary from module to module and from persistent world to persistent world, and we try to offer the best builds we can regardless of environment, unless there are specifics given to us at the Build Request point.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Z0RnN",
      "avatar": "no_avatar.png",
      "timestamp": "1:25 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Orion orion... when i look upon the stars i see you, finished the build up to lvl 15 just now.. there is so much details in this build.. sneaking, persuade... the improved bear form... skill allocation?, how do u guys even come up with this sort of math?... to brag, wich i often do, i managed to get 2700 rated rbg in wow mop.. i thought and felt i was a god, was top 20 in EU bad company 2, but man... this mathematical genius amongst pve players, that come up with builds... how is it even possible... it always leaves me more humble...i love meeting people that are better then me... in those cases i just relax... put aside any anger, and just enjoy myself in there splendor... same in darksouls... all this good players....how do they find out these things... i just copycat builds....man o man, humble it is...its abit like finishing ff7... i just stood there looking outside and stared...let things soak in for abit... great effort ...indeed. <img class=\"post-image\" loading=\"lazy\" src=\"https://www.google.com/search?q=bloodydancing steel enchantement&amp;client=tablet-android-samsung&amp;prmd=isvn&amp;source=lnms&amp;tbm=isch&amp;sa=X&amp;ved=2ahUKEwipps3E__PmAhVoposKHVsaD9AQ_AUoAXoECAwQAQ&amp;biw=800&amp;bih=1280#imgrc=bg7sMeFCjyntVM\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:39 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That ain't no bear!<br/>\n<br/>\nAs far as creating builds is concerned, there's a sneaky way to make life easier here... <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/tools-of-the-builder-t515320.html\" rel=\"noreferrer\" target=\"_blank\">Building Tools</a><br/>\n<br/>\nBut some of us are old-skool and sit down with pencil and paper and work them through (nothing laudable about that, btw, just a bit rubbish with tech).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:41 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Dear Z0RnN<br/>\nYou've visited the an elite NWN character building skill training facility for players, and I have been whipped into shape very solidly for several months by the likes of Valerfor, Mick Dagger, Stag, Empyre65, and I have learned much.<br/>\n<br/>\nAny build posted should be expected to receive critique. Any critique posted should expect also to receive critique. Sometimes the critique of the critique must be critiqued. For it is through such a process we grow and learn, approached with an open mind, devoid of defensiveness - the focus being what is best for the player in the circumstances provided to achieve their goals...<br/>\n<br/>\nCharacters take quite a long time to play and progress. If you are like me I like things 'perfected' as much as possible before I start playing a build. The worst thing is getting halfway and realising you did something very ineffective with the starting stats or feats or whatever and start from scratch...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "2:06 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Not sure why it wont let me quote your build message Orion.. but just had to mention this...  <br/>\n<br/>\nAs much as I love the build you put together, I would have to take that 6th  monk level.  Between freeing up two feats (knockdown &amp; improved knockdown), you also get that next monk speed boost.  But that would mean delaying Improved Knockdown until near the end.  And you did say it wasn't built for lvl 40 power...    <br/>\n<br/>\nBut my fingers are twitching to add that one more level of monk....     Kinda like trying to walk past that peanut butter cookie... when you know you shouldn't.. but it's just screaming at you....<br/>\n<br/>\nEat ME!!!!!!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:22 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>conlaoch wrote: <a data-post-id=\"18311\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18311&amp;sid=cfc0c5f3a6dde9447c71e1040d56920e#p18311\">↑</a><div class=\"responsive-hide\">Jan 08, 2020</div></cite>Not sure why it wont let me quote your build message Orion.. but just had to mention this...  <br/>\n<br/>\nAs much as I love the build you put together, I would have to take that 6th  monk level.  Between freeing up two feats (knockdown &amp; improved knockdown), you also get that next monk speed boost.  But that would mean delaying Improved Knockdown until near the end.  And you did say it wasn't built for lvl 40 power...    <br/>\n<br/>\nBut my fingers are twitching to add that one more level of monk....     Kinda like trying to walk past that peanut butter cookie... when you know you shouldn't.. but it's just screaming at you....<br/>\n<br/>\nEat ME!!!!!!</div></blockquote>\nYou probably just filled your quote quota <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />.<br/>\n<br/>\nBut I get what you say about that 6th level of monk. I, however, would go Druid 24/ Monk 10/ CoT 6. But that's for 2 reasons: 1) I haven't a clue about druids, and 2) I pretty much always want more monk - even in builds with none at all.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "2:26 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"18312\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18312&amp;sid=cfc0c5f3a6dde9447c71e1040d56920e#p18312\">↑</a><div class=\"responsive-hide\">Jan 08, 2020</div></cite>\n<br/>\nYou probably just filled your quote quota <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />.<br/>\n<br/>\nBut I get what you say about that 6th level of monk. I, however, would go Druid 24/ Monk 10/ CoT 6. But that's for 2 reasons: 1) I haven't a clue about druids, and 2) I pretty much always want more monk - even in builds with none at all.</div></blockquote>\nHah!!!    quoting again... take that Quota!!!<br/>\n<br/>\nAnd with 10 monk that lets you take 6 early for the 2nd speed boost and the free knockdown.. and still leave 4 for later skill dumps.<br/>\n<br/>\nI'd most likely do the same Stag..  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:44 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">...and another 10% to speed and Imp Evasion (Monk 9), and +1 AC and Ki Strike 1 (Monk 10). But you'd lose 1 CoT bonus feat and 1 on all saves, and heavens only know what from Druid.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "6:28 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I designed it so K0RnN can have both dire bear form and improved knockdown at level 15, which he stated was the highest level he could create a character on the Nintendo Switch. Then import the character into the original campaign and destroy the enemies of Neverwinter. Because he will be level 15 in an area designed for levels 3 onwards, it will be quite some time before he gains further levels, so I wanted him to have all the good stuff immediately which was his goal - play a devastating killer bear!<br/>\n<br/>\nIf he was playing on a standard computer he could easily install a character creator like PGCC and insert a character of level 40 and in that situation monk 6 is more optimal.<br/>\n<br/>\nHorses for courses as they say. If he wasn't playing on Nintendo Switch and starting the OC at 15 you would be correct.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:55 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, I was only spit-balling here Orion - it wasn't intended as an actual suggestion: sorry 'bout that. I don't pretend to feel qualified to comment on druid builds in any case - never played one, never built one.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:06 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"18320\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18320&amp;sid=636553a8a8cdd4c682616502c2a3ac37#p18320\">↑</a><div class=\"responsive-hide\">Jan 08, 2020</div></cite>Oh, I was only spit-balling here Orion - it wasn't intended as an actual suggestion: sorry 'bout that. I don't pretend to feel qualified to comment on druid builds in any case - never played one, never built one.</div></blockquote>\nAgree with conloach by the way, that Monk 5 class split makes you want to reach for that additional monk level to get to 6... and a very lovely analogy. <br/>\n<br/>\nI must confess before Christmas I have started calorie counting, and when I realise that cookie is 100 calories and would require 1hr of walking to burn off the energy in it, its far less attractive to add to my energy record for the day then say, 20 blueberries which is close to 30. <br/>\n<br/>\nLikewise Monk 6 could delay knockdown/improved knockdown to save Z0RnN two pre-epic feats you actually don't need to make the build playable, more nice stuff like extra saves / spell foci / zen archery but not essential to Z0RnN's needs. Monk 9 might be kinder as Stag has suggested but starting at level 15 the bear form wouldn't be as strong. <br/>\n<br/>\nAnd spit-balling is always appreciated :) <br/>\n<br/>\nThat aside I believe you are underselling your skills somewhat here Stag, you have spent a few years studying the process of optimising builds and have suggested a number of improvements to my own, knowing the class is one thing from a gameplay perspective, but optimising stuff is another, and if the OP's writes the goals desired, within your limits I'm sure you can make useful commentary when it feels right<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "8:13 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">True... but if its peanut butter all bets are off....    I've been known to just grab the jar and a spoon....<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:43 PM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>conlaoch wrote: <a data-post-id=\"18323\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18323&amp;sid=636553a8a8cdd4c682616502c2a3ac37#p18323\">↑</a><div class=\"responsive-hide\">Jan 08, 2020</div></cite>True... but if its peanut butter all bets are off....    I've been known to just grab the jar and a spoon....</div></blockquote>\nYou're killing me :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "3:16 AM - Jan 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"18325\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18325&amp;sid=636553a8a8cdd4c682616502c2a3ac37#p18325\">↑</a><div class=\"responsive-hide\">Jan 08, 2020</div></cite><span style=\"font-size:75%;line-height:normal\">You're killing me :)</span></div></blockquote>\nEven my 3 German Shepherds know the sound that peanut butter lid makes when its removed ... and they come running for their helping...<br/>\n<br/>\nsometimes I even share....    :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:52 AM - Jan 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh dear<br/>\nDidn't realise peanut butter was good for dogs! :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:55 AM - Jan 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What gets me is that he uses a spoon - what's wrong with a finger dunked in on every passing of the jar?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:31 AM - Jan 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Salmonella probably<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:37 AM - Jan 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"18334\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18334&amp;sid=636553a8a8cdd4c682616502c2a3ac37#p18334\">↑</a><div class=\"responsive-hide\">Jan 09, 2020</div></cite>Salmonella probably</div></blockquote>\nPah - monks: immune to poison!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:54 AM - Jan 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And non magical disease :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "1:34 PM - Jan 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"18332\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18332&amp;sid=636553a8a8cdd4c682616502c2a3ac37#p18332\">↑</a><div class=\"responsive-hide\">Jan 09, 2020</div></cite>What gets me is that he uses a spoon - what's wrong with a finger dunked in on every passing of the jar?</div></blockquote>\nFinger cant reach the bottom of the jar   :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:12 AM - Jan 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>conlaoch wrote: <a data-post-id=\"18338\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18338&amp;sid=5a8a9fc5f1abc4a43488855a273a32c4#p18338\">↑</a><div class=\"responsive-hide\">Jan 09, 2020</div></cite><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"18332\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18332&amp;sid=5a8a9fc5f1abc4a43488855a273a32c4#p18332\">↑</a><div class=\"responsive-hide\">Jan 09, 2020</div></cite>What gets me is that he uses a spoon - what's wrong with a finger dunked in on every passing of the jar?</div></blockquote>\nFinger cant reach the bottom of the jar   :)</div></blockquote>\nDoncha just <em>HATE</em> it?<br/>\n<br/>\nThere is nothing like a spoonful o' peanut buttah!  Especially crunchy style!<br/>\n<br/>\nOh my!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Knight_oflimbo",
      "avatar": "no_avatar.png",
      "timestamp": "11:27 PM - Jan 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Druid 12/monk 2/Dwarven defender 26<br/>\n<br/>\nRace: Dorf <br/>\n<br/>\nAlignment: LN <br/>\n<br/>\nStats<br/>\nLevel ups go into Con until 22, then goes into wisdom <br/>\n<br/>\n8 STR<br/>\n14 Dex<br/>\n18 Con <br/>\n14 int<br/>\n15 wis<br/>\n8 Cha <br/>\n<br/>\n1: Druid , dodge<br/>\n2: Druid<br/>\n3: Druid, toughness <br/>\n4: Druid <br/>\n5: Druid <br/>\n6: druid, disarm<br/>\n7: druid <br/>\n8: druid: <br/>\n9: druid:  blind fight <br/>\n10: druid<br/>\n11 druid <br/>\n12: druid, IC: unarmed, dire bear<br/>\n13: dwd<br/>\n14: dwd<br/>\n15: dwd: imp disarm<br/>\n16: dwd<br/>\n17: dwd<br/>\n18: dwd: kd<br/>\n18-40: take 2 more monk levels for tumble dump at 22/27/32/37, rest goes into dwd<br/>\n<br/>\nFeats: on general feat level, take epic prowess and  great wisdom, on dwd bonus feats, take Epic damage resist, armored skin.<br/>\n<br/>\n<br/>\nAC: 15 base+ 8 tumble + 2 armor skin + 9?wisdom+4 def stance = 38 before items and buffs. Barkskin, +5 whatever AC item , wisdom and dex buffs should bring this up to low 50s. <br/>\n<br/>\nAb: 26 base + 10 STR +  1 EP + 4? From improved disarm= 41 base.<br/>\n<br/>\nDamage: 1d8+10? <br/>\n<br/>\nIf they somehow hit you, 27/- DR and probably 600+ HP. <br/>\n<br/>\nYour offense is super ass, especially when you are trying to punch through DR, but you shouldn't be dying and you can attack really fast. <br/>\n<br/>\nIf all else fails, unshift into human form and punch the meat off of them with gloves.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}