{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "242",
  "name": "Interest in funding $20/month paid forum by Inivsion Power Board",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/interest-in-funding-usd20-month-paid-forum-by-iniv-t2354290.html",
  "author": "JimDandy",
  "avatar": "10235455_1510287071.png",
  "replies": "3",
  "views": "1.6K",
  "posts": [
    {
      "author": "JimDandy",
      "avatar": "10235455_1510287071.png",
      "timestamp": "12:15 AM - Aug 08, 2014",
      "content": "<div>Hei, gang!<br/>\n<br/>\n The forum software here is getting on my nerves, lol. Is there an interest in getting funds together and getting one of these deals with Invision Power Board? <a class=\"postlink\" href=\"http://www.invisionpower.com/cloud-pricing\" rel=\"noreferrer\" target=\"_blank\">http://www.invisionpower.com/cloud-pricing</a><br/>\n $20 a month between us could be easily attained, I'm thinking, and we could pay for a few years in advance or something. Just a thought I thought I'd air. :)<br/>\n<br/>\n PS: I should add that I'm very familiar with setting up forums and that we could probably set one up on the <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhawk/</a> address, if we know who's still hosting that.<br/>\n<br/>\n -JimDandy</div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "5:07 PM - Aug 09, 2014",
      "content": "<div>The Krit provided the search engine at the comcast site.  He probably has the best idea of the ownership.</div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "10:03 AM - Aug 18, 2014",
      "content": "<div>I will chip in 20 USD.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:32 PM - Aug 30, 2014",
      "content": "<div>Not to throw cold water on enthusiasm in regards to NWN, but I don't see this as a productive venture, fee or no fee.<br/>\n<br/>\n Let's revisit the ECB history briefly.<br/>\n<br/>\n ECB got its start on the Bioware legacy forums where essentially the entire community was frequenting, at least those who kept tabs on forum banter. All the epic builds were searchable, though the pre-epic ones were not.  Still, they were all archived and accessible by anyone.<br/>\n<br/>\n Then, when the plug was pulled, the membership began fragmenting into smaller groups, many redirecting their interest in a few \"primary\" servers that they liked and began building according to the expertise on those servers.  Most of the active servers have their own active forums and a portion of those players seldom visit other venues for building advice.  The balance of ECBers just went *poof*.<br/>\n<br/>\n Kail decided he had the time to sponsor a replacement outlet for epic builders just over 3 years ago.  In that time, forumer had undergone some formatting changes, some better, some worse... and there was an even more significant drop-off of participation.  More fragmenting.<br/>\n<br/>\n Then GoG came along and sparked a new player base which temporarily boosted subscribership.  If you check that forum, you should notice a similar drop-off of activity... in part to the novelty wearing off and a similar migration of players to the server forums they favor.  Add to that, the incompatibility that the game itself poses to the newest OS's and hardware platforms... well... the writing is on the wall IMO.  <br/>\n<br/>\n Even the closing of the IGN Vault, the NWN popularity mainstay, did not completely bury the faithful, but it is getting tougher and tougher for casual purchasers of NWN to do their gaming trouble-free without finding and installing the work-arounds..<br/>\n<br/>\n A new venue will need to find a way to migrate all the current builds over or folks will continue to use this site for ideas.  It's not as easy as it may first seem, either. I've done a lot of web designing myself, both for a major company's infrastructure and my own personal pages, but being strapped permanently as an admin to a forum that has little activity would damper anyone's fervor.<br/>\n  <br/>\n Don't get me wrong.  I'd love to use a better, more user-friendly venue. TBH, the reason I don't post builds here anymore is because the paste mechanism is unbearable with the new format and my interface.  I refuse to retype every line of a build from scratch just to post it. Today, I convey my builds only through email or messenger and it is so much faster and nicer to format it the way I want.  (Actually, I have the same problem on BSN so stopped posting build prototypes there as well.)  But yet another displacement of the knowledge base?  *cringing*<br/>\n<br/>\n To summarize:  yes, a more efficent posting system would be great in theory but the further dilution of participants wouldn't be worth the effort IMO.  And, honestly... that'll be the day I actually pay to post builds (yeah, I know there's no actual charge per build, but supporting a forum is the same as paying a fee for the service).  Not this cowboy!  I'll stick with buying rounds at the local watering hole. </div>"
    }
  ]
}