{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "584",
  "name": "A Quandary...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/a-quandary-t2355507.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "11",
  "views": "331",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:55 PM - Jul 02, 2020",
      "content": "<div>...is what I'm currently in, so I come to the Guild for some guidance.<br/>\n<br/>\nI confess, this started out as a name that simply came to me while I was writing something else. And that name was Tulip Brickhead. And he was a Dwarf. So I had a mull as to what sort of character he might be, and figured him a gentle but stubborn soul. Thus, an ideal party tank. Not interested in inflicting great swathes of damage and mayhem, but absolutely determined to protect his friends from harm. He has no arcane or divine assistance, just the strength of his heart (after all, this is me asking, after all <span class=\"text-emoji\">😇</span>).<br/>\n<br/>\nSo I went into a Dex-based Dwarven Defender with EDRIII. The best I came up with was a Fighter 16/ DwD 19/ Harper Scout 5. He ended up with 21/- DR, 658 hit points, and an AC of 29 naked or in full plate, 32 with tower shield (he's not an idiot: he's not looking to get hit). He has an AB of 43 with his finessed hatchet (40 ranged), and all his saves are over 20 (but under 30). He also has 10 uses of Defensive Stance a day.<br/>\n<br/>\nAll of which seemed alright. Not brilliant, but alright. And then I wondered...How about an EDRIII DwD with Epic Dodge? And that's where my quandary began.<br/>\n<br/>\nThe best I've managed to date is a Fighter 8/ Rogue 14/ DwD 18. On the plus side, it gains 51 skill points and ED. On the minus side it loses 3 AB, 2 AC (robes) or 1 (full plate), and 1 Defensive Stance. It also means either ED or EDRIII come very late in the build.<br/>\n<br/>\nCan you offer any assistance, please? Don't get me wrong, I'm not asking for a full build from you good people, just some thoughts on how I might improve things. Or, indeed, whether the whole EDRIII and ED idea is a dumb one (in a purely mundane build, ofc).<br/>\n<br/>\nThanks in advance!<br/>\n<br/>\nCheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Oh, btw, this doesn't mean I've forgotten about Viconia, but this one just became something of a brain-itch.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:08 PM - Jul 02, 2020",
      "content": "<div>If you use Shadowdancer instead of Rogue to qualify for ED, you only need 10 levels, or 11 for a late Tumble dump.  It would not require you to use a stealthy play style, unless you feel compelled to roleplay your classes.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:15 PM - Jul 02, 2020",
      "content": "<div><blockquote><div><cite>Empyre65 wrote: <div class=\"responsive-hide\">Jul 02, 2020</div></cite>If you use Shadowdancer instead of Rogue to qualify for ED, you only need 10 levels, or 11 for a late Tumble dump.  It would not require you to use a stealthy play style, unless you feel compelled to roleplay your classes.</div></blockquote>\nOh, that could be interesting, thanks Empyre! I would indeed like a late Tumble dump, but 11 SD means I could go for 19 DwD and 10 Fighter, thereby having another bonus feat to replace the feat I'd need to use for Mobility. As you rightly surmise, a stealthy tank isn't what I'm looking for - something of a self-contradiction when you're trying to pull enemies to you.<br/>\n<br/>\nI know Rogue brings lots of other goodies, but I'm going for something simple here, so it might just obfuscate matters (sometimes simple is hard work!). I'll go sharpen my pencil!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:03 PM - Jul 02, 2020",
      "content": "<div><blockquote><div>Tulip Brickhead</div></blockquote>\n\nThis breaks my head.<br/>\n<br/>\nTulip?  It's too elfy.  How about Black-Eyed Susan? I would also change Brickhead to Stoneskull, or Granitestirn or something similar.<br/>\n<br/>\nEspecially if going Shadowdancer, Black Eyed Susan would be a pretty good name (it is a form of Tulip).  Of course, for a male, this might not work so well.  How about Black-Eyed Stonehead?<br/>\n<br/>\nI really like the idea with Shadowdancer instead of Rogue.  I kind of imagine a Tunnelrunner sort of character, who is at home in the inky blackness of the deep roads...</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:39 PM - Jul 02, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Jul 02, 2020</div></cite><blockquote><div>Tulip Brickhead</div></blockquote>\n\nThis breaks my head.<br/>\n<br/>\nTulip?  It's too elfy.  How about Black-Eyed Susan? I would also change Brickhead to Stoneskull, or Granitestirn or something similar.<br/>\n<br/>\nEspecially if going Shadowdancer, Black Eyed Susan would be a pretty good name (it is a form of Tulip).  Of course, for a male, this might not work so well.  How about Black-Eyed Stonehead?<br/>\n<br/>\nI really like the idea with Shadowdancer instead of Rogue.  I kind of imagine a Tunnelrunner sort of character, who is at home in the inky blackness of the deep roads...</div></blockquote>\nLook, the name just popped into my fat head while I wasn't looking, and I liked it, so *<em>parp</em>*<span class=\"text-emoji\">😋</span>. I suspect that Brickhead came from a nickname we gave to our rugby team's hooker (no, not that sort), whose head did look like an upended brick. I was his loose-head prop, with the nickname of Donkey, which was fine by me! Even though it actually meant it was me did all the donkey-work while others got the glory. Anyway, I digress...<br/>\n<br/>\nI've been looking at incorporating SD instead of Rogue, and it's not actually making things much better. Don't get me wrong, I'm not dismissing it, I just think maybe I need to do things differently in order to best make use of the class. I confess, I do like the idea of a Tunnelrunner barreling down those deep paths until nasties appear, then standing stock still and drawing in his brows...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Sarthrovar",
      "avatar": "no_avatar.png",
      "timestamp": "3:10 AM - Jul 03, 2020",
      "content": "<div><blockquote><div>rugby team's hooker (no, not that sort)</div></blockquote>\nThank you for this <span class=\"text-emoji\">😂</span> that made my week better. And I learned something about rugby.<br/>\n<br/>\nI recently went spelunking in the archives for Dex-based DwDs (I'm on a binge trying out builds or build concepts on EE that I didn't play when NWN first came out)...<br/>\n<br/>\nPutting the highlights that I found into spoiler in case you don't want to see full builds.\n<details><summary>Spoiler</summary><a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build148006.html\" rel=\"noreferrer\" target=\"_blank\">Syrath's Movable Wall (F 8 / DwD 22 / SD 10)</a><a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build217356.html\" rel=\"noreferrer\" target=\"_blank\">Jennalee's Blessed Dodging Defender (Rogue 16 / DwD 14 / CoT 10)</a><a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build218378.html\" rel=\"noreferrer\" target=\"_blank\">Kail Pendragon's Concealed Wall V.3 (Rogue 24 / DwD 14 / F 2)</a><a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build249776.html\" rel=\"noreferrer\" target=\"_blank\">ArticDwar900's Defensive Dexer (F 13 / DwD 26 / R 1)</a></details></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:38 AM - Jul 03, 2020",
      "content": "<div>I think you could start with the requirements for Epic Dodge:<br/>\n- Shadowdancer 10<br/>\n- Rogue 13<br/>\n- Monk 9 SD 5<br/>\n- Rogue 10 SD 5<br/>\n- Monk 9 Rogue 10<br/>\n<br/>\nConsider adding a level of a tumble class if you want to get Epic Dodge asap, so there can be a tumble dump late.<br/>\n<br/>\nThen add DD (and whatever third class you wish, if there isn't one)<br/>\n<br/>\nA fighter 8 SD 10 DD 22 might be interesting? It will have evasion, and wont be totally ineffective in terms of damage with epic weapon specialization without being overpowering with too much sneak attack.<br/>\nSame with Ranger SD 10 DD, or even paladin <br/>\n<br/>\nHope that helps<br/>\n<br/>\n<strong>Edit:</strong> noted Sathrovar's links with many thanks!<br/>\n<br/>\nI like syrath1001's <a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build148006.html\" rel=\"noreferrer\" target=\"_blank\">Movable Wall</a>, except change the rapier to a handaxe as per your preference, and other preferences. <br/>\nIt combines Epic Damage Reduction 3 (total DR 24/-), Epic Dodge, Evasion, HiPS, AB 41, Epic Weapon Specialization for +6 damage, and Str 14 for +2-8 damage.<br/>\nEpic Weapon Specialization is pretty quick at level 21, that is an excellent feature of the build. <br/>\nEDR I-III is pretty late at levels 31-35. I would move this earlier, in fact as soon as possible.<br/>\nEpic Dodge is pretty late, at level 39 but with dwarven defender, great HP, evasion and HiPS this feels more like the \"icing on the cake\" or the \"cherry on top\". <br/>\nI think this would turn out to be a very nice party tank in a challenging environment.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:08 AM - Jul 03, 2020",
      "content": "<div>Interesting character concept, Stag!<br/>\nThe name gives me completely different associations though. <br/>\nTulip Brickhead is a female gnome. <br/>\nShe is of the renown Brickhead clan, known for their quality stoneskin spells. <br/>\nShe is a jester. Her parents believed that they were gong to have a boy and wanted to call him Turnip. But she fooled them, being a girl and everything. So Turnip was hastily changed to Tulip. <br/>\n<br/>\nAs for alignment she is chaotic good, a free spirit, not tied down by tradition. But she knows the family secret and can do stoneskin quite well.<br/>\nThat brings us to the question of class.  Maybe my mind is playing tricks on me, or perhaps she is, but I see her as a rogue. She has a bit of wizard from her family background. She may well be a jester, but not in the sense of being an artist, but even so, she is not without some charm. <br/>\nSo here we almost have a MAD build with dexterity, intelligence and charisma. Lucky she gets some constitution for free.<br/>\nED should be within reach, but she will never be a DC caster and probably never reaches any degree of indispellability. <br/>\n<br/>\nSo there is my go at Tulip. Not at all what you had in mind, alas.<br/>\n<br/>\n<br/>\nNow as to your project. Simple is work, I couldn't agree more.<br/>\nSometimes that work is just throwing out the things on your whish list that you really don't need.<br/>\nUnless you find a synergy, most things you add to a build come at a cost. <br/>\nEDR III and ED is possible in a dwd build with a given class combo. But you are getting close to a MAD build, even if you say he is a dexer to begin with. MAD builds are much more easy with RDD, but then we talk strength builds. With dex builds you have the option to take a class that offers great dex as an epic bonus feat to boost dexterity. But none of those classes help qualify for ED other than to have tumble as a class skill.<br/>\nSorry, but life is a b****sometimes.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:31 PM - Jul 03, 2020",
      "content": "<div>Many thanks, one and all!<br/>\n<br/>\nI suspect that there is no scintillating answer to my quandary - plenty of adequate ones, but nothing that shines out as worthy of inclusion within the annals of our Guild (not wishing to decry the builds <em>@Sarthrovar</em> cites). I guess that's due to having to spread oneself too thin in order to get too much in, thereby diluting the whole (as Mick hints at) - both in terms of the number of levels one has to invest in a class in order to make use of just one feat, and the stat spread.<br/>\n<br/>\nI think the itch has been scratched for now. It'll hang around as a bit of a niggle for a while, and I may well return to it later. Oh well.<br/>\n<br/>\nThanks again, all. <span class=\"text-emoji\">👍</span><br/>\n<br/>\nOh, and I do like your take on the name, Mick! <span class=\"text-emoji\">😅</span></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:11 AM - Jul 04, 2020",
      "content": "<div>I’ll go dig up my Rogue Dwd build and compare later tonight.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "10:04 PM - Jul 06, 2020",
      "content": "<div>Hey Stag !<br/>\n<br/>\nDon't forget this little gem from the Dwarflord<br/>\n<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build213875.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 13875.html</a></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:08 PM - Jul 06, 2020",
      "content": "<div>Thanks Kalistez - another great build from the Dwarflord!<br/>\n<br/>\nMaybe part of my problem was wedding myself to DwD for more DR. I'll continue my mulling...<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    }
  ],
  "author-color": "#AA0000"
}