{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "186",
  "name": "Arelith Warlocks 2.0: Viability",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-warlocks-2-0-viability-t2354316.html",
  "author": "Thell",
  "avatar": "no_avatar.png",
  "replies": 3,
  "posts": [
    {
      "author": "Thell",
      "avatar": "no_avatar.png",
      "timestamp": "3:31 PM - Sep 13, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hey fellas<br/>\n<br/>\n So, I'm back again and I'd appreciate hearing an expert opinion. Arelith has long had a class called the warlock, which was possibly the single worst class in the entire history of NWN for PvP. Not joking, it really was that awful, it made my harper scout look OP.<br/>\n<br/>\n Now they've totally overhauled it, and I'm actually quite tempted to give it a go. I've got a DEX based build in mind but I'd appreciate any suggestions for making the most of it.<br/>\n<br/>\n the class comes in two different flavours; giving different spells and immunitiess are.....<br/>\n<br/>\n Bard Base- Loses Bard Song and acess to Curse song. All other skills and feats available remain the same except...<br/>\n<br/>\n - Must be Non-Good<br/>\n - Gains d8 rather than d6 HP per level<br/>\n - Gains Uncanny Dodge at level 10, 5/- damage resistance at level 20, and 10/- at level 30 to all physical types (piercing/slashing/bludgeoning)<br/>\n - 5/10/15 DR at the above levels to two elements (Acid and Fire for Fiends, Cold and Electricity for Fey)<br/>\n - Innate -20% Arcane Spell failure (Other Spell Failure reducing Medium armour and Large Shields are available too)<br/>\n - Warlocks have unlimited spells per day, with no cooldown and whenever the Warlock casts a spell that targets a hostile opponent, unless it's a Charm/Dominate spell - they do 1d4/level damage (applying only to the direct target of the spell, casting Confusion will deal damage to the target and force them and everyone around them to make a save or be affected, but only the main target takes damage) of an element depending on the pact. Fey Warlocks can pick and switch between Magic, Cold and Electrical damage while Fiends have Magic, Fire and Acid.<br/>\n -All spells otherwise work as normal when cast on the floor or party members. When cast directly on hostiles the target has to fail a touch attack roll, otherwise they avoid both the damage and the spell itself!<br/>\n<br/>\n The Spells they get are.....<pre>      Fey                            Fiend\n  1   Daze (0), Light (0)            Flare (0), Light (0)         \n  2   Sleep (1), Exp Ret (1)         Summon Creature (1), Lesser Dispel (1)\n  3   Mage Armor (1)                 Balagarn's Iron Horn (1)\n  4   Tasha's Laughter (2)           Bull's Strength (2)\n  5   Cure Minor (0)                 Resistance (0), Grease (1)\n  6   Charm Person (1)               Protection from Alignment (1)\n  7   Displacement (3)               Bestow Curse (3)\n  8   Hold Person (2)                Summon Creature (2)\n  9   Ghostly Visage (2)             Darkness (2)\n  10  Hold Monster (4)               Dismissal (4)\n  11  Invisibility (2)               Ultravision (2)\n      Cloud of Bewilder (2)          Gust of Wind (3)\n  12  Slow (3)                       Summon Creature (3)\n  13  Mind Fog (5), Charm Monster(3) See Invis (2)\n  14          Dispel Magic (3), Eagle's Splendour (2)\n  15  Haste (3)                      Fear (3)\n  16                   Energy Buffer (6)     \n  17  Dominate Person (4)            Summon Creature (4)                 \n  18  Improved Invis (4)             Cat's Grace (2)\n  19  Confusion (3)                  War Cry (4) \n  20  Mass Haste (6)                 Summon Creature (5)\n  21\n  22                 Greater Dispelling (5)\n  23           \n  24                           \n  25  Dirge (6)                      Summon Creature (6)\n  26                       \n  27\n  28  Ethereal Visage (5)            Ice Storm (6)\n  29\n  30</pre>Summon Monster Spells cast by the fiend are improved, and each one summons a fiend of seemingly decent power (Summon I summons a Level 6 Worg). Warlocks with Greater Spell Focus Conjuration and Summon Creature VI supposedly gain an especially powerful summon (which I've heard is comparable to the Balor Summoned by Gate).<br/>\n<br/>\n So...What do you think fellas? I was considering some Dex based Fey/Monk/Blackguard but I'm not sure, I mean the seeming uselessness of some fo the fiend spells puts me off but I can see pretty clearly that a level 30 Ice Storm with 30d4 extra damage followed by another quickened/hasted spell would hurt a lot. Mechanics on Arelith are by and large mostly close to vanilla, the main restrictions being on building are that you must take 3 levels consecutivley of a class while levelling up (So Bard/Bard/Bard/Monk is alright but Bogue/Rogue/Monk isn't), PDK is banned, RDD and Shifter are off limits to people who don't spend 20 hours a day on the server grinding PC's up to thrity to sacrifice for a 5% win chance lottery roll (PM is attainable, but not as easily as the other prestige classes) and you cannot keep levels in an alignment restricted class if you are no longer of that alignment (so no Neutral Blackguards and the like).<br/>\n<br/>\n Cheers fellas<br/>\n<br/>\n Thell<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:01 PM - Sep 15, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hmm, it seems to me that the class they made and the intentions behind it, contradict themselves.<br/>\n<br/>\n Let me explain, Bard's spell list isn't made for offense and it is mostly buffs, but wiithout the powerful bard song// curse song he looses half of his melee power, not to mention that your party looses those powerful buffs/ de-buffs too.<br/>\n<br/>\n But there is something that is really good if you have unlimited spell slots, <strong>Ice Storm</strong> has no save and with unlimited slots plus the bonus 6d4 damage, it can be very-very good.<br/>\n<br/>\n If you want to play a melee compatand though, even all of these buffs they made to the Warlock Class aren't worth it. <strong>Bard Song, is that powerful</strong>! And it is even more powerful in your low magic world that has only 30 lvls.<br/>\n<br/>\n<br/>\n Just my opinion of course, with the limited knowledge that i have for Arelith,<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Templar",
      "avatar": "10235261_1528181864.jpg",
      "timestamp": "11:00 AM - Jan 06, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">the new warlock class isn't really a melee build... or pvp at all... its a support build that loses most of its spells but is able to cast the ones it can (on the list) unlimited number of times. the big bonus is any spell it casts that is offensive does 1d4/level of damage on the targeted creature. add haste, thats 1d4/lvl twice per round.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Noromical",
      "avatar": "no_avatar.png",
      "timestamp": "4:26 PM - Jan 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I play an abyssal lock myself, and from what I've seen, they're the most offensive-capable. Sending in the summon can soak up a lot of damage, for the crowds, grease spell works wonders, 2-3 and they can't keep their feet. I run only 13 STR, and 18 DEX, but a Bull's Strength before combat or two brings you up to 18. Flare can help mitigate damage to you or your summon, and bestow curse is powerful when used in the right spots. Mind you, these are low level spells, but a quick bestow curse can drop your target's hp, AC, and AB down by at least one point, but that 1 point can be all you need. 1d4/lvl doesn't sound like much, but keep in mind, you'll hit the fighter classes rather reliably with it, and weakening them before they get to you can be crucial to besting them. Most caster classes also lack the saves to beat your effects, my Drow Abyss-lock beat a cleric 3x her level and came out unscathed<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}