{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "773",
  "name": "Work in progress: zen archery cleric",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/work-in-progress-zen-archery-cleric-t2355230.html",
  "author": "elypzkou",
  "avatar": "10759180_1573383069.png",
  "replies": "11",
  "views": "2.4K",
  "posts": [
    {
      "author": "elypzkou",
      "avatar": "10759180_1573383069.png",
      "timestamp": "11:44 AM - Nov 10, 2019",
      "content": "<div>Good morning everyone, I am a new player to the neverwinter night scene but I am not completely new to dnd.<br/>\nI played a lot of pathfinder: kingmaker in the past which was <em>mildly</em> different lol, but it gave me a rough idea of what to expect going into neverwinter nights.<br/>\n<br/>\nI am playing on a server with a few odd settings: up to level 40 it's very low magic, with +5 items mostly dropping from bosses and some items being super rare. I had a friend help out with my first character (bard/rdd0) and eventually made it to level 40,  yet I still need to find one amulet of natural armor better than +3.<br/>\n<br/>\nHowever after you hit level 40 and you start doing epic dungeons things ramp up pretty quickly, there's knockdown immunity helmets, permanent haste bracers, death immunity belts and stuff like that. <br/>\nThe problem is that epic dungeons are super hard and my bard ends up as a buff dispenser most of the times, can't get too close or i die.<br/>\n<br/>\nSo with this in mind I decided to make something safer and my idea was a zen archery cleric. \n<div class=\"codebox\"><p>Code: <a href=\"#\" onclick=\"selectCode(this); return false;\">Select all</a></p><pre><code>RACE AND CLASSES\nhuman warrior (1) cleric (38) monk (1)\nnature domain, trickery domain\n\nSTARTING STATS\nSTR 8\nDEX 14\nCON 12\nWIS 18 (38)\nINT 12\nCHA 8\n\n\nLEVEL PROGRESSION\n\nwarrior- weapon focus longbow, point blank shot, rapid shot\ncleric--\ncleric-- thoughness / called shot\ncleric--\ncleric--\ncleric-- zen archery\ncleric--\ncleric-- \ncleric-- extend spell\ncleric--\ncleric--\ncleric-- empower spell\ncleric--\ncleric--\ncleric-- spell focus evocation\ncleric--\ncleric--\ncleric-- greater spell focus evocation\ncleric--\ncleric--\ncleric-- epic spell focus evocation\ncleric--\ncleric--\ncleric-- great wisdom 1, great wisdom 2\ncleric--\ncleric--\ncleric-- great wisdom 3, great wisdom 4\ncleric--\ncleric-- \ncleric-- great wisdom 5, great wisdom 6\ncleric--\ncleric-- \ncleric-- great wisdom 7, great wisdom 8\ncleric--\ncleric-- \ncleric-- great wisdom 9, great wisdom 10\ncleric--\ncleric--\nmonk  -- epic weapon focus longbow\ncleric-- armor skin\n\n\nSKILLS \nConcentration 43\nSpellcraft 43\nListen 42\nTumble 40\nHeal 10</code></pre></div>\nThis is just a theory build atm so there might be a few mistakes, before i fully commit to this new character i would like to ask a few questions.<br/>\nWhat do you think of called shot ? I read in a different thread that it's nice to have it but I am not sure I want to give up thoughness for it.<br/>\nOn the same note, rapid shot vs called shot ? Can i take a called shot and attack again or is it a full round action ?<br/>\n<br/>\nAnyways the idea is to make a cleric with high dc and high ac, with archery as a solid backup option if i run out of spells (dungeons are no-rest zones) or if i meet foes with too many saving throws.<br/>\n<br/>\nIf you have any questions or suggestions please let me know, hopefully i didn't get anything <em>too</em> wrong lol.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:44 PM - Nov 10, 2019",
      "content": "<div>Hello and welcome, elypzkou! Good to have you on board.<br/>\n<br/>\nI'll confess from the start that I know very little about clerics, so I'll just concentrate on other stuff and let people who know more give divine advice.<br/>\n<br/>\nFirst, I'd drop Toughness. An archer/caster shouldn't need a deep pool of hit points - they're trying to avoid getting hit by staying out of the action, right? I'm also not sure about Called Shot in this scenario - 1) with -4 to your AB (you'd have a total of 5 at level 3 with your current levelling, so subtracting 4 would give you a princely 1 - a 5% chance to even hit an enemy), you'd be taking it way too early. Blind Fight might be a better option. However, see below.<br/>\n<br/>\nI'm assuming you'd be taking all your Tumble points at level 39 (your monk level), which is great for a +8 boost to AC (and the +14 monk Wisdom AC bonus), but that's a hell of a long time to wait. Oh, and what sort of armour do you see yourself wearing? Presumably, you'd be shedding it for robes when you do take monk, or you'd lose that juicy Wisdom AC.<br/>\n<br/>\nPersonally, I'd think about taking your cleric feats earlier pre-epic and dropping Fighter to take some Champion of Torm levels later on (CoT also allows you to take Great Wisdom as an epic bonus feat, as well as giving bonus feats every other level up CoT 10, so you could build both Called Shot and Blind Fight in, and a +1 to all saves every other level). I'd also consider taking a few more levels of monk (at least 2 more, for the monk speed and +2 saves vs mind spells, as well as deflect arrows at level 2). Yes, that would mean dropping cleric levels down a few notches, but it would give you a lot more scope (and make playability easier at lower levels). Maybe a Cleric 26/ CoT 10/ Monk 4? But I'm straying into what cleric brings, about which I'm no help.<br/>\n<br/>\nAnyway, just my two-pennyworth.<br/>\n<br/>\nWelcome again!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:55 PM - Nov 10, 2019",
      "content": "<div>The Smooth Archer will solve all your problems.<br/>\n<br/>\nIn a nutshell :<br/>\n<blockquote><div>\nSmooth Archer<br/>\n<br/>\nHuman<br/>\n<br/>\nSmooth Archer (32 Cleric | 4 Fighter(6) | 4 Monk(2) )<br/>\n<br/>\nRace : Halfling<br/>\nAlignement : Any lawful<br/>\nPvP build in arena.<br/>\nPlayable range: 10-40 (10 to 21 maybe difficult but with damage spell ^^ its funny)<br/>\n<br/>\nStatistic :<br/>\nSTR : 6<br/>\nDEX : 16<br/>\nCON : 10<br/>\nINT : 14<br/>\nWIS : 18 (36)<br/>\nCHA : 8<br/>\n<br/>\nPros :<br/>\n- Good AB<br/>\n- Good AC<br/>\n- Good HP<br/>\n- 10 Greater restauration whitout wisdom bonus.<br/>\n- Cant be dispel by cleric (only by Mords)<br/>\nCons :<br/>\n- Low damage<br/>\n- Can be balagorn if Spell Ressistance is morded (46 SR )<br/>\n- No Conceal<br/>\n- Low discipline<br/>\n<br/>\nDamage :<br/>\n1D6 Physical<br/>\n4 (Mighty)<br/>\n5 Physical (Arrow)<br/>\n2 Magical<br/>\n5 Magical<br/>\n1 Slashing<br/>\n-----------<br/>\n18 Damage Minimum<br/>\n<br/>\nWith no buff :<br/>\nHP : 368<br/>\nAB (BaB : 26) : +42/+37/+32/+27<br/>\nAC : 36<br/>\n---Save :<br/>\n------Fort : 25<br/>\n------Reflex : 26<br/>\n------Will : 41<br/>\n<br/>\nWith buff :<br/>\nHP : 528<br/>\nAB : +58/+53/+48/+43<br/>\nAC : 61<br/>\n---Save :<br/>\n------Fort : 30<br/>\n------Reflex : 25<br/>\n------Will : 38<br/>\n<br/>\nWith buff and item +5 (CON, DEX and WIS):<br/>\nHP : 608<br/>\nAB : +67/+62/+57/+52<br/>\nAC : 72 (With no haste item)<br/>\n---Save :<br/>\n------Fort : 32 (No fortitude ring)<br/>\n------Reflex : 29<br/>\n------Will : 44<br/>\n<br/>\nSkill point:<br/>\n176<br/>\n40 ? Tumble<br/>\n43 ? Concentration (50 buffed)<br/>\n43 ? Heal (63 buffed)<br/>\n43 ? Discipline (48 buffed)<br/>\n7 ? Free!<br/>\n<br/>\nLevelling:<br/>\n01 ? Cleric (01) ? Domain : Plant, War || Extend Spell.<br/>\n02 ? Fighter (01) ? Weapon Focus : Short Bow<br/>\n03 ? Fighter (02) ? Point Blank Shot || Rapid Shot<br/>\n04 ? Fighter (03) ? Wisdom +1 (19)<br/>\n05 ? Fighter (04) ? Weapon Specialization : Short Bow<br/>\n06 ? Cleric (02) ? Zen Archery<br/>\n07 ? Cleric (03) -<br/>\n08 ? Cleric (04) ? Wisdom +1 (20)<br/>\n09 ? Cleric (05) ? Maximize Spell<br/>\n10 ? Cleric (06) -<br/>\n11 ? Cleric (07) -<br/>\n12 ? Cleric (08) ? Wisdom +1 (21) || Improved Critical : Short Bow<br/>\n13 ? Cleric (09) -<br/>\n14 ? Cleric (10) -<br/>\n15 ? Cleric (11) ? Toughness (Or Expertise)<br/>\n16 ? Cleric (12) ? Wisdom +1 (22)<br/>\n17 ? Cleric (13) -<br/>\n18 ? Cleric (14) ? Blind Fight (Or Improved Expertise)<br/>\n19 ? Cleric (15) -<br/>\n20 ? Cleric (16) ? Wisdom +1 (23)<br/>\n21 ? Monk (01) ? Armor Skin<br/>\n22 ? Monk (02) (Fighter) -<br/>\n23 ? Monk (03) (Cleric) -<br/>\n24 ? Cleric (17) ? Wisdom +1 (24) || Epic Weapon Focus : Short Bow<br/>\n25 ? Cleric (18) -<br/>\n26 ? Cleric (19) (Fighter) -<br/>\n27 ? Cleric (20) ? Great Wisdom 1<br/>\n28 ? Cleric (21) ? Wisdom +1 (26) || Great Wisdom 2<br/>\n29 ? Cleric (22) -<br/>\n30 ? Cleric (23) ? Great Wisdom 3<br/>\n31 ? Cleric (24) ? Great Wisdom 4<br/>\n32 ? Cleric (25) ? Wisdom +1 (30)<br/>\n33 ? Cleric (26) ? Great Wisdom 5<br/>\n34 ? Cleric (27) ? Great Wisdom 6<br/>\n35 ? Cleric (28) -<br/>\n36 ? Cleric (29) ? Wisdom +1 (33) || Great Wisdom 7<br/>\n37 ? Cleric (30) ? Great Wisdom 8<br/>\n38 ? Cleric (31) -<br/>\n39 ? Cleric (32) - Epic Prowess<br/>\n40 ? Monk (04) ? Wisdom +1 (36)<br/>\n<br/>\nSpell set :<br/>\n1- (4) Entropic Shield , (4) Protection from Alignement , (1) Remove Fear , (1) Bless , (2) Divine Favor.<br/>\n2- (2) Extend : Bless , (2) Extend : Shield of Faith , (5) Extend : Divine Favor<br/>\n3- (2) Extend : Aid , (2) Extend : Barskin , (2) Extend : Ultravision , (2) Extend : Darkness , (1) Extend : Silence.<br/>\n4- (2) Extend : Magic Vestement , (2) Extend : Prayer , (2) Extend : Negative Energy Protection, (2) Extend : Invisibility Purge , (1) Restauration.<br/>\n5- (1) Extend : Death Ward , (2) Maximize : Endurance , (2) Extend : Divine Power , (2) Maximize : Owl Wisdom, (2) Maximize : Cat Grace.<br/>\n6- (2) Extend : Spell Ressistance , (2) Extend : True Seeing , (2) Extend : Battletide , (1) Harm.<br/>\n7- (2) Word of Faith , (5) Greater Restauration.<br/>\n8- (2) Extend : Aura of Vitality , (5) Extend : Greater Restauration.<br/>\n9- (2) Extend : Aura versus Element , (5) Undeath?s Eternal Foe.<br/>\n</div></blockquote>\n\nThe funny thing about this build is that although it was made for PvP, it is really successful in a PvE, especially with low magic levels.<br/>\n<br/>\nI play this build as a Halfling, but note that if you do, it is going to get an XP penalty.  You can also replace the Shortbow with a Longbow if Human, or a Heavy Crossbow if you like - but then you will need to squeeze in Rapid Reload somewhere.  Note that Halflings can use a Heavy Crossbow (don't ask me why).</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:02 PM - Nov 10, 2019",
      "content": "<div>Hello and welcome elypzkou!<br/>\n<br/>\nIt sounds like you are looking for a powerful level 40+ optimised cleric zen archer. Stag has made some good comments already, and others may give input, so my input shall be to direct you to some level 40+ optimised cleric zen archer builds to see what you might want to add.<br/>\n<br/>\nProbably the most famous level 40+ optimised cleric zen archer is the so called '<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/demolition-man-cleric-38-monk-1-rogue-1-t515420.html\" rel=\"noreferrer\" target=\"_blank\">Demolition Man</a>' by Maximillan Kane. It has been very extensively play tested.<br/>\n<br/>\nMy view is that in an environment without powerful ammunition or the ability to buff such ammunition (ie a non-WoG environment), it might lack damage.<br/>\n<br/>\nSo I personally have been working on a few zen archer builds adding divine damage or other cool stuff might be more optimal. <br/>\n<br/>\nI made a simple modification to the Demolition Man build to add divine damage, its called <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/divine-demolition-man-cleric-38-monk-1-paladin-1-t2355225.html\" rel=\"noreferrer\" target=\"_blank\">Divine Demolition Man</a>. Not yet play tested so I've put it in the unfinished section but feel free to have a look and see if there are features that might improve your build<br/>\n<br/>\nI also like Druids and having lots of spells plus turning into a dragon sounds cool when in close range, so I made a divine damage zen archer with Druid level 9 undispellable spells and Cleric level 8 spells, its less of a DC caster than more of a versatile type build. See Divine Damage Druid Dragon Shape Zen Archer <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/divine-damage-druid-dragon-zen-archer-druid-37-cle-t2355226.html#p17611\" rel=\"noreferrer\" target=\"_blank\">post 5</a> of thread. Its more of a druid with cleric spells to buff zen archery stuff (or dragon shape). I'm in the process of play testing this so again its in the unfinished section.<br/>\n<br/>\nHope these three builds help you with your quest.<br/>\n<br/>\nBy the way, in case you weren't aware, I find Kamiryn's <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/other/tool/characterbuildcalculator-cbc\" rel=\"noreferrer\" target=\"_blank\">Character Build Calculator Excel Spreadsheet</a> a useful tool for designing builds. <br/>\n<br/>\n<strong>Edit:</strong> Heh I've been ninja'ed by Web. Web's build is very nice, it gets +6 damage from WS/EWS which is a very elegant solution reducing investment in Divine Damage, that is something to consider too!</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:44 PM - Nov 10, 2019",
      "content": "<div>I tend to rely on builds that do not have X number a day type things as much as possible - because, IMO, they tend to run out exactly when one wants (or needs) to use them, often leaving one stuck with a dirtnap or timesink!<br/>\n<blockquote><div><em><strong>Divine Might</strong></em><br/>\nPrereqs: turn undead, charisma 13+, strength 13+, power attack<br/>\n<br/>\n<strong>Specifics:</strong> The character may spend one of his <em>turn undead</em> attempts to add his charisma bonus to all weapon damage for a number of rounds equal to the charisma bonus. <br/>\n</div></blockquote>\n\nThis is why I just do not like DM (and DS) - because you basically are needing 3 main stats here - Str, Wis, Cha.<br/>\n<br/>\nThat spreads things too thin IMO.<br/>\n<br/>\nThe Smooth Archer gets around this by investing in ONE stat!  One.  <br/>\n<br/>\nThis makes it superior for a number of reasons - 1, is that Wis as the main casting stat of Clerics means that one can have really good Spell DCs (Implosion hell!), and also, more of them.<br/>\n<br/>\nSecond, Wis is a main stat for Monks, as it gives them unreducible AC - meaning that one cannot loose it (iirc).<br/>\n<br/>\nThree, with Zen Archery, it is used as the main AB stat!<br/>\n<br/>\nSince The Smooth Archer has basically scavenged other stats to further pump Wis, this does mean that it really needs to focus on Archery (or Crossbow).  Of course, with the ability to cast Divine Power, that then becomes a fairly moot point later on.<br/>\n<br/>\nI will say that this build does suffer at beginning levels due to the extremely low str - which will prevent one from armoring up if str items are not available - one may wish to redistribute a few points from Dex to Str to accomodate this (and avoid Halfling).<br/>\n<br/>\nSo now the good news!  A Crossbow is not affected by a low str!  That's right, unlike other missle weapons, a Crossbow is not affected by low Str here - so it makes for a really good weapon in this build!  It also has higher damage and a better crit range than a bow.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:06 PM - Nov 10, 2019",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Nov 10, 2019</div></cite>\nSo now the good news!  A Crossbow is not affected by a low str!  That's right, unlike other missle weapons, a Crossbow is not affected by low Str here - so it makes for a really good weapon in this build!  It also has higher damage and a better crit range than a bow.</div></blockquote>\nJust remember to take Rapid Reload rather than Rapid Shot.<br/>\n<br/>\nOh, and you're right, webshaman, monk Wis AC is not affected by such nasty things as sneak attacks. Though, to be fair, I can't recall whether it's blown if you've been knocked down. Nonetheless, a high Wis monk has less need of UD than other Dexers (apart from DwD, of course).</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "elypzkou",
      "avatar": "10759180_1573383069.png",
      "timestamp": "5:49 PM - Nov 10, 2019",
      "content": "<div>whoa guys thank you for all these helpful tips, it will take me a while to go through all the builds posted here but I will try to reply to everyone.<br/>\nI already like the halfling zen archer, for some reason i thought halflings couldn't use bows at all, didn't realize shortbows are smaller than longbows lol.<br/>\n<br/>\nI'll get back to you in a few minutes, thanks again for the help !<br/>\n<br/>\n<strong>Update: </strong>so far the smooth archer is the one i like the most. It pushes AB and AC even higher than what i tried to do and the DC loss is minimal, very intresting concept, my only concern is the first few levels look though. If i can get a party going with other new players this is definitely one build i want to try though.<br/>\n<br/>\n<em class=\"mention\">@Stagmeister</em> good point about  called shot, blind fight would work best here. I also found out that in order to keep dodge AC vs unseen enemies blind fight is required,  listen alone is not enough. So this feat slot would definitely go to blind fight.<br/>\nAs for how I would level up, mostly as a fighter, plate armor and longbow, supported by cleric buffs and summoning spells. This shouldn't be too hard with how frontloaded a human fighter is when it comes to feats. CoT is another option here but i could only take it later down the line and the first levels would be a bit harder. Good call about going at least 3 monk though, the class  spread between monk and fighter is one of the things that I am considering atm.<br/>\n<br/>\n<em class=\"mention\">@Orion2019</em>  the demolition man looks very strong in a pvp situation but i think it's a bit too specialized compared to what i'm trying to do. Stealth + DC is a tempting option when you want to nuke unsuspecting folks (wish monks didn't have to be lawful, so i could roleplay this as chaotic neutral lol) but i want to be strong with a bow for dungeons :S <br/>\nOn a different note: good to know there is a tool to make builds easier to read, i was wondering how everybody else was formatting theirs and this answers it. Thanks !<br/>\n<br/>\nFinally i have a question about crossbows as i never really played around with those.<br/>\nDoes rapid reload stack with rapid fire ? Or are they exclusive ?<br/>\nIf I decide to go with halfling the heavy crossbow might be a good alternative to the shortbow, i just don't know if i can carry it around with 6 base strength lol. How heavy are we talking about, exactly ?</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:24 PM - Nov 10, 2019",
      "content": "<div>Hehe elypzkou now you know why this place is the best<br/>\n<br/>\nI am a subscriber to the concept of 'moar damage' pls<br/>\n<br/>\nWas wondering if I could modify web's awesome build to add divine damage<br/>\n<br/>\nHere it is. Still has a Base ranged AB of 40 so its playable<br/>\n<br/>\nI wanted a lot of skill points if I went elf for this build, for keen senses + search/listen<br/>\n<br/>\nCons is the dump stat here which is ok if one is an archer with summons, but I added toughness for a bit of survivability against IGMS spam <br/>\n<br/>\nCalled shot would have been nice to fit in, if one can deal with having less HP then swap toughness for that<br/>\n<br/>\nGonna be a bit reliant on +cha buffs / items to use DM early on but need to hit em <br/>\n<br/>\n20% exp penalty from level 12. 40% penalty at level 40 onwards (not sure if that matters in your environment?)<br/>\n<br/>\nI dont know about the interaction between DM and haste, I think one can cast DM + spell in a round, but not sure about DM + attacking in a round<br/>\n<br/>\nAnd with domains just choose what you want, trickery and travel is my preference <br/>\n<details><summary>Spoiler</summary>Cleric(33), Fighter(6), Monk(1), Elf\nSTR: 13\nCON: 6\nINT: 14\n\n01: Fighter(1): Point Blank Shot, Power Attack\n03: Cleric(1): Divine Might, Trickery, Travel\n05: Cleric(3)\n07: Fighter(4): Weapon Specialisation: Longbow\n09: Cleric(5): Rapid Shot\n11: Cleric(6)\n13: Cleric(8)\n15: Cleric(10): Extend Spell\n17: Cleric(12)\n19: Cleric(14)\n21: Fighter(6): Epic Weapon Focus: Longbow, Epic Weapon Specialisation: Longbow\n23: Cleric(17)\n25: Cleric(19)\n27: Cleric(21): Empower Spell\n29: Cleric(23): Great Wisdom I, (WIS=24)\n31: Cleric(25)\n33: Cleric(27): Great Wisdom IV, (WIS=28)\n35: Cleric(29): Great Wisdom V, (WIS=29)\n37: Cleric(31)\n39: Cleric(33): Great Charisma II, (CHA=17)\n\nSkillpoints: 174\nSaving Throw bonuses: Spells: +3, Mind Effects: +2\nAB (max, naked): 28 (melee), 40 (ranged)\nSpell Casting: Cleric(9)\n\n\n01: Concentration(4), Discipline(4), Open Lock(1), Search(2), Save(2), \n03: Concentration(1), Search(1), Spellcraft(5), \n05: Concentration(1), Search(1), Spellcraft(1), Save(1), \n07: Concentration(1), Discipline(1), Search(1), \n09: Concentration(1), Search(1), Spellcraft(1), \n11: Concentration(1), Spellcraft(1), Save(2), \n13: Concentration(1), Save(8), \n15: Concentration(1), Save(14), \n17: Concentration(1), Save(20), \n19: Concentration(1), Save(26), \n21: Concentration(1), Discipline(11), Save(21), \n23: Concentration(1), Save(27), \n25: Concentration(1), Save(33), \n27: Concentration(1), Save(39), \n29: Concentration(1), Save(45), \n31: Concentration(1), Save(51), \n33: Concentration(1), Save(57), \n35: Concentration(1), Save(63), \n37: Concentration(1), Save(69), \n39: Concentration(1), Save(75), </details></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:16 PM - Nov 10, 2019",
      "content": "<div>Rapid Fire does not work with crossbows, while Rapid Reload works only with crossbows.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:04 PM - Nov 10, 2019",
      "content": "<div>With a Con of 6, I think a new definition of \"glass canon\" has been set! O_o<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:19 AM - Nov 11, 2019",
      "content": "<div>Hehe I heard and read about Papa Lenin built a 80hp Elven 'cheerleader' Sorceress on WoG (6 cons with d4 hit die = 2hp/level)<br/>\nThe ultimate glass cannon there!<br/>\nApparently Papa described it was easier to level than a pure fighter.... <span class=\"text-emoji\">😨</span></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:10 AM - Nov 11, 2019",
      "content": "<div>I agree, it is easier to level a Sorcerer than a pure Fighter on WoG - even a Sorcerer with only 20 hps at level 10!</div>"
    }
  ]
}