{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "009",
  "name": "Ranger-General",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/ranger-general-t2354822.html",
  "author": "Illusion",
  "avatar": "no_avatar.png",
  "replies": "0",
  "views": "705",
  "posts": [
    {
      "author": "Illusion",
      "avatar": "no_avatar.png",
      "timestamp": "10:02 PM - Feb 13, 2018",
      "content": "<div>All right, so I'm getting back into the game (EE is coming eventually, woo!). I thought about making an Elven Ranger, but.. here's the problem I have. I wanted to do a pure honest to good, ranger. I have no idea if that's viable or not. (As I never  got them to do beyond 3-4 dmg with a bow or melee even at 40.)<br/>\n<br/>\nAnyway, I was going to do one for Arelith (30 cap.) I haven't gotten far and I need some help. My intentions were a ranger that dual wielded (Dual Katanas at close) and a longbow at range. I think I got... sorta some levels in, but I need help. Trying to sorta go PvE, but avoiding being totally thrashed in Pvp.<br/>\n<br/>\n<br/>\nElf, Ranger (30, but can bend) Katana/Longbow<br/>\nSTR 12<br/>\nDEX 17 +2 Dex Gift<br/>\nCON 12<br/>\nWIS 14<br/>\nINT 14 (16) (+2 Int Gift)<br/>\nCHA 8<br/>\n<br/>\nRanger 1: Weapon Finesse, FE; Human<br/>\nRanger 2: ...<br/>\nRanger 3: Exotic Weapon<br/>\nRanger 4: +1 dex<br/>\nRanger: 5 SFE: Undead<br/>\nRanger 6: Expertise<br/>\nRanger 7:<br/>\nRanger 8: +1 dex<br/>\nRanger 9: Imp Crit Katana<br/>\n<br/>\n<br/>\nBeyond this point I don't have much idea. For skills, I'm not sure beyond 'Spot', Lore, Hide relating skills and maybe listen (if I can even take more than that.). I'll list the Ranger changes below so you might also have a better idea.<br/>\n<br/>\nFeats and Abilities\n<ul>\n<li>At level 4, receives Defensive Dual Wielding\n<ul>\n<li>This increases their AC when dual wielding (or wielding a double-sided weapon) by 1, and increases by 1 every 8 levels afterward</li>\n</ul>\n</li>\n<li>At level 5, first Studied Enemy (Essentially Favored Enemy, but I gotta kill like 100 of them, etc)</li>\n<li>At level 7, Woodland Stride feat.</li>\n<li>At level 7, Uncanny Dodge I feat.</li>\n<li>At level 9, Evasion feat.</li>\n<li>At level 16, they gain Hide in Plain Sight in \"natural\" areas.</li>\n</ul>\n\nOther Features\n<ul>\n<li>Skillpoints per level increased to 6.\n<ul>\n<li>They gain the skillpoints <strong>after</strong> taking the level, so they get to actually use the extra 2 that they get the next level. This is due to a mechanical limitation of the engine.</li>\n</ul>\n</li>\n<li>Rangers count toward one of the required classes to become Arcane archers. They still need to fill the other requirements (feats and race), but do not require a magic capable class (Bard, Wizard, Sorcerer).</li>\n<li>Characters with at least 3/4 of their character levels as Ranger will turn animals into Companions when successfully using the Animal Empathy skill. This allows a Ranger to have up to three followers (2 Companions and 1 Summon/Empathy Animal). Companions will not be released upon rest, but normal Empathy animals still will be.</li>\n</ul>\n<br/>\nSpell Changes included:<br/>\n<br/>\nFirst Circle<br/>\n<strong>Grease</strong>: Affected by Persistent Area spells changes. Has no spell resistance check.<strong><br/>\nEntangle</strong>: Affected by Persistent Area spells changes. Has no spell resistance check. <strong><br/>\nSummon Creature I (to IV)</strong>: Will summon creature one tier higher with Greater Spell Focus: Conjuration.<br/>\n<br/>\nSecond Circle<br/>\n<strong>Sleep</strong>: Works with any target with equal/lower level than caster's class level and affects (caster level + 1d4) hit dice worth of creatures. Empower Spell increases affected hit dice by 50%.<br/>\n<br/>\nThird Circle<br/>\n<strong>Blade Thirst</strong>: Duration increased to 1 Turn / Level. Enhancement Bonus has been changed to 2 + 1 / 5 levels beyond the 11th (i.e. +2 at level 11, +3 at level 16, +4 at level 21, +5 at level 26). Additionally, the enchanted weapon gains an equivalent amount of Vampiric Regeneration. Can be applied to magic/enchanted weapons. <strong><br/>\nGreater Magic Fang</strong>: Continues to scale past level 14. (+6 6/+6 at 17, +7 7/+7 at 20...)<br/>\n<br/>\nFourth Circle<br/>\n<strong>Freedom of Movement</strong>: Can be removed with spell breaches.</div>"
    }
  ]
}