{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "936",
  "name": "Dwarf Battle Cleric - LVL 40",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/dwarf-battle-cleric-lvl-40-t2354941.html",
  "author": "feuderali",
  "avatar": "no_avatar.png",
  "replies": "27",
  "views": "2.0K",
  "posts": [
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "6:42 AM - Sep 05, 2018",
      "content": "<div>Hi I've been trying to come up with an optimized level 40 build for a Dwarf battle/war cleric.  You'd think there'd be a ton of options however I can't find one that suits my needs.  They're mostly just taking a few (upto 15) cleric levels to get some self buffing then focussing on being melee.  I'd like one that has respectable divine spell casting, so mainly cleric levels with melee to support.  Other than cleric I don't care too much which classes get mixed in however I don't want RDD for this character and he must be good or neutral alignment so sadly BG is out (although a good option for this build). I also want to use warhammers so not a flurry of blows kama build.<br/>\nThis character will be levelled normally.  Being mainly cleric this shouldn't present a problem however it does mean I need to try and avoid the 20% xp penalty which unfortunately means cleric/paladin isn't an option really although it would fit well.<br/>\n<br/>\n1) PvM or PvP - PvM mainly although PvP is enabled on the server so should be a consideration. Definitely not a duelling build however.<br/>\n2) Level cap - 40<br/>\n3) Race preference - Must be a Dwarf.<br/>\n4) Class preference - As above, Cleric main + whatever.  Archetype: Dwarven Holy Warrior, Champion of Moradin/Clangeddin, War Priest.<br/>\n5) Melee preference - 1h and shield, warhammer, heavy plate.<br/>\n6) Range preference - Maybe a crossbow just for the utility, I don't want to waste feats investing in ranged though. I guess zen archery would be a great 1 feat investment for this guy tho so maybe.<br/>\n7) Weapon preference - Warhammer<br/>\n8) Maximum item enhancement - I'm not sure on the max but relatively low to medium magic so GMW, darkfire etc very useful. <br/>\n9) Spellcasting - As much cleric as I can fit in without gimping the melee side.  Mainly melee fighting with spells to buff, provide utility and as a supplementary offence. If possible I'd like to fit in a SF and GSF, and one arcane defence. However they're not game breaking.  <br/>\n10) Custom factors - I can adapt if there are.<br/>\n<br/>\nThanks guys!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:51 AM - Sep 05, 2018",
      "content": "<div>If you want a strong spellcaster then having at least 24-26 levels in the class is mandatory. Dwarfs favour fighters a lot, so 4-6 levels will give you a good boost in your damage and you can round-up the build with 10 levels of CoT without occurring an exp penalty at all. Then, ESF in evocation can be fit inside the build without a problem and although you won't have the best DC's for your spells (due to focus in strength) at least they can be decent that way. <br/>\n<br/>\nI don't have the time for a full build right now, but I will give you the fundamentals of the build and you tell me if you like it. <br/>\n<br/>\nStr16(<strong>28</strong>) Dex(8) Con(16) Int(14) Wis15(<strong>20</strong>) Cha(6) makes a nice starting point for a Cleric(26)/ Fighter(4)/ Champion of Torm(10) <br/>\nThe build is Cleric(12)/ Fighter(4)/ Champion of Torm(4) (pre-epic) <br/>\n<br/>\nWeapon focus, Improved Critical, Weapon Specialization, Blind-Fight, Knockdown, Improved Knockdown, Spell Focus, Greater Spell Focus, Extend Spell, Empower Spell, Maximize Spell, Toughness (pre-epic) <br/>\nEpic Weapon Focus, Epic Weapon Specialization, Epic Prowess, Armour Skin, Epic Spell Focus, Great Strength V, Great Wisdom II (epic) <br/>\n<br/>\nYour AB should be +40/ +35/ +30/ +25 with 4 attacks/round &amp; <br/>\nYour DMG should be 1d8+15/ 19-20x3 with a stock warhammer <br/>\n<br/>\nPretty respectable figures I would say, even before you think about buffing yourself...</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:30 AM - Sep 05, 2018",
      "content": "<div>A slight variant on that would be to have Cleric 17 / Fighter 3 at level 20 for a BAB of 15. You would have only 3 attacks on purpose, so Divine Power can give you the 4th attack at your full AB, instead of full AB-15. That would mean fewer pre-epic feats and more epic feats (Dev Crit?).<br/>\n<br/>\nNow that I think about it some more, I like Valerfor's idea more. Especially if you went for Dev Crit, it would cost you a lot of metamagic feats.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "10:45 AM - Sep 05, 2018",
      "content": "<div>Thanks guys I'll work on this later and post what I've come up with.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "5:10 PM - Sep 05, 2018",
      "content": "<div><br/>\n<blockquote><div><cite>Empyre65 wrote:</cite>, so Divine Power can give you the 4th attack at your full AB, instead of full AB-15.  (Dev Crit?).<br/>\n<br/>\n.</div></blockquote>\n\nThat has been patched. It comes out as -15. It wont help.<br/>\n<br/>\nI've played several variants of this. Con 22 with EDR and DwD. With 26 Cleric, even one with less.<br/>\n<br/>\nCleric 26/Bard4/RDD10 is a killer ofc. <br/>\n<br/>\nAlso the mentioned Fighter4/CoT10 for better saves and EWS. <br/>\n<br/>\nCleric18/F4/DwD18 is fun to play and hard to kill. But thes days I would have gone for Cleric 24-26. Those days I just avoided the dispellers where I played it.<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "8:28 PM - Sep 05, 2018",
      "content": "<div>Yeah my problem with DwD for this build is the initial stat investment required in dex.   You already have to boost 2 main stats and as it is I don't really like that your Charisma is so low in this build as a cleric, so trying to put 13 in starting dex is really stretching you imo.<br/>\n<br/>\nI'm working on Cleric/Ftr/CoT atm.  Alternatives I think would maybe be to drop CoT for 1 level of monk or rogue for cheese/UMD + skills. I don't think you really have enough skill points to cover everything to make the rogue splash worth while. Also as a cleric I'm not sure UMD is quite as important as it is for other classes.  Monk would be much better if it was a robe/kama build though and that's not what I want to go for with this guy.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "8:36 PM - Sep 05, 2018",
      "content": "<div>I had forgotten about the DEX requirement.<br/>\n<br/>\nI never took any CHA at all in my clerics tho, its too expensive with little payback. 6 is enough. 8 DEX and 10 INT. Should be enough for 16 in STR, CON and WIS? <br/>\n<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "12:06 AM - Sep 06, 2018",
      "content": "<div>Ok so this is my rough build atm.  I'm sure it can be improved.<br/>\n<br/>\n26/4/10  Cleric/Fighter/Champion of Torm<br/>\n<br/>\nStr 16(28) <br/>\nDex (8) <br/>\nCon(16)<br/>\nInt(14) <br/>\nWis15(20) <br/>\nCha(6)<br/>\n<br/>\nAB: 37/32/27/22<br/>\nAB: 40/35/30/25 with weapon of choice<br/>\n<br/>\nHP: 508<br/>\n<br/>\nLEVELING GUIDE:<br/>\n01) Cleric  (01): Extend Spell,  Domains: Your Choice (War, Str, Prot, Earth fit the concept but whatever you prefer depending on PW/module etc)<br/>\n02) Fighter (01): Weapon Focus<br/>\n03) Cleric  (02): Spell Focus<br/>\n04) Cleric  (03): {WIS +1}<br/>\n05) Cleric  (04): Empower Spell<br/>\n06) Cleric  (05): <br/>\n07) Fighter (02): Blind Fight<br/>\n08) Cleric  (06): {WIS +1}<br/>\n09) Cleric  (07): Greater Spell Focus<br/>\n10) Cleric  (08):<br/>\n11) Fighter (03):<br/>\n12) Cleric  (09): Max Spell, {WIS +1}<br/>\n13) Cleric  (10):<br/>\n14) Fighter (04): Weapon Spec.<br/>\n15) Cleric  (11): Toughness<br/>\n16) CoT     (01): {STR +1}<br/>\n17) CoT     (02): Improved Critical<br/>\n18) CoT     (03): Knockdown<br/>\n19) CoT     (04): Improved Knockdown <br/>\n20) Cleric  (12): Great STR I {STR +1}<br/>\n21) Cleric  (13): <br/>\n22) Cleric  (14): <br/>\n23) Cleric  (15):<br/>\n24) Cleric  (16): Armor Skin, {STR +1}<br/>\n25) Cleric  (17):<br/>\n26) Cleric  (18): <br/>\n27) Cleric  (19): Epic Weapon Focus<br/>\n28) Cleric  (20): {STR +1}<br/>\n29) Cleric  (21): <br/>\n30) Cleric  (22): Great STR II<br/>\n31) CoT     (05):<br/>\n32) CoT     (06): Epic Weapon Spec, {STR +1}<br/>\n33) CoT     (07): Great STR III<br/>\n34) CoT     (08): Epic Prowess<br/>\n35) CoT     (09): <br/>\n36) Cleric  (23): Grt Str IV , Grt WIS I {STR +1}<br/>\n37) Cleric  (24): <br/>\n38) Cleric  (25):<br/>\n39) CoT     (10): Expertise, Great STR V<br/>\n40) Cleric  (26): Great Wis II {STR +1}<br/>\n<br/>\nSome comments on it so far and where it can be improved:<br/>\n<br/>\nI start out as cleric beause I find summon animal is really useful for getting you past level 1 on hardcore / perma death servers. Especially when you start with little or no gear.<br/>\n<br/>\nYou can't cast 9th level spells naturally until level 36 which isn't good.   You're stuck at late levels with 2 Great Wis feats that you basically have to take though (only other options are epic spells).<br/>\n<br/>\nI had to front load the metamagic feats when arguably that's where they're less useful.  <br/>\n<br/>\nOne area where this can be improved, I'm taking Spell focus abjuration line because on the server I'm playing it helps with dispelling (likewise arcan defence abj gives +2 to beat dispel) so might be worth working in? <br/>\n<br/>\n\"<em>Dispel Magic: Spell Focus: Abjuration now adds +2 to dispel checks and Greater Spell Focus: Abjuration adds +4. If the target has Arcane Defense (Abjuration), dispel checks are lowered by 2\"</em><br/>\n<em>\"Greater Spell Breach:  Breaches 1 more effect with Greater Spell Focus: Abjuration. If the target has Arcane Defense (Abjuration), it will breach one buff less\"</em><br/>\n<br/>\nI can see the logic in ditching those feats entirely maybe if this guys caster level is considered decent enough to do without those.  That would open up 2/3 more feats. I think for a regular server I would ditch the spell focus feats entirely though.   Expertise is taken at lvl 39 because honestly there's nothing really better to take there but it's a bit late to be really useful.   I couldn't get Epic Spell focus in, presumably because my level order is messed up.  I'm guessing Expertise should be ESF.  I'm not sure on whether to keep spell focus in, if there's something really good I'm giving up maybe I'd drop it.  Would like to hear opinions on it.  I don't see the point in working in divine stuff with 6 charisma.  Dev Crit is probably not that useful for this build, the str is a bit low and warhammer is a poor choice for dev crit.  It would require changing (scimitar) the theme of the build a bit too much I think.<br/>\n<br/>\nI look forward to you tearing this all apart!!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:07 AM - Sep 06, 2018",
      "content": "<div>You can take Great Wisdom at level 24 as a general feat, and take Armor Skin as a Cleric feat later. That will give you earlier access to level 9 spells.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:25 AM - Sep 06, 2018",
      "content": "<div>When I envisioned this build I had in mind a couple of things,<br/>\na) you should end up with even scores in both wisdom &amp; strength pre-epic (18Str/ 18Wis)<br/>\nb) you should take ewf, ews, ep as CoT bonus feats &amp; armour skin, esf as Cleric bonus feats in epic<br/>\nc) all other great attribute feats should be taken with your epic general feats (exactly seven)<br/>\nd) maximize spell could be exchanged with expertise should you want it to, do not spend an epic feat for that<br/>\ne) you have an unused epic general feat at 21st level (these feats, all of them should be great attribute feats)<br/>\nf) there is no need to delay your fighter levels too much, get your combat feats fast and then you can focus on your caster ones  <br/>\n<br/>\nPersonally, I would not take these abjuration gimmicks of the server and instead focus on what you had in mind originally (evocation)<br/>\nFinally, yes, 26 CL is good enough (undispellable except mords), in fact, 26 CL was always the gold standard with Cleric builds.<br/>\n<br/>\nHope I helped a bit, I will have another look at your (improved) build later as well.</div>"
    },
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "2:20 AM - Sep 06, 2018",
      "content": "<div>Yeah you've definitely helped a lot.  I'll use both your suggestions and revise the build.  Valerfor your Abjurant champion build is my favourite build btw.  That's usually my goto for everything.  I'm just making this guy to try cleric for a change.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "6:11 AM - Sep 06, 2018",
      "content": "<div>Where du you put skills?<br/>\n<br/>\nTumble<br/>\nSpellcraft<br/>\nDiscipline<br/>\n<br/>\nAnd?<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:42 PM - Sep 06, 2018",
      "content": "<div>Concentration<br/>\nSpot</div>"
    },
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "7:46 PM - Sep 06, 2018",
      "content": "<div>26/4/10  Cleric/Fighter/Champion of Torm<br/>\n<br/>\nStr 16(28) <br/>\nDex (8) <br/>\nCon(16)<br/>\nInt(14) <br/>\nWis15(20) <br/>\nCha(6)<br/>\n<br/>\nAB: 37/32/27/22<br/>\nAB: 40/35/30/25 with weapon of choice<br/>\n<br/>\nHP: 508<br/>\n<br/>\nLEVELING GUIDE:<br/>\n01) Cleric  (01): Extend Spell,  Domains: Your Choice (War, Str, Prot, Earth fit the concept but whatever you prefer depending on PW/module etc)<br/>\n02) Fighter (01): Weapon Focus Warhammer (can replace with preferred weapon here)<br/>\n03) Cleric  (02): Spell Focus Evocation<br/>\n04) Cleric  (03): {WIS +1}<br/>\n05) Cleric  (04): Empower Spell<br/>\n06) Cleric  (05): <br/>\n07) Fighter (02): Blind Fight<br/>\n08) Cleric  (06): {WIS +1}<br/>\n09) Cleric  (07): Greater Spell Focus Evocation<br/>\n10) Cleric  (08):<br/>\n11) Fighter (03):<br/>\n12) Cleric  (09): Max Spell, {WIS +1}<br/>\n13) Cleric  (10):<br/>\n14) Fighter (04): Weapon Spec.<br/>\n15) Cleric  (11): Toughness<br/>\n16) CoT     (01): {STR +1}<br/>\n17) CoT     (02): Improved Critical<br/>\n18) CoT     (03): Knockdown<br/>\n19) CoT     (04): Improved Knockdown <br/>\n20) Cleric  (12): {STR +1}<br/>\n21) Cleric  (13): Great STR I<br/>\n22) Cleric  (14): <br/>\n23) Cleric  (15):<br/>\n24) Cleric  (16): Great Wis I, {STR +1}<br/>\n25) Cleric  (17):<br/>\n26) Cleric  (18): <br/>\n27) Cleric  (19): Epic Weapon Focus<br/>\n28) Cleric  (20): {STR +1}<br/>\n29) Cleric  (21): <br/>\n30) Cleric  (22): Great STR II<br/>\n31) CoT     (05):<br/>\n32) CoT     (06): Epic Weapon Spec, {STR +1}<br/>\n33) CoT     (07): Great STR III<br/>\n34) CoT     (08): Epic Prowess<br/>\n35) CoT     (09): <br/>\n36) Cleric  (23): Grt Str IV , Armor Skin {STR +1}<br/>\n37) Cleric  (24): <br/>\n38) Cleric  (25):<br/>\n39) CoT     (10): Epic Spell Focus, Great STR V<br/>\n40) Cleric  (26): Great Wis II {STR +1}<br/>\n<br/>\nThis is the fixed version.<br/>\n<br/>\nTaking Empyre65 and Valerfor's advice.  Expertise has been swapped out for ESF.  Great Wis I at level 24 and Armor SKin comes later.  This gives earlier access to level 9 spells.<br/>\n<br/>\nre: taking Fighter levels earlier. I felt like once you had martial weapons, it made more sense to focus on cleric so as not gimp your early spell casting too much. They could be rearranged however.<br/>\n<br/>\nI've tested the build out a bit, in a fairly low magic environment. It does fine, it doesn't feel like a power build like some RDD type build however but I suppose that's to be expected.  I think it could really use a decent periapt of wisdom or something to give you a bit more spell casting since the Wisdom is lower than if you were making a full lvl 40 epic cleric type build giving you a smaller range of spells available.  The melee is decent however once you're self buffed . I found damage reduction to be the main problem for this guy as individual melee hits aren't doing big damage and warhammer crits are fairly rare. Of course this is with mundane but self buffed gear.  If you can get +2d6 dmg +2d6 dmg type items then it's less relevant.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "7:50 PM - Sep 06, 2018",
      "content": "<div>If melee is decent, you're forgetting something. Divine Power and extended Divine Favor alone makes him a machine. Hou got Bless, Aid, Prayer and Battletide to get even farther. GMW Too. Should get you too 60. Or so.<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "9:20 PM - Sep 06, 2018",
      "content": "<div>Hi no I'm including all of that.  \"once you're self buffed\". I think AB gets up to 62 max with a maxed empowered bull's strength, and then 69 with war and strength domains active on top of that.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "9:48 PM - Sep 06, 2018",
      "content": "<div>Most times you can have the long terms up, and sprinkle the others now and then. Divine Power or Divine Favor should last you a while.<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "9:50 PM - Sep 06, 2018",
      "content": "<div>Yeah and if you take Str domain you can fit extended divine powers across two levels to give you more casts.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:30 PM - Sep 06, 2018",
      "content": "<div>This build has a buffed AB of 66 which is monstrous in Low-to-Medium magic worlds. Moreover, he can achieve 90-95% of that with self-buffs (domain powers not included) which makes him extremely reliable in any situation. I like your fixed version feuderali, it should do well in any module/PW. Your levelling/feat order could be improved somewhat but even like that it is fine. <br/>\n<br/>\nFor playability's sake, for example, I would take the two increases in strength first and then follow with the three wisdom increases (pre-epic). I would put \"toughness\" at 18th level and get the combat feats first and I would start with Fighter instead of Cleric so I can start with 5AB instead of 3AB. In epic levels I would take that 23rd Cleric level first, then start with CoT for example so I could get armour skin earlier and a CL increase or I would stop it at 20 then take all CoT levels asap to get my epic combat feats earlier and then continue with Cleric.<br/>\n<br/>\nThis stuff is nitpicking though and I feel you have done a good job overall with this build, you only need a good hammer (of thunderbolts) now and you are ready to go!</div>"
    },
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "11:01 PM - Sep 06, 2018",
      "content": "<div>Thanks Val, I will try to incorporate your suggestions and revise it.  I'm getting 62AB self buffed (69 with Str and War domains).<br/>\n  <br/>\nI really feel like starting as cleric is easier though.  In my experience you usually start out with no money, no decent gear and no potions.  As a fighter this means level 1 your're clenching your butt fighting every goblin hoping they don't get a lucky crit and send you back to character creation.  With a cleric you can send the badger of doom in and if he dies, summon another and then run for it so you can rest and try again.  I definitely think cleric is easier for getting over the starting hump, however that does depend on your server conditions I suppose.  I usually go for hardcore games and permadeath.  If you can start with some potions then fighter would be fine.<br/>\n<br/>\nI'm also considering dropping maximise spell as I don't find I'm using it.  What would you replace it with?  I think expertise is an obvious alternative, although zen archery would be good if you have limited rest restrictions in your game.  Early game you can send the summon in and snipe from a safe distance.  Once you get the tyrantfog zombie this could work pretty well.  So you could take Zen archery early and push the spell focus feats back a bit since early on they're not that useful.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:06 AM - Sep 07, 2018",
      "content": "<div>If you are referring to permadeath worlds and so on then you are probably right feuderali, but even on WoG (which is a hard PW), you can start with a bunch of healing potions which is why I figured a strong starting AB was preferable. <br/>\n<br/>\nAbout the final maximum AB this is always calculated as (Base AB +20 AB max from various bonuses +6 AB from max strength) and then there are the de-buffs (curse song, prayer, taunt etc) and the \"feats\" which is mainly the \"smite\" ability. If you see anything else on your character sheet then ignore it, it isn't very accurate, the combat log is much better. The character sheet also does not take into account stuff like size modifiers (Dragonshape AB, AC) and so on. <br/>\n<br/>\nFinally, the feat choice is entirely up to you and all you have said would be a good choice, however, I have seen some very good results by using \"scribe scroll\" or \"craft wand\". It is very handy to have 100 Heal scrolls ready in your scroll case, or a wand with 50 charges of Darkfire ready to use and since I see that you want to have as much magical power as possible, then I feel one of these feats would be a good alternative to (Zen archery, Expertise).</div>"
    },
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "1:15 AM - Sep 07, 2018",
      "content": "<div>Yes you're right those are definitely good choices.  I'm so used to playing with an alternative crafting system that the option never occurred to me.  I think I'd take a crafting skill.  Also crafting 'find traps' and 'knock' items are great for a character with no rogue skills/pixie.  You'd need to get knock through your domains though.<br/>\n<br/>\nAbout the AB, yes I'm just going by the character sheet once fully buffed. I'm not taking debuffs into account.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:16 AM - Sep 07, 2018",
      "content": "<div>NPCs will identify you as what you take at level 1, so if you want to be known as a Cleric, take Cleric at level 1. A nitpicking tweak I would add is to wait to take the 2nd level of Fighter until you have the 11th level of Cleric so you can get the Heal spell as soon as possible.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "2:02 AM - Sep 11, 2018",
      "content": "<div>I finalized this build.  I've taken on board the suggestions in this thread, with the exception of starting as fighter, I still start as cleric as that's a preference I have for this build.  I've tried to front load the combat feats a bit more, although some have to be taken as bonus fighter/CoT feats and therefore there's somewhat of a restriction on the order they can be taken in.<br/>\n<br/>\nHope you guys like it.<br/>\n<br/>\nSkills points are a bit short on this build, skills are:<br/>\n<br/>\nConcentration, Discipline and spellcraft maxed as class skills.  You can also max Spot as a CoT class skill <strong>or</strong> put those points into Tumble as a cross class skill.  Obviously if the server/module you play has any special rules or a particular skill is very useful there then you can divide those points up between where you like (e.g heal / lore / ride are class skills).   <br/>\n<br/>\n26/4/10  Dwarven Cleric/Fighter/Champion of Torm<br/>\n<br/>\nStr 16(28) <br/>\nDex (8) <br/>\nCon(16)<br/>\nInt(14) <br/>\nWis15(20) <br/>\nCha(6)<br/>\n<br/>\nAB: 37/32/27/22<br/>\nAB: 40/35/30/25 with weapon of choice<br/>\n<br/>\nHP: 508<br/>\n<br/>\nLEVELING GUIDE:<br/>\n01) Cleric   (01): Blind Fight,  Domains: Your Choice (War, Str, Prot, Earth fit the concept but whatever you prefer depending on PW/module etc)<br/>\n02) Fighter (01): Weapon Focus Warhammer (can replace with preferred weapon here)<br/>\n03) Cleric   (02): Extend Spell<br/>\n04) Cleric   (03): {STR +1}<br/>\n05) Cleric   (04): <br/>\n06) Cleric   (05): Empower Spell<br/>\n07) Fighter (02): Knockdown<br/>\n08) Cleric   (06): {STR +1}<br/>\n09) Cleric   (07): Spell Focus (Evocation)<br/>\n10) Cleric   (08):<br/>\n11) Fighter (03):<br/>\n12) Cleric   (09): Craft Wand/Scribe Scroll, {WIS +1}<br/>\n13) Cleric   (10):<br/>\n14) Fighter (04): Weapon Spec.<br/>\n15) Cleric   (11):  Greater Spell Focus (Evocation)<br/>\n16) CoT     (01): {WIS +1}<br/>\n17) CoT     (02): Improved Critical<br/>\n18) CoT     (03): Toughness<br/>\n19) CoT     (04): Improved Knockdown <br/>\n20) Cleric  (12): {WIS +1}<br/>\n21) Cleric  (13): Great STR I<br/>\n22) Cleric  (14): <br/>\n23) Cleric  (15):<br/>\n24) Cleric  (16): Great Wis I, {STR +1}<br/>\n25) Cleric  (17):<br/>\n26) Cleric  (18): <br/>\n27) Cleric  (19): Epic Weapon Focus<br/>\n28) Cleric  (20): {STR +1}<br/>\n29) Cleric  (21): <br/>\n30) Cleric  (22): Great STR II<br/>\n31) CoT     (05):<br/>\n32) CoT     (06): Epic Weapon Spec, {STR +1}<br/>\n33) CoT     (07): Great STR III<br/>\n34) CoT     (08): Epic Prowess<br/>\n35) CoT     (09): <br/>\n36) Cleric  (23): Grt Str IV , Armor Skin {STR +1}<br/>\n37) Cleric  (24): <br/>\n38) Cleric  (25):<br/>\n39) CoT     (10): Epic Spell Focus, Great STR V<br/>\n40) Cleric  (26): Great Wis II {STR +1}<br/>\n<br/>\nThis is a very solid build for levelling legitimately, you don't have to suffer through levels of feeling gimped and there's no XP penalty at any point.  It's particularly good in a low/mid magic environment as you're able to self buff pretty early on as well as having access to the fighter goodies and a decent bab.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:11 AM - Sep 11, 2018",
      "content": "<div>Nice work feuderali.</div>"
    },
    {
      "author": "feuderali",
      "avatar": "no_avatar.png",
      "timestamp": "6:36 AM - Sep 11, 2018",
      "content": "<div>Thank you Valerfor and thank you and everyone else in this thread for their help with the build.</div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "1:34 AM - Sep 15, 2018",
      "content": "<div><blockquote><div><cite>Grimnir wrote:</cite>\n<blockquote><div><cite>Empyre65 wrote:</cite>, so Divine Power can give you the 4th attack at your full AB, instead of full AB-15.  (Dev Crit?).<br/>\n<br/>\n.</div></blockquote>\n\nThat has been patched. It comes out as -15. It wont help.<br/>\n<br/>\n</div></blockquote>\n\nWhen and where was this patched ?<br/>\n<br/>\nThis seems like a pretty big deal.</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "8:21 AM - Sep 15, 2018",
      "content": "<div><blockquote><div><cite>Kalistez wrote:</cite><blockquote><div><cite>Grimnir wrote:</cite>\n<blockquote><div><cite>Empyre65 wrote:</cite>, so Divine Power can give you the 4th attack at your full AB, instead of full AB-15.  (Dev Crit?).<br/>\n<br/>\n.</div></blockquote>\n\nThat has been patched. It comes out as -15. It wont help.<br/>\n<br/>\n</div></blockquote>\n\nWhen and where was this patched ?<br/>\n<br/>\nThis seems like a pretty big deal.</div></blockquote>Use the combatlog when testing, you'll see.<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    }
  ]
}