{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Bioware Legacy Builds",
  "forum_id": "008",
  "id": "009",
  "name": "Holy Paragon: Cleric 11/Fist of Raziel 19/CoT 10",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/holy-paragon-cleric-11-fist-of-raziel-19-cot-10-t515482.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": 0,
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:31 AM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">The original build can found <a class=\"postlink\" href=\"http://web.archive.org/web/20100128060955/http://nwn.bioware.com/underdark/character_holyparagon.html\" rel=\"noreferrer\" target=\"_blank\">here</a>.<br/>\n<br/>\n<strong><span style=\"color:#FF0000\">Note: Holy Paragon requires the PRC pak to build and operate.</span></strong><br/>\n<br/>\nWritten and Created by: Lockindal Linantal<br/>\nReformatted by HipMaestro &amp; pals, 110914 <br/>\n<br/>\nThe musky smell of dusty leather and dry flesh became thicker with each step. The walls were close and the darkness pressed upon the small party as they crept deeper into the crypt. The leader raised her hand. Whispered conversation stopped and they all listened intently. A full minute passed before her hand motioned them to continue. No one felt like talking anymore. A slight man armored only in boiled leathers tapped the silver armored leader on the shoulder. He motioned to a cobweb that had been recently torn aside. She gazed at it intently nodding. They were approaching the central altar. Her pale eyes seemed to glow in the deepening blackness. Something shifted in the dark. She cursed and reached for her sword. \"Get down!\"<br/>\n<br/>\nA claw lashed out and struck the slight man aside tearing a ragged set of lines along his thin armor. He had time to grunt and clutch his chest before another slash struck across his neck, splattering blood across the stones. He coughed twice and fell back against the wall. A light of the purest white blasted the darkness from every corner revealing a giant monster of blackish purple skin, long deadly nails, and thin steely limbs. It hissed and reared back as if burned.<br/>\n<br/>\n\"Raziel take you!\" The blinding white light took the form of a curved sword held by the armored woman. The light now revealed pale, pale skin and features that hinted at divine origin. Her eyes glowed with righteous might as her weapon bit into the hide of the creature. Her silver and gold armor shone in the light, glittering like cut gems. She swung again, and again her sword cut deep. The creature raged and spat venom which burned any surface it touched. Another cut through the thin neck of the creature and the shrieking stopped. Her party was crouched against the wall, quaking no longer at the monster but at the light that seemed to come directly from their leader, the light of the celestial.<br/>\n<br/>\nShe turned to her fallen comrade touching his lifeless face. His wounds began to seal shut and the color returned to his face. His eyes blinked open, confused and scared.<br/>\n<br/>\n\"Come friend we have much work still to do.\" The Holy Paragon lifted him up like a child and ushered her party forward.<br/>\n<br/>\nA knightly order dedicated to slaying evil, The Fists of Raziel are devout crusaders who lead the charge against evil. The Holy Paragon is no exception, taking up a powerful position within the Fists of Raziel, she utilizes her faith in Torm to destroy her opposition with ferocious efficiency. <br/>\n<br/>\nCleric(11), Fist of Raziel(19), Champion of Torm(10), Aasimar, Lawful Good<br/>\n<br/>\nSTR: 16 (26)<br/>\nDEX: 8<br/>\nCON: 10<br/>\nWIS: 16 (19)<br/>\nINT: 14<br/>\nCHA: 16 (21)<br/>\n<br/>\n01: Cleric(1): Power Attack<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Divine Might<br/>\n04: Cleric(4): STR+1, (STR=17)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): Divine Shield<br/>\n07: Cleric(7)<br/>\n08: Cleric(8): WIS+1, (WIS=17)<br/>\n09: Fist of Raziel(1): Weapon Focus: Scimitar<br/>\n10: Fist of Raziel(2)<br/>\n11: Fist of Raziel(3)<br/>\n12: Champion of Torm(1): STR+1, Extend Spell, (STR=18)<br/>\n13: Champion of Torm(2): Knockdown<br/>\n14: Champion of Torm(3)<br/>\n15: Champion of Torm(4): Improved Knockdown, Improved Critical: Scimitar<br/>\n16: Fist of Raziel(4): STR+1, (STR=19)<br/>\n17: Champion of Torm(5)<br/>\n18: Fist of Raziel(5): Sanctify Martial Strike: Scimitar<br/>\n19: Fist of Raziel(6)<br/>\n20: Fist of Raziel(7): CHA+1, (CHA=17)<br/>\n21: Champion of Torm(6): Epic Weapon Focus: Scimitar, Great Wisdom I, (WIS=18)<br/>\n22: Champion of Torm(7)<br/>\n23: Champion of Torm(8): Great Wisdom II, (WIS=19)<br/>\n24: Champion of Torm(9): CHA+1, Great Strength I, (STR=20), (CHA=18)<br/>\n25: Champion of Torm(10): Epic Prowess<br/>\n26: Cleric(9)<br/>\n27: Fist of Raziel(8): Great Strength II, (STR=21)<br/>\n28: Fist of Raziel(9): STR+1, (STR=22)<br/>\n29: Fist of Raziel(10)<br/>\n30: Fist of Raziel(11): Great Strength III, (STR=23)<br/>\n31: Fist of Raziel(12)<br/>\n32: Fist of Raziel(13): CHA+1, Great Charisma I (CHA=20), <br/>\n33: Fist of Raziel(14): Great Strength IV (STR=24)<br/>\n34: Cleric(10)<br/>\n35: Fist of Raziel(15)<br/>\n36: Fist of Raziel(16): CHA+1, Epic Skill Focus: Spellcraft, Epic Divine Might, (CHA=21)<br/>\n37: Fist of Raziel(17)<br/>\n38: Fist of Raziel(18)<br/>\n39: Fist of Raziel(19): Great Strength V, Epic Divine Shield (STR=25)<br/>\n40: Cleric(11): STR+1, (STR=26)<br/>\n<br/>\nHitpoints: 378<br/>\nSaving Throws (Fortitude/Will/Reflex): 30/29/22<br/>\nSaving Throw bonuses: Spells: +11<br/>\nBAB: 28<br/>\nAB (max, naked): 40 (melee), 28 (ranged)<br/>\nAC (naked/mundane armor/shield only): 13/24<br/>\n<br/>\nSkillpoints: 215<br/>\nDiscipline 42(50), Lore 42(44), Persuade 5(10), Spellcraft 43(55), Tumble 20(19), remaining 43<br/>\n<br/>\n01: Lore(4), Persuade(4), Spellcraft(4), Tumble(1), Save(6), <br/>\n02: Lore(1), Persuade(1), Spellcraft(1), Save(8), <br/>\n03: Lore(1), Spellcraft(1), Tumble(1), Save(9), <br/>\n04: Lore(1), Spellcraft(1), Save(12), <br/>\n05: Lore(1), Spellcraft(1), Tumble(1), Save(13), <br/>\n06: Lore(1), Spellcraft(1), Save(16), <br/>\n07: Lore(1), Spellcraft(1), Tumble(1), Save(17), <br/>\n08: Lore(1), Spellcraft(1), Save(20), <br/>\n09: Discipline(11), Tumble(1), Save(12), <br/>\n10: Discipline(2), Lore(2), Save(13), <br/>\n11: Discipline(1), Lore(1), Tumble(1), Save(14), <br/>\n12: Discipline(1), Lore(1), Save(17), <br/>\n13: Discipline(1), Lore(1), Tumble(1), Save(18), <br/>\n14: Discipline(1), Lore(1), Save(21), <br/>\n15: Discipline(1), Lore(1), Tumble(1), Save(22), <br/>\n16: Discipline(1), Lore(1), Save(25), <br/>\n17: Discipline(1), Lore(1), Tumble(1), Save(26), <br/>\n18: Discipline(1), Lore(1), Save(29), <br/>\n19: Discipline(1), Lore(1), Tumble(1), Save(30), <br/>\n20: Discipline(1), Lore(1), Save(33), <br/>\n21: Discipline(1), Lore(1), Tumble(1), Save(34), <br/>\n22: Discipline(1), Lore(1), Save(37), <br/>\n23: Discipline(1), Lore(1), Tumble(1), Save(38), <br/>\n24: Discipline(1), Lore(1), Save(41), <br/>\n25: Discipline(1), Lore(1), Tumble(1), Save(42), <br/>\n26: Spellcraft(18), Save(29), <br/>\n27: Discipline(2), Lore(2), Tumble(1), Save(28), <br/>\n28: Discipline(1), Lore(1), Save(31), <br/>\n29: Discipline(1), Lore(1), Tumble(1), Save(32), <br/>\n30: Discipline(1), Lore(1), Save(35), <br/>\n31: Discipline(1), Lore(1), Tumble(1), Save(36), <br/>\n32: Discipline(1), Lore(1), Save(39), <br/>\n33: Discipline(1), Lore(1), Tumble(1), Save(40), <br/>\n34: Spellcraft(8), Save(37), <br/>\n35: Discipline(2), Lore(2), Tumble(1), Save(36), <br/>\n36: Discipline(1), Lore(1), Save(39), <br/>\n37: Discipline(1), Lore(1), Tumble(1), Save(40), <br/>\n38: Discipline(1), Lore(1), Save(43), <br/>\n39: Discipline(1), Lore(1), Tumble(1), Save(44), <br/>\n40: Spellcraft(6), remaining (43) <br/>\n<br/>\n<strong>Background, Analysis and Comments by Author</strong><br/>\n<br/>\nEquipment<br/>\nScimitar<br/>\nFull Plate<br/>\nTower Shield <br/>\n<br/>\nHoly Paragon Advantages<br/>\nAasimar traits. The Holy Paragon is a descendant of the celestials, and as such has unique qualities. <br/>\nAasimar Ability Adjustments: +2 Cha, +2 Wis.<br/>\nDarkvision: Aasimar are able to see in the dark. <br/>\nSkill Affinity (Spot): +2 racial bonus to Spot checks.<br/>\nSkill Affinity (Listen): +2 racial bonus to Listen checks.<br/>\nResist Cold: Innate cold resistance of 5.<br/>\nResist Acid: Innate acid resistance of 5.<br/>\nResist Electrical: Innate electrical resistance of 5.<br/>\nSpell Ability - Light: Can cast once per day as 3rd level.<br/>\nOutsider: Aasimar are considered Outsiders for the purpose of spells.<br/>\nHuman: Aasimar are considered Human for the purpose of spells.<br/>\nLevel 9 Divine Spells, and 51 Epic Spells (many of which she can cast relatively effortlessly - i.e. she will make her Spellcraft check on a reliable basis). These spells allow the Holy Paragon to utilize the strength of the gods on her opponents rather than just her strength alone. They empower her with great power, allowing her to do things such as: <br/>\nContingent Resurrection (epic spell). If the Holy Paragon (or a chosen ally) is slain in battle, her energy is automatically rechanneled to allow her (or a chosen ally) to be born anew, so long as she prepared the ritual.<br/>\nChampion's Valor (epic spell). The Holy Paragon can invoke the power of the divine to become immune to Knockdown, Mind-Affecting spells, Critical Hits, and Sneak-Attacks.<br/>\nDeadeye Sense (epic spell). If the Holy Paragon is having difficulty hitting a foe, she can invoke the power of the divine to be able to have the sense of a true predator, invoking the Deadeye Sense, giving her +20 to her attack bonus for a good amount of time.<br/>\nResurrection. She can invoke her divine power to resurrect fallen allies.<br/>\nHeal. She can heal herself for 150 hit points per casting of this spell.<br/>\nGreater Restoration. She can recover from status effects, as well as greatly heal herself.<br/>\nArmy Unfallen (epic spell). The Holy Paragon can completely heal herself and all of her allies, as well as resurrect all fallen allies in a large radius. She alone can cause a victory or defeat with this spell at her disposal.<br/>\nGreater Magic Weapon. She can enchant her weapon to pierce DR.<br/>\nAnd many, many more...<br/>\nHigh Damage, often times irresistible. She has the power of Holy Martial Strike, giving her an innate +2d6 divine damage bonus vs evil; if she chooses, she can also invoke Epic Divine Might as many times per day as her charisma modifier allows (base 8 times per day, lasting a base of 10 rounds), her damage with her scimitar is 1-6+8+2d6 vs. evil without any magical enhancement; her damage (base) with epic divine might is 1-6+8+10 (easily increased with charisma modifications)! If you add in her various spells (such as dark fire) that allow her to multiply this further (remember, Eagle's Splendor and Bull's Strength raise damage too due to these abilities), you can see how her hits are devastating. These damage bonuses are also divine, which is not resistible very often at all, further increasing the potential of her strength.<br/>\nHigh Armor Class, especially for a plate user. With Epic Divine Shield (which, under the PRC, adds to Shield AC instead of Dodge AC) and several spells to increase her armor class, she can easily gain a very high armor for a full plate user. The only disadvantage to her armor class is that she cannot keep this high armor class all the time (and must sacrifice uses of her Divine Might ability to use this ability).<br/>\nVery versatile due to spell casting.<br/>\nHigh saving throws, especially against spells.<br/>\nDiplomatic due to Cha score.<br/>\n<br/>\nHoly Paragon Disadvantages<br/>\nRelatively Low AB. Even with Deadeye Sense and max Str enhancement, her AB is only 66/61/56/51, which is not very sufficient in high magic worlds. However, her power is not reduced by low magic worlds - she retains this same AB in low magic worlds, making her almost unbeatable on those worlds.<br/>\nIf made from scratch, she must endure many hardships to gain her epic spells once she has reached epic levels. Much sacrifice is required to gain epic spells, and this discipline and endurance is one of the toughest challenges for the Holy Paragon.<br/>\nLow wisdom modifier. This makes her spells' DC low for those spells that rely on this modifier.<br/>\n<br/>\nMagic Item Wish List<br/>\nKeen scimitars, preferably with an enhancement to damage through elemental means. This enhances her damage and allows her to score critical hits more often. She does not need it to be magical, per se, since she can enchant her own weapons with Greater Magical Weapon.<br/>\nA permanently hasted item. Who would say no to an increased movement rate, an extra spell per round, and an extra attack? (The Holy Paragon has max Dodge AC just from max Cha items and EDS, so +4 AC is not included)<br/>\nAC boosting items. With her mediocre hit points, an even higher AC is important.<br/>\nSpell craft boosting items. With more spell craft, she can learn more epic spells and also cast epic spells easier.<br/>\nSaving throw boosting items. While her saves are excellent, she is not protected well enough to be considered \"immune\" to most effects.<br/>\n<br/>\nKey Stats<br/>\nFinal Saves (Vs. Spells)<br/>\nFortitude: 30 (40)<br/>\nReflexes: 22 (32)<br/>\nWill: 28 (38)<br/>\n<br/>\nFinal Saves (Vs. Spells) [BUFFED (+12 Con/Dex/Wis &amp; recitation/divine protection)]<br/>\nFortitude: 39 (50)<br/>\nReflexes: 31 (42)<br/>\nWill: 37 (48)<br/>\n<br/>\nFinal AC (Buffed / Unbuffed)<br/>\nUnbuffed, 24<br/>\nSelf-Buffed (Epic Mage Armor, Epic Divine Shield, Shield of Faith, Divine Protection) = 60<br/>\nBuffed fully (EMA, Epic Divine Shield, Shield of Faith, Divine Protection, +12 Cha, +4 Dex) = 74<br/>\nWith Amulet of Protection +5 and a haste item = 83<br/>\n<br/>\nAB and Damage<br/>\nWith no buffs, normal scimitar:<br/>\n40/35/30/25 1D6+2D6 vs Evil (HMS)+8 (15-20 X2) <br/>\nWith Greater Magical Weapon buff, normal scimitar:<br/>\n45/40/35/30 1D6+2D6 vs Evil (HMS)+14 (15-20 X2)<br/>\nWith +12 to Str and a keen scimitar with Greater Magical Weapon:<br/>\n51/46/41/36 1d6+2D6 vs Evil (HMS)+20 (13-20 X2)<br/>\nWith +12 to Str and a keen scimitar with Greater Magical Weapon and Deadeye Sense, with Epic Divine Might and +10 to Cha:<br/>\n66/61/56/51 1d6+20+20 (divine might) (13-20 X2)<br/>\nMaximum AB with scimitar 66<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}