{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "289",
  "name": "Build request",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/build-request-t2354301.html",
  "author": "campgod",
  "avatar": "10235447_1565972826.jpg",
  "replies": 10,
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "7:15 PM - Aug 16, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello everyone, once again I would like to see what you come up with <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n 1)PvP<br/>\n 2)lvl cap:40<br/>\n 3)Race: Human(for the extra feats) or Halfling(small stature)<br/>\n 4)Class; Was looking for two, a Fighter/WM/assassin(maybe try for the highest lvl assassin I can get? Open for suggestions) and a Ranger/wm/assassin(like a Ranger23/WM7/Assassin10?) for the BOE and sneaks. (I like Assassins over rogue cause at lvl 9 they get HiPS and nice spells.)<br/>\n 5)Melee prof: Duel on both builds for sure. AB is more imporant then the AC cause I will be sneaking as much as I can. KD would be nice to lvl with but will swap it out for maybe Iron will? Doing a rebuild at lvl 40.<br/>\n 6)Range pref: N/A<br/>\n 7)Weapon pref: Open to suggestions but I like useing a Sai, which is in the dagger family and needs WeaponPro:Extoic. Sai can hold lots of enchants i can forge one that has +6 enhancement.,Keen,Massive cit.1d12 and 1d8 ele damage.<br/>\n 8)Max Item enchant: +6 enhancement other properties depends on weapon<br/>\n 9)Spell casting: All the rangers and Assassins spells (with these builds shouldnt be a prob)<br/>\n 10)Custom factors: Assassins get HiPS at lvl 9. you can only get Scrolls,Potions and wands from a PC, So I would like to have my UMD in the 40's so i can use a wand of Clarity that one of my casters can make.<br/>\n<br/>\n I know I left something out...I always do, so feel free to ask. Again, Thank you for your ideas and time.<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:39 PM - Aug 16, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Heya campgod,<br/>\n<br/>\n So, you are looking for a hiigh AB, Dual-Wielding Assassin right? And since you will get HiPS from the aforementioned class you don't have the need for SD-good. You also want exotic weapons in the build so you can equip Sai, alright. I hope these custom weapons do benefit from WF, EWF and the like or else it's not worth it at all. In fact as any experianced PvP player will say to you, the weapons hardly make a difference if your Assassin is build correctly... Death attack DC is all that matters if it isn't nerfed and after that Sneak attack dice and Skill. You may not have to be a WM in order to get a good Death attack DC/ AB, so keep that in mind. WM would likely serve more as a distraction to this build and probably hamper you more than benefit you, except if you want this yourself (you like the WM criticals) i would suggest something without it.<br/>\n<br/>\n One final question, what is a competitive (naked) AB you have in your mind for this build?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:27 PM - Aug 16, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Eh, once again when i have a great concept in my head i search and find that's done already from one of the great builders of the past, the dwarflord already diid what i had in mind (since you don't need SD to get HiPS) with this build, and it already has a nice looking AB.<br/>\n<br/>\n The Huntress =&gt; <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build211533.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 11533.html</a><br/>\n<br/>\n<br/>\n Tell me what you think campgod,<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "11:16 PM - Aug 17, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello Valerfor, Thanks for the reply. I was just saying WM cause I was thinking it would help get me a higher AB. I took a look at \"The Huntress\" and it looks great. Couple of things I just want to ask, So Human over Halfling? When I re-lvl at 40 I can not do the 1st lvl so I can move KD out till a later lvl. Should I take Strong Soul or Luck of Heros instead? Strong soul seems nice cause of the fort, will save and the +2 against death spells. What do you think?<br/>\n<br/>\n P.S. Also what do you think about squeezing in ED? Would that effect the AB to much?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:55 AM - Aug 18, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Aye, <strong>The Huntress</strong> it's a great build and with your PW's modifications to the Assassin class is maybe one of the best. As grizzled_dwarflord said in his thread \" If that build also had HiPS &amp; ED, everyone would want one! \". Before i continue with the build i have to say something first. It never crossed my mind that you might want Assassin there just for the HiPS &amp; Spells. I automatically thought: <em>Heh, that guy is gonna murder them with his Death attack DC if it's not nerfed somehow</em>...In case the first thing applies, meaning you wanted Assassin there just for the HiPs and mediocre Spells, man-you do have to reconsider. Have you ever seen an efficient Assassin at work? If \"True Sight\" is nerfed, which is True in your case (at least from what i remember from Sinfar's rules page) then your opponents will have a very difficult time even reacting back from your initial flurry of attacks. More precisely they will have to do a Double DC: 44 (assuming you have maxed your Intelligence) Fortitude save or practically freeze in place for 26 turns! Game-end for them. And if you are hasted this becomes even more ridiculous, as they will have to do a Triple Fortitude save Vs that DC (seven attacks/round break into a 3-2-2 flurry). And they will have to make that save with their Raw saves, because Death attack is an ability, they cannot include their spellcraft bonusses to that. Now i do not know what kind of saves PvP players usually have in Sinfar but that DC is very difficult to make in anything except a Paladin or CoT class-based character. And to make that trifold is almost impossible unless they build specifically for that and commit the major part of their items for their saves. Of course all of these stuff do require you to take as-many-as-possible Assassin levels, like the dwarflord has already done with <strong>The Huntress</strong><em>. Phew, finished for now</em>...<br/>\n<br/>\n Continuing with the build, i made some modifications on it that you can check them out. One problem is that i do not know the very specifics of your server so you will have to help me here as to what is more important to the build but all the choices that i made can be reversed if you like. I made the following modifications:<br/>\n<br/>\n 1) Changed the skills in order to get deadly trap-mastery for the build ignoring craft-traps (i assumed you can get traps without you having to craft them)<br/>\n 2) Changed the end leveling order to get more ranks in discipline and quicker maximum death attack without loosing anything, since stealth are also in Ranger's skill list<br/>\n 3) Buffed the saves, especially the fortitude<br/>\n 4) Got armor skin epic feat for +2 AC<br/>\n 5) Got rid of the exotic weapons feat for dual short-swords ( i will explain why, below)<br/>\n<br/>\n For these changes i dropped the Wisdowm to 10 which means i lost the ability to cast 2 first level &amp; 1 second level Ranger spells. And i lost the ability to dual-wield Sai as you wanted. I also lost 2 points from each of hide/move silently skills. Now i will explain why i did that. You have UMD 35 ranks, which means that you can cast every single spell in the game without failure from either scrolls or wands. Why keep the mediocre Ranger first level spells when i have the ability to cast them (and at a higher caster level) from a wand? Now for the weapon change let me do a comparison of the Sai and the short-sword.<br/>\n<br/>\n (<strong>Sai</strong>/ <strong>Short-sword</strong>)<br/>\n Base Damage: 1d4/ 1d6<br/>\n Critical Range: 19-20 X2/ 19-20 X2<br/>\n Damage Type: Piercing/ Piercing<br/>\n Size: Tiny/ Small<br/>\n<br/>\n Based on that comparison, i would say that Sai isn't worth it at all. You get a smaller weapon that is easier to get disarmed, with a smaller base damage and same all other stats, and you have to spend a feat for that too. No, thanks! Even if the enchantments the Sai can hold are slightly better it still isn't worth it over the short-sword unless the elemental damage enchantment you can put into Sai's is more than 1d4. Let me make this more clear, if said Sai can hold a +6, keen. +1d12 massive crits, +1d8 elemental damage enchantment and the Short-sword can hold the same with only difference it can take only 1d4 elemental damage then the two weapons are probably the same in terms of damage potencial but for the Short-swords you don't have to pay a feat. Now if the differtence is greater than that, then you can always take \"Exotic Weapons\" for the cost of \"Luck Of Heroes\" feat, that i took at first level.<br/>\n<br/>\n Now here is the build as i have modified it,<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">The Huntress:</span></strong><span style=\"font-size:120%;line-height:normal\"> (Ranger10/ Ftr4/ Assassin26)</span><br/>\n Human<br/>\n Alignment: Any/Evil<br/>\n<strong>Playable 1-40, PvM/ PvP</strong><br/>\n<br/>\n Str: 14<br/>\n Int: 14<br/>\n Wis: 10<br/>\n Dex: 16 (<strong>34</strong>)<br/>\n Con: 14<br/>\n Chr: 08<br/>\n<br/>\n 01) Ranger (01): Luck Of Heroes, Knockdown, FE (1)<br/>\n 02) Fighter (01): WF: Short-Swords<br/>\n 03) Fighter (02): Blindfighting, Weapon Finesse<br/>\n 04) Ranger (02): Dex-17<br/>\n 05) Ranger (03):<br/>\n 06) Assassin (01): Great Fortitude<br/>\n 07) Assassin (02): (Ghostly Visage)<br/>\n 08) Assassin (03): Dex-18<br/>\n 09) Ranger (04): Improved Knockdown, (Ultravision)<br/>\n 10) Ranger (05): FE (2)<br/>\n 11) Assassin (04):<br/>\n 12) Assassin (05): Improved Crit: Short-Swords, Dex-19, (Darkness)<br/>\n 13) Ranger (06):<br/>\n 14) Ranger (07):<br/>\n 15) Ranger (08): Iron Will<br/>\n 16) Ranger (09): Dex-20<br/>\n 17) Assassin (06):<br/>\n 18) Assassin (07): Toughness, (Invisibility)<br/>\n 19) Assassin (08):<br/>\n 20) Fighter (03): Dex-21<br/>\n 21) Assassin (09): EWF: Short-Swords, (Improved Invisibility &amp; HiPS)<br/>\n 22) Assassin (10):<br/>\n 23) Assassin (11):<br/>\n 24) Fighter (04): WS/EWS: Short-Swords, Dex-22<br/>\n 25) Assassin (12):<br/>\n 26) Assassin (13):<br/>\n 27) Assassin (14): Armor Skin, Great Dex I<br/>\n 28) Assassin (15): Dex-24<br/>\n 29) Assassin (16):<br/>\n 30) Assassin (17): Great Dex II<br/>\n 31) Assassin (18): Great Dex III<br/>\n 32) Assassin (19): Dex-27<br/>\n 33) Assassin (20): Great Dex IV<br/>\n 34) Assassin (21):<br/>\n 35) Assassin (22): Great Dex V<br/>\n 36) Assassin (23): Great Dex VI, Dex-31<br/>\n 37) Assassin (24):<br/>\n 38) Assassin (25):<br/>\n 39) Assassin (26): Epic Prowess,, Great Dex VII<br/>\n 40) Ranger (10): Great Dex VIII, Dex-34<br/>\n<br/>\n BAB: 28 (four attacks/six dual-wield)<br/>\n AB: 44 (short-sword &amp; shield)<br/>\n Dualwielding Short-Swords AB: 42/37/33/27 &amp; 42/37<br/>\n Damage: 1d6 +8 (main) &amp; 1d6 +7 (off-hand) /17-20 X2<br/>\n<br/>\n AC: 32 (35 w/Tower Shield)<br/>\n Death Attack DC: 38 (44 w/Max Intelligence)<br/>\n Sneak Attack: 13d6 (78d6 per round)<br/>\n Hit Points: 410<br/>\n<br/>\n Skill Points: 294<br/>\n<br/>\n Hide: 43 (55)<br/>\n Move Silently: 43 (55)<br/>\n Tumble: 40<br/>\n UMD: 36 (35)<br/>\n Set Traps: 11 (25)<br/>\n Discipline: 43 (45)<br/>\n Spellcraft: 18 (20) cc<br/>\n Search: 19 (21)<br/>\n Disable Traps: 21 (25)<br/>\n Open Locks: 3 (15)<br/>\n<br/>\n Fort: 26 (30)<br/>\n Will: 19 (23)<br/>\n Reflex: 33 (37)<br/>\n<br/>\n * Luck Of Heroes can change to Exotic Weapons Proficiency if you want it<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:27 AM - Aug 18, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Keep in mind that <strong>The Huntress</strong>, can indeed change to a Halfling and it will get a higher AB/ AC as well, not to mention the really good bonuses in Hide/ Move Silently due to \" Small Stature\" racial ability. She will however get an exp penalty as you level up and she will loose 43 skill points as well (which is exactly the Discipline skill), but i do not know how important is for you to have Discipline at all in this build so i left it as Human (and for RP purposes too, since Sinfar is primarily an RP server). But if you are set on having the best AB, with a <em>\"Hin Huntress\"</em> you could have +2AB/ +2AC out of it. Saves would remain the same even if you sacrificed the \"Luck Of Heroes\" feat since all Halflings have a special racial ability that gives them +1 to all their saves.<br/>\n<br/>\n For <strong>The Huntress</strong> to have ED, would require another mix of classes, entirely. I would say that it is not as important to this build because you have the ability to use <em>HiPS </em>and get away from danger at will, plus you will have a really good AC, since you are a Dex-based character.<br/>\n<br/>\n Lastly, if you are interested in <em>HiPS</em> and want a character with AB and really good damage potencial you could also check my <strong>Dark Assailant</strong> build that is a (Ftr/Sd/Wm). I do not know if you like that kind of build or you wanted Death attack in there, but in PvP/ PvM he won't have the slightest problem to get rid of his opponents. He doesn't have dual-wield though but prefers to crush his enemies with a massive two-hander and his natural 34 Strength boosted by Weapon Master criticals. Have a look even if only for entertaining purposes,<br/>\n<br/>\n<strong>Dark Assailant =&gt;</strong> <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2352638/THE-DARK-ASSAILANT-FTR-16-SD-16-WM-8#.U_FHbGP5fhQ\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... _FHbGP5fhQ</a><br/>\n<br/>\n That's it man, i hope i answered to all your questions, keep us informed ;)<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "5:00 AM - Aug 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As always Valerfor you have helped me out a lot! Thank you. ok, lets see if I can answer some questions.<br/>\n 1) Unfortunately I haven't seen any traps being used by anyone I have seen some in the world but it is rare. So I think there is no real need for trap skills.<br/>\n 2)Buffing the saves is always a good idea. I do craft two items for use doing PvP which gives me a fort save in the high 40's ans so does about everyone else. With another Assassin I play that has 30 lvls I tend to get some people if they roll a low number. DA is not nerfed and TS is nerfed True Seeing:The duration is set to 3 rounds . People do at times go around drinking TS potions if they think I am near.<br/>\n 3)As far as the weapons go here is what I can put on a short-sword...now you can do other things but it is limited, Short-sword I can forge it to have +6 enhancement and keen or +6 with say 1d8 ele damage and that is about it. The Sai can be +6 enhancement,keen,massive crit 2d12 and 1d4 ele damage or I could do +6,2d12 massive and go 1d12 ele damage if I leave out the keen. Now based on those would you still go Shrot-sword?<br/>\n 4) KD is ok for lvling but in PvP I am not knocking down many. Some are running around with KD immune armor, which I kinda think is a waste to have, but it does help with people spamming Hellball. So that gives me two extra feats that I can throw in Exotic weapons maybe? As far as Disarm goes I see no one doing that either.<br/>\n I do like the ranger later lvl though for the Dis. it does help from getting KD. I really cant make up my mind about the race...<br/>\n Thanks for your time.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "5:07 AM - Aug 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Dark Assailant =&gt; <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2352638/THE-DARK-ASSAILANT-FTR-16-SD-16-WM-8#.U_FHbGP5fhQ\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... _FHbGP5fhQ</a> <br/>\n   Is a really nice build as well. I might have to toy with that one next lol.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:26 AM - Aug 19, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah, i see... Then your server is a medium magic world but with aspects of a high magic one, due to the custom crafting they are able to avoid almost all of the combat tricks and instant death mechanics of the normal NwN. That's probably to avoid players cries, especially when they face hardcore PvP ones. To be able to boost your fortitude save to high forty's with simply crafting two items (that may have also other properties) means that all of Devastating Critical, death attack, High DC Sorcerers and even Imploder Clerics are nothing but lucky shot machines where they hope from their opponent's to roll 1's. Moreover if Knockdowns and Disarms don't work either due to  some properties of items that boost Discipline by a huge amount then all is left is the exchange of blows head-on. Sadly that devastates the majority of the power builds leaving only what is true in high magic worlds as well, and that's pure damage. That's why all they care in High magic worlds is AB/ AC/ ED and nothing else, the rest will always come through items. At least Sinfar doesn't let you build Dex-Machines ignoring the Strength part of it by giving out huge enchantments on the weapons and that's good. They seem to have also balance properly the exotic weapons by giving significant improvements to them compared to the normal weapons where the plain old scimitar is the best weapon for almost all purposes.<br/>\n<br/>\n<em>I apologize for the mini-rant but it is sad to see so many builds, get nerfed to the ground through items that anyoe can craft consistently..</em>.<br/>\n<br/>\n Anyway, lets focus to the build and try to answer your questions, all that matters is for you to have fun and so you will. To answer first the weapon question, NO i do not think anymore that the Short-Sword is comparable to the Sai, get the Exotic weapons feat, is a must-have as it will boost your damage significantly. Take notice that both are piercing weapons and the scrolls of keen edge won't work on them, so you have to make them keen at the forge as there is no other way to do it with use magic device. The boost elemental damage as it will multiply on a critical hit (unlike massive criticals) except if you find that the other players have elemental resistances too often. Then go for massive criticals since this at least cannot be resisted, except from pale-masters and the like.<br/>\n<br/>\n If you think that knockdown/ Improved knockdown won't work in a PvP match (and it will not, unless you have a significantly high AB) then trade that for Exotic weapons and SF: Discipline (OR Stealthy). If you can redo your build once you are lvl 40 then keep it when you level-up and then re-build with those feats instead of KD/ IKD. Traps not being used is also against you, (<em>sigh</em>) so better trade the points elsewhere, put them where you think it is good, maybe the Listen skill.<br/>\n<br/>\n That's all i have to offer, knowing that much for your server man, i hope you will be satisfied with the build and have fun,<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "3:45 AM - Aug 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah people can craft for high saves...but then that leaves a soft spot open else where in their build. It's fun playing diff builds in diff situation's. +12 of any stat can be crafted, of cousre the gear can not hold every single one. Most do 3 you can maybe get 3 +12 in any giving stat but then lack in other protection. Please do not be disappointed in the facts of my server lay in front of you. You have giving me a great build and great advice. Most do the high str. 2H'ers Dev's and high mages, but the high str. get beat up by the Assassins still and some AA or lite casters fail the save and just stand there why I punish them! You have done more than you give yourself credit for. thanks again for all your help...and I cant wait to try the Dark Assailant next!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:47 PM - Aug 20, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I see...<br/>\n<br/>\n Then i am glad i was able to help man, do keep us informed of how the build performs and have fun :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}