{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "343",
  "name": "Champion of the Wilderness: Druid 28/CoT 10/Monk 2",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/champion-of-the-wilderness-druid-28-cot-10-monk-2-t515398.html",
  "author": "Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": 0,
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:13 PM - Aug 06, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hey guys,<br/>\n<br/>\nI had a long lunch break today at work, but not long enough to actually play NWN, so I will make good use of my time by posting this very good build. There are many builds utilizing this class combo, but all of them go for more Monk for the added speed. I just figure that everywhere I play I'm the one starting the confrontations and I haven't really felt the need to flee, so I could relinquish it with no problem, in order to become a better caster, get DS earlier and better saves to round it up, as usual at the cost of playability, oh well, each to their own. Here it is!<br/>\n<br/>\nDruid(28), Champion of Torm(10), Monk(2), Human<br/>\n<br/>\nPlayable 1- 40 PvM, Untested PvP<br/>\n<br/>\nAlignment: Lawful Neutral<br/>\n<br/>\nSTR: 8<br/>\nDEX: 8<br/>\nCON: 10<br/>\nWIS: 18 (34)<br/>\nINT: 14<br/>\nCHA: 14<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Druid(1): Expertise, Extend Spell<br/>\n02: Druid(2)<br/>\n03: Druid(3): Spell Focus: Conjuration<br/>\n04: Druid(4): WIS+1, (WIS=19)<br/>\n05: Druid(5)<br/>\n06: Druid(6): Empower Spell<br/>\n07: Druid(7)<br/>\n08: Druid(8): WIS+1, (WIS=20)<br/>\n09: Druid(9): Greater Spell Focus: Conjuration<br/>\n10: Druid(10)<br/>\n11: Druid(11)<br/>\n12: Druid(12): WIS+1, Knockdown, (WIS=21)<br/>\n13: Druid(13)<br/>\n14: Druid(14)<br/>\n15: Druid(15): Weapon Focus: Scimitar<br/>\n16: Druid(16): WIS+1, (WIS=22)<br/>\n17: Champion of Torm(1)<br/>\n18: Champion of Torm(2): Improved Knockdown, Improved Critical: Unarmed<br/>\n19: Champion of Torm(3): {Smite Evil}<br/>\n20: Champion of Torm(4): WIS+1, Blind Fight, (WIS=23)<br/>\n21: Druid(17): Great Wisdom I, (WIS=24)<br/>\n22: Monk(1): {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n23: Druid(18)<br/>\n24: Druid(19): WIS+1, Great Wisdom II, (WIS=26)<br/>\n25: Druid(20)<br/>\n26: Druid(21)<br/>\n27: Druid(22): Great Wisdom III, (WIS=27)<br/>\n28: Druid(23): WIS+1, (WIS=28)<br/>\n29: Champion of Torm(5)<br/>\n30: Champion of Torm(6): Great Wisdom IV, Great Wisdom V, (WIS=30)<br/>\n31: Druid(24): Dragon Shape<br/>\n32: Champion of Torm(7): WIS+1, (WIS=31)<br/>\n33: Druid(25): Epic Spell: Greater Ruin<br/>\n34: Champion of Torm(8): Armor Skin<br/>\n35: Champion of Torm(9)<br/>\n36: Druid(26): WIS+1, Epic Spell: Hellball, (WIS=32)<br/>\n37: Champion of Torm(10): Epic Prowess<br/>\n38: Druid(27)<br/>\n39: Druid(28): Great Wisdom VI, Epic Spell Focus: Conjuration, (WIS=33)<br/>\n40: Monk(2): WIS+1, {Deflect Arrows}, (WIS=34)<br/>\n<br/>\nHitpoints: 340<br/>\nSkillpoints: 281<br/>\nSaving Throws (Fortitude/Will/Reflex): 29/38/23<br/>\nSaving Throw bonuses: Spells: +8, Fear: +2<br/>\nBAB: 26<br/>\nAB (max, naked): 27 (melee), 26 (ranged)<br/>\nAC (naked/mundane armor/shield only): 31/31<br/>\nSpell Casting: Druid(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nAnimal Empathy 42(44), Discipline 43(42), Heal 28(40), Listen 43(55), Lore 43(45), Spellcraft 42(44), Tumble 40(39)<br/>\n<br/>\nThe focus in Conjuration spells is because of the combo Stonehold + Storm of Vengeance (I love these spells), not Creeping Doom as it has no save, but also because there are no good spells on levels 1 and 2, so Grease and Extended Grease fill in that gap nicely. Their DCs become decent for such low lvl spells, and if you drop 4 on the same area where some monsters are already paralyzed with stonehold it will add to the chaos. My strategy is to disable opponents by any means available and to which they are not immune, so KD, Grease, Stonehold and Storm of Vengeance work nicely, and I pity the fool who gets down to half HP and decides not to drink a Heal potion, Greater Ruin followed by Hellball will make them regret it. The greatest thing about it is that you can use the nukes while shifted to Dragon Shape. If you can get a shield that gives you charisma, equip it just before shifting and you have a brief once-a-day-uberness with Divine Wrath that lasts a little longer. Too cheap <br/>\n<br/>\nWell, the first few levels are the hardest, and saying that, no druid has much trouble getting by them, but having to go 22 levels without Monk Wisdom AC and Tumble makes shifting impractical in the early stages. 8 STR also means no Tower Shield or even moderately heavy armor for you, you'll probably just use shifting to increase your carrying capacity when returning to town to sell, or in a 1 on 1 situation with mobs you can KD. So you're better off as a summoner. And in that sense, WoG is great. Summons have been drastically improved, but their durations reduced to rounds / level, and druids get +1 level on their summons, like clerics with the animal domain. That makes for an excellent combo with Extend Spell. You basically at the second spell level have a second level summon that lasts twice as long!<br/>\n<br/>\nAnimal Empathy will make your early life a lot easier, as you'll have 3 creatures doing your dirty work for ya. Your companion, your summoned creature and your charmed animal. <br/>\n<br/>\nAlso you may have noticed the lack of Zen Archery in this build, which is a common point among all others with the same class combo. Here is how I look at it: If I stay from far away, I will do more damage or be more useful casting spells rather than attacking, and if I get in melee range, I shift, so Zen archery, although very nice to have, is by no means a must here. I`ve designed it to be a really good caster with above average melee prowess, so I hardly ever find myself in a situation where using a bow or a sling will be more effective than casting spells or shifting to melee and beating mobs up.<br/>\n<br/>\nExpertise here is because of this: your AB isn't all that high, so every once in a while you will be in the situation that you can't hit a creature except on 20s (F.Ex: Prismatic Dragon with his Shield of Shimmering Light in the Training Mod, Lord Vayne, in the Molag Pass in WoG). Most of the time, they will also only hit you on 20s, but if they don't have evasion, you can shift to Dragon Shape, turn expertise on and then keep firing Dragon Breaths at them. It will turn the tide in your favor rather than waiting till all your buffs run out to be in trouble or relying on luck to win the battle before.<br/>\n<br/>\nI have extensively discussed the strategies surrounding this build when I posted it back in the old guild, so no need to be reticent. If you want to know anything specific either post here or PM me and I'll be delighted to answer.<br/>\n<br/>\nTell me your thoughts <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}