{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "229",
  "name": "Any Pointers?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/any-pointers-t2354415.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "18",
  "views": "1.4K",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:54 AM - Apr 09, 2015",
      "content": "<div>Hello All,<br/>\n<br/>\n I'm just looking for a few prods in the right direction for this build, please. When you see my parameters you'll see why it's a build for me to make, rather than you perfectionists, but it all helps in my development, right?<br/>\n<br/>\n To the bones. I'm looking to build a full L40 PvM creation that is human, male and melee-centric. They are predominantly Barbarian, as rage (or more particularly terrifying rage is key. So far so good. Things start to get a little less optimum around now. He will not be a heavy armour wearer - I can stretch to medium, but light is preferred - and he doesn't do shields (great for AC, I know). He's not even that fond of two-handed weapons or dual-wield, but I think I can get around that - though not without problems, for while his weapon of choice is probably bastard sword (I have some flexibility there, thank goodness), he does carry plenty of knives. Oh, and he's STR and DEX focused, with as much CON as I can squeeze in - fortunately, he's not a spell-chucker.<br/>\n<br/>\n So, at the moment I'm thinking a Barbarian/Ranger split of about 31/9, but I'm aware that i) best guidance tends to be that if 2 classes makes it better, 3 makes it more so, and ii) I believe Tumble would be a good skill for him. This all inclines me to chuck some Rogue, or possibly Bard at him. And now I get confused: is it better for me to drop Ranger (which would only be there for Dual-wield/Imp 2 weapon fighting, given the armour impositions), and load more Rogue/Bard; or would the cost of Ambidexterity and 2 weapon fighting be too high?<br/>\n<br/>\n I've got myself into a bit of a tizzy over this, so I thought I'd ask for advice. Hope you don't mind.<br/>\n<br/>\n Thanks in advance - and sorry (bloody role-players, eh!)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "9:01 AM - Apr 09, 2015",
      "content": "<div>I am by no means a power builder, but in my mind, I see your toon as a Dex-based Ranger 21/Barbarian 15/Harper Scout 4<br/>\n<br/>\n Ranger not only gives you the dual wield feats, but also 2d6+5 extra damage against 5 races. Barb, of course, gives your Terrifying Rage and Harper gives you tumble. You get stackable Cat's Grace from Ranger and Harper, as well. Iron Will + Tymora's Smile give you some mind resistance.<br/>\n<br/>\n Bastard Sword is out for a dexer, however, but Rapier and Dagger (or Kukri) could be wicked against favored enemies.<br/>\n<br/>\n You could do that combo STR based with a Bastard Sword, but with light armor and no shield . . . even with full tumble you;ll be moderately easy pickings. </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:59 AM - Apr 09, 2015",
      "content": "<div>Many thanks - I hadn't even thought about Harper Scout (forgot it even existed, truth be known). I'll see if I can get away with rapier, as your reasoning does make a lot of sense. I shall get back to you...<br/>\n<br/>\n Thanks again</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:00 PM - Apr 09, 2015",
      "content": "<div>I have to start by apologising to Theophilus Fist - sorry. I looked into the Harper Scout stuff, and was about to start building, when I got a call, and now have an agreement I can either do Greatsword or Bastard Sword with shield - so things change once again!<br/>\n<br/>\n I'm now looking at something on the lines of Barbarian 23/ Fighter 4 /Rogue 13 (for Epic Dodge) - but I don't know whether the Uncanny Dodges stack or not? If not, I'm not prepared to use up so many levels just for one feat, so I'd move it around to Barbarian 24/ Fighter 10 (or 8)/ Rogue 6 (or 8) (for Tumble).<br/>\n<br/>\n Another option might be Barbarian 27/ Bard 3/ RDD 10, but that drifts a bit more from the concept.<br/>\n<br/>\n Any thoughts welcome, good folk!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:03 PM - Apr 09, 2015",
      "content": "<div>Barbarian 17/ Rogue OR Assassin 13/ Fighter OR Champion Of Torm 10, is one suggestion,<br/>\n<br/>\n Barbarian 29/ Fighter 6/ HS 5, is the other.<br/>\n<br/>\n Do not take three main classes or else you are gonna have an exp penalty even with a Human. Theo's suggestion was a really good one except from the part that everything would come after 30th lvl in the build.</div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "9:50 PM - Apr 09, 2015",
      "content": "<div><blockquote><div><strong>Stagmeister wrote:</strong><hr/>I have to start by apologising to Theophilus Fist - sorry. I looked into the Harper Scout stuff, and was about to start building, when I got a call, and now have an agreement I can either do Greatsword or Bastard Sword with shield - so things change once again!<br/>\n<br/>\n I'm now looking at something on the lines of Barbarian 23/ Fighter 4 /Rogue 13 (for Epic Dodge) - but I don't know whether the Uncanny Dodges stack or not? If not, I'm not prepared to use up so many levels just for one feat, so I'd move it around to Barbarian 24/ Fighter 10 (or 8)/ Rogue 6 (or 8) (for Tumble).<br/>\n<br/>\n Another option might be Barbarian 27/ Bard 3/ RDD 10, but that drifts a bit more from the concept.<br/>\n<br/>\n Any thoughts welcome, good folk!</div></blockquote>\n<div align=\"left\">2-hander with Epic Dodge is doable . . . but not optimized.  Have you thought about Barbarian/Rogue/Weaponmaster? If you avoid Epic Dodge, maybe BB16/RO5/WM19  or BB15/RO3/WM22?<br/>\n<br/>\n If you keep Epic Dodge . . . BB20/RO13/WM7.  I'd have to build it out, but I believe Terrifying Rage and Epic Dodge could be had.  It's a shame, however, putting all those atribute points into Dex without getting any AB benefit.<br/>\n<br/>\n In either case, I'd do at least 16 lvls full BAB pre-epic.  </div></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:52 PM - Apr 09, 2015",
      "content": "<div><blockquote><div><strong>Stagmeister wrote:</strong><hr/>I got a call, and now have an agreement I can either do Greatsword or Bastard Sword with shield - so things change once again!<br/>\n<br/>\n I'm now looking at something on the lines of Barbarian 23/ Fighter 4 /Rogue 13 (for Epic Dodge)<br/>\n  </div></blockquote>\n<div align=\"left\">Just one thing. Epic dodge means you have a dex build. If you want to use dexterity to generate melee weapon AB, you will need Weapon finesse and use finessable weapons. Neither greatsword nor bastardsword are finessable.</div></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "9:55 PM - Apr 09, 2015",
      "content": "<div>i might also give a long look to BB26/MK9/SD5 if alignment changes are available, because free cleave, KD/IKD are great tools when you don't have WS/EWS or DevCrit.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:23 PM - Apr 09, 2015",
      "content": "<div>Hey guys!!<br/>\n<br/>\n I was wondering, why don't you do a Barbarian 28 / Bard 2 / RDD 10 and get DEX and CON increases at will since you'll be getting your STR from RDD.<br/>\n<br/>\n I think this is the best option that will be less-gimped.<br/>\n<br/>\n Take it EZ!</div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "11:43 PM - Apr 09, 2015",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong><hr/>Hey guys!!<br/>\n<br/>\n I was wondering, why don't you do a Barbarian 28 / Bard 2 / RDD 10 and get DEX and CON increases at will since you'll be getting your STR from RDD.<br/>\n<br/>\n I think this is the best option that will be less-gimped.<br/>\n<br/>\n Take it EZ!</div></blockquote>\n<div align=\"left\">BINGO!  And if he makes him a half orc, he could name him the HOOD (Half Orc Of Doom!)<br/>\n<br/>\n Oh wait.  That's been taken.  <img class=\"img-emoji\" src=\"emoji/11.gif\"/></div></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:45 PM - Apr 09, 2015",
      "content": "<div>Hahahah good one! :D</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:31 AM - Apr 10, 2015",
      "content": "<div>Good one Theo ;-)<br/>\n<br/>\n By the way, although in general Mick was right, i have two builds in the ECB that do have Epic Dodge but are STR-Based, if you want something like it.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:44 AM - Apr 10, 2015",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong><hr/>Good one Theo ;-)<br/>\n<br/>\n By the way, although in general Mick was right, i have two builds in the ECB that do have Epic Dodge but are STR-Based, if you want something like it.</div></blockquote>\n<div align=\"left\">\n That means Low AB :D</div></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:51 AM - Apr 10, 2015",
      "content": "<div>Well, you can't have anything and everything but i believe that 42 AB &amp; w/ WM's criticals to boot, its good enough. It's not monstrous Ab but she is no slouch either.<br/>\n<br/>\n<span style=\"color:#800080\"><span style=\"font-size:120%;line-height:normal\"><strong>Dodji Domotai</strong></span></span> =&gt; <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2353227/Dodji-Domotai-Fighter-16-WM-7-Rogue-17#.VScB4pNS2r8\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... ScB4pNS2r8</a></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:10 PM - Apr 23, 2015",
      "content": "<div>Thanks everyone - plenty to think about! Sorry I've been out of the loop for a couple of weeks - I've now managed to (re)load NWN at last, and have been haring around the OC and HoTU with my little Elven tank so I can get to The Gods Themselves and Sands of Time (as per our very long thread). So playing, not building. Apologies.<br/>\n<br/>\n Anyway, thought I'd log back in to check I'm patching, modding appropriately for that campaign, and then thought I'd see what else was going on - and blimey, you've all been very helpful! With this many options I'll have to do a lot of compare and contrast work, but I will get back to you with my final build for you to throw bricks at, I promise!<br/>\n<br/>\n And now, off to play with the Frost Giants in Cania...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:43 PM - May 04, 2015",
      "content": "<div>@ Valerfor - I've had a good, long look at the various possible incarnations of this build, and interestingly enough for one that was initially majoring in Barbarian, your Dodji Domotai comes closest to delivering what I need! Thank you. Just a couple of questions. While I've got movement from the person who's looking for this character in many areas (such as dropping Barbarian, wearing decent armour and shield early on, etc), he's not budging on the build being human, and really wants a bastard sword - tho' I have explained the benefits of the much-underrated scimitar. So, would a BS-wielding human version wreck the build, or would it just take a couple of tweaks?<br/>\n<br/>\n Thanks in advance. (Btw, your Shadow Avenger is going great guns in SoU at the moment - currently lvl10)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:38 PM - May 04, 2015",
      "content": "<div>The extra feat that Humans get can be used for exotic weapons proficiency, but you'd lose 2 points starting DEX, and so you would have to boost DEX instead of STR 2 times to get enough DEX for Epic Dodge. Since Valerfor never tels us when to boost what ability, I don't know whether that would result in having to delay Epic Dodge, but I do know that your AB would be -1 from the loss of 2 STR. On the plus side, you will get +2 CON, so you get more health and +1 on Fortitude saves.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:52 AM - May 05, 2015",
      "content": "<div>@ Empyre - Cheers. I'd started having a look at what might happen with STR 16, DEX 17, CON 11, and INT 12 - primarily because I'm not that fussed about points in Open Lock, Disable and Set Trap (saving me 35 skill points), and I could live without a full deck of Spot. I had thought about pumping CON by 1, but that - together with the +1 needed in DEX, I'd just come around to thinking was too much of a penalty elsewhere (AB, for example). So I'd begun scratching the old head and thought I'd have a look here to see if anyone had replied - and guess what - you've come to the same conclusion as me! At least this means I'm learning!<br/>\n<br/>\n @ Valerfor - any enlightenment, please?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:04 AM - May 06, 2015",
      "content": "<div>Sorry Stag, last days were being rough on me so i could not reply earlier,<br/>\n<br/>\n For altering Dodgi's build with Human genetics, that would indeed give you a free feat that you could use for Exotic weapons (no-father sword) but that would mean you end-up with 1 AB less, no big deal perhaps, but i was trying for best AB when i made this. Anyway, if you choose to do so, the benefits are as Empyre says with the addition of 43 skill points that you could use for stealth and so on, OR you could just take a longsword instead of a bastard-sword and change nothing at all from the build.<br/>\n<br/>\n Glad you enjoying \"Shadow Avenger\" ;-)<br/>\n<br/>\n ~ You point - I punch!</div>"
    }
  ],
  "author-color": "#AA0000"
}