{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "947",
  "name": "Anemoi Builds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/anemoi-builds-t2354931.html",
  "author": "Brabeum",
  "avatar": "10758905_1525336315.jpg",
  "replies": "6",
  "views": "637",
  "posts": [
    {
      "author": "Brabeum",
      "avatar": "10758905_1525336315.jpg",
      "timestamp": "5:08 AM - Jul 29, 2018",
      "content": "<div>So I just started playing on this Arelith offshoot PW that just opened called Anemoi. I am still new and could use some advice and suggestions for builds. <br/>\n<br/>\nIn addition to all the Arelith changes to feats, classes, skills, and the added stuff,  paths like Kensai and Favored Soul, +2 to up to 2 stats at character creation, this new server is capped at level 15.<br/>\n<br/>\nYou progress further by purchasing feats, even epic ones from a trainer for gold. Almost every PRC and feat has had its minimum requirements reduced and levels lowered to be obtainable.<br/>\n<br/>\nSo long story short, you could eventually train every feat your class qualifies for and cap every class skill by taking just one level of in that class. Which kinda makes feats and skills not really relevant. Just get the ones you want the most first. <br/>\n<br/>\nIt seems to me, what really matters is which 3 classes to choose, and how many levels to put in each class. So what would you play on this server and why?<br/>\n<br/>\n<br/>\n<br/>\n   </div>"
    },
    {
      "author": "Brabeum",
      "avatar": "10758905_1525336315.jpg",
      "timestamp": "7:27 AM - Jul 29, 2018",
      "content": "<div>Currently I am thinking a dual wielding rogue for access to all those fun skills and nifty epic rogue feats like Slippery Mind, Crippling Strike, etc. Then throw in a few cleric levels for buffs, the war domain, and access to all the metamagic feats. and their perks, yoink and such. Third is the one I am on the fence about. Sneaky Assassin? Zen PDK Mounted archer? Tanky Dwarven Defender? Wise Summoner?</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:54 PM - Jul 30, 2018",
      "content": "<div>How about hitpoints, stats (str/dex etc), saves and spell progression, can you buy them with gold too?<br/>\nEG: If I have a character with 1 wizard level, can I buy the ability to cast high level magic with a high spell penetration?<br/>\nIf that is the case, then what purpose has character levels?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Brabeum",
      "avatar": "10758905_1525336315.jpg",
      "timestamp": "12:28 PM - Aug 01, 2018",
      "content": "<div>Yes, you can buy them with gold too. You can buy hit points by buying the toughness feats. You can train in the many feats that improve saving throws, including the \"must be taken at level one\" ones. You can also purchase a few spell slots in each of the first 5 spell levels with one level in the class (and a high enough prerequisite stat.)  But your spells that improve with caster level will suffer.<br/>\n<br/>\nThe purpose of 15 levels? I would imagine to give players some more hit points, to give a progressive feel to the content, to make balancing easier, and so more people will be able to play together. No 9th level spells. <br/>\n<br/>\nStill thinking I want to play cleric and rogue. still debating what to take third.  Oh and clerics on this server are synergistic. Whatever spell they cast on others they cast for free on themselves as well. So slotting and then casting stuff like Slay Living would be a bad idea. Buffing a partner and yourself on the other hand is twice as easy as before. <br/>\n<br/>\nSo my thinking is heavy on the cleric so buffs last a while, something like 11 cleric / 3 Rogue / 1 Fighter maybe?  Rogue is for locks and traps, and epic rogue feats like slippery mind and crippling strike, fighter for all the combat feats including weapon spec,  the rest cleric for heals and buffs.</div>"
    },
    {
      "author": "Brabeum",
      "avatar": "10758905_1525336315.jpg",
      "timestamp": "7:06 PM - Aug 01, 2018",
      "content": "<div>So I guess given the level makeup, I'd like to know what starting stats to take (Including taking up to two Arelith gifts of +2 to two stats.) Should I go DEX or STR? WIS? I would prefer STR if possible. I only get the three +1s to stats from levels 4, 8, and 12 and as far as feats, I did not see the Greater STR/DEX/WIS feats at the trainer.  </div>"
    },
    {
      "author": "Brabeum",
      "avatar": "10758905_1525336315.jpg",
      "timestamp": "7:06 PM - Aug 01, 2018",
      "content": "<div>Oh and the race is human.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:24 AM - Aug 03, 2018",
      "content": "<div>Well it looks like a crazy setup, far from normal NWN, and i have no experience with it. From what you tell, I would have focused on the cleric class for buffing and support. You get some very potent buffs from 15 cleric levels, so I would be careful not to stray away from that.</div>",
      "author-color": "#AA0000"
    }
  ]
}