{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "984",
  "name": "[Arelith] Help Pure Sorc Build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-help-pure-sorc-build-t2354857.html",
  "author": "ssyun153",
  "avatar": "10758893_1525336314.jpg",
  "replies": "2",
  "views": "617",
  "posts": [
    {
      "author": "ssyun153",
      "avatar": "10758893_1525336314.jpg",
      "timestamp": "9:10 PM - Apr 18, 2018",
      "content": "<div>Looking to make a pure sorcerer build, that allows me as many spells as possible per day since the resting in Arelith servers are limited. I would also like to solo as much as possible using pet summons and such to help fight. However my knowledge of this game is still very limited as i'm still a new player and would like any suggestions and or builds out there for the level 30 cap server. Also my main damage attack in later levels will be the great missile lines combined with the stop time spell. With the servers limited resting how does a caster get around fighting when he/she is out of spells? I'm also open to pure wizard builds if that is a better option for this type of server.<br/>\n<br/>\nBuild: <br/>\n1. Keeping in mind the \"Arelith\" rule set<br/>\n2. Race - Human for the extra feat<br/>\n3. any alignment<br/>\n </div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "4:10 PM - Apr 20, 2018",
      "content": "<div>In a rest restricted environment, there are two feats for a sorcerer that will help with the lack of sleep.<br/>\n<br/>\nScribe Scroll and Craft Wand.  <br/>\n<br/>\nOn most servers craft wand is not very useful as the spells don't scale and the charge per wand is often very low.  Craft wand also doesn't allow you to make a wand with anything over lvl 4 spells.  On some servers its been modified to scale spell level and change amount, and on those worlds its worth your weight in gold.<br/>\n<br/>\nScribe scroll on the other hand will be very useful for you.  Keep a bag of empty scroll paper handy and every time before you rest, scribe all your leftover spells to scrolls.  Wont take long before you have a huge backup stash of scrolls to use.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:29 PM - Apr 20, 2018",
      "content": "<div>Hi ssyun<br/>\nAre you looking for a straight up level 30 sorcerer build like:<br/>\n1: Sorcerer (1)<br/>\n...<br/>\n30: Sorcerer (30)?</div>",
      "author-color": "#AA0000"
    }
  ]
}