{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "313",
  "name": "“Flat in Kochi: Symbol of Unbound Luxury”",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/flat-in-kochi-symbol-of-unbound-luxury-t2354259.html",
  "author": "BerkeleySullivan",
  "avatar": "no_avatar.png",
  "replies": "4",
  "views": "408",
  "posts": [
    {
      "author": "BerkeleySullivan",
      "avatar": "no_avatar.png",
      "timestamp": "6:56 AM - May 16, 2014",
      "content": "<div><a class=\"postlink\" href=\"http://www.jairajbuilders.com/\" rel=\"noreferrer\" target=\"_blank\">Flat in Kochi</a> is often regarded as a much publicized symbol of extravaganza and new urban life culture engulfing Indian cities. Kochi based builders developed millions of square feet built up space since their beginning dating back to 1990s. Residential flats in Kochi are located near elite housing areas in the City inhabited by the rich and mighty. Ample parking space, modern amenities, premium facilities and affordability attracts more people towards flats in Kochi. Flat in Kochi is a perfect combination of spaciousness, modernity, attraction and professional excellence. Automatic generator backup, CCTV surveillance facility, video door phone and roof top swimming pool are unique features available in Kochi flats.Kitchen area in a typical Kochi flat is well equipped with granite counter top, water purifier, stainless steel sink and wall mixer. Common amenities available in Kochi flats include cable television, waste management system, and kids play area. Water treatment plant, guest house facility, well equipped health club, air conditioned party hall and excellent interior design solutions will take you to new world of comforts. Residential apartments in Kochi are incredibly stunning, exotic, astounding, attractive and sensational. Quality specifications offered by Kochi flat builders are unmatched in all respects and it stands as a hallmark to their work excellence. Kochi residential flats offer their coveted residents a well planned and nicely furnished living space. Each square foot of Kochi flats is designed with best available material in the universe like Malaysian teak wood and Italian marble. Get ready to enjoy a euphoric living experience in a high class apartment in Kochi Township.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:36 PM - May 17, 2014",
      "content": "<div>What is this post doing here and where the thread with the yardstick builds go?<br/>\n<br/>\n It seems that with each forum changes, there are some problems in the beginning that i hope they will be fixed soon.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:43 PM - May 17, 2014",
      "content": "<div>Since Kail is the only admin on this server and he has vanished, we are stuck with any bot that gets into the forums. I have selected Ignore on that account, and I suggest you do, too.<br/>\n Wait, the whole thread with yardsticks is gone? OK, i just looked, and somehow, it got bumped back to the 7th page.<br/>\n Here's a link: <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2293896#.U3fXSCjwmUk\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/22 ... 3fXSCjwmUk</a><br/>\n EDIT: OK, I bumped it, and it is back on page 1.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:16 AM - May 19, 2014",
      "content": "<div>Thank you empyre, for a moment i thought it was gone completely-but you found it!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:57 AM - May 19, 2014",
      "content": "<div>I used the forum search.</div>",
      "author-color": "#00AA00"
    }
  ]
}