{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "953",
  "name": "Need help tailoring a Winter Soldier concept.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/need-help-tailoring-a-winter-soldier-concept-t2354913.html",
  "author": "TychoVelius",
  "avatar": "10758924_1537379651.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "TychoVelius",
      "avatar": "10758924_1537379651.jpg",
      "timestamp": "12:48 AM - Jul 04, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Was thinking at work while running machines, and took down some notes. I was listening to some voordeel videos, specifically her Captain America playlist, and the Winter Soldier is one of my favorite characters from the MCU. I started thinking of how I could play a similar character.<br/>\n<br/>\nFirst thing I wrote down was that I needed Pale Master, for the arm. Best analog I could think of, and it adds to the 'unkillable' nature of the character, operating basically as a human with a strong arm in a setting full of gods and monsters.<br/>\nI had a decision then, whether to focus on the Soviet sniper aspect of the character or the brawler. Brawler would require monk, at first ponder, but then I realized that despite the fact that he does most of his fighting in the setting unarmed, it would make just as much sense for him to use knives, which he also does in the movies. He's definitely ambidexterous, switching hands a few times when knife-fighting with Cap, so that pushed me towards ranger. I searched the ECB archives, and came up with a candidate.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build251653.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 51653.html</a><br/>\n<br/>\nNow, some things about the build confused me. It takes heavy armor proficiency at first level, but rangers can't dual-wield in heavy armor. On further reading, it seems that the build is only supposed to dual-wield with modifications, splitting Str/Dex to 14/14 and using lighter armor. <br/>\n<br/>\nSo, it seems that by going with the 14/14 version, I could play the pre-conversion Winter Soldier, up to Epic levels where I start taking Pale Master levels until I get the Undead Graft. Not a mechanically overwhelming feature, but cool enough, and it fits the theme. Pondering what I should replace the opening feat with, and thinking that since I already have a trapper (that we've only had a few options to use) in the Strategist, perhaps the Winter Soldier will drop Set Trap and Taunt in favor of Hide and Move Silently. Also, does the save bonus from Spellcraft depend on rank or overall value? The build lists 38 ranks resulting in a score of 40, is that enough for the bonus, or will I need to sink a couple more points in there?<br/>\n<br/>\n<br/>\nIt breaks theme a bit, in that the Winter Soldier isn't any sort of arcane, and if I really wanted to keep that out, the best Winter Soldier build would probably just be a Fighter/Rogue/Weaponmaster, and I wanted something a bit juicier. The Palemaster arm sold me on it. I'm still open to better ways of portraying the character, though.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:05 PM - Jul 06, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Kail leaves it open what weapon to focus on. You may pick a heavy weapon and have strength based warrior in full plate with extra AC and immunities from PM. What Ranger then brings to the build is the BoE and FE bonus along with the spells and skills.<br/>\nThe AC from PM is +6. Add that to +3 from studded leather and it is better than the +8 other characters get from full plate. If you start with the 14/14 option, the ac gets even better from +2 from dexterity. Rangers can boost that with Cat's grace for another + 1 or 2 to AC. With items granting a dex bonus, you can even get a dex high enough to downgrade your armor to leather or padded with even better AC!<br/>\nKail leaves this as an option.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TychoVelius",
      "avatar": "10758924_1537379651.jpg",
      "timestamp": "11:35 PM - Jul 06, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Going with the 14/14 option.<br/>\n<br/>\nSkipping Set Trap to apply to Hide/MS, but I'm undecided on Taunt, because I just don't know how useful it is. Saving points for now.<br/>\n<br/>\nAlso struggling with my conscience over using daggers or kukris. Kukris are mechanically better, I have a free feat since I'm not taking Heavy Armor, and I can cast Blade Thirst on them. Daggers are more thematic and less cheesy, and have more CEP visual options. I might flip a coin. I could be super cheesy and use a two-bladed sword, but kukri and dagger are at least analogous. If only daggers were pierce/slash...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:36 AM - Jul 07, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's a tough concept to do TychoVelius but the build you have chosen is good for this job. I am only concerned with it only have five favoured enemies though, since personally, I never go below seven.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}