{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "163",
  "name": "Arcane/Divine Advice Please",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arcane-divine-advice-please-t2354527.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:49 PM - Apr 19, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello All.<br/>\n<br/>\n I'm now 18 months into my NwN experience, and thought it was about time I started dabbling in the weird and wonderful world of magic. I've played Bards and CoTs, but uncharismatic ones, and I've never used a scroll that wasn't curative. So I thought, who better to ask for a recommendation for a magic newbie than the Guild?<br/>\n<br/>\n My plan would be to take them through either the OC or SoU/HotU to familiarize myself a bit with how they work, but I'm open to suggestions as to whether some sort of Cleric, Druid, Sorcerer or Wizard would give me a good basic introduction. There seem to be so many that look good, but I think I need to play a few before I fully understand them (and I have read some of the Game Guides). It may well prove a challenge, as I have thus far been a fairly hardline meleer who just likes to get in the thick of things.<br/>\n<br/>\n Thanks in advance<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:25 PM - Apr 19, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The OC is so silly easy even on the hardest difficulty, I suggest something that gets you two of the class-specific quests, the Cloak Tower membership(Ch 1) and Druid Circle (Ch 2).  You'll need at least Dru 7 reached sometime during Ch 2 to get the full circle test so can use the other 11 for your mage (a wiz will reach level 6 spells, a sorc level 5 only).  The fact that the spells will be limited for both classes and that the ability spread will be slightly thin will help to boost the challenge somewhat.  But you will be able to hone your casting technique all that much better being handicapped that far.  Plus get to compare and contrast familiars and animal companions first hand.<br/>\n<br/>\n Naturally, you could just go pure mage then follow-up with pure druid but my suggestion sort of shortcuts the whole intro thingy using the OC.  But keep in mind that when spells like IGMS and the Bigby line begin to become available, the momentary challenge will end abruptly since the OC was never rebalanced.<br/>\n<br/>\n Then I would play cleric for SoU/HotU just because it rox and HotU especially will provide nice challenge.  There are some usable level 28 cleric builds around here I think and probably some in the legacy archive listed as pre-epic builds.<br/>\n<br/>\n That should give a good intro into spellcasting although, TBH, a self-buffer cleric tends to do more smackdown than offensive casting.  Just try to force yourself to use the weapon a finisher to get a good perspective on the exploits and limitations of the cleric's full repertoire.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:43 PM - Apr 19, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sage counsel as always, Hip. Thank you. Although I might raid here for a Cleric first, and then try to put something together myself for the Wiz/Druid.<br/>\n<br/>\n Cheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}