{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "566",
  "name": "Beory's Twin-Bladed Silencer (Cleric 35 / Fighter 4 / Rogue 1)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/beory-s-twin-bladed-silencer-cleric-35-fighter-4-r-t2355534.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 13,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:43 PM - Aug 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong><span style=\"font-size:150%;line-height:normal\">Beory's Twin-Bladed Silencer</span></strong><br/>\n<br/>\n<strong><span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202008/10759084_e4290e68132ed490d5e067557f9201d2_t.jpg\" />\n</dl>\n</span></strong><br/>\n<span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://i.pinimg.com/736x/c0/f1/aa/c0f1aa1a34c4c9bdf12fdd7a8c239b8f.jpg\" rel=\"noreferrer\" target=\"_blank\">https://i.pinimg.com/736x/c0/f1/aa/c0f1 ... 239b8f.jpg</a></span><br/>\n<br/>\n<br/>\n<br/>\nThis is a concoction I made up:<br/>\n<br/>\n- Cleric 35 for awesome caster levels, undispellable and Mord resistant buffs, bonus feats and auto-silent III<br/>\n- Fighter 4 to obtain martial weapon proficiency for shortswords and bonus feats to help with ITWF, EWS, and getting 30 Str<br/>\n- Rogue 1 for UMD, Tumble 40 and 1d6 sneak attack<br/>\n<br/>\nThere is a self-silence Auto-Silent III strategy which is similar to Grizzled_Dwarflord's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/vicar-of-the-void-cleric-35-monk-4-ranger-1-t2355317.html\" rel=\"noreferrer\" target=\"_blank\">Vicar of the Void</a>, attack those dreaded mages with an up to 35 round duration self silence aura, casting spells with autosilent III while they remain silenced. But instead of using implosion to kill mages, this build uses dual shortswords with Str 30-&gt;42 (+16 str damage main / +8 str damage off hand), Divine Favor (+5 magical) / Darkfire (+11-16 fire) and WS/EWS (+6) combined with 5-7 APR (depending on divine power and haste) for <span style=\"text-decoration:underline\">up to 285 added damage / round</span>, not even including weapon damage (including weapon enchantment from GMW +5 or UMD), 1d6 sneak attack and critical hits (with all the attacks / round plus AB buffs I take improved critical). <br/>\n<br/>\nThere is also a full awesome 9th circle cleric spellbook which I buff further with animal domain for stronger summons to tank or do damage and true seeing as a level 3 spell (to compensate for the lack of a detection skill). Assuming I can cap AB with all the cleric buffs along with capping strength, AB should be 38 + 6 + 20 -2 (dual wielding) +2 (flanking AB with an empowered summon active) = 64. AC of enemies can be lowered with Darkness, Battletide, Word of Faith, SoV stun etc, plus all the strength is handy if one wishes to fill level 6 and 7 spell books with harm spells (or heal/mass heal against undead) for melee touch attack AB, which uses strength to determine AB.<br/>\n<br/>\nWeaknesses I can see are reflex save and low skill points. I wish there were more skill points to put into concentration and spellcraft. I could drop HP to get it, but HP isn't the highest, it is ok at 366hp, which can get  capped at 606 hp and there is undispellable endurance. Fort and Will saves are pretty average, and there is only +4-5 against spells due to the lack of skill points. There is also a slight delay with getting level 8 and 9 cleric spells to level 24 and 27 but there is very powerful combat ability to compensate plus the overpowered Word of Faith spell to blind anyone in a huge area without a save. Epic weapon specialization is late at level 36, and a 74 skill point dump at level 37 for UMD and Tumble 40 (but that skill dump I think is definitely worth it - we shall see with play testing). 20% Exp penalties from level 37+. Auto-silent III is also late too. It will be scared of the usual suspects, dev critters, implosion users, sneakers, but a full cleric spell book plus UMD grants a whole bunch of tricks to deal with em.<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202008/10759084_58e92ff718314e05fc8a885eea39f8a4_t.jpg\" />\n</dl>\n</span><span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://artfiles.alphacoders.com/793/79335.jpg\" rel=\"noreferrer\" target=\"_blank\">https://artfiles.alphacoders.com/793/79335.jpg</a></span><br/>\n<br/>\nOverall I think the build has incredible strengths and have playtested it to level 7 already with all the AB buffs and AC buffs along with animal domain summons it feels very powerful and very fun to play. <br/>\n<details><summary>Spoiler</summary>Cleric(35), Fighter(4), Rogue(1), Human\n\nDEX: 15\nWIS: 15 (19)\nCHA: 8\nHuman: (Quick to Master)\n02: Fighter(1): Weapon Focus: Shortsword\n04: Cleric(3): WIS+1, (WIS=16)\n06: Cleric(5): Blind Fight\n08: Cleric(7): STR+1, (STR=17)\n10: Cleric(9)\n12: Cleric(11): WIS+1, Improved Two-Weapon Fighting, (WIS=17)\n14: Cleric(13)\n16: Cleric(15): STR+1, (STR=18)\n18: Cleric(17): Improved Critical: Shortsword\n20: Cleric(19): STR+1, (STR=19)\n22: Cleric(21)\n24: Cleric(23): STR+1, Great Strength II, Great Wisdom I, (STR=22), (WIS=18)\n26: Cleric(25)\n28: Fighter(2): STR+1, Epic Weapon Focus: Shortsword, (STR=24)\n30: Cleric(28): Great Strength IV, (STR=25)\n32: Cleric(30): STR+1, (STR=26)\n34: Cleric(32): Automatic Silent Spell II\n36: Fighter(4): STR+1, Weapon Specialization: Shortsword, Epic Weapon Specialization: Shortsword, (STR=28)\n38: Cleric(33)\n40: Cleric(35): STR+1, Automatic Silent Spell III, (STR=30)\nHitpoints: 366\nSaving Throws (Fortitude/Will/Reflex): 23/25/18\nBAB: 25\nAC (naked/mundane armor/shield only): 20/30\nAlignment Changes: 0\nSpellbook\nLevel 2 - Mostly Divine Favor, some Bulls/Endurance/Owl's/Barkskin/Aid\nLevel 4 - Divine Power / Death Ward\nLevel 6 - Heal / Harm / some Greater Sanc\nLevel 8 - WoF / Summon VIII-&gt; IX / Aura vs Alignment\n\nConcentration 35(35), Open Lock 1(3), Spellcraft 24(24), Tumble 40(42), UMD 34(33)\n\n02: Concentration(1), Save(4), \n04: Concentration(1), Spellcraft(1), Save(5), \n06: Concentration(1), Spellcraft(1), Save(7), \n08: Concentration(1), Spellcraft(1), Save(9), \n10: Concentration(1), Spellcraft(1), Save(11), \n12: Concentration(1), Spellcraft(1), Save(13), \n14: Concentration(1), Spellcraft(1), Save(15), \n16: Concentration(1), Spellcraft(1), Save(17), \n18: Concentration(1), Spellcraft(1), Save(19), \n20: Concentration(1), Spellcraft(1), Save(21), \n22: Concentration(1), Save(24), \n24: Save(29), \n26: Save(35), \n28: Save(41), \n30: Save(47), \n32: Save(53), \n34: Save(59), \n36: Save(65), \n38: Concentration(3), \n40: Concentration(3), \n</details>\n\nI did wonder about dropping EWS and going Cleric 38 / Fighter 1 / Rogue 1 but in this situation losing 3 caster levels for up to +42 damage / round I thought was well worth it.<br/>\n<br/>\nI could have gone dual kama monk for preying mantis / ultimate woodpecker power, but there is something cool about running around with two flaming swords clad in full plate.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:55 PM - Aug 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have not tried the auto silence III tactics yet. Even so, correct me if I am wrong,  wasn't that about attacking mages with spells within a silence aura? <br/>\nIf your plan is to attack with your two swords, would not an ordinary silence spell be enough to silence the mage?<br/>\n<br/>\nApart from that, it is difficult to go wrong with cleric power and you have plenty of it.<br/>\nDual wield comes at a cost; dex 15, con 10, int 10. You repair some with toughness. But you are skill starved.<br/>\n<br/>\nI am not a fan of builds with a single late skill dump. They may look good on paper, but playability often suffers. What about cleric 32/ figher 4/ rogue 4?<br/>\nYou lose an epic bonus feat, but gain skill points, more frequent skill dumps and get an opportunity to avoid the xp penalty. Cleric 32 is still undispellable by a good margin, penetrates epic SR items and is not shabby at all.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:30 PM - Aug 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Mick<br/>\nThanks for reviewing my build draft and your suggestions, appreciate your expert opinion as always.<br/>\n<br/>\nAuto-silence III is core to the build's concept, I know you are not suggesting dropping it but to explain my thoughts regarding it:<br/>\nI am just imagining if I am self-silenced for up to 35 rounds and things turn bad, really bad, I've killed the mage, but suddenly there is a mob on me. <br/>\nI want to cast a darkness spell, summon creature spell, word of faith, heal/harm spell, divine favor, greater sanctuary, buff a teammate or summon, the mage casts greater spell breach rather than greater dispelling and I have to recast NEP or spell resistance etc... divine favor has run out mid silence as it is less than 1/3rd of the silences duration <br/>\nWaiting for the self-silence spell to run out after killing mages and dealing with the subsequent mobs with minimal spellcasting might be annoying or even life ending, if I don't have any emergency scrolls in my possession to escape the mobs. <br/>\nAnyway Autosilence III seems to me to be a better choice than armor skin and two great wisdoms, because I am less afraid to self-silence myself than I usually am. Maybe a wand of dispel, self targeted could get rid of the self-silence but maybe I might fail a roll or two to get rid of it, then I might be in trouble. <br/>\n<br/>\nI'll have a think about the rogue skill dumps, I didn't chase em, any other class other than cleric or sorcerer I normally chase those skill dumps but those two classes offer so much power rushing to level 25-26 just feels better when I play em. Here the build draft is rushing cleric 26 for undispellability and to access level 8 / 9 spells, then auto-silence II-III to be able to cast divine favor, divine power, battletide, greater sanctuary, heal and harm while self-silenced while taking Great Strength VI for 30 Str. I am wary of building for the journey however.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:09 PM - Aug 13, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I did not suggest to drop auto silence,  but the thought crossed my mind so to speak. It is a heavy investment in feats in a rather feat starved build, only for the conveniece of re buffing. Silence spell alone can help you with that if you plan ahead. <br/>\nBut then again, auto silence is not my cup of tea. Nevertheless, I question the value of auto silence in a self-buffer melee build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:03 AM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hehe feat starved is a huge complement, it means I have pushed things to the limit trying to pack as many features in as possible, my usual modus operandi :)<br/>\nAnyway I will test it out and let you know, it seemed the most interesting and maybe most powerful way to make use of the limited choices with the cleric bonus feats from ultra high levels, I am curious to see how it all goes<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:26 AM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, play and test it. There is a saying: The proof is in the pudding.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "5:40 AM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The complete saying is,<br/>\n\"The proof of the pudding is in the eating.\"<br/>\nWhich still means, yes, test it.<br/>\n<br/>\nSent from my Pixel 3 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:56 AM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've had a nibble and its delicious gkorjax!<br/>\n<blockquote><div>It is worth remembering that, as the phrase is quite old, the pudding wouldn't have been a sticky toffee pudding from the sweet trolley, but a potentially fatal savoury dish. In Camden's listing of proverbs he also includes \"If you eat a pudding at home, the dog may have the skin\", which suggests that the pudding he had in mind was some form of sausage. THE OED describes the medieval pudding as 'the stomach or one of the entrails of a pig, sheep, or other animal, stuffed with a mixture of minced meat, suet, oatmeal, seasoning, etc., and boiled'. Those of you who have ventured north of the border on Burns Night will recognize this as a fair description of a haggis - \"the great chieftain o' the pudding-race\", as Burns called it in the poem Address to a Haggis, 1786. medieval peasants, faced with a boiled up farmyard massacre, might have thought a taste test to have been a wise choice.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.phrases.org.uk/meanings/proof-of-the-pudding.html\" rel=\"noreferrer\" target=\"_blank\">https://www.phrases.org.uk/meanings/pro ... dding.html</a></div></blockquote><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "6:24 AM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice. My only thought would be what Mick suggested regarding Rogue 4. Since she’s not exclusively a caster cleric, dropping cleric to 32 will hardly matter other than the loss of a bonus feat. In return you gran evasion, a little uncanny dodge, and some consistent umd/tumble drops. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "11:40 PM - Aug 14, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Orion!<br/>\n<br/>\nWell, I guess it's all a matter of opinion, of course, but clerics are kind of my specialty. The build doesn't look bad at all. No builds with this many Cleric levels are, but I wonder how much of its choices are actually part of the original concept. Because some of them seem to kind of be working against it, sort of. Let me be more specific:<br/>\n<br/>\n1- Is STR-based part of the concept? Since you're kind of value-owning yourself for needing 15 DEX for the dual-wielding feats, which forces you to start with 10 CON and take Toughness in a feat-starved build, I was wondering if it wouldn't be better to go DEX, since Divine Power sets your STR to 18 anyway. This way you'd need one more feat for Weapon Finesse, but you could get that feat either by going Cleric 32/ Rogue 2/ Fighter 6 or by just dropping Toughness and keeping things as they are. That would allow you to rearrange some stat points for a much higher CON score.<br/>\n<br/>\n2- Does it have to be Short Swords? If you're taking Fighter levels just for the Martial proficiency, I wonder if you'd be open to other weapons. I was thinking either daggers or, in a more radical change to the build, maybe Monk for Kamas and a multitude of attacks per round. It'd need to be DEX, though.<br/>\n<br/>\nAnyway, just wondering. Depending on if and what you answer to this, I might have something else to suggest.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:33 AM - Aug 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Max!<br/>\n<br/>\nFabulous to hear from you, and thanks for reviewing my build draft and making suggestions.<br/>\n<br/>\nStrength based is a core concept, mostly for a low mid magic setting for extra damage where weapon damage is not overpowering and the added bonuses are helpful. It has EWS so Dex is an option though I would want to rearrange things to get it sooner in a Dex build. <br/>\n<br/>\nShortswords that is because WoG has a fabulous shortsword that reliably drops late epics, sadly the best reliable kama drop is mid pre epic. Things might change with the new adventure DM Wise is working on (Githyanki and Astral Planes) so maybe there will be some other cool  weapons I might have to adjust to. Dagger is very attractive for sure, kukris are another excellent choice if I take exotic instead but shortswords at the moment are the weapon to go for... I think<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "8:28 PM - Aug 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion wrote:</cite>Hi Max!<br/>\n<br/>\nFabulous to hear from you, and thanks for reviewing my build draft and making suggestions.<br/>\n<br/>\nStrength based is a core concept, mostly for a low mid magic setting for extra damage where weapon damage is not overpowering and the added bonuses are helpful. It has EWS so Dex is an option though I would want to rearrange things to get it sooner in a Dex build. <br/>\n<br/>\nShortswords that is because WoG has a fabulous shortsword that reliably drops late epics, sadly the best reliable kama drop is mid pre epic. Things might change with the new adventure DM Wise is working on (Githyanki and Astral Planes) so maybe there will be some other cool  weapons I might have to adjust to. Dagger is very attractive for sure, kukris are another excellent choice if I take exotic instead but shortswords at the moment are the weapon to go for... I think</div></blockquote>\n\nHey Orion, <br/>\n<br/>\nThanks for the warm welcome. I only do comment in builds where I like what I see, but also see room for improvement. Having played on WoG extensively in the past, though I know things are much different in the EE version from the 1.69 one, where I still occasionally play, I have never really had much problem playing DEX characters to mid-epics with ease. Quite the contrary, I've struggled way more with Strength toons. And even if DEX does mean less damage, it also means higher AC, and if anything, a Cleric character will be the one that suffers the least with this problem, with so many damage buffs at their disposal. They will struggle in very few specific situations, like the Duergar that have DR AND are immune to fire. Nonetheless, I do think this guy would not only be doable, but also be better as a DEXer than it is now. Up to you if you want to follow that advice or not, bt up to level 12, I level Clerics using Animate Dead and Darkfire. You just tear through everything with that skelly. And your character can just watch and inflict wound to heal it.<br/>\n<br/>\nI believe the optimal spread for this guy would be 32 / 2 / 6. Lose a Cleric Bonus Feat and 3 caster levels, gain a Fighter Bonus Feat, plus Evasion and a MUCH smoother leveling with that skill dump at 22. You also have XP penalty, but on WoG that's hardly an issue. <br/>\n<br/>\nJust for the record, my Magical Master (Maximillian Kane), who is level 40 on WoG still has THAT Kama you mentioned, and he does just fine in melee combat with it. You can also get an acid one at the WF chests, which will be useful against enemies with Fire resistance. But yeah, there are some nice short swords out there indeed. <br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:42 AM - Aug 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Max! <br/>\n<br/>\nThe 32 - 2 - 6 split I think is a very thoughtful suggestion. Keeping the 30 str, Wis 19, auto silent 3, losing three caster levels for an extra skill dump (particularly tumble 25 for 5 ac) and evasion. My only worry is fighting something like Drow and I want my darkness/ultravision, word of faith or SoV to penetrate their CL +11 spell resistance, or the Sultan's monks for example I suspect they will be very tough. Improved evasion can be gotten on items too, by the time I get rogue 2 at lvl 37 I would possibly have access to such items. I might try to rely on the awesome power of the cleric class to carry me without the dump till late and play for level 40 power for 3 caster levels I know I know... <br/>\n<br/>\nRegarding a Dex version, I think i would want uncanny dodge and then epic dodge with all that dex, then monk for sheer power... The Shadow Priest written in 2010, would be a good template for something like that, if I were to go Dex I would lead towards that... add ITWF to it for even more attacks. I like to explore the less travelled path so to speak, so I chose Str based here ITWF Str cleric isn't greatly explored mostly because of the incredibly demanding requirements I suspect. If I go dex based , maybe a cleric 26 rogue 13 monk 1 type split would allow for epic dodge and ultra high Dex... and 10 apr and all that sneak would be awesome, provided it penetrates (Uncanny dodge changes 1.74+) <br/>\n<br/>\nAnyway this is what I came up with:<br/>\n<br/>\nITWF Dex Kama Cleric 26 / Rogue 13 / Monk 1<br/>\n<details><summary>Spoiler</summary>Cleric(26), Monk(1), Rogue(13), Human\nSTR: 14\nCON: 12\nINT: 8\n\n01: Rogue(1): Ambidexterity, Two-Weapon Fighting\n03: Cleric(2): Weapon Proficiency Exotic\n05: Cleric(4)\n07: Cleric(6)\n09: Cleric(7): Weapon Finesse\n11: Cleric(9)\n13: Rogue(3): {Uncanny Dodge I}\n15: Cleric(12): Improved Two-Weapon Fighting\n17: Cleric(14)\n19: Cleric(15)\n21: Cleric(17): Epic Weapon Focus: Kama\n23: Rogue(5)\n25: Cleric(19)\n27: Cleric(21): Great Dexterity II, (DEX=21)\n29: Cleric(22)\n31: Cleric(24)\n33: Rogue(7): Great Dexterity IV, (DEX=25)\n35: Rogue(9)\n37: Rogue(11)\n39: Rogue(13): Epic Dodge, Defensive Roll\n\nSkillpoints: 184\nSaving Throw bonuses: Spells: +4, Traps: +2\nAB (max, naked): 37 (melee), 34 (ranged)\nSpell Casting: Cleric(9)\n</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "6:32 PM - Aug 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion wrote: <a data-post-id=\"21592\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21592&amp;sid=4d620f7539b2d2d281702601c8b2162b#p21592\">↑</a><div class=\"responsive-hide\">Aug 17, 2020</div></cite>Thanks Max! <br/>\n<br/>\nThe 32 - 2 - 6 split I think is a very thoughtful suggestion. Keeping the 30 str, Wis 19, auto silent 3, losing three caster levels for an extra skill dump (particularly tumble 25 for 5 ac) and evasion. My only worry is fighting something like Drow and I want my darkness/ultravision, word of faith or SoV to penetrate their CL +11 spell resistance, or the Sultan's monks for example I suspect they will be very tough. Improved evasion can be gotten on items too, by the time I get rogue 2 at lvl 37 I would possibly have access to such items. I might try to rely on the awesome power of the cleric class to carry me without the dump till late and play for level 40 power for 3 caster levels I know I know... <br/>\n<br/>\nRegarding a Dex version, I think i would want uncanny dodge and then epic dodge with all that dex, then monk for sheer power... The Shadow Priest written in 2010, would be a good template for something like that, if I were to go Dex I would lead towards that... add ITWF to it for even more attacks. I like to explore the less travelled path so to speak, so I chose Str based here ITWF Str cleric isn't greatly explored mostly because of the incredibly demanding requirements I suspect. If I go dex based , maybe a cleric 26 rogue 13 monk 1 type split would allow for epic dodge and ultra high Dex... and 10 apr and all that sneak would be awesome, provided it penetrates (Uncanny dodge changes 1.74+) <br/>\n<br/>\nAnyway this is what I came up with:<br/>\n<br/>\nITWF Dex Kama Cleric 26 / Rogue 13 / Monk 1<br/>\n<details><summary>Spoiler</summary>Cleric(26), Monk(1), Rogue(13), Human\nSTR: 14\nCON: 12\nINT: 8\n\n01: Rogue(1): Ambidexterity, Two-Weapon Fighting\n03: Cleric(2): Weapon Proficiency Exotic\n05: Cleric(4)\n07: Cleric(6)\n09: Cleric(7): Weapon Finesse\n11: Cleric(9)\n13: Rogue(3): {Uncanny Dodge I}\n15: Cleric(12): Improved Two-Weapon Fighting\n17: Cleric(14)\n19: Cleric(15)\n21: Cleric(17): Epic Weapon Focus: Kama\n23: Rogue(5)\n25: Cleric(19)\n27: Cleric(21): Great Dexterity II, (DEX=21)\n29: Cleric(22)\n31: Cleric(24)\n33: Rogue(7): Great Dexterity IV, (DEX=25)\n35: Rogue(9)\n37: Rogue(11)\n39: Rogue(13): Epic Dodge, Defensive Roll\n\nSkillpoints: 184\nSaving Throw bonuses: Spells: +4, Traps: +2\nAB (max, naked): 37 (melee), 34 (ranged)\nSpell Casting: Cleric(9)\n</details>\n</div></blockquote>\nHey Orion!<br/>\n<br/>\nSo, there are a few improvements I could suggest in this build of yours, and I would know because I have one with EXACTLY that class split. The boons to this guy in comparison to the Shadow Priest are the extra Sneak Attack damage and UMD, which are nothing to sneer at. The downside, it loses 1 BAB (if you do what I did and will suggest below), a lot of movespeed and it doesn't have HiPS as an exit strategy at its disposal. I never did publish it because I felt it wasn't ready, but it's here in my unfinished folder somewhere collecting dust LOL. Anyway, I digress, let's get on with the specifics:<br/>\n<br/>\nThe first thing I noticed is you took Weapon Proficiency-Exotic to be able to get the Kama proficiency without the Monk level pre-epic. I'd much rather get Knockdown. You are VERY limited by not having it, and will constantly be dispelled by every caster you face for not being able to KD them. So, I'd much rather drop 1 AB and add KD to my tool belt. <br/>\n<br/>\nThe second thing is the 14 to STR is a complete waste of stat points. Being that Divine Power automatically sets your STR to 18 , regardless of its original number as long as it's not over 18, the only situation when the 14 STR would be useful would be to carry stuff when encumbered and unbuffed. Much better to switch these points over to INT and enjoy your 120 extra skill points :D. No reason to gimp this build's skills that much being that you have access through these classes to pretty much every skill in the game except Taunt and Perform. <br/>\n<br/>\nAnd last but not least, I wouldn't recommend the usual skill-dump-every-5-levels in pre-epic for Clerics on WoG. Having played many of them, I can tell you you can go Rogue 1 and the 15 Cleric straight and you'll have a MUCH easier time leveling, then you can go Rogue 3. the 2 skill dumps won't be missed and the extra spell power and buff progression for the Cleric spells will make a HUGE difference. Trust me, I've done both, and it's not even close.<br/>\n<br/>\nAs for the OP build, I think you're not considering that you really don't need to cast against Drow or any other SR enemies, you can just whoop them in melee. You can use Mord's or Nature's Balance, or Greater Spell Breach scrolls to lower their SR if you really need to. But, in my 100 trips to the Underdark and Demonweb Pits, I normally just KD the wizards, they die, then I get invis, run back and take on the rest. I obviously don't let them see me until I can take them down.<br/>\n<br/>\nAnyway, gotta go! TTYL!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}