{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "838",
  "name": "Amia Ranger or maybe paladin or divine champion build?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/amia-ranger-or-maybe-paladin-or-divine-champion-bu-t2355130.html",
  "author": "massack",
  "avatar": "10759123_1565224679.jpg",
  "replies": "6",
  "views": "249",
  "posts": [
    {
      "author": "massack",
      "avatar": "10759123_1565224679.jpg",
      "timestamp": "3:00 AM - Aug 08, 2019",
      "content": "<div>Hey all! i'm looking to make a Lady Knight of Lurue for this server and i've been kinda cycling through build concepts and i'm just not getting it right. I think i'm mainly looking to be PvM but not getting constantly rolled in PvP would be nice too if also possible. <br/>\n<br/>\nRace wise i was going to go Feytouched ((ECL+1) +2 dex, +2 cha, -2 con; Low Light Vision; +4 will saves; Charm person; Fey) as it really fits the story concept of the character. <br/>\n<br/>\nBeyond this she's kind of a knight so I was thinking long or short sword and shield, a little nature magic would be a great addition as well since she's a loyal follower of a Fey Unicorn Deity. Definitely more dexterous than strength based and focusing on lighter armors. Heal would also be nice so she could aid people with health kits. I'm sorry this sounds so scattered, i'm here to answer any questions of course.<br/>\n<br/>\nAs for a taste of the character, given her chaotic nature, they look to aid the lost and forsaken by granting protection, help, and guidance. Especially to those that wander into the wilderness of the world. She also stands fast against Malar and his blood thirsty minions. Additionally she try to lend aid to dreamers in pursuit of their dreams and general merriment to those they meet as a life is best when lived with joy. Some char concept pics attached.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:02 PM - Aug 08, 2019",
      "content": "<div>Hello massack, and welcome to the guild!<br/>\nWhen I read your request, I had to look up Lurue and the Amia pages, just to see what was possible with such a character.<br/>\nIt is easy to make a Ranger/CoT build, a Druid and even a Paladin build. But when I read up on Lurue I started thinking of something different, a build  that can embrace the magic, chaos and charm of the fey realm, and still be able to act as a powerful \"Lady Knight\".<br/>\nWhat I envisioned was a chaotic good Cleric of Lurue with Animal and Dream* domains. And I thought it would be perfect to multiclass the Cleric with Bard, which happens to be the favored class of the Feytouched.<br/>\nA Short sword or Rapier (both finessable) can resemble the short spear (unicorn horn) that is the favored weapon of Lurue.<br/>\nLet me know what you think, if this is something to pursue.<br/>\n<br/>\n*(For those not familiar with Amia: Dream is one of their many custom-domains)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:49 PM - Aug 08, 2019",
      "content": "<div>She's so cute! <span class=\"text-emoji\">😄</span><br/>\n<br/>\nIIRC, Amia is a 30-level PW?</div>"
    },
    {
      "author": "massack",
      "avatar": "10759123_1565224679.jpg",
      "timestamp": "1:11 AM - Aug 09, 2019",
      "content": "<div>Oh that's interesting i never really considered full cleric and cleric/bard. I'd definitely be interested in hearing such a build! <br/>\n<br/>\nand i was kinda looking at the custom domains but wrote them off as not really something i'd play with too much because i wasn't going cleric. <br/>\n<br/>\nAlso, yes amia is a 30-level PW</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:50 AM - Aug 10, 2019",
      "content": "<div>I may come up with a draft, something to work with, if you want.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "massack",
      "avatar": "10759123_1565224679.jpg",
      "timestamp": "3:34 AM - Aug 10, 2019",
      "content": "<div>I'd love that if it's alright. </div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:55 PM - Aug 11, 2019",
      "content": "<div>Hello,<br/>\nThis took me a while before i realized that i could not have \"everything\" in a level 30 build. (Typical beginner's mistake, really) When I tried Cleric, I was not able to keep a high charisma, dexterity and wisdom plus a reasonable strength and constitution...and some intelligence for the most critical skills.<br/>\nI tried different approaches, both for Cleric and for Bard as main class.<br/>\nI ended up with one combat Cleric: Cleric 24/ Bard 6, one caster Cleric: Cleric 26/ Bard 4. They can both cast and fight, but the focus is a bit different.<br/>\nIt was somewhat easier with the Bard builds where one can drop wisdom and just take charisma 16.<br/>\nI made several Bard \"knights\" with Fighter and either Rogue or Shadowdancer for Uncanny dodge and Evasion.  Bard ended between 19 and 23 levels depending on what I gave priority.<br/>\n<details><summary>Spoiler</summary>Amia Combat Knight of Lurue\nCleric(24), Bard(6), Feytouched\n\nDEX: 16 (20)\nWIS: 14 (19)\nCHA: 12\n01: Bard(1): Weapon Proficiency Martial\n03: Cleric(2): Weapon Finesse\n05: Cleric(4)\n07: Bard(2)\n09: Cleric(7): Weapon Focus: Rapier\n11: Cleric(9)\n13: Cleric(10)\n15: Cleric(12): Blind Fight\n17: Bard(4)\n19: Cleric(15)\n21: Cleric(17): Epic Weapon Focus: Rapier\n23: Cleric(18)\n25: Cleric(20)\n27: Cleric(22): Great Dexterity I, (DEX=18)\n29: Cleric(24)\n\nSaving Throws (Fortitude/Will/Reflex): 17/27/19\nBAB: 20\nAC (naked/mundane armor/shield only): 23/30\n\nConcentration 29(30), Discipline 33(34), Perform 11(12), Spellcraft 33(35), Tumble 30(35), UMD 14(15)</details>\n<details><summary>Spoiler</summary>Amia Caster Knight of Lurue\nCleric(26), Bard(4), Feytouched\nSTR: 10\nCON: 12\nINT: 12\n\n02: Cleric(1): Domain Animal, Domain Dream\n04: Cleric(3): WIS+1, (WIS=17)\n06: Cleric(5): Extend Spell\n08: Cleric(7): WIS+1, (WIS=18)\n10: Cleric(9)\n12: Bard(2): WIS+1, Empower Spell, (WIS=19)\n14: Cleric(12)<br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/><br/></details></div>",
      "author-color": "#AA0000"
    }
  ]
}