{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "189",
  "name": "Long time no see. Looking for a WM/COT?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/long-time-no-see-looking-for-a-wm-cot-t2354484.html",
  "author": "campgod",
  "avatar": "no_avatar.png",
  "replies": 6,
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "10:02 PM - Dec 14, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello everyone. First of all I cant seem to use the same link I had saved for the Epic character search engine, is it no longer there???<br/>\n  <br/>\n I was looking for a WM with a longsword and somewhat good saves.( Maybe even be able to cast GWM for the +5/6 but high AB form WM might just do the trick?) Would that be a WM/CoT mix? If so does anyone have something along those lines or any thoughts of something like that?<br/>\n<br/>\n Lvl 40, PvP, any race. +6 items with a cap of +12 on stats (Str. Dex, etc.) Dev crit does 3x the damage instead of instant death. Not even sure i could work a dev crit into a build like this?<br/>\n<br/>\n So once again good to see you and thanks for your time.<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:41 AM - Dec 15, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome back campgod!  I just returned myself after a long absence.  Maybe I've adopted a new handle but I still give the same misguided recommendations as always... which is why some of the veterans will pop in occasionally to maintain a status quo.  The wait may seem longer, though, as many members have moved on or taken a break or just don't check in as regularly.<br/>\n<br/>\n Unfortunately, the ComCast server that housed both the WoG homepages and ECB Search engine are now dust.  But... fortunately... The_Krit's archive of both the epic and pre-epic legacy builds are all uploaded and accessible through javascipt once you DL the files from the New Vault.  I've posted the links in an ECB topic<strong> <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354480/How-and-Where-to-Access-Legacy-ECB-Archives\" rel=\"noreferrer\" target=\"_blank\">here </a></strong><br/>\n<br/>\n You will need to run the Search Engine on your machine rather than off the web, though.  Same builds as before, only you need a browser enabled to digest javascript.  Firefox works fine.  Apparently Chrome does not.  IE complained about ActiveX but ran it after I told it to.<br/>\n<br/>\n One thing to keep in mind though, when/if you refer to those builds... you can't hyperlink.  Either furnish a short summary of each build in your post or rely on members to use their own copies of the search to view the referenced builds.  Title, Author and Split should be enough for us to find them fast.<br/>\n<br/>\n Are you talking about a cleric/WM or a CoT/WM?  Or some combo of the two?  If cleric/WM, you'll either need fighter levels (lower saves) right away or be prepared to wade pretty far through pre-epic levels to fulfill the WM prereqs using CoT with its +7 BAB prereq.  So those are your secondary and tertiary classes.  What were you planning for the primary... cleric, bard, magician, rogue? Those are the only magic-enabled classes.  All those won't get bonus feats until epic class levels.   BTW, GMW goes +5 max enhancement so if they have +6 wpns you won't be using GMW after you find one.  Ummm, could I interest you in a scimi instead?  With WM you'll crit a whole lot more and not notice the avg base dmg difference much at all.  You could make an ED dexer build with rogue but would need to go rapier for that.   And while we are here, are you looking for high-defense or high-damage?<br/>\n<br/>\n Hip<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "7:12 PM - Dec 17, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for all the info Hip. I was was thinking maybe a CoT with the WM cause I was trying to get high AB/crit range with some saves added to it for PvP. All the best gear/weapons are forged by the player and have a certain amount of PP (slots sort of speak) depending on the weaon. I like Scimi's but they can hold little enchantment cause of their crit range is so great anyway. For example a Scimi holds two PP which will only give me room to make it a +6 weapon(enhancement) and that's it, where a long sword holds 6 PP so I could put +6 and some elemental damage. But I don't mind using one if you think it would still be better. As for the primary I am not sure...I guess it would have to be go Fighter, right? Doesn't have to be a Magic user. Rogue would be nice cause I would be able to use wands that another toon of mine can make.(see invisy and clarity) Would monk add a little AC? So as you can see I am pretty opened just not sure. On this server after you hit 40 you can re-lvl and redo the build except for the first lvl of course. You can also switch alignment at any time. TY for your time.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "9:02 PM - Dec 17, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If DevCrit is nerfed, I'd leave it alone.<br/>\n<br/>\n If you need a damage enhancement, go Paladin/COT/WM - Divine Power's +5 to attack/damage or Deafening Clang's +3. You don't have to invest in CHA -a STR based Pally with 12 WIS (to cast level 2 spells), plus a bunch of feats from COT can be devastating. PAL 8/COT 10/WM 22 STR based. Good saves, high AB, high damage.  Here's Ithacan's build P8/COT16/WM16<br/>\n ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------<br/>\n<br/>\n Knight of the Sword<br/>\n Any (as built, Elf)<br/>\n<br/>\n Loyal to kingdom and country, the Knight of the Sword does one thing and does it well: dish out the pain. Need buffs? Look elsewhere. Need skills? Sorry, we don't got any. Move silently? Pfft. Need something sliced in two? Now we are talking.<br/>\n<br/>\n S: 14 to 30<br/>\n D: 13<br/>\n C: 12<br/>\n W: 11 to 12<br/>\n I: 14<br/>\n CH: 14<br/>\n<br/>\n 1 Paladin1 Feat: Dodge<br/>\n 2 Paladin2<br/>\n 3 Paladin3 Feat: WF: Greatsword<br/>\n 4 Paladin4 Ability: Strength (15)<br/>\n 5 Paladin5<br/>\n 6 Paladin6 Feat: Mobility<br/>\n 7 Paladin7<br/>\n 8 CoT1 Ability: Strength (16)<br/>\n 9 CoT2 Feat: Spring Attack, Expertise<br/>\n 10 CoT3<br/>\n 11 CoT4 Feat: Whirlwind Attack<br/>\n 12 Weapon Master1 Feat: Improved Critical (Greatsword); Ability: Strength (17)<br/>\n 13 Weapon Master2<br/>\n 14 Weapon Master3<br/>\n 15 Weapon Master4 Feat: Power Attack<br/>\n 16 Weapon Master5 Ability: Strength (18)<br/>\n 17 Weapon Master6<br/>\n 18 Weapon Master7 Feat: Cleave<br/>\n 19 Weapon Master8<br/>\n 20 Weapon Master9 Ability: Strength (19)<br/>\n 21 Weapon Master10 Feat: Great Strength I (20), Epic Weapon Focus (Greatsword)<br/>\n 22 Cot5<br/>\n 23 CoT6 Feat: Epic Prowess<br/>\n 24 CoT7 Feat: Great Strength II (21); Ability: Strength (22)<br/>\n 25 CoT8 Feat: Great Cleave<br/>\n 26 Weapon Master11<br/>\n 27 Weapon Master12 Feat: Great Strength III (23)<br/>\n 28 Weapon Master13 Feat: Overwhelming Critical; Ability: Strength (24)<br/>\n 29 CoT9<br/>\n 30 CoT10 Feat: Great Strength IV (25), Improved Parry<br/>\n 31 CoT11<br/>\n 32 CoT12 Ability: Strength (26)<br/>\n 33 CoT13 Feat: Devastating Critical (Greatsword);<br/>\n 34 CoT14 Feat: Great Wisdom (12)<br/>\n 35 Weapon Master14<br/>\n 36 Weapon Master15 Feat: Great Strength V (27) Ability: Strength (28)<br/>\n 37 Weapon Master16 Feat: Armor Skin<br/>\n 38 CoT15<br/>\n 39 CoT16 Feat: Great Strength VI (29)<br/>\n 40 Paladin Ability: Strength (30)<br/>\n<br/>\n Unarmed AC: 16 (15 crossclass ranks in tumbling)<br/>\n Normal Plate AC: 24<br/>\n Unarmed AB: +41/26/31/26<br/>\n With normal greatsword: + 47/43/38/33 (Critical 15-20 x3)<br/>\n<br/>\n Fort: 33<br/>\n Dex: 33<br/>\n Will: 28<br/>\n<br/>\n Skills: Tumble 15, Discipline 43, Parry 43, Spot 42, Concentration 7<br/>\n<br/>\n A human would get one more feat (exotic weapons and use bastard sword and shield or use scythe as weapon of choice) and 40 more skill points (cross class to Tumble for added AC or put them in taunt).<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:53 AM - Dec 18, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The Parry skill is widely regarded as useless.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:53 PM - Dec 18, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, it was a bit hard to discern your ideas from your request, campgod, tbh.  But I am getting the impression you want your basic CoT/WM w/o self-buffing spells.  If not the case, a battle cleric CoT/WM would do more damage but DevCrit ~probably~ not in the picture (haven't really thought that concept through yet).<br/>\n<br/>\n Dunno whether you've noticed from past posts, but I am not one to throw out random builds for requests.  I would rather builders simply grasp the linkage between what they want (their instincts) and what gets implemented to achieve that... i.e. make their own builds, comparing with similar ones which may have addressed things differently.  To that end, here is a combo that goes with the highest base damage SH weapons (katana, bastard, DwarvenWA).  Two of those have the same crit range as your longsword so should be able to be enhanced the same way (unless there is still more server-specific info being withheld).  Naturally, you could easily gain a pre-epic feat by going longsword, but IMO, if you have the feats (which this build certainly does), exotics are really worth it.  Dwarven Waraxe is more typical and has more potential damage but poor crit range will become a liability for grabbing all the epic crit bonuses regularly.  If the server doesn't nerf DWaxe, it's worth considering.<br/>\n<br/>\n Human would gain a racial feat but the end potential would be lower.  The dwarven racial bonuses seem well worth the short feat to me, anyway.  But it is all your choice since you are the one who will be testing it in action.  I have not.  I only do that for published builds.  DL a trainer if you don't have one and make your own tweaks as you notice any shortcomings.  So here is the basic plan:<br/>\n<br/>\n<strong>Ftr8 / CoT10 / WM22, Dwarf, xG/xN</strong><br/>\n<br/>\n STR: 18 (34)<br/>\n DEX: 13<br/>\n CON: 14<br/>\n WIS: 8<br/>\n INT: 13<br/>\n CHA: 6<br/>\n<br/>\n AB - 51 (melee), 32 (range), 4 APR<br/>\n AC 28<br/>\n<br/>\n Saves (F/W/R): 29/24/28 (35/30/34 vs spells), Poison +2 (racial)<br/>\n<br/>\nPre-epic - Ftr7/CoT6/WM7, HP 240<br/>\n All bumps to STR<br/>\n Feats: Exotic Prof (katana/bastard/DWaxe),WF, Dodge, Mobility, WS, Expertise, SprAttack, WW, ImpCrit, PA, Cleave, KD, IKD, BF<br/>\n Skills: Disc 23(29), Intimidate 4(2), Spcr 8(9), Tumble 11(12)<br/>\n<br/>\nEpic - Ftr1/CoT4/WM15, HP 480<br/>\n All bumps to STR<br/>\n Feats: GrtSTRx6, EWF, EWS, GrtCleave, Armor Skin, Prowess, OverCrit, Epic Will, DevCrit<br/>\n Skills: Disc 20(55), Spcr11(20), Tumble 9(21)<br/>\n<br/>\n Why DevCrit anyway?  Because except for going DevCrit route, WM bonus feats suck.  Epic Toughness? Meh.  What's the point?  Swallow a potion.<br/>\n Saves look darn good to me for a meleer.  The only thing I had considered was dropping an AB via -3WM levels to get Called Shot/+1 saves with CoT levels... a great way to effectively increase your relative AC. But that is only an option if you are confortable with the associated attack penalty.<br/>\n<br/>\n Since this supposed to be focused towards PvP, I also suggest stocking up on Invis pots.  If you run into any Div Might/Div Shld types, their buffs are easy to strip with hit 'n *poof* tactics and then go toe to toe.  IKD/BF vs. caster types, of course... must-haves.  Unless you PvP more than a single toon at one time, though, cleave/grt cleave are totally worthless as is WW. WM is an expensive class to invest into, unfortunately.<br/>\n<br/>\n Haven't calculated damage (I'll leave that to your play-testing sessions) but with 1-10 base, WS/EWS +6, STR mod +12, Overcrit and your server's DevCrit boosts it should work out pretty well.  You should be able to apply the same enhancements as a longsword and can figure that much in as well.<br/>\n<br/>\n At mimimum, this summary will serve as a metric to weigh other concepts against.  Like I said, it's a basic CoT/WM with no frills.<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "7:33 AM - Dec 21, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like both and will try each to see what fits me the best. At any rate s me a great template. Thanks to everyone for the info.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}