{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "083",
  "name": "Dex v DR",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/dex-v-dr-t2355700.html",
  "author": "Dingpot",
  "avatar": "10759398_1682113117.jpg",
  "replies": 7,
  "posts": [
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "1:25 PM - Apr 02, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">There is probably a guide for this somewhere but I haven't been able to find it. As I understand it even on a finesse build, damage is still based on strength. What are the options for getting over this on monsters with high damage reduction?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:45 PM - Apr 02, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, there's good news and there's bad news, Dingpot...<br/>\n<br/>\nThe good news is that you're right, always nice to know.<br/>\n<br/>\nThe bad news is that raw damage is always based on strength.<br/>\n<br/>\nHowever, there are exceptions (aren't there always?). I'm leaving out the obvious: spells, below.<br/>\n<br/>\nAA damage comes from enchanted arrows (+1 to both AB and damage every odd level taken), but that, of course, is only with ranged attacks.<br/>\n<br/>\nWeapon Specialization and its big brother will give +6 to damage, but you need at least 4 levels of Fighter to get them (if you take EWS at the same level as F4 in epic levels), though 6 levels is more traditional (the last 2 of which could be CoT, for EWS). I believe it's also do-able with 5, if you take F5 on a general feat in epic levels, but I can't promise that.<br/>\n<br/>\nAll Monks get d20 damage + STR modifier from fists at level 16, whether finessed or not (except for Halflings and Gnomes, who only reach d12).<br/>\n<br/>\nDwarven Defender gets +2 to STR when in Defensive Stance. Bard Song can increase damage (by how much depends on how good your song is).<br/>\n<br/>\nRDD gives up to 3 STR boosts (+2 at L2, +2 at L4, +4 at L10 - all stacking).<br/>\n<br/>\nDepending on your foe, critical hits can be immensely helpful.<br/>\n<br/>\nAnd then, of course, there's Sneak Attack (and Death Attack, for Assassins), which gives +1d6 damage every odd level, but again is dependent on the nature of the enemy you face.<br/>\n<br/>\nOther than those options, there's always the aforementioned spells, as well as traps to consider.<br/>\n<br/>\nSo it's not all bad!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:54 PM - Apr 02, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you can get a weapon with higher enhancement and/or elemental damage, that will help, too.<br/>\n<br/>\nIt would also help to find a weapon that does a different type of damage from what the enemy if resisting.<br/>\n<br/>\nFinally, some types of DR can be bypassed entirely by a high enough enhancement.  For example, in SoU Chapter 2, the Wise Wind will take full damage from a +3 weapon.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "5:32 PM - Apr 02, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Dingpot! There are different types of DR and the answer is different for each different type:<br/>\n<br/>\n- Intrinsic DR (like from a Dwarven Defender), which will be shown as follows: 15/- <br/>\nThis type of DR you simply can't overcome with anything. It will apply regardless of what you do and it applies to all physical damage types. The way to overcome that is to do other types of damage (like with Divine Favor, Greater Magic Fang, Darkfire, Flame Weapon, etc..<br/>\n<br/>\n- Damage-type DR (like from a Greater Archer's Belt)<br/>\nThis type of DR can be overcome by either switching to a different weapon or adding damage of a type that isn't the resisted type (the above methods of adding damage to a weapon also work here)<br/>\n<br/>\n- Weapon-enhancement DR (like with the Stoneskin spell or some forms of DR from undeads), which is shown as 15/+3, where this second number is the enhancement bonus up to which it applies.<br/>\nThis type of DR is tied to the enhancement bonus of the weapon you use, so for example a Tyrantfog Zombie will be immortal if you're using nonmagical weapons, but if you use a +1 weapons, he will die in 1 round. So, to overcome this type of DR you need a weapon with a higher enhancement bonus than the type of DR covers, or if it's a spell you just need to eat through it until it ends.<br/>\n<br/>\n- Damage immunity (50% or 100%, like from some undeads to slashing and piercing or red dragons with fire)<br/>\nThis type of DR can be overcome by switching damage types. Typically, you want to have at least one blunt and one either piercing or slashing weapon, and that should have you covered in most situations. If you only carry the weapons in which you have focus, then that's why you're struggling.<br/>\n<br/>\nThe rest my mates have already explained, so I'm out!<br/>\n<br/>\nCheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:03 PM - Apr 02, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Awww, man, one of my fav's was left out!<br/>\n<br/>\nRanger, doods!<br/>\n<br/>\nFEs and of course Bane of Enemies!  Adds some nice damage.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "frebe13",
      "avatar": "no_avatar.png",
      "timestamp": "9:46 AM - Jun 29, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Dingpot wrote: <a data-post-id=\"24103\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24103&amp;sid=dd26e6a81c37225e30829947fc679568#p24103\">↑</a><div class=\"responsive-hide\">Apr 02, 2021</div></cite>There is probably a guide for this somewhere but I haven't been able to find it. As I understand it even on a finesse build, damage is still based on strength. What are the options for getting over this on monsters with high damage reduction?</div></blockquote>\nThe obvious solution is Sneak Attack :) With 5 levels of Rogue included you gain enough to compensate for lower strength. Also other fixed damage additions such as Divine Favour and Darkfire. Power attack isn't bad either. The point of DEX builds is that a single stat adds to both AB and AC so there is really no trade-off needed. Just max out at every opportunity. There are lots of good and efficient ways to trigger sneak attacks but the simplest are Cleric spells (Word of Faith and Darkness). <br/>\n<br/>\nAlso you don't need low strength to be a finesse fighter. You can still get 14 str. <br/>\n<br/>\nHehe just getting back into the game with Enhanced Edition playing Nordock again :) Rogue 5+/Cleric 26+/Fighter 2+ something. Not sure how it will end up. But damage output is great even with just 14 str.<br/>\n<br/>\nThe main point to avoid though is playing \"builds\" that takes lots of levels to come together. In this case its just the first Rogue level that kind of sucks since you'll have an extremely weak Rogue as you need to invest in Wisdom. As soon as its Rogue 1/Cleric 1 its fine with summons.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:36 PM - Jun 29, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">With D&amp;D, there is always supposed to be some \"negatives\" with the positives - it is supposed to keep things in \"balance\".<br/>\n<br/>\nMeaning Str does damage and AB (and carrying capacity), Dex does AC and AB.  They sort of offset one another - one can have a high AC and AB, but deal less damage (and against crit/sneak immunes, it can be a real PITA) OR one can have a high AB and Damage output, but lower AC.<br/>\n<br/>\nOne way to get around this (IMO) is to be a monk with fists (because fists do 1-20 damage at level 20 with med sized characters).  Note that I am not including any spells here, because they are both temporary and can be dispelled (and in an Anti-Magic area, cannot be used at all - the bane of battle clerics!).<br/>\n<br/>\nAFAIK, there is no guide to dex based builds and DR (re: outputting damage vs crit/sneak/high DR opponents) because...well, see above.  Basically the only way to deal with physical DR like that of a Barb, DwD, etc, is with additional elemental damage on one's weapon (divine and positive being ones that are rarely, if ever, resisted).  As this heavily depends on the environment where one plays, it severely limits what one could put into a guide imo.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "frebe13",
      "avatar": "no_avatar.png",
      "timestamp": "11:05 AM - Jun 30, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Obviously there are trade-offs but NWN isn't really true to the D&amp;D campaign rules. Its much easier to compensate for the low damage caused by a mediocre 14 or so Str than it is for the AC you get from having a higher Dex score.  Just Power Attack is worth 10 Str. It just comes down to what magic items you have available. But mostly it depends on how a module is balanced. Anyway if Rogues can make it in a module at all then a Dex based Cleric can make it also. Cleric by default has better options for dealing with undead in any case...or even constructs. I always liked Cleric for Dex-based characters anyway. Also Rangers or Paladins for Strength base ones.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}