{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "383",
  "name": "PvM Pal/HS/CoT Help",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pvm-pal-hs-cot-help-t2343206.html",
  "author": "JIntegrity",
  "avatar": "10235222_1510287070.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "JIntegrity",
      "avatar": "no_avatar.png",
      "timestamp": "3:24 AM - Oct 02, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Human<br/>\nLawful Good<br/>\nPaladin(11)/Harper Scout(4)/Champion of Torm(5)<br/>\n<br/>\nSTARTING STATS:<br/>\n<br/>\nSTR - 14<br/>\nDEX - 10<br/>\nCON - 10<br/>\nWIS - 15<br/>\nINT - 10<br/>\nCHA - 16<br/>\n<br/>\nENDING STATS<br/>\n<br/>\nSTR - 14<br/>\nDEX - 10<br/>\nCON - 10<br/>\nWIS - 16<br/>\nINT - 10<br/>\nCHA - 20<br/>\n<br/>\nBASIC STATS:<br/>\n<br/>\nHitpoints: 186<br/>\nSkillpoints: 77<br/>\nSaving Throws (Fortitude/Will/Reflex):<br/>\n19/20/18<br/>\nSaving Throw Bonus: Spells: (Up to) +19<br/>\n(See below)<br/>\nBAB: 19<br/>\nAB (max, naked): 22 (melee), 19<br/>\n(ranged)<br/>\nSpell Casting: Paladin(3)<br/>\n<br/>\nLEVELING GUIDE:<br/>\n<br/>\n1- Paladin(1) {Divine Grace, Divine<br/>\nHealth, Lay of Hands} Power Attack, Iron Will<br/>\n2- Paladin(2) {Aura of Courage, Smite Evil}<br/>\n3- Paladin(3) {Remove Disease, Turn Undead} Divine Might<br/>\n4- Paladin(4)<br/>\n5- Paladin(5)<br/>\n6- Paladin(6) Alertness<br/>\n7- Paladin(7)<br/>\n8- Paladin(8)<br/>\n9- Harper Scout(1) {Bardic Knowledge} Weapon Focus: (Warhammer*), Favored Enemy: Undeads<br/>\n10- Champion of Torm(1)<br/>\n11- Champion of Torm(2) {Sacred Defence} Cleave<br/>\n12- Paladin(9) Divine Shield<br/>\n13- Harper Scout(2) {Deneir's Eye, Sleep}<br/>\n14- Champion of Torm(3)<br/>\n15- Paladin(10) Extra Turning<br/>\n16- Harper Scout(3) {Cat's Grace, Tymora's Smile}<br/>\n17- Harper Scout(4) {Eagle's Splendor, Lliira's Heart}<br/>\n18- Paladin(11) Extend Spell<br/>\n19- Champion of Torm(4) Improved Critical (Warhammer*)<br/>\n20- Champion of Torm(5) {Divine Wrath}<br/>\n<br/>\n*Weapon subject to change. Advice?<br/>\n<br/>\nSKILLS:<br/>\n<br/>\nDiscipline(12), Lore(6), Persuade(21), Search(4), Tumble(20), Save(10)*<br/>\n<br/>\n1- Discipline(4), Lore(4), Persuade(4)<br/>\n2- Lore(1), Persuade(1)<br/>\n3- Lore(1), Persuade(1), Search(1)<br/>\n4- Persuade(1), Search(1)<br/>\n5- Persuade(1), Search(1)<br/>\n6- Persuade(1), Search(1)<br/>\n7- Persuade(1)<br/>\n8- Persuade(1)<br/>\n9- Persuade(1), Tumble(5), Save(3)*<br/>\n10- Save(6)*<br/>\n11- Save(9)*<br/>\n12- Persuade(3), Save(9)*<br/>\n13- Persuade(1), Tumble(5), Save(8)*<br/>\n14- Save(11)*<br/>\n15- Persuade(2), Save(12)*<br/>\n16- Persuade(1), Tumble(5), Save(11)*<br/>\n17- Persuade(1), Tumble(5), Save(10)*<br/>\n18- Persuade(1), Discipline(2), Save(10)*<br/>\n19- Discipline(3), Save(10)*<br/>\n20- Discipline(3), Save(10)*<br/>\n<br/>\n*I have no idea whether I want these points in Discipline or Listen. Help?<br/>\n<br/>\nActually designed this character for the OC. I wanted to see if this build could be improved.<br/>\n<br/>\nStarting from the top: Human for the skill points an essential extra feat, and Lawful Good because Paladin (I'm not going to RP an evil Paladin... this time).<br/>\n<br/>\nAt Paladin level 11 (with 16 WIS) I get a third level spell slot. I'll mostly use this for Extended Eagle's Splendor. Harper Scout 4 gives me a cast of Eagle's Splendor that stacks with the Paladin's. Champion of Torm gives me Divine Wrath, along with some nice feats, Sacred Defence II, and second uses of Smite Evil/Lay on Hands.<br/>\n<br/>\nWhile I'm saddened by the low Con of this build. However, to get a 3rd level spell at 11, I need at least 16 WIS, I need 10 INT for skill points (I wouldn't go below 9 any way), I don't want a negative AC modifier from less than 10 DEX, and I don't want and I'm not willing to sacrifice STR or CHA to get it. Hopefully, with careful play, this should be a non-issue.<br/>\n<br/>\nThis build focuses on the synergy between Paladin and Harper Scout, to increase CHA insane levels for Divine Might and Shield, while getting extra feats and Divine Might from Champion of Torm. In a perfect roll, at level 20, this character should have a +5 CHA modifier base, +5 from two perfect Eagle's Splendor rolls, +4 from Aura of Glory, plus whatever CHA bonuses (if any) I can get from my gear. Unarmed, with a damage roll of 1, I'd hit for at least 15 if you only include my CHA modifier from Divine Might, and that doesn't include my STR modifier, especially after buffed by Bull's Strength, or any other buffs, such as Bless or Divine Wrath.<br/>\n<br/>\nThat being said, I want to use a bludgeon weapon as my main, due to disliking losing damage to undead, and, since I can't spare a feat for Exotic Weapons, it leaves me with much to be desired as far as blunt weapons go. I've heard there are enemies with resistances to bludgeon weapons though, and, if there is a weapon type that never gets resisted, I'd love to know (I value consistency over raw damage).<br/>\n<br/>\nSeeing as I'm trying to get all my abilities as soon as possible (if I wait until 20, then the campaign will likely already be over), I realize the levels I take things could probably be much better. I'd love any advice on the matter you can give, and any problems that stand out with the character. Thank you for your time. <br/>\n<br/>\nEdit: Also, if it wouldn't be too much trouble, I'd love to see how you'd take this concept and build it for PvP.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:12 PM - Oct 02, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As you know, Magical Master and I have tried to point you in a better direction dealing with this concept on BSN.<br/>\n<br/>\nTwo additional things to think about...<br/>\n<br/>\nFirst, the ECB is not fussy about providing spoiler information and has a nifty edit feature to conceal that information from a passing reader conscious of such things.  For that reason, you can provide as much module-specific information in  your request as you would like and if a member has played that SP module or on that server, you'll get even more helpful tips.  <br/>\n<br/>\nSecond, trying to convert an epic build concept to a pre-epic is a slippery slope.  It CAN be done, but rarely is it anywhere as effective as the original epic concept.  The pre-epic HS is a perfect example.  That odd-ball 5 levels pre-epic and the 3/4 class can put a real hurt on your AB.  Hence, to gain its maximum benefits you will see it show up usually in epic levels where it can no longer impact the BAB.<br/>\n<br/>\nSince I have little actual in-game experience with Cha-based toons (I can count my designs on one hand!), I'll miss a lot but there are some staunch charismatics here that will fill in the missing blanks (as MM did on BSN).<br/>\n<br/>\nI recommend that you use a module like the OC plague campaign as a learning canvass for a new concept and then move on to more difficult modules and servers to more thoroughly test its reliability.  A trainer can also help iron out the rough spots but custom content authors usually spend a great deal of time producing challenging combat scenarios than those devised by the BioWare staff, no offense intended... it's just a fact.<br/>\n<br/>\nHope to read your next post in the near future!<br/>\n<br/>\nOh... and welcome to the New ECB!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:28 PM - Oct 02, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Heya!<br/>\n<br/>\nWelcome to the ECB, mate.<br/>\n<br/>\nI hope you don't find this offensive, it's not meant to be, but even if you build a Fighter with 8 CON, 8 STR and 8 DEX, you can beat the OC enemies after a certain level. At first it's hard, but the enemy ACs and ABs don't grow in the same proportion as your toon does, so your Fighter with gimped stats will be a monster after lvl 11 or so with a belt of STR and a nice magic weapon. <br/>\n<br/>\nObviously I am exaggerating, but the point behind it is quite valid, which is: anything can do well in the OC, ANYTHING. That said, what you have here is a lvl 20 paladin with low STR but high Charisma. There has long been a debate between STR x CHA in Paladin builds, and it all depends on where you play. You can go STR and have more AB and damage ALL THE TIME (not just when buffed with Divine Might) and have lower AC (cuz your Divine Shield will be less effective if at all due to the lower CHA). If you go more for CHA, you'll have higher saves and a higher AC when buffed with Divine Shield, do the same damage than you'd do if you went for STR when buffed with Divine Might (less when unbuffed), but your AB will be lower by the same proportion.<br/>\n<br/>\nOR, you could split the difference. How about 16 STR and 18 CHA, or even 18 STR and 16 CHA? All of these are viable, raise your AB and damage while not destroying the concept of the build entirely. And you won't have to go back to shop encumbered all the time, which is always nice <br/>\n<br/>\nIf you are playing in the OC, the benefit you get from HS is irrelevant cuz in the OC you can equip your toon with a Nymph's Cloak +5 and Prophyro's Ring +4 (from the Boddyknock quest) to a total of +9 CHA enhancement. I am not sure if you are aware of this, but the CAP (maximum possible magical enhancement) for Ability scores on NWN is +12. That means you can reach the cap with Aura of Glory alone, or Eagle's Splendor if you don't roll a 1. My point is, the stacking of Eagle's Splendor is irrelevant when you can fill the gaps with magical items. If you don't consider them, then OK, it's a bit nice.<br/>\n<br/>\nAs for the spread, it could use a lot of tweaking, as could the starting abilities. You should lower your DEX to 8 and raise your CON, and also lower your Wisdom score 2 points, altering the spread to Paladin 12 CoT 4 HS 4. Divine Wrath is nice, but lasts very little, not to mention it's only once per day, so not worth 2 ability points and 1 paladin level (which would grant you that third level spell you desire). Negative scores can be supplemented with magic items. if you drink a Cat's Grace potion and cast the Harper version along it, you will reach the maximum DEX modifier that a full plate allows.<br/>\n<br/>\nSo, here is what I would change:<br/>\n<br/>\n1- The spread: Paladin 12 CoT 4 HS 4<br/>\n2- The stats (starting and ending) - 14 STR - 8 DEX - 12 CON - 14 WIS - 14 INT - 15 CHA ending at 16 - 8 - 12 - 14 - 14 - 18<br/>\n<br/>\nI would look into the feats as well, but it seems by Hip's post that you already had some help with that. <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:07 AM - Oct 03, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nMy point is, the stacking of Eagle's Splendor is irrelevant when you can fill the gaps with magical items. If you don't consider them, then OK, it's a bit nice.\n</div></blockquote>\nYup.  At first glance, it appears a worthwhile exploit for low-magic situations.  I mean, it looks very good on paper.<br/>\n<br/>\nProblem is 5 hours per day maximum and cannot be extended.  Max can correct me if I am mistaken but I believe the feat version of Eagle's is just as dispellable as the spell book version (am figuring 12 + 5 = 17 vs. d20 + 3 [from item] to 5) ... so with such a puny caster level (5) after it goes *poof* even with a cheap scroll or other item of lesser dispel... there goes the investment into the exploit.<br/>\n<br/>\nI don't think I have ever designed an optimization based around a 1x/day feature.  Smiting attempts is limiting enough for me and at least can be extended with a feat.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:21 AM - Oct 03, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nMy point is, the stacking of Eagle's Splendor is irrelevant when you can fill the gaps with magical items. If you don't consider them, then OK, it's a bit nice.\n</div></blockquote>\nYup.  At first glance, it appears a worthwhile exploit for low-magic situations.  I mean, it looks very good on paper.<br/>\n<br/>\nProblem is 5 hours per day maximum and cannot be extended.  Max can correct me if I am mistaken but I believe the feat version of Eagle's is just as dispellable as the spell book version (am figuring 12 + 5 = 17 vs. d20 + 3 [from item] to 5) ... so with such a puny caster level (5) after it goes *poof* even with a cheap scroll or other item of lesser dispel... there goes the investment into the exploit.<br/>\n<br/>\nI don't think I have ever designed an optimization based around a 1x/day feature.  Smiting attempts is limiting enough for me and at least can be extended with a feat.</div></blockquote>\n\nDon't worry, nobody casts dispel in the OC. He won't get dispelled. LOL<br/>\n<br/>\nEDIT: I just saw that Extra Turning is there, which I thought was Extra Smiting at first. Yeah, that's no good, you should have Extra Smiting with a CHA-based pally.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:59 AM - Oct 03, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nDon't worry, nobody casts dispel in the OC. He won't get dispelled. LOL\n</div></blockquote>\nMobs of pixies in the spirit realm spam it like crazy at caster level 8.  Almost impossible to maintain low-level buffs in there.  And then there is Morag, naturally, being her usual p.i.t.a...  I was thinking more along the lines of adopting a pre-epic build like this in PvP within that context, Max.\n<blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nEDIT: I just saw that Extra Turning is there, which I thought was Extra Smiting at first. Yeah, that's no good, you should have Extra Smiting with a CHA-based pally.</div></blockquote>\nThat makes both of us.  A self-induced optical illusion x2.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}