{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "338",
  "name": "Bowyer Bandito Divino: Cleric 23/Bard 2/Arcane Archer 15",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bowyer-bandito-divino-cleric-23-bard-2-arcane-arch-t515441.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": "10",
  "views": "2.8K",
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:43 AM - Sep 04, 2011",
      "content": "<div><strong>Background</strong><br/>\n<br/>\nI've been toying around with different versions of a divine archer for a long time.  Originally, this started out as an easily dispellable uber AB high AC DEX sure-shot variant that had limited damage  and little versatility.  It played well enough under most conditions but always seemed to be lacking within its innate potential.  So, after much deliberation I would like to propose this version (umm... \"versions\", there are 2 of them) for your inspection and comments.<br/>\n<br/>\n<strong>PROS</strong><br/>\n6 APR Hasted w/Rapid Shot<br/>\nHigh buffed AB (+70) and decent unbuffed AB (+46)<br/>\nHigher than average innate archer damage (28-35 per shot)<br/>\nHigh buffed saves vs. spells (Fort 45/Will 51/Refl 42) <br/>\nAccess to all cleric spells<br/>\nGood up to mighty +7 bows<br/>\nServiceable taunting (el bandito *lol*)<br/>\n<br/>\n<strong>CONS</strong><br/>\n20% XP penalty from level 9 on<br/>\nBuffs 5% dispellable against Greater Dispelling<br/>\nPuny overall skill set... No Listen! <br/>\nAA power develops very slowly and late<br/>\nFeat-starved (naturally)<br/>\n<br/>\nBuild Comments<br/>\nI have never had any issue/problem with AC using my style of play.  That style is EXTREMELY artillery so am never, ever flanked.  However for those of you who play a more point blank style to grab that last bit of AB &amp; damage at any cost, I have provided a DEFENSIVE variant that boosts the AC by at least +7 (more, if you happen to find a nice nymph cloak to wear).<br/>\n<br/>\nThe differences are slight but significant and can use the identical level-up sequence.  If your server provides a deleveler/releveler you may want to experiment with both variants a bit to decide which works best. <br/>\n<br/>\nThough this build has been play-tested via trainer (recruited my sister's kids to do it for me), I have not, personally, exposed it to the acid test, though I have played archers many times before and know pretty much what to expect (actually, as a combat type, archers have always been my favorite in any game).  I am looking forward to trying it out myself (even with the bleedin' XP penalty!) because that is the only way to get it tweaked properly.<br/>\n<br/>\nThere are several ECB builds that use this MC combo but I haven't found any that are suitable to reference here, not that they aren't sound... but are all focused in a different direction than this one.  If you find one that you feel is similar enough, please link it in this thread and I will include it here in the starting post.<br/>\n<br/>\nAs usual, I welcome all criticisms and dissection.<br/>\n<br/>\n<strong>Cleric 23/Bard 2/Arcane Archer 15, Elf, any non-lawful</strong><br/>\n<br/>\nSTR: 13<br/>\nDEX: 13<br/>\nCON: 10<br/>\nWIS: 14 (26) [28] <span style=\"color:#0000FF\">{See Note 1}</span><br/>\nINT: 14<br/>\nCHA: 14<br/>\n<br/>\nHP: 316<br/>\nSaves (F/W/R): 23/31/21 (32/40/30 vs. spells)<br/>\nOther save bonuses: Mind Effects: +2<br/>\nBAB: 25<br/>\nAB (max, naked): 27 (melee), 45 [46] (ranged)<br/>\nAC (naked/mundane armor/shield only): 21/32<br/>\n<br/>\n01: Clc 1 - Point Blank Shot, Domains War &amp; Strength<br/>\n02: Clc 2<br/>\n03: Clc 3 - Extend Spell<br/>\n04: Clc 4 - WIS+1 (15)<br/>\n05: Clc 5<br/>\n06: Clc 6 - Wpn Focus: Longbow<br/>\n07: Clc 7<br/>\n08: Clc 8 - WIS+1 (16)<br/>\n09: Brd 1 - Zen Archery<br/>\n10: AA 1<br/>\n11: AA 2<br/>\n12: AA 3 - WIS+1 (17), Called Shot<br/>\n13: Clc 9<br/>\n14: Clc 10<br/>\n15: Clc 11 - Imp Crit: Longbow<br/>\n16: Clc 12 - WIS+1 (18)<br/>\n17: Clc 13<br/>\n18: Clc 14 - Empower Spell<br/>\n19: Clc 15<br/>\n20: Clc 16 - WIS+1 (19)<br/>\n21: Clc 17 - Epic Wpn Focus: Longbow<br/>\n22: Clc 18<br/>\n23: AA 4<br/>\n24: AA 5 - WIS+1 (20), Rapid Shot<br/>\n25: Clc 19<br/>\n26: AA 6<br/>\n27: Clc 20 - Power Attack<br/>\n28: AA 7 - WIS+1 (21)<br/>\n29: AA 8<br/>\n30: Clc 21 - Divine Might<br/>\n31: AA 9<br/>\n32: AA 10 - WIS+1 (22)<br/>\n33: Clc 22 - Divine Shield [Grt Wis, 23] <span style=\"color:#0000FF\">{See Note 2}</span><br/>\n34: AA 11<br/>\n35: AA 12<br/>\n36: Clc 23 - WIS+1 (23) [24], Armor Skin [Grt Wis, 25], Grt Wis I (24) [26]<span style=\"color:#0000FF\"> {See Note 3}</span> <br/>\n37: AA 13<br/>\n38: AA 14 - Epic Prowess<br/>\n39: AA 15 - Grt Wis II (25) [27]<br/>\n40: Brd 2 - WIS+1 (26) [28]<br/>\n<br/>\n<strong>SKILLS: 206</strong><br/>\nConcentration 43(43), Perform 4(6), Spellcraft 43(45), Taunt 43(45), Tumble 40(41), UMD 33(35)<br/>\n<br/>\n01: Conc(4), Spcr(4), S - 8<br/>\n02: Conc(1), Spcr(1), S - 10<br/>\n03: Conc(1), Spcr(1), S - 12<br/>\n04: Conc(1), Spcr(1), S - 14<br/>\n05: Conc(1), Spcr(1), S - 16<br/>\n06: Conc(1), Spcr(1), S - 18<br/>\n07: Conc(1), Spcr(1), S - 20<br/>\n08: Conc(1), Spcr(1), S - 22<br/>\n09: Conc(1), Perf(1), Spcr(1), Taunt(5), Tumb(10), UMD(8), S - 2<br/>\n10: S - 8<br/>\n11: S - 14<br/>\n12: S - 20<br/>\n13: Conc(4), Spcr(4), S - 16<br/>\n14: Conc(1), Spcr(1), S - 18<br/>\n15: Conc(1), Spcr(1), S - 20<br/>\n16: Conc(1), Spcr(1), S - 22<br/>\n17: Conc(1), Spcr(1), S - 24<br/>\n18: Conc(1), Spcr(1), S - 26<br/>\n19: Conc(1), Spcr(1), S - 28<br/>\n20: Conc(1), Spcr(1), S - 30<br/>\n21: Conc(1), Spcr(1), S - 32<br/>\n22: Conc(1), Spcr(1), S - 34<br/>\n23: S - 40<br/>\n24: S - 46<br/>\n25: Conc(3), Spcr(3), S - 44<br/>\n26: S - 50<br/>\n27: Conc(2), Spcr(2), S - 50<br/>\n28: S - 56<br/>\n29: S - 62<br/>\n30: Conc(3), Spcr(3), S - 60<br/>\n31: S - 66<br/>\n32: S - 72<br/>\n33: Conc(3), Spcr(3), S - 70<br/>\n34: S - 76<br/>\n35: S - 82<br/>\n36: Conc(3), Spcr(3), S - 80<br/>\n37: S - 86<br/>\n38: S - 92<br/>\n39: S - 98<br/>\n40: Conc(4), Perf(3), Spcr(4), Taunt(38), Tumb(30), UMD(25)<br/>\n<br/>\n<strong>CRUNCH @Level 40 </strong><span style=\"color:#0000FF\">{See Notes 1, 4}</span><br/>\n<br/>\nAB +70<br/>\nBuffs: Bard Song, Bless, Aid, Owl's Wisdom, Battletide, Prayer, Div Power, Div Favor, Div Might, <br/>\nTaunt (not included in progression but available)<br/>\nHasted +70/+65/+60/+70/+65 (5 APR)<br/>\nHasted, Rapid Shot mode +68/+63/+58/+68/+63/+58 (6 APR)<br/>\n<br/>\nDamage 28-35<br/>\nBuffs: Bard Song, Battletide, Prayer, Div Favor, Div Might, Battle Master<br/>\n(1-8) + 8 + 19 = 28-35 (Crit 19-20 x3)<br/>\nImbue Arrow (3/day) 12d6 fire/magical/physical<br/>\n<br/>\nAC 43<br/>\nBuffs: Mage Armor*, Magic Vest, Shld of Faith, Haste<br/>\n19 + 8 (Plate) + 16 = 43<br/>\n*Unequip armor before casting MA.  Using padded armor (5% failure) results in AC of 42.<br/>\n<br/>\nHP 556<br/>\nBuffs: Endurance, Auro of Vit, Battle Master<br/>\n316 + 120 + 80 + 40 (capped CON) = 556<br/>\n<br/>\nSaves (F/W/R) 36/42/33 (45/51/42 vs. spells)<br/>\nBuffs: Bard Song, Resistance, Owl's Wis, Cat's Grace. Endurance, Battletide, Prayer, Aura of Vit, Prot/Align, Battle Master<br/>\n23/32/21 + 13/10/13 = 36/42/33<br/>\n<br/>\nOther<br/>\nImbue Arrow DC 32<br/>\n10 + 15 + 7 = 32<br/>\nSpell Resistance (spell) SR=35<br/>\n12 + 23 = 35<br/>\nMighty enhancement, maximum +7<br/>\nSTR 13 + 7 (Bull's) + 4 (AoV) + 5 (Div Might) + 5 (Battle Master) = 34; Mighty +7 (capped at STR 25)<br/>\n<br/>\n<span style=\"color:#0000FF\"><strong>Notes</strong><br/>\n<br/>\n1. Two variants have been furnished in the level-up guide.  <br/>\n</span><ul><li>The OFFENSIVE variant (WIS=28) benefits from +1 AB, breaks higher SR and additional spell slots at slvl 1, 5 &amp; 9.[/*:m]</li>\n<li>The DEFENSIVE variant (WIS=26) benefits from Divine Shield/Armor Skin for a gain of +7 AC w/mundane equipment.<br/>\n<br/>\nOnly the stats for the OFFENSIVE variant have been furnished in the analysis.[/*:m]</li></ul>[/list]<br/>\n<br/>\n2. For OFFENSIVE variant, select Grt Wisdom on this level. For DEFENSIVE variant, select Divine Shield.<br/>\n<br/>\n3. For OFFENSIVE variant, select Grt Wisdom on this level. For DEFENSIVE variant, select Armor Skin.<br/>\n<br/>\n4. Max values of dice rolls for empowered buffs are assumed.[/color]</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:32 AM - Sep 04, 2011",
      "content": "<div>Hey Hip, <br/>\n<br/>\nI remember discussing one build sort of like that with Cleric and AA via e-mail just about when I showed you my zen archer build. This is a good combo, but I have a couple of points I would like to argue here: I would switch up the spread to Cleric 15, Bard 2 AA 23. The way you've structured your build here, it doesn't use Cleric as a caster, with only an average Wisdom score of 28 and no spell focus feats, so Cleric usage here is limited to self-buffing,  which means you don't need more than 15 Cleric levels other than for near undispellability (5% chance with Greater Dispelling). Here is why:<br/>\n<br/>\nYour buffs will mostly cap at level 15, except for Shield of Faith, as below:<br/>\n<br/>\nDivine Favor caps at 15<br/>\nMagic Vestment caps at 15<br/>\nDarkfire caps at 10 *<br/>\nShield of Faith caps at 18<br/>\nGMW caps at 15 *<br/>\n<br/>\n* In WoG, GMW works on bows and Darkfire on arrows, that is why I mentioned them. Don't know about where you play.<br/>\n<br/>\nAs you pointed out yourself, you don't need AC being an archer, so it's not worth the level investment to cap SoF or to be 5% dispellable. I would think you should much sooner adjust your playstyle in order not to be targeted by dispel than take 8 levels of Cleric where they aren't needed. With those 8 levels invested in Arcane Archer, you'd get +4 undispellable AB and one more Bonus Feat (you lose one with Cleric 23, get two from AA 18 and 22). If you are willing you can even consider dropping 1 AB and going Cleric 15 AA 22 Bard 3 for one extra skill dump around mid 20s to early 30s. Your Imbued arrows would do 16d6 damage, instead of 12d6 as is now.<br/>\n<br/>\nAnother thing I would also recommend is dropping Divine Shield and Divine Might because of the heavy stat and feat investment in an already feat-starved build. I have a Pally CoT zen archer who does use those a lot, but he has 20 CHA to make it worth his while and has CoT bonus feats to compensate for the lack of feats. With 14 base CHA it's hardly worth the investment. You've taken Power Attack, Divine Might, Divine Shield and Rapid Shot in epics. With those 4 Feats, you could redo your starting stats and get more Great Wisdoms for higher AB and spell DCs. You could take that extra bonus feat and get Epic Prowess with it, freeing up another Epic Bonus Feat.<br/>\n<br/>\nSome other minor tweaks I see here are: You should swap Rapid Shot with Improved Critical. 5% increased threat range is less than one fully buffed attack per round in terms of raw damage, especially with Cleric buffs. You could even consider dropping it altogether for one more Wisdom increase. Your damage output might suffer a bit this way, but your AB gain will be tremendous! +4 just from AA, and another +4 if you manage to pump up your starting Wisdom to 18 and getting 4 more Great Wisdoms. Your attack spells, although not the focus here with only 15 caster levels, could be used against non-SR creatures with weak saves. The one that comes to mind the most is Hammer of the Gods, which has a devastating effect against a group of meleers so they are stunned while you snipe the hell out of the casters.Or you could drop a well-placed \"stack\" of Blade Barriers at a doorway and make the monsters choose between death by arrows or blades. WoG has a custom script where monsters won't walk over a harmful spell and commit suicide, so you could drop them at a doorway and then just shoot them all to death virtually risk-free. And if they do try to come at you, it'll be very painful!<br/>\n<br/>\nAnyway, like I said to you via e-mail back then, I don't know nuthin bout no Arcane Archers, but I do know my Clerics VERY WELL. Apart from avado, whose experience with clerics is vast and beyond reach, I may be the second guy who is still here to have played this class the most or built with it the most. I like the synergy between Cleric capacity to buff the AA's already extremely high AB and Zen Archery, not to mention improve the damage output. No build with these elements would ever be considered weak, but I believe the alternative I have suggested would be much stronger.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:23 PM - Sep 04, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong> <br/>\nI would switch up the spread to Cleric 15, Bard 2 AA 23. The way you've structured your build here, it doesn't use Cleric as a caster, with only an average Wisdom score of 28 and no spell focus feats, so Cleric usage here is limited to self-buffing,  which means you don't need more than 15 Cleric levels other than for near undispellability (5% chance with Greater Dispelling). \n</div></blockquote>\nYup. It's an archer pure &amp; simple.  Might throw in WoF  or summon for occasional mob control or perhaps an extended GS to reposition better, but otherwise, obviously this build was never designed for it's casting power... just indispellability... so we need to address our mutual evaluation of the importance of that factor in a buffing build first since it is crucial to my split (for all buffing caster splits, for that matter).  It is THE #1 reason for 23 levels.  There is no other reason and only lowered from 24 to grab the +AB &amp; damage from AA15.  The buff caps you've quoted mean nothing once they are dispelled. <br/>\n<br/>\nFor those of you not following in your program, here would be the actual buff resiliency of a level 15 caster buff compared with a level 23 cleric:<br/>\n<br/>\n<strong>Dispellability:  d20 + dispeller caster level vs. 12 + buffer level</strong><br/>\n<br/>\nLesser Dispel - Level 14 buffer indispellable by this dispel version <br/>\n[d20 + 5 (max)] vs. [12 + 14] = 25 vs. 26 <br/>\n<br/>\nDispel Magic - Level 19 buffer indispellable by this dispel version <br/>\n[d20 + 10 (max)] vs. [12 + 19] = 30 vs. 31<br/>\n<br/>\nGreater Dispelling - Level 24 buffer indispellable by this dispel version  <br/>\n[d20 + 15 (max)] vs. [12 + 24] = 35 vs. 36<br/>\n<br/>\nMordenkainen's disjunction - Level 40 buffer (max with standard NWN level cap)<br/>\n[d20 + 40 (max)] vs. [12 + 40] = 60 vs. 52 (Result: dispelled by d20 of 12 thru 20 or 60% dispellable by this version)<br/>\n<br/>\nExample:  Dispellability of Caster Level 15 buffs <br/>\nLesser Dispel - 25 vs. 27 - Result: buffs indispellable by this version <br/>\nDispel Magic - 30 vs. 27 - Result: buffs dispelled by d20 of 17 thru 20 = 4/20 or 20% dispellable by this version<br/>\nGreater Dispelling - 35 vs. 27 - Result: dispelled by d20 of 12 thru 20 = 12/20 or 60% dispellable by this version<br/>\nMordenkainen's disjunction - 41 (min) vs. 27 = Result: dispelled by d20 of 1 thru 20 = 100% dispellable by this version<br/>\n<br/>\nExample:  Dispellability of Caster Level 23 buffs <br/>\nLesser Dispel - 25 vs. 35 - Result: buffs indispellable by this version <br/>\nDispel Magic - 30 vs. 35 - Result: buffs indispellable by this version<br/>\nGreater Dispelling - 35 vs. 35 - Result: dispelled by d20 of 20 = 1/20 or 5% dispellable by this version<br/>\nMordenkainen's disjunction - 41 (min) vs. 35 = Result: dispelled by d20 of 1 thru 20 = 100% dispellable by this version<br/>\n<br/>\nI consider indispellability levels of over 10% for Greater Dispelling too unreliable to be of value for a build reliant and structured around buffs.  Apparently you weight indispellability much lower than I.<br/>\n<br/>\nActually I have a build with the exact same (cleric 15) split filed away but did so poorly against arcanists, dragons &amp; raks that I revisited it to see what I could do to help it and this is the result.  The current buffed AB is more than sufficient IMO.  With artificially boosted ACs of hostiles (as on some servers I have played), I would simply go with a high-level DEX AA, ignore cleric altogether since buffs will go *poof* easily and at least you hit regularly. Also, those same uber monster servers have uber equipment and arrows that are enchanted to the point that the piddly little cleric buffs have little significance in increasing damage.<br/>\n<br/>\nBut I will never post a build that provides an accommodation for the WoG (or any other custom) server unless someone requests it.  My builds will always be assumed to apply to vanilla v1.69. <br/>\n<br/>\nAs far as spell DCs for crowd control, I stick mostly to no-save spells like Word of Faith, Harm, etc.  HoG is handy, but when it misses I just go the no-save route.  Besides few spells are as reliable as leg shots in combo with a greater mummy or elder elemental tank when mobs get pesky.<br/>\n<br/>\nThe swap between Imp Crit &amp; Rapid Shot is valid between those 9 levels I suppose.  TBH, I seldom use Rapid Shot myself in practice.  Never need to with a hasted AA!   I probably would more often if I could remember to activate it, though.  There's that senior thing again. <br/>\n<br/>\nLet's get this buff permanence issue hashed out first, though, since it impacts just all of my buffing builds. K, pardner?</div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "9:42 PM - Sep 04, 2011",
      "content": "<div>I see that Maxi is now a \"godly-master\"!  <br/>\n<br/>\nI played a cleric/aa way way back in 2004.  That is too long ago to be specific!  Here is what I found in GENERAL, with a high wisdom cleric (which Zen archery means).  The high wisdom means that the spell DC (like Max pointed out) is high!  I routinely had extremely effective casters with 19 BASE wisdom (or 30 effective with gear).  When you start with 30, OMG! Now you are up to 40+ and the DC on the spells becomes nothing to sneeze at!  <br/>\n<br/>\nI have NEVER once used the Hammer of Gods!  I used OTHER spells!  Implosion is for the new player all enammered with insta-death.  Leave it for the new players!<br/>\n<br/>\nSOV is the ULTIMATE stunner!  I routinely used ONLY that spell to stop mobs (you cast 2 or 3 or more on a mob and then attack the mobs).  It gives 10 rounds of damage while you sit and pick off the stunned ones.  <br/>\n<br/>\nWhy fight one on one (even from range) with a high wisdom cleric?  I suggest you make a Necromancy based wizard and try out Wail.  Learn all about HERDING with that spell!  Then, apply it to the cleric (HERDING).  I use to HAVE to solo construct areas because other players would make it harder than it had to be.  I would run the entire map, collecting the monsters.  I would gather them ALL into one area and wait!  As the groups got BIG, i would unload 3 SOV on myself, stunning the ones close to me.  Then unleash FIRESTORMS (6 or however many i had) wasting the ENTIRE map in 5 minutes.  <br/>\n<br/>\nWhat I found was, the high wisdom (which 28 is at the LOW end of) makes the cleric Godly (even more so).  My \"tweak\" would be to get wisdom up even higher and live off higher AB and DC.  Divine might/shield.. 14+12=26 gives +8 damage and AC.  In my opinion, not enough to loosing 2 epic feats for.  In my experience, when you wait so long to take normal feats, they are rarely used because you have learned to use other parts of the character.  Of course, that does not apply when you are building for, say a Dragon shape, which is a target epic feat.  Div might and shield are not target feats, so I wouldnt worry about them much.  Pump the wisdom and have even more FUN!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:26 PM - Sep 04, 2011",
      "content": "<div>Hey dude, i like that you raise this discussion, it's VERY INTERESTING and could be very productive for you and all other guild members, including myself. I know EXACTLY what it's like to have 15 levels of Cleric and be 100% dispellable by Mord's. Maximillian Kane (my Magical Master build) is Cleric 15 Wizard 23 Monk 2 in WoG. Ask Kail, undoubteldy he'll confirm that WoG has all types of dispellers EVERYWHERE. Even there, he has not had much trouble with dispel, and if there ever was a server that could be his \"bane\", WoG would be it. Let me try to show you my point of view on dispellability and how it influences your play, but first I want to make a correction:<br/>\n<blockquote><div>Greater Dispelling - 35 vs. 27 - Result: dispelled by d20 of 12 thru 20 = 12/20 or 60% dispellable by this version\n</div></blockquote>\n\nThis is not actually true. 12, 13, 14, 15, 16, 17, 18, 19, 20 is equivalent to 9/20 so 45% dispellable. Honest mistake, no worries. Thought I'd correct it for other members that decide to read through our ramblings.<br/>\n<br/>\nNow about your comments, it seems you don't have enough buffs memorized or have severe resting restrictions where you play, or something that would hinder the possibility of rebuffing undoable. As for me, I normally have enough buffs to get dispelled, rebuff, get dispelled again, rebuff, get dispelled again, rebuff pretty much every combat (at least the important ones). You have to know how to equip your toon and manage your spellbook in order to minimize the impact of being dispellable. For example: if you choose to wear Darkmoon Robes (+0 with permanent haste), you are asking for trouble, unless you memorize 3 or 4 Magic Vestment spells to deal with the fact that you WILL BE DISPELLED. In my experience, as long as you keep the most important properties to you in your items, you should be fine. In other words, it's better to wear a +5 robe without haste and pick the travel domain and memorize several copies of Extended Haste to use with discretion rather than get perma-haste and not memorize more than 1 MV. If you can't afford the slots for MV, you need to rethink something.<br/>\n<br/>\nIn your build's case specifically, I'd try to cap Wisdom with items, and if that's not possible, enhance it as much as you can through them and then memorize 3 or 4 Empowered Owl's Wisdom in case you get dispelled. I don't know where you play and how things work there, but I can tell you that I've played Maximillian Kane on Aielund Saga twice from 1-33, on 2 separate brazillian PWs 1-40 and now got him to lvl 35 on WoG. To me, WoG has been the most difficult server to play this build with low caster levels because of the sick amount of dispel spammers. You can't invade a Giant and Ogre fort and not find an Ogre Mage, Ogre High Mage or Ogre Mage Lord, you can't kill the Stone Giant King without having to go through his Stone Giant Shamen (lvl 17 or higher Druid casters with Greater Dispelling and SoV), you can't kill the Frost Giant King without fighting through Frost Giant Clerics, The Fire Giant King has 2 Wizardesses and 2 Priestesses that dispel you, and his wife is a high level mage as well, escorted by a priestess of her own, etc... As you can see, those are all melee-oriented monster types and you still have at least Greater Dispellers, Breachers or Mord spammers running around. Virtually EVERYWHERE you go, you will find dispel spammers, and it's only the first or second spell they cast, with very improved AI that WoG has. It's been a tough ride, and I've had to make adjustments to my playstyle with it to be able to succeed there. I always go for Casters first, I summon a lot and let the summons be dispelled, I use Time Stop and Bigby's 6, 7 and 9 to neutralize multiple casters in one screen, all of which you could do with this toon via UMD. I let party members take the lead and stay back sniping till they have been targeted with dispels and I try to avoid or be more careful in places where I know there are lots of dispellers and also I don't go there when I don't have enough resources (A.K.A. have few buffs left, no consumables, heal potions, etc..). I rest and then proceed whenever possible, and if it's not I turn back, rest and then return. Well, actually, WoG in that sense has been easier because they have a scroll called Leomund's Secret Shelter, which does the same as the PnP version. It opens a portal door to another dimension to a house in which you can rest and then you get out the door and it's wasted, but each of these beauties costs 35k gold so at first I couldn't afford them. Now at 35th lvl I can afford as many as I want.<br/>\n<br/>\nI find that as long as you are prepared for the possibility of being dispelled and dispellable, it's not a major concern. With those tweaks I suggested, having +8 AB and knowing how to equip your toon, manage his spellbook and rebuff while in the heat of battle, you shouldn't need to worry about it all that much. And if all else fails, Harming a caster will make sure they never get that spell out in the first place. Hard to succeed on a concentration check when you take that much damage! But maybe it has to do with wherever you play, I truly cannot say. What I can say for certain is that as of now in the many places I have played, I am yet to find a situation where I go: the only way to go around this situation is to modify my build and get more Cleric levels.<br/>\n<br/>\nJust to exemplify, I can say that Max has 9 Divine Favors, 8 Extended Divine Favors, 4 Divine Powers and 6 Extended Divine Powers memorized, 3 Empowered Owl's Wisdom (he has +6 to Wisdom from items, and then buffs the rest), plus 3 GMWs and 2 Darkfires for arrow stacks. I also keep a couple of my important spells in scrolls just in case I need to bail out, like Time Stop, Greater Sanctuary, GMW (self-crafted and in WoG they give +5 at 15 caster levels like they were supposed to), Invisibility, etc.<br/>\n<br/>\nAnyway, the other day I was playing with marshall with the build we helped him come up with. He said something quite absurd to me: \"I don't have enough slots for Divine Power\". I immediately gave him a \"spellbook makeover\", after which he had 3 slots for Extended Divine Power available. Sometimes it's just a matter of knowing what's more important. I know you like Empowered Endurance, but honestly, if you don't see a way to squeeze in another Empowered Owl's Wisdom, don't think twice! Drop Empowered Endurance for it. <br/>\n<br/>\nI agree with you that it's nice to walk around not having to worry about being dispelled and I agree that buffs are really important to this build, but that doesn't mean you need to change the spread to a much worse version to be undispellable, just means you have to WORRY about being dispelled, memorize multiple copies of your more important buffs and tread carefully when confronting types which you think can cause you problems. <br/>\n<blockquote><div>Actually I have a build with the exact same (cleric 15) split filed away but did so poorly against arcanists, dragons &amp; raks</div></blockquote>\n\nI don't know how dragons are where you play, but I have killed a dragon in WoG that spams Greater Dispelling 3 times, has 40/+6 DR and acid immunity. I soloed him from lvl 24 on. But you need to know what you're doing, and perhaps where you play things work differently, dragons are hasted, etc.. To deal with Rakshasa, the alternative build with +8 AB would be even better, cast Spell Resistance on yourself (nice to have a couple of scrolls available just in case) then Divine Power and Divine Favor and fire away! If they come close, you either called shot slow them or engage in melee. You should always have a sword / shield at hand to deal with different situations. And as for arcane casters, try coming in invisible and Harming them. I doubt they can succeed the Concentration check to get even one spell out. Multiple casters can be a pain. I suggest using GS and summoning something so they waste their dispels on that summon and then you can buff up and take it from there, or stand at a corner, then run outm shoot once and run back behind the wall so that they follow you. Summon a creature so that it blocks them, buff up and snipe away. At this time it would've been handy to have implosion. Oh well!<br/>\n<br/>\nSo, has this post in any way clarified why I rate undispellability somewhat lower than you?? Don't get me wrong, it's pretty high in my book, but when you weigh it against +8 AB, +4 spell DCs and 1 more epic bonus feat, I tend to lean towards the latter as a better choice. Eager to see ur take on this rather large post.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:41 PM - Sep 04, 2011",
      "content": "<div><blockquote><div>I see that Maxi is now a \"godly-master\"! \n</div></blockquote>\n\nI'm not a master yet, but I do know the class very well, partially thanks to you <br/>\n<blockquote><div>SOV is the ULTIMATE stunner! I routinely used ONLY that spell to stop mobs (you cast 2 or 3 or more on a mob and then attack the mobs). It gives 10 rounds of damage while you sit and pick off the stunned ones. <br/>\n<br/>\nWhy fight one on one (even from range) with a high wisdom cleric? I suggest you make a Necromancy based wizard and try out Wail. Learn all about HERDING with that spell! Then, apply it to the cleric (HERDING). I use to HAVE to solo construct areas because other players would make it harder than it had to be. I would run the entire map, collecting the monsters. I would gather them ALL into one area and wait! As the groups got BIG, i would unload 3 SOV on myself, stunning the ones close to me. Then unleash FIRESTORMS (6 or however many i had) wasting the ENTIRE map in 5 minutes.</div></blockquote>\n\nI use that a lot with my Druid build, Champion of the Wilderness, but instead of Fire Storms, I use Extended Stonehold to keep the suckers in place while I fire off Call Lightning, Empowered Call Lightning and my companion and summoned earth elemental kick the crap out of the stunned foes. It's harder to loot the corpses than to kill them <br/>\n<blockquote><div>What I found was, the high wisdom (which 28 is at the LOW end of) makes the cleric Godly (even more so). My \"tweak\" would be to get wisdom up even higher and live off higher AB and DC. Divine might/shield.. 14+12=26 gives +8 damage and AC. In my opinion, not enough to loosing 2 epic feats for. In my experience, when you wait so long to take normal feats, they are rarely used because you have learned to use other parts of the character. Of course, that does not apply when you are building for, say a Dragon shape, which is a target epic feat. Div might and shield are not target feats, so I wouldnt worry about them much. Pump the wisdom and have even more FUN!</div></blockquote>\n\nMy suggested tweaks would bring his Wisdom score to 36 <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:53 AM - Sep 05, 2011",
      "content": "<div>I see where you guys are going as far as the benefits of the higher WIS but I can't figure out Max's +8 AB.  Going from AA 15 to AA 23 is 8 more AA levels which nets +4AB and +4 damage.  So must assume the other 4 AB is from the subbed in Grt Wis feats scattered amongst those Power Attack, Divine Might/Shield and... ummm, there must be another one there somewhere... and then redistributing the start spread to get rid of the Str prereq for Power Attack et al. and dropping it into Wis. Close?  Read on, please...   <br/>\n<br/>\nThe most interesting intimation (to me, anyway) and the one that I have never gotten a straight answer on is \"How much AB should be targeted in a build?\"  (Mr. Max, IIRC, we glossed over this issue a bit in private, a ways back when we were discussing the pros and cons of an AA that could attain an innate AB approaching 80 but I don't think there was anything concrete that came out of it, just contingencies).  Still, it is probably the #1 most important variable to determine before any building takes form because as long as the AB level results in reliable hits (i.e. AC of foes is not high enough to make the AB level prohibitive) why strive to make it any higher?  And this one at 70 seems like plenty to me under average circumstances. Artillery archers are almost impossible to taunt, penalize or curse because the attack range is too far away, but I'm sure you guys already realize that. <br/>\n<br/>\nI like flexibility in all my builds because I want to take part in every aspect of the game that I can.  So that means I want to have enough slots available for battles with groups of living and also undead during the same day.  Sure, you can slot a few token undead killer spells in there, but they get exhausted quickly and then what do you do?  Look for a place to hide or rest?  Uhhh... don't know about you guys, but my RL clock is ticking and not too steadily anymore.  A decent plan today is better than a perfect plan tomorrow. I want all the slots possible and that means adequate caster levels in combo with the prime ability.<br/>\n<br/>\nBut you are right, Max, in that play style involves a comfort level.  I can't remember if it was you who stated this once but someone playing a spellcaster combo (perhaps it was a divine/arcanist combo? can't recall) actually suggested that using the radial during combat was just a matter of practice and it would become second nature.  Ooookeeeee.  Maybe in my next life it will be part of the repertoire but this little grey indian would rather chew on tin foil while rubbing a cheese grater across his eyeballs than use the bleedin' radial, probably the worse utility in the NWN IMO.  WE WANT MORE QUICKSLOTS!!! *lol*  \"Will you PLEASE stop that annoying figgeting?\"  \"Leave me alone, gramps, I'm casting a spell!\"<br/>\n<br/>\nI've made some training modules for my nephews that contain hoardes of the nastiest respawning SOBs you could imagine... my Aberdeen NWN Proving Ground.  When I am away like now, I email the builds and have them run them through the ropes and report the results.  Believe me... when the metal meets the meat indispellability is worth its weight in gold.  So it's not always the restrictive rest customization that can throw a monkey wrench into the well-laid plans, but also respawn settings.   If your PC doesn't have staying power, you are doomed or running away (not my style).  So my personal strategy is to provide the longest buffs possible so that they will last.  A case in point are the empowered spells.  Sometimes it takes 2 or even 3 casts to get a favorable roll (you are speaking to the master of the Roll 1, btw  ). So Slot Level 4 is just about expended in the first buffing.<br/>\n<br/>\nIt would be nice to expect there to be enough enhancements on items to make up for the weaknesses of a build but I never depend on that.  Either the build can stand on its own with mundane equipment or IMO it is suspect.  And building for a certain server is a whole other ball of wax anyway.  I don't expect I could ever design an effective build for WoG unless I actually learned the nuances (like those domain restrictions) and spent some time nosing around the stores.  It's like that on most servers except the vanilla-balanced ones which are fairly predictable in that respect.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:07 PM - Sep 05, 2011",
      "content": "<div>Heya Hip, I don't have much time, so let me try to sum it up.<br/>\n<blockquote><div>I see where you guys are going as far as the benefits of the higher WIS but I can't figure out Max's +8 AB. Going from AA 15 to AA 23 is 8 more AA levels which nets +4AB and +4 damage. So must assume the other 4 AB is from the subbed in Grt Wis feats scattered amongst those Power Attack, Divine Might/Shield and... ummm, there must be another one there somewhere... and then redistributing the start spread to get rid of the Str prereq for Power Attack et al. and dropping it into Wis. Close? Read on, please...</div></blockquote>\n\nPrecisely. +4 AB from AA 15 to 23, 18 starting Wisdom and +4 Great Wisdoms by dropping PA, DM, DS and Epic Prowess (which you can take with the extra bonus feat from AA)<br/>\n<blockquote><div>The most interesting intimation (to me, anyway) and the one that I have never gotten a straight answer on is \"How much AB should be targeted in a build?\" (Mr. Max, IIRC, we glossed over this issue a bit in private, a ways back when we were discussing the pros and cons of an AA that could attain an innate AB approaching 80 but I don't think there was anything concrete that came out of it, just contingencies). Still, it is probably the #1 most important variable to determine before any building takes form because as long as the AB level results in reliable hits (i.e. AC of foes is not high enough to make the AB level prohibitive) why strive to make it any higher? And this one at 70 seems like plenty to me under average circumstances. Artillery archers are almost impossible to taunt, penalize or curse because the attack range is too far away, but I'm sure you guys already realize that. \n</div></blockquote>\n\nTaunting has nothing to do with it, it reduces AC, but the case here is not about JUST having +8 AB. The AB is nice because it makes you hit in your 3rd attack just as much as you hit on the 1st and 2nd. The extra wisdom will give you AB, spells per day and spell DCs. There are many many ways to incorporate spells into your combat strategy. Having more slots also means you won't need to drop any spells to memorize multiple copies of your most important spells to rebuff in case you are dispelled. I'll give ya a little example. In WoG there's this very high AC boss called Vayne, who is a pain in the arse. He has around 70 AC, which this build would hit always in the first attack, but on the third attack every round you'd have to roll an 11 or more to hot. With the higher Wisdom, you'd hit on a 3 or more.<br/>\n<blockquote><div>I like flexibility in all my builds because I want to take part in every aspect of the game that I can. So that means I want to have enough slots available for battles with groups of living and also undead during the same day. Sure, you can slot a few token undead killer spells in there, but they get exhausted quickly and then what do you do? Look for a place to hide or rest? Uhhh... don't know about you guys, but my RL clock is ticking and not too steadily anymore. A decent plan today is better than a perfect plan tomorrow. I want all the slots possible and that means adequate caster levels in combo with the prime ability.\n</div></blockquote>\n\nWith a higher casting stat, it makes sense to get more caster levels. With low DCs, 9th level Cleric spells are worthless, so that's why I suggested that you go for Cleric 15, cuz that's all that is needed for buffs. Now with 36 Wisdom, you could take a few more levels in Cleric to get all spell levels. This way you'd have a better arsenal. Then you'd need to drop Improved Critical to get Epic Prowess as you'd lose AA 22 Bonus Feat. But IMO the undead-slaying spells are wasted. You have Turn Undead and you can darkfire a weapon and melee with them, as they are generally weak vs fire. But you sound like you never know what you're up against when you play, which is PRECISELY why you should not prepare for such specific situations like fighting undead or arcane casters. You should have alternatives that have more than one purpose and I believe that meleeing a bit is one that will cover more ground. There is no question in my mind that you'll melee better than a caster. You're a CLERIC!<br/>\n<blockquote><div>But you are right, Max, in that play style involves a comfort level. I can't remember if it was you who stated this once but someone playing a spellcaster combo (perhaps it was a divine/arcanist combo? can't recall) actually suggested that using the radial during combat was just a matter of practice and it would become second nature. Ooookeeeee. Maybe in my next life it will be part of the repertoire but this little grey indian would rather chew on tin foil while rubbing a cheese grater across his eyeballs than use the bleedin' radial, probably the worse utility in the NWN IMO. WE WANT MORE QUICKSLOTS!!! *lol* \"Will you PLEASE stop that annoying figgeting?\" \"Leave me alone, gramps, I'm casting a spell!\"\n</div></blockquote>\n\nYeah but knowing how to adjust your playstyle AS WELL as your builds is important, otherwise you will limit your building options. If you are a cautious player, and walk slowly with detect mode on, and don't rush in, you will never be effective as a tanker. So what I say here is that you should always strive to improve yourself. Each class combo has a different playstyle that goes best with it, and you should have them all as part of your in-game repertoire.<br/>\n<blockquote><div>I've made some training modules for my nephews that contain hoardes of the nastiest respawning SOBs you could imagine... my Aberdeen NWN Proving Ground. When I am away like now, I email the builds and have them run them through the ropes and report the results. Believe me... when the metal meets the meat indispellability is worth its weight in gold. So it's not always the restrictive rest customization that can throw a monkey wrench into the well-laid plans, but also respawn settings. If your PC doesn't have staying power, you are doomed or running away (not my style). So my personal strategy is to provide the longest buffs possible so that they will last. A case in point are the empowered spells. Sometimes it takes 2 or even 3 casts to get a favorable roll (you are speaking to the master of the Roll 1, btw  ). So Slot Level 4 is just about expended in the first buffing.\n</div></blockquote>\n\nWe are all masters of that, but rebuffing when you get 1 less Wisdom isn't wise (maybe you are doing it because your wisdom is lower so you don't realize that's not a good idea ) , even less so in a dispellable build. That is simply wasting resources. When you get dispelled, which you will, you rebuff and hope for a better roll. My Pal / WM / Monk sometimes gets an unlucky +7 to Charisma due to a 1 on Eagle's Splendor. I just last through the day, since that +1 isn't vital to my survival. It seems to me as a little OCD of yours (like myself with ending even stat numbers), but I can tell you that if you truly worry THAT MUCH about rolls, take Maximize spell and be done with it.<br/>\n<blockquote><div>It would be nice to expect there to be enough enhancements on items to make up for the weaknesses of a build but I never depend on that. Either the build can stand on its own with mundane equipment or IMO it is suspect. And building for a certain server is a whole other ball of wax anyway. I don't expect I could ever design an effective build for WoG unless I actually learned the nuances (like those domain restrictions) and spent some time nosing around the stores. It's like that on most servers except the vanilla-balanced ones which are fairly predictable in that respect.</div></blockquote>\n\nThis is simply plain wrong, mate, it borders the absurd. There are builds that rely more on items, but there shouldn't be a build that doesn't need to count on items to minimize their weaknesses. They all MUST do that!! Some need items more than others, like a Fighter WM Rogue will need more than this one. Items are an important part of NWN play, and knowing how to equip your toon well is as much valid knowledge as knowing how to build. If you truly know your build, you know its strengths and its weaknesses and you know which items you can equip it with to potentialize their strengths and diminish their weaknesses. Knowing the environment where you play is vital to equip your build well, so yeah, you should, if you ever came to play in WoG,get to know the nuances, but the shops there don't sell much. You get the stronger items by killing bosses. That's pretty much it. Holy crap, I got carried away and now I'm late for work.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:25 PM - Sep 05, 2011",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong>\n<blockquote><div>The most interesting intimation (to me, anyway) and the one that I have never gotten a straight answer on is \"How much AB should be targeted in a build?\" (Mr. Max, IIRC, we glossed over this issue a bit in private, a ways back when we were discussing the pros and cons of an AA that could attain an innate AB approaching 80 but I don't think there was anything concrete that came out of it, just contingencies). Still, it is probably the #1 most important variable to determine before any building takes form because as long as the AB level results in reliable hits (i.e. AC of foes is not high enough to make the AB level prohibitive) why strive to make it any higher? And this one at 70 seems like plenty to me under average circumstances. Artillery archers are almost impossible to taunt, penalize or curse because the attack range is too far away, but I'm sure you guys already realize that. \n</div></blockquote>\nTaunting has nothing to do with it, it reduces AC, but the case here is not about JUST having +8 AB. The AB is nice because it makes you hit in your 3rd attack just as much as you hit on the 1st and 2nd. The extra wisdom will give you AB, spells per day and spell DCs. There are many many ways to incorporate spells into your combat strategy. Having more slots also means you won't need to drop any spells to memorize multiple copies of your most important spells to rebuff in case you are dispelled. I'll give ya a little example. In WoG there's this very high AC boss called Vayne, who is a pain in the arse. He has around 70 AC, which this build would hit always in the first attack, but on the third attack every round you'd have to roll an 11 or more to hot. With the higher Wisdom, you'd hit on a 3 or more.\n</div></blockquote>\nGood point about the effect of the progression.  I think my tendency has been to concentrate on the full-attack levels when I build. But, as you have indicated, one can't just ignore the remainder of the progression to make it as effective as possible.<br/>\n<br/>\nYes, raising the prime ability increases slots and DCs but in one focused on reaping the buffs, like this one, I prefer to increase slots and durations.  This build was never intended to be a pseudo offensive cleric.  The main control is still via leg shots, setting a meat shield and occasionally WoF.  Even though the 23 levels appear to infer a heavier caster-centered, it isn't.  But I believe both benefits can be achieved by eliminating the STR/Power attack/Divine might structure.  Problem is, damage is key for a toothpick thrower so the Divine Might with higher mighty potential will net more damage than the +4 from 8 more AA levels.  Sry, but I cannot rely on WoGs GWM/Darkfire bow buffs to bail this build concept out. \n<blockquote><div>\nWith a higher casting stat, it makes sense to get more caster levels. With low DCs, 9th level Cleric spells are worthless, so that's why I suggested that you go for Cleric 15, cuz that's all that is needed for buffs. Now with 36 Wisdom, you could take a few more levels in Cleric to get all spell levels. This way you'd have a better arsenal. Then you'd need to drop Improved Critical to get Epic Prowess as you'd lose AA 22 Bonus Feat. But IMO the undead-slaying spells are wasted. You have Turn Undead and you can darkfire a weapon and melee with them, as they are generally weak vs fire. But you sound like you never know what you're up against when you play, which is PRECISELY why you should not prepare for such specific situations like fighting undead or arcane casters. You should have alternatives that have more than one purpose and I believe that meleeing a bit is one that will cover more ground. There is no question in my mind that you'll melee better than a caster. You're a CLERIC!\n<blockquote><div>\nI'll pass.  If I wanted to melee, I'd build a high discipline tanker with recipro shields or a typical battle cleric.  I play an archer like an archer, not a tank. So apparently our basic archer diverges enough to make build considerations hard to mediate.  You can figure on getting disarmed and/or KD'd without high STR in most environments so this build would not satisfy. <br/>\n</div></blockquote>\nYeah but knowing how to adjust your playstyle AS WELL as your builds is important, otherwise you will limit your building options. If you are a cautious player, and walk slowly with detect mode on, and don't rush in, you will never be effective as a tanker.</div></blockquote>\nAgain, as I stated before... this was intended to be an artillery build, one that never dies by the occasional lucky DevCrit.  Tank away with with your point blank archer but pure artillery will be more secure.<br/>\n<blockquote><div><blockquote><div>It would be nice to expect there to be enough enhancements on items to make up for the weaknesses of a build but I never depend on that. Either the build can stand on its own with mundane equipment or IMO it is suspect. And building for a certain server is a whole other ball of wax anyway. I don't expect I could ever design an effective build for WoG unless I actually learned the nuances (like those domain restrictions) and spent some time nosing around the stores. It's like that on most servers except the vanilla-balanced ones which are fairly predictable in that respect.</div></blockquote>\n\nThis is simply plain wrong, mate, it borders the absurd. There are builds that rely more on items, but there shouldn't be a build that doesn't need to count on items to minimize their weaknesses. They all MUST do that!! Some need items more than others, like a Fighter WM Rogue will need more than this one. Items are an important part of NWN play, and knowing how to equip your toon well is as much valid knowledge as knowing how to build. If you truly know your build, you know its strengths and its weaknesses and you know which items you can equip it with to potentialize their strengths and diminish their weaknesses. Knowing the environment where you play is vital to equip your build well, so yeah, you should, if you ever came to play in WoG,get to know the nuances, but the shops there don't sell much. You get the stronger items by killing bosses. That's pretty much it. Holy crap, I got carried away and now I'm late for work.</div></blockquote>\nSry, Max.  It's plain right and it's pragmatic as hell if you can take off your WoG glasses for a second. <br/>\n<br/>\nA build is static and reliable. The item enhancements are variables controlled by the designer of the environment.  Item seeding is random. <br/>\n<br/>\nThe enhancements you obtain during your ventures within an environment merely realize more of the potential that is in any build by design.  It doesn't take a rocket scientist to juggle items to achieve the best possible enhancement combo.  But designing in the anticipation of procuring specific items is counter-productive and morphs the game from a interesting RPG into a tedious item hunt like Diablo or its ilk.  Unless you are clairvoyant and know what will become available before it happens... send me a flask of what you are drinking.   Playing on low-magic servers will illuminate this dynamic clearly, though I suspect you wouldn't enjoy the item limitations they would impose on your personal preference.  <br/>\n<br/>\nThe error in your thinking is that you NEVER know what items you may get to equip until you sample an environment at which point your well-planned assumptions can flop.  Unless of course, you are depending on muling and twinking via playmates, in which case we REALLY have nothing to discuss along these lines. We'll just have to agree to disagree on this point because building for a specific set of conditions is too constrictive for my tastes.  I'll leave that twinking to others to alter it to suit the provisions of their favorite server, LAN game or SP module.  Diversity provides that each of us have our own individual preferences, too much of a permutation for me to even begin to consider.  I'll let my builds stand on their own merit.<br/>\n<br/>\nLet me make on final point here.  If a build is maximized to be played within a specific environment, then the title of the build should be labeled accordingly so that folks searching for builds to play where they prefer will know instantly that it is based on a set of customizations, constraints and assumptions that may have no bearing on their own situation.  I will discuss this with Kail upon his return because it will aid those who want to simply use the ECB as build resource rather than a dissection clinic.<br/>\n<br/>\nThere are some very cogent points you've presented upstream, though, that will aid me in future build considerations.  Danke!<br/>\n<br/>\nCheers, amigo!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:46 PM - Sep 05, 2011",
      "content": "<div><blockquote><div>Good point about the effect of the progression. I think my tendency has been to concentrate on the full-attack levels when I build. But, as you have indicated, one can't just ignore the remainder of the progression to make it as effective as possible.<br/>\n<br/>\nYes, raising the prime ability increases slots and DCs but in one focused on reaping the buffs, like this one, I prefer to increase slots and durations. This build was never intended to be a pseudo offensive cleric. The main control is still via leg shots, setting a meat shield and occasionally WoF. Even though the 23 levels appear to infer a heavier caster-centered, it isn't. But I believe both benefits can be achieved by eliminating the STR/Power attack/Divine might structure. Problem is, damage is key for a toothpick thrower so the Divine Might with higher mighty potential will net more damage than the +4 from 8 more AA levels. Sry, but I cannot rely on WoGs GWM/Darkfire bow buffs to bail this build concept out. \n</div></blockquote>\n\nI have a few points to raise here:<br/>\n<br/>\n1- You are tunnel visioning yourself here. There's nothing to say that you cannot be BOTH a good sniper and a good caster. In fact, that is EXACTLY what Zen Archery does by tying your AB to your casting stat. And AA builds can do damage with the arrows, plus magic arrows you can find on most environments and a  Mighty bow, Divine Favor. Even without Darkfire to arrows and +5 from GMW it's still enough. Sure it'll be nice if you can have enough CHA to pump up the damage via DM, but in this case you don't, and no empowered Eagle's splendor will change that. +4 damage for 4 rounds is hardly something to make such HUGE sacrifices for.<br/>\n<br/>\n2- Maybe that is why you did so bad with that Cleric 15 toon against the enemies you mentioned. When you don't explore everything the class combo has to offer. Having a 41 DC Implosion by swapping around the stats and dropping DM, DS and PA will help you deal with different situation. Not as long as you keep that mentality of \"this is an archer, only an archer, just an archer, and my spell slots are for buffs, only for buffs and just for buffs, I use WoF, only WoF and just WoF\". If you add moves to your repertoire, but still maintain the main focus of the build, it will remain a hell of an archer, but what's to say that a Cleric Zen Archer can't use a high DC implosion spell to deal with casters? Would you rather snipe them and be targeted by their spells than instantly kill them by attacking their lowest save with a lvl 9 AREA spell?<br/>\n<blockquote><div>Again, as I stated before... this was intended to be an artillery build, one that never dies by the occasional lucky DevCrit. Tank away with with your point blank archer but pure artillery will be more secure.\n</div></blockquote>\n\nYou misunderstood me. I never suggested ANYTHING close to tanking with a build like this, which is what you seem to be implying here. I argued that DIFFERENT BUILDS HAVE DIFFERENT PLAYSTYLES that go well with each one of them, and that you AS A PLAYER OF MANY BUILDS should incorporate them into your repertoire. If you ever play a tank, being cautious won't do you any good, in fact you will certainly get your party members killed. Your main focus as a tank is SOAKING UP DAMAGE AND LIVING TO TELL THE TALE. That build would require a more \"come get me, you stupid monsters\" kind of attitude. Exactly the same type of situation you'd get in by playing a dispellable Cleric without worrying about being dispelled. You'd have to adjust your style of play to not be targeted by dispel magic effects as often. You could use Invisibility potions, GS, Time Stop scrolls, many resources are available to acheive that goal.<br/>\n<blockquote><div>Sry, Max. It's plain right and it's pragmatic as hell if you can take off your WoG glasses for a second.<br/>\n<br/>\nA build is static and reliable. The item enhancements are variables controlled by the designer of the environment. Item seeding is random.</div></blockquote>\n\nYou are absolutely wrong. Also you seem to be mistaking me by some sort of WoG obsessed creature that cannot see the game if not through the server I play. Don't underestimate me, it's not the case. I have been playing this game for 7 years, mate. Played on several SP campaigns, 2 brazillian PWs and now WoG only for the last 6 months. When I speak to you here, it's HARDLY based on WoG rules or WoG customizations, although I do mention them occasionally to prove a point, which you don't seem to be getting, so here is the point:<br/>\n<br/>\nYou are the one that is being short-sighted here, Hip. NO BUILD IS STATIC EVER. All builds are completely and totally morphable, tweakable and adjustable ALL THE TIME according to environment. Let me give you a couple of examples:<br/>\n<br/>\nIf a server I want to play in is low magic. then granted I would make my Holy Weapon Master with Cheese with Rogue rather than Monk and swap Taunt for UMD. In fact, in one of the Brazillian servers I played, Natalya was a Pally 19 / Rogue 2 / WM 19. That server had INSANE AC monsters so you needed every bit of AB you could afford, and there were SET items entirely based on classes, so you needed UMD to be able to equip yourself properly. In the Aielund Saga, she was a Paladin 20 Monk 1 WM 19, and in the other Brazillian PW she was Pally 26 / Monk 1 / WM 13 but without KD, IKD, as most monsters were immune to it. In an environment where True Seeing isn't modified (A.K.A. sees invisible and hidden creatures automatically), I won't take Listen on my Magical Master build. On that same environment, I will have to memorize more than 1 copy of True Seeing  <br/>\n<br/>\nAlso, I'm not saying that I will only equip Maximillian with a Helm of X, a Belt of Y, so on and so forth, but I know what goals I will need to acheive (I need to TRY TO cap or get as close to as possible INT and WIS with items to get the spell slots) So if I have to pick between a belt of Wisdom +2 and a belt of Dexterity +2, I will take the Wisdom one. If there is none, I will have to do without.<br/>\n<br/>\nIt's hard to try to explain this to you because as far as I know, you don't play on any online servers with custom-made improved monsters, custom-made AI scripts and alterations. One of the Brazillian PWs I played Maximillian's build on, it seemed like the admin hated mages. He had nerfed all Bigby hands and damage shields (pretty big part of my combat strategy was gone). Your build I commented on there which was based on reciprocal damage would effectively be unplayable. Many spells had been nerfed as well and most monsters had spell resistance and at least 2 immunities. I tweaked him to a more melee-oriented version. The build was still the same, but the spellbook had been DRASTICALLY changed.<br/>\n<br/>\nI cannot even begin to tell you how wrong you are about this, I was once kind of like you in that regard, before I had my first online experience. It's a whole new world out there. And by online I don't mean playing modules with friends, I mean INTERNET SERVERS. You won't know what CHALLENGE means until you play online and face custom monsters with perfected AI scripts (still pretty dumb, but much better), like a caster whose first spell is either Time Stop or Greater Sanctuary so they can buff up without being hit.. No train module will prepare you for the diversity of things you can find. I don't consider myself to be a player that has \"been around\" all that much, but having played what I have, opposites like the Brazillian servers and WoG, I've played a pretty wide range of things. The only type of server or world I haven't played is low magic. But the point is that if the server is low magic, then it is balanced for not-so-powerful items (or at least it should be), so it's not a problem. One of the Brazillian PWs I played on was SO IMBALANCED that Rogue-heavy characters just didn't exist, they were used by the players as mules to carry and sell stuff through appraise, and they'd level just by watching a friend kill stuff. <br/>\n<br/>\nAnyway, what I mean basically is that if you rely on buffs like GMW on a server that has good +5 items, then you don't really know what you're doing. If the server doesn't have them, sure, you NEED TO BUFF your weapon with a Cleric. But what if you play on a server that has nerfed Divine Favor? Or one like Arelth, where you can only put ONE BUFF on each item? What happens then? You're the one that knows the server you play in, so you should be able to say what would work and what wouldn't, and change your build accordingly.<br/>\n<br/>\nAnyway, I argued that your build would be better off by going Cleric 15 and AA 23 BECAUSE OF THE LOW WISDOM. Now that you've decided to change that, more Cleric became again a very viable option. But that option would be to sacrifice AB and Imbue Arrows damage for CASTING PROWESS and Undispellability. Having 36 Wisdom, if you don't add spellcasting to your combat strategies, you're just unnecessarily limiting yourself.<br/>\n<br/>\nI have tried to avoid mentioning WoG to see if you can get my point here without thinking it's WoG oriented. Fingers crossed, this time it'll work! <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "10:40 PM - Sep 05, 2011",
      "content": "<div>I've played servers that provide item enhancements like crit immune, harm immune &amp; Level 40 IGMS: OnHit gloves, +100 damage arrows/bolts/bullets (just to name a few) with SRs &amp; Saves on hostiles that essentially makes clerics and any other spell-reliant class (and PM of course) completely worthless and AC &amp; DR skins that rival even the highest AB/damage hitters. <br/>\n<br/>\nNo.  I've never played on Brazilian servers and probably never will.<br/>\n<br/>\nMy point is... that until one learns the ropes, one must assume build accommodations that are universal and then adjust according to the environment-specific conditions.  Unfortunately, you will need to keep making the same environment-dependent item-dependant comments on all my builds because I design mundane builds not server-specific ones based on procuring certain items.  Interpret that as you like. It is what it is.  I ignore all builds that publish stats based on hypothetical item enhancements because to find a comparison point I need to do even more math.  I do enough as it stands.<br/>\n<br/>\nLets's please take this discussion to PM, please, because it has strayed too far out of hand to add anything at all to the discussion of the build dynamics. Deal?</div>"
    }
  ]
}