{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "782",
  "name": "Pimp My Ranger!",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pimp-my-ranger-t2355222.html",
  "author": "grizzled_dwarflord",
  "avatar": "10758933_1548854436.jpg",
  "replies": "12",
  "views": "1.0K",
  "posts": [
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "6:24 AM - Oct 30, 2019",
      "content": "<div>Cheers my lads!  Looking for suggestions to optimize this Ranger.<br/>\n<strong> </strong><br/>\n<strong>The Warden Vindicator<em> (Ehlonna’s Retribution)</em></strong><br/>\n<em>Race:</em> Human (other races work but incur xp penalties)<br/>\n<em>Alignment:</em> Any <br/>\n<em>Classes:</em> Ranger32/Fighter4/Rogue4<br/>\n<em>Playable:</em> 1-40, PvM, Low to Mid Magic<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Attributes</span></strong><br/>\nStr16 (30)<br/>\nInt10<br/>\nWis14<br/>\nCon14<br/>\nDex14<br/>\nChr8<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Level Guide</span></strong><br/>\n1 Ranger1, Power Attack, Cleave, FE I<br/>\n2 Ranger2<br/>\n3 Ranger3, Knockdown<br/>\n4 Ranger4, Str17<br/>\n5 Ranger5, FE II<br/>\n6 Ranger6, Weapon Focus: Battle Axe<br/>\n7 Ranger7<br/>\n8 Ranger8, Str18<br/>\n9 Ranger9, Blindfighting<br/>\n10 Ranger10, FE III<br/>\n11 Ranger11<br/>\n12 Ranger12, Improved Crit: Battle Axe, Str19<br/>\n13 Ranger13<br/>\n14 Ranger14<br/>\n15 Ranger15, Toughness, FE IV<br/>\n16 Ranger16, Str20<br/>\n17 Ranger17<br/>\n18 Ranger18, Great Cleave<br/>\n19 Ranger19<br/>\n20 Ranger20, Str21, FE V<br/>\n21 Ranger21, Great Str I<br/>\n22 Rogue1<br/>\n23 Ranger22<br/>\n24 Ranger23, Bane of Enemies, Great Str II, Str24<br/>\n25 Ftr1, Overwhelming Crit: Battle Axe<br/>\n26 Ranger24<br/>\n27 Rogue2, Great Str III<br/>\n28 Ftr2, Devastating Crit: Battle Axe, Str26<br/>\n29 Ranger25, FE VI<br/>\n30 Ranger26, Epic Weapon Focus, Great Str IV<br/>\n31 Ftr3<br/>\n32 Rogue3, Str28<br/>\n33 Ftr4, Weapons Spec, Epic Weapon Spec.<br/>\n34 Ranger27<br/>\n35 Ranger28<br/>\n36 Ranger29, Epic Prowess, Armor Skin, Str29<br/>\n37 Rogue4<br/>\n38 Ranger30, FE, VII<br/>\n39 Ranger31, Epic Will<br/>\n40 Ranger32, FE VIII, Str30<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Combat Vitals</span></strong><br/>\nAB: 44/39/34/29<br/>\nNaked AC: 22<br/>\nMundane Armor/ Shield: 32<br/>\nBase Max HP: 504<br/>\nDev Crit DC: 40 (<em>46 max</em>)<br/>\nBane AB w/Aid &amp; Blade Thirst: 50/45/40/35<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Saves</span></strong><br/>\nFort: 24<br/>\nWill: 22<br/>\nReflex: 18<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Total Skill Points</span></strong>: 300<br/>\nAnimal Empathy - 24<br/>\nHide - 40 <br/>\nMove Silently - 43 <br/>\nSet Trap – 43<br/>\nCraft Trap - 15 (this might need tweaking)<br/>\nTumble - 40<br/>\nUMD - 30<br/>\nDisable Trap - 28<br/>\nSearch - 17<br/>\nSpot<br/>\nOpen Lock – 10<br/>\nSpot - 1<br/>\nHeal - 1<br/>\n <br/>\n<strong>Preferred FEs</strong>: Reptilian Humanoids, Goblinoids, Giants, Undead, Outsiders, Drow, Humans, Elementals<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Ranger Spell Set</span></strong><br/>\n1<sup>st</sup>: Ultravision, Camouflage (lasts forever), 2 Summons (for Bigby Bait)<br/>\n2<sup>nd</sup>: Cat’s Grace, One with Land, Protection from Elements<br/>\n3<sup>rd</sup>: Blade Thirst (works on all weapons up to +5 enhancement), Aid, Greater Magic Fang<br/>\n4<sup>th</sup>: Freedom, Summons IV (x2) for Ikes Yikes sponging<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Strengths</span></strong><br/>\n·       Strong offensive output; attains Bane of Enemies and Dev Crit by Level 28 and EWS by Level 33<br/>\n·       Evasion<br/>\n·       Use Magic Device <br/>\n·       Versatile Enough to use Hide Armor and Tower Shield (<em>doesn’t have to wait on Heavy Armor proficiency</em>)<br/>\n·       Stealth Skills augmented by Camouflage and One with Land<br/>\n·       Knockdown for Casters<br/>\n·       Great Skill Set<br/>\n·       Undispellable Ranger Spells<br/>\n·       8 Favored Enemies<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Weaknesses</span></strong><br/>\nMediocre AC<br/>\nLowish Saves (augmented with Evasion, Freedom, Aid, and Protection from Elements)<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Commentary</span></strong><br/>\nI checked the old archives and didn’t see a Build with this set-up, but I’m not sure where to check for newer entries, so if I missed it please forgive me and the Moderators may remove this entry.  I wanted a Ranger that had both Dev Crit and Bane early on in Epic.  On WoG, Rangers receive 6 skill points per level, so it liberates Rangers from having to go for the inevitable 14 Intelligence.  Having this freedom allows the Ranger to actually focus on more rangerly pursuits.<br/>\n <br/>\nIt’s been awhile since I dipped my foot into the pool of actual building, but I’ve been itching to play Rangers again.  What I have forgotten is that Rangers mustn’t be played in the same vein as normal melee builds.  They must be played like an assassin.  You camo up, you stalk your prey and then strike!  It also pays to go after your FE’s.  Don’t go running off to the Steading of the Hill Giant Chief if you haven’t acquired your FE Giants yet, and so on.  Craft traps, recover traps, find traps, and use them to disable your prey.  Use your Panther Companion as a secondary assault when you spring your trap.  Engage your opponent head on then call your panther (Cat Graced, Greater Fanged, Flame Berried, and Stone-skinned using Gargoyle Boots) and have him deal devastating flanking sneaks while you knock your opponent down.<br/>\n <br/>\nThe Dev Crit is an insurance policy.  This will help clear out the mobs and allow you to focus on the things that matter.<br/>\n <br/>\nIn playtesting from the ground up, I never bothered to dualwield.  I used Chain Shirt and supplement my Dex to make up for any AC shortfalls (Chain Shirt grants 4 AC, and you can supplement another 4 AC if you get you Dexterity up to 18, which is relatively easy to do with your base 14 Dex and Cat’s Grace.  I also supplemented AC with a Tower Shield.  He is also able to effective stealth in medium/light armor &amp; shield by augmenting his natural Stealth skills with Camouflage and One with Land.<br/>\n <br/>\nBattle Axe was chosen for style, but one could choose from any of the one-handed martial/simple weapons. </div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:44 AM - Oct 30, 2019",
      "content": "<div><blockquote><div><cite>grizzled_dwarflord wrote: <div class=\"responsive-hide\">Oct 30, 2019</div></cite>Cheers my lads!  Looking for suggestions to optimize this Ranger.<br/>\n<strong> </strong></div></blockquote>\nHello GDL! It is a delight to see a build made by you again!<br/>\nI like this build! It has an enormous amount packed into it. And your lore/naming is always bloody awesome. <br/>\n<br/>\nThere are some small tweaks I would suggest, with the proviso I haven't played a lot of ranger, and a lot of it is based on personal preference!<br/>\n<details><summary>Spoiler</summary>Pre-epic feats\n\nSkills\n\nSearching for newer builds since the old archives\n</details>\nHope to see more of you!</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:49 PM - Oct 30, 2019",
      "content": "<div>Wow!<br/>\n<br/>\nGD!!!!!<br/>\n<br/>\nBe still, my palpitating heart!<br/>\n<br/>\nWhat about Assassin instead of Rogue?  There is some good synergy there - although evil.<br/>\n<br/>\nI want to draw your attention to something I noticed about Rangers (Animal Companions) :<br/>\n<br/>\nBadger<br/>\n<table class=\"post_content_table\"><tbody><tr><td>30</td>\n<td>1d10/1d10/2d8</td>\n<td>+3</td>\n<td>+3</td>\n<td>20/+1 </td>\n</tr>\n<tr><td>35</td>\n<td>1d12/1d12/2d10</td>\n<td>+4</td>\n<td>+4</td>\n<td>20/+2 </td>\n</tr>\n<tr><td>40</td>\n<td>2d8/2d8/2d12</td>\n<td>+5</td>\n<td>+5</td>\n<td>20/+3 </td>\n</tr>\n</tbody></table>\n\nNow, I did not know this little \"tidbit\" of info, and I have been playing Rangers since NWN was released!<br/>\n<br/>\nCombined with a certain item for Animal Companions on WoG, that as revealed by DM Wise adds Regeneration as well as elemental damage to an Animal Companion, and WOW!<br/>\n<br/>\nYou have an Animal Companion that can Greater Rage (at max amount due to the Ranger levels here) PLUS the best DR PLUS Regen (+5 Regen??!!  Holy crud!!!! O_o ) AND then add in the Regen from the item AND then give your Badger an item that also adds Regen...the mind boggles at this!<br/>\n<br/>\n+7~8 Regen a round, combined with some pretty nice DR...THIS is EPIC!<br/>\n<br/>\nWouldn't it be worth somehow getting to level 35 Ranger, just for this?  That would still leave you the 4 Fighter levels for the WS, etc, and 1 level over for perhaps SD1?<br/>\n<br/>\nBTW - this has me drooling...gotta go out and test this!</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "7:54 PM - Oct 30, 2019",
      "content": "<div>Lol, don't crash...or die.. Unless you have tons of extra gear lying around.. <br/>\n<br/>\nSent from my SM-N900P using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:18 PM - Oct 30, 2019",
      "content": "<div>I can't offer much here, GDL, but as far as the skills go, try to get UMD to a modified 33 - so another 4 points should see you right. Afraid I can't recall the way the DTrap/Set Trap synergy works atm, but it shouldn't be hard for someone of your capabilities to find out (there's probably something in the Game Guides section). Builds without either Spot or Listen (alright, you take 1 point in Spot) make me twitch a bit, but it's hard to see what to sacrifice.<br/>\n<br/>\nOn the feats: was there a particular reason for delaying WF until level 6? If not, I might think of taking it at 1, along with PA, then Cleave at 3 and KD at 6, so you've got some AB behind you when you attempt to floor someone.<br/>\n<br/>\nEver so 'umble thoughts from a big fan of your work (especially the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/hearth-guard-fighter-8-cot10-dwarven-defender-22-t2354692.html\" rel=\"noreferrer\" target=\"_blank\">Hearth Guard</a>)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:37 PM - Oct 30, 2019",
      "content": "<div>Changing the topic to favourite GDL builds, my favourite GDL build is <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build303254.html\" rel=\"noreferrer\" target=\"_blank\">The Charnel Lord</a> for sure!<br/>\n<br/>\nI need to find time to play it!</div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "2:10 AM - Oct 31, 2019",
      "content": "<div>A couple things regarding the DwarfLord's build. I do agree with Stag about taking the weapon focus at level 1, but I'd further also make the switch and push knockdown later than level 3..I'd put it at level 6. I don't feel like I\"m really ever succeeding at knocking anyone down at lower levels...Additionally I'd replace toughness with Improved Knockdown. I'm one who likes to skate by with less hp...so of course this is just a minor tweak that COULD be done. I also acknowledge that in a lot of environments knockdown becomes less important as more and more bosses have immunity items and/or high disciplines.<br/>\n<br/>\nI still love how GDL refers to one of the favored enemies as \"Drow\"....<br/>\n<br/>\n:)<br/>\n<br/>\nEdit: Woops...sorry Orion...Didn't notice your spoiler suggestions....err...what he said!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:57 PM - Oct 31, 2019",
      "content": "<div>Here we go, I've found the trapping guide. It's probably more info than you need, and if it's for WoG there may be differences. Equally, I don't know if EE has modified it at all. But afaik it is correct at time of going to press. Enjoy!<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/unravelling-the-world-of-nwn-traps-a-primer-t2176824.html\" rel=\"noreferrer\" target=\"_blank\">Traps - A Primer</a></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "4:01 PM - Oct 31, 2019",
      "content": "<div>Thanks for the suggestions, everyone.  I realize I hung up my cleats years ago, but I still play from time to time and I still build a bit, but it’s mostly off the record kind of stuff.  This has been my first attempt at a formalized build since my Ruinous Devastation.<br/>\n <br/>\n@Orion: Regarding taking Weapon Focus earlier – a few others mentioned this as well, and that’s sound advice.  However, I did have a reason for taking it later.  In fact, I was actually considering pushing it back even further (around 9<sup>th</sup>) and I’ll explain why.  I hate to be married to a particular weapon early on.  I tend to let the rhythm of the environment dictate what I’ll choose.  On Greyhawk, some of the best weapons in game are ones that are dynamically created in a rare random drop.  I’ve always hated taking weapon focus in something early on only to find an amazing “x weapon” that could have carried me into Epics.  Often times such weapons don’t even bear an Enhancement value, but Rangers can compensate with their versatile Blade Thirst.  But yes, if I were married to a weapon early on, I would take Weapon Focus at Level 3 and not Level 6<br/>\n <br/>\nRegarding Epic Will vs Anything Else – yes, in my original Half-Orc version (before settling on Human), I had Epic Skill Focus: Craft Trap.  The DC for Epic traps is 55 (iirc).  I then waffled on whether this really had long term value since I wouldn’t achieve it until the twilight of the character’s career.  Of course, one could argue that there is diminishing returns for Epic Will at Level 39, or any feat for that matter, but something must be chosen.  I don’t believe there’s much value other than an Epic Save feat, or an Epic Skill Focus, at Level 39.  You may talk me into going the Epic Skill Focus route, though that will require me to put more points into Craft Trap in order to get close to that 55 DC.  <br/>\n <br/>\nTo facilitate such, I most likely would drop Con to 12 and bump Int to 12, but I do like having the raw 500 hp Ranger.  He is low on defense, so he has to make up for it somewhere.  Or, I could re-allocate my current skill point distribution.  Looking at what I have listed, there isn’t anything I would care to make lower.  One could argue Animal Empathy, but I make good use of this pre-epic, particularly between Level 5-15 when I can lock down Dire Bears and Ancient Dire Bears.  And while your suggestion on lowering Dex to 12 is worth consideration, bear in mind I don’t plan on wearing Heavy Armor for a very long time, if ever, and on WoG AC matters, especially pre-epic.  Surprisingly, there are ways to make up for this on the back end by way of items.  There are ways to acquire or even craft your own items to make up for Skill score shortfalls.  For instance, with a mediocre socket item, one could gradually make an item that added skill bonus to Craft Trap, Set Trap, and Disable Trap.  It might take a while, but it would be a side project that your character would work on over the course of their career.<br/>\n <br/>\n@Webshaman:  I didn’t know that about the Badger either!  That’s good to know.  Now I want to get in there and see what the other animals have under the hood.  I’ve always enjoyed using the Panther.  If used properly, it’s a great damage delivery system.<br/>\n <br/>\n@Stagmeister, see the above regarding my thoughts on the Weapon Focus feat.  Also, regarding Cleave, I find having Cleave at Level 1 and 2 far more valuable than Weapon Focus.  It’s a quasi-extra attack, which is far more useful at low levels when you only have one.  Unless I don’t have a choice, I typically grab Cleave early on when the design calls for it, and I always regret not having it when I choose WF instead.<br/>\n <br/>\nAlso, regarding your suggestion for a 33 UMD, I was actually considering dropping UMD to 26.  Anything that I want to UMD I can effectively do with a modified score of 25.  Unless you have a compelling reason to take it higher, I’ll probably reduce it and bump Craft Trap up few notches.<br/>\n <br/>\n@gkorjax:  I am unable to attain IKD in this build.  One needs a raw 13 Intelligence.  If I could, I would, your right, but alas it is not meant to be.  KD is enough for most medium-sized casters.<br/>\n <br/>\nFinally, someone mentioned taking Assassin over Rogue.  That is a viable option if one is interested in using a Different Race – Dwarf comes to mind in that situation.  In so doing, you would lose Evasion and about 16 skill points, and you would have to lock in on an evil alignment.  The benefit would be the Use Poison feat, which I do like, and poison has a bit more teeth on WoG than regular environments.  <br/>\n <br/>\nThank you, everyone.  You certainly have given me much to consider.  I think you all hit on those areas on which I remain undecided.  Admittedly this is not a supreme wipe-the-floor-with-the-carcasses-of-your-enemies type of build, but it certainly has enough versatility to deal with most situations.  I think bringing the Craft Trap score up to around 40, and swapping Epic Will with ESF: Craft Trap, are worthy.  In so doing, I would probably take the ESF much earlier (but not at the expense of BoE or Dev Crit progression) in order to get earlier access to some of these trap creations.  In so doing, I’ll probably drop Constitution to 12 and raise Intelligence to 12.  This will garner about 8 skill points per level, and give the player a bit more flexibility with Skill Point allocation.  <br/>\n <br/>\nThanks again!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:29 PM - Oct 31, 2019",
      "content": "<div>Perhaps I'm a bit late for this now. I like your build. And there are many good suggestions.  <br/>\nI don't know the special features on WoG, but I understand that AC plays a vital part in builds there.<br/>\nI guess that dex 14 is there so you can buff dex, add dex items and be able to wear light armor for stealth and dual wielding.<br/>\nThe weapon choice bothers me some, though I understand that you don't want to be married to a specific weapon type. Battle axe is a good one hander. But with this build type you want a small or tiny weapon for dual wielding and preferably a better threat range for dev crit.<br/>\nWith all the damage bonus vs FE, from strength  and from EWS, the nominal weapon damage of a smaller weapon means less.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:33 PM - Oct 31, 2019",
      "content": "<div><blockquote><div><cite>gkorjax wrote: <div class=\"responsive-hide\">Oct 30, 2019</div></cite>Lol, don't crash...or die.. Unless you have tons of extra gear lying around.. <br/>\n<br/>\nSent from my SM-N900P using Tapatalk</div></blockquote>\nI mean...I normally \"feed\" my Magic Electrifier anything of +3 and less to power up my other items...assuming UMD/Wizzie.  So why not \"feed\" them to the Companion, instead?</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:02 PM - Oct 31, 2019",
      "content": "<div><blockquote><div><cite>grizzled_dwarflord wrote: <div class=\"responsive-hide\">Oct 31, 2019</div></cite>@Webshaman:  I didn’t know that about the Badger either!  That’s good to know.  Now I want to get in there and see what the other animals have under the hood.  I’ve always enjoyed using the Panther.  If used properly, it’s a great damage delivery system.<br/>\n <br/>\nFinally, someone mentioned taking Assassin over Rogue.  That is a viable option if one is interested in using a Different Race – Dwarf comes to mind in that situation.  In so doing, you would lose Evasion and about 16 skill points, and you would have to lock in on an evil alignment.  The benefit would be the Use Poison feat, which I do like, and poison has a bit more teeth on WoG than regular environments.  \n</div></blockquote>\nI looked through all the Animal Companions.<br/>\nOnly the Hawk has DR (should go up to +4/20, but the level 40 entry is bugged) alongside the Badger.<br/>\nAll Animal Companions stop development at level 20, skill wise.  Most stop at level 20 in every other way, with the exception of Enhancement bonus to attacks.<br/>\nFor example, the Panther, which is my favorite of the Animal Companions (well, used to be, until I discovered the \"hidden\" bonuses of the Badger), it's Sneak damage stops at 10d6 at level 20.<br/>\nWhich, if you ask me, really seems odd as it does continue to level all the way up to level 40 - so as a Rogue it should have the same Sneak damage IMO (and would really go a long way to making it \"good\" at high level).<br/>\nAnd it was me who suggested Assassin.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:38 PM - Oct 31, 2019",
      "content": "<div>Hi GDL thanks for considering the feedback! <br/>\n<br/>\nJust with craft trap, the NWN Wiki states epic traps cannot be crafted (<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Craft_trap\" rel=\"noreferrer\" target=\"_blank\">https://nwn.fandom.com/wiki/Craft_trap</a>), its why I chose the modified 34 target for deadly electrical traps which do 30d6 damage to up to 7 enemies in a 15 foot radius. There are certain items that can increase craft trap skills for example gloves of the artificer, items which increase intelligence, luck stone ?amulet of the master so one could get away with a lower score I think<br/>\n<br/>\nAlthough with all this I haven't done a lot of crafting of traps, although I have made a character on WoG who has a modified craft trap 33 and will start muck around with it in the next few weeks (for learning purposes) <br/>\n<br/>\nbut anyway I was wondering (in fact <em>hoping <span class=\"text-emoji\">🙂</span></em>) you knew something I didn't<br/>\n<br/>\nAlso Valerfor has taught me UMD 30 is a good target for WoG to equip items, there are certain boots that require this located in a mine in the desert that I like very much and would grant a bit of versatility to your build, that might be of interest to your character,. having played a few UMD using fighter type builds recently I heartily agree with Valerfor's opinion on this matter<br/>\n<br/>\nBest wishes</div>"
    }
  ]
}