{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "117",
  "name": "Spellsword - EFU request.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/spellsword-efu-request-t2354602.html",
  "author": "Karwelas",
  "avatar": "no_avatar.png",
  "replies": "8",
  "views": "946",
  "posts": [
    {
      "author": "Karwelas",
      "avatar": "no_avatar.png",
      "timestamp": "11:37 AM - Sep 22, 2016",
      "content": "<div><span style=\"color:#ECF3F7\">1) PvM or PvP - Builds that are maximized for PvM are often not maximized for dueling with other PCs.</span><br/>\n<br/>\n Both Pvp and PvM.<br/>\n<br/>\n<span style=\"color:#ECF3F7\">2) Level cap - What is the maximum level that the build (or server) will likely reach?</span><br/>\n<br/>\n Around level 10, probably. It is very low magic/level server.<br/>\n<br/>\n<span style=\"color:#ECF3F7\">3) Race preference - Unless a class demands a specific race or races, Human will be assumed. Otherwise, specify the your favorite.</span><br/>\n<br/>\n Human.<br/>\n<br/>\n<span style=\"color:#ECF3F7\">4) Class preference - Describe which class(es) you have been considering so far and why. Your own concept is key to building what will do the job and be the most fun for you to play.</span><br/>\n<br/>\n<span style=\"color:#ECF3F7\">Sorcerer, spellsword class. There are special subcase feats for this type of character, gonna post them below. No multiclassing if possible, but if you think it will be good idea, feel free. Still one class and not some kind of cleric, barbarian or ranger.<br/>\n<br/>\n 5) Melee preference - A few options to consider are: dual-wielding vs. one-hand with shield, high AC dexterity-based vs. high-damage strength-based, sneak attacks (stealth), taunting, specialized attacks (e.g. whirlwind, knockdown, called shots, sneaks, death attacks... you name it!).<br/>\n<br/>\n No idea, to be honest. Two hand sword, is must, but that is one thing I need. High damage would be great.</span><br/>\n<br/>\n<span style=\"color:#ECF3F7\">6) Range preference - DEX archery or Zen Archery (WIS) <br/>\n<br/>\n No range, except spells.</span><br/>\n<br/>\n<span style=\"color:#ECF3F7\">7) Weapon preference - Which weapon type would you enjoy using the most?<br/>\n<br/>\n Two-hand sword.</span><br/>\n<br/>\n<span style=\"color:#ECF3F7\">8) Maximum item enhancement - In the setting where you intend to play this character, what is the highest enchantment (or bonus) that is likely to be used on equipment?<br/>\n<br/>\n Very, very low. Mostly +1 is considered very nice item. There are buffs, of course. No attributes enchancement, only + 1 to skills.</span><br/>\n<br/>\n<span style=\"color:#ECF3F7\">9) Spellcasting - If you are requesting a build that is likely to use magic, explain its general use. Will it be used primarily to add enhancements to a physical base attack (i.e. for buffing), to cast strong offensive spells or a balance of both areas of expertise? If arcane-based, would you prefer to be able to cast spells reliably while wearing armor? Is indispellability of buffs an important consideration?<br/>\n<br/>\n Buffs, buffs, buffs. Sorcerer buffs. </span><br/>\n<br/>\n<span style=\"color:#ECF3F7\">10) Custom factors - Are there any special conditions that will affect how the build will work where you intend to play it? A PRC server is one example of a custom environment. Many servers have their own modifications to the standard game which will factor into the devising of a solid character build. Also, some community modules set their own rules</span><br/>\n<br/>\n<strong>Spellsword - </strong><span style=\"color:#929D9B\">Uncommonly heard of, and even more rarely practiced, the mages who do combine their magical talent with martial expertise epitomize why this style of combat is often unfounded. Regardless of it's difficulty, a minority of arcanists continue down this path in the pursuit of their own prosperity, offering a unique versatility on the battlefield.</span><br/>\n<br/>\nLevel 1:<span style=\"color:#929D9B\"> Weapon Proficiency (Martial), Weapon Proficiency (Exotic), +1 AB</span><br/>\nLevel 5:<span style=\"color:#929D9B\"> +3 Taunt, +2 Magical Damage on melee &amp; ranged attacks</span><br/>\nLevel 8:<span style=\"color:#929D9B\"> Damage Reduction 5/+1, +1 Dodge AC, AB bonus changed to +2</span><br/>\n<br/>\n<br/>\n<strong>Alignment</strong>: Any <br/>\n<strong>Hit Points</strong>: Max HP rolls up to level 3 and then d4+con modifier per level<br/>\n<strong>Proficiencies</strong>: Armor (none), Weapon (Simple)<br/>\n<strong>Skill Points:</strong> 2+int modifier per level (2+int modifier)*4 at 1st level<br/>\n<strong>Save Progression:</strong> Fort Low, Will High, Ref Low<br/>\n<strong>Attack Bonus:</strong> +1/2 levels <br/>\n<strong>Spellcasting:</strong><span style=\"color:#929D9B\"> </span>Arcane (spell failure from armor is a factor), charisma-based (a base charisma score of 10 + the spell's level is required to cast a spell, bonus spells are based on modified charisma, and the charisma modifier affects spell DCs), and spontaneous cast (no spell preparation required). <br/>\n<br/>\n Custom spells:  <ul><li>Sorcerer/Wizard (Level 0):<ul><li>Necromancy<ul><li>Disrupt Undead: Deal 1d6 positive damage to a single undead creature.</li> </ul></li></ul></li><li>Sorcerer/Wizard (Level 1):<ul><li>Enchantment</li> </ul><ul><li><ul><li>Command: For one round, make a target flee, approach, fall or halt.</li> <li>Nybor's Gentle Reminder: Stun for 1 round, penalties for 1 round/level after.</li> <li>Rouse: Awaken all sleeping creatures in a 10-foot-radius burst.</li> </ul></li><li>Transmutation<ul><li>Jump: Significant bonus to Tumble.</li> </ul></li><li>Evocation<ul><li>Burning Bolt: Fire multiple flaming bolts at an opponent</li> </ul></li><li>Necromancy<ul><li>Chill Touch: Make undead flee. Deal strength and negative energy damage to everyone else.</li> </ul></li></ul></li><li>Sorcerer/Wizard (Level 2):<ul><li>Transmutation<ul><li>Augment Familiar: For 1 round/level, your familiar becomes much more effective in combat.</li> <li>Whispering Wind: Send messages to distant locations of your choice.</li> </ul></li><li>Evocation<ul><li>Scorching Ray: Ranged spell which deals fire damage.</li> </ul></li><li>Abjuration<ul><li>Alarm: For 2 hours/level, set up an invisible alarm which telepathically alerts you when a creature moves into the region.</li> </ul></li><li>Enchantment<ul><li>Masochism: Gain brief, temporary bonuses based on hitpoints lost in any given round</li> </ul></li></ul></li><li>Sorcerer/Wizard (Level 3):<ul><li>Evocation<ul><li>Ice Burst: High radius, relatively low-damage burst of ice damage.</li> </ul></li><li>Conjuration<ul><li>Regroup: Teleport up to 1 willing companion per level to your position from within a limited radius.</li> </ul></li><li>Necromancy<ul><li>Heart Clutch: For as long as you concentrate, and as long as your opponent continues to fail your fortitude saves for up to 1 round per level, continually damage and paralyze the target humanoid.</li> </ul></li></ul></li><li>Sorcerer/Wizard (Level 4):<ul><li>Divination<ul><li>Scrying: For 1 minute/level, spy on any creature in your current area OR any PC within range.</li> <li>Arcane Eye: For 10 minutes/level, create an invisible, mobile sensor which you possess and use for scouting and spying.</li> </ul></li><li>Abjuration<ul><li>Ward Area: Temporarily protect the current area from scrying.</li> <li>Ilyykur's Mantle: You cloak yourself in an aura that gives you a +1 bonus per 3 caster levels (maximum +5) on saving throws against spells and spell like abilities, and you gain electricity resistance 10.</li> <li>Lower Spell Resistance: Lower a single target's spell resistance.</li> </ul></li><li>Evocation<ul><li>Blast of Flame: Unleash a flaming cone which deals up to 10d6 damage to everyone caught within.</li> <li>Acid/Cold/Electric/Fire Orb: Launch an orb of elemental damage against a single target which bypasses spell resistance.</li> </ul></li><li>Transmutation<ul><li>Mass Ultravision: Everyone within the area of effect receives magical sight which is able to pierce even magical darkness.</li> </ul></li></ul></li><li>Sorcerer/Wizard (Level 5):<ul><li>Conjuration<ul><li>Teleport: Teleport yourself and, if desired, a small party to a predetermined location.</li> </ul></li><li>Transmutation:<ul><li>Baleful Polymorph: Turn your victim permanently into a chicken if they fail a -4 fortitude save.</li> </ul></li></ul></li></ul></div>"
    },
    {
      "author": "Karwelas",
      "avatar": "no_avatar.png",
      "timestamp": "11:45 AM - Sep 22, 2016",
      "content": "<div>Uh, and also spell changes if you really want to read that: <a class=\"postlink\" href=\"http://www.efupw.com/forums/forum/information/efu-mechanics/81477-efu-spell-changes\" rel=\"noreferrer\" target=\"_blank\">http://www.efupw.com/forums/forum/infor ... ll-changes</a></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:01 PM - Sep 22, 2016",
      "content": "<div>Hello Karwelas, and welcome to the ECB Guild! Unfortunately, arcanists aren't my speciality (if I could even be thought of as having one), so I'm afraid you might have to wait for one of the great and good to log on - sorry.<br/>\n<br/>\n In the meantime, have a browse around, see if anything grabs you.<br/>\n<br/>\n Good to meet you!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:18 PM - Sep 22, 2016",
      "content": "<div>Welcome to the ECB!  <br/>\n<br/>\n This is our first Level 10 request AFAIK.  Low-magic is my personal favorite because closest to PnP.  Anyhoo...<br/>\n<br/>\n Unless your server has made custom weapon types available, \"two-handed sword\" doesn't exist.  I hope you mean \"Greatsword\" which is a sword held in two hands.  The two-bladed sword would be a bad choice due to the DW AB penalties.  It could be built but would be significantly different and weaker.  I'll leave it up to you to fit the build into your custom subrace scheme.<br/>\n<br/>\n Fighter(2), Sorcerer(8), Any aligned Human<br/>\n<br/>\n STR: 16 (18)<br/>\n DEX: 8<br/>\n CON: 16<br/>\n WIS: 8<br/>\n INT: 12<br/>\n CHA: 14<br/>\n<br/>\n 01: Ftr(1): Blind Fight, WF: Greatsword, Power Attack [PvM] (or Toughness [PvP])<br/>\n 02: Src(1)<br/>\n 03: Src(2): Extend Spell<br/>\n 04: Src(3): STR+1 (17)<br/>\n 05: Src(4)<br/>\n 06: Src(5): Empower Spell<br/>\n 07: Src(6)<br/>\n 08: Src(7): STR+1 (18)<br/>\n 09: Src(8): SkF: Concentration<br/>\n 10: Ftr(2): Cleave [PvM] (or KD [PvP])<br/>\n<br/>\n HP: 82 (max)<br/>\n Saves F/W/R: 8/5/1 (10/7/3 vs. spells)<br/>\n BAB: 6<br/>\n AB (max, naked): 11 (melee), 5 (ranged)<br/>\n AC (naked/mundane armor/shield only): 10/21<br/>\n<br/>\n Skillpoints: 52 - Concentration 13(19), Discipline 13(17), Heal 4(3), Spellcraft 12(13), Tumble 5(4)<br/>\n<br/>\n ----&gt; As was clearly explained on the request form, there is no such build as \"PvM and PvP\".  Pick one and select the corresponding feat.<br/>\n<br/>\n Haven't figured spell choice yet, but Bull STR, Endurance and GMW should figure in prominently, if possible.<br/>\n<br/>\n Gotta run for now.  Good luck on your PW! <img class=\"img-emoji\" src=\"emoji/11.gif\"/><br/>\n<br/>\n  </div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:49 AM - Sep 23, 2016",
      "content": "<div>I know you said no Clerics, but a pure Cleric, or Cleric 9 / Fighter 1 would be a great spellsword. I'd be happy to build you one.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:25 PM - Sep 23, 2016",
      "content": "<div>Does it have to be a sorcerer? <br/>\n Both wizard and bard have greater potential as spellswords at this low level.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:17 PM - Sep 23, 2016",
      "content": "<div>That's exactly what I thought, Mick.  INT-based would result in slightly better saves vs. spells and generally a better skill set.  But, if I am following the subclass restrictions correctly, it can only be a sorcerer or wizard judging by the list of custom spells (though it doesn't specifically declare that up-front).  A bard's song could indeed swing the combat balance favorably with minimum levels.<br/>\n<br/>\n As a die-hard proponent of the wizard class, they have more flexibility preparing for encounters.  But typically, spell scrolls are hard to find and afford within low-magic environments, the easiest domains to balance class-wise.  So I don't know how much advantage a wizard has in that respect.<br/>\n<br/>\n The proverbial sorc/pally synergy leaves the build too feat-starved to develop a reliable spellword in only 10 levels but it really needs serious Discipline dumps or expect to spend much of its career lying on its butt KD'd.<br/>\n<br/>\n But I do like the pre-epic build philosophy: squeeze as much as you can as efficiently as possible into an extremely brief context.  All choices are amplified.</div>"
    },
    {
      "author": "Karwelas",
      "avatar": "no_avatar.png",
      "timestamp": "11:47 PM - Oct 01, 2016",
      "content": "<div>I would be happy to get one to be honest, as I did mistake during my counting thing! Fell free to hit with any wizard ideas! Or that cleric one!<br/>\n<br/>\n EDIT: Wizard scrolls are actually very usable and findable. Not too powerful, but those exist. Healing is sparse of EFU. Dying is easy and you lost over 5000 exp usually, so it mean level down often then once (or two around 10). Never saw player above 10 level.<br/>\n<br/>\n Wizard or Cleric, I don't care at this point.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:52 AM - Oct 02, 2016",
      "content": "<div>Here is the Cleric build. You have lots of options:<br/>\n  - For your domains, Travel gives you haste as a level 5 spell and Trickery gives you Improved Invisibility as a level 5 spell. There are other options, though. Healing empowers (1.5 times normal) all your Cure X Wounds spells and gives you Heal as a level 5 spell, which is good because you will never get level 6 spells. Magic gives you Mage Armor as a level 1 spell, which is useful at low levels in a low magic environment, and Stoneskin as a level 4 spell, which makes you practically invulnerable in such a low-level low-magic environment. Strength gives you the Divine Strength ability, Divine Power as a level 3 spell, and Stoneskin as a level 5 spell.<br/>\n  - For feats, Divine Might, Divine Shield, and Cleave all have Power Attack as prerequisites so you can choose any 2 of those 3. Or, you could replace Power Attack with Luck of Heroes and take Knockdown and either Improved Knockdown or Empower Spell.<br/>\n  - For your weapon, I recommend Warhammer because blunt damage is seldom resisted and it allows you to use a shield for more AC, and it also has a x3 critical hit modifier which is statistically almost identical to the 19-20 critical threat range. If you really have your heart set on a greatsword, or have a special greatsword you plan to use, feel free to focus on that instead, but you won't be able to use a shield, and the extra Strength damage for a 2-handed weapon won't be much because your Strength will not be spectacular like in epic levels.<br/>\n Click on the work Spoiler to see the build:<br/>\nSpoiler [+]<br/>\n<br/>\n Level 10 Spellsword Cleric (Cleric 9 / Fighter 1)<br/>\n Human, Any Alignment<br/>\n Playable 1 - 10<br/>\n<br/>\n Abilities:<br/>\n STR: 14<br/>\n DEX: 10<br/>\n CON: 14<br/>\n WIS: 14 (16)<br/>\n INT: 12<br/>\n CHA: 14<br/>\n<br/>\n Leveling Guide:<br/>\n Human: (Quick to Master)<br/>\n 01: Cleric(1): Blind Fight, Power Attack, Domain Travel, Domain Trickery<br/>\n 02: Fighter(1): Weapon Focus: Warhammer<br/>\n 03: Cleric(2): Extend Spell<br/>\n 04: Cleric(3): WIS+1, (WIS=15)<br/>\n 05: Cleric(4)<br/>\n 06: Cleric(5): Cleave<br/>\n 07: Cleric(6)<br/>\n 08: Cleric(7): WIS+1, (WIS=16)<br/>\n 09: Cleric(8): Divine Might<br/>\n 10: Cleric(9)<br/>\n<br/>\n Stats:<br/>\n Hitpoints: 102<br/>\n Skillpoints: 52<br/>\n Saving Throws (Fortitude/Will/Reflex): 10/9/3<br/>\n Saving Throw bonuses: Spells: +2<br/>\n BAB: 7<br/>\n AB (max, naked): 10 (melee), 7 (ranged)<br/>\n AC (naked/mundane armor/shield only): 11/22<br/>\n Spell Casting: Cleric(5)<br/>\n Alignment Changes: 0<br/>\n<br/>\n Skills:<br/>\n Concentration 13(15), Discipline 5(7), Heal 13(16), Lore 2(3), Spellcraft 9(10), Tumble 5(5)<br/>\n<br/>\n 01: Concentration(4), Heal(4), Spellcraft(4), Save(4)<br/>\n 02: Concentration(1), Discipline(5), Heal(1), Save(1)<br/>\n 03: Concentration(1), Heal(1), Spellcraft(1), Tumble(1)<br/>\n 04: Concentration(1), Heal(1), Tumble(1)<br/>\n 05: Concentration(1), Heal(1), Tumble(1)<br/>\n 06: Concentration(1), Heal(1), Tumble(1)<br/>\n 07: Concentration(1), Heal(1), Tumble(1)<br/>\n 08: Concentration(1), Heal(1), Spellcraft(2)<br/>\n 09: Concentration(1), Heal(1), Spellcraft(2)<br/>\n 10: Concentration(1), Heal(1), Lore(2)</div>",
      "author-color": "#00AA00"
    }
  ]
}