{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "000",
  "name": "A Complete Guide to the Basics of Character Building",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/a-complete-guide-to-the-basics-of-character-buildi-t515440.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": 6,
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:49 PM - Sep 03, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hail, members of the ECB! I thought I would pitch in a little of the knowledge I gained from you guys.<br/>\n<br/>\n In my experience, being in the ECB requires, beyond above average intelligence, a significant amount of pre-existing knowledge for a member to be able to understand what to many of you may seem obvious. I have suffered from this in the past, like when I posted a DEX Ranger, and I didn't even know what Epic Dodge was. I didn't play online until very recently, so I had nobody to discuss ideas with and to learn from, like Avado learned from Stryder. This mini-article is aimed at the beginners, newbies that do not understand what is relevant and what is not, what works and what does not, which classes have best synergies, and which ones do not work well together. It is a thorough guide that will hopefully diminish the existing gap of knowledge between the elders of the guild and the newcomers.<br/>\n<br/>\n As a general rule, I will try to divide the process into steps, but at any given point, you may realize that something doesn't work like you wanted it to, or even have a better idea that will require you to change something in the previous steps. If that is the case, don't be afraid to do so, the entire build should be revisited and revised multiple times, even after you consider it's ready. Experimenting is the best way to learn. If during the process, a question that you don't know the answer to pops up, go to <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Main_Page\" rel=\"noreferrer\" target=\"_blank\">NWN WIKI</a> to find the answer (name is also a link). It's the most reliable source of information you'll find. Now let's get to it!<br/>\n<br/>\n<strong>1- COMING UP WITH A CHARACTER CONCEPT:</strong><br/>\n<br/>\n The first thing you wanna do when building a character is come up with a character concept, and it may come in many ways. If you are a more RP-oriented player, then perhaps you'll have an idea for a character you'd like to roleplay. If you are an action player, perhaps there is a new class combo you want to explore, or if you are like me, BOTH! One thing is for certain: if you are truly an Epic Character Builder, you want to POWERBUILD! That means creating a well thought and maximized build according to your needs, however, there is no UBER MONSTER DO-IT-ALL build, they all have strengths and weaknesses, which you need to work on (maximizing their strengths and diminishing weaknesses) both with your choices when building and with your items in game. In other words, you need to know what you're looking for and how to get there. It's not as easy as it sounds, trust me.<br/>\n<br/>\n So now that you've defined what you want to play (FOR EXAMPLE: I want to RP an elven barbarian / I want to explore the synergies between Clerics and Monks), what's next? Next you need to understand that, building for level 40, there is no case in which a character won't benefit from having a second class. A Fighter / Weapon Master is much stronger than a Fighter, a Ranger / Rogue is much stronger than a Ranger, etc.. You get the point.<br/>\n<br/>\n Anyway, now that you've chosen your second class, what's next? Similarly to the prior statement, there are VERY FEW CASES in which a character won't benefit from having a third class. That happens because of skill dumps (this means that if you take 10 levels of Fighter and then 1 of Rogue, as long as you have enough skill points, you can raise your skills as high as those of a Rogue 11), complementary class features and sometimes requirements for Epic Feats. FOR EXAMPLE: A Cleric / Monk is very strong if made a DEX build, because Monks add WIS to AC when not wearing armor / shield, and Clerics' casting is divine, which is WISDOM-based. Also, the Cleric has many AB (Attack Bonus) and damage buffs (Divine Power, Divine Favor, Darkfire, Greater Magic Weapon, etc...) and can buff Wisdom as well, so being a DEX-based character doesn't mean you won't do damage, but you will still have a high AC.<br/>\n<br/>\n Now any DEX build will benefit GREATLY from having Epic Dodge. As all the elders know, Epic Dodge requires Tumble 30+, DEX 25+, Improved Evasion and Defensive Roll. They also know Monks get Improved Evasion at level 9 and Tumble as a class skill. Now that only leaves Defensive Roll. There are 2 classes that get it: Rogue and Shadowdancer. Rogue gets UMD and Sneak Attack, which are nice, but you need at least 10 levels to have access to Defensive Roll, and that will hurt your casting ability and make you dispellable. Plus, many of the Rogue's Skills are also Monk skills, and there is XP penalty involved because these are 3 base classes. Shadowdancer, on the other hand, gives you Defensive Roll at level 5, and also has HiPS (Hide in Plain Sight, which allows you to hide after attacking a creature), which is VERY USEFUL for any DEX-based character that has Hide, Move Silently.<br/>\n<br/>\n I have actually posted a build using this class combo, and I'll use it as reference throughout this article, so here's the link: <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515430/\" rel=\"noreferrer\" target=\"_blank\">The Shadow Priest</a><br/>\n<br/>\n As you can see, there's a lot of thinking involved in building characters. Hope you're up for the challenge!<br/>\n<br/>\n<strong>2- DEFINING THE OPTIMAL SPREAD:</strong><br/>\n<br/>\n This is where its starts to get tricky. The character spread (A.K.A. split) is the number of levels of each class you take throughout the build. In \"The Shadow Priest\", it's Cleric (26) / Monk (9) / Shadowdancer (5). I recently saw a posted build by one of the newcomers in the Build Request forums which was Bard (16) / Blackguard (6) / Pale Master (18). Bard 16 gives you a great Bard Song, so that's OK, but Blackguard 6 gives you nothing (you could end at BG 4 and have EXACTLY the same things) and neither does PM 18. So, if he had created a Bard (16) / BG (4) / PM (20), he would have 1 more Bonus Feat and +2 AC from PM, so you can say that his build didn't use an optimal spread. This is a VERY IMPORTANT concept to grasp. Building a powerful toon revolves around spread optimization, as well as other factors.<br/>\n<br/>\n Generally, when you are defining the spread, you want to end up in levels that give you something in return (bonus feats, mostly, either automatically or to choose from a list). The Shadow Priest is the perfect example of optimization. Cleric 26 gives you a bonus feat, Monk 9 gives Improved Evasion (requirement for Epic Dodge) and Shadowdancer 5 gives Defensive Roll (also a requirement for Epic Dodge). I could've gone Cleric 25 Monk 10 SD 5, or Cleric 24 Monk 11 SD 5, or any other spread that achieved what I wanted, but the one I went with is the one that gets THE MOST benefits, as I will explain later on.<br/>\n<br/>\n It's important to try to maximize your gains by trying to end on a specific level that gives you something. As an example of that, Weapon Master 30 is the same as Weapon Master 28, because those last two Weapon Master levels don't give you ANYTHING. So a Fighter 10 / Weapon Master 30 is weaker than a Fighter 12 Weapon Master 28, because the latter gets one extra feat with fighter 12 while losing nothing from the Weapon Master side. Similarly, the same Fighter 12 Weapon master 28 is weaker than a Fighter 12 / Weapon Master 25 / Rogue 3 because the latter gets Evasion, Uncanny Dodge, 2d6 Sneak Attack damage, Tumble AC, UMD (Use Magic Device), while losing 1 AB and 1 Epic Toughness feat (The last Weapon Master Bonus Feat leaves you nothing to choose from).<br/>\n<br/>\n Optimizing a build means trying to attain the best possible benefits from that class combo according to your concept. Another common term that you should get used to in building is PRE-EPIC SPREAD, which is the number of levels of each class you will take from level 1 to level 20 (In \"The Shadow Priest\" it's Cleric 16 / Monk 4). To define both your level 40 and your pre-epic spread, you need to take many things under consideration. Here's a rough list:<br/>\n<br/>\n<strong>- BAB (Base Attack Bonus) PROGRESSION</strong>: This is the rate at which your character gains AB (Attack Bonus). For the first 20 levels, it is class-related, meaning that the number of AB points you will gain depends on which class you choose. This will affect the number of attacks per round that your character will have, as I'll explain below. From level 21 to level 40, your BAB progresses at a rate of 1 point every two character levels, regardless of class (you gain 1 point of BAB every odd level: 21, 23, 25 etc..). For the first 20 levels, there are 3 different BAB progressions, which for the sake of simplicity I'll refer to as good, average and bad:<br/>\n<br/>\n      - Good: 1 BAB per level. The classes that get this progression get 4 attacks per round at level 20, each attack at -5 from the previous one. Here's a list of the classes that have this progression: Arcane Archer, Barbarian, Blackguard, Champion of Torm, Dwarven Defender, Fighter, Paladin, Purple Dragon Knight, Ranger, Weapon Master.<br/>\n<br/>\n      - Average: +3/4 BAB per level (This means that every 4 levels you take in that class, you gain 3 points of BAB distributed as follows: level 1 = +0, levels 2, 3 and 4 = +1 each). The classes that get this progression will have 3 attacks per round at level 20, each at -5 from the previous one. Here's a list of the classes that have this progression: Assassin, Bard, Cleric, Druid, Harper Scout, Monk*, Red Dragon Disciple, Rogue, Shadowdancer, Shifter.<br/>\n<br/>\n * Monks have a singular AB progression when they're unarmed or wielding a Kama, but since it's so different from the general rule, it's best left for later (or never hehe).<br/>\n<br/>\n      - Bad: +1/2 BAB per level (This means that every 2 levels you take in that class, you gain 1 point of BAB distributed as follows: odd levels = +0, even levels = +1 each). The classes that get this progression will have 2 attacks per round at level 20, each at -5 from the previous one. Here's a list of the classes that have this progression: Pale Master, Sorcerer, Wizard.<br/>\n<br/>\n Now as a general rule, once you've decided your final spread, in terms of AB you want to fit as many levels of the class(es) that have the best BAB progression as you can without hurting your spread before level 20. By combining classes in the first 20 levels you'll get a different number of attacks per round.<br/>\n<br/>\n The MAXIMUM PRE-EPIC BAB IS 20. You get that if you only take classes with a good BAB progression until level 20. Similarly, the MINIMUM PRE-EPIC BAB IS 10. In terms of attacks per round, they are defined by your pre-epic BAB. Once you are level 21+, your BAB will continue to grow, but you won't get any extra attacks per round. Here's a table of how it works (level 20 numbers):<br/>\n<br/>\n      -PRE-EPIC BAB 10 = 2 attacks per round <br/>\n      -PRE-EPIC BAB BETWEEN 11 AND 15 = 3 attacks per round<br/>\n      -PRE-EPIC BAB BETWEEN 16 AND 20 = 4 attacks per round<br/>\n<br/>\n A common rule that you should know about when using +3/4 level BAB classes is the RULE OF 4, which means that these classes should be taken in multiples of 4 to maximize BAB acquisition over the first 20 levels. As an example, a Bard/RDD combo can have 14 pre-epic BAB if you take Bard 13 RDD 7, and 15 pre-epic BAB by going Bard 12 RDD 8 from levels 1-20. A more radical example would be going Cleric 13 Monk 6 SD 1 pre-epic in my Shadow Priest build, which would mean 13 pre-epic BAB, instead of the 15 attained by Cleric 16 Monk 4, or if I wanted to get earlier HiPS, I could've gone with Cleric 12 Monk 4 SD 4 and still maintain 15 pre-epic BAB.<br/>\n<br/>\n In \"The Shadow Priest\" build, the number of levels of each class doesn't matter much, as long as you respect the RULE OF 4, since all three classes have the same progression, so there is no class that should be prioritized here for a higher BAB. But on a Fighter 12 / Weapon Master 25 / Rogue 3, it's best you avoid taking the first Rogue until after level 20, lest you lose 1 AB for nothing.<br/>\n<br/>\n However, this is not the only thing to take under consideration. On another build with the same classes, but a different approach, say a Fighter 14 / Weapon Master 7 / Rogue 19, DEX-based with Epic Dodge and Self Concealment 5. You can go Fighter 9, Weapon Master 7, Rogue 4 pre-epic and lose only 1 BAB, saving up Fighter Bonus Feats to take important feats on epic levels. Like I said, this is only one of the many factors that need to be taken into account when defining your pre-epic spread and level 40 spread and in that situation, the Epic Bonus feats are more important than +1 BAB in achieving what the build aims for. <br/>\n<br/>\n<strong>- SAVING THROWS (A.K.A. Saves: Fortitude, Reflex, Will): </strong>Similarly to the BAB progression, the saves also stack up during the first 20 levels and then grow constantly from levels 21 to 40. Each class has 1 or 2 Primary saves (Monks have 3 lol), which grow at a higher rate than the other ones, and generally a weak save too, which will grow very slowly. If you've understood the mechanism behind the BAB progression, it's the same logic, only applied to saves.<br/>\n<br/>\n If that's still not enough for ya, here's the link to a full explanation at NWN WIKI: <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Base_save\" rel=\"noreferrer\" target=\"_blank\">Base Save</a> <br/>\n<br/>\n Personally, I have never given much attention to the saves progression, but it can be useful as a tie breaker if you're undecided on your pre-epic spread.<br/>\n<br/>\n<strong>- SKILLS AND FEATS:</strong> You have to decide which skills and feats you want to have, check the requirements to try to define the MINIMUM number of levels of each class you need. If you want Divine Shield on a build that has Paladin, for example, you need at least 3 levels of Paladin, because it requires Turn Undead, which Paladins only get at level 3. Many classes gain bonus feats as they advance in levels, with Monk being the most remarkable one.<br/>\n<br/>\n \"At level 1, they get Cleave, Evasion, Improved Unarmed Strike, Monk AC bonus, Flurry of Blows, Stunning Fist; at level 2 Deflect Arrows; at 3 Monk Speed and Still Mind; at 5 Purity of Body; at 6 Knockdown and Improved Knockdown; at 7 Wholeness of Body; at 9 Improved Evasion, so on and so forth, all the way to 20th level\"<br/>\n<br/>\n Some of these feats aren't really that useful, like Still Mind and Wholeness of Body, others, such as Improved Evasion, KD / IKD, etc.. are AWESOME! You have to decide what you're going for and then define the minimum level for that class, and do the same for each of the 3 classes. This sounds a lot easier than it actually is.<br/>\n<br/>\n I commonly see novice builders going for Improved Evasion on high-reflex builds. Although IE is commonly known as a very good feat, if you aren't going to get Epic Dodge, a high-reflex build is where it's least useful, because what it does is make you take half damage even when you fail the save. How often does a high-reflex build fail a reflex save?<br/>\n<br/>\n In \"The Shadow Priest \" build, I wanted Improved Evasion because it's a requirement for Epic Dodge, so 9 Levels of Monk was enough. Same thinking with the Shadowdancer, I wanted Defensive Roll, so 5 levels were all I needed. As for the Cleric, I wanted undispellability and all the spells, so I needed 24 Levels at the very least. So there were 2 extra levels. What to do with them? The answer is simple: PRIORITIZE. In this case, Monk 10 or 11 would give me +1 AC (at Monk 10), Shadowdancer 6 or 7 would give me nothing, and Cleric 26 would give me 1 Epic Bonus feat and more caster levels, plus, since I took Great Wisdom with it, reaching 20, it also gave me +1 AC. Easy choice: Cleric.<br/>\n<br/>\n<strong>3- SELECTING YOUR STARTING STATS: </strong><br/>\n<br/>\n I usually don't start thinking about starting stats until I have a pretty good idea of what the character is gonna be like. It doesn't necessarily mean you need to wait until you've defined your spread, but for the sake of organization I'm making this my number 3 step. The truth is that you think about this somewhere inbetween defining your spread and pre-epic spread. You analyze which stats are important to your build, and the minimum of each that you need to attain requirements.<br/>\n<br/>\n In The Shadow Priest, I needed 19 Wisdom to cast all Cleric spells, but I could take 2 Great Wisdom feats, so effectively I only needed 17 base Wisdom. However, 17 Wisdom costs you 3 stat points, so I preferred to use 2 stat increases for 18 Wisdom, since as I explained above, Wisdom also gives him AC, so ending on an odd value would be incredibly dumb. He also needed at least 14 Intelligence for the skill points, as he has to max out Hide, Move Silently and Listen, plus Concentration, Tumble and Spellcraft. And he is Dex-based, so I needed to put at least 16 DEX.<br/>\n<br/>\n The rest (leftovers) were allocated to Constitution for Fortitude and HP. Strength was useless, because I had Divine Power to increase it and AoV to cap it, and Charisma would give me nothing as well. It all has to come together and that's what is important. Again what you do here is try to define the minimum of each attribute that you'll need to be able to get all the feats, skills and spells that you want and then PRIORITIZE when distributing the leftovers.<br/>\n<br/>\n<strong>4- SELECTING OF FEATS AND ATTRIBUTE POINT DISTRIBUTION: </strong><br/>\n<br/>\n As for selecting feats, Cinnabar Din created a topic quoting Mithdradates on very good advice about feat selection. I doubt I could do better myself in explanation, unfortunately, that has been lost in the closing of the old forums, so I will try to sum up what I remember from this. Basically, to select your feats, you must divide them in MUST HAVE and NICE TO HAVE:<br/>\n<br/>\n<strong>- MUST HAVE:</strong> Here are all requirements for classes or epic feats that you want to have, for example: Dodge and Mobility for SD and Improved Evasion and Defensive Roll for Epic Dodge, and Epic Dodge, which is a vital part of my combat strategy. Weapon Finesse to get DEX to modify attacks, Extend Spell to make those juicy sweet buffs last longer and Trickery domain for 50% concealment from Improved Invisibility, which in combination with Epic Dodge are the core of the build. Those are the MUST HAVES of my Shadow Priest build.<br/>\n<br/>\n The rule of thumb here is that you HAVE TO be able to fit all of these into the build, so don't get carried away here or else you'll end up being disappointed. If you have too many MUST HAVES, your build simply won't work!<br/>\n<br/>\n<strong>- NICE TO HAVE:</strong> Here you put all the feats that you think are going to improve your combat strategy but are not VITAL to the build. For the Shadow Priest, I will list a few, just to get the idea: Armor Skin, Weapon Focus, Improved Critical, Epic Weapon Focus, Epic Prowess, Called Shot, Disarm, Improved Disarm, Empower Spell, Expertise, Improved Expertise, Blind Fight, etc... Now you need to prioritize.<br/>\n<br/>\n Think with me: Disarm alone is not good, so I needed 2 feats for Disarm/Improved Disarm. Blind Fight allows you to deal with concealment, so it was one of my highest priorities, Weapon Focus and Improved Critical to help with damage output are also very important, so that leaves me with basically one feat left to choose from Empower Spell, Called Shot and Expertise. Now having +5 AC is quite good, but with Called Shot on a high AB Monk build, I will lower the enemy's attack by more than 5 points by spamming it, so Called Shot takes precedence over Expertise, since Concealment will help you tank mobs anyway. The other choice is between Called Shot and Empower Spell. My DCs are bad because my Wisdom is low, so it's not at all vital to have attack spells. That cripples half the use of empower. The other half is for capping stats. So if your server's items don't help much there, you can go for Empower Spell, but where I play, I can cap DEX and WIS easily with items, so I went with Called Shot.<br/>\n<br/>\n Roughly, that is what Cinn's article talked about. Moving on!<br/>\n<br/>\n Selecting the Attribute point distribution can be easy in some builds and somewhat complicated in others. You need to know a few things in order to make the correct decisions:<br/>\n<br/>\n - Requirements for Feats you want your character to have; (DEX 25+, Improved Evasion and Defensive Roll, Tumble 30+ for Epic Dodge in the Shadow Priest build, or STR 25+, Great Cleave, Epic Weapon Focus and Improved Critical for Devastating Critical, or CON 21 for Epic Damage Reduction, for example)<br/>\n - Skills, feats and class features that require a certain minimum attribute score to be used. Spells, for example require a certain ability to be 10 + Spell Level in order for you to be able to cast them. Each class has its own primary casting ability: Wizards use INTELLIGENCE, Sorcerers and Bards use CHARISMA, Paladins, Clerics, Druids and Rangers use WISDOM.<br/>\n<br/>\n Remember you gain one modifier every 2 ability points spent (or Greater Ability feats taken), so there is little point in ending the build with an odd score on any ability unless it's a requirement for something. Even then it's probably better to get one more increase for a higher modifier. Only end on odd scores if you REALLY CAN'T AVOID IT!!!!<br/>\n<br/>\n In the \"Shadow Priest\" build, I wanted to get enough Wisdom to cast all Cleric spells as soon as possible. I was going to wait until Cleric 23 to take Great Wisdom 1 with the Cleric Bonus Feat, but then I found out I could also take Armor Skin with that feat, so I chose to swap them. I wanted to put as many points in DEXTERITY as possible (for AB and AC) while being able to cast all Cleric spells. I could've ended on WISDOM 19, but with the Monk AC bonus, WISDOM 20 gave me +1 AC.<br/>\n<br/>\n<strong>5- DEFINING THE LEVEL-UP ORDER:</strong><br/>\n<br/>\n Now it's time to define which class to take on which level. This is THE MOST OVERLOOKED-BY-NOVICE-BUILDERS aspect of Character Building.<br/>\n<br/>\n It's is very important for your character to grow constantly and heavily impacts playability. The order in which you choose to level up can prevent or grant you the possibility to attain a certain desired feat. You have to revise which class features are attained at which level and then establish your priorities. You also need to consider skill updates and / or skill dumps and at which levels they'll be most effective. But before even that, you have to consider WHICH class TO START WITH!<br/>\n<br/>\n As a general rule, you need to start with the class that has the most skill points, because at level 1, the skill points received are multiplied by 4. If you don't do this, be sure to have a good reason not to (XP Penalty being the main one, not enough levels of that class to waste being the second). After selecting which class your character will start as, you need to select the order in which to choose your levels. For that, you need to know how a few things work:<br/>\n<br/>\n<strong>- SKILLS:</strong> You need to know the basic principle that a MAXIMUM TOTAL on a class skill is always CHARACTER LEVEL +3. There are a few skills that are vital to many builds, and knowledge of how they work can help you choose when to take certain classes, mainly those that are taken for the sole purpose of skill dumps. The general rule is to take these classes on levels that will grant you an optimized skill rank / modified rank for the most important skills.<br/>\n<br/>\n      - Tumble: You gain 1 AC for every 5 RANKS you have in this skill. That means that NO MODIFIERS APPLY TO THE AC BONUS. Also, that you only need 40 ranks in this skills to attain the maximum possible bonus. To have a Tumble score of 10, you need to take a class that has it as a class skill at level 7. Normally, you're going to see classes such as Rogue, Bard, Shadowdancer, Assassin, etc... being taken at levels 7, 12, 17, etc... That is done because of Tumble.<br/>\n<br/>\n      - UMD: This skill works with MODIFIED RANKS in multiples of 5. If you have 9 UMD total, it's the same as having 5 UMD. The next multiple of 5, in this case 10, will enable you to use better gear. UMD is modified by CHARISMA. If you have a negative CHARISMA modifier, you'll need to take a class that has UMD as a class skill at level 8 in order to have a total of 10 Modified Ranks. One thing I use a lot in my UMD users with negative Charisma is to delay the Tumble dump 1 level so that UMD modified ranks also go to a higher level, so I commonly take Rogue at level 23 instead of 22, 33 instead of 32, 38 intead of 37 in those builds. If you are a Dwarf or Half-Orc, it would be 24 instead of 23, so on and so forth because of the -2 charisma modifier, rather than -1.<br/>\n<br/>\n      - Spellcraft: This skill works with MODIFIED RANKS in multiples of 5. Again, you gain +1 to all saves vs spells each time your Spellcraft total reaches the next multiple of 5. Spellcraft is modified by INTELLIGENCE.<br/>\n<br/>\n<strong>- FEATS:</strong> Some feats are only attainable if you take a level on a specific class. The main example of this is Weapon Specialization. It can be attained at any given level if you've fulfilled the requirements. You need at least 4 Fighter levels to be able to get it. Coincidentally or not, you do gain a bonus feat with Fighter 4, but if you use it for something else, you'll need to take a Fighter level on a general feat level in order to have access to it. I am assuming that you know a NWN character gains a new feat every 3 levels. If not, now you do.<br/>\n<br/>\n Following the same line of thought, you need to know which class-specific feats you get at which level and then PRIORITIZE! The key to doing this is knowing the classes you're playing very well. That will make it easier for you to determine which feats are the most useful and in what order you should take them. This is the most difficult part of NWN: KNOWING THE CLASSES. This is why this guide is just a guide to the BASICS, because once you know this, you can try to build with all class combos, but you can only make a GOOD build if you know the classes that you use in that build.<br/>\n<br/>\n To exemplify this, how many Clerics have I seen try to go for 16 pre-epic BAB to get full attack schedule, when that's WORSE than having 3 attacks per round, because of the way Divine Power works!!!?!?!?!!?!?!? How many people make Wizard or Sorcerer spellswords and find them shitty because they cast a Fireball and it does little to no damage?!?! Or when they cast no-save spells like they are supposed to do, but then the enemy resists it because they didn't cast any form of breach previously!! You need to know the classes VERY WELL, and that learning process may take YEARS. I'm not exaggerating!!<br/>\n<br/>\n \"Knowing the classes and what they can do is the refined gold of character building, this article is just the frame in which you pour that gold.\"<br/>\n<br/>\n I'm just quoting myself here, I'm aware of that, but what the hell, that was a HELL OF A SENTENCE hehe!!! Anyway, back to the topic at hand. For the purpose of explaining the order of acquisition of feats, \"The Shadow Priest\" is just the perfect example. I wanted to get the Cleric buffs up and running as soon as possible, and in terms of that, 8 Spell levels were more than enough. I also needed Monk for the Kama focus, Wisdom AC, Attack Schedule and Tumble dumps. So my pre-epic spread was 16/4. Notice how I took Monk first for the extra skill points, then at 7, 12, 17? Now you know why! After 21, I started with priorities. The first one was Improved Knockdown, then right after that was Hide in Plain Sight. Then I went back to Cleric because of the casting power, since my melee power was already formidable. Monk 7 and Monk 8 were used for Skill dumps, then I needed Monk 9 and the Shadowdancer levels to be able to take Epic Dodge at level 39.<br/>\n<br/>\n<strong>6- BUILD MODEL:</strong><br/>\n<br/>\n After you are done with the planning, it's time to test it. After that and if everything goes according to plan, publishing your build is the next step. Make sure your build isn't an exact copy of someone else's build and has enough originality to be posted. If you're not sure, post it in the Build Request forum and ask. Here's the model I use for posting my builds in this guild:<br/>\n<br/>\n ECB Build Model<br/>\n<br/>\n RACE:<br/>\n<br/>\n ALIGNMENT:<br/>\n<br/>\n PLAYABILITY:<br/>\n<br/>\n STARTING STATS:<br/>\n<br/>\n STR -<br/>\n DEX -<br/>\n CON -<br/>\n WIS -<br/>\n INT -<br/>\n CHA -<br/>\n<br/>\n ENDING STATS:<br/>\n<br/>\n STR -<br/>\n DEX -<br/>\n CON -<br/>\n WIS -<br/>\n INT -<br/>\n CHA -<br/>\n<br/>\n SKILLS TOTAL (@Level 40) [Ranks (Modified Ranks)]<br/>\n<br/>\nSkill nn (nn)<br/>\nSkill nn (nn)<br/>\nSkill nn (nn)<br/>\nSkill nn (nn) ...etc.<br/>\n<br/>\n BASIC STATS:<br/>\n<br/>\n - Hit Points:<br/>\n - Skill Points:<br/>\n - Skills:<br/>\n - Saving Throws (Fort/Ref/Will):<br/>\n - Naked AC:<br/>\n - BAB:<br/>\n - AB:<br/>\n - Spellcasting:<br/>\n<br/>\n LEVELING GUIDE:<br/>\n<br/>\n 1-<br/>\n 2-<br/>\n 3-<br/>\n 4-<br/>\n 5-<br/>\n 6-<br/>\n 7-<br/>\n 8-<br/>\n 9-<br/>\n 10-<br/>\n 11-<br/>\n 12-<br/>\n 13-<br/>\n 14-<br/>\n 15-<br/>\n 16-<br/>\n 17-<br/>\n 18-<br/>\n 19-<br/>\n 20-<br/>\n 21-<br/>\n 22-<br/>\n 23-<br/>\n 24-<br/>\n 25-<br/>\n 26-<br/>\n 27-<br/>\n 28-<br/>\n 29-<br/>\n 30-<br/>\n 31-<br/>\n 32-<br/>\n 33-<br/>\n 34-<br/>\n 35-<br/>\n 36-<br/>\n 37-<br/>\n 38-<br/>\n 39-<br/>\n 40-<br/>\n<br/>\nSKILLS SCHEDULE<br/>\n1-<br/>\n 2-<br/>\n 3-<br/>\n 4-<br/>\n 5-<br/>\n 6-<br/>\n 7-<br/>\n 8-<br/>\n 9-<br/>\n 10-<br/>\n 11-<br/>\n 12-<br/>\n 13-<br/>\n 14-<br/>\n 15-<br/>\n 16-<br/>\n 17-<br/>\n 18-<br/>\n 19-<br/>\n 20-<br/>\n 21-<br/>\n 22-<br/>\n 23-<br/>\n 24-<br/>\n 25-<br/>\n 26-<br/>\n 27-<br/>\n 28-<br/>\n 29-<br/>\n 30-<br/>\n 31-<br/>\n 32-<br/>\n 33-<br/>\n 34-<br/>\n 35-<br/>\n 36-<br/>\n 37-<br/>\n 38-<br/>\n 39-<br/>\n 40-<br/>\n<br/>\n SIMILAR BUILDS:<br/>\n<br/>\n SPECIAL NOTES:<br/>\n<br/>\n<strong>7- FINAL NOTES:</strong><br/>\n<br/>\n Well, I didn't say that it was going to be easy, but if you follow these guidelines, you should be able to create some nice builds, but most importantly, you will be capable of understanding the insightful advice that the elder members of the guild have to offer you. Good luck on your adventures, and most importantly, HAVE FUN DOING IT!!!<br/>\n<br/>\n<strong>8- TOOLS (recently edited in):</strong><br/>\n<br/>\n When I wrote this guide, WAY BACK, when the old forums were still alive, I did use the above model to create my builds, and did everything by hand. Nowadays, I have evolved into using the CBC (Character Build Calculator). It's an excel plan that allows you to choose everything you need to and calculates everything for you. I reckon that knowing how to do things by hand did help me understand building a bit better, but it is an invaluable tool for lazy scumbags such as myself to avoid redoing the math to calculate your stats. There are also other very neat tools in a topic right here at the forums.<br/>\n<br/>\n Here's the link: <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515320/\" rel=\"noreferrer\" target=\"_blank\">Tools of the Builder</a><br/>\n<br/>\n Take it EZ!<br/>\n<br/>\n<em>edit: by Hip 20161213 repaired broken links</em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "11:26 AM - Apr 16, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks a lot for sharing this!<br/>\n<br/>\nWhile I still will need tons of information, this guide is giving a good overview and probably will prove very helpful in the future.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "calespurmarksman",
      "avatar": "10758934_1530764018.jpg",
      "timestamp": "2:14 PM - Jul 31, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Max, thanks for doing this! It helped me a lot.<br/>\n<br/>\nOne thing I don't get is why do you claim undispellability for a lvl 24 Cleric? The DC of a dispell is 12 + caster level Vs d20 + dispeller's lvl, so any Spellcaster above lvl 36 will be able to dispell with a 100% probability. Am I wrong?<br/>\n<br/>\nThanks!!!!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:45 PM - Jul 31, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>calespurmarksman wrote:</cite>\nHey Max, thanks for doing this! It helped me a lot.<br/>\n<br/>\nOne thing I don't get is why do you claim undispellability for a lvl 24 Cleric? The DC of a dispell is 12 + caster level Vs d20 + dispeller's lvl, so any Spellcaster above lvl 36 will be able to dispell with a 100% probability. Am I wrong?<br/>\n<br/>\nThanks!!!!<br/>\nWith <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Dispel_magic\" rel=\"noreferrer\" target=\"_blank\">Dispel Magic</a>, the maximum caster level used in that calculation is 10, and with <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Greater_dispelling\" rel=\"noreferrer\" target=\"_blank\">Greater Dispelling</a>, the maximum is 15. There is also <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Mordenkainen%27s_disjunction\" rel=\"noreferrer\" target=\"_blank\">Mordenkainen's Disjunction</a>, which has no cap, so nobody is ever safe from that spell.</div></blockquote><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "calespurmarksman",
      "avatar": "10758934_1530764018.jpg",
      "timestamp": "4:57 PM - Jul 31, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote:</cite>\n<blockquote><div><cite>calespurmarksman wrote:</cite>\nHey Max, thanks for doing this! It helped me a lot.<br/>\n<br/>\nOne thing I don't get is why do you claim undispellability for a lvl 24 Cleric? The DC of a dispell is 12 + caster level Vs d20 + dispeller's lvl, so any Spellcaster above lvl 36 will be able to dispell with a 100% probability. Am I wrong?<br/>\n<br/>\nThanks!!!!<br/>\nWith <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Dispel_magic\" rel=\"noreferrer\" target=\"_blank\">Dispel Magic</a>, the maximum caster level used in that calculation is 10, and with <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Greater_dispelling\" rel=\"noreferrer\" target=\"_blank\">Greater Dispelling</a>, the maximum is 15. There is also <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Mordenkainen%27s_disjunction\" rel=\"noreferrer\" target=\"_blank\">Mordenkainen's Disjunction</a>, which has no cap, so nobody is ever safe from that spell.</div></blockquote>\n</div></blockquote>\n\nOh, yeah, right! My bad...<br/>\n<br/>\nThanks a lot for the reply - I have a lot to think about on my Rogue-Wiz-AA :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:55 PM - Dec 21, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A lot of Pearls here!<br/>\nThank you Max for bringing structure to this complicated process. <br/>\nAnd thank you for honoring Cinn and Mith. They truely deserve it!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Luj1",
      "avatar": "no_avatar.png",
      "timestamp": "5:47 PM - Dec 24, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Fantastic thread<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}