{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "735",
  "name": "The Spell Resistant Kensai (Monk 36/Fighter 2/Assassin 2)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-spell-resistant-kensai-monk-36-fighter-2-assas-t2355284.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 12,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:34 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong>The Spell Resistant Kensai</strong><br/>\n<br/>\n<em><span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_3310f5776722419d2c9d535e6a85edbc.png\" />\n</dl>\n</span></em><span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://i.pinimg.com/550x/73/59/04/73590407d352874126c7c0271ae4713a.jpg\" rel=\"noreferrer\" target=\"_blank\">https://i.pinimg.com/550x/73/59/04/7359 ... e4713a.jpg</a></span><br/>\n<br/>\n<em>Stealthy and moving like lightning, and with zen-like senses, this spell resistant Kensai uses UMD to self buff him with haste/greater spell mantle/improved invisibility, eliminate high value targets such as spellcasters and archers with improved knockdown, then fly out of battle, melee combatants hot on his heels, into his waiting pile of tangle and electrical traps... admittedly not the best traps in the world, but if there are enough of them...</em><br/>\n<br/>\n<em>If the aftermath of all this he can manage the remaining enemies, he crushes them with his keen weapon-ed devastating scimitar.</em><br/>\n<br/>\n<em>If there are still too many, he makes use of his tremendous speed to run out of sight, stealth, rebuff, and return, ready to eliminate them one by one...</em><br/>\n<br/>\n<br/>\n<em>Edited after suggestions from Zanithar and Stagmeister</em><br/>\nAnyway this guy was built after reading through a discussion about my <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-mage-hunter-monk-32-fighter-6-assassin-2-t2355279.html\" rel=\"noreferrer\" target=\"_blank\">first spell resistant mage hunter draft build</a> posted here. <br/>\n<br/>\nI realised my current strategy of dealing with mages is to UMD/Haste/Greater Spell mantle up, and charge in with dev crit.<br/>\n<br/>\nI wondered if such a strategy could be improved by adding monk speed and high non-reducible spell resistance.<br/>\n<details><summary>Spoiler</summary>d20 + caster level + spell penetration  vs. SR\n</details>\n\nWith an innate spell resistance of 54, a level 40 caster would have to roll a 14 or more to penetrate (65% chance of spell failure). A level 40 caster with epic spell penetration would have to roll a 8 or more to penetrate (35% chance of spell failure). <br/>\n<br/>\nSaves are nicely balanced being a monk, but devastating critical opponents and enemies with petrify will give him pause with his low fortitude save.<br/>\n<br/>\nDedicated fighters with high AC may also cause a challenge, with a Base AB of 40 and 3 APR <br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_8d4161c84c6ec8eb3e8a54c39135e42c.jpg\" />\n</dl>\n</span><span style=\"font-size:50%;line-height:normal\">Image source: <a class=\"postlink\" href=\"https://img-9gag-fun.9cache.com/photo/a5MD5pL_700bwp.webp\" rel=\"noreferrer\" target=\"_blank\">https://img-9gag-fun.9cache.com/photo/a ... 00bwp.webp</a></span><br/>\n<br/>\nEnemies with true sight or good detection skills will also pose a thread, as this is not a dex based build and I didn't have space for ESF: Hide / Move Silently<br/>\n<br/>\nThe good thing is though, with all that monk speed, if a challenge is too difficult you could potentially run out, stealth, and plan the next encounter.<br/>\n<br/>\nI gave him a back up attack with his fists by taking weapon focus: unarmed, with a monk UBAB of 38 and 5 APR hopefully that will do the task against crit immune low AC constructs and undead. High AC undead bosses still going to be a problem. <br/>\n<br/>\nOne could drop that feat for expertise, great fortitude, luck of heroes, resist energy or even a stealthy feat. <br/>\n<br/>\n1d6 death attack, dev crit DC 41 (47 with capped strength)<br/>\n<br/>\nWith assassination attempts, haste is very valuable so your first flurry does two attacks. Gives you a better chance of landing that dev crit with that 12-20 crit range. <br/>\n<br/>\nAnyway I liked the look of this one, so I've posted this one here for your review and commentary. <br/>\n<br/>\nAppreciate your advice as always.<br/>\n<br/>\n<details><summary>Spoiler</summary>Monk(36), Fighter(2), Assassin(2), Human\nSTR: 18 (32)\nCON: 12\nINT: 12\n\n01: Monk(1): Toughness, Weapon Proficiency Martial, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}\n03: Monk(3): Weapon Focus: Scimitar\n05: Monk(5)\n07: Monk(7)\n09: Monk(9): Power Attack, {Improved Evasion}\n11: Monk(11)\n13: Monk(13)\n15: Monk(15): Blind Fight\n17: Monk(17)\n19: Monk(19)\n21: Fighter(1): Great Strength I, Epic Weapon Focus: Scimitar, (STR=24)\n23: Monk(21)\n25: Monk(22)\n27: Monk(24): Improved Spell Resistance I\n29: Monk(26)\n31: Assassin(2): {Uncanny Dodge I}\n33: Monk(29): Great Strength II, (STR=28)\n35: Monk(31)\n37: Monk(33)\n39: Monk(35): Great Strength IV, Improved Spell Resistance IV, (STR=31)\n\nSkillpoints: 254\nSaving Throw bonuses: Mind Effects: +2, Poison: +1\nAB (max, naked): 40 (melee), 28 (ranged)\nSpell Casting: \n\n\n01: Discipline(4), Hide(4), Listen(4), Move Silently(4), Save(8), \n03: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(7), \n05: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(11), \n07: Discipline(1), Hide(1), Listen(1), Move Silently(1), Tumble(5), Save(10), \n09: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(14), \n11: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(18), \n13: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(17), \n15: Discipline(1), Hide(1), Move Silently(1), Save(22), \n17: Discipline(1), Hide(1), Move Silently(1), Tumble(5), Save(23), \n19: Discipline(1), Hide(1), Move Silently(1), Save(29), \n21: Discipline(1), Save(35), \n23: Discipline(2), Hide(1), Listen(2), Move Silently(1), \n25: Discipline(1), Hide(2), Listen(4), Move Silently(2), \n27: Discipline(1), Hide(1), Move Silently(1), Tumble(5), \n29: Discipline(1), Hide(1), Move Silently(1), Save(6), \n31: Hide(1), Move Silently(1), Search(1), UMD(9), Save(3), \n33: Discipline(1), Hide(1), Listen(3), Move Silently(1), \n35: Discipline(1), Hide(1), Listen(3), Move Silently(1), \n37: Discipline(1), Hide(1), Move Silently(1), Tumble(5), \n39: Discipline(1), Hide(1), Listen(3), Move Silently(1), </details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:53 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">EDIT ... my brain just caught up ...never mind.  Monk 36 / Assassin 2 / Fi is slightly better I think?<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:02 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Zanithar<br/>\n<br/>\nGood thoughs with the assassin 2. I did consider it initially but I can have a look at the Assassin 2 idea again to increase SR by one, extra monk speed I believe and get earlier uncanny dodge at the expense of 1d6 sneak, 12 skill points and requiring to be evil, but I wonder if the current configuration is better for a bit of extra damage in that first flurry, getting balance right is tricky between to the two. Not sure really which is better. Perhaps a little versatility given UMD and spell mantles?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "11:06 PM - Jan 07, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You would trade potential sneak damage for a smidge more Monk goodness and that slight chance of Death Attack.<br/>\n<br/>\nHowever, the way I see it is that Devastating Critical will take care of business OR neither sneak attack nor Devastating critical will work (immune critical).  So sneak damage, although useful, is unnecessary redundancy and Monk speed and SR is one of the key focuses of the build.<br/>\n<br/>\nIt is always good to hunt more skill points :)<br/>\n<br/>\nSent from my iPhone using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:02 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've just been looking at your \"hurting things\" potential, and it doesn't make for happy reading, I'm afraid. 3APR (4 with Haste), an AB of 38/33/28, and a Dev Crit DC of 39 with your scimitar. You need to hit them to hurt them, and with that AB you won't be likely to knock them down either. I think you recognize this yourself by taking WF in Unarmed. Why not stick with that? You get the UBAB progression and d20 damage fists at level 16, as well as cutting through DR at Ki Strike 1, 2 and 3 (levels 10, 13 and 16). Admittedly not much, but it doesn't hurt. It also frees up 2 feats. I appreciate that scimitar is more crit-friendly, but that makes no difference if you're just waving it in the wind.<br/>\n<br/>\nI'm also intrigued why you wouldn't take Spellcraft (albeit cross-classed) if you're looking to be spell resistant?<br/>\n<br/>\nI confess, this isn't one for me, but that doesn't mean you and others couldn't make best use of it. Sorry.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:26 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"18280\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18280&amp;sid=5ddcaeb938e65218e131dcdd9709ad6c#p18280\">↑</a><div class=\"responsive-hide\">Jan 08, 2020</div></cite>[...] 3APR (4 with Haste), an AB of 38/33/28, and a Dev Crit DC of 39 with your scimitar. You need to hit them to hurt them, and with that AB you won't be likely to knock them down either. </div></blockquote>\nThanks for the feedback. So more AB. I think you knew I can figure how to solve this one<img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />.<br/>\n<br/>\nEasy solution. Dump starting Wis to 8, drop Int to 12 put starting Str to 18, drop two improved spell resistance feats for great strengths. 2 base AB added right there. One would get Dev crit earlier at level 24. Lose some AC and -2 will save and 43 skill points and 4 spell resistance. I think that's an ok tradeoff. <br/>\n<br/>\nI then hit the benchmark of Mithdradates's average warrior AB of 40. Hooray for me! Add buffs from UMD / good weapon, can pump the AB up to a reasonable level. <br/>\n<br/>\nThat last attack is going to rarely hit against comparable opponents, likely on a 20 and likely never crit. This is a 3/4 BAB build really, hitting an AB of 40 is pretty good considering. The main advantage of that 4th attack is going to be the two hit flurry which can be achieved by haste. If I include more levels of fighter pre-epic for 1 BAB and that extra attack, then I struggle to fit in all the epic level feats (Overwhelming Critical, Devastating Critical, EWF, EP) plus as many improved spell resistance feats as possible.<br/>\n<br/>\nThere are higher AB Kensai builds, for example, <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/whirlwind-of-steel-monk-25-ftr-8-wm-7-t2350043.html\" rel=\"noreferrer\" target=\"_blank\">Valerfor's Whirlwind of Steel</a> which takes 15 levels of Fighter/WM, AB is 43 in that circumstance but spell resistance is much lower, 35 in comparison. I'm looking for a much more spell resistant Kensai with Dev Crit, and this is achieved by pumping Monk 35+. I'd be looking at as close to 50/50 against a pure caster with epic spell penetration to avoid sacrificing other capabilities.<br/>\n<blockquote><div>I think you recognize this yourself by taking WF in Unarmed. Why not stick with that? You get the UBAB progression and d20 damage fists at level 16, as well as cutting through DR at Ki Strike 1, 2 and 3 (levels 10, 13 and 16). Admittedly not much, but it doesn't hurt. It also frees up 2 feats. I appreciate that scimitar is more crit-friendly, but that makes no difference if you're just waving it in the wind.</div></blockquote>\nSometimes once you have played so many builds you just feel the need to play a dev critting Spell Resistant Kensai Stag? Just a bit different to the usual punch fest/dual kama fest monks tend to be. <br/>\n<br/>\nFurthermore are fists more optimal here? Not sure. I believe they are different weapons.<br/>\n<br/>\nFists - 1d20 damage, innate +1-3 enchantment (to essential pierce Ghostly Visage / Ethereal Visage, some other enemies), Crit threat range 19-20 (10%), 5 APR-7APR (flurry of blows/haste) -&gt; ?keen gloves do they exist<br/>\nScimitar - 1d6 damage, weapon can be buffed with keen weapon/GMW/Bless Weapon/Flame Weapon/Dark Fire scrolls with UMD, frees up the glove slot for magical bonuses, Crit threat range 12-20 (45%) or 15-20 (30%), 3-4 APR (depending if haste is active)<br/>\nGreatsword - 2d6 damage, 1.5 str damage, buffable weapon, freed up glove slot, Crit threat range 15-20 (30%) or 17-20 (20%), 3-4 APR<br/>\n<br/>\nReally in terms of weapon choice, I thought a build that aims to assassinate with dev crit would want a weapon with a wide crit range. <br/>\n<br/>\nI thought therefore the keen scimitar is the no brainer for assassinations. Kukri would likely come close second just for being a small weapon making one more likely to be disarmed. Rapier would tie with kukri just because it isn't a slashing weapon and you can't use keen weapon on it, but keen rapiers exist in the toolset for sure. <br/>\n<br/>\nDo the extra attacks from fists (3 APR vs 2 APR) in the first flurry make it more optimal? This is the stats for the first flurry. <br/>\n<br/>\n- You get two attacks in your first flurry with haste with a keen scimitar giving you a 70% (1-0.55^2) chance in your first flurry of rolling something in the threat range. <br/>\n- Keen Greatsword hasted gets two attacks in the first flurry, this grants a 51% (1-0.70^2) chance in your first flurry of rolling something in the threat range. <br/>\n- Fists get 3 attacks in the first flurry with both Flurry of Blows/Haste active. This grants a 27% (1 - 0.9^3) chance of rolling the crit range in the first flurry (3 attacks). If Keen gloves exist, then the crit range in the first flurry is 39% (1 - 0.85^3) with Flurry of Blows &amp; haste active. Flurry of Blows will lower AB by 2.<br/>\n<br/>\nAnyway the character is almost tripling the crit chance (70% vs 27%) in the first flurry with a keen scimitar with haste active, which is the point of the build - assassinate with dev crit going through all those crazy Epic Warding/Premonition shields etc etc then get the hell out before you receive the Time Stop/Mass Haste/Time Stop/Mord/Time Stop/IGMS/Time Stop/Bigby treatment hehe.<br/>\n<br/>\nIn terms of the AB fists vs sword, if the goal is damage, I think fists win, if the goal is dev crit, then I think scimitar wins<br/>\n<br/>\nI didn't crossclass Spellcraft because with such high SR + spell mantles there are lots of defenses already. <br/>\n<br/>\nThe thing that is going to kill this guy is being surprised by a Bigby's hand (which is a non-DC spell ) which gets through his innate spell resistance, improved knockdown (equip knockdown immunity if possible) or dev crit (this is your achilles heel), death attack before he gets mind immunity (that grants paralysis immunity too right?) or petrify (everyone will roll a 1 eventually, ranged weapons are best here). <br/>\n<br/>\nHence I valued the detection skills. If you see em before they see you, you can always reposition with your +110-120 monk speed, unless of course, they are monks themselves and somehow faster than you which is unlikely :) Instant death spells can be countered by a death immunity belt or a death ward scroll from UMD, and you are mind immune so the will save might not matter as much, so spell craft seemed low value, certainly helpful for sure, but 40 points in spot is better against those sneaky assassins that catch you. <br/>\n<br/>\nAnyway that decision is all academic now that I'll drop Int to 12 and lose 43 skill points, I'll need to drop Spot anyway, but it would have been nice against those annoying HiPS'ers<br/>\n<br/>\nI also considered other races, Dwarf and Half-Orc but human looked more stylish to me, plenty more human kensai portraits on the internet (feel free to let me know if you find any good dwarven or half-orc ones) to upload into the game with the ConvertPortrait command in the NWN console<br/>\n<br/>\nAnyway thanks for the feedback. I'll work on including Zanithar's suggestion for Assassin 2 adding 1 SR and Stag's suggestion for more AB and edit it into the main post. Thanks!<br/>\n<br/>\n<strong>Edit:</strong> actually I can include spot if I drop dex to 12 and put Int to 14 but I'm not sure that would be worth it, I'm gonna mull over it a bit<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:58 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A good and solid riposte, Orion! Still not one for me, I'm afraid - though may well be for others.<br/>\n<br/>\nAnd yes, indeed I remember Valerfor's Whirlwind of Steel - the pair of us took her (separately as Seo - Valerfor - and Ren - me) to level 40 in Mines of Twin Summits with slightly different iterations a couple of years ago, and their tales of glory may be read on that thread in the modules forum from pages 12 to 16.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "3:01 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A min-maxed build single-wielding a kukri/rapier/scimitar has a larger amount of critical hits per round on average than a min-maxed build dual-wielding kamas against most opponents. Unarmed won't compare to high crit range weapons when it comes to the chance of landing critical hits. Damage is much more complicated, but if you focus specifically on critical hits then unarmed is significantly worse.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:32 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Yunim wrote: <a data-post-id=\"18286\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18286&amp;sid=5ddcaeb938e65218e131dcdd9709ad6c#p18286\">↑</a><div class=\"responsive-hide\">Jan 08, 2020</div></cite>A min-maxed build single-wielding a kukri/rapier/scimitar has a larger amount of critical hits per round on average than a min-maxed build dual-wielding kamas against most opponents. Unarmed won't compare to high crit range weapons when it comes to the chance of landing critical hits. Damage is much more complicated, but if you focus specifically on critical hits then unarmed is significantly worse.</div></blockquote>\nIndeed, but the point I was making was that you need to land a hit before you can crit. AB is crucial to a melee build, critting is not. It's nice, but it's like putting your house on one roll of the dice with an AB under 40.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "3:48 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was taking AB into account when I made my comment. If you switch from single-wielding a scimitar to unarmed and don't also increase the AB with that change then the average number of critical hits per round will decrease against most opponents, even though the average damage per round or average number of hits per round might increase against some opponents. Since this build focuses on dev crit it makes sense to maximise the average number of critical hits per round even if it means a decrease in the average damage per round.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:34 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">No it doesn't make sense. You're relying on that first hit in the flurry landing (and no, not FoB) and UBAB progression means you've a better chance of hitting after that first attack. The Dev Crit DC is only 39 in any case so doesn't support that. If you want a lucky one-hit wonder, fine, try it and see how it goes and how long you last. If you want to actually survive throughout 1-40, do something different.<br/>\n<br/>\nIt would appear you've been around Yunim, how about you pop something in the Introductions forum to give us some background info? That's what it's there for.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "5:17 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Specifically in terms of the average number of critical hits per round, a kukri/rapier/scimitar is better for this build.<br/>\nI've tested it with scimitar vs kama vs flurry of blows, both keened and non-keened, both hasted and unhasted, for all AC values that matter.<br/>\nIn all cases a scimitar is either the best or joint best weapon choice, specifically in terms of the average number of critical hits per round.<br/>\nThere's no point in doing a full damage calc because those are too variable, but working with crits only depends on AB, AC, and threat range so it's easy to test all cases.<br/>\n<br/>\nIf switching to kama gives even +1 AB then there are some cases where kama is better than scimitar, and if the threat range is increased via WM bonuses then there are some cases where kama is better than scimitar. But for the current build, kukri/rapier/scimitar is the best or joint best option for generating critical hits in all cases.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:53 AM - Jan 08, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for letting us know of your experience testing crit range Yunim, theoretically it makes sense too, and in practice a keen scimitar wielded with improved critical tends to crit very very frequently, as long as the AB is high enough. Hope the AB is high enough now. I'll take the build for some playtesting soon if there are no further comments. Thanks again.<br/>\n<br/>\nHehe by the way I think my intro was a that insightful just a screenshot of a character wearing a stag helmet, the ultimate antlered fashion accessory. Adds 2 to CHA<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}