{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "765",
  "name": "Level 30 Risen Lord Build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/level-30-risen-lord-build-t2355238.html",
  "author": "Scylon",
  "avatar": "no_avatar.png",
  "replies": "4",
  "views": "241",
  "posts": [
    {
      "author": "Scylon",
      "avatar": "no_avatar.png",
      "timestamp": "10:28 AM - Nov 19, 2019",
      "content": "<div>I have never played a shifter, but the idea is interesting to me. <br/>\n<br/>\nQuestion is, can the risen lord/demonflesh build be done at level 30? I have looked at it but arelith has a rule where you need to take 3 levels in a row before you can mix and match. (EG: 3 bard, 3 figher, 1 bard again etc)<br/>\n<br/>\nI recall there was one floating around made by one of the master builders (@HipMaestro), but he has been gone for a couple of years now. </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:56 AM - Nov 19, 2019",
      "content": "<div>Hi Scylon.<br/>\n<br/>\nIs this the build by Hip you're thinking of? <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/flesh-and-bone-hotu-druid-12-monk-6-shifter-10-t2354642.html\" rel=\"noreferrer\" target=\"_blank\">Hip's Shifter</a><br/>\n<br/>\nWith a little re-jigging (taking a further level of Monk at L8 to make the 3 in a row requirement, for example) it should be do-able. Particularly given that Hip's is a L28 build rather than a L30 one - so you could also grab a further Shifter level, making the final build a Druid 12/ Shifter 11/ Monk 7.<br/>\n<br/>\nHowever, I still have no knowledge of either Shifters or Druids, so I'd wait for others to give a view first!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:06 PM - Nov 19, 2019",
      "content": "<div>While I'm here - here's a link to the Shifter Guide for you.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/zelle-s-shifter-guide-version-v-revisited-t2209096.html\" rel=\"noreferrer\" target=\"_blank\">Zelle's Shifter Guide</a></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "12:29 AM - Nov 20, 2019",
      "content": "<div>I believe that Shifter is a restricted class on Arelith so you might have difficulty qualifying for the class. Also there are a lot of custom changes on the server so some of the builds that are recommended to you might not work well on Arelith. It's probably best to ask on the Arelith forum for server-specific builds.<br/>\n<br/>\nRisen Lord requires Shifter 10, Construct Shape requires Shifter 10 and 27 WIS. These requirements mean that you must be at least Dru5/Shif10 which only leaves 15 levels to work with. I think you can add up to two +2 bonuses to abilities with gifts, so Construct Shape can be achieved without any Great WIS feats.<br/>\nFor Risen Lord you can either focus on DEX for AC, CON for EDR3, or WIS for AC (requires Monk). For Construct Shape your main stat will be WIS, with DEX or CON as secondary abilities.<br/>\n<br/>\nOn some servers Monk/Shifter is nerfed so that WIS does not add to AC when shifted. If that is not the case on Arelith then I would recommend something like Dru14/Shif10/Monk6 or Dru11/Shif13/Monk6 for either shape. There are a lot more class options but that depends on what you want from the build.</div>"
    },
    {
      "author": "Scylon",
      "avatar": "no_avatar.png",
      "timestamp": "8:29 AM - Nov 23, 2019",
      "content": "<div>Cheers for the advise people. I'm looking into it and will play around a little. <br/>\n<br/>\nRegarding the restriction, its not an issue. You put in an application and you will be approved or denied based basically on their whim. I have an idea for the RP in mind with the end gold being risen lord or construct. </div>"
    }
  ]
}