{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "574",
  "name": "Swordflight  Build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/swordflight-build-t2355522.html",
  "author": "marcrussell12",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "4.8K",
  "posts": [
    {
      "author": "marcrussell12",
      "avatar": "no_avatar.png",
      "timestamp": "3:43 AM - Jul 31, 2020",
      "content": "<div>Hi all,<br/>\n<br/>\nI'm relatively new to Neverwinter Nights, but I would say I have a good understanding of D&amp;D rulesets and how the game works (I've played DDO, all the infinity engine games, Pathfinder: Kingmaker, etc). I was just wondering if anyone could recommend a good paladin build to bring all the way through all parts of Swordflight (I already beat chapter 1, but I think I am going to make a new character and start chapter 2 with it).</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:58 AM - Jul 31, 2020",
      "content": "<div>Hail Marc, and welcome!<br/>\n<br/>\nMy understanding of Swordflight is that it's a better experience if you play the same character throughout. Iirc, it currently goes to about level 33/4, with a couple more modules planned to take you to 40. So my first question is about commitment...do you want a build that will take you from beginning to end, or would you prefer one that stops at the current level? I ask merely because a build designed to mature later will not be as useful as one planned to maximize what's available at lower levels.<br/>\n<br/>\nAlso, and this is me speaking as one who has never played, let alone built, a Pally in NwN, what type of Paladin do you want to be? A big-time smiter of evil or a more basic meleer with better saves but fewer feats and skills? I ask here so that others who know what they're talking about can be more clued-up in advance.<br/>\n<br/>\nAs with all things Neverwinter, nothing's ever simple, my friend!<br/>\n<br/>\nWelcome again</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:51 PM - Jul 31, 2020",
      "content": "<div>Greetings Marc and great to hear from you!<br/>\nI do not know the Swordflight environment very well yet, it is on my to-do list, but I hear it is challenging. others can comment regarding environmental specifics.<br/>\nIt is valuable to build for the environment in question, especially in regards to weapon focuses, if I make a halberd wielding paladin but no good halberds drop it is not a great build for the environment.<br/>\nI can comment on paladins however. <br/>\nStag has already commented on different attribute focuses on paladins - Strength and Charisma are the most common. <br/>\nDexterity and Wisdom zen archer focused paladins are less common.<br/>\n<br/>\nIn my view one can also think of building Paladin as a minor class or major class.<br/>\nA minor class paladin minimally invests in paladin levels for a substantial return. That is, take a handful of levels, between 1 to 5 levels, for their amazing abilities, which include:<br/>\n- disease immunity and divine grace (for CHA modifier for saves)<br/>\n- fear immunity<br/>\n- divine might and divine shield<br/>\n- discipline, taunt, persuasion, concentration as class skills <br/>\n<br/>\nThen one can go heavy on other classes. There are a number of classes which synergise well with that small amount of paladin, such as sorcerer, rogue, monk, fighter/CoT, blackguard if it is allowed.<br/>\n<br/>\nThe downside is one sacrifices paladin spellcasting of memorized spells with this approach. There are some great paladin spells such as divine favor, bless weapon, aura of glory. Scrolls still can be used. If scrolls are available, then it could be argued little is really lost, apart from higher caster levels (which for divine favor can be quite significant, +5 to AB and damage is quite valuable in low to mid magic environments, also dispel resistance). Paladins also suffer from minimal base memorized spells per day, 3x/day is not a lot and is awful in a rest restricted environment. On the plus side by sacrificing spellcasting, one can set wisdom to 8 and put the starting attribute points in other statistics such as strength, charisma and constitution, allowing them to be higher.<br/>\n<br/>\nThe major class approach is to invest heavily in paladin. Usually this involves 20 or more levels of paladin to allow for spellcasting, higher caster levels and paladin bonus feats (which are good combat feats, epic weapon focus, epic prowess, armor skin, devastating critical etc). <br/>\n<br/>\nThere are some nice combos. For strength based paladins, a Paladin 29 / Sorc 1 / RDD 10 combination helps boost the AB, strength, charisma, constitution and charisma of paladin builds, and allows access to sorcerer scrolls, wands and equipment. A charisma based paladin smiter gets a lot of value from Champion of Torm levels for bonus feats for extra great smiting feats and CoT levels count towards smite damage, good synergy with Divine Wrath. Rogue or Monk for evasion synergises well with the great saves. <br/>\n<br/>\nI've already written a lot and you've asked only for builds so I can suggest a few, others can comment whether they suit the environment:<br/>\n<br/>\nPaladin 29 / Sorc 1 / RDD 10<br/>\n- Valerfor's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/a-bsk-paladin-what-s-the-best-build-t2355018-s10.html#p14034\" rel=\"noreferrer\" target=\"_blank\">The Crimson Dragonslayer</a><br/>\n<br/>\nPaladin 29 / Sorc 1 / RDD 10<br/>\n- <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-universal-paladin-paladin-29-sorc-1-rdd-10-t2355473.html#p20716\" rel=\"noreferrer\" target=\"_blank\">The Universal Paladin</a><br/>\n<br/>\nFighter 10 / WM 25 / Paladin 5<br/>\n- Valerfor's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/harvester-of-souls-ftr-10-pal-5-wm-25-t2354285.html\" rel=\"noreferrer\" target=\"_blank\">Harvestor of Souls</a><br/>\n<br/>\nPaladin 26 / Rogue 4 / CoT 10 (Cha based, smite)<br/>\n- Grizzled_Dwarflord's <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build222567.html\" rel=\"noreferrer\" target=\"_blank\">Knight of the Quest</a><br/>\n<br/>\nSorcerer 26 / RDD 10 / Paladin 4<br/>\n- Mick Dagger's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/spellsword-of-bahamut-sorc-26-paladin-4-rdd-10-t515415.html\" rel=\"noreferrer\" target=\"_blank\">Spellsword of Bahamut</a><br/>\n<br/>\nRogue 28 / Fighter 6 / Paladin 6 (str, dev crit)<br/>\n- avado's <a class=\"postlink\" href=\"https://world-of-greyhawk.github.io/builds/data/build246093.html\" rel=\"noreferrer\" target=\"_blank\">Tyr's devastating thud</a><br/>\n<br/>\nRogue 29 / Paladin 5 / Fighter 4 (dex)<br/>\n- <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-mistress-of-mayaheine-rogue-29-paladin-5-fight-t2355397.html#p19732\" rel=\"noreferrer\" target=\"_blank\">Mistress of Mayaheine</a><br/>\n<br/>\n<br/>\n<strong>PS</strong>:  <em class=\"mention\">@grizzled_dwarflord</em>  did you ever finish your story in your Knight of the Quest build?<br/>\n<br/>\nFor those who are unaware, here are some of the comments in his thread:<br/>\n<blockquote><div>Cinnabar Din: Damn. You rule, Grizz. Nice build too. <br/>\n<br/>\nKaliban99: Great story Grizz. You had some great little twists in there. Very good reading. Thanks.<br/>\n<br/>\nManOWarr: Forget the build!!! I want the conclusion to the story!!!! lol Well okay, I like the build too!!! Seriously,I would buy your story here if it was a book and this was the preview story on the back of the cover. Great story!!<br/>\n<br/>\nMick Dagger: A Charisma build in all it's glory that goes well with this great romantic story. Btw. Are you a professional writer?<br/>\n<br/>\nKamiryn: Great Story <br/>\n<br/>\nIthican: The story is remarkable<br/>\n<br/>\nkrsboss: ...and that's about all i can really say! Apart from wow! Great little story, really wanna find out more and what happens...Grizz you really should write a book</div></blockquote></div>"
    }
  ]
}