{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "440",
  "name": "Harper Champion - Paladin 20, Fighter 15, Harper Scout 5",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/harper-champion-paladin-20-fighter-15-harper-scout-t2293531.html",
  "author": "Thazzle",
  "avatar": "no_avatar.png",
  "replies": 18,
  "posts": [
    {
      "author": "Thazzle",
      "avatar": "no_avatar.png",
      "timestamp": "8:38 PM - Oct 19, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong>Story</strong><br/>\nFor many years she was the finest soldier Cormyr had ever seen. She wielded her swords with grace and skill, and many foes fell before her without even getting to swing their blades. Being a soldier, however, was not what she wanted to be. She wanted to hunt down evil and to protect the innocent wherever, whenever - so one day when she came upon a cleric of Tyr, she decided to go with him. She studied the the ways of The Just God and began to believe that it was no coincidence, that she had met the cleric. She joined the church and began her quest for ridding the world of evil. After many years of tirelessly killing evil wherever it rose, she began to see the futilty of her efforts. Evil was everywhere and would always return. She decided that she would turn her efforts away from lesser evils and focus on the greater ones. She sought out the Harpers, who she had heard would fit her needs, and offered to join them. The Harpers took her in and she quickly rose in the ranks. <br/>\nAs an incredible fighter and a holy warrior she is like a machine, cutting down evil creatures swiftly and easily and without mercy.<br/>\n<br/>\n<strong>Name</strong><br/>\nHarper Champion PvM 1-40 (although the first levels can be a bit tough)<br/>\n<br/>\n<strong>Classes</strong><br/>\nPaladin 20 / Harper Scout 5 / Fighter 15<br/>\n<br/>\n<strong>Race and Alignment</strong><br/>\nHuman, Lawful Good<br/>\n<br/>\n<strong>Abilties</strong><br/>\nStrength\t        14 +2\t           (19 +4)<br/>\nDexterity\t        16 +3\t           (26 +8)<br/>\nConstitution\t10<br/>\nWisdom\t        14 +2<br/>\nIntelligence\t10<br/>\nCharisma\t        12 +1\t(28 +9) (40 +15)<br/>\nBuffed with Bull's Strength, Aura of Glory and x2 Eagle's Splendor/Cat's Grace<br/>\n<br/>\n<strong>Saves</strong><br/>\nFortitude\t31 (35) 39 (43)<br/>\nReflex\t28 (32) 41 (45)<br/>\nWill\t\t29 (33) 37 (41)<br/>\nBuffed with Eagle's Splendor/Cat's Grace x2, Aura of Glory, Aid and Prayer<br/>\n<br/>\n<strong>Armor Class\t24 (44)</strong><br/>\nBase\t\t10<br/>\nPadded Armor\t1<br/>\nDex Bonus\t3<br/>\nTumble\t\t8<br/>\nArmor Skin\t2<br/>\nCat's Grace x2\t5<br/>\nDivine Shield\t15<br/>\n<br/>\n<strong>Hit Points\t420 max</strong><br/>\nPaladin\t\t200<br/>\nFighter\t\t150<br/>\nHarper Scout\t30<br/>\nToughness\t40<br/>\n<br/>\n<strong>Attack Bonus\t34/29/24/19 (off-hand 39/29) 51/46/41/36 (off-hand 51/46)</strong><br/>\nBase\t\t30<br/>\nFeats\t\t3<br/>\nDexterity\t3<br/>\nDual-Wield\t-2<br/>\nCat's Grace x2\t5<br/>\nAid\t\t1<br/>\nPrayer\t\t1<br/>\nHoly Sword\t5<br/>\nDivine Favor\t5<br/>\n<br/>\n<strong>Damage\t1d6+8 17-20x2 \t(1d6+36 +1d6 vs Evil 17-20/x2)</strong><br/>\nShortsword \t1d6<br/>\nStrength\t2 (4)<br/>\nSpecializations\t6<br/>\nDivine Might\t15<br/>\nHoly Sword\t5 and 1d6 against Evil<br/>\nDivine Favor\t5<br/>\nPrayer\t\t1<br/>\n<br/>\n<strong>Buffs</strong><br/>\n<strong>Long</strong><br/>\n\tProtection from Alignment, Eagle's Splendor x2, Bull's Strength, Cat's Grace x2, Aura of Glory, Aid, Death Ward, Freedom of Movement, Greater Magic Weapon, Bless<br/>\n<strong>Short</strong><br/>\n\tHoly Sword, Prayer, Divine Favor<br/>\n<br/>\n<strong>Skills</strong><br/>\nTumble \t40 (43) (48)<br/>\nSpellcraft \t20<br/>\nDiscipline \t35 (37) (39)<br/>\nLore \t\t6 (11)<br/>\nPersuade \t8 (17) (23)<br/>\nSearch\t4<br/>\nLevel Tumble on all Harper Scout levels, Spellcraft on level 7, 17, 27 and 37 and finally discipline on all Fighter and Paladin levels, however remember that you need 14 points for Lore and Search at level 20<br/>\n<br/>\n<strong>Level Progression</strong><br/>\n1\t1 Fighter*\tAmbidexterity, Two-Weapon Fighting, Weapon Finesse<br/>\n2\t2 Fighter*\tWeapon Focus: Shortsword<br/>\n3\t3 Fighter\tToughness<br/>\n4\t4 Fighter*\tWeapon Specialization, +1 Charisma (13)<br/>\n5\t5 Fighter<br/>\n6\t6 Fighter*\tImproved Critical: Shortsword, Iron Will<br/>\n7\t7 Fighter<br/>\n8\t8 Fighter*\tPower Attack, +1 Charisma (14)<br/>\n9\t9 Fighter\tAlertness<br/>\n10\t1 Paladin<br/>\n11\t2 Paladin<br/>\n12\t3 Paladin\tDivine Might, +1 Charisma (15)<br/>\n13\t10 Fighter*\tImproved Two-Weapon Fighting<br/>\n14\t11 Fighter<br/>\n15\t4 Paladin\tDivine Shield<br/>\n16\t12 Fighter*\tBlind Fight, +1 Charisma (16)<br/>\n17\t13 Fighter<br/>\n18\t5 Paladin\tExtend Spell<br/>\n19\t14 Fighter\tCleave<br/>\n20\t6 Paladin\t+1 Charisma (17)\t(Put 8 points in Persuade, 6 points in Lore and 4 points in Search to qualify for Harper Scout)<br/>\n21\t1 Harper Scout*\tGreat Charisma I (18), Epic Weapon Focus<br/>\n22\t2 Harper Scout<br/>\n23\t7 Paladin<br/>\n24\t15 Fighter\tEpic Weapon Specialization, +1 Charisma (19)<br/>\n25\t8 Paladin<br/>\n26\t9 Paladin<br/>\n27\t3 Harper Scout\tArmor Skin<br/>\n28\t10 Paladin\t+1 Charisma (20)<br/>\n29\t11 Paladin<br/>\n30\t12 Paladin\tGreat Charisma II (21)<br/>\n31\t13 Paladin<br/>\n32\t4 Harper Scout\t+1 Charisma (22)<br/>\n33\t14 Paladin\tGreat Charisma III (23)<br/>\n34\t15 Paladin<br/>\n35\t16 Paladin<br/>\n36\t17 Paladin\tGreat Charisma IV, +1 Charisma (25)<br/>\n37\t5 Harper Scout\tGreat Charisma V (26)<br/>\n38\t18 Paladin<br/>\n39\t19 Paladin\tGreat Charisma VI (27)<br/>\n40\t20 Paladin\t+1 Charisma (28)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:22 PM - Oct 20, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey man!<br/>\n<br/>\nNice to see you're already getting busy in your first days here. Now, as for the build, IMO it could use some tweaks. I don't have enough time to look at it in-depth, but I see some problems with it:<br/>\n<br/>\n1- Cat's Grace and Eagle's Splendor don't stack with themselves, so you cannot attain the bonus twice. They stack with other spells that give bonus to the same ability (Aura of Glory, for example). <br/>\n<br/>\n2- Your AB is kind of low, given your focus in CHARISMA, which is like the worst possible scenario for a dual-wielder. I would consider investing less in charisma and more in DEX. Here is the reasoning: a DEX-based pally will always have the DEX bonus to AC and AB thanks to Weapon Finesse, while the CHA bonus to AC from Divine Shield will only be on for a limited period of time. By investing in DEX instead of CHA, you lose Divine Might damage and duration and Divine Shield duration, but you gain a permanent increase to AC and especially AB.<br/>\n<br/>\n3- You could go with more Paladin pre-epic and use the Fighter Bonus Feats to take feats in epics, not to mention your buffs will be stronger much sooner, which is desirable. Paladin 15 Fighter 5 before 20 is the best.<br/>\n<br/>\n4- You could change the spread to Paladin 23 Fighter 12 HS 5 and keep the same number of feats while adding duration to your buffs and making it less likely to be dispelled.<br/>\n<br/>\nGotta go to work, I'll continue my analysis later on.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Thazzle",
      "avatar": "no_avatar.png",
      "timestamp": "12:49 PM - Oct 20, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm pretty sure the Harper version of Cat's Grace and Eagle's Splendor stack with the normal version? Although he does not have access to Cat's Grace through spellcasting, he can make the potion when he reaches Harper Scout level 5.<br/>\n<br/>\nPutting more points in dex makes sense to me, especially because Divine Favor only lasts a turn, having 40 charisma just seems so cool!   <br/>\n<br/>\nGoing with more paladin levels pre-epic seems like a nice route, but then I'd have to change my build significantly. Reaching for both dual-wielding, divine might and harper scout requirement feats is tough.<br/>\n<br/>\nI'm gonna look it over again and see if I can tune it up. Thanks for the constructive critisism!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:47 PM - Oct 20, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You're right, the harper versions do stack, I forgot about that harper scout thing.<br/>\n<br/>\nAs to changing your build, you can drop a couple of feats, besides, nothing says that you can't take pre-epic feats in epic levels if that's the point. So, if we stick to the paladin 15 Fighter 5 pre-epic spread and Paladin 23 Fighter 12 final, you can do this:<br/>\n<br/>\nPaladin(23), Fighter(12), Harper Scout(5), Human<br/>\n<br/>\nSTR: 14<br/>\nDEX: 14 (30)<br/>\nCON: 10<br/>\nWIS: 14<br/>\nINT: 12<br/>\nCHA: 14 (16)<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Fighter(1): Weapon Finesse, Two-Weapon Fighting, Power Attack<br/>\n02: Fighter(2): Weapon Focus: Shortsword<br/>\n03: Fighter(3): Blind Fight<br/>\n04: Fighter(4): DEX+1, Weapon Specialization: Shortsword, (DEX=15)<br/>\n05: Paladin(1)<br/>\n06: Paladin(2): Ambidexterity, {Smite Evil}<br/>\n07: Paladin(3)<br/>\n08: Paladin(4): DEX+1, (DEX=16)<br/>\n09: Paladin(5): Improved Two-Weapon Fighting<br/>\n10: Paladin(6)<br/>\n11: Paladin(7)<br/>\n12: Paladin(8): DEX+1, Divine Might, (DEX=17)<br/>\n13: Paladin(9)<br/>\n14: Paladin(10)<br/>\n15: Paladin(11): Iron Will<br/>\n16: Paladin(12): DEX+1, (DEX=18)<br/>\n17: Paladin(13)<br/>\n18: Paladin(14): Alertness<br/>\n19: Paladin(15)<br/>\n20: Fighter(5): DEX+1, (DEX=19)<br/>\n21: Paladin(16): Divine Shield<br/>\n22: Harper Scout(1): Great Dexterity I, (DEX=20)<br/>\n23: Fighter(6): Epic Weapon Focus: Shortsword<br/>\n24: Fighter(7): DEX+1, Great Dexterity II, (DEX=22)<br/>\n25: Fighter(8): Armor Skin<br/>\n26: Fighter(9)<br/>\n27: Harper Scout(2): Great Dexterity III, (DEX=23)<br/>\n28: Fighter(10): DEX+1, Epic Weapon Specialization: Shortsword, (DEX=24)<br/>\n29: Fighter(11)<br/>\n30: Fighter(12): Great Dexterity IV, Improved Critical: Shortsword, (DEX=25)<br/>\n31: Harper Scout(3)<br/>\n32: Harper Scout(4): DEX+1, (DEX=26)<br/>\n33: Paladin(17): Great Dexterity V, (DEX=27)<br/>\n34: Paladin(18)<br/>\n35: Paladin(19)<br/>\n36: Paladin(20): DEX+1, Great Charisma I, (DEX=28), (CHA=15)<br/>\n37: Harper Scout(5): Great Dexterity VI, (DEX=29)<br/>\n38: Paladin(21)<br/>\n39: Paladin(22): Great Charisma II, (CHA=16)<br/>\n40: Paladin(23): DEX+1, Epic Prowess, (DEX=30)<br/>\n<br/>\nHitpoints: 380<br/>\nSkillpoints: 182<br/>\nSaving Throws (Fortitude/Will/Reflex): 26/23/29<br/>\nSaving Throw bonuses: Mind Effects: +2, Traps: +2<br/>\nBAB: 30<br/>\nAB (max, naked): 44 (melee), 41 (ranged)<br/>\nAC (naked/mundane armor/shield only): 30/33<br/>\nSpell Casting: Paladin(4)<br/>\nAlignment Changes: 0<br/>\n<br/>\nDisable Trap 1(2), Discipline 43(45), Heal 30(32), Lore 6(12), Open Lock 1(11), Persuade 8(11), Search 4(5), Taunt 43(46), Tumble 40(50)<br/>\n<br/>\nThis is just a rough sketch, you can drop 2 Great Dexterities for Extend Spell and Toughness and keep all the feats you had except Cleave (which doesn't do much for a tooon with 7 attacks per round) and still end up with a really good AB / AC. I rearranged the starting stats which led to delaying ambidexterity until after dex was 15. No big deal, really, since you shouldn't dual wield until your AB is higher. I liked the combo here, the synergies you explored with this build are quite cool.<br/>\n<br/>\nMay I recommend you read the Game Guides section, more specifically my Complete Guide to the Basics of Character Building, where you will find EXCELLENT advice on building optimized toons. Kudos for the idea and the balls to post it, and once again welcome to the ECB, mate. May your stay here be a very fruitful one!<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "7:11 PM - Oct 20, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thazzle, great to see you posting already and thanks so much also for the story (a paladin build is always a welcome sight to my eyes, and especially a paladin build with a story--Good Stuff!). OK, see the dilemma here, and agree with Max re: the need to get more DEX which although CHA is quite cool, you're not a Smiter here so no need for so much CHA (even though, yes, makes the Harper Champion good looking.  <br/>\n<br/>\nThe Divines are nice, but don't last all that long so as to make more DEX worth it, I agree. With your buffs and potion making abilities, can get a nice boost from the Divines at 16 or so CHA, putting the rest into DEX for your AB and AC (which unlike the Divines, don't run out and/or need to be re-charged, but stay with you, I agree). <br/>\n<br/>\nI LOVE the Paladin, and Max has some rather nice suggestions there for you, to which I'll add: Take it to 25 Paladin, 5 Harper with the rest into FTR. At 5 off from 25 Pally, that's like having a pot of gold in front of you, reaching long and hard for it and finally getting there only to decide not to reach out for it. Unless something has totally changed in the 1.69 patch (see the Pally FINALLY got its Warhorse, heh, heh), 25 caster levels (i.e. 25 levels of Paladin) means your Paladin buffs cannot be dispelled. (This changed in NWN2, don't know why all of a sudden Paladins were treated differently, but in NWN2 paladin caster is only equal to half of your total Paladin level, meaning a NWN2 Paladin can NEVER get to be a non-dispellable caster (which is just plain awful); this, unlike in NWN (or PnP/D&amp;D),where Paladins remain, well, real Paladins. Namely, caster level equals your Paladin level and, so long as you get to 25-plus levels of Paladin, your buffs are solid--aka non-dispellable in turn). 25 Caster levels = the Pot of Gold!<br/>\n<br/>\nI like Max' suggestions for you, but with caster levels in mind, just a couple more suggestions in turn (i.e., with solid, non-dispellable buffs, means they can be counted on). Thus, no problem losing 2 FTR (I do like EWS shortsword, and impr.crit, seeing Armor Skin as the potential Candidate to drop. Assuming non-dispel/25 Paladin, the Champion will be fine--lots of great buffs, not to mention lots of damage options as well (there are some really good ones!). In terms of HPs, can get away with 400-ish (Max, put Toughness back in! 380 is too low). I would also think about dropping EITHER Divine Might or Divine Shield for i.e. Toughness, since both draw from the same pool. Ordinarily, I like Might; however, if bring your Naked, Unbuffed AB to 44 as is suggested above, bolstered by (at 25 Paladin) NON-DISPELLABLE Paladin buffs, then I'd be inclined to keep the DS but not DM (a nice AC boost when required, the Pally book having nice buffs/damage but not so much in the way of AC). (Note: 400HPs is about the minimum for anything that melees, so work Toughness back in there ... especially since with all that DEx and no uncanny dodge ... <br/>\n<br/>\nI don't disagree with Max when it comes to taking pre-epic feats in epic, though I prefer to get all my pre-epics before hitting the epic portion of my career, sometimes it just can't be helped. All that matters in the end is that you get to where it is that you are going, and have a ton of fun with it of course along the way. Some really nice suggestions there for you, and just a few thoughts that come to my mind as well. <br/>\n<br/>\nAnd to Ye Harper Champion I say, stay true to all that is just and good, and good and just ye shall always be!<br/>\n<br/>\n~ Tyr<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:26 PM - Oct 20, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Tyr, I don't know if that's a post 1.69 thing, but to be effectively undispellable, you need 24 CLs, not 25. There was a thread in the old ECB about that. Now as to your suggestion, I wouldn't advise dropping a feat, but if you must, go Paladin 29 HS 5 Ftr 6. You lose 3 Feats and gain 2, leaving you with even more caster levels and the same number of feats than your 25 Pally alternative. However I would advise you not to do that because the best paladin buffs are short-term, so 5% dispellability isn't much of a problem, especially for a non-UMDer with a mild feat starvation. IMO the best spread for this class combo is 23-12-5, and the second best is 29-6-5.<br/>\n<br/>\nAnyway, Thazzle, it's common for elder builders to disagree, because of playstyle differences. You have to take these suggestions and analize which one of them fits your playstyle better.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "8:19 PM - Oct 20, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Max, I was busy in the ECB2 when that memo went out, so didn't get it ... heh, heh. All fun aside, 1 more Pal (to 25) is worth more than an extraneous level of FTR (i.e., FTR 11 doesn't do anything more for you than FTR 10 does, with 12 FTR giving 1 extra feat true, but then 23 Pal isn't solid--i.e., MORD's. Thing about Paladin is, buff up good and fast on the go (not like the \"ritual\" needed by i.e. Clerics, etc.), and have a proper BAB / melee table as well (so don't really NEED a lot of buffs). Myself, when playing a Paladin, quite comfortable with a Natural, non-Buffed AB 40 (and ONLY say this when it comes to the Paladin--full BAB table, their book brings in so much more).  <br/>\n<br/>\nChampion in turn could drop for e.g. 2 GRT.Dex, which alone is easily offset by i.e. prayer (one spell) alone. That one spell alone gives +1 AB/Dam (+1 AC as well, as it reduces enemy AB/dam in turn among other things), and lasts one round per Paladin level--which be plenty long. Don't need UMD on a Paladin: come with their own spellbook, and there be some nice ones in there, (plus, saves are good,so don't exactly need \"shoring up\" i.e. UMD, not to mention come with self-healing, etc.  <br/>\n<br/>\nThat said I do entirely agree that some good hard AB/AC is good, and what Paladins as melee characters proper enjoy as well. I just don't see DM as a candidate here, not to drop toughness for, but do like DS on a build like this (run off the same pool, don't last all that long and with DEX/no uncanny dodge, the DS boost when needed would be good). Alas, Paladins I find are so misunderstood: they are a melee class, melee I tell you. (Lousy skill set, but that is the cost of a melee getting a spell book, not that FTRs etc. exactly get a good skill selection either, b/c they don't; with the pally spell book far better than have any other melee class, don't you think? Oh, wait, melee other than Paladin don't get a spell book, nor do they get UMD either .... LOL). Gotta say I do rather like the skills that the Harper brings here, along with the stacking and potion thing! Great RP-wise, and build wise (A Paladin with Tumble? SWEET!!!). That said, 29 Pal/5 HS/6 FTR (4 pre-ep for WS, 2 on epic for EWS, and which is really nice as that's +6 damage on both swords) would be best, don't disagree.  Cool combo, Thazzle. Look forward to seeing what you do!! (And thanks again for the story: I like stories, too! <br/>\n<br/>\nLet Right Prevail! ~ Tyr<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:36 AM - Oct 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">My thoughts on going charisma based.<br/>\nYou get glorious saves and a very high temporary bonus to AC and divine damage. The higher the charisma, the better your divine feats will be.<br/>\nThe downside is, like Max pointed out that your AB will suffer if you go overboard with charisma and forget strength, or as in this case dexterity.<br/>\nA sound fighter type build should normaly have a naked AB in the 40s. +44 is a good benchmark.<br/>\nBuilds that can self buff can get away with less. Paladins have that option with bless/aid/prayer/divine favor that can add +8 to AB for a limited period. GMW and holy sword will also add to AB, but will not help much once +5 weapons are available.  Normally a paladin can self buff strength and charisma. If you focus on dexterity, your harper scout can provide some dexterity buff, but i guess it will be of limited duration with only 5 levels in harper scout (correct me if I'm wrong.)<br/>\nPaladins also have the taunt skill that will help reduce the AC of your opponent.<br/>\nBuffing up for every fight,  activating the divine feats and taunting your enemy, takes some time. It makes the character more complicated to play, and the time you spend preparing for every fight has a negative impact on the overall effectiveness of your character. But then again your reward is better armor, a fair damage output and a certain \"coolness\" factor.<br/>\nI believe that a paladin with all available buffs should at least have a naked AB in the upper 30s, rather close to +40 (like Tyr recomends). A strength (or dexterity) of 20 along with full BAB progression and the AB enhancing feats should get you there, leaving plenty of room to build up adequate charisma.<br/>\n<br/>\nMy thoughts on dual wielding.<br/>\nDivine shield gives enough AC to let you drop the shield.<br/>\nDual wield inflicts a -2 AB penalty, so you should be careful since you don't have a high AB in the first place.<br/>\nStrength based damage bonus is cut in half on the off hand weapon. Charisma based divine damage from divine might is not reduced.<br/>\nEffective TWF forces you to take at least 15 dexterity.<br/>\n<br/>\nMy thoughts on a dexterity build.<br/>\nI like strength better than dexterity in this kind of builds.<br/>\nYou will need dex 26 in a paded armor to get an AC equal to a full plate. Maybe you can get there with buffs from harper scout. The alternative is leather armor (and dex 22) or a chainshirt (and dex 18), but the AC will be slightly lower.<br/>\nDex based AC is at best risky when you do not have the uncanny dodge feat.<br/>\nYou will not be able to qualify for epic dex based feats.<br/>\nYou do not take any dex based skills except tumble.<br/>\nStrength improves the damage output.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:44 PM - Oct 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Mick, I would like to offer a different angle on what you said.<br/>\n<br/>\nIn the alternative I offered, his naked AB is 44. He has Bless, Aid, Prayer, GMW and Divine Favor, and depending on magic level, he can cap both CHA and DEX (he can craft Harper Items), even if for a short time. that's +13 to Magical AB enhancement, with +6 from dex. This means 63 AB (61 DWing) and not factoring in a successful Taunt. With that kind of AB he shouldn't have any problem hitting. Now, with 7 APR (assuming Haste) and several damage bonuses (+5 GMW, +5 Divine Favor, +9 Divine Might, +1 Prayer, +1 or +2 STR, and maybe +3 Deafening Clang), he will have an excellent damage output and make the best use of the short-term damage buffs he has, which are many. <br/>\n<br/>\nANY PALADIN (Except my Ugly Mug Hero, who is more of a Fighter with many Paladin levels) is to me a mediocre character who has a few moments of godliness (real godliness). If he knows how to conserve his most important buffs for the most important battles, he will do well. CHA-based smiters, even my Holy WM with cheese are in the same area. They have average stats that are VERY BUFFABLE for a short time, which is generally enough to win any single battle. The STR-based alternative is cool too, no doubt, but then it makes less and less sense to take some Paladin specific features, like DM and DS. I like the synergies he explores here, so I'd say that you're selling this build a bit short when you say this. True, he doesn't get ED or SC, but there are some pretty nice things this build can do. Damage output shouldn't be an issue, in fact his DW will probably make him do more damage than the average STR-based Paladin just due to the extra attacks while fully buffed against most enemy types.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "3:18 PM - Oct 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Paladin a mediocre character? YIKES!!! So not true! (well, mine aren't, never have been, and I don't mean my Lionheart Ranger/WM or WM/Paladins or Wing Commander, my dev.criting Pal26/RDD10 either), but my GS VIII Paladin (with a Naked AB 40, +7Smite / Self-Buff 60,+12 Smite: 72, or for -1 ab gets GS X! Mick and I together worked on that GS smiter (please don't get me started on NWN2 ... LOL). Nope. Nothing average about the Paladin, or the fear/mind immunities and saves that are out of this world; nothing mediocre about it at all!! <br/>\n<br/>\nHoly Sword lest we forget also carries the on-hit dispel magic prop, so has its uses ...   This, in addition to Paladin Dispel (part of the good book) so as to remove buffs off enemies, hence more AB etc. likewise in turn (assuming there's something to dispel). Thing about going Dex based though, no discipline and all of its lost when caught flat-footed or prone. (I explored the Dex angle with SC-5 and ED, much better for high magic worlds, as is the case of ALL DEXERS, need equipment to do any damage, as damage comes not from DEX but STR. That said, the Pally book does help, this is true; yes, DM offers a nice bonus but takes time to turn on both DM and DS (which are great with high cha, whole thing about the divines and buffs being about the Smiting: incredible damage, enemy is dead. Dont' need the divines in turn to last at all long. A smite does the trick, often is the case you only need just the one (multiplies all of it on a crit., too). Then, thing about most dexers is they are sneak charged and rely on the stealth to deliver that damage, much the same way most Paladins rely on the Smite. Then, there's the balanced approach (all depends, if good v evil go smite and lots of it; otherwise, balancing makes sense, always did). <br/>\n<br/>\nBut regardless, no damage--whether sneak, smite, physical or otherwise--delivers itself. For that, need AB but also need to stand on one's feet to deliver it (dex without uncanny goes out the window AC wise, and dodge, tumble is also lost). Need a good AC to avoid being hit in the first place, and why DS (with the Dex) when REALLY need it works here, but to make DM and DS work would require (I believe) too much focus on CHA, taking away from Dex and other things a build (not Smite, not Sneak, not STR-damage based) like this needs. <br/>\n<br/>\nIn terms of Paladin buffs, assuming a 22 DEX (BAB 30, AB 40- with wf/ewf and EP), you're looking at 63 self-buffed<br/>\n (+3 aid, prayer, bless, +5 GMW (or Holy Sword, which also adds Divine damage v evil), +5 Divine Favor), add CHA modifier for a Smite Evil boni once per day. In terms of damage, though, Bull's helps, as will the +5 Divine Favor (magic), with 1d6 divine vs Evil (Holy Sword), with Bless weapon (2d6 divine) for undeads. So, no, not hopeless, but not the same as STR based (that doesn't depend on buffs). Suppose if she's playing in a higher magic world he'll be able to enhance magical weapons, but is the AB sufficient to hit when against high magic critters? That's actually when she'll enjoy her Holy Sword On-Hit: Dispel Magic the most. That said, all dexers are dependent on gear and lots of it to deliver any damage (with the exception of sneak-charged rogue/assassins, then, they also sneak reliant, attack through stealth, and a totally different beast; but as against the crit immune like undeads, heh, give me epic Paladin turning over that anyday ... heh, heh). FTR WS/EWS definitely also helps, if goes that route and which I highly recommend, too: gives 6 damage (which isn't buff dependent. An AB 40- (plus the buffs) to deliver, leaving enough for CHA charged DS (without Uncanny, I likewise worry when it comes to DEX based builds. Not an archer in the shadows, but a melee build. All that Dex out the window .... <br/>\n<br/>\nBut no, definitely NOT hopeless. and no body's saying that. What Mick's saying (and I happen to agree) is that'd be better if goes STR, as pooling off the same stat. for AB/Damage, as opposed to requiring STR (Dam), DEX (AG, AC w.o Uncanny), CHA (for divines) AND Wis for the spells on top of all of that, too. What I'm saying: So long as has a decent AB (40+) AND decent HPs (400 are minimum on a melee, ... WM crits do about 100 (or more) damage per crit, with 4 apr (and of course if haste is available, they get that, too). For PvM/E, though? Still 400. There be some really tough undeads out there (not all zombies are push-overs, and lots of things like to IKD). Thing is, saves are really nice, and has the Good Pally book, too. Trying to squeeze a lot in here, though. <br/>\n<br/>\nPulling a lot of stats--and that in turn thins things/results in equipment dependency. To put it another way, the more one tries to do, the more one needs more gear to do it. No way of sugar coating that ... <br/>\n<br/>\nThazzle: I am being quite gentle when I say that (those here who've long known me will tell you (I hope, or I'll SMITE 'em, heh heh) that I'm a nice person, but at the same time, I HATE it when people rely on gear. Really, who says you're going to get all that gear and as if not more importantly, even if you do, then everything you're up against has all that same great gear, too. (Had to be said, just did, otherwise some may begin to wonder if it's really me Tyr posting here. But I really am trying to be gentle, then, I liked your story. Appreciate that yoyu're trying to do something different, but watering down your stats unecessarily in turn.  Might want to have a look int he build search engine under builder name, Mithdradates who put together a Pal/HS/FTR for PvM--1-40; goes STR of it, to Naked AB 42 (Pal buff for more), and a really nice story that goes with it, too. <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build242563.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 42563.html</a>  .  <br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: did I mention that I Love Paladins? Rather quite like that --FINALLY--they can summon their War Mount, too.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:57 PM - Oct 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Tyr, on a side note, I have to tell you that Holy Sword has been nerfed, more specifically the DISPEL property you're talking about. The way it is now, it pretty much doesn't dispel anything anymore. I don't know the exact specifications of this, just the consequence.<br/>\n<br/>\nAs for Paladins, well, I like them as much as you do, and I have to tell you that I can't see how an AB of 40 can reach 63 with PAL buffs only, unless you're talking about smites, which only further enhances my point of view. What I mean is this: a fully-buffed AB of 63 can help in certain situations, but will a fully buffed AB be there for you in all battles? The answer is no. I'll take my pally WM as an example: She has a fully-buffed AB of 64, which is awesome! as well as a fully-buffed AC of 78, which is even more awesome! Now, with that said, she can't keep those buffs up long enough for more than one HARD battle a day. Most of the time, she walks around at 63 AC and 57 AB, which is average, not helpless. Now, it all boils down to where you play, but this toon built by Thazzle has some cool synergies. He just needs to invest on Listen or Spot, to make sure he sees his enemy coming. The loss of DEX to AC can be a pain, I have just mentioned my Magical Master toon on another topic, which is a DEX-based Cleric / Monk / Wizard with no Uncanny Dodge. True, he doesn't really need UD, cuz of all the nifty magicks he can pull, but nonetheless it's a pain, not a buildbreaker nor reason to go STR-based IMO. <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "2:12 AM - Oct 23, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Paladin gets the following: AB buffs: +5 Divine Favor, +1 Prayer, +1 Bless, +1 Aid,  +5 Holy Sword (or  GMW)]. Also, Bull's (+2 STR), which applies to damage, but not finesser. And yes, there is the Smite Boni from Cha (at 16 as you suggested, would be +3, lots more self-buffed of course). Hey, never said it was hopeless, remember? Just saying there are things to consider. Monk/Cleric get the WIS synnergies; Monk AC wis boni into AC which isn't lost when flat-footed, unlike DEX, no? That said, recall years ago some worlds (PvM/E) used to have \"Dragon Slippers\" (KD immunity). Perhaps he can get a hold of those.<br/>\n<br/>\nAnd yes, RP-wise, this build is unique and interesting, I agree. <br/>\n<br/>\nAs to the Holy Sword, are you serious?!? Wouldn't doubt it (in light of NWN2) but in past, for the on-hit dispel to trigger, actually have to do physical damage. If your enemy has damage shields and can't punch through to delivery a single point of actual damage (not divine, not magic, not elemental or anything else, must actually be physical damge for the on hit dispel to actually trigger)., then it doesn't trigger That's how it worked before, at least. Could that have been the case--i.e., not punching through, or ...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:20 AM - Oct 23, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Now it NEVER DISPELS, I am very serious, sadly. I used to be one of these fans of the Holy Sword, but it has been significantly nerfed and for a very long time. Oh well, paladins still rock anyway. Have you read my Paladin guide?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Thazzle",
      "avatar": "no_avatar.png",
      "timestamp": "4:31 PM - Oct 24, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A lot of activity! Truly awesome! I'm reviewing my build as we speak, trying to get that golden line between dex/chr and stuffing some paladin levels in early (seeking that Eagle's Splendor and Bull's Strength as quickly as possible!).<br/>\n<br/>\nI'm mostly just soaking up your words and trying to find my own middleway. I'm not going to go strength, because frankly, that would change the build too much, taking it away from the path I wanted for this particular build. So he doesn't have UD - Well.. No character will ever be perfect.  Also, the reasoning behind taking Harper Scout is for the dual buffs. Two times Eagle's Splendor and Cat's Grace and the two feats it gives. In a strength build the Cat's Grace would be much less interesting and there'd be much more interesting choices for a third class, than the Harper Scout (in my opinion).<br/>\n<blockquote><div>Thazzle: I am being quite gentle when I say that (those here who've long known me will tell you (I hope, or I'll SMITE 'em, heh heh) that I'm a nice person, but at the same time, I HATE it when people rely on gear. Really, who says you're going to get all that gear and as if not more importantly, even if you do, then everything you're up against has all that same great gear, too.</div></blockquote>\n\n... What gear? This dude is dressed in nothing but a second-hand padded armor that smells like fish and his swords might as well be wooden.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:57 PM - Oct 24, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">She said that because I was mentioning that with a little gear you can cap both stats.<br/>\n<br/>\nIf you want to follow the discussion more closely, without trying to guess when people could have posted in your topics, then you have the option to mark the box: Notify me when a reply is posted when you create a new topic. This topic has already been made, so you can edit the first post, which we call the OP (Original Post) and tick that box. From that point on, you'll receive an e-mail whenever someone replies to this topic. You can check the suggested build I offered and try to understand why I made the choices I made, and also read as much as you can in the Game Guides forum. There is a Paladin guide there, which I wrote.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "11:35 PM - Oct 24, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yep, that was the point. <br/>\n<br/>\nAs to the holy sword, did a bit of testing in a training hall and something buggy going on. Wasn't acting that way before (some of us around here been building pallys and turning them on their heads for a very, very long time, thoroughly testing everything and it fired alright in past, slicing through mages like a hot knife through butter, really. I don't know what's going on, but will test that in the OC, Max. Appreciate the heads-up about it; in the good Pally book, however, is dispel, but still ... (Information and truth about it SHALL prevail, we WILL figure out--exactly--what is going on with that Sword! <br/>\n<br/>\nPals always been the heavy hitter, any into baseball? The \"big hitter' of the group, with the one-shot kill (throws the ball right out of the park, everybody in on that home run, fans cheer, other team goes home. Game over!). Not about the skills or the AC (that's what DS is for, when needed, with a one-kill shot don't really need it that long; but that's the smite/classic Paladin, and nice to have a hard, natural AB for the i.e. stragglers, etc., true also forPvM/E and especially (not up against the \"boss\" all day long of course PvM/E, so save the buffs/your smite boni for when you do). PvP;s a bit different, one-shot is sweet, or take out the big bad sorcerer, let everyone else tend to the 'minions', only a bit hard(er) w.o the Holy Sword as dispel spell on that won't exactly do ... Anywho. That's Bioware for you; in PvM/E, don't need so much). Still, a hard, natural AB is proper on a melee regardless (40- is good on an epic STR based Pal,, having the good book for oh so much more, assuming non-dispellable, etc). Ok to take less Pal levels for PvM/E, although, if not STR-based as we've here discussed, no i.e \"one-shot kill\" so more of it, etc. would be good. Otherwise and notwithstanding, a nifty concept (new angles are fun, and RP value, too!). <br/>\n<br/>\nSo much more to the Pal than the smite alonee, different ways to mix. Then, different \"Holy Orders\" in the past (3 main ones, with smaller orders as well), and seems there's a Dex-based Harper one in the works, heh, heh (yes,  look forward to seeing what you do here as well). As to the guide you wrote, Max, happy to stop by and have a look at it, and possibly thus contribute as well (will be fun, I think so, too). We will figure out what the heck is going on with the Holy Sword as well, as that's just...wrong; guess it means testing one with \"holy avenger\" property supposedly built-in, too. As Pal, auto entitlement. <br/>\n<br/>\nMeantime, Thazzle, balance here is best, I agree. Otherwise, NIFTY! <br/>\n<br/>\nSlay evil ON! ~ Tyr<br/>\n<br/>\nEDIT: remove typos, etc.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:20 AM - Oct 25, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>TyrTemplar wrote:</strong>As to the guide you wrote, Max, happy to stop by and have a look at it, and possibly thus contribute as well (will be fun, I think so, too). We will figure out what the heck is going on with the Holy Sword as well, as that's just...wrong; guess it means testing one with \"holy avenger\" property supposedly built-in, too. As Pal, auto entitlement. </div></blockquote>\nHere is what I found on <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Holy_avenger\" rel=\"noreferrer\" target=\"_blank\">Holy avenger</a> in the NWNWiki.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:12 AM - Oct 25, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">See the last line? Now it caps at CL 10 on the dispel check, which is really bad...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "12:03 PM - Oct 25, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Mick. <br/>\n<br/>\nHoly Sword, etc<br/>\nI will test this proper in the OC, but what the Wiki says (sometimes it's right, many times it's wrong) makes sense as to what is going on. As I feared, NWN2 stuff has found its way into NWN1 via the Patch. In NWN2 as said, Pal treated as a \"spell sword\" (only 1/2 Pal levels count towards CL, meaning never get to non-dispel, which is stupid). NWN1 did NOT do that (thank the gods/goddesses), but did as it pertains to the Holy Sword then (just like in NWN2-first 20, capping it at CL 10 (or 1/2 Pally at that time), which is just wrong; then, MoTB expansion (NWN2 30) expanded melee \"nerfs\" all around--i.e, cool down on KD (Pal and every other melee), such that the sneakers with the HiPs were suddenly running amok, onlly for that in turn to be nerfed (cool down). Meantime, epic mages not nerfed when it comes to their spells, and melee can't simple dispel spell a mage (no Holy Sword) anymore than they can an epic NWN1 Pal (ie, no other melee could dispel a mage proper other than Pal, but with the Sword now at 1/2 (less actually both NWN2 and NWN1, there being 30 levels NWN2 and 40 NWN1 of course), .... rididculous. <br/>\n<br/>\nPal Holy Sword sliced (on hit: dispel), and how it's always been game wise and RP-wise (when evil mages turn to the dark arts, Templars kept them in check, and only melee to be able to do so--if built right, uber saves and immunities, godly AB/damage with Smite, Holy Sword ... etc.  <br/>\n<br/>\nOh, Bioware. At least NWN1 (unlike NWN2) didn't mess with Pal levels for purposes of CL for anything else, other than the sword change (still gets one for one for duration and of course dispel purposes, being good and proper and way it's always been), and still has of course proper warrior BAB table, etc. not to mention Smite, etc. SO NO CHANGE there at all, and that's good. Still, capping the sword at CL 10 (as opposed to how it used to be pre-patch),  is just plain ... wrong (agree with you totally, Max): this, both RP-wise AND EVERYTHING ELSE. But that's OK, I mean, Pals among other things still have the wonderful book and all that wonderful smite, etc. to send evil back to whatever plain of Hell from which it crawled ... <br/>\n<br/>\nSlay EVIL ON! - Tyr<br/>\n<br/>\nEDIT: just checked the files in-game, and Bio notes 1.69, and yep, Sword's nerfed as discussed [though Bioware claims it's \"fixed\" -- right, WoTC (PnP) 3.5, in which case should be 20 (enhance with a feat not available NWN1, but should be if doing so CL 24 or more at least, not that NWN1 follows 3.5 rules (always different)]. None of it makes sense, at all, but is what it is. Oh, well. But so what--seriously. Pals are still great. So much other stuff going on ithey're divine, really ...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}