{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "553",
  "name": "Going Rogue...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/going-rogue-t2355517.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 45,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:44 PM - Jul 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">It shames me somewhat that I've never really used the Rogue class as a rogue. I've used it often to grab what I can from it while focusing more on other things - after all, it's a very handy class to bolt on. Anyway, I thought now was the time to pay it some more attention - hence this.<br/>\n<br/>\nI've gone for a build with full capability to disarm, set and recover all epic traps (apart from plot-specific ones, of course), with a good measure of stealth and acceptable melee abilities (including 14d6 sneak attack damage).<br/>\n<br/>\nNaturally, I have questions: what to take as my final 2 Rogue bonus feats? I opted for Skill Mastery and Slippery Mind, but could easily have gone for an Epic Skill Focus or 2, or a couple of  Improved Sneak Attacks, or Self-Concealments. A shrewd or dodgy decision? I also find myself with 51 skill points to distribute. A sizeable chunk will go on Open Lock, but I have no idea how many is good enough to open all locks bar plot-specific ones. The rest I'm looking to distribute between a permutation of Heal, Lore, and Persuade, though there may be better options. If I followed the guidance correctly (which ain't guaranteed), I think I've done what I can with the Search and trapping skills.<br/>\n<br/>\nAnyway, do please have a look. Any feedback is welcome (I'd prefer it not to be over-rude, but hey, I'm sure I'll have had worse <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />).<br/>\n<br/>\n<strong>Rogue 28/ Fighter 4/ CoT 8</strong><br/>\nHin: any non-evil<br/>\nPvM 1-40<br/>\n<br/>\n<strong>Stats</strong><br/>\nSTR 12<br/>\nDEX 18 (34)<br/>\nCON 12<br/>\nWIS 8<br/>\nINT 16<br/>\nCHA 8<br/>\n<br/>\nHPs: 328<br/>\nAC: (naked) 33 (+med shield) 35<br/>\nSaves: Fort 27, Will 20, Reflex 39. +4 v spells, +2 v fear-type spells, +7 v traps<br/>\nSkills: 401. Disable Trap 43 (46), Hide 43 (59), Listen 43 (48) OR Spot 43 (46), Move Silently 43 (61), Search 39 (42), Set Trap 31 (43), Spellcraft (cc) 17 (20), Tumble 40 (52), UMD 34 (33). 51 spare for Open Lock, Heal, Lore, Persuade<br/>\nBAB: 26<br/>\nAB: (max, melee, Kukri) 43/ 38/ 33/ 28 (DW 41/ 36/ 31/ 26/ 41/ 36), (ranged) 38 (+1 with thrown weapons)<br/>\nSneak Attack: 14xd6 damage<br/>\n<br/>\n<strong>Levelling</strong><br/>\n1 R1: Exotic Weapon Proficiency<br/>\n2 R2: (Evasion)<br/>\n3 R3: Weapon Finesse/ (Uncanny Dodge I)<br/>\n4 F1: DEX+1 (19)/ Weapon Focus: Kukri<br/>\n5 F2: Blind Fight<br/>\n6 F3: Knockdown<br/>\n7 F4: Weapon Specialization: Kukri<br/>\n8 R4: DEX+1 (20)<br/>\n9 R5: Ambidexterity<br/>\n10 R6<br/>\n11 R7<br/>\n12 R8: DEX+1 (21)/ Two Weapon Fighting<br/>\n13 R9<br/>\n14 R10: (Improved Evasion)<br/>\n15 CoT1: Improved Two Weapon Fighting<br/>\n16 CoT2: DEX+1 (22)/ Improved Critical: Kukri<br/>\n17 R11<br/>\n18 R12: Improved Knockdown<br/>\n19 R13: (Crippling Strike)<br/>\n20 CoT3: DEX+1 (23)<br/>\n21 CoT4: EWF: Kukri/ EWS: Kukri<br/>\n22 R14<br/>\n23 R15<br/>\n24 R16: DEX+1 (24)/ Great Dex I (25)/ (Defensive Roll)<br/>\n25 R17<br/>\n26 R18<br/>\n27 R19: Great Dex II (26)/ (Epic Dodge)<br/>\n28 CoT5: DEX+1 (27)<br/>\n29 CoT6: Armour Skin<br/>\n30 CoT7: Great Dex III (28)<br/>\n31 CoT8: Epic Prowess<br/>\n32 R20: DEX+1 (29)<br/>\n33 R21: Great Dex IV (30)<br/>\n34 R22<br/>\n35 R23<br/>\n36 R24: DEX+1 (31)/ Great Dex V (32)/ Skill Mastery<br/>\n37 R25<br/>\n38 R26<br/>\n39 R27: Great Dex VI (33)<br/>\n40 R28: DEX+1 (34)/ Slippery Mind<br/>\n<br/>\nNot so much a draft build as a quest for knowledge. Hope you're all alright with that...<br/>\n<br/>\nThanks in advance. Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:46 PM - Jul 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">First of all Stag, this is a strong build, focusing for the most part on rogue.<br/>\nYou can play it as a rogue too.<br/>\nBut it is easy to see where you're coming from: 4 attacks per rund, dual wild, EWS, IKD, improved critical on kukris and AB 43.<br/>\nDon't get me wrong. There is nothing wrong with what we used to call a \"fighter-thief\". They can be very strong characters. But when you start out with a wish not to \" focus on other things\" and you ask for feedback, I would like to see what you can do without any full BAB class at all.<br/>\nThen we can talk rogue.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:56 PM - Jul 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Fair point, my friend. It can be hard to shrug off a natural bias. I'll have a more concerted effort at it. See, I just need an elbow in the ribs. Tbc...<br/>\n<br/>\nThanks Mick!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:06 PM - Jul 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">When making a Rogue-focused build, I like to spread out the non-Rogue levels so that your skills don't fall too far behind.  For example, at level 7, this build will have the skills of a level 3 Rogue, and will have a hard time with traps and locks.  Furthermore, you will want to take Rogue at levels that end with 2 and 7 to get the AC from Tumble as soon as possible, and with CHA 8, you might also want Rogue at levels that end with 3 and 8 for the next multiple of 5 UMD.<br/>\n<br/>\nI would take Two Weapon Fighting before Ambidexterity because TWF benefits all main-hand attacks, while Ambidexterity benefits only the off-hand attack, but then again, I wouldn't dual-wield until I have both anyway.<br/>\n<br/>\nSince your Reflex saves are so good, I would swap Improved Evasion with Crippling Strike.<br/>\n<br/>\nIf your opponent has Blind Fight, your protection from concealment is squared because they get a second chance if their attack is blocked by your concealment, so 50% becomes 25%, 40% becomes 16%, 30% becomes 9%, 20% becomes 4%, and 10% becomes 1%.  Because of this, it is not worth taking Self Concealment unless you go all the way to SC 5.<br/>\n<br/>\nFor the skills, I would max Open Lock and put the left-over points into Lore.  Maybe take 4 points of Appraise at level 1 and never touch it again.<br/>\n<br/>\nEDIT: I took so long to type this that it is no surprise that I was ninja'd.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:23 AM - Jul 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Stag<br/>\nNice build! I like having high Rogue with nice saves :)<br/>\nI really like how you are questing for knowledge, in fact with you sharing your quest, everyone learns including me!<br/>\nExotic Weapon Proficiency needs BAB +1, so you will need to move it from Level 1 to later in the build. Level 4 perhaps.<br/>\nKnockdown and Improved Knockdown I would take as soon as practical after getting 2 APR, another way to get sneak attacks is important.<br/>\nAgree with Empyre to take Crippling Strike at Rogue 10, improved evasion can be taken later, evasion is already strong, easier to knock them down with lowered strength.<br/>\nAlso agree with Empyre's to space out the non-rogue levels. There is the opportunity to max discipline in the build, and with 400+ skill points, why not :)<br/>\nEpic Traps are set with Modified Set Trap 45 with Take 20 or Skill Mastery, it is fine as it is as it is easy to find +4 dex to boost AB to get a +2 modifier but you can change that if you want<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:42 AM - Jul 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">All good stuff, thanks, everyone!<br/>\n<br/>\nI've tried to take a fair bit on board in a re-imagining. Mick will doubtless tut at me, because I'm still taking CoT, but there are reasons for it (and I don't make it to 4 APR - <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />). You decide...<br/>\n<br/>\n<strong>Rogue 33/ CoT 6/ SD 1</strong><br/>\nHin: any non-evil<br/>\n1-40 PvM<br/>\n<br/>\n<strong>Stats</strong><br/>\nSTR 10 (<em>that still hurts me</em>)<br/>\nDEX 20 (36)<br/>\nCON 12<br/>\nWIS 8<br/>\nINT 14<br/>\nCHA 8<br/>\n<br/>\nHPs: 306<br/>\nAC: (naked/robes) 32 (+med shield) 34<br/>\nSaves: Fort 23, Will 19 (<em>don't like anything below 20, but...</em>), Reflex 40. All +4 v spells, +2 v fear-type spells, +9 v traps<br/>\nSkills: 392. Disable Trap 34 (46), Hide 43 (60), Listen 43 (48), Move Silently 43 (62), Open Lock 43 (56), Search 40 (42), Set Trap 30 (43), Spellcraft (cc) 18 (20), Tumble 40 (53), UMD 34 (33). 6 spare.<br/>\nBAB: 25 (<em>Boo, hiss!</em>)<br/>\nAB: (3APR) (max, dagger) 42, (max, sling 43)<br/>\nSneak Attack: 18xd6 damage<br/>\n<br/>\n<strong>Levelling</strong><br/>\n1 R1: Blind Fight<br/>\n2 R2: (Evasion)<br/>\n3 R3: Weapon Finesse/ (Uncanny Dodge I)<br/>\n4 R4: DEX+1 (21)<br/>\n5 R5<br/>\n6 R6: Weapon Focus: Dagger<br/>\n7 R7<br/>\n8 R8: DEX+1 (22)<br/>\n9 R9: Weapon Focus: Sling<br/>\n10 R10: (Crippling Strike)<br/>\n11 CoT1<br/>\n12 R11: DEX+1 (23)/ Knockdown<br/>\n13 R12<br/>\n14 CoT2: Improved Knockdown<br/>\n15 R13: Dodge/ (Improved Evasion)<br/>\n16 R14: DEX+1 (24)<br/>\n17 R15<br/>\n18 R16: Mobility/ (Skill Mastery)<br/>\n19 SD1: (HiPS)<br/>\n20 CoT3: DEX+1 (25)<br/>\n21 CoT4: Great Dex I (26)/ EWF: Dagger<br/>\n22 CoT5<br/>\n23 CoT6: EWF: Sling<br/>\n24 R17: DEX+1 (27)/ Great Dex II (28)<br/>\n25 R18<br/>\n26 R19: (Defensive Roll)<br/>\n27 R20: Epic Dodge<br/>\n28 R21: DEX+1 (29)<br/>\n29 R22<br/>\n30 R23: Great Dex III (30)<br/>\n31 R24: Epic Skill Focus: Disable Trap<br/>\n32 R25: DEX+1 (31)<br/>\n33 R26: Great Dex IV (32)<br/>\n34 R27<br/>\n35 R28: Slippery Mind<br/>\n36 R29: DEX+1 (33)/ Great Dex V (34)<br/>\n37 R30<br/>\n38 R31<br/>\n39 R32: Great Dex VI (35)/ Improved Sneak Attack I<br/>\n40 R33: DEX+1 (36)<br/>\n<br/>\nWhat do we think of this one?<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:48 PM - Jul 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">To be honest, I think that Mick gave you bad advice and this is a step backwards.  You have halved your attacks per round, and reduced the damage per attack!  I would prefer the first build with the tweaks I suggested and the further tweak of taking Luck of Heroes at level 1 instead of Exotic Weapons, and then using daggers.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:05 PM - Jul 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Stag<br/>\nI think the updated draft is a strong build with 33 rogue levels that is a lot of sneak attack and a lot of skill points.<br/>\nWith 6 CoT levels I think you should try to get BAB 26 for that extra attack / round, without dual wielding it means an initial two hit flurry from stealth (ie HiPS) without Haste.<br/>\nI would just choose either a melee weapon or ranged weapon as your focus, I think it is too difficult to focus on both without more fighter or CoT levels for bonus feats.<br/>\nI think your goal of keeping Will above 20 is a noble one, and you can drop a great dexterity or two for Epic Will and maybe I would suggest epic fortitude too, as certain fortitude focused spells such as Implosion and Flesh to Stone there are no immunities to (ie death magic immunity does not protect against implosion) <br/>\nFighter rather than CoT can be considered as an option, for an extra feat and easier leveling, you would lose some saves, Paladin is another option for extra saves (double buffable with CHA and the other stat), disease/fear immunity especially if decide not to dual wield and drop the ranged weapon weapon focus (which I think is a luxury).<br/>\nI would change your weapon to shortsword mace or handaxe if you choose Fighter or Paladin for a little extra damage.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:12 PM - Jul 19, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Many thanks, both!<br/>\n<br/>\nIf you don't mind too much, I'll see what Captain Stabby has to add to the mix before doing much more. If, as I suspect, he was trying to drag me down a route that included some arcane/divine chicanery, shrift shall be short (and a big lady with a large sharp thing will be heading off up the fjords...). But if not, he's got a sly old touch for these things, so I'm tempted to hang fire. Hope that's alright with you.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:29 AM - Jul 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well Empyre, I have not given that much of advice yet. But I have given him a challenge. <br/>\n<br/>\nI do agree that a dual weapon focus is a step backwards.<br/>\n<br/>\nStag, in my opinion playing a rogue is to a large degree about having options and being able to control the field by planning ahead. <br/>\nSA is powerful and should be honed. That means taking a lot of it, having a reasonable AB and have many attacks per round for max damage per flurry. IKD helps land SA in toe to toe combat. Stealth gives SA and adds to AB when flat footed and when flanking.<br/>\nStealth also gives tactical advatages. <br/>\nHIPS adds an immense tactical improvement to stealth. In general HIPS is far more powerful than EWS.<br/>\n<br/>\nI already hear you ask: But what about sneak immunes, and what about true seeing?<br/>\nThis is where you will need options, both tactical and by different means to do damage. Here skills come into play. A carpet of traps and UMD for items and spells are examples. <br/>\nTraps and scrolls often work well against difficult warrior types too.<br/>\n<br/>\nRogue is also about defense with evasion, uncanny dodge, slippery mind, defensive roll, epic dodge and self concealment. UMD also adds here with protective spells cast from caster items or scrolls.<br/>\n<br/>\nRogues are also scouts, or commandos if you like, with hidden operations of gathring information and finding the best ways of initiating an attack. <br/>\n<br/>\nRogues gain entrance by opening locks and disarming traps and can be burglars and thieves.<br/>\nThey are masters of skills with most skills as class skills and the highest number if skill points per level.<br/>\n<br/>\nYou can build a rogue with focus on martial combat, armed or unarmed. He will be different from a pure warrior, but you can still play him as a warrior. <br/>\nYou don't need any advice on that. You already played the Halfling Champion and you know how to build a warrior.<br/>\n<br/>\nIt was not my intention to push this in the direction of mage. There are some good rogue/wizard builds, but UMD and scrolls will do for most rogues.<br/>\n<br/>\nI hope this makes it more clear where I try to get with this.<br/>\nPlaying a rogue can be a unique and quite different way of handling both combat and other situations in game. <br/>\nMy advice is to try it out and see for yourself if you enjoy it.<br/>\nWhen you know how to play a rogue, you will also know how to build one.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:55 AM - Jul 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Many thanks, Mick!<br/>\n<br/>\nI know you weren't really pushing me down a mage path, but I've met you and your roguish skills before, so you can't blame a chap for being suspicious <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />. Still learning - still enjoying!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:56 AM - Jul 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Stag<br/>\nIf I can add to Micks comments, when you do playtest a rogue, expect the first few levels to be very challenging solo, as one does not have a lot of sneak attack yet, no knockdown and skills are not fully developed and to get sneaks you will not want to tank without knockdown, HiPS or darkness/ultravision. It is best to use all the tools available to you- stealth, traps, UMD, picking off targets one by one, ranged weapons - to the maximum. Later on it gets much much easier. On the topic of UMD, early levels try out if you can, a wand of sleep on low will save enemies. You might enjoy that as a rogue :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:21 AM - Jul 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It was a pain in the bottoms to login from my phone but I had to do it since I this is of major importance ( or none at all, depending on the audience ) to this thread. <br/>\n<br/>\nInstead of repeating EXACTLY what Mick said in his first post, I will be more harsh than that.<br/>\n<br/>\nMake the best PURE rogue that you can. No multiclassing whatsoever, otherwise you will rely on a crutch &amp; play as you normally do with a smidge of sneaking instead. Learn to manipulate the shadows  for your benefit, learn the trap-stacking, learn to sneak first. Then, as you have made your first steps on this, add 1 level of SD. What a world of difference it will make!! And you will be laughing maniacly because then you'll know how to use it to the best effect. <br/>\n<br/>\nI know its hard. It is basically what I've told you in the Sorceress thread, but it really is the best way to learn new things,  I know you're a man of courage, I know you can take it &amp; that's why I'm getting on you hardcore-no quarters given. If you learn this properly, a whole world of different characters opens-up for you. <br/>\n<br/>\nDamn it, I can't wait till me or Mick will take you in a real PW &amp; show you a whole new world of possibilities &amp; have fun doing silly things ( all ECB members are welcome, obviously ) together! <br/>\n<br/>\nSo, learn &amp; learn fast :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:17 AM - Jul 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I can only echo Valerfor's advice - go full Rogue.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:55 PM - Jul 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Right then, full Rogue it is (to start with, at least). It doesn't help, btw, that no one's bothered to come up with one in the Yardsticks thread, so I can't really cheat <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />. There will also be the occasional bout of deliberate perversity from me (what can I say, it's in my nature): for example, in the build below I'm going Dwarf.<br/>\n<br/>\nAlright, off we go again...<br/>\n<br/>\n<strong>Rack and Ruin</strong><br/>\nRogue 40<br/>\nDwarf: any alignment<br/>\n1-40 PvM<br/>\n<br/>\n<strong>Stats</strong><br/>\nSTR 14<br/>\nDEX 18 (32)<br/>\nCON 14<br/>\nWIS 8<br/>\nINT 12<br/>\nCHA 6<br/>\n<br/>\nHPs: 320<br/>\nAC: (naked/robes) 29 (+tower shield) 32. (<em>Start wearing studded leather or hide. When DEX goes over 20, go to leather, and padded after DEX exceeds 22. After DEX reaches 28, play in robes. UMD and available robes might well render this advice redundant</em>)<br/>\nSaves: (<em>Can't pretend I'm happy with any except Reflex, but let's see if we can adapt</em>) Fort 18, Will 19, Reflex 34. All +6 v spells, +2 v poison, +11 v traps.<br/>\nSkills: 387. Disable Trap 35 (46), Hide 43 (54), Listen (or Spot) 37 (36), Move Silently 43 (54), Open Lock 43 (54), Search 41 (42), Set Trap 32 (43), Spellcraft (cc) 19 (20), Tumble 40 (51), UMD 35 (33)<br/>\nBAB: 25 (3 APR, 5 D-W)<br/>\nAB: (max, handaxe - <em>couldn't bring myself not to be dwarfly, here</em>) 40/ 35/ 30 (D-W 38/ 33/ 28/ 38/ 33). (max, ranged) 38/ 33/ 28<br/>\nSneak Attack: 22xd6 damage<br/>\nSpells: UMD<br/>\n<br/>\n<strong>Levelling </strong>(<em>All Rogue, so won't bother listing</em>)<br/>\n1 Blind Fight<br/>\n2<br/>\n3 Weapon Finesse<br/>\n4 DEX+1 (19)<br/>\n5<br/>\n6 Weapon Focus: Handaxe<br/>\n7<br/>\n8 DEX+1 (20)<br/>\n9 Knockdown<br/>\n10 (Crippling Strike)<br/>\n11<br/>\n12 DEX+1 (21)/ Two-Weapon Fighting<br/>\n13 (Skill Mastery)<br/>\n14<br/>\n15 Ambidexterity<br/>\n16 DEX+1 (22)/ (Slippery Mind)<br/>\n17<br/>\n18 Improved Two-Weapon Fighting<br/>\n19 (Improved Evasion)<br/>\n20 DEX+1 (23)<br/>\n21 EWF: Handaxe<br/>\n22<br/>\n23<br/>\n24 DEX+1 (24)/ Epic Prowess/ Defensive Roll<br/>\n25<br/>\n26<br/>\n27 Great Dex I (25)<br/>\n28 DEX+1 (26)/ Epic Dodge<br/>\n29<br/>\n30 Epic Will<br/>\n31<br/>\n32 DEX+1 (27)/ Epic Skill Focus: Disable Trap<br/>\n33 Great Dex II (28)<br/>\n34<br/>\n35<br/>\n36 DEX+1 (29)/ Great Dex III (30)/ Improved Sneak Attack I<br/>\n37<br/>\n38<br/>\n39 Great Dex IV (31)<br/>\n40 DEX+1 (32)/ Improved Sneak Attack II<br/>\n<br/>\n<strong>Sturm und Drang</strong> is next for construction...<br/>\n<br/>\nOver to you again. Cheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Made some amendments following Orion's advice<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:45 PM - Jul 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Looks nice Stag<br/>\n<br/>\nAnother option instead of handaxe is Mace. <br/>\nYou will then be a Dwarven Drummer of Skulls.<br/>\n<br/>\nI would try to find space for Epic Prowess<br/>\nThen you can take Epic Fortitude or Epic Will. <br/>\nSame AB, -1 AC and Reflex but better saves.<br/>\n<br/>\nSlippery Mind and Skill Mastery I would take before Improved Evasion. Improved Evasion and Defensive Roll essentially pre-requisites for Epic Dodge.<br/>\nI would swap the ranks in search and disable trap. I would then drop ESF: Disable Trap and swap that for Improved Sneak Attack for more damage.<br/>\n<br/>\nHappy to disclose I do prefer Human (extra feat, skill points) or Elf Rogues (+1 AB, Keen Senses, sleep immunity). Then dual wield shortswords.<br/>\nHalflings are very strong (+2 AB, +1 to saves, detection and stealth bonuses) but find it harder to knock down things which I don't like as much.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:56 PM - Jul 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion wrote: <a data-post-id=\"21324\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21324&amp;sid=3c9627613c46b9c4652db3bcd0eca554#p21324\">↑</a><div class=\"responsive-hide\">Jul 20, 2020</div></cite>Looks nice Stag<br/>\n<br/>\nAnother option instead of handaxe is Mace. <br/>\nYou will then be a Dwarven Drummer of Skulls.<br/>\n<br/>\nI would try to find space for Epic Prowess<br/>\nThen you can take Epic Fortitude or Epic Will. <br/>\nSame AB, -1 AC and Reflex but better saves.<br/>\n<br/>\nSlippery Mind and Skill Mastery I would take before Improved Evasion. Improved Evasion and Defensive Roll essentially pre-requisites for Epic Dodge.<br/>\nI would swap the ranks in search and disable trap. I would then drop ESF: Disable Trap and swap that for Improved Sneak Attack for more damage.<br/>\n<br/>\nHappy to disclose I do prefer Human (extra feat, skill points) or Elf Rogues (+1 AB, Keen Senses, sleep immunity). Then dual wield shortswords.<br/>\nHalflings are very strong (+2 AB, +1 to saves, detection and stealth bonuses) but find it harder to knock down things which I don't like as much.</div></blockquote>\nThanks Orion.<br/>\n<br/>\nWeapon is, of course, up for grabs.<br/>\n<br/>\nI like the idea of Epic Prowess and an epic save, and I'm fine with taking Slippery Mind and Skill Mastery before Imp Evasion.<br/>\n<br/>\nMy understanding of Disable Trap was that it required 48 modified ranks (46 with the synergy with Set Trap) to perform all actions (mostly recover and disarm) on epic traps, and Search required 42 modified ranks to immediately detect epic traps. That was what led to my decision. Is that wrong?<br/>\n<br/>\nWhile yes, an extra feat and more skills would be nice from Human, and keen senses and sleep immunity is good from Elf, I went with Dwarf because of its CON bonus, with no detriment to STR or DEX (the extra +2 saves v spells and assorted other stuff doesn't hurt either). Hin had crossed my mind, as it would, with all its little bonuses - and the larger bonus to DEX - but I always want IKD when going small, and I didn't have feats spare for it (in this build, anyway), nor the stat distribution as I'd need 13+ in INT.<br/>\n<br/>\nDwarf may be a perverse choice, but it's not a random one!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:55 PM - Jul 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong>Sturm und Drang</strong><br/>\n<br/>\nNow this one needs friends - preferably at least one of the hitty variety. The entire thought is to scout territory, lay minefields as appropriate, doink at least one enemy on the head with a rock, then blow them to bits as they chase after you (or similar). With boss fights, while your tanky/hitty friend keeps them occupied, you whistle merrily as you lay appropriate rugs of traps for them. You keep out of sight as much as possible - the very last thing you want is to be seen and cornered on your own.<br/>\n<br/>\n<strong>Sturm und Drang</strong><br/>\nRogue 40<br/>\nHin: any alignment<br/>\n1-40 PvM<br/>\n<br/>\n<strong>Stats</strong><br/>\nSTR 10<br/>\nDEX 20 (34)<br/>\nCON 12<br/>\nWIS 8<br/>\nINT 14<br/>\nCHA 8<br/>\n<br/>\nHPs: 320<br/>\nAC: (naked/robes) 31 (+med shield) 33 (<em>same principle as previously</em>)<br/>\nSaves: Fort 20, Will 18, Reflex 35. All +4 v spells, +2 v fear-type spells, +11 v traps<br/>\nSkills: 430. Disable Trap 34 (46), Hide 43 (59), Listen (or Spot) 43 (48), Move Silently 43 (61), Open Lock 43 (55), Search 40 (42), Set Trap 31 (43), Spellcraft (cc) 18 (20), Tumble 40 (52), UMD 34 (33). 43 spare points for a full Heal/ Lore/ Persuade/ the other detection skill.<br/>\n+50% self-concealment<br/>\nSpells: UMD<br/>\nBAB: 25 (3APR)<br/>\nAB: (max, melee) 26/ 21/ 16, (max, sling) 42/ 37/ 32<br/>\nSneak Attack: 20xd6 damage<br/>\n<br/>\n<strong>Levelling</strong><br/>\n1 Point Blank Shot<br/>\n2 (Evasion)<br/>\n3 Weapon Focus: Sling (<em>if I've got this right, you don't need finesse for chucking stuff: DEX applies to AB</em>)<br/>\n4 DEX+1 (21)<br/>\n5<br/>\n6 Rapid Shot<br/>\n7<br/>\n8 DEX+1 (22)<br/>\n9 Blind Fight<br/>\n10 (Skill Mastery)<br/>\n11<br/>\n12 DEX+1 (23)/ Iron Will<br/>\n13 (Slippery Mind)<br/>\n14<br/>\n15 Great Fortitude<br/>\n16 DEX+1 (24)/ (Improved Evasion)<br/>\n17<br/>\n18 Toughness<br/>\n19 (Defensive Roll)<br/>\n20 DEX+1 (25)<br/>\n21 Great Dex I (26)<br/>\n22<br/>\n23<br/>\n24 DEX+1 (27)/ Great Dex II (28)/ Epic Skill Focus: Disable Trap<br/>\n25<br/>\n26<br/>\n27 Great Dex III (29)<br/>\n28 DEX+1 (30)/ Epic Dodge<br/>\n29<br/>\n30 Self-Concealment I<br/>\n31<br/>\n32 DEX+1 (31)/ Self-Concealment II<br/>\n33 EWF: Sling<br/>\n34<br/>\n35<br/>\n36 DEX+1 (32)/ Self-Concealment III/ Self-Concealment IV<br/>\n37<br/>\n38<br/>\n39 Great Dex IV (33)<br/>\n40 DEX+1 (34)/ Self-Concealment V<br/>\n<br/>\nSo that's both of 'em. Let's see how they fly!<br/>\n<br/>\nCheers<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Made some alterations following Mick's comments.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:47 PM - Jul 20, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like S&amp;D. It's funny that you think S&amp;D needs a hitty friend while that question never pops up with R&amp;R.<br/>\nTry to go solo Aielund act 1 with S&amp;D. That will force you to find other solutions than what the standard melee build offers.<br/>\nI would take PBS immediately and rapid shot asap. Improved evasion is the last thing I take before ED. Dexers will usually make their reflex saves and do well with evasion alene.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:03 AM - Jul 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And don't forget to play Moody Blues in the background :<br/>\n<br/>\n<em>I'm just a wandering on the face of this earth<br/>\n</em><br/>\n<em>Meeting so many people who are trying to be free</em><br/>\n<em>And while I'm traveling I hear so many words</em><br/>\n<em>Language barriers broken, now we've found the key</em><br/>\n<em>If you want this world of yours to turn about you</em><br/>\n<em>You can see exactly what to do, don't tell me</em><br/>\n<br/>\n<em>I'm just a singer in a rock and roll band</em><br/>\n<br/>\n<em>A thousand pictures can be drawn from one word</em><br/>\n<em>Only who is the artist, we got to agree</em><br/>\n<em>A thousand miles can lead so many ways</em><br/>\n<em>Just to know who is driving, what a help it would be</em><br/>\n<em>So if you want this world of yours to turn about you</em><br/>\n<em>And you can see exactly what to do, don't tell me</em><br/>\n<br/>\n<em>I'm just a singer in a rock and roll band</em><br/>\n<br/>\n<em>How can we understand</em><br/>\n<em>Riots by the people for the people</em><br/>\n<em>Who are only destroying themselves</em><br/>\n<em>And when you see a frightened</em><br/>\n<em>Person who is frightened by the</em><br/>\n<em>People who are scorching this earth, scorching this earth</em><br/>\n<br/>\n<em>I'm just a wandering on the face of this earth</em><br/>\n<em>Meeting so many people, who are trying to be free</em><br/>\n<em>While I'm traveling I hear so many words</em><br/>\n<em>Language barriers broken, now we've found the key</em><br/>\n<br/>\n<em>If you want this world of yours to turn about you</em><br/>\n<em>You can see exactly what to do, don't tell me</em><br/>\n<em>I'm just a singer in a rock and roll band</em><br/>\n<em>I'm just a singer in a rock and roll band</em><br/>\n<br/>\n<em>How can we understand</em><br/>\n<em>Riots by the people for the people</em><br/>\n<em>Who are only destroying themselves</em><br/>\n<em>When you see a frightened</em><br/>\n<em>Person who is frightened by the</em><br/>\n<em>People who are scorching this earth, scor-scorching this earth</em><br/>\n<br/>\n<em>Music is the traveler crossing our world</em><br/>\n<em>Meeting so many people, we're bridging the seas</em><br/>\n<em>I'm just a singer in a rock and roll band</em><br/>\n<em>I'm just a singer in a rock and roll band</em><br/>\n<em>I'm just a singer in a rock and roll band</em><br/>\n<em>We're just the singers in a rock and roll band</em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:42 AM - Jul 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for both practical and esoteric contributions, guys!<br/>\n<br/>\nJust noticed that SuD has an impossible Disable Trap. 44 ranks taken? Thus, I shall re-introduce Epic Skill Focus in Disable Trap, meaning I only need to invest 34 points in the skill, to replace Improved Sneak Attack I (thereby taking my sneak damage down to a mere additional 20xd6). Which has the advantage of giving me an extra 9 skill points to play with - so I could almost max Lore, Heal, or Persuade - or even go for the other detection detection skill as well.<br/>\n<br/>\nRight, am about to hit the whisky before the hay, so you'll be getting little more sense from me tonight (let's assume there was some beforehand, eh?). Justin Hayward and the Moodies would bring a nice comfort blanket to my rest, so double thanks, Web!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:49 AM - Jul 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, bloody hell, that grain spirit... For unseen and unknown friends (and Web, you b'stard!)...<br/>\n<br/>\n<em>I wish I knew how</em><br/>\n<em>It would feel to be free</em><br/>\n<em>I wish I could break</em><br/>\n<em>All the chains holding me</em><br/>\n<em>I wish I could say</em><br/>\n<em>All the things I should say</em><br/>\n<em>Say 'em loud, say 'em clear</em><br/>\n<em>For the whole wide world to hear</em><br/>\n<br/>\n<em>I wish I could share</em><br/>\n<em>All the love that's in my heart</em><br/>\n<em>Remove all the bars</em><br/>\n<em>That keep us apart</em><br/>\n<em>I wish you could know</em><br/>\n<em>What it means to be me</em><br/>\n<em>Then you'd see and agree</em><br/>\n<em>That every man should be free</em><br/>\n<br/>\n<em>I wish I could give</em><br/>\n<em>All I'm longin' to give</em><br/>\n<em>I wish I could live</em><br/>\n<em>Like I'm longin' to live</em><br/>\n<em>I wish I could do</em><br/>\n<em>All the things that I can do</em><br/>\n<em>And though I'm way overdue</em><br/>\n<em>I'd be starting anew</em><br/>\n<br/>\n<em>Well I wish I could be</em><br/>\n<em>Like a bird in the sky</em><br/>\n<em>How sweet it would be</em><br/>\n<em>If I found I could fly</em><br/>\n<em>Oh I'd soar to the sun</em><br/>\n<em>And look down on the sea</em><br/>\n<br/>\n<em>Then I'd sing 'cause I know</em><br/>\n<em>Then I'd sing 'cause I know</em><br/>\n<em>Then I'd sing 'cause I know</em><br/>\n<em>I'd know how it feels</em><br/>\n<em>Oh I'd know how feels to be free...</em><br/>\n<br/>\nHonestly, next time Nina Simone drops round for a cup of tea, we'll be having words...<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:19 PM - Jul 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote: <a data-post-id=\"21327\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21327&amp;sid=17ef01718d33d1cdb554c477ffb59f98#p21327\">↑</a><div class=\"responsive-hide\">Jul 20, 2020</div></cite>I like S&amp;D. It's funny that you think S&amp;D needs a hitty friend while that question never pops up with R&amp;R.<br/>\nTry to go solo Aielund act 1 with S&amp;D. That will force you to find other solutions than what the standard melee build offers.<br/>\nI would take PBS immediately and rapid shot asap. Improved evasion is the last thing I take before ED. Dexers will usually make their reflex saves and do well with evasion alene.</div></blockquote>\nHell's teeth, that first Act is hard work! I've not finished it yet, but am down in the Wyvern caves. Two things strike me early on (oh, ha-ha) - I could really use both more traps and more stealth (HiPS would be lovely). Sorry, three things - traps, stealth, wealth. They do make you earn your first few levels, don't they? Time to go play with the bugbears now (the gods only know how I'll get all that armour out without collapsing...). Okay, four things, traps, stealth, wealth and bags. Might have to stash some gear, head back up, return, then take out my crossness on the rest. Time-consuming, this rogue stuff, innit?<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:44 PM - Jul 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Time-consuming, this rogue stuff, innit?</div></blockquote>\n<em>Tempus Fugit or not, as the case may be.</em><br/>\n<br/>\nI guess that is really the core of it, right there.  Rogue is a time-sink.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:11 PM - Jul 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As Yes were one of my favourite bands, I'm really not keen on their B(Y)uggles album, Drama, getting a reference.<br/>\n<br/>\nHowever, this one always makes me smile - and I was there at the time (contains rude language and a touch of dialect). Ladies and gentlemen, I give you The Everly Pregnant Brothers...<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.youtube.com/watch?v=jIIdTcWIUOk\" rel=\"noreferrer\" target=\"_blank\">Rammel Drawer</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:37 PM - Jul 22, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">More wealth, more stealth, more traps, more bags. <br/>\nThis is promising Stag<br/>\nYou have started to think like a rogue.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:46 PM - Jul 22, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote: <a data-post-id=\"21339\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21339&amp;sid=17ef01718d33d1cdb554c477ffb59f98#p21339\">↑</a><div class=\"responsive-hide\">Jul 22, 2020</div></cite>More wealth, more stealth, more traps, more bags. <br/>\nThis is promising Stag<br/>\nYou have started to think like a rogue.</div></blockquote>\nThanks Mick (I think...)!<br/>\n<br/>\nOn my way to boldly rescue a princess now. Just at the cave mouth. Think I've finally got to grips with laying my minefields in the wide open spaces and luring folk in (though those invisible merc sods were a nuisance - as were the shamans on the barbar screen). It's much easier in the dungeons and underground. I took advantage of some sage counsel from Hip about laying a carpet pretty much as soon as you arrive, then you've always got a \"safe\" killing field. You can always construct more as you go along. And at least there are loads of traps to recover from the merc screen as well, which is nice.<br/>\n<br/>\nI'd still sell my soul for a Stone of Recall or bags left as easter eggs. I'm a Hin, for Arvoreen's sake - and I'm sure I'm shorter now than when I began thanks to all this to-ing and fro-ing! Just as well my boots seen unwearoutable. Can I play with some friends when I get to Fairloch, please? Preferably burly ones who can carry lots (though I am still tempted by the picture of Maggie and I bursting from between Valennia's legs into combat - the girls on tour! Yes, I'm playing SuD as a girlie: Hin lads just don't seem to work with me - you shouldn't want to punch your own PC, really, should you?).<br/>\n<br/>\nOh, and another bit of good news, I'm likely to hit level 10 or maybe even 11 before landing in Fairloch - huzzah!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:03 PM - Jul 22, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice!<br/>\nWhen you get there, tell us how you disposed of mr. Black.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:54 AM - Jul 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think you have definitely earnt the right for a few companions if you can level a pure rogue to level 10 solo :)<br/>\nThat is honestly the hardest bit :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:22 PM - Jul 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the encouraging noises, both!<br/>\n<br/>\nRight, Mr Black has departed this world (well, for a while anyway). Afraid I had to rely on a little naughtiness (let's call it resourcefulness, to be kind) to do it.<br/>\n<br/>\nAs is standard practice for me, I parked Criosa out of harm's way, then laid my first minefield just level with where the first wave of merc attacks takes place, having let the valiant guards go belting headlong into the fray (and their doom) as a distraction.<br/>\n<br/>\nWhile they were off being hacked to ribbons and thinning the herd, I went trotting over to the emptier side of the screen (left side as you head down the screen), and put down a proper welcome mat. Then I went back and told Criosa to follow me, and made her stop behind this second field.<br/>\n<br/>\nI then scuttled back and pulled those I could into the first minefield. This only left Robert, two of his mercs, and the sorcerer on the bridge. Back to just in front of the second field, where I waved a cheery \"hello\" to them, and they pursued (except that damned sorcerer). Once they were in the killing field, I activated Criosa while I went to play with Spelly McSpell Face. Fortunately, the vast majority of his spells were spent, and I UMD'd and sneaked him to death from a distance. Returned to find Robert on his last legs (well, his horse's), his two friends dead, and a mangled princess-shaped corpse. It didn't take much for Robert to join his comrades in a dirtnap, immobilized as he was. I had one resurrection scroll (I checked before unleashing Criosa), and viola - one chirpy blonde princess intact once more.<br/>\n<br/>\nI lost a lot of potential loot there, it evaporated before I had time to retrieve it. But I couldn't have carried it all anyway and had no way of storing it. And I've only a couple of traps left. Off to Fairloch now at level 10 (might hit 11 on board ship), where life gets much easier...or not.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:19 PM - Jul 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A bit messy getting her highness killed, but apart from that: Well done! <br/>\nWith a rogue there are several ways to solve the boss fight. You missed out on some loot, but got the job done. I think you have learned some of the rogue game with this play through. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:01 PM - Jul 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I wonder if the story would be broken if you stealthed past Robert and entered the town without killing him.  You would miss out on a lot of EXP, but it would be an interesting experiment.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:08 PM - Jul 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote: <a data-post-id=\"21348\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21348&amp;sid=44a7708d3c1de90a6ffcef8c6d065d18#p21348\">↑</a><div class=\"responsive-hide\">Jul 23, 2020</div></cite>I wonder if the story would be broken if you stealthed past Robert and entered the town without killing him.  You would miss out on a lot of EXP, but it would be an interesting experiment.</div></blockquote>\nOoh, that's a thought! I suspect, though, it would make the explanation of his reappearance a wee bit odd in part 3, so it might be plot driven<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:23 PM - Jul 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Reload save, give it a try.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:52 PM - Jul 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You're really not helping Web. I'll be honest, or what's the point? I tried three other approaches and pegged out each time. I'm blowed if I'm trying again! You have a go! (<em>I bet he will, the smart-alec, and then I'll look even more of a dunce. Ah, well...</em>) Still, I do like me some Aielund, so all is well.<br/>\n<br/>\nI know I'd be keen to hear Mick's tactics here, but I also know he plays his cards close to his chest, so I shan't lose any sleep over it. I also know he only has the best of intentions...<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:08 AM - Jul 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Fair enough Stag, I'll show you some cards.<br/>\nAfter leaving the caves you come to a winter area before the area with the hill with the combat zone down to Culdeny. <br/>\nI take the Princess with me and talk to the sargent on the hilltop. I let them all follow me back to the winter area outside the caves. I ask tham all to wait there out of harms way and enter the combat zone alone. <br/>\n<br/>\nWith a trapper, I have taken ranks in craft trap. Then I can craft electric- and fire average- or strong traps. <br/>\nI pull the minions one by one over a trap (or two) with a ranged weapon, run off,  go stealth and attack with a sneak attack. <br/>\nThe spies come under stealth, ofte when you have pulled another minion. One on one they don't do much damage unless they can SA you. Have high detect skills, so you see them come. Use the archer's belt you found earlier to avoid all damage.<br/>\nWhen RB is alone, use a really thick carpet of low tier traps, or a carpet of average or strong traps. Pull him across and see his horse stumble and fall.<br/>\nIf his mage is still there, give him regular minion treatmemt.<br/>\nNow go back to Criosa and have her follow you to town. Ask the soldiers too, if you like.<br/>\nThere are of course other ways to do this. RB is on horse and faster than the others. If you can slow him (tangle), you can run in circles around the whole force with your boots of travelling, bombarding them with fireballs from a necklace or wand. You can combine that with a field of traps...etc.<br/>\nYou can also send forward your cannon fodder and bombard the melee group with fireballs. <br/>\nThese are just some ideas. I am sure that others have different approaches to this battle.<br/>\n<br/>\nIf you have HIPS - you can have that by level 8-  well that's another cup of tea.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:50 AM - Jul 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think I love you all over again Mick!<br/>\n<br/>\nHonestly, I wasn't asking, but thank you. I really didn't know you could draw the troops back to another screen. That final tip about running in circles is pretty much what I did with <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/dyse-monk-11-wizard-2-arcane-archer-27-t2354696.html\" rel=\"noreferrer\" target=\"_blank\">Dyse</a>, the gun'n'run AA I came up with a while back. Oddly - or maybe not - I've felt quite a bit of similarity between the two. \"No, I'll leave the messy stuff to the others, I'll be over here keeping my clothes clean, thank you very much,\" as well as belting round like a jack-rabbit. Hugely different in a, well, different way. Rogue: more comfortable indoors. AA more comfortable outside. But both reluctant to get up close and personal.<br/>\n<br/>\nOr I might be talking nonsense again.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:26 AM - Jul 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Those are really good rogue tips and specific for a challenging encounter in Aielund for a solo low level rogue, thank you for sharing them Mick!<br/>\nThere is a bit of arcane speedcasting in there too with the tangle traps and fireballs running in circles :)<br/>\nJust fabulous<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:21 AM - Jul 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">RB is fast, so running only works if you can slow him down. I must admit that I have not used this method in this specific battle yet, but I would like to test it out. The challenge is how to target RB when surrounded by his forces. He is faster than his troops. That should make it possible to single him out.<br/>\n<br/>\nAnother tip if you recover traps. Some mods give xp when you disarm traps. For some reason you don't get that xp when you recover floor traps. You get the xp when you recover traps from doors and containers, though.<br/>\nThis is especially important if you play rogue based modules where a substantial part of xp come from the use of skills; eg: A Dance With Rogues.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "DarkShinobi",
      "avatar": "10759009_1621031747.jpg",
      "timestamp": "2:54 AM - Jul 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What a fun build idea! And the concept regarding focus on a single class to master it, it is really a great approach. I just started another play run on Aielund and I want to give this build a try, but usually, when I am at the start it is the moment I sometimes give up because of the struggle, so Stag, I would like to ask for some advice on how did you face the first levels on the first part of Aielund. <br/>\n<br/>\nI am going to run an elf for this one but the build will mostly be the same as yours :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:13 PM - Jul 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello there, DarkShinobi - and thank you very much!<br/>\n<br/>\nI know what you mean about those first few levels in Aielund: I remember the first time I went there I was KBR (killed by rats), which did not make me feel good. This time I went very much against the grain for me, and took it all as slowly as I could - scouting out areas in stealth and trying, where possible, to pull baddies one at a time. At the outset, traps were hard to come across or afford, so I had to rely on my sling and those little things you can grab from the sage, such as tanglefoot bags. I also tried to prioritise getting the quests done - I could always go back later and mop up the screen - for maximum xp, and so faster advancement. I think my biggest investment in gear was a pair of Boots of Travelling, when I could afford it: they gave me a bit of an edge in getting away from horrid surprises. This was also the first time I made use of the catapult against the big wyvern. Essentially, it's all about getting to know your build, playing to its strengths and attempting to minimize opportunities for others to take advantage of its weaknesses.<br/>\n<br/>\nBeing honest, I would have loved Dante and Nell along with me, but that wasn't part of Mick's challenge. I'd also have loved a level of Shadowdancer for HiPS, and maybe some Monk because, frankly, I love me some Monk. But that's a thought for me to explore another day...<br/>\n<br/>\nSeeing your name, and with you saying you'd be going elf, one build popped straight into my mind. It's by Mick and contains no Rogue at all (perversely), but it is great. It's his <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/kama-shinobi-monk-9-assassin-26-sd-5-t2350791.html\" rel=\"noreferrer\" target=\"_blank\">Kama Shinobi</a><br/>\n<br/>\nHope this helps a bit!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:14 PM - Jul 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">How I avoid KBR:<br/>\nI buy 2 Alchemist's Fire from the sage.<br/>\nAfter talking to the farmer, I enter the barn under stealth and lob one AF at the first group of rats. That kills them all except the Big Rat. When the second  group of rats appears , I lob one at them too. Then I only have what's left of the Big Rat to worry about.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:00 PM - Jul 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote: <a data-post-id=\"21360\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21360&amp;sid=16d104210d795df37bd111de5bc977ce#p21360\">↑</a><div class=\"responsive-hide\">Jul 25, 2020</div></cite>How I avoid KBR:<br/>\nI buy 2 Alchemist's Fire from the sage.<br/>\nAfter talking to the farmer, I enter the barn under stealth and lob one AF at the first group of rats. That kills them all except the Big Rat. When the second  group of rats appears , I lob one at them too. Then I only have what's left of the Big Rat to worry about.</div></blockquote>\nI know it makes little difference in the grand scheme of things, but it's one of those niggles at the edge of my mind...do you get better xp the more chickens that are left alive at the end of that encounter? I suspect not, but you know how it gets with itches.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:25 PM - Jul 25, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you kill chickens or other farm animals, you get xp for it. AFAIK there is no bonus xp for saving the chickens.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:21 PM - Jul 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote: <a data-post-id=\"21363\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21363&amp;sid=16d104210d795df37bd111de5bc977ce#p21363\">↑</a><div class=\"responsive-hide\">Jul 25, 2020</div></cite>If you kill chickens or other farm animals, you get xp for it. AFAIK there is no bonus xp for saving the chickens.</div></blockquote>\nThat's a shame, really. In Baldur's Gate when you save Nessa (the Cow), you get a nice healing potion for yourself <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n@Stag, use a scroll of UV on yourself &amp; then darkness on your opponents &gt;&gt;&gt;&gt;&gt; PROFIT<br/>\nYou're doing fine, keep going!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:00 PM - Sep 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Quick update for those who may be interested (apologies to the rest of you).<br/>\n<br/>\nJust finished the second part of Aielund with Sturm und Drang, but no soloing this time. I'd have liked Ronan, but he's also a Rogue, so no real point. I ended up doing the girls on tour - me, Valennia, and Maggie. Maggie (our Hin Druid) remains superb, and Valennia, while a proper Barbarian lass, does take some management.<br/>\n<br/>\nBy and large it was a breeze, with the only real problems coming on the Isle of the Dead and in the final confrontation in the throne room. The first was down to those respawning Abyssal Spectres - Val running off before I could stop her (I give these people too much rope) and me unable to lay sufficient minefields. I ended up taking the quickest route to the dead dragon (picking up loot from poor deceased you-know-who). The dragon itself, and indeed the lich, were a walk in the park. The main problem with the throne room battle, was that it starts immediately after the cutscene, which gives you no time to prepare your killing field(s), so a lot of sneaking took place. Maggie and I concentrated on the Cleric, while Val took on the katana WM. Once we'd got rid of Chen (the Cleric) it was relatively simple - though Val did peg out. I brought her back before we went to rescue Criosa. Again. And great was the joy.<br/>\n<br/>\nOne little tip as a trapsmith. That screen you go to to track the hunter who's been killing folk is an absolute godsend. There are a good thirty-forty traps to be recovered in that area - makes blowing up shadow druids much easier!<br/>\n<br/>\nThe build still cries out for HiPS and either Monk or Assassin, but hey, what can you do?<br/>\n<br/>\nTbc, if I, and you, can be arsed.<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: Should have mentioned, I dropped Slippery Mind for Crippling Strike, and it really is your friend.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}