{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "025",
  "name": "Mestil's Half-Dead Juggernaut: Wizard 26 / Pale Master 10 / Fighter 4",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/mestil-s-half-dead-juggernaut-wizard-26-pale-maste-t2355300.html",
  "author": "grizzled_dwarflord",
  "avatar": "10758933_1548854436.jpg",
  "replies": "20",
  "views": "16.9K",
  "posts": [
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "7:16 AM - Jan 17, 2020",
      "content": "<div>This is a concept I explored before in the old classic, <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build252820.html\" rel=\"noreferrer\" target=\"_blank\">Mestil’s Pale Emissary</a>, which seems like two lifetimes ago.  I took the same premise, but turned it upside down (<em>to be honest, I was attempting to make a viable Gnome warrior build, and everything kept leading me back to Wizard, sigh</em>).  But after all is said and done, I can’t help but think this could be a thing.  Unlike the Pale Emissary, you make no pretense at being a true caster.  But you still have a full compliment of Wizard Spells, undispellable, Epic Warding, Auto Silent III, Silenced, Empowered and Maximized IGMS, Immune to Crits, Dev Crits, Sneaks, Paralysis, 9/- DR.  But the true coup d'etat is the nearly 1000 hit points he gets when buffed with Empowered Endurance and some minor Con-boosting items, and then another 1300 hit points from Epic Warding, and with Damage Shields dealing nearly 100 points of damage per successful hit!  Drop this little bugger into a crowd and watch ‘em pop!  With an unbuffed Concentration at 66, no one will be able to Taunt or interrupt his castings, nor will anyone be able to Silence him.  Ladies, I present to you a build that should be both banned and outlawed:<br/>\n <br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10758933_1ff621b04be9c2ac9b167460bda02be8.jpg\"/><br/>\n<strong>Title: Mestil’s Half-Dead Juggernaut</strong><br/>\n<strong>AKA</strong>:  <em>Gnome Queen of the Dead Lights</em><br/>\n<strong>Race</strong>: Gnome (<em><span style=\"font-size:75%;line-height:normal\">Dwarf will work in a pinch, but let the Gnome have his Glory for once</span></em>)<br/>\n<strong>Classes</strong>: Wizard26 / Palemaster10 /Fighter4<br/>\n<strong>Alignment</strong>: Any Non-Good<br/>\n<strong>XP Penalty</strong>: None<br/>\n<strong>Playable</strong>: 1-40 PvM<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Attributes</span></strong><br/>\nStr10<br/>\nInt18 (20)<br/>\nWis8<br/>\nDex8<br/>\nCon18 (32)<br/>\nChr8<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Level Guide</span></strong><br/>\n1 Wizard 1, Toughness, Spell School: Illusion, Summon Familiar (<em>Eyeball for Ray Attacks!)</em><br/>\n2 Wizard 2<br/>\n3 Wizard 3, Extend Spell<br/>\n4 Wizard 4, Int19<br/>\n5 Wizard 5, Craft Wand<br/>\n6 Wizard 6, Empower Spell<br/>\n7 Wizard 7<br/>\n8 Wizard 8, Con19<br/>\n9 Wizard 9, Silent Spell<br/>\n10 Wizard 10, Maximize Spell<br/>\n11 Wizard 11<br/>\n12 Wizard 12, Great Fortitude, Con20<br/>\n13 Wizard 13<br/>\n14 Wizard 14<br/>\n15 Palemaster 1, Spell Penetration<br/>\n16 Palemaster 2, Con21, (<em>can access 8<sup>th</sup> Level spells</em>)<br/>\n17 Palemaster 3<br/>\n18 Palemaster 4, Greater Spell Penetration <br/>\n19 Palemaster 5, (<em>can access 9<sup>th</sup> Level spells</em>)<br/>\n20 Palemaster 6, Con22<br/>\n21 Wizard 15, Great Int I, ESF: Concentration, <br/>\n22 Palemaster 7 <br/>\n23 Palemaster 8<br/>\n24 Palemaster 9, Great Con I, Con24<br/>\n25 Palemaster 10, <em>Crit/Sneak Immunity</em><br/>\n26 Wizard 16<br/>\n27 Wizard 17, Great Con II<br/>\n28 Wizard 18, Con26<br/>\n29 Wizard 19<br/>\n30 Wizard 20, Great Con III, Auto Silent I (<em>or Epic Spell Pen</em>)<br/>\n31 Wizard 21<br/>\n32 Wizard 22, Con28<br/>\n33 Wizard 23, Auto Silent II (<em>or Greater Ruin</em>), Epic Warding<br/>\n34 Wizard 24<br/>\n35 Fighter 1, EDR I<br/>\n36 Fighter 2, EDR II, Great Con IV, Con30<br/>\n37 Fighter 3<br/>\n38 Fighter 4, EDR III<br/>\n39 Wizard 25, Great Con V<br/>\n40 Wizard 26, Auto Silent III (<em>or Hell Ball</em>), Con32<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Combat Vitals</span></strong><br/>\nBAB: 21/16 (<em>but this matters not</em>)<br/>\nAC: 16<br/>\nHP: 702 (942 max)<br/>\nDamage Reduction: 9/-<br/>\nEpic Warding Soak: 1300 hit points<br/>\nImmunities: Criticals, Sneak Attacks, Paralysis, Stun, and Hold<br/>\n <br/>\n<strong><span style=\"text-decoration:underline\">Flame On!</span></strong>\n<ul>\n<li>Death Armor: 1d4+5</li>\n<li>Elemental Shield: 1d6+26</li>\n<li>Mestil’s Acid Sheath: 1d6+52</li>\n<li>Total Damage inflicted On Attacker, per strike: 86-99 points</li>\n<li>Maximized IGMS: 240 points (no save)</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Saving Throws</span></strong>\n<ul>\n<li>Fort: 32 (41)</li>\n<li>Reflex: 15 (24)</li>\n<li>Will: 23 (32)</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Skill Set</span></strong>\n<ul>\n<li>Concentration: 43 (66)</li>\n<li>Discipline: 41</li>\n<li>Spellcraft: 43 (48)</li>\n<li>Craft Wand: 5 (10)</li>\n<li>Listen: 28 (29)</li>\n<li>Lore: 15 (20)</li>\n<li>Heal: 43 (42)</li>\n<li>Open Lock: 1</li>\n<li>Search: 5 (10)</li>\n<li>47 Still Remaining (cross class Spot?)</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Strengths</span></strong>\n<ul>\n<li>Indestructible</li>\n<li>Undispellable</li>\n<li>Indefatigable</li>\n<li>Very Simple Spellbook for those awkward mage players</li>\n</ul>\n <br/>\n<strong><span style=\"text-decoration:underline\">Builder’s Commentary</span></strong><br/>\nGnome chosen for free Skill Focus Concentration and high Con.  There’s certainly enough feats here to customize to your pleasure.  For instance, one doesn’t need Auto Silence feats, but I thought it was useful enough in a build like this.  One could swap those for a Necromancy Spell Focus line, but it didn’t seem worthy enough since there’s no effort to increase your casting stat beyond 20 (Mestil’s Pale Emissary does a better job with that by getting a 32 Intelligence). Likewise, one could take ESF: Discipline and SF: Discipline to mitigate Knockdowns, but if you have access to KD immunity then just grab that and save two feats.<br/>\n <br/>\nWhile he has a low reflex save, it matters not because he has so many hit points, and he can mitigate any damage with Energy Buffers and Protection from Elements.<br/>\n <br/>\nFort Save is quite good and you really only need to worry about Save vs. Death Spells.  With a 41 save, he can probably whether most of those storms.  <br/>\n <br/>\nAC is low, but it’s supposed to be.  The idea is to soak damage with Stoneskins, Prems, Epic Warding.  But even if those wear off, your DR, Crit Immunity and high hit points should win you any day in combat.<br/>\n <br/>\nI considered Expertise/Improved Expertise taken during pre-epic to give you some situational AC when needed, but I pulled the plug on it at the last minute.  I think one should be okay without it.<br/>\n <br/>\nFinally, after playtesting, I think this build should be illegal in every regard in all PWs.  Nothing could withstand him in melee warm ups in the PGCC.  Once I ran through the gamut (to include Prismatics), I then spawned 4 different Level 40 class builds at once (Ranger, WM, AA, and Monk) and they perished in short order, though I will give props to the Ranger for lasting the longest.  Ranged types are a nuisance, and will be the subject of your Empowered IGMS.  Other casters can be problematic, but you’ll outlast them.  Just keep your Spell Mantles up (perfect use for 7<sup>th</sup> level slots), and wear them down with your high Fort Save and unnaturally high hit points.  You’ll be able to crush them with a volley or two of some Ikes.  Overall this is a very simple mage to play.  Spellbook management is easy, because you have your bread butter – Death Armor, Elemental Shield, Acid Sheath – followed by your normal buffs, Stone Skins, Freedom, Greater Stone Skins, Prems, Shadow Shields, Spell Mantles, Time Stop, Mords, a Greater Sanc, and a retinue each of normal Ikes, Empowered Ikes, and Maximized Ikes.  You have Craft Wand to make whatever you need (Invis, Improved Invis, ILMS, Stoneskin, Bulls, Find Traps, etc.).  You can scribe Time Stop Scrolls, Greater Sanc scrolls, etc. for even more goodness.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10758933_5f158f845cf830cb3b23d12e0cbc118a_t.jpg\"/></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:02 AM - Jan 17, 2020",
      "content": "<div>Thanks GDL for posting this build up. <br/>\n<br/>\nIt is always great to read your builds, they have great lore, great presentation, and great substance.<br/>\n<br/>\nI have worked hard over the last month to learn arcane builds. As a humble student of the arcane arts, I really like what you have designed. <br/>\n<br/>\nI can visualise this as:<br/>\n- an extremely powerful defensive tank<br/>\n- with a full wizard spell book providing plenty of versatility and offensive power<br/>\n- plenty of no DC damage dealing options <br/>\n- enough spell penetration (SP =30+1d20?) if ILMS/IGMS is desirable, with max toolset SR is 32 I believe so 5% chance of failure if they have SR at max toolset. <br/>\n- covered up the fragility aspect of the wizard class very well (900 odd hp with mostly d4-d6 hit die!!!)<br/>\n- a large amount of skill points to invest in anything you desire, albeit cross-classed for much of it<br/>\n- no multiclass experience penalties<br/>\n<br/>\nI can see you have very deliberately kept the AC low (including not taking EMA) to ensure your damage shields are always effective, and with critical hit/sneak attack immunity combined with damage reduction from stoneskin/greater stoneskin/premonition EW and EDR, I believe there would be little lost with that missing AC while you preserve the damage shields as an offensive option.<br/>\n<br/>\nI can see this to be a wonderful teammate for any party as well. It can tank, deal damage through magic shields, ranged damage through ILMS/IGMS, it can buff teammates (ie flame weapon/keen weapon/ empowered bulls/stoneskin/improved invis etc etc), and has a pile of skill points to spend as well to utilise for whatever the party needs, and craft wand/scroll so the UMD'ers in the party can have a great time too.<br/>\n<br/>\nI wonder how useful discipline will actually be in your build, with both small stature and low AC, the odds are stacked against this little one. It might assist with preventing disarms, but that may not concern you much, as any damage you deal will be through damage shields or spells. Likewise with called shots, I suspect having a lower dex score with the damage shields may actually be considered something useful. <br/>\n<br/>\n<strong><em>Edit</em>:</strong> to clarify, if knockdown immunity is available, then discipline could be dropped? <br/>\n<br/>\nI suspect you have left fighter late in your build for EDR I-III for those discipline skill dumps, and if discipline is dropped (I hope Stag is not reading this, he's about to eviscerate me now), then fighter could be taken soon after PM 10 for faster EDR I-III. Extra skill points could be allocated elsewhere, something that I would consider is a few value points in set trap, craft trap and a single point in disable trap (up to deadly trap setting/crafting &amp; retrieval of unused traps, if this is desired).<br/>\n<br/>\nI think spot is valuable for any caster build and I encourage some investment in it if True Seeing is nerfed in one's environment. It is better at seeing enemies at long distances than listen allowing one to prepare well in advance before unleashing some spell power from range to initate combat. In addition spotted enemies once spotted must go out of sight through hiding behind terrain such as walls, going invisible or using HiPS before another spot check is undertaken, whereas listen checks are constantly in place, and a listened enemy can become 'unlistened' particularly if walls or distance get in the way. <br/>\n<br/>\nSwapping fighter for Champion of Torm would allow access to Spot as a class skill at the cost of needing to take a melee weapon focus, one less combat bonus feat, loss of heavy armor proficiency, to me it seems pretty even, getting that spot score to close to 40 or more plus a few saves might cost a bit. Unsure if its worth it to be honest, it seems pretty even to me.<br/>\n<br/>\nAnything else I would have to suggest might be a minor tweak or two at most, congratulations on this build and thanks for posting this</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:02 AM - Jan 17, 2020",
      "content": "<div>I really like this!<br/>\n<br/>\nIt lives in fear of Breaches.<br/>\n<br/>\nBut I still like it!</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "12:22 PM - Jan 17, 2020",
      "content": "<div>Love this one.  <br/>\n<br/>\nCourse I'm a fan of most PM builds, but ya gotta love a caster with more hit points then many melee toons.   <br/>\n<br/>\nDefinitely on my list of next toons to roll up.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "1:18 PM - Jan 17, 2020",
      "content": "<div>The Ultimate \"Don't touch me!\" build!!!<br/>\n<br/>\nImagine getting a hug from this guy!</div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "3:59 PM - Jan 17, 2020",
      "content": "<div>GDL,<br/>\nYou have exceptional timing posting this outstanding build. This is a great counter and a good conversation point for the devastating critical discussion happening elsewhere.<br/>\n<br/>\nI have one question about it: why take INT 19 at level 4 when you could put it off until 16, and pick up CON 20 earlier?</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "4:43 PM - Jan 17, 2020",
      "content": "<div><blockquote><div><cite>Ten Pura wrote: <div class=\"responsive-hide\">Jan 17, 2020</div></cite>GDL,<br/>\nYou have exceptional timing posting this outstanding build. This is a great counter and a good conversation point for the devastating critical discussion happening elsewhere.<br/>\n<br/>\nI have one question about it: why take INT 19 at level 4 when you could put it off until 16, and pick up CON 20 earlier?</div></blockquote>\nWell.. I was gonna say for more skill points     :)<br/>\n<br/>\nbut then I went back and looked again and that aint it...<br/>\nnow ya got me curious as well.</div>"
    },
    {
      "author": "Iwan",
      "avatar": "10759046_1549435113.jpg",
      "timestamp": "11:34 AM - Jan 18, 2020",
      "content": "<div>Any suggestion to replace Craft Wand when it is nerfed on a PW server?<br/>\nIf dropping also Great fortidude what magic school focus would You suggest to pick?<br/>\nHow is this build superior to Your previous version <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build252820.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 52820.html</a> ?</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "12:25 PM - Jan 18, 2020",
      "content": "<div><blockquote><div><cite>Ten Pura wrote: <div class=\"responsive-hide\">Jan 17, 2020</div></cite>\nI have one question about it: why take INT 19 at level 4 when you could put it off until 16, and pick up CON 20 earlier?</div></blockquote>\nNo good reason, I can assure you.  I designed several different incarnations, and finally settled on this combo.  In some of the older versions I went for 20 Int right away, but then realized there was greater economy by postponing Wizard 15 until Epic.  So that's just a remnant of that.  <br/>\n<blockquote><div><cite>Iwan wrote:</cite>Any suggestion to replace Craft Wand when it is nerfed on a PW server?<br/>\nHow is this build superior to Your previous version <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build252820.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 52820.html</a> ?</div></blockquote>\nThey nerfed Craft Wand? Those sunzabatches!  How about Brew Potion?  Much more limited, but fits thematically for a gnome whackadoodle.  Other options would be SF: Concentration (for a raw Concentration score of 69 and probably my first pick), SF: Discipline, Lightning Reflexes (to get your Reflex to a nice stumblebutt score of 17).  <br/>\n<br/>\nAnother thought would be to take Strong Soul at Level 1.  Another +1 to Fort, +1 to Will, and a further +1 to Death Saves.<br/>\n<blockquote><div><cite>Orion2019 wrote:</cite>\nEdit: to clarify, if knockdown immunity is available, then discipline could be dropped? <br/>\n<br/>\nI suspect you have left fighter late in your build for EDR I-III for those discipline skill dumps, and if discipline is dropped (I hope Stag is not reading this, he's about to eviscerate me now), then fighter could be taken soon after PM 10 for faster EDR I-III. Extra skill points could be allocated elsewhere, something that I would consider is a few value points in set trap, craft trap and a single point in disable trap (up to deadly trap setting/crafting &amp; retrieval of unused traps, if this is desired).<br/>\n<br/>\nI think spot is valuable for any caster build and I encourage some investment in it if True Seeing is nerfed in one's environment. It is better at seeing enemies at long distances than listen allowing one to prepare well in advance before unleashing some spell power from range to initate combat. In addition spotted enemies once spotted must go out of sight through hiding behind terrain such as walls, going invisible or using HiPS before another spot check is undertaken, whereas listen checks are constantly in place, and a listened enemy can become 'unlistened' particularly if walls or distance get in the way. <br/>\n<br/>\nSwapping fighter for Champion of Torm would allow access to Spot as a class skill at the cost of needing to take a melee weapon focus, one less combat bonus feat, loss of heavy armor proficiency, to me it seems pretty even, getting that spot score to close to 40 or more plus a few saves might cost a bit. Unsure if its worth it to be honest, it seems pretty even to me.\n</div></blockquote>\n@Orion2019, Yes, you can drop discipline if KD immunity is available.  In fact that was one of my suggestions in the build write up.\n<ul>\n<li>Regarding taking Fighter earlier... eh.  I wouldn't.  It's more important to accelerate your Wizard levels and damage progression, spell slots, etc, than it is for the EDR feats.  The EDR can wait since you'll be relying on Prems, Stoneskins, Crit immunity, unnaturally high hit points, etc.</li>\n<li>Regarding Spot, yes, I suggested that would probably be a wise investment. There's plenty of skill points to toss around.  It would be crossclassed, of course, but you could end with a 28 Listen and 26ish Spot, which is better than what most folks will have.</li>\n<li>However, I would not swap Fighter for CoT.  You lose 2 feats: one for the WF and then another because Fighter4 provides 3 feats, but CoT4 provides only 2.  You would then have to lower your Wizard levels, or use another Epic General Feat on the EDR.  Not a good idea.  CoT provides less economy.</li>\n</ul>\n<blockquote><div><cite>Iwan wrote:</cite>Any suggestion to replace Craft Wand when it is nerfed on a PW server?<br/>\nIf dropping also Great fortidude what magic school focus would You suggest to pick?<br/>\nHow is this build superior to Your previous version <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build252820.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 52820.html</a> ?</div></blockquote>\n@Iwan, Sorry, Iwan, I didn't see the other 2 questions at first.  If you drop Great Fort (I would suggest not doing this because only Death spells are going to kill him in the end (or autofail 1), then you can take GSF: Illusion, but I would take SF; Necro for Wails.<br/>\nHow is it superior to Mestil's Pale Emissary?  I don't know that it is.  It's just different.  The MPE offers more variety, flexibility, is more of a Caster.  They offer the same Bug Zapper damage output.  This new version can withstand twice as much damage.  </div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:53 PM - Jan 18, 2020",
      "content": "<div>Greetings GDL,<br/>\n<br/>\nThanks for your reply.<br/>\n<br/>\nI have taken your build for a bit of a spin in WoG albeit at low levels, and I have already learned to hate archers. There is heaps in the toolkit to deal with em of course :)<br/>\n<br/>\nI made a few adjustments to your fantastic build (hope you view this as the highest complement, if anything!).<br/>\n<br/>\nI have taken CoT, but taken a value level pre-epic to increase fort by +2 and reflex by +2. <br/>\n<br/>\nI lose a pre-epic feat by having to take a mostly unhelpful melee weapon focus but I gain +2 fort from taking CoT 1 pre-epic (instead of taking Great Fortitude pre-epic). So funnily enough that equalizes things out. <br/>\n<br/>\nFrom this CoT level pre-epic I get a nice skill dump for spot which is nice for a caster, and the ability to equip martial weapons/shields/light/medium armor earlier, although due my ability to do much with any of it is limited, apart from any additional properties they might have (like a low AC item with damage reduction or resistances that I usually ignore might be quite nice!).<br/>\n<br/>\nI take EDR I at level 21 as a general feat on for a bit of earlier protection, then the rest of the EDR II and III as bonus feats later on as you recommended, which also allows for big spot skill dumps.<br/>\n<br/>\nSaves end up being slightly better with the small investment in CoT which gives +2 to all saves and is subject to the 20 saves cap. Fort is 34 and reflex 19 (from 32 and 15 respectively). <br/>\n<br/>\nI could drop ESF: Concentration for Epic Fortitude to pump Fort all the way to 38 but decided against it. Additional taunt resistance sounds valuable, it looks like only an enemy with the charisma score of the winner of the Miss Universe beauty pageant is going to succeed.<br/>\n<br/>\nI did drop auto-silent but maybe the build would be stronger with it.<br/>\n<br/>\nFinally skills wise I put some points in disable trap/set trap/craft trap for those who love that stuff but you can always drop that for heal skill.<br/>\n<br/>\nAnyway at best these are just small tweaks, that you or others might find interesting, it pretty much is the same build.<br/>\n<br/>\nAlso I noticed your listen score in your original build when I plugged the numbers into the CBC is higher [CBC says Listen 28(33) instead of 28(29) written]. <br/>\n<br/>\nI suspect this is from the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Gnome\" rel=\"noreferrer\" target=\"_blank\">hidden +4 listen bonus from small stature</a>. <br/>\n<details><summary>Spoiler</summary>Illusionist(26), Pale Master(10), Champion of Torm(4), Gnome\nSTR: 10\nCON: 18 (32)\nINT: 18 (20)\n\n01: Illusionist(1): Toughness, {Scribe Scroll}\n03: Illusionist(3): Extend Spell\n05: Illusionist(5): Empower Spell\n07: Illusionist(7)\n09: Illusionist(9): Spell Penetration\n11: Illusionist(11)\n13: Illusionist(13)\n15: Pale Master(2): Weapon Focus: Dagger\n17: Pale Master(3): {Darkvision}\n19: Pale Master(5)\n21: Illusionist(14): Epic Damage Reduction I\n23: Pale Master(7)\n25: Pale Master(9)\n27: Illusionist(16): Great Constitution I, (CON=24)\n29: Illusionist(18)\n31: Illusionist(20): Epic Spell Penetration\n33: Illusionist(22): Great Constitution III, (CON=28)\n35: Illusionist(24)\n37: Champion of Torm(3): {Smite Evil}\n39: Illusionist(25): Great Constitution V, (CON=31)\n\nSkillpoints: 276\nSaving Throw bonuses: Spells: +9, Mind Effects: +2\nAB (max, naked): 22 (melee), 20 (ranged)\nSpell Casting: Wizard(9)\n\n\n01: Concentration(4), Craft Trap(4), Craft Weapon(4), Disable Trap(1), Lore(4), Open Lock(1), Set Trap(2), \n03: Concentration(1), Craft Trap(1), Lore(1), Set Trap(1), Save(1), \n05: Concentration(1), Craft Trap(1), Lore(1), Set Trap(1), Save(1), \n07: Concentration(1), Craft Trap(1), Lore(1), Set Trap(1), Save(3), \n09: Concentration(1), Craft Trap(1), Set Trap(1), Save(9), \n11: Concentration(1), Craft Trap(1), Set Trap(1), Save(15), \n13: Concentration(1), Set Trap(1), Save(22), \n15: Concentration(1), Set Trap(1), Save(13), \n17: Concentration(2), Listen(2), Set Trap(1), \n19: Concentration(1), Disable Trap(1), Listen(1), Set Trap(1), \n21: Concentration(1), Set Trap(1), Spellcraft(1), Save(2), \n23: Concentration(1), Listen(5), Set Trap(1), Spellcraft(2), \n25: Concentration(1), Listen(1), Set Trap(1), Spellcraft(3), \n27: Concentration(1), Spellcraft(6), \n29: Concentration(1), Disable Trap(3), Spellcraft(1), Save(1), \n31: Concentration(1), Disable Trap(3), Spellcraft(1), Save(1), \n33: Concentration(1), Disable Trap(1), Spellcraft(1), Save(3), \n35: Concentration(1), Spellcraft(1), Save(13), \n37: Disable Trap(3), Spot(1), \n39: Concentration(4), Spellcraft(4), Save(1), </details></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "9:42 PM - Jan 18, 2020",
      "content": "<div>On your CBC spreadsheet you have the size modifiers option enabled, I assume that grizzled_dwarflord doesn't which explains the missing +4 bonus.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:16 PM - Jan 18, 2020",
      "content": "<div><blockquote><div><cite>Yunim wrote: <div class=\"responsive-hide\">Jan 18, 2020</div></cite>On your CBC spreadsheet you have the size modifiers option enabled, I assume that grizzled_dwarflord doesn't which explains the missing +4 bonus.</div></blockquote>\nAhhh thank you Yunim. <br/>\nI'll keep it enabled as it reflects what is happening in game, as they say, never believe the character sheet, didn't realise this also extended to skills too :)</div>"
    },
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "6:25 AM - Apr 04, 2020",
      "content": "<div>I really love builds that just do things differently and this one seems really awesome.<br/>\nI'm actually quite new to nwn, and am wondering how I would level with this build and how I would gear it (weapon? shield?).<br/>\nI've mostly figured out the spells required, but could really use some pointers on using this build.<br/>\n<br/>\nEither way, I'm definitely going to devote time to seeing how this build works.</div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "12:39 PM - Apr 04, 2020",
      "content": "<div>Early levels, have a summon out with a henchman. Buff up with spells like Mage Armor, Protection from Evil and Magic Weapon. Pull a single adversary at a time using a ranged weapon. Stay away from melee.<br/>\n<br/>\nFor bosses, know what their weak save is. As a general guide: Fighters/Rogues: weak Will saves, Clerics: Reflex, Sorcerers/Wizards: Fortitude.<br/>\n<br/>\nLow level boss killers:<br/>\n<br/>\nReflex:<br/>\nGrease<br/>\nCombust<br/>\n<br/>\nWill:<br/>\nTasha's Hideous Laughter<br/>\nColor Spray<br/>\n<br/>\nFortitude:<br/>\nCloud of Bewilderment<br/>\nGhoul Touch<br/>\n<br/>\nOnce you get to 7th level, play style completely changes with 4th level spell access, but that's another topic.<br/>\n<br/>\nSurviving Wizard's meager beginnings is the toughest part.</div>"
    },
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "10:05 PM - Apr 04, 2020",
      "content": "<div><blockquote><div><cite>Ten Pura wrote: <div class=\"responsive-hide\">Apr 04, 2020</div></cite>Early levels, have a summon out with a henchman. Buff up with spells like Mage Armor, Protection from Evil and Magic Weapon. Pull a single adversary at a time using a ranged weapon. Stay away from melee.<br/>\n<br/>\nFor bosses, know what their weak save is. As a general guide: Fighters/Rogues: weak Will saves, Clerics: Reflex, Sorcerers/Wizards: Fortitude.<br/>\n<br/>\nLow level boss killers:<br/>\n<br/>\nReflex:<br/>\nGrease<br/>\nCombust<br/>\n<br/>\nWill:<br/>\nTasha's Hideous Laughter<br/>\nColor Spray<br/>\n<br/>\nFortitude:<br/>\nCloud of Bewilderment<br/>\nGhoul Touch<br/>\n<br/>\nOnce you get to 7th level, play style completely changes with 4th level spell access, but that's another topic.<br/>\n<br/>\nSurviving Wizard's meager beginnings is the toughest part.</div></blockquote>\nThanks for that, I actually hit 18 last night playing on PW \"A Dawn of Heroes.\" So luckily I was carried through the early parts.<br/>\nMy last big remaining question though... what on earth is IKE referring to? I'm trying to ensure I have the right spells (which I'm learning through trial and error of course), but can not figure out for the life of me what IKE is... I get IGMS is the greater missile, but context clues tell me ike is some sort of buff.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:15 PM - Apr 04, 2020",
      "content": "<div>I don't see a reference to IKE...</div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "11:43 PM - Apr 04, 2020",
      "content": "<div>I think Ike is IGMS, I saw something like \"Yke's Yke\" in an old wizard build in the old ecb (listed within 6th lv spells)</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "12:17 AM - Apr 05, 2020",
      "content": "<div>Ike’s Yikes is an colloquial reference to Isaac’s Greater Missile Storm <br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "6:13 PM - Aug 26, 2020",
      "content": "<div>Hey GDL!<br/>\n<br/>\nNice interesting build concept there! I like the way you set it up to be the best at tanking and punushing people for attacking you. I'm curious as to how you'd deal with Drow Wizards with this guy, though?<br/>\n<br/>\nI know you have the elemental protection spells and most likely a wand of Prot. from Elements, but I was wondering if it wouldn't be viable to get 2 Epic Energy Resistance - Fire feats for those pesky Darkfire / FW meleers? Also, I don't remember very well, only returned to playing NWN recently and in the old WoG. How does that feat stack with the spells? Does the spell always get consumed first or does the feat resistance apply first to only then consume the spell protection with the leftover damage?<br/>\n<br/>\nP.S.: Was that the build you were testing when I ran into you on Ruskis 2 years ago?<br/>\n<br/>\nCheers and Kudos!</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "12:11 AM - Aug 27, 2020",
      "content": "<div>Well, I suppose Elemental Shield itself <blockquote><div>The caster is surrounded by a ring of fire that damages all opponents who make a successful melee attack on the caster. The damage inflicted is 1d6, +1 point per caster level. <em><strong>The caster also gains 50% immunity to cold and fire. </strong></em></div></blockquote>\n\nAnd Energy Buffer <blockquote><div>The caster gains damage resistance 40/- against all elemental forms of damage. The spell ends after absorbing 60 points of damage from any single elemental type.</div></blockquote>\n\nThat should hold long enough for the Acid to melt that Drow Wizard down.</div>"
    },
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "10:27 PM - Aug 03, 2024",
      "content": "<div>This build is by far my favourite wizard build. Original gameplay, fun, extremly tanky and a bit lazy for a spellcaster. The RP plus : an effective wizard with PM. Perfect for evil Undead RP.</div>"
    }
  ]
}