{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "358",
  "name": "Classical Dungeon Crawler - Rogue 12/Fighter 4/CoT 24",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/classical-dungeon-crawler-rogue-12-fighter-4-cot-2-t2349202.html",
  "author": "eatU4myT",
  "avatar": "10235276_1510287070.gif",
  "replies": 3,
  "posts": [
    {
      "author": "eatU4myT",
      "avatar": "no_avatar.png",
      "timestamp": "10:40 AM - Jan 28, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Whilst R/F/CoT is hardly a novel class combination, I've never seen one that wasn't built towards a specific goal, either Devestating Critical, Epic Damage Reduction etc.  My main reason for enjoying this class combo is how reliable and easy it is to play.  So:<br/>\n<br/>\n<br/>\n<strong>Classes:</strong> Rogue (12), Fighter (4), Champion of Torm (24)<br/>\n<strong>Race:</strong> Dwarf<br/>\n<strong>Alignment:</strong> Any Non-Evil (Usually Chaotic Good)<br/>\n<br/>\n<br/>\n<strong>I Stats:</strong><br/>\n<br/>\nStr\t16   (30)<br/>\nDex\t12   (12)<br/>\nCon\t16   (18)<br/>\nWis\t12   (12)<br/>\nInt\t14   (14)<br/>\nDex\t 6    (6)<br/>\n<br/>\n<br/>\n<strong>II Level Progression:</strong><br/>\n<br/>\n01\tR1\t         Strong Soul<br/>\n02\tF1\t         Expertise<br/>\n03\tR2\t         Iron Will<br/>\n04\tF2\t         Weapon Proficiency (Exotic), +1 Con<br/>\n05\tR3\t<br/>\n06\tF3\t         Weapon Focus (?)<br/>\n07\tR4\t<br/>\n08\tF4\t         Weapon Specialisation (?), +1 Con<br/>\n09\tR5\t         Toughness<br/>\n10\tCoT1\t<br/>\n11\tR6\t<br/>\n12\tCoT2\t         Power Attack, Cleave, +1 Str<br/>\n13\tR7\t<br/>\n14\tCoT3\t<br/>\n15\tR8\t         Blind Fight<br/>\n16\tCoT4\t         Knockdown, +1 Str<br/>\n17\tR9\t<br/>\n18\tCoT5\t         Improved Knockdown<br/>\n19\tR10\t         Crippling Strike<br/>\n20\tCoT6\t         Improved Expertise, +1 Str<br/>\n21\tCoT7\t         Epic Will<br/>\n22\tCoT8         Epic Weapon Focus (?)<br/>\n23\tCoT9\t<br/>\n24\tCoT10       Great Strength I, Epic Weapon Specialisation (?), +1 Str<br/>\n25\tR11\t<br/>\n26\tCoT11\t<br/>\n27\tCoT12\tGreat Strength II<br/>\n28\tCoT13\t+1 Str<br/>\n29\tCoT14\tArmour Skin<br/>\n30\tCoT15\tGreat Strength III<br/>\n31\tCoT16\t<br/>\n32\tCoT17\t+1 Str<br/>\n33\tCoT18\tGreat Strength IV, Epic Prowess<br/>\n34\tCoT19\t<br/>\n35\tCoT20\t<br/>\n36\tCoT21\tGreat Strength V, +1 Str<br/>\n37\tCoT22\tEpic Fortitude<br/>\n38\tR12\t<br/>\n39\tCoT23\tGreat Strength VI<br/>\n40\tCoT24\t+1 Str<br/>\n<br/>\n<br/>\n<strong>III Vitals:</strong><br/>\n<br/>\nSaving Throws (F/R/W): 43/36/36  (vs Spell: 47/40/40)<br/>\nHitpoints: 552<br/>\nAC: 13  (with mundane full plate &amp; large shield:  25)<br/>\nBAB: 27<br/>\nAB: 38/33/28/23  (with one mundane weapon of choice: 41/36/31/36)<br/>\n<br/>\n<br/>\n<strong>IV Skills:</strong><br/>\n<br/>\nSkillpoints: 262 (modified score)<br/>\n<br/>\nAppraise\t16\t(18)<br/>\nDisable Traps\t14\t(16)<br/>\nDiscipline\t43\t(53)<br/>\nHeal\t\t39\t(40)<br/>\nLore\t\t22\t(26)<br/>\nOpen\t\t19\t(20)<br/>\nPersuade\t20\t(18)<br/>\nSearch\t\t21\t(23)<br/>\nSpellcraft\t16\t(10) - Cross Class<br/>\nTumble\t\t25\t(16)<br/>\nUse Magic Item\t27\t(25)<br/>\n<br/>\n(Skills chosen very much for playability/roleplay reasons.  170 of the 262 skill points are gained by level 20, allowing you to take your Rogue skills to decent levels straight away, before slowly increasing Discipline, Heal &amp; Spellcraft.)<br/>\n<br/>\n<br/>\n<br/>\nI play this character as a reliable, do everything, no specific strength but no specific weakness type character, with a heavy emphasis on being playable all the way up, 1 - 40.<br/>\n<br/>\nHe can use any weapon in the game, and can choose any one weapon to take the Focus/Specialistaion feats to gain +3 to hit, +6 damage.  The choice can be based on player preference, or situational (Dwarven Waraxe for the look, Morningstar for vs Undead etc.)<br/>\n<br/>\nHe has the three main combat techniques sorted.  Expertise &amp; Improved Expertise bring his AC in mundane armour up to 30 or 35, which combined with 552 hitpoints lets him tank pretty well.  Improved Knockdown helps combat bosses, and opens them up to a sneak attack for +6D6 damage, +2 points of Str damage.  Power Attack &amp; Cleave let him chew through hordes quickly, consider switching in a 2-handed weapon here to gain the 1.5 x Str modifier.<br/>\n<br/>\nHis saves are strong, and balanced to avoid a weak spot.  Fortitude is higher than the others - at 43, this covers him against Devestating Criticals from anyone with a modified Strength of less than about 40!<br/>\n<br/>\nHe can identify and use most items in the game up to a value of around 300,000, and can get a decent deal buying and selling them.<br/>\nHe can find and disable all non-epic traps, open most locks, and get his own way in many conversations.<br/>\nHe avoids attacks of opportunity and most knockdown and disarm attempts, gains some bonuses to saves vs spell, and makes good use of healing kits.<br/>\n<br/>\nThe racical bonuses for Dwarves suit the character well.  All the skill bonuses are built upon, the Con bonus and Cha reduction fit, and the bonuse to saves vs spell help make up for the fact that Spellcraft is a cross-class skill.<br/>\n<br/>\n<br/>\n<br/>\nI know there are improvements that could be made to this build to improve it at level 40.  It is, for example, silly to take R12/CoT24, when R14/CoT22 would gain you Uncanny Dodge III, +1D6 sneak damage and an additional rogue bonus feat, all for the cost of -1 to saving throws.  However, the only place I can ever get these to fit in without changing the playability of the character is at levels 39 and 40, by which time it seems a bit late to be bothering.  But, for someone playing PvP or just at level 40, that would be an obvious step.<br/>\n<br/>\nThere will also be changes that could be made in the skills selection to suit power gaming.  You can dump Appraise &amp; Persuade to increase Tumble to 40 for the +3AC, and pump some more cross-class points into Spellcraft for another +2 saves vs spells.<br/>\n<br/>\n<br/>\n<br/>\nMy question to you would probably be, does the character suffer too much from Jack-of-all-Trades syndrome?  In taking a little of everything, have I left him with not enough of anything?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:02 PM - Jan 28, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey, man. Welcome to the ECB.<br/>\n<br/>\nThis build is, I must say, far from optimized. There are many improvements you could make to make it MUCH better, both in terms of level 40 power and playability. However, you must understand how certain skills work. Spellcraft, Tumble and UMD work up in increments of 5, which takes away the whole purpose of taking more than 4 Rogue levels pre-epic, which hurts your BAB. That same character could have +2 AB JUST FOR changing the pre-epic spread. Now, with that many Fighter and CoT levels, feats seem almost unnecessary, BUT you can go for many tweaks to improve this build. Here's what I'd do:<br/>\n<br/>\n1- I'd change the FULL SPREAD to Fighter 6 / Rogue 16 / CoT 18. You'd lose some saves and one CoT Bonus Feat, BUT, here's what you'd gain: MANY Skill points (do the math, but I think about 6 per added level of Rogue, so 24), 2d6 SA damage, 2 Rogue Bonus Feats, which you can take Crippling Strike and two Epic Skill Focus feats, which in turn will increase two of your skill modifiers by 10, allowing you to spread some other points around for more skill efficiency and more jack-of-all-tradeness. Or you can take Improved Evasion, which will go very well with your high saves.<br/>\n<br/>\n2- I'd change the pre-epic spread to Fighter 6 CoT 10 Rogue 4 for a higher BAB.<br/>\n<br/>\n3- I'd MAX Tumble for more AC. You get +1 to your AC for every 5 ranks in Tumble (BASE RANKS), so this is a no-brainer.<br/>\n<br/>\n4- I'd also tweak the starting stats. You could easily drop your DEX down to 10 for Wisdom 14 and +1 to your Will Save (which is your lowest) without altering the concept of the build. I'd also drop Strong Soul for Luck of Heroes. <br/>\n<br/>\nAt first glance, this is what I can see. Later on I may take another look depending on your reply. I'd recommend you read my <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/a-complete-guide-to-the-basics-of-character-building-t515440.html\" rel=\"noreferrer\" target=\"_blank\">Complete Guide to the Basics of Character Building</a> to understand how the pre-epic BAB progression works, if you don't already know, and if you do, then read it anyway, maybe there's something you'll learn or even something you can contribute from your own experience.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eatU4myT",
      "avatar": "no_avatar.png",
      "timestamp": "8:04 PM - Jan 29, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the welcome!  Some food for thought there definitely.  <br/>\n<br/>\nI can see the advantages of upping the rogue levels and dropping some CoT levels.  However, for me, that would mean even more of an incentive to take more rogue levels pre-epic.  I know where you are coming from - the less levels of the 3/4 BAB class you take pre-epic the better - but for me, that +2 BAB is not as important as being able to reach your target for all your rogue skills by about level 18.  And the answer there isn't \"just make sure you save one of the 4 rogue levels until then\", which would certainly enable you to raise one of your skills to its target, but you wouldn't have banked enough skill points to get them all up there.  Even Tumble, which for sure only helps later on in batches of 5, initially you are just racing towards a DC of 14, and picking it up 1 point at a time from the word go does help.<br/>\n<br/>\nI guess I am saying that only taking 4 rogue levels pre-epic would, for me, hamper the playability of the build at that stage enough that I wouldn't see that as worth a +2 BAB.  Really, in a build which only reaches an AB of 38/33/28/23, I would think that just having BAB at 16+ pre-epic for the final attack is good enough?<br/>\n<br/>\nAs for stats, you certainly could drop the Dex to 10.  I guess that's just force of habit, associating Dex 12 with Full Plate!  AC is hardly the highlight of this build, so dropping a point there wouldn't break anything.<br/>\n<br/>\n<br/>\n<br/>\nAs a complete aside from this build, is there an easy way to search these forums for builds by class?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:47 PM - Jan 29, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You could split the difference, taking 8 Rogue pre-epic, gaining +1 AB instead of +2.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/buildsearch/\" rel=\"noreferrer\" target=\"_blank\">The Epic Character Build Search Engine</a> does that for <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/guild.html\" rel=\"noreferrer\" target=\"_blank\">the archived old forums</a>, but these forums have no such search engine. You could try the standard forum search button, but it would find all mentions of the classes, rather than only builds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}