{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "253",
  "name": "grizzled_dwarflord: The DeathStroke: Fighter 8 / Rogue 2 / Assassin 30",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/grizzled_dwarflord-the-deathstroke-fighter-8-rogue-t2354374.html",
  "author": "campgod",
  "avatar": "10235244_1510287070.jpg",
  "replies": 7,
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "1:39 AM - Jan 28, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello, I really like playing Gizz's DeathStroke and was wondering If there was a way to somehow get Dev.crit into this build or would it just ruin it? If it would ruin the build does anyone have something along those lines? A sneaky dual dev. critter? Thank you for your time.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:04 PM - Jan 30, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Where is the build? lol<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:37 AM - Jan 31, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here it is Max,<br/>\n<br/>\n<strong>The Deathstroke</strong>: <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build208029.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 08029.html</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:18 PM - Jan 31, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Campgod! As usual, you can make it a Devastating Critical build, but WHY? You're wielding maces, which have a shitty crit range, and your STR is nothing to write home about. The DC for Devastating Critical is linked to your Strength modifier, which for this guy is +10. And he has Death Attack up the whazoo in supply for any non-immune enemies, and, save for Dwarven Defenders, all things that are immune to sneaks are also immune to critical hits. My points is you ALREADY HAVE ways of dealing with non-immune creatures that are extremely effective and hardly require further measures. You'd lose 2 Great Strengths in epics plus 3 pre-epic feats (Power Attack, Cleave, Great Cleave) to add very little to the build itself.<br/>\n<br/>\n In this case, IMO it's absolutely counter-productive to take DevCrit.<br/>\n<br/>\n I hope me outlining my thought process helps you figure out what the build is all about.<br/>\n<br/>\n Take it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "6:06 PM - Feb 02, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you Max, It really does make sense. Str isn't there, the maces crit range is not great for the Dev crit focus. I have no idea what I was thinking...I have been on the Dev crit thing lately and was just trying to think of diff ways of making one. I let the idea cloud my thoughts and missed the obvious reasons why it wont work with some builds, Thank you again for your time.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:07 PM - Feb 02, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>campgod wrote:</strong><hr/>Thank you Max, It really does make sense. Str isn't there, the maces crit range is not great for the Dev crit focus. I have no idea what I was thinking...I have been on the Dev crit thing lately and was just trying to think of diff ways of making one. I let the idea cloud my thoughts and missed the obvious reasons why it wont work with some builds, Thank you again for your time.</div></blockquote>\n<div align=\"left\">\n Cool, I totally understand. Let me give you a basic \"north\" for you to think of new ways of making a devcritter:<br/>\n<br/>\n 1- High STR: Builds that benefit the most from the feat are builds that have higher STR. Namely, all RDD builds have good DCs because of the sick STR enhancements, but not necessarily. Some Fighter / CoTs or Paladin / CoTs can also make good DCs because CoTs get extra combat feats, which frees up all general feats to be taken as Great Strengths, raising the DC. WMs also have good synergy with the feat because of the increased threat range. I would say you should look for ending STR scores of 32 or higher at the very least.<br/>\n<br/>\n 2- Available Feats: To get DevCrit, one needs to \"spend\" 4 pre-epic feats and 2 epic feats: Power Attack, Cleave, Great Cleave, Improved Critical pre-epic and Overwhelming Critical plus Devastating Critical in epics. That means that generally, it's nice to have a few bonus feats, lest you make a KD-less devcritter and find out playing a one-trick pony is not fun lol.<br/>\n<br/>\n 3- Weapon Threat Range: Well, if you are going to have a chance of killing people every critical, the more criticals the merrier for you. This means that you should probably stick to weapons with 18-20 and 19-20 threat ranges depending on the build's AB. Why do I say this? A Kukri WM can have a Threat Range of 10-20/x2 with his keened Kukri, but what good is it if you only hit on 12s or 13s? Much better to go for a Scimitar or Longsword for more damage in non-crits (or somehow enhance your AB) to take full advantage of the threat range.<br/>\n<br/>\n I hope with these ramblings you have a much clearer idea of what too look / aim for when building a Devcritter. Mick's Paragon of Pain is a good candidate with his high STR, for example.<br/>\n<br/>\n Take it EZ!<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:00 PM - Feb 02, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That being said, <strong>you can</strong> turn gdl's build into a dev/crit. one and the strength wouldn't be that low 28 (40), but the problem isn't there but mostly in the AB. Deathstroke get's 38 AB while Dual-Wielding his maces and that's OK'ish for an Assassin but not for a dev/crit. build that must \"enforce\" it's critical hits.<br/>\n<br/>\n Max is right about the rest, particularly the feats thing, since they require a heavy commitment from you.<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "10:22 PM - Feb 02, 2015",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Valerfor wrote:</strong><hr/>That being said, <strong>you can</strong> turn gdl's build into a dev/crit. one and the strength wouldn't be that low 28 (40), but the problem isn't there but mostly in the AB. Deathstroke get's 38 AB while Dual-Wielding his maces and that's OK'ish for an Assassin but not for a dev/crit. build that must \"enforce\" it's critical hits.<br/>\n<br/>\n Max is right about the rest, particularly the feats thing, since they require a heavy commitment from you.<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">\n Yes, val I myself said you can, but cmon, don't lie to him, man! 28 is TERRIBLY low unless you're playing the OCs. My Ugly Mug Hero has that at level 30 on WoG right now and is having trouble devcritting some mobs already. Mages go down easy, but that is 10 levels below cap and he still has some feats to take and 3 stat increases. At lvl 40 I think you'd just be the 5% devcritter counting on enemies to roll natural 1s. That is, as you well reminded us, IF YOU EVEN CRIT!<br/>\n<br/>\n GDL has this thing about low AB toons for some reason. Many of his great creations are like that. CItadel, Death's Rival, this one, Assassin King. IDK how he manages to kill WoG bosses!<br/>\n<br/>\n :D</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}