{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "133",
  "name": "Hypothetical Overpowered PvP Builds",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/hypothetical-overpowered-pvp-builds-t2355444.html",
  "author": "Yunim",
  "avatar": "10759176_1572007808.png",
  "replies": 13,
  "posts": [
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "10:57 PM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Recently I've been playing around with the NWN toolset in the hope of eventually being able to write and understand NWN scripts. As part of that I've decided to work on my \"ideal\" PvP server, although it's highly unlikely that I will ever actually make it since I'm really just interested in learning about scripting. I've already started planning the balance of the server since I want to do that before I'm limited by minor details such as whether the proposed changes are actually possible.<br/>\n<br/>\nThe focus of this post is potentially unbalanced PvP builds on this hypothetical server, in particular high AB and AC values. I've already got a list of some of the problem builds that could cause issues but I'm interested in other potentially OP builds I might have missed. I'm not looking for full build guides, the class spread alone will be enough for me to work with. Currently most problem builds have AB in the +55-+70 range and AC in the 65-80 range. This 10 AB/AC gap is roughly what I'm aiming for, I'm planning to balance damage next so it won't be a problem.<br/>\n<br/>\nThe relevant details for AB/AC are:<br/>\n<details><summary>Spoiler</summary>\nLevel 40 builds only, no alignment restrictions.\n3 or 4 maxed out abilities (eg can cap STR, DEX, WIS, and CHA with just items and potions).\nExpertise/IExp is disabled while casting.\nMage Armor is available for everyone, caster level 15.\n\nBarbarian Rage gives +2 AB, Greater Rage gives +3 AB, Mighty Rage gives +4 AB, these bonuses don't stack.\nThundering Rage adds +6 AB to the weapon (so actually only +1 AB since it's on a +5 EB weapon, but it penetrates the 40/+6 DR of dragons).\nDruid/Shifter\nAll item properties stack properly EXCEPT Shield AC which does not merge.\nI'm considering giving unarmed wildshape forms +5 EB creature weapons when shifted, but for now they are stuck with vanilla creature weapons.\nPM\n\nOath Of Wrath gives +10 AB vs Race to the weapon (so actually only +5 AB since it's on a +5 EB weapon, but it penetrates X/+10 DR).</details>\n\nBelow is the current list of problem builds. I only looked at rough minmaxed versions so the numbers might be off slightly.<br/>\n<details><summary>Spoiler</summary>\n===\n---\nBarb28/Bard2/RDD10 (Half Orc) - +66 AB. 66 AC.\nBard26/Pal4/RDD10 (Human) - +60 AB. 76 AC.\nCler28/Bard2/RDD10 (Human) - +68 AB. 75 AC.\nFigh8/WM28/PDK4 (Half Orc) - +72 AB. 58 AC.\nPal20/Bard4/PM16 (Human) - +64 AB. 77 AC.\nPal29/CoT10/Monk1 (Human) - +62/+76 AB. 72 AC.\nRang26/Bard4/PM10 (Half Orc) - +61 AB. 65 AC.\nRang35/PDK4/Bard1 (Half Orc) - +68 AB. 62 AC.\nDEX Melee\nMonk9/Cler26/SD5 (Halfling) - +65 AB. 73 AC.\nMonk21/Figh14/SD5 (Halfling) - +50 AB. 75 AC.\nRang26/Figh4/SD10 (Halfling) - +61 AB. 71 AC.\nRog16/Figh20/Pal4 (Elf) - +56 AB. 80 AC.\nRog19/Bard5/PM16 (Halfling) - +53 AB. 81 AC.\nWiz3/PM24/SD13 (Halfling) - 84 AC.\nRanged\nBard5/PM16/AA19 (Elf) - +64 AB. 74 AC.\nBard8/SD10/AA22 (Elf) - +66 AB. 64 AC.\nFigh8/Bard3/AA29 (Elf) - +73 AB. 65 AC.\nRog33/Figh6/SD1 (Halfling) - +55 AB. 71 AC.\nCaster\nBard24/PM16 (Halfling) - 86 AC.\nSorc38/Pal1/Monk1 (Gnome) - 67 AC.\nShifter\n[Dragon]\nDru18/Wiz21/Monk1 (Human) - +54 AB. 83 AC.\nRang21/Dru18/Monk1 (Human) - +63 AB. 78 AC.\n[Elder Air Elemental]\nDru20/Pal17/Monk3 (Human) - +54 AB. 86 AC.\n[Epic Kobold Commando]\nMonk18/Dru5/Shif17 (Human) - +49 AB. 80 AC.\n[Epic Manticore]\n---\nCler25/Dru5/Shif10 (Human) - +55 AB. 62 AC.\nMonk25/Dru5/Shif10 (Human) - +40 AB. 78 AC.\n[Risen Lord]\nDru5/Shif13/DD22 (Dwarf) - +46 AB. 56 AC.\n---\nCler25/Dru5/Shif10 (Human) - +56 AB. 58 AC.\nMonk25/Dru5/Shif10 (Human) - +41 AB. 75 AC.</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "11:47 PM - Apr 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What do you mean by problem builds?<br/>\n<br/>\nOnes with extrem-ish AB/AC?<br/>\n<br/>\nI did som Capture the flag. <br/>\nTrur seeing gave bonus to spot, but you could hide, so HiPS ould be abused (6 sec cooldown). <br/>\nI did well with a halfling dual-wielder, Rogue29/SD1/cant remember10. Probably Fighter or CoT. With traps, ED, shield after first flurry, HiPS, traps and all that.<br/>\n<br/>\nI actually built a Dragon with 14 DwD, giving me 18 DR. I can't remember the Druid/Monk split, but it did OK, as most Dragons do.<br/>\n<br/>\nShadow Priest ofc. I played that a couple of years on two separate servers before someone posted it. You have the split in your setup. It's good.<br/>\n<br/>\nMy trumph card though, was the old Paladin16/Fighter2/WM22. I think I could get 70 AB self-buffed + Taunt. Add to that a dispel that doesn't work anymore. But it should still be a decent hitter. <br/>\n<br/>\nAgain, what's a problem build? Something that must be balanced? Arcane casters will be your main problem.<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "4:18 AM - Apr 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm strictly talking about high AB/AC in this topic, I've already got plans for most of the more general \"problem builds\". DD shifters, Epic Warding, HiPS, and the really OP spells have already been taken care of. My basic idea was to nerf the really OP things, get a decent balance for AB/AC, adjust damage, then actually work on implementing those changes via scripting.<br/>\n<br/>\nBuilds like a Pal28/Bard2/RDD10 with +69 AB and 75 AC are the ones I want to balance around. AB and AC aren't everything when it comes to PvP but I still want a general grasp on any builds that really push the limits so that I don't accidentally make a really unbalanced environment.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "7:25 AM - Apr 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">And yet, the build you mention will be beaten by a Pal16/Bard14/RDD10. So you got your work cut out. Maybe easiest to ban RDD, or lay restrictions on it. <br/>\nAlso maybe a problem with Weapon Masters. HìPS. But with those gone, Clerics suddenly surge.<br/>\n<br/>\nI did play on a server where arcanes mostly did their own thing, qnd PvP often happened through in-game factions. They removed Dev Crit after a while, and we had loads of fun rpging and PvPing in groups. Bards shine in group PvP, but also makes them targets. Do a little research.if you can find someone from an adjusted PvP server and get some tips. It's a tough game you're doing.<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:48 AM - Apr 18, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Bard14/Pal16/RDD10 is exactly the sort of build I'm looking for, thanks for the suggestion. It reaches +71 AB and 76 AC which is higher than the Pal/RDD but still in an acceptable range. Removing the 4 AC from RDD10 is probably the easiest nerf to make, but for now I think I'll leave it as it is. I'm also planning on adding some kind of incentive for two-handers so that would probably lower the average AC values.<br/>\n<br/>\nThe main inspirations I have are Antiworld and Neversummer 4, I really enjoyed the PvP on both of those servers so I'm aiming for a similar level of balance on mine. Neversummer 4 is probably the most balanced (although not completely balanced) PvP server I've ever played on but it has so many changes that it requires a wiki. Unfortunately changing things to that level is far beyond me right now so I'm mainly looking at simple changes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "The Flying Rodent",
      "avatar": "no_avatar.png",
      "timestamp": "2:48 AM - Apr 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">(Time to randomly poke my head in again!)<br/>\n<br/>\nPvP in NWN is full of imbalance, so there would need to be an awful lot of changes made to head in the direction of the 'ideal' PvP server. And even then, there would most likely still be certain classes and builds that shine moreso than others.<br/>\n<br/>\nLooking at NWN <strong>vanilla </strong>classes in a Vacuum, purely from a melee perspective, here's a list of some of the more impactful abilities that certain classes have:<br/>\n<br/>\n<strong>Bard:</strong> Effective +7 AB/AC from song levels 16-24, +8 at 25-29 (assuming plenty of perform gear), +9 at level 30+.<br/>\n<br/>\n<strong>Cleric: </strong>+5 boost to AC/Natural/Deflection/Shield, can hit +20 AB cap, highest potential Spot skill in the game.<br/>\n<br/>\n<strong>Druid: </strong>Gets Dragon Shape, which can be problematic for PvP under certain conditions.<br/>\n<br/>\n<strong>Fighter:</strong> Gets a bajillion feats, so will end up being a 'mix class' for an awful lot of builds. <br/>\n<br/>\n<strong>Monk:</strong> Gets extra movement speed and Wisdom bonus to AC. <br/>\n<br/>\n<strong>Paladin:</strong> High Base AB, +8 to AB from spells, Charisma to saves. <br/>\n<br/>\n<strong>Pale Master:</strong> Highest amount of free AC available in the game, Crit/Stun/Paralysis immunity.<br/>\n<br/>\n<strong>Red Dragon Disciple: </strong>A range of free Ability points, free AC, Fire immunity.<br/>\n<br/>\n<strong>Shadowdancer:</strong> You only need 1 level of this to be exceptionally annoying.<br/>\n<br/>\n<strong>Weapon Master:</strong> Highest DPS class available in the game.<br/>\n<br/>\n---<br/>\n<br/>\nSo. I guess a starting point would probably be to nerf some of these classes in some way. I only really know Antiworld's ways of dealing with PvP imbalance, so perhaps these suggestions are short-sighted. But none the less, some suggestions could be:<br/>\n<br/>\n<strong>Bard:</strong> Lower the AB/AC threshold of Song. Antiworld had a max of +3 AB/+3 AC for pure level 40 bards, and some sort of level scaling involving skill points as well. I don't know if you would go quite this far, but at the very least I'd cap Song AC, and scale it so that more levels are required to hit AC boosting thresholds.<br/>\n<br/>\n<strong>Cleric: </strong>Lower the impact of AB buffing spells, and perhaps lower the impact of AC boosting spells (so that battle clerics are not so oppressive pre-20). This could be done on a spectrum of 'a few small nerfs' to 'so much of a hit that Clerics have to be played as casters and not battle-buff-bots'. Perhaps their buff spells could just not be made to stack with each other in terms of AB (capping it somewhere between +5 and +10).<br/>\n<br/>\n<strong>Fighter:</strong> Probably not much that could be done, other than buff other melee classes like Barbarian, Blackguard, Assassin and Ranger.<br/>\n<br/>\n<strong>Monk: </strong>This one's hard. <br/>\n<br/>\nMovement speed is nigh impossible to truly balance in any PvP game, and for NWN PVP it just enables monks to be hit-and-run bots with next to no counterplay, pending restrictions on standing still and hitting things (see Antiworld). So perhaps it could scale slower and have a cap of say 50% extra instead of 130% extra, and there should be Antiworld-style honour-bound restrctions preventing people from disengaging combat until at least 1 round has transpired.<br/>\n<br/>\nWisdom AC is fine most of the time, but there are certain circumstances where it is also problematic for balancing (Shifter builds, Zen Archer Caster clerics). So perhaps its' impact could be lowered for certain shapes (pretty sure Antiworld just gutted the concept entirely but made all AC items stack), and there could be a level scaling of say 5 +1 Wisdom AC allowed for each Monk Level (to dissuade the 1-monk class dips).<br/>\n<br/>\n<strong>Paladin:</strong> This one's also hard, because Paladins have a lot of things going for them. I'd probably just nerf Divine Favour (which would also hit clerics) to +3, but then also place a limit on Charisma-benefits scaling dependent on Paladin level (to dissuade the 1-3 Paladin dips for free saves/div shield, which would help against dumb AC Sorcerer builds that havent even been mentioned yet).<br/>\n<br/>\n<strong>Pale Master:</strong> They need some sort of extra weakness. Maybe 50% extra damage from Bludgeoning would be nice, similar to BSK, in addition to their reduced AC. Would incentivize people to use something other than high-crit-range pointy sticks at the very least.<br/>\n<br/>\n<strong>Red Dragon Disciple:</strong> Make them good at less things. I'd be inclined to take their AC away completely, and perhaps even give them something like a Cold damage weakness (so that Ice Storm would be their bane). Meddling with RDD abilities typically causes the game to flip the f**k out, so I'd probably leave those alone lol.<br/>\n<br/>\n<strong>Shadowdancer: </strong>Hide in Plain Sight is hard to balance as well. Antiworld did well with their honourbound restriction of 1 use every 18 seconds in combat, so perhaps this would be enough. <br/>\n<br/>\n<strong>Weapon Master:</strong> Maybe change the way their feats work, so that they apply more of an effect to Two Handed weapons than One Handed. WM's typically aren't 'too' problematic in PvP though (given that they're tricky to mix with other OP classes like PM and RDD), so perhaps they could just be left alone.<br/>\n<br/>\n---<br/>\n<br/>\nSooo there's some suggestions. Of course, you could just elect to buff other classes instead of nerfing these ones, but I think nerfing the obviously OP stuff would be a start.<br/>\n<br/>\nAnd then there are spells, items, etc. would need to be input in a certain way, but these would probably be easier to figure out once the server has been play tested a bunch. Assuming it ever gets made. :)<br/>\n<br/>\nBut I guess for the moment, you could toy with the idea of implementing a few nerfs, punch them into certain build combinations, and see how they effect the numbers? At the very least, you'll be able to reduce the impacts of certain 'overpowered' classes, which are ultimately what makes certain build combinations as strong as they are.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:59 AM - Apr 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The idea isn't to make a completely balanced server where any build can fight equally with any other build, just a place where the really overpowered feats/spells (such as Epic Warding and HiPS) are toned down. If somebody wants to click the recommended button and make a Figh40 then they can, but I wouldn't buff/nerf things to the point that they can compete with actual decent builds. Even with nerfs mages and clerics would probably still be top tier, just not the unbeatable monsters that they usually are in low/medium magic PvP. Most Rogue builds would still be countered by most PM builds, most mages would still be countered by most rakshasa builds, I'm fine with that kind of balance.<br/>\n<br/>\nRight now the only thing I've really focused on is the AB/AC balance, I want to work on damage and DI/DR next. I already have plenty of nerf ideas but I haven't looked at them in detail to balance them. Looking at your list, Monk Speed is the only thing that I haven't already accounted for. I would probably just leave it alone, there are already ways to deal with Monks.<br/>\n<br/>\nTo give a few examples of the planned buffs/nerfs: AAs and PDKs can penetrate Epic Warding (30/+10 DR), Assassins get scaling Magical damage, and builds with HS5 do Positive damage against enemies with critical immunity. So although PMs and DD/Shifters are still annoying builds there are now ways to fight them without relying on casters.<br/>\n<br/>\nIf I ever actually released the module I would stick with nerfing the major problems and then let the players find the resulting balance. Anything that's really broken would eventually be noticed and (ab)used, I could always nerf things after releasing it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "The Flying Rodent",
      "avatar": "no_avatar.png",
      "timestamp": "1:31 AM - Apr 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sounds like you’ve considered a few different things then. I like the Harper Scout and PDK changes, those classes need some love. <br/>\n<br/>\nWell, I guess if you wanted a summary of ‘the most OP aspects’ of NWN that require attention, then from a melee perspective , you’d be considering things like:<br/>\n<br/>\n- Bard Song,<br/>\n- AB boosting spells,<br/>\n- Monk Speed,<br/>\n- The Paladin’s kit in general,<br/>\n- Divine Wrath (though I guess if fights are drawn out then this isn’t an issue), <br/>\n- PM AC,<br/>\n- The RDD kit in general,<br/>\n- HIPS.<br/>\n- Various Shifter Shapes combined with Monk AC.<br/>\n<br/>\nI personally think you’re underestimating the impact of Monk Speed, but assuming it’s dealt with properly then it should be ok. My experience on PvP servers where it ‘isn’t’ dealt with, is that many people just default to builds that include Monk (eg Monk 9 Pal 9 CoT 22 two-hander). Because if you can’t beat them, join them, right?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "2:13 AM - Apr 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've almost decided on everything regarding AB/AC now, I'm planning to deal with damage next. The main two changes not aready stated in the OP are adding +5 EB to unarmed shifter forms (except dragons) and removing the +4 AC from RDD10. The AC bonuses from RDD15/20/25/30 will remain since they're not really a problem. I think PM and RDD AC changes can be done by editing 2da files in NWN EE, but I've only messed with a few 2da files so I'll leave those changes for later.<br/>\n<br/>\nAfter your suggestion I looked for a Monk Speed script but it appears to be hardcoded. So my options are to either apply a custom Haste effect to Monks or make a change that will requires haks. Ideally all of the changes I make will be server-side so for now I'll just leave it alone. I've got the hang of spell scripts, so if needed I could change a spell like Vine Mine to temporarily immobilize any character with more than 3 Monk levels. The main downside is that most Monk builds would be hard countered by most Druids, although I could make it so that the duration is based on the ratio of Monk and Druid levels.<br/>\n<br/>\nCurrently I've edited some spell scripts and Oath Of Wrath, the next thing I'm planning to work on is shifter item merging.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:23 PM - Apr 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am impressed with your ambition here Yunim. <br/>\nI really look forward to where this will take you.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "7:43 PM - Apr 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Revival of Antiworld......<br/>\n<br/>\nSent fra min SM-G981B via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "10:43 PM - Apr 24, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Since this is a discussion about PvP (albeit about OP builds) - are the old GodMode 2das no longer viable?<br/>\n<br/>\nDid NWNEE kill those?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "12:07 PM - May 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Currently I've finished scripting most of the easy stuff and I have a rough idea of how to do some of the tricker stuff. I'm now trying to decide how to limit spamming, unlike Antiworld I want to try and script it rather than use an honour system. To begin with I'm working on spells since they're easy to change, but eventually I want it to work on hardcoded things like Disarm and Knockdown too. I've got a few questions about how cooldowns should be applied with respect to a team PvP environment.<br/>\n<br/>\nI'll use Terrifying Rage as an example since I'm using that as my prototype. Currently when an enemy enters a Terrifying Rage aura they get given a temporary immunity to Terrifying Rage. If they are immune or if they pass the save then they get 3 rounds immunity, if they fail the save and get paralysed then they get immunity until 3 rounds after the effect ends. The main problem with this is that it's possible to remove the paralysis. With Terrifying Rage it's not too bad, but when it applies to all limited abilities/spells there will be issues.<br/>\n<br/>\nFor example, let's say you fail the save and get a 3 round paralysis. You now have a 6 round immunity to Terrifying Rage from the moment you fail the save. However an ally could remove the paralysis effect with FoM, at which point you still have the full 6 round immunity despite not having the full 3 round paralysis. Ideally casting FoM would lower to timer to 3 rounds from save fail or remove the immunity if 3 rounds have already passed since the save fail, but scripting that seems pretty tricky with the inbuilt functions. This would also apply to spells such as Dominate Monster and the Bigby line, so this could result in a significant immunity duration despite the target being free of the spell effects.<br/>\n<br/>\nDo you think it's worth attempting a fix for this or should I just accept the potential problems it can cause?<br/>\nI think I have a possible solution but it would take a lot more work than the current system.<br/>\n<br/>\nAnother problem is that this immunity applies to all uses of Terrifying Rage, regardless of the Barbarian using it. So if you pass a 20 DC Terrifying Rage you are now immune to Terrfying Rage for 3 rounds even if you are fighting a different Barbarian with a 50 DC Terrifying Rage. This means that if you're facing two clerics with Implosion they can only cast 1 Implosion on you every 3 rounds, instead of 1 Implosion each every 3 rounds. The main advantage is that chaining death/disable effects would be harder, but it would also cause issues with team composition and build overlap.<br/>\n<br/>\nShould I leave this or should I make the immunity work per caster?<br/>\nPersonally I haven't decided which method is best. Leaving it would make team composition an important factor but I can also imagine the frustration it would cause for casters.<br/>\n<br/>\nFinally, I'm looking at a spell category list similar to the one that Antiworld had. For example all death spells would be on the same timer, so you can't just cast Destruction if your Implosion fails.<br/>\nThe current categories I have are:<br/>\nDeath (eg FoD, Implosion, Wail)<br/>\nMovement Restriction (eg Balagarns, Bigby9, Dominate Monster)<br/>\nDisabling, which is pretty much every other non-damaging DC spell (eg Energy Drain, Sunburst, Word Of Faith)<br/>\n<br/>\nShould I split the disabling category into more groups or will these 3 categories cover everything?<br/>\nI remember Antiworld had more categories but I can't remember the specific types.<br/>\n<details><summary>Spoiler</summary>====\n---\n===\n---\nRage: +2 AB from Rage. +3 AB from Greater Rage. Rage and Mighty Rage don't stack.\nTerrifying Rage: DC is Intimidate/2 + 1d10, capped at 50 DC. Works on enemies with the same HD. Checks for appropriate immunities properly. Enemies given immunity for 3 rounds after roll / effects end. TODO: Immunity timer works per Barbarian?\n---\nSummon Mount: Disabled.\nBlackguard\n---\nDivine Wrath: Duration increased to (CoT level + CHA modifier) rounds.\nHarper Scout\n---\nFinal Stand: Temporary HP increased to 1d10 per character level.\nInspire Courage: Duration increased to 1 turn per PDK level.\nRallying Cry: Duration increased to 1 round per PDK level. Movement Speed Increase removed.\nFeats\nBrew Potion / Craft Wand / Scribe Scroll: Disabled.\nSpells\nDamage Shields (Aura vs Alignment, Death Armor, Elemental Shield, Mestil's Acid Sheath, Wounding Whispers): Don't stack.\nBless Weapon: Bonus damage applies to constructs and elementals too.\nCrumble: Damage is 1d6 per 2 CL, capped at 15d6 damage. Works on elementals and undead too.\nEpic Warding: Reduced to 30/+10 DR.\nGreater Restoration: Heal is 5 per CL. Doesn't remove rage.\nHarm: Damage is 2d4 per CL. Heal is 5 per CL.\nHeal: Damage is 2d4 per CL. Heal is 5 per CL, 10 per CL with Healing Domain.\nImplosion: Affects everyone in the AoE except the caster.\nKeen Edge: Works on all melee weapons.\nMass Haste: Disabled.\nMonstrous Regeneration: Regeneration increases to 6 per round if target already affected by the spell Regeneration.\nRegeneration: Removed Regeneration stacking.\nResurrection: Disabled.\nTrue Seeing: Gives See Invis + UV + +20 Spot.</details>\n<details><summary>Spoiler</summary>===\n---\nAssassin - Levels 10, 14, 18, 22, 26: +2 Negative Damage per level. Level 30: +5 Negative Damage (+15 Negative Damage total). Ignores DI/DR.\n[2da EDIT] PM - Bone Skin AC bonus halved.\n[2da EDIT] Shifter item merging - All items merge except for Shield AC, all properties stack properly, bonus Dodge AC removed from all shapes.\n===\n---\nDisarm - Weapon hits backpack instead of ground. 3 round immunity.\nHiPS - 3 round timer.\nStunning Fist - 3 round immunity upon recovering.\nSpells\nAoE Spells - No stacking.\nSlow - Remove excess Monk Speed?\nSummons - Adjust Level 9 / Epic / BG / PM / SD summons.\n===\n</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "6:21 PM - May 27, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Working on this has been quite interesting, I've learned a lot about how modules are made and why some of the bugs/quirks in NWN exist. I've got working prototypes for most of the core systems now, the only thing left to do is to actually make the module. Luckily there's a promotional section on the NWN wiki for Antiworld so I found the original spam category list, although I've decided to change mine slightly.<br/>\n<br/>\nI have an idea for BS/CS changes and a list of available item spells but I want other opinions too. What do you think of these potential changes to BS/CS and which spells can be cast via items?<br/>\n<br/>\n<details><summary>Spoiler</summary>\nRequires 2 Perform per level. (eg Bard40 with 60 Perform has a level 30 BS/CS)\nAC: +/-1 per 8 levels [+/-5 @ 40 max]\nSaves: +/-1 per 10 levels [+/-4 @ 40 max]\nBard 40 = +/-1.\nBS Temp HP: Bard levels + Perform ranks [167 max]\n\n\n+4 AB. +7 AC. +10 Damage. +6 Saves. +12 Skills. +120 Temp HP.\nBard32, 64 Perform, EM+LI+LS:\n\n+2 AB. +3 AC. +5 Damage. +3 Saves. +6 Skills. +60 Temp HP.\n</details>\n<details><summary>Spoiler</summary>\nSpell casting via items only works for magic rods and potions. Caster Level 15. 5 uses per day per spell.\nNo UMD\nBull's Strength\nClairaudience/Clairvoyance\nDeath Ward\nEagle's Splendour\nFox's Cunning\nGreater Dispelling\nImproved Invisibility\nLesser Dispel\nLesser Spell Mantle\nOwl's Wisdom\nSee Invisibility\n===\nAmplify [15 UMD]\nElemental Shield [30 UMD]\nFlame Weapon [20 UMD]\nGreater Spell Breach [40 UMD]\nMass Camouflage [30 UMD]\nSpell Mantle [45 UMD]</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}