{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Rules and Tools",
  "forum_id": "000",
  "id": "000",
  "name": "Tools of the builder",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/tools-of-the-builder-t515320.html",
  "author": "KailPendragon",
  "avatar": "10235214_1540245864.jpg",
  "replies": "3",
  "views": "12.2K",
  "posts": [
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "3:58 AM - Jun 29, 2011",
      "content": "<div>Edit by Mick Dagger:<strong> For updated links, see the post by Hip Redux below</strong><br/>\n<br/>\n<br/>\n<strong>NWN Wiki:</strong> a dynamic compendium of NWN lore, always ready to be updated<br/>\n<br/>\n<br/>\n<br/>\n<strong>Old ECB Guild Archive:</strong> this is the archive of the ECB Guild on the BioWare NWN Legacy forums. A repository of knowledge and wisdom about all that is NWN character builds. Courtesy of The_Krit.<br/>\n<br/>\n<br/>\n<br/>\n<strong>Epic Character Search Engine: </strong>the search engine of the old ECB guild builds' database. Courtesy or The_Krit.<br/>\n<br/>\n<br/>\n<br/>\n<strong>Epic Character Builders Guild downloadable archive</strong> on the Vault courtesy of The_Krit.<br/>\n<br/>\n<br/>\n<br/>\n<strong>Pre-epic Character Builds Guild downloadable archive</strong> on the Vault courtesy of The_Krit.<br/>\n<br/>\n<br/>\n<br/>\n<strong>Neverwinter Grimoire: </strong>This document is a compilation of the Neverwinter Nights, SoU, &amp; HotU rules. It covers most of the rules on character creation and has descriptions of every feat, skill, and spell that is included in the game. It is meant for the beginner and advanced player as a guide and reference. This is the second version of this document. Many things have been added and corrected along with Shifter info. This document uses hyper-linked bookmarks throughout. It is formatted to print front/back. The use of color in the document is meant for ease of reading and will not take up too much color ink. <br/>\n<br/>\n<br/>\n<br/>\n<strong>Epic Character Table: </strong>This table shows when each class and Prc recives bounus feats as well as special abilities. It also shows the pre-requesits if the pointer hovers over a class.<br/>\n<br/>\n<br/>\n<br/>\n<strong>Kamiryn's Character Build Calculator:</strong> The CharacterBuildCalculator is an Excel Sheet that allows you to create builds very fast and easily. You just select your race, your class (or classes) and the order of leveling. Then the CBC calculates at which level you gain a feat (regular/bonus) and what class feats you get. Also the CBC calculates your hitpoints, your BAB, your attacks/round, your saving throws, skill points, spell casting, bard song and many more things. Finally the CBC generates a text output of your build ready to post everywhere you like. The CBC covers races (feats, skill points, ability modifiers), hitpoints (constitution bonus, toughness, epic toughness), BAB, attacks/round, feats (regular, bonus, class, feat prequisites), saving throws (CON/DEX/WIS modifiers, feats), skill point selection (forbidden skills, cross-class skills, class skills) bonus skill points (human, INT modifier).<br/>\n<br/>\nEdit by Mick Dagger: <strong>For updated links, see the post by Hip Redux below</strong></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "12:30 AM - Jul 26, 2011",
      "content": "<div><strong>The Halls of Advanced Training Deluxe - HotU+SoU Edition:</strong> the ultimate character creation and customization module. You may create a character, make him/her any level you so choose and equip that character with any gear you wish from all the standard items in the standard NWN game and the HotU + SoU expansions plus many more custom items. There is also a pawn shop that collects copies of unique custom items from the inventories entering players. You may also change your alignment to any that you choose and tweak your ability scores. This is all done in a fully fleshed out setting with NPC's and navigational aids. There is also a large PvP Arena and a script powered level + gear balanced monster arena with customizable difficulty via adjustments to average party level and total party level. In addition there is a rogue training house to test your rogue's lock picking and trap skills and a testing hall to benchmark your character's battle capabilities with combat dummies and archery targets.<br/>\n<br/>\n<br/>\n<br/>\n<strong>Novice to Epic Character Maker CEP23 Edition by DawnWalker: </strong>another module useful to level up a character to the desired level, equip him with vanilla and custom gear and test him in a handful of arenas against different enemy types of various levels. Direct access with customized characters to the OCs via a special portal in the module.<br/>\n<br/>\nEdit by Mick Dagger: <strong>For updated links, see the post by Hip Redux below</strong></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:30 AM - Mar 10, 2016",
      "content": "<div>These are the updated links to replace the defunct IGN Vault ones (and a few more I thought had some merit).  Refer to Kail's description (above) or check the project descriptions (which may be more up to date).  I have appended comments to a link only if I feel they may help others understand better what each download offers the ECB membership.<br/>\n<br/>\nAt the top of the list, of course...<br/>\n<br/>\n<a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/other/tool/characterbuildcalculator-cbc\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#ff0000\"><strong>Kamiryn's Character Build Calculator</strong></span></a> - There simply is no real substitute for this Excel Spreadsheet other than PnP.  It's worth investing in MSOffice just to be able to use Kamiryn's astonishing time-saver.  A boon for noobs and advanced builders alike!<br/>\n<br/>\n<strong>Trainers</strong><br/>\nThese are all very small modules that load fast and have no latency if you decide to use them for PvP.  Try each of them to decide which is your own favorite. These modules will not allow any changes to Level 1 starting characters (race, feat selection, starting abilities) and they do not provide an easy way to maneuver skill allotments on-the-fly according to changes you juggle with class sequence and INT level.  Deleveling/releveling works the same as you could do using the console but saves you the effort of typing commands.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/module/halls-advanced-training-deluxe-hotusou-edition\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#ff0000\"><strong>The Halls of Advanced Training Deluxe - HotU+SoU Edition</strong></span></a> - This is my favorite trainer because it has so many useful features like NPC animals to test Animal Empathy on, a progressive rogue skill area, an exceptional enemy selection mechanism, a scaled AB vs. AC test area that works particularly well with Combat Debugging enabled and a truly nasty uber boss to compete against who awards some godly items should your toon survive.  Also, the level/ability/alignment change mechanism just seems easier and faster than in some of the other modules.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/module/pretty-good-character-creator-customizer-pgc3-powered-igipe\" rel=\"noreferrer\" target=\"_blank\"><strong><span style=\"color:#ff0000\">Pretty Good Character Creator / Customizer (PGC3) powered by IGIPE</span></strong></a><br/>\n<br/>\n<a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/module/novice-epic-character-maker-experience-gold-equipment-and-more\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#ff0000\"><strong>Novice to Epic Character Maker- Experience, Gold, Equipment, and More!</strong></span></a><br/>\n<br/>\n<a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/module/novice-epic-character-maker-cep-edition\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#ff0000\"><strong>Novice to Epic Character Maker CEP Edition</strong></span></a><br/>\n<br/>\n<strong>Build Search and Archives</strong><br/>\n<span style=\"color:#0000ff\"><strong>Old ECB Guild Archive</strong></span>: Defunct<br/>\n<br/>\nThe following data and utilities are now only available from the new Vault.  Check the ECB Rules and Tools topic entitled \"<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354480/How-and-Where-to-Access-Legacy-ECB-Archives\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#ff0000\"><strong>How and Where to Access Legacy ECB Archives</strong></span></a>” for download links and instructions.<br/>\n<br/>\n<strong>Epic Character Search Engine<br/>\n Epic Character Builders Guild downloadable archive<br/>\n Pre-epic Character Builds Guild downloadable archive</strong><br/>\n<br/>\n<strong>Game-related Resources</strong><br/>\n<a class=\"postlink\" href=\"ftp://neverwintervault.org/rolovault/projects/nwn1/other/729/Neverwinter_Grimoire_v3.0.zip\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#ff0000\"><strong>Neverwinter Grimoire v3.0</strong></span></a><br/>\n<br/>\n<a class=\"postlink\" href=\"ftp://neverwintervault.org/rolovault/projects/nwn1/other/133/Epic_Character_Table_2.zip\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#ff0000\"><strong>Epic Character Table</strong></span></a> - Link to archive provided.  This is an html page but is not accurate so even though the compilation might be handy if it were accurate, the mistakes will just confuse new builders and annoy veterans.  IMO not worth storing on your HD.<br/>\n<br/>\n<strong>Toys</strong><br/>\n<a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/hakpak/original-hakpak/customize-character-override-hak-ccoh\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#ff0000\"><strong>Customize Character Override HAK (CCOH)</strong></span></a> - Quick 'n easy way to change the look of your toon in-game without dyes and crafting expense.<br/>\n<br/>\n<strong>NWN-related Websites</strong><br/>\n<a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Main_Page\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#ff0000\"><strong>NWN Wiki</strong></span></a><br/>\n..... specifically, <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Category:Character_development\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#ff0000\"><strong>PC-related on wiki</strong></span></a><br/>\n<br/>\n<a class=\"postlink\" href=\"http://forum.bioware.com/forum/43-neverwinter-nights/\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#ff0000\"><strong>BioWare Social Network NWN Forum</strong></span></a> - discuss anything related to Neverwinter Nights gaming</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:24 PM - Mar 14, 2017",
      "content": "<div>I've been hunting for a free version of Excel to help our members speed up their designing efforts.  Until today, all I could find was a viewer, a means to view a spreadsheet but not use any of the features (like filtering, sorting, searching, using macros, etc.).  A recent post on the NWVault forums revealed exactly what I believe is a viable resource to do just that.<br/>\n<br/>\nCheck out the <strong><a class=\"postlink\" href=\"https://www.wps.com/office-free\" rel=\"noreferrer\" target=\"_blank\">WPS Office Suite for Windows</a>. </strong> It should fill the gap that many of you without MSOffice have been dealing with for years.  Kamiryn's CBC is no longer out of your reach! <br/>\n<br/>\nPlease report its ease (or difficulty) to service your needs in the <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/forums/60571/\" rel=\"noreferrer\" target=\"_blank\">General Forum</a>.</strong>  And good luck with the installation and performance!  This looks promising. <img class=\"img-emoji\" src=\"emoji/11.gif\"/></div>"
    }
  ]
}