{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "380",
  "name": "Mith's C16/F8/R16 Questions",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/mith-s-c16-f8-r16-questions-t2345444.html",
  "author": "Kalistez",
  "avatar": "no_avatar.png",
  "replies": "4",
  "views": "418",
  "posts": [
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "2:07 AM - Nov 11, 2013",
      "content": "<div>Hi Guys,<br/>\n<br/>\nI found this old C16/F8/R16 build of Mith's using the search engine, and was wondering if it was still viable.<br/>\n<blockquote><div>\nI present to you the ultimate dexterity based \"ranger\". Note that there are no ranger levels, because you can't make a halfway decent ranger that's dexterity based. Instead, I set out to make a character that can fill the role of dexterity based ranger. what you end up with is a build that is a better scout, does more damage and has better spells. I originally intended to use druid instead of cleric, but, without a wisdom focus, the cleric spells are far more useful that the druid spells and the lists overlap to some degree. This build should do best in a no magic or low magic setting where devastating critical is banned.<br/>\n<br/>\nAdvantages<br/>\n<br/>\n-8D6 Sneak attack. Coupled with improved invisibility, improved knockdown and word of faith, this build can get a large number of sneak attacks.<br/>\n-Good Damage for a Dex Build. With Bull's strength and Divine power he can increase his strength by 12 to add some bonus damage. Darkfire, greater magic weapon, epic weapon specialization, divine favor, battletide and prayer also contribute to this build's damage potential. Even without critical hits or sneak attacks, this build does well in the damage department.<br/>\n-Level 8 Cleric spells. I originally wanted to use druid spells, since ranger magic is supposed to be druidic, but the spell lists are similar and the melee buffs help out this build much more than the offensive druid spells ever could.<br/>\n-Epic Dodge. He can avoid the first attack from his opponent each turn.<br/>\n-Improved Evasion and a good reflex save. He doesn't take much damage from evocations.<br/>\n-Can set traps. He can use traps to augment his melee abilities<br/>\n-Excellent scouting abilities. He has a good hide and move silently skill, and with find traps, true sight, improved invisibility and greater sanctuary, he can scout as well as any ranger or rogue.<br/>\n<br/>\nDisadvantages<br/>\n<br/>\n-Low Hitpoints. This is a result of being an elf with rogue levels. Not much can be done about this, but he does have endurance, heal, greater restoration and mass heal as well a good AC if he uses a shield.<br/>\n-Low Caster Level. He can be dispelled, though this will not affect his armor and weapon buffs, and he can have trouble with SR.<br/>\n-Low AB. He has a 40 AB with a single mace, 38 while dual wielding. With cleric buffs, this should be fine for a low or no magic world, but it can be problematic.<br/>\n-Mediocre Fortitude and Will saves. He can cast clarity and death ward, and he has okay fortitude saves and will saves vs. spells but this is a weak point.<br/>\n-XP penalty from level 15 onwards.<br/>\n<br/>\nComparison of this \"Ranger\" to a Ranger<br/>\n<br/>\n-Spells. I don't need to show the superiority of level 8 cleric spells to level 4 ranger spells<br/>\n-Damage. Favored enemy and Bane of Enemies does 9+2D6 points of damage to favored enemies. With epic weapon specialization and darkfire alone he does 14+1D4 points of damage to all opponents. Throw in the sneak attack and other cleric buffs and the \"Ranger\" wins hands down<br/>\n-Attack Bonus. The Ranger would have a 4 point higher AB than the \"Ranger\". The Ranger can only use blade thirst and aid to buffs his AB, while the \"Ranger\" has bless, aid, divine power, divine favor, prayer, battletide and greater magic weapon to buff his AB. <br/>\n-Hit Points. The Ranger with the same CON would have 102 more hit points, The \"Ranger\" cam cast endurance to decrease that gap to 22, but the Ranger wins out here.<br/>\n-Animal Companion. The Ranger can summon a powerful animal, the \"Ranger\" can summon an elder elemental.<br/>\n-Stealth. The Ranger has high hide and move silently skills which he can augment with camoflage. The \"Ranger\" has high hide and move silently skills, which he can augment with invisibility spells.<br/>\n-Detection. The Ranger has a high spot, listen and search skill. The \"Ranger\" can cast true sight and find traps.<br/>\n-Trap Setting. Both builds can set traps.<br/>\n-Defense. The Ranger has a similar AC, but the \"Ranger\" has uncanny dodge, epic dodge and improved invisibility.<br/>\n<br/>\nUltimate Dex \"Ranger\"<br/>\n<br/>\nRace Elf<br/>\n<br/>\nAlignment Any<br/>\n<br/>\nBase Attribute<br/>\nSTR 10<br/>\nDEX 18<br/>\nCON 12<br/>\nWIS 14<br/>\nINT 14<br/>\nCHA 8 <br/>\n<br/>\nLeveling Guide (complicated, but you only get an XP penalty at level 15 and it doesn't get higher than 20%)<br/>\nLevel 1 Rogue<br/>\nLevel 2 Fighter<br/>\nLevel 3 Cleric<br/>\nLevel 4 Rogue<br/>\nLevel 5 Fighter<br/>\nLevel 6 Cleric<br/>\nLevel 7 Rogue<br/>\nLevel 8 Fighter<br/>\nLevel 9 Cleric<br/>\nLevel 10 Rogue<br/>\nLevel 11 Fighter<br/>\nLevel 12 Cleric<br/>\nLevel 13 Rogue<br/>\nLevel 14 Cleric<br/>\nLevel 15 Rogue<br/>\nLevel 16 Cleric<br/>\nLevel 17 Rogue<br/>\nLevel 18 Cleric<br/>\nLevel 19 Rogue<br/>\nLevel 20 Cleric<br/>\nLevel 21 Fighter<br/>\nLevel 22 Rogue<br/>\nLevel 23 Cleric<br/>\nLevel 24 Rogue<br/>\nLevel 25 Cleric<br/>\nLevel 26 Rogue<br/>\nLevel 27 Cleric<br/>\nLevel 28 Fighter<br/>\nLevel 29 Rogue<br/>\nLevel 30 Cleric<br/>\nLevel 31 Rogue<br/>\nLevel 32 Cleric<br/>\nLevel 33 Rogue<br/>\nLevel 34 Cleric<br/>\nLevel 35 Fighter<br/>\nLevel 36 Rogue<br/>\nLevel 37 Cleric<br/>\nLevel 38 Cleric<br/>\nLevel 39 Rogue<br/>\nLevel 40 Fighter<br/>\n<br/>\nFinal Level Distribution<br/>\nCleric 16<br/>\nFighter 8<br/>\nRogue 16<br/>\n<br/>\n<br/>\nClerical Domains<br/>\nTrickery and Animal (Trickery and War are better choices though)<br/>\n<br/>\n<br/>\nAttribute Bonuses<br/>\nlevels 4, 8, 12, 16, 28 and 40 go to dexterity<br/>\nlevels 20, 24, 32 and 36 go to wisdom<br/>\n<br/>\nFeats<br/>\nLevel 1: Knockdown<br/>\nLevel 2: Weapon Finesse<br/>\nLevel 3: Weapon Focus (mace)<br/>\nLevel 5: Ambidexterity<br/>\nLevel 6: Two-Weapon fighting <br/>\nLevel 9: Improved Knockdown<br/>\nLevel 11: Weapon Specialization (mace)<br/>\nLevel 12: Improved Two-Weapon Fighting<br/>\nLevel 15: Blind-Fight<br/>\nLevel 18: Extend Spell<br/>\nLevel 21: Epic Weapon Focus (mace)<br/>\nLevel 24: Great Dexterity I, Improved Evasion<br/>\nLevel 27: Great Dexterity II<br/>\nLevel 28: Epic Weapon Specialization (mace)<br/>\nLevel 30: Great Dexterity III<br/>\nLevel 31: Defensive Roll<br/>\nLevel 33: Great Dexterity IV<br/>\nLevel 36: Great Dexterity V<br/>\nLevel 39: Great Dexterity VI, Epic Dodge<br/>\nLevel 40: Epic Prowess<br/>\n<br/>\nFinal Attributes<br/>\nSTR 10<br/>\nDEX 30<br/>\nCON 12<br/>\nWIS 18<br/>\nINT 14<br/>\nCHA 8<br/>\n<br/>\nFinal Saves (Vs. Spells)<br/>\nFortitude 23 (31)<br/>\nReflexes 29 (37)<br/>\nWill 23 (31)<br/>\n<br/>\nAB and Damage<br/>\n<br/>\n(No buffs, two normal maces)<br/>\n38/33/28/23 6+1D6 (+8D6 sneak attack) (20 x2)<br/>\n38/33 6+1D6 (+8D6 sneak attack) (20 x2)<br/>\n<br/>\n(+4 to Dex [Cat's Grace], +12 to STR [Bull's Strength, Divine Power], Bless, Aid, Prayer, Battletide, Divine Power, Divine Favor, Greater Magic Weapon x2, Darkfire x2, two maces)<br/>\n59/54/49/44 17+1D6 (+1 slashing +7 magic +8+1D6 fire +8D6 Sneak Attack) (20 x2)<br/>\n59/54 14+1D6 (+1 slashing +7 magic +8+1D6 fire +8D6 Sneak Attack) (20 x2)<br/>\n<br/>\nMaximum AB: 66 (64 while dual wielding) <br/>\n<br/>\nAC <br/>\n28 (no armor, no buffs)<br/>\n31 (robes, tower shield, no buffs)<br/>\n<br/>\n39 (+4 to Dex [Cat's Grace], magical vestments, shield of faith, robes) <br/>\n47 (+4 to Dex [Cat's Grace], magical vestmentsx2, shield of faith, robes and tower shield)<br/>\n<br/>\n53 (+12 to DEX, +5 Robes, +5 Ring of Protection, +5 Amulet of Natural Armor, Boots of Speed)<br/>\n61 (As above with +5 tower shield)<br/>\n<br/>\nHit Points 338 (Max Every Level)<br/>\n<br/>\nFinal Skillpoints 286<br/>\nConcentration 43 (43)<br/>\nCraft Trap 18 (20)<br/>\nDisable Trap 1 (3)<br/>\nDiscipline 43 (43) <br/>\nHide 42 (52)<br/>\nMove Silently 42 (52)<br/>\nSet Trap 19 (29) <br/>\nSpellcraft 38 (40)<br/>\nTumble 40 (22) <br/>\n<br/>\n<br/>\nSkillpoint Distribution<br/>\nLevel 1: Craft Trap 4, Disable Trap 1, Hide 4, Move Silently 4, Set Trap 4, Tumble 4, Save 19<br/>\nLevel 2: Concentration 5, Discipline 5, Save 13<br/>\nLevel 3: Concentration 1, Spellcraft 6, Save 10<br/>\nLevel 4: Craft Trap 2, Hide 3, Move Silently 3, Set Trap 2, Tumble 3, Save 7<br/>\nLevel 5: Concentration 2, Discipline 3, Save 6<br/>\nLevel 6: Concentration 1, Spellcraft 3, save 6<br/>\nLevel 7: Craft Trap 2, Hide 3, Move Silently 3, Set Trap 2, Tumble 3, Save 3<br/>\nLevel 8: Concentration 2, Discipline 3, Save 2<br/>\nLevel 9: Concentration 1, Spellcraft 3, Save 2<br/>\nLevel 10: Craft Trap 1, Hide 3, Move Silently 3, Set Trap 1, Tumble 3, Save 1<br/>\nLevel 11: Concentration 2, Discipline 3 <br/>\nLevel 12: Concentration 1, Spellcraft 3<br/>\nLevel 13: Hide 3, Move Silently 3, Set Trap 1, Tumble 3<br/>\nLevel 14: Concentration 2, Spellcraft 2<br/>\nLevel 15: Craft Trap 1, Hide 2, Move Silently 2, Set Trap 1, Tumble 2, Save 2<br/>\nLevel 16: Concentration 2, Spellcraft 2, Save 2<br/>\nLevel 17: Craft Trap 1, Hide 2, Move Silently 2, Set Trap 1, Tumble 2, Save 4<br/>\nLevel 18: Concentration 2, Spellcraft 2, Save 4 <br/>\nLevel 19: Hide 2, Move Silently 2, Set Trap 1, Tumble 2, Save 7<br/>\nLevel 20: Concentration 2, Spellcraft 2, Save 7<br/>\nLevel 21: Concentration 1, Discipline 10<br/>\nLevel 22: Hide 3, Move Silently 3, Tumble 3, Save 1<br/>\nLevel 23: Concentration 2, Spellcraft 3<br/>\nLevel 24: Craft Trap 1, Hide 2, Move Silently 2, Set Trap 1, Tumble 2, Save 2<br/>\nLevel 25: Concentration 2, Spellcraft 2, Save 2<br/>\nLevel 26: Craft Trap 1, Hide 2, Move Silently 2, Set Trap 1, Tumble 2, Save 4<br/>\nLevel 27: Concentration 2, Spellcraft 2, Save 4<br/>\nLevel 28: Concentration 1, Discipline 7<br/>\nLevel 29: Hide 3, Move Silently 3, Tumble 3, Save 1<br/>\nLevel 30: Concentration 2, Spellcraft 3<br/>\nLevel 31: Craft Trap 1, Hide 2, Move Silently 2, Set Trap 1, Tumble 2, Save 2<br/>\nLevel 32: Concentration 2, Spellcraft 2, Save 2<br/>\nLevel 33: Craft Trap 1, Hide 2, Move Silently 2, Set Trap 1, Tumble 2, Save 4<br/>\nLevel 34: Concentration 2, Spellcraft 2, Save 4<br/>\nLevel 35: Concentration 1, Discipline 7<br/>\nLevel 36: Hide 3, Move Silently 3, Set Trap 1, Tumble 3<br/>\nLevel 37: Concentration 2, Craft Trap 1, Spellcraft 1<br/>\nLevel 38: Concentration 1, Craft Trap 2, Save 1<br/>\nLevel 39: Hide 3, Move Silently 3, Set Trap 1, Tumble 1, Save 3<br/>\nLevel 40: Concentration 2, Discipline 5<br/>\n</div></blockquote>\n\nI would be using Short Swords instead of Maces which doesn't change much as far as I can see.  There are 2 things I was looking to do but was unsure how it will effect things.<br/>\n<br/>\nFirstly I was going to Cleric at 1 and Rogue at 3 to increase my initial survivability.<br/>\n<br/>\nSecondly I was also going to drop 2 points out of INT and add them to CHA (This is for an RP realm and they kinda frown on Min/Maxing to a certain extent).  I'm not sure how this will effect my skill points.  Craft traps is disabled on my server so I will have those spare if need be.<br/>\n<br/>\nThanks in advance</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:59 PM - Nov 11, 2013",
      "content": "<div>Hail!<br/>\n<br/>\nAll seems in order with this build. There was a change in Epic Dodge in the 1.69 patch, which now only allows it to be taken after level 27, but this one takes it at level 39, so you're good to go.<br/>\n<br/>\nBy not taking Rogue first you'll lose Skill points, same as if you take points off of INT. For the INT modification you'll lose 43 skill points, literally ONE FULL SKILL, and the Cleric instead of Rogue you'll lose another 24 points. You don't seem to like skills, since all your tweaks are Affecting your skill point total. Craft Trap accounts for 18 points, where are you going to remove the other 49 from? That is A LOT of skill points. <br/>\n<br/>\nIMO, if you're going to take points out of anything, then take them out of CON. That way you'll only lose 40 HP and 1 Fort save, but this build already has few HP as is. In ANY rogue build, even if you drop Craft Trap, there's no such thing as too many skill points. I'd lower CON over INT 10 out of 10 times in this build. You'd also lose access to Improved Knockdown (requires 13 INT) by lowering INT.<br/>\n<br/>\nHonestly, I'd also not worry about surviving level 1 as a Rogue, just get a bow and some arrows and kite and run. It takes time, but I am against any modification that weakens a build in terms of lvl 40 power for survivability. Just figure out a way to survive, traps are your friends <br/>\n<br/>\nWeapon choice is server-dependant, but Bludgeoning resistance is far less common in every server I've played than Slashing or Piercing, which might be why Mith went with maces.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "7:52 PM - Nov 11, 2013",
      "content": "<div>Thanks Max !<br/>\n<br/>\nI realised just after I posted that dropping the INT would rule out getting Improved Knockdown so I may try the CON route.<br/>\n<br/>\nTBH I like the idea of maces but shortsword is the favoured weapon of the deity I chose and due to RP reasons I sort of need to stick with it.<br/>\n<br/>\nThanks again for your time.</div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "3:39 AM - Nov 12, 2013",
      "content": "<div>Just looking at other options, in your opinion would it be worth giving up <br/>\n<br/>\n2 BAB<br/>\n1 Attack<br/>\nIW/IWS<br/>\nKD/IKD<br/>\n<br/>\nso as to gain<br/>\n<br/>\nHiPS<br/>\nDarkvision<br/>\nSummon Shadow<br/>\nShadow Evade<br/>\nLevel 9 Cleric Spells<br/>\n1d6 sneak attack<br/>\nED at 32 instead of 39<br/>\n<br/>\nI remember reading somewhere on the forums that if you are using a cleric to buff then you want to be at 3 APR Unbuffed as you get more attacks at a higher BRB, not sure how correct this is.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:16 AM - Nov 12, 2013",
      "content": "<div><blockquote><div><strong>Kalistez wrote:</strong>Just looking at other options, in your opinion would it be worth giving up <br/>\n<br/>\n2 BAB<br/>\n1 Attack<br/>\nIW/IWS<br/>\nKD/IKD<br/>\n<br/>\nso as to gain<br/>\n<br/>\nHiPS<br/>\nDarkvision<br/>\nSummon Shadow<br/>\nShadow Evade<br/>\nLevel 9 Cleric Spells<br/>\n1d6 sneak attack<br/>\nED at 32 instead of 39<br/>\n<br/>\nI remember reading somewhere on the forums that if you are using a cleric to buff then you want to be at 3 APR Unbuffed as you get more attacks at a higher BRB, not sure how correct this is.</div></blockquote>\n\nYou should probably read my Cleric guide before playing this guy, and it'll even help you understand some of Mith's choices in this build. Here's the link to the guide:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/an-insight-into-the-cleric-class-t515461.html\" rel=\"noreferrer\" target=\"_blank\">An Insight into the Cleric Class</a><br/>\n<br/>\nI'd keep the build as is for now. Mith is one of the greatest builders of the old ECB, so be sure that whatever you're thinking about, he probably did too and chose to keep it this way for good reason. He takes Fighter levels the way he does because he aims at reducing XP penalty, and he says so in his text. Fighter also helps with the dual-wielding feats, which he otherwise would have a lot of trouble obtaining, and gives WS / EWS to his maces. He could go CoT but then he'd lose one feat, which he simply can't afford. With SD, you not only lose the Fighter bonus feats, but also add the need for 2 extra feats (Dodge and Mobility) as requirements. Bad, very bad. Also, with low Wisdom, 9th level Cleric spells aren't all that desirable. If you consider that the main ones are Implosion and Storm of Vengeance, which are both save spells, which means your DCs will be pedestrian and your enemies will probably make the saves more often than not.<br/>\n<br/>\nEDIT: Just to be clear, you could shuffle the Fighter levels around if you don't mind enduring XP penalty (40%). You'll basically take nearly twice as long to level, which some people would call A LOT. 15 pre-epic BAB is the ideal, but in this build you can't do it without causing severe XP penalty, unless you went for Human or swapped Fighter for CoT levels and gave up on WS / EWS (which in a DEX build isn't exactly good, but you can deal damage with your Clerical buffs, so not a build-breaker either). That would effectively raise your saves by 4 at the cost of WS / EWS. You'd lose one feat from Fighter 1 but you'd \"gain\" 2 feats for not being able to take WS / EWS as mentioned above, so technically you'd gain 1 feat.<br/>\n<br/>\nEDIT II: The finesse with which Mith manages to avoid severe XP penalty with this guy is AMAZING, but TBH I would probably prefer going Human instead of delaying Clerical prowess as much. You'd gain one more feat, +2 CON (which gives 40 HP) 43 extra skill points at the cost of 2 DEX (-1 AB, -1 AC, -1 to all skills modified by DEX). Then you could do some MAJOR tweaking to the leveling order to ensure 15 BAB and earlier Cleric buffs.<br/>\n<br/>\nTake it EZ!</div>"
    }
  ]
}