{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "269",
  "name": "Quotes to Build By",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/quotes-to-build-by-t515511.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:06 PM - Oct 20, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hey ECBers!<br/>\n<br/>\nI love to peruse the old ECB builds and TBH at times I get more of a kick out of the discussions than reading the builds themselves.<br/>\n<br/>\nBack in 2005, our beloved grizzled_dwarflord responded to a statistical analysis of single-wield vs. dual-wield by Steve (aka Stravinsky00) with the following:\n<blockquote><div>\n\"There are three kind of Lies in this world: Lies, Damn Lies, and Statistics.\"\n</div></blockquote>\nDon't know how original the quote was, but it made me grin so I thought you all may enjoy the nostalgia as well.  Leave it to grizz to get down to basics. <br/>\n<br/>\nFeel free to append any build-related quotes that have stood the test of time for you during your NWN career.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "RookY2K",
      "avatar": "no_avatar.png",
      "timestamp": "11:25 PM - Oct 20, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong> grizzled_dwarflord responded to a statistical analysis of single-wield vs. dual-wield by Steve (aka Stravinsky00) with the following:\n<blockquote><div>\n\"There are three kind of Lies in this world: Lies, Damn Lies, and Statistics.\"\n</div></blockquote>\nDon't know how original the quote was, but it made me grin so I thought you all may enjoy the nostalgia as well.  Leave it to grizz to get down to basics. <br/>\n<br/>\nFeel free to append any build-related quotes that have stood the test of time for you during your NWN career.</div></blockquote>\n\nThat was something that the great Samuel Clemens, aka Mark Twain said.  I believe he actually quoted someone else, but he's the one most think of in relation to that quote.  <br/>\n<br/>\nI'm not a NWN veteran, but I've been playing RPG's of one sort or another for quite a while (relative to my age at least). The one \"truism\" that sticks with me is:<br/>\n<br/>\n\"Those that can, do.  Those that can't, whine about you being an elitest\".<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "5:20 AM - Oct 21, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>RookY2K wrote:</strong>\"Those that can, do.  Those that can't, whine about you being an elitest\".</div></blockquote>\nOh crap!  I have been found out<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "magpie45",
      "avatar": "no_avatar.png",
      "timestamp": "8:31 PM - Nov 04, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I,ll bite on this,I love RP servers,I really,really do,but the thing that gets me most is the old building effectively .building like we do here is bad,thing.building with completely irrelevant stuff ,but a three page backstory in elven =good[or even worse,Drowese!   ]<br/>\n<br/>\nIt annoys me no end,why if I have researched my build for this rp focused char so he is as good as he should be,driven by his story,should i be told im powergaming,powergaming! I have too ask here dammit!  I,ll show you powerbuilds if you want buster! <br/>\n<br/>\n/end rant <br/>\n<br/>\nAnd ,my 2nd pet hate :FOIG[find out in game].when its a mechanical or commonly known lore thing!...ok I can get not knowing the bad guys plots in a player driven storyline,fine....but a basic nwn engine or common lore question!?...my bottom!<br/>\n<br/>\n/end second rant ,phew ,feel better now!<br/>\n<br/>\nSo my rule if its your build and you can be bothered too actually build it or look it up,cool!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:04 PM - Nov 04, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's not exactly a quote, but a motto in Business school that can very well apply to NWN character building:<br/>\n<br/>\n\"Before you praise yourself for coming up with something that has never been done before, look very closely to it and try to figure out why nobody else has done something like what you're trying to do. Most of the time, you're going to find out that it either HAS been done before and FAILED or that it hasn't been done because there is an innate flaw to your idea that you at first weren't able to perceive.\"<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "3:53 AM - Oct 10, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Max, business is fun, but let's take it to the next level, shall we? <br/>\n<br/>\nIn law, at least as it applies to IP and innovation (defined broadly to encompass more than just patents, but patents, too, absolutely), we follow a certain line of thought harkening back to Einstein himself, who said (and I paraphrase): \"The only true source of knowledge is experience, but knowing what was doesn't get you to what could be such that the only true sign of intelligence is creativity.\" Remember, killer-apps (visionaries), the complete opposite of one-hit wonders/one-trick ponies that don't last, but that which change the everything. Reason why some things haven't been done is simply because people do that which experience tells us is safe (i.e., tried, tested and true). The fun of it is connecting the dots, and getting (through the application of creative, innovative thinking) to what could be, and actually doing it. This is what's meant by innovation, and what alone has the potential to change the rules of the game (i.e., result in killer-apps, such that that which was tried, tested and true becomes insolvent--think, typewriters were around for a century, and then came the computer. Same as the auto eliminated the horse and buggy. True \"thinkers\" did that). Ah, but innovation in all of forms (a matter of degree) is a beautiful thing, and what the world in terms of the marketplace (business and consumers) as well as new characters in terms of building needs. As applied to character building, remember the golden rule: do not try to do too much, as no product or company can be all things to all consumers at all times either (that only results in dilution, and in turn specialized in nothing). NEVER bite off more than once can chew--unless you like to chew, in which case you need a well-built WM, But to build a better WM (to be a \"better mouse trap\" per se), everything in there must in turn be focused on that which it is that the WM does best--namely, focused on farming, yes? Thus, in turn, requiring not just creativity but focus: remember, the world is changed by what in hind-sight seems like the simplest of things, hind-sight always being 20-20. (Heh, and if not, just remember barring a good old Time Stop to travel with a good cleric; they tend to heal everything ... LOL). <br/>\n<br/>\nCheers<br/>\n<br/>\nP.S. and unlike real-world testing of new methods, products, etc., heck, building a better character doesn't require much in the way of R&amp;D money, much less regulatory approvals, etc. so should be easy, right?  Start with the basics, build up the experience, know what works and what doesn't, and then focus on something that it is you want to do, and just do it. Worse thing that can happen is you \"die\". Brush it off, go back and tweak, and learn some more. No one ever made anything of themselves without making an enemy and/or getting a bloody nose along the way (otherwise, playing it \"safe\" and no killer app/visionary/new and improved/Etc. ever comes from that). Practice as they say makes perfect, right? <strong>And most of all: remember always to have fun with it along the way; after all, if you don't enjoy playing a character, then why on earth would anyone think that anyone else would. Simple as that.</strong> But if you want to build a better mouse trap, start with the premise that you need to build a better cat, like giving it terrifying rage for example ...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}