{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "436",
  "name": "Warrior of Song<Bard/BG/F>(Arelith)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/warrior-of-song-bard-bg-f-arelith-t2298774.html",
  "author": "Nokteronoth",
  "avatar": "no_avatar.png",
  "replies": 3,
  "posts": [
    {
      "author": "Nokteronoth",
      "avatar": "no_avatar.png",
      "timestamp": "2:50 AM - Nov 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Moved to <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/warrior-of-song-bard-22-bg-4-fighter-4-t2298782.html\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.44.forumer.com/warri ... 98782.html</a><br/>\n<br/>\nSorry for the misplacing!<br/>\n<br/>\n~Nok<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Nokteronoth",
      "avatar": "no_avatar.png",
      "timestamp": "3:34 AM - Nov 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">EDIT- With the plain Greensteel gear available on Arelith (+3 Shield, +2 armor, +3 weapon). +1 STR and +1 CHA on all gear not armor/shield/weapon.<br/>\n<br/>\nAC is 53 when buffed, +41/+36/+31/+26 AB<br/>\n1-6+16+5slashing+3 bludgeoning+9 divine<br/>\n<br/>\nSaves are 27/29/27<br/>\n<br/>\nBAB 21 <br/>\n<br/>\n~Nok<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:39 AM - Nov 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I guess I get elected, by default, to do the basic education.   <br/>\n<br/>\nThis build, like the others you have posted is not a[ i]\"finished and fully tested\" build so does not belong in this subforum. The telltale evidence is the fact that you haven't even included the class split in the title, a convention that allows others to find builds meeting their desires easier.  Do not omit testing either because weaknesses in the build are often recognized in-practice.  Just writing down a list of choices is only half the battle in assuring a build works as intended.<br/>\n<br/>\nYour efforts would be better served by moving all 6 of them (if I counted right) to the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/build-request-unfinalized-builds-f60563.html\" rel=\"noreferrer\" target=\"_blank\">Build Request/Unfinalized Builds</a> subforum where they would most likely be reviewed faster and more thoroughly.  Not many of the veteran builders play on Arelith, but if we are given enough of the specifics we can pretty much guide a builder towards optimization.<br/>\n<br/>\nSince our illustrious admin Kail has been MIA for an extended period, none of us have privileges adequate to do a clean move for you... so here is the easiest way for you to do it yourself:<br/>\nOpen up your original post for edit, create a new post in the aforementioned subforum with the identical title, copy the original text, paste into the new topic, and then submit.  If you submitted multiple posts, combine them into a single post when you move them.  Link only the original post and leave the others blank. Then, delete all your original post text. I believe only the text can be removed, not the topic itself, but try it... if it works you need no linkage.  Otherwise, in the original (now all should be blank), place a statement like \"<strong>Build information moved to</strong> *URL*, where *URL* is the new URL of the topic in the Unfinalized builds section.<br/>\n<br/>\nApologies for not getting to you sooner, but my access to the ECB has been rare in the past few months.  You'll need to do this for each of the 6 topics you have already created, unfortunately.  Better late than never (or before you submit the next 6).<br/>\n<br/>\nAs a new member I encourage you to become well-acquainted with the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/character-builds-posting-rules-t515321.html\" rel=\"noreferrer\" target=\"_blank\">Character Builds Posting Rules</a> to avoid any future wasted time and effort.  The membership is all here to help you design effective characters but rely on each other to maintain some order.<br/>\n<br/>\nAnd since I'm here now... Welcome to the new ECB!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Nokteronoth",
      "avatar": "no_avatar.png",
      "timestamp": "3:46 AM - Nov 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah..sorry Maestro! Didn't understand there was a big difference there. I'll move everything soon as I get to a stopping point IG. <br/>\n<br/>\n~Nok<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}