{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "765",
  "name": "KISS - Champion of Mother War (Fighter 8/ WM 22/ CoT 10)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/kiss-champion-of-mother-war-fighter-8-wm-22-cot-10-t2355233.html",
  "author": "Orion",
  "avatar": "10404082_1510287071.jpg",
  "replies": 12,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:27 PM - Nov 12, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I've gone back to basics here (Keep It Simple, Stupid). No messing about trying to be clever, no tricks up its sleeve. It's a straight-up grunt build designed to hit things often and hard. No bells and whistles. I have, however, tried to mitigate horrid saves with the use of CoT, and the AC isn't absolutely disastrous, which I'd feared. It's still far from stellar, but liveable with, hopefully. (And sorry, GDL, I'm still wedded to my Disciplinary whore - make of that what you will...).<br/>\n<br/>\nI would, however, appreciate any thoughts from the Guild (else I wouldn't have posted it).<br/>\n<br/>\n<em><strong>EDIT:</strong> Amended to incorporate helpful suggestions and corrections as at 13/11/2019</em><br/>\n<br/>\n<strong>Champion of Mother War</strong><br/>\nFighter 8/ WM 22/ CoT 10<br/>\nHuman, non-evil<br/>\nPvM 1-40 (not tested yet)<br/>\n<br/>\n<strong>Stats</strong><br/>\nSTR 17 (34)<br/>\nDEX 13<br/>\nCON 14<br/>\nWIS 8<br/>\nINT 14<br/>\nCHA 8<br/>\n<br/>\n<strong>Levelling</strong><br/>\n1 F1 - Luck of Heroes/ Power Attack/ Cleave<br/>\n2 F2 - Weapon Focus: Scimitar<br/>\n3 F3 - Dodge<br/>\n4 F4 - STR+1 (18)/ Weapon Specialization: Scimitar<br/>\n5 F5<br/>\n6 F6 - Expertise/ Knockdown<br/>\n7 F7<br/>\n8 CoT1 - STR+1 (19)<br/>\n9 CoT2 - Mobility/ Spring Attack<br/>\n10 CoT3<br/>\n11 CoT4 - Whirlwind Attack<br/>\n12 WM1 - STR+1 (20)/ Blind Fight/ (WoC: Scimitar)<br/>\n13 WM2<br/>\n14 WM3<br/>\n15 WM4 - Imp Crit: Scimitar<br/>\n16 WM5 - STR+1 (21)<br/>\n17 CoT5<br/>\n18 CoT6 - Great Cleave/ Imp Knockdown<br/>\n19 WM6<br/>\n20 CoT7 - STR+1 (22)<br/>\n21 WM7 - GStrI (23)<br/>\n22 CoT8 - Overwhelming Critical: Scimitar<br/>\n23 WM8<br/>\n24 WM9 - STR+1 (24)/ GStrII (25)<br/>\n25 F8 - Devastating Critical: Scimitar<br/>\n26 WM10<br/>\n27 WM11- GStrIII (26)<br/>\n28 WM12 - STR+1 (27)<br/>\n29 WM13 - Epic WF: Scimitar<br/>\n30 WM14 - GStrIV (28)<br/>\n31 WM15<br/>\n32 CoT9 - STR+1 (29)<br/>\n33 CoT10 - GStrV (30)/ Epic WS: Scimitar<br/>\n34 WM16 - Armour Skin<br/>\n35 WM17<br/>\n36 WM18 - STR+1 (31)/ GStrVI (32)<br/>\n37 WM19 - Epic Prowess<br/>\n38 WM20<br/>\n39 WM21 - GStrVII (33)<br/>\n40 WM22 - STR+1 (34)/ Epic Toughness I<br/>\n<br/>\nHit Points: 500<br/>\nAC: (naked) 17, (full plate + tower shield) 28<br/>\nSaves: Fortitude 30, Will 21, Reflex 29. +4 vs spells<br/>\nBAB: 30<br/>\nAB: (max) (melee) 50/45/40/35, (ranged 32)<br/>\nDamage: (scimitar) 1-6 + 18 (Crit 13-20, 10-20 with keen, x3)<br/>\nDev Crit DC: 42 (unbuffed)<br/>\nSkill Points: 215. Discipline 43 (55), Intimidate (cc) 4 (3), Listen 43 (42), Open Lock 1 (2), Search (cc) 19 (21), Spellcraft (cc) 18 (20), Tumble (cc) 20 (21), 5 points in either Heal (4) or Lore (7).<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:36 PM - Nov 12, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Been having a little think, and maybe a F8/WM22/CoT10 split might work better. If I took Fighter 8 at level 20, I could take Great Cleave then, and IKD at level 18. It would then mean delaying EWF, EWS, AS, EP, OCrit and DCrit by one level each, then taking WM from level 32 until the end. That would nett me +1 AB and IKD, at the cost of -3 to Will, -5 to Reflex and -1 to Fortitude saves. Does that sound better?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "8:37 PM - Nov 12, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sometimes it's good to just put on your Heavy Metal and deliver the punishment without bullshit. It just feels sooo good. A little effort to mitigate some weaknesses and you're good. Everyone has at some point played a guy like this. And it's fun. That crit range is awesome. Just wish there was way to switch between using the scimmy with shield and twohanded like in later editions, and it would be really great. Good fun. Not much to add, it's pretty straight forward for what you want!<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:51 PM - Nov 12, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Stag!<br/>\n<br/>\nAnother build to read from the ECB, hooray!<br/>\nA great start to the day for me, not only is there a new GDL build, GDL build commentary but now Stag has created a dev critting monster for us to review.<br/>\n<br/>\nI like the concept, I like the use of three classes pre-epic to maximise on saves, which CoT enhances further. I like the use of the bonus feats epic to obtain seven great strength feats. I like pumping WM levels sky high to get a very high melee AB.<br/>\nI agree the Fighter 8/WM 22 /CoT 10 split is probably better, as you gain an extra feat and +AB getting up to that magic 50 AB number, which will also help with crit threat rolls and hitting with your fourth attack, also allowing you to have expertise or power attack constantly active if desired depending on the situation. <br/>\nOne of the challenges with WM is trying to minimise the number of epic toughness feats which I think you do well. <br/>\nI have a tendency to take Epic Prowess and Armor Skin (if I take armor skin) pretty late in builds which probably reflects WoG influence on me, in builds such as Aielund etc taking those feats earlier as you do, is solid.<br/>\n<br/>\nI have some small comments to make which are purely minor tweaks and make little difference to the overall power in this build but I have listed them here in case you were interested<br/>\n<details><summary>Spoiler</summary>With two prestige classes in your build plus a whole bunch of bonus fighter/CoT feats to obtain weapon master pre-epic, you do have the option of choosing any race you wish without worrying about multiclass penalties. I guess there are a few choices depending if you want to stick with sword and shield (which is good here as some extra AC is very much desirable, also protects against knockdown and crits) or to go two handed (which is also good here for extra strength damage in case dev crit doesn't proc or is nerfed/disabled in modules)\nChoices include Gnome to wield that scimitar in two hands, for extra +1AC, extra HP (or another stat for you to choose as you wish), or Halfling for two handed scimitar usage, extra AC and +1 extra saves (at the cost of some HP). Dwarf is another nice choice here for extra HP, and to boost saves against spells, Cha would be dropped to 6, not sure if this affects your CoT abilities, you probably will know the answer to that, also sometimes dwarf is not always the best RP wise. Elf would grant Keen Senses to make the most out of your Spot skill, one would lose a little HP which can be worked around.\nSmall races are very cute and very fun to play from an RP perspective, even if there are penalties to knockdown checks and being unable to wield large weapons. I was partying with BlackCobra in WoG the other day with a dex halfling fighter/rogue and it was super cute for a little pretty halfling lass to be tanking for a big bad tall human cleric standing at the back shooting with a crossbow. I remember Cornflower recently posting it was funny to watch a small gnome improved knockdown larger opponents with an ultra high AB score when he was playing a Fighter RDD. Mick has taught me with such small races it is important to get improved knockdown which I will need to game test one day.\nIf you want to stay human and have extra skill points you could always drop Int to 13 and put Dex to 14, to give the character some ranged AB and a little flexibility in equipping a chain shirt with an appropriate Dex bonus, also helps with the reflex save\n</details>\n\nAnyway nice one!<br/>\n<br/>\nFinally if the readers need some music whilst reading Stag's build... <br/>\n<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/?list=PLg6tYYDm8NjlQFe0FyHhVnit2Im-tRe_c\" style=\"background:url(https://i.ytimg.com/vi//hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:56 PM - Nov 12, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks a lot Orion! I think I'm now settled on the F8/WM22/CoT10 (I still get to keep Will saves at 20 - it's one of those landmarks for me). I have been thinking about dwarf instead of human, because, well, why wouldn't you? But it comes down to that extra feat (and the same is true of other races). So, loath or despise it, human seems optimal. I do quite like the Dex/Int changeover, though (and it would save me having to work out where to put those extra skill points - like in cross-classing Search/ OLock/ DTrap and so on). Oh, and if I'm going late-end WM, I'd go Listen rather than Spot. Personal preference.<br/>\n<br/>\nAnd thanks for the vid - I remember it well! Always felt sorry for Peter Criss as the Catman behind the drums. The successors to The Sweet and Mott The Hoople in my book.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:49 AM - Nov 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You are missing the Mobility feat required for WM (and required for Spring Attack).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:18 AM - Nov 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yup, I would say drop LoH and go with another feat, so that Mobility can be picked up.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:14 PM - Nov 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, for goodness' sake - thanks Empyre! Don't know how that one slipped by me (though my guess would be incompetence).<br/>\n<br/>\nRather than drop LoH, I've re-jigged the split so it's now Fighter 7/ CoT 7/ WM 6 pre-epic and Fighter 1/ CoT 3/ WM 16 in epic levels. Nett result: a slight dip in the saves and the loss of 20 hps, but +1 to AB, so hoorah!<br/>\n<br/>\nRather than type the lot out again, I'm going to edit the OP. See if it works for you. Sorry if it makes the discussion to date look a bit weird, but I'll credit the <span style=\"text-decoration:line-through\">guilty</span> helpful suggestions and amend the title.<br/>\n<br/>\nOh, and I'm not terribly up to speed with my open locks, search, and disable traps targets, so any advice is welcome there.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:12 PM - Nov 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Man dont be so hard on yourself I've read plenty of builders make simple errors but hehe thats the purpose of peer review!<br/>\n<br/>\nWith the remaining 45 skills points I think it depends on the environment and whether you have a rogue or even a wizard in your party<br/>\n<br/>\nIf the knock spell and find traps work like in vanilla NWN, and you have items that can cast this that don't require UMD then there is no real need to invest in this, unless one gains exp from disarming traps (like in Aielund). Likewise if there are no penalties for bashing open doors or chests with power attack open lock becomes less useful, however there are modules where the contents of chests gets degraded when bashed...<br/>\n<br/>\nSearch is useful for finding hidden doors and identifying the traps in the first place. For an environment like WoG I was told by Knight of Limbo to aim for a modified search score of 10 and I've just stuck with this out of habit. It seems to work in WoG for what I need at least, although a little more search I think would be handy<br/>\n<br/>\nIf it was up to me I would probably put a few points in search to get a modified score of 10 and put some points in heal.<br/>\n<br/>\nYou could also put a few more crossclassed points into spellcraft 21(23) if you wanted for better saves provided you have an item with either +int (ie fox's cunning) or +spellcraft (ie bard song) but I'm not sure that is necessarily the best choice.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:42 PM - Nov 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"17700\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17700&amp;sid=b0f2cba1cb2fb8da444e02219f5b5c57#p17700\">↑</a><div class=\"responsive-hide\">Nov 13, 2019</div></cite>Oh, and I'm not terribly up to speed with my open locks, search, and disable traps targets, so any advice is welcome there.</div></blockquote>\nAs for Open locks: There are few if any standards here. The module designer makes the locks as hard as he wants.<br/>\nOpen lock is a \"take 20\" skill. If you only take <strong>one single rank</strong> (and have a dex of 13), you will be able to open locks with a DC of 22. If you use dex buffs and thieves' tools you can reach the high 30's. You have no spellcaster- or UMD class in this build, but there are still standard items that let every class use the Knock spell.<br/>\nAn alternative \"target\" for opening locks is to bash them. A large weapon with high base damage, a high strength and the Power attack feat are helpful here.  So is also elemental weapon damage if the damage resistance of the container is high.<br/>\n<br/>\nThe target for search depends on several factors. If the trap is set by a player, the Set trap skill of that player is added to the DC, and the traps soon become impossible to detect. If you play a module, the DC of the traps may be altered by the module builder.<br/>\nBut most often you encounter standard traps with standard DCs. <br/>\nThe Search skill is not a \"take 20\" skill, so you roll a d20 and the result may be anything from 1 to 20 (+ your skill rank). You roll once every round, twice if in active detect mode.<br/>\nThe DC of the most difficult standard deadly traps is 22. If your modified skill rank is 2, you will need to roll a 20 to detect the trap. It may take a while. If your modified rank is 21, you will always detect the trap on your first attempt, even when you roll a 1.  So there is no need to go any higher than a modified rank of 21.<br/>\nThe DC for epic traps is 43. Only rogues can detect traps with a DC higher than 35, so you don't need to bother with this build.<br/>\n<br/>\nDisable traps is a \"take 20\" skill. If the trap is set by a player, the Set trap skill of that player is added to the DC. If you play a module, the DC of the traps may be altered by the module builder. <br/>\nThe most difficult standard deadly traps have a disarm DC of 36. You only need a modified rank of 16 to disarm them (because of the \"take 20\"). Now only rogues can disarm traps with a DC above 35. So if you have no rogue levels and want to \"disarm\" the traps with a DC of 36, you have to recover them instead. Recover has (for some odd reason) no DC limit for non rogue characters. To be able to recover traps with a disarm DC of 36, you have to deal with a DC of 46. So you will need 26 modified ranks to recover them.<br/>\nOf course you can use a Find traps spell instead if you have it available. You can also \"disarm\" floor traps by stepping on them and hoping for a successful save, or spawning a summoned creature on them.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:23 PM - Nov 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Many thanks for clearing that up for me, Mick.<br/>\n<br/>\nAnnoyingly for this build, I've enough \"spare\" skill points to get a modified Search of 21 and then have only 7 points left (3 cross-classed, with 1 spare) to try and do anything about what I've found. It's good ol' fashioned \"find trap, save, pray for a save, blow up, reload, repeat until not dead\" time again! Or have a friendly rogue nearby, of course.<br/>\n<br/>\nSo (and I'll edit the OP now) I'll go for Search (cc) 19 (21), Open Lock (cc) 1 (2), then 5 left for either Heal (4) or Lore (7).<br/>\n<br/>\nOh, and @Orion, you mentioned Aielund earlier. It's a non-Dev Crit module, so this build would need a fair few changes before venturing there. One of those changes would involve taking some Concentration, as there are a fair few baddies who use Taunt.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:11 PM - Nov 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hmm Stag just wondering what your thoughts were on a Fighter 8 CoT 4 WM 28 split. Fighter 7 CoT 3 WM 10 pre-epic. Take 1 fighter level and 1 CoT epic whenever you want a bonus combat epic feat. It has a base AB of 53 now. <br/>\n<br/>\nThe will save is dropped to 17 which you might not like. Maybe you might find a way around it? One could drop a little AB to get like an epic will feat for +4 + another feat of your choice, could be a skill focus, toughness, epic energy resistance.... <br/>\n<br/>\nHeh I'd also like improved knockdown earlier but I've gotta go to work now I've finished my cup of coffee in the morning lol, I have no doubt you can make adjustments to make it work<br/>\n<br/>\nAnyway this is what I came up with. Very crude draft<br/>\n<details><summary>Spoiler</summary>Fighter(8), Champion of Torm(4), Weapon Master(28), Human\nSTR: 17 (34)\nCON: 14\nINT: 14\n\n01: Fighter(1): Dodge, Expertise, Mobility\n03: Fighter(3): Weapon Focus: Scimitar\n05: Fighter(5)\n07: Weapon Master(1): Weapon of Choice: Scimitar\n09: Champion of Torm(2): Knockdown, Improved Critical: Scimitar\n11: Weapon Master(3)\n13: Weapon Master(5)\n15: Weapon Master(7): Cleave\n17: Weapon Master(9)\n19: Fighter(7)\n21: Weapon Master(11): Great Strength I, (STR=23)\n23: Weapon Master(13): Overwhelming Critical: Scimitar\n25: Weapon Master(15)\n27: Weapon Master(17): Great Strength III, (STR=26)\n29: Weapon Master(19): Epic Weapon Focus: Scimitar\n31: Champion of Torm(4): Improved Knockdown\n33: Weapon Master(21): Great Strength V, (STR=30)\n35: Weapon Master(23)\n37: Weapon Master(25): Armor Skin\n39: Weapon Master(27): Great Strength VII, (STR=33)\n\nSkillpoints: 215\nSaving Throw bonuses: \nAB (max, naked): 53 (melee), 32 (ranged)\nSpell Casting: \n\n</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:46 AM - Nov 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually a Fighter 6 /CoT 6 / WM 28 split would be more optimal in terms of saves (F6CoT4WM10 pre epic), you don't need any more bonus epic feats and it allows for improved knockdown pre epic.<br/>\n<br/>\nAnyway just posting in the spirit of a suggestion that might improve your build!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}