{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "461",
  "name": "PvP High Magic Server",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/pvp-high-magic-server-t2260220.html",
  "author": "Dante2377",
  "avatar": "10235222_1510287070.jpg",
  "replies": 10,
  "posts": [
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "4:27 AM - Jun 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">So I need a little PvP build advice as I've never really done it much.<br/>\n<br/>\nthe PW I've been playing on is a high magic server - all gear up to +10 with special sets of equipment (e.g. get the armor, shield [if applicable for that class], bracers, belt, boots, and helm all together) that give a +10 AB bonus as well as +10 to all 6 attributes.  Pretty much all immunities are easily had (KD, poison, mind affecting spells) and anyone you'd want to PvP will have +15 to +20 on all 3 saves (min +10).  Figure all weapons will be +10 keen with 30 or more damage bonus (mix of elemental, bludgeoning/slashing/piercing, divine, neg, posivite, etc).  You can pass gear between characters.  Getting +12 in multiple relevent abilities just from gear [no spells necessary] shouldnt be a problem (and figure most people will)<br/>\n<br/>\nSpells and feats have NOT been modified (e.g. vanilla dev crit is available).<br/>\n<br/>\nThe types of builds I mostly see people doing PvP on the server are <br/>\n<br/>\n1. Ftr28 Bard 2 RDD10<br/>\n2. AA builds<br/>\n3. Monk melee builds (e.g. M28 f10 SD2, or M15 R24 SD1)<br/>\n<br/>\nPvP takes on 2 forms - dueling (agreed upon, go to the arena, can negotiate stakes if you want, etc) and also more aggressive Player Killing out in the areas (have to be within 10 levels, no ganging up, no repeatedly targeting weaker guys, etc).  <br/>\n<br/>\none thing to note - when you die not in the arena, your body drops a corpse with all your equipped gear and 50% of the gold you were carrying, so your killer has the option to take your equipped gear if they choose.<br/>\n<br/>\nI built the F10 R5 WM25 build that max recommended in the other thread in this section that I started (minus exotic allowing for +2 great strenth to get to 50 AB before magic enhancements).  He ended up with AB of 76 (keen battleaxe+10, +10 from the \"set\" and another +6 capped str) and AC 85.  He does great PvM there and has been alright/middle of the road for me PvP, but I spent some skill points on locks and traps.<br/>\n<br/>\nMost of the good pvp builds are AC mid 80's, with dex or other higher AC builds into the 90's.<br/>\n<br/>\nthere are almost no magical-based builds that I've seen or at least from the regulars.<br/>\n<br/>\na 20% XP penalty is no big deal if it means a more lvl40 power.  Also, leveling can be easy as I can pass gear down from my 40 to new guys.  Also, they don't complete the level up until a script after you click \"ok\", to prevent max'ing HP, but that also means if you get enough XP to trigger a new level, but don't take it, the system still counts you as your old level for handing out XP, unlike vanilla, so if you find a good level where you're getting 300-500 xp per mob, you can sit on it for a bunch of levels all at once.<br/>\n<br/>\nMy query here is, in that environment, are there some recommended build styles (specific builds for reference would be good, but general themes that might be good here from PvPers - I can look up builds in the search engine from there) and/or any PvP class guides?  I put pvp into the search, but only being 3 characters isn't enough to trigger.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:04 PM - Jun 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Honestly, I hate those environments more than anything you could know. I have played on such environments before, and they're just pathetic. Fighter Bard RDD is excellent because of DevCrits, but the secret in this type of environment is to build for HIGH AC IMO. You should consider using a Bard PM RDD combo, for instance. A Druid / Shifter with Rakshasa shape is also very good. Both these builds should have over 100 AC, which means you'll only get hit on 20's and will never be critted, because the threat roll doesn't have auto-hit on 20. so they'll miss. Add some Regeneration to it and you can imagine. The problem with PvPing like this is that you'll almost always end up on a battle of 20's, since you won't be able to hit anyone either. Offensively, there are a couple of very good options in such environment, which could be my Ugly Mug Hero build Paladin 26 / Fighter 12 / Rogue 2. Some tweaking is required, because you`ll have to drop Knockdown, etc.. or perhaps my Holy Weapon Master with Cheese build, dropping Divine Shield, Knockdown, Improved Knockdown perhaps Divine Might for 4 Great Strength feats and changing the spread to Paladin 20 / WM 19 / Monk 1 for possibly the highest AB you can reach in the server. But it's hard for me to imagine good builds for such environments because, well, I hate them . <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "3:54 PM - Jun 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Max, all good thoughts.  I was less concerned with going out and PKing as much as just not dying to them.  I have another server I play on for questing/long-term development.  This was more for when I was in the mood just to party up and bash some stuff.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:58 PM - Jun 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Generally speaking, if you want to take part in PvP, well... when in Rome, do as the Romans do.    The popular builds are that way for a reason.  Unless the server has just recently undergone a massive recustomization, the vet player will have found all the weak points, if there are any.  The RDD AC/STR exploit is common as is monk -3 progression exploit along with their innate APR advantage.  Seems a bit odd that there aren't many WMs, though.  It would lead me to suspect there are crit immunity items around, enough that all the duelers &amp; PKers have them as standard equipment.  Dunno.  But AA will always achieve the highest AB and should be able to hit 90+ AC PCs/NPCs if the standard AB cap is in place.  Raising an AB from 65 to 66 (or similar AB boosts) results in no difference against high AC PvPers.  Only 20's will hit.<br/>\n<br/>\nMy best advice to avoid wasting a lot of time building test toons is to wait, watch and buddy up.  Observe how confrontations are resolved.  You may be able to coerce your way into arenas with bribery and then use your social skills to learn the build design and equipment details of the victors.  Noobs will usually be trusted.  Vets will be shunned, or even deceived, though.  <br/>\n<br/>\nOnce you feel you have a firm grasp on what to procure then start hunting PvM.  If the server provides persistent stash, then build a serious PvM to amass a primo loot cache.  If not, have your pals help you mule over items to a dueling build.  Once equipped, determine which build(s) you intend to PvP against, suit up and spar.   You will probably find that you will need somewhere around a dozen PvP toons, each one to address a different weakness, to win consistently.<br/>\n<br/>\nIf you want to avoid PKers (for me, they were just an annoyance while I was trying to complete a task, like stepping on a trap), build any toon that can use scrolls via UMD and have someone scribe a boatload of TimeStop &amp; Greater Sanctuary scrolls.  It will usually cost a pretty penny or even some cherished items to get them (unless you yourself build a scriber mule, that is) but it is well worth the investment if neither of those spells have been nerfed (which you have indicated that they have NOT been).<br/>\n<br/>\nNow, as to the paucity of high-level caster builds like Wiz 30/PM 10... are there properties on items that grant immunity to full schools or entire spell levels?  That's a sure way to nerf all caster builds on high-magic and a quite common practice.  How about high-CON melee mage recipro builds?  Faced any of those?   Immunity to magic damage available?  How about immunity to divine?   Usually, players will avoid caster builds because they are difficult to level PvM with the elevated monster immunities, saves &amp; SRs but once they reach 40, they should do very well in PvP unless, as mentioned before, too many immunity properties have been placed on items. <br/>\n<br/>\nFinally, a few general questions to get a \"feel\" for your environment... does the server use the standard +12 ability and +20 AB caps?  Much taunting used? (not a factor vs. archers or artillery casters)  What is the highest DR available on items (not the soak, the anti-penetration level)?<br/>\n<br/>\nLike Max, I dislike PvP servers... the philosophy.  Even a single PKer, if allowed to harass the regular players unchecked by a DM, will drive me from any server... permanently.   What time I have left on this planet I do not want to spend reinforcing the vicarious thrills of adolescents.  That is what nursery school is for.   What little interest I had in PvP play was extinguished after mastering the algorithm to creating successful dueling toons (I won't call them \"builds\" because it was more just an item-procurement adventure).  That took about 3 months to exhaust and then I retired to play only low-magic servers or LAN games where the feel of PnP had not been completely erased by a designer's vision of what \"fun\" is supposed to be.  But different strokes for different folks, I suppose.  Give it a whirl if you are enticed.  Understand one thing, though.  The build itself is secondary to the equipment in high magic environments.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "5:28 PM - Jun 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There aren't any items that give immunity to whole schools (or at least not commonly available).  there are no crit immune items, although a few odd sneak immune ones floating around, but they're not super usable otherwise.  I haven't had any problems crit'ing people (assuming I can hit their AC to confirm crit) assuming they aren't Pale Master.  Some builds have taunt - it's not common but not rare either.<br/>\n<br/>\nstandard +12 ability and +20 AB cap.<br/>\n<br/>\nI have a couple belts that gives 20/+15 DR and various others 15/+11 or 15/+14.    The problem with belts is that none of the \"set\" belts have that kind of DR and if you don't wear one, you don't get the +10AB set bonus from having the whole set equipped.  Might not be an issue for AA.<br/>\n<br/>\nIn general, there are only 1-2 aggressive PKers and they pretty much get ganged up on if they pick on people or party-drop PK type stuff.  It's 98% \"friendly\" PvP.  Just wanted to try it for a bit, different from the ILR/slow stuff I'm used to.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:40 PM - Jun 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Then I would try to level a high-CON Wiz or Sorc with PM 10 to prevent a lucky crit.  Erect the 3 damage shields with Epic Warding.  Make sure to carry a greatsword or some such obvious big 2H weapon so that when your Bigbys land, they will begin swearing and calling you a cheater.  Focus in Evoc &amp; Necro.  The main con about a caster build is that the toon will be limited to PvP and perhaps scribing scrolls, crafting wand &amp; brewing potions for friends. Versus high-magic monsters they suck and need help to reach 40.  <br/>\n<br/>\nAnother worthwhile approach is a DevCrit DEX kukrimaster that will crit over half the time (IIRC 10-20 keened), avoiding all confrontations against crit immunes or ACs that are your max AB+20 or higher.  <br/>\n<br/>\nIf you would like to pursue either of these, let me know &amp; I will post a sample of each.  They are easy to build, but mainly for cheap giggles, though.  I promise you, unless you are tickled easy, it will become quickly boring as it flies directly in the face of what NWN is all about.  And walking around in an anti-PK build will kind of ruin your experience on the server anyhow.  Like you stated, PKers' presence is not tolerated much on today's PWs and the alert will go out when they begin to misbehave.  But, like myself, you may want to try it just to find out for yourself.  In my case, I was begged into doing it by some friends, but consider the experience a waste of time I wish I had back to defrost my refrigerator.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "8:51 PM - Jun 15, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, I'd be interested in seeing samples of both.  I have very little experience with Sorc or Wiz at all.<br/>\n<br/>\nI was also thinking about this <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build221315.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 21315.html</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:38 PM - Jun 16, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>when your Bigbys land,</div></blockquote>\n\nIn those environments, Bigbies don't land<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:21 AM - Jul 05, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><blockquote><div>when your Bigbys land,</div></blockquote>\nIn those environments, Bigbies don't land </div></blockquote>\nCast Timestop, then a Mord and follow up with any no-save Bigby (there are 3 to choose from).  They will land most times except against SR monks which are renown mage killers.  In that case, log a DevCrit arcane archer. We are talking PvP in this case and innate SRs (even with item enhancements) approaching 70 on any server would pretty much negate every caster build, arcane and divine alike.  Casting in PvP using any spell that allows saves is a shortcut to self-demolition.  It's just too easy to build a high-saves toon to counter all those spells.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:11 AM - Jul 05, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong><blockquote><div>when your Bigbys land,</div></blockquote>\nIn those environments, Bigbies don't land </div></blockquote>\nCast Timestop, then a Mord and follow up with any no-save Bigby (there are 3 to choose from).  They will land most times except against SR monks which are renown mage killers.  In that case, log a DevCrit arcane archer. We are talking PvP in this case and innate SRs (even with item enhancements) approaching 70 on any server would pretty much negate every caster build, arcane and divine alike.  Casting in PvP using any spell that allows saves is a shortcut to self-demolition.  It's just too easy to build a high-saves toon to counter all those spells.</div></blockquote>\n\nNo, you don't understand, they won't land not because of SR, they won't land cuz the check they have to make is a Strength check, so you'll get the message: Target Evaded Grappling Attempt.<br/>\n<br/>\nTrust me on this, I used to play in a Brazilian PW with very similar settings, and I NEVER EVER EVER hit one single Bigby's in PvP. We are talking about nearly Capped Dodge modifiers on pretty much all toons (+10 boots, Haste, Mage Armor, sometimes Epic Mage Armor). Capped STR modifiers, etc... Bigby's aren't balanced to deal with that kind of item power.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:39 AM - Jul 16, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Quite familiar with the 2-level Bigby grapple check, Max.<br/>\n<br/>\nTrust ME.  Play a dozen or so different high-magic servers and you will discover a plain fact: there are no standards.  You can assume nothing.  There is no consistency across the spectrum.  Some allow you to forge ridiculous enhancements on every item.  Others remove class requirements altogether.  Still others provide re-levelers.  The list of item &amp; game modifications can become a daunting task to keep track of.  It really doesn't represent the spirit of NWN, at least not for established PnP converts who simply want to play a computer version of AD&amp;D.<br/>\n<br/>\nBesides, I never inferred Bigby's would land against a high-level mage.  Any class that erects spell mantles need not worry about passing a grapple check.  Truth is, on high-magic servers, one will hardly ever find another wizard or sorc to PvP against because the monster stats have usually been so distorted (in order to balance with the item enhancements) that they have a hard time leveling solo so nobody builds them.  That doesn't mean they wouldn't do well in PvP if they were partied to Level 40, though.  That's what the guilds are all about... building death squads.   <br/>\n<br/>\nBigby-focused PvP builds are most useful against AAs which are the bane of many of those PWs.  It also works well against WMs and other non-Dexer melee builds (which are tough to pass the initial AC check against).  I have had a lot of success PvP with a Sorc39/Bard1 taunting grappler.  A few stacks of Timestop scrolls is enough to immobilize most all adversaries so you can cast your Bigby, Timestop, rinse and repeat until it grapples.  Though, even Timestop has been modified differently to prevent lagging the server too much.  Sometimes, Timestop will reduce AC down to almost 0.  Like I said, every high-magic server has its own flavouring.  My own preference of high-magic PWs are those that limit the enhancements to items that would normally contain those enhancements, like rings with Dodge AC would be an example of a server I would avoid like the plague.  Designers of high-magic PWs are generally of two varieties:  capable designers of those that have altered scripting to provide adequate fighter/caster class balance and those inept designers that try to use items to achieve a balance because their scripting abilities are feeble.  Those become the Diablo-esque item hunt servers that distill all the standard NWN build mechanics out of the game and subsequently most of the toon building mechanics.  The vicarious thrill of item procurement serves only a certain audience and I cannot be numbered among them.<br/>\n<br/>\nBigbys rule in PvP.  You just need to find a reasonably-constructed high-magic server to implement it properly.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}