{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "800",
  "name": "Can you help me build a decent lvl 13 bard?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/can-you-help-me-build-a-decent-lvl-13-bard-t2355188.html",
  "author": "Leroux",
  "avatar": "10714033_1519247364.jpg",
  "replies": 12,
  "posts": [
    {
      "author": "Olivier Leroux",
      "avatar": "no_avatar.png",
      "timestamp": "1:01 AM - Oct 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi there, excellent character builder elite! <br/>\n<br/>\nNew member here, was recommended this site over at NW Vault, since despite being a long time NWN player I don't really have much of a clue how you build a good character, especially regarding a class I'm not that familar with. I usually take the easy way out, playing clerics or sorcerers, but now I decided to play a bard, in a <strong>group of four</strong>, the other three characters being a cleric, a sorcerer with pixie and a ranger/harper. We're planning to play <strong>HotU</strong> together, everyone starting at level 13 and everyone can bring three powerful items of choice with them, the rest of the equipment should just be basic stuff.<br/>\n<br/>\nSo what Im looking to build is a <strong>lvl 13 bard </strong>for <strong>PvM</strong>, doesn't need to be a powerhorse, but a character who's able to survive in HotU as a team member while being useful to the others without being too much of a burden, and I would like to integrate these odd ideas (which might or might not work):<br/>\n<br/>\n- <strong>Elf</strong> (purely cosmetic/RP choice)<br/>\n- maybe using <strong>exotic weapons</strong>, possibly a <strong>whip</strong>? (just because I seldom use them otherwise and want to do something different)<br/>\n- additionally or alternatively using <strong>bow</strong><br/>\n- possibly able to do some rogue stuff like <strong>disarming traps</strong> and <strong>opening locks</strong>, to support the pixie and speed things up (does it make sense to invest points in these non-class skills or not?)<br/>\n- bards seem to have quite a bit of mind-affecting spells like \"charm\", \"hold\", \"dominate\", which I usually never use and don't know much about, I wonder if it's feasible to make this bard a <strong>charmer/manipulator</strong> (in addition to being a <strong>disarmer</strong>)<br/>\n- items I have and consider using (<strong>three magic items are allowed</strong>): ring of STR+3, belt of STR+3, glove of Perform+6 (but maybe it would be wiser to invest in good armor?); weapons should be +3, but I could also use Greater Magic Weapon on non-magic stuff at the start, until I find better weapons within the module<br/>\n- I was thinking about adding <strong>RDD</strong> levels, but I'm not sure if that's a good idea yet for a lvl 13 character or whether going pure bard would be preferable<br/>\n<br/>\nDoes that make any sense? Can you build a decent bard with these features or is this utter nonsense? <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nAlso, arcane spell failure seems to be an issue with bards; how should I deal with it? By not wearing armor at all, by buffing in clothing, then switching to armor before the fight, by just going along with the risk and wasting spells in the process? What kind of clothing or armor do you recommend for this bard? And how important is the Concentration skill or combat casting feat for an efficient bard?<br/>\n<br/>\nThanks a lot for any help you can offer!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:21 AM - Oct 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome to the guild O L!<br/>\nIf you start at lvl 13, I bet you want a build that takes you from there as well.<br/>\nYou ask a lot of questions about playing bard. You may find some answers in my Bard Guide.<br/>\nBards can be many things and fill several roles. So take your time and find out what you want your bard to be.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:06 AM - Oct 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Mick's guide is a brilliant guide to the Bard class<br/>\n<br/>\nRE your goals<br/>\n<details><summary>Spoiler</summary>- Elf (purely cosmetic/RP choice)<br/><br/>\n\n<br/><strong>suggest light multiclass with Assassin to get these as class skills and avoid the 20% exp penalty!!! </strong><br/><strong>if you can't stomach being evil suggest light multiclass with rogue you will have a 20% exp penalty however</strong>\n<br/><strong>will want to consider a decent charisma score + spell focus / greater spell focus / epic spell focus in Enchantment? maybe others can comment</strong>\n- items I have and consider using (three magic items are allowed): ring of STR+3, belt of STR+3, glove of Perform+6 (but maybe it would be wiser to invest in good armor?); weapons should be +3, but I could also use Greater Magic Weapon on non-magic stuff at the start, until I find better weapons within the module<br/><br/>\n<br/>\n\n<br/></details>\n<br/>\nAnyway I'd suggest a Elven Bard / Assassin could do what you need<br/>\n<br/>\nPre epic split Bard 16 / Assassin 4<br/>\n<br/>\nLevel 28 split Bard 21 / Assassin 7 ?<br/>\n<br/>\nAnother cool idea might be a Bard 21 / Assassin 4 / Blackguard 3 to get divine might, then you can shoot them with divine damage added to your arrows<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Olivier Leroux",
      "avatar": "no_avatar.png",
      "timestamp": "1:16 PM - Oct 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote:</cite>If you start at lvl 13, I bet you want a build that takes you from there as well.</div></blockquote>\nThat's true. I guess I wrote lvl 13 because I mostly care about the build being fun at lvl 13 already, not so much about the future. Maybe from lvl 13 on, I'll learn by playing, about what works great and what's still missing, but jumping to lvl 13 from scratch without any experience concerning bards and not knowing what I will face is a lot harder.<br/>\nAnyway, I found your guide, thanks!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Olivier Leroux",
      "avatar": "no_avatar.png",
      "timestamp": "1:22 PM - Oct 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks! Sounds like it might make more sense to turn the bard into a robed archer and support character instead of a bold melee whip user.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:08 PM - Oct 08, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you want your Bard to be an archer, and you want to be an Elf, how about a Bard / AA?  For traps, you could have the Lens of Disarming as one of your starting items, since it is something you would have gotten while playing SoU before HotU.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:20 AM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've forgotten how powerful the Find Traps spell / item is! (It's nerfed in WoG)<br/>\n<br/>\nIt's a third level spell in the Bard Spell book.<br/>\n<br/>\nIn HoTU I think you won't have to bother putting any points in disable traps if you are starting at level 13, unless you wish to recover traps<br/>\n<br/>\nAs for open lock, the Knock spell is really strong and makes the open lock skill redundant, not sure if your party has access to it as it isn't a Bard spell.<br/>\n<br/>\nMind you I think you can just bash things open anyway<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:27 PM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">When deciding how you want your character to be and what role/ part is should play, it may help to look at the other party members; what they are capable of and if they leave any gaps that need to be filled. <br/>\nI assume that the sorcerer is going to focus on casting attack spells, debuffing with Mord's etc. A bard will never be able to compete with that. Bard has some nice buffing and utility spells on its own, but there is a great chance that you don't even need that since you also have a cleric in the party with many strong buff spells.<br/>\nClerics are top notch melee characters, given their very strong buffing spells. They can also be great casters of attack spells and work great as \"spell-swords\".<br/>\nThe ranger/HS can have many roles, depending on how it is built; melee fighter, archer, trapper and scout are all possible. <br/>\nThe Pixie familiar of the sorcerer can to some degree serve as a rogue, disarming traps and opening locks.<br/>\nThe most likely roles for your character in this party is either as a second melee character along with the cleric or as an archer depending on if the ranger focuses on archery or melee. In both cases your character can support the party with a bard song. If you go toe to toe with your foes (or at least within 30 feet), a curse song can often be very effective. <br/>\nHow much you want to focus on rogue skills depends in part on what role the ranger has, and in part on how much the sorcerer player wants to use the familiar.<br/>\nThere are plenty of bard based builds for the roles I outline here.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Olivier Leroux",
      "avatar": "no_avatar.png",
      "timestamp": "5:27 PM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote: <a data-post-id=\"17242\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17242&amp;sid=1cdc8a279ec09bea8cad0b44671b506b#p17242\">↑</a><div class=\"responsive-hide\">Oct 09, 2019</div></cite>When deciding how you want your character to be and what role/ part is should play, it may help to look at the other party members; what they are capable of and if they leave any gaps that need to be filled. </div></blockquote>\nFrom what I heard, the cleric and the ranger are not the best tanks, but doing okay (I assume that means the ranger uses melee weapons, but I'd have to ask). The pixie is doing fine with rogue stuff, too, but the sorcerer would be ready to switch to a different familiar, in case I wanted to take on the rogue's role. What they don't have is someone who sneaks or sneak attacks, or an archer apparently (if I understood that right), though another melee fighter wouldn't hurt either.<br/>\n<br/>\n<br/>\nWhen I play casters I usually just use the most obvious attack spells, so I assumed the cleric and sorcerer might do the same, instead of casting crowd control spells like Charm/Dominate which my bard could do. Then again, I've never tried this in NWN and don't know how useful and effective these spells are, or whether they're even needed, when the sorcerer can bombard the opponents with AOE spells anyway ...<br/>\n<br/>\n<br/>\nI don't necessarily need to play a bard either, I could also play a rogue (which I'm not very familiar with either), or a real tank, but I find fighters without access to magic rather boring to play, and I thought if I have to go out of my usual comfort zone, bard would the most interesting choice, and quite useful for the others.<br/>\n<br/>\n<br/>\nThe reason why I asked for help is that I built a lvl 13 bard on my own and tried it on the playground of the Pretty Good Character Customizer module, and the character was very vulnerable even against opponents with challenge ratings of Effortless or Easy, which made me wonder whether the bard would be able to survive HotU. Of course, what I experienced might be quite misleading, because in the module the bard was alone and outnumbered and not a support character in a team.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Olivier Leroux",
      "avatar": "no_avatar.png",
      "timestamp": "5:32 PM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"17241\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17241&amp;sid=1cdc8a279ec09bea8cad0b44671b506b#p17241\">↑</a><div class=\"responsive-hide\">Oct 09, 2019</div></cite>I've forgotten how powerful the Find Traps spell / item is! (It's nerfed in WoG)<br/>\n<br/>\nIt's a third level spell in the Bard Spell book.</div></blockquote>\nInteresting, I didn't realize Find Traps also disarms them.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "7:45 PM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I stealthy come into this discussion to encourage you to not to give up on playing bards as front-line fighters. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\nBards have been my stepping stone to spellswords, and can be quite tanks, thanks to some spells (for example improved invisibility/war cry/dirge/haste), songs (bard song/curse song) and access to a wide range of skills (for example, tumble for the extra AC, discipline, use magic device, spellcraft) ;)<br/>\nFor a level 28 HotU PC, as an example, you can build a:\n<ul>\n<li>Bard16/Fighter2/RDD10;</li>\n<li>Bard23/fighter1/RDD4.</li>\n</ul>\nThe bard level will provide you spells, tumble AC and a great bard/curse song (that lasts more time, for the second build); from RDD you will get ability bonuses and (if taken to lv 10) various immunities; few fighter levels will provide you extra feats and armor and weapon proficiencies.<br/>\n<br/>\nEDIT: I know that these examples, as an elf, will take you an exp penalty, but I wanted just to give you some ideas on front-line bards. You may even want to play an elf bard 23/rdd 5: you will not take an exp penalty and you will benefit on a \"very lasting\" song and increases to abilities (and +1 to AC) from lv 5 RDD.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Olivier Leroux",
      "avatar": "no_avatar.png",
      "timestamp": "10:19 PM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I vaguely remember about multi-classing that the order in which you choose classes may matter a great deal, since you might miss out on some things if you take a class at the wrong character level. Is that true? I think that's also part of why I was asking about a lvl 13 build initially, because with a lvl 40 build I have even less of a clue when to take what.<br/>\n<br/>\nI could imagine playing a front-line bard, but I wonder if constantly having to pay attention to arcane spell failure and switching armor before fights isn't too bothersome in a multiplayer game without to pause ...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "11:30 PM - Oct 09, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I don't know to what you refer for \"missing out some things\", I'll only tell you that the level order can be critical: maybe there are great features you need to be anticipated to make the build more versatile or playable...<br/>\n<br/>\nI am now playing a sorcerer spellsword and it is quite different than a bard one, as you have to cast many spells during combat (e.g. if your buffs are dispelled/wear off/circumstances need it: if a strong enemy is coming at you, you want to activate elemental shields to drain your opponents' HP because you know that he/she will beat your AC many times...or you want to use time stops/Isaac's missiles/etc...).<br/>\n<br/>\nBards are meant to use a little range of spells during combat (song excluded, as it is not a spell): haste, wounding whispers, dirge, war cry, expeditous retreat, keen edge. Other buffs can be casted outside combat.<br/>\nSome spells, like darkness and displacement, are not subject to arcane spell failure.<br/>\nMaybe other members will disagree, but I would advise you to avoid buffing a lot while fighting; for example, in many fights haste + bard song can turn the outcome of a fight. Wounding whispers can be used in tough boss fights; if you are swarmed by enemies better on investing on AC and avoiding uses of heals and potions, than damaging enemies this way (you have to be hit, and either you have barkskin/stoneskin/premonition on, or your  HP will decrease fast).<br/>\nBesides, casting spells means high chance of attacks of opportunity, that can (best situation) damage you or (worst situation) damage you and interrupt spellcasting.<br/>\n<br/>\nTo deal with spell failure, you can take the \"still spell\" feat which make you cast a specific spell without any failure, at the costs of one slot higher than the spell's one. For example, a stilled haste would consume a 4th level slot; you can cast your 4th level spells as if they are level 5, thing to be considered as the only useful spell on that slot is greater dispelling.<br/>\nYou cannot still lv 6 spells, however energy buffer can be casted outside fighting....you will only lose dirge, but if you focus on AC you can fight without it.<br/>\n<br/>\nEDIT: I am currently playing as a cleric spellsword in a server, and in my opinion it isn't too troublesome to buff during combat. Just organize your quickslots so the spells you plan to use are in places where clicking is faster (for me this is the centre of the bar). Don't be afraid to change the allocation if you aren't anymore comfortable with the current order.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}