{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "177",
  "name": "Bard/WM/PM",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bard-wm-pm-t2354503.html",
  "author": "Kalis",
  "avatar": "10577588_1510287072.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "Lieutenant Kalis",
      "avatar": "no_avatar.png",
      "timestamp": "5:48 AM - Feb 23, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Was thinking of a versatile toon. Thinking of going 20 bard. But I have not made a bard before. Race: Human. 20Bard/7WM/12/PM. What are the necessary feats I would need to make it effective in its environment. Weapon prof was thinking Scimitar because of its critical modifier if keened. Something fun.. who can take on and take care of its own weight. What is it you gents, suggest.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:54 PM - Feb 23, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Before trying to hash out an alternative (I suspect a weak one at that), a few questions:<br/>\n<br/>\n 1) What is your goal beyond \"versatile\"?  A support tank?  A solo toon relying a good deal on summons to buy some time for casting?  By choosing 2 of the least versatile PrC alternatives out there (not to mention Bard's lack of any bonus feats) can you see the conflict in your assertion?<br/>\n 2) What \"IS\" the planned environment?  Level 40 cap?  Dispels/Mords likely to be spammed at your toon? With your suggested split I don't see an AB level that will cope with high AC enemies... not enough WM levels to elevate it effectively at all.  Are you planning to use scrolls for offensive purposes since the bard class itself has little casting in that area.  High UMD (at least a modified 33, in other words) is a must for that plan.<br/>\n 3) The split seems to infer a serious singer/curser yet no <em>Lasting Inspiration</em> is possible.  What merit those last two PM levels?  AC will not be the problem but hitting regularly will.<br/>\n 4) Casting in robes w/o shield only?  Otherwise, Autostill is the only recourse and that is 4 feats with 3 in epic levels (i.e. fewer great ability feats to further pad a pedestrian AB during epic levels).<br/>\n 5) You'll be needing Martial Prof to go with Scimi.  In feat-starved bardic build?  There goes your hope for versatility without KD/IKD or PA/Cleave since WM will cost 7 feats, 8 with scimi. And Still Spell with armor/shield yet another non-combat pre-epic feat allotment, make that 9.  If you can't manage at least Blind Fight and Improved Crit, any combat-focused build is at a huge disadvantage in-game.  But you'll have plenty of time to watch your partymates make all the kills so bring your knitting or a paperback.<br/>\n 6) Scimi MUST be a STR build.  At least <em>Weapon Finesse</em> can be ignored, but are you willing to remain in catch-up mode AB-wise and dmg-wise all through the toon's paled STR development?<br/>\n 7) The ability spread will be anything but versatile.  CHA 16, DEX 13, INT 13, STR 14, CON 12, WIS 8 is looking fairly anemic already. You'll need to shift points if you want to taunt but where from... CON? STR?  I can feel the vise closing as we consider this line of reasoning.<br/>\n<br/>\n All-in-all, not a sound direction worth pursuing, as evidenced by the scant few others who have attempted to breach this void.  Also... <strong>do not become too enamored at the lure of increased multiplier and crit range of the WM class</strong>. If your toon cannot approach an adequate AB needed to elicit all those crit opportunities, all you end up with is a potentially-decent build watered down by all the WM prereqs.  If you don't want to take advantage of a high-level singer and just stick to support casting, RDD 10/PM 10 would fare MUCH better than this concept (not that I am encouraging that plan either but it does make a bit more sense) and one that presents many alternatives (i.e. \"versatility\").  Apologies for showing up with the proverbial bucket of cold water, but better now than later, eh?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "12:28 AM - Feb 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As HM points out, Weapon Master requires a lot of feat investment and given that PM is a low AB class, the combo looks counter productive.<br/>\n<br/>\n For BD/WM/PM, you invest STR 13, DEX 13, 4 Intimidate, Dodge, Expertise, Mobility, Spring Attack &amp; WWA to get +1 AB, 1 extra attack (if you go 12 Bard pre-epic and 7 WM) increased multiplier and threat range.<br/>\n<br/>\n For BD/RDD/PM you invest 8 Lore to get +8 STR, +2 CON, +2 INT, +2 WIS, +4 AB, +4 AC, Fire/Sleep/Paralysis Immunity.<br/>\n<br/>\n Other than the extra attack (at -15), the balance for me is heavily tipped towards RDD over WM.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:47 AM - Feb 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Lieutenant Kalis!<br/>\n<br/>\n I don't pretend to have the expertise of either Hip or Theophilus P Wildebeest (sorry, showing my age there), but I do wonder why you've gone for PM in your mix? What does it bring to the table? If you're looking for versatility, then Bard's great (I had to be convinced and trusting of the great and good when I first took the class in a build), and there's very little that won't be helped by RDD. If I might suggest a radical choice for a third class, why not Fighter? It'd certainly help with your AB, without taking 853 feats to qualify for it! For what it's worth, if you're going to take WM, you've really got to invest heavily in it (there's a discussion somewhere here I had with Max last year - probably in my Grim Stonefoot thread - and he was right, even if Grim was a lovely doorstop) from the point you take it - probably one reason why I don't enjoy playing WM below overall level 30* - whereas it's almost the other way around with Fighter - if it's going to be a supporting class, you only really need 4 or 6 levels. Equally, if RDD does hold some appeal, 10 levels is the number to get all the best stuff from the class. Now, this could open up more Bardic levels if you like, or you could try a Bard 20 / RDD 14 / Fighter 6. Just spitballing - you know what you want to achieve!<br/>\n<br/>\n * Thinking about it, no one should be a weapon<em> master</em> much before then anyway.<br/>\n<br/>\n Oh, and welcome!<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Just realised this would take 2 of your 3 requested classes out, so please feel free to ignore me.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:10 AM - Feb 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Stagmeister's on the right track with Fighter levels to help rise out of the muck. <br/>\n<br/>\n Trying to stay as close as possible to the original split requested, but declining to include the WM feat sink, maybe something like:<br/>\n<br/>\n Bard(20), Fighter(10), Pale Master(10), Unlawful Non-good Human<table class=\"post_content_table\"><tbody><tr><td>STR: 15 (28)</td><td>...........</td><td>HP: 378</td></tr><tr><td>DEX: 10</td><td>-----------</td><td>Saves (F/W/R): 24/22/22 (33/31/31 vs spells)</td></tr><tr><td>CON: 14</td><td>-----------</td><td>BAB: 26</td></tr><tr><td>WIS: 8</td><td>-----------</td><td>AB (max, naked): 39 (melee), 27 (ranged)</td></tr><tr><td>INT: 14</td><td>-----------</td><td>AC (naked/mundane armor/shield only): 26/37</td></tr><tr><td>CHA: 15 (16)</td><td> </td><td> </td></tr></tbody></table>\n 01: Brd(1): Blind Fight, Curse Song<br/>\n 02: Ftr(1): WF: Scimitar<br/>\n 03: Brd(2): Lingering Song<br/>\n 04: Ftr(2): STR+1 (16), KD (or PA)<br/>\n 05: Brd(3)<br/>\n 06: PM(1): Extend Spell<br/>\n 07: Brd(4)<br/>\n 08: Brd(5): STR+1 (17)<br/>\n 09: PM(2): Still Spell<br/>\n 10: Ftr(3)<br/>\n 11: Ftr(4): WS: Scimitar<br/>\n 12: Brd(6): STR+1 (18), IC: Scimitar<br/>\n 13: Brd(7)<br/>\n 14: Brd(8)<br/>\n 15: Ftr(5): Empower Spell<br/>\n 16: Brd(9): STR+1 (19)<br/>\n 17: Brd(10)<br/>\n 18: Ftr(6): Lightning Reflexes, IKD (or Cleave)<br/>\n 19: Brd(11)<br/>\n 20: Brd(12): STR+1 (20)<br/>\n 21: PM(3): Grt STR (21)<br/>\n 22: PM(4)<br/>\n 23: PM(5)<br/>\n 24: PM(6): STR+1 (22), Grt STR (23)<br/>\n 25: PM(7)<br/>\n 26: PM(8)<br/>\n 27: PM(9): Grt STR (24)<br/>\n 28: PM(10): STR+1 (25)<br/>\n 29: Ftr(7)<br/>\n 30: Ftr(8): EWF: Scimitar, EWS: Scimitar<br/>\n 31: Ftr(9)<br/>\n 32: Ftr(10): CHA+1 (16), Armor Skin<br/>\n 33: Brd(13): Grt STR (26)<br/>\n 34: Brd(14)<br/>\n 35: Brd(15)<br/>\n 36: Brd(16): STR+1 (27), Epic Prowess<br/>\n 37: Brd(17)<br/>\n 38: Brd(18)<br/>\n 39: Brd(19): ESkF: Taunt<br/>\n 40: Brd(20): STR+1 (28)<br/>\n<br/>\n Skills @40: Discipline 43(52), Perform 43(46), Spellcraft 43(45), Taunt 43(56), Tumble 40(40), UMD 30(33), remaining ---&gt; 19<br/>\n<br/>\n Personally, I despise going so far into bardic development without <em>Lasting Inspiration</em> so would gladly shed an AB to get it.  In that case, the split would be Bard22/Ftr8/PM10 with the additional benefit of being less easy to dispel your buffs.<br/>\n<br/>\n I went straight to PM10 in epic for no particular reason other than it seemed \"clean\" (and fast). The sequence is open for readjustment, of course. Feat selection was based mainly on my own experience of what seems to work on most servers I've played.  Notice that Still Spell won't help your level 6 spells so choose armor/shield to give you the best chance for casting success for those spells.  Autostill is impossible for a bard unless combined with a casting class that can qualify... unfortunately.<br/>\n<br/>\n Keep in mind, that your songs will increase your AC by 7 (Bard song 5 + Curse song 2) and AB +7 likewise but reversed song effects.  Successful taunts will net your toon another 6 AB max.  Figure +3 AB for Empowered Bull's.  The only downside of the Bard spellbook is the lack of Endurance (never really figured that one out myself) which would have really helped your HP total.  Go find some potions I suppose.<br/>\n<br/>\n Let this example serve as a metric against which you can compare an RDD version.  I suggest you try to piece one together yourself as a learning exercise since you have a template now to work from.<br/>\n<br/>\n Well, this one is versatile at least. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />  And you have your Keen Edge buff that you wanted.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}