{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "236",
  "name": "Blade (Fighting Bard), FTR 14 WM 25 Bard 1 (Dev.Crit)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/blade-fighting-bard-ftr-14-wm-25-bard-1-dev-crit-t2293727.html",
  "author": "TyrTemplar",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "2.9K",
  "posts": [
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "11:53 PM - Oct 20, 2012",
      "content": "<div>Blade, the Fighting Bard<br/>\nBy Deborah “Tyr” Templar<br/>\n<br/>\nAuthor’s Note: This is Blade, the Fighting Bard (Dev.Crit) who originally appeared in the ECB1 back in 2005- as part of a series, entitled: “the Fighting Bard”, and re-tweaked in light of the 1.69 patch. To see the original character, with links to other characters in the series along with other builds utilizing the class combination at time of original posting, see: <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build246241.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 46241.html</a> <br/>\n<br/>\nIs the Pen Truly Mightier than the Sword?<br/>\n<br/>\nBlade, The Fighting Bard-- Fighter(14), Weapon Master(25), Bard(1)<br/>\nRace: Human / Alignment: Any non-lawful (Theme: Chaotic Good, Chaotic Neutral)<br/>\n<br/>\nI. Attributes:<br/>\nSTR: 17 (34)<br/>\nDEX: 13<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nII. Level Guide:<br/>\n01: Fighter(1): Dodge, mobility, power attack<br/>\n02: Fighter(2): cleave<br/>\n03: Fighter(3): weapon focus: scimitar<br/>\n04: Fighter(4): STR+1, Weapon Specialization: Scimitar, (STR=18)<br/>\n05: Fighter(5)<br/>\n06: Fighter(6): knockdown, spring attack<br/>\n07: Fighter(7)<br/>\n08: Fighter(8): STR+1, expertise, (STR=19)<br/>\n09: Fighter(9): blind fight<br/>\n10: Fighter(10): whirlwind attack<br/>\n11: Weapon Master(1): Weapon of Choice: Scimitar<br/>\n12: Weapon Master(2): STR+1, improved critical: scimitar, (STR=20)<br/>\n13: Weapon Master(3)<br/>\n14: Weapon Master(4)<br/>\n15: Weapon Master(5): toughness<br/>\n16: Weapon Master(6): STR+1, (STR=21)<br/>\n17: Weapon Master(7)<br/>\n18: Fighter(11): improved knockdown<br/>\n19: Fighter(12): great cleave<br/>\n20: Fighter(13): STR+1, (STR=22)<br/>\n21: Weapon Master(8): Great Strength I, (STR=23)<br/>\n22: Weapon Master(9)<br/>\n23: Weapon Master(10)<br/>\n24: Weapon Master(11): STR+1, Great Strength II, (STR=25)<br/>\n25: Weapon Master(12)<br/>\n26: Weapon Master(13): epic weapon focus: scimitar<br/>\n27: Fighter(14): Great Strength III, epic weapon specialization: scimitar, (STR=26)<br/>\n28: Weapon Master(14): STR+1, (STR=27)<br/>\n29: Weapon Master(15)<br/>\n30: Weapon Master(16): Great Strength IV, Overwhelming Critical: Scimitar, (STR=28)<br/>\n31: Weapon Master(17)<br/>\n32: Weapon Master(18): STR+1, (STR=29)<br/>\n33: Weapon Master(19): Great Strength V, devastating critical: Scimitar, (STR=30)<br/>\n34: Weapon Master(20)<br/>\n35: Weapon Master(21)<br/>\n36: Weapon Master(22): STR+1, Great Strength VI, epic prowess, (STR=32)<br/>\n37: Weapon Master(23)<br/>\n38: Weapon Master(24)<br/>\n39: Weapon Master(25): Great Strength VII, armor skin, (STR=33)<br/>\n40: Bard(1): STR+1, (STR=34)<br/>\n<br/>\nIf looking to PvP your Blade, <br/>\nMight consider adjusting your abilities as follows: STR: 18 (34), DEX: 13, CON: 12, WIS: 8, INT: 13, CHA: 8, picking up Grt.Fort (instead of IKD), and ESF: Discipline or Epic Fort instead of what in turn would be an extraneous Grt.Strength, swapping AS (-2 AC) with Epic Toughness so as to retain your dev.crit (DC), STR (AB/Damage) set-up, in exchange for -20HPS (i.e., 496 HPs adj), -43 skills (i.e., loss of Taunt or Spellcraft, depending on your choice; alt, since bard entitles use of arcane items, UMD's for monk gear and possibly some obscure cleric items, it's a candidate for picking up spellcraft in any event and instead, depending on what's available and preferences). You are a straight up, no-nonsense WM: you hit, you crit. Things die. <br/>\n<br/>\n--<br/>\nIII. Basics: <br/>\nHitpoints: 516<br/>\nSaving Throws (Fortitude/Will/Reflex): 22/15/20<br/>\n<br/>\nIV. Combat Vitals:<br/>\na. Devastating Critical (DC): 42 / Bio-Cap 48<br/>\n<br/>\nb. Mundane Weapon: BAB: 30, AB 52, +1 Song: 53, +6 Taunt: 59 AB<br/>\nBio-Cap (assuming +12 STR, +20 Weaponry/UMD—i.e., Truestrike): 78, +6 Taunt: 84 AB<br/>\n<br/>\nc. Damage:<br/>\nMundane Scimitar: AB 53, +6 Taunt: 59 AB; Damage: 1-6+18, +1 Song, OR: 1-6+19 (crit: 13-20/x3)<br/>\n+5 Keen Scimitar, +6 STR: AB 61, +6 Taunt: 67 AB; Damage: 1-6+27 (crit: 10-20/x3). <br/>\nOn a crit: 84-99 damage (while forcing the save against insta-death on each and all of them crits!). <br/>\n<br/>\nV. Defense Vitals:<br/>\nAC: 21, +8 Mundane Plate, +3 Mundane Tower Shield: 32, +5 Expertise: 37 AC (-5 ab)<br/>\nOther: UMD, Dev.Crit (the dead don't strike back, no?   ) <br/>\n<br/>\nVI. Spell Casting: UMD<br/>\n<br/>\nVII. Skillpoints: 217*<br/>\nDiscipline 43(55), Intimidate 4(3)(WM prereq.), Listen 43(42), Perform 4(3), Tumble 40(41), UMD 36(35), and either: Taunt 43(42) (lowers enemy AC, +6 effective AB)-or- Spellcraft 43(45) (+9 saves vs. spells).<br/>\n<br/>\nPlayers should feel free to adjust their Blade to suit their own needs/environs, as always. <br/>\n<br/>\nCrit ON! ~ Tyr<br/>\n<br/>\nEDIT: damage calculation. Added alternative feat selection option.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:25 PM - Oct 25, 2012",
      "content": "<div><strong>I like the smell of ki damage in the morning...</strong><br/>\nThese epic Weaponmasters have so high AB that you can afford to walk around in PA mode all the time adding +5 damage to every hit. Even adding IPA is worth considering in some builds. <br/>\nThe same is valid for Expertise and IE.<br/>\nThe weakness of these builds is the low will save. One really should try to find items that grant immunities vs mind effects.<br/>\nAnd in a Dev crit build the fort save should also be as high as possible to survive dev crit duels. <br/>\nIn this Dev crit build I would try to find room for Great fortitude and Epic fortitude, and perhaps even Luck of heroes. One way of clearing two general feats is to aim for str 32. The AB and damage would still be high enough.<br/>\nMick</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "3:37 PM - Oct 25, 2012",
      "content": "<div>Mick, will saves are the typical weakness of melee (and easist thing to shore up--i.e. clarity potions and mind-blank scrolls). In terms of PvP, couldn't possibly agree more with the importance of the Fort save, though. And reason why under the level guide I put in the option to take Epic Fort.   <br/>\n<br/>\nSo glad you asked about it, and important to highlight, along with the fact (me bad) that somehow I neglected to put in the additional option to swap IKD for great fort pre-ep (this, for PvP, as I always recommend, but for some reason missed putting that in, so very glad you asked! Thanks). Et VOILA: +6 Fort (which is good, and which players will enjoy much better in PvP than IKD, I agree. (Note: IKD being nice to have PvM/E for downing \"huge\" things like dragons, etc., but not so important PvP where it's an AB/attack roll check against discipline (so AB/STR very nice there, too!). <br/>\n<br/>\nWith high STR speaking not only to the AB, but also all the Dev.Crit (DC) factor (DC 42 / 48 cap is high, and more than does the trick, I agree; but I like my AB/damage set-ups, always did (you hit, you crit. Things die. Simple). All that STR bolstered by WS/EWS multiplies beautifully on a crit, too! So don't be messing with the AB/damage set-up, or Dev.Crit DC either--this be a PG/melee warrior, all about the crit.factor and focussed around same (going the Fort option as set out above under the level guide, and swapping IKD with Great Fort for more of it if PvP'ing your Blade, which is important, I agree with you). You hit, you crit. NEXT. (Enemies die fast, and chews through mobs like there's no tomorrow...<br/>\n<br/>\nKi is cool, too, and yes, Expertise and PA actually can be used! Also nice that the patch fixed up whirlwind attack, which in pre-patch never used, but now that it's fixed/working ... heh, enjoy! No, don't need so much AB/DC if PvM/E, but I LOVE my AB/damage, and also the fact that with high STR and WS/EWS, your Blade won't exactly be standing around poking say an undead boss with a scimmy as those things be crit. immune, so you'll be most happy to have all that STR (AB/damage) in tact so as to dispatch the crit.immune nicely, too! <br/>\n<br/>\nNo such thing as too much AB/damage on a melee--you hit, you crit, things die, with lots of non-crit damage coming in on the crit.immune (including an actually useful PA, etc., too). Yes, high AB is nice, just plain nice, I tell you!  ). That said, and in PvP especially, no such thing as too much saves either, and why the option is there, along with swapping IKD for more of it, too (so don't be messing with the STR/AB-damage set-up, especially when it comes to the dev.crit, as no such thing as too much DC either .. heh, heh). Thanks, Mick, and what can I say: just love this guy adn still do, so revisiting that old series was inevitable (a given, really; heh, memories, eh?). And yes, more Fighting Bards to come, to be revisited in light of 1.69 patch, so stay tuned, folks (thanks again, Mick, appreciate the comment and the question). <br/>\n<br/>\nSlash, sing and Crit ON~ Tyr</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "10:12 PM - Mar 15, 2016",
      "content": "<div><blockquote><div><strong>TyrTemplar wrote:</strong><hr/>Mick, will saves are the typical weakness of melee (and easist thing to shore up--i.e. clarity potions and mind-blank scrolls).<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Before other players consider falling into the same trap as proposed here, let me become more pragmatic than hypothetical.  Unless you are loaded with enough clarity pots or similar scrolls to spend every step consuming those resources while wandering an unfamiliar map, any weak-willed toon will succumb to mind-effects.  Even relatively low-level invisible or stealthing casters spamming <em>Hold Person</em> (often scattered about in small, concealed clusters) will quickly dominate your toon without prior warning.  And that is the least potent of mind spells to deal with.<br/>\n<br/>\n Mick's suggestion of wearing a mind-immunity item is the only recourse for a non-magik assuming the environment even provides gear with that property.  Nope.  There is no replacement for adequate save ratings, hence the bias towards CoT or hi-CHA Divine Grace (or Dark Blessing) toon designs where such threats proliferate.  Low-level pot &amp; scroll buffs, so easily dispelled, are not reliable within any environment using a competitive creature AI.  During combat, they waste rounds and open up AoOs, hardly an efficient panacea.</div></div>"
    }
  ]
}