{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "091",
  "name": "Glimmer Wronghead (Barb 2/ Bard 11/ AA 27)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/glimmer-wronghead-barb-2-bard-11-aa-27-t2355593.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": 11,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:35 PM - Oct 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><em><span style=\"background-color:#FF0000\"><span style=\"background-color:#000000\"><span style=\"color:#FF0000\"><span style=\"background-color:#EEEEEE\">Moved to the Full Epic forum 23/3/21 - details below.</span></span></span></span></em><br/>\n<br/>\nHaving looked through the ECB Guild filter I couldn't find one of these. Alas, I couldn't check the old engine atm - everything seems to be collapsing currently. The lack of one does make me question whether I'm missing something, but I'll ask the Guild anyway...<br/>\n<br/>\nThis is for a character in my fanfic, dropped into NwN as close as possible, so I've got loads of back-story, but that can wait until we see whether it's worth it. Suffice to say, she was raised a weak little oddball in a clan of barbarians, but turned out to be a deadshot with a bow and cheerleader for the raids.<br/>\n<br/>\nIn fact, here's the first time we meet her - and her first, hesitant kill...\n<details><summary>Spoiler</summary>\"Glimmer.\"\nShe prised one eye open. A slit of stabbing, sickening brightness.\n\"Come back.\"\nShe pushed the spit-wet dowel out of her mouth with her tongue and croaked the one word she could think of. \"Shit.\"\n\"There's my girl!\" Yull squatted beside her, necklace of runes and bones dangling, grinning that twisted grin that showed the hole in his teeth and offered no help at all. \"What did you see?\"\nGlimmer heaved one hand up to grip her head. Felt like if she didn't hold her skull together it would burst. Shapes still fizzed on the inside of her lids, like the glowing smears when you've looked at the sun.\n\"I saw folk falling from a high tower. Dozens of 'em.\" She winced at the thought of them hitting the ground. \"I saw folk hanged. Rows of 'em.\" Her gut cramped at the memory of swinging bodies, dangling feet. \"I saw...a battle, maybe? Below a purple hill.\"\nYull sniffed. \"This is the north. Takes no magic to see a battle coming. What else?\"\n\"I saw Ustred burning.\" Glimmer could almost smell the smoke still. She pressed her hand to her left eye. Felt hot. Burning hot...\n...\"What does it mean?\"\nYull held a fingertip to his scarred lips, the way he did when he was on the verge of deep pronouncements. \"No bloody idea. Mayhap the turning of time's wheel shall unlock the secrets of these visions.\"\nGlimmer spat, but her mouth still tasted like despair. \"So...wait and see, then.\"\n\"Eleven times out of twelve that's the best course.\" Yull scratched at his collarbone and winked. \"But if I said it that way no one would reckon me a deep thinker.\"\n\"Well, I can unveil two secrets right away.\" Glimmer groaned as she pushed herself up onto one elbow. \"My head hurts and I shat myself.\"\n\"That second one's no secret, anyone with a nose is party to it.\"\n\"My thanks for that.\"\n\"No bother.\"...\n...\"So...you really think I've got the Eye?\"\nYull strode on through the woods with that loping gait that, however fast Glimmer walked, always left her an uncomfortable half-step behind. \"You think I'd be pissing my efforts away on you otherwise?\"\nGlimmer sighed. \"S'pose not. Just, in the songs, it's a thing witches and magi and deep-wise folk use to see into the fog of what comes. Not a thing that makes idiots fall down and shit themselves.\"\n\"In case you never noticed, bards have a habit of dressing things up. There is a fine living to be made, d'you see, in songs about deep-wise witches, but in shitty idiots, less.\"\nGlimmer sadly conceded the truth of that...\n...Yull stopped dead, tattooed hand raised and eyes narrowed. All Glimmer could hear was whispering branches, the tap of drips from the melting snow, the tweet of birds in the budding trees.\nGlimmer leaned towards him. \"What's the -\"\n\"Nock a shaft to your bow and keep 'em talking,\" whispered Yull.\n\"Who?\"\n\"Failing that, sing 'em a song. You're blessed with a fine voice.\" And he darted off the road and into the trees.\n\"A song?\" hissed Glimmer, but Yull's flitting shadow had already vanished into the brush.\nThat was when she heard a man's voice. \"Sure this is the way?\"\nShe'd had her bow over her shoulder, hoping for a deer, and now she shrugged it off, fumbled out an arrow and nearly dropped it, managed to get it nocked in spite of a flurry of nervy twitches up her arm.\n\"We was told to check the woods.\" A deeper, harder, scarier voice. \"Do these look like woods?\"\nAn old man came around the bend in the road. He held a staff in his hand, and he lowered it, metal gleaming in the dappled light, and Glimmer realized it weren't a staff but a spear. There were three of them. The old one had a sorry look, like none of this was his idea. Next came a nervous lad with a shield and a short axe. Finally, there was a big man with a heavy beard and a heavier frown. Glimmer didn't like the look of him at all.\nHer mother always said not to point arrows at folk unless you meant to see 'em dead, so she drew her bow halfway and pointed it at the road. \"Best hold still,\" she said.\nThe old one stared at her. \"Girl, you have a ring through your nose.\"\n\"I am aware.\" And Glimmer stuck her tongue out and touched the tip to it. \"It keeps me tethered.\"\n\"You might wander off?\"\n\"My thoughts might.\"\n\"Is it gold?\" asked the lad.\n\"Bronze,\" she lied, since gold was apt to turn unpleasant meetings into lethal ones.\n\"And the paint?\"\n\"The mark of the cross is a goodly mark much loved by the moon. The Eye is the left eye and the cross will keep it's sight true through the fog of what comes.\" She turned her head and spat without taking her eyes off them, then added, \"Maybe,\" since she wasn't sure the cross had done a thing but get smeared on her pillow when she forgot to wipe it off of a night.\nShe wasn't the only doubter. \"You mad?\" growled the big man.\nGlimmer sighed. Far from the first time she'd fielded that question. \"One person's mad is another's remarkable.\"\n\"Be a fine thing if you were to put that bow down,\" said the old one.\n\"I like it where it is.\" Though she definitely didn't. It was getting all sticky in her hand, shoulder aching from the effort of holding it half-drawn, and a twitch in her neck starting up that she worried might jerk the string loose. \"What you doing down here?\"\n\"Putting an end to Dyse and her arse-lickers, and bringing Ustred back into Inith where it belongs.\"\nGlimmer's knuckles whitened around her bow, fear turning to anger. \"You are fucking not.\"\n\"Already happening.\" The old man shrugged. \"Only question for you is whether you'll be raised up with the winners or slung in the body-pit with the losers.\"\n\"She is bloody mad.\" The big one stepped forwards. \"Now drop the -\" And he made this long wheeze, and his shirt stuck out, a glint of metal showing. \"Oh,\" he said, dropping to his knees.\nThe lad turned around.\nGlimmer's arrow stuck into his back, just under his shoulder-blade. Her turn to say, \"Oh,\" not sure whether she'd meant to let go the string or not.\nA flash of metal and the old man's head jolted, the blade of Yull's sword catching him in the throat. He dropped his spear, grabbed for him with clumsy fingers. \"Hush, now.\" Yull slapped his hand away and ripped the blade free in a red gout. He wriggled on the ground, fiddling with the great wound in his neck as if he might stop it spurting. He was trying to say something, but as fast as he could spit the blood out his mouth filled again. Then he stopped moving.\n\"You killed 'em.\" Glimmer felt all hot. There were some red specks on her hand. The big one was lying on his face, shirt soaked dark.\n\"To be fair, you killed this one,\" said Yull. The lad knelt there, making little squeaky gasps. Yull leaned down and calmly plucked the knife from the lad's belt. \"Was hoping to set him a question or two, but he'll be giving no answers with that shaft in his lung.\"\nAs if to prove the point, he coughed some blood into his hand and stared over it at Glimmer. He looked a bit offended, like she'd said something hurtful.\n\"Still, no one ever gets things all their own way.\" Glimmer jumped at the crack as Yull rammed the lad's knife into the crown of his head. His eyes rolled up and his back arched, then he fell on his side.\n\"They didn't seem so bad,\" Glimmer said.\n\"For a girl struggling to penetrate the mists of the future, you don't half miss what's right in front of you.\" Yull was already rooting through the old man's pockets. \"If you wait 'til they seem bad, you've waited way too long.\"\n</details>\n<br/>\nDo please have a look, and let me know your thoughts.<br/>\n<br/>\nThanks in advance.<br/>\n<br/>\n<strong>Glimmer Wronghead</strong><br/>\nBarbarian 2/ Bard 11/ AA 27<br/>\nHalf-Elf non-lawful <br/>\nPvM 1-40<br/>\n<br/>\n<strong>Stats</strong><br/>\nSTR 14<br/>\nDEX 18 (36)<br/>\nCON 10<br/>\nWIS 8<br/>\nINT 14<br/>\nCHA 8<br/>\n<br/>\nHPs: 306<br/>\nAC: (naked) 33 (<em>not much point giving the others</em>)<br/>\nSaves: Fortitude 22, Will 18, Reflex 36. Immune to sleep spells, +8 v spells, +2 v mind spells<br/>\nBAB: 28<br/>\nAB: (max, melee) 42, (ranged) 59<br/>\nDamage: (ranged) 1d8+16<br/>\nBard Song: L11 (11p/day). +2 AB and damage, +2 AC, +1 saves, +2 skills, +8 temp HPs<br/>\nSkills: 258. Hide 42 (55), Move Silently 42 (55), Perform 19 (18), Spot 43 (43), Spellcraft 38 (40) Tumble 40 (53), UMD 34 (33)<br/>\n<br/>\n<strong>Levelling</strong><br/>\n1 Barb1: Point Blank Shot/ (Barbarian speed}<br/>\n2 Bard1<br/>\n3 Bard2: WF: Longbow<br/>\n4 Barb2: DEX+1 (19)/ {Uncanny Dodge I}<br/>\n5 Bard3<br/>\n6 Bard4: Rapid Shot<br/>\n7 Bard5<br/>\n8 Bard6: DEX+1 (20)<br/>\n9 AA1: Blind Fight<br/>\n10 AA2<br/>\n11 AA3<br/>\n12 AA4: DEX+1 (21)/ Imp Crit: Longbow<br/>\n13 Bard 7<br/>\n14 AA5<br/>\n15 AA6: Called Shot<br/>\n16 AA7: DEX+1 (22)<br/>\n17 AA8<br/>\n18 Bard8: Weapon Finesse<br/>\n19 AA9<br/>\n20 AA10: DEX+1 (23)<br/>\n21 AA11: EWF: Longbow<br/>\n22 AA12<br/>\n23 Bard9<br/>\n24 AA13: DEX+1 (24)/ Armour Skin<br/>\n25 AA14: Epic Prowess<br/>\n26 AA15<br/>\n27 AA16: Great Dexterity I (25)<br/>\n28 Bard10: DEX+1 (26)<br/>\n29 AA17<br/>\n30 AA18: Great Dexterity II (27)/ Great Dexterity III (28)<br/>\n31 AA19<br/>\n32 AA20: DEX+1 (29)<br/>\n33 AA21: Great Dexterity IV (30)<br/>\n34 AA22: Great Dexterity V (31)<br/>\n35 AA23<br/>\n36 AA24: DEX+1 (32)/ Great Dexterity VI (33)<br/>\n37 Bard11<br/>\n38 AA25<br/>\n39 AA26: Great Dexterity VII (34)/ Great Dexterity VIII (35)<br/>\n40 AA27: DEX+1 (36)<br/>\n<br/>\n<strong>Skills Schedule</strong><br/>\n1 (save 24)<br/>\n2 Hide 5, Move Silently 5, Perform 4, Spellcraft 3, Spot 4, Tumble 5 (save 4)<br/>\n3 Hide 1, Move Silently 1, Perform 3, UMD 5<br/>\n4 (save 6)<br/>\n5 Hide 2, Move Silently 2, Perform 3, Spot 4 (save 1)<br/>\n6 Hide 1, Move Silently 1, Spot 1 (save 4)<br/>\n7 Spellcraft 5, Tumble 5<br/>\n8 Perform 1, UMD 5<br/>\n9 Hide 2, Move Silently 2, Spot 2<br/>\n10 Hide 2, Move Silently 2, Spot 2<br/>\n11 Spot 1 (save 5)<br/>\n12 (save 11)<br/>\n13 Perform 2, Spellcraft 5, Tumble 5, UMD 5<br/>\n14 Hide 2, Move Silently 2, Spot 2<br/>\n15 Hide 2, Move Silently 2, Spot 2<br/>\n16 Hide 1, Move Silently 1, Spot 1 (save 3)<br/>\n17 (save 9)<br/>\n18 Spellcraft 5, Tumble 5, UMD 5<br/>\n19 Hide 2, Move Silently 2, Spot 2<br/>\n20 Hide 2, Move Silently 2, Spot 2<br/>\n21 (save 6)<br/>\n22 (save 12)<br/>\n23 Perform 3, Spellcraft 5, Tumble 5, UMD 5<br/>\n24 Hide 2, Move Silently 2, Spot 2<br/>\n25 Hide 2, Move Silently 2, Spot 2<br/>\n26 Hide 1, Move Silently 1, Spot 1 (save 3)<br/>\n27 (save 9)<br/>\n28 Spellcraft 5, Tumble 5, UMD 5<br/>\n29 Hide 2, Move Silently 2, Spot 2<br/>\n30 Hide 2, Move Silently 2, Spot 2<br/>\n31 Hide 2, Move Silently 2, Spot 2<br/>\n32 Hide 1, Move Silently 1, Spot 1 (save 3)<br/>\n33 Hide 1, Move Silently 1, Spot 1 (save 6)<br/>\n34 Hide 1, Move Silently 1, Spot 1 (save 9)<br/>\n35 (save 15)<br/>\n36 (save 21)<br/>\n37 Perform 3, Spellcraft 10, Tumble 10, UMD 4<br/>\n38 Hide 2, Move Silently 2, Spot 2<br/>\n39 Hide 2, Move Silently 2, Spot 2<br/>\n40 Hide 2, Move Silently 2, Spot 2<br/>\n<br/>\nSimple, but maybe effective?<br/>\n<br/>\nCheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Made a couple of amendments in light of Mick's comments, below.<br/>\n<br/>\n<em><strong>EDIT 2:</strong></em> Included a full skill schedule, now I've had the chance to play her. Without over-blowing my own trumpet (I hope), she does play really well and pretty easily, even at lower levels, which is why I'm moving her to the Full Epic forum. I opted for Spellcraft to cover the \"spare\" skill points, as much as anything because I had easy access to helpful Rogues, but if you want to solo her you might want to swap that for some cross-classed skills in Disable Trap, Open Lock, and Search (Set Trap, too, if you find you have points to spare). It might be worth noting that in Aielund (where she was tested), Bard receives an additional 2 skill points p/level and the Song is altered. I chose to ignore these during my playthrough, as it would be an illegal build elsewhere. Comparative builds are detailed further down in the thread, but I believe Glimmer stands well enough to be distinct from them.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:09 PM - Oct 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This :<br/>\n<br/>\n- <em><strong>Solid Archer </strong></em>- <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build198047.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 98047.html</a> is pretty close to yours.<br/>\n<br/>\nI think like the above build if you go Bard 1 first, you get more skill points.  Yours goes a little more Bard (11), the above build goes Bard 9.  <br/>\n<br/>\nThe big difference being, your Bardsong at level 11 gets 2 AC and +1 SL more.  Your AA has only -1 Arrow Enchantment less.  Your Dex is better by 2 points - gets +1 AB and possibly +1 AC more as well.<br/>\n<br/>\nFacit : Yours looks a bit more optimized - but I would swap Barb 1 for Bard 1 at first level (and go Barb 1 at level 2).<br/>\n<br/>\nOther than that, looks pretty solid.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:18 PM - Oct 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Web - and thanks for the link, I'll open it as soon as my stoopid machine allows.<br/>\n<br/>\nNow, this might be a WoG thing, but in vanilla, both Bard and Barbarian (and AA, for that matter - made the sums <em>much</em> easier) get 4 skill points +INT modifier per level, so what to take at level 1 becomes moot. I opted for Bard at 2 and 3 for a full Tumble bump at 2 and a full UMD one at 3. Simple as that.<br/>\n<br/>\nCheers<br/>\n<br/>\nEDIT: Oh, and if I went for Bard at L1 I'd need at least 11 CHA, which I ain't got, and doesn't matter for song<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:19 PM - Oct 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yep, they get the same SP at 1st.<br/>\n<br/>\nI stand corrected.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:24 PM - Oct 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sorry Web, I was editing as you posted - that bloody ninja's on overtime!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:25 PM - Oct 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, gotcha on the Cha.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:36 AM - Oct 29, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I like this build. It looks like something I might have conjured up myself, only I never did - unfortunately.<br/>\nBarbarian has several things to offer an archer with UD, 10% speed advantage, martial weapons (for HE builds) and a full BAB class from the start. You even get to boost the mighty property now and then with rage.<br/>\nI have used barbarian from time to time and posted a Bb/Wi/AA build in the 20s section. I also found a couple of barbarian/bard archer builds in my folders, among them a Bb8 Ba3 AA29.  It is based on much the same principles as your build, only with more brawn and less song. It even has the same starting and ending abilities.<br/>\nWith the relatively high AB of a low level high dexterity archer, I often take rapid shot before weapon focus longbow. The order in which I take blind fight, called shot and improved critical depends on the setting. If there is speed enhancing options, called shot comes late. If there are a lot of concealed enemies, BF comes in time before they start to appear. And I like improved critical as soon as possible. Those juicy x3 crits cannot come too often.<br/>\nI also like to take AS and EP sooner and rather take great dex later, unless I build up dex for ED. The thinking is that AS + EP = +1 AB +2AC, whereas 2x great dex = +1 AB +1 AC. But then again dex also works on skills and reflex save.<br/>\nBut these are all minor things and your build is indeed good as is.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:48 AM - Oct 29, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A search for barbarian bard AA showed 4 builds:<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build294853.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 94853.html</a><br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build248064.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 48064.html</a><br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build216369.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 16369.html</a><br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build198047.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 98047.html</a><br/>\n<br/>\nAnd here is my build for comparison: \n<details><summary>Spoiler</summary>Barbarian(8), Bard(3), Arcane Archer(29), Half-Elf\nSTR: 14\nCON: 10\nINT: 14\n\n01: Barbarian(1): Point Blank Shot\n03: Barbarian(3): Rapid Shot\n05: Barbarian(5)\n07: Bard(1)\n09: Arcane Archer(2): Called Shot\n11: Arcane Archer(4)\n13: Arcane Archer(6)\n15: Arcane Archer(8): Blind Fight\n17: Arcane Archer(10)\n19: Barbarian(8)\n21: Arcane Archer(11): Epic Weapon Focus: Longbow\n23: Arcane Archer(13)\n25: Arcane Archer(15)\n27: Arcane Archer(17): Great Dexterity I, (DEX=25)\n29: Arcane Archer(19)\n31: Arcane Archer(21)\n33: Arcane Archer(23): Great Dexterity V, (DEX=31)\n35: Arcane Archer(25)\n37: Arcane Archer(27)\n39: Arcane Archer(29): Great Dexterity VIII, (DEX=35)\n\nSkillpoints: 258\nSaving Throw bonuses: Spells: +9, Mind Effects: +2, Traps: +1\nAB (max, naked): 32 (melee), 61 (ranged)\nSpell Casting: \n\n\n01: Open Lock(1), Save(22), \n03: Save(34), \n05: Save(46), \n07: Hide(10), Move Silently(10), Perform(4), Spellcraft(8), Tumble(10), UMD(10), Save(6), \n09: Hide(1), Move Silently(1), Spot(2), Save(2), \n11: Hide(1), Move Silently(1), Spot(1), Save(8), \n13: Hide(1), Move Silently(1), Spot(1), Save(14), \n15: Hide(1), Move Silently(1), Spot(1), Save(20), \n17: Hide(1), Move Silently(1), Save(27), \n19: Save(39), \n21: Hide(1), Move Silently(1), Spot(4), \n23: Hide(1), Move Silently(1), Spot(1), Save(6), \n25: Hide(1), Move Silently(1), Spot(1), Save(12), \n27: Hide(1), Move Silently(1), Spot(1), Save(18), \n29: Hide(1), Move Silently(1), Spot(1), Save(24), \n31: Hide(1), Move Silently(1), Spot(1), Save(30), \n33: Hide(1), Move Silently(1), Spot(1), Save(36), \n35: Hide(1), Move Silently(1), Spot(1), Save(42), \n37: Hide(1), Move Silently(1), Spot(1), Save(48), \n39: Hide(1), Move Silently(1), Spot(1), Save(54), \n</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:28 AM - Oct 29, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Mick, it means a lot. And thanks also for the links, which I can now access - hoorah!<br/>\n<br/>\nAs far as the feats are concerned, I confess to a little coin-tossing between when to take Imp Crit and Called Shot (CS won), though on reflection I think I now prefer earlier IC. Probably a personal thing, but I like getting Blind Fight early on, just in case. Taking the WF before Rapid Shot is a hangover from lots of OC playing, when you get your first enhanced weapon at around level 4/5 (if you do the prison first), and you get what you've focused in. So, mostly practical in nature. I decided to take Weapon Finesse rather than Toughness or Epic Will (my old desire for saves over 20), because if I should get trapped into melee (heavens forbid) I'd like a reasonable chance of breaking free. I do like what you say about Armor Skin and Epic Prowess, and will steal that!<br/>\n<br/>\nLooking at the other builds, it's interesting that more levels of Bb are often taken, whereas my initial thought was for a Barb 2/ Bard 16/ AA 22 to hit the \"sweet 16\" (TM M Dagger) of song, for better party support, but I was lured away by better enchanted arrows and the AA bonus feat at L26.<br/>\n<br/>\nAll good stuff!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:14 AM - Oct 29, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">All three classes have something to offer if taken enough levels. Bard for song, spells and frequent skill drops, barbarian for TR and AA for more AB and damage. So there are indeed different ways to build with them. I even found a strength based TR archer with dev crit longbow among my Bb Ba AA builds, but I believe strength based archers in general are better with fighter or RDD.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:14 AM - Feb 13, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Finally, it's Glimmer's turn - she who was first shall be last, and all that malarkey.<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202102/10404082_761084431b6921dc982afdaf9c57290c.jpg\" />\n</dl>\n</span><br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:08 PM - Mar 23, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've now moved Glimmer into the big boys forum, following testing, and amended the lead post accordingly.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}