{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "915",
  "name": "Looking for advice to make a powerful and fast leveling fighter.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/looking-for-advice-to-make-a-powerful-and-fast-lev-t2354968.html",
  "author": "StreI0k",
  "avatar": "no_avatar.png",
  "replies": 21,
  "posts": [
    {
      "author": "StreI0k",
      "avatar": "no_avatar.png",
      "timestamp": "11:27 PM - Dec 31, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello~ Happy new year!<br/>\n<br/>\nI want to make a melee character that doesn't mind compromising high level potential for better playability and more power spikes at lower levels.<br/>\n<br/>\nWas thinking of making a human fighter/weapon master and maybe something more (in this server one must be at least 3 levels of each class)<br/>\nbut delaying weapon master to get cleave early and cross-classing into tumble for more A/C.<br/>\n<br/>\nI am open for any suggestion and thanks a lot!<br/>\n<br/>\n<br/>\n<br/>\n <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "1:17 AM - Jan 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Are you an experienced player? What server are you looking to play on (people know server specific stuff on here)? <br/>\n<br/>\nWhy not the standard Fighter/Bard/RDD ?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "StreI0k",
      "avatar": "no_avatar.png",
      "timestamp": "1:53 AM - Jan 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am neither a very experienced player nor completly new to nwn/d&amp;d. <br/>\n<br/>\nThis is for a hispanic speaking server which isn't available at the right moment but hopefully will be soon~<br/>\nOnly requirements for this character are: No devastating critical nor less than 3 levels per class. <br/>\n<br/>\nEven though i wouldn't mind being a Fighter/Bard/RDD, Fighter/Bard/PM, Fighter/Rogue/DwD or another combination. (I do really love the damage of WM though!)<br/>\nThe primary goal would be being very powerful at the early stages of the game because i don't know for how long i'll be playing with this character. (Hopefully past level 16 but not sure if much more)<br/>\n<br/>\nEdit: PvM, level 16 to 20 (High focus on sub 10), Don't mind race, Fighter, One handed with shield (Some cross-class dipping into taunt and hopefully early access to cleave), very low magic (probably +2 at most!), no class dipping with less than 3 levels.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:09 AM - Jan 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, I'm going to hate myself for this as a committed non-magic-user, but in a very low magic world, maybe Cleric would work well here - particularly if you want a melee build? Buckets of enhancements that are better than equipment and weapons available, so AC and AB can soar hugely. And perhaps in only 20 levels you only need 2 classes. Or maybe just Cleric - they ain't bad at all at early levels (or so I'm told).<br/>\n<br/>\nOf course, there's also the very solid Fighter/Rogue/CoT to consider...<br/>\n<br/>\nJust a few more options for you to think about.<br/>\n<br/>\nCheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, didn't ask - are you looking for a strength or dexterity based fighter?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:38 AM - Jan 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As Stagmeister said, a Cleric is a very good option for a low-magic, low-level PW, if you need more ideas I will leave the link to our level twenty sub-forum below.<br/>\n<br/>\nLevel 20 Builds =&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/preepic-level-20-builds-f6/\" rel=\"noreferrer\" target=\"_blank\">preepic-level-20-builds-f6/</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "StreI0k",
      "avatar": "no_avatar.png",
      "timestamp": "12:42 PM - Jan 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the feedback! <br/>\n<br/>\nI rather a strength character than dexerity one if i am not going to be reaching epic dodge (maybe a dex cleric could work though?)<br/>\nAlso i'd prefer not having to be a magic user (Resting was very very very limited in this server)<br/>\n<br/>\nFighter/Rogue/CoT sounds interesting, but would it be better than a Fighter/WM?<br/>\n<br/>\nIt is okay to delay other feats for cleave to level up faster?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Thorsson",
      "avatar": "10758835_1513245773.jpg",
      "timestamp": "1:27 PM - Jan 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Low Magic then AC is King IMO, having played in a +3 environment for some time. For that reason I think that F/Bd/RDD has to come high up the list. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:09 PM - Jan 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Take a look at Kail's \"Dragon Spawn\" in the 20s section.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "StreI0k",
      "avatar": "no_avatar.png",
      "timestamp": "3:46 PM - Jan 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Wouldn't it be better going Fighter/Bard/PM though?<br/>\n<br/>\nStill i'd like suggestions about how to do a powerleveling Fighter/WM<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:04 PM - Jan 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>StreI0k wrote:</cite>\nWouldn't it be better going Fighter/Bard/PM though?<br/>\n<br/>\nStill i'd like suggestions about how to do a powerleveling Fighter/WM\n</div></blockquote>\nBetter, no. Different, yes. So much depends on how you like to play - or whether you want to try a different playstyle. There is, after all, no \"perfect\" build - and it would probably be very boring if there was.<br/>\n<br/>\nCertainly, for offense, a strength-based Fighter/WM is great, but saves and AC will likely suck (particularly Will, which can be catastrophic for mundane melee builds), and you won't have many skills to use. Plus, of course, qualifying for WM eats up a lot of (largely useless) feats, so you become more restricted in your options. If going for a Fighter/WM you'll certainly want a third class to help with these issues, such as - but not restricted to - Rogue, Bard or Monk. That will, of course, mean the loss of at least 1AB, but it's worth it not to be turned into a messy splat on the floor on a regular basis.<br/>\n<br/>\nFor a great straight-up meleer, also have a look at Mick's Brawler Champion in the 20s section - I've enjoyed that many times, along with its more exalted Epic cousin. Then there's Valerfor's Peck'n Decker, which is a Fighter 10/ WM 7/ Monk 3.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Thorsson",
      "avatar": "10758835_1513245773.jpg",
      "timestamp": "8:10 PM - Jan 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Crits are great if it's easy to hit enemies, so it probably works from that side. It's less good on defence though and you don't have as many spare Feats to help, because WM requires so many. Further, you need at least 13 in Dex &amp; Int (neither of which you really need), so you necessarily have less to put in Con (I assume maxing Str whatever).<br/>\n<br/>\nOn Fighter/Bard/PM you have the AC, but you don't have the Str, plus PM is low BAB. We don't want a caster here and in any case you would have to juggle Armor, due to ASF. I don't think it really works with the level restriction.<br/>\n<br/>\nOddly enough the topic of one of these builds on a low magic worlds was raised in <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/dragon-spawn-fighter-6-bard-4-red-dragon-disciple--t515343.html\" rel=\"noreferrer\" target=\"_blank\">dragon-spawn-fighter-6-bard-4-red-drago ... 15343.html</a> way back in 2011. Kail's advice seems fairly sensible to me: \n<blockquote><div>I'd probably go Bard 3/FTR 7/RDD 10 preepic, then FTR 8 at 21st lvl to grab EWF/EWS and finish it off with Bard 4 for a final skilldump. In a low magic environment the extra +2 AB/+4 dmg is a big bonus</div></blockquote><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:10 AM - Jan 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The standard weapon-master power-build that you will see in level-twenty PW's is Ftr(10)/Rog(3)/WM(7), scimitar &amp; shield.<br/>\nAs Stagmeister said though, they tend to have low saving throws &amp; standard AC (Instead of good AC that an RDD provides).<br/>\n<br/>\nIf a power-leveling weapon-master is what you want then this is it.<br/>\nStart with Str17(22) Dex13 Con14 Int14 Wis8 Cha8 &amp; go from there.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "StreI0k",
      "avatar": "no_avatar.png",
      "timestamp": "11:47 PM - Jan 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for all the feedback! I'll be trying some different Ftr/CoT/Rog, Ftr/CoT/Monk and Ftr/Bard/RDD builds.<br/>\n<br/>\nProbably i'll stick to Ftr/CoT because it has more punch in the early levels. (Might spend most of my playtime in level 11 or less)<br/>\nThose extra free feats will do wonders! (Will miss those juicy WM crits though..)<br/>\n<br/>\nNow i've a few questions more.<br/>\n<br/>\nWhen is the appropiate time to use Called Shot? I feel that Knockdown is better in almost every situation.<br/>\n<br/>\nWhich one is the least important of this skills: Heal, Search/Disable Trap and Spot?<br/>\n<br/>\nWas also thinking about getting Dodge if i get the spare feat to close a bit the gap of AC with RDD, is it alright?<br/>\n<br/>\nLast thing but it's not a mechanical matter. How would you guys suggest i could roleplay UMD? I feel it's such a sudden change of skillset that i can't think of good justifications to have it on my build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:50 AM - Jan 03, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The three options you mention are among my personal favourites - and they give you so much scope in your builds.<br/>\n<br/>\nAs to your questions:<br/>\n<br/>\ni) Afraid my timing is still a bit rubbish with CS, but you want to get one in during the first flurry of each round if you're using it (like KD), because your AB will drop thereafter until the next round starts. It's also more tactical than KD, so you need to decide whether you want to slow them down (leg) or knacker their use of weaponry (arm).<br/>\n<br/>\nii) Unless you're going big in Heal, in my opinion that's the least useful (assuming you're not going for a Cleric/Pally build). If possible, you always want a detection skill (Spot or Listen), and if you ain't got a handy Rogue nearby, not being blown to pieces on a frequent basis is a helpful thing.<br/>\n<br/>\niii) Nothing wrong with Dodge, but unless it's a necessary qualification for something else, you might want to think if anything else would be better (after all, it's +1AC only against the foe you're facing, so a bit rubbish with mobs).<br/>\n<br/>\niv) Roleplay UMD? It's a phenomenal skill to have, if you can get it. Use of scrolls, wands, and otherwise unavailable gear (assuming no clashes with specific items) - what's not to like? Rogues wearing Monk boots and robes while chucking spells around confuses the crap out of people!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:39 AM - Jan 03, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, if your build is Ftr/Rog/CoT then you might as well take dodge too, they have so many feats available that they need to burn them somewhere...<br/>\nThe only time you have some reason not to take it is when you leave your dexterity to 9 because you start with almost max strength &amp; constitution for an EDR III build.<br/>\nOr maybe try to have 14 charisma instead to take advantage of divine wrath's boost. <br/>\n<br/>\nIn short, if you start with 13 dexterity or above &amp; you play a Ftr/Rog/CoT then you can also take dodge without compromising the build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "StreI0k",
      "avatar": "no_avatar.png",
      "timestamp": "10:01 PM - Jan 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">After testing for a while, this is what i managed to build by trying to squish every last bit of power per level. (Based on Brawler champion, Thanks Mick Dagger!)<br/>\nI am sure it can be optimized much further and i still got many doubts, so every tiny bit of feedback is more than welcome. :)<br/>\n<br/>\nFighter(7), CoT(10), Rog(3) Human<br/>\n<br/>\nSTR: 17 (22)<br/>\nDEX: 13<br/>\nCON: 14<br/>\nWIS: 8<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\n01: Fighter(1): Expertise, Power Attack, Cleave<br/>\n02: Fighter(2): Weapon Proficiency Exotic<br/>\n03: Fighter(3): Weapon Focus: Bastard Sword<br/>\n04: Fighter(4): Weapon Specialization: Bastard Sword<br/>\n05: Fighter(5)<br/>\n06: Fighter(6): Knockdown, Dodge<br/>\n07: Fighter(7): (Tumble 5 cross-class)<br/>\n08: CoT(1)<br/>\n09: CoT(2): Improved Knockdown, Improved Critical: Bastard Sword<br/>\n10: CoT(3)<br/>\n11: CoT(4): Blind Fight<br/>\n12: CoT(5)<br/>\n13: CoT(6): Called Shot<br/>\n14: CoT(7)<br/>\n15: CoT(8): Iron Will, Improved Expertise<br/>\n16: CoT(9)<br/>\n17: Rogue(1)<br/>\n18: Rogue(2): Toughness<br/>\n19: Rogue(3)<br/>\n20: CoT(10): Great Cleave<br/>\n21: Fighter(8): Improved Weapon Focus: Bastard Sword, Improved Weapon Specialization: Bastard Sword<br/>\n<br/>\nSkills: Discipline, Spot, Spellcraft(c), Taunt(c), Tumble, UMD<br/>\n<br/>\nHow could the order of feats be optimized further?<br/>\n<br/>\nFeats that are sorely missed but not sure which ones would be worthwhile to drop for: Disarm, Improved Disarm and Weapon Focus: Heavy Flail<br/>\n<br/>\nWould it be better to start with Rogue at level 14 to get those 20 ranks in Tumble earlier? I think it might be better.<br/>\nAlso about Rogue, there is much difference between 20 to 23 UMD?<br/>\n<br/>\nIs it better if i forget about crossclassing Taunt and instead putting those points towards Concentration? I really love using Taunt with Expertise though!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:09 PM - Jan 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is just a quickie, as I have to call an ageing mother. But, if you split Rogue to levels 2 or 7/ 7 or 12/ and17 you'll get your Tumbles sorted more efficiently. And you may have said before why you're going for Bastard Sword, but I can't remember. If you bin it for Scimitar your chance of a crit soars and you get another feat (assuming you want to continue as human). I'm afraid I don't see the point of Great Cleave unless you can get to Dev Crit - it can be really annoying otherwise. Called Shot is an interesting take - I may be more tempted by Disarm - but that would only really work well with a 2-handed weapon. Fortunately, if you skip exotic weapons and Great Cleave, you can get WF and WS in Heavy Flail or Greatsword.<br/>\n<br/>\nThe taunt issue is an interesting one: take the skill and you can do it - take concentration and others won't be able to taunt you. (And you will have more skill points if you use tumble appropriately).<br/>\n<br/>\nSorry, have to dash...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "StreI0k",
      "avatar": "no_avatar.png",
      "timestamp": "11:34 PM - Jan 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sadly i can't split the levels  because any class that's taken must be leveled 3 times in a row. (They used to be even harsher with restrictions a few years ago! &gt;-&lt;)<br/>\n<br/>\nI really like the Bastard Sword because of that little extra bit of consistent damage at lower levels but might be a very good idea use that feat more efficiently.<br/>\nI'll see how can work it fitting Disarm, Improved Disarm, WF and WS for the Heavy Flail into the build.<br/>\n<br/>\nAbout Taunt vs Concentration i guess it depends on the module i'll be playing. Can't really remember very well though if mobs taunted too much!<br/>\n<br/>\nNo problem Stagmeister and thanks!<br/>\n<br/>\n.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valkos",
      "avatar": "10235425_1545159776.jpg",
      "timestamp": "11:24 AM - Jan 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was typing during last night some of the same ideas, as Stag.<br/>\n<br/>\nA few things to add would be Called Shot. You have improved expertise and since you do, I would skip it all together. Called Shot really shines early on and mostly with a ranged character. <br/>\n<br/>\nOn the topic of taunt, I would take it, but know this. Many mobs have concentration. If you ever want to create a taunt version of this kind of build, I would go for ftr6/bard4/cot10. You would lose sneak atks against knocked and flanked targets, but you would also gain more will saves and the ability to take bard at the last level of level 20.<br/>\n<br/>\nDepending on how much you need saves on your character, I would take Luck of heroes and Strong soul at level 1.<br/>\n<br/>\nIn terms of feats, I would optimize as well for stronger early game power.<br/>\n<br/>\n<br/>\n01: Fighter(1): LoH, S.Soul, Power Attack, <br/>\n02: Fighter(2): Cleave<br/>\n03: Fighter(3): WF: +<br/>\n04: Fighter(4): Weapon Specialization: +<br/>\n05: Bard(1)<br/>\n06: Bard(2): knockdown<br/>\n07: Bard(3): (Tumble, taunt 10)<br/>\n08: CoT(1)<br/>\n09: CoT(2): Improved Knockdown, Improved Critical: Bastard Sword<br/>\n<br/>\nThis is just a suggestion of course, but the main theme for any melee build in my mind early on is getting cleave, ikd and imp crit as soon as I can. I would follow the same logic on the rogue version of the build as well.<br/>\n<br/>\nIn general I believe your build comes down to the first 2 levels. If you can quite easily get to level 2, the I would take the LoH and S.soul all day. If not, I would keep LoH and take pwr atk and cleave level 1.<br/>\n<br/>\nLast thing is I would also pick scimitar 100%. You will see the difference as your AB gets better. In the meantime, use whatever you find. Also the need for a blunt weapon should be for undeads of course, yet I dont see the need to specialize in it. The dmg lost from a slash/pierce weapon against undead, is clearly covered by blunt dmg alone.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "StreI0k",
      "avatar": "no_avatar.png",
      "timestamp": "12:35 PM - Jan 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am not sure about Called Shot either. Yet i think it's very useful in lots of opportunities, for example against Dex enemies because it's a double purpose feat against them.<br/>\n<br/>\nBeing a Bard seems indeed like a good compromise, even if it hurts a losing Evasion, Sneak attacks and the possibility of getting EWF and EWS at level 21. <br/>\nThough it's not possible to take CoT at level 8 with that build you proposed because of the +6 BAB at level 7. (Would be doable by getting CoT at level 9)<br/>\n<br/>\nSaves were kinda flimsy with my last build, going to see if i can spare some feats to have at least LoH and Iron Will. (Never thought of S.Soul)<br/>\nDon't mind that much dropping the idea of using a Bastard Sword, feats are too valuable when you have heaps available! <br/>\nI am also on the same boat with the feats for the Heavy Flail but was thinking about maybe getting just Weapon Focus: Heavy Flail to free up Feats but keep that strong AB.<br/>\n<br/>\nThe priorities for a build of this kind should be something like this, right? UMD = AC &gt; AB = Saves &gt; Damage &gt; HP<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valkos",
      "avatar": "10235425_1545159776.jpg",
      "timestamp": "1:04 PM - Jan 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">yeah CoT needs 7 bab to be chosen. It might be the breakpoint of a bard chosen for this build. Since you need 3 levels of the same class in a row, it becomes very hard to aquire tumble on a lower level than 12. <br/>\n<br/>\nYou could do 7 ftr - 3CoT - 3 bard in that order, but then you cannot get 4 levels of bard as you 100% would want 10 levels of CoT imo. <br/>\n<br/>\nPerhabs some of the other gurus can find a better solution. <br/>\n<br/>\nThe ftr/rog/cot is by no means worse. It has other perks and would definately be a top dog fighter.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "StreI0k",
      "avatar": "no_avatar.png",
      "timestamp": "1:39 PM - Jan 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Okay~ I'll do a bit more of research myself, but before i wanted to make a summary.<br/>\nThe priorities for a build of this kind should be something like this, right? UMD = AC &gt; AB = Saves &gt; Damage &gt; HP<br/>\n<br/>\n<strong>Feats </strong>(I have 17 available feats and this 19 seem good options) (Maybe i am missed a useful feats! For example I am not counting WS:Heavy Flail)<br/>\n<br/>\nMust have: WF:Scimitar, WS:Scimitar, IC:Scimitar, KD, IKD, Expertise, Power attack, Cleave, Blind Fight<br/>\nProbably should have: WF:Heavy Flail, Disarm, IDisarm<br/>\nTempted to have: Called Shot, IExpertise, Dodge. <br/>\nUseful to have: Toughness, Luck of Heroes, Iron Will, S. Soul<br/>\n<br/>\n<strong>Skills</strong><br/>\n<br/>\nConcentration: Incredibly strong but very few monsters taunt in this server.<br/>\nDiscipline: Must have!<br/>\nHeal: Not needed?<br/>\nSpellcraft: Must have (Should be a multiple of 5 after adding the INT modifier)<br/>\nSpot: Must have?<br/>\nTaunt: Not worthwhile to crossclassing it?<br/>\nTumble: Must have (Should be a rank multiple of 5) <br/>\nUMD: Must have! (Is it good enough with 20 pre epic or should aim for 23?)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}