{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "010",
  "name": "About Saving Throws",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/about-saving-throws-t2356301.html",
  "author": "wanderei",
  "avatar": "no_avatar.png",
  "replies": "5",
  "views": "138",
  "posts": [
    {
      "author": "wanderei",
      "avatar": "no_avatar.png",
      "timestamp": "3:49 PM - Jan 29, 2025",
      "content": "<div>How important are those? I see lot of builds grabbing champion of torm to get those high or other means.. Does it really pay off if you fail at rolling \"1\" you still losing. Wouldnt it be better to just keep on upgrading equipment to fill those as immunities?..</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:18 PM - Jan 29, 2025",
      "content": "<div>It makes a difference if you will be facing imposing DCs, yes.  Like if you need a 19+ to succeed.<br/>\n<br/>\nIt doesn't if you are already at the \"fail on a 1\" stage...<br/>\n<br/>\nGenerally, though, Immunities &gt; Saving Throws.<br/>\n<br/>\nOh, and one can turn \"fail on a 1\" off, btw.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "6:52 PM - Jan 29, 2025",
      "content": "<div>And if anyone knows the In's and Out's of rolling a 1, Webby is the man to listen to...<br/>\n<br/>\nHe's basically the cosmic whipping boy of bad RNG karma....<br/>\n<br/>\nReally wanna know what he did in a past life to make the RNGods hate him so....</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:32 PM - Jan 29, 2025",
      "content": "<div>Probably due to all the killings...yeah.<br/>\n<br/>\nOh well.<br/>\n<br/>\nGive me that one!  I can take it!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:54 PM - Jan 29, 2025",
      "content": "<div>Web's quite right (I'm talking about the saves here, not the killings, 'kay?). Just to add a few more mundane details, if I may...<br/>\n<br/>\nBy and large, Fortitude measures how well you can take physical punishment, Will is the same for mental punishment, and Reflex is about avoiding physical punishment. Fighter-types are generally good at Fortitude, but sucky at Will (Reflex can vary). The problem arises when an enemy mage targets your Will or Reflex save (and they will), and your Fighter is left suddenly unable to do his job, ie fight. Equally, arcanists tend to have very good Will saves, but dreadful Fortitude ones, so they're good at handling spell punishment, but are very squishy when it comes to being physically hit. Rogues will normally have strong Reflex saves but may be dodgy with the other two, so they can get out of the way from many spell/ trap effects, but will suffer from physical or mental onslaughts.<br/>\n<br/>\nThat's just magic and traps. Dev Crit, if it's enabled where you play, checks against a Fortitude save: you fail that, you're dead.<br/>\n<br/>\nSo yes, saves are very important in the same way that AB and AC are, or having a high casting DC and being undispellable are for casters. Essentially, you're trying to weight the dice as best you can (and the same is true of skills) - you're trying to minimize the potential difference between what someone's trying to do to you and what you can do to them (to use the above Dev Crit example, if I hit you with a Dev Crit of 42, you need a Fortitude save of 41 to make me have to roll a 20, and your odds obviously get smaller the lower your save, and not many mages or rogues - or even fighters - have a Fort save of 40+)<br/>\n<br/>\nWhile CoT is good for so much more than adding Sacred Defence to your saving throws, that certainly doesn't hurt, and the bonus feats it gains can also be damned useful. Monk is the only class that boosts all 3 base saves by the same amount, so is also worth consideration.<br/>\n<br/>\nOf course, if you can boost things from items, so much the better, but remember that the more you rely on them, the fewer \"spare\" slots (for gloves, armour, boots, rings, etc) you'll have available for anything else. What we try to do here (mostly) is make you as unreliant upon gear as possible, which gives you more freedom to equip the assorted kewl stuff that will likely come your way.<br/>\n<br/>\nAn example for you. You play the OC and have the Golden Circlet (immune to mind effects from spells - best hat in the game by a country mile). You then move into HotU, and immediately have all your gear nicked. So, unless you have a halfway decent Will save, you're likely to be screwed by any mages coming your way.<br/>\n<br/>\nThat's my somewhat-more-than twopenny-worth!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:10 PM - Jan 29, 2025",
      "content": "<div><blockquote><div><cite>wanderei wrote: <div class=\"responsive-hide\">3:49 PM - Jan 29</div></cite>How important are those? I see lot of builds grabbing champion of torm to get those high or other means.. Does it really pay off if you fail at rolling \"1\" you still losing. Wouldnt it be better to just keep on upgrading equipment to fill those as immunities?..</div></blockquote>\nLow will saves are an Achilles-heal of warrior- and rogue classes. If you don't address it in the build, You will depend on items granting immunities to fear and mind spells/effects, or you have to keep drinking clarity potions.</div>",
      "author-color": "#AA0000"
    }
  ]
}