{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "125",
  "name": "Arelith Weapon Master Build PVP Preferred",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-weapon-master-build-pvp-preferred-t2354593.html",
  "author": "AfroBro",
  "avatar": "10577588_1510287072.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "AfroBro",
      "avatar": "no_avatar.png",
      "timestamp": "1:29 AM - Sep 12, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello, I was wondering if someone can help me make a build for dual-weilding Weapon Master build. The race I wanted to make is a human. For the weapons, I wasn't too sure what would be considred good since i'm pretty new to the game. A friend of mine said scimitars were good weapons to use, but I wanted to make sure if someone can clarify that for me. The server is Arelith.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:15 AM - Sep 12, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello and welcome, AfroBro! Good to have you here.<br/>\n<br/>\n I'm sure there will be Guild members along soon who will be able to help with your request, unfortunately I'm not one of them. What I can say is that dual-wielding a medium-sized weapon like scimitar isn't the best idea, there will be penalties, but on the plus side, scimitar is definitely one of the best weapons for critical hits, which is what Weapon Master is all about.<br/>\n<br/>\n I'm also not familiar with Arelith, but if you have a look at the Mid Epic - Level 30 Builds section here, you'll find an <strong>Arelith Sword Master</strong> build (Fighter 10 / Rogue 4 / Weapon Master 16) that you might like - both human and scimitar-wielding, just not two of them. Something to do while waiting for someone who knows better than me, anyway.<br/>\n<br/>\n Again - welcome!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:51 AM - Sep 12, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What sort of classes are you planning on dueling?  A STR build will work okay vs. other STR melee.  DEX is better vs. casters and Arcane Archers because you can use stealth. WM/CoT is also better vs. caster attacks.<br/>\n<br/>\n Keep in mind that WMs main focus is crits, specifiically DevCrit (which I think Arelith either nerfed or prohibited).  That's what they were built to do. So you will do poorly against any build with PM10 or higher (unless Arelith nerfed PM as well). Also, WMs crit range advantage tends to get lost vs. high AC builds (like DEX or Monk WIS) since only the high end of the range will hit anyway.<br/>\n<br/>\n Decide on the types of adversaries you want to tear through and optimize accordingly.  Otherwise, just build the best PvM version you can and hope you don't run into many class combos that can exploit your weaknesses (Will saves are usually one of those).<br/>\n<br/>\n Dual-wielding scimi's will never hit as often as dual-wielding two light weapons.  Kukrimaster is the best WM that can be built.  Easily.  So figure on losing all duels against those you encounter.  But DWing scimi's does look kewl, so at least you'll look impressive in death.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "AfroBro",
      "avatar": "no_avatar.png",
      "timestamp": "7:15 AM - Sep 12, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">ya i wan2 los ever fit like tru wariooo!!!! thy wil fer me and d scmmy throu deth!!!!<br/>\n<br/>\n On the real note, I truthfully wanted a build where I have decent attacks per round, and have decent damage. I was told that's usually a monk, but didn't sound like something I wanted to make. Do you think for what I want, Weapon Master would be the best choice? I probably should of put that in my original post. Sorry for not doing so. :(<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "10:56 AM - Sep 12, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am assuming you prefer a non-magical melee build.  WM is one way.  If RDD is not nerfed on Arelith, that's another popular one.  Empyre can help with Arelith 30-Level RDD builds if that's the case and Valerfor posted <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354265/\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#0000FF\">one</span></a><span style=\"color:#0000FF\"> </span></strong>as well.  Both WM and RDD have the greatest non-magical AB potential and WM gets the added damage advantage of crit multiplier at WM 5.  The crit range bonus only has advantage vs. relatively easy-to-hit low AC mobs but little advantage vs. bosses and other uber AC encounters. In both cases, you'd focus on pumping STR.<br/>\n<br/>\n Kukrimaster is the best WM.  Probably a DW kama monk WM is very close to that with the monk progression in effect and high attacks per round.  You'd definitely want WS/EWS via fighter in the mix for maximizing damage potential.  A ranger WM is best done with a DEXer, but that is limited to medium armor and it relies to some extent on its Cat's Grace buffing (magical). DEXers need either Uncanny Dodge or Defensive Awareness (that's just for dwarves) to protect their DEX investment.<br/>\n<br/>\n So that's the trade-off. STR focus for high AB/high damage, DEX for high AB/high AC.  Choose your poison.  On a DevCrit build demand that it must be a STR focus.<br/>\n<br/>\n All DW builds suffer from the same weakness... AC.  Monk WM can compenate for that problem to some degree with its Monk AC bonus and WIS bonus but must limit itself to robes to take advantage.  Monk WM also has the best saves.<br/>\n<br/>\n To acquire all the feats needed to attain WM and DW early you'll need either several fighter levels (the damage route) or several CoT levels (the high saves route).  The CoT route has an advantage for a monk WM since it can take Great WIS bonuses in epic, further aiding the AC dilemma that DWers face.<br/>\n<br/>\n So it really comes down to how \"safe\" you want your WM to be as to which route is most practical.  Only you can determine what sort of compromise is needed to survive (or ideally, dominate) on your server.  It requires some knowledge of the sort of encounters your toon is likely to face to make the decision.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}