{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "870",
  "name": "Harping On... (Ranger 25/ CoT 10/ HS 5)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/harping-on-ranger-25-cot-10-hs-5-t2355056.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "2",
  "views": "304",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:01 PM - Apr 14, 2019",
      "content": "<div>Hello again, All<br/>\n<br/>\nYou may have noticed that I've been exploring different classes of late (different for me, anyway), and thanks to a post by Cornflower in another thread, I thought I'd have a look at what I could do with Harper Scout.<br/>\n<br/>\nI've had a look through the archives and Hip's Fantabulous Contrapulator and can't find any with this split - which probably says something, but I'll carry on regardless.<br/>\n<br/>\nI considered five or six different class combinations, but ended up with this dexterous dual-wielder. It does have an issue or two, I'll admit. Lack of Uncanny Dodge and Evasion is a bit worrying. The AC will be mediocre in pre-epic - particularly as I've not gone big on Wisdom, so Ranger buffs are limited to 2nd level, so at least Cat's is available. It's a Dexer without Epic Dodge. Oh, and UMD would be nice.<br/>\n<br/>\nHowever, on the plus side, the AB for a dual-wielder is pretty damn good - both melee and ranged - so attacks should land, the saves are fine, as are the skills. And there are 8 Favored Enemies, with Bane of Enemies taken at a reasonable level, so the lack of damage is mitigated against most foes.<br/>\n<br/>\nSo, I leave the infant in its cot (no pun intended) for you to poke and prod...<br/>\n<br/>\nOh, and I haven't got a decent name for it yet, but let's see how it goes.<br/>\n<br/>\n<strong>Ranger 25/ CoT 10/ Harper Scout 5</strong><br/>\nHuman, any non-evil<br/>\nL1-40 PvM<br/>\n<br/>\n<strong>Stats</strong><br/>\n<br/>\nStr 12<br/>\nDex 17 (34)<br/>\nCon 12<br/>\nWis 12<br/>\nInt 13<br/>\nCha 8<br/>\n<br/>\nHPs: 460<br/>\nAC: (naked) 32 (haven't worked out the rest yet, sorry)<br/>\nSaves: Fort 29, Will 24, Reflex 36 (+4 v spells)<br/>\nSkills: 238. Hide 43 (55), Listen or Spot 43 (51), Lore 7 (8), Move Silently 43 (55), Persuade (cc) 8 (7), Search (cc) 4 (5), Spellcraft (cc) 19 (20), Tumble 40 (52)<br/>\nBAB: 30<br/>\nAB: melee: (max - I'd go either handaxe or shortsword) 46/ 41/ 36/ 31 (d-w 44/ 39/ 34/ 29 - 44/ 39); ranged (max) 43/ 38/ 33/ 28<br/>\nSpells: Ranger level 2, Harper Scout<br/>\nBoE and 8 FEs (depends on environment, but always worth including those races immune to crits). Equates to +2 AB, +6 and +2xd6 damage, +6 Spot/Listen (versus Ranger FEs), +2 AB, +2 and +2xd6 damage, +2 Spot/Listen (versus HS FE)<br/>\n<br/>\n<strong>Levelling</strong><br/>\n<br/>\n1 Rgr1 - Weapon Focus (Handaxe or Shortsword)/ Weapon Finesse/ (Dual-Wield/ FE I/ Trackless Step)<br/>\n2 Rgr2<br/>\n3 Rgr3 - Expertise<br/>\n4 Rgr4 - DEX+1 (18)<br/>\n5 Rgr5 - FE II<br/>\n6 Rgr6 - Blind Fighting/ (Animal Companion)<br/>\n7 Rgr7<br/>\n8 Rgr8 - DEX+1 (19)<br/>\n9 Rgr9 - Knockdown/ (Imp TWF)<br/>\n10 CoT1<br/>\n11 CoT2 - Imp Crit (Handaxe or Shortsword)<br/>\n12 CoT3 - DEX+1 (20)/ Toughness<br/>\n13 CoT4 - Improved Knockdown<br/>\n14 Rgr10 - FE III<br/>\n15 Rgr11 - Iron Will<br/>\n16 Rgr12 - DEX+1 (21)<br/>\n17 Rgr13<br/>\n18 Rgr14 - Alertness<br/>\n19 Rgr15 - FE IV<br/>\n20 CoT5 - DEX+1 (22)<br/>\n21 Rgr16 - Great Dex I (23)<br/>\n22 HS1 - Great Dex II (24)<br/>\n23 Rgr17<br/>\n24 Rgr18 - DEX+1 (25)/ Great Dex III (26)<br/>\n25 Rgr19<br/>\n26 Rgr20 - FE V<br/>\n27 Rgr21 - Bane of Enemies<br/>\n28 HS2 - DEX+1 (27)<br/>\n29 CoT6 - Epic Weapon Focus (Handaxe or Shortsword)<br/>\n30 CoT7 - Great Dex IV (28)<br/>\n31 CoT8 - Armor Skin<br/>\n32 HS3 - DEX+1 (29)<br/>\n33 R22 - Great Dex V (30)<br/>\n34 R23 - FE VI<br/>\n35 R24<br/>\n36 CoT9 - DEX+1 (31)/ Great Dex VI (32)<br/>\n37 HS4<br/>\n38 CoT10 - Epic Prowess<br/>\n39 HS5 - Great Dex VII (33)/ FE VII<br/>\n40 Rgr25 - DEX+1 (34)/ FE VIII<br/>\n<br/>\nWhat do we think?<br/>\n<br/>\nCheers<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Tidied up some inaccuracies in light of Mick's post below.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:49 PM - Apr 14, 2019",
      "content": "<div>This is an interesting build in more than one way, Stag<br/>\nYou get a high AB and a respectable AC, even without a shield. And you can always grab one if needed.<br/>\nWith CoT the saves become very good for a fighter type.<br/>\nGiven the context, how you use HS bonus feats is probably the core of the build idea, apart from having a tumble class. More dex is of course good for a dexer.<br/>\nA good thing is that with wisdom 12, you also get lvl 2 ranger spells. The ranger cat's spell stack with the cat's from HS. But this is maybe not so important if you play in a mid/high magic envireonment, where you can cap dex with items. <br/>\nDamage is generally low when you play dexers, but here you use FE and BoE to generate more damage, but 8 FEs do not cover everything. Note that the FE from HS is not quite as good as the ones from ranger (check the NWNWiki for details, or check my edit below).<br/>\nI like the fact that you have high stealth for tactical positioning.<br/>\nThe most glaring weakness with this dexer is the lack of UD. You can play without, just like you can with a dex monk, but it is a weakness you have to keep in mind when facing enemies that can flank you.<br/>\nYou don't seem to have given it any attention, but this build will also be a fairly good archer, especially when you have stacked the FE bonus and BoE kicks in.<br/>\nWith 25 ranger levels the animal companion also is more than just a distraction.<br/>\n<br/>\nEdit:<br/>\nAt 25 ranger levels you get +6 bonus to damage, listen, spot and taunt against FE's<br/>\nAt 5 HS levels you get a +2 bonus to the same for the FE you choose with HS.<br/>\nBoE gives +2 AB to the FEs and a 2d6 damage bonus on top of the damage bonus from FE.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:02 AM - Apr 15, 2019",
      "content": "<div>As ever, thanks Mick.<br/>\n<br/>\nI am an idiot for getting the level of Ranger spells wrong - of course it's 2nd - I would blame it on working things out on paper, but that would be a lie. I'll change it.<br/>\n<br/>\nEqually, it was a mental aberration that made me cock up the BoE/ FE info. Again, I'll change it. It does seem arbitrary, though, for the effects on HS FE(s) not to stack with Ranger ones, given it's the same bonus feat and is taken by the same character. Hey-ho, we do love our anomalies here. I do assume, though, that BoE will still apply to the HS FE taken. (Enough acronyms yet, Cornflower? <span class=\"text-emoji\">😉</span>). Essentially, take the HS FE for something more naturally squishy.<br/>\n<br/>\nAye, the lack of UD is potentially fatal for a dexer. When considering which classes to include, I had given thought to Rogue rather than CoT (Ranger 21 or 22/ Rogue 13 or 14/ HS 5 - including ED), but it was horribly feat-starved, as was a Ranger 30/ SD 5/ HS 5. I'd also toyed with a strength-based Fighter 13/ HS 5/ DwD 22, but that changed the dynamic completely (I might return to that one later, though).<br/>\n<br/>\nAs far as the number of FEs is concerned, 8 should cover most bases - granted, not all. Undead, constructs, humans, elves (drow), dwarfs (duergar), aberrations, outsiders, and dragons would still leave large orc and ogre shaped holes, for example. A lot will depend on how well you know your environment (as with so many things).<br/>\n<br/>\nAnd you're right about ranged attacks: should be AB 43, I think. In the absence of UD and trapping skills, it could well be a good way for pulling foes.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    }
  ],
  "author-color": "#AA0000"
}