{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "847",
  "name": "Looking for a big sword elf build",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/looking-for-a-big-sword-elf-build-t2355103.html",
  "author": "Michelangelo",
  "avatar": "10759109_1563017986.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Michelangelo",
      "avatar": "10759109_1563017986.jpg",
      "timestamp": "2:17 PM - Jul 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi all,<br/>\n<br/>\nRecently I got my hands on a NWN:EE and thought to revisiting the city of Neverwinter after a loooooong time after playing the original. I have started out over a dozen times and never got past chapter 2 as I was never happy with a character I could develop on my own, being a complete noob at it it.<br/>\n<br/>\nI loved playing assassin before (as he could fight, pick locks and traps, set traps and use magic devises in a pinch) but the mechanics of fighting was kind a bothersome (hitting and then retreating into the dark all the time). However I recently got to watch a anime called Berserker, a bit older but liked the story of Guts. That got me started thinking and I would like to ask for your help in coming up with a build for my next run.<br/>\n<br/>\nI would like to play a small elf with a gigantic sword, there is something strangely fascinating about a small creature hulling a gigantic weapon. <br/>\n<br/>\nEnvironment preference - PvM build, something I can take through the Original Campaigns and beyond<br/>\n<br/>\nRace preference - Elf<br/>\n<br/>\nClass preference - none but I would like to avoid a character that is dependence on casting a lot of biffing and protective spells just to keep up. I have no problems with a few but casting 10 spells all the time is just bothersome<br/>\n<br/>\nWeapon preference - giant two handed sword, other gigantic weapons could also be considered <br/>\n<br/>\nAlso - no alignment restrictions, I have trouble staying evil :-)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:36 PM - Jul 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello and welcome, Michelangelo - good to meet you!<br/>\n<br/>\nAt the risk of blowing my own trumpet, how about this one for a greatsword-wielding elf? <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/firewing-of-corellon-bard-8-cot-22-rdd-10-t2355058.html\" rel=\"noreferrer\" target=\"_blank\">Firewing of Corellon</a><br/>\n<br/>\nShe might involve a bit of hard work at earlier levels, but boy does she grow into her skin. Now, given that the Original Campaign will finish with you on about level 17/18, you might want to think about having her continue on in another module that will take you all the way to level 40. Mines of Twin Summit would be a good one to show off her increasing power. You just import your character there after you've completed the OC. If you'd be interested, we can give you the details later.<br/>\n<br/>\nAnyway, see what you think of the build (just click on the underscored words) and get back to us.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:01 PM - Jul 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's called \"Berserk\" &amp; if you liked the anime, then better read the manga, it's even better Michelangelo. <br/>\n<br/>\nAnyway, to play Guts properly you'll need a Greatsword &amp; Dev. Critical for sure, sorry, no hand-cannon for you in NwN but for the rest, Stagmeister's Firewing of Corellon would do mighty fine.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Michelangelo",
      "avatar": "10759109_1563017986.jpg",
      "timestamp": "12:12 AM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, I will pop by the Firewing thread and ask. It would be mighty interesting to see gunpowder weapons in NWN :-)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}