{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "151",
  "name": "Best PvM Duo",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/best-pvm-duo-t2355325.html",
  "author": "Yunim",
  "avatar": "10759176_1572007808.png",
  "replies": 21,
  "posts": [
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:40 AM - Jan 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">What do you think is the best PvM duo in a given environment?<br/>\n<br/>\nObviously this varies wildly depending on the environment, I'm mainly interested in level 40 characters in low/medium magic worlds. The inspiration for this thread was a conversation I had about dual-logging in WoG, but I don't want to restrict the conversation to just the WoG server. I also don't want to focus on dual-logging, so the difficulty of playing both builds at once isn't an issue.<br/>\n<br/>\nI think that the best PvM duo in a low/medium magic world is a Cler/RDD and Wiz/PM. The lower the magic level the better this duo does, in high magic worlds both builds are usually overshadowed by others due to available items. Offensive melee, offensive casting, defence, and healing are all covered between the two builds, while offensive ranged can be included by giving the Cler/RDD Zen Archery.<br/>\nThe level spread for the Cler/RDD is either Cler24/Bard2/RDD14 (for min-maxing AB), Cler26/Bard4/RDD10 (lower AB but better saves), or Cler28/Bard2/RDD10 (higher caster level). This build has Dev Crit (in environments where it is enabled), full Cleric casting, and can hit the +20 AB cap self-buffed. In some environments Divine Might and Divine Shield are worth taking, but in general focusing on STR is usually best. Zen Archery results in a mediocre ranged AB when fully buffed, depending on the environment it could be worth taking.<br/>\nExample Cler/RDD: [<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/dracolich-duo-d-cleric-28-bard-2-red-dragon-discip-t2355326.html\" rel=\"noreferrer\" target=\"_blank\">dracolich-duo-d-cleric-28-bard-2-red-dr ... 55326.html</a>]<br/>\nThe level spread for the Wiz/PM is either Rog2/Wiz28/PM10 (better skills) or Wiz29/PM10/Monk 1 (higher caster level and an extra feat). The main choice for this build is whether to be a CON based nuke mage or an INT based DC mage. Whether to build for AC or not is another important decision. It can reach 80ish AC in a +5 environment with IExp but if Expertise is disabled when casting then building for AC becomes less attractive. However, even if casting in Expertise is disabled the extra AC can be useful against hard hitting enemies so it might be worth taking anyway.<br/>\nExample Wiz/PM: [<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/dracolich-duo-l-rogue-2-wizard-28-pale-master-10-t2355327.html\" rel=\"noreferrer\" target=\"_blank\">dracolich-duo-l-rogue-2-wizard-28-pale- ... 55327.html</a>]<br/>\nThe main strategy is for the Wiz/PM to tank while the Cler/RDD attacks. The Wiz/PM can either AC tank or DR tank, has damage shields for reciprocal damage, and can cast nuke spells while tanking. The Cler/RDD has over 65 AB self-buffed with Dev Crit, in addition to Harm, Heal, Word Of Faith, and several other useful spells. If melee doesn't work then the Wiz/PM can focus on using damage shields and nuke spells while the Cler/RDD heals the Wiz/PM. The Cler/RDD has a fairly high AB on the Harm/Heal touch attack so combining Mords and Harm/Heal is another no-save spell option. Both builds have access to UMD so support scrolls and wands can be used by both builds.<br/>\n<br/>\nAn honourable mention goes to Bard + DPS, this can be a very nasty combination and has a lot of room for customisation. Curse Song gives up to -2 AB, -7 AC, -2 Fort, and -18 skills. When combined with the -6 AC from Taunt even a mediocre DPS build can reliably land hits, Dev Crits, and successfully disarm or knockdown opponents.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "8:50 AM - Jan 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It really does depend on the world and how it is “boxed”.  But assuming you knew nothing about the next world beyond “it is a mid-low magic world” and you needed an persistent world “explorer duo”.   I would probably go with a Dev-crit immune (resistant) melee tank and a buffer.<br/>\n<br/>\nMeaning I would likely go with a deep cleric Trave/Trickery build with a sprinkling of monk and rogue in the epics (pull rogue level or two into preepic if needed) and a melee PM (Bd/PM/Fi] DevCrit build.  After I worked out the nuances of the PW, this would change to fit how the world in question is boxed.<br/>\n<br/>\nOn Arelith I would go with a 30 sanc healer and a Fi/WM/Ro melee.<br/>\n<br/>\nOn WoG, a zenarchery 38 cleric and DevCrit/immune DevCrit melee.<br/>\n<br/>\nOn Blackstone a speed sorcerer and probably a battlecleric.<br/>\n<br/>\n<br/>\nI default to cleric because under the Unmodded NwN it is the class that checks the most options and offers the most versatility without requiring anything other than mundane items.  Not only does it check the most boxes  and plugs the most holes for the cleric, it can check all those boxes and plug all those holes for a duo melee as well.  On a low/mid magic world, melee characters are restricted by item availability and power. A cleric can and does generally does allow a buffed melee character to punch well above the weight offered by a low magic world and up into a mid to upper middle magic world in spells on mundane items.  It also offers all the core spells generally needed to function outside of Mordekainen’s Disjunction.<br/>\n<br/>\nA melee Pm does the same, but for Undispellable AC and the key immune DevCrit.<br/>\n<br/>\n The caveat is I build for exploration survival until I learn the world.  I tend to start on a new world with a battlecleric as a single explorer assuming you can sort out the deity rules quickly :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:03 AM - Jan 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Also, are you allowed to dual log on WoG?  For some reason I assumed that was on the not allowed list but hey, I have 5 or 6 keys and 3 computers kicking about so .... is it allowed?<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "9:41 AM - Jan 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">An unlikely pairing, but yet still quite devastating, is a true Shifter Dragon (for being able to withstand any amount of pain and still dish it out), supported by a Great Smiting Paladin with a near-ending supply of Divine Mights.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:24 PM - Jan 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great discussion.<br/>\nI play a lot of party in mid magic these days and very interested in this.<br/>\n<br/>\nI break down basic party jobs to:<br/>\n- tank (actually the most important)<br/>\n- buff<br/>\n- damage<br/>\n- skills (ie traps, detection, locks etc etc)<br/>\n- disables / debilitate / healing<br/>\n<br/>\nWith only two party members, versatility is key<br/>\n<br/>\nMy top choices:<br/>\n1. Human/dwarf Fighter / Bard / RDD or human Bard / Blackguard / RDD for the tank / DPS / Buffer.  Both Bard heavy (ie Bard 20+ for lasting inspiration), put dev crit if possible. Mogheiden for example (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/moghedien-melody-of-the-dark-bard-26-bg-4-rdd-10-t2350150.html\" rel=\"noreferrer\" target=\"_blank\">moghedien-melody-of-the-dark-bard-26-bg ... 50150.html</a>).<br/>\n2. Dex based Cleric/Rogue/SD, Wis based Cleric/Rogue/Monk zen archer, or wisdom Druid/Rogue/Monk with Dragon Shape. <br/>\n<br/>\nBoth choices can do all the jobs listed above, just slightly differently.<br/>\n1. can tank, buff, damage, skills, disables/debilitate (ie improved knockdown/curse song)<br/>\n2. can tank, buff, damage, skills and disables/debilitate (ie stonehold), <br/>\n<br/>\nBeyond that I would start to add specialists into the mix.<br/>\nThird choice is a CHA human sorcerer 35/paladin 2/rogue 3 to spam out bigby's, summons/black blades of disaster/mind blank/stoneskin/IGMS spam for more buffs/spellpower/great saves/more skills. Then sit in the background saving spells either invisible or greater sanctuaried. The other two can do heaps, just step in when things get hairy. Can use ShapeChange/Damage Shield to tank as well.<br/>\n<br/>\nFourth addition, would be a divine damage ultra high Arcane Archer like <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/holy-elven-archer-paladin-9-wizard-1-arcane-archer-t2354403.html\" rel=\"noreferrer\" target=\"_blank\">Mick Dagger's build</a>, there is plenty of protection available for it, and if he dies just resurrect him.<br/>\n<br/>\nFifth final specialist would be some unkillable spell immune dex monk like Monk 38/Assassin 2 ala WebShaman style. Give him a pile of Mord's Scrolls to remove enemy Bigby's spells from your teammates (I think this works...) if the whole team suddenly gets ambushed by a pile of mages spamming Bigby's 9, you are immune, you use a greater sanctuary scroll, then those mord scrolls to remove the bigby's whilst running at the speed of light around any mobs that might be present. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:10 PM - Jan 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"18764\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18764&amp;sid=a7572e7da280b0f90b24bc5100190494#p18764\">↑</a><div class=\"responsive-hide\">Jan 30, 2020</div></cite>I break down basic party jobs to:<br/>\n- tank (actually the most important)<br/>\n- buff<br/>\n- damage<br/>\n- skills (ie traps, detection, locks etc etc)<br/>\n- disables / debilitate / healing</div></blockquote>\n\n- tank: <strong>Rogue</strong> - AC, ED, SCV<br/>\n- crowd control: <strong>Rogue</strong> - Stealth, HIPS (with SD1), traps<br/>\n- buff: <strong>Rogue</strong> - UMD for caster items and for scrolls<br/>\n- damage: <strong>Rogue</strong> - SA, traps, UMD for damage spells, UMD for weapon buffs<br/>\n-skills: <strong>Rogue</strong> - skills galore<br/>\n- debuffer/ disabler/ healing: <strong>Rogue</strong> - Scrolls (dispels/ breach/mord), Crippling strike, traps, Heal - is just one more skill<br/>\n- saves: <strong>Rogue</strong> - (with a dash of CoT) Improved evasion, Slippery mind, Defensive roll, Uncanny dodge II and up<br/>\n<br/>\nOh was it a duo??? <br/>\nAdd another<strong> Rogue <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /></strong><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:32 PM - Jan 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll take two Deadly Nightshades for 100!<br/>\n<br/>\nMonk 34/SD 5/Ass 1 x 2.<br/>\n<br/>\nThey come like lightning, kick yer behind, and vanish as if they had not been there at all - <em>might </em>want to have one replace the Ass 1 with Ro - to disarm really nasty traps that are cannot be disarmed by Ass.<br/>\n<br/>\nBoth near magic immune, ED, Dex based Fisters with HiPS and maxed out HS and MS.  Equip with Lesser Breach Wands, a behindload of spell scrolls, items, etc (UMD ftw!!!) and romp.<br/>\n<br/>\nUMD replaces your Cleric/Mage heals, buffs, etc - so don't need those classes.  <br/>\n<br/>\nThe Rule of 20 says you will eventually hit anything - and with the right buffs, will anyway.  Since both are nigh indestructable, it is just too easy to HiPS if one should go down for some reason, and rez it with the HiPSer.  If a real TS monster is being opposed, then the incredible speed will suffice (or just pop GS or TS and rez then).<br/>\n<br/>\nI think only the Tarrasque will be able to give these two pause - and then they could run away so fast that it ain't funny!<br/>\n<br/>\nThese two just have too many tricks up their sleeves that all the others do not have.  Even if some devious builder puts in a surprise room, locked until death of opponent, with little room to maneuver, it's gonna take some real clever scripting and/or monsters to make these two sweat.  Something that will just totally wreck any others, these two have a chance due to the incredible immunities built in without needing to buff, etc.<br/>\n<br/>\nMages?  Hit them with a DMZ area.  Good luck there.  Clerics are gonna suffer as well, but not as bad.  Bards?  A total silence area, with DMZ as well - that takes care of them.  Rogues imo have a much better chance, but get whammied by magic...<br/>\n<br/>\nI have played on a PW that had such an area - where Mages and Clerics dreaded to go, because all buffs were stripped off immediately and an Anti-Magic effect was permanent in the area itself.  Melee mostly hated it because of the many different nasty spell-like surprises waiting in store and the \"you will get hurt if you touch me\" mobs.  AAs hated it due to the limited room and ultra-fast opponents.  Rogues and SDers hated it due to the TS sporting m0bs that were sneak immune.<br/>\n<br/>\nAbout the only thing that would threaten my two choices would be Greater Ruin spamming opponents.  But then, everyone would have a problem with that.  I should know, I built such an area to challenge Players on my PW, The Playground as the before-last area to the Super-Secret End Boss of Bosses.  Mini-micro (think bug swarm) ultra-fast zippy flying things all over the place that can see anything (TS), and have unlimited Greater Ruins.  All in an Anti-Magic Area.  <br/>\n<br/>\n3 Players managed to make it past that area in the entire life Span of the PW, and only 2 of them managed to then defeat the End Boss and get a permanent statue in The Hall of Heroes.<br/>\n<br/>\nBut, aside from that...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "11:01 PM - Jan 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">My first character on any server is always a caster cleric so I can definitely see the benefits of a Cleric and Figh/Bard/PM duo. I can't speak for Arelith or WoG, but on BSK the best duo is probably a tank and DPS. Mages aren't that useful when it comes to bosses and battle clerics are overshadowed by dedicated melee builds due to +20 AB weapons being available.<br/>\n<br/>\nShifter and paladin is certainly a unique pair, it could work well on servers where most opponents are evil. As long as it has other shapes such as Risen Lord and Rakshasa then the shifter could also act as a decent tank while the paladin gets to smiting. High AB from paladin buffs and unblockable damage from Divine Might will work against a lot of mobs, even those with high AC or high DI/DR,<br/>\n<br/>\nFrom the ones you listed I would go with a Bard/BG/RDD and zen caster Cleric. You'd have offensive melee, ranged, and casting capabilities, both can AC tank, and both builds would have a lot of flexibility due to UMD.<br/>\n<br/>\nLevelling a pair of pure rogues would be a nice challenge, maybe one STR and one DEX to help with any sneak immune foes.<br/>\n<br/>\nMonk/SD is definitely a good defensive build, but I would pair it up with an offensive build rather than having two of them. I've played and fought both Monk35/SD5s and Monk34/SD5/Rog1s in the past. Although their defences make them very hard to kill their weak offence means that they're more distractions than real threats, although with enough time 20s will wear down most opponents without Epic Dodge or regen. Having a build that can both AC tank and absorb spells would definitely be a great help to their party member though, they can run in, get aggro, and leave the killing to their party member. I would probably pair it with either an AA or a mage, but any offensive build will do really.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "12:14 AM - Jan 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I suppose it depends on your assumptions.  To use things like UMD and niche builds you need to understand the server you play on.<br/>\n<br/>\nIf UMD offers little or no advantage (Arelith) then all those builds relying on it become rubbish pretty quickly.  Drop in server with defined rest areas or long rest windows and Divine builds become far less useful.<br/>\n<br/>\nRDD builds are restricted on more servers than not, so I tend not to start there myself but I often end there :)<br/>\n<br/>\nIn my mind, niche builds are where you end up on a server or module once you know it.  Generic “explore and learn” builds are a different thing.<br/>\n<br/>\nI am enjoying reading people’s thoughts, approach and assumptions though, they are diverse and very interesting.<br/>\n<br/>\nThanks for the post!<br/>\n<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:23 AM - Jan 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In terms of strong party classes, I believe Bard and Cleric are pretty easy choices for major classes, they provide so many bonuses and protections not to just themselves but also to others.<br/>\n<br/>\nBeyond that it is pretty simple to add further 'Jobs' such as Tank, Damage, Skills (with rogue skill dumps for example). I like the 'Tank' to be high AB so knockdowns can be effective to protect teammates. <br/>\n<br/>\nI think a very high level cleric (to try to provide some Mord Resistance to buffs) with rogue works well here. I believe high DC is nice but not essential here. For example, Avado, a noted cleric builder, was never a fan of putting Wisdom higher than 20 in his builds. One could go <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/boccob-s-tricky-devastator-cleric-32-fighter-6-rog-t2355328.html\" rel=\"noreferrer\" target=\"_blank\">Devastating Critical Cleric even</a>, so the Bard doesn't have to.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:38 AM - Jan 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>their weak offence</div></blockquote>\n\nI am curious and puzzled why you think the offense is weak.<br/>\n<br/>\nDex based Fister - that is 1d20 + Str (22) and Glove damage.  AB itself is pretty high (Dex based, all in) - around 47~50+ range, depending on items available.  Number of Attacks is high due to Monk UBaB and Circle Kick combined with Flurry of Blows, and if present, Haste.  <br/>\n<br/>\nI mean, sure, a dedicated AA or WM will definitely have an AB that is at least +10 higher - but that really applies against all other builds as well - AA and WM (+RDD) can continue to get good AB stacking in Epic Levels, something that other classes struggle for (either taking EP, EF:Weapon, and Great [Ability]) - except that AA and WM can also get those.<br/>\n<br/>\nI was plenty surprised at the damage being dealt out (and WoG has very heavy DR opponents!) - even AoO (who has 30DR) was possible to beat with Fists.<br/>\n<br/>\nNote that Arileth I would not even consider to be D&amp;D anymore, with the extreme customization and limitations that they put on stuff.<br/>\n<br/>\nOn Thain, with the artificial 20 level limit (can go over, but it is complicated) 20th level Monks are still \"teh chizz\" there - but only pure ones - so no Nightshades.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:09 AM - Jan 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I wouldn't get too puzzled Web. <br/>\n<br/>\nIt's about its AB and the definitions builders use.<br/>\n<br/>\nBase AB 40 (ie no buffs, mundane equipment, at level 40) is a pretty standard benchmark for a warrior. <br/>\n<br/>\nLess than that, the AB is considered a 'support' type attack. <br/>\n<br/>\nMore reading: <br/>\n- <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build241416.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/buil ... 41416.html</a> (Mithdradates)<br/>\n- <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/attack-bonus-ab-goals-t2355144.html\" rel=\"noreferrer\" target=\"_blank\">attack-bonus-ab-goals-t2355144.html</a> (general ECB discussion)<br/>\n<br/>\nYou have definitely demonstrated your build can work on WoG though.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:48 AM - Jan 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, I think he may be comparing Arileth here.<br/>\n<br/>\nIf +20 ENHANCEMENT weapons are available, that's +20 to hit and damage (insane for level 30 imo).<br/>\n<br/>\nMonk gloves only have Attack bonus.<br/>\n<br/>\nSo the 1d20 is made totally redundant for a Monk.<br/>\n<br/>\nIt's basically Monks have a -20 to damage.<br/>\n<br/>\nThat would totally support his \"weak offense\" statement.<br/>\n<br/>\nThain is not like that - neither are most PWs that I have ever played on (I would never, EVER play on Arelith).<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "6:56 AM - Jan 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Blackstone has +20 weapons and a level 40 cap.  It is an interesting world where there are two progression tiers.  The first is a mid tier magic world and the second is a high tier via crafting magic world.   <br/>\n<br/>\nArelith is a heavily customised level 30 world with end game weapons hitting +3 with some racial and class limited weapons hitting +4.  It is interesting because they have a version of NwN with some level of class balance.  Whether or not the version is to your tastes is a different thing, but it is a solid attempt at creating what NwN and frankly D&amp;D “should” have been.<br/>\n<br/>\nMonks are weak offensively because they have to “Hit” stuff to damage it and even with more attacks and the UBAB attack schedule you are better off with fewer attacks that require less than a 20 to hit and critical.  A 3/4 BAB class is weak offensively unless it has other mechanisms of bridging the AB vs AC gap and a monk has none ... no, circle kick is not an AB vs AC bridge ...<br/>\n<br/>\nNow, to be fair, if the world is balanced for 3/4 BAB melee classes to hit end game NPCs then a monk does well.  Or if you dip or multi them and net high BAB high number of attacks, the game changes.<br/>\n<br/>\nBut, compared to a full melee class a deep monk build is weak offensively.  The trade off being they are exceedingly strong defensively.<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:04 AM - Jan 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>UBAB attack schedule you are better off with fewer attacks that require less than a 20 to hit and critical.</div></blockquote>\n\nExcept that FoB and Circle Kick both are high UBaB extra attacks.<br/>\n<br/>\nThat means that one has 3, instead of 1 (albeit FoB is a -2).<br/>\n<br/>\nI call that a pretty good offensive option.<br/>\n<br/>\nThe thing is, most have written off Circle Kick, because it was totally borked before.  It was fixed by BD.<br/>\n<br/>\nTrue, it does make you attack a different opponent if more than 1, but still...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "8:48 AM - Jan 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">InterestIngly, on a pure 3/4 BaB class with no way to mitigate the AB drop, whether circle kick or FoB nets full UBAB or not doesn’t make a difference outside of clearing the trash mobs.  When you need a 20, you need a 20.  And that is why monk is weak offensively.  You get 2 or 3 extra 1/20 shots to hit over a straight melee who are steadily hitting 2 attacks (first and hasted) for more damage because they have enhancement bonuses (not Attack bonuses), decent threat ranges and critical multipliers and depending on how AC intensive the combat, let’s say 1/20 on the other 3 attacks.<br/>\n<br/>\nSo with a monk attacking 8 times a round using unarmed combat, FoB, circle kick and haste but requiring a 20 to hit will hit 0.4 times per round,<br/>\n<br/>\nA straight melee attacking 5 times a round using a weapon and haste, but requiring a 15 to hit (25% on primary attack which is MUCH worst than most end game content is typically balanced) would hit .65 times per round.<br/>\n<br/>\nA straight melee is typically considered to have a 10 AB differential over a 3/4 melee due to the 5 BaB differential and the extra fighter/CoT/WM feats, paladin spells and tighter stat focus (honestly not sure why on a blackguard ... hehe).  Meaning when a monk needs a 15 to hit (-2 for FoB): 17/20/20/20/20/20/17/20 (also those extra free attacks of circle kick and haste are on BAB schedule not UBAB) a fighter/WM/CoT needs needs a 5 to hit: 5/10/15/20/5.<br/>\n<br/>\nAnd lets be clear, no “decent” server is end game boss balanced for a 3/4 melee class with limited feats for stat bumps hitting 25% of the time at full BAB.  You would be lucky to see 10% of the full BAB attack.<br/>\n<br/>\nSo a monk will hit .6 times per round and a pure melee will hit 2.3 times per round.  There really is no comparison until both need straight 20s or they both need 1s.<br/>\n<br/>\nWhere a monk pulls ahead is it can sometimes survive longer, particularly solo.  And  dead is 0 hits per round so .6 hits per round wins :)<br/>\n<br/>\nThis is why a monk is weak offensively but very effective trash mob sweepers.  It is also why they can solo end game mobs on certain servers.  When everyone needs a 20, more attacks is better and not much can outlast a monk.<br/>\n<br/>\nFor what it is worth, the damage per hit math is worse.  Most full melee can out damage an entire monk (fist) attack sequence connecting with 1-2 hits.<br/>\n<br/>\nThis is why monks are weak offensively.  It is also why bards need bard song, curse song and taunt to function in melee.<br/>\n<br/>\nMonks, from a melee offence perspective become quite interesting when you dip them however ... this also erases most of their defensive capabilities.<br/>\n<br/>\nNow, back to my DD/monk/rogue unarmed FoB / Circle kick EDR build.  If you want to use all those mob attacks you need to mitigate the 20s!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:14 PM - Jan 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Then why is my build is hitting decently against AoO, WDK, etc - they both sport pretty high ACs.<br/>\n<br/>\nSo I am not sure where the disparity here is.<br/>\n<br/>\nI worry more about the DR, tbh.  Getting damage past it.  <br/>\n<br/>\nHitting is not the problem (although I was pretty frustrated against a horde of 50% conceal today...grrrr!  Seems like almost every hit was \"Miss, conceal\"! and my character has Blindfight!).  The fight took forever...I mean with like 24 opponents all with 50% conceal, and then RNJesus doing stupid stuff...still, didn't get damaged, so...timesink.<br/>\n<br/>\nPerhaps the AC on WoG End Bosses just isn't as sky high as you are figuring.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "8:55 PM - Jan 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I don't play on Arelith but I do play on Blackstone Keep, which has +20 AB weapons not +20 EB weapons. Whenever I post builds on the ECB forums they are built with +5EB/+5AC worlds in mind, since in my experience those are the most common when it comes to item properties.<br/>\n<br/>\nMonk35/SD5 and Monk34/SD5/Rog1 are two of the best defensive builds in NWN, but their offence is terrible when compared to proper DPS builds even in a +5 EB world. The damage on a Monk/SD is mediocre for a DEXer in a +5 EB world, but the AB is bad even if you drop defensive feats for AB feats. I care about self-buffed AB more than the base AB that the ECB focuses on, but +50 AB is the absolute minimum I would accept for a melee build in a +5 EB world. +50 AB is barely acceptable in a +5 EB world, I would class decent AB as above +60 AB. There are plenty of ways to increase AB beyond just adding AA, RDD, or WM levels in a low/medium magic world.<br/>\n<br/>\nLet's compare two minmaxed DEX builds with Epic Dodge, Monk35/SD5 and Rog13/Figh8/WM19. I'll assume +12 STR, +12 DEX, and +5 AB/EB.<br/>\n<br/>\nMonk35/SD5<br/>\nWhen I build this I go for 61 SR with Armor Skin, Epic Dodge, and ISR8, but for this comparison I'll drop Armor Skin and one ISR feat for EWF: Unarmed and Epic Prowess. The starting stats are 16STR/20DEX for an elf and 14STR/20DEX for a halfling.<br/>\nElf AB: 25 (BAB) + 16 (DEX) + 4 (Feats) + 5 (AB Bonus) = +50 (+48 with Flurry)<br/>\nElf Damage: 1d20 + 9 (19-20/x2)<br/>\nAverage Hit: 19.5 / Average Crit: 39<br/>\nHalfling AB: 25 (BAB) + 16 (DEX) + 4 (Feats) + 5 (AB Bonus) + 1 (Size Bonus) = +51 (+49 with Flurry)<br/>\nHalfling Damage: 2d12 + 8 (19-20/x2)<br/>\nAverage Hit: 21 / Average Crit: 42<br/>\n<br/>\nRog13/Figh8/WM19<br/>\nA kukri-wielding halfling with 12STR/20DEX starting stats. For the sake of fairness I'll ignore the +7d6 Sneak Attack and assume that the kukri isn't keened.<br/>\nAB: 29 (BAB) + 19 (DEX) + 4 (Feats) + 4 (WM Bonus) + 5 (EB Bonus) + 1 (Size) = +62<br/>\nDamage: 1d4 + 18 (13-20/x3)<br/>\nAverage Hit: 20.5 / Average Crit: 61.5<br/>\n<br/>\nThe Monk35/SD5 has -11/-12 AB, lower average criticals, and a lower threat range, but has similar average non-crit damage and potentially +2 APR in comparison to the Rog13/Figh8/WM19. If the Rog/WM is built for dual-wielding then the APR will be the same for both builds, although the offhand non-crit damage will be slightly worse than the Monk/SD damage. Unless both builds are rolling for 20s the Rog/WM will outdamage the Monk/SD against most opponents. This is just comparing two DEX builds with Epic Dodge, once I start including builds like STR Clerics and STR WMs then the Monk35/SD5 is completely overshadowed in terms of both AB and damage.<br/>\n<br/>\nI've never played on WoG but I imagine that most of your time fighting big bosses with a Monk/SD is spent watching the screen in boredom waiting for 20s since the bosses can't hit you and you can't hit them. Imagine how much faster you would kill bosses if your Monk/SD was partnered with a STR WM, Divine Might AA, or nuke mage. That's why having one Monk/SD in your duo would work but having two of them would be a bad idea.<br/>\n<br/>\nEdit: I just noticed that I wrote the halfling's unarmed damage as 2d12 rather than 2d6, as  a result the halfling does even less damage compared to the other two builds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:40 AM - Feb 01, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">No, I don't wait for 20s.  But yeah, the rolls are on the high end, of course.<br/>\n<br/>\nMost of the Bosses on WoG just have high AC and can tank damage.  And then they deal damage out like powerhouses - meaning most solo's get wrecked, and fast.<br/>\n<br/>\nAll of my other solo's have to \"hunt and peck\" meaning draw out one of the m0bs and whittle down the multitudes until only the Boss is left (there is one Boss where this is not possible and one gets swamped).<br/>\n<br/>\nThe problem has always been getting a build with enough defences to withstand the damage (their AB is high enough to normally hit) AND deal enough damage to defeat the Boss, all the while tanking the spells.  <br/>\n<br/>\nIt has not been an easy route.<br/>\n<br/>\nAs a Monk/SD/Ass (one could take Ro) I don't have those problems at all.  None.  I go in, and just let things happen, because other than Greater Ruin, nothing is going to happen.  Sure, sometimes NWN likes to roll multiple 20s in a row (I've seen 8 20s after another!) and damage will happen, but the build can tank it.<br/>\n<br/>\nDamage is not a problem with the build on WoG.  I don't play on Blackstone, so I have no idea how the build would do there.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "4:24 AM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Builds should be adapted to their environments, so if it works on WoG then it's a good build for you. AC tanks are useless against bosses on BSK and a Monk/SD doesn't have the damage to be a DPS build either so it wouldn't do well in PvM.<br/>\n<br/>\nIn general the main problem with the build's offence is the low AB, especially when compared to proper offensive melee builds. In a +5EB environment the damage is okay for a DEXer, but again when compared to proper offensive melee builds it's lacking.<br/>\n<br/>\nMaybe the WoG bosses just have lower AB and AC than I thought they would have. In a +5EB/+5AC world I would expect most high end PvM mobs to have around +50-+75 AB and 50-80 AC, depending on the type of mobs and whether they're bosses or not. On top of that most bosses would have some combination of concealment, DI/DR, immunities, regeneration, spells, and other nasty tricks that builders love to include. On the low/medium magic servers I've played on in the past the Monk/SD would need to be in IExp when fighting most high end bosses which would reduce the AB even further. If you can tank bosses on WoG without Expertise then I can see why you don't see a problem with the offence.<br/>\n<br/>\nPersonally I would still pick an offensive build as a partner though, having two AC tanks seems redundant to me.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:47 AM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Can confirm, 1 defensive teammate might be enough to accomodate for two offensive teammates<br/>\n<br/>\nAquarius, Franz and I recently finished the Demonweb Pits as a trio, late 20s to mid-30s (we gained a lot of levels during the process) <br/>\n<br/>\nFranz is con based dwarven defender, 800hp or something<br/>\n<br/>\nAquarius (divine might bard RDD spear wielder) and I (cleric divine might zen archer) are full offensive divine damage dealers. Aquarius is great with curse song and lasting inspiration, lowering AC / saves / skills whilst boosting ours, I add quite a few cleric buffs to the team which are hard to dispel. <br/>\n<br/>\nI pretty much shoot unimpeded every teamfight, the guys will head back and protect me if needed. if the tanks fall I can just invis or greater sanctuary and raise em.<br/>\n<br/>\nYogmister sometimes joins in as a fighter/rogue/WM with dev crit (offensive) but I find we get a few more dirt naps with the 1:3 balance, perhaps 1:2 is better, or 1:3 with two ranged (ie archer/spellcaster)<br/>\n<br/>\nBigby's is a huge problem, but as long as I'm alive we aren't going to lose a fight with 50 res scrolls and 5 res rods in my pack...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:42 AM - Feb 02, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, I can say that the two Nightshades waltzed all over WoG, with narry a problem.<br/>\n<br/>\nWhat can't be reliably hit, regens the damage, and ignores magic, has no real problem (except Gr. Ruin, which with two is never a problem).<br/>\n<br/>\nEven against Lord Vayne and Lady Athea (2 Gr Ruins) or WDK (who seems to have 2 as well), with an Orb each, not a problem at all (if one sucks down 2, the other Rezes).<br/>\n<br/>\nBut in other environments, I might change my mind, dependingly.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}