{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "144",
  "name": "Setting and Crafting Traps: A detailed analysis",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/setting-and-crafting-traps-a-detailed-analysis-t2355294.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "13",
  "views": "1.4K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "10:55 AM - Jan 13, 2020",
      "content": "<div><strong>Setting and Crafting Traps: A detailed analysis</strong><br/>\n<br/>\nHello all!<br/>\n<br/>\nI have been studying setting and crafting traps over the last 2-3 months. <br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/unravelling-the-world-of-nwn-traps-a-primer-t2176824.html\" rel=\"noreferrer\" target=\"_blank\">Previous discussion</a> examined the merits of laying a carpet of individual traps versus stacking a large number of traps on themselves. <br/>\n<br/>\nThis discussion aims to determine if a effective and flexible standard layout for traps is possible.<br/>\n<br/>\nMeaning it is flexible enough to deal with the majority of combat situations and effective at the same time in those situations.<br/>\n<br/>\nAlso a trapper needs to consider what traps to use, what strength traps to use, and how many traps to use, in any given situation, to deal a certain amount of damage. <br/>\n<br/>\nSome analysis will be performed to consider this, as the damage calculations for each trap and type can vary.<br/>\n<br/>\nIt is also valuable to consider the component to damage ratio, and what is the most efficient, assuming the reflex save DC for 1/2 is not an issue.<br/>\n<br/>\nI am keen to read what other more experienced trappers think, if there is anything to improve, and perhaps, share their own experiences, stories and standard layout strategies of their own. <br/>\n<br/>\n<strong>Pre-requisites</strong><br/>\nSet trap 1-15, modified or 45 modified [to set with take 20]<br/>\n- minor fire/electrical traps 1-4<br/>\n- average fire/electrical traps 5-9 <br/>\n- strong fire/electrical traps 10-14<br/>\n- deadly fire/electrical traps 15<br/>\n- epic fire/electrical/frost traps 45<br/>\n<br/>\nDisable trap 1 rank, to retrieve unused traps<br/>\n<br/>\nArmor, shields and riding on horseback can reduce the set trap score. It is best to unequip full plate/shields and dismount when attempting trap setting.<br/>\n<br/>\nBest to set traps outside of combat. This includes all party members. Combat can prevent take 20 and interfere with trap setting. <br/>\n<br/>\n<strong>Recommended</strong><br/>\nCraft trap 0-34, modified [5% to 100% crafting success range]. Skill can be used without training.<br/>\n- minor fire/electrical traps 0-19 <br/>\n- average fire/electrical traps 4-24 <br/>\n- strong fire/electrical traps 9-29<br/>\n- deadly fire/electrical traps 14-34<br/>\n<br/>\nIf one aims to craft deadly fire/electrical traps, I humbly suggest a minimum craft trap modified score (with items from your environment) of 19-24.<br/>\n<br/>\nThis has 25-50% success rate to craft deadly fire/electrical traps to mitigate the 10% risk of component loss on unsuccessful trap creation.<br/>\n<br/>\nHigher is better obviously to save on component loss.<br/>\n<br/>\nCrafting traps can be done quickly, by putting the crafting skills menu on the quickbar, then memorising the series of numbers to press to craft the trap of interest. IE F4 [crafting skills menu] -&gt; 5 [craft a trap] -&gt; 2 [electrical] -&gt; 1 [minor] might craft an minor electrical trap, for example, but it depends on the components you are carrying.<br/>\n<br/>\n<strong><strong>My current standard trap layout</strong></strong><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_2b06baf7db2c7f1ca908f3170529b374_t.jpg\"/><br/>\n<strong>Trap free area</strong><br/>\nThe trap free area is where I pull enemies when I don't want to use the traps, to 'save them'. (a similar concept to saving spells, for example). <br/>\n<br/>\nFor the purpose of this post I have defined these enemies I don't want to use damaging traps on as 'easy enemies'. These enemies funnily enough include difficult opponents I don't want to use my traps on, such as  high dexterity monks with evasion/improved evasion who might just charge through such traps without a scratch, wrecking my trap field.<br/>\n<br/>\n<strong>Weaker traps (non-disable)</strong><br/>\nThe weaker traps are designed to to damage or kill enemies that I want to use the traps on. <br/>\n<br/>\nThis might be weak enemies around bosses I cannot pull individually, boss summons/familiars/animal companions, or moderate difficulty non-boss enemies. <br/>\n<br/>\nThe weaker traps can be individual, or they may have variable amounts of stacking. I like to have a mixture. In this example I have stacked between 1-4 minor fire traps in this area, but a different situation I might use stronger traps or stack more traps (or weaker traps/use less traps).<br/>\n<br/>\nThese are all traps I don't mind losing, they aren't particularly special to me.<br/>\n<br/>\n<strong>Tangle traps</strong> <strong>(slow) - optional</strong><br/>\nAgainst enemies without freedom, these traps have a high reflex save DC (20-35) and I believe can be stacked forcing multiple saves per round. They could be placed in the area where weaker traps are marked on the screen. This appears optimal if your party has substantial ranged firepower (such as archer builds, sorcerer builds, wizards, UMD/arcane users with wands of fire/ILMS etc) and the opponents do not have freedom.<br/>\n<br/>\nA high base reflex save will be 12 + dexterity modifier at level 20 and 22 + dexterity modifier at level 40. <br/>\nA low base reflex save will be 6 + dex mod at level 20 and 16 + dex mod at level 40.<br/>\n<br/>\nIn practice the way I translate this is that one or two deadly tangle traps should be effective to slow fighter types and mages. Multiple tangle traps would be required for rogues and assassins. <br/>\n<br/>\nI have not tested this however and appreciate any corrections you might make, and am prepared to edit the main post if I am found to be incorrect.<br/>\n<br/>\n<strong>Stronger traps</strong><br/>\nThese traps I place for bosses, and potentially wish to save them otherwise. These are higher grade traps aimed at dealing damage (fire, electrical, deadly spike traps, deadly blob of acid traps, epic traps), or very large stacks of lower grade traps (ie multiple minor fire/electrical traps).<br/>\n<br/>\n<strong>No stun traps (ie frost, sonic, acid blob) in the damage trap area</strong><br/>\nI don't particularly want stun traps in this damage trap area, especially the early part of the trap field, as a stunned enemy will stand still, and potentially encourage friendly melee combatants to the area. <br/>\n<br/>\nIf further traps go off, these might damage or kill my allies (or myself) if the PvP setting allows for friendly damage.  <br/>\n<br/>\nAlthough I am flexible in that regard and would tolerate deadly blob of acid traps at the outskirts of any combat zone<br/>\n<br/>\nSometimes players and the AI just see an enemy and charge to be honest despite your chat request or AI order request to stand your ground! <br/>\n<br/>\n<strong>Stun traps, summons, companions and teammates (optional)</strong><br/>\nThis white line indicates where I want to place these. Summons and companions will be ordered to 'Stand your ground' to avoid them receiving AoE damage from the traps.<br/>\n<br/>\nTeammates will be requested to stand in those locations.<br/>\n<br/>\n<strong>Direction of enemy pull</strong><br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759084_8a1eded55e34667a12de699ff80cc30d_t.jpg\"/><br/>\n<br/>\nPulling means I attract the enemies attention and they chase me. <br/>\n<br/>\nThis diagram demonstrates the directions I 'pull' enemies.  <br/>\n<br/>\nUsually this will be with a ranged weapon (such as this example) or with a wand, although it might simply be the enemy seeing me and walking towards me. <br/>\n<br/>\nDetection skills such as listen and spot, or the True Seeing spell are valuable in knowing you have pulled certain enemies<br/>\n<br/>\nIn the green direction I pull 'Easy' enemies, these are enemies I don't want to use my traps. As discussed this could include dexterity monks with evasion who will take minimal damage from my traps.<br/>\n<br/>\nIn the orange direction, I pull 'Medium' enemies, these are enemies I want to use weaker traps on. <br/>\n<br/>\nIn the red direction, I pull 'Hard' enemies, these are enemies I want to use both my weaker and strong traps on. <br/>\n<br/>\nTeammates, summons, animal companions/familiars are in the white area. AI summons/companions are ordered to 'Stand your Ground', as teammates are as well. This is to prevent them from being annihilated when AoE fire/electrical traps activate. <br/>\n<br/>\nI also, optionally, can put a smattering of disable traps (frost, sonic and acid blob) in the white area. Disable traps are completely countered by both freedom and stun/mind immunity.<br/>\n<br/>\n<strong>Not all traps are made equal. </strong><br/>\nI found this out through playing experience. <br/>\n<br/>\n<em>Most opponents</em><br/>\nIn terms of sheer damage, with no disables, and assuming no evasion, against most opponents (clerics, fighters, mages), I believe fire traps and electrical traps are best. They appear to do the most damage / trap, and have the added advantage of targeting more than one enemy at once. <br/>\n<br/>\nAlchemist's fire ideally should be crafted into deadly fire traps if possible, although minor fire traps are effective if the enemy's reflex save is low and there is no evasion/improved evasion. <br/>\n<br/>\nQuartz crystals should be crafted into the electrical trap that will likely beat your opponents reflex DC, although deadly electrical traps appear very reliable in general. <br/>\n<br/>\nDeadly spike traps may be useful as well but not weaker versions of the spike traps. Strong and deadly acid blob traps but not weaker versions also output reasonable damage and provide a potential disable. <br/>\n<br/>\nAcid blob traps are attractive against enemies without freedom and weak reflex saves. The reflex DC is 25 for deadly acid blob traps. A few traps may need to be set for this to be reliable. Unfortunately these traps cannot be crafted.<br/>\n<br/>\nMore details in further analysis.<br/>\n<br/>\n<em>Evasion/Improved Evasion users</em><br/>\nAgainst these opponents (rogues, monks), either no save damaging traps or disabling traps can be considered in addition to the standard traps suggested above.<br/>\n<br/>\nAnother option is to avoid using traps against them by pulling them away from your traps, one could use the method described above..<br/>\n<br/>\nUnfortunately no save traps do limited damage, with the exception being holy traps against undead, and epic frost/sonic traps.<br/>\n<br/>\nI think stacked minor holy and minor sonic traps are the ideal traps for no save damage, I have observed holy water and thunderstones can be potentially stacked, although I have observed non-stackable holy water as well. Happy to receive comments on this.<br/>\n<br/>\nFrost traps disable if they fail a fortitude save. The deadly trap fortitude DC is 15. Quite a few traps might need to be stacked for the disable to be reliable. <br/>\n<br/>\nSonic traps disable if they fail a will save. The deadly trap will DC is 20. Again quite a few traps might need to be stacked for the disable to be reliable. <br/>\n<br/>\nBoth frost and sonic traps can be crafted with coldstones/thunderstones. <br/>\n<br/>\n<em>Undead</em><br/>\nHoly traps can be considered to do damage against these in addition to electrical and fire traps.<br/>\n<div class=\"codebox\"><p>Code: <a href=\"#\" onclick=\"selectCode(this); return false;\">Select all</a></p><pre><code>Median non-disabling minor trap damage, listed highest to lowest\n\n\nType                  Approx. Median Damage       Save for 1/2    Targeting    Other\nelectrical            28 electrical (8d6)         reflex          multiple\nholy [undead only]    22 divine (4d10)            no save         single\nfire                  19 fire (5d6)               reflex          multiple\nacid splash           9 acid (2d8)                reflex          single\nnegative [non undead] 7 negative (2d6)            no save         single       fort save against stats, heal undead\nspike                 7 piercing (2d6)            reflex          single\nholy  [non undead]    5 divine (2d4)              no save         single\n\n\nMedian non-disabling deadly trap damage, listed highest to lowest\n\nType                  Approx. Median Damage       Save for 1/2    Targeting    Other\nfire                  148 fire (25d6)             reflex          multiple\nelectrical            105 electrical (30d6)       reflex          multiple\nspike                 88 piercing (25d6)          reflex          single\nholy [undead only]    66 divine (12d10)           no save         single\nacid splash           36 acid (8d8)               reflex          single\nnegative [non undead] 27 negative (8d6)           no save         single       fort save against stats, heal undead\nholy [non undead]     20 divine (8d4)             no save         single\n</code></pre></div>\n<strong>How many stacked traps to deal 'x' amount of damage</strong><br/>\nI believe it is helpful in a practical sense to have a table of calculations as to how many stacked traps are required to deal 'x' amount of damage on most occasions.<br/>\n<br/>\nI spent a little time to create this table to share with anyone who wishes to view it.<br/>\n<div class=\"codebox\"><p>Code: <a href=\"#\" onclick=\"selectCode(this); return false;\">Select all</a></p><pre><code>Number of traps to deal a certain amount of median damage\n(assuming no immunities/resistances/reductions/saves/evasion/improved evasion)\n\n\nMedian damage / trap is listed in [ ]\n\n\nMinor traps\n\nType              25 damage    50 damage    100 damage    200 damage    500 damage\n\nelectrical [28]     0.9         1.8           3.6           7.2           17.9\nfire [19]           1.3         2.6           5.2           10.5          26.3\nacid splash [9]     2.8         5.6           11.1          22.2          55.6\nnegative [7]        3.6         7.1           14.3          28.6          71.4\nspike [7]           3.6         7.1           14.3          28.6          71.4\nholy [5]            5.0         10.0          20.0          40.0          100.0\n\nholy undead [22]    1.1         2.3           4.5           9.1           22.7\n\nacid blob [10.5]    2.4         4.8           9.5           19.0          47.6\nfrost [5]           5.0         10.0          20.0          40.0          100.0\nsonic [5]           5.0         10.0          20.0          40.0          100.0\n\nAverage traps\n\n\nType              50 damage    100 damage    200 damage    500 damage    1000 damage\n\nelectrical [52.5]   1.0          1.9            3.8           9.5           19.1\nfire [28]           1.8          3.6            7.1           17.9          35.7\nacid splash [13.5]  3.7          7.4            14.8          37.0          74.1\nnegative [10.5]     4.8          9.5            19.0          47.6          95.2\nspike [10.5]        4.8          9.5            19.0          47.6          95.2\nholy [7.5]          6.7          13.3           26.7          66.7          133.3\n\nholy undead [27.5]  1.8          3.6            7.3           18.1          36.4\n\nacid blob [17.5]    2.9          5.7            11.4          28.6          57.1\nfrost [7.5]         6.7          13.3           26.7          66.7          133.3\nsonic [7.5]         6.7          13.3           26.7          66.7          133.3\n\n\nStrong traps\n\n\nType              100 damage    200 damage    500 damage    1000 damage    2000 damage\n\nelectrical [70]      1.4           2.9           7.1           14.3           28.6\nfire [52.5]          1.9           3.8           9.5           19.0           38.1\nacid splash [22.5]   4.4           8.9           22.2          44.4           88.9\nnegative [17.5]      5.7           11.4          28.6          57.1           114.3\nspike [17.5]         5.7           11.4          28.6          57.1           114.3\nholy [15]            6.7           13.3          33.3          66.7           133.3\n\nholy undead [44]     2.3           4.5           11.4          22.7           45.5\n\nacid blob [42]       2.4           4.8           11.9          23.8           47.6\nfrost [12.5]         8.0           16.0          40.0          80.0           160.0\nsonic [12.5]         8.0           16.0          40.0          80.0           160.0\n\nDeadly traps\n\n\nType              200 damage    500 damage    1000 damage    2000 damage    5000 damage\n\nfire [148]           1.4           3.4           6.8           13.5           33.8\nelectrical [105]     1.9           4.8           9.5           19.0           47.6\nspike [88]           2.3           5.7           11.4          22.7           56.8\nacid splash [36]     5.6           13.9          27.8          55.6           138.9\nnegative [27]        7.4           18.5          37.0          74.0           185.2\nholy [20]            10.0          25.0          50.0          100.0          250.0\n\nholy undead [66]     3.0           7.6           15.2          30.3           75.8\n\nacid blob [63]       3.2           7.9           15.9          31.7           79.4\nfrost [20]           10.0          25.0          50.0          100.0          250.0\nsonic [20]           10.0          25.0          50.0          100.0          250.0\n\n\nEpic traps\n\n\nType              200 damage    500 damage    1000 damage    2000 damage    5000 damage\n\nelectrical [210]     1.0           2.4           4.8            9.5            23.8\nfire [175]           1.1           2.9           5.7            11.4           28.6\nfrost [100]          2.0           5.0           10.0           20.0           50.0\nsonic [100]          2.0           5.0           10.0           20.0           50.0</code></pre></div>\n<strong>Optimal crafting component to damage ratios for minor, average, strong and deadly traps</strong><br/>\nThis is another interesting question I wished to answer, as it also ties into what traps one might wish to craft to deal the most damage.<br/>\n<br/>\nFor example, I might be facing a group of enemies with low reflex DCs and no evasion. In this situation, is it best to craft minor electrical traps with those 35 quartz crystals I've hoarded, or should I craft them into deadly traps?<br/>\n<br/>\nI calculated the number of components needed to deal 500 damage using different strength of crafted trap (minor, average, strong and deadly)<br/>\n<div class=\"codebox\"><p>Code: <a href=\"#\" onclick=\"selectCode(this); return false;\">Select all</a></p><pre><code>Components to deal 500 damage (assuming no saves, resistances, immunities, reductions or improved evasion)\n\n\nType                                    Minor (1)      Average (3)   Strong (5)      Deadly (7)\n\nelectrical [quartz crystal]             17.9           28.5          35.5            33.6\nfire [alchemist fire]                   26.3           53.7          47.5            23.8\nspike [caltrops]                        71.4           142.8         143.0           39.9\n\nholy undead [holy water]                22.7           54.3          57              53.2\n\nnegative [skeleton knuckle]             71.4           142.8         143.0           129.5\nholy [holy water]                       100.0          200.1         166.5           175\n\nacid spash [acid flask]                 55.6           111.0         111.0           97.3\n\nfrost [coldstone]                       100.0          200.1         200.0           175.0\nsonic [thunderstone]                    100.0          200.1         200.0           175.0</code></pre></div>\n\nIn general if damage is the only outcome measure, minor traps provided the best component to damage ratio (ie best 'bang for buck').<br/>\n<br/>\nThe exception being deadly fire traps and deadly spike traps.<br/>\n<br/>\nIn reality, one <strong>must </strong>take into account the likely reflex save of the opponents one will face, if the trap has a DC reflex save for 1/2 damage. <br/>\n<br/>\nAlso the likelihood of the components being lost if the craft trap skill is not particularly high.<br/>\n<br/>\nIt is safe to say, in general, if one can craft deadly fire and spike traps reliably, that would be the ideal way to utilise these components.<br/>\n<br/>\nMinor holy traps are almost always the most efficient way to utilise their components.<br/>\n<br/>\nOther traps one must consider other effects, and the DC of the opponent. <br/>\n<br/>\n<br/>\n<strong>Too long, didn't read (TL,DR) [or conclusions]</strong><br/>\n<br/>\n- I set traps to allow for three different pull directions, depending on whether:<br/>\n-&gt; I want the opponent to avoid my trap, or<br/>\n-&gt; I want the opponent to be damaged by my weaker traps, or <br/>\n-&gt; I want the opponent to be damaged by both my weaker and stronger traps<br/>\n<br/>\n- I set the traps in a green carpet fashion with variable amounts of stacking, the weaker traps at the front, the stronger traps at the back<br/>\n<br/>\n- Tangle traps (potentially stacked) can be used to slow opponents to pepper them with ranged attacks, if the enemy does not have freedom<br/>\n<br/>\n- Disable traps I place on the outskirts of the trap field. Frost and sonic traps will likely require to be stacked to be reliable.<br/>\n<br/>\n- Fire, electrical in general appear to be the most effective damaging traps. <br/>\n<br/>\n- If traps are being crafted, <br/>\n-&gt; holy water should generally be crafted into minor holy traps <br/>\n-&gt; caltrops should be crafted into deadly spike traps if able to be achieved reliably, as damage output is poor with lower grade traps<br/>\n-&gt; alchemist fire should be crafted into deadly fire traps if able to be achieved reliably<br/>\n-&gt; quartz crystals can be crafted efficiently into deadly electrical traps, however if the opponent has a low reflex save, lesser electrical traps might be slightly more efficient<br/>\n<br/>\n- Comments are welcome from the experienced mob of players out there!</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "1:05 PM - Jan 13, 2020",
      "content": "<div>Nice write up Orion and I'll have to read it again a few times to digest it fully.  Off the top of my head though there are two things that stand out.  <br/>\n<br/>\n1.  Don't forget traps can also be a \"Holy Crud I gotta get out of here\" tool as well.  I have been known to place a stack in the doorway mainly consisting of stunning/slow types in case I need to retreat quickly and something hungry might be chasing me...  That couple rounds of sonic stun can be a lifesaver...<br/>\n<br/>\n2.  Negative traps below deadly reduce strength as well as do damage, deadly versions remove a level and do damage.   Not a bad thing when that Wizzie fails its fort save and drops 4-5 caster levels after hitting that stack of negative traps.  And really.. what were you gonna do with those skeleton fingers anyway?   Use them as Swizzle sticks in your after dinner cocktails?<br/>\n<br/>\nI'm sure I'll think of more once i reread this a time or three...<br/>\n<br/>\nOnce again.. great job on this..</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:33 PM - Jan 13, 2020",
      "content": "<div>Much good material here, Orion!<br/>\nIt is interesting to see how you use the field for different pull directions.<br/>\nI am so fed up with creatures healing up after every single trap that I almost always use stacks, even if I risk overkill.<br/>\nNot all traps have a reflex save.  Use that against those with a low fort/will save and evasion. <br/>\nAnother factor with rogues is their ability to detect traps. Traps with a high detect DC will improve the odds.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Yogmister7",
      "avatar": "10759120_1567273437.jpg",
      "timestamp": "6:58 PM - Jan 14, 2020",
      "content": "<div>Orion, what an impressive research!<br/>\nI have learned a lot... And will try to practice it as soon as possible.<br/>\n<br/>\nThank you for such an amazing work.<br/>\n<br/>\nYogmister.<br/>\n<br/>\n<br/>\n<br/>\nSent from my Redmi 4 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "11:53 PM - Feb 05, 2020",
      "content": "<div>After having teamed up with you, Orion, in WoG, I learnt how traps can be deadly even at low levels.<br/>\nThank you for this detailed guide, I'll have a look at it so to learn something new!</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "2:10 AM - Feb 28, 2020",
      "content": "<div><strong>Craft trap: an example</strong><br/>\nI thought I would share a screenshot of crafting deadly electrical traps <strong>without any ranks</strong> in the Craft Trap skill. This obviously depends on the environment whether this is possible. <br/>\nThe screenshot is from World of Greyhawk PW which is mostly viewed as a challenging (but enjoyable) mid magic environment.<br/>\n<br/>\n<strong>Character:</strong><br/>\nMy character is the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-celestial-defender-sorcerer-38-paladin-1-monk--t2355371.html\" rel=\"noreferrer\" target=\"_blank\">Celestial Defender</a>, a cons based sorcerer, she is level 13.<br/>\nShe is designed for PvM parties as a tank, buffer, disabler with bigby's, nuker with icestorm/ILMS and all-round favorite to have around.<br/>\nA few of the ECB'ers have partied with her already (<em class=\"mention\">@webshaman1</em> <em class=\"mention\">@Aquarius 233</em> <em class=\"mention\">@Yogmister7</em> <em class=\"mention\">@grom56</em> )<br/>\nIncluding a certain half-elven EDR III double dev crit juggernaut who started kneeling before her and proposing to her on meeting her and <strong>very rightly received a Bigby's 6 to the head</strong> to get that brain fixed.<br/>\n<br/>\n<br/>\nHere I want to collect and make a pile of deadly electrical and fire traps so any rogues/rangers and others in my party can enjoy setting them.<br/>\nIt means any quartz crystals and alchemist fires are very high value, and I have started hoarding them where possible.<br/>\n<br/>\n<strong>Items equipped:</strong><br/>\n- lesser ring of craft trap +5 craft trap<br/>\n- lesser ring of craft trap +5 craft trap<br/>\n- gloves of the artificer +3 craft trap<br/>\n- heavy pick (CEP martial weapon) with +4 int<br/>\n- amulet of intelligence +3 int<br/>\n<br/>\n<strong>Buffs:</strong><br/>\n- lesser ioun stone: Scarlet and Blue +2 int<br/>\n- potion of fox's cunning (rolled +3)<br/>\n<br/>\n<strong>Math:</strong><br/>\nTotal craft trap bonus +13<br/>\nTotal Int modifier 14 (base) + 4 +3 +2 +3 = 26 (+8)<br/>\nTotal modified craft trap score fully buffed: 21.<br/>\n[remember, never trust the character sheet]<br/>\n<br/>\nDC to craft deadly electrical trap = 35. Need to roll 14 or more.<br/>\n= 35% chance of crafting trap<br/>\n= 65% chance of failure, 6.5% chance of losing components / roll<br/>\n<br/>\nExpected yield-&gt; 80% components into traps, 20% component loss.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202002/10759084_5c0eb83a1914383ec0a037f6a0b98de3_t.jpg\"/><br/>\n<strong>Discussion:</strong><br/>\nThere are even gloves which provide craft trap +5 in the environment I am in (rather than the +3 I have equipped), so if I had them equipped I would have a 45% chance of success, and 5.5% chance of component loss, leading to an 89% expected yield from components.<br/>\n<br/>\nGoes to show even the most deadly of traps can be crafted in certain environments with the craft trap skill, <strong>with no investment in the skill</strong>. But if you want to play it safe, 5-10 ranks makes life a lot easier. <br/>\nThe key is not to be turned off by the failed rolls. If one does the math and knows the expected yield is favorable, just keep rolling until components are used up :)<br/>\n<br/>\nAnd I just fail to see how this is tedious as long as you know what you are doing :)<br/>\n<br/>\nHope that helps for the budding trappers out there!</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:40 AM - Feb 28, 2020",
      "content": "<div>Because in that same environment, I can both strip those traps off of objects, or just buy them.<br/>\n<br/>\nCheaply.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "6:39 AM - Feb 28, 2020",
      "content": "<div>The post wasn't directed at you Web, but rather players who actually want to try to use craft trap properly.<br/>\nWe should be encouraging using all the tools available to us rather than discouraging this.<br/>\n<br/>\nYou will notice builders such as <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/arcane-speedarcher-monk-6-wizard-13-arcane-archer--t2354296.html\" rel=\"noreferrer\" target=\"_blank\">Mick Dagger</a> and <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-sentry-of-anduin-rogue-33-fighter-6-shadowdanc-t2350497.html\" rel=\"noreferrer\" target=\"_blank\">Valerfor</a> investing a few ranks in craft trap in some of their builds.<br/>\nI believe if it is good enough for the great builders for some of their builds, its worth learning about.<br/>\nIt's like Craft Weapon in Mage Builds, I was prepared to learn about this because GDL used it, and I can understand its value now.<br/>\nSure I can rely on the environment and just buy bone wands or traps, but there is something satisfying about being versatile and not reliant on a shopkeeper for such requirements.<br/>\n<br/>\nI want to provide the information so players can take the necessary steps to craft traps, if they choose.<br/>\nIt isn't a natural process and I found it difficult myself until Zelcandra taught me.<br/>\nThis is all part of making us more skilled and better players.</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "7:01 AM - Feb 28, 2020",
      "content": "<div>I'm aware that this has switched to a discussion about traps on WoG rather than traps in general but I wouldn't expect +12 INT and +13 Craft Trap to be available from items in most environments, at least not at low levels.<br/>\n<br/>\nI was curious about the maths so I worked out the probability of successfully crafting a trap. If the probability of crafting a trap on an individual roll is p, then the probability of successfully crafting a trap across all attempts is given by 10p/(9p+1).<br/>\nSo in your example of a 35% chance of success on an individual roll, you have roughly an 84% chance of successfully crafting a trap across all attempts.<br/>\n<br/>\nBelow is a table with the probabilities of successfully crafting a trap.<br/>\nThe first column is the probability of crafting a trap on an individual roll, the second column is the probability of crafting a trap across all attempts.\n<details><summary>Spoiler</summary><table class=\"post_content_table\"><tbody><tr><td>0</td>\n<td>0</td>\n</tr>\n<tr><td>0.05</td>\n<td>0.345</td>\n</tr>\n<tr><td>0.1</td>\n<td>0.526</td>\n</tr>\n<tr><td>0.15</td>\n<td>0.638</td>\n</tr>\n<tr><td>0.2</td>\n<td>0.714</td>\n</tr>\n<tr><td>0.25</td>\n<td>0.769</td>\n</tr>\n<tr><td>0.3</td>\n<td>0.811</td>\n</tr>\n<tr><td>0.35</td>\n<td>0.843</td>\n</tr>\n<tr><td>0.4</td>\n<td>0.870</td>\n</tr>\n<tr><td>0.45</td>\n<td>0.891</td>\n</tr>\n<tr><td>0.5</td>\n<td>0.909</td>\n</tr>\n<tr><td>0.55</td>\n<td>0.924</td>\n</tr>\n<tr><td>0.6</td>\n<td>0.938</td>\n</tr>\n<tr><td>0.65</td>\n<td>0.949</td>\n</tr>\n<tr><td>0.7</td>\n<td>0.959</td>\n</tr>\n<tr><td>0.75</td>\n<td>0.968</td>\n</tr>\n<tr><td>0.8</td>\n<td>0.976</td>\n</tr>\n<tr><td>0.85</td>\n<td>0.983</td>\n</tr>\n<tr><td>0.9</td>\n<td>0.989</td>\n</tr>\n<tr><td>0.95</td>\n<td>0.995</td>\n</tr>\n<tr><td>1</td>\n<td>1</td>\n</tr>\n</tbody></table></details></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:30 AM - Feb 28, 2020",
      "content": "<div>Thanks Yunim<br/>\nYou are correct, one should not rely on access to +12 Int (with items/buffs) and +13-15 to Craft Trap on items, it was something I could achieve in the situation I found myself in (extremely favorable to crafting traps), but if one wanted to be safe, investment of a number of ranks is wise, and I've suggested a target of modified 19-25 for crafting deadly traps in general without relying on items. I was surprised an environment that is considered challenging would have such bonuses available but I suspect that is because crafting is attempted to be encouraged.<br/>\n<br/>\nThanks for trying to calculate the math Yunim, I very much like the format of your table and what you have attempted to do. <br/>\nThere are three outcomes, 1. success in crafting + loss of components, 2. unsuccessful crafting no loss of components (allowing for a re-roll) and 3. unsuccessful crafting + loss of components. Can I ask how did you derive the formula 10p/(9p+1) as I don't quite understand how its derived (or how to derive the forumla in this circumstance from basic principles)?</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "10:37 AM - Feb 28, 2020",
      "content": "<div>Say that the probability of successfully crafting a trap on an individual roll is p, with 0 &lt;= p &lt;= 1.<br/>\nIn the case of a failure, there is a 90% chance of keeping the components and a 10% chance of losing the components.<br/>\nSo there are three outcomes, the ones that you have already listed.<br/>\n<br/>\nP(Success) = p<br/>\nP(Failure) = 1-p<br/>\nP(Failure + No Component Loss) = 0.9 * (1-p) = 9(1-p)/10 = q<br/>\nP(Failure + Component Loss) = 0.1 * (1-p) = (1-p)/10 = r<br/>\nNote that we always have p+q+r = 1, but it is not necessarily true that p+q = 1.<br/>\n<br/>\nFrom there it's just basic probability theory and algebra.<br/>\nThe probability of success across all attempts is given by the infinite sum:<br/>\nP(Total Success) = p + pq + pq^2 + pq^3 + ...<br/>\nWe can simplify this to:<br/>\nP(Total Success) = p/(1-q) = 10p/(9p+1)</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:07 PM - Feb 28, 2020",
      "content": "<div>Thanks for explaining Yunim<br/>\nI must confess one part went over my head though<br/>\nIe. getting from p + pq + pq^2 +pq^3 + ... to p/(1-q) is where I have a gap in my knowledge<br/>\nI am keen to learn, is there some further reading I can do?<br/>\nAppreciate your time explaining</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "4:26 PM - Feb 28, 2020",
      "content": "<div>p + pq + pq^2 + pq^3 + ... is an example of a geometric series. [<a class=\"postlink\" href=\"https://en.wikipedia.org/wiki/Geometric_series#Formula\" rel=\"noreferrer\" target=\"_blank\">https://en.wikipedia.org/wiki/Geometric_series#Formula</a>]</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:37 PM - Feb 28, 2020",
      "content": "<div>Thanks!</div>"
    }
  ]
}