{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "139",
  "name": "Wandering Axe Murderer - Fighter 8 / Ranger 25 / WM 7",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/wandering-axe-murderer-fighter-8-ranger-25-wm-7-t2355350.html",
  "author": "MortusMaximus",
  "avatar": "no_avatar.png",
  "replies": "16",
  "views": "4.8K",
  "posts": [
    {
      "author": "MortusMaximus",
      "avatar": "no_avatar.png",
      "timestamp": "4:18 AM - Feb 11, 2020",
      "content": "<div>Concept - So I've been playing NWN since I was too young to read the text within the game, let alone understand it. For years I've seen my dad play Fighter/WM/Rogue variants, and for years thought that was the only way to truly \"win\" in the game. Recently however I started to question my previous stance. Why don't more people use double-sided weapons I asked myself. The answer I came up with was that investing into the dual wielding feats takes too much (both ability and feat wise), to make it worth the trouble. Well why don't they just take levels in Ranger to bypass the dual wielding feats? Well because.... Huh.... This is a build created out of spite, but has become a sort of obsession with me. A double-axe wielding, Dev critting,  Weapon Master with bane of enemies and a whole lot to prove. Doing a search through the new and old databases I saw that some folks used the same or very similar level layouts, but with some different choices in feats or concept. <br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build176438.html\" rel=\"noreferrer\" target=\"_blank\">Fighter 7/Ranger 26/WM 7 fighter 7 / ranger 26 / weapon master 7  (human)  by bpberryWRC</a> - This guys build wasnt really going for anything specific weapon wise, and has some ability score/leveling differences that I feel make it different enough.<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build316572.html\" rel=\"noreferrer\" target=\"_blank\">Visible Monster fighter 8 / ranger 25 / weapon master 7  (human)  by The_Fascist_Porkchop</a> - As Grimnir points out, its almost an exact copy of his Grim Ripper build, but it focuses on the Bane of Enemies alone without dev crit, so I feel it's not the same as mine.<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build117669.html\" rel=\"noreferrer\" target=\"_blank\">The Foe Hunter ranger 25 / fighter 8 / weapon master 7  (elf?)  by Lockindal</a> - Build was posted without alot of information, and had some unique choices in it regardless. Also used full plate/sword and board instead of dual wielding.<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build270518.html\" rel=\"noreferrer\" target=\"_blank\">Robin Hood (Wildwood Warrior) ranger 10 / weapon master 22 / fighter 8  (human)  by TyrTemplar</a> - Vastly different level spread, and this being a RP build makes this one the least like my build, but still wanted to mention it since it has the same base classes.<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build253168.html\" rel=\"noreferrer\" target=\"_blank\">Grim Ripper ranger 25 / weapon master 7 / fighter 8  (human)  by Grimnir77</a> - See above Visible Monster<br/>\n<br/>\nTyr has also reposted the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/robin-hood-wildwood-warrior-ranger9-ftr12-wm19-t2302002.html\" rel=\"noreferrer\" target=\"_blank\">Robin Hood Build on this site</a> recently as well, under the same name, but different level spread.<br/>\n<br/>\nWithout further ado here's my attempt at a build.<br/>\n<br/>\n<br/>\nWandering Axe Murderer - Fighter 8 /  Ranger 25 / Weapon Master 7<br/>\n<br/>\nHuman, Any Alignment<br/>\nPlayable 1-40 PvM<br/>\n<br/>\nAbilities:<br/>\nSTR: 16 (28)<br/>\nDEX: 14<br/>\nCON: 14<br/>\nWIS: 10<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Fighter(1): Weapon Proficiency Exotic, Dodge, Weapon Focus: Double Axe<br/>\n02: Ranger(1): Favored Enemy I, {Dual Wield}<br/>\n03: Fighter(2): Expertise, Mobility<br/>\n04: Fighter(3): STR+1, (STR=17)<br/>\n05: Fighter(4): Weapon Specialization: Double Axe<br/>\n06: Fighter(5): Spring Attack<br/>\n07: Fighter(6): Whirlwind Attack<br/>\n08: Weapon Master(1): STR+1, Weapon of Choice: Double Axe, (STR=18)<br/>\n09: Weapon Master(2): Improved Critical: Double Axe<br/>\n10: Weapon Master(3)<br/>\n11: Weapon Master(4)<br/>\n12: Weapon Master(5): STR+1, Blind Fight, (STR=19)<br/>\n13: Weapon Master(6)<br/>\n14: Weapon Master(7)<br/>\n15: Fighter(7): Power Attack<br/>\n16: Ranger(2): STR+1, (STR=20)<br/>\n17: Ranger(3)<br/>\n18: Ranger(4): Cleave<br/>\n19: Ranger(5): Favored Enemy II<br/>\n20: Ranger(6): STR+1, (STR=21)<br/>\n21: Fighter(8): Epic Weapon Focus: Double Axe, Epic Weapon Specialization: Double Axe<br/>\n22: Ranger(7)<br/>\n23: Ranger(8)<br/>\n24: Ranger(9): STR+1, Great Cleave, {Improved Two-Weapon Fighting}, (STR=22)<br/>\n25: Ranger(10): Favored Enemy III<br/>\n26: Ranger(11)<br/>\n27: Ranger(12): Great Strength I, (STR=23)<br/>\n28: Ranger(13): STR+1, (STR=24)<br/>\n29: Ranger(14)<br/>\n30: Ranger(15): Overwhelming Critical: Double Axe, Favored Enemy IV<br/>\n31: Ranger(16)<br/>\n32: Ranger(17): STR+1, (STR=25)<br/>\n33: Ranger(18): Devastating Critical: Double Axe<br/>\n34: Ranger(19)<br/>\n35: Ranger(20): Favored Enemy V<br/>\n36: Ranger(21): STR+1, Bane of Enemies, (STR=26)<br/>\n37: Ranger(22)<br/>\n38: Ranger(23): Favored Enemy VI<br/>\n39: Ranger(24): Great Strength II, (STR=27)<br/>\n40: Ranger(25): STR+1, Favored Enemy VII, (STR=28)<br/>\n<br/>\nHitpoints: 480<br/>\nSkillpoints: 265<br/>\nSaving Throws (Fortitude/Will/Reflex): 24/16/21<br/>\nBAB: 30<br/>\nAB (max, naked): 44 (melee)<br/>\nAC (naked/padded armor/studded leather): 16/17/19<br/>\nSpell Casting: None<br/>\nAlignment Changes: 0<br/>\n<br/>\nYou require 4 points of Intimidate before the first WM level at 8, but other than that the skill point distribution is wide open. The AC calc assumes the 20 points in Tumble for the free 4 AC. Generally speaking I max out Animal Empathy for the chance at removing an enemy from the fight and gaining an ally, and previously I dumped into Discipline as well, but after reading Grizzled's viewpoint on it I may change that in the future. The general Ranger skill options are all their if you decide to use them, Hide, Move Silently, Set Trap, Spot, Search and listen depending on your preference. With the mandatory Intimidate and 20 in Tumble, you can max 5 skills and the rest is pocket change in another skill of your choice.<br/>\n<br/>\nThe build gets 7 Favored Enemies to divvy out as you see fit. Each one will get +6 to damage, some skill rolls, +2 to hit and an additional 2d6 damage at level 40 with Bane of Enemies. Generally speaking the types that are immune to criticals are safe bets (Undead, Constructs, Elementals etc), but it really is personal preference.  I usually throw a Dragon in there because the giant lizards deserve the extra damage IMO.<br/>\n<br/>\nDamage is a big part of this builds purpose, so here's a few of the more common calculations I've seen on other builds.<br/>\n<br/>\nAB/Damage with a basic double axe at 40 is as follows:  <br/>\nMH 41/36/31/26   1d8+15 (17-20)x4 +3d6 on crit<br/>\nOH 41/36   1d8+10 (17-20)x4 +3d6 on crit<br/>\nAgainst Favored Enemies:<br/>\nMH 43/38/33/28   1d8+21+2d6 (17-20)x4 +3d6 on crit<br/>\nOH 43/38   1d8+16+2d6 (17-20)x4 +3d6 on crit<br/>\n<br/>\n<br/>\nWith the gear I usually encounter getting +12 strength and a +8 weapon isn't unheard of, and Keen is easy enough to secure either through enchant, or a wild wizard. Here's the calculations with a moderately buffed up axe/magic gear:<br/>\nMH 55/50/45/40   1d8+29 (15-20)x4 +3d6 on crit<br/>\nOH 55/50   1d8+21 (15-20)x4 +3d6 on crit<br/>\nAgainst Favored Enemies:<br/>\nMH 55/50/45/40   1d8+35+2d6 (15-20)x4 +3d6 on crit<br/>\nOH 55/50   1d8+27+2d6 (15-20)x4 +3d6 on crit<br/>\n<br/>\n<br/>\nAdmittedly the build is not the best at taking hits, 480 HP for a front line fighter isn't phenomenal, and his AC is going to be sub-par at best being restricted to light armor and never using a shield. However he hits like a 2-ton truck before swinging the 1.5-ton truck around to hit you again. I usually play on servers with abundant magical items, so getting +12 Str/Dex/Con isn't too difficult. I also don't generally run solo when playing past early epic levels, as the build functions best in a squad with both a dedicated buffer and a tank.<br/>\n<br/>\nI find that the build functions well pre-epic and can handle most areas solo if played intelligently and cautiously. The mid-epic levels where enemies hit harder and more frequently make it more difficult to survive due to lower AC. Once he hits the late-epic levels though it really starts to just smoke enemies through sheer damage output. I have played this character 1-40 on Amon, and am going to attempt it on WoG, and had great success and a lot of fun getting all the way to epic levels.<br/>\n<br/>\nThis is not the BEST build, but it's a different way of playing an older trope, and an absolute blast in a party setting. Suggestions and critiques are welcome and encouraged, I've spent months looking at it, but know that there are things I just haven't been able to see myself.<br/>\n<br/>\nThank you for your time, hopefully you have as much fun with this build as I have. </div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:33 AM - Feb 11, 2020",
      "content": "<div>Greetings and welcome MortusMaximus!<br/>\n<br/>\nTo give everyone context I met MortusMaximus on WoG when he was telling me about his build, and when he told me:<br/>\n- he made this primary ranger build / weapon master<br/>\n- he play-tested this build to level 40 on other PWs<br/>\n- it was ITWF Double Axe dev crit<br/>\n- he likes building and is keen to get the build critiqued<br/>\n<br/>\nI suggested this it would be great to read his build on our forum. Its been a while since I've read a primary ranger build which has been thoroughly playtested and thanks for the opportunity to read the work you have done. <br/>\n<br/>\nTo me it looks like a powerful killer with 6-7 APR / round, dev crit weapon master.<br/>\nIf dev crit is not successful, +9-15 str damage (depending if Str cap is reached), +6 from Favored Enemies, +2d6 Bane of Enemies and +6 from WS/EWS = +21 +2d6 damage/hit added to that 6-7 APR / round. With a x4 multiplier I would expect some big critical hit numbers to be appearing, which is always enjoyable to see.<br/>\nIf a teammate casts Flame Weapon on you, your damage output accelerates even further with all those attacks / round.<br/>\n<br/>\nThere are weaknesses (ie AC/saves/inability to self-buff) that I can see which appear difficult to remedy and you are well aware of, but you can compensate for these by playing in a party setting. <br/>\n<br/>\nI have a few suggestions which might improve your build.<br/>\n<br/>\nOne is to see if you can incorporate level 4 ranger spell casting into the build. As your build has 25 ranger levels, this will allow you to have undispellable buffs, with some spell penetration. Spells such as Entangle/Grease/Ultravision, Cats Grace, Freedom of Movement, Aid, Resist Elements/Protection from Elements could be valuable in your build. I actually think you have enough HP and could drop Cons to 10 to put Wisdom to 14 in this circumstance. You aren't really a tank, you are a melee destroyer so 400 base HP I think should do the trick. <br/>\n<br/>\nYou could drop one favored enemy for Epic Prowess by moving Bane of Enemies to the Ranger Bonus Feat at Ranger 23, extra AB is always useful in dual wielding builds, although I am not experienced enough with primary ranger builds to say whether this is a good suggestion.<br/>\n<br/>\nI am curious to see if you can incorporate Knockdown into the build. I dont have any great suggestions to do this, at present the best I see is dropping Blind Fight for Knockdown, but this is never really desirable, being able to reroll against concealed enemies is always very valuable. One could drop one Great Strength and swap another for Armor Skin, it does lower the Dev Crit DC but Knockdown is obtained pretty late and this seems less desirable to me.<br/>\n<br/>\nOnce again, thanks for taking the time post your build and ideas</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "2:24 PM - Feb 11, 2020",
      "content": "<div>I think I might take an approach like this to net Level 4 Ranger Spells.  Str ends up 2 points lower but is exchanged for Epic Prowess (+1AB) and Armorskin (increasing AC, which is a weakness of this build.  So +2 AC for the cost of -1 Damage but also providing a +1 AB that is universal for weapon swapping/ranged/sword and board. You will also lose 1 Favored Enemy.  You will also net a rather long +1 AB/Saves via a 25 Turn Aid spell and of course all the other Ranger spell goodness including Cat's Grace.<br/>\n<br/>\nMany PW offer additional Skillpoints and changes to Blade Thirst for Rangers, they seem to be the goto fixes to balance Rangers.  If you play on a PW offering Blade Thirst upgrades, this may prove more useful for you.  You could also considering dropping 2 CON and return Dex and Int to 14 if you require more Skillpoints but on most worlds I suspect the extra HP are likely a better option.\n<details><summary>Spoiler</summary>Ranger(25), Fighter(8), Weapon Master(7), Human\nSTR: 15 (26)\nCON: 14\nINT: 13\n\n01: Ranger(1): Dodge, Weapon Proficiency Exotic, Favored Enemy I, {Dual Wield}\n03: Fighter(2): Mobility, Expertise\n05: Fighter(4): Weapon Specialization\n07: Fighter(5)\n09: Weapon Master(1): Improved Critical, Weapon of Choice\n11: Weapon Master(3)\n13: Weapon Master(5)\n15: Weapon Master(7): Power Attack\n17: Ranger(4)\n19: Ranger(6)\n21: Fighter(8): Epic Weapon Focus, Epic Weapon Specialization\n23: Ranger(8)\n25: Ranger(10): Favored Enemy III\n27: Ranger(12): Great Strength I, (STR=22)\n29: Ranger(14)\n31: Ranger(16)\n33: Ranger(18): Armor Skin\n35: Ranger(20): Favored Enemy V\n37: Ranger(22)\n39: Ranger(24): Epic Prowess\n\nSkillpoints: 228\nSaving Throw bonuses: \nAB (max, naked): 43 (melee), 32 (ranged)\nSpell Casting: Ranger(4)\n\n\n02: Discipline(5), Save(7), \n04: Discipline(1), Save(13), \n06: Discipline(1), Listen(5), Save(8), \n08: Discipline(1), Save(4), \n10: Discipline(1), Listen(1), Save(6), \n12: Discipline(1), Listen(1), Save(10), \n14: Discipline(1), Listen(1), Save(14), \n16: Discipline(1), Hide(6), Listen(1), Move Silently(6), Save(8), \n18: Discipline(1), Hide(2), Listen(1), Move Silently(2), \n20: Discipline(1), Save(3), \n22: Discipline(1), Hide(3), Listen(3), Move Silently(3), Save(2), \n24: Discipline(1), Hide(2), Listen(1), Move Silently(2), Save(2), \n26: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(6), \n28: Discipline(1), Hide(1), Listen(1), Move Silently(1), Tumble(5), \n30: Discipline(1), Hide(2), Listen(1), Move Silently(2), \n32: Discipline(1), Hide(2), Listen(1), Move Silently(1), Save(1), \n34: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(5), \n36: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(9), \n38: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(13), \n40: Discipline(1), Hide(1), Listen(1), Move Silently(1), Save(7), \n</details></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:16 PM - Feb 11, 2020",
      "content": "<div>Dual wielding rangers with dex 14 can dual-wield without the need for dex 15 for Ambidexterity. Dex 14 also ends up at dex 26 when capped. That is a +8 dex bonus to AC, fitting padded armor perfectly. Of course this dex based AC works better in a build with Uncanny dodge.<br/>\n<br/>\nBoth saves, especially the will save, and AC is a challenge with this build. In a high magical environment AC often becomes less important because AC from 4 or 5 different sources (armor, deflection, natural, dodge and shield) soon add up and surpass the possible AB bonus from buffs and on a weapon. It will be interesting to see how this character fares in a PW like WoG with mid magic equipment.<br/>\nThe will save is a real achilles' heel that needs to be covered somehow. Immunity to mind effects as an item property is desirable, but stacks of clarity potions can help you out.<br/>\nThe way I see it this character is a glass cannon - but what a cannon!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:27 PM - Feb 11, 2020",
      "content": "<div>Well, having played Rangers on WoG, I can say this :<br/>\n<br/>\nAC is DEFINITELY a major problem - which either relegated my Ranger into full Armor+Shield, or into Archery (long range) glass cannon territory.<br/>\n<br/>\nBoth being very valid and solid builds, btw.<br/>\n<br/>\nGoing toe-to-toe in anything else was basically suicide - one then really needs something to lock down that AC - some Barb, Rog, Ass for that sweet Uncanny Dodge.<br/>\n<br/>\nEven then I was running into some difficulties - better to go Dex based then and no Armor at all (if that AC can be locked down with UD).<br/>\n<br/>\nSecond, being on WoG, not having UMD is ouch!  Major Ouch!  I would really not recommend it for solo play.<br/>\n<br/>\nOne thing about this build, if one went 1/2 Orc, one gets Double Axe prof free - which would give +2 Str (but would hit some other vitals, so...)  Just sayin'.<br/>\n<br/>\nI personally love the Ranger class, but one should really be aware of the huge challenges in building and playing one.</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "6:10 PM - Feb 11, 2020",
      "content": "<div>Sometimes the best defense is a good offense. However, it takes only a minor investment to attain Ranger spells. And Rangers have a worthwhile spellset. Cats grace, aid, blade thirst, freedom, prot. from elements, and ultravision. Even their camouflage line of spells is useful. You could drop Dex to 10, raise Wis to 14, wear full plate and cover you dex decrease with cats grace. No loss in AC. No loss in AB. Net +2 to Will saves, and now you have a spell set. <br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "MortusMaximus",
      "avatar": "no_avatar.png",
      "timestamp": "7:57 PM - Feb 11, 2020",
      "content": "<div>Wow, not even 24 hours and already alot of feedback, and even the famed dwarflord himself! Thank you for taking the time to look over my build. Some of the points made so far I've thought about in the months of theory crafting/playtesting, and I'd like to offer my thoughts on some of them, and see if my reasoning is flawed or if I'm just undervaluing certain aspects of the classes (specifically ranger spells).<br/>\n<br/>\nOrion<br/>\n<br/>\nThank you personally for encouraging me to post the build, I've already enjoyed the process of creating the character, and am enjoying the chance to talk about it with masters of the craft more than I can express.<br/>\nAs far as your points go, I had originally played around with stats that allowed me to get Ranger spells, but found them to be lackluster, and all around outclassed by magic items/potions. From what I can gather, and using the stat spread put forward by Zanithar (my original stat spread for the build in fact), going for Ranger spells gets the obvious lvl 4 spells, and +2 base will saves. Along with the spells is a 25 turn +1 to AB/Saves in aid. Doing so however, loses 1 from max hit, 1 from Dev Crit DC, 1 AB (if not factoring Aid), 40 skillpoints, and an AC point. To me it's not a worthwhile trade, unless I'm running it completely solo. At that point the spells would be mandatory, as they would increase survivability too much to pass up. In a party setting however, I just don't see the need when there will almost always be one buffer who will outstrip the rangers ability regardless. Lastly the build is extremely feat starved, going for dev Crit and weapon master limits the ability to take knockdown. Trading blindfight makes it all the more susceptible to invisible creatures, and I just don't see how that can really be worthwhile on a character already lacking in the defense department.<br/>\n<br/>\nZanithar<br/>\n<br/>\nThat was my original stat spread for version 1 of this build! The build still functions with your spread, however I did have some things that I'm a little confused on. Losing the str point but adding epic prowess results in a +/-0 AB, but a -1 to damage values, and the Dev Crit DC. Granted the one DC might not make a huge difference, but still having any negatives in the trade leaves a bad taste in my mouth. Armor skin runs into the same issue, only worse in some ways, with the odd Dex score it results in a +/-0 AC but -1 to Reflex saves. Idk where the +2 in your post was from, but I can't find a way to get it from the build. The bonuses from Aid can be useful, and are actually the only thing you actually gain from the trade, resulting in +/-0 reflex, +3 will and +1 Fort and AB for 25 rounds. But the same thing can be gained from a party members Aid which will likely last longer, or even from a scroll or potion even if for a much shorter duration. Personally running in a party for most if not all of my time it seems lackluster at best. The changes to Ranger spells you mentioned are intriguing, would WoG happen to be a server that has adopted these changes? If so that might sway me more towards wanting the spells, but atm I'd really only consider it if I was going to run solo for extended periods of time. I also didn't mention the loss of a favored enemy in the epic prowess pickup, personally it just weighs the argument further towards it being irrelevant and not useful for the build. The extra favored enemy just gives more chances for bane to proc and an even higher bonus than the one granted by epic prowess.<br/>\n<br/>\nMick Dagger<br/>\n<br/>\nThose were my exact reasons for going for 14 Dex, making Padded Armor the most efficient, and trying to minimize the loss of heavy armor as much as I could. The lack of Uncanny Dodge is regrettable, but at least against Invisible creatures blind fight and listen can reduce the odds of being flat footed. The rest of the time it's rough, but still doable if playing smartly. The AC and saves are abysmal for most of the builds life until decent magic items are obtained to round them out. However I rarely find myself adventuring alone, and find potions/magic items can help me fill the gaps I'm missing most other times. The build suffers solo, but thrives in a party of 2 or more. And yes, a glass cannon for sure, but a big one.<br/>\n<br/>\nWebShaman<br/>\n<br/>\nAs stated previously, AC is a big issue for the build, but one that can be worked around if played correctly. Animal companion, charmed animals, other party members or even the terrain and enemies can all be manipulated to reduce the risk of being surrounded or caught outside of a 1v1. In a 1v1, this build should be able to out damage the opponents due to sheer APR and damage output on each hit. Lack of Uncanny Dodge is again a hindrance, but again one I feel can be worked around with intelligent play. I was unaware UMD was so mandatory for WoG. Is it a matter of using wands/scrolls or are items often class locked? The build is playable solo, it just requires ALOT more patience and setup. It definitely shines more in a party setting however. As far as the half-orc goes, I had the exact same conversation with my dad while theorycrafting the character. The +2 Str is negated by the -2 Int, making ability scores a net +/-0. Free Double Axe Prof replaces the human bonus feat, again a net +/-0. The only thing the half orc gets is Darkvision in exchange for 40 skillpoints, which personally I don't think is worth. I would like to hear any suggestions you have as a ranger on WoG though, favored enemy suggestions or other things to look for would be much appreciated.<br/>\n<br/>\nGrizzled Dwarflord<br/>\n<br/>\nThe man, the myth, the legend. I grew up looking at your builds in awe and wondering if I could make something even close to your level. Seeing your comment on the build made me smile for an hour. The contents though confuse me slightly. I feel like I've definitely undervalued the ranger spells since it's be a point from each commenter, but the trades you have outlined don't match the builds goals at all. Dropping Dex lowers reflex by 2, an arguably harder save to comp for than will. Wearing full plate negated all of the TWF feats, resulting in a huge AB loss and an entire APR. At that point I'd rather take an 80 hp loss in order to gain the spells, dropping Con by 4 instead. <br/>\n<br/>\n<br/>\n<br/>\nHopefully I hit on most of the points made so far, and hopefully my reasoning makes some sense. I've had to type all of this on my phone, so I might have missed something somewhere, but anything that I'm wrong about or that I might be valuing differently please feel free to let me know! I love these kinds of conversations and learning more about this game I've loved since childhood. Thank you again for your time, hopefully I can get more feedback/knowledge for the build.<br/>\n<br/>\nKey questions: <br/>\nAre the ranger spells worth as much in a party setting vs. solo?<br/>\nHow much are the spells worth if left vanilla (no changes to how they work)?<br/>\nWhat changes (if any) have been made to the ranger spells on WoG that would make them more valuable?<br/>\n<br/>\n<br/>\nSent from my Pixel 3 XL using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "8:47 PM - Feb 11, 2020",
      "content": "<div>Doh. Was thinking you got ITWF from your fighter levels. Scratch that thought.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:36 PM - Feb 11, 2020",
      "content": "<div>WoG<br/>\n<br/>\nFEs, I always take <br/>\nGoblins (good up into low Epics), Undead (good to level 40),<br/>\nGiants (Good to upper Epics), <br/>\nHumans (good to upper Epics),<br/>\nElves (because of Drow, mainly).<br/>\n<br/>\nThose I always take, and in that order.<br/>\n<br/>\nAny others, I would say choose as one will.<br/>\n<br/>\nAs for the Animal Companion, you will find out very fast on WoG that it will last about...1~2 rounds, atm.  I don't use them any more, because it is futile.<br/>\n<br/>\nOne can try - and buff them  and give them items, etc, to try to make them more durable, more effective.<br/>\n<br/>\nIt just is not enough.<br/>\n<br/>\nThey are just really good for distracting enemies for abit.<br/>\n<br/>\nEspecially at higher levels.<br/>\n<br/>\nAs for spells, as GD has pointed out, Grease, Pro. from Ele., Cat's Grace, etc are pretty good if you get the CL at or above 24 (non-dispellable).<br/>\n<br/>\nBlade Thirst is REALLY good, has been buffed to go to +5 enhancement, can be applied to bows, etc.<br/>\n<br/>\nBasically GMW, but for Rangers.<br/>\n<br/>\nUMD is powerful on WoG for Wand, scroll, and item use reasons.<br/>\n<br/>\nEspecially for Wands of Lesser Breach, esp. for Melee orientated builds (because of damage shields).<br/>\nOwtL and MC are only good above ground, so I rarely use them - I normally only have ranged Rangers. YMMV.<br/>\n<br/>\nI do have one melee based Ranger, but as it is a kama monk Ranger, it is a bit different.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "9:54 PM - Feb 11, 2020",
      "content": "<div>I’ll drop a quick update in now, more to follow later.<br/>\n<br/>\n1. Blade Thirst has been minimally buffed on WoG.  It is basically a weaker (but still viable) version of Greater Magic Weapon (you are still better off with GMW).  NOTE: we should not discuss WoG specific stuff here, which is why I did not, the admins get grumpy and WebShaman should know better by now.<br/>\n&lt;add strike when not on phone&gt;2. Dex AC is only something you should be building towards IF you can lock it in with Uncanny Dodge or Defensive Awareness.  This build has neither, as such you should be wearing the best possible medium armor you can get ... not padded armor ... ever.  Meaning a focus on 14 Dex is not a mechanically sound one.  Get your Dex to 13 to net the WM required feats, 14 if you have a spare point for quality of life.&lt;/strike&gt;<br/>\n<br/>\nThis is an extremely situational build, others have referred to it as a glass cannon build.  I would counter and state it is a situationally glass cannon.  Meaning, for half the fights on any persistent world it will be a weak damage build and for the other half it will be weaker than a WM/Fi/Ro build (especially in a party).<br/>\n<br/>\nIt offers two advantages over a WM/Fi/Ro build.  <br/>\n1. It can “situationally” apply its feat bonus to things that are Critical Immune (assuming it takes the appropriate Favored Enemy).<br/>\n2. It can self buff and perform better solo.<br/>\n<br/>\nYour build removes one of these two advantages meaning, you will be more useful to a party when fighting undead.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "10:24 PM - Feb 11, 2020",
      "content": "<div>Rangers can only dual-wield in light armor or robes, heavy armor and medium armor are bad choices for this build. Even without Uncanny Dodge this build will lose at most 8 DEX AC, and since it already has terrible AC most opponents will hit it anyway if it is caught flatfooted. Avoiding flatfootedness in combat is pretty easy, although the lack of FoM due to the low WIS might cause some issues.<br/>\n<br/>\nA very minor correction to the initial post, this build gets +4d6 Massive Criticals from OC not +3d6.</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "10:41 PM - Feb 11, 2020",
      "content": "<div>Fair enough, it is worse than I thought/remembered.<br/>\n<br/>\nI have to say, I find it exceeding frustrating that there are no decent Strength Ranger Dual Wield options in NWN.  Such lovely strength weapons and you need to be a glass cannon to use them.<br/>\n<br/>\nI will say 8 AC is not to be trivialized.  That is a lot and that is just the armor related Dodge AC.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:39 PM - Feb 11, 2020",
      "content": "<div>Sorry about the WoG reference, but as he is playing this build there, I thought I would address his questions in relation to that.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "11:51 PM - Feb 11, 2020",
      "content": "<div>Orion,<br/>\nBuild us a low AC EDR version pretty please.  I am at work :)<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:16 AM - Feb 12, 2020",
      "content": "<div>I think the build is fine in a party, buffed up its a monster, add a tank into the picture and one is going to have a great time. <br/>\n<br/>\nJust solo it has troubles. I would probably drop Weapon Master if I was solo, it soaks up so many feats and requirements including Dex 13 / Int 13. <br/>\n<br/>\nI would swap the class for Rogue for Evasion, Uncanny Dodge and Tumble 40/UMD/Disable Trap.<br/>\n<br/>\nAn EDR III ITWF Dev Crit ranger is not a bad idea, I'm happy to look into it. I'm keen to learn how to build Rangers well.</div>"
    },
    {
      "author": "Zanithar",
      "avatar": "10759190_1575525433.jpg",
      "timestamp": "12:20 AM - Feb 12, 2020",
      "content": "<div>I’ll build one when I get home, after date night tonight because I too am curious.  Strength build Dual Weapon on Ranger chassis has<br/>\nVery polarised Str/Weakness.  <br/>\n<br/>\nEDR May shore up the troublesome bits enough to make it interesting.<br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk</div>"
    },
    {
      "author": "Yunim",
      "avatar": "10759176_1572007808.png",
      "timestamp": "12:25 AM - Feb 12, 2020",
      "content": "<div>A dual-wielding Rang26/Bard4/PM10 with Dev Crit and EDR3 is doable but with that build it's best to go for Dev Crit or EDR3, not both. It would probably be best to discuss that build in a different thread though.</div>"
    }
  ]
}