{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "102",
  "name": "Druid/monk/rogue Totem path build for Arelith",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/druid-monk-rogue-totem-path-build-for-arelith-t2354645.html",
  "author": "FoodEater",
  "avatar": "no_avatar.png",
  "replies": "3",
  "views": "2.5K",
  "posts": [
    {
      "author": "FoodEater",
      "avatar": "no_avatar.png",
      "timestamp": "1:42 PM - Dec 03, 2016",
      "content": "<div>Greetings.<br/>\n<br/>\n I'm requesting some help at this druid im going to create in Arelith (max level 30)<br/>\n<br/>\n I want to create a druid caster that is going to be unarmed, will have summon companions, disabling traps and opening locks and going to take the totem path and shape as a raven (+4 wisdom +10 lore)<br/>\n therefore the spells im choosing would be something to improve my attacks or defence. (magic school Conjuration?)<br/>\n Im going to battle with the raven shape, is Improved unarmed strike going to effect on this?<br/>\n Is it good to take monk levels to gain attack speeds?<br/>\n<br/>\n Is Druid/monk/rogue good combination? (rogue because of Open lock and Disable traps Class skill)<br/>\n<br/>\n<br/>\n Any help would be greatly appreciated!<br/>\n  </div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:20 PM - Dec 03, 2016",
      "content": "<div><span style=\"font-size:150%;line-height:normal\"><em><strong><span style=\"color:#0000FF\">WELCOME!</span></strong></em></span><br/>\n<br/>\n Monk is the way to go for unarmed (non-shifter) polymorphs. IAS you get for free at monk 1.  For unarmed shapes, monks main advantage is the UBAB -3 progression.  The WIS AC and monk speed (at monk 3) is also a big help.  Of all the combat feats only ImpCrit Unarmed and Epic Prowess affect the shapes's unarmed attack. (Also Overwhelming critical if you happen to be building high-STR which this toon will not be able to do with the high casting requirements, WIS 17+)<br/>\n<br/>\n I recommend trying to fit in 6 levels of monk for the most value and get IKD, +1AC and 10% more move speed.  On Arelith that would be something like 4 Monk during pre-epic and 2 more Monk during epic levels. Yes, it will have a negative impact on your spell penetration so decide if you want to \"risk\" any more than 3 levels (you are going to need at least 1 more late tumble dump as well).<br/>\n<br/>\n You do NOT need to take rogue levels to gain rogue skills, especially if you focus on DEX for your native (druid) form. I know nothing about raven form because it is a custom shape that Arelith uses. Your shapes can use all the trap and lock skills while polymorphed except they cannot recover traps or use lockpicks. You'll only need rogue levels to deal with epic traps. But that will further gimp your caster abilities down to dru24/mnk3/rog3.  If epic traps is not your goal, you can easily cross-class your rogue skills (including Search) to do what you want.<br/>\n<br/>\n Be aware, though, that the druid wild shape merge is extremely poor (only armor/shield/helmet merge) so you'll need to self-buff to gain significant boosts or protections.  Maybe Arelith has also changed the rules about polymorphing, though.  You'll need to check into it yourself.<br/>\n<br/>\n  </div>"
    },
    {
      "author": "FoodEater",
      "avatar": "no_avatar.png",
      "timestamp": "5:31 PM - Dec 03, 2016",
      "content": "<div>Thanks for the quick reply!<br/>\n Few questions,<br/>\n<br/>\n If I dont take rogue class, im unable to add skills for example to Open lock, as a (class skill), therefore it takes 2 points to increase such skill.<br/>\n Also what you mean by IKD, as improved knockdown?<br/>\n<br/>\n Im also wondering when I choose the totem path for raven (+4wis +10lore) and when I check my stats at the game, the wisdom points arent increased at all, even though polymorphed..<br/>\n<br/>\n Doesn't weapon focus (unarmed strike) have effect when polymorphed? What about expertice (giving +5 to AC and reduces attack roll by 5)? What about improved unarmed strike, no effect?</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:59 PM - Dec 03, 2016",
      "content": "<div><blockquote><div><strong>FoodEater wrote:</strong><hr/>If i dont take rogue class, im unable to add skills for example to Open lock, as a (class skill), therefore it takes 2 points to increase such skill.<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n Yup.  All that's needed to disarm all traps with DC&lt;36 is 11 ranks.  All that is needed to Set all traps except gas is 15 ranks.  15 Ranks of Pick Lock will disarm DCs of 35 or less.  Then add the INT modifier to Disable traps and the DEX modifier to Set Traps and Pick Locks to extend the potential even further. These levels are easily reached by cross-classing those skills.\n<blockquote><div>Also what you mean by IKD, as improved knockdown?</div></blockquote>\n Yes.  6 Levels of monk net your toon cleave, kd/ikd, evasion, FoB, stunning fist and a litany or other benefits.\n<blockquote><div>Yes the wisdom is going to be high on this character so I gain AC advantage of taking monk levels?</div></blockquote>\n Monk 1 is enough to get WIS AC benefit.\n<blockquote><div>Could Druid/monk/cleric be a good build? as a cleric, i also benefit from wisdom score.. could use some protective and attack increasing spells from cleric..</div></blockquote>\n Once you start to dilute your primary casting class, druid, your spell casting begins to suffer.  Cleric is a superior self-buffing class but cannot polymorph except for Polymorph Self with Animal Domain.  That polymorph can be dispelled.  Wild Shape can not.  As a caster using buffs and protections, you want to achieve relative immunity to being dispelled at Level 24 caster (Mords dispel all caster levels on a Level 30 cap server.).\n<blockquote><div>\n Im also wondering when I choose the totem path for raven (+4wis +10lore) and when I check my stats at the game, the wisdom points arent increased at all, even though polymorphed..<br/>\n<br/>\n Though, if I choose parrot as my totem, I gain +4 charisma, could I benefit from this somehow on this build?</div></blockquote>\n I can't imagine any situation that a boost to CHA would help a druid except perhaps a druid/bard.  Monk is still a much, much better secondary dump class.<br/>\n<br/>\n As far as the stacking goes, I found this on the Arelith wiki:\n<blockquote><div><strong>\"Current bugs</strong><br/>\n<br/>\n Bonus stats characters get from taking the initial token are supposed to stack with what they have from the totem. Right now totem druids will not get additional +4 Dex in panther form.<br/>\n<br/>\n \"Yes, you should get +4 dex in panther form. I'm aware that there are some issues with properties copying across forms, which I haven't yet had a chance to investigate.\"Mithreas<br/>\n<br/>\n<strong>Stats bonuses on items</strong> will override (not stack with) bonuses that totem druids get from their selection of totem. This issue is known and under investigation by developers. This occurs only in animal form; stats bonuses in original humanoid form work fine.\"<br/>\n  </div></blockquote>\n  \n<blockquote><div>Doesn't weapon focus (unarmed strike) have effect when polymorphed?</div></blockquote>\n<div align=\"left\">Nope. Neither does EWF. Neither does WS or EWS. It works as I stated unless your server has changed the NWN rules. Check the <strong><a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Dragon_shape\" rel=\"noreferrer\" target=\"_blank\">Dragon Shape article</a></strong> where most of this is discussed and clarified.<br/>\n<br/>\n<em>edit: added some Totem info from the Arelith Wiki</em></div></div>"
    }
  ]
}