{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "025",
  "name": "Avado's cleric tome",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/avado-s-cleric-tome-t515465.html",
  "author": "conlaoch",
  "avatar": "10235240_1510287070.jpg",
  "replies": 29,
  "posts": [
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "4:47 PM - Sep 13, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">After reading Max's Clerical Insights, I wondered if I could also find Avado's old guide.  Here it is...<br/>\n-----------------------------------------<br/>\n<blockquote><div>Quote: Posted 01/16/09 07:12 (GMT) -- FinneousPJ<br/>\n<br/>\nSo maybe you should help the guy?</div></blockquote>\n\nI was asked to “help”, so this is my contribution.<br/>\n<br/>\nAs many know, I adore the cleric class. I have played just about every class (cept HS), In all my time, I found the cleric to be the most versatile and, for me enjoyable. It is my hope that with this small bit of info, you will gain as I have. And for the record, clerics are strong. If you are only a mod player, most of this will be overkill. I only really played on pw’s that are considered hard, or party servers. The main server I really learned on, was one where builds like the Exalted Sorc, Undead lord, Puff the dragon, or Blade juggernaut were developed. I know, today, there are more elegant ways of achieving the results, but these were the first of their kind, and the server was where they were tested (I briefly (bout 30mins) chatted with cd in a game one time, which was really cool to get his perspective, as short lived as it was).<br/>\n<br/>\nNow, I wish I could take credit for this, but alas, I cannot. I was taught ingame by a gent, one Stryder Blade. On a server where the final boss requires a forum post for a party time, he did it alone, for the fun of it. So, Stryder, wherever you are, THANKS! I am sure there is a lot to your strategy for the cleric, this by no means is exhaustive. It is just some really good info that makes the cleric the chosen one I have been touting all along!<br/>\n<br/>\n<strong>Concept 1: HERDING</strong><br/>\n<br/>\nThis is a name I came up with to describe what it is that I do. It is a pretty scary idea, especially if you don’t have faith in your cleric, but I assure you, there is a reason. <br/>\n<br/>\nThe cleric has a unique role in nwn. A cleric ISNT a caster. He is a meleer with spell support. There will be many who argue this, that is ok. Clerics do not have the variety of offensive magic that a wiz has, thus, they REQUIRE getting their hands dirty every once and a while. With this in mind, we DO have some offensive magic spells to use, but to use them most efficiently, we need a lot of targets in a relatively small space (I guess wiz/sorcs herd too).<br/>\n<br/>\nTo herd, when you enter an area, you want to spawn the entire area of monsters. The tricky part is to get them all to follow you and not get killed! I DON’T recommend doing this the FIRST time you enter an area. You need to know the layout, and you need to know the monsters before you can herd properly. I say that and laugh, as I am sure dekes, Stryder or Abuck can tell you I rarely listened to my own advice and wound up on the receiving end of a res spell. Thanks guys/gal.<br/>\n<br/>\nWhat you are trying to do is get 10-20 or the entire spawn area to come to one location where you will stand in the middle of the bunch and, well, be a cleric. Like I said, this isn’t an easy thing to do. It is a scary process to see 15 umber hulks coming at you, but this is where your faith in the AC and ability of your cleric come in. Practice and you will get the hang of it.<br/>\n<br/>\n<strong>Concept 2: Spell Book Management</strong><br/>\n<br/>\nThis is an area which is missed by a lot of players. I didn’t understand it for the longest time. Basically, with a cleric, you don’t look at the metamagic feats for what they do, but more, what they offer. Yes, extend is a very nice feat, and EVERY cleric should have it, but what does it do vs what does it offer. Extend doubles the duration of your spell (cept for div fav  ) In this case, they are the same. In my very humble opinion, if you are a cleric without extend, EVEN if you are lv 40 pure, you are short changing yourself.<br/>\n<br/>\nThe next important one is Empower. It increases the output of a spell. WHAT it offers is to cast a spell 2 slots higher. Again, if you have the room, it is more desirable than Max spell because you cant maximize the boss killer (I wont give that away yet).<br/>\n<br/>\nMax spell is good, but if I were to take a 3rd meta feat, it would be either silent or still. WHAT! Why on earth would a cleric look at still? It is for what it offers! While extend offers one slot higher, it is limited to what spells are offered. Still or silent offer ALL the cleric spells one slot higher. I tend to lean toward silent, but if I am a bard/.clerc/rdd or pm, I would go still if charisma was 11 or so. Either is a good 3rd choice. I have done, what I would term a caster cleric (I know what I said), but my intent was to use spells more than melee, I would take max. That was for the necro spell to slaughter undead en-mass. <br/>\n<br/>\nThe idea is to leave yourself options for spells. For example, if I was going to a major undead server, I would take max. That gives me 4 slots of undead to death (normal, silent, empower, max). That is options! Silent gives you 2 slots of heal/harm (normal/ silent). See where I am going?<br/>\n<br/>\n<strong>Concept 3: Harm</strong><br/>\n<br/>\nAnd for undeads. Heal. This is really a rookie spell. Yes, it is a great way to take out certain things, but, despite what people think, it IS resistable. Many a time, I have cast this spell and had it resisted, even with my cleric/hierophant (prc with +10 to all DC). So, if in the extreme case it can be resisted, it isn’t a good spell to rely on. <br/>\n<br/>\nWe use harm for those areas where the experience is good, but the monsters are long and tedious to take out. You know the 1000 hp + monsters where you have 10 of them ontop of you? I have nightmares of umber hulks all around us on a hill side and missing a harm here and there.. Harm should be used to speed xp, not to rely on for anything else. LOL yes, harm is the lazy man’s leveling tool, and I am a lazy man at times (ask my wife  ) <br/>\n<br/>\n<strong>Concept 4: IMPLOSION</strong><br/>\n<br/>\nK, YES, implosion gets +3 to spell DC, innate. Big deal. I originally did my Beest build (the ultimate cleric listed in prc section), and he had a 46 dc with implode. 46 for those who are wondering, with 20 base wisdom is CRAZY! It is higher than you can get in vanilla nwn. I didn’t use the spell but one time to try out. I found my strategies below to be much more effective, though, if you like the spell, use it. Remember its an Evocation spell so spell foci in that.<br/>\n<br/>\n<strong>Concept 5: Cleric’s role</strong><br/>\n<br/>\nA cleric should be right up front. You are in Full plate (at least you should be) with a tower shield. You have +10 minimum ab boost, ac boosts. Why on earth would you be behind “healing”? When I speak of this, realize I very rarely have higher than 10 in constitution. Clerics can boost con, so why waste the points.<br/>\n<br/>\nI have played both wisdom clerics and strength clerics, and while I can appreciate a charisma cleric, I have never played one. In my view, going higher than 20 wisdom base is a waste. Yes, having a higher DC is nice, but remember, you are not really a caster. I prefer strength clerics. There is something oh so sexy about a cleric that has level 9 spells AND devastating critical. That is my opinion, but a high strength is best. Why? You are a cleric with ¾ ab. This means we need all the ab we can get (the +10 min goes ONTOP of the ab!). <br/>\n<br/>\nSo you are out in front, first to the scene. Remember to buff first! LOL<br/>\n<br/>\nThose are really the 4 things that I ingrain in my playing with clerics. If I cut anything short, let me know and I will elaborate the best I can. So, the above is the mindset, how do you play a cleric?<br/>\n<br/>\n<strong>BUFFING</strong><br/>\n<br/>\nYou have to get your own feel for what a cleric can do for you. I have found that I only really use Divine Favor in the level 1 spells. Sometimes, entropic shield, or shield of faith (it ONLY has +5 deflection, so a ring of prot +6 negates it). The lv 2 buffs I usually extend (lv 3). So my spellbook has lv 1 and 2 slots as divine favor (up to as many as 18 at a time – yes its that good).<br/>\n<br/>\nI have never fallen in love with Bless, aid or prayer. I have used prayer abit cuz its lv 3 iirc (yes I am doing this all from memory). Battletide is another that is decent, especially extended. And of course, darkfire, greater magic weapon, and magic vestment *2 (armor and shield). <br/>\n<br/>\nDivine Power… the BEST spell in the game. I understand it has been tweaked downward. No matter. It gives you an AB boost which is essential. Stryder, when I pointed this out to him, he actually designed a cleric with 12 bab (cleric rdd) that had +7 to ab when he cast DP! LOL It is THAT good. Today, I tend to lean toward 4 apr, 16 bab cleric where it will add +4 ab. It is up to you.<br/>\n<br/>\nIt is important to look at durations. Extend DP is great cuz it allows you to fight more than one battle before it wears out, where DF has 1 turn regardless, hence the excessive number I carry. The real fun is to try to get the number of DP to match the DF. I always seem to have more DP cuz they last longer. If you are bored, this may be a way to adjust your spell book. DF is cast usually every battle, and I always am watching my buffs cuz sometimes you may need a recast in the middle of a combat!<br/>\n<br/>\nSo what are my tactics? Thanks to onion eater, here is a quote from him regarding the strategies.<br/>\n<blockquote><div>Quote: Sent 01/16/09 09:21 (GMT) by onion eater<br/>\n<br/>\nOh yeah. Totally thrilled ... I've taken out some bosses way outside my level range w/ the spell, but always through gross repetition. Can't wait to put down four or five at a time. Heck, why not get some scrolls involved too? IIRC, they're pretty cheap, and not a totally worthless caster level … soon enough I'll have another cleric ready to take advantage of the tactic. Cool stuff.\n</div></blockquote>\n\nI cut out some of the stuff that were irrelevant to the topic (and some spoiler stuff!). thanks buddy.<br/>\n<br/>\nThese are best taught in game, like how Stryder taught me, but I don’t play anymore, so.. i sincerely hope you can glean the jist of what i am saying here...<br/>\n<br/>\n<strong>Mass Kill Strategy</strong><br/>\n<br/>\nThis is the one where you Herd. For this, you need to use Storm of Vengence (SOV) and for non-undeadies, Firestorm. I typically had 6-7 SOV and same firestorms memd before entering an area. The first step is to herd all the baddies to an area where they can see you and continue to move towards you. It takes practice, but it is well worth it. I mastered this strategy in a Golem area on the mountain, and had as many as 20 golems coming at me at one time (they are immune to crits, which is why I took this area to master). In normal gameplay, all crit immune, this area would take some time to clear out, up to 20 mins with a party. In herding, I had them all in one area.<br/>\n<br/>\nMake a stand (I envision Gandalf in fellowship, “This far and no farther!”) and WAIT. Wait for them to come to you and start swinging. You need to have some AC to make this work, but at any level, a cleric should have no AC problems. Once they are surrounding you, I cast an SOV. Once that is away, I would cast all the rest of my SOV, SOV is a wonderful spell. It does alittle damage, and stuns, but it does alittle damage. Having 6 SOV’s means the monsters in the area have to roll 6 times per damage type to not be stunned. This goes on for 10 rounds. As soon as SOV is done, some near you will be stunned, allowing you to cast Firestorm in rapid succession. All 6! You can hold back firestorms but you should only start this process when they are almost upon you. NEVER WASTE (another cleric motto).<br/>\nAfter this, you may have a few left, but the entire area is done in under 5 mins. <br/>\n<br/>\nFor undeads, it is alittle different. On the mountain, there is an area called Epic Undead. Most people HATE that area. I kept my port to here for about a month, I loved it so much. I actually went here at lv 28 where most parties go here at lv 33 or more AND STRUGGLE.<br/>\nThe strategy is similar. Because Mass Heal doesn’t have the area of effect that Firestorm has, you don’t want to go and collect the entire area. That would be suicide. I typically herded about 10 epic undeads (for those from the mountain they didn’t believe me until they saw it). Now, lay down an SOV. Then maybe 3 more (not as many) you don’t need as much as mass heal is different.. As they surround you, cast a mass heal. Then ATTACK the wounded ones asap. The undeadies I fought had a “heal” so I didnt want to waste 3 mass heals and they simply heal. They will typically have 4 hp, so there shouldn’t be much work to do. Then recast mass and repeat with your mace. It is slower, but they are undeads! I guess you could use firestorm, but mass heal vs undeads is WAY better, imo. <br/>\n<br/>\nIn summary, the whole idea is to get them closing in on you. I always had the feeling that I wasn’t gonna survive! And then I did. I always found that, unless your party knew exactly what you were doing, this strategy works best solo. Now, if something happens and you die… you are stuck! LOL Experiment and have fun. This strategy works well. Like a mentor of mine says, it isn’t the method but the man if the strategy doesn’t work for you <br/>\n<br/>\n<br/>\n<strong>THE BOSS KILLER!</strong><br/>\n<br/>\nYes, I am here. The boss killer. I thanked Stryder everyday for showing me this one! It is that good.<br/>\nOn the mountain, there was this little boss, frost goblin king, who was for the lv 29 quest. If you weren’t a sorc/wiz, you usually waited until 34 or so to do the quest, and then, ONLY with at least one other, and hopefully more. I am not certain what exactly it was about him, all I know is that you couldn’t hit him (even figher.wms had a struggle) and he had heals so it was a LONNNG battle. This is the guy I was taught this strategy on (the one onion brags about above!).<br/>\n<br/>\nThe spell is……….. Blade Barrier! Ta da! <br/>\n<br/>\nWHAT?? I can see your frustration! This is the big spell avado talks so much about, BB! Are you serious? I know cuz I said the same exact thing, and YES, I am totally serious. BB is the number one boss killer spell in nwn and there is really nothing that can be done to stop it.<br/>\n<br/>\nBut BB does only a pitiful amount of damage? Yes it does. So? What has been my strategy up until now? Mass damage, right? Well, cast a bunch of BB’s at one time! Sure. You can do that. What happens? <br/>\nPeople do this and they lay a blade here, one here, one there and so on. The target then steps on the blades and does a save. IF he makes it, no damage. Hmm.. not too good. Or is it? What happens if every time the target crosses the blade he does, not 1 but 12 saves? What are the odds NOW that he will save? A LOT less, right? Right  and here is where the power lies. It isn’t in the spell itself, but the way you cast the spell. Our mindset is to make the bastards roll as many times per step as you can (no this is NOT a pvp strategy! Lmao. I did it one time for fun and drakkon just laughed!).<br/>\n<br/>\nHere is the secret: hold the cursor over an area and cast BB. THEN DON’T MOVE THE cursor and cast another bb or another 12! I usually have bb, ext or silent BB and Empowered BB for boss fights, up to 18 or so. You don’t really need more than 8 BB, but you can do more. When you have cast the BB’s, you should see only ONE line of blades. They will look fuller than one line, but it is only ONE line. <br/>\n<br/>\nNow, get the boss’ attention and have him follow you through the blades. EVERY step he does in the blades he is rollin 8 times! Or however many you put down. This will not kill him (if it does in one pass, shame on you!). The next part is really technical. Keep him running in or through the BB as much as possible (every step he is rolling vs damage). He will die! Like onion says above, he is taking out bosses above his level! There is no AC worry, no AB worries. <br/>\n<br/>\nThere is one danger, spell resistance. I have seen a boss resist BB for a bit, iirc. I know Kail or Finn will correct this for me, as in this I am going entirely by memory. But I do recall seeing a boss resist the BB for a time. If I am wrong that is cool. It is just something to be aware of.<br/>\n<br/>\nPrefered running patterns.. LOL I like doing S shapes through the blades. It is especially nice to run the lengths of the blades. Side to side is good too. Remember, the whole idea is to make him roll for damage.<br/>\n_____________<br/>\n<br/>\nSo, there it is. .avado’s guide to clerics. I am sure that there are things you can argue against. SO what. I actually LIVED this in game for several years vs some of the hardest areas, solo, and lived. I was taught by the best, and now I pass it on. I really didn’t want to do it! I had shared this with a few in game and none could understand what was doing. I hope this helps clear up their thoughts, as well as brings you some understanding of this versatile class.<br/>\n<br/>\n<br/>\n---------------------------------<br/>\n<br/>\nBetween this guide and Max's tome of knowledge, this should help me get a cleric to stay alive long enough to enjoy em..<br/>\n<br/>\n<br/>\nConlaoch<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "11:06 PM - Sep 13, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Where did you find that!  LOL  Thanks.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "2:56 AM - Sep 14, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I just searched for \"Avado cleric guide\" and grimnir had saved it to a different board.  I just cut and pasted and reformatted it for here...<br/>\n<br/>\n<br/>\nConlaoch<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:56 PM - Sep 14, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hail, my friends.<br/>\n<br/>\nI would like to pitch in a little to this guide. First a correction:<br/>\n<blockquote><div>Today, I tend to lean toward 4 apr, 16 bab cleric where it will add +4 ab. It is up to you.\n</div></blockquote>\n\nThis is BAD, VERY BAD. Because DP will not grant you an extra attack at full BAB, so instead of, say: +40/+35/+30/+40 (with 15 BAB), your schedule will be +40/+35/+30/+25 (with 16 BAB). If you throw haste into the mix then it becomes: +40/+35/+30/+40/+35 (15 BAB) vs +40/+35/+30/+25/+40 (16 BAB).<br/>\n<br/>\nSo in BEST CASE SCENARIO you lose 10 BAB on your last attack. I repeat: Clerics should NEVER EVER EVER aim to have more than 15 BAB. Is it unplayable? No, no Cleric is, but it's just plain wrong unless you have a very good reason for doing it (say if you go Cleric 15 Fighter or CoT 6 WM 19), then you have no choice but to have more than 15 BAB, but if you can, avoid it at ALL COSTS! Less than 15 BAB is cool, 12 BAB, 13 BAB, doesn't really matter much (although your capped lvl 40 AB will be lower) because DP will compensate for it. So 12 BAB will net you +8 to AB from Divine Power, not +7, another little error from avado there, but give the man a break, he did this from memory 2 years after retiring! DP grants you 20 minus your pre-epic BAB always after level 20, because a Fighter's BAB is always 20 at lvl 20. But the DP enhancement counts towards the +20 cap, so you will lose that AB at the higher levels when you have all your buffs to reach the cap.<br/>\n<br/>\nThe MASS KILLING strategy is very good, but it requires a certain set of pre-set conditions to work. I'll list them:<br/>\n<br/>\n1- That enemies in the area are \"herdable\" if that's a word. If the enemies have a form on Ranged attack, you need to approach and attack each of them to make them switch to melee combat mode, then once you do you must watch not to get too far away from each one of them, or else they will switch back to their ranged combat mode. This can be a pain in the butt. <br/>\n2- That enemies are not spell resistant if your caster levels are not high.<br/>\n3- That there are not many casters around, as casters aren't herdable. If there are few casters, then you can herd the mobs around the casters.<br/>\n4- That said creatures have low reflex and no Evasion or Improved Evasion, or else Fire Storm will probably be useless.<br/>\n5- That said creatures don't have any form of Elemental Damage Resistance so that your spells really can hurt them.<br/>\n6- That the XP in the server is worth doing the work for. I say this because in WoG, mobs in general after a certain level aren't worth pretty much any XP. The real XP is in bosses. In another brazillian PW I used to play, there were scarce high-level areas and very far away from one another, so herding / mass killing actually meant you needed to either log out and play another toon while the respawn time transpired or wait tediously for the mobs to respawn.<br/>\n7- That enemies don't have the Freedom property, otherwise they won't get stunned. In the brazillian PW I mentioned, most monsters had it.<br/>\n<br/>\nAlso, there is one thing that avado doesn't mention but that is VERY FORTUNATE for this combo. SoV WILL PIERCE THROUGH GREATER SANCTUARY!! You can cast SoV next to a monster in GS and they will have to roll saves and be stunned like everyone else. Pretty sweet huh?<br/>\n<br/>\nAbout the BOSS KILLER, I was asked by Conlaoch about any tips using Blade Barrier, as he said that he would commonly misstep on them and get hit by his own blade barrier spell. There is one way not to certainly avoid them, but to greatly reduce the odds of getting owned by your own blades in case of missteping on them. You need to cast Spell Resistance on yourself (which you should always do anyway). This way, here is what happens:<br/>\n<br/>\nSpell Resistance spell gives you 12+1 every caster level. SR check to resist the spell is d20 + caster level (which in this case is the same for both, as you are the caster and the person trying to resist the spell), so if you roll a 13 or better on yourself, you will be damaged by the spell, otherwise you will resist it. So effectively by casting Spell Resistance on yourself, you have 60% chance of resisting your own spells. That is good for all of your spells and all classes that have Spell Resistance and spells that can damage or affect the caster like Druid's Stonehold spell. SoV is of no concern as it doesn't target allies.<br/>\n<br/>\nAbout HARM and IMPLOSION, I have to disagree with avado here, but I think that it's probably just a matter of servers we have played. Maybe where he played they were useless or for newbies as he described, but in my experience, both can be really potent weapons if propery used. Implosion is very good for certain situations, and so is Harm. I'll elaborate on both below: <br/>\n<br/>\nAs long as you know a monster isn't spell resistant or have ways of lowering said monster's SR (UMD Breach scrolls, Nature's Balance, Mordenkainen's Disjunction scrolls), Harm can be used in many situations to make a hard fight easy. I'll give you an example: There is this really tough boss in WoG called Lord Vayne, who is a Cleric Bard PM. If you let him buff up, the fight will last you LITERALLY an hour. He has many Heals, very high AC and all Cleric spells. However, you can approach him invisible (potion or Trickery domain spell) and cast Time Stop (spell or scroll, granted you have UMD or 17 Wizard levels like my Magical Master build), then Harm on him twice (it has been modified to do 250 Maximum damage and he has around 450 HP before buffing) and finish him off before Time Stop wears off with a Wand of Missiles, or Magic Missile, or IGMS Scroll, or pretty much ANYTHING that does damage, because as a Cleric Bard PM he has no Evasion, even a Firestorm would work here. His fortitude save is also very high, which means he won't succumb to Implosion unless you yourself have a very high Wisdom score. So in this situation, if anyone would use Implosion it wouldn't be effective, but Harm does the trick and finishes off an otherwise VERY TOUGH fight in 1 round.<br/>\n<br/>\nNon-UMD Clerics would need a certain degree of luck because they wouldn't have Time Stop to prevent him from healing or casting GS, but they can still manage if they break his Concentration.<br/>\n<br/>\nNow onto Implosion. Curiously, in the next area from Lord Vayne in WoG, there is a VERY HIGH LEVEL Wizard boss named Lady Althea. She has EMA, EW and all kinds of buffs, high spell DCs, IGMS, Time Stop, Greater Sanctuary, etc.. The whole package. If you let her buff up, you're in for a world of pain. However, she can go down VERY EASILY with a few well-placed spells that attack her weaknesses: Implosion is one of them. As we all know, Implosion attacks the Fortitude save of an enemy, which is a Wizard's weakest save. Now if you have capped Wisdom, as a general rule you'll have 32 Wisdom (20 base score). That is a +11 modifier. A spell DC is calculated by 10 + Spell Level + Ability Modifier + Miscellaneous Modifier (spell focus feats, innate +3, etc.). So by default your Implosion DC will be 33. That's a pretty decent DC to attack an enemy's weak save for a non-specialist caster. You come in invisivle, use Time Stop and throw 3 or 4 Implosions in a row at her. She's at least 75% likely to die instantly. Or you can make it even simpler by using a Bigby lvl 6 (Bull Rush) scroll to disable her and then kick the living crap out of her with your mighty Clerical buffs. FOrgot to mention, she has a ring of 15/- elemental resistance and is immune to paralysis, so avado's SoV / Firestorm tactics wouldn't work with her.<br/>\n<br/>\nNow both these strategies wouldn't work on enemies with True Seeing, so they are also situation-dependant, just like avado's suggested tactics above. The contrast or rather the combined result of my above tactics and avado's can give you an idea of how vast the Cleric's arsenal can be. They literally have a spell for every situation.<br/>\n<br/>\nAnyway, just thought I'd complement this very nice guide. Thanks for finding it, Conlaoch!<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:12 PM - Sep 14, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nAlso, there is one thing that avado doesn't mention but that is VERY FORTUNATE for this combo. SoV WILL PIERCE THROUGH GREATER SANCTUARY!! You can cast SoV next to a monster in GS and they will have to roll saves and be stunned like everyone else. Pretty sweet huh?\n</div></blockquote>\nJust about any direct damage AoE spell will accomplish the piercing, no?<br/>\n<br/>\nYou still need to know the approximate location of a GS foe (or at least suspect that they are in the vicinity) or need to spam lots of them until you manage to locate them (which you will only know from the combat log since it will not end their GS). Sure, it works, but can be an all-or-nothing commitment of Level 9 spells (in the case of SoV, anyway) where you may be spamming a high SR enemy.  If they don't fail the reflex, they just move out of the 10-meter radius effect and then probably just flank around the AoE to spam IKD on the perpetrator.  Probably a more economically-feasible method would be to spam lower-level AoEs first to gain a general location and then launch the first SoV and hope they didn't move out of range.  Sometimes, the lightning animation can give a clue to enemy location but it is not all that easy to notice.<br/>\n<br/>\nit works very well in enclosed areas where the target's location and movement is limited but not so effective in wide-open ones.<br/>\n<br/>\nIn theory, it sounds great, but in practice there are several contingencies.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:26 PM - Sep 14, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was not considering PvP or situations in which you would not see the enemy cast GS. I was considering only plain dumb PvM \"I'm a monster and I don't move when I buff\" type of behavior. But yeah, in other situations, like not knowing where the enemy is, it's not useful to pierce GS. If you see the enemy cast it, though, and there is no custom AI script, you know exactly where they'll be for the next few rounds. USE THE FORCE, LUKE <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "7:10 PM - Sep 14, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The 16 bab makes no difference.  Playability suffers little if at all going from 15 to 16 in my experience.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "7:18 PM - Sep 14, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nAlso, there is one thing that avado doesn't mention but that is VERY FORTUNATE for this combo. SoV WILL PIERCE THROUGH GREATER SANCTUARY!! You can cast SoV next to a monster in GS and they will have to roll saves and be stunned like everyone else. Pretty sweet huh?\n</div></blockquote>\nJust about any direct damage AoE spell will accomplish the piercing, no?<br/>\n<br/>\nYou still need to know the approximate location of a GS foe (or at least suspect that they are in the vicinity) or need to spam lots of them until you manage to locate them (which you will only know from the combat log since it will not end their GS). Sure, it works, but can be an all-or-nothing commitment of Level 9 spells (in the case of SoV, anyway) where you may be spamming a high SR enemy.  If they don't fail the reflex, they just move out of the 10-meter radius effect and then probably just flank around the AoE to spam IKD on the perpetrator.  Probably a more economically-feasible method would be to spam lower-level AoEs first to gain a general location and then launch the first SoV and hope they didn't move out of range.  Sometimes, the lightning animation can give a clue to enemy location but it is not all that easy to notice.<br/>\n<br/>\nit works very well in enclosed areas where the target's location and movement is limited but not so effective in wide-open ones.<br/>\n<br/>\nIn theory, it sounds great, but in practice there are several contingencies.</div></blockquote>\nNo, i literally menat that you cast SOV ON YOU!  I would click 3 of them on my character and not move.  That means that IF they want a piece of me, they come to me (AI is stupid).  They fail, they get stunned so I now know where they are.  My AC and AB are boosted and I would use Firestorm as an area cleaner.  What was left was choped down (i LOVED dev crit with clerics). <br/>\n<br/>\nA word about Implosion, Yes it is a noob spell.  What do I mean?  A Noob focuses ONLY on implode!  There are LOTS of these sorts of things happening.  I did it myself when I started.  Implode has its uses, yes.  However, spellbook management is more important than any one spell.  That is what i meant by noob spell.  Harm is the same.  <br/>\n<br/>\nI typically judge a cleric build by what is taken.  When I see KD for example, while it is a nice feat, for a cleric it is useless THE WAY I PLAYED.  I took it in builds and never used it once.  Things died too fast without it.  IS it useful?  sure.  Would i trade the slot for a meta, no.  Having spell flexibility is much more important to me.  That is why I loved dev crit!  Frees up feat slots!  LOL<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:13 PM - Sep 14, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>No, i literally menat that you cast SOV ON YOU! I would click 3 of them on my character and not move. That means that IF they want a piece of me, they come to me (AI is stupid). They fail, they get stunned so I now know where they are. My AC and AB are boosted and I would use Firestorm as an area cleaner. What was left was choped down (i LOVED dev crit with clerics). </div></blockquote>\n\nAbout SoV, it's not a target spell, you just cast it, unless your inventory is open. Just a question, what about casters?? Cuz at least everywhere I played, casters don't come to you, they just stay back and fire spells, so I imagine that by doing this you would be playing right into their hand. What did you use to do with caster mobs?<br/>\n<br/>\nOne more thing, I don't use KD much with Clerics either, but Devcrit doesn't free up feats, You need Power Attack, Cleave, Great Cleave, Improved Critical and Overwhelming Critical, plus one feat to take DC itself. That's 15 levels worth of feats between requirements and the feats themselves, 12 if you're Human. All these could be used for metamagic also .<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "8:53 PM - Sep 14, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>avado wrote:</strong><br/>\nNo, i literally menat that you cast SOV ON YOU!  I would click 3 of them on my character and not move.  That means that IF they want a piece of me, they come to me (AI is stupid).  They fail, they get stunned so I now know where they are.  My AC and AB are boosted and I would use Firestorm as an area cleaner.  What was left was choped down (i LOVED dev crit with clerics). \n</div></blockquote>\nAhhh, PvM.  I see (said the blind man).  So does SoV work like Evard's where the enemy must move through the area to get affected?  The smaller races can avoid Evard's to some degree and tiny races are immune.  Just wondering about the SoV dynamic.  Whenever I've used it the enemy always moved into the AoE unless, like Max posed, they stand back and use artillery attacks (like archers using GS).<br/>\n<br/>\nNot a bad strategy, though.  Tricksey<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "11:18 PM - Sep 14, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The 16 bab is not absurd!  Many of us who discussed that topic. The jist is, with the last patch, it makes no real difference, as the difference with haste and DP ISNT like it was when 15 was mandatory for clerics.  It is a preference, and it is 2 YEARS old!   <br/>\n<br/>\nLike I said, ECB is about MUNDANE characters.  What that means is, we put the builds out AS THEY ARE.  Items are dependant on server.  If you make reference to these in the build or topic, you confuse the issue.  It makes the builds impossible to judge side by side because you have to remember what to take out and what to add. Every build MUST be laid bare in order to allow each individual to be able to see how it COULD be played by them.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:02 AM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You still didn't answer my question about casters. How did you handle them? I'm curious.<br/>\n<blockquote><div>The 16 bab is not absurd! Many of us who discussed that topic. The jist is, with the last patch, it makes no real difference, as the difference with haste and DP ISNT like it was when 15 was mandatory for clerics. It is a preference, and it is 2 YEARS old! \n</div></blockquote>\n\nIt is 2 years old, but it is post 1.69 and since then nothing has changed. Having 16 BAB means that you get one of your attacks at -15, as opposed to -5. You may call it preference, I, however see absolutely no reason for you to cripple yourself that way. Maybe I'm being shortsighted, if that's so, then please tell me what am I failing to see? If not, then please remember that new players will be reading your guide, so if you support this, explain your reasoning so they can understand why.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "6:12 AM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><blockquote><div>The 16 bab is not absurd! Many of us who discussed that topic. The jist is, with the last patch, it makes no real difference, as the difference with haste and DP ISNT like it was when 15 was mandatory for clerics. It is a preference, and it is 2 YEARS old! \n</div></blockquote>\n\nIt is 2 years old, but it is post 1.69 and since then nothing has changed. Having 16 BAB means that you get one of your attacks at -15, as opposed to -5. You may call it preference, I, however see absolutely no reason for you to cripple yourself that way. Maybe I'm being shortsighted, if that's so, then please tell me what am I failing to see? If not, then please remember that new players will be reading your guide, so if you support this, explain your reasoning so they can understand why.\n</div></blockquote>\nSo I am supposed to concern myself about something that is over 2 years old that is in a form that I can no longer modify?  What I wrote about 16 bab is fair. It isn't crippling to have 4 apr! Crippling would be a 20bab!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:07 AM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yo guys!  Please take a break from the head bashing for a sec to answer <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=11&amp;t=156#p849\" rel=\"noreferrer\" target=\"_blank\">MY question</a>.  Pretty please with cognac on it?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:17 PM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong>Yo guys!  Please take a break from the head bashing for a sec to answer <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/viewtopic.php?f=11&amp;t=156#p849\" rel=\"noreferrer\" target=\"_blank\">MY question</a>.  Pretty please with cognac on it?</div></blockquote>\n\nSoV is an area spell that works in the area where you cast it. There is no such thing as a race or class or size that makes you immune to it, but freedom will prevent the paralysis effect of it.<br/>\n<blockquote><div>So I am supposed to concern myself about something that is over 2 years old that is in a form that I can no longer modify? What I wrote about 16 bab is fair. It isnt crippling to have 4 apr! Crippling would be a 20bab!</div></blockquote>\n\nSorry, still not enough reason. AFAIK, here in the ECB we are about optimizing builds. It doesn't have to be the most powerful class combo, but within the realm of possibilities that the class combo we are trying to build with offers, we strive to make the builds as good as they can be. Is a Cleric with 16 BAB unplayable? ABSOLUTELY NOT! It's only a minor change to have -10 on your last attack, and the class is so overpowered that this might go unnoticed in-game unless you read the combat log. Similarly, in a +20 environment with abundant weapons that do 2d12 bonus damage, a Fighter build that doesn't take WS/EWS won't do much worse than one that does, does that mean it has become a matter of \"preference\" to take the feat? NO! A fighter build without WS and EWS is not optimized, but it's as playable as the 16 BAB Cleric. But again, if you can avoid it, why wouldn't you?<br/>\n<br/>\nI will state this for all new players to read this topic: A CLERIC BUILD WITH MORE THAN 15 BAB THAT CAN AVOID IT IS NOT OPTIMIZED.<br/>\n<br/>\nSo long.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "2:40 PM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I understand what avado says about ECB builds needing to be general ones, ready for further module/PW customization at the hands of the player possibly even asking advice here as how to customize the specific build. On the other side, I also know that builds do not really exist in a vacuum; they come to life only when put in a living environment with all its peculiarities. That is why my builds are mostly tailored for mid magic environments, it's because of a conscious choice to optimize builds for the environment I deem the most balanced and appropriate for NWN play. In that light WoG is a good example of a balanced and yet very challenging (something very important to power build creeps like us) mid magic environment; to be such modifications to the vanilla game have been implemented.<br/>\n<br/>\nSumming up, I think we should build for a generic balanced environment mostly avoiding specific servers specificities. The possibility to publish builds tailored to the peculiarities of a specific module/PW still exists, but it must be made clear from the start that we are dealing with a module/PW specific build.<br/>\n<br/>\nI'm also thinking that builds tailored for a generic high or low magic environment (something significantly deviating from a mid magic one, not just being on the low or high end of mid magic) should be appointed as such, in light of mid magic being the natural and balanced reference frame for NWN builds.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "2:47 PM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipMaestro wrote:</strong><blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nAlso, there is one thing that avado doesn't mention but that is VERY FORTUNATE for this combo. SoV WILL PIERCE THROUGH GREATER SANCTUARY!! You can cast SoV next to a monster in GS and they will have to roll saves and be stunned like everyone else. Pretty sweet huh?\n</div></blockquote>\nJust about any direct damage AoE spell will accomplish the piercing, no?</div></blockquote>Aye. Also WWA/IWWA will disregard GS (assuming your enemy is in WWA/IWWA hitting range of course)<br/>\n<blockquote><div>You still need to know the approximate location of a GS foe (or at least suspect that they are in the vicinity)</div></blockquote>True seeing will let you see a GS foe but you won't be able to target him directly. With Tony K's AI enemies able to see you under GS (cause they have true seeing) cover will actually use the AoE strategy against the human player.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "2:52 PM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>avado wrote:</strong><br/>\nA word about Implosion, Yes it is a noob spell.  What do I mean?  A Noob focuses ONLY on implode!  There are LOTS of these sorts of things happening.  I did it myself when I started.  Implode has its uses, yes.  However, spellbook management is more important than any one spell.  That is what i meant by noob spell.  Harm is the same.  </div></blockquote>There is truth in what avado, in his own usual blunt way, says <br/>\n<br/>\nClerics are not just about implosion and harm (and heal). Clerics are veeery versatile characters with a lot of resources at their disposal, complemented with no spell failure and heavy armor right from the start. One should not pigeon hole himself into the same old stale strategy. One should explore all the road available to him. That said, harm and implosion are good spells, in the right situation. I don't think avado was saying otherwise, right dude?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "3:01 PM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Minor editing for a peaceful atmosphere sake, we all can discuss things with a calmer mind and a more constructive approach. Thank you for your understanding.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "avado",
      "avatar": "no_avatar.png",
      "timestamp": "3:04 PM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have DEFINIELY thrown a harm and implode in my day!  I just dont think they are the be all of clerics, like many put up.  I have read so many posts from people that say they use harm and implode and buff party.   <br/>\n<br/>\nIf you want to see a crazy sepll caster, make a high DC necro wizard and throw Wails around.  I actually had to stop playing one at lv 27 do to the crazy destruction I brought (also a good spell).  I was usint RWOT in PRC, so not quite the same, but in a balanced Vanilla situation, should deal the same carnage.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "3:28 PM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Both solutions (15 and 16 BAB at lvl 20) have their advantages and disadvantages. IMO and according to my playstyle and playing environment preferences BAB 15 is the way to go since the advantages it offers overcome both the disadvantages and the counterpart (BAB 16) package. The 4th (or 6th as the case may be) attack at full AB instead of -15 is nothing small.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "6:49 PM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>KailPendragon wrote:</strong><blockquote><div><strong>HipMaestro wrote:</strong>\n<blockquote><div>You still need to know the approximate location of a GS foe (or at least suspect that they are in the vicinity)</div></blockquote>True seeing will let you see a GS foe but you won't be able to target him directly. With Tony K's AI enemies able to see you under GS (cause they have true seeing) cover will actually use the AoE strategy against the human player.</div></blockquote></div></blockquote>\nThat's odd.  It must depend on the AI being used because my GS guy can walk right up to any hostile, dance around it and it never makes one hostile action against my PC whatsoever (or any other GS PC in the area).  Works the same on every server and in every LAN game I've ever played.  These observations are in compliance with its description of \"No other creature can detect the caster.\" though I have only tested it myself from the GS caster viewpoint.  Looks like I'll need to build a few GS-OnSpawn hostiles to see if my PC's True Seeing can pierce it.  Really hadn't been looking at it from a PvP aspect, TBH.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "7:48 PM - Sep 15, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I mentioned Tony K's AI, Hip.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "12:52 AM - Sep 16, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>KailPendragon wrote:</strong>I mentioned Tony K's AI, Hip.</div></blockquote>\nThat must be it then, Kail.  I guess a monster AI must be specially customized to handle untargetable hostiles else those Ancient Dragons that just stand there staring must be \"stupid\" ones (IIRC breath attack can target a point on the screen rather than a character).<br/>\n<br/>\nNow that I've tested it myself to see how a True Seer perceives a GS-user I am surprised.  I never saw those dotted encircling lines before on any creatures while I was using True Seeing and I use it almost constantly once it becomes available.  I can understand why GS isn't all that useful in PvP or with an advanced monster AI that possesses a means to cast AoE.  Even those fire bombs and such should be effective.  So much for the GS claim being undetectable without some sort of True Seeing qualifier in the description.<br/>\n<br/>\nAt least now I understand how easy it is to detect GS users when using AoE spells like avado suggests in his cleric tactics.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "dapegon",
      "avatar": "no_avatar.png",
      "timestamp": "3:32 PM - Oct 14, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">\"Max spell is good, but if I were to take a 3rd meta feat, it would be either silent or still.\"<br/>\n<br/>\nFrom my humble point of view, why would you  get silent (spell level +1) if you already have extend? of course, there are many spells that cannot be extended, but if you choose silent, no spell at all could be maximized, right?<br/>\n<br/>\nNow, I supposed that the point is not only getting more options, but getting the more interesting ones. For instance, if you use mass heal to kill undead, you will not be able to extend or maximize it, but you could use silent normally.<br/>\n<br/>\nEven with that in mind, I find difficult to skip maximize for silent... If the problem is getting interesting options, why not choose silent and maximize instead of extend and silent? Well, I'm still thinking about it. And even more, is a third metamagic feat good enought to skip others nice feats? I have in mind armor skin, an epic feat, should I choose metamagic instead of a feat that offers some extra protection (for the SoV tactic, for instance)?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:16 PM - Oct 14, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>dapegon wrote:</strong>\"Max spell is good, but if I were to take a 3rd meta feat, it would be either silent or still.\"</div></blockquote>\nPlease cite the post where you extracted the quote.  TBH I've tried scouring the topic but unable to locate the source.  <br/>\n<br/>\navado, Kail, Max and myself had been contributing to the guide discussion to some degree, but if you desire a response specifically from the author of the quote, Kail is essentially gone from the Internet, avado hardly ever checks in anymore and I am sure it wasn't derived from one of my comments (unless I have become OCR-impaired).  However, I will try to insert my own thoughts...\n<blockquote><div>\nFrom my humble point of view, why would you  get silent (spell level +1) if you already have extend? of course, there are many spells that cannot be extended, but if you choose silent, no spell at all could be maximized, right?</div></blockquote>I'm not following you at all here.  Silent uses one spell slot above the desired spell, maximize three slots higher.  Even if they were the same slot, both metamagic versions would appear for you to select from so you could easily quickslot Bless (for example) in three metamagic versions of Extended, Silent &amp; Still.  Naturally, enough slots must be available in the first place, obviously.  Sry.  I am missing the point you are trying to make about this.  As for the situation to use Silent over Extend... that should also be obvious, when Silence has been cast on your toon or you have entered an area which places the silenced effect on any character entering it only Silent spells can be cast with verbal components.\n<blockquote><div>\nNow, I supposed that the point is not only getting more options, but getting the more interesting ones. For instance, if you use mass heal to kill undead, you will not be able to extend or maximize it, but you could use silent normally.<br/>\n<br/>\nEven with that in mind, I find difficult to skip maximize for silent... If the problem is getting interesting options, why not choose silent and maximize instead of extend and silent? Well, I'm still thinking about it. And even more, is a third metamagic feat good enought to skip others nice feats? I have in mind armor skin, an epic feat, should I choose metamagic instead of a feat that offers some extra protection (for the SoV tactic, for instance)?</div></blockquote>\nThought process is bouncing around a bit but I'll try to decipher and organize...<br/>\n<br/>\nMetamagic feats like Silent, Still and Quicken are typically selected to create flexibility in spell management rather than to address casting scenarios, though it can certainly factor in.  It is a slightly different consideration for pure caster like a sorcerer or pure cleric, than a melee mage or battle cleric, though the same benefits still apply.  Cleric tend to possess very high AC with their repertoire of defensive spells so something like Armor Skin can have little value.  A mage (or hybrid build) with Epic Warding really doesn't need Armor Skin either.  Sorcerers and bards with their lack of requiring learning use metamagic feats differently, but that is probably not related to this guide anyway.<br/>\n<br/>\nAs far as Maximize spell goes, I seldom use it myself for two reasons 1) occupies a slot one level higher than Empowered spells (means more spells can be Empowered than Maximized) and 2) sets a predetermined maximum value (1d4+1 roll @+5) for all spells that can be maxed including buffs.  Given the option, I use Empowered spell (1d4+1*1.5) in just about all my builds except perhaps pure wizard that has feats to spare and can benefit from the slight flexibility.  But that whole debate has been hashed out for many years so it comes down to player preference and what is easiest for you to manage given your current spell repertoire.  Some people feel more comfortable casting a predetermined effect at a cost of flexibility and higher potential, I guess.  To each his/her own.<br/>\n<br/>\nOh... and selecting Extend spell feat should be obvious, as well.  \"Per round\" buffs are essentially worthless in combat without it in builds that take few caster levels.  Once again, the choice is build-specific, so even Extend can become near worthless in a Level 40 pure caster build, for example.<br/>\n<br/>\nSo, until the OP of that quote shows up (and recognizes the context), perhaps my input will help clarify these issues a bit more than before.  With apologies to the quote's author for potentially kibitzing on their turf.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:09 PM - Oct 14, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hail there, Dapegon!<br/>\n<br/>\nThis is not my guide, but I think I'll pitch in, cuz I think I see your point.<br/>\n<br/>\nIf you look at this metamagic issue without delving deeper into the Cleric's spellbook nature, then your arguments make half-sense, however, when you do, even the half-sense they make is gone. <br/>\n<br/>\nFirst and foremost, what Hip says is right. Due to the fact that Maximize Spell occupies a slot 3 levels higher than the original spells, you can only Maximize spells from levels 1-6. That alone is a big setback in terms of spellbook management. Empower spell means that you can empower spells from level 1-7, which is better.<br/>\n<br/>\nCross-referencing the above information with your knowledge of Cleric spells, here's what you get:<br/>\n<br/>\nLevel 1 - There are NO offensive spells at this level.<br/>\nLevel 2 - You can maximize stat buffs, but then you'd need to use up level 5 slots and everyone who's EVER played a Cleric knows that level 5 spells are for Extended Divine Power.<br/>\nLevel 3 - You can maximize Searing Light as a divine damage spell. But you'd occupy a level 6 spell, where you have spells like Blade Barrier, Harm and Heal. So again, bad choice.<br/>\nLevel 4 - You can Maximize Hammer of the Gods, but then it'd come at level 7, which is where you have Word of Faith (or namely Silent Blade Barrier if you follow Avado's advice, which makes a lot more sense than Maxed HotG).<br/>\nLevel 5 - Here you have Flame Strike as your only offensive spell, but then you'd occupy a level 8 spell slot, which is also where you get Fire Storm (infinitely better), Mass Heal or Empowered Blade Barrier. All of these make infinitely more sense than Maximized Flame Strike.<br/>\nLevel 6 - At this spell level you can Maximize Blade Barrier, but then you'd occupy a level 9 slot, which is here you have the following: Implosion, Storm of Vengeance, Silent Fire Storm, etc, again, all much better spells than a Maximized Blade Barrier (although that could be nice to have). <br/>\n<br/>\nBasically, the way the Cleric arsenal of spells works, Maximize spell isn't useful because you end up using a slot that is better used with another spell. For arcane casters, you can maximize IGMS, which can be very useful in some situations, so that alone makes it worth it. <br/>\n<br/>\nAnyway, I guess you can understand my point, right? <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "7:49 PM - Oct 14, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for interpreting dapegon's issue for me, Max.  I guess it was a quote from one of avado's comments so your clarification is about the best that will be offered unless another one of the vets checks in.<br/>\n<br/>\nIt may have some value in posting a discrete topic in the General subforum that illuminates the benefits, disadvantages and interaction of selecting metamagic feats in various builds.  Oft times it still comes down to how the choices are optimized in-game, play style and comfort, but facts are facts and they can be itemized to some extent.  If they were compared side-by-side I'm betting it would prove a valuable resource for those who haven't tried them out under a broad range of situations (or environments) or are just unfamiliar how they are used in practice.  I would include all caster classes in such a topic.   I could begin assembling a prototype and pass it to you via email until a useful version was hashed out.  Seems the ECB has been gaining membership slowly but steadily and I am guessing many of those inductees use the guild for reference and besides the build requests.<br/>\n<br/>\nWhat do you think? Game?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "dapegon",
      "avatar": "no_avatar.png",
      "timestamp": "4:47 PM - Oct 15, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh! sorry for the mess!<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong><br/>\nPlease cite the post where you extracted the quote. TBH I've tried scouring the topic but unable to locate the source.\n</div></blockquote>\nThe cite is on the first post, concept 2: Spell Book Management. Sorry, I was using a text browser and I didn't find the \"quote\" button.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong><br/>\nHowever, I will try to insert my own thoughts...\n</div></blockquote>\n\nDon't worry, I was expecting your answer (and Max, of course) as I know that avado is seldom online.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong><br/>\nI'm not following you at all here. Silent uses one spell slot above the desired spell, maximize three slots higher. Even if they were the same slot, both metamagic versions would appear for you to select from so you could easily quickslot Bless (for example) in three metamagic versions of Extended, Silent &amp; Still. Naturally, enough slots must be available in the first place, obviously. Sry. I am missing the point you are trying to make about this. As for the situation to use Silent over Extend... that should also be obvious, when Silence has been cast on your toon or you have entered an area which places the silenced effect on any character entering it only Silent spells can be cast with verbal components.\n</div></blockquote>\n\nOk, I was speaking about slots. I understand that avado points to the fact that, sometimes, many copies of the same spell are needed. The way to bypass the max slot/level is using metamagic, so you could cast the same spell using slots of diferent levels. Imagine now that you have the possibility of getting only two metamagic feats, my question was why not choose a combination that allow you to cast the same spell on three diferent levels? why extend and silent, that only give you slots from two diferent levels (+0 and +1)? It has nothing to do with the \"special feature\" that the feat could give you, just extra slots.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong><br/>\nMetamagic feats like Silent, Still and Quicken are typically selected to create flexibility in spell management rather than to address casting scenarios\n</div></blockquote>\n\nAgree.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong><br/>\nCleric tend to possess very high AC with their repertoire of defensive spells so something like Armor Skin can have little value.\n</div></blockquote>\n\nOk. I guess you're right. It was just a silly example for an epic feat that could be more interesting than a third metamagic, apart from the tipicals of focus, great wisdom and so.<br/>\n<blockquote><div><strong>HipMaestro wrote:</strong><br/>\nOh... and selecting Extend spell feat should be obvious, as well. \"Per round\" buffs are essentially worthless in combat without it in builds that take few caster levels. Once again, the choice is build-specific, so even Extend can become near worthless in a Level 40 pure caster build, for example.\n</div></blockquote>\n\nYep, I was thinking in a pure cleric build.<br/>\n<blockquote><div><strong>Maximillian Kane wrote:</strong><br/>\nIf you look at this metamagic issue without delving deeper into the Cleric's spellbook nature, then your arguments make half-sense, however, when you do, even the half-sense they make is gone.\n</div></blockquote>\n\nWell, Max, I must admit that your explanation is very clear and well explained. Maximize? After reading your post, It's not an option anymore. My excuse, I have little experience playing with clerics, I usually play with wizards, where maximize is not as bad...<br/>\n<br/>\nThanks a lot for your comments. I apreciate your opinions, as I always learn something new from them.<br/>\n<br/>\nBest regards.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:23 PM - Oct 15, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just a parting comment on this topic...<br/>\n<blockquote><div><strong>dapegon wrote:</strong><br/>\nOk, I was speaking about slots. I understand that avado points to the fact that, sometimes, many copies of the same spell are needed. The way to bypass the max slot/level is using metamagic, so you could cast the same spell using slots of diferent levels. Imagine now that you have the possibility of getting only two metamagic feats, my question was why not choose a combination that allow you to cast the same spell on three diferent levels? why extend and silent, that only give you slots from two diferent levels (+0 and +1)? It has nothing to do with the \"special feature\" that the feat could give you, just extra slots.</div></blockquote>\nI missed that interpretation but, fortunately Max nailed it right off.  I hadn't realized that it was referencing a feat-starved situation where one needed to be careful of what they selected.<br/>\n<br/>\nSo to insert my own rationale...<br/>\n<br/>\nSure. Getting access to the same spell on three different slot levels is an ideal situation.  But there's a kicker.  Exactly which spell(s) would three different slot levels be an advantage?  As Max has reminded, if your most-used spells are above level 6, Maximize would not do much to increase your potential.  And Quickened spells are even more limiting in slot management even though you could have the same spell on 4 different levels.  However, when you have lots of +1 metamagic slots from different feats and that metamagic version can be cast slvl 0 thru 8 (as most of those can, Silent and Still are most commonly used), there is tremendous flexibility.  Naturally, the advantages of most of those +1 metamagic spells is not near as powerful as Maximize or Empower but that is the trade-off.<br/>\n<br/>\nOne thing to keep in mind about metamagic casting... the DC never changes regardless of which slot it appears.  So the chance to save against it as Empowered or Maximized or Stilled or Extended is exactly the same as the spell level it is based on.  If you already realized that fact then just consider this a brief reminder.  Let's move on...<br/>\n<br/>\nSorcerers (and to a lesser extent bards) thrive on diverse metamagic, but that is due to the unprepared casting feature of the class.  Also, arcane casters will often need pre-epic Still to qualify for the three AutoStill feats in epic if building to wear armor while casting.  Autometamagic is powerful!  Every spell in your book can be either stilled, cast in silence or quickened. <br/>\n<br/>\nSituation much different for divine casters because, not unexpectedly, the feature of assured success while equipping heavy armor/shield means they are often feat-starved to balance casting a bit (imagine if clerics got the pre-epic bonus feats wizards do... scary!).  Clerics, pallies, druids and rangers have a powerful melee presence (or SHOULD!) and need feats to feed both their combat effectiveness and spellcasting prowess (like w/Spell Focus &amp; Penetration feats) at the same time.  In their case, typically, builds have no more room than for two metamagic feats, if that.<br/>\n<br/>\nAnd finally Empower vs. Maximize...<br/>\n<br/>\nTo decide which is the most effective in a build, besides the spell slot management issue, consider this:  How often does an extra skill point, an extra 40 HP, an extra AB, an extra AC and extra saves, together, just barely put your toon in superior position, reach a DC or win a dice roll?  If that fact is significant to you, Empower is always the most beneficial.  Maximize does one thing great: it guarantees that no more than a +5 dice roll value will occur for that effect.  Empower reaches +7 though it can take a few attempts to achieve that.  There's just more potential with that feat.  But... if omitting a dice roll for certain slvl 0 to 6 spells is more comfortable for your play style, then if you have to choose, settle for Maximize.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}