{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "266",
  "name": "Is there a spell list of what they effect best?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/is-there-a-spell-list-of-what-they-effect-best-t2312851.html",
  "author": "greyfey",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "584",
  "posts": [
    {
      "author": "greyfey",
      "avatar": "no_avatar.png",
      "timestamp": "10:14 PM - Jan 14, 2013",
      "content": "<div>I'm fairly new to caster,s I admit,im playing a Cleric on a med. too high lvl magic server,and in between being bugged too buff,heal, resurrect etc,etc. ,[im 15th lvl,not a flipping God!]<br/>\n<br/>\nIn my spare slots I do like to have some effective offensive spells,now try as I might,I cannot find them put into,they have low will?,use these,low fort?,use these,low ref?,use these,high SR?,use these sort of lists,now I know I could go through the entire nwnwiki and write it myself,but surely there is a much better one,someone who really KNOWS spell,s has done?<br/>\n<br/>\nBelieve me ,I have searched but my search-fu is weak!,surely im not the first to think of such a list? Btw it,s reading the excellent guides here that actually got me thinking of it in the first place   ,and just reading those has given me a few tell,s in game complimenting my tactics   <br/>\n<br/>\nSo there we are,is there such a list,or is it pad and biro time again?<br/>\n<br/>\nAlso,if someone could do a Sorcerer and or Wizard guide similar too the two Cleric one,s I would be eternally grateful!<br/>\n<br/>\nYrs hopefully G.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:37 AM - Jan 19, 2013",
      "content": "<div>Well, I can tell you this: if you're looking to kill things with spells, Wizard or Sorcerer is the way to go, as there is nothing that compares to IGMS for single targets, but, that said, there are a few spells Clerics have that can do the deal for you, albeit the possibilities are limited. Let us take a look at them:<br/>\n<br/>\nPre level 4 you simply don't have any meaningful spells, so let us start from level 4 on. At 3 you have Hold Person for low-will types, but I prefer to use all with buffs.<br/>\n<br/>\nNow, Hammer of the Gods is a nice spell if you're facing loads of low-will melee types. The damage is very bad, but that doesn't matter because what you're looking for is to disable them, not kill them. This works wonders with a Zen Archer, who will have a high DC and will then be able to take his time and kite them all to death. The damage type is divine, btw, which is the hardest type to resist save for magic damage type.<br/>\n<br/>\nAt level 5 you have Flamestrike, which deals Fire and Divine damage in an area. It also affects allies with only the Fire damage. I don't really use this spell cuz at level 5 you need to have Extended Divine Power in ALL your slots. Period. Save here is reflex, but there are better options futher along the book.<br/>\n<br/>\nAt level 6 you have Blade Barrier, which can be very useful if you spam it and then keep running around and making enemies chase you. Save is reflex as well and the damage is excellent, although of physical nature and subject to DR.<br/>\n<br/>\nAt level 7 you have Word of Faith, which is a no-save spell that blinds targets and unsummons summoned creatures in the AoE (large AoE. I love that spell. As for other options, there is Destruction, which is an insta-death spell that deals divine damage if the target doesn't die. Save for it is Fortitude.<br/>\n<br/>\nAt level 8 there is Fire Storm, which is a good AoE spell against low-reflex mobs with no evasion. It's like a huge Flame Strike that kills everything around you. avado used to have a good strategy involvin this spell and Storm of Vengeance. You can find it in his cleric guide. Mass Heal is also a level 8 spell and can do wonders against a host of clogged-up undeads. It leaves them with 1d4 HP but the AoE is quite small. I used to abuse this spell in a server I played where they had a vampire city. I would go and call the whole horde's aggro and get them to surround me, then a Mass heal followed by one attack and boom, all gone in one sec. It was a great way to lvl up.<br/>\n<br/>\nAnd at level 9 there are 2 great spells: Implosion, which is the highest possible DC insta-death spell and not subject to immunities (it receives a +3 in DC for free and is an Evocation spell),  and then you have Storm of Vengeance, which is even better because it affects a huge AoE around you and stuns targets for 2 rounds. Using this in conjunction with Fire Storm can truly be devastating. So, in summary:<br/>\n<br/>\nlvl 4 - Hammer of the Gods - stun effect has a will save.<br/>\n<br/>\nlvl 5 - Flame Strike - Reflex save (affects allies)<br/>\n<br/>\nlvl 6 - Blade Barrier - Reflex save (affects allies and yourself and whoever walks on the blades)<br/>\n<br/>\nlvl 7- Word of Faith - no save spell, Destruction - fortitude save<br/>\n<br/>\nlvl 8 - Fire Storm - Reflex Save, Mass Heal - no save, only vs undeads<br/>\n<br/>\nlvl 9 - Implosion - Fortitude Save, Storm of Vengeance - Reflex save<br/>\n<br/>\nhope this helps<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "greyfey",
      "avatar": "no_avatar.png",
      "timestamp": "12:57 PM - Jan 19, 2013",
      "content": "<div>Excellent stuff!,this will be printed and stuck above my screen!,thankyou for the time</div>"
    }
  ]
}