{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "200",
  "name": "Elven Esoterism - when is elf the best option?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/elven-esoterism-when-is-elf-the-best-option-t2354782.html",
  "author": "LauraMVX",
  "avatar": "10758829_1511108032.png",
  "replies": 8,
  "posts": [
    {
      "author": "LauraMVX",
      "avatar": "10758829_1511108032.png",
      "timestamp": "12:53 AM - Nov 29, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">A counterpart to Stagmeister's Gnomic Gnosticism thread. You see elves a good bit more than gnomes, but usually they're not the best choice. In a <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/sorcerer-in-the-stone-t2354651.html\" rel=\"noreferrer\" target=\"_blank\">build request</a> that gave 'Elf' as a racial preference, after working out a build within the restriction Hipmeister commented \"your preference for elf is extremely costly: -33 skills, -30 HP, -1 Fort, -1 feat.  At least your toon will have pointy ears, if that's any compensation.\" <br/>\n<br/>\nI really like the elf's (elves's?) racial ability to search all the time, as well as their skill affinities for recon, but I always feel like I'm struggling to make them fit any time I use them. Between their unhelpful favored class and their hit to constitution, whatever they do excel at due to the dex modifier is usually better covered by the halfling (who gets a +1 AB and +1 AC for their trouble). <br/>\n<br/>\nBut are there any situations where the Elf is the <em>best</em> option? Not just a passable one, but the <em>very best</em>? The obvious one that springs to mind is the Arcane Archer, but a lot of the best AAs will even go <em>half-elf</em> before they'll go elf!! Scrolling through the ECB archives with 'Elf' as the only filter, I still haven't found one that isn't an AA... (Perhaps thats due to its privileged position in the alphabetized list, though :P) (One build I'm reading, next to their max HP, reads \"&lt;-- :(\")<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:57 AM - Nov 29, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">One thing that comes to mind is their weapon proficiency elf that gives access to longsword, rapier, short- and longbow. That can save the day in a feat starved build with classes that only have WP simple, or worse. It can serve clerics, bards and druids well, and generally make it easier to qualify for CoT or WM in builds based on non-warrior classes.<br/>\nHumans get an extra feat that one can spend on WP Martial, but the other races don't. And humans don't have the high dexterity,  keen senses and other elven racial boni.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "LauraMVX",
      "avatar": "10758829_1511108032.png",
      "timestamp": "4:37 PM - Nov 29, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, I used to take elf a lot when playing druids because they cant take weapon proficiencies. Druids do get the scimitar, though, but not a longbow.<br/>\n<br/>\n'Archer' seems to be one area where elves are ideally suited over the halfling because, while they're both +dex, they can use longbows while the halfling cant. Another possibility I'd been thinking of is that they might be best suited on a build that isn't actually dex-based, but wants to grab a cheap 18 dex; somethng that uses robes or light armour... A strength-based dual wielding ranger or something like that, or a sorcerer/RDD who wants to cast spells in combat. An empowered cats grace on top of a 17 dex, as well as +4 ac from the RDD, and +8 from some tumble dump prestige class, gives a naked AC of 29 (vs heavy armour's 31) and saves three feats spent on autostill...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:59 PM - Nov 29, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you'd like an example of where an elf shines outside its more traditional roles, Mick's very own Kama-Shinobi stands out for me. It's a Monk 9/ Assassin 26/ SD 5, and you can find it on page 2 of the Full Epic forum. I can't think of another race that could top it. Regardless, as with much of building, a lot of it's about the concept, then turning that into the best it can be. You can't just say, \"I want the best wizard in the world ever\" and leave it at that. Well, not in this guild anyway. My first ever build request was for a dual-wielding (with handaxe, as it turned out), strength-based elf, and lo, Empyre and Valerfor gave me a lovely Fighter 16/ Bard 14/ RDD 10, which remains a delight to play.<br/>\n<br/>\nOf course, classes like Dwarven Defender are unlikely to be \"best\" unless they're dwarves. But even then, best at what? This is what makes it all fascinating - optimizing within parameters<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:07 PM - Nov 29, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Don't forget the most important thing, \"personal preference\".<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "LauraMVX",
      "avatar": "10758829_1511108032.png",
      "timestamp": "10:20 PM - Nov 29, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div>Regardless, as with much of building, a lot of it's about the concept, then turning that into the best it can be. You can't just say, \"I want the best wizard in the world ever\" and leave it at that.</div></blockquote>\n<blockquote><div>Don't forget the most important thing, \"personal preference\".</div></blockquote>\n\nOfcourse!! Hopefully I don't come off as some power maniac who's only interested in the very best! Mainly I am just trying to learn the game mechanics &amp; the art of making good builds before I can be more on-the-fly/creative. Kind of like learning to write poems in iambic pentameter before moving on to a more expressive blank verse... That, and getting my butt kicked taking my favourite elf RP character to World of Greyhawk the past couple days has me thinking about turning up the power - although that might not be my elf's (elve's?) fault, admittedly <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /> Anyway, I'm mostly asking in a purely academic way, \"what can an elf do like no one else?\"<br/>\n<br/>\nThanks for the tip about the Kama Shinobi Stagmeister, I'll check it out! And I've got to see that strength-based elven dragon...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:00 PM - Nov 29, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>LauraMVX wrote:</cite>\n\"what can an elf do like no one else?\"\n</div></blockquote>\nVery few things really, and apart from specific builds that matters more to PvP (because of the active spot/listen) that favoured \"Wizard\" class is simply just bad. They could have been much more useful with \"Ranger\" instead. Anyway, if i had to find something useful that they have over Halflings, i would say they are the only medium-sized race that gets a dexterity bonus. Why that matters? Well, IKD with an Elf warrior is more useful that a Hin's one. Also Halflings take a Strength penalty and this can be a factor sometimes. If we are talking about builds, i used an Elf as well for my Epic Dodging-Strength-Based character \"Dodji Domotai\" &amp; Max used an Elf too in his \"Drow Fencer\".<br/>\n<strong><span style=\"color:#A64D79\">Dodji Domotai</span></strong> --&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/dodji-domotai-fighter-16-wm-7-rogue-17-t2353227.html#p632\" rel=\"noreferrer\" target=\"_blank\">dodji-domotai-fighter-16-wm-7-rogue-17- ... .html#p632</a><br/>\n<strong><span style=\"color:#3D85C6\">Drow Fencer</span></strong> --&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/drow-fencer-fighter-14-rogue-19-weapon-master-7-t2329192.html#p457\" rel=\"noreferrer\" target=\"_blank\">drow-fencer-fighter-14-rogue-19-weapon- ... .html#p457</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:38 PM - Nov 29, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">\"Hear, hear!\" to Ranger as preferred class for an elf, but spitting at the moon just gives you sputum in the eye. Still, Dodji Domtoai I can attest to being a wonderful construction that balances everything beautifully. I'd forgotten Max's Drow Fencer - probably because his and my playstyles seem to crash badly - but it is a marvellous build, I can see that.<br/>\n<br/>\nAnyway, no, Laura, you don't come across as a power-maniac. Your poetry analogy is quite apt - it's all about knowing your audience/world - what you want to say balanced with what the audience wants to hear.<br/>\n<br/>\nOh, and that strength-based elven dragon can be found on page 7 of the Build Request forum, under the heading of \"Non-shooty, non-magicky elves - you know you're out there...\" I love him.<br/>\n<br/>\nFinally, I'd say elf's for the singular and elves' for the plural possessive, but hey, what do I know?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:46 AM - Nov 30, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nIf you'd like an example of where an elf shines outside its more traditional roles, Mick's very own Kama-Shinobi stands out for me. It's a Monk 9/ Assassin 26/ SD 5, and you can find it on page 2 of the Full Epic forum. I can't think of another race that could top it. \n</div></blockquote>\nThank you Stag!<br/>\nIn that build I chose elf because it is a medium sized race with high Dexterity.<br/>\nThe build is Dexterity based and dual wields  Kamas.<br/>\nKamas are small weapons and elf, that is a medium sized race gets a -2 AB dual wield penalty, which is the best you can get. <br/>\nHalfling, that would be the alternative race, is small sized and will get a -4 AB penalty with a small weapon offhand. A halfling will need a tiny weapon offhand to reduce the AB penalty for dual wielding to -2.<br/>\nThe +1AB bonus from small size is not enough to compensate for the extra AB penalty from dual wielding Kamas.<br/>\nThe extra strength that elf provides over halfling, is only a minor factor in a build that wears robes and deals 42d6 damage in the opening attack, when attacking from stealth.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}