{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "151",
  "name": "The Dark Orcish Shaman - Cleric 20 / Bard 4 / PM 16",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-dark-orcish-shaman-cleric-20-bard-4-pm-16-t2335357.html",
  "author": "Maximillian Kane",
  "avatar": "10235244_1510287070.jpg",
  "replies": "9",
  "views": "7.8K",
  "posts": [
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:49 PM - Jun 11, 2013",
      "content": "<div>Hail, ECBers!<br/>\n<br/>\nI come to you today because WoG is down and in order to get some NWN flowing through my veins, I went ahead and started working on a build of mine that has been on the works for quite some time. The idea is very simple: to combine Clerical godliness will PM AC and immunities whilst still improving upon the existing builds in the ECB with this very common class combo. OK, maybe it's not quite as simple, as Mith's Hierophant of Valsharoon (one of my favorite builds ever) is among them. Nonetheless, I believe it's mission accomplished, and the result is a fierce combatant with the whole lot of Cleric spells, very good fully-buffed AB, full Tumble and UMD and Epic Mage Armor for a very high AC. I will offer a detailed calculation of combat stats bellow the build. <br/>\n<br/>\nAs for weaknesses, the HP are sufferable, but with EMA and Empowered Endurance, you can get over the 500 mark easily, as you'll be able to equip CON gear, at least where I play. The saves are also bad, and she has no Evasion, which is too bad. And she's a little tight (actually VERY tight) on skill points. So, DO NOT TRY to cast spells in combat, because you don't have Concentration. Well, with your high AC, you probably won't get hit, but there's still the casters to worry about. In melee, you probably can, save for the enemy rolling a sneaky 20 on you. Also, you have no discipline, so KD immunity is high on your list of priorities. Again, on WoG it's not hard to come by, so no big loss there either. Plus, with your high AC, you'll only ever be in trouble when your enemies roll a 20.<br/>\n<br/>\nDomains are Strength for lvl 3 Divine Power and War for Aura of Vitality (and Cat's Grace until you get to that level). I would've also liked to have put in Trickery, because high AC and the 50% Concealment from Improved Invisibility go well together, but where I play, you can get by with Dusts of Disappearance and II scrolls (or Wands) as long as you have them in abundance. If where you play it's not that way, you may consider dropping Strength for Trickery, but I always have lvl 3 slots to put Divine Power available, so I tend to like Strength domain a lot. Travel is also an option if where you play there are no perma-haste items. Strength is again the domain to be dropped if you go that route. Anyway, without further delay, The Dark Orcish Shaman: <br/>\n<br/>\nCleric(20), Bard(4), Pale Master(16), Half-Orc<br/>\n<br/>\nAlignment: Any non-lawful non-good (CE for RP)<br/>\n<br/>\nPlayable: 1-40 PvM, untested PvP<br/>\n<br/>\nSTR: 18 (28)<br/>\nDEX: 8<br/>\nCON: 12<br/>\nWIS: 16 (20)<br/>\nINT: 12<br/>\nCHA: 6<br/>\n<br/>\nHalf-Orc: (Darkvision)<br/>\n01: Cleric(1): Weapon Proficiency Martial, Domain War, Domain Strength<br/>\n02: Cleric(2)<br/>\n03: Cleric(3): Knockdown<br/>\n04: Cleric(4): WIS+1, (WIS=17)<br/>\n05: Cleric(5)<br/>\n06: Cleric(6): Extend Spell<br/>\n07: Cleric(7)<br/>\n08: Cleric(8): WIS+1, (WIS=18)<br/>\n09: Cleric(9): Blind Fight<br/>\n10: Cleric(10)<br/>\n11: Cleric(11)<br/>\n12: Cleric(12): WIS+1, Empower Spell, (WIS=19)<br/>\n13: Cleric(13)<br/>\n14: Cleric(14)<br/>\n15: Cleric(15): Improved Critical: Warhammer<br/>\n16: Cleric(16): STR+1, (STR=19)<br/>\n17: Cleric(17)<br/>\n18: Cleric(18): Weapon Focus: Warhammer<br/>\n19: Cleric(19)<br/>\n20: Cleric(20): STR+1, (STR=20)<br/>\n21: Bard(1): Epic Weapon Focus: Warhammer<br/>\n22: Bard(2)<br/>\n23: Bard(3)<br/>\n24: Pale Master(1): STR+1, Armor Skin, (STR=21)<br/>\n25: Pale Master(2)<br/>\n26: Pale Master(3)<br/>\n27: Pale Master(4): Epic Prowess<br/>\n28: Pale Master(5): STR+1, (STR=22)<br/>\n29: Pale Master(6)<br/>\n30: Pale Master(7): Great Strength I, (STR=23)<br/>\n31: Pale Master(8)<br/>\n32: Pale Master(9): STR+1, (STR=24)<br/>\n33: Pale Master(10): Great Strength II, (STR=25)<br/>\n34: Pale Master(11)<br/>\n35: Pale Master(12)<br/>\n36: Pale Master(13): STR+1, Great Strength III, Epic Energy Resistance: Acid I, (STR=27)<br/>\n37: Pale Master(14)<br/>\n38: Pale Master(15)<br/>\n39: Pale Master(16): Great Strength IV, Epic Spell: Epic Mage Armor, (STR=28)<br/>\n40: Bard(4): WIS+1, (WIS=20)<br/>\n<br/>\nHitpoints: 343<br/>\nSkillpoints: 137<br/>\nSaving Throws (Fortitude/Will/Reflex): 23/27/15<br/>\nSaving Throw bonuses: Spells: +8<br/>\nBAB: 25<br/>\nAB (max, naked): 38 (melee), 25 (ranged)<br/>\nAC (naked/mundane armor/shield only): 29/40<br/>\nSpell Casting: Cleric(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nHeal 5(6), Perform 11(9), Spellcraft 39(40), Tumble 40(39), UMD 42(40)<br/>\n<br/>\n01: Spellcraft(4), Save(8), <br/>\n02: Spellcraft(1), Save(10), <br/>\n03: Spellcraft(1), Save(12), <br/>\n04: Spellcraft(1), Save(14), <br/>\n05: Spellcraft(1), Save(16), <br/>\n06: Spellcraft(1), Save(18), <br/>\n07: Spellcraft(1), Save(20), <br/>\n08: Spellcraft(1), Save(22), <br/>\n09: Spellcraft(1), Save(24), <br/>\n10: Spellcraft(1), Save(26), <br/>\n11: Spellcraft(1), Save(28), <br/>\n12: Spellcraft(1), Save(30), <br/>\n13: Spellcraft(1), Save(32), <br/>\n14: Spellcraft(1), Save(34), <br/>\n15: Spellcraft(1), Save(36), <br/>\n16: Spellcraft(1), Save(38), <br/>\n17: Spellcraft(1), Save(40), <br/>\n18: Spellcraft(1), Save(42), <br/>\n19: Spellcraft(1), Save(44), <br/>\n20: Spellcraft(1), Save(46), <br/>\n21: Perform(2), Spellcraft(1), Tumble(24), UMD(24), <br/>\n22: Perform(2), Spellcraft(1), Tumble(1), UMD(1), <br/>\n23: Heal(1), Perform(2), Spellcraft(1), UMD(1), <br/>\n24: Spellcraft(1), Save(2), <br/>\n25: Spellcraft(1), Save(4), <br/>\n26: Spellcraft(1), Save(6), <br/>\n27: Spellcraft(1), Save(8), <br/>\n28: Spellcraft(1), Save(10), <br/>\n29: Spellcraft(1), Save(12), <br/>\n30: Spellcraft(1), Save(14), <br/>\n31: Spellcraft(1), Save(16), <br/>\n32: Spellcraft(1), Save(18), <br/>\n33: Spellcraft(1), Save(20), <br/>\n34: Spellcraft(1), Save(22), <br/>\n35: Spellcraft(1), Save(24), <br/>\n36: Spellcraft(1), Save(26), <br/>\n37: Heal(1), Save(28), <br/>\n38: Heal(1), Save(30), <br/>\n39: Heal1), Save(32), <br/>\n40: Perform(5), Heal (1) Tumble(15), UMD(16), <br/>\n<br/>\nWell, as I said, this combo is not new, nor are the synergies, but I believe I have made the most of them, topping many of the great builds that were posted in the old guilds. This build has, for sure, the best AB-to-AC-to-DPR (Damage Per Round) ratio of them all. Let's take a look at them:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build213833.html\" rel=\"noreferrer\" target=\"_blank\">Priestess of the Damned by I...Samphus</a> His build has 2 less AB than this build, same fully-buffed AC (AoV gives 4 DEX, which caps with a Full Plate), but he goes for Travel instead of Strength. On WoG there are some perma-haste items, so I could go for Strength instead. That tweak is listed above as a possibility in non-perma-haste environments.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build247143.html\" rel=\"noreferrer\" target=\"_blank\">Hierophant of Valsharoon by Mithdradates</a> This is one of my favorite all-time builds, and definitely inspired me to create this toon. Mith's build has indispellability, which mine doesn't get, more skillpoints, more hitpoints and Devcrit, but no EMA and later Crit immunity. Also, mine has +1 AB and +9 AC if you count EMA Dodge bonuses compared to his. Not a bad tradeoff against one of the greatest builds in ECB history.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build152521.html\" rel=\"noreferrer\" target=\"_blank\">Cantor of the Dead by CrispyCritter</a> This build goes for a very strange spread, and TBH I don't understand why he stops Cleric at 12. He gets some Bard stuff, but not enough to tip the scales in terms of not putting those levels in Cleric. IMO, not very optimized.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build256482.html\" rel=\"noreferrer\" target=\"_blank\">Boneguard(101AC) by Mick Dagger</a> A severely gimped but well-conceptualized build with a clear achievable goal: to make a build that goes over 100 AC on its own. Mick's choices in this build are all oriented to that end, and he doesn't consider playability, in fact he acknowledges that in the OP. <br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build161210.html\" rel=\"noreferrer\" target=\"_blank\">Devine Deathsinger by _Ferahgo_</a> This is a higher-AC, higher AB build than mine, but lacks damage because of the defensive setting. He's a DEX toon with no evasion and very few HP. Quite an impressive build, but he gives up too much for not enough IMO. His +2 AB don't make him hit much more often, the extra AC is redundant most of the time and he gives up a lot of damage output and HPs to achieve that. Not such a hot trade IMO.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build232599.html\" rel=\"noreferrer\" target=\"_blank\">Kiaransalee Drow Cleric by Nekroskop_</a> Another DEX toon with high AC, but not enough damage output, even though much nicer HP than the previous build. The spread is also not optimized.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build138926.html\" rel=\"noreferrer\" target=\"_blank\">Combat Medic by Halston Vega</a> A well-designed party support caster who is supposed to heal his comrades while they do all the fighting. Takes a lot of metamagic feats for casting prowess.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build203792.html\" rel=\"noreferrer\" target=\"_blank\">The Robust Reanimator by jjjhhhlll</a> Same concept as the above, but goes for EDR feats, which fits the concept of a survivor more.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build234766.html\" rel=\"noreferrer\" target=\"_blank\">Another Lite-Can Cleric! bt krsboss</a> This toon is very similar to mine, but gets 40 more HP, while 5 less AB. Has more skills though, because he goes for Human. ESF: Discipline and Heal. I don't understand why ESF Discipline on such a high AC build, even with that, his AC will always be higher...<br/>\n<br/>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build148250.html\" rel=\"noreferrer\" target=\"_blank\">Archer Cleric by Tilbono</a> This is a Zen-Archer / Caster. IMO he doesn't need AC unless against AAs, so I don't really understand why use this class combo for such purpose. IMO a Cleric / Monk like my Demolition Man can make better use of WIS, which makes it so that he has about the same (if not higher) AC thanks to Monk Wisdom AC, and a much higher AB / Spell DCs. He's not crit-immune, but not many can crit that kind of AC anyway. Not sure what his reasoning was using this great melee class combo for ranged combat, except that maybe he was afraid to get critted by archers or surprised in melee. Still, his build is unique among the others because he went for archery and a bit of casting.<br/>\n<br/>\nNow, as for the calculations. This build can reach 64 fully-buffed AB:<br/>\n25 (BAB)<br/>\n+9 (STR)<br/>\n+4 (WF, EWF, EP)<br/>\n+6 (Capped STR)<br/>\n+5 (GMW)<br/>\n+5 (Divine Power)<br/>\n+5 (Divine Favor)<br/>\n+2 (Battletide)<br/>\n+1 (Bless)<br/>\n+1 (Aid)<br/>\n+1 (Prayer)<br/>\n<br/>\nIt can also reach a high indispellable AC with the right item with a bit of dispellable extra AC just in case it's not enough.<br/>\n10 (Base)<br/>\n+1 (Dex)<br/>\n+8 (Full Plate)<br/>\n+3 (Tower Shield)<br/>\n+10 (Bone Skin)<br/>\n+2 (Armor Skin)<br/>\n+8 (Tumble)<br/>\n+20 (EMA)<br/>\n+4 (Permahaste item)<br/>\n+5 (Monk Boots)<br/>\n= 71 Indispellable AC with just a couple of items<br/>\n+5 (Magic Vestment, dispellable, but you can find a +5 shield on WoG)<br/>\n+1 (Mage Armor scroll or wand, dispellable)<br/>\n= 77 Fully-buffed AC with just a couple of items<br/>\n+2 (Debuff from Battletide, circumstantial)<br/>\n+1 (Debuff from Prayer, circumstantial)<br/>\n= 80 Fully-buffed effective AC <br/>\n<br/>\nYou don’t actually need more than 77 AC where I play. With 72 most mobs will only hit you on a 20, except epic bosses. For most of the fights you’ll be untouchable, reach the boss relatively unscathed and then dust yourself up and have a decent fight. If EVER you find yourself in a situation where you need MORE than 77 AC, have some scrolls of Bigby lvl 5 ready to go and problem solved, unless the enemy has Spell Resistance. If they do, have some Heal potions (you should be able to save many for those very specific battles where they’re most useful).  And since most of your AC is indispellable, not even Mord’s can disarm you. Casters may cause a bit of problems if you let them buff, but with Epic Energy Resistance: Acid, less so than for most toons. With the equipment slots you’ll have available because of EMA, just get yourself a Ring of Major Acid Resistance and equip it if things get tough. You’ll reap through their Mestil’s Acid Sheath and kill them without taking too much damage from it.<br/>\n<br/>\nAnyway, I hope you like this build.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "10:00 PM - Mar 21, 2016",
      "content": "<div>Experience penalty this build: -20% XP from Level 21 thru Level 40 (20 levels)<br/>\n<br/>\n Can gain +1 saves vs. spells by shifting 4 points from UMD (once again, 33 modified ranks is sufficient) and/or Heal to cap Spellcraft 43(44).  You'll need to remember to swallow a Fox pot before an encounter to gain that extra save, though.</div>"
    },
    {
      "author": "phmah2408",
      "avatar": "10758847_1515693635.jpg",
      "timestamp": "11:06 PM - Jan 05, 2018",
      "content": "<div>How about switching it to human to avoid exp penalty?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:14 AM - Jan 06, 2018",
      "content": "<div>A couple of things, if Max doesn't object too much (oh - and hello!, btw)...<br/>\n<br/>\nIn PWs an xp penalty matters rather less, because you can always go say hello to re-spawning creatures and pump youself back up, which is not always possible in SP modules.<br/>\n<br/>\nI would also suspect that Max looked at the character's stats - not only at creation, but throughout, and weighed up what would get him to what he was looking for. He probably doesn't build anything like me, but unless I'm constrained from the start, I'll build with human - cos it's easiest, then make choices about racial proclivities subsequently. (Can I do without the extra feat, skill points, etc)<br/>\n<br/>\nOh, and I suppose there's always the \"let's do something different\" thing to bear in mind. In effect, the kewlness factor.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "3:25 AM - Jan 06, 2018",
      "content": "<div>If I had to hazard a guess, the half-orc was more for the +2 to str while sacrificing charisma.<br/>\n<br/>\nPersonally, I'd probably switch to Human to get the more skill points while losing +1 AB.<br/>\n<br/>\nAnd since I also play on WoG, I'd stick with a Morningstar, drop martial weapon proficiency and take Craft Wand.<br/>\nWands aren't interruptible and being able to have a pack of 50 spells in a convent pocket sized form...   way too sweet to pass up...<br/>\nKinda like a Pez dispenser for Get Out of Trouble cards...   Need a spare Hammer of the Gods, restoration, or Darkfire?   got a 50 pack right here.....<br/>\n<br/>\nCourse the Orc could be quite fun as well...    </div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "6:58 PM - Mar 13, 2018",
      "content": "<div>Hey guys! I hope even two years later the answer still counts. Both of you are right, yet both of you are wrong lol. I went Half-Orc knowing that I'd sacrifice CHA for STR, and doing something different was part of it, but the MAIN reason to go with Half-Orc was just what gave me the idea to make this toon. I was killing a bunch of Orcs and among them were some Orc Shamen, and I thought: I wish I could make one of those. This was the result lol!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:37 PM - Mar 13, 2018",
      "content": "<div>Thanks Max! Should really have known better than trying to second-guess you!<br/>\n<br/>\nGreat to see you back, btw - but where's your Shrek avatar gone? Are you going for a more mysterious. less cuddly approach now? <span class=\"text-emoji\">😉</span></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "2:35 PM - Mar 15, 2018",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>Thanks Max! Should really have known better than trying to second-guess you!<br/>\n<br/>\nGreat to see you back, btw - but where's your Shrek avatar gone? Are you going for a more mysterious. less cuddly approach now? <img class=\"post-image\" loading=\"lazy\" src=\"http://emoji.tapatalk-cdn.com/emoji6.png\"/></div></blockquote>\n\nHey Stag! Thanks for the warm welcome. <br/>\n<br/>\nIf you look closely, you'll see that this account has \"_\" inbetween the two names. I lost the other one when the forums migrated, and the Shrek avatar was there. I just haven't edited this account yet. Maybe one day lol.<br/>\n<br/>\nCheers!<br/>\n<br/>\n<br/>\nSent from my iPad using Tapatalk</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "10:43 AM - Oct 07, 2019",
      "content": "<div>I just tested this build. Wow.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:30 AM - Oct 07, 2019",
      "content": "<div>Sounds like you have a story to tell eltalstro! :)</div>"
    }
  ]
}