{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "068",
  "name": "The Perils of Rail Travel...",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-perils-of-rail-travel-t2354711.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "9",
  "views": "308",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:26 PM - Jun 12, 2017",
      "content": "<div>...include a drifting mind.<br/>\n<br/>\n I've recently been working through HotU with a view to having a \"proper\" go at Sands of Fate, when something struck me: if HoTU is Dev Crit enabled, is SoF? I don't think I've made a Dev Crit build - certainly not in the last 2 years, so thought I'd try. I also had the Ranger class on my mind thanks to another build request (thus, you can blame them for what follows <img class=\"img-emoji\" src=\"emoji/6.gif\"/>), so thought I'd have a go at a STR-based Ranger with BoE and Dev Crit, dual-wielding kukris.<br/>\n<br/>\n I went through many permutations before reaching Birmingham: starting with a Ranger/Rogue/SD (but that seemed to promise a DEX, ED build) then Ranger/Bard/RDD (but iirc the sadly missed Tyr Templar did that better than I could hope to), before settling on something that I hope is viable: a Ranger 25 / CoT 10 / HS 5.<br/>\n<br/>\n Below is the draft I came up with on paper while on the train. It's fairly raw, because I had no means of checking stuff (only had a notebook and pen - no tinternet access), so please excuse any hiccups, but what do you think of it - both conceptually and developmentally?<br/>\n<br/>\n<strong>Ranger 25 / CoT 10 / HS 5</strong><br/>\n Human, non-Evil<br/>\n PvM 1-40<br/>\n<br/>\n STATS<br/>\n<br/>\n STR - 17 (34)<br/>\n DEX - 14<br/>\n CON - 12<br/>\n WIS - 11<br/>\n INT - 12<br/>\n CHA - 8<br/>\n<br/>\n HPs: 420<br/>\n Saves: F 29/W 23/ R26 (all +4 vs Spells)<br/>\n AC: (naked) 22, (mundane Chain/BPlate) 27, (+Tower) 30<br/>\n Skills: 238 - Discipline 43 (55), Lore 25 (26), Persuade 8 (7), Search 33 (34), Spellcraft 19 (20), Spot 43 (45), Tumble 40 (42)<br/>\n BAB: 30<br/>\n AB: (melee: kukri) max 46/41/36/31 (D-W) 44/39/34/29 - 44/39 (not done ranged yet, apologies)<br/>\n DevCrit DC: 42 (crit at 12-20 with ImpCrit, Keen kukris)<br/>\n<br/>\n LEVELLING<br/>\n<br/>\n 1 R1 - WProf:Exotic / WF:Kukri / (D-W/Trackless Step/FE I)<br/>\n 2 R2<br/>\n 3 R3 - Power Attack<br/>\n 4 R4 - STR+1 (18)<br/>\n 5 R5 - FE II<br/>\n 6 R6 - Cleave / (Animal Companion)<br/>\n 7 R7<br/>\n 8 R8 - STR+1 (19)<br/>\n 9 R9 - Imp Crit:Kukri / (Imp 2W-F)<br/>\n 10 R10 - FE III<br/>\n 11 CoT1<br/>\n 12 CoT2 - STR+1 (20) / KD / Blind Fight<br/>\n 13 R11<br/>\n 14 R12<br/>\n 15 R13 - Iron Will<br/>\n 16 R14 - STR+1 (21)<br/>\n 17 R15 - FE IV<br/>\n 18 CoT3 - Great Cleave<br/>\n 19 CoT4 - Alertness<br/>\n 20 CoT5 - STR+1 (22)<br/>\n 21 CoT6 - GrtStr I (23) / ASkin<br/>\n 22 HS1 - FE V<br/>\n 23 CoT7<br/>\n 24 CoT8 - STR+1 (24) / GrtStr II (25) / Ow Crit<br/>\n 25 CoT9<br/>\n 26 CoT10 - Dev Crit<br/>\n 27 R16 - GrtStr III (26)<br/>\n 28 R17 - STR+1 (27)<br/>\n 29 R18<br/>\n 30 R19 - GrtStr IV (28)<br/>\n 31 R20 - EWF:Kukri<br/>\n 32 R21 - STR+1 (29)<br/>\n 33 R22 - GrtStr V (30)<br/>\n 34 R23 - Bane of Enemies<br/>\n 35 HS2<br/>\n 36 HS3 - STR+1 (31) / GrtStr VI (32)<br/>\n 37 HS4<br/>\n 38 HS5 - FE VI<br/>\n 39 R24 - GrtStr VII (33)<br/>\n 40 R25 - STR+1 (34) / EProwess<br/>\n<br/>\n I also have a couple of questions about the construction regardless of anything else. First, can I take Overwhelming and Devastating Criticals when I do - that is, at the same time as I take STR23 and STR25 - or would I have to delay them (which would result in some reshuffling)? Second, would I be better off going for BoE before going for the crits?<br/>\n<br/>\n I'd be grateful for your thoughts, good people <img class=\"img-emoji\" src=\"emoji/11.gif\"/><br/>\n<br/>\n<em><strong>EDIT: </strong></em>Sorry again. I'm aware the AC is less than great, any thoughts there - that don't necessarily mean taking Heavy Armour?<br/>\n<br/>\n<em><strong>EDIT 2:</strong></em> I've just checked the Legacy Archive and Hip's fantabulous contrapulator and there don't seem to be any other builds of this design. Which would make it either \"interestingly unique\" or \"unlikely to succeed\". Votes? Oh, and given that I don't have a full repetroire of FEs, my thinking would be to go for those that are crit immune (Undead and Constructs are the first that come to mind), then those you're most likely to have a rotten time with in your environment (eg, Aberrations and Outsiders), before anything else (Reptilians, Giants, Elementals, Dwarves, Elves, whatever). Still, it's up to you. Oh, and regarding the skills, I'd have gone for some Hide and Move Silently if I was taking SD - just to cover me. They still might be a good idea, however, and are max-able if I drop Conc and Spellcraft. Again, over to you...<br/>\n<br/>\n<em><strong>EDIT 3:</strong></em> Changed epic levels in light of the below, but maintained the drive for Dev Crit prior to BoE, which I'm still not sure about.<br/>\n<br/>\n<em><strong>EDIT 4:</strong></em> Another edit to take account of what I said in post #5, below.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:57 PM - Jun 12, 2017",
      "content": "<div>Unfortunately, I can answer one of my own questions now. Somewhere in the recesses of my mind was a previous discussion, and alas it it is true. I was correctly informed by Hip that when levelling-up the sequencing runs: stat increase; skills; bonus feat; general feat. Thus, I am unable to take Overwhelming Crit at L21 and Devastating Crit at L24 (which were both CoT bonus feats, relying on taking the general Great Strengths first). Therefore, regardless of anything else, some shuffling is in order - and possibly pushes the acquiring of BoE forwards.<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:29 AM - Jun 13, 2017",
      "content": "<div>I was about to say that about Dev Crit, but you figured it out for yourself. Yes, Dev Crit definitely works in SoF.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:51 AM - Jun 13, 2017",
      "content": "<div>Thanks Empyre - it's still good to have it confirmed!<br/>\n<br/>\n My irritation and general annoyance with Cania (which is where my Hearth Guard is about to enter) is such that I may be tempted to start Aribeth's Redemption with this build, and sod the gear/consequences, before going into SoF - which is one reason I'd like to get it right.<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:21 AM - Jun 14, 2017",
      "content": "<div>Remember, Aribeth's Redemption is for Humans, Elves, or Half-Elves only. It does, however, have a forge similar to Risolvr's.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:24 PM - Jun 14, 2017",
      "content": "<div>Well, I downloaded the Pretty Good Character Creator from the Vault, and it doesn't appear to be working for me (I stuck it in the mods folder - was this wrong?), so I'm taking this toon on a quick blast through the OC before taking Aribeth's Redemption (currently about to visit the Head Gaoler). I've also tweaked the build to change the order of pre-epic feats and altered the skillset: losing Concentration to boost Lore and taking Search up to 33 (modified to 34). The Search increase is specific to SoF, because I seem to recall someone mentioning that there were a lot of hidden doors/traps there and it would be handy to find them. Iirc, a modified 34 is the most you can use without having any Rogue in the build.so that's why I stopped there. That left 19 skill points going spare, so I stuck them into Lore, giving 25 (25), to help with funds. Am off to do the edit now...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "3:10 PM - Jun 14, 2017",
      "content": "<div>That modified 34 is because of traps. I suppose everyone can spot hidden doors with a DC higher than 36.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:47 PM - Jun 14, 2017",
      "content": "<div>This is the version I have: <a class=\"postlink\" href=\"https://neverwintervault.org/sites/all/modules/pubdlcnt/pubdlcnt.php?file=https://neverwintervault.org/sites/neverwintervault.org/files/project/1828/files/pgc3_v43.zip&amp;nid=1828\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/sites/all/ ... p&amp;nid=1828</a><br/>\n from this page: <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/pretty-good-character-creator-customizer-pgc3-powered-igipe\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... ered-igipe</a><br/>\n You might have gotten the version that needs CEP.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:46 PM - Jun 14, 2017",
      "content": "<div>Brilliant, Empyre, I'll try that one now.<br/>\n<br/>\n Thanks</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:04 AM - Jun 16, 2017",
      "content": "<div>Now I didn't expect this...<br/>\n<br/>\n Like a good and dutiful fellow I was wandering around with my kukri+1 (at level 5 and 6) in the OC, then I upgraded the scimitar+1 I got from Gulnan so I had some fire damage to bust open all those locks I couldn't before, and lo, t'was as if an angel descended - am knocking everything in sight out of the park with a weapon I'm not focussed in. Life is one strange barstool. Right, off to the Docks - damned chicken!</div>",
      "author-color": "#AA0000"
    }
  ],
  "author-color": "#AA0000"
}