{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "400",
  "name": "Looking for ideas for a Ranger",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/looking-for-ideas-for-a-ranger-t2335753.html",
  "author": "campgod",
  "avatar": "no_avatar.png",
  "replies": "21",
  "views": "3.1K",
  "posts": [
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "8:56 AM - Jun 16, 2013",
      "content": "<div>Hello everyone. I have been away from the game for a many years now and pretty much forgot everything about building. I have noticed we now need direct IP address to play on a sever. Well short story..I am on a new sever and they have plenty of rules and changes on builds. I was looking for a beast ranger build. The changes/rules are no animal companion and with 21 lvls of ranger you get HIPS (outdoor only). So I wanted to pick your brain on where to go from there. Lvling goes as follows, Any pally, monk or prestige class has to have at least 5 lvls. You can only take one prestige class. Any other class can have less than 5 lvls but only if before lvl 20, anything after lvl 20 has to be at least 5 lvls. This server seems to favor dex builds but don't really want to throw out Str ones either. But if they do fav. Dex builds should one duel weild then? I have seen some of the past Ranger builds that have rogue in it which would be cool with the HIPS? I rem seeing one of Grimms builds called the Grim Ripper I think it was called, which was a ranger/fighter/wm carrying a Scythe...which would be cool to coming out of HIPS. I like the KD theme but on this server most cant be put down cause they protect against it. There is no Over/Dev crit allowed. This is a PvM with a strong PvP at lvl 40. This sever also has NO magic stores where you can buy anything. All comes from other players who make potions and scrolls with gold and loss of exp. Then you can buy from them if they want to sell.  UMD does help so you can use items though. There is no Perma Haste on items. Haste comes from the build or spells. Weapons get a max of +7, armor I think is around +6. So I think that's about it...im sure I'm leaving out info you might need. So please ask and thank you guys for your time and good to see you are still around. Oh and this is a lvl 40 server.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:58 PM - Jun 16, 2013",
      "content": "<div>Heya,<br/>\n<br/>\nThe Grim Ripper sounds like a nice way to go. That build deals SICK damage output and is the closest you'll get to Devastating Critical in that server. However, one has to wonder. This build is pretty much an offensive toon with very little defense. Is that the kind of thing you were looking for?<br/>\n<br/>\nThere is also my Bane Crusher build, which is a DEX-Based, Epic-dodging Ranger 23 Rogue 16 SD 1 (That last level of SD may be worthless unless you want to have HiPS indoors as well). you can tweak it a little so that you have early on Tumble by dropping 1 BAB and going Ranger 16 Rogue 4 pre-epic or two BAB to have HiPS from level 8 and indoors (going Ranger 15 Rogue 4 SD 1 pre-epic taking the SD level at lvl 8). That makes the leveling much easier, but the lvl 40 result much worse. Still, with those server restrictions, it should still do fine, because nobody will have optimized builds with 1 SD level. Here is a link to the build. You may swap the FEs for the main classes in NWN for PvP:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/the-bane-crusher-ranger-23-rogue-16-sd-1-t515517.html\" rel=\"noreferrer\" target=\"_blank\">The Bane Crusher</a><br/>\n<br/>\nPlease note that the \"final\" build is at the 5th or 6th post in the topic. <br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "8:44 PM - Jun 16, 2013",
      "content": "<div>Thanks Max for taking the time to reply to my post. I really like the Grim Ripper cause of its damage but like you said very little defence which does kind of scare me lol. The Bane Crusher is a very nice build as well, however You can not take just 1 lvl of a prestige class, you must take at least 5 lvls. I was looking at the Elfbane by mphacon as well, what are your thoughts on that one? As well as the Sherwwod Blade by TyrTemplar? I like the Ranger/Bard set up but never played a toon that was just 2 classes. He has two ways to setup the feats. One that looks like its in your face fighting with taunt and the other a sneak around which might be nice to have with the HIPS. Seems to me if I am going for the HIPS I might have to be forced to go with a DEX build huh? I want best of both worlds...which is impossible lol. Or if you have something new in mind I wouldn't mind hearing that as well. You are one of those epic builders which I followed there builds so thanks again for taking the time.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:53 PM - Jun 17, 2013",
      "content": "<div>Hey campgod!<br/>\n<br/>\nSo, what you need to understand is the \"characteristics\" of each type of build. Notoriously, STR-based Rangers are damage-dealing machines with very little defense. This happens because of the damage bonuses versus Favored Enemies and Bane of Enemies, high AB and generally High Strength. However, Rangers don't get any defensive class features, except a boost for Hiding skills via Camouflage / Mass Camouflage. In that sense, that custom HiPS bonus can be an interesting tool for that defensive purpose, so long as they're buffed with Camouflage and Mass Camouflage and probably in Light Armor (Heavy Armor incurs a skill check penalty for Stealth skills, but it's still doable, provided you have the proficiency). Generally, over 25 levels of Ranger are recommended on damage-dealing Rangers because of the access to multiple types of FEs (to cover all the base classes of the game). They rely on killing the enemy before it kills them and HiPS can be a good getaway clause if things get nasty, but you should by all means outdamage most if not all meleers. The damage output of the Grim Ripper, for instance, is gigantic. He will tear through opposition like there's no tomorrow. Most STR-based Rangers should be that way. <br/>\n<br/>\nHere is an example of a build I will send you one I have in my grimoire, which needs tweaks to fit your server, you can go Ranger 26 Fighter 4 Assassin 10 (so you get Improved INV) or Ranger 29 Fighter 6 Assassin 5 just to fulfill the requirements, but I don't have time to tweak it for you, so you gotta do it yourself:<br/>\n<br/>\nRanger(35), Fighter(4), Assassin(1), Human<br/>\n<br/>\nSTR: 16 (30)<br/>\nDEX: 14<br/>\nCON: 10<br/>\nWIS: 14<br/>\nINT: 14<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Ranger(1): Expertise, Weapon Proficiency Exotic, Favored Enemy: Undeads, {Dual Wield}<br/>\n02: Ranger(2)<br/>\n03: Ranger(3): Knockdown<br/>\n04: Ranger(4): STR+1, (STR=17)<br/>\n05: Ranger(5): Favored Enemy: Elementals<br/>\n06: Ranger(6): Weapon Focus: Kukri<br/>\n07: Ranger(7)<br/>\n08: Ranger(8): STR+1, (STR=18)<br/>\n09: Ranger(9): Improved Critical: Kukri, {Improved Two-Weapon Fighting}<br/>\n10: Ranger(10): Favored Enemy: Constructs<br/>\n11: Ranger(11)<br/>\n12: Ranger(12): STR+1, Blind Fight, (STR=19)<br/>\n13: Ranger(13)<br/>\n14: Ranger(14)<br/>\n15: Ranger(15): Improved Knockdown, Favored Enemy: Dragons<br/>\n16: Ranger(16): STR+1, (STR=20)<br/>\n17: Ranger(17)<br/>\n18: Ranger(18): Improved Expertise<br/>\n19: Ranger(19)<br/>\n20: Ranger(20): STR+1, Favored Enemy: Outsiders, (STR=21)<br/>\n21: Ranger(21): Bane of Enemies<br/>\n22: Fighter(1): Armor Skin<br/>\n23: Fighter(2): Epic Weapon Focus: Kukri<br/>\n24: Fighter(3): STR+1, Epic Skill Focus: Discipline, (STR=22)<br/>\n25: Ranger(22)<br/>\n26: Ranger(23): Epic Prowess<br/>\n27: Fighter(4): Weapon Specialization: Kukri, Epic Weapon Specialization: Kukri<br/>\n28: Ranger(24): STR+1, (STR=23)<br/>\n29: Ranger(25): Favored Enemy: Elves<br/>\n30: Ranger(26): Great Strength I, Favored Enemy: Humans, (STR=24)<br/>\n31: Ranger(27)<br/>\n32: Ranger(28): STR+1, (STR=25)<br/>\n33: Ranger(29): Great Strength II, Favored Enemy: Dwarves, (STR=26)<br/>\n34: Ranger(30): Favored Enemy: Half-Orcs<br/>\n35: Ranger(31)<br/>\n36: Ranger(32): STR+1, Great Strength III, Favored Enemy: Halflings, (STR=28)<br/>\n37: Ranger(33)<br/>\n38: Assassin(1)<br/>\n39: Ranger(34): Great Strength IV, (STR=29)<br/>\n40: Ranger(35): STR+1, Favored Enemy: Giants, Favored Enemy: Magical Beasts, (STR=30)<br/>\n<br/>\nHitpoints: 396<br/>\nSkillpoints: 293<br/>\nSaving Throws (Fortitude/Will/Reflex): 22/18/18<br/>\nSaving Throw bonuses: <br/>\nBAB: 30<br/>\nAB (max, naked): 44 (melee), 33 (ranged)<br/>\nAC (naked/mundane armor/shield only): 22/32<br/>\nSpell Casting: Ranger(4)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 43(43), Discipline 43(63), Hide 43(45), Listen 40(42), Move Silently 43(45), Tumble 40(42), UMD 41(40)<br/>\n<br/>\nI will talk more about DEX Rangers when I have time, and the above build is just a guideline. Other possible tweaks are lowering DEX to 8 to start with 18 STR, or swapping DEX  for CON. I didn't do that because I planned on using a chain shirt to approach enemies while hiding and hit them with KD and several attacks per round (generally enough to wipe the floor with them) before they can even attack. If you get them by surprise, they're as good as dead with this type of build. For the situations in which you need to engage, I have Improved Expertise for when AC is needed, like against PMs with Epic Warding, etc... The reason for me going with 14 DEX is because it's tweaked for WoG, where there is a certain item that will grant you Shield AC (not a shield) and it also boosts DEX by 2, so I can use a Chain Shirt thanks to the Cat's Grace spell (which is near indispellable in this build). With those and Improved Expertise, I can get around the AC deficiencies in situations that require.<br/>\n<br/>\nI'll explain to you the characteristics of DEX-based melee rangers and archers later on, cuz now I don't have time.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:22 PM - Jun 17, 2013",
      "content": "<div>Ok, before my next student comes in, let me try to talk a bit more about DEX rangers.<br/>\n<br/>\nBasically, DEX rangers can be Archers or Meleers. This type of build synergizes more with the overall skillset, IMO. Why? Because:<br/>\n<br/>\n- Rangers get the dual-wielding feats for free ONLY WHEN WEARING LIGHT ARMOR. The only way to wear a light armor and not have abysmal AC is to go DEX.<br/>\n<br/>\n- Rangers get the Cat's Grace spell, and Camouflage and Mass Camouflage boosts in this type of build are more significant, as your base scores will be much higher than in a STR build in terms of Stealth skills.<br/>\n<br/>\n- Rangers get Set Trap as a class skill. Sure a STR-based Ranger can set up to deadly traps, but why would he waste his time setting traps if he can obliterate you with a couple of blows? Traps are a good alternative source of damage for toons who need ways of doing damage, not for 2-handed juggernauts. <br/>\n<br/>\n- Rangers get Hide and Move Silently as class skills and many skill points per level, which generally synergizes well with Sneak Attack or Death Attack and HiPS. The fact that Rangers get these skills allow them to fit requirements for Assassin and Shadowdancer (not the Tumble one).<br/>\n<br/>\n- Rangers have Favored Enemies and Bane of Enemies to provide a nice source of damage against their FEs. This bit works well with STR and DEX toons alike. For STR it increases an already sick damage output, for DEX it gives a good alternate source of damage.<br/>\n<br/>\nIn both situations (Melee and Archer), DEX-based Rangers have to find a way to DO DAMAGE, but they have many tools at their disposal to achieve that goal. First, melee ones: going Ranger Rogue Shadowdancer is VERY COMMON because of the Hiding and Dex buffs from Camouflage, Mass Camouflage (which stack with each other) and Cat's Grace. Rogue comes in as an alternate source of damage through Sneak Attacks and supplies the skill points to invest in trap skills, both good alternate sources of damage, and SD ices the cake with HiPS. Bane of Enemies takes care of the damage versus FEs, but not against anything else. Strategically choosing the FEs in this type of build is mandatory. If you are playing PvM, try to choose FEs that are immune to criticals and sneaks and/or have DR, and for PvP, choose player base races.<br/>\n<br/>\nArchers normally go the Arcane Archer route, which grants sick damage output.<br/>\n<br/>\nPlease note that I'm mostly referring to Ranger as a main class builds. There are also those who get just a couple of levels for free dual-wielding feats.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "9:46 PM - Jun 17, 2013",
      "content": "<div>OK, I'm done working for today. So, in answer to your question, I like the Grim Ripper as a damage dealer more than both of the presented builds. The Wildwood Minstrel is a more well rounded character, and the Elfbane is a good meleer who lacks in defense a little less than the Grim Ripper, but deals less damage in turn. For a HiPS setting, all out offense might be your best bet. Or you can significantly alter the choice and go with a Ranger AA build for archery with HiPS as an escape mechanism to avoid melee confrontation, although I have always preferred Called Shot to that end.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "3:33 AM - Jun 18, 2013",
      "content": "<div>Wow! Thanks for all the good ideas and tips! After looking over the Str. and Dex. builds I think I will be going Str. Dex is a good way to go too, but I think I want a hard hitter that's up front. I read your post \"A Complete Guide to the Basics of Character Building and looks like I am good for the BAB cause the Ranger and Fighter are both in the GOOD range. So for the spread I would start ranger and do all the Assassin lvls post epic? Also I really like the 10 lvls of assassin cause of the Imp Invisy but also the server has given the Assassin so good bonuses. Here they are:<br/>\n<br/>\n Assassin levels count as half levels for purposes of resisting dispels, in the same manner as Pale Masters, Paladins, and Rangers. <br/>\nAssassins Ghostly Visage is a Free Action<br/>\n On Assassin level 4 they can cast True Strike 1x/day as a level 5 caster. An assassin's true strike spell lasts for 18 seconds (3 rounds), which is double the duration of the standard mage spell.<br/>\n On Assassin level 5 they receive a stealth ability usable 1x/day. The ability gives + 1 hide/ms per 2 Assassin levels for 2 rounds per Assassin level.<br/>\n On Assassin level 6 they can cast Cat's Grace 1x/day as a level 15 caster.<br/>\n On Assassin level 10 they get Permanent Ultravision<br/>\n On Assassin level 11 they can cast Fox's Cunning 1x/day as a level 15 caster.<br/>\n On Assassin level 15 they can cast Freedom of Movement 1x/day as a level 7 caster.<br/>\n On Assassin level 15 the Improved Invisibility feat improves to 60% concealment.<br/>\n On Assassin level 20 they can cast Clairaudience/Clairvoyance 3x/day as a level 15 caster.<br/>\n On Assassin level 20 Improved Ghostly Visage - Assassin becomes Ethereal for 1rd<br/>\n On Assassin level 30 Improved Ghostly Visage - Assassin becomes Ethereal for 2rds <br/>\n<br/>\nMost importantly, when an Assassin reaches their 10th level, they are given a vial containing the venom of Lolth herself... here are the details: <br/>\n<br/>\n1. Assassin uses poison. <br/>\n<br/>\n2. Poison is applied to weapon in main hand (does not work on unarmed attack, ranged weapons, or bludgeoning weapons). <br/>\n<br/>\n3. Poison will stay on weapon until a target is hit, or 1 round per Assassin level, whichever is shorter. <br/>\n<br/>\n4. Assassin hits creature. If target is currently attacking another creature or casting a spell, the target isn't vulnerable. Target must make a fortitude save or die. DC is 5 + Assassin Level + Intelligence modifier. <br/>\n<br/>\nDC increases by an accumulative +1 if underground, +1 if in Menzoduran, and +1 if in the Temple of Lolth. So for example, the DC is 8 + Assassin Level + Intelligence modifier in the Temple of Lolth (located in Menzoduran). <br/>\n<br/>\nImmunity to death magic, sneak attacks, critical hits, poison, and paralysis do not help the target avoid the destructive power of Lolth's venom. However, non-living creatures are immune. <br/>\n<br/>\nNote: regular Assassin death attack remains unchanged (its hard-coded). <br/>\n<br/>\n5. Poison cannot be reapplied for 5 minutes or until the Assassin rests, whichever duration is shorter. Poison cannot be applied while Assassin is in combat or while a living hostile creature is nearby. Poison also cannot be applied to weapon while assassin is ethereal, and going ethereal removes the poison from an assassin's weapon. <br/>\n<br/>\n6. Finally, Lolth is not pleased with those who use her power against her beloved. <br/>\n<br/>\nThe only thing I am worried about is if I go that route I have to take all 4 fighter lvls before 20. If I do that I will not get any of the Fighter epic feats, right? Like Epic weapon focus, Armor Skin or Epic weapon special? If that is the case would taking the 6 Fighter lvls and only 5 Assassins lvls make for a better hard hitter? I would get an extra epic fighter feat as well with the 6th lvl of fighter? In your opinion what would be the best route? Being they made Assassins BAD as for a 1/2 in the BAB but that really doesn't matter if I take them all post epic right? Thanks again for your time.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "3:42 AM - Jun 18, 2013",
      "content": "<div>Also I was wondering why the 43 in Concentration?</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:00 AM - Jun 18, 2013",
      "content": "<div><blockquote><div><strong>campgod wrote:</strong>Also I was wondering why the 43 in Concentration?</div></blockquote>\n\nResisting Taunts if someone tries to lower your AC and to cast Camouflage or Mass Camouflage in combat to HiPS out of a fight with less chance of being detected.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "4:19 AM - Jun 18, 2013",
      "content": "<div>Wow....So I just started to put it on paper and looked up some more things on the site and found out theres fraction restrictions. I can not be a ranger and Assassion due to the fractions there...sorry to waste your time. I guess I need to figure something else out.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "4:25 AM - Jun 18, 2013",
      "content": "<div>I still like the Ranger/Fighter idea, just need to see what else I should take with it.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:06 PM - Jun 18, 2013",
      "content": "<div><blockquote><div><strong>campgod wrote:</strong>Wow....So I just started to put it on paper and looked up some more things on the site and found out theres fraction restrictions. I can not be a ranger and Assassion due to the fractions there...sorry to waste your time. I guess I need to figure something else out.</div></blockquote>\n\nI gave you a lot of information besides the build itself, if you learned something then my time hasn't been wasted. Besides, you can still pick the Grim Ripper, which is better at damage dealing than my build</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "3:41 AM - Jun 19, 2013",
      "content": "<div>In that aspect it wasn't a waste of time at all. Thanks again for all your help Max. That Ranger/Fighter/assassin build sounded/looked nice though.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "6:04 AM - Jun 19, 2013",
      "content": "<div>The scythe is changed a bit on this server it only does slashing damage, with that said is that still a better choice over lets say a two-bladed sword? I also was looking at Grizzled_dwarflord's Brood of the mountain's. <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build196232.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 96232.html</a>. Say if I did take the 2 bard lvls back to back at lvl 16 and 17 would that effect the BAB up? I know I will lose most of the Tumble dump that it would of if I could take it at lvl 40, but cant because of my server's setting. At lvl 21 and 24 took Great Str. instead of the Over/Dev crit feats. I could also get rid of  the feats at 3,6,9 Power att.,cleave, and great cleave for something else? not sure what but I'm sure there is something better. I guess my question is, with all these changes would it just mess up the build all together, and would the Grimm Ripper just be a better choice anyhow? Thanks again for your time.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:07 AM - Jun 19, 2013",
      "content": "<div><blockquote><div><strong>campgod wrote:</strong>The scythe is changed a bit on this server it only does slashing damage, with that said is that still a better choice over lets say a two-bladed sword? I also was looking at Grizzled_dwarflord's Brood of the mountain's. <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build196232.html\" rel=\"noreferrer\" target=\"_blank\">http://home.comcast.net/~worldofgreyhaw ... 96232.html</a>. Say if I did take the 2 bard lvls back to back at lvl 16 and 17 would that effect the BAB up? I know I will lose most of the Tumble dump that it would of if I could take it at lvl 40, but cant because of my server's setting. At lvl 21 and 24 took Great Str. instead of the Over/Dev crit feats. I could also get rid of  the feats at 3,6,9 Power att.,cleave, and great cleave for something else? not sure what but I'm sure there is something better. I guess my question is, with all these changes would it just mess up the build all together, and would the Grimm Ripper just be a better choice anyhow? Thanks again for your time.</div></blockquote>\n\nWith a two-bladed sword you will need the dual-wield feats, which meand you wont be able to wear heavy armor. Scythe is a slashing weapon everywhere, man, so I don't understand what you mean when you say it's changed to be a slashing weapon, it IS a slashing weapon. The one that does two damage types is the Halberd AFAIK. <br/>\n<br/>\nYou can go Ranger 26 Bard 4 RDD 10. You lose nothing, you gain 2 more skill dumps and that solves your problem. For purposes of BAB, Bard 2 is the same as Bard 1. To maintain BAB at full you would need to take only Ranger levels from 1-20, but since that isn't possible where you play, just make sure you don't take any RDD levels before 20 too so that you lose yet another BAB point.<br/>\n<br/>\nI only skimmed through the build and since I have no time, that's all I'll be able to do. I hope it's good enough.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "WhiZard",
      "avatar": "no_avatar.png",
      "timestamp": "11:19 PM - Jun 19, 2013",
      "content": "<div>Scythe is by default is part of the piercing/slashing family.  Other piercing/slashing weapons include the halberd and the creature claw item.  Both the halberd and the scythe can be affected by keen edge, and any enhancement bonus (for the sake of stacking) acts as an attack bonus plus a slashing damage bonus.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:52 AM - Jun 20, 2013",
      "content": "<div><blockquote><div><strong>WhiZard wrote:</strong>Scythe is by default is part of the piercing/slashing family.  Other piercing/slashing weapons include the halberd and the creature claw item.  Both the halberd and the scythe can be affected by keen edge, and any enhancement bonus (for the sake of stacking) acts as an attack bonus plus a slashing damage bonus.</div></blockquote>\n\nHow did I not know that? I stand corrected then!</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "1:09 AM - Jun 20, 2013",
      "content": "<div>Thanks guys once again for your help.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "9:58 PM - Jun 20, 2013",
      "content": "<div>I hope I'm not getting annoying here with all these questions... I see mostly 26 Ranger/4 Bard/10 RDD. But with the lvling restrictions for my server do you think I could do a 24 Ranger/6 Bard/10RDD? 24 Ranger would give me 5 FE's on this server and the 6 lvls would let me take them anywhere in the build. That being said I could take ranger 1-20 for the best BAB and put one lvl bard at the end to dump Skill points? Also how many points in Wis and Cha would I need to cast all of the Rangers spell's and at least 4 lvls of Bard? 14 and 14? I would like to have Imp invisy and the haste spell since my server has no perma haste items. I have no idea how to figure the starting abilities, like how any points in what? Thank you for your time.</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "10:54 PM - Jun 20, 2013",
      "content": "<div>1 - Ranger 1 --- WP Exotic (OR Toughness later), WF, FE I<br/>\n2 - Ranger 2<br/>\n3 - Ranger 3 --- Power Attack<br/>\n4 - Ranger 4<br/>\n5 - Ranger 5 --- FE II<br/>\n6 - Ranger 6 --- Cleave<br/>\n7 - Ranger 7<br/>\n8 - Ranger 8<br/>\n9 - Ranger 9 --- Improved Critical<br/>\n10 - Ranger 10 --- FE III<br/>\n11 - Ranger 11<br/>\n12 - Ranger 12 --- Blind Fight<br/>\n13 - Ranger 13<br/>\n14 - Ranger 14<br/>\n15 - Ranger 15 --- Great Cleave, FE IV<br/>\n16 - Ranger 16<br/>\n17 - Ranger 17<br/>\n18 - Ranger 18 --- Curse Song<br/>\n19 - Ranger 19<br/>\n20 - Ranger 20<br/>\n21 - Ranger 21 --- Bane of Enemies, FE V<br/>\n22 - Bard 1<br/>\n23 - Bard 2<br/>\n24 - Red Dragon Disciple 1 --- EWF<br/>\n25 - Red Dragon Disciple 2<br/>\n26 - Red Dragon Disciple 3<br/>\n27 - Bard 3 --- Epic Prowess<br/>\n28 - Red Dragon Disciple 4<br/>\n29 - Red Dragon Disciple 5<br/>\n30 - Red Dragon Disciple 6 --- Armor Skin<br/>\n31 - Red Dragon Disciple 7<br/>\n32 - Red Dragon Disciple 8<br/>\n33 - Red Dragon Disciple 9 --- Great Strength I<br/>\n34 - Red Dragon Disciple 10<br/>\n35 - Bard 4<br/>\n36 - Bard 5 --- Epic Skill Focus (taunt)or Great Strength II<br/>\n37 - Bard 6<br/>\n38 - Bard 7<br/>\n39 - Bard 8 --- Lingering Song or Lasting Inspiration(which increase soong to 50 rounds) orGreat Strength III<br/>\n40 - Bard 9<br/>\n This is my cut up version of the \"Dancing Blades\" build by Johannhowizer. I took out Over/Dev crit. and put in Epic Prowess and Armor skin Does this work at all? I would have to to replace Power Att.,Cleave, and Great Cleave with what, am not sure. I still would like the Imp invisy and Haste from the 4th lvl Bard spellbook. Once again not sure how to configure the starting abilities Str,Dex,Con,Int,Wis. I could also drop the lvl9 Bard and take ranger? The bonus from bard song at lvl 9 is the same as lvl 8 on my server. I would still get 5 FE's with a 21/9/10 build and the 24/6/10 not sure what the benefits of taking one over the other? Thanks to anyone who has any ideas for me. If I can do a 25/5/10 I could get one more FE's, which would make it 6 total.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:03 AM - Jun 21, 2013",
      "content": "<div>Honestly, that is a terrible build, mate. No offense, but too many imprecisions that it's not even worth saving. The spread is awful, you can't take Curse song without having Bard song and if you aren't going for Devcrit, then why would you keep Power Attack, Cleave and Great Cleave? Furthermore, if you want Bane of Enemies, it is good when you actually have many enemies to apply the bonus damage to, so why would you drop Ranger levels that would give you extra feats for Bard levels that will give you VERY LITTLE (a handful of skill points and a few dispellable and low duration spells) in return?<br/>\n<br/>\nI would stick with Tyr Templar's build as she is the meleer elder of the guild, and if you want to make it accessible in your server, go Ranger 25 Bard 5 RDD 10 and choose one feat to drop. You will have access to Improved Invisibility and haste via scrolls or wands, just not of spells. Worst case scenario, carry around some potions of Haste.<br/>\n<br/>\nNow, I will be very honest with you, maybe even blunt, although my intention is the best possible (to try to get you to understand more about NWN character building). Judging by your questions and the build you have just posted, I have to say that you just are not equipped to understand the advice that is being given to you. I have been in that position in the past, and it's not a fun spot to be in. In truth, you have a long way ahead of you to get to a point where you have enough information to actually understand what we are talking about when we propose some things to you. You can start by reading my guide about character building. Once the info there sinks in, you may start delving deeper into the classes. Here is a link:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/a-complete-guide-to-the-basics-of-character-building-t515440.html\" rel=\"noreferrer\" target=\"_blank\">Guide to the basics of building</a><br/>\n<br/>\nI hope I have not offended you. Again, that was not my intention. I wish you all the best in beginning your learning process.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "campgod",
      "avatar": "no_avatar.png",
      "timestamp": "4:26 AM - Jun 21, 2013",
      "content": "<div>Alright and thanks for your help</div>"
    }
  ]
}