{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "217",
  "name": "A support Class?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/a-support-class-t2354445.html",
  "author": "Illusion",
  "avatar": "no_avatar.png",
  "replies": "14",
  "views": "1.4K",
  "posts": [
    {
      "author": "Illusion",
      "avatar": "no_avatar.png",
      "timestamp": "5:04 AM - Jun 05, 2015",
      "content": "<div>Hello there, my name is Illusion. I have come for your help in a problem I have run into, as such I should go onto explain some things, before I go into anything I want to make, I should probably go into what's changed on the server I chose to play on (only one I could find, but it shall be good regardless) <ul><li>A Level 30 server named Arelith.</li> <li>Class changes are mostly none existence except sub-classes Bard gains warlock etc, but this is not my intent, though you can get gifts that do different things</li> <li>It seems AA, BG, DC, DD, SD, and WM are free reign, the others require permission, as such I would like to remain in these if needed.</li> </ul> Now here comes the long part, I've played a warrior, mage, and that was all fun. But, I decided to take a route less traveled. I wanted to make a support character, I suppose I should go on, I wanted to make a bard, but wondered if a pure bard was a bad idea, now here are some bullets though I know somethings have a negative impact perhaps. <ul><li>I wanted to make it a dwarf regardless of the current situation of it getting a -2 to its CHA.</li> <li>I have no specific weapon in mind actually, so that itself would be free reign.</li> <li>I wanted it to be capable of support, so I'm not looking for a solo major big number one shotting paladin. Some survivability solo would be nice, but it's majority, I would like to focus on buffing, (and if possible healing)</li> <li>I did not know if leaving it a pure bard would be good or not, I've read the guides here and while informative, that multiple classes can be better than a pure one, this can sometimes be a rare case, not many people I see aren't wanting a power build.</li> </ul> Now whilst I said all that there are a few things I did want to say beforehand, they aren't really necessary to the character itself but, <ul><li>I don't want a build handed to me, I may not know the ways of making one, but I'd rather be apart of making my character (if someone is willing to teach me all the better). Getting a build tossed at me is no fun in comparison to at least helping forge it myself.</li> <li>I'm not looking for the Ultimate Build, as there is no such thing, I'm looking for help to create something with practical use in PvE, and PvP.</li> </ul> If I missed giving any information that is needed please tell me, and I look forward to discussing it with you all.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:55 PM - Jun 05, 2015",
      "content": "<div>Hello Illusion and welcome as an aspiring builder!<br/>\n I hear you. You want a support character.<br/>\n Bard is a good choice. Bards can do a lot of support. Actually bard is one of the best classes to make versatile POWER builds. When you use the same features for support, you get a very versatile and powerful support character.<br/>\n Bards use the songs, skills and spells for party support. They can also be very powerful in combat, if you think that counts as support.<br/>\n<br/>\n You want to build the character with some aid from us. You seem undecided if you want a pure bard or not. 16 bard levels is a sweet spot if you want most song value from your investment. 20 or 21 levels will give you LI for almost permanent song effect. 24 levels will give undispellable spells. <br/>\n<br/>\n I suggest that you make a temporary attempt at a build, and then we can guide you further.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Illusion",
      "avatar": "no_avatar.png",
      "timestamp": "10:16 PM - Jun 05, 2015",
      "content": "<div><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>Hello Illusion and welcome as an aspiring builder!<br/>\n I hear you. You want a support character.<br/>\n Bard is a good choice. Bards can do a lot of support. Actually bard is one of the best classes to make versatile POWER builds. When you use the same features for support, you get a very versatile and powerful support character.<br/>\n Bards use the songs, skills and spells for party support. They can also be very powerful in combat, if you think that counts as support.<br/>\n<br/>\n You want to build the character with some aid from us. You seem undecided if you want a pure bard or not. 16 bard levels is a sweet spot if you want most song value from your investment. 20 or 21 levels will give you LI for almost permanent song effect. 24 levels will give undispellable spells.<br/>\n<br/>\n I suggest that you make a temporary attempt at a build, and then we can guide you further.</div></blockquote>\n<div align=\"left\">You very well seem to know what you're talking about, I appreciate the response, if I was to make a support do you think the 24 levels would be better then? Giving undispellable spells (Minus that Mordenkainen's disjunction if that can dispel it, which worries me because I hear people can just put that on a wand and have it 24/7. And if such what is your recommedation for the last 6 levels? I was thinking bards can be lawful apparently (after creation) So, I was thinking monk, but then a Sorcerer might better benefit from it as well correct? Seeing as it may potentially bring in spells I don't have, whilst also gaining from CHA much like the bard. If they can be powerful allies in combat, it still reigns as support to me, I just wanted to try something different from the pew pew magic missles, pew pew arrows, cut cut pure sword brute.</div></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:00 AM - Jun 06, 2015",
      "content": "<div>I will recommend that you focus on what you want the character to be able to do and how far bard can take that. Then we can see what other classes can bring to that build idea. Don't clutter it up now with all kind of thinking on \"a liittle bit of this and some of that\" from all kind of classes. If you want to learn, start with something simple. That also gives focus and makes the build sound.<br/>\n Are you willing to try and make an attempt with pure bard, just to get the feel with the class? (nudge, nudge)<br/>\n You want to max out song with as high perform as you can reasonably get. You want curse song and lasting inspiration. You want at least charisma 16 to be able to cast all spells. What spells to pick can wait for later. And then you have to make a decision between focus on strength or dexterity if you want any combat prowess at all. There are many skills to choose from and you don't have more than 4 + int modifier skillpoints per level, so you have to pick wisely, depending on what you want your character to be able to do. A high intelligence gives more skillpoints. Most bards I've seen have intelligence 14.<br/>\n<br/>\n As for your questions:<br/>\n Undispellable means that your character has a higher caster level than what can be touched with lesser dispel (level 14), dispel magic (level 19) and greater dispelling (level 24). Those are the weapons of bards, clerics and druids, so you are safe from them once you have caster level 24.<br/>\n Mages also have the breach line of spells and MD. Indispellability is not a guarantee against those spells. MD works both as a powerful breach spell and a dispell spell. You would need a character with 49 caster levels to be immune to the <em>dispel </em>effect form MD of a level 40 dispeller. The toolkit item based MD on the other hand has dispeller level 17 and you should be safe from that with 26 caster levels. But you will not be safe from the <em>breach</em> effect of MD.<br/>\n<br/>\n We may well end with 24 bard levels like you suggest, but let us not start with the end, shall we?<br/>\n<br/>\n Now the ball is with you.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Illusion",
      "avatar": "no_avatar.png",
      "timestamp": "12:20 AM - Jun 06, 2015",
      "content": "<div><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>I will recommend that you focus on what you want the character to be able to do and how far bard can take that. Then we can see what other classes can bring to that build idea. Don't clutter it up now with all kind of thinking on \"a liittle bit of this and some of that\" from all kind of classes. If you want to learn, start with something simple. That also gives focus and makes the build sound.<br/>\n Are you willing to try and make an attempt with pure bard, just to get the feel with the class? (nudge, nudge)<br/>\n You want to max out song with as high perform as you can reasonably get. You want curse song and lasting inspiration. You want at least charisma 16 to be able to cast all spells. What spells to pick can wait for later. And then you have to make a decision between focus on strength or dexterity if you want any combat prowess at all. There are many skills to choose from and you don't have more than 4 + int modifier skillpoints per level, so you have to pick wisely, depending on what you want your character to be able to do. A high intelligence gives more skillpoints. Most bards I've seen have intelligence 14.<br/>\n<br/>\n As for your questions:<br/>\n Undispellable means that your character has a higher caster level than what can be touched with lesser dispel (level 14), dispel magic (level 19) and greater dispelling (level 24). Those are the weapons of bards, clerics and druids, so you are safe from them once you have caster level 24.<br/>\n Mages also have the breach line of spells and MD. Indispellability is not a guarantee against those spells. MD works both as a powerful breach spell and a dispell spell. You would need a character with 49 caster levels to be immune to the <em>dispel </em>effect form MD of a level 40 dispeller. The toolkit item based MD on the other hand has dispeller level 17 and you should be safe from that with 26 caster levels. But you will not be safe from the <em>breach</em> effect of MD.<br/>\n<br/>\n We may well end with 24 bard levels like you suggest, but let us not start with the end, shall we?<br/>\n<br/>\n Now the ball is with you.</div></blockquote>\n<div align=\"left\">All very good points, it might be wise to attempt a pure bard, but I don't really have an area to test that outside of the Original Campaign, and even that's not a excellent testing grounds. Perhaps, it might be wise to test out a pure bard and see what's what, before deciding the best way to cut out, and see what's capable of going alongside it in synch, it seems 24 levels would help greatly, I found some new knowledge myself, making a wand with MD is expensive, very much so to the point unless someone is exploiting they likely won't have more than one, it's a danger, but lots of other mages seem to love their other dispels in favor of saving the final spells for more variety. Would the OC, or other three campaigns be suitable testing grounds or?</div></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:26 AM - Jun 06, 2015",
      "content": "<div>To make a build, use pen and paper, or kamiryn's character build calculator (CBC), an EXCEL sheet that let you try different build approaches, and does the math for you.<br/>\n To test the builds, there are modules you can download that give you the xp and items you want, so you can build the characters level by level without playing them to get xp. They usually have an \"arena\" where you can test your build vs various creatures. I have tested two such modules called \"novice to epic character maker\" and \"pretty good character creator\". You can download it all from neverwintervault.org<br/>\n  </div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Illusion",
      "avatar": "no_avatar.png",
      "timestamp": "1:28 AM - Jun 07, 2015",
      "content": "<div><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>To make a build, use pen and paper, or kamiryn's character build calculator (CBC), an EXCEL sheet that let you try different build approaches, and does the math for you.<br/>\n To test the builds, there are modules you can download that give you the xp and items you want, so you can build the characters level by level without playing them to get xp. They usually have an \"arena\" where you can test your build vs various creatures. I have tested two such modules called \"novice to epic character maker\" and \"pretty good character creator\". You can download it all from neverwintervault.org<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Although, it wasn't a direct good way to test, I used the OC campaign. It seemed to go well to an extent, it's usefulness is undeniable, but it's versatility as a pure bard is woefully lacking. It will likely need to be cut off at some point, I've yet to find a perfect way to mesh that, from the looks of it, without going a fighter/bard hybrid, those six other levels would definitely be crucial. From the knowledge I've gathered everyone doesn't seem to bother will low level dispels, rather they go with MD around 95% of the time. The breach will be a big problem, but the spells on both sides limited, it will be quite troublesome to find something optimal.</div></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:17 AM - Jun 07, 2015",
      "content": "<div>To sum it up: So far we have only covered undispellability of spells and the problem with MD vs. buffing spells. That applies to all caster classes, not only bard. If spellcasting is your only focus, then bard may not be the best support class around.  You have given some reason for not going pure bard. But you have not told exactly what you feel that the bard class lacks.<br/>\n<br/>\n 1) I think we have come to a point where we must boil things down to what you want your support character to be able to do, what kind of support you want to be able to give.<br/>\n 2) If you don't want a complete build tossed at you, then post a a temporary build here (pure or not pure) so we have something to work with.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Illusion",
      "avatar": "no_avatar.png",
      "timestamp": "9:22 PM - Jun 08, 2015",
      "content": "<div><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>To sum it up: So far we have only covered undispellability of spells and the problem with MD vs. buffing spells. That applies to all caster classes, not only bard. If spellcasting is your only focus, then bard may not be the best support class around.  You have given some reason for not going pure bard. But you have not told exactly what you feel that the bard class lacks.<br/>\n<br/>\n 1) I think we have come to a point where we must boil things down to what you want your support character to be able to do, what kind of support you want to be able to give.<br/>\n 2) If you don't want a complete build tossed at you, then post a a temporary build here (pure or not pure) so we have something to work with.</div></blockquote>\n<div align=\"left\">Well I played around with the bard, did the buffs, did some dex, and I didn't find it as quite good as I thought it would be, now bare in mind, the buffs they can do are amazing and helpful no doubt about it. I thought about healing, but then if people can just buy potions of heal, to fully restore themselves I don't think that's as viable as I would like. I mean it could be, I think clerics have ressurrection, but they also have scrolls, though expensive.Is there even such a thing as a support ...wizard? I'm opening up my options quite a bit actually, I still do want a support character, but maybe the 'buff-bot' isn't what I'D have fun playing. Get back to me when you can, as soon as we figure this bit out, I can try and make a temporary build?</div></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:16 PM - Jun 09, 2015",
      "content": "<div>The best support action of the bard is the tremendous bonus a party gets from the bard song and curse song combination, especially with high level songs. We are talking about great alterations of AB and AC and  manipulation of saves and skills for the party and the opposing mob. The song effects can not be dispelled or breached. You can even sing and remain stealthed.<br/>\n Good party spells include GMW, haste and mass haste, improved invisibility and the ability buffs. There are also several utility spells. The bard healing spells are of limited value, potions are better when available. <br/>\n The skillset benefits the bard in a great way. Several skills will also help a party. The Taunt skill will  help the lower the AC of opponents and will benefit the whole party. Appraise and Persuade/Bluff are there for gold, and RP. Listen empowered by the amplify spell for scouting. Bards are good at identifying items, they have a high lore skill, even without taking any ranks, and can buff it with spells and song. <br/>\n Bards are not specialized healers, but can as support character take the heal skill up in the 40s/50s with a high level song. That has some use to save fallen comrades with healing kits, when they are about to bleed to death (Death model with death at -10 hp).<br/>\n<br/>\n A multiclass option for support bards is rogue, for extra thieving- and trapskills, skillpoints, and uncanny dodge + evasion. <br/>\n Shadowdancer is also a great defensive alternative for stealth builds if you can get HIPS, to make you the last man standing.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Illusion",
      "avatar": "no_avatar.png",
      "timestamp": "11:52 PM - Jun 09, 2015",
      "content": "<div><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>The best support action of the bard is the tremendous bonus a party gets from the bard song and curse song combination, especially with high level songs. We are talking about great alterations of AB and AC and manipulation of saves and skills for the party and the opposing mob. The song effects can not be dispelled or breached. You can even sing and remain stealthed.<br/>\n Good party spells include GMW, haste and mass haste, improved invisibility and the ability buffs. There are also several utility spells. The bard healing spells are of limited value, potions are better when available.<br/>\n The skillset benefits the bard in a great way. Several skills will also help a party. The Taunt skill will help the lower the AC of opponents and will benefit the whole party. Appraise and Persuade/Bluff are there for gold, and RP. Listen empowered by the amplify spell for scouting. Bards are good at identifying items, they have a high lore skill, even without taking any ranks, and can buff it with spells and song.<br/>\n Bards are not specialized healers, but can as support character take the heal skill up in the 40s/50s with a high level song. That has some use to save fallen comrades with healing kits, when they are about to bleed to death (Death model with death at -10 hp).<br/>\n<br/>\n A multiclass option for support bards is rogue, for extra thieving- and trapskills, skillpoints, and uncanny dodge + evasion.<br/>\n Shadowdancer is also a great defensive alternative for stealth builds if you can get HIPS, to make you the last man standing.</div></blockquote>\n<div align=\"left\">Yes,... I think  I understand your reasoning. Shadowdancer gets +1 to hide, they removed HIPS last I checked. But, I see your point, bard can be helpful, it just depends on how it's used, your idea has interested me, lore I hear allows you to understand other languages sometimes (there's a language system) I kinda like it, but I don't see how there would be nearly enough skill points for most of that, (with the dwarf at least)</div></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:36 PM - Jun 10, 2015",
      "content": "<div>Hey there, Illusion. <br/>\n<br/>\n Bards take a little while to mature into a powerhouse, so that may be why you're having problems in your testing. They're very limited early on, but their growth from levels 13-16 is amazing. However, if you've never used one, there might be things that you simply aren't aware of that you character can do. I'd take Mick's advice on this. Try to cough up a Bard 26 / Fighter 4 with all 4 Fighter levels pre-epic or a Bard 24 / Fighter 6 with 4 Fighter levels pre-epic and we can go from there.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:01 PM - Jun 10, 2015",
      "content": "<div>Max, he wants a support character, and he doesn't want it just handed over. He wants to learn.<br/>\n Fighter for minor class is a great way to power-build bards, as is RDD. But he is not looking for a meat-grinder this time.<br/>\n<br/>\n Illusion, before we go any further, I want you to post a temporary build so we have something to work with.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "8:20 PM - Jun 12, 2015",
      "content": "<div>I know, Mick, but an extra attack per round and 3 extra feats won't hurt him. It'll leave him more extra feats to pick support stuff, such as extend spell.</div>"
    },
    {
      "author": "Illusion",
      "avatar": "no_avatar.png",
      "timestamp": "10:55 PM - Jun 12, 2015",
      "content": "<div><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>Max, he wants a support character, and he doesn't want it just handed over. He wants to learn.<br/>\n Fighter for minor class is a great way to power-build bards, as is RDD. But he is not looking for a meat-grinder this time.<br/>\n<br/>\n Illusion, before we go any further, I want you to post a temporary build so we have something to work with.</div></blockquote>\n<div align=\"left\">I will attempt this build, but it might take me a day or so, just wanted to message here as a way of saying I haven't forgotten of this, I just..have been unable to access the internet xD</div></div>"
    }
  ]
}