{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Bioware Legacy Builds",
  "forum_id": "008",
  "id": "007",
  "name": "Undead Lord: Wizard 6/Fighter 4/Pale Master 30",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/undead-lord-wizard-6-fighter-4-pale-master-30-t515472.html",
  "author": "HipMaestro",
  "avatar": "10235222_1510287070.jpg",
  "replies": "8",
  "views": "33.6K",
  "posts": [
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "3:49 AM - Sep 14, 2011",
      "content": "<div>The original build can found <a class=\"postlink\" href=\"http://web.archive.org/web/20100210144235/http://nwn.bioware.com/underdark/character_undeadlord.html\" rel=\"noreferrer\" target=\"_blank\">here</a>.<br/>\n<br/>\nBy Christopher \"cdaulepp\" Aulepp<br/>\nReformatted by HipMaestro &amp; pals, 110913 <br/>\n<br/>\nMindless zombies are scary. Brilliant wizards are scary. Heavily armoured warriors are scary. Combine all three together? That's the making of nightmares. The Undead Lord is a nightmare personified.<br/>\n<br/>\nWizard(6), Fighter(4), Pale Master(30), Human, Lawful Neutral (Any Non-good, per Hip 110913)<br/>\n<br/>\nSTR: 18 (26)<br/>\nDEX: 8<br/>\nCON: 12<br/>\nWIS: 8<br/>\nINT: 16 (20)<br/>\nCHA: 8<br/>\n<br/>\n01: Fighter(1): Power Attack, Cleave, Weapon Focus: Scimitar<br/>\n02: Wizard(1<br/>\n03: Wizard(2): Extend Spell<br/>\n04: Wizard(3): STR+1, (STR=19)<br/>\n05: Pale Master(1)<br/>\n06: Pale Master(2): Spell Penetration<br/>\n07: Pale Master(3)<br/>\n08: Pale Master(4): STR+1, (STR=20)<br/>\n09: Pale Master(5): Great Cleave<br/>\n10: Pale Master(6)<br/>\n11: Pale Master(7)<br/>\n12: Pale Master(8): STR+1, Greater Spell Penetration, (STR=21)<br/>\n13: Pale Master(9)<br/>\n14: Pale Master(10)<br/>\n15: Fighter(2): Still Spell, Improved Critical: Scimitar<br/>\n16: Fighter(3): STR+1, (STR=22)<br/>\n17: Wizard(4)<br/>\n18: Wizard(5): Toughness, Empower Spell<br/>\n19: Wizard(6)<br/>\n20: Fighter(4): STR+1, Weapon Specialization: Scimitar, (STR=23)<br/>\n21: Pale Master(11): Overwhelming Critical: Scimitar<br/>\n22: Pale Master(12)<br/>\n23: Pale Master(13): Epic Spell Penetration<br/>\n24: Pale Master(14): STR+1, Great Strength I, (STR=25)<br/>\n25: Pale Master(15)<br/>\n26: Pale Master(16): Epic Spell: Epic Mage Armor<br/>\n27: Pale Master(17): Devastating Critical: Scimitar<br/>\n28: Pale Master(18): INT+1, (INT=17)<br/>\n29: Pale Master(19): Epic Spell: Greater Ruin<br/>\n30: Pale Master(20): Great Intelligence I, (INT=18)<br/>\n31: Pale Master(21)<br/>\n32: Pale Master(22): INT+1, Epic Spell: Epic Warding, (INT=19)<br/>\n33: Pale Master(23): Automatic Still Spell I<br/>\n34: Pale Master(24)<br/>\n35: Pale Master(25): Automatic Still Spell II<br/>\n36: Pale Master(26): INT+1, Epic Weapon Focus: Scimitar, (INT=20)<br/>\n37: Pale Master(27)<br/>\n38: Pale Master(28): Automatic Still Spell III<br/>\n39: Pale Master(29): Armor Skin<br/>\n40: Pale Master(30): STR+1, (STR=26)<br/>\n<br/>\nHitpoints: 362<br/>\nSaving Throws (Fortitude/Will/Reflex): 24/22/15<br/>\nSaving Throw bonuses: Spells: +9<br/>\nBAB: 22<br/>\nAB (max, naked): 33 (melee), 21 (ranged)<br/>\nAC (naked/mundane armor/shield only): 31/42<br/>\n<br/>\nSkillpoints: 273<br/>\nConcentration 43(44), Discipline 23(31), Listen 30(29), Lore 20(25), Move Silently 30(29), Spellcraft 43(48), Spot 21(20), <br/>\nTumble 21(20)<br/>\n<br/>\n01: Concentration(4), Discipline(4), Lore(4), Spot(2), Tumble(2), Save(4), <br/>\n02: Concentration(1), Spellcraft(5), Save(4), <br/>\n03: Concentration(1), Spellcraft(1), Spot(1), Tumble(1), Save(4), <br/>\n04: Concentration(1), Spellcraft(1), Save(8), <br/>\n05: Concentration(1), Listen(8), Spellcraft(1), Spot(1), Tumble(1), <br/>\n06: Concentration(1), Listen(1), Move Silently(3), Spellcraft(1), <br/>\n07: Concentration(1), Listen(1), Move Silently(3), Spellcraft(1), <br/>\n08: Concentration(1), Listen(1), Move Silently(3), Spellcraft(1), <br/>\n09: Concentration(1), Listen(1), Move Silently(3), Spellcraft(1), <br/>\n10: Concentration(1), Listen(1), Move Silently(1), Spellcraft(1), Tumble(1), <br/>\n11: Concentration(1), Listen(1), Move Silently(1), Spellcraft(1), Tumble(1), <br/>\n12: Concentration(1), Listen(1), Move Silently(1), Spellcraft(1), Save(2), <br/>\n13: Concentration(1), Listen(1), Move Silently(1), Spellcraft(1), Save(4), <br/>\n14: Concentration(1), Listen(1), Move Silently(1), Spellcraft(1), Save(6), <br/>\n15: Discipline(12), <br/>\n16: Concentration(1), Discipline(3), Tumble(1), <br/>\n17: Concentration(2), Spellcraft(3), Save(1), <br/>\n18: Concentration(1), Spellcraft(1), Tumble(2), Save(1), <br/>\n19: Concentration(1), Spellcraft(1), Tumble(2), Save(1), <br/>\n20: Concentration(1), Discipline(4), Spot(1), <br/>\n21: Concentration(1), Listen(2), Move Silently(1), Spellcraft(2), <br/>\n22: Concentration(1), Listen(2), Move Silently(2), Spellcraft(1), <br/>\n23: Concentration(1), Listen(2), Move Silently(2), Spellcraft(1), <br/>\n24: Concentration(1), Listen(2), Move Silently(2), Spellcraft(1), <br/>\n25: Concentration(1), Listen(2), Move Silently(2), Spellcraft(1), <br/>\n26: Concentration(1), Listen(2), Move Silently(2), Spellcraft(1), <br/>\n27: Concentration(1), Listen(1), Lore(1), Move Silently(2), Spellcraft(1), <br/>\n28: Concentration(1), Spellcraft(1), Tumble(2), <br/>\n29: Concentration(1), Spellcraft(1), Tumble(2), <br/>\n30: Concentration(1), Spellcraft(1), Spot(1), Tumble(1), <br/>\n31: Concentration(1), Spellcraft(1), Spot(1), Tumble(1), Save(1), <br/>\n32: Concentration(1), Spellcraft(1), Spot(3), <br/>\n33: Concentration(1), Spellcraft(1), Spot(1), Tumble(1), Save(1), <br/>\n34: Concentration(1), Spellcraft(1), Spot(3), <br/>\n35: Concentration(1), Spellcraft(1), Spot(1), Tumble(1), Save(1), <br/>\n36: Concentration(1), Spellcraft(1), Spot(3), Save(1), <br/>\n37: Concentration(1), Spellcraft(1), Spot(2), Tumble(1), Save(1), <br/>\n38: Concentration(1), Lore(7), Spellcraft(1), <br/>\n39: Concentration(1), Lore(2), Spellcraft(1), Spot(1), Tumble(1), <br/>\n40: Concentration(1), Lore(6), Spellcraft(1), <br/>\n<br/>\n<strong>Background, Analysis and Comments by Author</strong> <br/>\n<br/>\nEquipment<br/>\nScimitar<br/>\nFull Plate Mail<br/>\nTower Shield <br/>\n<br/>\nOffensive Capabilities<br/>\nSummons: The Undead Lord's study of the necromantic arts has given him mastery over the undead, and as such, he can summon forth a demilich to fight at his side once per day. The lesser demilich is immune to spells level 3 and lower, giving him an edge against casters. The Undead Lord can also summon a skeleton warrior from the dead to fight with him. Finally, a panther accompanies the Undead Lord serving as a distraction with sneak attacks.<br/>\n<br/>\nDevastating Critical: Thanks to his combat feats and access to the \"keen edge\" spell, the Undead Lord scores critical hits on a 12-20, or 45%, of the time. With three normal attacks per round and one extra from haste, the Undead Lord can take down ancient dragons, or anyone else not immune to critical hits, in one blow.<br/>\n<br/>\nTrue Strike: With this spell, the Undead Lord gains a +20 attack bonus, though its effects are short-lived. True Strike should be saved for monsters that are harder to hit.<br/>\n<br/>\nReciprocal Damage: Each time an enemy strikes the Undead Lord they will take 1d6 + 12 acid damage from acid sheath, 1d6 + 6 fire damage from elemental shield, and 1d4 + 5 sonic damage from death armor.<br/>\n<br/>\nSpell Casting: Perhaps the true offensive power of the Undead Lord comes from access to all the wizard/sorcerer spells. The Undead Lord should focus on those spells that have no save, such as the Bigby's line of spells, to disable opponents. Power Word Kill and Power Word Stun are great to take down wounded enemies. You might also wish to cast an occasional Greater Ruin or empowered Isaac's Greater Missile Storm. This character has it all.<br/>\n<br/>\nSpells the Undead Lord should seek out are:<br/>\nLevel 9 - Mordenkainen's Disjunction, Power Word Kill<br/>\nLevel 8 - Mind Blank, Greater Sanctuary,<br/>\nLevel 7 - Shadow Shield, Bigby's Grasping Hand, Power Word Stun, Spell Mantle<br/>\nLevel 6 - Bigby's Forceful Hand, True Seeing, Isaac's Greater Missile Storm<br/>\nLevel 5 - Bigby's Interposing Hand, Energy Buffer<br/>\nLevel 4 - Improved Invisibility, Isaac's Lesser Missile Storm<br/>\nLevel 3 - Keen Edge, Greater Magic Weapon, Haste<br/>\nLevel 2 - Flame Weapon<br/>\nLevel 1 - True Strike<br/>\n<br/>\nDefensive Capabilities<br/>\nArmour Class: The Undead Lord has quite an impressive naked AC of 31! Thanks to his training as a fighter and the Automatic Still Spell feats, the Undead Lord can wear mundane full plate mail and a tower shield with no chance of disrupting his arcane spell casting. This brings the Undead Lord's AC to an impressive 42. The Undead Lord is extremely difficult to hit and the extra AC is handy against mobs of monsters. Good, Neutral, and Evil creatures alike will know the difficulty of hitting the Undead Lord whose AC will be a whopping 68 AC minimum after buffing with spells such as Haste, Mage Armor, Cat's Grace, and Epic Spell: Epic Mage Armor.<br/>\n<br/>\nConcealment: Combining the high armour with class with concealment obtained through Improved Invisibility and Bigby's Interposing Hand (no save), the Undead Lord is very difficult to hit.<br/>\n<br/>\nImmunity to Critical Hits: The Undead Lord invokes fear and awe in others because of his natural ability to resist critical strikes. He also gains benefits from his palemaster heritage, including immunity to hold, paralyzation, and stun. Watch and laugh as the pathetic weapon masters and rogues realize their folly when their main forms of attack are rendered useless against the Undead Lord.<br/>\n<br/>\nElemental Damage Reduction: With access to all the wizard spells through learning from scrolls, the Undead Lord can reduce elemental damage with spells such as Energy Buffer, Protection from Elements, Resist Elements, and Endure Elements.<br/>\n<br/>\nPhysical Damage Reduction: The Undead Lord has an astounding damage reduction of 50/+20 from epic warding. The above-average enemy, unable to score critical hits, will be hard pressed to overcome the Undead Lord's reduction before he is destroyed.<br/>\n<br/>\nMagical Item Preferences: With access to magical equipment, the Undead Lord becomes a foe that all dread to face. He should focus on items that increase intelligence for extra spell slots and strength for extra attack bonus and damage.</div>"
    },
    {
      "author": "codea",
      "avatar": "no_avatar.png",
      "timestamp": "1:33 PM - Jul 11, 2016",
      "content": "<div>I like this build so much, that I started playing OC with it. My question is if it a good build for finishing nwn + sou + hotu?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:20 PM - Jul 12, 2016",
      "content": "<div>Hi, codea - and welcome! <img class=\"img-emoji\" src=\"emoji/11.gif\"/><br/>\n<br/>\n I'm probably not the best person to advise you, given I've never played either Wiz or PM, but here are my thoughts...<br/>\n<br/>\n First off, how did you get on with the OC? Challenging? Did you solo it, or go with a companion (Linu, Daelan, Tomi, etc)? You say you \"started\" playing the OC - did you finish? What issues - if any - did you find? Have you played the OC and SoU/HotU before?<br/>\n<br/>\n My inclination would be to travel with a companion in SoU/HotU - probably Dorna to begin with, but I'd always recommend Deekin 'cos he's fun to have around and gets pretty awesome once he starts leveling in RDD.<br/>\n<br/>\n The OC will generally finish with you at L18, while SoU/HotU will take you to around L28, so if you want to get maximum payback from the Undead Lord you might want to grab a mod or two from the Vault - if I remember correctly, \"The Gods Themselves\" would be a good follow-on from HotU for a non-Good aligned player, and \"The Nether Scrolls\" and \"Sands of Fate\" will take you through to L40. Again, IIRC, I don't think Aribeth's Redemption would work for this character, 'cos you have to be Good aligned.<br/>\n<br/>\n Sorry for all the questions, but it's better not to assume stuff, I think. Once again, good to have you on board! <img class=\"img-emoji\" src=\"emoji/13.gif\"/></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:21 PM - Jul 12, 2016",
      "content": "<div>I echo Stagmeister's welcome and pass on the guild's appreciation that you decided to join our little group of fanatics.<img class=\"img-emoji\" src=\"emoji/11.gif\"/><br/>\n<br/>\n As he already explained, your build will be severely abridged.  Even if you string all these campaigns together, you won't reach any higher than Level 30 and with hench/summons (which you surely will need) even lower yet.  OC-to-SoU-to-HotU will be nothing more than scraping together as much XP as possible in SoU since the challenge will be gone by starting it with a toon at least Level 16-ish.  The SoU-to-OC-to-HotU alternative will be similarly boring for the OC.  One thing you should recognize is that many of the prestige classes, feats and spells make exploiting them in the OC (plague) campaign appear very impressive because Bioware never rebalanced the OC encounters, creature skins or monster AI to counter those improvements.  It will give you a false sense of the effectiveness of any build that employs the v1.69 enhancements in that campaign even set on the hardest difficulty.<br/>\n<br/>\n Anyway... examining the build posted: you won't be reaching either autostill or epic warding so plan on fighting in robes for the most part.  Fortunately, True Strike does not have a somatic component so you can cast any metaversion in full armor.  The problem is that, for it (DevCrit) to be a good investment, you'll need to be hitting within the threat range to crit... and that means LOTS of True Strikes.  For that reason, I'd be piling up as many meta versions as possible.  True Strikes can't be extended or stilled so cross those off the list.   Only Silenced and/or Quickened versions will expand your slots enough to give your DevCrits a chance to succeed.  But by level 30, your AB will only be around 28, so hitting things will be tough.  TS automatically reaches the AB cap at 48 (re: Level 30 again) so only buffs/enhancements that raise STR (like <em>Empowered</em> Bull's which is NOT part of this build) will elevate it higher.  The weapon enhancement will be overwritten by TS except for its DR penetration.  So that sweet +10 HotU weapon will get raised only another 10 AB with TS in force.<br/>\n<br/>\n Take notice that many Level 40 cap builds have been optimized to achieve their true \"potency\" at or around Level 40 so to adapt them for play on other than servers (or environments) where capped toons have long shelf life after reaching the cap, the feat selection will need to be rejuggled.  Armor Skin is one such move.  Probably better than EMA because only the dodge portion of EMA will stack with normal enhancements and timed.  Most buffs will be easily dispelled on any Pale Master because of the anemic caster level.<br/>\n<br/>\n Because of the poor caster level, PMs (except for PWs where the class has been modified) need spell penetration really bad.  In this build, it means get ESP ASAP.  Spell durations should be fine, though.<br/>\n<br/>\n That's about all the advice I can lend about things to consider playing this in the Bioware campaigns.  It would not be my first choice even though the toon cannot be critted after level 13.</div>"
    },
    {
      "author": "codea",
      "avatar": "no_avatar.png",
      "timestamp": "10:51 PM - Jul 13, 2016",
      "content": "<div>wow, thanks a lot for your advice and warm welcome :)<br/>\n<br/>\n I know that true power of the build is released at lvl 40, but ...  PM is so great :)<br/>\n<br/>\n I finished OC and datadisks long time ago with several builds solo (strictly - I don't like sharing my experience) :) I also used to play on some servers, but I almost can't even recall it, because it was so long ago. I remember seeing this build as a noob and I was so impressed :) hm.. I'm getting old.<br/>\n<br/>\n Currently I'm playing Kali's Funeral March. Hopefully it will be suitable and fun for single player game. But it is offtopic here.<br/>\n<br/>\n  </div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:37 PM - Jul 13, 2016",
      "content": "<div>If you're looking to continue as a single player, might I recommend the Aielund saga to you? It's downloadable from the NwN Vault and will take you from level 1 through to level 36. It will make you work harder for your rewards, but has a greatly more interesting plotline - politically and quest-wise. Assorted clever-dicks here have solo-ed it, but I really enjoy (let alone find it necessary) taking a couple of companions - the AI is much improved on the OC, and your xp won't take a hit, if that helps. If you're interested, have a look in the Modules forum here in the Guild - one of the threads is dedicated to Aielund. I won't say any more.<br/>\n<br/>\n As for getting old, I wouldn't worry unduly - I only started playing NwN 18 months ago and I've over half a century on my back - and I believe (though he'll most likely kill me for it) that Hip's avatar makes him look years younger than reality...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "codea",
      "avatar": "no_avatar.png",
      "timestamp": "7:20 AM - Jul 14, 2016",
      "content": "<div>:-D<br/>\n thank you for the tip, I will check Aielund</div>"
    },
    {
      "author": "mypurplescissors",
      "avatar": "no_avatar.png",
      "timestamp": "2:26 AM - Apr 17, 2018",
      "content": "<div>How does he cast spells with 90% spell failure?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:50 AM - Apr 17, 2018",
      "content": "<div>He has Automatic Still Spell III.</div>"
    }
  ]
}