{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "171",
  "name": "'Undispellable' at caster level 24 apart from Mord's, but is there actually a loophole?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/undispellable-at-caster-level-24-apart-from-mord-s-t2355087.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": "19",
  "views": "3.6K",
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:51 PM - Jun 26, 2019",
      "content": "<div>Hi all ECB expert builders,<br/>\n<br/>\nJust a question about the concept of being 'undispellable' at caster level 24 apart from Mord's. I haven't played enough primary spell casters to understand this concept completely in practical terms but I have read something on the wiki that in theoretical terms makes me think.<br/>\n<br/>\nI fully understand that at caster level 24, being the target of a Lesser Dispel, Dispel or Great dispelling spell means you will pass every single DC check. This is because the dispeller's best roll is 35 with Greater Dispelling, and at level 24 your DC is 36 (?unless they have Spell focus / Greater spell focus / Epic spell focus: Abjuration which doesn't sound like a very popular school to focus in). I also understand Mordenkainen's disjunction will strip many spell effects with a high caster level.<br/>\n<br/>\nWhat about if say the greater dispelling spell was cast as an area of effect spell?<br/>\n<br/>\nThe wiki states this undergoes a different check, which is (quoted from the Wiki): <br/>\n<br/>\nDispeller's caster level + dispeller's ability modifier + bonus vs. 2 * (creator's ability modifier) + 20 + d100<br/>\n<br/>\nThe bonus is\n<ul>\n<li>25 for <em>lesser dispel</em>,</li>\n<li>50 for <em>dispel magic</em>,</li>\n<li>75 for <em>greater dispelling</em>,</li>\n<li>100 for <em>Mordenkainen's disjunction</em>, and</li>\n<li>an additional 30 if the dispeller is a non-player character.</li>\n</ul>\n\nThe ability modifier used is intelligence for those with levels of wizard, and charisma for all others.<br/>\n<br/>\nSo say if I was a level 24 wizard casting greater dispelling as an area effect to try to remove a level 24 wizard's buff on a fighter, and we both have Int 26<br/>\n<br/>\nThat means 24 + 13 + 75 vs 2 x 13 +20 +d100 = 112 vs 46 +d100 = 65% chance of removing a single buff when greater dispelling is cast as an area effect<br/>\n<br/>\nIs this a loophole? <br/>\n<br/>\nAnd is the wiki correct in stating intelligence is used for wizards, and charisma for all others? So divine spell casters (Cleric/Druid/Paladin/Ranger) are at a significant disadvantage here if greater dispelling is cast as an AOE?<br/>\n<br/>\nAlso do NPCs cast AOE dispels?<br/>\n<br/>\nAnyway food for thought from your junior but super enthusiastic builder! </div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:42 AM - Jun 27, 2019",
      "content": "<div>Orion, I really appreciate the effort, determination and skill you have shown when trying to understand how NWN works and how you share your findings with us. So far I've been able to sit back and nod and think \"this guy is trying hard and has something to show for himself\", and I have looked at your guides and posts and thought \"precisely so, that is close to how I would have written it too\".<br/>\nThe question you bring up here is a good one, for sure, and I start to think of who could have that detail of knowledge. WhiZard would most certainly know, but he has not posted anything here since 2015. But maybe he is active somewhere else?<br/>\nOr perhaps one of our regulars  has the answer?<br/>\n<br/>\nMick</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:59 AM - Jun 27, 2019",
      "content": "<div>Yeah, the guy is hard-working, give him some love folks, he deserves it.<br/>\n<br/>\nNow, on to the question at hand. I must admit, that this is a case that I have rarely seen &amp; never paid much attention to it. In WoG, where there is a very advanced A.I. for the casters, there are occasions that the NPCs will unleash a (greater) dispel to get rid some of the effects on the ground such as cloudkill &amp; whatnot. But it never occurred to me that this could also be used to get rid of some personal buffs &amp; since this has indeed an increased chance of success for NPCs it makes me wonder if that is indeed a loophole to the system &amp; if it can also be used in a number of other situations like PvP, etc. Most of the times, combat in PWs is too frenetic in high-levels (no pause) to pay much attention to whom you dispel you, you just keep with the corner of your eye a mental note to see if the green circles with your buffs are still ON &amp; with your fingers try to KD these bastards to the ground before they do more damage to you, add to this another mental note to drink a potion of clarity as soon as this one expires or gets dispelled &amp; it gets really complicated, especially if you also try to resurrect fallen comrades with the rod of resurrection, etc. But yes, this could very well be the only way NPCs have to dispel otherwise immune to dispelling spell-swords. <br/>\n<br/>\nVery interesting finding this one, Orion.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:23 AM - Jun 27, 2019",
      "content": "<div>Hi Mick and Valerfor, I'm appreciative of your kind words. I've read quite a few of your posts and both of you have made significant contributions over long periods of time. I've had some time off work due to circumstances outside my control, so NWN is my new hobby for a while. NWN is such a rich environment, with so many different permutations, that despite the game being released in 2002 it is incredible that I find there are new things I learn about it all the time.<br/>\n<br/>\nI guess this concept has raised lots of questions. <br/>\n<br/>\nI'm curious as to how this could be tested in game.<br/>\n<br/>\nAlso the formula suggests level 3 dispel magic will scale as you advance in caster levels disproportionately to your opponent if you cast it as AOE. Perhaps even a level 3 dispel cast as an AOE it is still useful at level 40, if you really need to remove buffs from your opponent and you dont have that spare Mord's to cast.<br/>\n<br/>\nIf I do the math:<br/>\n<br/>\nLevel 40 wizard with Intelligence 34. gets quite a few casts of lvl 3 dispel magic / day. Drinks a potion of speed before battle. Then tries to dispel buff cast by level 40 wizard with intelligence 34. With AOE dispel lvl 3<br/>\n<br/>\n40 (caster level) + 12 (modifier) + 50 (bonus) vs 2 x 12 (2 x modifier) + 20 +1d100 = 102 vs 44 +1d100 = 57% chance of dispelling the strongest buff with a level 3 spell.<br/>\n<br/>\nGets a second cast due to haste.<br/>\n<br/>\nChance of strongest buff still remaining = (1 - 0.57) x (1 - 0.57) = 18.5% chance of buff still remaining = 81.5% chance of removing strongest buff from a group, given same spell ability.<br/>\n<br/>\n<br/>\n<br/>\nWhereas level 16 wizard with Intelligence 22. Casts lvl 3 dispel as AOE to remove buff from level 16 wizard with int 22. <br/>\n<br/>\n16 + 6 + 50 vs 12 + 20 +1d100 = 72 vs 32 +1d100 = 39% of removing buff.<br/>\n<br/>\nIf hasted with two casts -&gt; 62.8% chance of removing strongest buff from a group<br/>\n<br/>\n<br/>\nOr what about Paladin Joe, level 40. Casts dispel magic as an AOE with Wisdom 14. Is hasted.  Fighting Wizard level 40 with 34 Int. Wants to remove Wizard's buff.<br/>\n<br/>\n40 + 2 +50 vs 2x 12 +20 +1d100 = 92 vs 44 +1d100 = 47% chance of removing strongest buff.<br/>\n<br/>\nIf two casts due to haste -&gt; (1 - 0.47) x (1 - 0.47) = 28% chance of buff remaining, or 72% chance of removing strongest buff.<br/>\n<br/>\n<br/>\nWhereas that same Paladin Joe at level 17 with Wisdom 14, hasted with an item vs Wizard 17 with 22 int.<br/>\n<br/>\n17 +2 +50 vs 2x6 +20 +1d100 = 69 vs 32 +1d100 = 36% chance of removing strongest buff<br/>\n<br/>\nIf two casts due to haste = (1 - 0.36) x (1 - 0.36) = 41% chance of buff remaining or 59% chance of removing strongest buff.<br/>\n<br/>\n<br/>\nAlso:<br/>\n<br/>\nDoes casting Epic level buffs, which are immune to dispel protect you from AOE dispels of your lesser buffs?<br/>\n<br/>\nFor example if you have Epic Warding active. Does this mean Wizard 40 or Paladin 40 won't have a chance of dispelling any buffs with AOE dispel magic regardless of the math, because the spell tries to remove Epic Warding and it can't, and because of this, the AOE dispel will not try to remove other lesser buffs such as a Fox's Cunning?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:04 AM - Jun 27, 2019",
      "content": "<div>I have seen many weird things in Neverwinter Nights during the years, such as NPCs instantly getting up from a KD position, NPCs pass through obstacles, NPCs following &amp; attacking you without error, even through Greater Sanctuary but I have never seen Epic Warding getting dispelled, not even once. And, it goes a long time now, but I think that weapon buffs are also non-dispellable too.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:21 AM - Jun 27, 2019",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nI have seen many weird things in Neverwinter Nights during the years, such as NPCs instantly getting up from a KD position, NPCs pass through obstacles, NPCs following &amp; attacking you without error, even through Greater Sanctuary but I have never seen Epic Warding getting dispelled, not even once. And, it goes a long time now, but I think that weapon buffs are also non-dispellable too.\n</div></blockquote>\n\nSorry Valerfor for my confusing question, I should have clarified - does casting an non-dispellable buff such as Epic Warding protect you from AOE dispel of your lesser buff (say, a Fox's Cunning)? Because the AOE dispel will only target your strongest buff, and if your strongest buff is undispellable, then is that kind of a protection for your lesser buffs.<br/>\n<br/>\nI've adjusted the text. I guess the best way to answer this question would be to try to test it 'in-game' which I'm not sure how to :)</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:37 AM - Jun 27, 2019",
      "content": "<div>Either a LAN game or ask someone in your PW to do the trick.<br/>\n<br/>\nOtherwise, you are out of luck since you will have to modify Tony's A.I to target the ground &amp; so on.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:42 AM - Jun 27, 2019",
      "content": "<div>Either way, for every measure there is a counter-measure so, for example, when we played spell-swords with just fifteen-levels of Cleric/Wizard &amp; we knew that the area was heavy in dispelling we often sent ahead a heroic...badger with a couple of zero/first-level buffs on it to take the first hits head-on.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "5:52 AM - Jun 27, 2019",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nEither way, for every measure there is a counter-measure so, for example, when we played spell-swords with just fifteen-levels of Cleric/Wizard &amp; we knew that the area was heavy in dispelling we often sent ahead a heroic...badger with a couple of zero/first-level buffs on it to take the first hits head-on.\n</div></blockquote>\nThe power of practical experience! I take it the 'Resistance' cantrip would be useful there :)<br/>\n<br/>\nI haven't done any LAN or PW. My enhanced edition crashing regularly has put me off for now. Maybe in future. I get the idea WoG is a good server?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:00 PM - Jun 27, 2019",
      "content": "<div>Hi Orion,<br/>\n<br/>\nAfraid I'm not going to be able to cast any insight into your main thread here - but I can give you this link to Max's WoG thread. More particularly, it means it's playable solo off-line as well. Hope it helps...<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/solo-wog-t2354874.html\" rel=\"noreferrer\" target=\"_blank\">Solo WoG</a></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "4:28 PM - Jun 27, 2019",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>\nHi Orion,<br/>\n<br/>\nAfraid I'm not going to be able to cast any insight into your main thread here - but I can give you this link to Max's WoG thread. More particularly, it means it's playable solo off-line as well. Hope it helps...<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/solo-wog-t2354874.html\" rel=\"noreferrer\" target=\"_blank\">Solo WoG</a>\n</div></blockquote>\nThanks Stag<br/>\n<br/>\nI logged into Greyhawk soon after my post actually.<br/>\n<br/>\nWas hilarious. I had to play solo because no one else was on, Lvl 2 Druid, and I found a difficult encounter with a group of bears in the Kreaglewood forest south. They that mowed down my animal companion in moments. I ran to Borderkeep thinking that I would escape by going to a new area, but one damn grizzy bear followed me to the new area, killed like 5 NPCs  (like this family of farmers sitting near the gates) and me, then stood proudly at the exit of Borderkeep to the forest stopping me from going in that direction :) <br/>\n<br/>\nI had to write to the forum because I was scared I broke something in the game and maybe we needed DM pest control. Glad they reassured me. <br/>\n<br/>\nI downloaded the solo offlane module soon after. I guess if I encounter any further problems I can muck around there. I understand Greyhawk is really designed for parties and Solo play is really difficult.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:22 PM - Jun 27, 2019",
      "content": "<div>Starting location plays a big role for newbies in the server. Borderkeep is the more traditional/harsh starting point for more AD&amp;D like experience.<br/>\n<br/>\nInstead, start with Homlet &amp; the moathouse/Temple of Elemental Evil storyline &amp; see the difference. <br/>\n<br/>\nAlways carry a bow with you, careful of the rusties, there are in places that you don't expect, always use \"Tab\" key to highlight your environments better &amp; accurately.<br/>\n<br/>\nAC is King in WoG, ultimately, skill/technique trumps all though &amp; once you are better at it, you will be able to solo pure fighters.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:05 PM - Jun 27, 2019",
      "content": "<div>Ahhhh Valerfor you are telling me that like the true newbie I have dived straight in the deep end!<br/>\n<br/>\nI will disclose with the brilliant education of this forum, I only died three times solo, and am now level 6 druid :) I spammed a lot of summon creature to get there. I thought I would start with a favourable class to begin with then work my way 'up' (perhaps not to solo pure fighter for a while though)<br/>\n<br/>\nPerhaps with some of the harder classes I will choose the other storylines!<br/>\n<br/>\nBy the way, are 'rusties' rust monsters? Like in the bestiary? <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/pages/bestiary.html\" rel=\"noreferrer\" target=\"_blank\">http://world-of-greyhawk.github.io/pages/bestiary.html</a> I will give them a wide berth for now</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:25 AM - Jun 28, 2019",
      "content": "<div>Yup, they are. Be careful about them as your gear grows. Always carry a missile weapon with you &amp; quick-slot it in the hotkeys. <br/>\n<br/>\nDruids are really powerful on WoG, they have awesome summons. Get that book that allows you to change the preferred summon at each level, it's very handy.<br/>\n<br/>\nThree times is less than the numbers that I died when ventured forth for the first time in Borderkeep &amp; the surrounding forests. Flying kobolds with poisoned bolts coming at you at 1st/2nd level, I knew the place were meant \"business\" from that point On.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:26 AM - Jun 28, 2019",
      "content": "<div>Level 6 Druid, Congrats!<br/>\n<br/>\nKeep going strong &amp; keep us updated.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:37 AM - Jun 28, 2019",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nLevel 6 Druid, Congrats!<br/>\n<br/>\nKeep going strong &amp; keep us updated.\n</div></blockquote>\nBears nearly got me again. <strong>Newbee mistake again! </strong>I left the server in the middle of the spawn point of the bears. They respawned and attacked me when I had no summons or buffs. Never do that. <strong>Always try to leave any PW server in a 'safe' place. </strong><br/>\n<br/>\nThis is me at level 6 running from the forest into Borderkeep, with two bears hot on my heels<strong> following me from the previous area. I have 1/60hp</strong>. I run to the militia this time rather than the farmers (who have not respawned after dying - note the empty chairs in front of the house on the right), who do a good job of dealing with them.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201906/10759084_300fee41c0dd51121339d17bcdaeb24a.jpg\"/><br/>\nAm diverging off topic - can add to the greyhawk thread if you like</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:39 AM - Jun 28, 2019",
      "content": "<div>Haha, fun times! But you managed to survive, which is good.<br/>\n<br/>\nYeah, feel free to take it to WoG's thread &amp; let us discuss about it there, love some screenshots too.</div>"
    },
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "10:35 AM - Jun 28, 2019",
      "content": "<div>Hey, Orion2019. I have a few thoughts on your main topic for this thread.<br/>\n \n<ul>\n<li>There are potentially two \"area of effect\" concepts in play with the various dispel spells. The first is that a dispel can be cast in \"AoE mode\" by targeting the ground and it does some dispelling on things within a radius of the point on the ground that was targeted. The second AoE refers to effects that persist in an area for a while, like Acid Fog, Blade Barrier, etc.</li>\n<li>When the wiki mentions the special calculation of DC versus area of effect, it is talking about the chance to dispel a persistent area of effect spell (or other AoE effect). In other words, that second method of calculating a dispel chance applies when the dispel is cast on an AoE spell, like Acid Fog. It will also try and dispel a buff on creatures near the target point, but that buff's chance of being dispelled is the same as if the creature had been targeted directly. The ground-targeted dispel is not a loophole that allows a dispeller a higher chance of dispelling non-AoE spells (like buffs) on creatures by targeting the ground near those creatures. </li>\n<li>Keep in mind that references to the dispeller's caster level refer to the caster level <em>as capped by which spell is cast</em>. That means that, in your first example of a level 24 wizard with 26 INT casting a Greater Dispelling on an area that contains an AoE spell cast by another level 24 caster, the calculation would limit the dispeller's caster level to 15, as always for Greater Dispelling. Thus<br/>\n<strong><span style=\"background-color:#F4CCCC\">15</span> + 13 + 75 vs 2 x 13 +20 +d100 = <span style=\"background-color:#F4CCCC\">103</span> vs 46 +d100</strong></li>\n<li>As mentioned before, that secondary calculation would not apply to a fighter near the Greater Dispelling's target point who had buffs from a level 24 caster. Those buffs would use the <strong>dispeller level + d20 vs. 12 + caster level</strong> check and be undispellable by Greater Dispelling, due to the level 15 cap on Greater Dispelling.</li>\n<li>Per above, creatures caught in an area dispel potentially will have one effect removed by that dispel, still subject to dispeller level limits. I am inferring the \"one effect\" from the scripting lexicon's entry for <a class=\"postlink\" href=\"https://nwnlexicon.com/index.php?title=EffectDispelMagicBest\" rel=\"noreferrer\" target=\"_blank\">EffectMagicDispelBest</a>, which is called on creatures caught in the radius centered at the dispel's target on the ground. That entry mentions that \"the highest level spell effect\" on the target will be subject to the dispel check. </li>\n<li>FWIW, WoG NPCs will often cast dispels on persistent AoEs to remove them. This can be useful in terms of tactics.</li>\n<li>Weapon buffs are subject to dispels on WoG. So, don't be surprised if a weapon enhanced with Flame Weapon or Greater Magic Weapon is wiped clean after a dispelling (including Mord's) by a high-level enemy.</li>\n<li>As mentioned in the Wiki article, there are some effects that are unnaturally easy to dispel because the game considers them to be cast at caster level 0, even when they were not. Some of the Bigby's spells come to mind, since some of them use the cut-scene immobilize effect.</li>\n</ul>\n <br/>\nThis is my understanding of some of the dispelling mechanics. I did a bunch of testing on these things long ago, and this is my recollection of the results. There are some subtleties involved and it's tough to know all of what's going on without digging through the scripts, which are a little involved. To be honest, I am not 100% confident that all of the Bioware functions called by the scripts work exactly as they should. For instance, I have had the domination of a creature removed by a special ability dispel cast by a caster (a doom knight) who should have been too low in caster level (9) to remove it. I can't be sure what oddity allowed that to happen (there is also some complexity with the caster level of creatures' special abilities).<br/>\n <br/>\nAnyway, I hope this helps clarify a bit.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:16 PM - Jun 28, 2019",
      "content": "<div><blockquote><div><cite>MrZork wrote:</cite>\nHey, Orion2019. I have a few thoughts on your main topic for this thread.<br/>\n \n<ul>\n<li>There are potentially two \"area of effect\" concepts in play with the various dispel spells. The first is that a dispel can be cast in \"AoE mode\" by targeting the ground and it does some dispelling on things within a radius of the point on the ground that was targeted. The second AoE refers to effects that persist in an area for a while, like Acid Fog, Blade Barrier, etc.</li>\n<li>When the wiki mentions the special calculation of DC versus area of effect, it is talking about the chance to dispel a persistent area of effect spell (or other AoE effect). In other words, that second method of calculating a dispel chance applies when the dispel is cast on an AoE spell, like Acid Fog. It will also try and dispel a buff on creatures near the target point, but that buff's chance of being dispelled is the same as if the creature had been targeted directly. The ground-targeted dispel is not a loophole that allows a dispeller a higher chance of dispelling non-AoE spells (like buffs) on creatures by targeting the ground near those creatures. </li>\n<li>Keep in mind that references to the dispeller's caster level refer to the caster level <em>as capped by which spell is cast</em>. That means that, in your first example of a level 24 wizard with 26 INT casting a Greater Dispelling on an area that contains an AoE spell cast by another level 24 caster, the calculation would limit the dispeller's caster level to 15, as always for Greater Dispelling. Thus<br/>\n<strong><span style=\"background-color:#F4CCCC\">15</span> + 13 + 75 vs 2 x 13 +20 +d100 = <span style=\"background-color:#F4CCCC\">103</span> vs 46 +d100</strong></li>\n<li>As mentioned before, that secondary calculation would not apply to a fighter near the Greater Dispelling's target point who had buffs from a level 24 caster. Those buffs would use the <strong>dispeller level + d20 vs. 12 + caster level</strong> check and be undispellable by Greater Dispelling, due to the level 15 cap on Greater Dispelling.</li>\n<li>Per above, creatures caught in an area dispel potentially will have one effect removed by that dispel, still subject to dispeller level limits. I am inferring the \"one effect\" from the scripting lexicon's entry for <a class=\"postlink\" href=\"https://nwnlexicon.com/index.php?title=EffectDispelMagicBest\" rel=\"noreferrer\" target=\"_blank\">EffectMagicDispelBest</a>, which is called on creatures caught in the radius centered at the dispel's target on the ground. That entry mentions that \"the highest level spell effect\" on the target will be subject to the dispel check. </li>\n<li>FWIW, WoG NPCs will often cast dispels on persistent AoEs to remove them. This can be useful in terms of tactics.</li>\n<li>Weapon buffs are subject to dispels on WoG. So, don't be surprised if a weapon enhanced with Flame Weapon or Greater Magic Weapon is wiped clean after a dispelling (including Mord's) by a high-level enemy.</li>\n<li>As mentioned in the Wiki article, there are some effects that are unnaturally easy to dispel because the game considers them to be cast at caster level 0, even when they were not. Some of the Bigby's spells come to mind, since some of them use the cut-scene immobilize effect.</li>\n</ul>\n <br/>\nThis is my understanding of some of the dispelling mechanics. I did a bunch of testing on these things long ago, and this is my recollection of the results. There are some subtleties involved and it's tough to know all of what's going on without digging through the scripts, which are a little involved. To be honest, I am not 100% confident that all of the Bioware functions called by the scripts work exactly as they should. For instance, I have had the domination of a creature removed by a special ability dispel cast by a caster (a doom knight) who should have been too low in caster level (9) to remove it. I can't be sure what oddity allowed that to happen (there is also some complexity with the caster level of creatures' special abilities).<br/>\n <br/>\nAnyway, I hope this helps clarify a bit.\n</div></blockquote>\n\nThanks so much for your message! so the AOE dispel formula is for AOE effects rather than buffs on the individual character which will apply the usual formula, and will be undispellable (apart from Mords) at caster level 24 :)<br/>\n<br/>\nAnd you've tested it.  So no loophole guys</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:44 AM - Jul 02, 2019",
      "content": "<div>Just on the topic of AOE dispels and Divine Spell Caster disadvantage (ie Wisdom based AOE spell casting),<br/>\n<br/>\nThe wiki currently states regarding the AOE dispel formula: 'The ability modifier used is intelligence for those with levels of wizard, and charisma for all others.' <br/>\n<br/>\nIf this is true, then Divine Spell Casters (Cleric/Druid/Paladin/Ranger) are at a significant disadvantage compared with Wizard and Sorcerers when trying to avoid their AOE spells being dispelled, and somewhat when attempting to dispel AOE spells, as they cannot use their Wisdom modifier (which is normally high for clerics and druids, less so for Paladins and Rangers) and they will use their Charisma modifer (which could be a low stat to invest in other stats, particularly for Druids and Rangers).<br/>\n<br/>\nI found this comment from WhiZard on the <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Talk:Dispel\" rel=\"noreferrer\" target=\"_blank\">NWN Wiki, Talk:Dispel</a> page<br/>\n<br/>\n<blockquote><div><strong>AoE dispelling</strong><br/>\nAs an anonymous user tried to adjust this part of the article to what he thought was default behavior, (see below comment he added)<br/>\n\"The ability modifier used is intelligence for spells that came from the wizard spellbook, charisma for spells that came from the bard/sorcerer spellbooks and wisdom for spells that came from the Cleric/Paladin/Druid/Ranger spellbook\"<br/>\nI will address that this part of the dispelling is handled by script and due to engine limitations is not able to account for some of the things for which the hard-coded dispel commands account. The script involved for area of effect dispelling is x0_i0_spells.WhiZard 11:56, April 7, 2010 (UTC)</div></blockquote>\n\nI'm trying to interpret what WhiZard is saying. <br/>\n<br/>\nI think he means that the anonymous user was incorrect, and so what is written in the Wiki is correct in his opinion and hard coded into the game, AOE dispelling works as described, and wisdom based spell casters will use their Charisma modifier when trying to prevent their AOE spell from being dispeled or trying to dispel a particular effect. WhiZard's name was mentioned in the discussion so I thought I would share what I found</div>"
    }
  ]
}