{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "176",
  "name": "Barbarian/Druid combo",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/barbarian-druid-combo-t2354505.html",
  "author": "CosmicTomato",
  "avatar": "10404082_1510287071.jpg",
  "replies": 17,
  "posts": [
    {
      "author": "CosmicTomato",
      "avatar": "no_avatar.png",
      "timestamp": "10:03 PM - Mar 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Heya. Been on a hiatus from NWN (thanks to The Witcher 3 and Dark Souls 2) for a while, but I've had this idea bouncing around my head for a bit now. I'd like to go about building something like the Berserker/Druid from BG, but I've been having trouble converting the concept into something workable. I've had two general ideas, one where the Druid spells are used to buff up and go in with melee, or as a shifter-type character. Probably, I could take CoT with the first idea (and end up with something like Max's Terrifying Priest of Kord here on the forums) to boost the saves, but the lack of innate heavy armor proficiency might be an issue. The second would take Shifter, but I have no idea what shapes would work well, or if the various Barbarian rages work in the different forms.<br/>\n<br/>\n As for other \"requirements\", I was planning to run through Aielund for the first time with this guy, so from what I've heard I'll end up nearly level 40 (but I've got nothing against cheating in a couple of levels for the last few fights). Race will probably have to be human, and I think I'll be sticking to the tried and true Scimitar/Tower Shield.<br/>\n<br/>\n If there are any sage sages roaming the boards, I'd love to hear some advice.<br/>\n<br/>\n Cheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:51 PM - Mar 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome back!  I returned myself after a much longer \"vacation\".  The game does have a persistent allure, no?<br/>\n<br/>\n Basically, a druid barb will be a gimped cleric barb because NWN druids don't get any buffs even close to their cleric cousins (BG druids are MUCH different), except perhaps Owl's Insight AC boost which is best used in combo with a robed monk combo unless polymorphed, then the armor will merge and the WIS remains.  Since you seem set on heavy armor/tower most monk bonus will be lost (including the -3 attack progression unless kama or unarmed, scimi will use -5 progression) and the speed boost as well.  All polymorphs will override these limitations with the merge and regain all the monk AC/speed bonuses. Only those shapes using creature weapons will use the monk progression, flurry and stuns, however. <br/>\n<br/>\n All <strong>feat-based</strong> actions/spells/spell-like abilities, etc. can be used while polymorphed.  That includes raging, bard song, smiting, all the epic spells (again. feat-based), assassin's invisibility, etc... well, you get the picture.  Polymorphs can taunt and will tumble out of AoOs among skills that work the same as the native form.  It is also pretty funny to see an iron golem bend over to disarm a trap or unlock a door (w/o lockpicks, though). ;)<br/>\n<br/>\n Only dragon shape can achieve a greater attack enhancement than +5 (it's +6) but only its claw attack.  The bite has no enhancement unless the caster pre-buffs with a DR buff like Stoneskin/Premonition, then it can penetrate +5 DR.  Something like a Rod of the Ghost pre-buff would penetrate +1 DR, Ethereal Visage (if you have UMD/scroll or item) penetrates +3, and so on.  These pre-buffs have the exact same effect on any shape using creature weapons, not just dragons.  Bears, badgers, elementals, wymlings, dire tigers, gargoyles, etc... same deal.<br/>\n<br/>\n The main weakness of druid shapes is that the item merge is poor.  Only magical props of armor, hat and shield merge.  Depending on the shape selected, shifter forms will merge all item props except the glove slot e.g  Minotaur, drider, commando, Risen Lord, Rak... all these and some others.<br/>\n<br/>\n If you haven't experienced using shifter, it doesn't mean you need to learn all the shapes for a build like this.  Just decide on one that seems most suitable and test a few others during moderate challenge opportunities until you reach the target shape... a sort of orientation period for your own edification.  I've always liked Risen Lord myself because Undead Shape has no WIS requirement and the early crit immunity is very nice.  The only caveat managing undead shape is that you must unmorph to heal since heal pots will have the reverse affect and heal kits are inaccessible while polymorphed, just like any other item (like rods or grenades).  Oh, oops, yes... almost forgot... If your undead shape spots a mob of clerics... UNMORPH!  They can be turned pretty easily.  They can't be killed, but get feared for what seems an eternity.<br/>\n<br/>\n The important thing to remember about the merge is that all sources of AC bonus on items get converted to Deflection so do not stack. The armor/shield rating itself is ignored so a robe with +5 and tower with +3 will result in the same AC (+5 Deflection) as a full plate and tower with the same bonuses. But if you pre-buff with Cat's (and Owl's for a monkish shaper) and wear gear that boosts those abilities, the AC can go quite high.  50+ is common for a RL.  As far as the weapon goes, it doesn't matter what sort of weapon your caster holds, it will be converted to a scythe and all the magical properties (including the enhancement) are merged onto to the scythe.  The minimum (base) enhancement for the RL weapon is +5 so if your toon can get hold of higher enhancements on any kind of weapon (even a dagger or club), they will merge and become a scythe.  All the armed shapes work exactly the same way.<br/>\n<br/>\n But check all the shapes and their characteristics before you decide if shifter is a fit you like.  Some humanoid shapes are popular.  The Commando has been used a lot.  Each is fun to experiment with until you reach your personal shape of preference.<br/>\n<br/>\n Consider this a brief intro into the shifter class.  In order to make an informed decision for your build, I suggest checking all the available shapes including epic ones, and their prereqs before forming any opinions.  The NWNwiki has all you'll need to know regarding shifter shapes and how they might fit into your concept.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CosmicTomato",
      "avatar": "no_avatar.png",
      "timestamp": "12:24 AM - Mar 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">\"Basically, a druid barb will be a gimped cleric barb because NWN druids don't get any buffs even close to their cleric cousins.\"<br/>\n<br/>\n Yeah, that's what I feared (although Aura of Vitality is quite nice to have). I think Shifter is the way to go, even though I have next to no experience with it. Let me look at the forms and mull over it tomorrow. As a knee-jerk reaction, maybe an epic Minotaur which uses some of the unique Barbarian rages is closer to my idea. That said, Risen Lord also looks nice. I don't know if the Dragon shapes are feasible if I'm looking to get the more exotic Barb rages as well, considering the amount of WIS needed, at which point I may as well go Monk.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:23 AM - Mar 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you do decide to go dragon shape, then skip shifter altogether and stick with plain druid to get it.  One issue with dragon shape is it comes in very late in the build (Level 39 is common ) so you'll be toying with other non-armed wildshapes and elementals until you meet the WIS prereq.  To get the earliest possible DS, it would have to be a brb/dru/CoT. WhiZard built one in the legacy ECB that gets DS at Level 33.  That seems about the earliest I've seen.  Refer to a <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354480/How-and-Where-to-Access-Legacy-ECB-Archives\" rel=\"noreferrer\" target=\"_blank\">reference post</a></strong> I made last Dec to regain access to the older builds if you didn't DL it yet.<br/>\n<br/>\n The other problem I've had with focusing on DS is that the shape really suxs underground and in corridors for the same reason an NPC dragon can get stuck.  And doorways are no picnic either when you are getting pummeled by archers and slingers through the opening.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CosmicTomato",
      "avatar": "no_avatar.png",
      "timestamp": "8:41 AM - Mar 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hmm. The earliest I could feasibly take Risen Lord is 11 levels of Shifter right? There's nothing else I need to consider?<br/>\n<br/>\n Because the more I think about it, the cooler Risen Lord with Terrifying Rage sounds (as a bonus, it might even be playable!).<br/>\n<br/>\n I've been trying to get the browser search for the old builds working, but I haven't had any luck. I keep getting \"No server found\" or something to that effect when I try and search after using the ECB_search.html. Is there anything else I need to be doing? I have to admit, I am semi computer-illiterate so it could be something fairly basic (I did extract the files though!).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:00 PM - Mar 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>CosmicTomato wrote:</strong><hr/>Hmm. The earliest I could feasibly take Risen Lord is 11 levels of Shifter right? There's nothing else I need to consider?<br/>\n<br/>\n Because the more I think about it, the cooler Risen Lord with Terrifying Rage sounds (as a bonus, it might even be playable!).<br/>\n<br/>\n  </div></blockquote>\n That's correct. All you will need is Shifter 11 which leaves 29 levels for druid/barb. As it turns out, you will also get epic minotaur at the same level so could use it as a secondary shift in the case I noted about the threat of encountering turning classes (like clerics and pallies) with undead shapes.  I have an idea how to optimize both shapes in such a build myself and will inject a suitable example for you to consider.  In the meantime, install the legacy build search onto your machine and study up on the specifics of how shifting works.<br/>\n<br/>\n Shifter is not only playable, but dominant over most other builds. The only caveat is that the AB can never approach that of a WM or battle cleric so is not suitable for high-magic environments that design creature blueprints with uber AC ratings.  I believe Aielund is mid-magic or high mid-magic so a shifter should be fairly effective there.  You just need some practice using different shapes until you reach epic levels to begin using your chosen ones.  IMO shifter is probably the most fun class to play because there are so many ways to deal with situations and threats.  I'll make some suggestions once a build has been hashed out to help minimize some of the experimentation aspects.\n<blockquote><div>I've been trying to get the browser search for the old builds working, but I haven't had any luck. I keep getting \"No server found\" or something to that effect when I try and search after using the ECB_search.html. Is there anything else I need to be doing? I have to admit, I am semi computer-illiterate so it could be something fairly basic (I did extract the files though!).</div></blockquote>\n Follow the link in the previous post I provided to download the legacy archive from the new Vault. You can run it locally as long as you use a browser that has Javascript enabled. The details on how to use the archive is contained in the same post with the link.  The WoG server that hosted the build search was decommissioned when the host eliminated its free service, ummm, probably 6-8 months ago.  The Javascript version works exactly the same and since the archive is comprehensive all builds are accessible.  Of course, it won't contain any builds from this site.  You'll need to search here using google which is crude but better than scrolling through the entire list.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CosmicTomato",
      "avatar": "no_avatar.png",
      "timestamp": "4:02 PM - Mar 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was hoping to get at least 15 levels of Barb for the rages, and I'm not sure about how many druid levels would be a good idea (although it would need to be at least 5, obviously). Seeing as I'm not probably not going to be casting very often, and it'll be fairly pointless investing into STR and DEX (if they're being overridden by the polymorph, right?), do you think it might be feasible to pump CON and go for EDR?<br/>\n<br/>\n In any case, I'll get back to you once I have the ECB search working.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:41 PM - Mar 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>CosmicTomato wrote:</strong><hr/>I was hoping to get at least 15 levels of Barb for the rages, and I'm not sure about how many druid levels would be a good idea (although it would need to be at least 5, obviously). Seeing as I'm not probably not going to be casting very often, and it'll be fairly pointless investing into STR and DEX (if they're being overridden by the polymorph, right?), do you think it might be feasible to pump CON and go for EDR?<br/>\n  </div></blockquote>\n<div align=\"left\">Polymorph gaming is an entirely different perspective and not all that instinctive to many.  ALWAYS be aware of the ability overrides, which feats have an effect and which do not and learn the special abilities because even the weakest shape has its uses (like basilisk vs other basilisks).<br/>\n<br/>\n Actually, DEX is exactly what gets pumped since essentially all shapes are \"naked\" after merge and receive the full native DEX modifier unless DEX is overwritten.  Both Risen Lord &amp; Epic Minotaur override STR &amp; CON, but DEX remains the native rating.  Pumping CON makes no sense because the return is so low considering the overrides.  You'd be sacrificing lots of AC just to gain a few more points of DR, assuming you even have the feats to take advantage in epic.  Naturally, if you had been aiming for the optimal Kobold Commando, DEX would be the last ability to pump.  Most shifter builds pump WIS but that is because most shifter builds use Monk dumps for the tertiary class.  No raging going that route.  Without the advantage of Monk WIS AC, there is no point in setting WIS any higher than for spellcasting and yes, your spellcasting, buffs or otherwise, will be merely tokens to add a slight amount of help and completely dispellable.  No way to reach Terrifying Rage, Shifter 11 and have much left to develop spellcasting prowess.<br/>\n<br/>\n I am sketching something like Brb20/Dru8/Shf12 but can flex one level (maybe Brb20/Dru9/Shf11) in late epic to gain access to Level 5 spells with some tweaking that may or may not be all that beneficial.  However, with the feat selection focused on melee combat, there is little slack to develop metamagic even extended ones.  Not with barb, anyway.  No bonus feats for any class in the combo has its consequences.  But one thing I can accomplish is an RL with 4APR / 5APR hasted for his scythe.  That is extremely rare because so few shifter builds use fighter-type classes for the tertiary.<br/>\n<br/>\n Because it's been eons since I played a raging barb (and NEVER EVER a barb shifter), I was thinking of testing my concept in a trainer to get an idea of durations and effectiveness of RL and other shapes during challenging situations.  If I am satisfied, I'll post it as a finished Level 40 build due to its uniqueness (there are a scant few legacy builds using similar combo split but none of them seems to optimize efficiently enough for my taste), geared as best I can towards playing Aielund so you and others like Empyre who play that series will be better able to tweak it for that use.  Like I've stated a zillion times... always build for a specific environment.  And that is what I'll try to do with help from the ECB faithful who know the mysteries of Aielund cold.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CosmicTomato",
      "avatar": "no_avatar.png",
      "timestamp": "8:23 PM - Mar 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">My mistake. I may have half-read the wiki page for the forms this morning before heading to work, so must have gotten mixed up between DEX and CON being overridden. Yeah, I agree, pumping CON is stupid then. Have to admit, I did get sort of hooked on the idea of a Risen Lord with DR...<br/>\n<br/>\n Isn't taking 9 levels of Druid strictly better than the 12 levels of Shifter? You'd lose out on the 5th level spells for no reason that I can discern.<br/>\n<br/>\n Uniqueness is good though. It's nice to think we can get new ideas out of a 15 year old game. Very much looking forward to seeing what you come up with!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:54 PM - Mar 03, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>CosmicTomato wrote:</strong><hr/>Isn't taking 9 levels of Druid strictly better than the 12 levels of Shifter? You'd lose out on the 5th level spells for no reason that I can discern.<br/>\n  </div></blockquote>\n Level 5 does seem better on paper, doesn't it?  But look closer.<br/>\n<br/>\n Out of the level 5 spells, only the Spell Resistance buff has any merit.  And that spell only gives an SR 22.  Remember that you will be playing an RL 90% of the time from Level 24 on using an Epic Minotaur for \"emergency\" shifts only.  Undead are immune to death magic (so cross Death Ward off your list).  As stated before, Owl's Insight only has merit with a monk shifter or a dedicated offensive caster to increase spell DC... not a factor in a melee build where your druid/barb will be unable to cast while shifted except for the special abilities (like dragon breath, petrify, mind blast, etc.). Then there is Awaken, extremely useful for your pet but TBH, once you begin slicing and dicing with the scythe, the last thing you will be worried about is keeping your companion alive, a companion that will be doing almost no damage compared to your Lord of Terror.  Monstrous Regen?  Meh.  4 rounds of +3HP healing/rnd = 12 HP.  Not gonna miss that.  Need I go on? <br/>\n<br/>\n When you begin to start to consider which items will enhance your shapes, you will be choosing items like ones with haste, SR, DEX/STR/CON boosts, +saves and any weapon enhancement that adds OnHit damage or other effects like stun.  You'll only be able to utilize one item AC boost.  It should be the highest bonus you can find.  Matters not what kind either.  Armor/shield/natural/dodge... they are all converted to deflection so that means the shield may contain a useful enhancement rather than +AC bonus.  It doesn't matter what size shield either.  Barb is limited to medium armor so look around for one with sweet magical props... like SR &gt; 22 !!! :D<br/>\n<br/>\n The reason I like the number \"Shifter 12\" is because it is divisible by 2 and 3.  Many shape special abilities establish effectiveness by Shifter levels/2 or Shifter levels/3 so that number optimizes them. Shifter 18 would be the next one.  Also, I plan to invest heavily in detect skills (this in part because Empyre indicated that Aielund uses an advanced creature stealth AI a lot) and need a late dump to Spot.<br/>\n<br/>\n But all this sort of information will be revealed when I publish this and, TBH, as far as I have tested it, it really does look like a beast.  It taunts, tumbles, rages, breathes fire... all sorts of tricks.  Much kewler than I would have expected so sometimes throwing at a dartboard CAN pay off, eh?<br/>\n<br/>\n Oh... btw... even after your Level 4 Stoneskin 80/+5 buff wears off, your RL will have a permanent 15/+3 DR skin intact, 50% immunity to slash &amp; pierce and +2 vampiric regen which is the main method to keep its HP up without healing... and some other goodies... SO CHECK YOUR SHAPES CAREFULLY PLZ!!!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CosmicTomato",
      "avatar": "no_avatar.png",
      "timestamp": "7:28 AM - Mar 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah. I suppose it isn't as clear cut as that then. But, one thing I am confused about is that RL and Minotaur don't get any special abilities, and seeing as we're talking about one level that's probably going to be taken at the end of the build, I don't really see the point of slightly better abilities for forms that I won't use that often (if at all) and after the majority of levelling has been done. However, I do agree that the extra Spot would be nice; it does seem sort of weird to me that Druids don't get ANY detection skills (or spells even!).<br/>\n<br/>\n Also, one thing that I haven't understood is how hit points are calculated in the new forms. I literally haven't played Shifter in years, so I don't know off-hand. Of course, there are the temporary hit points which are a flat bonus, but does the new CON modifier change the number of hit points of the existing classes? If it doesn't, would it be a good idea to keep the starting CON moderately high to take advantage of the Barb d10?<br/>\n<br/>\n Oh, and what we're doing is BRAINSTORMING, right? No dartboards here! ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:58 PM - Mar 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>CosmicTomato wrote:</strong><hr/>Ah. I suppose it isn't as clear cut as that then. But, one thing I am confused about is that RL and Minotaur don't get any special abilities, and seeing as we're talking about one level that's probably going to be taken at the end of the build, I don't really see the point of slightly better abilities for forms that I won't use that often (if at all) and after the majority of levelling has been done. However, I do agree that the extra Spot would be nice; it does seem sort of weird to me that Druids don't get ANY detection skills (or spells even!).<br/>\n<br/>\n Also, one thing that I haven't understood is how hit points are calculated in the new forms. I literally haven't played Shifter in years, so I don't know off-hand. Of course, there are the temporary hit points which are a flat bonus, but does the new CON modifier change the number of hit points of the existing classes? If it doesn't, would it be a good idea to keep the starting CON moderately high to take advantage of the Barb d10?<br/>\n<br/>\n Oh, and what we're doing is BRAINSTORMING, right? No dartboards here! ;)<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Stay tuned.  Most all these questions will be outlined and answered in my analysis. <br/>\n<br/>\n Actually Barb uses d12 hit dice and the roll has nothing to do with the CON modifier that is simply added after the roll.<br/>\n<br/>\n The shapes that override CON ignore the native CON (and modifier, of course) but do use some +HP feats.  Toughness/Epic Toughness are more useful than taking Great CON twice (unless trying to qualify for EDR or something) if your goal is to just create the largest HP pool for your toon that you can.  Polymorphs also ignore all native racial characteristics/bonuses unless they happen to \"match\" the polymorph's appearance.<br/>\n<br/>\n What's most important is BAB because that is what the polymorph form uses to calculate its racially-determined AB.  Just like BAB, hit dice are class-related rather than racial bonus so they are merged into the polymorph final stats.  So... a pure druid dragon will have a smaller HP tally than a barb druid dragon or fighter druid dragon because the HD are higher in the latter cases and the more high HD levels the higher the total dragon HP. Or, at least the potential is there with normal rolls. Or are you like me and roll a series of several 1's before the trend switches? If so, stay away from the racetrack.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CosmicTomato",
      "avatar": "no_avatar.png",
      "timestamp": "8:37 PM - Mar 04, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Dammit, I need to stop replying to posts at half six in the morning. Of course I meant d12. <br/>\n<br/>\n Anywho, I'll stop bugging you for now. I'm super stoked to see the finished build, so it might arrive more quickly if I leave you to to building. Don't fear, more annoying questions will follow, I promise!<br/>\n<br/>\n P.S Messed around with the links for the old ECB search engine. The search function is the only thing that I can't get working. Can browse the builds by author and the forums fine, which I don't quite understand. Will keep playing with it, see if it works eventually.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:44 AM - Mar 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here you go, Vegetable of the Vastness...<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354506/\" rel=\"noreferrer\" target=\"_blank\">Lord of Terror</a></strong></span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CosmicTomato",
      "avatar": "no_avatar.png",
      "timestamp": "9:32 AM - Mar 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually, a tomato is a fruit, but I'll allow you the error seeing as you were so kind to make this for me! Also, I'll cede that \"vegetable\" of the vastness has a nicer ring to it than \"fruit\" of the vastness.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:52 PM - Mar 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Cosmic Tomato (thought Heavenly Love Apple would be pushing it at our first meeting <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />). Don't know if it would be of any interest to you, but I recently started posting Aielund-specific stuff (not a walkthrough) on the Aielund Saga thread in the Modules section of NWN World in the main menu here. This was precisely because I hadn't played Aielund before - I'd by and large been confined to the OC/SoU/HotU, and I wanted somewhere to bring up any issues that I found. Do please jump in with any you might encounter.<br/>\n<br/>\n Cheers, and enjoy what looks like a cracker of a build!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CosmicTomato",
      "avatar": "no_avatar.png",
      "timestamp": "9:24 PM - Mar 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Having a peruse of the thread now. Cheers for pointing it out, Stag.<br/>\n<br/>\n Also, I now have an animal companion called \"Heavenly Love Apple\".<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:37 PM - Mar 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ha! Oh, please tell me it's the (mortally embarrassed) brown bear!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}