{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "981",
  "name": "Level 5 Character",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/level-5-character-t2354862.html",
  "author": "wildleaf",
  "avatar": "10747696_1523894257.png",
  "replies": "18",
  "views": "718",
  "posts": [
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "8:48 PM - Apr 20, 2018",
      "content": "<div>Extremely low magic.. no rest restrictions inside of the rare designated resting areas. I'd love to see what ideas you guys have.<br/>\n<br/>\nI'd like to see something durable, with some magic, and a few tricks up their sleeve.<br/>\n<br/>\nThinking maybe a druid.. or sorcerer?<br/>\n<br/>\nSearch and the Craft Skills are extremely useful as well.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:55 PM - Apr 20, 2018",
      "content": "<div>Hi, wildleaf. I ain't the best at building, but I'm not too shabby at searching. I think I've found you a good Ranger build: I'm just waiting on a question or two being answered.<br/>\n<br/>\nRanger would give you a full BAB, dual-wield capabilities and level 2 Ranger spells, as well as a couple of favoured enemies and a pet.<br/>\n<br/>\nSo, does that sound like something you might be interested in?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "11:11 PM - Apr 20, 2018",
      "content": "<div>Aye, I'm interested in everything. Also, undead are a huge concern, so FA undead would be good. I look forward to seeing the build.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:46 PM - Apr 21, 2018",
      "content": "<div>Hello again. I got a few things wrong in my first reply (it's actually 2 spells from level 1, and no pet - that's at level 6), but I'd still say the Ranger option is a decent one. If you want to check the build I was referencing, have a look at the last few posts on Mick Dagger's thread, \"What makes a strong low level (1-10) build?\" in the General Discussion sub-forum. Of course, if his caffeine rush has come up with something new, all the better.<br/>\n<br/>\nFor myself, I'll confess that, while I appreciate the defensive merits of Expertise, I'd probably be tempted to go for something else - maybe even a second Weapon Focus, given Mick's edit, so that (particularly if undead are a major issue) you could have a slashing and a blunt focus. But that's just my play-style.<br/>\n<br/>\nAnyway, have a look and see what you think.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:19 PM - Apr 22, 2018",
      "content": "<div>A 5 level limit rules out (most) prestige classes. No classes get +6 BAB which would grant one more attack/round. Monk/warriors can have one more attack with +4 BAB because of the monk attack progression with Unarmed and Kama. Dual-wielding, Rapid shot, Flurry of blows, Divine Power and Haste can also add an extra attack. Cleave can add a situational attack.<br/>\n<br/>\nLow magic usually means that self-buffing characters are best.<br/>\nHere magic is limited to lvl 3 spells for wizards, clerics and druids, level 2 spells for sorcerers and bards, and level 1 spell(s) for rangers and paladins. Level 3 spells means you can do with 13 or 14 in your casting stat. That makes it possible to have a high strength that gives a better melee presence. <br/>\n<br/>\nDruids get Wildshape, have an animal companion and can buff with Bull's and Barkskin.<br/>\nClerics start to get some buffs and can have Divine Power as a lvl 3 spell with Strength domain.<br/>\nBards have a level 3 song and can buff with Ghostly visage and Magic weapon.<br/>\nMonk/warriors can have 4 attacks with dual Kamas and Flurry active (and a 5th when Cleave kicks in), but the AB will suffer.<br/>\nRogues can craft and set pretty good traps. A warrior/rogue can have +4 BAB and 2d6 sneak damage.<br/>\nA specialist wizard can cast 2 fireballs, buff pretty well and be an all-right melee-mage if the strength is high.<br/>\nThe warrior classes can also do quite well, as long as they can dominate with high strength, full armor, martial weapons and combat feats such as Cleave and Knockdown. They will retain their effectiveness long after the more fancy buffs of other classes have run out.<br/>\n<br/>\nEdit: As for prestige classes, you can in fact take  one or two levels of Palemaster or one level of  PDK.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:57 PM - Apr 22, 2018",
      "content": "<div>I seem to remember something about caster builds being particularly effective in low magic environments, and given that wildleaf says in the lead post that this is an \"extremely\" low magic one, maybe a +CON race (for durability) pure caster would serve - Druid keeps coming into my small mind, which is intriguing, given that I don't do casters. Oh, hang on, what about a Halfling Druid - a bit like Maggie in Aielund?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:46 AM - Apr 23, 2018",
      "content": "<div>Seems like a melee Cleric would be one of (if not the best) choices here. The level cap is extremely low to even make a build for that however, there isn't much room for anything really. Start with Human 17 (18) str/ Dex 10/ Con 14/ Int 10/ Wis 14/ Cha 9 and proceed as normally.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:11 PM - Apr 23, 2018",
      "content": "<div>Here is something if you want to try Wizard! The build has room for buffs, a summoned meat-shield, and some attack spells. You can do good ranged damage with a heavy x-bow, but will also do well in melee against mobs or weakened bosses in a lvl 5 setting. Recommended buffs: Mage armor, Shield, Protection from alignment, Ghostly visage, Magic weapon, Bulls strength, Cat's grace, Flame weapon.<br/>\n<details><summary>Spoiler</summary>\nIllusionist(5), Human\nSTR: 16\nCON: 14\nINT: 15 (16)\n\n01: Illusionist(1): Knockdown, Expertise, {Scribe Scroll}\n03: Illusionist(3): Weapon Focus: Quarterstaff\n05: Illusionist(5): Extend Spell\nHitpoints: 30\nSaving Throw bonuses: Spells: +2\nAB (max, naked): 6 (melee), 4 (ranged)\nSpell Casting: Wizard(3): 3 level 3 slots, 4 level 2 slots, 5 level 1 slots and 5 cantrip slots.\n\nConcentration 8(10), Discipline 4(7), Heal 8(7), Spellcraft 7(10), remaining skillpoints 11\n01: Concentration(4), Discipline(2), Heal(4), Spellcraft(4), Save(4), \n03: Concentration(1), Discipline(1), Heal(1), Spellcraft(1), Save(6), \n05: Concentration(1), Discipline(1), Heal(1), Save(11), \n</details>\n\nA possible tweak :\n<details><summary>Spoiler</summary> Start with Str 17, Dex 13 and Int 14.  Take +1 Str at lvl 4 for a total of Str 18. Gives +1 AB and +2 damage with the Staff.  The price will be 1 less lvl 3 spell slot, -1 to the spells DC and -2 skill points, and -1 AC and -1 ranged AB 50% of the times if you buff with Cat's. </details></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:42 PM - Apr 23, 2018",
      "content": "<div>Here is something completely different: A raging melee brute with high hitpoints, full plate armor, and several combat moves. He works equally well with all simple and martial melee weapons. The will saves are low.<br/>\n<details><summary>Spoiler</summary>Barbarian(4), Fighter(1)\n\nDEX: 10\nWIS: 8\nCHA: 8\nHuman: \n01: Barbarian(1): Power Attack, Cleave\n03: Barbarian(2): Knockdown, {Uncanny Dodge I}\n05: Barbarian(4)\nHitpoints: 73\nSaving Throw bonuses: -\nAB: 9 (melee), 5 (ranged)\nAC (naked/mundane armor &amp; shield): 10/21\n\nDiscipline 8(12), Heal 8(7), Listen 8(7), Taunt 8(7), remaining skillpoints 14\n01: Discipline(4), Heal(4), Listen(4), Taunt(4), Save(8), \n03: Discipline(1), Heal(1), Listen(2), Taunt(2), Save(10), \n05: Discipline(1), Heal(1), Listen(1), Taunt(1), Save(14), </details></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:58 PM - Apr 23, 2018",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote:</cite>\nHere is something completely different: A raging melee brute with high hitpoints, full plate armor, and several combat moves. He works equally well with all simple and martial melee weapons. The will saves are low.<br/>\n<br/>\n<br/>\n</div></blockquote>\n\nInteresting use of the word \"low\" there, Mick! In the same way that dodo sightings in Scotland could be considered low, I suppose <span class=\"text-emoji\">😋</span></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:21 PM - Apr 23, 2018",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>\n<blockquote><div><cite>Mick Dagger wrote:</cite>\nHere is something completely different: A raging melee brute with high hitpoints, full plate armor, and several combat moves. He works equally well with all simple and martial melee weapons. The will saves are low.<br/>\n<br/>\n<br/>\n</div></blockquote>\n\nInteresting use of the word \"low\" there, Mick! In the same way that dodo sightings in Scotland could be considered low, I suppose <span class=\"text-emoji\">😋</span>\n</div></blockquote>\n\nHe, he! What to say? No dodos? At least you are allowed to roll a d20. And when you rage you can even add a whopping +2 bonus. <span class=\"text-emoji\">😎</span><br/>\n<br/>\nDefinitely a weakness, but we are in lvl 5 land, and even a monk only gets +4 for will save...  and an extra +2 from the wis bonus if wis is 14... and another +2 from Still mind and... I think I see where this is going... <br/>\nDefinitely a weakness, but then again we are in level 5 land, and even wizards only get +4 bonus to the will save... and buff to mind spell immunity with protection from alignment or clarity or whatnot...Yeah, I think I see where this is going <span class=\"text-emoji\">😖</span>   <br/>\nSo one should buy potions of Clarity to protect that fragile mind! If they are available in the low magic setting, that is... If not, I recommend cold a beer and the respawn button.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:53 PM - Apr 23, 2018",
      "content": "<div>Exactly, sir. What's the fighter and/or tank's worst nightmare? Failing a Will save and not being able to do their job while your squidgy friends get torn a new one. And solo it's even worse. Of course, one could argue that it shouldn't be too problematic unless the game's wildly skewed, but nevertheless...<br/>\n<br/>\nYou know I'm a meleer by nature, and I'm wondering about a Monk 3/Fighter 2 now - and STR/WIS based, because a DEX one would take forever to kill anything. I appreciate that would entail -1BAB, but there are plus points (an extra feat or two not least among them).<br/>\n<br/>\nI'm delighted you think you see where this is going - I'm still shooting in the dark!<br/>\n<br/>\nBtw, as a non-caster, I liked your Wiz build(s).</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:21 AM - Apr 24, 2018",
      "content": "<div>No lies, I also liked your Wiz build Mick, especially the variaton with the 18 strength backed-up with bull's, flames &amp; haste. It is a pity though he doesn't have a proper weapon to make full use of it. Maybe replace \"expertise\" for \"martial weapons\"?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:37 AM - Apr 24, 2018",
      "content": "<div>Just a variation of Mick's Barbarian, I name thee \"The Smasher\".<br/>\n<br/>\nHalf-Orc, Neutral<br/>\n<br/>\nStr: 19 (<strong>20</strong>), Dex: 09, Con: 14, Int: 14, Wis: 08, Cha: 06<br/>\n<br/>\nBarbarian (01): WF: Greatsword<br/>\nFighter (01): Power Attack*<br/>\nFighter (02): Cleave*, Knockdown<br/>\nFighter (03): <br/>\nFighter (04): WS: Greatsword<br/>\n<br/>\nAB: +11, DMG: 2d6 +9/ 19-20 x2 (Greatsword)<br/>\n<br/>\n* You can replace Power Attack &amp; Cleave with Expertise &amp; Blind-Fight, for a more defensive approach.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:02 PM - Apr 24, 2018",
      "content": "<div>Here is a serious contender for hunting the Undead. A Paladin with a bone-crushing blunt martial weapon, immunity to fear and disease, a solid AB and AC and high saves ((no dodo spotting <span class=\"text-emoji\">😉</span>)).<br/>\nShe has a first level spell slot and can buff with Bless weapon (or any other lvl 1 spell). She has also a high charisma for better saves and turning undead mooks. You have some spare skill points for crafting, concentration, heal or whatever you like.<br/>\n<br/>\nPaladin(4), Fighter(1), <br/>\nHuman<br/>\nLawful good<br/>\n<br/>\nSTR: 15 (16)<br/>\nDEX: 12<br/>\nCON: 14<br/>\nWIS: 12<br/>\nINT: 10<br/>\nCHA: 14<br/>\n<br/>\n01: Paladin(1): Power Attack, Cleave, {Divine Grace, Divine Health, Lay on Hands}<br/>\n02: Fighter(1): Weapon Focus: Warhammer<br/>\n03: Paladin(2): Knockdown, {Aura of Courage, Smite Evil}<br/>\n04: Paladin(3): STR+1, (STR=16), {Remove Disease, Turn Undead}<br/>\n05: Paladin(4): {Level 1 spell casting}<br/>\n<br/>\nHitpoints: 60<br/>\nSaving Throws (Fortitude/Will/Reflex): 10/4/4<br/>\nBAB: 5<br/>\nAB: 9 (melee), 6 (ranged)<br/>\nAC (naked/mundane armor &amp; shield): 11/22<br/>\nSpell Casting: Paladin(1)<br/>\n<br/>\nSkillpoints: 24<br/>\nDiscipline 8(11), Taunt 8(10), remaining skillpoints 8<br/>\n<br/>\n01: Discipline(4), Taunt(4), Save(4), <br/>\n02: Discipline(1), Save(6), <br/>\n03: Discipline(1), Taunt(2), Save(6), <br/>\n04: Discipline(1), Taunt(1), Save(7), <br/>\n05: Discipline(1), Taunt(1), Save(8),<br/>\n<br/>\n<br/>\nTweak: You can drop Cha to 9 and start With str 17 for +1 AB, +1 damage and +1 to Discipline, at the cost of -2 to all saves and an even weaker turn undead.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "5:37 PM - Apr 28, 2018",
      "content": "<div>Thanks guys! I love the build ideas, and the enthusiasm!<br/>\n<br/>\nAlso, did I mention... perma death? <span class=\"text-emoji\">😅</span><br/>\n<br/>\nSorry for taking so long to reply, just went through a big move and finally got internet. Time to plug in the ole desktop and smash some undead, whew. <br/>\n<br/>\n-<br/>\n<br/>\nThere are no clarity potions, because there are no shops period. I love the wizard build.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:41 AM - Apr 29, 2018",
      "content": "<div>You do like to challenge yourself eh?<br/>\nOut of all these, my favorite was Mick's Wizard...But with a Greatsword!<br/>\nAnyway, good luck and then maybe try a level 60 server just for the opposite effect ;)</div>"
    },
    {
      "author": "wildleaf",
      "avatar": "10747696_1523894257.png",
      "timestamp": "3:22 PM - Apr 29, 2018",
      "content": "<div>The wizard is sick, but I feel like he's gonna get killed off instantly with his low hp.<br/>\n<br/>\nHmm, maybe that would increase the challenge.<br/>\n<br/>\nYou think dropping knockdown for Martial weapons would be worth it?</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:05 PM - Apr 29, 2018",
      "content": "<div>Use summons to divert the pressure and add to the attack. Both the boar and the dire wolf are strong for their level. Use Ghostly visage on yourself to get DR. Buff the weapon with Magic weapon and Flame weapon. Cast Bull's, Mage armor, Shield, Protection from evil, Cat's etc on yourself and you summen, if you still have spells left. At low levels the Mephit familiars are strong tanks with both DR and regeneration.</div>",
      "author-color": "#AA0000"
    }
  ]
}