{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "471",
  "name": "NEED HELP FAST, GG! GODLY BUILD",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/need-help-fast-gg-godly-build-t2222615.html",
  "author": "Bazinga",
  "avatar": "10235222_1510287070.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "Bazinga",
      "avatar": "no_avatar.png",
      "timestamp": "11:50 PM - May 08, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">The server I play on is Underworld, It's an Action Server that has some very unique features. It goes beyond the 40 and stops at 60. I'm looking for a pure pvp build, of just one class. Surprise me guys! Here's some info on the changes I could find to assist in creation! If you could please tell me at each level what skills I should put points into thanks!<br/>\n<br/>\n++LEGENDARY LEVELS++<br/>\n<br/>\nAs you may know, the Underworld has legendary levels 41-60, basically you must gain experience points beyond 780,000. Level 60 requires 12.78 million experience points, so, you probably realize this is not achieved as fast as level 40 is, but is a slower process. If you would like to gain legendary levels beyond level 40 up to 60th level you just need to go into the power chamber and use the leveler device which can be accessesed from inside the Halls of Magic.<br/>\n<br/>\nThe levels you gain increases your skill points, attack bonus, and even increases your ability scores and allows the garnereing of feats. While your character sheet may not read 60th level, you sure will feel the difference as you gain more levels.<br/>\n<br/>\n++SPELL CHANGES++<br/>\n<br/>\nAll spells take into consideration Legendary Levels. You must have taken the legendary levels to get the bonus.<br/>\n<br/>\nAll spell that inflict elemental damages (acid, cold, electrical, fire and sonic) can have that portion of their damage boosted by the player's Lore skill. The damage increase is equal to 1% per two points of lore above 20 to a maxium of 50%<br/>\n<br/>\nPalemaster levels now count 7/6 towards necromancy and illusion spells, and 1/3 towards all other spells.<br/>\n<br/>\nPalsmasters recieve a +1 DC to necromancy and illusion spells for every 15 levels, including legendary levels. Power Word Kill is a considered a necromancy spell in deteremining Palemaster caster levels.<br/>\n<br/>\nIn deteremining spell power, dragon disciples add 3 caster levels per 2 dragon disciple levels to all fire based spells, but none to non-fire based spells.<br/>\n<br/>\nItems that grant a caster level bonus will not increase spell penetration, but only damage dice and buff level calculations. Other items can increase spell penetration or dice checks.<br/>\n<br/>\n++CLASS: BARBARIAN++<br/>\n<br/>\nBarbarian Rage now adds +4 Strength, Constitution and Saving Throws, +2 for every 5 levels over 9, to +12 total.<br/>\n<br/>\nAt Barbarian level 50, barbarian rage adds +1 Attack.<br/>\n<br/>\nThundering Barbarian Rage now adds BARBARIAN_LEVEL/6 retroactive dice to their weapon.<br/>\n<br/>\nTerrifying Rage now has DC of Barbarian Level - 5 + (Intimidate_Skill/6)<br/>\n<br/>\nBarbarians gain an addition point of Strength and Constittution every 5 Levels past 40th.<br/>\n<br/>\n++GOD LEVELS++<br/>\n<br/>\nIf you can complete the whole module you may start the last adventure, which require well-prepared party. On the last adventure, which is actually 5 adventures in all, and requires a lengthy amount of time (4+ hours), you will encounter the Queen of the Damned, if you can defeat her, you may become a God.<br/>\n<br/>\nThe God System:<br/>\nAfter defeating the Queen of the Damned, your character will be flagged as an activator. To be able to create a god, you must delete your activator (through the rest menu). Once deleted, your account is flagged with the ability to create a god. To make your god character, as long as you are flagged, enter \"God\" or \"Goddess\" in the subrace field of your new character.<br/>\n<br/>\nGods rceieve the following benefits:<br/>\n* All Abilities gain +18<br/>\n+ All Armor/Shield proficiencies, as well as Exotic and Martial Weapon Proficiencies.<br/>\n* Gods gain 25% less experience<br/>\n* Gods gain +5% spell damage per God Run completion, to +25% total.<br/>\n<br/>\n++PARAGON++<br/>\n<br/>\nA paragon in the Underworld is the pinnacle of a specific class.<br/>\n<br/>\n*To become a Paragon, you must set your subrace to \"Paragon\" (Without the quotes)<br/>\n*Paragons MUST be a pure class character. If a class requires a base class, such as Arcane Archers, you may be 2 classes.<br/>\nHOWEVER<br/>\n                      -- You MUST have 10 levels in your base class, and 20 levels in the prestige class. The only exception is Harper Scout and Purple Dragon Knight, of which you may have the maximum of 5 levels.<br/>\nParagons gain the following abilities.<br/>\n* All abilities gain +8<br/>\n* Ability to use any weapon or armor type, regardless of class. Skill and spell failure penalties still apply.<br/>\n*Paragons will be given a greater socketed weapon of their choice. Or, if they are a caster-type, a class-specific weapon.<br/>\n* Paragons MAY aid in the trials to godhood, however..<br/>\n* Paragons CAN NOT become gods Themselves.<br/>\n* Paragons gains +25% more experience<br/>\n* Paragons gain +2% spell damage per God Run completion, to +10% total.<br/>\n<br/>\n=====<br/>\n<br/>\nSurprise me!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Bazinga",
      "avatar": "no_avatar.png",
      "timestamp": "10:19 AM - May 09, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If anything I'm looking more for a God like character, but the first playthrough is the key build. It doesn't just have to be Paragon (Pure Class Lvl 60).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "4:43 PM - May 09, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">High Int Wiz 40 or High Cha Sorc 40 with necromancy and evocation foci would own most servers.  However, if the monsters have been customized with insane SR, uber saves vs. spells and mucho immunities it could become a bear to level up and you'd need to party until your DCs could match those.  Or does your server have an XP system for dueling?  <br/>\n<br/>\nMages rule 99.99% of the time in PvP, otherwise.  High CON recipro builds are pretty much bullet-proof in PvP vs. any melee except DevCrit ones.  Bigby's &amp; IGMS work wonders against archers, as well.<br/>\n<br/>\nIf the environment is high enough magic, magical classes will wilt since all their spells tend to appear on nonclass-specific gear.  In addition, the significance of the build itself becomes secondary to acquiring items.   Those are Diablo-esque servers. <br/>\n<br/>\nThere are few ECBers that play on post-epic servers and I am in that subgroup.  BTW, you need not scream with caps in your topic titles.  It won't help you get faster or better attention.  Trust me.<br/>\n<br/>\nIn any event, welcome aboard the new ECB!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}