{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "445",
  "name": "Epic dodge & mighty rage concept.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/epic-dodge-mighty-rage-concept-t2291947.html",
  "author": "Nemusator",
  "avatar": "no_avatar.png",
  "replies": 5,
  "posts": [
    {
      "author": "Nemusator",
      "avatar": "no_avatar.png",
      "timestamp": "3:12 PM - Oct 10, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">How many of these have you seen? I made it solely cause of its originality. But eventually this turned out to be one of my favorite pvp builds. <br/>\n<br/>\nRace: Dwarf<br/>\nStarting ability values:<br/>\n<br/>\nSTR 16<br/>\nDEX 16<br/>\nCON 18<br/>\n<br/>\nFeats:<br/>\n<br/>\nPre-epic / Epic<br/>\n<br/>\nAlertness / Epic Dodge<br/>\nBlind fight / Great Constitution III<br/>\nDefensive roll / Great Dexterity V<br/>\nDodge / Great Strength I<br/>\nIron will / Mighty Rage<br/>\nMobility /<br/>\nToughness /<br/>\nWeapon focus battleaxe /<br/>\n<br/>\nSkills: Discipline and tumble as main skills, some skill points into taunt ( or listen  ).<br/>\n<br/>\nWhen I actually made the build, it got +5 to AC lol--------------------<a class=\"postlink\" href=\"/attach/view/ma/845224_65695ed76451c194b132549a6c651be4\" rel=\"noreferrer\" target=\"_blank\">Click here to view the attachment</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "4:47 PM - Oct 10, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey, man.<br/>\n<br/>\nWelcome to the ECB. Nice to see the screenshots, nifty touch to the posts. However, we do have somewhat of a \"model of posting builds\" in the guild. A build is much more than the final class spread, features or abilities. A build is EVERYTHING, every little choice that you have to make from lvl 1 to 40, the order in which you take the classes, etc...<br/>\n<br/>\nHere is a model: <br/>\n<br/>\nECB Build Model<br/>\n<br/>\nRACE:<br/>\n<br/>\nALIGNMENT:<br/>\n<br/>\nPLAYABILITY:<br/>\n<br/>\nSTARTING STATS:<br/>\n<br/>\nSTR -<br/>\nDEX -<br/>\nCON -<br/>\nWIS -<br/>\nINT -<br/>\nCHA -<br/>\n<br/>\nENDING STATS:<br/>\n<br/>\nSTR -<br/>\nDEX -<br/>\nCON -<br/>\nWIS -<br/>\nINT -<br/>\nCHA -<br/>\n<br/>\nBASIC STATS:<br/>\n<br/>\n- Hit Points:<br/>\n<br/>\n- Skill Points:<br/>\n<br/>\n- Skills:<br/>\n<br/>\n- Saving Throws (Fort/Ref/Will):<br/>\n<br/>\n- Naked AC:<br/>\n<br/>\n- BAB:<br/>\n<br/>\n- AB:<br/>\n<br/>\n- Spellcasting:<br/>\n<br/>\nLEVELING GUIDE:<br/>\n<br/>\n1-<br/>\n2-<br/>\n3-<br/>\n4-<br/>\n5-<br/>\n6-<br/>\n7-<br/>\n8-<br/>\n9-<br/>\n10-<br/>\n11-<br/>\n12-<br/>\n13-<br/>\n14-<br/>\n15-<br/>\n16-<br/>\n17-<br/>\n18-<br/>\n19-<br/>\n20-<br/>\n21-<br/>\n22-<br/>\n23-<br/>\n24-<br/>\n25-<br/>\n26-<br/>\n27-<br/>\n28-<br/>\n29-<br/>\n30-<br/>\n31-<br/>\n32-<br/>\n33-<br/>\n34-<br/>\n35-<br/>\n36-<br/>\n37-<br/>\n38-<br/>\n39-<br/>\n40-<br/>\n<br/>\nSIMILAR BUILDS:<br/>\n<br/>\nSPECIAL NOTES:<br/>\n<br/>\n7- FINAL NOTES:<br/>\n<br/>\n--------------------------------------------------------------------------------------///////---------------------------------------------------------------------------<br/>\n<br/>\nAs for the build itself, it's hard to critique it without knowing what you did lvl per level, so I'm just gonna focus on the little available info I have here:<br/>\n<br/>\nThe class spread is not exactly good, nor are the classes you chose to use in this combo. You could achieve a similar result with a Barbarian Fighter Rogue combo, but then you'd have Sneak Attack and UMD as well. The AB in this build is quite low, but when you go for things that require STR, DEX and CON bonuses, that's sure to happen. You could, for example, go Fighter 12 Barbarian 15 Rogue 13 and get the same results, plus UMD and Sneak Attack. The starting stats are pretty cool, and Dwarf is the best race for this purpose indeed, because you can relinquish CHA.<br/>\n<br/>\nAnyway, it'd be awesome if you could fill out the form with all the choices you made (assuming you planned them, of course), so we can have a deeper look at it.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:14 PM - Oct 10, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Please review the posting guidelines described in the ECB.  I've PM'd your account with all the links you will need to provide a finalized tested build suitable for review by the guild membership.  <br/>\n<br/>\nI see Max already attempted to provide the necessary education.    (Nice work, Max!)<br/>\n<br/>\nIn addition, you may want to familiarize with all the guidelines that Kail has published in order to make your time spent with the ECB most productive and enjoyable.<br/>\n<br/>\nIn any event, welcome to the ranks of the New ECB!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Nemusator",
      "avatar": "no_avatar.png",
      "timestamp": "1:43 AM - Oct 11, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I already saw the variant you were talking about, so I wanted something more original. Also, on our server Harpers can cast Clarity once per day instead of Tymora's smile.  And a decent ab tank with mind immunity can be really fun to play!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:08 AM - Oct 11, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey again man. Well, I speak from a place of personal experience when I say this, as this happened to me when I first joined this guild 6 years ago. I thought my builds were all uber, when they in fact were, speaking of my builds here, not yours, basically SHIT. It took me a while to recover from the \"rude awakening\" I received from the elder members of this guild. The only reason I thought my builds were great was because I was looking at them with the tunnel vision effect coming from my own lack of knowledge.<br/>\n<br/>\nWhat I'm trying to say here, obviously having no intention of being rude, is that the people of this guild know A LOT about the game, and even more about character building, so don't be discouraged by the criticisms your builds will surely receive. Learn from them as I learned from the true elders once. If you do so, one day you yourself will look at your builds and go: \"I can't believe I thought these builds were strong!\". When you do that, that's when you'll be a much better builder. This is THE MOST COMPLEX game ever made, and we all here love it for this reason. I have been playing it for 8 years, 6 of those being an ECBer and I'm still learning new things every day. <br/>\n<br/>\nTo get you started on builds in general, there's the Game Guides forum section, where you can find a handful of guides to building, skills and some classes. I wish more of the elders were here to write more of these guides, as most of them are mine. I wrote Druid, Cleric and Paladin guides and one guide to the basics of character building. Mick wrote one on the AAs and Hip on trap skills, WhiZard has also contributed by comparing Rapid Shot and Flurry of Blows and questioning their usefulness. There's also Avado's Cleric guide and Zelle's Shifter guide, courtesy of Hip, who was kind enough to unearth it from the internet limbo.<br/>\n<br/>\nAnyway, mate, this is just the first step you can take if you want to become a more competent builder, and I do hope you take it, otherwise why would you want to be an Epic Character Builder?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Nemusator",
      "avatar": "no_avatar.png",
      "timestamp": "10:17 PM - Oct 11, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm aware that all the criticism I receive is for my own good. Also, sometimes I just make builds as I want to make them, following some idea of mine, but yeah, I know that there is a tone of stuff I don't know, and I like to improve myself constantly in every way, so this is going to be a good practice for me!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}