{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Game Guides",
  "forum_id": "001",
  "id": "001",
  "name": "Master of Performance - a Bard guide",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/master-of-performance-a-bard-guide-t2354698.html",
  "author": "Mick Dagger",
  "avatar": "10235235_1549015559.jpg",
  "replies": 39,
  "posts": [
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:02 AM - Apr 26, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><strong><span style=\"font-size:120%;line-height:normal\">Master of Performance</span></strong><br/>\n<br/>\n Bard is a very talented and powerful class. Bard builds, both with bard as major and minor class provide powerful and versatile characters, that fill a range of different roles.<br/>\n Bard builds can be played as frontline fighters, as archers, as self-buffing fighter-mages, as stealthy rogue types and as multi-talented support characters.<br/>\n A prominent feature of the bard class is the song, a one-click party buffer. When taken to high levels, and combined with the curse song, the song feature becomes a game changer.<br/>\n<br/>\n Some people claim that the bard is a “jack of all trades, but master of none”. Bards are sometimes portrayed as lute wielding wimps, effeminate and mostly obsessed with their looks, while they write verses highlighting other people’s heroic acts. Of course you are free to roleplay your bard like that, hiding behind a big strong warrior and singing songs to inspire the morale, but...<br/>\n The NWN bard is a power class with several features where it outshines every other class in the game:<br/>\n First and foremost bards are <em>masters of song</em>, and that also makes them <em>masters of party play</em>. The bard class is also the <em>master of multiclassing</em>, and the combination of all their powers make them <em>masters of versatility</em>.<br/>\n This makes bard one of the top classes for power-builds in NWN.<br/>\n<br/>\n But bard is also a fun class to roleplay. Even if the game and game mechanics represent performance with song, there are many forms of performance arts out there that your character can pursue. And it is not set in stone that your bard has to be an extrovert, persuasive, unreliable, charismatic character. There are many options if you want to give more depth to your character and divert from the traditional adventure-party scald stereotype.<br/>\n Many experienced players (including this one) say that once you start playing bards, there is no way back.<br/>\n<br/>\n<strong>The basics</strong><br/>\n Bard is a base class and can be taken at level 1<br/>\n Alignment restrictions: Any non-lawful<br/>\n Hit die: d6<br/>\n Proficiencies: Armor (light, medium), shields, weapons (simple)<br/>\n Skill points: 4 + int modifier ( x 4 at 1st level)<br/>\n Class skills: Appraise, bluff, concentration, craft armor, craft trap, craft weapon, discipline, heal, hide, listen, lore, move silently, parry, perform, persuade, pick pocket, spellcraft, taunt, tumble, UMD<br/>\n Primary saving throws: Reflex, will<br/>\n Base attack bonus: +3/4 levels<br/>\n Spellcasting: Arcane, level 0-6 spells, charisma-based and spontaneous cast.<br/>\n Special feats: Bardic knowledge and Bard song are gained at level 1<br/>\n Epic bonus feats: The epic bard gains a bonus feat every three levels, at levels 23, 26, 29, 32, 35, and 38.<br/>\n Available epic bonus feats are: arcane defense, curse song, epic skill focus (all but animal empathy), epic spell focus, epic will, extra music, great charisma, great dexterity, greater spell focus, greater spell penetration, improved combat casting, lasting inspiration and lingering song.<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:33 AM - Apr 26, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><span style=\"font-size:120%;line-height:normal\"><strong>Master of song</strong></span><br/>\n<br/>\n<strong>The Bard song</strong><br/>\n The Bard song is a one-click-buff for the whole party. It affects all allies within a distance of 30 feet and cannot be dispelled. It improves Attack Bonus, Damage, Armor Class (Dodge AC), Saves, Skills and adds temporary hitpoints. A normal Bard song lasts 10 rounds. The Lingering song feat makes the song last 15 rounds and the Lasting impression epic feat makes the song last 100 rounds. If you have both feats the song lasts 105 rounds. Your bard gets 1 attempt to sing per day for each bard level. The Extra music feat adds 4 songs per day.<br/>\n The Bard song will not affect a character already affected by a Bard song. You will have to wait until the other song expires. So if there happens to be more than one bard in a party, let the one with the best song sing!<br/>\n You cannot sing when silenced, and the song will not affect silenced creatures.<br/>\n<br/>\n The Bard song gets better with higher bard levels and at each level you need a given Perform skill rank for the song to work properly. The song reaches its maximum at level 30.<br/>\n AB maxes out at level 8 with +2<br/>\n Damage maxes out at level 14 with + 3<br/>\n AC maxes out at level 30 with +7<br/>\n The saves max out at level 16 with + 3Will/ +2 Fortitude/+2 Reflex<br/>\n The hitpoints max out at level 30 with +48<br/>\n The skills max out at level 30 with + 19 to every skill rank<br/>\n<br/>\n<strong>Bard song table</strong><table class=\"post_content_table\"><tbody><tr><td>Bard song lvl</td><td>Perform</td><td>Attack</td><td>Damage</td><td>Will</td><td>Fort</td><td>Refl</td><td>THP</td><td>AC</td><td>Skills</td></tr><tr><td>1</td><td>3</td><td>1</td><td>1</td><td>0</td><td>0</td><td>0</td><td>0</td><td>0</td><td>0</td></tr><tr><td>2</td><td>6</td><td>1</td><td>1</td><td>1</td><td>0</td><td>0</td><td>0</td><td>0</td><td>0</td></tr><tr><td>3</td><td>9</td><td>1</td><td>2</td><td>1</td><td>1</td><td>0</td><td>0</td><td>0</td><td>0</td></tr><tr><td>6</td><td>12</td><td>1</td><td>2</td><td>1</td><td>1</td><td>1</td><td>0</td><td>0</td><td>1</td></tr><tr><td>8</td><td>15</td><td>2</td><td>2</td><td>1</td><td>1</td><td>1</td><td>8</td><td>0</td><td>1</td></tr><tr><td>11</td><td>18</td><td>2</td><td>2</td><td>1</td><td>1</td><td>1</td><td>8</td><td>2</td><td>2</td></tr><tr><td>14</td><td>21</td><td>2</td><td>3</td><td>1</td><td>1</td><td>1</td><td>16</td><td>3</td><td>2</td></tr><tr><td>15</td><td>24</td><td>2</td><td>3</td><td>2</td><td>2</td><td>2</td><td>16</td><td>4</td><td>3</td></tr><tr><td>16</td><td>30</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>20</td><td>5</td><td>4</td></tr><tr><td>17</td><td>35</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>22</td><td>5</td><td>5</td></tr><tr><td>18</td><td>40</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>24</td><td>5</td><td>6</td></tr><tr><td>19</td><td>45</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>26</td><td>5</td><td>7</td></tr><tr><td>20</td><td>50</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>28</td><td>5</td><td>8</td></tr><tr><td>21</td><td>55</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>30</td><td>5</td><td>9</td></tr><tr><td>22</td><td>60</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>32</td><td>5</td><td>11</td></tr><tr><td>23</td><td>65</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>34</td><td>5</td><td>12</td></tr><tr><td>24</td><td>70</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>36</td><td>5</td><td>13</td></tr><tr><td>25</td><td>75</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>38</td><td>6</td><td>14</td></tr><tr><td>26</td><td>80</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>40</td><td>6</td><td>15</td></tr><tr><td>27</td><td>85</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>42</td><td>6</td><td>16</td></tr><tr><td>28</td><td>90</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>44</td><td>6</td><td>17</td></tr><tr><td>29</td><td>95</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>46</td><td>6</td><td>18</td></tr><tr><td>30</td><td>100</td><td>2</td><td>3</td><td>3</td><td>2</td><td>2</td><td>48</td><td>7</td><td>19</td></tr></tbody></table>\n\n The AB bonus from Bard song counts towards the +20 AB bonus cap. The same goes for the AC bonus. And that is of importance since Dodge bonus from different sources stack. The skill bonus also counts towards the +50 skill bonus cap.<br/>\n<br/>\n<br/>\n<strong>The sweet sixteen– and beyond</strong><br/>\n A level 16 Bard song gets max AB (+2), max damage (+3), max saves (3/2/2), AC +5 (vs +7 max), HP +20 (vs +48 max) and + 4 to skills (vs + 19 max). The Perform requirement at level 16 is 30 modified ranks. The Bard song at level 16 is by many players considered a sweet spot where you get the best return from your investment in class levels and Perform ranks.<br/>\n At higher bard levels the increase in Perform requirement becomes steep, with +5 for every level, ending at Perform 100 for a level 30 song. For that investment you get another +2 to AC, and + 28 HPs, which is not that great. But you also get an extra +15 to all skills, and that can have a great impact on gameplay.<br/>\n It is hard to reach a modified Perform rank of 100. You can max out the Perform skill, take skill enhancing feats and try to boost your charisma. A high level Bard song can also help improve the skill, but it will not help you benefit from a better Bard song, since the Bard song will not affect a character already affected by a Bard song. The bottom line is that you will need items with a skill bonus to be able to reach 100.<br/>\n<br/>\n<strong>The Curse song</strong><br/>\n The Curse song is a negative Bard song, a one-click debuffer that affects all your enemies within a distance of 30 feet and cause penalties to their Attack Bonus, Damage output, Armor Class, Saves and Skills, and cause sonic damage. You need to take the Curse song feat to be able to sing the Curse song, and singing the Curse song uses one of the Bard song attempts per day.<br/>\n The penalties and damage caused by the Curse song improve with bard levels and corresponding Perform skill, exactly in the same way as the Bard song improves the bonus to your party with higher levels. (The only exception is that the Bard song ends at +19 to skills whereas the Curse song table has one less skill point from level 22 and ends at -18 to skills.)<br/>\n The Curse song will not affect a creature already affected by a Curse song. It will not work if the singer is silenced and will not affect silenced creatures. The Curse song lasts 10 rounds, like the Bard song, and the feats Lingering song, Lasting impression and Extra music will also work with Curse song.<br/>\n The Perform skill bonus you get from the Bard song can make it possible to sing a higher level Curse song. To put it simple, this is possible because the Bard song affects you and your party, while the Curse song affects your enemies.<br/>\n Despite being hostile, singing the Curse song does not break invisibility.<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:37 AM - Apr 26, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong><span style=\"font-size:120%;line-height:normal\">Master of party play</span></strong><br/>\n<br/>\n I have already covered that the Bard song improves your party and the Curse song weakens your enemies.<br/>\n Curse song lowers the AB of your enemies. That has a similar effect to improving the AC for you and your party. A nice difference though, is that it happens without counting towards the +20 cap for any given AC type!<br/>\n The same goes for the effect of the Curse song on the enemy AC. That has a similar effect to improving the AB for your and your party, and that too does not count towards the AB bonus cap.<br/>\n<br/>\n For a level 16 song the summarized effect will be +7 AB and +7 AC for your bard and your party:<br/>\n +2 AB from Bard song<br/>\n +5 AB from Curse song (from -5 AC Curse song effect on enemies)<br/>\n +5 AC from Bard song<br/>\n +2 AC from Curse song (from -2 AB Curse song effect on enemies)<br/>\n<br/>\n The +7 AB and +7 AC bonus to the entire party from the level 16 songs make a <em>HUGE</em> difference and will change a fight completely.<br/>\n This effect will max out at bard level 30 where the combined song bonus will be +9/+9.<br/>\n<br/>\n Your bard can even add as much as +6 AB to this entire if you also use the Taunt skill, which is a class skill for bards, successfully on your target creature. One effect of Taunt is to reduce the target’s AC, and thus indirectly act like an AB bonus. In that way even the Taunt effect will not count towards the AB bonus cap.<br/>\n Of the +13 AB from the Bard song/ Curse song/ Taunt combo of a level 16 bard, only +2AB count towards the AB bonus cap.<br/>\n<br/>\n A high level song has tremendous effect on skills. The skill boost from a high level song will make the rogue in your party a master. Your chance to succeed with social skills will flourish. Versus enemies the effect will be even stronger when you combine Bard song and Curse song: The effect on combat will change dramatically when one party has the Discipline, Spellcraft, Taunt and Concentration ranks improved by almost 20, and the other party has them equally shrinked. When a Bard song improves your party’s detect skills by near 20 and the Curse song reduces the enemies’ stealth skills to the same degree, the chance of detection improves vastly. Conversely your success with stealth will improve greatly if the roles are swapped.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:44 AM - Apr 26, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><span style=\"font-size:120%;line-height:normal\"><strong>Master of multiclassing</strong></span><br/>\n<br/>\n<strong>The Bard skill-set</strong><br/>\nBards have a unique set of class skills: Appraise, bluff, concentration, craft armor, craft trap, craft weapon, discipline, heal, hide, listen, lore, move silently, parry, perform, persuade, pick pocket, spellcraft, taunt, tumble and UMD.<br/>\nHere you have access to “fighter” skills, such as discipline, concentration and taunt. You get “mage” skills like spellcraft and concentration. You have several “rogue” skills such as tumble, pick pocket and UMD. And you have social skills. Only trap skills, intimidate and spot, will rely on the other classes in your build.<br/>\n<br/>\nThe unique skill set makes the bard class very attractive in multiclassed builds. Using bard as a minor class in a build let you dump bard skills at intervals. In this way bard works as a filler that makes several different build types possible. It can add Discipline, Taunt and Spellcraft to a rogue build. It let you add Tumble, Listen, Taunt, UMD and Spellcraft to a warrior build, or Discipline, UMD, Tumble and stealth to a caster build, and so on.<br/>\nIn a build with bard as major class, a high level song bonus to skills will allow you to invest less skillpoints in several skills, because the song will improve the skills enough to get the job done anyway. Eg; one point in the trap skills, boosted by a high level song, may enable handling of deadly traps.<br/>\n<br/>\n<strong>Bard as stepping stone</strong><br/>\nBard counts as arcane caster and qualifies for the arcane archer and the palemaster classes. Bard is also a spontaneous caster with dragon in its bloodline, and as such qualifies for the Red dragon disciple class.<br/>\nBard based arcane archers, as opposed to wizard- and sorcerer based, will not need a third class pre-epic to get high enough BAB for the 4th attack per round. They will not need a tumble class as third class, and generally have greater freedom when deciding what 3rd class to pick, if any. XP penalty can be an issue though if you pick Bard together with a second primary class for an elven archer.<br/>\nBard based palemasters work well in builds made for physical combat. (For pure casters wizard is better, because the way wizards learn spells fits better the game mechanics of the PM class.)<br/>\nA bard/palemaster/warrior build secures a very robust melee presence with high AC and enables immunity to critical hits. Bard alone with only level 6 spells has not access to epic spells. But if you add 15 or more levels of PM, your already solid build gets access to epic spells such as Epic mage armor and Epic warding.<br/>\nThe red dragon disciple class is a power builder’s wet dream. You get immense stat increases – especially for strength - improved AC and a list of immunities. Only Bard and Sorcerer can qualify for RDD. Bard is better than Sorcerer in most builds because of the higher BAB and better class skills. Sorcerer can be an alternative in Monk and Paladin based builds because of the alignment restrictions.<br/>\nBard has access to class skills that are needed to qualify for Assassin, Shadowdancer and Harper scout. This secures bard builds the earliest possible access to these classes.<br/>\n<br/>\n<strong>How many bard levels you want for your character.</strong><br/>\n1-10 bard levels: At this level range you typically use bard as stepping stone or filler for a multiclassed build. You may take some levels of  bard early on to qualify for a prestige class. Apart from that you only use Bard for skill dumps at certain points in the build. The low level song will be of some benefit for the character, but often not enough to invest in the Curse song feat.<br/>\n11-15 bard levels: The Bard song begins to get an AC bonus that translates to an AB bonus when you use Curse song. Your bard gets mid level spells and can benefit from metamagic on low level spells. Sometimes your build ends with 14 or 15 bard levels instead of 16 because you have to give other classes priority.<br/>\n16 bard levels: This is the sweet-spot for the songs. You also have access to level 5 magic.<br/>\n20 bard levels: This is where you get access to Lasting impression, as long as you have an epic character so epic feats are available. With 20 levels you also have full access to bardic spellcasting. Your level 20 Bard song now requires 50 Perform ranks, which is still attainable without items.<br/>\n21 bard levels: This is basically the same as 20 levels with access to Lasting impression and full spellcasting. The extra level let you take Lasting impression early in the epic levels and still have a Bard level for a late skilldump.<br/>\n25 bard levels: At 25 caster levels your spells become immune to dispels, even from Greater dispelling.<br/>\n23, 26 and 29 bard levels: You get epic bonus feats<br/>\n30 bard levels: The song progression stops at 30 levels. This is one more indication that bard is supposed to be mixed with other classes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:02 PM - Apr 26, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><span style=\"font-size:120%;line-height:normal\"><strong>Bard magic</strong></span><br/>\n<br/>\n Bards are arcane casters and have access to their own list of spells from the level 0 cantrips to level 6 spells. Spell failure from armor is a factor for all spells with a somatic component.<br/>\n The magic is charisma based and bards are spontaneous casters. This works in the same way as the magic for sorcerers, but their spell repertoire is different.<br/>\n<br/>\n A level 20 bard knows 5 spells of each level from level 0 to 5, and 4 level 6 spells. The level 20 bard can cast 4 spells per day from each spell level plus bonus spells from charisma and any items.<br/>\n Bards only get level 6 spells and for that you need at least a charisma of 16. Bards cannot learn epic spells. But bards that multiclass with palemaster can still get epic spells if you take 15 or more levels of the palemaster class and choose epic spells when you level up as palemaster.<br/>\n<br/>\n Bards can benefit from metamagic feats. Extend spell, to make spells last longer and Still spell, to avoid armor related spell failure are the most popular. Automatic still spell I and II would make the casting care-free for armored characters, but you need level 9 spells from another class to be able to choose those feats, and most Bard builds never get that.<br/>\n I sometimes see bard specific items with reduced arcane spell failure as an item property.<br/>\n Many Bard players solve the problem with spell failure by removing the armor and shield before casting buffs well ahead of combat, and use stilled spells and non-somatic spells during battle.<br/>\n Bard spells without somatic component:<br/>\n Cantrips: Flare, Light<br/>\n Level 2: Blindness/deafness, Darkness<br/>\n Level 3: Displacement<br/>\n<br/>\n Bards can also to some degree serve as counterspellers. They have access to spellcraft to identify the spells they must counter. Bards have Lesser dispel (innate level 2) as level 1 spell, Dispel magic as level 3 spell and Greater dispelling as level 5 spell. Since bards are spontaneous casters they can choose to use their dispelling line of spells in all their “slots”. They can even use metamagic; still- or silent spell to fill the level 2, 4 and 6 slots and thus be able to counterspell between 20 and 30 spells per day at bard level 20. So the limitation is not in the number of spells but rather that these universal counterspells are limited to countering spells of the same level or lower.<br/>\n<br/>\n<strong>This is a listing of all bard spells.</strong><br/>\n I wanted to highlight my subjective choices. But then I realized that I could not agree with myself because different build types may benefit from different spells. The list still serves the purpose of demonstrating just that; how bard spells may serve very different purposes. And then I finally managed to highlight some spells after all.  (Feel free to post your own list below.)<br/>\n<br/>\n Cantrips: <strong>Cure minor wounds</strong>, Daze, Flare, Light, <strong>Resistance</strong><br/>\n 1st level spells:<strong> Amplify</strong>, Balagarn's iron horn, Charm person, Cure light wounds, <strong>Expeditious retreat</strong>, <strong>Grease</strong>, <strong>Identify</strong>, <strong>Lesser dispel</strong>, <strong>Mage armor</strong>, <strong>Magic weapon</strong>, <strong>Protection from alignment</strong> , Scare, Sleep, Summon creature I<br/>\n 2nd level spells: Blindness/deafness, <strong>Bull's strength</strong>, <strong>Cat's grace</strong>, Clarity, Cloud of bewilderment, Cure moderate wounds, <strong>Darkness</strong>, Eagle's splendor, Fox's cunning, <strong>Ghostly visage</strong>, Hold person, Invisibility, Owl's wisdom, See invisibility, <strong>Silence</strong>, Sound burst, Summon creature II, Tasha's hideous laughter, <strong>Ultravision</strong><br/>\n 3rd level spells: Bestow curse, Charm monster, Clairaudience/clairvoyance, Confusion, Cure serious wounds, <strong>Dispel magic,</strong> <strong>Displacement</strong>, Fear, Find traps, <strong>Greater magic weapon</strong>, Gust of wind, <strong>Haste</strong>, Invisibility sphere, <strong>Keen edge</strong>, Magic circle against alignment, Remove curse, Remove disease, Slow, Summon creature III, <strong>Wounding whispers</strong><br/>\n 4th level spells: Cure critical wounds, Dismissal, Dominate person, Hold monster, <strong>Improved invisibility</strong>, Legend lore, Neutralize poison, Summon creature IV, <strong>War cry</strong><br/>\n 5th level spells: Ethereal visage, <strong>Greater dispelling</strong>, Healing circle, Mind fog, Summon creature V   <br/>\n 6th level spells: <strong>Dirge</strong>, Energy buffer, Ice storm, Mass haste, Summon creature VI<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:08 PM - Apr 26, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><span style=\"font-size:120%;line-height:normal\"><strong>Bard skills</strong></span><br/>\n<br/>\nThere are a lot of very nice skills here! It's a pity you can’t afford to take them all.<br/>\n<br/>\n<strong>Appraise</strong> - Nice to have where gold is hard to get, but usually not vital<br/>\n<strong>Bluff</strong> - A cool alternative to persuade, but its usefulness depends on how often it is used in dialogues in the mod you play.<br/>\n<strong>Concentration</strong> - This skill helps avoid spell failure from taking damage, and helps resist taunts. A must have for casters, and very useful for melee fighters if  your opponents spam taunts. A skill I pick for my bards, if i can afford it.<br/>\n<strong>Craft armor and Craft weapon</strong> - Maybe of some use in extremely barren “living of the land” scenarios. I never take any ranks in these skills.<br/>\n<strong>Craft trap</strong> - A skill I sometimes take for trappers.<br/>\n<strong>Discipline</strong> - A must have for strength based frontline brawlers. Can also work well for dexterity based characters, and even casters if you boost it with skill focus feats. Helps avoid knockdowns, disarms and called shots.<br/>\n<strong>Heal</strong> - Nice to have in single player if healing potions are scarce and resting limited. Also fine to cure difficult poisons and diseases. Great to use to save dying comrades with healing kits in multiplayer.<br/>\n<strong>Hide and Move silently</strong> - If stealth is your thing, then this is it! Alternatives would be the invisibility spells and potions.<br/>\n<strong>Listen</strong> - This is your scouting skill. It is often better than Spot. You can boost it with the Amplify spell.<br/>\n<strong>Lore</strong> - Bards are masters of lore. You don’t need many ranks here, perhaps only 8 to qualify for RDD. Sometimes lore is rolled in dialogues. Lore bonus is common on items, and you have spells and the bardic knowledge feat to help you out.<br/>\n<strong>Parry</strong> - This skill doesn’t work properly in NWN<br/>\n<strong>Perform</strong> - Every bard needs enough Perform to meet the song requirements. High level bards need it desperately.<br/>\n<strong>Persuade</strong> - The most common social skill in mods, and the most common social skill bonus on items. If you want to take it, is a matter of taste and roleplay choice.<br/>\n<strong>Pick pocket</strong> - This skill can be fun, but has limited value in most mods. In multiplayer the skill has caused much grief, and most servers have detailed pp-rules.<br/>\n<strong>Spellcraft</strong> - I always try to get as much as I can here. The skill gives you a +1 to saves vs spells for every 5 modified ranks. It helps identify spells for counterspelling, and is required for epic spells. It also appears in dialogues, sometimes as an alternative to lore rolls.<br/>\n<strong>Taunt</strong> - This skill is an effective way to improve your hit rate by lowering the AC of your target with up to -6. You can also use it together with expertise to improve your AC, or with Power attack to improve damage and still be able to hit your target. The difficulty class is a Concentration check made by the target against the character's Taunt skill roll. If the Taunt is successful, the opponent suffers an armor class penalty equal to the difference between the Taunt roll and the defender's roll (to a max of a -6 penalty) for 5 rounds. The target will also suffer a 30% chance of spell failure, if they don't resist the Taunt.<br/>\n<strong>Tumble</strong> - A must have. Every 5 ranks of Tumble gives +1 AC. 40 ranks gives +8 AC. Tumble also helps you avoid attacks of opportunity when running past an enemy. The DC is 15.<br/>\n<strong>Use magic device</strong> - Also a must have. The skill let your character use items and scrolls restricted to other classes, races and alignments. The difficulty (DC) of the task is determined by the item value. Trying to use something restricted to another class is the easiest (base DC). Trying to use something restricted to another race adds 5 to the DC, and trying to use something restricted to another alignment adds 10 to the DC.<br/>\nBards can cast from most vanilla arcane scrolls without the UMD skill. Bards can cast from all scrolls restricted to other classes with a modified UMD rank of 10, even at high difficulty settings.<br/>\nSee <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354638/A-Miniguide-to-Designing-with-the-UMD-Skill\" rel=\"noreferrer\" target=\"_blank\"><strong>Hip's UMD guide</strong></a> for further details.<br/>\n<br/>\n<strong>Master of Lore</strong><br/>\nBards get the Bardic knowledge feat which grants a +1 bonus to lore for each class level (max 40).<br/>\nBards have Lore as class skill, like all other classes (max 43)<br/>\nBards can cast the Identify spell for a lore bonus of 10 + 1 per caster level (max 50)<br/>\nBards can cast the Legend lore spell for a lore bonus of 10 + 1 per 2caster levels (max 30)<br/>\nBards can sing Bard song for a skill bonus (max19)<br/>\nIntelligence gives a bonus (eg. intelligence 14 for a bonus of 2)<br/>\n<br/>\nTo identify items the game uses the table: skillvsitemcost.2da. This list maxes out at lore 55 to identify items worth 12.000.000 gold, so the potential max lore for the bard is extreme overkill.<br/>\nBut then again, with enough bard levels and the ability to cast Identify, you never have to put a single point in the lore skill – unless, of course, you want to qualify for RDD or HS.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:18 PM - Apr 26, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><span style=\"font-size:120%;line-height:normal\"><strong>Master of versatility</strong></span><br/>\n<br/>\nThe many assets of the bard class with songs and spells for buffing and debuffing and the great potential for multiclassing outlined above, makes the class very versatile.<br/>\nThe available class-spells also reflects this variety with healing spells, summoning spells, attack spells, a reciprocal defense shield, ability buffs, weapon and defense buffs, debuffers and the dispel line of spells, the darkness/ ultravision combo and utility spells for locks and traps etc.<br/>\nThe skill set also reflects this variety with skills from the fighter, healer, mage, scout and rogue domains.<br/>\n<br/>\n<strong>Roles and build types</strong><br/>\nBard builds can fill many different roles. Most bards will work as party buffers. Even at low levels, their song will give a significant bonus to AB and damage. A medium- to high level Bard song can be a game changer. Few Bards are built as dedicated casters, the way sorcerers are, but even so they have spells that make a difference when they buff their party, or debuff their enemies.  <br/>\nBards can make great frontline warriors, both strength and dexterity based. They are usually mixed with a warrior class for free armor and weapon feats and some extra BAB. But sometimes they are even paired with cleric. The access to the RDD and PM classes, make them shine in that role. They also have great potential as archers, especially when they are built with the AA class.<br/>\nBard can supplement rogue classes very well by adding warrior- and mage related skills, and providing some spell casting and the benefit of the song.<br/>\nIn some scenarios bards can even have a small support role as healer if you take the heal skill and pick the different available healing- and curing spells.<br/>\nBard can also supplement divine classes with their skills, songs and access to RDD. Some of the strongest builds you get are cleric/bard based. There is a charisma synergy when you mix bard with blackguard.<br/>\n<br/>\n<strong>Strength builds</strong><br/>\nThe typical strength build focuses on melee. You want heavy armor proficiency and martial- or exotic weapon proficiency for your bard. The Armor and shield call for stilled spells. Strength based bards usually multi class with combat classes like fighter, barbarian, CoT and blackguard, but also with cleric. And you often find RDD or PM in those builds.<br/>\n<br/>\n<strong>Dexterity builds</strong><br/>\nDexterity based builds can be melee characters with weapon finesse, archers or a combination of the two. They usually have a focus on combat, but many also display rogue skills and stealth.  A high dexterity means that you can downgrade your armor to clothing at some point and avoid armor related problems with spell casting. Dexterity bards want uncanny dodge from rogue, SD, assassin or barbarian. Epic dodge is a target for epic levels. Rogue and SD provide the feats you need to qualify for that. Some dexterity builds take the epic self-concealment feats. But a high level undispellable bard will normally rely on casting Improved invisibility instead.<br/>\nDexterity bards benefit from weapon proficiency martial, -exotic, -elf or -rogue that provide finesseable martial weapons and bows.<br/>\n<br/>\n<strong>Charisma builds</strong><br/>\nBard has charisma as primary stat for spell casting. But few bards go beyond charisma 16 which is what you need to be able to cast level 6 spells. As opposed to sorcerers it serves little purpose to invest heavily in charisma for increased spell DC with the limited selection of attack spells available for Bards.<br/>\nWhen you see bards with a high charisma, bard usually is part of a divine build with focus on a strong Divine might and –shield, or other charisma related divine feats.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:41 PM - Apr 26, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Another excellent Guide from the quill of Mr Dagger - thank you! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n A very welcome addition to the canon of the Guild's Guides.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "10:39 PM - Apr 27, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you very much for this guide!<br/>\n<br/>\n I have played a bit of bard in my last module (Fighter/Bard/RDD), and I can say that, even with a few levels, the effectiveness and the versality of the build improve a lot!<br/>\n I have a little question: when I play a meeler with a bit of Bard levels (for example, 4), is it effective (if possible) to choose the \"Extra song\" or \"Lingering song\" feat? Which of them would you choose?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:45 PM - Apr 28, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Aquarius 233 wrote:</strong><hr/>Thank you very much for this guide!<br/>\n<br/>\n I have played a bit of bard in my last module (Fighter/Bard/RDD), and I can say that, even with a few levels, the effectiveness and the versality of the build improve a lot!<br/>\n I have a little question: when I play a meeler with a bit of Bard levels (for example, 4), is it effective (if possible) to choose the \"Extra song\" or \"Lingering song\" feat? Which of them would you choose?</div></blockquote>\n<div align=\"left\">You're welcome!<br/>\n<br/>\n Spending extra feats on a low level song is not a priority in such a powerful build. Think of the song as something you add for +1 AB, +2 damage and a small bonus to saves, together with potions (bull's, bless, aid etc.) when preparing for the toughest fights.<br/>\n The picture is quite different when you have a higher level song somewhere in the teens. Then you want curse song and lingering. Extra music can be of value if resting is very resticted.<br/>\n If you go to lvl 20 or beyond and take lasting impression, lingering loses it's value, and extra music becomes pointless because of the long duration and the sheer number of songs per day.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:50 PM - Apr 28, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>Another excellent Guide from the quill of Mr Dagger - thank you! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /></div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "6:16 PM - Apr 28, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ok many thanks for the info!<br/>\n I have read this guide and I would like to...test your patience! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\n I have another question. with reference to the bard song, you say that:<br/>\n<em>\"The AB bonus from Bard song counts towards the +20 AB bonus cap. The same goes for the AC bonus. And that is of importance since Dodge bonus from different sources stack. The skill bonus also counts towards the +50 skill bonus cap.\"</em><br/>\n<br/>\n Does the (little) boost to saving throws counts toward the +20 cap mentioned in the below page?<br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Stack\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Stack</a><br/>\n I think so, but I would like to have a confirmation.<br/>\n<br/>\n Thank you for your reply!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "6:37 PM - Apr 28, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Mick!!!<br/>\n<br/>\n Like i didnt have enough builds to play, now i have a bunch of bard 16 and bard 20 ideas running though my head...<br/>\n<br/>\n Awesome guide though and I think i'll have to try a bard heavy build instead of my normal wizzies and sorcs.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:29 PM - May 04, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>conlaoch wrote:</strong><hr/>Thanks Mick!!!<br/>\n<br/>\n Like i didnt have enough builds to play, now i have a bunch of bard 16 and bard 20 ideas running though my head...<br/>\n<br/>\n Awesome guide though and I think i'll have to try a bard heavy build instead of my normal wizzies and sorcs.</div></blockquote>\n<div align=\"left\">Thank you!<br/>\n Hope you enjoy your singers! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /></div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "2:36 PM - May 04, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Aquarius 233 wrote:</strong><hr/>Does the (little) boost to saving throws counts toward the +20 cap mentioned in the below page?<br/>\n<br/>\n I think so, but I would like to have a confirmation.<br/>\n  </div></blockquote>\n<div align=\"left\">I think so too, but someone will have to test it to confirm it.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:16 AM - May 06, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Aquarius 233 wrote:</strong><hr/>Does the (little) boost to saving throws counts toward the +20 cap mentioned in the below page?<br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Stack\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Stack</a><br/>\n I think so, but I would like to have a confirmation.\n</div></blockquote>Consider it confirmed, Aquarius.  Saves from bard song count towards the PC's save cap. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:35 AM - May 06, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Mick Dagger wrote:</strong><hr/><span style=\"font-size:120%;line-height:normal\"><strong>Bard skills</strong></span><br/>\n<br/>\n--- clip ---<br/>\n<br/>\n<strong>Use magic device</strong> - Also a must have.  The skill let your character use items and scrolls restricted to other classes, races and alignments.<br/>\n<em>On UMD from the NWN Wiki</em>:<em> The base difficulty class (DC) of this task is determined by the value of the item, and modified by the type of emulation the character is attempting. If the character attempts to emulate a specific race, the DC increases by 5; if he attempts to emulate a specific alignment, the DC increases by 10. Emulating a specific class does not modify the base DC.<br/>\n<span style=\"color:#FF0000\">You must make a DC check of 25 + the level of the spell to cast a spell from a scroll if the difficulty mode of the game is set to Hardcore or higher. The special check for using a scroll at hardcore difficulty or higher does not apply to scrolls with no class limitations, to characters with at least one bard, sorcerer, or wizard level, nor to characters who have the spell in question prepared (ready to cast). It does apply to all other characters who have at least one level in rogue, shadowdancer, or assassin, even if that character has a class that is allowed to use the scroll normally.<br/>\n</span></em><span style=\"color:#FF0000\"><span style=\"color:#000000\">--- clip --</span></span><em><span style=\"color:#FF0000\"><br/>\n</span></em></div></blockquote>Hey, Mick!  Nice guide you posted here and its fills a need that has existed for much too long.<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nOne point in regards to what you've posted about the bard's version of UMD...<br/>\n <br/>\nI think including any information about the hardcore scroll check for the bard class simply muddies the waters since the class doesn't use it.  So why duplicate what's already been posted as a generalization on the NWNWiki in an ECB class guide?  Setting an effective UMD level seems to consistently confuse bard designers, new and vet alike, so perhaps it's better to just state the <span style=\"text-decoration:underline\">net</span> facts and distill out what's really needed.  I'd remove the section (marked in <span style=\"color:#FF0000\">red</span>) that is not applicable to bard, IMHO. <br/>\n<br/>\nBTW, I've included some other handy UMD factoids like skill focus feat availability in my <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354638/\" rel=\"noreferrer\" target=\"_blank\">Mini-guide to Designing with UMD</a> you may want to link in your outline since it delves deeply into the design mechanics of UMD for all classes... including bard.  Your choice, mate.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:20 PM - May 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Hip!<br/>\n<br/>\n As for UMD, you're right. I will edit that part and try to make it as simple as possible, and keep a bard focus.<br/>\n<br/>\n Edit: Done!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "9:00 PM - May 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n<blockquote><div>Aquarius 233 wrote:Does the (little) boost to saving throws counts toward the +20 cap mentioned in the below page?<br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Stack\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Stack</a><br/>\n<br/>\n I think so, but I would like to have a confirmation.<br/>\n  </div></blockquote>\n Consider it confirmed, Aquarius.  Saves from bard song count towards the PC's save cap. </div></blockquote>\n<div align=\"left\">\n Thank you very much for the confirmation, Hip!</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "7:08 PM - Apr 11, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you play Aielund (or any other module) with EMS there are several changes to the Bard class:<br/>\n<br/>\nYou get Weapon Proficiency Rogue.<br/>\n<br/>\nYou get 6 skill points per level + int bonus (x4 at lvl 1)<br/>\n<br/>\nYou have the following extra spells to choose from:<br/>\nAcid Splash as C0<br/>\nBanishment as C5<br/>\nDeafening Clang as C1<br/>\nDominate Monster as C6<br/>\nElectric Jolt as C0<br/>\nEndurance as C2<br/>\nEndure Elements as C1<br/>\nFreedom Of Movement as C4<br/>\nGreat Thunderclap as C5<br/>\nGreater Shadow Conjuration as C5<br/>\nHorizikaul's Boom as C1<br/>\nMass Charm as C6<br/>\nProtection From Elements as C3<br/>\nRay Of Frost as C0<br/>\nResist Elements as C2<br/>\nShadow Conjuration as C4<br/>\nShield as C1<br/>\nStoneskin as C4<br/>\n<br/>\nThe Bard song and Curse song  are changed:<br/>\nPerform requirement is Bard-level +3 for each song ( 4 for lvl 1 song, 5 for level 2 song etc)<br/>\nEvery 6 levels starting at Bard 1: +1 AB, +1 Damage (Bard 1, 7, 13, 19, 25 etc)<br/>\nEvery 6 levels starting at Bard 2: +1 DodgeAC  (Bard 2, 8, 14, 20, 26 etc)<br/>\nEvery 6 levels starting at Bard 3: +1 Fort<br/>\nEvery 6 levels starting at Bard 4: +1 Will<br/>\nEvery 6 levels starting at Bard 5: +1 Reflex<br/>\nEvery 6 levels starting at Bard 6: +1 Skills, +6 HP<br/>\nThere is no level 30 song cap<br/>\n<br/>\nAt lvl 16 the bonus is: +3 AB, +3 Damage, +3 AC, +3 Fort, +3 Will, +2 Refl, +2 skills, +12 HP, and there is not a clearly defined \"Sweet spot\" at lvl 16 anymore.<br/>\n<br/>\nLasting Impression is only 2x normal song duration (i.e. 20 rounds)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "6:26 AM - Jul 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote:</cite><strong>Perform</strong> - Every bard needs enough Perform to meet the song requirements. High level bards need it desperately.</div></blockquote>\nHey Mick,<br/>\nI've been going through this (as well as your Spell Sword of Bahamut) to try to optimise my Drum Major of Torm spell sword build; it has helped A LOT. One question about perform. 16th level of bard song needs 30 perform but at Lvl 40 how much should you bank on coming from items. I'm assuming you want to only rely on items in case of debuffs. Do you have a rule of thumb?<br/>\nRegards,<br/>\nEltalstro<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:02 PM - Jul 17, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I always try to have enough ranks for the song to work at its current level. At higher levels you depend on items for this to happen, simply because you cannot get a high enough perform rank even with skill enhancing feats and a buffed charisma. Normally I don't calculate in anything extra to withstand debuffers, but if I were planning my build for an environment where that is a serious problem, I might reconsider.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "yecori1001",
      "avatar": "no_avatar.png",
      "timestamp": "12:00 AM - Jul 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Mick! What do you think, for an usual melee bard at level 26 with bard song, which of the skill combination would be better?<br/>\nUMD 42 (45) / Heal 25 (24) or Listen 25 (24)<br/>\nUMD 30 (33) / Concetration 37 (40) or Listen 37 (36)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:54 PM - Jul 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>yecori1001 wrote: <a data-post-id=\"21123\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21123&amp;sid=5ad0e4a0a85658039fbbbdc0e1bd26bc#p21123\">↑</a><div class=\"responsive-hide\">Jul 05, 2020</div></cite>Hi Mick! What do you think, for an usual melee bard at level 26 with bard song, which of the skill combination would be better?<br/>\nUMD 42 (45) / Heal 25 (24) or Listen 25 (24)<br/>\nUMD 30 (33) / Concetration 37 (40) or Listen 37 (36)</div></blockquote>\nSorry for posting this late.<br/>\nAs a general rule, what is best depends to some degree on the environment. <br/>\nUMD 33 is usually the target for lvl 9 scrolls, but with bard there is no regular UMD scroll check. So UMD 10 is enough to use scrolls without problems, simply based on the gold value of scrolls.<br/>\nIf you need UMD 30 or 45 to use items, depends on what items are available.<br/>\n<br/>\nWith listen, I prefer it as high as possible.<br/>\n<br/>\nHeal is not a skill I give priority. Potions will normally get the job done.<br/>\n<br/>\nConcentration is a \"nice to have\" skill. It protects against taunts and casting failure from taking damage. Normally I buff up before combat and don't cast so much during. So it is not vital the way I play. But it can still be useful if your enemies taunt a lot.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:22 PM - Jul 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">One thing I would like to add here - a Bard can boost his OWN song through singing!<br/>\n<br/>\nSo a Bard in his own Party (or one that uses Curse Song) should sing alone to himself (this, of course, depends on Perform ranks and Bard level btw, so check before \"expending\" a Song) and then Sing to the party with the buffed bonus to Perform and the buffed bonus to Curse for enemies.<br/>\n<br/>\nIt can act as a \"double whammy\" sort of situation that just boosts things further.  Of course, this will require that the Player of the Bard character keep all the addy's in view.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:27 PM - Feb 09, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"21397\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=21397&amp;sid=5ad0e4a0a85658039fbbbdc0e1bd26bc#p21397\">↑</a><div class=\"responsive-hide\">Jul 31, 2020</div></cite>One thing I would like to add here - a Bard can boost his OWN song through singing!\n</div></blockquote>\nGood point Web!<br/>\nLike you say, just stay away from your party when boosting up the song. That way they will benefit from your improved song when you sing for them.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Voles",
      "avatar": "10759447_1617790230.jpg",
      "timestamp": "3:42 PM - Apr 07, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote: <a data-post-id=\"9802\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=9802&amp;sid=5ad0e4a0a85658039fbbbdc0e1bd26bc#p9802\">↑</a><div class=\"responsive-hide\">Apr 26, 2017</div></cite><strong>Dexterity builds</strong><br/>\nDexterity based builds can be melee characters with weapon finesse, archers or a combination of the two. They usually have a focus on combat, but many also display rogue skills and stealth.  A high dexterity means that you can downgrade your armor to clothing at some point and avoid armor related problems with spell casting. Dexterity bards want uncanny dodge from rogue, SD, assassin or barbarian. Epic dodge is a target for epic levels. Rogue and SD provide the feats you need to qualify for that. Some dexterity builds take the epic self-concealment feats. But a high level undispellable bard will normally rely on casting Improved invisibility instead.<br/>\nDexterity bards benefit from weapon proficiency martial, -exotic, -elf or -rogue that provide finesseable martial weapons and bows.</div></blockquote>\nI wonder what full bab class mix with dex bard to get the best result? and how many lvls? I want at least 16 lvl of bard, but better to get 25 lvl for undispellable spells and lasting inspiration.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "9:11 PM - Apr 07, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Voles,<br/>\n<br/>\nAt 25 levels of bard, you need to consider how you'd get the required 75 points of perform. If you're pushing  DEX to 30 this could prove difficult. You'd also want to think about how you'd boost damage output. Others will have better advice on how to do this. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Voles",
      "avatar": "10759447_1617790230.jpg",
      "timestamp": "9:37 PM - Apr 07, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>eltalstro wrote: <a data-post-id=\"24181\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24181&amp;sid=5ad0e4a0a85658039fbbbdc0e1bd26bc#p24181\">↑</a><div class=\"responsive-hide\">Apr 07, 2021</div></cite>Hey Voles,<br/>\n<br/>\nAt 25 levels of bard, you need to consider how you'd get the required 75 points of perform. If you're pushing  DEX to 30 this could prove difficult. You'd also want to think about how you'd boost damage output. Others will have better advice on how to do this. <br/>\n<br/>\nSent from my G3125 using Tapatalk</div></blockquote>\nthanks) Haven't even think about this. Now i need to change my build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:15 PM - Apr 07, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Voles wrote: <a data-post-id=\"24176\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24176&amp;sid=5ad0e4a0a85658039fbbbdc0e1bd26bc#p24176\">↑</a><div class=\"responsive-hide\">Apr 07, 2021</div></cite>\nI wonder what full bab class mix with dex bard to get the best result? and how many lvls? I want at least 16 lvl of bard, but better to get 25 lvl for undispellable spells and lasting inspiration.</div></blockquote>\nIf you want an archer the answer is AA.<br/>\nIf you want melee, there are many ways to do it, with or without full bab classes. Rogue, SD, Assassin, Fighter, BG, CoT, Barbarian and RDD come to mind as they all have something to offer a build.<br/>\nI suggest that you look up some builds in our 40s section or <a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/buildsearch/index.html\" rel=\"noreferrer\" target=\"_blank\">here</a> and see for yourself.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "1:09 AM - Apr 08, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><br/>\n<blockquote><div><cite>Voles wrote:</cite><blockquote><div><cite>eltalstro wrote: <a data-post-id=\"24181\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24181&amp;sid=1a70d3c67148a9401fbd4ba72db15975#p24181\">↑</a><div class=\"responsive-hide\">Apr 07, 2021</div></cite>\n</div></blockquote>\nthanks) Haven't even think about this. Now i need to change my build.</div></blockquote>\n\nThat's the story of my NWN life. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "11:13 PM - Dec 15, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here's a question that I haven't found an answer in the nwnwiki: does the AC penalty caused by the bard's Curse Song stack with AC penalty from Taunt?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:15 PM - Dec 15, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, it does.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "8:55 PM - Jan 21, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Bard training : <a class=\"postlink\" href=\"https://www.instagram.com/reel/CnXGpedrL_v/?igshid=YmMyMTA2M2Y%3D\" rel=\"noreferrer\" target=\"_blank\">https://www.instagram.com/reel/CnXGpedr ... MTA2M2Y%3D</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Jenova91",
      "avatar": "no_avatar.png",
      "timestamp": "1:34 PM - Mar 15, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Excuse me to reactivate the topic, firstly great work and presentation ! <br/>\nBut i noticed that your malus calculation isnt the one in Nwnwiki, the curse song is supposed to lower the AC more than in your presentation.<br/>\n<br/>\nI maybe missread something or i dont know.<br/>\nBecause iam looking to make a 16 bard then (idk) lvl max 24 , rp/pvp factions, probably dex based to max AC.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:26 PM - Mar 15, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is the Curse Song table :<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:27 PM - Mar 15, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I fail to see where you are finding a \"malus in calculation\" here.  Could you please point out what you consider a \"malus in calculation\" at level 16?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:05 PM - Mar 15, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm not sure why you'd think that <em class=\"mention\">@Jenova91</em> ? The Curse Song is an exact mirror of the Bard Song, exactly replicating the various effects but adversely affecting enemies rather than aiding the Bard's party (apart from one tiny example that Mick details in the section about Song, but that's about skills not AC). Web's table, lifted from the wiki, confirms both that and Mick's table on page 1.<br/>\n<br/>\nThe only thought I have is that if where you play has altered the application of Bard/ Curse Song? I know that Aielund has made alterations to Song, but irc not Curse (can't swear to that, I'm afraid), along with other changes to the class.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Jenova91",
      "avatar": "no_avatar.png",
      "timestamp": "4:01 PM - Mar 15, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Totaly sorry, i missread and the numbers are corrects ! <br/>\n<br/>\nIts the part about Bard song and Curse song cummulated that made me confused<br/>\n<br/>\nAgain, accept my apologizes and thanks for your quick anwsers !<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:17 PM - Mar 15, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Don't be sorry - I misread stuff all the time. The knack is to ask: as you have.<br/>\n<br/>\nAnd welcome to the Guild <em class=\"mention\">@Jenova91</em> !<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}