{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "012",
  "name": "Help tweaking GDL's Deathless Pariah for Swordflight",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/help-tweaking-gdl-s-deathless-pariah-for-swordflig-t2356287.html",
  "author": "jassamisalami",
  "avatar": "no_avatar.png",
  "replies": "1",
  "views": "297",
  "posts": [
    {
      "author": "jassamisalami",
      "avatar": "no_avatar.png",
      "timestamp": "2:51 AM - Dec 04, 2024",
      "content": "<div>Hey guys, I'm finally going to take a run at finishing Swordflight after many years (and characters) on the module. I've been eyeing GDL's Deathless Pariah on the old website for a long time and I think it will be the one I want to go all the way with. However, there are some changes that I think will make it more suitable for the module, but I'm afraid of accidentally nerfing the build because I'm not the best builder in the world and I'm also pretty unfamiliar with Palemaster. I'll post the full build as designed by GDL at the end of this post. <br/>\n<br/>\nMy proposed changes are:<br/>\nA. Going 10 PM /17 Wiz /14 Fighter instead of 17 PM/ 10 Wiz/ 14 Fighter. I know this will lose Autostill III and Epic Warding, as well as some AC, but it should net me higher caster levels and more spells. I think this is a pretty solid tradeoff in the limited rest environment of Swordflight. <br/>\nB. Removing most of the combat feats in order to gain Cleave, Exotic Weap, and Spell Penetration Feats. This is mostly just playstyle specific. I've never been a big fan of the combat feats and I would rather lean into no save spells, and use the higher caster levels and spell pen feats to overcome spell resistance. <br/>\n<br/>\nMy question is will this result in any big issues I have overlooked? Other than the loss of the two epic feats and the AC? Is there some glaring reason why this build would fall apart if I shift these levels? I don't want to get 33 levels in and then realize that this isn't going to work. <br/>\n<br/>\nHere is the GDL Build:<br/>\nHuman<br/>\nLawful Neutral<br/>\n<br/>\n<br/>\n<strong>Deathless Pariah</strong><br/>\nFighter14/Wizard10/Palemaster16<br/>\n<br/>\n<br/>\n<strong>Attributes</strong><br/>\nStr16 (26)<br/>\nInt16 (20)<br/>\nWis8<br/>\nDex8<br/>\nCon16<br/>\nChr8<br/>\n<br/>\n1 Fighter1, Weapon Focus, LoH, Lightning Reflexes<br/>\n2 Fighter2, Knockdown<br/>\n3 Fighter3, Blindfighting<br/>\n4 Fighter4, Weapon Specialization, Str17<br/>\n5 Fighter5<br/>\n6 Wizard1, Still Spell<br/>\n7 Wizard2<br/>\n8 Wizard3, Str18<br/>\n9 Wizard4, Extend Spell<br/>\n10 Fighter6, Improved Knockdown<br/>\n11 Fighter7<br/>\n12 Fighter8, Improved Critical, Called Shot, Str19<br/>\n13 Palemaster1<br/>\n14 Palemaster2<br/>\n15 Palemaster3, Disarm<br/>\n16 Fighter9, Str20<br/>\n17 Palemaster4<br/>\n18 Fighter10, Improved Disarm, Toughness<br/>\n19 Fighter11<br/>\n20 Fighter12, Expertise, Int17<br/>\n21 Wizard5, Epic Weapon Focus, Great Int I<br/>\n22 Palemaster5<br/>\n23 Palemaster6<br/>\n24 Fighter13, Epic Weapon Specialization, Str21<br/>\n25 Palemaster7<br/>\n26 Palemaster8<br/>\n27 Palemaster9, Great Str I<br/>\n28 Palemaster10, Str23<br/>\n29 Wizard6<br/>\n30 Wizard7, Great Str II<br/>\n31 Wizard8,<br/>\n32 Wizard9, Int19<br/>\n33 Wizard10, Great Int II, Epic Prowess<br/>\n34 Palemaster11<br/>\n35 Palemaster12<br/>\n36 Palemaster13, AutoStill I &amp; II, Str25<br/>\n37 Palemaster14<br/>\n38 Palemaster15<br/>\n39 Palemaster16, AutoStill III, Epic Warding<br/>\n40 Fighter14, Armor Skin, Str26<br/>\n<br/>\nAB: 38<br/>\nAC: 36<br/>\nHit Points: 465<br/>\n<br/>\nFort: 27 (36)<br/>\nWill: 22 (31)<br/>\nReflex: 18 (27)<br/>\n<br/>\nDiscipline: 43 (51)<br/>\nConcentration: 43 (46)<br/>\nSpellcraft: 42 (47)<br/>\nTumble: 20<br/>\nListen: 42<br/>\nHeal: 43<br/>\nSearch: 10<br/>\nLore: 10<br/>\n<br/>\n<strong>Special</strong><br/>\nCan Autostill all Extended Spells<br/>\nImmunities: Criticals, Sneak Attack, Stun, Hold, Paralysis<br/>\nSummons: Ghoul King<br/>\nDeathtouch DC: 20 (don't actually use this)<br/>\n<br/>\n<strong>Preferred Spells</strong>:<br/>\n<br/>\n1st(5): Truestrike, Mage Armor, Protection from Alignment<br/>\n2nd(5): Bulls Strength, Cats Grace, Flame Weapon, Ultravision<br/>\n3rd(5): Keen Edge, Invisibility Sphere<br/>\n4th(5): Improved Invisibility, Lesser Spell Breach, Elemental Shield<br/>\n5th(5): Mestil's Acid Sheath, Bigby's Interposing Hand, Lesser Spell Mantle<br/>\n6th(4): Greater Spell Breach, True Seeing, Greater Stoneskin<br/>\n7th(4): Spellmantle, Shadowshield<br/>\n8th(3): Greater Sanctuary, Premonition<br/>\n9th(2): , Timestop, Mord's Disjunction</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:34 AM - Dec 04, 2024",
      "content": "<div>The Deathless Pariah by GDL is a fine-tuned build, achieving level 9 spells and Auto still feats and Epic warding by taking enough PM levels.<br/>\nAlbeit being a spellsword, the way it is built, it is primarily a tank and a self buffer. Even though it is not specified in the build write-up, I assume that it is designed for a large two-handed weapon with a situational boost to AB from the Disarm feats. <br/>\n<br/>\nBack in 2004, GDL wrote:\n<blockquote><div>//the Curse of the Deathless Pariah, finally be lifted!<br/>\n<br/>\nMaintained the 16BAB, the 38AB, improved saves slightly, garnered an extra 5th spell slot, snatched all the Autostills, secured Epic Warding, increased hit points, and increased combat combos, like TrueStrke/Improved Disarm, TrueStrike/Knockdown, Called Shot, etc....<br/>\n<br/>\nI forgot how tough this guy actually was. As if his Immunities and high AC weren't bad enough, all of his Extended spells are automatically AutoStilled-- hello Improved Invis, Elemental Shield and Mestil's Acid Sheath, Keen Edge and Flame Weapon! He can Premonition or Greater Sanctuary, Timestop or pull out Epic Warding, and still nail his opponents with his mighty blade. His True Seeing eliminates the Rogue threat, but with his immunity to sneaks they were never much of a threat to begin with. He can slap an Extended Bigby's Interposing Hand on the enemy to lower their AB by 10 (the last thing your opponent wants you to do when you're coming at them lock, stock and smoking bone arm!). And his maxed concentration combined with crit/sneak immunity insures his spells will be uninterrupted.<br/>\n<br/>\nPlaytested again, and Dwarflord approved. He smokes everybody. He just has too many aces up his sleeve for anyone to get a good drop on him. Of course, heavy casters will probably tear him apart, but he can always Greater Sanctuary, or TIme Stop, summon the Ghoul King, and run like hell.<br/>\n//<br/>\nEpic Warding is probably the best defensive buff in the game, excepting things like Greater Sanctuary, etc. Epic Mage Armor is nice, and is probably better suited to a heavy caster. A plate-wearing Palemaster spellsword can better spend his feats on other things. He already has a solid array of great defensive buffs and has a decent supply of them. It seemed more useful to get Int to 20 to get that extra 5th level spell slot for casting Extended Improved Invis or Elemental Shields which eventually become Autostilled <em>and </em>Extended.<br/>\n<br/>\nYou can further give yourself 1 additional spell slot per level if you pick a specialty school. Illusion and Transutation (losing Conjuration in a build like this isn't a great loss, as there are very few spells from that list I would choose, with the exception of Mestil's) come to mind. Necromancy is also a choice if you know you can obtain True Seeing on an item.</div></blockquote>\nI would not change the build.</div>",
      "author-color": "#AA0000"
    }
  ]
}