{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "697",
  "name": "The Unhittable, Damage Resistant, Dragon Devastator (Rogue 16 / Bard 2 / RDD 22)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-unhittable-damage-resistant-dragon-devastator--t2355337.html",
  "author": "Orion",
  "avatar": "10759084_1591431150.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:28 PM - Feb 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">In many ways this build is completely crazy.<br/>\n<br/>\nI fit into it:<br/>\n- Devastating Critical Rapier<br/>\n- Epic Damage Reduction III<br/>\n- Epic Dodge<br/>\n<br/>\nWhich is totally insane. <br/>\n<br/>\nAnd yet, when I look at the numbers, it looks unusually playable.<br/>\n<br/>\nThe base AB of 36 is of concern, and I wish it were higher, but it was challenging to get it higher than that, up to the benchmark of about 40.<br/>\n<br/>\nAC gets +8 from tumble and +6 from RDD, bard provides shield proficiency for free, and the build has 576 HP with EDR III and epic dodge, so defensive capabilities are very strong. <br/>\n<br/>\nWith all that dex AC, eventually robes or padded armor is what this guy will wear.<br/>\n<br/>\nThis idea is interesting, and if there are sufficient AB boosts in the environment you are playing in, then this could be quite a fun build to play.<br/>\n<br/>\nPerhaps I will require some tips on how to play a 3/4 BAB class properly (which this is, albeit a very beefy one)!<br/>\n<br/>\nI can't think of a build which combines the three big big feats I describe, ever posted up before, so I have posted this up for your review and enjoyment.<br/>\n<br/>\n20% Exp penalties from level 12. It also looks like Half-Orc could also work, although one will have less skill points and one loses all the awesome dwarven racial bonuses<br/>\n<details><summary>Spoiler</summary>Rogue(16), Bard(2), Red Dragon Disciple(22), Dwarf\nSTR: 16 (26)\nCON: 18 (22)\nINT: 8 (10)\n\n01: Rogue(1): Blind Fight\n03: Rogue(3): Weapon Focus: Rapier, {Uncanny Dodge I}\n05: Rogue(5)\n07: Rogue(7)\n09: Rogue(9): Cleave\n11: Rogue(11)\n13: Red Dragon Disciple(1)\n15: Red Dragon Disciple(3): Improved Critical: Rapier\n17: Red Dragon Disciple(5)\n19: Red Dragon Disciple(7): (CON=22)\n21: Red Dragon Disciple(9): Epic Weapon Focus: Rapier, (INT=10)\n23: Rogue(12)\n25: Red Dragon Disciple(12)\n27: Rogue(13): Devastating Critical: Rapier, Defensive Roll\n29: Red Dragon Disciple(15)\n31: Red Dragon Disciple(17)\n33: Red Dragon Disciple(18): Great Dexterity I, Epic Damage Reduction III, (DEX=21)\n35: Red Dragon Disciple(20)\n37: Rogue(15)\n39: Red Dragon Disciple(22): Great Dexterity III, Epic Prowess, (DEX=24)\n\nSkillpoints: 180\nSaving Throw bonuses: Spells: +3, Traps: +3, Poison: +2\nAB (max, naked): 36 (melee), 32 (ranged)\nSpell Casting: \n\n\n01: Disable Trap(1), Listen(4), Lore(4), Open Lock(1), Search(4), Set Trap(1), Tumble(4), UMD(4), Save(5), \n03: Listen(1), Lore(1), Tumble(1), UMD(1), Save(10), \n05: Listen(1), Lore(1), Tumble(1), UMD(1), Save(16), \n07: Listen(1), Tumble(1), UMD(1), Save(24), \n09: Listen(1), Tumble(1), UMD(1), Save(32), \n11: Listen(1), Tumble(1), UMD(1), Save(40), \n13: Discipline(1), Listen(1), Save(24), \n15: Discipline(1), Listen(1), Save(22), \n17: Discipline(1), Listen(1), Save(20), \n19: Discipline(1), Listen(1), Save(18), \n21: Discipline(1), Listen(1), Save(16), \n23: Listen(1), Tumble(10), UMD(11), Save(2), \n25: Discipline(1), Listen(1), \n27: Listen(1), Search(1), Tumble(5), Save(1), \n29: Discipline(1), Listen(1), \n31: Discipline(1), Listen(1), \n33: Discipline(2), Save(2), \n35: Discipline(1), Save(4), \n37: Tumble(10), Save(3), \n39: Discipline(1), Search(1), </details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "12:43 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hail ye!  I got just one question for ya.  Actually, I meant to ask this in one of the other ones you posted.  How do you have time to test all of these let alone play them?  At a clip of about 4 per day, I'm nigh dizzy.  I'm still trying to level up builds I posted in 2008 (<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build295887.html\" rel=\"noreferrer\" target=\"_blank\">like this one</a>), among others.  Not trying to dissuade you, mind you, just a curious streak.  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:27 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hail GDL!<br/>\n<br/>\nI post a lot of unfinished build drafts, these are not yet ready for consideration for the level 40 section.<br/>\nThese are simply ideas, which I refine to a draft stage without play testing. <br/>\nI put them up to share in the unfinished build section / build request section of the forum.<br/>\n<br/>\nThis has several benefits:<br/>\n1. If there are obvious pitfalls then these will be commented on rapidly<br/>\n2. If there are weaknesses (for example, this triple epic feat build draft which stretches everything to the limit, only has a Base AB of 36) then I might ask if there is any way this weakness could be addressed, or is it just impossible within the NWN rules.<br/>\n3. If they are good ideas, then I use that feedback to prioritise developing one idea over another. If they are not so exciting ideas, then I might not prioritize developing it or even pause development on the idea. <br/>\n4. It gives me time to develop some lore into the concept<br/>\n5. Others, may in fact play test the build before I do and give me suggestions. I posted a <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=17230#p17230\" rel=\"noreferrer\" target=\"_blank\">Lord of Gruumish - Fighter 20 / Bard / Pale Master</a> build draft 5 months ago, trying to find a build in which the half-orc is 'the most optimal race'. <em class=\"mention\">@zg1k</em> was kind enough not only to suggest comments, but to play test this build to 40 before I have even got around to it, and give me comments during the play testing as to what worked well. He told me it was quite straightforward to play. It is probably worthy of consideration to the level 40 section but I want to give it a bit more time and consideration before I submit it, unless others tell me such a build should be a priority<br/>\n6. If it is a good idea, it mulls around into my head until I scribe it down somewhere (usually in the CBC spreadsheet is the fastest method). After I scribe it down, if the numbers look good or there is something that I think might be of interest, then I post it up. Otherwise it continues to bug me until I do post it up, if you know what I mean? Like the double dev crit half-elf build then the double dev crit / EDR III half-elf build drafts. They looked so good I had to share em, develop the concept further, otherwise it would have just bugged me to no end.<br/>\n<br/>\nThere's probably more, but I do appreciate the moderators and the guild community accomodating this it does get the ideas out of my brain to give it space for other ideas. Some months ago I struggled a bit figuring out what sort of cleric build I would like to play. I still have no idea. I went through devastating critical cleric build ideas, then double devastating critical cleric build ideas, then devastating critical pale master build ideas, then divine damage devastating critical zen arbalest ideas.... I think at some stage Mick Dagger just wrote: \"Please, feel free to post whatever cleric build you fancy Orion!\"<br/>\n<br/>\nI am play testing a few builds at once. I have been play testing through the Double Devastating EDR III Half-Elf Build Draft, the Mage-Fist Build Draft and the the HiPS Speed Caster Build Drafts so far this week. It will take a bit of time to get through all of them. The ideas are there to share to freely share at the minimum, and the conveyor belt is still chugging along slowly and surely.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:53 PM - Feb 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Orion2019 wrote: <a data-post-id=\"18881\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18881&amp;sid=1b90144ce703e9d33c49a3c6731bab01#p18881\">↑</a><div class=\"responsive-hide\">Feb 04, 2020</div></cite>...and the conveyor belt is still chugging along slowly...</div></blockquote>\nI sense a tiny understatement here... <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\nI know that you play a lot too, and test different character types. I enjoy when you share your experience with playing the different builds. That also gives the guild a feedback on the advice  given, confirming common knowledge or sometimes discovering something different.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}