{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "104",
  "name": "Arelith - Cleric Build Request",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-cleric-build-request-t2354629.html",
  "author": "AngelsAndDemons",
  "avatar": "10577588_1510287072.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "AngelsAndDemons",
      "avatar": "no_avatar.png",
      "timestamp": "4:35 AM - Nov 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello,<br/>\n<br/>\n I am looking to create one single character on Arelith with the goal of being able to take on the broadest range of foes, essentially the best all-around PVP build. If I had more time to play I would create a different build for each type of foe, but unfortunately I only have time to create a single one. I tend to favor clerics for the sake of nostalgia, but I am open to any class/build really.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "AngelsAndDemons",
      "avatar": "no_avatar.png",
      "timestamp": "6:58 AM - Nov 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I wanted to share some feedback I've received about this build from a prominent poster here. His comments are in bold along with my responses. This was in response to me saying I wanted to play the imploder build, whereas now, after getting his feedback, I've opened up to any and all options really. I'd like to avoid having multiple builds if possible.<br/>\n<br/>\n<strong>First, I'd recommend build one vs. warrior/CoT types, high CHA pally/BG.  That includes the high CON, EDR builds.  All those can have ridiculous Fort saves when they combine the CON, sacred defense, Epic Fort, dark blessing, etc.  And that translates into only one thing for a cleric Imploder: Uber WIS!  As high as possible.<br/>\n<br/>\n You've got a good start with the spell foci but need much higher WIS, as high as you can get.  A split like Clc26/CoT4 will not only provide more opportunities to increase WIS but raise your pedestrain saves a bit. </strong><br/>\n<br/>\n Will definitely conside this.<br/>\n<br/>\n<strong>Set STR at 14 and CON at 16 (again, more help vs. Fort) if you are using gifts.  DP will raise STR to 18 plus empowered Bull STR reaches 24.  </strong><br/>\n This only works if I cast divine power first, then use the Bull's Strength, which is going to limit me to 30 rounds or 3 minutes, and it assumes I didn't start the encounter buffed with bull's strength already. It would be great if I could pull it off, but it sounds difficult to pull off.<br/>\n<br/>\n<strong>I wouldn't let DEX go lower than 10 because your reflex is nasty bad already.  Use pots to raise up for that 1 AC if you want.  A shield-using cleric should have no problems at all with reach high AC levels (I'm assuming Arelith is sort of low to mid magic as enhancements go, which plays directly into the hands of a serious self-buffer).</strong><br/>\n<br/>\n I'm considering lowering my intelligence a few points to add additional points into dex or con.<br/>\n<br/>\n<strong>You missed Blind Fight which means you won't hit any SC types with your sword regardless of your AB.</strong><br/>\n<br/>\n I definitely considered blind fight, I basically ran out of feats. If I don't need spell penetration I would strongly consider grabbing Blind FIght instead.<br/>\n<br/>\n<strong>Don't worry about beating SR with penetration feats since SR isn't a factor with those types.  Maybe there's an SR belt around that they might decide to use but there are enough cleric levels to beat them all with average dice rolls (27-46).</strong><br/>\n<br/>\n There's no belt that I'm aware of on Arileth, but I'd like to make this build as generally versatile as possible, including encounters with spell casters. This it one of the reasons I grabbed UMD, so I could use spell breach, and death spell casters. That was the goal at least.<br/>\n<br/>\n<strong>Empower spell is essential.  Extend is a convenience.  You need to boost DC as high as possible so with buffs and feats should reach: 10 + 9slvl + 13wis + 6feats +3implode = DC 41 for Implodes, not counting the gifts.  I'm figuring on reaching WIS 30 plus an Empowered Owl buff for that Wis element.</strong><br/>\n<br/>\n On Arlieth, you can add 2 +1 enchants to each piece of gear. With +6 to both str/wis I can easily get to 10 cap without empowered bulls strength and owl's wisdom, unless I'm missing something?<br/>\n<br/>\n<strong>Bard serves no purpose in this build.  The extra 3 tumble AC you'll more than make up with all your cleric AC buffs.  Besides, AC should never become a factor with an artillery attack like Implode.  Using arcane scrolls won't effect dueling with these types of opponents.</strong><br/>\n<br/>\n The reason for taking bard here is mainly for spell breach, and also for opening up arcane options. I also believe I get 5 AC since I put 30 points tumble. The goal was insane AC against meleers, but I'd like to hold my own vs spellcasters as well if possible.<br/>\n<br/>\n<strong>Your only problem will be the fact that there is not metamagic for Imploders which means you have limited casts.  However, Slay Living and Destruction also save vs. Fort.  Unfortunately, those are Necro spells so will lose out on the focus that Imploder gets.  Maybe you could try balancing out going necro focus and let the Implode extra +3 DC make up for it?  Think about it.</strong><br/>\n<br/>\n This is a great suggestion. It's difficult for me to weigh how much that +3 DC is going to affect my ability at successful death spells. I am considering dropping melee abilities to pick up more necromancy, if that serves better the overall purpose of a more versatile vs all classes PVP cleric. I\"m not experienced enough to make this judgement, looking for you veterans to help me out here.<br/>\n<br/>\n<strong>So design this one for the melee types.  Archer types should be likewise easy targets as well.  After you are happy with this one, then begin working on one to deal with divine clones and high-mage types.  A whole other ball of wax.</strong><br/>\n<br/>\n I guess I don't understand enough of what I\"m lacking here to take on a divine and high mage types here. The reason I took spell pen, and greater spell pen was so I could use wands to spell breach, then use death spells to end them. I don't know how viable this strategy is. Since I didn't know it wuold work I've tried maintaing a strong melee ability to keep myself versatlie. This is a consequence of my lack of knowledge I suppose and wanting to avoid a build that has glaring vulnerabilities. Suggestions?<br/>\n<br/>\n<strong>I don't see greater ruin as being a significant duel-changer. especially if they make their save (I always seemed to roll 1's with epic damage spells, but maybe that's just me).  GR doesn't gain the spell focus boosts either so they will save easier.  Stick to feats that will factor in for more than 1 round per day.  At least that is my advice.</strong><br/>\n<br/>\n I expect my PVP encounters on Arelith to be few and far between. In essence I want to be ready to blow one person away as effectively as possible. I also chose greater ruin because it is boosted on Arelith I think 2x. I didn't realize the DC isn't boosted, which stinks. Which, if any, epic spells would you folks recommend?<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:06 PM - Nov 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you don't want to drop any of your magic-boosting feats, then Improved Critical is the feat to drop for Blind Fight. Improved Critical is nice to have, but Blind Fight is better. It not only improves your chances of hitting concealed enemies, but it also negates some of their advantage over you.<br/>\n<br/>\n If you cross-train Tumble, you get 15 ranks for +3 AC, and if you take Tumble as a class skill, you get 30 ranks for +6 AC, for a net increase of +3 AC over the cross-training version. That's why he said you get 3 AC from Bard.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "AngelsAndDemons",
      "avatar": "no_avatar.png",
      "timestamp": "5:38 PM - Nov 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the feedback, Empyre.\n<blockquote><div>If you don't want to drop any of your magic-boosting feats, then Improved Critical is the feat to drop for Blind Fight. Improved Critical is nice to have, but Blind Fight is better. It not only improves your chances of hitting concealed enemies, but it also negates some of their advantage over you.</div></blockquote>\n I am actually willing to drop magic-boosting feats if it'll round my character out better. Your comment makes perfect sense though. I was considering the same thing, dropping improved critical. Resting in Arileth is really limited, that's why I'm trying to keep the extend though I understand it's a convenience.\n<blockquote><div>If you cross-train Tumble, you get 15 ranks for +3 AC, and if you take Tumble as a class skill, you get 30 ranks for +6 AC, for a net increase of +3 AC over the cross-training version. That's why he said you get 3 AC from Bard.</div></blockquote>\n Ah, I see, makes sense. Thanks for clearing that up for me.<br/>\n<br/>\n Do you have any ideas on how I can 'open up' this build to face a broader range of builds? Have I cornered myself too much, by focusing so heavily on magic focus and spell penetration? Alternatively, should I vest even heavier in magic focus? I don't quite understand why this build is weak against casters, so I'm struggling to figure out how to improve it. I'm very flexible wrt to changing anything, I just wanted to do my homework and create a build I thought would be good, rather than asking other folks to do all the work for me.<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:55 PM - Nov 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's the PvP request itself that is tough for the guild, in general, to deal with.  The builds that you see that are labeled \"PvP\" or \"could-be-used for PvP\" really are not in most cases.  Trust me. I used to PvP a lot at one time and know what of I speak.  It is a different craft entirely.  It's always a pure solo design since feats like Great Cleave and Whirlwind (just as a few obvious examples) have zero benefit beyond qualifying for WM which can be easily countered with any optimized melee PM or Risen Lord build.<br/>\n<br/>\n The difference in a build dedicated to PvP versus one that \"should work\" is a matter of intense focus.  Certain opponents will almost always fail against your build if you chose the right opponent.  That's the way I used to play PvP to great success and to the frustration of those who went hostile.  Or I just logged a toon I knew would directly counter their strengths, essentially neutralizing their build, with equal success.<br/>\n<br/>\n But I understand your dilemma not having the time or patience to level a few similar builds, each optimized to deal the best with certain opposing builds.  Been there myself.  Which is one of the reasons I no longer design PvP builds for myself, because they are just too limiting and time-consuming on my end.  It's very similar to the difference between a PvM build optimized for combat but extremely limited when it comes to interacting well with the environment (merchants, persuasion, ability-checks, etc.). <br/>\n<br/>\n Generally, your greatest threat as an Imploder will be any toons with high Fort saves.  There are more toons wandering around focusing on that aspect, proportionately, than spell resistance types.  SR types would be SR monks and pure clerics and druids.  An SR monk could reach SR in the neighborhood of 46-50-ish depending on feat allocation.  A pure priest will reach SR 42.  The main difference being that the monk SR cannot be breached so much more stable vs. high-mage types.  This is the main reason I urge focusing on DC rather than than penetration because trying to beat SR universally is an uphill battle with only the 3 feats standing between your casting success and failure whereas increasing WIS to uber levels can effectively test the saves (your gifts, ability allocation and empowered Owl's Wis).  CoT, high-CHA Divine Grace/Dark Blessing toons and high CON-EDR types would be the ones with the greatest potential to counter your high DC so those targets would be the ones with the greatest return for investment.  Always figure they will have Epic Fort mixed in there. Those are still dice rolls, whereas the SR checks are static.  If you can't beat SR today, you won't beat it tomorrow either.<br/>\n<br/>\n So, it's up to the strategy you prefer.  Build a well-rounded spell attack that works decent under some conditions or optimize to dominate certain kinds of opponents reliably and suffer those builds that easily counter your strength.  Mages have the added ability to reduce your SR so, in general, will suceed penetrating your spell defenses better than your spells will theirs.  Druid's have Nature's Balance to counter arcane SR but cannot Implode, Slay Living or use Destruction for those instadeath methods you are seeking to employ.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}