{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "021",
  "name": "How do you build a Half Elf Bard/Cleric/AA combo?Post build plz",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/how-do-you-build-a-half-elf-bard-cleric-aa-combo-p-t2354794.html",
  "author": "FairyMaster",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "256",
  "posts": [
    {
      "author": "FairyMaster",
      "avatar": "no_avatar.png",
      "timestamp": "10:27 PM - Dec 12, 2017",
      "content": "<div>That's what I'm trying to do now but...<br/>\nI have to waste a feat to be able to use a longbow...<br/>\nShould I put some points intro str for Comp longbow?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:21 PM - Dec 12, 2017",
      "content": "<div>Hi Fairy Master,<br/>\n<br/>\nWould I be right in thinking you're taking Half-Elf to avoid an xp penalty? If so, and if you're not going heavy on Bard, then switching to Elf and Wizard might be an idea - you'll certainly get proficiency in longbow from the start. It's tough to work out without knowing your current class split.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:28 PM - Dec 13, 2017",
      "content": "<div>Hello Fairy Master,<br/>\nIf you take half-elf, you must take WP Martial to get bow proficiency with the two classes you have chosen. Elves get racial proficiency with bows. <br/>\nYou can avoid the xp penalty with elf, just like Stagmeister says, with either taking equal amounts of Bard and Cleric or by taking Wizard instead of Bard.<br/>\nIt all boils down to what build you want.<br/>\nI usually try to take a moderate amount of strength, up to 14 if I can afford it, to add to damage. You can add to strength later with items or potions when you get higher mighty properties.<br/>\nA high number of AA levels will make your archer better with higher AB and better damage.<br/>\nWhen building an archer with Cleric, I aim at 15 Cleric levels to max out most buffs. If you take 14-16 Bard levels as well to avoid an xp penalty, you get a build that matures late, and you don't get much from only about 10 levels of AA.<br/>\nI have to admit that most things with Cleric 15 or Bard 14-16 will be a strong build, but more AA will make a better archer.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "FairyMaster",
      "avatar": "no_avatar.png",
      "timestamp": "11:51 PM - Dec 13, 2017",
      "content": "<div>Actually,I don't plan to use Bard much<br/>\nLet's say Bard has the same role of Wizard here,few levels.<br/>\nAnd I'm coming for a rp concept here,It's too bad you have to take feat.<br/>\n<br/>\nThanks for replying</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:15 AM - Dec 14, 2017",
      "content": "<div>Well rp and fun trump everything! Now, bearing in mind Mick's advice, would something like a half-elf AA 22/ Bard 3/ Cleric 15 appeal - with 14 STR if it's do-able? I could work on one, but Mick's a lot better (not to mention faster) at these things...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "FairyMaster",
      "avatar": "no_avatar.png",
      "timestamp": "10:59 AM - Dec 14, 2017",
      "content": "<div>Hey Stagmeister.<br/>\nI think 12 str will do,it's for Arelith anyway,<br/>\nLet's see your build first</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:55 PM - Dec 14, 2017",
      "content": "<div>Arelith means max 30 levels and 3 consecutive levels of every new class, if I'm not wrong. All this narrows it down a bit what you can build. <br/>\nIf I recall correctly you can also add gifts at start-up. <br/>\nDo they have normal xp penalties and alignment restrictions?  Have they changed the requirements for qualifying for AA?<br/>\n<br/>\nAs for your roleplaying, how important is being a cleric for this character? Or in other words; what emphasis do you want to put on the class in this build?</div>",
      "author-color": "#AA0000"
    }
  ]
}