{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "711",
  "name": "The Black-Hearted Shapechanger (Monk 6/Sorcerer 32/Blackguard 2)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-black-hearted-shapechanger-monk-6-sorcerer-32--t2355321.html",
  "author": "Ten Pura",
  "avatar": "10759105_1562697297.png",
  "replies": "2",
  "views": "171",
  "posts": [
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "11:08 PM - Jan 28, 2020",
      "content": "<div>Orion posted his <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-planar-kensai-spellsword-sorcerer-27-blackguar-t2355318.html\" rel=\"noreferrer\" target=\"_blank\">Planar Kensai Spellsword</a> and when I saw it, I thought of something crazy. This is it.<br/>\n<br/>\n<br/>\nPlayable: Level 10 - 40.<br/>\nPvM (mostly)<br/>\nLawful Evil alignment<br/>\n<br/>\nA quick search of the database reveals 2 other Sorcerer/Monk/Blackguard builds (weirdly).<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build141904.html\" rel=\"noreferrer\" target=\"_blank\">Defiler of the Silt Sea</a> (Sorcerer 32/Monk 6/Blackguard 2) This build went for ESF: Necromancy, Epic Warding, EMA, Hellball, Greater Ruin, and finishes by picking up Epic Toughness IV, but finishes CON 15, CHA 28 (if I'm counting correctly, the build doesn't state).<br/>\n<a class=\"postlink\" href=\"http://world-of-greyhawk.github.io/builds/data/build275035.html\" rel=\"noreferrer\" target=\"_blank\">Arcane Greatsword</a> (Sorcerer 29/Monk 3/Blackguard 8) This build went for STR.<br/>\n<br/>\nIn the level 40 characters, we have 1 build:<br/>\nMick Dagger's (excellently built) <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/evil-speed-caster-sorc-35-monk-3-bg-2-t2319013.html\" rel=\"noreferrer\" target=\"_blank\">Evil Speed Caster</a> Mick took the build to CHA 38 and stacked ESF: Necromancy on it for a monster Wail DC.<br/>\n<br/>\nGeneral Idea:<br/>\nBuff then Polymorph. The usual suspects should work well here:<br/>\nImproved Invisibility<br/>\nMage Armor<br/>\nMestil's Acid Sheath<br/>\nShadow Shield<br/>\nHaste<br/>\n<br/>\nStrengths:<br/>\nUndispellable spell casting<br/>\nGood caster levels<br/>\nFortitude/Will saves, especially against spells<br/>\nNice skill selection for a non-Wizard/Rogue<br/>\nEpic Damage Resistance III<br/>\n4 Sorcerer Epic Bonus Feats (I put Great Charisma III and Epic Spell: Epic Warding, but you could put something else)<br/>\nMost of shifter power, but with arcane damage shields<br/>\nLevel 40 power<br/>\n<br/>\nWeaknesses:<br/>\nLevel 1 - 9 (these would be horrible to play)<br/>\nMordenkainen's Disjunction<br/>\n<span style=\"text-decoration:line-through\">Sneakers, but especially HiPS'ers</span> Shapechange - Red Dragon (Immune to Crits/True Seeing) should fix this.<br/>\nGDL's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/mestil-s-half-dead-juggernaut-wizard-26-pale-maste-t2355300.html\" rel=\"noreferrer\" target=\"_blank\">Mestil's Half-Dead Juggernaut</a><br/>\nSorcerer known spells limit<br/>\nVery late bloomer<br/>\nTraps<br/>\n<br/>\nKey Features:<br/>\nPolymorph plus damage shields plus Monk bonuses<br/>\nBlind Fight - helps mitigate against sneakers<br/>\nBrew Potion - indispensable to polymorph and Shifter builds alike!<br/>\n4 different metamagic feats for adjusting spell slots on the fly<br/>\nPhysical stats (STR, DEX) kept intentionally low due to Polymorph effects<br/>\n<details><summary>Spoiler</summary>Monk(6), Sorcerer(32), Blackguard(2), Human\nSTR: 8\nCON: 16 (26)\nINT: 12\n\n01: Monk(1): Toughness, Blind Fight, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}\n03: Sorcerer(2): Still Spell\n05: Sorcerer(4)\n07: Monk(2): {Deflect Arrows}\n09: Sorcerer(7): Brew Potion\n11: Monk(3)\n13: Sorcerer(9)\n15: Sorcerer(11): Empower Spell\n17: Monk(4)\n19: Sorcerer(14)\n21: Sorcerer(16): Great Constitution I, (CON=20)\n23: Sorcerer(17)\n25: Sorcerer(19)\n27: Sorcerer(21): Epic Damage Reduction I\n29: Sorcerer(23): Great Charisma I, (CHA=20)\n31: Sorcerer(25)\n33: Sorcerer(27): Epic Damage Reduction III\n35: Sorcerer(29): Great Charisma II, (CHA=21)\n37: Sorcerer(31)\n39: Sorcerer(32): Epic Prowess, Great Charisma III, (CHA=22)\n\nSkillpoints: 190\nSaving Throw bonuses: Spells: +8, Mind Effects: +2\nAB (max, naked): 21 (melee), 21 (ranged)\nSpell Casting: Sorcerer(9)\n\n\n02: Concentration(1), Heal(1), Lore(1), Save(3), \n04: Concentration(1), Lore(1), Save(2), \n06: Concentration(1), Lore(1), Save(6), \n08: Concentration(1), Save(7), \n10: Concentration(1), Save(13), \n12: Concentration(1), Discipline(1), Taunt(15), Save(1), \n14: Concentration(1), Spellcraft(3), \n16: Concentration(1), Spellcraft(3), \n18: Concentration(1), Spellcraft(3), \n20: Concentration(1), Spellcraft(1), Save(4), \n22: Concentration(1), Discipline(5), Save(6), \n24: Concentration(1), Spellcraft(1), Save(9), \n26: Concentration(1), Spellcraft(1), Save(13), \n28: Concentration(1), Spellcraft(1), Save(17), \n30: Concentration(1), Spellcraft(1), Save(21), \n32: Concentration(1), Spellcraft(1), Save(25), \n34: Concentration(1), Spellcraft(1), Save(29), \n36: Concentration(1), Spellcraft(1), Save(33), \n38: Concentration(1), Discipline(12), Taunt(26), \n40: Concentration(1), Discipline(6), \n</details>\n\nEDIT:<br/>\nChanged the feat schedule to get Epic Damage Reduction I - III and Epic Spell: Epic Warding earlier (thanks for spotting it, Orion). Dropped Epic Energy Resistance: Electrical for Epic Prowess for +1 AB.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:28 PM - Jan 29, 2020",
      "content": "<div>I like your build, its nicer than the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-golemic-overlord-monk-6-sorcerer-24-blackguard-t2355311.html\" rel=\"noreferrer\" target=\"_blank\">golemic overlord draft I wrote</a>, I didn't put enough HP in it in retrospect and tried too hard to be a DC caster<br/>\n<br/>\nI get the feeling you may not even have to polymorph into the various shape change forms with the amount of HP, just stand and blast, if you know what I mean. You got evasion, you got great spell casting, you got EDR III, you got epic warding.<br/>\n<br/>\nIn terms of the polymorphs, there are good and bad things about them. <br/>\n<br/>\nFirstly the good things. Sorcerer has great damage shields which can be extended, and ways to mitigate damage such as premonition, empowered endurance etc. This is fantastic. The golem polymorph has great HP, crit immune, sneak immune, mind immune and has damage reduction 30/+3, probably one of the best defensive polymorphs. Just don't bring it near an electrical damage caster.<br/>\n<br/>\nThis is on the flip side, compounded by the polymorphs having terrible AB. Sorcerer is additionally being a 1/2 BAB class, and being unable to have any AB boosts apart from spells and epic prowess. I tried to boost the AB in Golem form in game testing with the Golemic Overlord draft with BAB 26, empowered bulls str etc etc, and the best buffed AB I could create was 42 which is utterly abysmal and led to me abandoning the sorcerer / polymorph idea and creating my sorcerer / palemaster build draft. <br/>\n<br/>\nDruids and shifters at least can have some of their item bonuses transfer when polymorphed. The Shapechange and Polymorph Self spells do not allow any equipped item bonus transfers at all.<br/>\n<br/>\nI also like how you put discipline in the build, it is worth it for sure for any polymorph build, but especially for this one as there is no other source of knockdown immunity when polymorphed, unlike druids and shifters.<br/>\n<br/>\nAnyway some tweaks I would suggest in your draft, I would personally look to aim for Cha 20 and put the rest into other stats like Str (for carrying capacity - I noted you took still rather than silent spell, I take it you may have plans to equip armor/shield...), constitution (for health). The Wis 14 is good when shifted, but it might be worth swapping 2AC and 2 will for intelligence 16 and 86 skill points.<br/>\n<br/>\nYunim gave me feedback previously about Tumble 15 modified and avoiding attacks of opportunity and I agree completely with this advice, try to fit this into your build.<br/>\n<br/>\nSome detection skills are valuable to use against stealthers and here I would suggest putting some points into listen. Taunt could be dropped for this if you need to.<br/>\n<br/>\nA few points in search are good to pick up traps unless Find Traps is not nerfed. <br/>\n<br/>\nYou could start to get EDR I-III feats as soon as you hit Con 21, and I would encourage this. With your current build arrangement you are eligible at level 27 but you start taking EDR at 30, so I would prioritise this over further stat gains until EDR III is obtained.<br/>\n<br/>\nSome of the bonus sorc feats could be put into Auto-Still I-III depending on your environment and if you want to equip full plate/tower with your blackguard heavy  armor/shield proficiencies.</div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "9:03 PM - Jan 29, 2020",
      "content": "<div>Dropping starting CON to 15 would let someone pick up Tumble and detection skills, but negating attacks of opportunity in a shield build is probably not desirable. <br/>\n<br/>\nPutting STR into the build won't increase the AB. The polymorph effect over-writes the base strength, but keeps the Bull's Strength buffs.<br/>\n<br/>\nStacked Bull's Strength plus Tenser's gave me a +49 AB. With Haste, I think I got 6 attacks per round, which is quite decent for a build that uses melee damage as its secondary damage output (primary is damage shields, tertiary is offensive spells). Taunt works while Polymorphed, bumping my effective AB by possibly another 6.<br/>\n<br/>\nI agree that Automatic Still Spell is definitely competitive with Great Charisma III, but it's one of several options I would recommend for the Sorcerer bonus feats. Also, I should bump up both Epic Damage Reduction and Epic Spell: Epic Warding to earlier in the feat schedule; that was a sloppy oversight on my part.<br/>\n<br/>\nAlternatives for the Sorcerer bonus feats (except Epic Spell: Epic Warding):<br/>\nGreat Charisma I - III<br/>\nEpic Energy Resistance I - III (Acid and Electrical both are appealing for this option)<br/>\nAutomatic Still Spell I - III<br/>\nAutomatic Silent Spell I - III (this would require swapping Still Spell for Silent Spell at level 3)<br/>\n<br/>\nMost other options would be inferior to one of the above in most environments. It would be a rare day indeed where Automatic Quicken Spell was highly useful on a caster that will likely be self-buffed with Haste.<br/>\n<br/>\nEDIT:<br/>\nAlternative suggestions no longer made sense with the updated feat schedule. Now corrected.</div>"
    }
  ]
}