{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "260",
  "name": "Dwarven Party of Five/six",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/dwarven-party-of-five-six-t2336816.html",
  "author": "10235461",
  "avatar": "no_avatar.png",
  "replies": 3,
  "posts": [
    {
      "author": "10235461",
      "avatar": "no_avatar.png",
      "timestamp": "3:01 AM - Jun 29, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Greetings folks. <br/>\n<br/>\nBeen talking to some folks and we are toying around with an idea to play a party of Dwarves on the Arelith Server (Max level 30). Our premiss is a wandering group of mercenaries fighting for coin. We enjoy the cooperative nature of our playing styles and I have been tasked to come up with a balanced party that will be good for PvM as well as PvP. <br/>\n<br/>\nThe last time I did this with another group, we built the Dwarves so each were dependent on the other. After a while, two of the folks got bored and started playing other concepts that left the rest of us with characters that were very close to unplayable. So my goal is to have PC's that are compliment each other, yet are not so dependent where if this whole experiment falls apart, the ones that wish to keep playing thier dwarves can do so without too much headache. <br/>\n<br/>\nSo, still in the concept phase - Military group, most will be in full armor, traditional dwarven play. The Barbarian path was kicked around a bit as well, so that is still on the table. Will be sporting hammers or axes and crossbows. I am thinking one scout, a few tanks and a cleric. But I was hoping to throw it out here and see if there are some good builds for dwarves that would be fun to play. <br/>\n<br/>\nThanks in Advance. <br/>\nDSC<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:45 AM - Jun 29, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Make one of them a <a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build301814.html\" rel=\"noreferrer\" target=\"_blank\">Melee Mage</a>. A Cleric is a good idea for another one of them. One should be a Rogue. It would seem wrong to have a party of Dwarves without a Dwarven Defender. How about a Weapon Master to finish the party?<br/>\n<br/>\nI'll wait for feedback from you and others before I build anything.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:35 PM - Jun 29, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There are too many of them, Darksar. The problem is that it depends of how far you're willing to go with the diversity of the party. Most in full armor, you say, but are you considering the option of a DEX toon? I ask this because the build concepts you outlined are a bit vague. I think you should have two casters, one arcane and one divine, a tank, a warrior type and a rogue type toon.<br/>\n<br/>\nArcane Caster - Dwarven Wizard 23 / Fighter 4 / Rogue 3<br/>\n<br/>\nDivine Caster - Cleric 24 / Monk 3 / Rogue 3 <br/>\n<br/>\nTank - Fighter 8 / Dwarven Defender 18 / Rogue 4 <br/>\n<br/>\nMelee Warrior - Ranger 23/ Weapon Master 7 (for Bane of Enemies and Critical enhancements, either dual-wielding kukris or handaxes, STR-based) This one will be the damage dealer, but it not very playable on its own. It's a very offensive build.<br/>\n<br/>\nMelee Warrior 2 - If you want something more playable, a Fighter 8 / Weapon Master 19 / Rogue 3 could be your way to go.<br/>\n<br/>\nRogue-ish toon - A Fighter 12 / Dwarven Defender 5 / Rogue 13 such as my Underdark Expeditioner adapted to level 30 with only 5 levels of DD for SA immunity could do the trick. Or Fighter 6 / Dwarven Defender 5 / Rogue 19 for more Rogue skills.<br/>\n<br/>\nThis outline could be a very strong party, but they aren't all full-plated juggernauts the way you imagined. <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "10235461",
      "avatar": "no_avatar.png",
      "timestamp": "3:14 PM - Jun 29, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">First off, Thank you gentlemen for your quick replies. <br/>\n<br/>\nYes, it was vague, and I apologize for that, but unfortunately, our concept is vague right now as we don't know what we want to do. After talking with the folks, I think we have a solid idea on what is needed. I will place the builds on the build help forum once I have them all fleshed out. Our first concept is:<br/>\n<br/>\nCleric 30: Caster cleric mainly, thinking of having a high SR penetration to overcome some of the PvP we will encounter. <br/>\nFtr8/DD18/Rog4: For the Damage reduction (21? I think) and our main tank<br/>\nFtr8/WM19/Rog3: Another traditional build and a damage dealer<br/>\nRog24/Ftr6: There are some traps/locks in Arelith that will need this kind of 'attention'<br/>\nFtr4/Cleric26: Melee based cleric. <br/>\n<br/>\nSurprisingly, no one wanted to play a Mage. I did like the idea of the Melee mage but since I am playing the caster cleric, I thought the party may need healing moreso than haste. I wasn't able to contact one of the folks last night, so I am thinking he may want to play a mage-type PC. If so, I will have to see if he wants me to build his PC. <br/>\n<br/>\nThanks again, I will post these builds in the 'whadda ye tink o' me builds' section and go from there. <br/>\n<br/>\nDSC<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}