{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "090",
  "name": "Cleric/ Wizard Mash-ups",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/cleric-wizard-mash-ups-t2355691.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "7",
  "views": "576",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:56 PM - Mar 20, 2021",
      "content": "<div>Hi All.<br/>\n<br/>\nBefore embarking on my second Wiz build, I wanted to canvass the Guild on the potential or otherwise of a Wizard/ Cleric construction. More particularly, how gimped a build might end up being with access to level 9 spells in both arcane and divine magic?<br/>\n<br/>\nThe immediately obvious problem is the spell DC in both areas, as well as neither being undispellable - as you need at least 17 Cleric levels and 17 Wizard ones, which means neither can reach level 25.<br/>\n<br/>\nThen there's the problem of having to boost 2 stats - INT and WIS - to at least respectable levels, and that probably means taking the spell penetration line, thus reducing the number of feats that would ordinarily be available for other useful things, unless you only cast no-save spells.<br/>\n<br/>\nEven should such a build be worth pursuing, there's then the issue of which class to concentrate on first. My temptation is to initially focus on Cleric (let's assume I have no interest in melee, so the AB and AC doesn't factor here) and take all the Wizard bonus feats in epic levels, but that might be hopelessly naive.<br/>\n<br/>\nFinally (though you good folk may well have other issues), there's the question about whether to take a 3rd class, and if so, what?<br/>\n<br/>\nOn the positive side, you'd have an enormous quantity of spells at your disposal, and your Will save should really shine.<br/>\n<br/>\nLadies and gentlemen, the floor is yours...<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "3:55 PM - Mar 20, 2021",
      "content": "<div>My initial thought is that you don't want to max out spells from both classes. <br/>\nThen comes the question if this is meant to be a pure caster or a spellsword of some kind.<br/>\nTwo full spell books give a lot of possible combinations. But the spell penetration becomes weak, just like you said. <br/>\nIf this is a spellsword,  cleric offers the best combat buffs, but apart from that wizards have more powerful spells.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:23 PM - Mar 20, 2021",
      "content": "<div>I'm looking at a pure caster - I might start mucking around with hybrids when I'm more accustomed to doing the spelly thing.<br/>\n<br/>\nI was trying to keep this pretty general (hence my posting in this forum), but here's my quandary: in an ideal world I'd like an Evoker with access to Implosion, so he can both ex- and im- plode things (as it were). Concepts can be such an arse sometimes - particularly as this one's also supposed to be an archmage! I suspect that I'm trying to squeeze too much in for him to be very effective in either area, but thought I'd do well to check with the Guild before I go wasting silly amounts of time here.<br/>\n<br/>\nAny further thoughts are, of course, welcome!<br/>\n<br/>\nCheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Max's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/aerie-the-wingless-avariel-cleric-19-illusionist-1-t2354380.html\" rel=\"noreferrer\" target=\"_blank\">Aerie the Faerie</a> build (particularly his upgrade last September) is probably closest to the sort of thing I'm thinking of, although this guy's supposed to be an aged, thickset, bald man, rather than a flimsy, female, flightless Avariel. So Dwarf might be an option here for more CON and less DEX. However, I'm not bothered about Zen Archery, so if going Human I'd get - effectively - 2 extra feats, so could cover Silent and Maximize (and more skills, obvs).</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "kfor85",
      "avatar": "10759362_1598639921.jpg",
      "timestamp": "9:13 PM - Mar 20, 2021",
      "content": "<div>Hey Stag! <br/>\n<br/>\nMax's Aerie was the first build that came to mind before I read your last edit as it got ESF: Evocation and all the goodies for an archmage archetype.<br/>\n<br/>\nHaving played that build solo mostly 1-40 on WoG I'd say you could of course go for dwarf/human but I'd advise you to keep Zen Archery, it's much more useful to the build in comparison to Maximize IMO as in places that have enemies with higher SR than the Toolset Standard 32 you're gonna have issues (a pretty embarassing situation for any archmage to be in) and with Extend, Silent and Empower you'll have more than enough spellbook management already.<br/>\n<br/>\nCheers!<br/>\n<br/>\nPS: Also from observations from that playthrough, I thought about something like Wiz 21/CL 18/Monk 1 to get Epic Warding, then you get a super strong Golem form from Shapechange buffed with damage shields and clerical goodies, maybe that would fit the bald sturdy aged guy thing a bit more as a fighting form in your toolkit</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:24 PM - Mar 22, 2021",
      "content": "<div>The only thing that one will have to take into consideration when doing Shapechange is that any bonuses to Int/Wis and therefore spellslots is going to suffer, accordingly.<br/>\n<br/>\nFor a Wiz/Cl, this can mean a loss of a lot of spellslots, especially with +12 Int and/or Wis.  Not to mention any items that give bonus spellslots.<br/>\n<br/>\nVery annoying imo.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:41 PM - Mar 22, 2021",
      "content": "<div>I'm sure you're right, Web. Being selfish, in my particular case I have no desire whatsoever to undergo shapechange with such a build. He does not sully his hands with mundanities such as physical combat, thank you very much.<br/>\n<br/>\nStill, good to know the info!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "kfor85",
      "avatar": "10759362_1598639921.jpg",
      "timestamp": "9:27 PM - Mar 22, 2021",
      "content": "<div>I agree with what Web said and for the record I didn't do that change to acquire Epic Warding when leveling (I used the Golem Form+Damage Shields on some foes though), it was just a thought of a last resort tool for when everything else fails (although one can still potentially disable/deal damage with SR ignoring spells from both sides: WoF, Evards etc) which didn't happen to me mainly due to the presence of Zen Archery. <br/>\nStag, I wouldn't consider the Golem form+shields strategy as getting my hands dirty when not using the cleric buffs as I just stand there and they suicide so most likely something more of a wizard gimmick :)<br/>\n<br/>\nCheers!</div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "11:58 AM - Mar 23, 2021",
      "content": "<div>Hey Stag! <br/>\n<br/>\nWhile most has been said already, I do think Aerie is an AMAZING template for you to base yourself upon. With such high WIS, it's really a shame not to have Zen Archery. It's just one feat for another whole combat style as an option. You can stand behind summoned creatures firing arrows or spells depending on what enemies you face. But she does struggle with SR, which is precisely why having Archery as something to fall back on is a nice alternative. <br/>\n<br/>\nYou can also read my Magical Master, or the Speedy Sniper. All of them use Wizard/Cleric in very different ways. </div>",
      "author-color": "#00AA00"
    }
  ],
  "author-color": "#AA0000"
}