{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "774",
  "name": "The Wizard-Rogue synergy build avice",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-wizard-rogue-synergy-build-avice-t2355228.html",
  "author": "calespurmarksman",
  "avatar": "10758934_1530764018.jpg",
  "replies": "6",
  "views": "4.4K",
  "posts": [
    {
      "author": "calespurmarksman",
      "avatar": "10758934_1530764018.jpg",
      "timestamp": "10:18 PM - Nov 08, 2019",
      "content": "<div>Hey, guys!<br/>\n<br/>\nI have been reading the forum for quite some time now, and, although a relatively new member, I have gleaned a lot of knowledge from you, Great ECBers. Knowledge spanning building, play-styles, exploits, strategies and much-much more, that the Wikia simply doesn't have the capacity to provide for. So, first of, thank you! <br/>\n<br/>\nNow, to the topic at hand, I always marvel at the different class synergies, explored on the forums (for ex. the Black Arrow build, synergizing Blackguards Divine Might damage bonus with Bard's spellcasting prowess). And I wanted to try some kind of synergy in one of my builds. <br/>\n<br/>\nNow, one of the less obvious synergies (but non the less explored quite vastly by Hipmaestro and others) is the Wiz-Rogue Int synergy. Int is the casting stat for Wizard, and simultaneously grants skill points, where Rogue is the class with the most class skills. So the idea of a Wizard Spy Master was born. <br/>\n<br/>\nOf course, I wasn't the first, and I don't claim to be =) Furthermore, I've scoured the forums for build ideas for quite some time, and found a number of them (sorry, I'm a bit lazy to give links), like Whisky Addled Old Spellster (Wiz 35/Rogue 4/SD 1), which is a very nice build. Another build with a different synergy that I also found is the Wiz/Monk/SD combination (sorry, don't recall the name of that one). But what I didn't find was both synergies synced into one build - Wiz/Monk/Rogue. So that's what I tried to come up with - and would really value your advice on the result I have at hand. <br/>\n<br/>\nJust a couple of notes before the build lay-out: I know that a lot of ECBers prefer to go for end-level power, but since I don't play on PWs, the life-time playability is more important for me than lvl40 perks. That's why the lvl spread may seem suboptimal from a lvl40 power builder perspective, but pls remember I tried to make this guy as smooth-sailing as possible - meaning gradual growth without huge bumps along the road. And yes, as you guessed, I had PvM in mind when building, but would love to hear your thoughts on this guy in PvP environments. <br/>\n<br/>\nFor the build itself: my goal was to exploit the synergy between Wizard's main casting stat and trapping skills - hence the choice of Rogue as a third class to be able to handle epic traps. This guy has the ability to disarm, recover and set them. In addition, he has enough skill points to craft deadly traps (epic traps are not craftable) at a dice throw of 1 (using empowered Fox's cunning). In addition, he exploits the Monk speed cheese + Expeditious Retreat + Mass Haste to move faster than a bullet and avoid most melee encounters, simultaneously leading his opponents into trapped areas. When he does get caught up in melee for some reason - he can buff AC up to 66 with +5 items available and capped ability scores (or, switching out Greater Ruin for Mage Armor - without items and capped ability scores), or, if he so desires, he can keep his AC on the low side, and instead employ Epic Warding + Damage Shields + enemy Attacks of Opportunity on casting (defensive casting off) to wear down any mob trying to harm him. Spellcasting-wise, he has dual spec in Evocation and Necromancy for maximum effectiveness, and a final Int score of 36 (just 2 points below the max watermark). 33 levels is kind of on the low side for a pure caster, but I sacrificed 2 caster levels for 2 Rogue levels for better life-time playability rather than go for lvl40 max power (see note above). <br/>\nHis weaknesses are the saves, which suck, but are somewhat compensated by the +11 bonus from Spellcraft, and the lowish HP - only 260, so he can withstand 1 maxed IGMS, but that's about it, though these can be bumped up to 300 with empowered Endurance.    <br/>\n<br/>\nFinal note: This build has Aielund in mind, which takes the player to lvl 37, not 40, so the Rogue skill dump is at 37 rather than 40, but that is easily adusted for without changing the build, if disired. That is also the reason for a Heal skill dump in lvls 38-40, because there is basically nowhere else to put those leftovers (You could put them in Lore, but a lvl 33 Wizard's Identify spell grants him +43 to the skill, and adding in the +13 Int modifier you get 56 - which according to the Wikia allows you to identify ANY item in the game, as the max DC is 55). However, if the Rogue level is taken at 40 instead you can have a lot of versatility with available skills. In addition, the module uses EMS rules for spells (as you know, as I've read discussions on this), so that's the reason for Greater Ruin - by EMS rules you get Epic Mage Armor as a substitute for Mage Armor spell once you reach the prerequisites, as far as I could understand the notes I've found online. <br/>\n<br/>\nI haven't play-tested him yet, but I plan to soon, and I would really value your experienced comments and suggestions on the build - particularly at it's my first one posted here. <br/>\n<br/>\nWithout further ado - here goes. <br/>\n<br/>\nThe Wizard Spy Master - aka. The Phantom. <br/>\nWizard(33), Monk(3), Rogue(4), <br/>\nHuman, Lawfull Good<br/>\n<br/>\nSTR: 8<br/>\nDEX: 14<br/>\nCON: 14<br/>\nWIS: 10<br/>\nINT: 18 (36)<br/>\nCHA: 8<br/>\n<br/>\nHuman: (Quick to Master)<br/>\n01: Wizard(1): Silent Spell, Expertise, {Scribe Scroll}<br/>\n02: Monk(1): {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}<br/>\n03: Wizard(2): Extend Spell<br/>\n04: Wizard(3): INT+1, (INT=19)<br/>\n05: Wizard(4)<br/>\n06: Wizard(5): Craft Wand, Spell Focus: Evocation<br/>\n07: Wizard(6)<br/>\n08: Rogue(1): INT+1, (INT=20)<br/>\n09: Wizard(7): Empower Spell<br/>\n10: Wizard(8)<br/>\n11: Wizard(9)<br/>\n12: Monk(2): INT+1, Maximize Spell, {Deflect Arrows}, (INT=21)<br/>\n13: Wizard(10): Spell Focus: Necromancy<br/>\n14: Wizard(11)<br/>\n15: Wizard(12): Greater Spell Focus: Evocation<br/>\n16: Wizard(13): INT+1, (INT=22)<br/>\n17: Rogue(2)<br/>\n18: Monk(3): Improved Expertise<br/>\n19: Wizard(14)<br/>\n20: Wizard(15): INT+1, Greater Spell Focus: Necromancy, (INT=23)<br/>\n21: Wizard(16): Great Intelligence I, (INT=24)<br/>\n22: Wizard(17)<br/>\n23: Wizard(18)<br/>\n24: Wizard(19): INT+1, Great Intelligence II, (INT=26)<br/>\n25: Wizard(20): Great Intelligence III, (INT=27)<br/>\n26: Wizard(21)<br/>\n27: Wizard(22): Great Intelligence IV, (INT=28)<br/>\n28: Rogue(3): INT+1, {Uncanny Dodge I}, (INT=29)<br/>\n29: Wizard(23): Great Intelligence V, (INT=30)<br/>\n30: Wizard(24): Great Intelligence VI, (INT=31)<br/>\n31: Wizard(25)<br/>\n32: Wizard(26): INT+1, Great Intelligence VII, (INT=33)<br/>\n33: Wizard(27): Epic Spell: Epic Warding<br/>\n34: Wizard(28)<br/>\n35: Wizard(29): Epic Spell Focus: Evocation<br/>\n36: Wizard(30): INT+1, Epic Spell Focus: Necromancy, (INT=34)<br/>\n37: Rogue(4)<br/>\n38: Wizard(31)<br/>\n39: Wizard(32): Great Intelligence VIII, Epic Spell: Greater Ruin, (INT=35)<br/>\n40: Wizard(33): INT+1, (INT=36)<br/>\n<br/>\nHitpoints: 260<br/>\nSkillpoints: 463<br/>\nSaving Throws (Fortitude/Will/Reflex): 20/22/23<br/>\nSaving Throw bonuses: Spells: +11, Mind Effects: +2<br/>\nBAB: 20<br/>\nAB (max, naked): 19 (melee), 22 (ranged)<br/>\nAC (naked/mundane armor/shield only): 20/23<br/>\nSpell Casting: Wizard(9)<br/>\nAlignment Changes: 0<br/>\n<br/>\nConcentration 43(45), Craft Trap 17(30), Disable Trap 40(55), Heal 41(41), Hide 40(42), Listen 40(40), Move Silently 40(42), Search 40(53), Set Trap 40(44), Spellcraft 42(55), Tumble 40(42), UMD 40(39)<br/>\n<br/>\n01: Concentration(4), Spellcraft(4), Save(20), <br/>\n02: Concentration(1), Hide(5), Move Silently(5), Tumble(5), Save(13), <br/>\n03: Concentration(1), Spellcraft(2), Save(17), <br/>\n04: Concentration(1), Save(23), <br/>\n05: Concentration(1), Save(29), <br/>\n06: Concentration(1), Save(35), <br/>\n07: Concentration(1), Save(41), <br/>\n08: Craft Trap(11), Disable Trap(10), Hide(1), Move Silently(1), Search(11), Set Trap(5), Tumble(5), UMD(11), <br/>\n09: Concentration(2), Craft Trap(1), Spellcraft(4), Save(1), <br/>\n10: Concentration(1), Save(8), <br/>\n11: Concentration(1), Save(15), <br/>\n12: Concentration(1), Craft Trap(1), Hide(9), Move Silently(9), Tumble(5), <br/>\n13: Concentration(1), Craft Trap(2), Spellcraft(5), <br/>\n14: Concentration(1), Save(7), <br/>\n15: Concentration(1), Save(14), <br/>\n16: Concentration(1), Spellcraft(4), Save(18), <br/>\n17: Disable Trap(10), Hide(2), Move Silently(2), Search(9), Set Trap(5), Tumble(5), <br/>\n18: Concentration(2), Craft Trap(2), Hide(2), Move Silently(2), Save(3), <br/>\n19: Concentration(1), Save(11), <br/>\n20: Concentration(1), Save(19), <br/>\n21: Concentration(1), Spellcraft(4), Save(23), <br/>\n22: Concentration(1), Save(32), <br/>\n23: Concentration(1), Save(41), <br/>\n24: Concentration(1), Spellcraft(4), Save(46), <br/>\n25: Concentration(1), Save(56), <br/>\n26: Concentration(1), Save(66), <br/>\n27: Concentration(1), Save(76), <br/>\n28: Disable Trap(10), Hide(12), Listen(19), Move Silently(12), Search(11), Tumble(10), UMD(20), <br/>\n29: Concentration(2), Spellcraft(3), Save(7), <br/>\n30: Concentration(1), Save(19), <br/>\n31: Concentration(1), Save(31), <br/>\n32: Concentration(1), Spellcraft(4), Save(40), <br/>\n33: Concentration(1), Save(53), <br/>\n34: Concentration(1), Save(66), <br/>\n35: Concentration(1), Save(79), <br/>\n36: Concentration(1), Spellcraft(4), Save(89), <br/>\n37: Disable Trap(10), Heal(3), Hide(9), Listen(21), Move Silently(9), Search(9), Set Trap(30), Tumble(10), UMD(9), <br/>\n38: Concentration(2), Heal(10), Spellcraft(3), <br/>\n39: Concentration(1), Heal(13), Spellcraft(1), <br/>\n40: Concentration(1), Heal(15)<br/>\n<br/>\nThank you all in advance for your input! And let the thrashing begin =)<br/>\n<br/>\nP.S. Please let me know if I forgot to include some crucial information for the build - it was not intentional, and if you let me know what I've missed, I'll try to be expeditious about updating =) Thanks!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:32 PM - Nov 08, 2019",
      "content": "<div>Hi Marksman - long time no see! Hope all goes well with you.<br/>\n<br/>\nI am in no way qualified to comment on a Wizard build, but here's a potential thought for you. Gnome or Elf would also work here without an xp penalty (and I'd be really tempted by a gnome - if that didn't come out too badly, particularly if you didn't object to the Illusion school). In module play such as Aielund Craft Wand isn't going to be of great use (yes, I know it is in WoG, alright!), so losing a feat wouldn't be too hard, and nor would Heal be a huge loss in the skills.<br/>\n<br/>\nJust the cogs turning in my head - feel free to ignore...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:28 AM - Nov 09, 2019",
      "content": "<div>Hello calespurmarksman!<br/>\n<br/>\nThis looks like a nice wizard speed caster with rogue skills for Aielund<br/>\n<br/>\nI agree with Stag about craft wand in Aielund - in WoG craft wand is very desirable due to the resting restrictions, and the fact that things respawn meaning gold and exp can be recouped without difficulty, not sure it is super useful in Aielund?<br/>\n<br/>\nI also agree with Stag Gnome or Elf could be considered. <br/>\n<br/>\nGnome makes one more stealthy and provides some extra HP and AC. Overall it is probably stronger than human but from an RP perspective may not quite suite what you want or expected. Elf adds some AC at the cost of HP but grants the delightful Keen Senses feat , which with a high Search and Listen score is an excellent synergy whilst being able to move faster than a DM. <br/>\n<br/>\nOf the two I like Elf better but thats just me.<br/>\n<br/>\nI have some minor further tweaks they are from a personal preference perspective, overall it looks quite playable<br/>\nAlso like Stag I am but learning the Arcane Arts<br/>\n<details><summary>Spoiler</summary>Starting Stats - assuming you stay human, Dex to 12, Cons to 16, Wis to 8 would add 40hp, allowing you to reach the nice 300hp target for a non-combat build set by Kail and Hip\nPre-epic feats - Craft wand, silent spell, expertise and improved expertise I would change for spell foci / greater spell foci in one or two schools, resist energy, saves (ie luck of heroes/great fortitude) or toughness. I think one can cast spells with improved expertise up but one should have summons or party members to tank for you\nEpic feats - in terms of playability I would take the epic spell foci earlier. I would swap epic spell: ruin for something else. Epic Mage Armor is a pretty good choice. Epic Skill  Foci are also not bad. Same with epic energy resistance feats or a further epic spell focus\nSkills - One could drop Spellcraft to 34 and invest in other things such as appraise, persuade etc. I seem to recall money can be a limiting factor in Aielund. Heal one could drop to maybe 14-15 as well. Lore is a handy skill as well, reduces reliance on shopkeepers etc, maybe 10-20 points might be good.\n</details></div>"
    },
    {
      "author": "calespurmarksman",
      "avatar": "10758934_1530764018.jpg",
      "timestamp": "1:28 PM - Nov 09, 2019",
      "content": "<div>Hi, Stag, Orion! <br/>\n<br/>\nI haven't posted anything in a while, but I'm keeping up with the forums and the latest posts non the less, so I see you even if you don't see me :) But great to talk once again!<br/>\n<br/>\nThank you very much for your advice! I also considered gnome / elf instead of human. Gnome would work great for the Phantom / Ghost / Poltergeist concept (think Peeves / Casper etc), but there are a couple of things that stopped me: one is a bit different RP concept, the other is a focus in illusion, with enchantment prohibited. The enchantment school has Mass Haste, which is much needed for the Monk speed cheese.<br/>\nElf on the other hand is a great idea, and your point on Keen senses synergy is well taken - I will need to explore this further. <br/>\nFor the stats and expertise feats: I always prefer AC to HP - standing in the middle of a mob with noone being able to hit you is priceless :) In addition, summons dilute the xp pool, which may not be a big problem in PWs like WoG, for ex., but it significantly decreases the final attained lvl in a module. Hence my choice of expertise feats.<br/>\n<br/>\nCraft wand is not \"essential\" for Aielund, I guess, though there are also some resting restrictions in there. But on the other hand having 50 casts of ILMS in your backpack is kind a cool. You can't usually buy those from merchants, so this feat significantly increases your casts per day.<br/>\n<br/>\nSilent spell is there for spellbook versatility - being able to cast, for ex, IGMS at lvl 7, where there are no direct damage spells, is a very good option, which I didn't realise was needed untill I played a Wizard and was trying to pack my spellbook. But the idea to include luck of heroes / great fortitude for increased saves is really cool, thanks for that!<br/>\n<br/>\nEpic Skill Focuses were also on my list of desired feats, but I fliped them for Great Int and Epic Spells. <br/>\n<br/>\nRegarding Epic Spell Focuses, I used to have them earlier, but I switched them during building, because it provides a smoother skill schedule (giving more skill points earlier in the career for a smoother skill growth). Epic spell focuses give +2 to DCs, which is nice, bit imho is not overly essential in early to mid epic - but I may be mistaken, so will be happy if someone can confirm/disprove my logic. <br/>\n<br/>\nI'll try to look into updating with Elf next week, possibly with feat reshufflings. Thanks again, guys!!!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:19 PM - Nov 09, 2019",
      "content": "<div>Just for information's sake, here's Max's Wiz/Rog. It's a reworking of an NPC from the OC, and takes 2 levels of Fighter and 3 of Rogue. Oh, and it's a gnome, just to be contrary. Interesting, though.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/boddyknock-glinckle-wizard-35-fighter-2-rogue-3-t2269098.html\" rel=\"noreferrer\" target=\"_blank\">Bodyknock Grinkle</a></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "2:42 PM - Nov 09, 2019",
      "content": "<div>Regarding Epic Spell focus, remember that if one goes to 3+ schools (maybe even 2), one might consider reworking some things and just take great intelligence in place of them.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "4:04 AM - Nov 11, 2019",
      "content": "<div>In many places magic bags are real common, but I'd have dropped the wis to 8 and upped the str to at least ten.   I hate having to make runs back to town to empty out my inventory.   And yes.. I know..there is Bulls str empowered and str potions etc... I'm just lazy..  I like being able to pick up all my starting gear and still have the strength to pick up a 1/5th of distilled courage  without needing a Belt of Storm Giant Strength.<br/>\n<br/>\nOther then that, dropping 3 wiz levels for 3 more monk levels gives an even higher permanent speed boost.  And yes. that will reduce your spell DC a touch, but that can be made back in one school by the foci mentioned above, or by adding in the spell penetration feats instead.   A permanent change from 10% to 20% is a big difference when you dont need a spell to enhance it.  </div>"
    }
  ]
}