{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "546",
  "name": "The Epic Wizard (40 Illusionist)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-epic-wizard-40-illusionist-t2355489.html",
  "author": "yamuchaop",
  "avatar": "10404082_1510287071.jpg",
  "replies": 11,
  "posts": [
    {
      "author": "yamuchaop",
      "avatar": "no_avatar.png",
      "timestamp": "5:07 PM - Jun 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Someone referred me to this forum when i shared my wizard build. It's not really anything special, just a functional build that works from 1-40.<br/>\nThis is just my build that i wanted to share.<br/>\n<br/>\nWhy Illusionist? I don't find enchantment spells all that useful in NWN. In my opinion CC as a whole is a lot less powerful than it is in pnp.<br/>\n<br/>\nHere's a short list of the end-game spells that i want to use, these spells will impact choices i make later.<br/>\n<ul>\n<li><strong>Level 1:</strong> None of them scale well into later levels.</li>\n<li><strong>Level 2:</strong></li>\n<li>Lesser dispel: Can be used as a counterspell but rarely need it.</li>\n<li>Knock: Replaces the need for lockpicking, but your pixie familiar does this for you anyway.</li>\n<li>Death armor: Good against high spell resistance monsters!</li>\n<li><strong>Level 3:</strong></li>\n<li>Flame arrow: The number of arrows keep scaling past level 20. Deals insane damage for a measly level 3 spell.</li>\n<li>Dispel magic: Same deal as lesser dispel.</li>\n<li>Clarity: It's quite common for wizards to have access to gear that makes this superfluous.</li>\n<li>Find traps: Reveals and disarms every trap in 30 meter radius. Even more thievery for the mages :)</li>\n<li><strong>Level 4:</strong></li>\n<li>Elemental shield: Same deal as death armor.</li>\n<li>Evard's black tentacles: One of the best damage spells in the game. It's a really strange spell, the saving throw doesn't matter too much, spell resistance doesn't work either. But resistance to bludgeoning damage really counters it. The empowered version is amazing since it increases the number of tentacles.</li>\n<li>Improved invisibility: 50% concealment and protection against targeted spells? Dips!</li>\n<li>Lesser spell breach: The only breach you'll need (most likely anyway)</li>\n<li>Ice storm: This spell is plain bad when you get it but at level 40 it will deal 18d6 damage with no saving throw. It really comes into its own in the later parts of the game.</li>\n<li><strong>Level 5:</strong></li>\n<li>Firebrand: This spell is amazing when you get it, and you'll likely use it heavily until the really high levels.</li>\n<li>Mestil's acid sheath: Same deal as elemental shield and death armor. Stack the three for great effect.</li>\n<li>Dismissal: Get's rid of annoying summons that'll block your missile storms.</li>\n<li>Lesser spell mantle: Most likely the only mantle you'll ever need.</li>\n<li><strong>Level 6:</strong></li>\n<li>Bigby's forceful hand: Amazing single target spell. It's very rare that monsters are immune to both knockdown and daze.</li>\n<li>True seeing: Replaces the see invisibility and ultra vision spells in the later stages of the game.</li>\n<li>Isaac's greater missile storm: The most ludicrously overpowered damage spell in the game. Murders bosses like no other. Don't use it against groups of enemies though.</li>\n<li><strong>Level 7:</strong></li>\n<li>Shadow shield: Immunity to necromancy, death magic and negative plane energy + some protection against physical attacks on top. Always memorize one.</li>\n<li>Finger of death: You can ramp the DC so high that nothing but a 20 will save the monster. In the pnp version a roll of 20 doesn't save you, but in nwn it does.</li>\n<li><strong>Level 8:</strong></li>\n<li>Premonition: Replaces stoneskin and greater stoneskin until you get epic warding. Amazing defensive spell.</li>\n<li>Horrid wilting: Deals up to 25d8 magical damage with a constitution save for half. It's also party friendly. This really is a great spell for clearing groups of enemies. Undead and constructs are sadly immune to this spell. Along with Evard's tentacles this is the \"group buster\" of choice.</li>\n<li><strong>Level 9:</strong></li>\n<li>Wail of the banshee: This spell can be ludicrously powerful, but it doesn't work on enemies immune to death magic.</li>\n<li>Time stop: Probably the most overpowered spell in the game. 9 Seconds worth of spells will kill most things.</li>\n</ul>\n<strong>Things i didn't mention:</strong><br/>\nSummons steal your experience in NWN, so while they are useful and powerful i don't use them.<br/>\nConjuration and Necromancy are in my opinion the best offensive schools for the late game. This means that the only spell focus i'd bother with is for those two schools.<br/>\nI prefer humans for wizards since they get an extra feat and some skill points. Gnomes are also quite good.<br/>\nAlways pick the Pixie familiar, it's a really good rogue! You can also do a trick to get past locked doors. Put your character face first into the door you want to bypass, then posses your familiar and walk it backwards into your character, this will push your character through the door :)<br/>\n<br/>\n<strong>Skills:</strong>\n<ul>\n<li>Concentration: You don't want to be interrupted while casting.</li>\n<li>Spellcraft: Every 5 ranks will grant you +1 save vs. spells.</li>\n<li>Tumble: Every 5 hard ranks will grant you +1 AC.</li>\n<li>Discipline: You sadly can't get it high enough without dual-classing. Be careful around knockdown.</li>\n</ul>\nYou'll have plenty of skill points to spare on other skills too, but those four are the most important for combat.<br/>\n<br/>\n<strong>Attributes:</strong>\n<ul>\n<li>Strength: 8 - Useful for carrying loot, but just buy a few bags of holding.</li>\n<li>Dexterity: 12 - Grants initiative and armor class. Really useful stat, sadly don't have enough points.</li>\n<li>Constitution: 16 - Could swap this with dexterity, but i prefer the hit points and fortitude save.</li>\n<li>Wisdom: 8 - Wizard's get good will saves so its not really needed.</li>\n<li>Intelligence: 18 - Put every point in here. It increases DC and grants more spellslots.</li>\n<li>Charisma: 8 - If you wanted to be pretty and blast things, then the sorcerer is for you! :)</li>\n</ul>\n<strong>Feats:</strong>\n<ul>\n<li>Level 1: Luck of heroes, Combat casting. Casting defensively is a really good idea in this game.</li>\n<li>Level 3: Toughness.</li>\n<li>Level 5: Spell penetration. Not really that useful in the early game, but more useful than anything else i want.</li>\n<li>Level 6: Greater spell penetration.</li>\n<li>Level 9: Spell focus: Conjuration. Your offensive spells will likely be flame arrow, evard's black tentacles and firebrand at this level. Two of those are conjuration spells with a saving throw.</li>\n<li>Level 10: Silent spell. It's not really that i expect to be silenced all that often, but it's nice being able to re-arrange spells to higher spell slots.</li>\n<li>Level 12: Greater spell focus: Conjuration.</li>\n<li>Level 15: Empowered spell and Maximize spell: These will really help you do damage for the late stages.</li>\n<li>Level 18: Spell focus: Necromancy. The good necromancy spells ticks in late, so there was no need before now.</li>\n<li>Level 20: Greater spell focus: Necromancy</li>\n<li>Level 21, 23, 24, 26, 27, 29, 30, 32, 33, 34. Great intelligence 1-10. Getting these as early as possible for even more skill points. If you don't feel like you need the extra skill points then feel free take the next few feats first.</li>\n<li>Level 36: Epic warding. Amazing protection. Worth resting just to get this ability back.</li>\n<li>Level 38: Epic spell penetration: Getting your spells resisted is kinda annoying.</li>\n<li>Level 39: Improved combat casting. The benefit of taking this skill is mobility. Having 27+ concentration while in Defensive casting mode does the same thing, but Defensive Casting is cancelled when you move.</li>\n<li>Level 40: No feats here but there is a choice to be made. Taking this level as a wizard helps slightly in overcoming spell resistance and it ups the damage of a few spells. On the other hand a level of Monk will grant you evasion and allow you to max out Tumble and Discipline. A rogue level could also be taken for Use magic device. I have my doubts about how useful even a maxed out discipline skill is for this build.</li>\n</ul>\n\nYou could also skip Great intelligence 9 and 10 for Hellball and greater ruin, the loss from missing out on 2 Intelligence is 1 DC and 1 Level 8 spell slot.<br/>\n<br/>\n<em>...and that is my entire build :)</em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:49 PM - Jun 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello and welcome yamuchaop!<br/>\n<br/>\nYou've clearly put a lot of thought and effort into your build, and the information you give is greatly appreciated. However, I'd be grateful if you could follow the layout as detailed in the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/character-builds-posting-rules-t515321.html\" rel=\"noreferrer\" target=\"_blank\">Build Posting Rules</a> thread from the Rules and Tools forum. This is not mere bureaucracy, but it enables those searching for builds to have common points of reference, and enables us to transpose builds into the database.<br/>\n<br/>\nI understand that you're new here, so you can have a little time to standardize your post (along with your Cleric/Fighter in the Level 20 forum). Thanks in advance.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "demoix",
      "avatar": "10759054_1550229973.jpg",
      "timestamp": "5:12 PM - Oct 09, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Very nice buid, I'm about to start OC with this build now<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "4:53 AM - Oct 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>demoix wrote: <a data-post-id=\"22242\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=22242&amp;sid=f705527845879214ecda345ec318c28d#p22242\">↑</a><div class=\"responsive-hide\">Oct 09, 2020</div></cite>Very nice buid, I'm about to start OC with this build now</div></blockquote>\nIf I may suggest, I recommend The Aielund Saga. It's an excellent series of modules that takes you all the way to 33rd level or so. IMO much better than the OC.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:47 AM - Oct 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would recommend World of Greyhawk...<br/>\n<br/>\n<img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\nThat would certainly be a good test of this build!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:58 AM - Oct 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Maximillian_Kane wrote: <a data-post-id=\"22245\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=22245&amp;sid=f705527845879214ecda345ec318c28d#p22245\">↑</a><div class=\"responsive-hide\">Oct 10, 2020</div></cite><blockquote><div><cite>demoix wrote: <a data-post-id=\"22242\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=22242&amp;sid=f705527845879214ecda345ec318c28d#p22242\">↑</a><div class=\"responsive-hide\">Oct 09, 2020</div></cite>Very nice buid, I'm about to start OC with this build now</div></blockquote>\nIf I may suggest, I recommend The Aielund Saga. It's an excellent series of modules that takes you all the way to 33rd level or so. IMO much better than the OC.</div></blockquote>\nJust a wee clarification...<br/>\n<br/>\nAielund will get you to level 36 or 37 (although Mick's certainly reached level 38 at least twice when soloing).<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "demoix",
      "avatar": "10759054_1550229973.jpg",
      "timestamp": "5:25 PM - Oct 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I never played custom community modules yet but definitely gonna try now as HOTU campaign only support up to ~28lvl<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:32 PM - Oct 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, and you can also get WoG offline!<br/>\n<br/>\nIt's much more fun than most offline mods (though Aieland Saga is pretty good!).<br/>\n<br/>\nI might be a tick biased here...hehe.<br/>\n<br/>\nWoG goes to level 40.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:33 PM - Oct 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>demoix wrote: <a data-post-id=\"22250\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=22250&amp;sid=f705527845879214ecda345ec318c28d#p22250\">↑</a><div class=\"responsive-hide\">Oct 10, 2020</div></cite>I never played custom community modules yet but definitely gonna try now as HOTU campaign only support up to ~28lvl</div></blockquote>\nIgnore Web for now (often sound advice <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />), you can get to WoG later on. Have a look at our Modules forum for modules that can get you all the way to level 40 - as well as many others designed for lower level play. Aielund is the stand-out one in my book, and will get you almost all the way. Or you could go into Sands of Fate after HotU, which will take you from level 28 to 40. Or right after the OC you could go for Mines of Twin Summit, taking you from level 15-18 up to 40.<br/>\n<br/>\nAll the loading information should be in the individual module threads (many with links to the Vault), so you should have no problem getting started with them. I believe they're all EE compatible as well, but the Vault will tell you more.<br/>\n<br/>\nEnjoy!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "6:42 PM - Oct 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>demoix wrote: <a data-post-id=\"22250\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=22250&amp;sid=f705527845879214ecda345ec318c28d#p22250\">↑</a><div class=\"responsive-hide\">Oct 10, 2020</div></cite>I never played custom community modules yet but definitely gonna try now as HOTU campaign only support up to ~28lvl</div></blockquote>\nOnce you take that leap, you will NEVER want to go back!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "demoix",
      "avatar": "10759054_1550229973.jpg",
      "timestamp": "7:21 PM - Oct 10, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Much appreciate everyone's adventure suggestions!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:34 PM - Oct 21, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Build moved 21/10/2020. Over four months is long enough to properly format the build. It is very worthy in many ways, and can be reintroduced to the level 40 forum when it's complete.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}