{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Full Epic - Level 40 Builds",
  "forum_id": "006",
  "id": "010",
  "name": "Truesilver's Hand (Monk 30/ DwD 5/ SD 5)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/truesilver-s-hand-monk-30-dwd-5-sd-5-t2355093.html",
  "author": "soulfullmusik",
  "avatar": "10404082_1510287071.jpg",
  "replies": 92,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:58 PM - Feb 12, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">This one has been long in gestation, and wouldn't be here at all if not for the stupendous efforts of Mirnaia in its testing while my game was broken, to whom I shall remain eternally grateful. Mirnaia also made a very viable tweak of upping the Wisdom at the expense of Constitution, which clearly worked. I took the build in its initial version through full testing lately, and both are fine. I'm including the entire thread from the Build Request forum below, as I believe it merits the coverage (and I'll be linking it to the Mines of Twin Summit thread in the Modules forum), as well as showcasing Mirnaia's exemplary assistance, and you can choose which better suits you. I did have a back-story for the build, but it was based on the character being female, which would rub against the grain of Mirnaia's testing, so I'll leave it for another time. (Oh, and I'll write up a proper Skills Schedule for the initial build as soon as I can - I still input here directly, so it takes a bit of time). Hope you like it.<br/>\n<br/>\nGo well!<br/>\n<br/>\nHere's another one for your consideration. Assassin was beginning to make me twitch, so I did some reverting to type...it's a Monk! And...it's a Dwarf!However, I thought I'd try a different tack. An unarmed Dexer (admittedly because I couldn't get the TW feats in, so binned Kama) with an emphasis on defence, but who can hurt with d20 fists once s/he hits Monk 16 - so I tried to get that relatively early.<br/>\n<br/>\nAnyway, I'd really appreciate any thoughts.<br/>\n<br/>\n<strong>Monk 30/ DwD 5/ SD 5</strong><br/>\nDwarf - any Lawful<br/>\nPvM 1-40 (untested - game still bust, so relying on pnp here)<br/>\n<br/>\n<strong>Stats</strong><br/>\nStr 14<br/>\nDex 18 (32)<br/>\nCon 14<br/>\nWis 8<br/>\nInt 12<br/>\nCha 6<br/>\n<br/>\nHPs - 460<br/>\nAC - (naked) 37 (+1 Dodge, +1 Shadow Evade)<br/>\nSR - 40 (undispellable)<br/>\nSpeed - +100%<br/>\nSaves - F 25, R 33, W 22 (+2 vs traps +2 vs spells - maybe +4 more vs spells, depending on skills chosen)<br/>\nEpic Dodge<br/>\nHiPS<br/>\nDefensive Awareness II (cannot be flanked in combat)<br/>\nDR - 20/+1<br/>\n10% resistance to element (fire, cold, acid, electrical or sonic)<br/>\n50% Concealment (2/day, 30 rounds each)<br/>\nImmune to mind-affecting spells<br/>\nBAB - 26<br/>\nAB - +41/38/35/32/29<br/>\nDamage - (unarmed) d20+2<br/>\n<br/>\nSkills - 215. Hide 43 (54), Listen 43 (44), Move Silently 43 (54), Tumble 40 (51). 46 spare for any combo of Disable Trap (cc), Discipline, Lore, Open Lock (cc), Search and Spellcraft (cc) <br/>\n<br/>\n<strong>Levelling</strong><br/>\nDwarf: +2 Search underground/ Darkvision/ +2 vs poison and spells/ +2 Lore/ +4 dodge AC vs Giants/ +1AB vs Orcs and Goblinoids<br/>\n1 M1 - (Cleave/ Evasion/ etc)/ Dodge<br/>\n2 M2<br/>\n3 M3 - Weapon Finesse<br/>\n4 M4 - Dex+1 (19)<br/>\n5 M5 - (Immune to disease)<br/>\n6 M6 - (KD/ IKD)/ WF: Unarmed<br/>\n7 M7<br/>\n8 M8 - Dex+1 (20)<br/>\n9 M9 - (Imp Evasion)/ Mobility<br/>\n10 SD1 - (HiPS)<br/>\n11 M10<br/>\n12 M11 - (Immune to poison)/ Dex+1 (21)/ Toughness<br/>\n13 DD1<br/>\n14 DD2 - (Defensive Awareness I)<br/>\n15 DD3 - Blind Fight<br/>\n16 DD4 - Dex+1 (22)<br/>\n17 DD5 - (Defensive Awareness II)<br/>\n18 M12 - (SR: 10+class level)/ Imp Critical: Unarmed<br/>\n19 SD2<br/>\n20 SD3 - Dex+1 (23)<br/>\n21 M13 - EWF: Unarmed<br/>\n22 M14<br/>\n23 M15<br/>\n24 M16 - Dex+1/ GDexI (25)<br/>\n25 SD4<br/>\n26 SD5 - (Defensive Roll)<br/>\n27 M17 - Epic Dodge<br/>\n28 M18 - (Empty Body)/ Dex+1 (26)<br/>\n29 M19<br/>\n30 M20 - (Perfect Self)/ Epic Prowess<br/>\n31 M21<br/>\n32 M22 - Dex+1 (27)<br/>\n33 M23 - GDexII (28)<br/>\n34 M24<br/>\n35 M25 - Armour Skin<br/>\n36 M26 Dex+1/ GDexIII (30)<br/>\n37 M27<br/>\n38 M28<br/>\n39 M29 - GDexIV (31)<br/>\n40 M30 - Dex+1 (32)/ Epic Energy Resistance<br/>\n<br/>\nI don't recall seeing anything quite on these lines (which means that more than likely it's got problems), so over to you!<br/>\n<br/>\nCheers<em><br/>\n<br/>\n<strong><em>EDIT:</em></strong> </em>Forgot to add Dwarf racial bonuses, sorry - now corrected.<br/>\n<br/>\n<em><strong>EDIT 2</strong></em>: It may be that DwD10 and Monk25 is worth it, with the final few DwD levels taken late in epic levels, but I'm yet to be sold on that. You're all welcome to try, of course! (Oh, and I'll be working up some kind of back-story while you carve him/her up.)<br/>\n<br/>\n<strong><em>EDIT 3</em></strong>: I've got the character story - hence the change of thread title. She is a follower of Moradin's bride, Berronar Truesilver. That's all you get for now.<br/>\n<br/>\n<strong><em>EDIT 4</em></strong>: Really should stop with all the editing. However, I thought it worth mentioning that I did find a sort of mirror build to this one in the Legacy Archive. Back in 2005 Kaliban came up with <strong>Tempered Steel</strong>, which is a Monk 9/ SD 5/ DwD 26, with the same starting and ending stats. He does go for dual-wielding kamas (giving a d-w AB of +40), meaning Blind Fight is lost and Imp Crit and W Focus are taken in epic levels. ED is not reached until L39. His HPs are 470, but that's because he takes an Epic Toughness at L40, and his naked AC is 32. He does get DR of 18/-, but I'll trade that in for all the other goodies Truesilver's Hand has tucked away.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:21 PM - Feb 13, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Alright, I'm going to ask a big favour of the Guild. I would be immensely grateful if someone was prepared to give this a test run. I'd love to, but something is corrupt in the heart of Neverwinter for me at the moment, and it simply will not load. The thing is, I really like the look of this one (might be a bit sticky until the mid-late teens), and I would like to post it as a tested build in the 40s section. It's my first really unique take on a build (I think), and I would like to unleash it on an unexpecting world. But I can't without your help.<br/>\n<br/>\nSo, any brave volunteers, please? Virtual beers and/or cakes, together with massive kudos is all I can offer, I'm afraid.<br/>\n<br/>\n(Oh, and if someone is prepared to give it a go, I'd go for full Discipline as the spare skill, with a few points in Lore.)<br/>\n<br/>\nThanks <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "10:06 AM - Feb 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Dearest Stag, and what type of setting were you thinking of? I could take it for a spin in MTS as high magic (skipping the OC because I loathe it with a vengeance), or Endless Nights as extremely random.<br/>\n…I guess I could try doing solo WoG, but I might not know it nearly well enough to dare venture into it with a character who's so item-dependent early on.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:51 AM - Feb 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You are an absolute star, Mirnaia - thank you!<br/>\n<br/>\nMTS could be a good call, though you might get very bored there with a Dexer. I know from elsewhere that Mick uses Endless Nights as a training ground, though I have yet to try it myself. I'd be tempted to leave WoG well alone for a test drive. One that does leap to mind, but perhaps requires more commitment than I've any right to ask for, is Aielund (I think not hitting the last 3 or 4 levels is forgivable).<br/>\n<br/>\nEssentially, it's your call. I'm just extremely grateful <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "4:19 PM - Feb 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll do MTS because I've played through it 2 times already, so I'll have some basis of comparison, it's a fun slugfest without being overly difficult and it's not that long for a module that goes into 40.<br/>\n<br/>\nThe exact build I'd take there:<br/>\n<br/>\n<details><summary>Spoiler</summary>\nMonk(30), Dwarven Defender(5), Shadowdancer(5), Dwarf\nSTR: 14\nCON: 10\nINT: 12\n\n01: Monk(1): Dodge, {Cleave, Evasion, Improved Unarmed Strike, Stunning Fist}\n03: Monk(3): Weapon Finesse\n05: Monk(5)\n07: Monk(7)\n09: Monk(9): Mobility, {Improved Evasion}\n11: Monk(10)\n13: Dwarven Defender(1): {Defensive Stance}\n15: Dwarven Defender(3): Blind Fight\n17: Dwarven Defender(5)\n19: Shadowdancer(2): {Uncanny Dodge I}\n21: Monk(13): Epic Weapon Focus: Unarmed\n23: Monk(15)\n25: Shadowdancer(4)\n27: Monk(17): Epic Dodge\n29: Monk(19)\n31: Monk(21)\n33: Monk(23): Great Dexterity II, (DEX=28)\n35: Monk(25): Armor Skin\n37: Monk(27)\n39: Monk(29): Great Dexterity IV, (DEX=31)\n\nSkillpoints: 215\nSaving Throw bonuses: Spells: +2, Mind Effects: +2, Traps: +1, Poison: +2\nAB (max, naked): 41 (melee), 38 (ranged)\nSpell Casting: \n\n\n01: Hide(4), Listen(4), Lore(3), Move Silently(4), Open Lock(1), Save(3), \n03: Hide(1), Listen(1), Lore(2), Move Silently(1), \n05: Hide(1), Listen(1), Lore(1), Move Silently(1), Save(1), \n07: Hide(1), Listen(1), Move Silently(1), Tumble(5), \n09: Hide(1), Listen(1), Lore(2), Move Silently(1), \n11: Hide(1), Listen(1), Move Silently(1), Save(6), \n13: Listen(1), Save(5), \n15: Listen(1), Save(9), \n17: Listen(1), Save(13), \n19: Hide(1), Listen(1), Lore(4), Move Silently(1), \n21: Hide(1), Listen(1), Move Silently(1), Save(3), \n23: Hide(1), Listen(1), Lore(2), Move Silently(1), \n25: Hide(1), Listen(1), Lore(4), Move Silently(1), \n27: Hide(1), Listen(1), Move Silently(1), Tumble(5), \n29: Hide(1), Listen(1), Lore(2), Move Silently(1), \n31: Hide(1), Listen(1), Move Silently(1), Save(3), \n33: Hide(1), Listen(1), Lore(2), Move Silently(1), \n35: Hide(1), Listen(1), Lore(1), Move Silently(1), Save(1), \n37: Hide(1), Listen(1), Move Silently(1), Tumble(5), \n39: Hide(1), Listen(1), Lore(2), Move Silently(1), </details>\n<br/>\nI took Lore as the extra skill, because Discipline is somewhat useless with a Dex build. You can protest and I'll switch it back, but I went with 10 Con and 12 Wis, for +2 AC.<br/>\n<br/>\nStarting at level 15, here's the beginning, every item's available in the OC:<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201902/10758846_4fd3d3a01c29453fc533ce99e9b5c2f3_t.png\" /></dl>\n</span><br/>\n<br/>\nCloak of Fortification +3<br/>\nGloves of the Hin Fist +3<br/>\nBelt of Guiding Light<br/>\nRing of Power<br/>\nRing of the Rogue +4<br/>\nPendant of the Elf +4<br/>\nDragon Slippers<br/>\nTruesilver Robe (renamed and recoloured Dark Moon)<br/>\n<br/>\nThe potions might be overkill (Str, Dex, Con, Wis, Barkskin), but anyway, this is how I'll start out.<br/>\n<br/>\nEDIT: First kill - Vestivius.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:45 PM - Feb 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Excellent stuff, Mirnaia!<br/>\n<br/>\nI entirely understand about dipping on Discipline - I might have gone for some Search and De-trapping instead, but <em>you're</em> the one doing <em>me</em> a favour, so Lore's cool. If it had been a game-changer I'd have included it in the \"mandatory\" list of skills.<br/>\n<br/>\nI actually quite like the shift to 12 Wis from Con. Swings and roundabouts on the Fort/Will saves axis. More importantly, this build is about not getting hit (ED, Concealment, AC, SR, DAII, Hide and MS, speed, etc), whereas Con is for when you do get hit, and whether you can handle it. Thus it's a smart idea, thanks. (I just get twitchy with dwarfs who can't handle a mountain dropping on them, but that's my problem - much as the Discipline thing is down to my proclivity for Str builds.)<br/>\n<br/>\nAs I said, my only concern about MTS is about a few areas with hundreds of baddies with DR. I have no doubt you'll beat them, but it might take a year or two!<br/>\n<br/>\nHave more cake and fizz! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "supercocho",
      "avatar": "10759053_1550164774.jpg",
      "timestamp": "6:23 PM - Feb 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">owo cool, so dwarf is the mystery umm<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:45 PM - Feb 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I suppose it's perfectly reasonable to question the use of dwarf if it's not being stuffed with Con. But you certainly can't take DwD without being a dwarf, and Defensive Awareness II is well worth the investment (imho) regardless of other considerations. You'd need a whole lot more of another class to get close to its benefits, which would hamper all the Monk goodies, and when you could take them.<br/>\n<br/>\nAnd the most important of those other considerations is that I bloody love me some dwarf! Thus enjoyment trumps all. As it's supposed to.<br/>\n<br/>\nGood to meet you supercocho!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "8:01 PM - Feb 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">After Action Report.<br/>\n<br/>\nHere's what I did: I turned the virtual beer into real one (and a bottle of cider, but that's for the pulled pork that's cooking while I'm playing), put aside my Might and Magic III playthrough, and started hacking away.<br/>\n<br/>\nThanks for the nod on the skill and ability preferences. I mean, look at the guy's face, that's way more like 12 Wis than 8 :) I was also toying with the idea of 14 Int at the cost of Con and leaving Wis at 8, but didn't find any really useful skill for MTS. For Aielund, I'd do it and max Persuade for a cooler RP experience, if you can stomach the idea of a dwarven diplomat.<br/>\n<br/>\nIn the beginning with such builds, you're struggling for AC, especially since you don't have any kind of concealment yet (and no UMD). AB isn't sky-high either. I gracefully skipped over the most painful bits, as a pure dex-monk is probably the weakest low-level character, but there's nothing to do about that other than suck it up (or skip it, like I did!)<br/>\nI quickly ditched the initial robes for Vestivius' +5 robes and haste boots, an unbuffed AC of 37 is comfortable in the beginning of MTS. I didn't kill V because I wanted the cloak, but just for the heck of it, honestly, I didn't remember what he dropped.<br/>\nThe effects of Def stance can definitely be felt, but there are still too many 20s. I can't wait for ED and Empty Body.<br/>\nHiPS is ridiculous as always. Pull with a bow, hide, mess up the stragglers. Or assassinate the caster, hide, reposition. MTS features many true seers, though.<br/>\n<br/>\nTHE SPEED IS GOOD.<br/>\nMinotaurs outdoors + 3 risen monks (West, East, South) -  barely beat one minotaur pack unbuffed without tricks, rushing in, using IKD. With potions, I lost 1/2 health, with bow/HiPS abuse (i.e. playing intelligently), virtually nothing. Potions make a big difference, but I'll try and only use them when it'd get really rough otherwise. Same for drinking healing potions.<br/>\nBadric residence - I always get freaked out when the Minstrels use EYE RAYS. (I play on HC, petrification makes you a Peter forever.)<br/>\nSewers lvl 1 - poison immunity is nice against the spiders. Sewage cubes generally missed their acid attacks, have 10 DR against fist. Also, because I was lower level, fewer ones spawned. I didn't know it was a thing in MTS. Needed drinks after several battles. Umber hulks are a joke. Hit level 16. Getting 13 HP with 10 Con feels weird :) Confirmed, at level 16, more cubes spawn, take forever (3-4 rounds per cube) to kill. Being Hungarian, I take offense at not being able to solve a cube quickly. Against 5-6 cubes, had to HiPS away and heal, even with potions active, or abuse the terrain to separate them.<br/>\nWhite Wolf Inn - maybe ditching Discipline was not such a good idea against Taunts. HiPS to the rescue.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:59 PM - Feb 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Great stuff Mirnaia! And of course, playing NwN stone-cold sober is a ridiculous idea (I'm sure both tapatalk and the ECB Guild would not approve this message - at least formally). I'm drinking the cider while cooking with wine - salmon with lemon and dill (I'm <em>so</em> liberal elite <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n<em><strong>EDIT:</strong></em> Sorry, coming back to this over a month later, but I just thought it might be worth mentioning that it's Concentration, not Discipline, that resists Taunt (I know, weird). I'm sure that was just a typo, but others might want to know.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:16 PM - Feb 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nHere's another one for your consideration. Assassin was beginning to make me twitch, so I did some reverting to type...it's a Monk! And...it's a Dwarf!\n</div></blockquote>\nI feel something budding here, like you're searching for something that won't quite reveal itself. <br/>\nYou return to monk, safe and sound. And the build is good. People are willing to play your builds. And you have become a respectable character builder.<br/>\nAnd still...you keep searching.<br/>\nHere is a <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/melee-mage-wizard-40-t2354625.html\" rel=\"noreferrer\" target=\"_blank\">Dwarf</a> I want you to have a closer look at. It is really something different. A melee character, but not a monk this time.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "11:06 PM - Feb 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, the mage who wants to be a cleric… and for some weird reason* kind of succeeds. But seriously, install an override for Tenser's if the module you're playing doesn't modify it to PnP.<br/>\nOn the one hand, when I'm playing a non-caster, it feels strange, on the other hand, not fighting against dispels all the time is relaxing.<br/>\n<br/>\n*because clerics are by far the best, but mages are even better<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:20 AM - Feb 15, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'll let the two of you into a little secret (shh - tell no one!).\n<details><summary>Spoiler</summary>I have no problem at all with arcane or divine casters per se. Indeed, I have huge respect for what they can achieve (probably why I tend to like builds that can kill them fast, perversely), and have played them many times in earlier incarnations of d&amp;d. However, it all seems so bloody convoluted in NwN, and it annoys me to distraction. I don't want to have to spend a month prepping before taking on my abominable foes - I'd be more tempted to say, \"Oh, go on, *insert name of villain*, you have the damned kingdom. I'm going fishing with Kipper Bob.\"\nMaybe I just need to get some practice at it, and thereby gain some muscle-memory - and I honestly don't particularly mind banging my head against a wall for a while, but I do lack the patience I once had. Once I'm back up and running, I might do some quiet mucking about with this casting shenanigans, but I wouldn't put your house on it. Oh, and Mick, I do like that link - Web Shaman knew his onions!\n</details>\n\nNow, for the rest of the Guild - who haven't been listening and so don't know what I've just said - STAG DOESN'T DO CASTERS!!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:31 AM - Feb 15, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Those who protest the loudest, are those who are thinking about it the most ;)<br/>\n<br/>\nBesides, nowadays we have \"Casters\" with 40+ AB &amp; Full Plate, so even without magic, they can cut /slash / bludgeon their way through just fine.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:42 AM - Feb 15, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\nThose who protest the loudest, are those who are thinking about it the most ;)<br/>\n<br/>\nBesides, nowadays we have \"Casters\" with 40+ AB &amp; Full Plate, so even without magic, they can cut /slash / bludgeon their way through just fine.\n</div></blockquote>\nEqually, you can lead a horse to water, but you can't make it drink <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\nSecondly, if it's the case that casters can do all that without magic, then why not boost the melee presence, rather than go charging off on a magical tangent? If the cake's good, I don't need any frosting - in fact, with a decent fruit cake I'll take the icing off and give it to the small children (or my mum).<br/>\n<br/>\nYou appreciate, of course, that neither goading nor appeals to sanity will work with me. I'll just dig my heels in harder (I wonder why I like dwarfs...). The only thing that works with me is if I get inquisitive.<br/>\n<details><summary>Spoiler</summary>And yes, there are some builds that have piqued my interest. I know you've been trying to get me \"in\" by Pally, Ranger or Bard, but I suspect that when I do go, I'll go big time, with loads of Wiz or Sorcerer (let's leave Cleric and Druid to one side for now, eh? That Viconia shambles is still something I need to come back to) - much as I did with going ranged with my first build being an AA 27. I'd actually been looking at what more RDD could bring than just 10 or 14 levels, then I came upon your Draco Mauler (F10/B4/RDD26) and thought ok, I can't do better than that. So, aye, when I fall, I fall hard.\n</details>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "EasternPromises",
      "avatar": "10759017_1547723389.jpg",
      "timestamp": "8:28 PM - Feb 19, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Reminds me of my Greedy Dwarf, but with much better weapon damage. The SR is also very appealing. However the lack of UMD hurts... it's just too good. Want to replace SD 5 with Rogue 10 :) ?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:20 PM - Feb 19, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>EasternPromises wrote:</cite>\nReminds me of my Greedy Dwarf, but with much better weapon damage. The SR is also very appealing. However the lack of UMD hurts... it's just too good. Want to replace SD 5 with Rogue 10 :) ?\n</div></blockquote>\n\nOrdinarily a sane person would probably agree (particularly as I've just been arguing for including UMD in someone else's build). However, I have no intention of using wands and scrolls with this one, and I already get to use juicy Monk gear. Just sticking to my mundane roots, you know? It's all about the concept, dude (can't find a dopehead emoji, sorry).<br/>\n<br/>\nOf course, you're quite welcome to vary from script, but a couple of things come to mind...I appreciate you're a PW player, so xp penalties matter less, but you'd certainly hug them close with a Monk 25/ Rogue 10/ DwD 5. Second, I do like me some HiPS - it's so much less faff than potions and scrolls. Yes, this pc can be a tank, but it can also be a swift and stealthy mage-killer.<br/>\n<br/>\nThat said, I await further feedback from Mirnaia, so am quite prepared to reverse any opinion heretofore expressed (official Stag disclaimer).<br/>\n<br/>\nCheers<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Bloody hell - I actually got a \"couple\" down to an actual 2!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "2:00 PM - Feb 20, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I assure you, Ernő (to be Frank,he's already Ernest) Rubik is still alive and kicking!<br/>\n<br/>\nFlurry of Blows and Defensive Stance are incompatible. This is really a pity. It won't matter much in MTS because you can cap every attribute, so all that DS will eventually give is 4 dodge AC and 2 save vs. all. WW inn cleared without problems, if you exclude the one reload when I got turned to stone.<br/>\nSo far, putting one point in open locks together with the ring of the rogue allowed me to unlock doors rather comfortably. This might be the first time I can complete a certain quest the proper way.<br/>\nHanded in the spider quest. ~13K for a 10-stack of heal potions is ridikkulus. I wish the module's creator limited heal access, but what the hell, it's a 2006ish module.<br/>\n<br/>\nCertain quest:  Walked into the inn, casual like (with monk speed) - it's refreshing to have a NWN module where most NPC's you talk to are actually friendly - I always forget where the fucking stairs are to the second floor, and the inn has like a million doors - anyway, I swung over to the jeweller's shop, assassinated the owner, and discovered that the doors are DC 38 (I can get at most 32, and didn't have lockpicks), so I murdered everyone inside, and helped myself to the contents of the vault. I love the way the customers keep walking around while you are beating the guards to death and kicking in doors. I later realised the artificer sells Chimes of Opening, useable by anyone. <br/>\nI had to reload to before the quest, because the level drain the vault chests did would not go away by resting, lesser restoration or by the healing at the apothecary. The tower of thunder sells a lot of scrolls and not only mage ones, but they only sell lesser restoration, not the more powerful ones. So, from what I can see, nothing gets rid of the level loss.<br/>\nThis time I did buy chimes, and realised that if the guards ever see you (even if they don't turn hostile because you hide again fast enough), you don't get credit for the sneaky bit. So I did it again again, with +3 lockpicks (the best sold by the artificer) and inventory shuffling. Oh, the occupational commitment! I can finally just sell everything to Uther Dartmoth. He, of course, sells up to +10 lockpicks, but you need to kill McAllister before he'll trade with you. I went back to the jeweller's and murdered everyone. <br/>\n<br/>\nAid the Miners: Regular minotaurs are extremely underpowered at this point, and the cave is filled with them. The rest are nothing we haven't seen at this point, either.<br/>\nLevel 17! Flanking immunity and an extra attack. Of course, one of the minotaurs drops a greater restoration scroll. <br/>\nI kited the greater gorgons to death (I could fail my save on more than a 1.) Shoot, HiPS, repeat also worked.<br/>\nAtM part 2: The risen monk packs are tougher. They can IKD you, which they wouldn't do normally because their AB is terrible, but when they do it from stealth, the Dex bonus retention to AC is not enough to stop it all the time. Weird stuff: one of them KD'd me on a 30 (14+16) roll, I have 44 AC, Defensive Awareness II and the monk who did it was definitely visible. I have no idea what gives. I mean, if they have no chance, they won't even attempt it, and I have seen them try several times. With DA2 it shouldn't matter where they stand relative to me, should it? What am I overlooking?<br/>\nStealth&amp;detect doesn't slow me down as opposed to just stealth.<br/>\nRisen masters still give extreme XP despite not being more dangerous than regular monks: level 18! Catching up on stealth skills and tumble, doubling my crit rate :D, MOAR MOVESPEED, and finally, innate spell resistance!<br/>\nNext up: frost giants.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:57 PM - Feb 20, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Marvellous progress, Mirnaia, thank you!<br/>\n<br/>\nI'll confess, I didn't know that about FoB and Def Stance. But this was never going to be about reliance on Def Stance or plenty more levels of DwD would be included. DwD here was always more about being unflankable. The AC bonus and improved saves are just nice little bonuses. I put the levels of DwD where I did for 2 reasons: the first was to offer some resilience during those difficult teen years, which Def Stance does help with at those levels; the second, of course, was to maximize pre-epic BAB as far as possible.<br/>\n<br/>\nYour commitment to the cause is highly commendable - cocktails and creme brulees abound <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "6:29 PM - Feb 20, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">All right, I was starting to have a bad conscience about not using Def Stance :)<br/>\nIKD needs to hit first before discipline is considered. I shouldn't be getting hit on a 30 with 38 to 44 AC (depending on buff status).<br/>\n<br/>\nZael's Peak, Base: Huge difference between going in with and without potions. Enraged Frost Giant Berserkers have 30 AB, and I only have 44 AC buffed. They also have significantly more health than regular giants.<br/>\nZael's Peak, Summit (just clearing it so I don't have to come back): first true seers! The souped up blue wyrmlings pose no threat, breaths taken care of by Ring of Power but mostly by improved evasion. Can't get gloves with the dragon blood quest, but still, I might as well do it. Servitor of Zael + Lesser Mithril Golem packs: if you don't get the jump on them (and the Servitors have good detection) it's of course difficult, because caster. I don't have enough AB to consistently hit the golems. Against the big golem packs at the top, I need to HiPS a lot.<br/>\nLevel 19! One level away from max attack per round.<br/>\n<br/>\nFrost Giant Caves: the berserkers can hurt. I ran out of healing potions but still decided to take on the first boss, survived. He drops a ring with WS: Unarmed strike, the rings I have right now are better though than 2 damage. Warlord Jarugdon, on the top floor, drops the Moss Covered Cloak, which is a godsend (10/- slashing, bludgeoning, piercing, +3 Int, KD immunity), unfortunately, he's also wearing it while he's still alive, so it takes forever to bring him down. This trivialises many fights against trash packs that have so far been dealing an annoying amount of damage. Jarugdon has higher Discipline than what my AB allows for, and he has high AB himself, so Def Stance &gt; FoB here. The monster density in the caves is pretty insane.<br/>\n<br/>\nHere's a video of the <a class=\"postlink\" href=\"https://youtu.be/1RQVXnK1n84\" rel=\"noreferrer\" target=\"_blank\">frost giant boss fight</a>. FPS = shite. This is not for entertainment, but so that Stag can see how his build performs when played very badly. It is also unlisted. I have Tony K's AI installed. This also means the enemy doesn't have dispel, or they'd have used it. Everything that could go wrong does. Misclicked IKD, buggy engine teleporting mosters around, misclick turning attack off, messing up IKD timing (always do it on all attacks of the 1st or 3rd flurry and stick with it for the rest of the fight), bad targeting. The flashing is due to me spamming the highlight button (which I bound to Space, which I think is the most convenient thing) to force an update of monster health.<br/>\nLevel 20! Eight attacks per round. I can also summon a shadow that is absolutely useless, and once per day I can do a a 5 round DC25 daze (10+Dex mod+SD level), which might be useful against grunt bosses, should I remember that I have it. I have never used it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:10 PM - Feb 20, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Fair point on IKD - you're not spamming 1s (you) and 20s (them) are you? Sometimes the gods are real bastards that way.<br/>\n<br/>\nCrap, I'd forgotten about the Mithril Golems - they're a pain even if going Strength big time, bloody well done (for your patience, as much as anything). I did wonder if you might go for Mordre Khan before heading to Zael's Peak - that way you'd be able to skip the ascent by using the Rak portal into Zael's base of operations, but that might be a bit premature.<br/>\n<br/>\nUnfortunately, I can't watch the vid, much as I'd like to. Maybe it's part of the whole knackeredness of things at my end atm. I, too, remain less than olympian in my IKD timing, etc. But I'm going to presume you eventually prevailed and are now (with the greatest respect) moss-covered.<br/>\n<br/>\nAre you trying Zael's lab before the Raks? I might actually be tempted by going to Kohr's Peak for a while - there's some great Monk gear on the boss Genie. But that might be a bit of a stretch just yet.<br/>\n<br/>\nThanks again, Mirnaia <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "7:21 PM - Feb 20, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">After the Frost Giants I was planning to finish the sewers and port into Zael's Lab, at least that's my usual route. I might check out Khor's Peak first upon reading your post - my gloves are badly in need of an upgrade. I don't really know how else I could share the video so you can see it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:16 PM - Feb 20, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Never mind the video - I'll get to see it once I'm sorted again, I'm sure. Thanks for posting, though!<br/>\n<br/>\nThinking about it, I'm cautious to advise going to Khor's. That first internal level can be an utter bastard - but maybe if it's adjusted for levels you'd be alright. Just don't want to send you off on a suicide mission, is all! Stick to what you know - it's all good. I confess, I do the sewers in one sweep, but maybe that's because I play standard rules. But I've also done Kohr's Peak first as often as I've done Zael's. Much depends on what you bring with you and what build you're playing. Remember, you can always kick my arse on this one!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:27 PM - Feb 20, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good job taking out the caster first Mirnaia, you could have also used the door as a choke-point as well after that.<br/>\nYour IKD's were also (mostly) successfully executed, the camera doesn't help much and all this tileset clipping but you did the best that you could given the circumstances.<br/>\nThe build will truly come alive when you get your hands on a pair of sweet Monk's gloves though, and I'll wait to see the results of that ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:40 PM - Feb 20, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\nGood job taking out the caster first Mirnaia, you could have also used the door as a choke-point as well after that.<br/>\nYour IKD's were also (mostly) successfully executed, the camera doesn't help much and all this tileset clipping but you did the best that you could given the circumstances.<br/>\nThe build will truly come alive when you get your hands on a pair of sweet Monk's gloves though, and I'll wait to see the results of that ;)\n</div></blockquote>\n<em>*Softly weeps*</em> Into MTS without Hin Fist 5 mittens <em>*Blows nose*</em> Perfectly attainable in the OC <em>*Gentle wail*</em><br/>\n<br/>\nHey, though, like I said before, the build should be challenged, and Mirnaia is doing a brilliant job. I would promise eternal goulash, but fear I would be unable to do the dish justice, so how about unlimited full English breakfasts - possibly our only true gift to the culinary arts over the centuries?<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:27 AM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\n<blockquote><div><cite>Valerfor wrote:</cite>\nGood job taking out the caster first Mirnaia, you could have also used the door as a choke-point as well after that.<br/>\nYour IKD's were also (mostly) successfully executed, the camera doesn't help much and all this tileset clipping but you did the best that you could given the circumstances.<br/>\nThe build will truly come alive when you get your hands on a pair of sweet Monk's gloves though, and I'll wait to see the results of that ;)\n</div></blockquote>\n<em>*Softly weeps*</em> Into MTS without Hin Fist 5 mittens <em>*Blows nose*</em> Perfectly attainable in the OC <em>*Gentle wail*</em><br/>\n<br/>\nHey, though, like I said before, the build should be challenged, and Mirnaia is doing a brilliant job. I would promise eternal goulash, but fear I would be unable to do the dish justice, so how about unlimited full English breakfasts - possibly our only true gift to the culinary arts over the centuries?<br/>\n<br/>\nCheers\n</div></blockquote>\nGoulash?<br/>\nWho are you, Sean Connery?<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/GpR43y7JUXI\" style=\"background:url(https://i.ytimg.com/vi/GpR43y7JUXI/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "12:34 AM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I took your advice and decided to clear up to Khor's base before going into the lab.<br/>\n<br/>\nKhor's Peak, Base: Fire Giants are slightly more dangerous than Frost Giants, but with the cloak, it's a lot safer. Being able to knock giants off their feet is nice.<br/>\nI owed Lord Krieger a visit long overdue (actually, he'd have wiped the floor with me before.) I was a bit concerned, since he's a Blackguard, but it turned out he only has a Will save of 14, and was thus the first victim of Shadow Daze. Or, he would have, if I could do enough damage to kill him in five rounds. Thus, it became a healfest from both sides. He drops a Nymph Cloak +6 and he's high level, how come his Will is only 14?<br/>\n<br/>\nThe Minions of Khor in town drop a \"Citidal Key\", with which you enter the \"Citidel of Khorinmagh.\" I went to town on the Minions and Champions, the area boss must have been a low level caster since I could resist his spells and his Elemental Shield was mostly negated by the Ring of Power. He drops a +5 robe with Flame Lash on getting hit and some fire soak, I put it on instead of the other +5 robe.<br/>\nThere was an Exiled Efreeti Lord who is KD immune and the only damage I could do to him was the 2/attack from the sonic damage on the gloves. Crits showed he has 15/? reduction (my gloves are only +3.) He still went down easily, even though I started the fight with half health and he had some support. He only drops a Ruby, which aren't worth keeping even if you know about the related MTS2 mechanic.<br/>\nThe Knights of Khor have true seeing for some reason, but they're pushovers.<br/>\n<br/>\n\"Citidel\" of Fire: Going in from the gate at the CoK immediately puts you into a massive fight with true seers, including Commander Vesuvia and Commander Neroon, who immediately handed mine to me. That happened two more times until I realised I have to buff up and then run past them to the corridor. Vesuvia is by far the more dangerous of the two, some kind of BG/WM, and has DR. Neroon drops a helm with Fear&amp;KD immunity and True Seeing. The overpoweredfulness of the module begins.<br/>\nBy now I can just hack at Templar packs without any micro and barely lose anything.<br/>\nSome other miniboss who was surrounded by Templar but could be KD'd, and thus, SNIPPEN (snipe, snope, snippen), got me to level 21! Off to the epics we go, with EWF: Unarmed. Even though this level gave me +3 AB, I'm still hurting for AB anc AC, but that's what you get for not playing a cleric ;)<br/>\nMost of the boss weapon drops have AB and separate elemental damage. The designer either had something wonky in mind or didn't know the difference between AB and Enhancement Bonus.<br/>\nGeneral Nova, the fire elemental boss who does a Meteor Swarm on hit, was a joke.<br/>\nUp came the two dragon bosses, Lord Smoke and Lord Ash, and down they went to IKD. Grow larger next time!<br/>\nCome to think of it, this area might have the highest boss density in all of MTS.<br/>\nOne of the advantages of being Dex-based with HiPS that you can hide and shoot if you really don't want to get up close. This was helpful with the boss I came here for, Grand Marshal Terethoxule (the efreeti boss you mentioned), since he's flanked by two Exiled Efreeti Lords, who take a lot less time to kill with ice arrows. The Marshal has a DC31 Quivering Palm, which killed me the first time. Reload, more careful, shot him to death. Drops gloves with, again, +5 AB (not EB) and d10 fire. He also drops +4 monk/SD robes with Freedom and Haste… it continues.<br/>\n<br/>\nVolcanic Shaft: Since I was here, I thought I would pay the twin dragons Chaar and Singe a visit. IKD.<br/>\nThe Ashen Renders here were super annoying with their acid breath with very high ranged touch AB, and I was too lazy to go back and get an amulet of acid resistance from the Artificer, but I dodged and weaved my way through.<br/>\nWhen you really don't want to be counterattacked, you can KD on the first flurry, and hide right as you deliver the third, then repeat.<br/>\n<br/>\nI'll exit through the Fire Giant Citadel, and I'll then have everything cleared to the West except for Khorinmagh himself.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:17 AM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah, paprika like I. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:20 AM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>\n<blockquote><div><cite>Stagmeister wrote:</cite>\n<blockquote><div><cite>Valerfor wrote:</cite>\nGood job taking out the caster first Mirnaia, you could have also used the door as a choke-point as well after that.<br/>\nYour IKD's were also (mostly) successfully executed, the camera doesn't help much and all this tileset clipping but you did the best that you could given the circumstances.<br/>\nThe build will truly come alive when you get your hands on a pair of sweet Monk's gloves though, and I'll wait to see the results of that ;)\n</div></blockquote>\n<em>*Softly weeps*</em> Into MTS without Hin Fist 5 mittens <em>*Blows nose*</em> Perfectly attainable in the OC <em>*Gentle wail*</em><br/>\n<br/>\nHey, though, like I said before, the build should be challenged, and Mirnaia is doing a brilliant job. I would promise eternal goulash, but fear I would be unable to do the dish justice, so how about unlimited full English breakfasts - possibly our only true gift to the culinary arts over the centuries?<br/>\n<br/>\nCheers\n</div></blockquote>\nGoulash?<br/>\nWho are you, Sean Connery?<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/GpR43y7JUXI\" style=\"background:url(https://i.ytimg.com/vi/GpR43y7JUXI/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span>\n</div></blockquote>\nSo how is it that I can view this video, then? I'm going into proper grunt mode now: \"Me no unnerstan...\"<br/>\n<br/>\n(But there's a massive part of me that just wants to reply, \"Yesh, Sean Connery I am.\")<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:38 AM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You just click on the \"Play Button\" in the frame or alternatively click on the \"white letters\" to take you into YouTube.<br/>\nIf you do not see these options then something is that you missing from your browser (perhaps you need to install the latest Javascript) or you have installed accidentally something that blocks it like \"AdBlock\".<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:55 AM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Valerfor, but that's exactly the problem. There was a nice big fat play button arrow in this clip, which worked fine. You may well have hit the nail on the head as far as Java is concerned. Apparently since last September Firefox no longer supports Java NPAPI, so updating has been interesting at best. But we'll get things sorted somehow.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:22 AM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The MTS modules do indeed have a lot of weapons with AB rather than EB, which is annoying, but gloves can never have EB anyway.<br/>\n<br/>\nI am using Firefox, and I had no problem watching that video.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "10:08 AM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Valerfor, how do you embed a video? I tried a few approaches and they didn't work. Maybe Stag'll be able to view it that way.<br/>\n<br/>\nYeah, I forgot that gloves don't have EB normally. But EB on proper weapons is also scarce until the second part. I believe it's intentional, because the mods on the weapon are never superfluous, it's just a strange design choice.<br/>\n<br/>\nI'm positive that when I get a collection of good gloves, or can actually put that fire damage to use, things will be a lot faster. I do enjoy this playthrough (and I didn't remember you can get +5 gloves in the OC, whoopsie), there are many things I didn't even know about this module until I started playing with this toon. The lack of innate Str will eventually make much less of a difference when I get to cap it at 26. It's still isn't terribly slow, and the dreaded (makes you sleepy) Mithril Golems have no bludgeoning DR. With high Dex, HiPS and IKD there are very few situations you can't handle, even if they are more challenging because I can't yet burst things down. The Daughter of Zael + 2 Servitors of Zael + 4 Elder Thunder Elemental packs in Zael's Lab will be… interesting, though.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:00 PM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mirnaia wrote:</cite>\nlevel 21! Off to the epics we go, with EWF: Unarmed. Even though this level gave me +3 AB,<br/>\n</div></blockquote>\nAt first I thought that was odd, but then remembered that level 21 is Monk 13, so fists become +2 weapons innately (+1 at Monk 10, +3 at Monk 16), so that explains the +3 AB<br/>\n<br/>\nCheers<br/>\n<br/>\n<em><strong>EDIT</strong></em>: Iirc, BAB increases on even levels in epic, so that means you'll get a nice +3 to AB at Monk 16 (level 24) - +1BAB, +1AB from 2 Dex bumps, +1AB from Ki Strike 3 - as well as hitting with d20 fists.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:37 PM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ki Strike doesn't increase your AB or damage.  It just increases what level of DR you can bypass, so Ki Strike +2 lets you bypass /+2 DR as if you were using a +2 weapon.<br/>\n<br/>\nAt level 21, he gets +2 AB from EWF.  I don't know where is getting the 3rd AB.  Maybe he is mistaken about the +3 AB.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "7:42 PM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I probably overlooked something, should be +2 AB.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:57 PM - Feb 21, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Mea culpa - apologies to all. Empyre is unsurprisingly right Not only that, but I should have realised anyway when first putting the build together that my AB calculation would have been wonky - which it's not, btw - because I'd have popped on another +3AB if what I said above was right. Trying to work out the answer to a problem by simply making stuff up is a dubious way to proceed, it appears. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:48 AM - Feb 22, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mirnaia wrote:</cite>\nValerfor, how do you embed a video?</div></blockquote>\nI just copy &amp; paste the URL directly to the message &amp; that works fine.<br/>\nI use Firefox as well.<br/>\nI'm open to other ideas that might work...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:17 AM - Feb 22, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote:</cite>\nAt level 21, he gets +2 AB from EWF.  I don't know where is getting the 3rd AB.  Maybe he is mistaken about the +3 AB.\n</div></blockquote>\nUnless I'm wrong in my remembering, and BAB in epic levels bumps on odd ones rather than even ones?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:42 AM - Feb 22, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">BAB =&gt; Odd levels<br/>\nSaving Throws =&gt; Even levels<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:59 AM - Feb 22, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Valerfor - mystery of the extra AB solved!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "9:02 AM - Feb 22, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Wow, then my eyes didn't deceive me?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:50 AM - Feb 23, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">No, of course not! However, it does mean I was talking nonsense about Monk 16 at level 24. Yes, you'll still get d20 fists and Ki Strike 3, but it's only +1AB from the two Dex pumps. Still, could be worse, eh?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "1:01 PM - Feb 27, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Fire Giant Citadel: mostly harmless, without buffing potions. Commander Chevak drops a +5 AB +5 mighty bow with fire ammo, which I'll be keeping.<br/>\nLevel 22! +1 Tumble AC.<br/>\nRavenous chimeras can petrify you, I shot them down with my new bow. When they're isolated, KD, HiPS after the 3rd flurry.<br/>\nKruux, the boss, drops a crit immunity helmet. Please imagine my rant here about an item that grants you an ability you would otherwise spend 10 class levels on and which is the major reason to spend said levels. You also get it so early.<br/>\n<br/>\nKhorinmagh's Lair: Khor has devcrit, but now I have the helm. He's with Lord Regent Herzog (cleric) and Deneral Deathnote (bard). I managed the pull the lord regent separately, from the other two which doesn't usually happen, and he got a lot of heals off (spells, not potions) even when I was KD'ing perfectly, and my initiative must have been superior. By the way, the shield he drops has immunities to death magic, fear, level/ability drain and mind-affecting spells… I think I'll stop commenting on the items, we all know the deal.<br/>\nDeathnote doesn't have curse song for some reason, I had to drink potions + defensive stance to get a semi-decent AC (46) so I could win.<br/>\nI needed to use 3 heal potiions on Khor, and I had no way of interrupting him, he's mind effect immune, KD immune and too large to KD anyway, and is of course a true seer. He didn't try to heal himself in phase 2, don't all red dragons have heal?<br/>\nOh, I had better results using the +5 fire gloves on Khor than the +3 sonic ones, because I guess he has +4/x or +5/x soak.<br/>\nAnyway, everything to the west of Twin Summit has been cleared! The meaningful loot from this adventure completely filled 10 bags.<br/>\nNext up: sewers and Zael.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:55 PM - Feb 27, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Many thanks for the update, Mirnaia!<br/>\n<br/>\nI've generally been able to pull away Herzog and Deneral separately by going behind the pillars obscuring them - going bottom left for H and bottom right for D. This leaves Khor on his own, which is hugely preferable! Strangely, at times I've found it harder to deal with Kohr in his human (or half-orc, I forget) form than when he goes draconic.<br/>\n<br/>\nI hear you about the crit-immune hat, but normally when I've been into MTS I've come from the OC and thus have the similarly OP Golden Circlet (mind-effect immunity), so...<br/>\n<br/>\nI look forward (with some trepidation) how you fare against the Raks. There's just so many of the magic-spamming bastards (and iirc they have true seeing) that it's bound to be tougher with a dex build.<br/>\n<br/>\nI usually end up finishing MTS1 at around level 24, but maybe, with two 3/4 BAB classes in the build you might make 25. I certainly hope you reach 24 before reaching the pair of risen dragons - 'cos they is naaasty!<br/>\n<br/>\nAs far as the build goes, it looks like AC is the biggest issue atm. At least when you get to level 23 (Monk 15) you'll get another 10% to speed and +1AC, which might help.<br/>\n<br/>\nCongratulations on binning Kohr, though!<br/>\n<br/>\nCheers <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:21 PM - Feb 27, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Mirnaia, I have been enjoying your storytelling.  You spin a good yarn.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:30 PM - Feb 27, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've just been able to watch your Frosty vid, Mirnaia - thoroughly enjoyed it! That's the difference HiPS makes, eh? Never played a char with it outside Aielund. Handy to be able to ignore the spiders, yes? Poison immunity never hurts. Always good to see and learn from others' tactics (though I absolutely agree with going in and splatting the caster first). And I never tire of seeing a dwarf at full speed!<br/>\n<br/>\nDon't know whether you changed the video's settings, or whether my updating Flash made it all happen for me, but whatever it was - hoorah!<br/>\n<br/>\nCheers - and thanks for your continued efforts!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:56 AM - Feb 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I've just been going over the build stats again (I know, sad, isn't it), and realized I'd forgotten to include the +1 to AC that comes with SD5 (along with Defensive Roll and 5/+1 DR - which of course will be consumed when Monk 20 is reached at level 30). That means the original naked AC should be 38, and Mirnaia's tweaked build should have an AC of 39.<br/>\n<br/>\nEvery little helps!<br/>\n<br/>\nCheers<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Given that AC seemed to be the main area of concern (so far), it might look odd that I take Epic Prowess (30) before Armor Skin (35). However, EP is taken as a general feat because it's unavailable as a Monk bonus feat, while AS is. It's not just me being perverse.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "6:35 PM - Feb 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thank you, Empyre, your compliment felt really good. I'm basically taking notes as I play (more for documentation than for entertainment), I'm glad you're enjoying it.<br/>\n<br/>\nStag, I'm happy to see I'll have even more AC. Also, even without the technical constraints I'd take EP before AS in a Dex build, especially with Monk where you have both Dex and Wis to rely on and not much in the way of boosting AB.<br/>\nA dwarf monk is indeed fun to watch. My very first NWN character was a half-orc monk called Jasmine Rocketfist (with large body phenotype), I sorely missed the screen shake when running around :)<br/>\n<br/>\nOne thing I forgot to mention in the last update was that I handed in the four vials of dragon blood, not that it does anything for me. You can't get gloves (understandable) and you can't get a kama (why? they do make sickles and scythes.) Anyway, the weapon you get is nothing crazy good.<br/>\n<br/>\n-- The Drain And The Pussycat --<br/>\n<br/>\nSewers, level 2: I remembered to buy back the acid resistance ring I sold to Uther Dartmouth (20/- acid soak + some other properties). We'll… need it much later. I also kept my true seeing helm, hotkeyed so I can put it on quickly instead of the crit immunity one, as we'll need that one too in the same place. We have the Signet of Zael (100% electricity soak.)<br/>\nI was jumped by Umber Hulks right as I went down to level 2, unstealthed. They were a already a joke at level 16. This is followed by more Sludge Crawlers. Finally, my fire gloves are doing their fire damage, which is almost double damage (d12+2 physical and d10 fire). I'm constantly improved evading their DC20 breath weapons with 24 Reflex. Snapjaw, Umber Hulk boss, nothing to write home about, he drops a +4 Wis amulet, but +4 Dex and mind spell immunity from the OC pendant is better.<br/>\nBattle devourers, they have a bit of soak for almost everything, but are still hopelessly outclassed.<br/>\nNext up is The Maw of Decay, the sludge crawler boss, awesome name, spends the entire fight on its back, and takes extra damage from fire. I also used Shadow Daze, just for the fun of it. Found out its Will save is a whopping 3.<br/>\nRIP Mindwarp, battle devourer boss, you weren't designed for a level 22 character. It drops a Dominate Monster 1/day item (its hide), which I could have used on the Maw to have fun, but alas, you can't have everything. Yes, anyone can use it.<br/>\n<br/>\nRuins of Mordre Khan: First of all, did he name his city after himself? Welcome to Rakland! We're going in with 24 Reflex and improved evasion, 24 SR, and a bunch of elemental soak. I'm basically out of buffing potions, but Raks dispel anyway, and they're found in huge packs. First pack type (serfs, concubines, courtesans, and one knight): they buff up with Mage Armour and Ghostly Visage (sic!), then try and beat me up. Tony K says they can't hope to beat my SR. Default Toolset Rakshasas have a caster level of 7, who'd have a 20% chance to beat my SR. In any case, they die in about two flurries each, sometimes one, if I get a good crit in, since I do a very wide range of damage. Stag, your worries may have been unfounded. I even tried backing up to see if they'd fireball me, they didn't.<br/>\nI collect 10 of their eyes to make decorative jewelry.<br/>\nInside the first main building, the Rak Lord fares no better.<br/>\nLady Otavia is the first boss (in the deep pit), KD, dies in four flurries.<br/>\nThere's a Wisp boss called The Death Lantern, who, for some reason, can be knocked down.<br/>\nI clear the other building, too, where the teleporter to Zael's Lab is, and hit level 23! More speed, and Quivering Palm (DC 18) which is not too useful.<br/>\nBecause the Raks didn't cast against me and because they couldn't really overcome my 15/- bashing/piercing/slashing soak from the Moss Covered Cloak (+crit immunity!), and they have very little HP, this level was by far the easiest so far.<br/>\n<br/>\nI went back to Adrea because I forgot what the reward for her quest is, but she'd only say that I bested Khor and need to kill her mother (Zael). She wouldn't initiate dialogue with me, so I couldn't hand in the eyes. I'll check back later once Zael is dead.<br/>\n<br/>\nThe Lair of Mordre Khan: Balors drop to their knees and die. By the way, do you know about the Balor on-death explosion bug? It has the spell penetration of the last spell they cast, but if the last spell was Summon Tanar'ri, the resist is automatic, if they go down without casting a spell, resisting it is impossible. <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Balor\" rel=\"noreferrer\" target=\"_blank\">More details </a>here. You can also evade it.<br/>\n<br/>\nLife drew me away, to be continued.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:35 PM - Feb 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mirnaia wrote:</cite>\n1. Stag, I'm happy to see I'll have even more AC. Also, even without the technical constraints I'd take EP before AS in a Dex build, especially with Monk where you have both Dex and Wis to rely on and not much in the way of boosting AB.<br/>\n<br/>\n2. One thing I forgot to mention in the last update was that I handed in the four vials of dragon blood, not that it does anything for me. You can't get gloves (understandable) and you can't get a kama (why? they do make sickles and scythes.) Anyway, the weapon you get is nothing crazy good.<br/>\n<br/>\n-- The Drain And The Pussycat --<br/>\n<br/>\n3. Sewers, level 2: I remembered to buy back the acid resistance ring I sold to Uther Dartmouth (20/- acid soak + some other properties). We'll… need it much later. I also kept my true seeing helm, hotkeyed so I can put it on quickly instead of the crit immunity one, as we'll need that one too in the same place. We have the Signet of Zael (100% electricity soak.)<br/>\n<br/>\n4. Next up is The Maw of Decay, the sludge crawler boss, awesome name, spends the entire fight on its back, and takes extra damage from fire. I also used Shadow Daze, just for the fun of it. Found out its Will save is a whopping 3.<br/>\n<br/>\n5. Ruins of Mordre Khan: First of all, did he name his city after himself? Welcome to Rakland! We're going in with 24 Reflex and improved evasion, 24 SR, and a bunch of elemental soak. I'm basically out of buffing potions, but Raks dispel anyway, and they're found in huge packs. First pack type (serfs, concubines, courtesans, and one knight): they buff up with Mage Armour and Ghostly Visage (sic!), then try and beat me up. Tony K says they can't hope to beat my SR. Default Toolset Rakshasas have a caster level of 7, who'd have a 20% chance to beat my SR. In any case, they die in about two flurries each, sometimes one, if I get a good crit in, since I do a very wide range of damage. Stag, your worries may have been unfounded. I even tried backing up to see if they'd fireball me, they didn't.<br/>\n<br/>\n6. I collect 10 of their eyes to make decorative jewelry.<br/>\n<br/>\n7. Because the Raks didn't cast against me and because they couldn't really overcome my 15/- bashing/piercing/slashing soak from the Moss Covered Cloak (+crit immunity!), and they have very little HP, this level was by far the easiest so far.<br/>\n<br/>\n8. I went back to Adrea because I forgot what the reward for her quest is, but she'd only say that I bested Khor and need to kill her mother (Zael). She wouldn't initiate dialogue with me, so I couldn't hand in the eyes. I'll check back later once Zael is dead.<br/>\n<br/>\n9. The Lair of Mordre Khan: Balors drop to their knees and die. By the way, do you know about the Balor on-death explosion bug? It has the spell penetration of the last spell they cast, but if the last spell was Summon Tanar'ri, the resist is automatic, if they go down without casting a spell, resisting it is impossible. <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Balor\" rel=\"noreferrer\" target=\"_blank\">More details </a>here. You can also evade it.\n</div></blockquote>\nHope you don't mind me editing your post for ease of responses!<br/>\n<br/>\nOnce again, huge thanks for what you're doing here - above and beyond the call...<br/>\n<br/>\n1. Pleased to hear it. I've usually been an AS first EP second type, but what you say makes absolute sense. And the (effective) immunity to sneaks helps with keeping the AC up anyway. I'll confess, one of the reasons I went for the CON rather than WIS bump at chargen was knowing that Dex wasn't going to be screwed by sneaks after level 17.<br/>\n<br/>\n2. I know you won't be strapped for cash atm, but you can always sell the beastie. As for kamas, iirc the part 1 boss (forgotten his name) drops a couple of good ones at the end. (When you decided to go for testing in MTS I was half-tempted to suggest going for a single kama over fist (more for the one you get from the Travelling God in part 2 than anything), but then remembered the ludicrously op gloves you start accumulating - and the damage output - so didn't.<br/>\n<br/>\n3. I'm sure you'll remember to keep hold of 2 copies of Zael's signet, 'cos one gets used up, and it's never wrong to be able to grab 100% immunity to electricity.<br/>\n<br/>\n4. Good to know about Shadow Daze, thanks.<br/>\n<br/>\n5 and 7. If he did name it after himself, it was a weird decision to call it \"Ruins of\" rather than \"City of\". Didn't exactly bode well, did it? I'm really pleased this bit went so well. I know I shouldn't worry, but it's hard when you've not taken your own build beyond the drawing board, and I wouldn't want it to be crap for you.<br/>\n<br/>\n6 and 8. Didn't Adrea give you the full story after you got accepted into the Fox Society? Iirc, that's when she tells you about the necklace and the Rak eyes. As far as I know, you can hand in the eyes at any time after then until you've killed both dragons, when you can't do anything except the main quest - no selling, buying or redeeming other quest rewards from anyone.<br/>\n<br/>\n9. Didn't know about that re the Balors - thanks.<br/>\n<br/>\nAgain, many thanks for all you're doing.<br/>\n<br/>\nCheers <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "11:38 PM - Feb 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Lair of Mordre Khan: Exactly as challenging as the level above it, including the fight against Mordre Khan.<br/>\n<br/>\nZaelenthiirym's Laboratory: The largest single area in the entire series. The way I usually do this is that I run a lap around the outer rooms, then the inner rooms, and then the middle area.<br/>\n\"Thunder Packs\": There's eight of them in the outer rooms. 4 Elder Thunder Elementals, 2 Servitors of Zael, 1 Daughter of Zael. They go relatively painlessly (they can spot you), knocking the Daughter down, then taking out the Servitors, losing about half my health (but the casters drop CCW potions). I was expecting worse. The Servitors do get their Stoneskin up, which does exactly nothing against a +5 weapon. The true seeing helm helps a lot, then switch it mid-combat once the casters are down.<br/>\n<br/>\nA detour to the Tower of Thunder: this place is filled with sorceresses, who are a joke with the normal AI script, and bloody dangerous with Tony K's AI. This is why I wanted to have the acid resistance ring with me. Turns out it was trivial with the amount of SR I had, I only had to watch out for the few Servitors who were there.<br/>\nLevel 24 after the last pack, d20 fist damage!<br/>\n<br/>\nInner lap: Grand Sorceress Sylvia died in a single round, followed by the rest of the casters in the room. <br/>\nHigh Alchemist Morgan: immune to KD, starts with Storm of Vengeance. Turns into a blue dragon for phase 2, which CAN be knocked down. I mostly evade the Storm ticks, only taking moderate Acid damage, while it kills the Battle Horrors around the boss. In one of the rooms opened by a boss key, I get a restock of Cat's, Bull's, and Owl's, but I haven't really been using them for a while.<br/>\nI enter one of the boss rooms and completely miss the presence of Loremaster Celestria, who also turns into a blue dragon upon death. The aura ticks and hits from the four different kinds of elder elementals make me pay the price in the form of 2 heal potions.<br/>\nShin the Despised: he can hit me reliably when not knocked down, but I can HiPS away from him and the other samurai, who drop heal potions. All in all, the lab has been a rather chill experience.<br/>\nMiddle room: I stalk around the edges, knocking mithril golems over the head, before engaging the rest. I shoot at a servitor which somehow pulls Zael to me, both phases go smoothly with plenty of knockdowns.<br/>\nLevel 25! I have plenty of Lore now, which can come in handy in the transition from MTS1 to the early parts of MTS2. I also get Shadow Evade. The only thing worth mentioning about it is the +1 dodge AC, but it's only for 5 rounds and can be dispelled (well, since caster level = character level here, only Morded.)<br/>\nFor the real Zael fight, the dragon form, which becomes a red dragon somehow, petrified me on the first attempt. Next, I killed the 4 thunder elementals before Zael, which I don't normally do, but Zael doesn't cast in her celestial form, and I thought reducing the clutter was desirable. KD'ing is a lot easier when there aren't several godzillion other enemies around, and the second try went smoothly. There is no shortcut from her sanctum, you have to leg it to town through the Tower of Thunder teleporter.<br/>\n<br/>\nBack in town, Adrea has no dialogue for the Rak eyes, I guess you must do it before killing either of the dragons. I dropped all 10 eyes in front of her to drive the point across, maybe she'll have a bad conscience about the affair.<br/>\nHere's something I never knew: if you take Monk at level 1, you get access to the store at the Order of the Mithril Hand. They sell standard OC monk stuff, and a few original items, such as a +5 robe only wearable by elves that grants Darkvision and immunity to the spell Fear (not fear immunity.) Nothing to write home about, really.<br/>\n<br/>\nGetting ready for the endgame of Act 1. Since Vestivius has been dead since the beginning of the campaign, I'll be turning the heads in to Rutger. We're level 25, hasted, 39 AB, 39 AC - I can knock myself out easily! -, have freedom, and are immune to crit, fear, KD, mind spells, death magic, soak 15 physical, 15 of fire/electrical/cold. These are the unbuffed stats. We'll definitely need higher AC for the penultimate fight, but there are several ways to boost it. Damage is all right, can be boosted with a Fire Giant belt in exchange for death magic immunity, level 27 would be really welcome for Epic Dodge. But normally, I get to level 27 before said fight when starting the campaign at level 17, so that's not going to happen in all probability. There are no grinding spots that I'm aware of. I guess I could exterminate the town, but I'm not going to do that with this character. And it wouldn't amount to much either.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "11:45 PM - Feb 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>0. Hope you don't mind me editing your post for ease of responses!<br/>\n<br/>\nOnce again, huge thanks for what you're doing here - above and beyond the call...<br/>\n<br/>\n1. Pleased to hear it. I've usually been an AS first EP second type, but what you say makes absolute sense. And the (effective) immunity to sneaks helps with keeping the AC up anyway. I'll confess, one of the reasons I went for the CON rather than WIS bump at chargen was knowing that Dex wasn't going to be screwed by sneaks after level 17.<br/>\n<br/>\n2. I know you won't be strapped for cash atm, but you can always sell the beastie. As for kamas, iirc the part 1 boss (forgotten his name) drops a couple of good ones at the end. (When you decided to go for testing in MTS I was half-tempted to suggest going for a single kama over fist (more for the one you get from the Travelling God in part 2 than anything), but then remembered the ludicrously op gloves you start accumulating - and the damage output - so didn't.<br/>\n<br/>\n3. I'm sure you'll remember to keep hold of 2 copies of Zael's signet, 'cos one gets used up, and it's never wrong to be able to grab 100% immunity to electricity.<br/>\n<br/>\n<br/>\n6 and 8. Didn't Adrea give you the full story after you got accepted into the Fox Society? Iirc, that's when she tells you about the necklace and the Rak eyes. As far as I know, you can hand in the eyes at any time after then until you've killed both dragons, when you can't do anything except the main quest - no selling, buying or redeeming other quest rewards from anyone.\n</div></blockquote>\n0. No problem whatsoever.<br/>\n2. Yeah, the good kama drops from the final boss in MTS1. MTS2 has an insane kama accessible very early. Part of the reason I suggested MTS was that I recall there are really good gloves later on.<br/>\n3. I of course didn't remember, but for some reason I still have the ring.<br/>\n6. I have the quest from Adrea, I guess you can't kill either of the dragons before turning it in (before this, I always went sewers -&gt; Zael -&gt; Khor.)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:27 AM - Mar 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Brilliant, Mirnaia!<br/>\n<br/>\nWith Zael's lab, again interesting as to how others' play, because I tend to do it in quarters (all the northeast, then all the northwest, then the southwest, then the southeast - picking off the central golems as I go a pair at a time). Admittedly, you do end up sighing, \"Oh, it's this lot again,\" but it doesn't seem to alert Zael and her girls. Shin has always disappointed as a foe, but I ain't going to complain too much.<br/>\n<br/>\nYeah - proper hurty fists! Woo-hoo!<br/>\n<br/>\nHow the hell did Zael become a red dragon? She's a blue, isn't she?<br/>\n<br/>\nI suspect you may be right about Adrea's Boon, which is a shame. But what's the betting she's still on guard and friendly outside her dad's place in part 2?<br/>\n<br/>\nAfter the Rutger \"incident\", remember you can still go back to the market area and reap more xp from undead folk before going to the old mines - though I could only have hoped you'd reach level 25, and you may yet reach 26 before part 2. But then, you're clearly more used to high 20s levels, while I normally play more full BAB so end up at 24.<br/>\n<br/>\nOh, and the Zael signet - in part 2 (I think) and part 3 it's a mahussive help when cloud-surfing!<br/>\n<br/>\nAll still good - and I'm feeling happier about the build now.<br/>\n<br/>\nCheers<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Sorry, meant to mention that yes, I knew about the monk store, but was rightly talked out of purchases there by Valerfor on my first run-through, given what I was bringing with me from the OC. Then there's all that, \"Bring me the head of Shin the Defiler,\" nonsense. I confess, at one point they annoyed me so much I killed the lot of 'em, but it wasn't worth it. Ooh, but you've got loads of Lore, so you might find the grandmaster's gear is kewl. After I'd killed them, no one would trade with me, so I have no idea. I'm guessing you may have to go eeevil, though...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:01 AM - Mar 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">At Shadowdancer 4, you get <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Shadow_evade\" rel=\"noreferrer\" target=\"_blank\">Shadow Evade</a>, which gives you +1 AC for 5 rounds, 3 times a day.  I guess that is the +1 AC that Stag was talking about.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:12 AM - Mar 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote:</cite>\nAt Shadowdancer 4, you get <a class=\"postlink\" href=\"https://nwn.fandom.com/wiki/Shadow_evade\" rel=\"noreferrer\" target=\"_blank\">Shadow Evade</a>, which gives you +1 AC for 5 rounds, 3 times a day.  I guess that is the +1 AC that Stag was talking about.\n</div></blockquote>\n\nThanks, Empyre, you're right. But balls - I misinterpreted the wiki and thought it was an eternal AC pump, sorry Mirnaia, as you were!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "2:17 AM - Mar 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I began the endgame by going to Rutger's house and then to the barracks, where he is not, as opposed to the town hall, where he is. I managed to get the last hit on the fake Rutger for 1950 xp and proceeded to clear the town of minions. Risen Monks, who were somewhat troublesome in the beginning, evaporate in a couple of flurries. Adrea still knew nothing about Rakshasas, but sent me off to the final areas of the first campaign. Uther will still trade with you, but he's the only one.<br/>\n<br/>\nAbandoned Mine (this is the area outside town): It starts with Minotaur packs! Oh, how we've come full circle.<br/>\nAbandoned Mine Crypt: Jumping down the well is the absolute point of no return… forever, and is the last you'll see of the Prime Material Plane in the series. The Lord of the Pit at the end has a huge HP pool, but I manage to keep him down for most of the fight, even with all the Risen Monks and Masters around.<br/>\n<br/>\nRuins of the Silver City: the Iron Wind Servants can drain Con, but nothing a lesser restore won't fix. I clear the area and I will intentionally fail the questionings so I get to fight.<br/>\nLevel 26! Defensive roll.<br/>\nAt the tower there are four Lords of the Pit, with Improved Invisibility spells. Defensive stance makes just the difference that I can beat them up without having to heal. Even with blind fight, it's mildly annoying, but without it, it would be super annoying.<br/>\nCrypt of Sanguinius: this is where you have to fight, I believe. He's supported by two guardians, whom I take out first since they buff him up. Sanguinius has EW and Greater Ruin, but not much else. He's difficult to hit (&gt;50 AC) and hits hard. He also taunts, I hide until it wears off. He's not a true seer and can be KD'd. He drops +6 robes with death/fear/drain/sneak immunity with improved evasion and some other stuff.<br/>\nFor some reason, his area is considered comfortable, you only eat rations when you rest, and do not need a bedroll.<br/>\nCrypt of High Priestess Ellesandra Algalia: she's flanked by two dragons, Dawn and Dusk, and all of them are dangerous. I do my usual method: leg it back to the Ruins, hoping to split them up. Only the two dragons follow, I kill them in defensive stance. Back for 'Sandra, she's a very high level cleric, and turns into a dragon when killed, which is actually the less dangerous form.<br/>\nCrypt of General Jaen Za'ar: She hits very hard with a high AB, and casts Evard's, but failed her save against Shadow Daze (Will 17 vs. DC26).<br/>\nCrypt of King Leorian Kalatar: yet again two dragon adds, Photon and Nova. Yet again run out, Nova followed with his DC38 fire breath. I finished him off by kiting as he hit very very hard and often. Repeat, Photon dispatched the same way. The King has 43 AB and hits for about 40 (he has Sun's Grace, a 2d6 positive 2d6 divine greatsword) but can't see what can't be seen, so the good old hit and HiPS did the trick. He drops a +6 Str +6 Cha +death magic immunity belt to replace my old guiding light one with.<br/>\n<br/>\nAaaand… with that, level 27! Epic Dodge, here I come!<br/>\nI'm putting on a Ring of Prot +5 instead of the Ring of Power, and thus have an unbuffed AC of 46. Def stance will put it to 50, which should be enough against what's to come.<br/>\n<br/>\nTomb of the Kelsha'ra: here it comes! I can usually find a place where only one of them can attack me, but not this time, however, by the time I get Risen Khor to \"Near Death\", I still haven't taken any damage. Risen Zael is in the middle of a breath attack and thus luckily cannot heal Khor as he dies. Zael is out of breath attacks by the time I get her down, so she does heal up and up and up, but during the entire fight I took maybe 4 hits.<br/>\n<br/>\nAnd so we come to Maphaeldor, who has an insane HP pool, Greater Ruin, II and a few other things up his sleeve. His robes cast Energy Burst (1) on hit, which is always resisted. I need to run away to heal two times (and he has very monk speed too), but keep him down most of the time and win, end of MTS1!<br/>\n<br/>\nHe drops the Touch of the Iron Wind, a set of +7 gloves with WS:US, 2d10 negative energy and DC20 Con drain on-hit. His robes would kind of be an upgrade but I can't use them because alignment and no UMD. The amulet and belt are also rather insane, I eventually settle for not capping Dex yet in exchange for +10 Wis and some Str.<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201903/10758846_0a3ec5adf3346d437205c126fc0c45d9_t.png\" />\n</dl>\n</span><br/>\nStay tuned for MTS2: Hell in Hell.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:54 AM - Mar 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yee-and-indeed-hah! I'm delighted with what you've done so far, Mirnaia. Technically, I should offer tuts at slaughtering the good guardians, but not a chance if you're starting part 2 with ED already embedded. Phenomenal work!<br/>\n<br/>\nOkay, back to what passes for reality. If I'm honest, the only two sexy bits left are Monk 18 (level 28) and 20 (30). Both of which will happen relatively early in part 2 for you - having attained 12 levels in part 1, for goodness' sake! Thus, I hope you don't get bored with the build. And you've got those hundreds of dead spirits to go through, who both whine a lot and have buckets of DR, so I don't envy you that screen. But at least it's only the one.<br/>\n<br/>\nOh, and I should have said earlier, superb work with Risen Zael and Khor!<br/>\n<br/>\nDamn, you making this look like a decent build!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "1:38 PM - Mar 23, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Recommended soundtrack: <span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/BSsfjHCFosw?list=PLAD2502F2CB75CC90\" style=\"background:url(https://i.ytimg.com/vi/BSsfjHCFosw/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><br/>\n<br/>\nWe left off with Maphaeldor assassinated and we were sentenced to life in Hell. I quickly wrapped up the final scene of MTS1. I'd like to mention here that I love how Aielund seamlessly transitions between modules. Manually importing my character into MTS2, for some funny reason, makes me feel like I'm hacking the game, so to speak. I'm also always afraid that somehow this breaks continuity. The module also doesn't auto-export your character.<br/>\n<br/>\nSo, time to beat up some Abishai. By the way, NWN is badass with Doom music. My expectation is that things will become easier through this module, can't go wrong with a dexer in MTS. Abishai die in 2, sometimes 3 flurries.<br/>\nI now get to choose whether to go through more abishai (very easy) or the beholder caverns (very frustrating). Of course we're going into the beholder caves.<br/>\n<br/>\nYmygryl's Caverns - No way this could go wrong. I can not quite one-flurry-kill Beholders reliably, but I can sneak up on them or shoot them and HiPS. Sometimes I just take the 5% chance to get petrified because Beacon's a gambling man. Now there are these Hellchests lying all around (which I can lockpick btw) that have supplies in them plus random Ring of Prots, from +5 to I think +9, so I'm trying to get one of those. I'm still spamming \"G\", my shortcut for quicksave. But when there are like 3 of them in a long corridor I kite: two flurries, HiPS. Goes rather quickly, too. The really annoying thing about Beholders is that you of course can't knock them down. I took some beams while I took the boss down, but I got lucky.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:14 PM - Mar 23, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">At Doom's Gate is great, I also recommend this for Boss fights:<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/-qJMJgLEQJs\" style=\"background:url(https://i.ytimg.com/vi/-qJMJgLEQJs/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:04 AM - Mar 24, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">At Doom's Gate is great, but Hangarmageddon is even better (Doom music remix from OCRemix.com)<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/oQs48dvebck?list=PL2CF44A95DAD5EA96\" style=\"background:url(https://i.ytimg.com/vi/oQs48dvebck/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "2:00 PM - Mar 24, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">MTS2: The sound of one hand pwning.<br/>\n<br/>\nI decide to play very zoomed-in inside the beholder caves, and that makes playing the game (especially with the Doom music Empyre's linked) super engaging. (Could this be the reason (besides the way they portray sexuality) why I prefer Mass Effect to Dragon Age?)<br/>\nSo I play the third level of the caves commando style, and let me say that even with MTS gear it's remarkable for a build to be able to safely take out groups of beholders and do so with several options at your disposal. I liked that, even though beholders always mean slow (but action-packed) going. Against isolated beholders I can hit from stealth, most probably win the initiative and disengage then hide immediately without the beams going off. Mind you, more often than not, they are dead *immediately* from the first flurry, but that's partly due to MTS gear (2d10 negative gloves, 20 permanent Str on a Dexer, WS from gear(!).) It sounds slow, doesn't it? Then I realise I kill monsters on the 1st flurry of the 2nd round of combat, which is pretty OK. And I make it through all 3 levels without getting stoned a single time. Beacon makes it through all 3 levels without getting stoned a single time. The best prot ring I find is +7. And I exit to THAT zone.<br/>\n<br/>\nStygian Marches, Eastern Wastes is probably the one zone with the most monsters in the game. It is huge and it has insane monster density. I just stand around and let the Hamatulas (the demons who summon skeletons) litter the floor around me. The Ancient Damned take about 5 flurries, and there are a ton of them. Looks like I vastly underestimated Epic Dodge. I thought that when surrounded, hits would still very likely slip through. But I've now killed about 30 while constantly surrounded, and have not yet taken a hit (I have 0 regen currently). That's with no concealment. Update: something hit me for 1. I'm fighting the undead with negative energy damage and constitution drain. It's also an example of when Def stance does not give you much: the +4 AC is useless here, since you're only fighting 20's.<br/>\n<br/>\nBeacon, Truesilver's hand on the dance floor! <span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/ZIC2W-p3i10\" style=\"background:url(https://i.ytimg.com/vi/ZIC2W-p3i10/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:49 PM - Mar 27, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">All good stuff, Mirnaia. Afraid I've been out of action of late (bloody real life), so will come back with proper comments as soon as I can (probably another couple of days) - and after I've had the chance to view the vids, of course. In the meantime, I'm delighted you didn't find those restless undead less tedious as I'd feared.<br/>\n<br/>\nKeep up the good work! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:16 PM - Mar 31, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, that video and music work <em>so</em> well together - and your editorial skills have really taken off! Superb work, Mirnaia. I will confess that some of my own favourite music tracks (for other scenes, of course) are from both HotU - particularly the Lith Mayar track when waiting for the horde to arrive - and Aielund, specifically when in Fairloch. I appreciate that both are NwN tracks, and neither are axe-wielding giants (in whichever sense you choose to interpret \"axe\"), but they stir my blood anyway.<br/>\n<br/>\nI know I haven't yet given proper feedback, but I've only been home for a couple of hours, so hopefully tomorrow if that's okay?<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:21 PM - Apr 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Okay, had a sleep and a proper read of progress to date. Really pleased the build is doing what it's supposed to (so far), which is to not get hit while still being able to deliver relatively respectable damage - due in no small measure to your efforts, Mirnaia.<br/>\n<br/>\nAs I said before (I think), Defensive Stance isn't really the point of taking DwD here - even though it doesn't hurt to have it, particularly in those difficult teenage years - it's more for the AC retention against sneaks and flanking given by Defensive Awareness to mitigate the lack of Uncanny Dodge.<br/>\n<br/>\nAre you heading to the island before trashing those irritating Wasabi (or whatever they're called)? Those flailing tails on the dead ones can really mess you about when it comes to targeting your next opponent - the number of times I've accidentally broken combat to apparently loot a corpse for no good reason is ridiculous.<br/>\n<br/>\nThanks for all your efforts to date! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:59 PM - Apr 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think that Flurry of Blows might often be more beneficial than Defensive Stance.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "11:41 PM - Apr 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote:</cite>\nI think that Flurry of Blows might often be more beneficial than Defensive Stance.\n</div></blockquote>\nYeah, I use it by default, especially since it's unlimited, unless there is a reason not to.<br/>\n<br/>\nThere are a few Tiefling Trackers (BGs) in the Eastern Stygian Wastes who give a lot of xp and I hit level 28! That's Monk 18, which gives me 50% (I believe undispellable) concealment twice per rest for round/lvl. One of them drops reasonable monk gear, including a pair of backup gloves better than what I had, should something resist negative energy damage on weapons. Notably, negative energy on weapons does harm undead. 5 minutes later, I find the area boss, the Keeper of the Damned (a scyther) who does resist negative energy, so I'm happy to test the new d10 fire d10 negative gloves against it. I still have trouble hitting high AC, my AB is 42 when not flurrying. Since I can't hit him reliably and therefore can't keep him down, and he can heal himself fully, it's a very long and boring fight, even though I'm in no danger whatsoever. I try shadow daze, but of course he's immune to mind-affecting. He healed about 6 times and I couldn't interrupt it once. His robes are an upgrade, but don't have fear immunity. This will be a moot point in 2 levels when I hit monk 20, but I shuffle my helm around, losing crit immunity but staying immune to fear.<br/>\n<br/>\nI exit to the west, to the River Styx and beat up the abishai. As Stag noted, I don't know what the designer was thinking with their dead, wagging bodies. Into the Cult of the Bull cave, where the minotaurs have true seeing, because why the hell not (I currently have 87 hide and move silently with some silly +30 boots), not that it matters in the outcome. The whole sequence is rather uneventful, culminating with the Bull God fight and freeing Persephone.<br/>\n<br/>\nI finish the outside area, with gloves that can stun now and 5d6 sneak attack, so it goes even faster. A sneak crit hits for about 70, and the current challenge level is best described by the fact that I maxed STR before DEX. They're weak, die fast and I'm safe so I don't really bother with KD. Off we go to the island so I can finally sell my bagload.<br/>\n<br/>\nPhlegethos Frontier: I bind at the stone, summon Phio, talk to her and realise I forgot to pick up the main quest in the beginning :) Time to pay Shin a visit.<br/>\n<br/>\nMarduuk: Adrea, long time no see. Shin gives me his quest, and I remember to visit Master Zoral in his pit, but I need to do Shin's quest first before he'll give me his. Let's see if I remember then. There are healing vendors but I used maybe 5 CCW potions so far so I'm good.<br/>\n<br/>\nI go back to clear the main zones, that is, the river banks and the areas south of them, and the abishai caves I skipped because I went beholder hunting. I hit level 29 in Vorguloth's Outer Dominion. There is a statue there that I still can't figure out what to do with, even though this is my 3rd MTS playthrough. Does it do anything other than damage you? I can unlock it with a lockpick, with the same result afterwards. There are a few Lords of the Pit, which are very easy with my improved gear. I talk to the Avatar of the Wandering God and get my first ally in MTS3 :)<br/>\n<br/>\nNext, I'll go to the probably universally most hated area in MTS2, the Horror Wood.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:56 AM - Apr 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah!<br/>\n<br/>\nYes, Empty Body is indeed undispellable.<br/>\n<br/>\nThat Keeper of the Damned encounter seems to go one of two ways. It's either a drab slugfest as you've just experienced (sorry about that, but at least you were defensibly prepped) or easily Dev Critted - but this is not such a build.<br/>\n<br/>\nI still haven't managed anything but ouch from that statue, regardless of build (I think there's another place like that - an altar - in the Haunted Wood as well). Don't forget the side \"door\" into Vorguloth's domain - lots of xp there, which is nice, but I missed it on my first couple of runs in MTS.<br/>\n<br/>\nAnd with Persephone freed, that gives you the best kama in town (I know this isn't a kama build, but still...).<br/>\n<br/>\nThe biggest/most annoying problem in the Haunted Wood is those damned little jack'o lanterns with petrification gaze. Save often. More than usually. I once forgot for ages and had to go through the whole sodding thing again.<br/>\n<br/>\nOh, and don't get over-excited about Master Zoral's gifts. Sure, the quest is great for xp, but you'll most likely be geared-up better than anything that he provides. Sorry.<br/>\n<br/>\nAgain - marvellous work to date, Mirnaia! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />)<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:52 AM - Apr 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If your AC, DR, and/or regeneration is good enough, you can just wait until the petrification wears off, while they try hopelessly to hurt you.  It is a nuisance, but at least you don't have to reload.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:59 AM - Apr 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote:</cite>\nIf your AC, DR, and/or regeneration is good enough, you can just wait until the petrification wears off, while they try hopelessly to hurt you.  It is a nuisance, but at least you don't have to reload.\n</div></blockquote>\nIn a sane universe you'd be right, Empyre, but Mirnaia's one of those hardcore rules nut-jobs (no offence intended, Mirnaia!), and petrification doesn't wear off for that type.<br/>\n<br/>\n<strong><em>EDIT:</em></strong> While I think about it, I seem to recall the last time I played a DwD (Valerfor's reworking of the Dwarven Wall) he had EDR and regen, and in part 3 I had him kitted out in armour that gave off chain lightning on a loop when hit, so that when he was petrified by those rock elementals in the Realm of the Forge not only could he wait it out but his armour ended up killing the beasties while he was petrified as well, which was nice.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "1:43 PM - Apr 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Empyre: I play on HC, where petrification is permanent, unfortunately. I currently also have 0 regen, partly because outlasting stoning is not an option. I'll try and be careful.<br/>\n<br/>\nThe only interesting thing in the abishai caves is that I make my so far record crit for 106, which I realise is the absolute most possible at the moment. 30 (5d6 sneak)+20 (2d10 bludgeoning on fists)+40 (fist crit)+16 (STR bonus crit).<br/>\n<br/>\nIn the Horror Wood, Boogeymen resist bludgeoning and take increased damage from fire, while Nightmares don't resist anything but are fire immune. I swap gloves until I realise there isn't really much of a difference, and settle for the Fist of the Bull that I've been using so far anyway. This build has taught me how to play fast while using HiPS when necessary. The first miniboss, Terror (nightmare) gets me to level 30, I get THE EYES! Also, mind spell immunity, as if half the items here didn't grant that already :( I go over my inventory, and realise none of my items do that :) I also get Epic Prowess, which is pretty damn useful at this point. The Headless Horseman is immune to KD but gimps himself because he keeps whirlwinding.<br/>\nOuter Horror Wood ends with a Witch of the Harvest, who cast Storm of Vengeance but most importantly Elemental Shield, and the only fire resistance I have is a Ring of Power for 15 fire soak, not ideal.<br/>\n<br/>\nInner Horror Wood: if not for the Jacks, I could round up the entire area in one go and make them kill themselves in their own SoV's (there is an area in MTS3 where you can do that.) SoV's are still largely beneficial and I try to stand in them. Witches are true seers but speed + KD means I can usually one-shot them before OnPerceive triggers. On that note, I dislike true seeing casters (dragons excepted, where it makes sense.) They destroy the challenge of get the jump on them or get fried. That said, casters are largely not too dangerous in MTS, but still. First two groups of Jacks handled, the annoying thing is that they spawn in your face, but they can't see me while I'm sneaking, so I spawn them that way. Third group down, could it be that they only try and petrify on spawn? The combat log could be unreliable here. I grow bolder and play it that way. The Ring of Power soaks basically all of the reflect damage. I do round up the entire right half of the area (still spawning the Jacks unseen), so not getting petrified with about 20 Jacks attacking you at the same time makes it very likely that they are only dangerous when they spawn. Empty Body and Epic Dodge makes the 20s tolerable, I lose maybe 20% of my health.<br/>\nNocticula The Witch Queen, the boss, has eye rays and somehow gained 90% concealment. I just facetank her, and win with my wonderful 19% hit chance (1-0.9*0.9). Her AC and HP are nothing to write home about, it's all the concealment.<br/>\n<br/>\nSamhain's Crypt: OK, it's something different, one of the Jacks here did use petrification gas (it failed.) Don't know what's up with them. Next hypothesis: if you pull them away from their spawn spot, they won't use it. The Master of the Hunt feels really easy because I can actually knock him down and he's not a true seer. Feels like a luxury, really. His belt finally allows me to cap DEX (but lose Freedom.) His helm would be great if I had UMD. Samhain himself casts Bigby 5 (-10 AB), which is countered by my one Greater Restoration scroll, but of course he does it again. He has Wounding Whispers which in my case hit for 20, but that's not too bad, he went down easily. I couldn't help but think give me control of such a character and I'll wipe the floor with anyone. Spellcasters are weird in MTS. Anyway, this was a whole lot easier than I thought it'd be, I port back to the Sanctuary, sell the loot and go to Marduuk to hand the quest in to Shin. Right, so Shin, whom I once killed, would like me to redeem Zael, whom I killed twice.<br/>\n<br/>\nTime to dig that Signet of Zael out of my inventory.<br/>\n<br/>\nSo, I'm off to Nimbus Tyr and start wrecking the place. The cyclopes don't even attempt to use their confusion ability on me (or was that MTS3?) Level 32! Many many minibosses throughout the two areas, including a sword boss called Lutideous, Blade of the Wind who has Wounding Whispers and drops itself upon death. More importantly, it drops a sonic immunity ring. Level 33!<br/>\n<br/>\nThe Nexus of Thunder: This is a fun boss fight, especially with a monk. Even with all four foci destroyed, Azazel has a lot of health, and has respectable AB, but Epic Dodge &gt;&gt; respectable AB. When I see Azazel, I think of the Master and Margarita, where Azazel is definitely a he, but I guess times and universes change. Back to Shin, where both Zael and Zoral want me to kill Susymog, but I'll first go to Vorguloth's inner domain because I haven't done it yet and I don't remember if there is a quest that leads you there.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:05 PM - Apr 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Further excellent progress, Mirnaia!<br/>\n<br/>\nI believe you're right about the jacks only petrifying upon spawning - I don't recall ever being caught by it except in the first few moments. Was I right about that altar, btw, or am I misremembering? Iirc, it was in the right-hand side of the outer woods across a narrow channel. Regardless, I'm pleased it all went as well as it could.<br/>\n<br/>\nSorry about the lack of UMD for that helm, but if it's any compensation it don't look pretty when it's on your head, and we need to look kewl for dem screenshots, yes?<br/>\n<br/>\nHave you tried selling loot to Shin's stooges? They always seem to give a better price than any of the merchants in the sanctuary. I know coin isn't exactly an issue atm, but I don't like to think of you being fleeced!<br/>\n<br/>\nI think you're right about the cyclopes confusion being in MTS3  - that's where there are also efreeti and archers in the clouds, isn't it? And well-remembered about Zael's signet.<br/>\n<br/>\nI don't think there's a specific quest that leads you to Vorguloth, and I've never been able to hand his head in to anyone for a reward. However, it transpires that he's the shit who's been getting everyone else to attempt to kill you, so he definitely needs a stern talking-to. And it's an xp farm, so hurrah!<br/>\n<br/>\nThere are times I've really struggled with Susymog and company, so I wish you luck and joy - though your talents will probably make the luck unnecessary.<br/>\n<br/>\nJust as an incidental, I've just noticed a new \"thing\" to click at the bottom of posts: where the Quote and Like buttons are - and that's Give Award. I wonder what that does? I'm going to give it a go and see...<br/>\n<br/>\n<em><strong>EDIT: </strong></em>Tried clicking on it, and it costs real money! Apparently it grants vip membership as well as the obvious kudos, but sorry, no. Afraid it will still have to be virtual booze and sugar <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "3:20 PM - Apr 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Stygron, Fortress Beneath the Glacier goes very smoothly. The fight with the four bosses including Vorguloth goes just like any other melee. He drops the Bracers of the Viscount that gives +10 armour AC (so far so good), but gives IC: Unarmed strike. On a bracer. Also level 34!<br/>\nTBC, I need to run off now.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "9:02 PM - Apr 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nWas I right about that altar, btw, or am I misremembering?</div></blockquote>\n\nNo, you were spot on. I couldn't get either the altar or the statue to do anything meaningful. I should check it in the toolset.<br/>\n<blockquote><div><cite>Stagmeister wrote:</cite>Sorry about the lack of UMD for that helm, but if it's any compensation it don't look pretty when it's on your head, and we need to look kewl for dem screenshots, yes?</div></blockquote>\n\nI'm all with the sentiment, but my current helm looks like my head got imploded. I do have a screenshot for hitting monk level 20, with no helm on. My country for a hide helmet mode.<br/>\n<blockquote><div><cite>Stagmeister wrote:</cite>Have you tried selling loot to Shin's stooges? They always seem to give a better price than any of the merchants in the sanctuary.</div></blockquote>\n\nNot yet, but the tiefling merchants are all but out of money. Yeah, money really isn't a problem.<br/>\n<blockquote><div><cite>Stagmeister wrote:</cite>I think you're right about the cyclopes confusion being in MTS3  - that's where there are also efreeti and archers in the clouds, isn't it? And well-remembered about Zael's signet.</div></blockquote>\n\nNo, that's this area. They probably cast it at a low level, and didn't try because SR.<br/>\n<blockquote><div><cite>Stagmeister wrote:</cite>I don't think there's a specific quest that leads you to Vorguloth, and I've never been able to hand his head in to anyone for a reward. However, it transpires that he's the shit who's been getting everyone else to attempt to kill you, so he definitely needs a stern talking-to. And it's an xp farm, so hurrah!</div></blockquote>\n\nI've never helped Sanguinius, maybe he'd send you there? I'll do so, I have a slightly tweaked Andariel playthrough just past MTS1.<br/>\n<blockquote><div><cite>Stagmeister wrote:</cite>There are times I've really struggled with Susymog and company.</div></blockquote>\n\nI don't really remember anything about them, but they're up next.<br/>\n<blockquote><div><cite>Stagmeister wrote:</cite> Tried clicking on it, and it costs real money! Apparently it grants vip membership as well as the obvious kudos, but sorry, no. Afraid it will still have to be virtual booze and sugar <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />\n</div></blockquote>\n\nLol, that's precious! :D<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:30 PM - Apr 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Mirnaia, you are a top banana!<br/>\n<br/>\nAs far as looks go, I recall getting a horrid but useful robe from an efreeti lord that made me look like a 1970s lampshade when male, but was all clingy and seductive when female. Just a comment. And the hat I tend to wear into the end-game is exceptionally ugly, and therefore to be removed for screenshots. Except I didn't when running around with Ren. Never mind. And let's see that screenshot with your lovely blue eyes!<br/>\n<br/>\nAs far as I can remember, Empyre tried an evil build and sided with Sanguinus rather than Shin, but he was a treacherous bastard (Sanguinus, not Empyre, obviously!). I've never tried siding with him, so you may be right about Vorguloth.<br/>\n<br/>\nIirc, the Susymog thing involves battering 4 sub-bosses of differing abilities, then the main dude with his Baalor henchies. It can be really hard work.<br/>\n<br/>\nAs far as the Thunder lot are concerned, sorry I got that wrong, but you managed it admirably anyway, so hurrah!<br/>\n<br/>\nCheers<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Quick correction - Susymog and his henchies aren't Baalors, they're Pit Fiends - so get those heal pots ready for some getting smited.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:17 PM - Apr 03, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sanguinus also sends you to kill Susymog, but for a different reason.  I don't recall him wanting Vorguloth's head, either.  Also, Sanguinus has no merchants, unlike Shin.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "1:48 AM - Apr 04, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Now that it's a fact that if I ever get rich it's not going to be because of Stagmeister ;) and that I'll have to keep my adblocker on, it's time for the other half Vorguloth's inner domain, through the wall.<br/>\n<br/>\nThe Bloodfiend Reavers, who look very awesome and very disturbing at the same time (blood-red women with a monster scorpion tail) can sometimes activate an aura that smacks you with magic damage every time you hit them. Mind you, there is magic soak in MTS, I just don't have such an item, so magical damage isn't as special here as it generally is elsewhere. The damage is less than 10 per hit landed, so no big deal.<br/>\nTheir leader, Bloodfire, who dies just as easily as the rest, drops a dagger with a level 6 Inferno on hit, which is way less awesome than it sounds, it's only 2d6/round (but can only be resisted with SR), and an item with Epic Ruin 1/day, lol (I can't use it, though).<br/>\n<br/>\nBeing a dexer in MTS is awesome, as you basically don't experience THE drawback (no damage).<br/>\n<br/>\nI believe that's it for the main, connected areas of Hell, so I go back for a good night's sleep at Orwick's at 7:00 am.<br/>\n<br/>\nOff we go to Susymog. Nearing the endgame, I'm slightly concerned about my 63 AC, which is definitely too little against the final boss, I think. Let's see what loot comes up.<br/>\nThe Tower: As soon as I see the blue hell hound Bohemoths, I recall that Susymog is a blue pit fiend. Bohemoths have a giant health pool, but are otherwise unremarkable. In Susymog's chambers, when the melee miniboss is surrounded by a huge number of monsters, but only the boss has true sight, you have a very easy way to single out the boss by sneaking. Bhe Bloodfiend Reaver's reflect aura wears off after only a few rounds, when there are a lot of them, I just wait it out hidden.<br/>\nAnother miniboss, Herald Decius, puts up Wounding Whispers, but now I have a sonic immunity ring.<br/>\nThis is the point in the game where the really crazy loot starts to drop, like a +9 ring of prot with +6 regen (I take the 1 AC hit and swap it on for my +10 ring, I've had no regen for basically the entire playthrough, and it's good for a lazy person), poison and disease immunity (not that I needed those), or a helm with +8 deflection, +6 CON and STR, crit immunity, KD immunity, and true seeing, as well as the first of the +12 ability stuff. I have no fear immunity items atm, but I believe mind spell immunity protects from fear, which we'll soon find out.<br/>\nI really like MTS as a great hack and slash diversion with an OK story and a very epic scope, but if it had, say, WoG's balance, it would be the best combat module ever, not to mention it would make a lot of build choices a lot more interesting.<br/>\nLord Susymog is a true seer, the 6 lords of the pit aren't, so he is pulled alone and kept on the ground for the fight. He even rolled a natural 1 twice on his save against the on-hit glove stun. The Lords of the Pit are weaklings at this point, I just use Empty Body, Flurry of Blows, and auto-attack them to death with barely losing anything. Back to Shin, Zael, and Zoral, and off to Vistelle.<br/>\n<br/>\nVistelle: A Fallen Guardian CASTS A SPELL AT ME, and it actually works! I think it was a Curse, a Lesser Restore from the Icon of Purity (the first quest reward from MTS1!) takes care of it. The area is really easy, so far MTS2 has offered very little challenge. I know it's going to ramp up near the end. Level 35, and Armour Skin! The \"natural +2 to AC\" in the description should have gotten whoever put it that way fired. It's innate, or bonus, or additional, or whatever, but not natural, as that is a specific type of non-stacking AC. IIRC, RDD's descriptions have the same issue.<br/>\nFallen Guardians are now officially my favourite enemy in MTS: one tried to dispel the stun I put on another one &lt;3 <br/>\nI fail to notice that Sanguinius has true seeing, so he buffs up, but has so little health that even with Elemental Shield he dies way faster than I lose health. Malphaedor has a Summoned Badger (&lt;3, this is the most adorable area ever), and gets a Greater Ruin off, which fails to do anything (65 positive damage from a level 10 spell is nothing at this point.) It's a nice touch that his equipment is almost the same as MTS1 Malphaedor's (his robes and gloves are upgraded, but he drops the same kama and amulet.)<br/>\nWith all the stuff dropped, I manage to get my AC to 74, much better, and now I officially look like a professional wrestler. Pimpin' screenshots at the end. I also have STR, DEX, WIS, CON maxed and have a plethora of immunities, and 5d6 sneak attack.<br/>\nI make it to the portal room, and I'm off to Avernus!<br/>\n<br/>\nTakhisis' minions are KD immune, are NOT true seers for some reason, and are no challenge (I snipe the templars first.) Cerberus warrants Def Stance over FoB, as he has respectable AB, but mostly because it's been so long since I last used DS. He has the most HP of anything so far. His range is so long that I have to cancel DS because we manoeuvre into a position where he can reach me, but I can't reach him, and DS prevents me from moving. He drops a fire immunity necklace, which I'll be keeping because I don't want to spend half an hour shooting a certain boss down in MTS3.<br/>\nI say hi to Nicademus and take a nap at his place. He sells a sequencer, something I haven't noticed so far. <br/>\n<br/>\nRealms of the dragons: I go white - green - black - blue - red. I improved evade almost everything, making the fights far less epic than intended. Takhisis hits me twice during the encounter, and Tiamat has monstrous HP, but the breath DC's are not high enough, and neither is the AB, of which she has 66 against my 74, but with Epic Dodge it's a joke. She drops the first truly WTF item, a +10 robe with Haste and +5 everything. Takhisis gets me to level 36, and that concludes MTS2!<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201904/10758846_920cf291017fbf577c99d9799dd950b4_t.png\" /></dl>\n</span><br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201904/10758846_deeaaf560b76dc1e270bafed350d6dd4_t.png\" /></dl>\n</span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:38 AM - Apr 04, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Brilliant work, Mirnaia!<br/>\n<br/>\nI recall the first time I met those Bloodfiend Reavers - I hadn't a clue what was going on or what they were, and it took me a couple of reloads before I mastered them.<br/>\n<br/>\nYes, your mind-spell immunity protects you from fear, but weirdly not confusion. No idea why. It's bit like having protection from paralysis that doesn't prevent petrification: just one of those things, I guess.<br/>\n<br/>\nOoh, you found Nicademus - where is he? Obviously I know where to find him in part 3, but I've yet to unearth him in Avernus.<br/>\n<br/>\nNice screenshots - looking good, and welcome to the WWF! (Lady Phio does seem to be compensating for something or other with that sword, though. I thought that was supposed to be a boy thing...And nice to see squeaky Persephone along for the ride, too.)<br/>\n<br/>\nSee you in part 3!<br/>\n<br/>\nCheers <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "11:23 AM - Apr 04, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Stag!<br/>\n<br/>\nNicademus is in the first area of Avernus. Turn back at the very end where you face Cerberus and run up the slope. There will be a cave and he's in there. You have to go all the way down first because there are walls blocking access from the sides.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:21 PM - Apr 04, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for that, and good to know. For some reason I'd assumed he'd be somewhere in Takhisis's palace, so no wonder I couldn't find him.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:04 PM - Apr 04, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">While I think about it, wondered if you'd like the locations of the 7 notes for the Music Goddess? I did pepper them in the thread Valerfor created, but thought it might be helpful to pull them all together. I'll stick them in a spoiler in case you don't want them.<br/>\n<details><summary>Spoiler</summary>1 - Fae Realm. Upon entering, turn right up the planked pathway. At the end is a statue of Oberon, and it's on that.\n</details>\n<details><summary>Spoiler</summary>2 - Healing Realm. It's on the north side of the eastern fountain of health.\n</details>\n<details><summary>Spoiler</summary>3 - Dino-land. It's at the near rear west of the south-eastern of the four head statues.\n</details>\n<details><summary>Spoiler</summary>4 - First Yuan-Ti area. It's in the far north-west near an upside-down ribcage.\n</details>\n<details><summary>Spoiler</summary>5 - Necropolis of the drowned dead. It's atop the edifice in the far north-east.\n</details>\n<details><summary>Spoiler</summary>6 - By the statue of the Sea Enchantress to the east of Neptune himself.\n</details>\n<details><summary>Spoiler</summary>7 - Death's Realm. It's on the west side of the big head statue behind the goddess.\n</details>\nCheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Didn't expect them to come out as 7 separate ones, sorry!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "1:30 PM - Apr 04, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Wow, thanks! I think I remember most of them, but <span style=\"text-decoration:line-through\">should</span> when I miss one, it'll be great to have all of this in one place!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "4:50 PM - Apr 04, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Maybe someone should post å link to this thread in the MTS module topic.<br/>\n<br/>\nEdit: With a spoiler warning, that is.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:40 PM - Apr 04, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mick Dagger wrote:</cite>\nMaybe someone should post å link to this thread in the MTS module topic.<br/>\n<br/>\nEdit: With a spoiler warning, that is.\n</div></blockquote>\nThat's good idea, Mick - baggsy not me! Find someone better at all that sort of malarkey.<br/>\n<br/>\nOh, and while you're here, I seem to recall you asking about Dexers in MTS in that very thread. Now more of us have played it, and more often, it would seem appropriate to revise my initial caution. While I stand by my initial assessment - and bearing in mind all the beasties with DR and so on - the sheer volume of high-end gear means that it is definitely more than do-able. Indeed, Mirnaia's current run-through seems to offer positive proof of that.<br/>\n<br/>\nJust trying to get you to give it another whirl.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:54 AM - Apr 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yup, that's where the Dexers reign supreme, the higher the magic-level the better for them.<br/>\nFun fact, I was reading Sword Coast's (is a +10 PW) forums a year ago &amp; they had a thread about the usefulness of WS/EWS in their builds. Most were taking it because there are no other worthwhile feats to take instead of it. It may sound paranoid, but considering that their Dragon-Slayer gear has 8d12 elemental damages on it, EWS is but a tiny amount in comparison.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:39 AM - Apr 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's up to 96 points of elemental damage! And here's me thinking MTS might be too OP...<br/>\n<br/>\nTrying to look on the sunny side, it means fewer builds would need Fighter as a class. But on the shady side, it means you're almost being channeled into going for something else, and I'm not sure I like that.<br/>\n<br/>\nThis place has always been about creating quality builds. Sure, environment and gear will always play a part, and tweaks can be made for that, but I would hate us to turn into somewhere where any old build would do the job. Please don't get me wrong, I'm not suggesting you're advocating that at all. If anything, I'm saying - brothers and sisters - that we are the beating heart, and we will <strong>not </strong>be turned!<br/>\n<br/>\nSorry, had a bit of a moment there...and, yes, I've had a glass of scotch or two...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:44 AM - Apr 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nSorry, had a bit of a moment there...and, yes, I've had a glass of scotch or two...</div></blockquote>\nThat's the good stuff <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mirnaia",
      "avatar": "no_avatar.png",
      "timestamp": "9:10 PM - May 31, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">All right, so after an embarrassingly long time I sit down to complete the final chapter of MTS. Stag, I'm really, really sorry, I'm trying to make up for it.<br/>\nIn case you have forgotten how The Hand currently looks like:<br/>\n<br/>\n<span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201905/10758846_b6dcb6b3a4f99c8525605b5bc81da750_t.png\" /></dl>\n</span><em>(he can only attack when burrowed)</em><br/>\n…and a slew of immunities.<br/>\n<br/>\nExpectations: I expect to crush my enemies. Only concerns are Elemental Shield, but I have a fire immunity ring, which, as I begin the third module, can't find in my inventory for some reason. Found it! It's an amulet that drops off Cerberus. I also have items with cold and sonic immunity, 20 acid soak, so I'm rather well prepared for reciprocal shields, including the really nasty one near the end of this module.<br/>\n<br/>\nAs for the remaining 4 level-ups, there isn't anything extraordinary to look forward to, just the rounding out of the character; one more great dex, the last tumble dunp, more sneaking. I'll have reasonable AB (very much enough for MTS) and very good AC. My worst save is 36. Now, I would still have no chance against an intelligently decked out true seeing wizard (unless monk speed &gt; OnPerceive, but that depends on luck and the availability of corners), but there is no such thing in this module.<br/>\n<br/>\n<br/>\n-- Show me a god whose ass I won't kiss --<br/>\nLet's begin by picking up the quests from all the gods I'm allowed to visit, as well as some of their sidekicks, plus Shin and Zael, before going to Jurassic World. I surprise myself by actually taking notes of the ingredients. As I mentioned before, this is the third time I play MTS, and I always use map pins in the central hub to remind myself of whose support I already have. I'm planning on keeping a list at the bottom of each entry, too.<br/>\n<br/>\nI begin with music, then Death (note#7!), Faery (Puck's quest, note#1, Honeydew silk for Zael, Shard of the Purest Essence with I think is an ingredient for the super weapon, or a red herring), Travels, Life (note#2), and the Lost World!<br/>\nThe scorpions here are hardly worth mentioning, they are here for underleveled characters to catch up. You could probably get away with a fairly low level character as long as you play carefully and have a way of losing them (or just use your Astral Sextant!) I don't really know their AC but maybe even a level 12 zen archer cleric could do fine, as long as haste, through domain or items, were available. It could be a fun challenge to see how low level a character you can beat MTS3 with - if you can survive early you should be able to catch up quickly. But I digress.<br/>\nBeacon is now single-handedly responsible for the mass dinosaur extinction (I really wish I had UMD and could Meteor Swarm them for bonus points in style). Tyrannosauruses have way too high discipline for KD and are immune to it anyway, and while Stegosauruses don't, they are immune to KD as well. Note #3 is here. I actually miss quite a bit on my lower AB attacks, so I decide to go without FoB. They have 51 AC, which is of course not too much at this point, but seems to invalidate my previous train of thought about a low level character (unless you BBoD + GS or some such.) I'm not very well versed in low level abusive building. Tyrannosauruses, I believe, are black dragons with the head replaced with that of a lizard. They swipe with their forepaws. Aww.<br/>\n<br/>\nSupport (2/20):<br/>\nThe Laughing God<br/>\nThe Wandering God<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:14 AM - Jun 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yee-and-indeed-Hah! Welcome back, I've missed you. No need for apologies - you are allowed a life outside Neverwinter, after all.<br/>\n<br/>\nIt is true that this module will largely be a rounding off of the character (though don't forget the Epic Energy Resistance at level 40 - whoo-hoo), but that should give you plenty of time to explore its strengths and weaknesses for a good old while at level 40.<br/>\n<br/>\nExcitingly, neither Shin nor Zael's goodies will be of any use to us - nor will the gift from the Forge God. We'll have to work to earn our goodies, which at least are plentiful.<br/>\n<br/>\nOne realm that might prove challenging is Change/Destruction. Those clockwork golems won't be a walk in the park, I suspect - though I'd be happy to be proved wrong. Likewise those springy bastards in Unlife, but for different reasons.<br/>\n<br/>\nRegardless, I'm looking forward to the ongoing adventures of Beacon, Truesilver's Hand.<br/>\n<br/>\nCheers <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /> (I've been keeping it on ice for you)<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Just had a thought from looking at your screenshot and seeing your line about burrows...for this run-through maybe he should be known as Truesilver's Ferret?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "5:17 PM - Jan 18, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote: <a data-post-id=\"14556\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=14556&amp;sid=2e6ca8571a25b1f24587557e39a3134b#p14556\">↑</a><div class=\"responsive-hide\">Mar 23, 2019</div></cite>At Doom's Gate is great, I also recommend this for Boss fights:<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/-qJMJgLEQJs\" style=\"background:url(https://i.ytimg.com/vi/-qJMJgLEQJs/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span></div></blockquote>\nI know that's out of purpose, but in French there's a \"jeu de mots\" since Throne Of Bhaal sounds almost like \"Trou de balle\" which means \"asshole\" in French.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:26 PM - Jan 18, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Pan Draconis wrote: <a data-post-id=\"27698\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=27698&amp;sid=2e6ca8571a25b1f24587557e39a3134b#p27698\">↑</a><div class=\"responsive-hide\">Jan 18, 2023</div></cite><blockquote><div><cite>Valerfor wrote: <a data-post-id=\"14556\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=14556&amp;sid=2e6ca8571a25b1f24587557e39a3134b#p14556\">↑</a><div class=\"responsive-hide\">Mar 23, 2019</div></cite>At Doom's Gate is great, I also recommend this for Boss fights:<br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/-qJMJgLEQJs\" style=\"background:url(https://i.ytimg.com/vi/-qJMJgLEQJs/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span></div></blockquote>\nI know that's out of purpose, but in French there's a \"jeu de mots\" since Throne Of Bhaal sounds almost like \"Trou de balle\" which means \"asshole\" in French.</div></blockquote>\nSeems about right to me. ToB is certainly the worst of the initial BG trilogy - far too linear for my liking: to quote Dynaheir when clicked on too often (and in a quasi-French accent), \"Go here, do that! What about <em>my</em> needs?\"<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "11:08 PM - Jan 18, 2023",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The real good thing in Throne of Bhaal is the raw power of the Bhaal's child and the tower with the Asmodeus fight. This demon was the true challenge of the game.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pan Draconis",
      "avatar": "10759307_1674117984.jpg",
      "timestamp": "4:12 PM - Aug 13, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"14119\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=14119&amp;sid=f85249f5597ec22cd9ed94bcb6a300b1#p14119\">↑</a><div class=\"responsive-hide\">Feb 12, 2019</div></cite>This one has been long in gestation, and wouldn't be here at all if not for the stupendous efforts of Mirnaia in its testing while my game was broken, to whom I shall remain eternally grateful. Mirnaia also made a very viable tweak of upping the Wisdom at the expense of Constitution, which clearly worked. I took the build in its initial version through full testing lately, and both are fine. I'm including the entire thread from the Build Request forum below, as I believe it merits the coverage (and I'll be linking it to the Mines of Twin Summit thread in the Modules forum), as well as showcasing Mirnaia's exemplary assistance, and you can choose which better suits you. I did have a back-story for the build, but it was based on the character being female, which would rub against the grain of Mirnaia's testing, so I'll leave it for another time. (Oh, and I'll write up a proper Skills Schedule for the initial build as soon as I can - I still input here directly, so it takes a bit of time). Hope you like it.<br/>\n<br/>\nGo well!<br/>\n<br/>\nHere's another one for your consideration. Assassin was beginning to make me twitch, so I did some reverting to type...it's a Monk! And...it's a Dwarf!However, I thought I'd try a different tack. An unarmed Dexer (admittedly because I couldn't get the TW feats in, so binned Kama) with an emphasis on defence, but who can hurt with d20 fists once s/he hits Monk 16 - so I tried to get that relatively early.<br/>\n<br/>\nAnyway, I'd really appreciate any thoughts.<br/>\n<br/>\n<strong>Monk 30/ DwD 5/ SD 5</strong><br/>\nDwarf - any Lawful<br/>\nPvM 1-40 (untested - game still bust, so relying on pnp here)<br/>\n<br/>\n<strong>Stats</strong><br/>\nStr 14<br/>\nDex 18 (32)<br/>\nCon 14<br/>\nWis 8<br/>\nInt 12<br/>\nCha 6<br/>\n<br/>\nHPs - 460<br/>\nAC - (naked) 37 (+1 Dodge, +1 Shadow Evade)<br/>\nSR - 40 (undispellable)<br/>\nSpeed - +100%<br/>\nSaves - F 25, R 33, W 22 (+2 vs traps +2 vs spells - maybe +4 more vs spells, depending on skills chosen)<br/>\nEpic Dodge<br/>\nHiPS<br/>\nDefensive Awareness II (cannot be flanked in combat)<br/>\nDR - 20/+1<br/>\n10% resistance to element (fire, cold, acid, electrical or sonic)<br/>\n50% Concealment (2/day, 30 rounds each)<br/>\nImmune to mind-affecting spells<br/>\nBAB - 26<br/>\nAB - +41/38/35/32/29<br/>\nDamage - (unarmed) d20+2<br/>\n<br/>\nSkills - 215. Hide 43 (54), Listen 43 (44), Move Silently 43 (54), Tumble 40 (51). 46 spare for any combo of Disable Trap (cc), Discipline, Lore, Open Lock (cc), Search and Spellcraft (cc) <br/>\n<br/>\n<strong>Levelling</strong><br/>\nDwarf: +2 Search underground/ Darkvision/ +2 vs poison and spells/ +2 Lore/ +4 dodge AC vs Giants/ +1AB vs Orcs and Goblinoids<br/>\n1 M1 - (Cleave/ Evasion/ etc)/ Dodge<br/>\n2 M2<br/>\n3 M3 - Weapon Finesse<br/>\n4 M4 - Dex+1 (19)<br/>\n5 M5 - (Immune to disease)<br/>\n6 M6 - (KD/ IKD)/ WF: Unarmed<br/>\n7 M7<br/>\n8 M8 - Dex+1 (20)<br/>\n9 M9 - (Imp Evasion)/ Mobility<br/>\n10 SD1 - (HiPS)<br/>\n11 M10<br/>\n12 M11 - (Immune to poison)/ Dex+1 (21)/ Toughness<br/>\n13 DD1<br/>\n14 DD2 - (Defensive Awareness I)<br/>\n15 DD3 - Blind Fight<br/>\n16 DD4 - Dex+1 (22)<br/>\n17 DD5 - (Defensive Awareness II)<br/>\n18 M12 - (SR: 10+class level)/ Imp Critical: Unarmed<br/>\n19 SD2<br/>\n20 SD3 - Dex+1 (23)<br/>\n21 M13 - EWF: Unarmed<br/>\n22 M14<br/>\n23 M15<br/>\n24 M16 - Dex+1/ GDexI (25)<br/>\n25 SD4<br/>\n26 SD5 - (Defensive Roll)<br/>\n27 M17 - Epic Dodge<br/>\n28 M18 - (Empty Body)/ Dex+1 (26)<br/>\n29 M19<br/>\n30 M20 - (Perfect Self)/ Epic Prowess<br/>\n31 M21<br/>\n32 M22 - Dex+1 (27)<br/>\n33 M23 - GDexII (28)<br/>\n34 M24<br/>\n35 M25 - Armour Skin<br/>\n36 M26 Dex+1/ GDexIII (30)<br/>\n37 M27<br/>\n38 M28<br/>\n39 M29 - GDexIV (31)<br/>\n40 M30 - Dex+1 (32)/ Epic Energy Resistance<br/>\n<br/>\nI don't recall seeing anything quite on these lines (which means that more than likely it's got problems), so over to you!<br/>\n<br/>\nCheers<em><br/>\n<br/>\n<strong><em>EDIT:</em></strong> </em>Forgot to add Dwarf racial bonuses, sorry - now corrected.<br/>\n<br/>\n<em><strong>EDIT 2</strong></em>: It may be that DwD10 and Monk25 is worth it, with the final few DwD levels taken late in epic levels, but I'm yet to be sold on that. You're all welcome to try, of course! (Oh, and I'll be working up some kind of back-story while you carve him/her up.)<br/>\n<br/>\n<strong><em>EDIT 3</em></strong>: I've got the character story - hence the change of thread title. She is a follower of Moradin's bride, Berronar Truesilver. That's all you get for now.<br/>\n<br/>\n<strong><em>EDIT 4</em></strong>: Really should stop with all the editing. However, I thought it worth mentioning that I did find a sort of mirror build to this one in the Legacy Archive. Back in 2005 Kaliban came up with <strong>Tempered Steel</strong>, which is a Monk 9/ SD 5/ DwD 26, with the same starting and ending stats. He does go for dual-wielding kamas (giving a d-w AB of +40), meaning Blind Fight is lost and Imp Crit and W Focus are taken in epic levels. ED is not reached until L39. His HPs are 470, but that's because he takes an Epic Toughness at L40, and his naked AC is 32. He does get DR of 18/-, but I'll trade that in for all the other goodies Truesilver's Hand has tucked away.</div></blockquote>\n\nI really like this defense Monster. Furthermore, there is room to customise the build.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "soulfullmusik",
      "avatar": "no_avatar.png",
      "timestamp": "2:47 PM - Mar 04, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">WOW amazing . . . .love to soak up information.  This is most helpful. Once again can't thank all of u enough.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}