{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "070",
  "name": "Undead Lord Remake.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/undead-lord-remake-t2354690.html",
  "author": "conlaoch",
  "avatar": "10235240_1510287070.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "7:12 PM - Apr 19, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I was feeling nostalgic and was revisiting one of my first loves Palemasters.  I adore palemaster builds.  Not sure why....  maybe its all the summoned pets and the crit immunity.<br/>\n<br/>\n But this led me to one of the originals...  The Undead Lord.<br/>\n<br/>\n Although the old builds from the Bioware boards are gone, I did find a link to a posting online.  (Technically they are not gone as you can download the old build forums via the neverwinter vault. But the undead lord was one of the spotlight builds, so wasnt listed there.)<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwn.wikispaces.com/undead_lord\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikispaces.com/undead_lord</a><br/>\n<br/>\n The Undead Lord was a Wizard/Ftr/Palemaster with a 6/4/30 level split.  He was a scimitar wielding, epic spell casting, dev critting AC tank.  The 30 PM levels gave a whopping +16 to AC<br/>\n<br/>\n If you were to try and remake one of these nowadays, what would you change from the original linked above?  And yes I know...   you can always drop the PM levels and take more wizard or fighter.. but then you dont get to run around with a Demi-Lich as a pet.  And who hasnt always wanted a disembodied head with glowing eyes following you around like a lost puppy dog?<br/>\n<br/>\n And I have a question for the rules experts concerning the original.<br/>\n<br/>\n The original took all three of the spell penetration feats, but since Bioware borked up the caster levels for Palemasters, does this do any real good?  The effective caster level is 6 due to the 6 wizard levels and Epic Spell Penetration only gives a +6 to spell DC.  <br/>\n<br/>\n Wouldnt it be better to use those three feats for something like IKD and maybe craft wand?<br/>\n<br/>\n Conlaoch<br/>\n<br/>\n [edited to fix my atrocious spelling and typing]<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:24 PM - Apr 19, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">All of the <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/forums/60574/\" rel=\"noreferrer\" target=\"_blank\">Bioware Legacy Builds</a> </strong>were ported over to the current ECB during its infancy so you need not hunt down them using caching sites.  The undead lord is just one.  Fortunately, it complies with the rules of v1.69 so can be played \"as is\".  Not all legacy builds are playable today as designed when they were.<br/>\n<br/>\nAs far as the build itself, I've never understood the rationale.  It nerfs casting proficiency severely to achieve some tanking prowess except the AB is so horrible it will never be able to crit anything once you consider the threat roll needed to accomplish that.  Striving for DevCrit is even more reliant on generating many crits, crits which will never happen except against low AC foes that would be easy to dispatch anyway.<br/>\n<br/>\nPenetration has nothing to do with DC.  It is another layer of check (the one vs. SR) before the save has been resolved (assuming a spell allows a save, of course).<br/>\n<br/>\n+6 penetration is like 6 levels of Wizard added into the build (6 x 5% = 30% better chance to beat SR).  It effectively doubles penetration else all spells that check against SR will just bounce off of any creatures with the minimum.  But when it gets right down to it, you are spot on questioning the value.  Since spell DCs have already been diluted with lack of INT due to investing in STR instead (and no foci to compensate), electing penetration feats assumes spells will first win the saves... which they won't... and then penetrate... which they won't.  Notice that the goal was only to reach the STR prereq for DevCrit but ignores Grt STR feats that would boost AB further and approach some combat effectiveness.  The build is always fighting itself as far as optimizing any form of attack is concerned.<br/>\n<br/>\nThe only use I see in this build is acting as a party tank and hoping for some naturals to land occasionally for some damage.  It will stand in well for other members to cause havok.  It just can't land spells reliably or cause much damage.<br/>\n<br/>\nNow, if you'd consider a barb version, you might be able to taunt down enemy AC enough to hit something with that extra AB. But then you'll be even more pressed feat-wise.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:12 PM - Apr 19, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It sounds more like a decoy than a tank. A decoy's job is to aggro the monsters (draw their attention) so the casters and archers can do the damage. This would be a pain to solo, taking forever to kill the monsters, relying on natural 20s to hit, and hoping that you get that natural 20 before they do.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:30 AM - Apr 20, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey, Con!<br/>\n<br/>\n I have to say that I even downloaded the character.bic file for this one back in the day and it just sucks.<br/>\n<br/>\n PM levels count as half-levels for some purposes (spells per day), but not for others. IDK if they count to beating Spell Resistance. Logic would say no, but I've never actually tested. Hip was spot on as to the SR check. Imagine this: 6 Caster Levels + 6 from ESP feats = 12, so for penetrating Spell Resistance. That means you WON'T penetrate anything. If PM levels work, then it's as though you were a level 27 caster. Still pretty crappy if you ask me. Another thing that PM levels don't count towards are spell durations, so your spells will last as long and be equivalent to a level 6 Wizard. That's also crappy.<br/>\n<br/>\n And what do you get for so many PM levels? Epic Spells, a Demi Lich summon (meh) and LOADS of AC so you can have a lifetime of \"only hit on natural 20's\" duels with every foe you encounter. TBH I really dislike that build. If I were to rebuild this guy, it'd probably be something close to GDL's Charnel Lord. Now THAT is a build!<br/>\n<br/>\n That's just my 2 cents.<br/>\n<br/>\n Take it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:51 AM - Apr 20, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><hr/> Another thing that PM levels don't count towards are spell durations, so your spells will last as long and be equivalent to a level 6 Wizard. That's also crappy.<br/>\n</div></blockquote>Not exactly.  Spells taken while taking PM levels use the PM duration,  those taken while wiz use the wiz durations.  If you wait to learn  spells from scrolls while at a PM level, all those spells will use the PM duration.<br/>\n<br/>\nProblem is: with only <em>Still, Extend</em> and <em>Empower</em> metamagic, you only have Level 1 slots for True Strikes and you can run through all those in a single encounter and <span style=\"text-decoration:underline\">then</span> what do you do?  Swing at the air, I suppose. <em> Silent spell</em> would have been better but even so, still an act of relative futility.  What will really get annoying is when you use all your TS attacks up against 50% concealed foes and never hit them once even at highest AB.  WHERE O' WHERE IS BLIND FIGHT, Mr. Aulepp ???  Obviously, this is a paper build that was never tested.<br/>\n<br/>\nMax distilled the concept down into its elementary rudiments.  It sux! <img class=\"post-image\" loading=\"lazy\" src=\"http://static.yuku.com/domainskins/bypass/img/smileys/eek.gif\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}