{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "409",
  "name": "Hinfather Concept?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/hinfather-concept-t2304664.html",
  "author": "TheSupremeForce",
  "avatar": "10235216_1520203711.jpg",
  "replies": 1,
  "posts": [
    {
      "author": "TheSupremeForce",
      "avatar": "10235216_1520203711.jpg",
      "timestamp": "5:44 PM - Dec 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">There's not an actual build here, so consider this an open request for help from any and all willing to offer!<br/>\n<br/>\nFirst of all, thanks in advance to anyone who gives this a look.  <br/>\n<br/>\nHere's the idea.  I'm trying to put together an appropriate and functional Monk of the Hin Fist.  <br/>\n<br/>\nWhile this character will largely be for PvM, PvP situations are possible.  I'd put the emphasis on PvM, as I'd like the PC to be as playable as possible.   He'll be by himself from time to time, but I hope to largely have a couple of PC sidekicks/underlings/henchmen/goons. <br/>\nRace: Halfling<br/>\nClass: Any combination of Monk/Rogue/Fighter (Paladin is allowed, but I don't really think it fits the character concept).  There aren't any rules about taking them in any order or in any specific numbers.<br/>\nI'm open to any level split, as I really have no idea what the best splits for this sort of build would be.  <br/>\n<br/>\nLevel Cap: 20, though seeing that number would not be for quite some time<br/>\n<br/>\nMagic Level: Mid-to-Mid-High.  While Enchantments aren't exactly overpowered (+4 is rare, +3 is more likely, +2 is easily done), there are a lot of resistances/immunities/boosts available if one is lucky enough to find them, or willing/able to spend the money/experience for them at the various Enchantment Forges.  Things such as Immunity to Mind Spells, Knockdown Immunity, Improved Evasion ARE obtainable (though rather costly if one isn't lucky enough to get one via drop, since they cost XP and loads of gold, which increases as you try to stack things onto single items).  Potions of most sorts are readily available if one can afford them.  <br/>\n<br/>\nI don't really have a strong weapon preference.<br/>\n<br/>\nHere's my reasoning for wanting this sort of character.<br/>\n<br/>\nThe server I play on is doing a complete reset in a few weeks.  We're returning to the beginning of the timeline with all new characters and beginning anew in 1357 during the time of the Salamander Wars in Thay.  The Time of Troubles happens the following year, for reference.  <br/>\n<br/>\nIn the city of Tyranturos (located in Thay), there's an area known as Hinhome.  It's filled with all sorts of shady Hin shenanigans.  My goal with this PC is to gradually take over the neighborhood (so to speak), expand and develop it, and ultimately transform the Hin community into a force that others have to at least notice.  Think Halfling Mafia (or Hafia) if that helps.  He's going to make himself the self-appointed protector/leader/Hinfather of Hinkind in Thay (or at least in Tyranturos).  This is doable with or without DM help, because there are systems for buying houses and decorating them, as well as the ability to hire player owned merchants.  <br/>\n<br/>\nI initially considered simply going rogue/fighter (possibly adding some prestige class, ie shadowdancer), but the low will saves and number of sneak attack immune enemies is a problem (as Thay is full of wizards and undead).  Also, most of the PC's I'm likely to have issues with will probably be Wizards.  I also like to be fast, especially since medium armor carries a 10% speed decrease and heavy carries a 20%.  My heavy armor character feels like he's running in mud compared to my other PC's.  It's usually not a big deal, but I figure that a halfling should be good at getting away.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "7:29 PM - Apr 22, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey, what's killing me here is the level cap.<br/>\n<br/>\nMonk goes well with Cleric in a Dex build, but with 20 levels and you wanting to be fast, that's just not doable. The only think I can think of is something like a Monk 16 (for maximum unarmed damage) Fighter 1 (for 1 feat) and Rogue 3 for Uncanny Dodge. Go DEX and don't look back. If the lvl 20 cap goes down, then contact us again and we might work something out for you. Another alternative is Monk 16 Fighter 4 for Weapon Specialization (unarmed). Same quickness, but no UMD or Uncanny Dodge.<br/>\n<br/>\nWish I could help you more, but I have no idea what options you'd be willing to consider. Can you be evil? if so, then Assassin works well in there, but with so many immunities, meh... Probably best to go just Monk FTR or Monk FTR Rogue.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}