{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "272",
  "name": "Improved Knockdown or Called Shot under these conditions?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/improved-knockdown-or-called-shot-under-these-cond-t2276136.html",
  "author": "Ataxia",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "875",
  "posts": [
    {
      "author": "Ataxia",
      "avatar": "no_avatar.png",
      "timestamp": "7:18 PM - Jul 29, 2012",
      "content": "<div>Hi there!<br/>\n<br/>\nI have a couple of questions relating to Knockdown, Improved Knockdown and Called Shot. I play on a server which is capped at around level 30 and have figured a melee character build which will have around an AB of 41 - 43 depending on if i'm dual wielding or carrying a shield.<br/>\n<br/>\nI expect to be facing opponents in pvp which will have mostly +4 gear with some having +5 items at a level cap of 30. Furthermore, I know with some certainty that greater gloves of swordplay (+30 discipline) are available as rare loot and also that it will not be difficult to add +12 to base strength through equipment. Naturally, there are likely to be many characters who aren't packing these items, but I'm considering the worst case scenario.<br/>\n<br/>\nSo, all being considered; would you guys considered knockdown, improved knockdown or indeed called shot? I have two pre-epic feats spare in my build and would really like to hear the relative merits of each of them.<br/>\n<br/>\nThanks in advance,<br/>\n<br/>\n- Ataxia</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:20 AM - Jul 30, 2012",
      "content": "<div>I would advise you to go for Knockdown and Improved Knockdown in this case. Called Shot effects don't disable opponents, and IKD will always be useful against casters. If you are a Monk meleer, however, Called Shot will stack up impressively with the attack schedule and 7 attacks per round. In that case, Knockdown and Improved Knockdown will come free, so you can grab Called Shot instead.<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Ataxia",
      "avatar": "no_avatar.png",
      "timestamp": "12:39 PM - Jul 30, 2012",
      "content": "<div>I didn't consider the caster angle; but it makes a lot of sense. Especially as the buildwill be packing crippling strike and a few d6 of sneak attacks.<br/>\n<br/>\nSeems like a no brainer to take KD and imp KD when you factor the sneaks into it doesn't it?<br/>\n<br/>\nCheers fella.<br/>\n<br/>\n-Ataxia</div>"
    }
  ]
}