{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "050",
  "name": "Paladin Build Help",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/paladin-build-help-t2354738.html",
  "author": "Bravadorado",
  "avatar": "10758811_1510287074.png",
  "replies": "65",
  "views": "2.3K",
  "posts": [
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "7:50 AM - Sep 12, 2017",
      "content": "<div>Hey guys, I'm playing NWN for fun and I saw <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Paladin_29/_sorcerer_1/_red_dragon_disciple_10\" rel=\"noreferrer\" target=\"_blank\">this build</a> on the wiki. I'm interested in it but I'd like to add some Champion of Torm levels for RP reasons, would that be possible without messing the whole thing up? I don't know much about NWN builds. I saw <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=8&amp;t=2354355&amp;p=10212#p10212\" rel=\"noreferrer\" target=\"_blank\">this build here</a> which is similar to what I'm looking for but needs Paladin levels added. Is this possible without ruining it?<br/>\n<br/>\n1) PvM or PvP - PvM<br/>\n<br/>\n2) Level cap - Max level<br/>\n<br/>\n3) Race preference - Human<br/>\n<br/>\n4) Class preference - Pal/Bard/RDD/CoT or Pal/Sorc/RDD/CoT<br/>\n<br/>\n5) Melee preference - Sword and shield high damage<br/>\n<br/>\n6) Range preference - N/A<br/>\n<br/>\n7) Weapon preference - Longsword<br/>\n<br/>\n8) Maximum item enhancement - Whatever is the max for the full campaigns<br/>\n<br/>\n9) Spellcasting - Buffing<br/>\n<br/>\n10) Custom factors - Just want the CoT class added to the mix of the wiki build<br/>\n<br/>\nThanks for any help guys!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:54 PM - Sep 12, 2017",
      "content": "<div>Hello Bravadorado - and welcome to the Guild!<br/>\n<br/>\nAlas, you can only have a maximum of three classes in a legitimate build, and if you want RDD involved then that means you need either Sorcerer or Bard as well, which means you could have either Paladin (which would preclude Bard) or CoT, but not both. And with CoT being a prestige class (you need a BAB of 7+ and a weapon focus in a melee weapon before you can take it), you wouldn't be able to start taking it until at least level 10 with a Bard/RDD, and considerably further along with Sorc/RDD.<br/>\n<br/>\nSorry to be the bearer of bad news.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "7:35 PM - Sep 12, 2017",
      "content": "<div>I see FeelsBadMan, I was thinking you could have more like in NWN2. In that case, could I ask for build advice? I'm going to play through both NWN and NWN2, and I want my character to be designed similarly in both games, as if it's the same person. He's either going to be a straight paladin type (Possible multiclasses in Monk/Fighter/CoT/Divine Champion) or a RDD type (Multiclasses in Bard/Sorc/Paladin/CoT/Divine Champion). These are the NWN builds I was looking at <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Monk_1/_paladin_9/_champion_of_Torm_30\" rel=\"noreferrer\" target=\"_blank\">Paladin/CoT</a>, <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Paladin_29/_sorcerer_1/_red_dragon_disciple_10\" rel=\"noreferrer\" target=\"_blank\">Paladin/RDD</a>, <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=8&amp;t=2354355&amp;p=10212#p10212\" rel=\"noreferrer\" target=\"_blank\">CoT/RDD</a>, and these are the respective NWN2 builds I was looking at <a class=\"postlink\" href=\"http://nwn2db.com/build/?2857\" rel=\"noreferrer\" target=\"_blank\">Paladin/DC</a>, <a class=\"postlink\" href=\"http://nwn2.wikia.com/wiki/Divine_Dragon_Pal%289%29,Sor%281%29,RDD%2810%29,DC%2810%29\" rel=\"noreferrer\" target=\"_blank\">RDD/DC</a>. Are any of these actually good, or are there better builds I can use? I don't need the best build in the game but I'd prefer if it was optimal for what it is. It seems like a straight paladin type is more defensive and a RDD type is more offensive, is that true or is one strictly better than the other? Do you have any ideas on a good build that can carry over for the most part between the games? I prefer to use Bard to get to RDD btw, since I don't really like the familiars, although I guess the pseudodragon would be okay.<br/>\n<br/>\nAny ideas? Thanks!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:57 PM - Sep 12, 2017",
      "content": "<div>I'll confess that I've never played NwN2 (didn't even know you could have four classes there), but I've just had a peek at the 2 builds you cite above, and both are Aasimar. While I've encountered that sub-race in (initially) Icewind Dale 2, and then as henchmen (although both were women) in a couple of NwN1 modules, it's not a viable race for an NwN1 PC. Thus, we already run into problems.<br/>\n<br/>\nCoT/Pally and AN Other will likely be a sound idea (though not with Bard because of the alignment issues) - classically Fighter or Rogue, although I do love me some Monk: as would Pally/Sorcerer/RDD. It all really depends on what you want from the build - and no, you can't have everything I'm afraid. Regardless, it could well be very difficult to switch one build between the two games, as they do have different rules.<br/>\n<br/>\nA Paladin (or indeed - and maybe particularly - CoT) might seem predominantly defensive, but they're not. They may indeed have great defensive abilities, but the primary Pally attributes are all offensive, only they tend to work best in spurts - a blast of righteous fury followed by some down-time. If anything, RDD was brought in as a more defensive class - no longer would your Sorcerer or Bard be a physical weakling; no more would it need to hide behind the big nasties. So no, one is not strictly better than the other. As ever, it all depends upon how you want to play.<br/>\n<br/>\nAs to familiars and Sorcerers, don't worry about it, they're not mandatory - they'll only come if you summon them.<br/>\n<br/>\nAnd the ball is lobbed back to you...sorry.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "10:10 PM - Sep 12, 2017",
      "content": "<div>It's not an issue that Aasimar isn't in NWN1, that's a pretty easy headcanon switch so long as everything else is similar. Also, I don't mean to have the exact same build in both games, just similar. Like a Bard/CoT/RDD might be a Bard/RDD/Divine Champion in NWN2, etc.<br/>\n<br/>\nI think I'm leaning pretty heavily towards the RDD builds, I've found a couple on the wiki and here.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Paladin_26/_bard_4/_red_dragon_disciple_10\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Paladin_26/_b ... isciple_10</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/holy-smiting-dragon-bard-8-rdd-10-cot-22-t2354355.html\" rel=\"noreferrer\" target=\"_blank\">holy-smiting-dragon-bard-8-rdd-10-cot-22-t2354355.html</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-draconic-duel-master-bard-16-rdd-10-cot-14-t2354386.html\" rel=\"noreferrer\" target=\"_blank\">the-draconic-duel-master-bard-16-rdd-10 ... 54386.html</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/dragon-knight-divine-dragon-pal26-rdd10-bard4-t2294234.html\" rel=\"noreferrer\" target=\"_blank\">dragon-knight-divine-dragon-pal26-rdd10 ... 94234.html</a><br/>\n<br/>\nDo any of these stick out to you as being particularly good?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:35 PM - Sep 12, 2017",
      "content": "<div>Welcome to the ECB Bravadorado, it's better to answer your questions here than to the \"Holy smiting Dragon's\" thread, so let's begin.<br/>\n<br/>\nFirst you need to answer some questions about the environment you will be playing these builds, be it modules or a persistent world? That alone makes a big difference.<br/>\n<br/>\nSecondly you need to decide if you want your Paladin to have the ability to inflict Holy Smites, because a \"Smiter\" is a huge investment in the build and requires many sacrifices to be made in order to make him/her a one-hit-wonder. Generally speaking a \"Smiter\" is way more viable in a module's environemnt than in a persistent world with restricted resting because he/she can inflict those powerful hits only up to 3 times per rest.<br/>\n<br/>\nPaladins in Neverwinter Nights are powerful offensive warriors contrary to some beliefs, with the addition of Divine Might &amp; Shield those holy warriors can both inflict and take some serious punishment. Their spells are also quite potent giving them the ability to rise their \"Attack Bonus\" to very high levels. A properly build Paladin is a force to be reckoned with even without the addition of other classes.<br/>\n<br/>\nSome possible Paladin builds that keep true to the \"Warrior\" aspect are investing a bit into the \"Fighter\" class in order to augment their damage with the addition of \"Epic Weapon Specialization\". A true and tested such build is (Paladin 26/ Fighter 4/ Champion of Torm 10). These kind of builds usually go for high AB and Dmg and possible Devastating Critical without investing in the Smiting aspect. They are very powerful non the less. Another option is to replace the fighter with monk instead in order to gain evasion, use of monk gear and higher armour class via the \"full tamble\" skill of the monk. You lose the EWS however.<br/>\n<br/>\nOne last thing that differenciates the Nwn1 from Nwn2. You can only have 30 levels in the second game instead of 40 as in the original.<br/>\n<br/>\nConsider these and i will wait your answers before proceeding to good recommendation for your needs.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "11:14 PM - Sep 12, 2017",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nWelcome to the ECB Bravadorado, it's better to answer your questions here than to the \"Holy smiting Dragon's\" thread, so let's begin.<br/>\n<br/>\nFirst you need to answer some questions about the environment you will be playing these builds, be it modules or a persistent world? That alone makes a big difference.<br/>\n<br/>\nSecondly you need to decide if you want your Paladin to have the ability to inflict Holy Smites, because a \"Smiter\" is a huge investment in the build and requires many sacrifices to be made in order to make him/her a one-hit-wonder. Generally speaking a \"Smiter\" is way more viable in a module's environemnt than in a persistent world with restricted resting because he/she can inflict those powerful hits only up to 3 times per rest.<br/>\n<br/>\nPaladins in Neverwinter Nights are powerful offensive warriors contrary to some beliefs, with the addition of Divine Might &amp; Shield those holy warriors can both inflict and take some serious punishment. Their spells are also quite potent giving them the ability to rise their \"Attack Bonus\" to very high levels. A properly build Paladin is a force to be reckoned with even without the addition of other classes.<br/>\n<br/>\nSome possible Paladin builds that keep true to the \"Warrior\" aspect are investing a bit into the \"Fighter\" class in order to augment their damage with the addition of \"Epic Weapon Specialization\". A true and tested such build is (Paladin 26/ Fighter 4/ Champion of Torm 10). These kind of builds usually go for high AB and Dmg and possible Devastating Critical without investing in the Smiting aspect. They are very powerful non the less. Another option is to replace the fighter with monk instead in order to gain evasion, use of monk gear and higher armour class via the \"full tamble\" skill of the monk. You lose the EWS however.<br/>\n<br/>\nOne last thing that differenciates the Nwn1 from Nwn2. You can only have 30 levels in the second game instead of 40 as in the original.<br/>\n<br/>\nConsider these and i will wait your answers before proceeding to good recommendation for your needs.\n</div></blockquote>\n\nI'm just playing the base game campaignns with the expansions. No multiplayer or anything.<br/>\n<br/>\nI like using smite evil as a nuke for bosses, while being competent still at facing regular enemies without needing to rest before every fight (Even if it only takes 5 seconds). I like the idea of using smites and crits, I also like the idea of having high saves and immunities, I like having both high strength and high charisma, and lots of buffs to apply before fights. I actually like having charisma as my highest stat, but I'm okay if strength and charisma are roughly equal. I like dealing high (burst) damage with pretty good survivability more than having high survivability with pretty good damage.<br/>\n<br/>\nFighter (or monk)/paladin/CoT seems like a good option, as does Paladin (Or CoT)/Bard/RDD. I would like most of my levels to be in Paladin/CoT, with Fighter/Monk/Bard/RDD being obvious \"secondaries.\" I play paladins in most games, so I like them a lot, and I especially like their perks in NWN, particularly their spells and getting a Holy Avenger. However, if I'm part RDD, I like the idea of being CoT because of RP reasons (Torm is a dragon rider). I was really hoping I could have 4 classes to add in paladins for their spells and the holy avenger. I like Bard over Sorcerer, since adding a little swashbuckling and music to my character is never a bad thing. Sadly I don't like a lot of the Bard spells besides Bard Song and the ability score buffs. I think the RDD is really cool for the immunities and other bonuses, and it seems a lot more interesting than adding fighter or monk levels tbh. I don't actually like the dragon wings though lol, I wish it didn't have those or I could change the color.<br/>\n<br/>\nAs I said, the builds between the games just need to have a similar flavor with similar classes, they don't need to be exactly the same, so the level differences don't matter to me.<br/>\n<br/>\nDoes any of this help narrow down a build? Thanks for the help.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "7:20 AM - Sep 13, 2017",
      "content": "<div>It seems to me like your build is probably the best I'm going to get tbh, unless there's a comparable Paladin/X/X build I haven't seen. I've been reading around trying to understand things a bit more. With your build I get DevCrit to deal with the trash mobs, and massive smite crits for bosses. Good strength and Charisma, whereas other builds tend to go for one or the other. I also learned that I can hide the gross dragon wings with a cloak, which I didn't know about. And apparently you can use a Holy Avenger on any character so long as you have 25+ UMD? It does prompt me to ask though, is Holy Avenger a top tier weapon? I know it's pretty much the best thing in tabletop DnD, but I don't really know how the forge enchantments and stuff work in HotU. You say in your build that the weapon can be anything and that the axe is just your preference. My preference is Holy Avenger, followed by Enserric, and then Desert Wind? I like Bastard swords in theory but none of the ones I see listed on sites really appeal to me, though the sites might be incomplete. If I use a non-exotic weapon in your build that means I get an extra feat right?<br/>\n<br/>\nI do think I'll miss the paladin immunities, abilities, spells, and divine might/shield, but I guess I can't have everything.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:13 PM - Sep 13, 2017",
      "content": "<div>Just as a by the way - though you may know this already - the original campaign will only take you to around level 18, and SoU/HotU will get you to around level 28. You can download the Aribeth's Redemption modules from the Vault to play as a continuation of the OC, and that too will get your character to about level 28. If you want to stretch the build's development all the way to level 40, the Sands of Fate modules (again available in the Vault) are a good way to go after either SoU/HotU or the OC/Aribeth's Redemption. Another excellent module for single player that will take you from level 1 up to around level 36 is Aielund (you can read more about it in the Modules subforum here - but be aware that Dev Crit is disabled).<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:26 PM - Sep 13, 2017",
      "content": "<div>Take a look at <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/how-and-where-to-access-legacy-ecb-archives-t2354480.html\" rel=\"noreferrer\" target=\"_blank\">this thread</a> and <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/ecb-guild-filter-t2354531.html\" rel=\"noreferrer\" target=\"_blank\">this thread</a> to be able to search a lot of builds. There are several Paladin / Sorcerer / RDD builds, so one of them might fit your needs.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "10:19 PM - Sep 13, 2017",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>\nJust as a by the way - though you may know this already - the original campaign will only take you to around level 18, and SoU/HotU will get you to around level 28. You can download the Aribeth's Redemption modules from the Vault to play as a continuation of the OC, and that too will get your character to about level 28. If you want to stretch the build's development all the way to level 40, the Sands of Fate modules (again available in the Vault) are a good way to go after either SoU/HotU or the OC/Aribeth's Redemption. Another excellent module for single player that will take you from level 1 up to around level 36 is Aielund (you can read more about it in the Modules subforum here - but be aware that Dev Crit is disabled).<br/>\n<br/>\nCheers\n</div></blockquote>\n\nI didn't know that, you can't get to max level through the regular game expansions? So if I justr plan on playing the official game content I can only get to level 30, even if I do every quest? Does that mean I shouuld be looking at the mid-epic builds instead?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:39 AM - Sep 14, 2017",
      "content": "<div>No, afraid not - I was just as frustrated by that as you during my early playing (and I am a single player who hasn't yet become involved in persistent worlds). So yes, you could look at the mid-epic builds, but I really would suggest you download Aielund (free from the NwN Vault, and dead easy to install - even me, who is more than a little technologically challenged, as others will attest, found it straightforward). It's a much better story arc with some great henchies who won't let you down, and it will get you to about level 36/7. As far as I'm aware, the Sands of Fate modules I mention above are the only way to get to level 40 in single player mods, and it means playing the original game or expansions first, so that might appeal.<br/>\n<br/>\nI don't know if you know this either, but Shadows of Undrentide and Hordes of the Underdark, while following on from each other, are not meant as follow-ons from the original campaign. The idea is that you start SoU as a level 1 character, rather than importing your level 18 one from the OC. I didn't know myself the first time, and was mightily miffed to only get 47xp for killing a dragon I can tell you! You can do the OC and then HotU - there will be some disjunctions, but it's do-able.<br/>\n<br/>\nSo, my advice would be to download Aielund, Aribeth's Redemption and Sands of Fate from the Neverwinter Vault, rather than just go for a shorter level build.<br/>\n<br/>\nI just keep on bringing bad news - I'll have to walk around ringing a bell soon.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "12:52 AM - Sep 14, 2017",
      "content": "<div>I see, I'll check out the modules. If Dev Crit is desabled in them then it doesn't seem to make much sense to take a build using it. I'm really at a loss for what to do, then. Regular DnD has so many resources to help a player like me figure things out, particularly 5e has so many great class guides out there. It feels so much harder with NWN/NWN2 because there's so many classes and so many feats and directions to go, it seems like a tangled mess.<br/>\n<br/>\nI don't really understand what my options are for a paladin character :/</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:18 AM - Sep 14, 2017",
      "content": "<div>The full campaign in Nwn1 goes up to 27th to 28th level. There are only a handful of modules that go beyond that range, because DnD in general breaks down at epic levels. This is a fundamental flaw in the original DnD rules and not of Nwn's. Having said that, the quality and enjoyment you get from a module has little to do with it's maximum level. You are right to want to look at level 30 sub-forum builds, these are optimized better for that range and in general don't wait to power up at the end of the build. So, have a look at these builds in there and see if you like something, if not then we can make a Paladin suited to your needs, unfortunately the less levels you have to work upon the harder is to get many things in one build as you have guessed by now. The Holy Avenger sword is a very good (if not the best) sword that you can get in pre-epic levels, of course since Nwn1 goes up to 40th level there are much better options out there once you get past that point, do not worry you will find them out in time.<br/>\n<br/>\nThe other option you have is to go for the Aielund Saga. This is a series of modules that were made after the official campaign and they are generally considered to be the best of the best out there. Having played them, i totally agree with that, Aielund makes the official campaign to look almost childish in comparison but i would still not skip on the SoU =&gt; HoTU campaign. There is much to learn there and it has a sufficiently epic scope by itself. It is also much easier than Aielund or other modern modules and will serve better as an introductory module for you.<br/>\n<br/>\nAlongside the SoU =&gt; HoTU campaign there is also another and very classic module that is ideal for a Paladin character. That is the \"Lord of Terror - The Diablo Campaign\" and it is basically a faithful remake of the Diablo 1 game in the Nwn1 engine complete with sounds and story. You can find more information about that in the \"Modules\" section. This is also a module that finishes at about the same (27th -28th) level as the HoTU so if you decide you want a character optimized for that range you have multiple options to select from.<br/>\n<br/>\nNow, having narrowed down what level about your character is about to end his carrier and the environment that you are going to play him/her, then we can make some critical decisions about the build. <br/>\nFirst of all we can exclude \"Great Smite\" from your build since this is too costly and comes very late to the build to actually matter. You will still be able to deal your regular smites however, so all is not lost.<br/>\nSecondly we will have to exclude \"Devastating Critical\" from the build as well, since that also comes at the earliest of 24th level (thereabout) and in many modules is either not allowed (aielund) or nerfed to the ground because of the type of enemies that you are going to face (Sands of Fate).<br/>\nGood thing that a properly build Paladin has no need from these two to deal with his enemies eh? His combat spells and his Divine Abilities more than make up for the loss of those. Your Paladin's abilities can be further augmented with the aid of Champion of Torm class. CoT has a \"Divine Wrath\" ability that is based on Charisma and since your hero is going to be looking \"Heavenly good\" he is a natural choice for this combo. As a natural third choice comes the Fighter to gives us his Weapon Specialization ability but in truth we do not need him because we are going to do a lot of damage with our buffs and divine might, so instead we can opt for Monk. Apart from giving our Holy warrior a more sophisticated look he can gives us better armour class as well. You see Monk can use some special equipment that normal warriors cannot use (Sun Soul boots) and with him being profficient in the use of \"Tumble skill\" we can expect at least 5 more AC till 27th level. What best Monk will also gives free cleave as a feat and the much needed evasion.<br/>\n<br/>\nAs you see, i am advising a (Paladin/ Monk/ CoT) for your Holy warrior and for a good reason. Forget \"Torm\" in the name of the class, it can be any other God's name as you RP it. The class is very good to combine with your Paladin, same with Monk or Fighter. But i am afraid i talk too much and i might confuse you with explanations you do not need to know from now. Give it a thought and decide what you are going to play then give us your feedback and we will make the best we can.<br/>\n<br/>\n~~ Swords, not words!</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "5:59 AM - Sep 14, 2017",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nsnip\n</div></blockquote>\n\nI think everything you said makes sense. I probably won't do the modules, mostly because I wanted to play NWN to play NWN, not something other people added on, even if it's good. There's other games I could play, such as NWN2, instead. I might check out the diablo one, but it sounds like I would make a new character for that anyway. So I think you're right on the level 30 builds, that's less to worry about build wise anyway.<br/>\n<br/>\nThanks for the class advice, it is probably a good idea to keep it simple. Are the sun soul boots very good? I remember seeing them the last time I played a long time ago, but I also remember having boots of speed that gave perma-haste which was incredibly useful. I believe haste also gives AC, is there an easier way to get perma-haste that makes the sun soul boots worth it?<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Monk_1/_paladin_9/_champion_of_Torm_30\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Monk_1/_palad ... of_Torm_30</a><br/>\n<br/>\nThis is the paladin/monk/CoT build I'm familiar with from the wiki, and I believe it's the character I started in my short playthrough forever ago. I don't really like that it starts as Monk level 1, as NPCs in game called me \"Monk\" for the rest of the game if I remember correctly. Is it possible to do either a paladin/fighter/cot or paladin/monk/cot build that takes paladin at level 1 instead of the other class? I'd also like to have a bit more strength than that build has, but I'm not sure it's necessary.<br/>\n<br/>\nIn any case I think what you're proposing sounds good. The only items I know of that I'd really like to use are the Holy Avenger, the Searing Armor, and the Boots of Speed (Or another perma-haste item). I imagine you're right about the monk being a better choice, if you could show me the build you had in mind that would be awesome. And just out of curiosity, is there any kind of paladin build that dual wields with high crit but doesn't use stealth? I've had fun in other games with something similar to that, might be worth a try here if it's possible.<br/>\n<br/>\nThanks for all the help!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:58 PM - Sep 14, 2017",
      "content": "<div>Having had an albeit cursory look at the build you cite on the wiki, and not a Pally player, I'm not over-impressed by it, but I'll confine my comments more to the Monk areas, where I feel more comfortable (and Empyre and Valerfor will correct any mistakes I make, I'm sure).<br/>\n<br/>\nThe reasons the build starts with Monk are entirely practical ones. Apart from getting the Cleave and Evasion feats for free right at the beginning, you get twice the amount of skills points to allocate at level 1 (admittedly only 16 rather than 8), and you get the 4 points in Tumble straight away - effectively saving you a further 4 points - in what is a skill-starved build in any case (only 137). However, I can see a good case for putting it back to level 2, because you'd still get the free feats then and you'd be able to take 5 points in Tumble for +1AC. Regardless, I think only 1 level of Monk is missing a trick - at least 2 levels would be better (I'd probably go for more, but that's just me), with the final one coming late on in the build so you can max that Tumble AC bonus (up to +8) without it costing you twice the amount of skill points.<br/>\n<br/>\nThe Sun Soul boots (Monk-specific, given you won't have UMD) are excellent. If I remember correctly, in the OC and SoU they cap at +5, but I seem to recall +7s in HotU. Anyway, just focusing on the +5 boots, they not only give +5 to AC but also +2 to DEX, which is another +1 to AC, so that's +6 in total, which is immense. There are indeed other perma-haste items out there (a chain mail comes to mind), and Rizolvir (a smith in the Underdark and again in Cania in HotU) can add perma-haste to a weapon for you.<br/>\n<br/>\nI'll leave other things to wiser heads than mine.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "11:50 PM - Sep 14, 2017",
      "content": "<div>I see. Yeah I'd really prefer not to start out as a monk just because the dialogues will trigger me lol. If there's a case for picking it up at second level I'd vastly prefer that. I actually also dislike that the build only has one level in monk, but because I think it just feels bad and cheap to only invest one level in a multiclass. If I can take two levels or even a few more that's good with me. After comparing the sun soul boots to the other ones on the website I'm using, they do seem really good, especially if I can get haste elsewhere.<br/>\n<br/>\nThanks again.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:00 AM - Sep 15, 2017",
      "content": "<div>Alright, here is your Paladin Bravadorado and there is a lot to answer from your posts but i would rather focus on the build for now and let Stag (who is admittedly doing a fine job with it) fill-in the gaps.One note for this Paladin though, that i should mention. This is not an easy build to play in its full potential. This Paladin has three distinct divine abilities, has spells to buff, has knockdown to shut-down enemy spell-casters, has turn undead, lay on hands and even some smites. He can also persuade people and even effectively use medical kits or taunt his enemies to lower their defenses significantly. Do you need to use all these abilities to win your fights? Nah, not even close. But you would be glad to know that the potential is there should you want to use them.<br/>\n<br/>\n(Paladin 16/ Monk 2/ CoT 10)<br/>\n RACE: Human<br/>\n ALIGNMENT: Lawful Good<br/>\n PLAYABILITY: PvE 1-28th<br/>\n<br/>\n STARTING/ ENDING STATS:<br/>\n STR  – 16 (20)<br/>\n DEX –  08<br/>\n CON – 12<br/>\n INT   – 12<br/>\n WIS  – 14<br/>\n CHA – 14 (20)<br/>\n<br/>\n Hit Points: 304<br/>\n<br/>\n Skill Points: 128<br/>\n Discipline: 31 (36)<br/>\n Heal: 17 (19)<br/>\n Taunt: 31 (36)<br/>\n Tumble: 30 (29)<br/>\n Persuade: 19 (24)<br/>\n<br/>\n Saving Throws (Fort/Ref/Will): 30/ 24/ 24<br/>\n Saving Throws (Fort/Ref/Will): 36/ 30/ 30 → (With +12 Charisma) <br/>\n<br/>\n Naked/ Armoured AC: 17/ 28 (Plate Armour &amp; Tower shield) <br/>\n<br/>\n BAB: 23 (Four attacks)<br/>\n AB:  +32/ +27/ +22/ +17 (Longsword)   <br/>\n DMG: 1D8 +5/ 17-20 X2 (Longsword)<br/>\n<br/>\n<br/>\n Spellcasting: Paladin 4th Lvl of Spells<br/>\n<br/>\n Lay on Hands: 130 HP's/ 286 HP's<br/>\n Smite Evil 3X Day: +5 (+11) Attack/ +26 Damage<br/>\n Divine Shield: +5 AC for 5 rounds/ +11 AC for 11 rounds<br/>\n Divine Might: +5 Dmg for 5 rounds/ +11 Dmg for 11 rounds<br/>\n Divine Wrath: +5 Attack/ +5 Divine Damage/ +5 All Saves/ Dmg Reduction 5/+1<br/>\n<br/>\n LEVELING GUIDE:<br/>\n 01) Paladin (01): Power attack, Weapon Focus: Longsword<br/>\n 02) Paladin (02):<br/>\n 03) Paladin (03): Divine Shield<br/>\n 04) Paladin (04): (+1 Charisma)<br/>\n 05) Paladin (05): <br/>\n 06) Paladin (06): Divine Might<br/>\n 07) Monk (01): Cleave, Evasion<br/>\n 08) Paladin (07): (+1 Charisma)<br/>\n 09) Paladin (08): Extra Turning<br/>\n 10) Paladin (09): <br/>\n 11) Paladin (10): <br/>\n 12) Paladin (11): Extend Spell, (+1 Strength)<br/>\n 13) Paladin (12): <br/>\n 14) Paladin (13): <br/>\n 15) Paladin (14): Extra Smiting<br/>\n 16) Paladin (15): (+1 Strength)<br/>\n 17) Champion of Torm (01): <br/>\n 18) Champion of Torm (02): Knockdown, Blind Fighting<br/>\n 19) Champion of Torm (03): <br/>\n 20) Champion of Torm (04): Improved Critical: Longsword, (+1 Charisma)<br/>\n 21) Champion of Torm (05): Great Charisma I<br/>\n 22) Champion of Torm (06): Epic Weapon Focus: Longsword<br/>\n 23) Champion of Torm (07): <br/>\n 24) Champion of Torm (08): Great Charisma II, Armour Skin, (+1 Charisma)<br/>\n 25) Champion of Torm (09): <br/>\n 26) Champion of Torm (10): Epic Prowess<br/>\n 27) Monk (02): Great Strength I<br/>\n 28) Paladin (16): (+1 Strength)<br/>\n<br/>\n SPECIAL NOTES:  <br/>\n * Immune to Fear and Disease<br/>\n * Evasion<br/>\n<br/>\n SPELL SLOTS: <br/>\n 1ST) 3x Bless Weapon (for undead)<br/>\n 2ND) 3x Extended Divine Favor (major combat buff)<br/>\n 3RD) 1x Extended Aura of Glory (major boost to charisma)<br/>\n 4TH) 1x Extended Prayer (major combat buff)</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:29 AM - Sep 15, 2017",
      "content": "<div>Some ease-of-use haks, you can copy the build and paste it on your journal so you can view it anytime you want (tip from Empyre).<br/>\nAlso as you may have noticed, this build guide is optimized for use in just 28 levels, in other words tailored exactly to your needs, no excess levels anywhere on it.<br/>\n<br/>\nThe Spell Slots, is just a guide, not set in stone. You can of course change your spells as you see fit. Same with your skills, the only vital skills are \"Discipline\" and \"Tumble\", everything else is just an extra.<br/>\nThe Monk feats in 7th level are automatically gained, you do not need to select them.<br/>\n<br/>\nAs for your dual-wield Paladin with high criticals... It's too much to ask in addition to all the other feats a Paladin must have and in only 28 levels.<br/>\nPaladins are in general considered to be a MAD (Multiple Attribute Dependancy) class and adding dual-wielding requires you to have a natural 15 Dexterity. That and three feats more for it.<br/>\nIt's a logistics nigthmare, but yes, i can do it.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "2:14 AM - Sep 15, 2017",
      "content": "<div>Thanks! This looks good, just one question, what levels should I put points in tumble?<br/>\n<br/>\nAs for the DW paladin, would there be a way to do it without the paladin class? Like maybe CoT and some combination of Fighter/Rogue/WeaponMaster/ShadowDancer/Assassin/Monk/Ranger or something? Maybe CoT/Monk/WM? My goal would be for it to have dual wielding and good critical smites, like your CoT/RDD build. It can be pretty damage focused, too, but I still want to wear that Searing Armor (Heavy I think).</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "3:43 AM - Sep 15, 2017",
      "content": "<div><a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/primeval-champion-ranger-26-fighter-4-champion-of--t515470.html\" rel=\"noreferrer\" target=\"_blank\">primeval-champion-ranger-26-fighter-4-c ... 15470.html</a><br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/kukri-master-fighter-8-weapon-master-22-champion-o-t515467.html\" rel=\"noreferrer\" target=\"_blank\">kukri-master-fighter-8-weapon-master-22 ... 15467.html</a><br/>\n<br/>\nI found these two, which look kind of like what I'm talking about, but they are too high level.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:52 AM - Sep 15, 2017",
      "content": "<div>Right, a good question and one that demands a full answer just so you know in general.<br/>\n<br/>\nUnless i write that a skill must be taken cross-class (cc) beside the skill (sometimes i forgot), then you only ever take skills when your class have them as class skills.<br/>\nExample: Tumble is a class skill only for Monk from these three, so you only put points in it at the 7th &amp; 27th level in this build. Tumble gives +1 AC per 5 ranks on it.<br/>\nExceptions do exist for this rule and generally have to do with pre-requisites of various prestige classes but 9 out of 10 the above rule is correct.<br/>\n<br/>\nI can't find that searing armour on gamebanshee, maybe you mean the silverbone armour or something. Does not matter there are better, far better ones, trust me on that. Holy Avenger on the other hand, yes that is both a potent weapon &amp; the status symbol of a Paladin and you are right to want it direly. There is one in SOU but you will have to find it. This cannot be bought from a vendor (as it should be). <br/>\n<br/>\nDW is taxing on a build but a (fighter/rogue/wm) or a (fighter/monk/cot) can do it easily. The challenge was to make it with a Paladin ha ha.<br/>\n<br/>\n<br/>\n~~ Justice is not blind, for i am her eyes!</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "4:04 AM - Sep 15, 2017",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nRight, a good question and one that demands a full answer just so you know in general.<br/>\n<br/>\nUnless i write that a skill must be taken cross-class (cc) beside the skill (sometimes i forgot), then you only ever take skills when your class have them as class skills.<br/>\nExample: Tumble is a class skill only for Monk from these three, so you only put points in it at the 7th &amp; 27th level in this build. Tumble gives +1 AC per 5 ranks on it.<br/>\nExceptions do exist for this rule and generally have to do with pre-requisites of various prestige classes but 9 out of 10 the above rule is correct.<br/>\n<br/>\nI can't find that searing armour on gamebanshee, maybe you mean the silverbone armour or something. Does not matter there are better, far better ones, trust me on that. Holy Avenger on the other hand, yes that is both a potent weapon &amp; the status symbol of a Paladin and you are right to want it direly. There is one in SOU but you will have to find it. This cannot be bought from a vendor (as it should be). <br/>\n<br/>\nDW is taxing on a build but a (fighter/rogue/wm) or a (fighter/monk/cot) can do it easily. The challenge was to make it with a Paladin ha ha.<br/>\n<br/>\n<br/>\n~~ Justice is not blind, for i am her eyes!\n</div></blockquote>\nMakes sense. The Searing Armor isn't on gamebanshee for some reason, but I know it exists because when I was like 10 I played NWN and started in HotU and I was a horrible player so I used debug mode and other things during the short time I played it. Anyway there's a certain ruins area in a desert I believe which is where you find the armor. It is golden, gives off a light radius, and shoots light beams. You can find it in this guide if you search Searing <a class=\"postlink\" href=\"https://www.gamefaqs.com/pc/188666-neverwinter-nights/faqs/51555\" rel=\"noreferrer\" target=\"_blank\">https://www.gamefaqs.com/pc/188666-neve ... faqs/51555</a><br/>\n<br/>\n- SEARING ARMOR:<br/>\nBase AC: 8<br/>\nMax. Dex Bonus: 1<br/>\nArmor Check Penalty: -8<br/>\nArcane Spell Failure: 45%<br/>\nFeat Required: Heavy Armor<br/>\nSpecial Properties: Armor<br/>\nBonus +5 (AC Armor Modifier);<br/>\nLight Bright (20m) Yellow; On<br/>\nHit: Searing Light Level 5;<br/>\nOnly Useable by Elf, Half-Elf,<br/>\nHalf-Orc, Human<br/>\n<br/>\nI just remember loving the look and feel of this armor, it's one of the main reasons I want to play through the game to be honest, so I can find it and use it for real.<br/>\n<br/>\nWhat classes would you suggest would be best to combine with CoT to get a DW-Scimitar critical smiter? Are Fighter/Rogue or Fighter/Monk the only options? The ones I linked above utilize WM and Ranger, though they are level 40 so I'm unsure. Also, this character can be an Elf if it's better than Human.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "4:16 AM - Sep 15, 2017",
      "content": "<div>Forget the ranger one, I'm not really interested in the class. I thought it might be cool if I could use a pet lion or something but nope lol. Still seems like the Weapon Master one is really good though.<br/>\n<br/>\nI'm not really sold on Rogue either since I don't plan to use Hide/Stealth/Poisons/etc at all. UMD would be really good to use the sun soul boots and the holy avenger, but I could just take Monk for the boots, and Holy Avenger isn't a great critical weapon so I would rather use scimitar for this type of build, unless I can dual wield Holy Avengers lol, that would be sweet as hell.<br/>\n<br/>\nI think (Fighter/Weapon Master/CoT) or (Fighter/Monk/CoT) or (Monk/Weapon Master/CoT) are the ones I'm most interested in, if they can work. Maybe (Fighter/Rogue/CoT) if being Rogue means I can DW Holy Avengers (And assuming that's a good thing to do instead of dual wielding scimitars). Or maybe Bard works better for that instead of Rogue? It just needs to be CoT if it can't be a paladin, because I still want Smite/Divine Wrath/LoH.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "4:46 AM - Sep 15, 2017",
      "content": "<div>So in summary:<br/>\n<br/>\nPrimary Class: <br/>\nCoT as the main class for paladin-ness (Smite/Divine Wrath/LoH).<br/>\n<br/>\nSecondary Class:<br/>\nMonk in order to get Boots of the Sun Soul and Evasion/Tumble (If Crit Scimitars is the way to go).<br/>\nRogue in order to get Evasion and UMD (If dual Holy Avengers is possible and a good idea).<br/>\nBard in order to get Bard Song and UMD if Rogue relies too much on Hide/Poison/Etc (I personally prefer Bard over Rogue)<br/>\n<br/>\nTertiary Class:<br/>\nFighter to get extra feats and stuff.<br/>\nWeapon Master to get all the juicy crit bonuses and mobility and such.<br/>\n<br/>\nThis character would use heavy armor, either dual longswords or dual scimitars, be focused on criticals hits and critical smites, and would have high-ish charisma. Which of the previously listed combinations would be able to do this the best?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:57 AM - Sep 15, 2017",
      "content": "<div>Ah, you must be talking about that armour that you get from the golem island in a mission of HoTU. Yeah thats an epic armour that is +5 full plate that strikes back with a low level searing light effect whoever hits you. Its a good one aye but there are better in HoTU, Casie's Soul, The Iron Skeleton, Lesser Golem armour, etc. Still if you liked it as a kid and you are fond of it then you can have it with almost any build apart from those that use Dexterity as thier primary stat and thus need Robes to get the best AC they can. As for the looks you can change how you look within the game and make yourself more comfortable. There are even dyes to change your colors so you look as shiny or menacing as you like.<br/>\n<br/>\nAs for the DW build, you can have it within 28 levels but you are confusing Smites with criticals. If you want to do a Smite on your opponent that is fine, a Paladin can do that from 1 to 3 times per day just fine. You pop a button and you add for that strike your level to the damage and your charisma bonus to your attack. If this was a critical hit and the creature is not immune to them, then you multiply your (total) damage by the ammount your weapon has. Now this is all well and good but when we here refer to a \"Smiter\" we mean another thing entirely.<br/>\n<br/>\nA <span style=\"text-decoration:underline\">Great </span>Smiter is one that has taken the epic feats in order to multiply the damage his base Smites do. It can go high, very high. In \"Holy Smiting Dragon\" i take this feat 6 times and that could easily be further optimized to as much as 9 times for a tenfold multiplication of your base Smites damage. In a critical hit that gets multiplied further and you could see even four digit-numbers in a single hit! But, that requires dedication as its pre-requisite is extremely tough. You have to have a base unmodified 25 Charisma before you even can take the first \"Great Smite\" feat. Since your Charisma needs to be that sky-high everything else goes to secondary role and even then it comes late and it is meant to be played in a PW where you can continue playing after you reach high levels. It is also used frequently in high-level PvP, that also happens in PW's since there are only two modules in Neverwinder Nights that permit you to have VHL characters running around and fight other builds. There are also exactly two modules that this can be played, Aielund &amp; Sands of Fate. But this build cannot be done in the short span of just the official campaign there is simply to little room in 28 levels to build a <span style=\"text-decoration:underline\">Great </span>Smiter.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "5:10 AM - Sep 15, 2017",
      "content": "<div>I might change my mind on the armor if the dyes are good and I find one I like more, but as of now it's one of my staple end game goals.<br/>\n<br/>\nIf you hit with a smite, and the attack is a critical hit, it will multiply the smite damage, right? That's all I mean when I say critical smiter. Someone who crits often, and also has smites, so that maybe those smites crit for a fair amount of extra damage. Great smiting would make it a whole lot better, but getting a crit on a smite is always better than not getting a crit on a smite, right? It's fine if it's just the base smite since I only have 28 levels.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:48 AM - Sep 15, 2017",
      "content": "<div>Dual-wielding scimitars is fine but longswords are cool too. I remember one of my first characters in HoTU, he was a Ranger with dual longswords, he was cleaving left &amp; right so fast the eye could not follow... You can pair the Holy Avenger with the Astral Blade which is a fine weapon by itself and looks cool as well. That sonic damage is almost never resisted.<br/>\n<br/>\nThe critical hits in Neverwinter Nights multiply everything except \"extre damage\" sources like sneak attack, or massive criticals. The extra elemental damage on a weapon, the smite and the rest are all multiplied in whole.<br/>\n<br/>\nRogue is taken in many builds not because he is stealthy or can lay down traps (although he can do those too) but because he has both \"Tumble\" &amp; \"UMD\" as class skills and at 2nd level he gives you Evasion. That is why my friend here the (fighter/rogue/cot) is considered to be one of the best universal builds. He can do (almost) everything and without incurring an Exp penalty or changing alignments. But as i said you can have a (paladin/monk/cot) that dual-wields in 28 levels too. It is tough but it can be done. A (fighter/rogue/cot) would have better raw AB (Attack Bonus) and damage, but the (paladin/monk/cot) will have all the divine feats (divine might &amp; shield are exclusive to paladins and clerics only) and better saving throws, apart from being immune to fear.<br/>\n<br/>\nHope that helps,</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "6:05 AM - Sep 15, 2017",
      "content": "<div>Scimitars seem like a good idea since the crit range is higher, but the longswords seem cool too. I think I'll go with the longswords then.<br/>\n<br/>\nYeah, I don't need great smites, I just want a DW character who does heavy crits and also has smites.<br/>\n<br/>\nIf I do fighter/rogue(or bard)/CoT, how fast can I pick up the CoT levels to feel more paladin-y? Is the difference between Rogue/Bard in this kind of build just Evasion vs Bard Song/Bard Spells? If the choice is Fighter/Bard/CoT or Fighter/Rogue/CoT, I'd rather go with the bard variant. Is Rogue strictly better than Bard in this kind of build?<br/>\n<br/>\nI imagine a Paladin/Monk/CoT will be pretty hard to get the character online in a short amount of time, and I'd rather do more damage than be more tanky. Although if you think divine might/shield/grace and paladin spells are worth it, I would consider it more.<br/>\n<br/>\nDo you think Weapon Master doesn't have a place in this kind of build? Could Fighter possibly be replaced with WM? I guess it makes me pretty MAD due to the INT requirement, but it seems pretty good for a crit build.<br/>\n<br/>\nThanks for all this help by the way!</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:59 AM - Sep 15, 2017",
      "content": "<div>Weapon master is a tough nut to crack, he is awesome but he requires no less than 7 feats just to qualify for the class and a 13 Intelligence as well. Dual-wielding requires another 3 feats and a 15 Dexterity too. Those are just the pre-requisites. Then you need the standard combat feats as well in order to be really effective (blind-fight, improved critical etc). A character takes a total of 7 feats throughout his life (in 18 levels) plus 1 more if he is a Human. See now why we need Fighter or CoT as one of the three classes in the build when we plan to take Weapon master?<br/>\n<br/>\nNo, rogues is not strictly better than the bard, just different. Both are equally good.<br/>\n<br/>\nYou can also have a look to level 20 sub-forum builds and see if you like something from there. Then play the classic \"plague\" campaign in Neverwinter and make another character for SOU to HoTU campaign. The original campaign is the best to get you in the game, you can expect to reach about level 17 by the end of it and then you can import your character to another module and continue from there.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "7:06 AM - Sep 15, 2017",
      "content": "<div>Yeah, I see how that would be a pain. So if I wanted Weapon Master and DW it would probably have to be really similar to the Kukri build, with Fighter/CoT/WM. In which case I'd have to use Scimitars and no Evasion, Tumble, or BotSS. Maybe it is an awful lot to try to do in 30 levels.<br/>\n<br/>\nWould you say that if I go Bard it would make more sense to take RDD like your build instead of Fighter? Or will fighter be better anyway for the bonus feats in the case of DWing?<br/>\n<br/>\nI definitely want to take one character through all the campaigns, I'm sure it'll get a little easy in the middle but I'm not really playing for the difficulty.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "7:59 AM - Sep 15, 2017",
      "content": "<div>After some thought I've decided to go for Rogue. Bard is nice but I don't think the Bard Song makes up for the loss of Evasion without significant investment in bard levels, which are frankly better spent elsewhere. The Bard spells have a high chance to fail with my armor, and most of the important ones (Animal Buffs, Haste, Keen) can all be replicated easily with items or potions. Also, while the Bard gives a \"support\" aspect that I enjoy, I don't really have enough party members to support to make it worthwhile, and the Rogue adds the assassin aspect I enjoy which the Bard doesn't quite have.<br/>\n<br/>\nWould it be possible for you to craft me a DWing Fighter/Rogue/CoT build? It needs over 25 in UMD I think.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:47 PM - Sep 15, 2017",
      "content": "<div>Long ago, I played a build in SoU, HotU, and Sands of Fate (which gets you the rest of the way to level 40) and there was just a little bit of paladin in the build solely for the purpose of using the Holy Avenger. UMD will allow you to use the Holy Avenger, but the quest in SoU to get it is only available to Paladins, and there is none to be had in HotU. However, I the encountered Enserric the longsword, and that was a better sword than the Holy Avenger (The Holy Avenger was nerfed in the final patch, 1.69, and Enserric's vampiric regeneration is awesome, and he is a talking sword, how cool!), so basically all I really got out of the one or two Paladin levels was immunity to Fear.<br/>\n<br/>\nWhen dual wielding, it is advantageous to use a light weapon in the off hand (one size smaller than you: small or tiny for medium-size races, only tiny for small-size races), and you can see here: <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Dual-wield\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Dual-wield</a> Your attack penalty for dual-wielding is lowered by two when your off-hand weapon is light. Unless you want to take the full line of feats for two weapons, you will be using the same kind of weapon in your main hand, which is good if you go for a DEX-based character with Weapon Finesse.<br/>\n<br/>\nWhen you first encounter Enserric, you can tell him that you don't need a longsword, and he will offer to transform into another weapon. The options are dagger, shortsword, and greatsword, which is great for a dual-shortsword (or dual-dagger) Rogue.<br/>\n<br/>\nJust some things to think about...</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:21 PM - Sep 15, 2017",
      "content": "<div>\"<em>Would it be possible for you to craft me a DWing Fighter/Rogue/CoT build?</em>\"<br/>\n<br/>\nYes, that's easy but you will probably not like it that much and i will tell you why. <br/>\nThe only thing that Charisma will affect in this build would be your smites &amp; your divine wrath's duration. In a Paladin's build Charisma affects those but also the power and duration of your divine shield &amp; divine might, your saving throws and also your ability to taunt your opponents. There is so much more to be gained by having a high Charisma is a Paladin's build.<br/>\n<br/>\nA (fighter/rogue/cot) though would make an excellent combat machine, DW included if you like, just there is not much to be gained by spending precious attribute points in Charisma. They need to be spend in rising Strength instead. The CoT will take care of your weak saves, even without having a high Charisma at all. The Rogue will give you Evasion &amp; UMD &amp; Tumble as class skills. The Fighter will give you Heavy armour and most importantly Weapon Specialization and later the Epic version of it.Yeah you won't have smite or fancy divine stuff but you will be able to use whatever you like and you will be incredibly effective in combat regardless. The social stuff can be handled by Rogue's skills just fine. This is a multi-purpose tool, it can do everything and can do it well.<br/>\n<br/>\nYou just need to prioritize your needs and decide what's most important to you.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "10:37 PM - Sep 15, 2017",
      "content": "<div>So in order to utilize charisma I'd need to do the Paladin/Monk/CoT build? Would it be possible to do Paladin/Rogue/CoT instead and get UMD for the boots? I really don't care about having the heal skill, so the points spent there can go into UMD.<br/>\n<br/>\nCan you build a good paladin/rogue/CoT build that dual wields longswords and everything in 28 levels?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:54 AM - Sep 16, 2017",
      "content": "<div>Alright, here is a different approach to the situation. This is what i call a \"Commando\". <br/>\nHe doesn't do fancy stuff nor does he care, all that he cares is about efficiency. The Commando's strength comes from his willpower alone, Torm is just a name for him, all that he knows is that most spells simply fail to affect him. He wears the heviest armour possible but doesn't use a shield, he prefers to shred his opponents to bits with his dual blades leaving them no time to react. He is multi-talented, he needs to be because the battlefield isn't a place for the weak, so he does everything alone to ensure it is done correctly. He hears the footsteps of his opponents before they see him, his senses are so good that no trap can catch him off-guard. In his travels he learned many strange things, he can read arcane runes and operate any magical device possible, even holy relics kept secret for long. For all his deeds he is still  a smooth-talker and usually others find themselves agree to his views before they know it.<br/>\n<br/>\nFighter 12/ Champion of Torm 10/ Rogue 6<br/>\nRace: Human<br/>\nAlignment: Any non-Evil<br/>\nPlayability: PvE 1-28th<br/>\n<br/>\nSTARTING/ ENDING STATS:<br/>\nSTR – 16 (26)<br/>\nDEX – 15<br/>\nCON –14<br/>\nINT –  14<br/>\nWIS – 08<br/>\nCHA –08<br/>\n<br/>\nHit Points: 340<br/>\n<br/>\nSkill Points: 201<br/>\n<br/>\nDiscipline: 30 (38)<br/>\nListen: 21 (20)<br/>\nSearch: 13 (15)<br/>\nOpen Locks: 13 (15)<br/>\nDisable Traps: 13 (15)<br/>\nUMD: 31 (30)<br/>\nPersuade: 24 (23)<br/>\nSpellcraft: 13 (15) cc<br/>\nTumble: 30 (32)<br/>\n<br/>\nSaving Throws (Fort/Ref/Will): 24/ 24/ 17<br/>\n<br/>\nSaving Throws (Fort/Ref/Will): 27/ 27/ 20 → (saves Vs spells)<br/>\n<br/>\n<br/>\nNaked/ Armoured AC: 20/ 27 (Full Plate Armour)<br/>\n<br/>\nBAB: 23 (Four attacks/ Six attacks while dual-wielding)<br/>\n<br/>\nAB: +33/ +28/ +23/ +18 &amp; +33/ +28 (Dual Short-Swords)<br/>\n<br/>\nDMG: 1d6 +14 &amp; 1d6 +10 / 17-20 x2 (Dual Short-Swords)<br/>\n<br/>\n<br/>\nSpellcasting: Use Magic Device for items worth up to 1 million gp.<br/>\n<br/>\nCombat Feats: Power attack, Expertise, Improved Knockdown, Called-Shot Arms/Legs<br/>\n<br/>\nLEVELING GUIDE: <br/>\n01) Fighter (01): Power attack, Weapon Focus: Short-Sword, Luck of Heroes<br/>\n02) Fighter (02): Cleave<br/>\n03) Fighter (03): Ambidexterity<br/>\n04) Fighter (04): Weapon Specialization: Short-Sword, (+1 Strength)<br/>\n05) Fighter (05): <br/>\n06) Rogue (01): Two-Weapon Fighting<br/>\n07) Rogue (02): <em>Evasion</em><br/>\n08) Fighter (06): Blind Fighting, (+1 Strength)<br/>\n09) Champion of Torm (01): Knockdown<br/>\n10) Champion of Torm (02): Improved Knockdown<br/>\n11) Champion of Torm (03): <br/>\n12) Rogue (03): Improved Two-Weapon Fighting, (+1 Strength)<br/>\n13) Champion of Torm (04): Improved Critical: Short-Sword<br/>\n14) Champion of Torm (05): <br/>\n15) Champion of Torm (06): Toughness, Expertise<br/>\n16) Champion of Torm (07): (+1 Strength)<br/>\n17) Rogue (04): <br/>\n18) Champion of Torm (08): Iron Will, Called-Shot<br/>\n19) Champion of Torm (09): <br/>\n20) Fighter (07): (+1 Strength)<br/>\n<br/>\n21) Champion of Torm (10): Great Strength I, Epic Weapon Focus: Short-Sword<br/>\n22) Fighter (08): Epic Weapon Specialization: Short-Sword<br/>\n23) Rogue (05): <br/>\n24) Fighter (09): Great Strength II, (+1 Strength)<br/>\n25) Fighter (10): Epic Prowess<br/>\n26) Fighter (11): <br/>\n27) Fighter (12): Great Strength III, Armour Skin<br/>\n28) Rogue (06): (+1 Strength)<br/>\n<br/>\nSpecial Notes: <br/>\n<br/>\n* Sneak Attack +3d6<br/>\n* Evasion<br/>\n* Open Locks<br/>\n* Uncanny Dodge<br/>\n* Trap Finding/Disarming</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:54 AM - Sep 16, 2017",
      "content": "<div>Notice in the second build how earlier some combat feats come, his AB is higher than the first build's even though he gets -2/-2 because he dual-wields. His base Dmg is likewise almost equal to a buffed Paladin's. He has many more tricks up his sleeves as well and his saves even though they are somewhat less than a holy warrior's they are still very respectable. He had evasion &amp; use magic device so he can use almost anything that comes his way, sun soul boots and special armours included.<br/>\n<br/>\nThe choice of weapons is a proven one, there are some very good short-swords to be found including the famous \"short-sword of quickness\" and the \"feyduster\". But if you want a different weapon it's your choice, you could even go for an exotic one if you like, i hear that two-bladed swords are very nice for example...That would require an additional feat but this is trivial in a build like that where the feats flow abound. If however you aren't satisfied with this, then i suppose i could make you a Paladin/ Monk/ CoT with dual longswords to be happy. But do not think that because it will appear on paper stronger it will be easier to play than this or the first one for example, certain sacrifices have to be made in order for that build to mature and you will need to learn how to use it effectively, divine feats and all.<br/>\n<br/>\nAnyway, i would be glad to hear your feedback especially when you decide to play one of these.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:36 AM - Sep 16, 2017",
      "content": "<div>I have a couple of thoughts, Valerfor, if that's ok (Bloody hell, prodding a dragon!)?<br/>\n<br/>\nWould it be a good idea to hold back a little on the dual-wielding until the AB is better? For example, you could take Blind Fighting at level 3, Iron Will at 6, Expertise at 8 and Imp Crit at 12: then Ambidexterity at 13 and both 2 Weapon Fighting and its big brother at 15, and dropping Toughness down to level 18. I'm just thinking about playability.<br/>\n<br/>\nIf I'm talking rubbish, please let me know!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:26 AM - Sep 16, 2017",
      "content": "<div>Not rubbish at all Stag, your thoughts are well-conceived but it was exactly the issue of playability that made me put those feats early in the build. You see, SOU for example ends at around lvl 13-14 so would you want a build that promises dual-wielding your favorite weapons only to pass the entirety of the adventure without using them once? That isn't a problem if you play in a PW or in a big series of modules like Aielund but in the somewhat limited environment of SOU or Classic \"plague\" campaign it is essential to be able to make use of your character's most prominent feature.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "3:02 AM - Sep 16, 2017",
      "content": "<div>I really appreciate the builds and all the help, but I for sure want to use charisma as my main stat, or at least equal with strength. Charisma is my favorite stat in DnD by far. The reason I'm interested in DWing and stuff is when I logged into the new character (Paladin/Monk/CoT) I immediately sighed a little as I thought about the character's progression into the game. While it would be powerful, it wouldn't be doing anything unique or interesting. It's essentially a pure paladin that takes multiclasses for no reason other than a couple defensive perks and extra feats. The multiclasses in the Paladin/Monk/CoT build don't add any uniqueness, just stats.<br/>\n<br/>\nDue to this lack of uniqueness, I considered other characters I had played in previous games or thought of playing in true DnD games. I have a lot of really cool characters. One of my favorites is Firuz Anvari from the game Guild Wars. Firuz is a Paragon/Assassin who wields dual swords, dealing critical hits and constantly supporting the party with the adrenaline/mana he quickly regenerates.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/p35O85u.jpg\"/><br/>\nSo this is the character I've been thinking of when asking about this current build, but it's probably a bit much to ask for NWN. I probably shouldn't try to copy my characters from other games, and instead come up with something unique to the NWN experience. I probably need to think about it a little more.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "5:15 AM - Sep 16, 2017",
      "content": "<div>I think I'm going to stick with the original plan. I came into this thread looking for help with the RDD build, and I chose that build out of the ones on this site because it was the most interesting to me. We got sidetracked but that is the build I liked and wanted to try more than the any of the others. I like that the Bard adds Bard Song for support and has UMD for scrolls and the boots of the sun soul and the holy avenger. I like the RDD because it adds tons of ability scores, especially to strength which means I can raise charisma more, and the AC, immunities, and fire breath. And I like that the last class can be either Paladin or Champion of Torm for various benefits.<br/>\n<br/>\nCould we go back to square one and figure out a Bard/RDD/Paladin or Bard/RDD/CoT (Whichever works better) build that is very similar to your Holy Smiting Dragon build, but optimized for the 30 levels instead of 40? Still with dual swords preferably.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:56 AM - Sep 16, 2017",
      "content": "<div>Bard won't work with Paladin, I'm afraid - Bard has to be non-lawful, while a Pally has to be lawful good. If you want a Paladin/RDD it has to be with Sorcerer.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "12:47 PM - Sep 16, 2017",
      "content": "<div>You can change your alignment when you are done taking levels in one of the two though, can't you? If that's too hard, then Bard/RDD/CoT is fine, I imagine that's the better option anyway.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:57 PM - Sep 16, 2017",
      "content": "<div>The problem is that if a Paladin stops being lawful, they lose their Paladin abilities and default to Fighter. Equally, a lawful Bard loses their Bardic abilities and defaults to (I think) Rogue. Unless, of course, you cheat...<br/>\n<br/>\nBut, as you say, Bard/RDD/CoT should make a strong build - though you'll have to quite careful early on, because the earliest you could start taking CoT would be level 10 (you need a BAB of 7+) if you only take Bard beforehand, and 11 if you take any RDD before CoT. And, if memory serves, you need to reach a pre-epic BAB of 17 to get 4 attacks per round (which I assume you'll want - 6 when/if dual-wielding), so you'll be somewhat restricted in what combinations you can take beyond that point.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:21 PM - Sep 16, 2017",
      "content": "<div>It has to be CoT because Paladin cannot find the five bonus feats that CoT gets and you need them, unless you want to lose stuff like \"blind-fighting\" &amp; \"knockdown\" to name a few. <br/>\nI am assuming you still want to dual-wield your weapons. <br/>\n<br/>\nHere is a couple of questions for you, i made a version of \"Holy Smiting Dragon\" at 28 lvl and i am not satisfied with the resaults very much. Namely his low-ish AB. The thing is that dual-wielding longswords impose a heavy toll on your character (-4/-4). You can solve this by picking \"Exotic weapons\" and chose the \"Two-Bladed Sword\" which has the base Dmg of two longswords but counds as a light off-hand weapon thus reducing the penalty to just (-2/-2). <br/>\n<br/>\nThis is a weapon with good support from the game and you can find some really good ones in there, such as the \"Sword of Lyons\" or the \"Uthgardt Ceremonial Blade\". With the \"holy avenger\" out of the equation anyway (you have to be a Paladin to get the quest in first place if i remember correctly) i think this is one of the best options out there for you. Other weapon options include the \"Double Axe\", and \"Dual Short-Swords\". You could also use \"Dual Kukris\" but the base Dmg is half that of a \"Two-Bladed Sword\" and there aren't too many good ones (except the Cutting Star) but you will deal critical hits more often with them.<br/>\n<br/>\nAnother thing is that you will have to start with Bard as your main class and if that is a deal-breaker for you then you can simply select one of the other builds.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:43 PM - Sep 16, 2017",
      "content": "<div>I've just had a look at your Holy Smiting Dragon, Valerfor (and you're right, she does appeal to me!), and it doesn't surprise me that a 28 level version would be hard work. Pre-epic is only the start of the problems (in pre-epic I was assuming 6 Bard levels, 4 RDD ones and the last 10 as CoT). With only 8 levels to play with in epic, which is 3 general feats, and a level of Bard taken at 27 for Tumble, you've only got 7 more levels to use, so that's either 1 more Bard and 6 RDD - leaving no CoT and therefore no bonus feats: or RDD doesn't reach 10, therefore not maxing its bonuses. I don't envy you, my friend!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:24 PM - Sep 16, 2017",
      "content": "<div>(BARD 8/ RDD 10/ COT 10)<br/>\n<br/>\nRACE: Human<br/>\nALIGNMENT: NG<br/>\nPLAYABILITY: PvM 1 – 28<br/>\n<br/>\nSTARTING/ ENDING STATS:<br/>\nSTR – 15 (30)<br/>\nDEX – 15<br/>\nCON –10 (12)<br/>\nINT –  12 (14)<br/>\nWIS – 08<br/>\nCHA –15 (20)<br/>\n<br/>\nHit Points: 276<br/>\n<br/>\nSkill Points: 154<br/>\n<br/>\nDiscipline: 31 (41)<br/>\nTumble: 30 (32)<br/>\nSpellcraft: 28 (30)<br/>\nUMD: 25 (30)<br/>\nLore: 10 (20)<br/>\nPerform: 10 (15)<br/>\nPersuade: 20 (25)<br/>\n<br/>\nSaving Throws (Fort/Ref/Will): 22/ 22/ 20 → 28/ 28/ 26 (saves Vs spells)<br/>\n<br/>\nNaked/ Armoured AC: 24/ 31 (Full Plate Armour)<br/>\n<br/>\n<br/>\nBAB: 20 (Six Attacks with Two-Bladed Sword)<br/>\n<br/>\nAB: +32/ +27/ +22/ +17 &amp; +32/ +17 (Two-Bladed Sword)<br/>\n<br/>\nDMG: 1d8 +10 &amp; 1d8 +5 / 17-20 x2 (Two-Bladed Sword)<br/>\n<br/>\n<br/>\nSpellcasting: Bard 3<sup>rd</sup> Circle of Spells plus UMD<br/>\n<br/>\nBard Song 8/ Day: +2 Attack Bonus/ +2 Dmg/ +1 to all Saves/ +8 Hp's/ +1 to all Skills<br/>\n<br/>\nSmite Evil 3/ Day: +11 Attack Bonus/ +10 → 20 Divine Dmg (Buffed Charisma)<br/>\n<br/>\nLay On Hands: 50 → 110 Positive Energy (Buffed Charisma)<br/>\n<br/>\nDivine Wrath: +5 Attack Bonus/ +5 Divine Dmg/ +5 to all Saves/ Dmg Reduction (5/ +1)<br/>\n<br/>\nDivine Wrath Duration: 5 → 11 rounds with Buffed Charisma<br/>\n<br/>\nLEVELING GUIDE:<br/>\n01) Bard (01): Two-Weapon Fighting, Ambidexterity<br/>\n02) Bard (02): <br/>\n03) Bard (03): Exotic Weapon Proficiency<br/>\n04) Bard (04): {STR +1}<br/>\n05) Bard (05): <br/>\n06) Bard (06): WF: Two-Bladed Sword<br/>\n07) Red Dragon Disciple (01): <br/>\n08) Red Dragon Disciple (02): {STR +1}<br/>\n09) Red Dragon Disciple (03): Heavy Armour<br/>\n10) Red Dragon Disciple (04): <br/>\n11) Red Dragon Disciple (05): <br/>\n12) Red Dragon Disciple (06): IC: Two-Bladed Sword, {STR +1}<br/>\n13) Red Dragon Disciple (07): <br/>\n14) Red Dragon Disciple (08): <br/>\n15) Champion Of Torm (01): Improved Two-Weapon Fighting<br/>\n16) Champion Of Torm (02): Blind Fighting, {STR +1}<br/>\n17) Bard (07): <br/>\n18) Champion Of Torm (03): Extra Smiting<br/>\n19) Champion Of Torm (04): Knockdown<br/>\n20) Champion Of Torm (05): {STR +1}<br/>\n21) Red Dragon Disciple (09): Great Charisma I<br/>\n22) Red Dragon Disciple (10): <br/>\n23) Champion Of Torm (06): EWF: Two-Bladed Sword<br/>\n24) Champion Of Torm (07): Great Charisma II, {STR +1}<br/>\n25) Champion Of Torm (08): Epic Prowess<br/>\n26) Champion Of Torm (09): <br/>\n27) Champion Of Torm (10): Great Charisma III, Armour Skin<br/>\n28) Bard (08): {STR +1}<br/>\n<br/>\n<br/>\nSPECIAL NOTES: <br/>\n* Immune to Fire<br/>\n* Immune to Paralysis<br/>\n* Immune to Sleep effects<br/>\n* Dragon Breath 1/ Day: 6d10 Fire Dmg, Ref DC (19)<br/>\n<br/>\nSPELL SLOTS:<br/>\n0<sup>ST</sup>) 3x Resistance<br/>\n1<sup>ST</sup>) 4x Mage Armour<br/>\n2<sup>ND</sup>) 2x Bull's Strength, 2x Eagle's Splendour<br/>\n3<sup>RD</sup>) 2x Keen Edge</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:11 PM - Sep 16, 2017",
      "content": "<div>Oh, now I'm impressed! Admittedly, I was wrong in that you only need a BAB of 16 for 4 APR, but still, superbly managed - all the big guns present and correct!<br/>\n<br/>\nMy only question (bearing in mind that it's nothing to do with me), is whether some Persuade and Lore might be sacrificed for some points in Spot?<br/>\n<br/>\nRegardless, I remain hugely impressed.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:51 PM - Sep 16, 2017",
      "content": "<div>Yeah, good question Stag and yes, of course you could do something like that but even better would be to arrange your stats in the beginning in order to have 14 Int and be able to take \"Spot\" in addition to the rest of the skills. And we all know how many useful skills the Bard has, like \"Taunt\" for example. Doing something like this would drop the end Charisma to 18 and Bravo asked for as much as possible so that was a no-go. You know this build would make a really good two-hander as well with its potencial 34 Str but i digress.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "7:49 AM - Sep 17, 2017",
      "content": "<div>That looks really good, but I don't know if I'm sold on the two-bladed sword, as that's never really been my thing. Would the build be better with a standard two-handed weapon or sword+board? We'd be saving 2 feats and could put more points into charisma out of Dex I assume? Weapons I'm okay with if there are good options (I don't know them all): Greatsword, Halberd, Bastard Sword, Scimitar, and Longsword.<br/>\n<br/>\nIf this build were to abandon dual-wielding, how do you think it would compare to a dual wielding Paladin/Rogue/CoT, just out of curiosity?<br/>\n<br/>\nBy the way, you can't dye weapons/shields, correct?<br/>\n<br/>\nAlso, when you get Enserric, you can upgrade him in the forge right? If you add like say Fire damage, will the red effect from vampiric be replaced by the fire effect? Or will it stay red?</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:30 AM - Sep 17, 2017",
      "content": "<div>No time to answer your questions right now but take a look at this Bravo, i use it all the time.<br/>\n<br/>\nCustomize Character Override =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/hakpak/original-hakpak/customize-character-override-hak-ccoh\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... e-hak-ccoh</a></div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "8:55 AM - Sep 17, 2017",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nNo time to answer your questions right now but take a look at this Bravo, i use it all the time.<br/>\n<br/>\nCustomize Character Override =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/hakpak/original-hakpak/customize-character-override-hak-ccoh\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... e-hak-ccoh</a>\n</div></blockquote>\n\nThis... changes things.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "9:34 AM - Sep 17, 2017",
      "content": "<div>Well, now I feel like my options are a lot more open as far as weapons and armor are concerned, but I still hate all of the shield models so I'd prefer to avoid them lol. And even if I can change their appearance, I still prefer the coolest weapons in game like the Holy Avenger or Enserric.<br/>\n<br/>\nEdit: After going through all the options, I definitely prefer a Greatsword or two Longswords. <br/>\n<br/>\nSo right now the only builds I'm considering are:<br/>\n<br/>\n(Paladin/Monk/CoT): If this build can use a Greatsword with similar success to the RDD build then I like it a lot more than previously when it had a shield. I don't suppose the Paladin abilities and extra CoT levels make up for the loss of 8 STR and Bard Song?<br/>\n(Bard/RDD/CoT): This build can go either Greatsword or dual Longswords, but it feels a bit bad for me to go Greatsword due to the Bard multiclass. It feels like a swashbuckler type character should be using dual Longswords.<br/>\n(Paladin/Rogue/CoT): This build would be dual Longswords all the way.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:15 PM - Sep 17, 2017",
      "content": "<div>The (<em>Paladin/Monk/CoT</em>) can definitely handle a Greatsword but the results won't be spectacular since he has but average strength. Besides he can wield the Holy Avenger (he and only him can initiate the quest for it) which is a better weapon than anything till you get to HOU. Unfortunately if he choses to use two weapons his AB will drop to unacceptable levels. So, this character is best suited to sword &amp; board pretty much.<br/>\n<br/>\nThe (<em>Bard/RDD/CoT</em>) is suited for both but if you get two longswords, the AB won't be as good. He is best paired to a big heavy Greatsword to take advantage of his huge strength. If dual-wielding is out of the equation for him then he can grow his Strength even more.<br/>\n<br/>\nThe (<em>Fighter/Rogue/CoT</em>) can handle anything, there was a reason that i chose the dual short-swords (one short-sword of quickness, one feyduster) but he will be equally good with a Greatsword. Not as good as the above build though.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:50 PM - Sep 17, 2017",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nThe (<em>Bard/RDD/CoT</em>) is suited for both but if you get two longswords, the AB won't be as good. He is best paired to a big heavy Greatsword to take advantage of his huge strength. If dual-wielding is out of the equation for him then he can grow his Strength even more.<br/>\n</div></blockquote>\n\nAnd, of course, there's no AB penalty - even with short-swords you'd be at -2/-2 (which is at least better than -4/-4 when dual-wielding longswords). And let's not forget the x1.5 damage from a two-handed weapon. That and, should you wish, you could use the drop in DEX to boost INT for skill points - as mentioned in an earlier post - as well as STR (or CHA, though STR seems more wise to me).<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:47 PM - Sep 17, 2017",
      "content": "<div>You are of course right Stag, this character would be a monster in combat if optimized for \"Big Stick\" use.<br/>\n<br/>\nThat being said &amp; just for the heck of it... Here is what the first build would look like if it was dual-wielding, it was actually easy to modify that once the initial work had been done.<br/>\nNow this character would have everything you want, dual-longswords, holy avengers, sun soul boots &amp; evasion, full tumble, divine shield/might/wrath, awesome saves, spells etc.<br/>\nBut his AB suffers &amp; his skill-set is tight and his hit points could be better i admit. But hey, coolness factor: 10/10<br/>\nI still think he can do it, just need to be careful and use his buffs and some potions.<br/>\nDo you think i should do something to the feat order to make it more playable in the beginning guys?<br/>\n<br/>\nRACE: Human<br/>\n ALIGNMENT: Lawful Good<br/>\nPLAYABILITY: PvE 1-28th<br/>\n<br/>\nSTARTING/ ENDING STATS:<br/>\nSTR –  14 (18)<br/>\nDEX –  15<br/>\nCON – 10<br/>\nINT –   10<br/>\nWIS –  14<br/>\nCHA – 14 (20)<br/>\n<br/>\nHit Points: 278<br/>\n<br/>\nSkill Points: 97<br/>\n<br/>\nDiscipline: 31 (35)<br/>\nTaunt: 31 (36)<br/>\nTumble: 30 (29)<br/>\nPersuade: 5 (10)<br/>\n<br/>\n<br/>\nSaving Throws (Fort/Ref/Will): 29/ 26/ 24<br/>\n<br/>\nSaving Throws (Fort/Ref/Will): 35/ 32/ 30 → (With +12 Charisma)<br/>\n<br/>\n<br/>\nNaked/ Armoured AC: 19/ 27 (Full Plate Armour)<br/>\n<br/>\nBAB: 23 (Six attacks w/ Dual Longswords)<br/>\n<br/>\nAB: +27/ +22/ +17/ +12 (Dual Longswords)<br/>\n<br/>\nDMG: 1d8 +4 &amp; 1d8 +2/ 17-20 x2 (Dual Longswords)<br/>\n<br/>\nSpellcasting: Paladin 4<sup>th</sup> Lvl of Spells<br/>\n<br/>\nLay on Hands: 130 HP's/ 286 HP's<br/>\nSmite Evil 1x Day: +5 (+11) Attack/ +26 Damage<br/>\nDivine Shield: +5 AC for 5 rounds/ +11 AC for 11 rounds<br/>\nDivine Might: +5 Dmg for 5 rounds/ +11 Dmg for 11 rounds<br/>\nDivine Wrath: +5 Attack/ +5 Divine Damage/ +5 All Saves/ Dmg Reduction 5/+1<br/>\n<br/>\nLEVELING GUIDE:<br/>\n01) Paladin (01): Power attack, Weapon Focus: Longsword<br/>\n02) Paladin (02):<br/>\n03) Paladin (03): Divine Shield<br/>\n04) Paladin (04): (+1 Charisma)<br/>\n05) Paladin (05): <br/>\n06) Paladin (06): Divine Might<br/>\n07) Monk (01): <em>Cleave, Evasion</em><br/>\n08) Paladin (07): (+1 Charisma)<br/>\n09) Paladin (08): Ambidexterity<br/>\n10) Paladin (09): <br/>\n11) Paladin (10): <br/>\n12) Paladin (11): TWF, (+1 Strength)<br/>\n13) Paladin (12): <br/>\n14) Paladin (13): <br/>\n15) Paladin (14): Extend Spell<br/>\n16) Paladin (15): (+1 Strength)<br/>\n17) Champion of Torm (01): <br/>\n18) Champion of Torm (02): ITWF, Blind Fighting<br/>\n19) Champion of Torm (03): <br/>\n20) Champion of Torm (04): Improved Critical: Longsword, (+1 Charisma)<br/>\n21) Champion of Torm (05): Great Charisma I<br/>\n22) Champion of Torm (06): Epic Weapon Focus: Longsword<br/>\n23) Champion of Torm (07): <br/>\n24) Champion of Torm (08): Great Charisma II, Epic Prowess, (+1 Charisma)<br/>\n25) Champion of Torm (09): <br/>\n26) Champion of Torm (10): Armour Skin<br/>\n27) Monk (02): Great Strength I<br/>\n28) Paladin (16): (+1 Strength)<br/>\n<br/>\n<br/>\nSPECIAL NOTES: <br/>\n* Immune to Fear and Disease<br/>\n* Evasion<br/>\n<br/>\nSPELL SLOTS: <br/>\n1<sup>ST</sup>) 3x Bless Weapon (for undead)<br/>\n2<sup>ND</sup>) 3x Extended Divine Favor (major combat buff)<br/>\n3<sup>RD</sup>) 1x Extended Aura of Glory (major boost to charisma)<br/>\n4<sup>TH</sup>) 1x Extended Prayer (major combat buff)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:39 AM - Sep 18, 2017",
      "content": "<div> I don't know if this is helpful or not, but you could leave Power Attack out (you're getting Cleave as a freebie anyway) and get Knockdown. So you could then do some Imp Crit / Blind Fight / KD / Dual-Wield juggling as you see fit.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:23 AM - Sep 18, 2017",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>\n I don't know if this is helpful or not, but you could leave Power Attack out (you're getting Cleave as a freebie anyway) and get Knockdown. So you could then do some Imp Crit / Blind Fight / KD / Dual-Wield juggling as you see fit.\n</div></blockquote>\n\nUnfortunately PA has to stay because it is a pre-requisite for Divine Might/Shield Stag.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "4:08 AM - Sep 18, 2017",
      "content": "<div>It seems like for that build Paladin/CoT/Rogue would be better than Monk, no? You'd get more skill points but still the same things monk gives?<br/>\n<br/>\nI don't think I'm changing my mind from what I said earlier about the weapons. For me to enjoy them:<br/>\n<br/>\nPaladin/Monk/CoT = Greatsword<br/>\nBard/RDD/CoT = Greatsword/DW<br/>\nPaladin/Rogue/CoT = DW<br/>\n<br/>\nI am normally okay with shields but I just hate all the shield models in this game, so I don't want to use them. I need to think about which one I most want to play some more.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:32 AM - Sep 18, 2017",
      "content": "<div><blockquote><div><cite>Bravadorado wrote:</cite>\nIt seems like for that build Paladin/CoT/Rogue would be better than Monk, no? You'd get more skill points but still the same things monk gives?</div></blockquote>\n\nNo it is not. Monk gives you also Cleave for free which is good for supporting iterative attacks which you will be doing a lot. It chains your attacks in other words. <br/>\nAlso Monk gives you Evasion from the 1st lvl, while Rogue does that at 2nd which in this build comes quite late.<br/>\nThirdly Monk let you get the Sun Soul boots and the rest without spending a single point in UMD, and we don't have enough skill points to do so with Rogue.</div>"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "9:22 AM - Sep 18, 2017",
      "content": "<div>I see.<br/>\n<br/>\nAfter some thought, I've decided I definitely want to dual wield longswords. I've also decided I want to multiclass rogue. I would like my main class to be paladin, but I get the feeling from our Discussion that Paladin/Rogue/CoT isn't going to work very well due to needing the paladin feats and the DW feats. The other option is Fighter/Rogue/CoT, so I'll go with that. Based on your last Fighter/Rogue/CoT build (On page 4), there are some changes I'd like you to make to the build if possible to better suit it to my needs. I'm not sure how to best make these changes, so I'll leave that up to you:<br/>\n<br/>\n<strong>Fighter/Rogue/CoT:</strong><br/>\n<br/>\n<strong>Ability Scores:</strong> Lower INT and CON to 10 or 12 (As low as possible), and move those scores to CHA. I'll have a lot of AC and saves so I don't need that much CON, and I don't need all the skills you listed so I can have lower INT too, I'd rather have a higher CHA for both RP reasons and Divine Wrath/Smite Evil.<br/>\n<br/>\n<strong>Skills: </strong>I don't want Listen (21), Search (13), Open Locks (13), Disable Traps (13), or Spellcraft (13). That saves 73 skill points. The only skills I care about are Discipline, Persuade, Tumble, and UMD. As long as the first 4 are where they need to be, I don't need any extra INT for skill points. Any extra points can go in Taunt.<br/>\n<br/>\n<strong>Weapons:</strong> Dual longswords instead of dual shortswords. I'll eat the penalty for cool points.<br/>\n<br/>\n<strong>Feats:</strong> I'm not sure that Iron Will, Called-Shot, Toughness, Expertise, and Improved Knockdown are critical in doing what I want this build to do. They can be replaced with other things like Great Cleave, Overwhelming Critical, Great Smiting, or ASI's. If some of these feats are taken just due to them being fighter bonus feats, then I'm okay with the build taking less fighter levels and more CoT levels (Less feats I don't want and better saves/Divine Wrath).<br/>\n<br/>\nCan you make a Fighter/Rogue/CoT build with these changes in mind?</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:47 AM - Sep 18, 2017",
      "content": "<div>If you want a holy warrior, there is another option, a Cleric! A Cleric 26 / Fighter 4 / CoT 10 can be a powerful melee warrior, with even more buffs than a Paladin. I know that's 40 levels, but when yu gret to the end of HotU, you don't have to stop. Sands of Fate will get you the rest of the way to level 40.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "10:33 AM - Sep 18, 2017",
      "content": "<div><blockquote><div><cite>Empyre65 wrote:</cite>\nIf you want a holy warrior, there is another option, a Cleric! A Cleric 26 / Fighter 4 / CoT 10 can be a powerful melee warrior, with even more buffs than a Paladin. I know that's 40 levels, but when yu gret to the end of HotU, you don't have to stop. Sands of Fate will get you the rest of the way to level 40.\n</div></blockquote>\n\nI don't like having that many spells, and I don't think that character would have enough feats to dual wield at level 30, and it wouldn't be able to use the sun soul boots or the holy avenger. Thanks though!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:30 PM - Sep 18, 2017",
      "content": "<div><blockquote><div><cite>Bravadorado wrote:</cite>\nI see.<br/>\n<br/>\nAfter some thought, I've decided I definitely want to dual wield longswords. I've also decided I want to multiclass rogue. I would like my main class to be paladin, but I get the feeling from our Discussion that Paladin/Rogue/CoT isn't going to work very well due to needing the paladin feats and the DW feats. The other option is Fighter/Rogue/CoT, so I'll go with that. Based on your last Fighter/Rogue/CoT build (On page 4), there are some changes I'd like you to make to the build if possible to better suit it to my needs. I'm not sure how to best make these changes, so I'll leave that up to you:<br/>\n<br/>\n<strong>Fighter/Rogue/CoT:</strong><br/>\n<br/>\n<strong>Ability Scores:</strong> Lower INT and CON to 10 or 12 (As low as possible), and move those scores to CHA. I'll have a lot of AC and saves so I don't need that much CON, and I don't need all the skills you listed so I can have lower INT too, I'd rather have a higher CHA for both RP reasons and Divine Wrath/Smite Evil.<br/>\n<br/>\n<strong>Skills: </strong>I don't want Listen (21), Search (13), Open Locks (13), Disable Traps (13), or Spellcraft (13). That saves 73 skill points. The only skills I care about are Discipline, Persuade, Tumble, and UMD. As long as the first 4 are where they need to be, I don't need any extra INT for skill points. Any extra points can go in Taunt.<br/>\n<br/>\n<strong>Weapons:</strong> Dual longswords instead of dual shortswords. I'll eat the penalty for cool points.<br/>\n<br/>\n<strong>Feats:</strong> I'm not sure that Iron Will, Called-Shot, Toughness, Expertise, and Improved Knockdown are critical in doing what I want this build to do. They can be replaced with other things like Great Cleave, Overwhelming Critical, Great Smiting, or ASI's. If some of these feats are taken just due to them being fighter bonus feats, then I'm okay with the build taking less fighter levels and more CoT levels (Less feats I don't want and better saves/Divine Wrath).<br/>\n<br/>\nCan you make a Fighter/Rogue/CoT build with these changes in mind?\n</div></blockquote>\n\nI don't want to sound negative here, but I fear I will.<br/>\n<br/>\nAre you really asking for a <strong>worse</strong> build, just for the sake of appearances? You won't be able to hear invisible enemies approaching (probably with sneak attacks), resist spells as well, and you'll run the risk of blowing yourself into small pieces if you're not able to find traps (even if you can't disarm them, it's better to know where they are). You'll lose 56 to 84 hit points from the loss of Toughness and CON. And you'll lose 2 AB on each weapon.<br/>\n<br/>\nOh, and Great Cleave and Overwhelming Critical are really only useful if you're going for Devastating Critical. Great Cleave will tie you into mob fighting while mages and clerics wail on you from afar and Overwhelming Crit only adds a smattering of damage to the build, and is only available in epic levels in any case. Iron Will boosts the meleer's traditional weak point, the save against Will; Improved Knockdown extends the potential for knocking down enemy mages and thereby dispatching them before they can batter you (the chance of which is made worse without points in Spellcraft). Expertise gives you a healthy AC boost when required, and Called Shot either slows your foe or damages their AB (depending on whether you go arm or leg). All of which are better than Great Cleave in my opinion.<br/>\n<br/>\nSo, it appears you're looking for something that's more vulnerable to attack - magical and mundane - and less likely to hit whatever you face. I just don't understand. Please, someone, tell me I'm wrong.<br/>\n<br/>\nI appreciate that you're looking for your ideal build Bravadorado, but it's about balance. A one-trick pony won't live long enough to demonstrate their particular speciality. Why not try Valerfor's Fighter/Rogue/CoT as is, <strong>then</strong> see what you'd do differently? And we'd all be happy to help with that, should you wish.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Bravadorado",
      "avatar": "10758811_1510287074.png",
      "timestamp": "9:35 PM - Sep 18, 2017",
      "content": "<div>I'm not sure of the weight of the stuff you're talking about. For the traps and etc, I plan on having a henchman with me to do most of that. I'm also not so sure that the base game is difficult enough that I need to be too worried about defensive optimization. I beat HotU when I was 10 without using any kind of build at all, so I feel like I can handle what the hell throws at me even with more offensive choices. It's probably different in the level 40 modules but as I said I just want to do the campaign.<br/>\n<br/>\nAnyway I was just pointing out things I prefer, I mentioned that I wasn't sure how it would affect the build. The main thing I'm concerned about is the low charisma score, I'd much rather have that higher than a few extra hit points and some skill points in lockpicking.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:10 PM - Sep 18, 2017",
      "content": "<div>You have a lot of builds going for you already bravadorado, where charisma hasn't been risen to better values it was considered worthless to invest in this particular build because it would drain resources without bringing substantial results. Any other micro-corrections you want to do to the builds are fairly easy to do so without inventing a new one and i am fairly sure you can do it by yourself.<br/>\n<br/>\nHave fun,</div>"
    }
  ]
}