{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "111",
  "name": "Bard/RDD/BG for SoU/HotU help",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/bard-rdd-bg-for-sou-hotu-help-t2354614.html",
  "author": "7",
  "avatar": "10404082_1510287071.jpg",
  "replies": 6,
  "posts": [
    {
      "author": "unlucky 7",
      "avatar": "no_avatar.png",
      "timestamp": "11:24 AM - Oct 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello, I'm looking to go through SoU and HotU on hardcore and I'm stuck with trying to build this character.<br/>\n<br/>\n I wanted a PvM build up to level 28 as a Human with the class split of Bard 14/ BG 4/ RDD 10 since I heard that characters can only get up to 27-28 playing these campaigns. I ended up finding this build which is basically exactly what I had in mind so I'm rolling with it with some <em>very</em> slight modifications.<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2350150/MOGHEDIEN-Melody-of-the-Dark-BARD-26-BG-4-RDD-10#.WAXDjvkrKCp\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... AXDjvkrKCp</a><br/>\n<br/>\n<br/>\n Str - 18 (33)<br/>\n Dex - 8<br/>\n Con - 12 (14)<br/>\n Int - 12 (14)<br/>\n Wis - 8<br/>\n Cha - 14 (16)<br/>\n<br/>\n Level Plan<br/>\n 01. Bard (1) - Power Attack, Cleave<br/>\n 02. Bard (2)<br/>\n 03. Bard (3) - Curse Song<br/>\n 04. Bard (4)<br/>\n 05. Bard (5)<br/>\n 06. Bard (6) - Still Spell<br/>\n 07. Bard (7)<br/>\n 08. Bard (8)<br/>\n 09. BG (1) - Weapon Focus (Greatsword)<br/>\n 10. BG (2)  <br/>\n 11. RDD (1)<br/>\n 12. BG (3) - Divine Might<br/>\n 13. RDD (2)<br/>\n 14. RDD (3)<br/>\n 15. RDD (4) - Knockdown<br/>\n 16. RDD (5)<br/>\n 17. RDD (6)<br/>\n 18. BG (4) - Blind Fight or Divine Shield<br/>\n 19. RDD (7)<br/>\n 20. RDD (8) <br/>\n 21. RDD (9) - Epic Weapon Focus (Greatsword)<br/>\n 22. RDD (10)<br/>\n 23. Bard (9)<br/>\n 24. Bard (10) - Epic Prowress<br/>\n 25. Bard (11)<br/>\n 26. Bard (12)<br/>\n 27. Bard (13) - Armor Skin or Lasting Inspiration<br/>\n 28. Bard (14)<br/>\n<br/>\n So here are the troubles I'm dealing with:<br/>\n At character level 18 should I take blind fight? I've heard people say that it's a necessity for melee fighters but I think they meant for PvP. Will I be getting it's worth in SoU + HotU?<br/>\n If I don't get blind fight, what should I take instead? I put up Divine Shield as a possible substitute but I'm open to anything else.<br/>\n<br/>\n At character level 27 should I take armor skin or lasting inspiration? I get that the extra AC is great but in the spirit of being a bard would lasting inspiration be an equal substitute? <br/>\n<br/>\n My biggest problem is what to do with skills. I know I want to roleplay so I'd like to level up bluff and intimidate to a level where they won't be failing (like would 20 in each be enough for these campaigns?). I also know that tumble and perform are needed. But aside from that I have no idea where to go and I would really appreciate some input on this. <br/>\n<br/>\n Also if possible can I get a recommended spell list?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:45 PM - Oct 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Welcome aboard our ship of obsessive-compulsive misfits!  We are glad you found some time to stop by. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n Just caught this topic heading out so bear with my cursory comments, please...<br/>\n<br/>\n Yes, the maximum level you will achieve by the end of HotU is 28 and you can set your watch by that.  Extensive use of two allies (plus summons) in all combat will penalize the XP significantly, though, so you may only reach 27 unless you mostly solo the random encounters without support help.<br/>\n<br/>\n Blind Fight is needed vs. all concealed like shadows, wraiths or those buffed with ImpInvis or other concealments.  Otherwise, regardless of your lofty AB, you'll miss more than hit (50% concealment is a real killer!).  Even archers will waste their expensive ammo trying to hit these without some sort of \"equalizer\".  True Seeing will not help hit concealed foes.  How about taking Blind Fight in pre-epic as a general feat, move your feats around a bit to take Curse Song in epic?  You'll need to sacrifice (probably) Epic Prowess, but should be able to find enough +CHA gear to make the decision viable.   Without a shield, you may be getting hit more often than you like so the divine buff may come in very handy. This build qualifies as \"feat-starved\" so you can expect to face some trade-offs in a build with less than 40 levels of wiggle room.<br/>\n<br/>\n You can't take Lasting Inspiration until at least Bard 20 (the actual prereq is: Bard Song 20).  Cross off LI as part of this particular build.  Deekin will elect LI if you get to him before he takes any RDD levels and make him a pure bard.  But he won't use Curse Song either.<br/>\n<br/>\n Bluff checks are not used in either SoU or HotU.  Those ranks would be wasted.  Nor are Intimidate checks.  More wasted skills there.  But Taunt DOES work so perhaps consider that to complement your Curse Song?  Just an idea.<br/>\n<br/>\n I haven't tried to plot this idea out yet but I'd start with STR 17 and boost DEX a bit more, at least to where there's no AC penalty (DEX 10).   Try not to end up with odd-numbered final abilities if at all possible.  You'll get a bit more carrying capacity with that extra point in STR but that's about all.<br/>\n<br/>\n For skills, you'll need to max Discipline.  Enough UMD to wear class-specific gear like monk boots if you desire to.  If you are limiting your casting to buffs, you can forgo investing Conc because there is no opposed taunting to consider in those modules. Otherwise, you'll want many ranks to survive the damage interruption trying to cast offensives like Sound Burst. (Stilled Ice Storms will not be available, unfortunately.)  As many ranks in Listen as you can afford.  There are some drow mages that will use Invis and some clerics that use sanctuary to beguile your attacks.  If you can hear them move around, it helps your targeting. <br/>\n<br/>\n I beleive I would focus on buffing my toon and party members if I were you.  Bards have so few good offensive spells that casting during combat can open your toon up to many AoOs that would otherwise not become a factor.  Keen Edge will help your Greatsword until you have access to the uber properties in Ch2 of HotU and then can be replaced by a less redundant buff.<br/>\n<br/>\n That should give you some homework to study until other members stop by to invest some of their own time to help.  Good luck!<br/>\n<br/>\n<br/>\n<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "unlucky 7",
      "avatar": "no_avatar.png",
      "timestamp": "1:57 AM - Oct 19, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the input, I really appreciate it! I'm a little dissapointed that Bluff and Intimidate are pointless for roleplaying in SoU/HotU but that does free up points. I'm going to take some time to digest all of this and see if I can work out a good skill path. Again, thank yoU!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:22 AM - Oct 19, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Why not invest in <em>Persuade</em>?  It's more-or-less the universal RP skill check used in the NWN universe and almost always accompanies <em>Bluff/Intimidate</em> when those checks have been included in convos.  Also, as sort of a mini-spoiler, Persuade will factor into your relationship with companions in HotU...  eventually. I don't recall any RP checks that require persuasion to be ultra-high, though, so am guessing 10-15 ranks plus your charisma should be sufficient.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:27 PM - Oct 19, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Unlucky7 - good to meet you.<br/>\n<br/>\n If would think <em>Spellcraft</em> would be a worthwhile investment here - for helping your saves against spells as much as anything. And if you find you've still got spares, maybe <em>Search </em>(even if you can't disable traps, you'll be able to find and avoid them - where possible) wouldn't hurt.<br/>\n<br/>\n So, it's looking like 31 ranks in Discipline, 30 in Tumble, my guess would be 28 (net) in UMD (Hip's the expert in that, so I'm sure he'll correct me if I'm wrong), 27 in Spellcraft, 31 in Listen (or Spot), and any left over (should be about 20, afraid I haven't done the full calculation of your total available skills, but I reckon it'll be around 170) in Persuade/Search/Lore.<br/>\n<br/>\n Hope all goes well.<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:48 PM - Oct 19, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Bard's UMD mechanics doesn't perform the hardcore scroll check (vs. spell level + 25).  To cast successfully from any scroll, whether arcane or divine, only requires enough UMD to use the scroll and that is based on the scroll's value in gold. <br/>\n<br/>\n For example, suppose a scroll of <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Undeath%27s_eternal_foe\" rel=\"noreferrer\" target=\"_blank\">Undeath's Eternal Foe </a>is either found or bought by a bard.  The default game value for that scroll is around 6K gold.  The standard scroll check (rogue/assassin) would require at least 33 net ranks of UMD (33 + d20) to cast that Level 9 scroll successfully 100% of the time.  But a bard only needs enough to satisfy the value requirements just like using any other class-specific item (i.e. the item appears to have a reddish background when unusable).  UMD 5 (4.8K gold) would not be enough but UMD 10 (20K gold) would.   There is no chance for casting failure.<br/>\n<br/>\n Therefore, essentially all that is needed for a bard to cast all scrolls is a net (allocated plus CHA modifier) 10 ranks of UMD.  The value of other sorts of class-specific gear that is desirable for the bard player will determine what ultimate UMD level to aim for.  That net level should be in increments of 5 to avoid wasting unnecessary skill points (i.e. UMD 29 evaluates the same as UMD 25).<br/>\n<br/>\n It should be noted that the \"value\" of the candidate items are established by the designer so the same item can vary in assessed value from environment to environment.  Also, the price to buy the item is typically inflated from the true value so is not usually a good metric to determine how much UMD is needed to use it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:52 PM - Oct 19, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah - that's what I meant to say <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n Told you he was Mr UMD<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}