{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "Build Request/Unfinalized Builds",
  "forum_id": "003",
  "id": "438",
  "name": "Vick Jorino ( F8/PDK4/WM28 )",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/vick-jorino-f8-pdk4-wm28-t2294007.html",
  "author": "Nemusator",
  "avatar": "no_avatar.png",
  "replies": 6,
  "posts": [
    {
      "author": "Nemusator",
      "avatar": "no_avatar.png",
      "timestamp": "8:17 PM - Oct 22, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">ECB Build Model:  F8/PDK4/WM28<br/>\n<br/>\nRACE:  Human<br/>\n<br/>\nALIGNMENT: Neutral good<br/>\n<br/>\nPLAYABILITY: Excellent <br/>\n<br/>\nSTARTING STATS:<br/>\n<br/>\nSTR - 18<br/>\nDEX - 13<br/>\nCON - 12<br/>\nWIS- 8<br/>\nINT - 13<br/>\nCHA - 8<br/>\n<br/>\nENDING STATS: <br/>\n<br/>\nSTR - 34<br/>\nDEX - 13<br/>\nCON - 12<br/>\nWIS - 8<br/>\nINT - 13<br/>\nCHA - 8<br/>\n<br/>\nBASIC STATS:<br/>\n<br/>\n- Hit Points:  540 ( raw ), 770 fully buffed<br/>\n<br/>\n<br/>\n- Skill points: discipline 43, heal 26, listen 43, tumble 21<br/>\n<br/>\n<br/>\n- Naked AC:  21 ( + 1 from dodge )<br/>\n<br/>\n- BAB: 30<br/>\n-AC: 48<br/>\n- AB: 64 unbuffed, 70 fully buffed with oath of wrath<br/>\n<br/>\n- Spellcasting:  PDK spells<br/>\n<br/>\nLEVELING GUIDE:  1-6 fighter, 7-10 PDK, 11-37 WM, 37-39 F, 40 WM.<br/>\n<br/>\n1-  Fighter; toughness, mounted combat, dodge<br/>\n2- Fighter; weapon focus greataxe<br/>\n3- Fighter; expertise<br/>\n4- Fighter; STR +1 (19), weapon specialization greataxe<br/>\n5- Fighter<br/>\n6- Fighter;  mobility, spring attack<br/>\n7- PDK;  ( rallying cry, heroic shield )<br/>\n8- PDK; STR +1 (20)<br/>\n9- PDK; whirlwind attack ( oath of wrath, inspire courage )<br/>\n10- PDK;<br/>\n11- WM; ( weapon of choice-greataxe ) ( ki damage )<br/>\n12- WM; STR +1 (21) blind fight<br/>\n13- WM<br/>\n14- WM<br/>\n15- WM; improved critical-greataxe; ( increased multiplier ), ( superior weapon focus )<br/>\n16- WM; STR +1 ( 22 )<br/>\n17- WM; ( ki critical )<br/>\n18- WM; knockdown<br/>\n19- WM<br/>\n20- WM; STR +1 ( 23 )<br/>\n21- WM; Great strength I (24 ), ( epic weapon master ), ( epic character )<br/>\n22- WM<br/>\n23- WM; epic weapon focus-greataxe, ( epic superior weapon focus )<br/>\n24- WM; STR +1 ( 25 ), great strength II ( 26 )<br/>\n25- WM<br/>\n26- WM; epic prowess <br/>\n27- WM; great strength III ( 27 )<br/>\n28- WM; STR +1 (28 ), <br/>\n29- WM; armor skin<br/>\n30- WM; great strength IV ( 29 )<br/>\n31- WM<br/>\n32- WM; STR +1 ( 30 ), epic toughness I<br/>\n33- WM; Great strength V ( 31 )<br/>\n34- WM<br/>\n35- WM; epic toughness II<br/>\n36- WM; STR +1 ( 32 ), great strength VI ( 33 )<br/>\n37- WM<br/>\n38- Fighter <br/>\n39- Fighter; improved knockdown, epic weapon specialization greataxe<br/>\n40- WM; STR +1 ( 34 ), epic toughness III<br/>\n<br/>\nSAVES ( without gear ) : <br/>\nFortitude 23 -35 with gear<br/>\nReflex      21 – 25 potion <br/>\nWill          15 – 18 potion<br/>\n<br/>\nGear:  purple crown ( + 4 constitution ),  greataxe ( + 1d8 sonic damage + 5 enchantment bonus ), broken plate + 5 ( + 5 to ac , constitution +2, regeneration + 1 ), belt of fire giant strength ( + 5 to strength ), greater gauntlets of ogre powa ( + 5 to strength ), ring of discipline ( + 14 to discipline ), ring of fortitude + 5, boots of the rage clan ( ac + 5, strength + 3 ), amulet of natural armor ( + 5 to ac ), cloak of protection ( + 5 to ac ) <br/>\nspare gear: knight’s shield, used only to cast battletide spell. <br/>\n<br/>\nSIMILAR BUILDS:  Seen few of these. Although the original idea was given to me by a friend, I was the first to make this type of a build on our server. <br/>\n<br/>\nSPECIAL NOTES:  Keep pumping  the discipline constantly. Use WM levels to pump up listen and heal. Take 20 ranks in tumble on last level.<br/>\nSkill points sheet:  discipline 77, heal 25, listen 42, tumble 65. <br/>\n<br/>\n7- FINAL NOTES: <br/>\n<br/>\n1. Massive damage<br/>\n2.  Massive ab and criticals <br/>\n3.  Really fun to play<br/>\n4.  Decent DC fear spell<br/>\n<br/>\n5.  PDK gear contributes to con, damage and ab.<br/>\n<br/>\n6.  Don’t underesimare the rallying cry! It gives you 20% bonus to land movement speed for one round.<br/>\n<br/>\n7.  Favorite tactic: Fear spell from distance, KD if it fails, Ki spam or plain attack. <br/>\n<br/>\n8. I'm not sure whether the oath of wrath can be used on dummies P:<br/>\n<br/>\n<br/>\nI sincerely wish that you enjoy this as much as I did.--------------------<a class=\"postlink\" href=\"/attach/view/ma/845224_0a3158b173bc53e1cf3ab306ba5c04fc\" rel=\"noreferrer\" target=\"_blank\">Click here to view the attachment</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:59 AM - Oct 25, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I bet this character wreaks havoc!  <br/>\nI have a couple of questions/comments\n<blockquote><div><strong>Nemusator wrote:</strong><br/>\n- Naked AC:  21 ( + 1 from dodge )<br/>\n//-AC: 48</div></blockquote>\nBase: 10<br/>\nTumble 20 ranks: 4<br/>\nArmor skin: 2<br/>\nDexterity 13: 1<br/>\nSum = 17<br/>\n(Dodge +1)<br/>\nWhat am I missing here?\n<blockquote><div>- BAB: 30<br/>\n- AB: 64 unbuffed, 70 fully buffed with oath of wrath</div></blockquote>\nBAB: +30<br/>\n28 lvls of WM: +7<br/>\nStr 34: +12<br/>\nFeats: +4<br/>\nSum = +53 unbuffed<br/>\nTheoretical max: +79<br/>\n<blockquote><div>\nGear:  purple crown ( + 4 constitution ),  greataxe ( + 1d8 sonic damage + 5 enchantment bonus ), broken plate + 5 ( + 5 to ac , constitution +2, regeneration + 1 ), belt of fire giant strength ( + 5 to strength ), greater gauntlets of ogre powa ( + 5 to strength ), ring of discipline ( + 14 to discipline ), ring of fortitude + 5, boots of the rage clan ( ac + 5, strength + 3 ), amulet of natural armor ( + 5 to ac ), cloak of protection ( + 5 to ac ) <br/>\nspare gear: knight’s shield, used only to cast battletide spell. </div></blockquote>\nIf your build has any flaws that should be covered with items or if you for any other reason need any items, then it is ok to mention that. With a will save bonus of 15 I would have been looking for an item with immunity to mind spells or effects.\n<blockquote><div> <br/>\n4.  Decent DC fear spell\n</div></blockquote>\nThe DC for the spell is 10 + purple dragon knight level + strength modifier<br/>\nThe DC with your build is: 10 + 4+ 12 = 26<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "2:28 PM - Oct 25, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here in the ECB, Nemusator, we normally don't factor in gear when mentioning the stats of our builds. So, what Mick is trying to say is that items differ from world to world, so your build poster here in the ECB may be used in many different worlds. That means that the items it uses are in a way irrelevant to the build's stats. When you try to figure out max AB, if there is any item being included in your calculations, you should mention it and also mention the value of the stat without said item (s). Just like Mick did, providing his calculations to the build's stats. I like how high the AB is, don't like how low the AC is .<br/>\n<br/>\nBTW I created a toon on Antiworld, but I have to say that I didn't like the custom modifications that you have made there. They clearly favor melee-oriented toons while clearly disfavoring casters (like halving Damage Shields). If you have a caster in fron of you with Mestil's Acid Sheath, then you have to dispel him or have enough HP to withstand the damage. This looks a lot like a Brazilian PW I used to play in. IMO some alterations there should be reviewed so as to diminish the gap between classes, not augment it.<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Nemusator",
      "avatar": "no_avatar.png",
      "timestamp": "12:07 AM - Oct 27, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm not sure what are you missing, but I made this character solely to post it here, and deleted it afterwards so I can't double-check. Ab values are definite. If you would make the char on Antiworld by this recipe it would have same stats. Also there are no items which can grant you mind immunity or alike. And since this is a team pvp, I usually just have tendency to wreak havoc for as long as I can. On the other hand, if I was dealing with something which abuses my low will save, I would wear two +5 to will items, but I highly doubt they would help me much vs anything with high DC. Now, is it just the Antiworld, but I'm pretty sure that con modifier has something to do with the DC of PDK's fear. Only, we nerfed it's endless duration. <br/>\nI also think that the more details the post shows, the more insight into the build itself you have. So I think it is cool to post what your gear gives you, but of course, you will make calculations with your own equipment which is available to you on your server. Also, any good mage player can own on Antiworld... Try, it and you will see. In fact, people are constantly complaining that mages are OP. Which is true in case of good mage player vs not so good other class player. Also, you don't have to be an active player to post your ideas, suggestions... So just go ahead if you have something in mind which could maybe improve things.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:29 AM - Oct 27, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You got your stats from NWN's character sheet? You need to know that the stats there are inaccurate. To get the real numbers, you have to calculate them, or have <a class=\"postlink\" href=\"http://nwvault.ign.com/View.php?view=Other.Detail&amp;id=8760&amp;id=856\" rel=\"noreferrer\" target=\"_blank\">Kamryn's Character Build Calculator</a> calculate them.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Nemusator",
      "avatar": "no_avatar.png",
      "timestamp": "11:45 AM - Oct 27, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Tanks, I knew about the sheet being wrong, but I could test  ab on dummies, though I didn't have opponent to test other properties. Posted data from previously tested similar builds would also be invalid...This will help in the future I guess.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "8:41 PM - Oct 29, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Firstly, MUCH better when it comes to the posting. As to the equipment, nothing wrong with listing things you recommend as a side-note at the end of the build (some do, some don't), but don't include the gear figures in your stats. Naked, unbuffed stats is what you need to set out here. Then, under the naked, unbuffed stats, feel free to add in your Buffs (i.e., any spells, feats or skills you actually own, not gear/scrolls/potions but stuff you actually \"own\". Like say you took Spellcraft which gives +1 save boni vs. spells for every 5 points of it, but you didn't). You don't own potions or gear, so please do not include them in the calcuations. It's OK after setting out all those naked stats, followed by your buffs, skills (the stuff you own) to show what Vick might look like in reasonable gear (say, +6 to a stat, +5 weapon or something like that), but after the naked stats followed by stuff you actually own. <br/>\n<br/>\nAlso OK (and in fact it's a really good idea) to point out the weaknesses and mention how to go about i.e. shoring up the will save with clarity potion (or mind-blank scroll, assuming UMD). This way we know that you know, and lets players who may not know about these things know. WIll save is typical weakness of meleel generally speaking (also one of the easiest things to shore up PvM/E); players might find stuff like that helpful to know, but don't over innundate them with gear--might give them the wrong impression (i.e. that he's gear-needy, when epic WM ain't).<br/>\n<br/>\nIn terms of calculating AB, Damage and AC, here you go: <br/>\nAB: BAB (30 here) + STR Mod (or DEX if a finesser) (+12 at 34 STR)  + feats (+1 WF, +2 EWF, +1 WF), + WM SWF (+7 w. 28 of it): 53 as Mick sets out. <br/>\n<br/>\nAC calc: AC = 10 + armor bonus + shield bonus + dodge bonus + natural bonus + deflection bonus + other AC. In this case, 10 Base +1 Dex +4 Tumble (cross-class) +2 AS: 17 (Naked). +8 Mundane Plate: 25 (tower would add +3 and another source for more in terms of gear, but using a 2-hander you can't use a shield, though). I know there's something about \"mounted combat\" potentially giving a dodge bonus (once per round, attempting a ride check for a potential +1 AC for every 5 of the check result over 10 ( no penalty if the check result is under 10); however, for this to apply must actually be mounted and train the ride skill (comes with benefits as well as penalties, but gotta love that where properly enabled rider gains HPs, AC from their mount). Please don't include that cool tumble stone you get in your world (I see where that extra is coming from, heh). Your Naked AC is 17, not 21. Mundane Plate adds +8, for an AC 25, yes? I know, dodge gives a +1 on current attacker, but that's 26; unless you're in expertise mode (+5 ac, -5 ab) in which case you deprived yourself of some AC there, as would take it to 30 (+1 dodge). If that's what you meant, then you cheated yourself out of a bit of AC.  <br/>\n<br/>\nDamage: weapon (Greatsword: 2-12) + STR Mod (12 x. 1.5 2-hand boni: 18, +6 WS/EWS, or: 2-12+24 .<br/>\n<br/>\nFear DC on PDK is 10, +PDK level and STR Mod, not Con, as Mick points out. Its a fear spell, duration tied to PDK level, and easily negated (Protect v. Alignment scroll or spell, clarity potion or mind-blank scroll ... If want to see a really cool \"fear\" DC, check out that of a raging Barbarian with terrifying rage (runs off the intimidate skill), just saying). Bard would be better here (skills like tumble (AC), listen (very useful PvP especially), UMD for things like the mind-blank scrolls among so many other things, with a much better inspire courage, curse, etc. and more of it) but we've lots of those already. <br/>\n<br/>\nNice to see PDK used in a build, something a bit different around here (thanks for the build!). Hey, is there full horse support in your world? Think it would be cool to see one of these guys mounted, maybe doing the archery thing (feats to decrease the ab penalties when mounted, etc.) and thus getting the whole ride AC boni and all that good PDK stuff coming into play; would be nice to see. Meantime, cool build. You hit (AB), you damage. Simple. <br/>\n<br/>\nRide ON ~ Tyr.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}