{
  "category_name": "Character Building",
  "category_id": "000",
  "forum_name": "General Discussion",
  "forum_id": "002",
  "id": "247",
  "name": "How do I Gandalf?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/how-do-i-gandalf-t2353791.html",
  "author": "C1QP0X",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "1.0K",
  "posts": [
    {
      "author": "C1QP0X",
      "avatar": "no_avatar.png",
      "timestamp": "8:40 AM - May 01, 2014",
      "content": "<div>Funny topic <br/>\n<br/>\nI've been playing a World of Torr server as of late (mostly by myself haha) but I was thinking I might try out playing as a Wizard on it. Anyways, looking through all the spell changes on these things and such most often just makes my head hurt. I was hoping I could get some character build suggestions! Below is all the relevant PW information.<br/>\n<br/>\nSpell Changes:<br/>\n<br/>\nAcid Arrow: Ranged touch attack, no SR<br/>\nAcid Fog: Allows no SR, damage 5d6 (fortitude 1/2)<br/>\nAcid Splash: Allows no SR, damage 1d2+1/3 levels<br/>\nAura of Glory: Healing increased to 1d6+1/3 levels, also damages hostile undead creatures for the same amount<br/>\nAwaken: Also adds +1 Natural AC/2 levels and +4 All Saves.<br/>\nBall Lightning: Damage increased to 4d6, maximum of 5 missiles per target, 15 missiles in total<br/>\nBane: Causes -2 penalty<br/>\nBestow Curse: Reduces all attributes by 4<br/>\nBigby's Hand Spells: Now use Discipline instead of STR checks, one check every round<br/>\nBlade Thirst: Now gives Keen effect and +1d8 positive damage. Duration increased to 2 rounds per level<br/>\nBull's Strength: Now gives 3 + 1/5 levels of ability increase. Empower Spell increases this by 1 and Maximize by 2. Capped at +7<br/>\nBurning Hands: Damage increased to 1d6/level<br/>\nCat's Grace: Same as Bull's Strength<br/>\nCone of Cold: Will additionally slow targets that fail their fortitude save<br/>\nContagion: Added Gargantuan AoE<br/>\nDarkness: Duration halved (1 round per 2 levels)<br/>\nDaze: Now works on all HDs<br/>\nDarkfire: Damage granted is 1d6 + 1 per 4 levels of caster with no level cap<br/>\nDispel Magic: Spell Focus: Abjuration now adds +2 to dispel checks and Greater Spell Focus: Abjuration adds +4. If the target has Arcane Defense (Abjuration), dispel checks are lowered by 2<br/>\nDivine Favor: +1 AB/Damage per 4 character levels, to a maximum of 4<br/>\nDoom: Causes -3 penalty, and the damage penalty is now physical instead of magical<br/>\nEarthquake: Damage increased to 10d6+1/level. Additionally knocks targets down for 1 round on a failed save<br/>\nEagle's Splendor: Same as Bull's Strength<br/>\nElectric Jolt: 1d3+1/3 levels damage<br/>\nElemental Shield: Does not stack with other damage shields<br/>\nEndurance: Same as Bull's Strength<br/>\nEnergy Drain: Ranged touch attack, no save, drains 2d4+2 levels<br/>\nEnervation: Ranged touch attack, no save<br/>\nFlame Arrow: Ranged touch attack, no SR, no reflex save, number of arrows reduced to CL/5 (but minimum arrows increased to 2)<br/>\nFlame Lash: 4d8+1d8/3 levels damage<br/>\nFlame Weapon: Damage granted is 1d6 + 1 per 4 levels of caster with no level cap<br/>\nFlare: 1d2 fire damage, 1d2+1 AB penalty on failed save<br/>\nFox Cunning: Same as Bull's Strength<br/>\nGhoul Touch: No longer requires a touch attack. Additionally does 1d2 negative damage / 2 caster levels. If the damage kills the target, a ghoul is summoned for the duration<br/>\nGlobe of Invulnerability: Gives 40% immunity to all damage except physical, duration increased to 2 rounds / level<br/>\nGreater Dispelling: Same as Dispel Magic<br/>\nGreater Restoration: This spell no longer heals much damage but removes all ill effects<br/>\nGreater Sanctuary: Duration 3 rounds + 1 round/5 levels, gives 100% spell failure for the duration<br/>\nGreater Spell Breach: Breaches 1 more effect with Greater Spell Focus: Abjuration. If the target has Arcane Defense (Abjuration), it will breach one buff less<br/>\nHarm: 30-60 damage depending on target creature size (smaller creatures take more damage). The damage can kill the target<br/>\nHeal: Heals between 30-60 hp depending on target creature size (smaller creatures are healed more). Heal potions heal a lower amount of HP<br/>\nHealing Sting: Damage increased to 2d6+2/level<br/>\nHold Animal: Duration reduced to 2 rounds + 1 per 5 levels<br/>\nHold Monster: Duration reduced to 2 rounds + 1 per 5 levels<br/>\nHold Person: Duration reduced to 2 rounds + 1 per 5 levels<br/>\nHoly Sword: Duration increased to 1 turn/level. Now grants 1d4+1/5 levels divine damage on the weapon instead of the other effects.<br/>\nHorizikaul's Boom: Now also stuns the target on a failed will save<br/>\nIce Dagger: Damage increased to 1d6+1/level, target will be slowed on a failed fortitude save (after failing reflex)<br/>\nImplosion: Removed +3 DC bonus, now does 1d6 bludgeoning damage/2 levels on all targets that successfully save<br/>\nImproved Invisibility: Certain things, such as taking damage, may break invisibility. Concealment bonus lowered from 50% to 30%<br/>\nIncendiary Cloud: Damage increased to 1d6/2 levels, to a maximum of 10d6<br/>\nInvisibility: Certain things, such as taking damage, may break invisibility<br/>\nIsaac's Greater Missile Storm: Maximum of 5 missiles per target<br/>\nLesser Spell Breach: Same as Greater Spell Breach<br/>\nLight: Grants +1 Natural AC vs Undead, +2 Spot/Search, -20 Hide/Move Silently<br/>\nLightning Bolt: Damage increased to 1d8/level<br/>\nMestil's Acid Breath: Allows no SR<br/>\nMestil's Acid Sheath: Damage reduced to 1d6+1/level, does not stack with other damage shields<br/>\nMind Fog: Lowers Will Saves by 2 even if save is made<br/>\nMinor Glove of Invulnerability: Gives 25% immunity to all damage except physical, duration increased to 2 rounds / level<br/>\nMordenkainen's Disjunction: Same as Dispel Magic<br/>\nNegative Energy Ray: Additionally drains 2 constitution (will save for 1/2)<br/>\nOwl's Wisdom: Same as Bull's Strength<br/>\nPoison: No longer requires a touch attack, poison type changed to more powerful Wyvern Poison, added Gargantuan AoE<br/>\nPremonition: Gives +3 Dodge AC (stacks with other AC types) and +3 Reflex save instead of DR<br/>\nQuillfire: Damage increased to 2d8+1/2 levels and damage cap removed. Additionally causes Blindness for 1d2+1 rounds (fortitude negates)<br/>\nRay of Frost: Now requires a ranged touch attack. Damage increased to 1d4 + 1/3 levels<br/>\nRemove Blindness/Deafness: Area of effect increased from medium to colossal<br/>\nRemove Paralysis: Area of effect increased from large to colossal<br/>\nScare: Now applies -2 AB, Damage and Mind Affecting saves to targets of any HD on a failed will save, and fear effect up to 8 HD<br/>\nSleep: Maximum HD affected increased to 12, Caster level +1d4 HD of creatures affected in total<br/>\nSound Burst: Damage increased to 1d8+1/2 levels, to a maximum of 1d8+10<br/>\nStinking Cloud: Allows no SR<br/>\nStone Bones: AC bonus increased to +6<br/>\nSunburst: Blindness duration 1 round/level, affects all except the caster in the area of effect<br/>\nTime Stop: Instead of the normal time stop, it freezes creatures in the entire area. Allows SR but no save. Duration is 1 + 1d3 rounds. For every casting of Timestop within the same 5 minute period, the duration you obtain will be at an additional -1 round. This can cause the spell to actually fail on a 3rd consecutive casting!<br/>\nTrue Seeing: This spell does NOT grant the Truesight ability, instead it grants See Invisibility, immunity to phantasmal killer and +1 Spot/2 levels<br/>\nUndeath to Death: Area of effect reduced to Gargantuan. Does 10 damage per level instead of killing instantly (no cap)<br/>\nVampiric Touch: Additionally drains 2 strength<br/>\nVine Mine: Camouflage bonus increased to +10 Hide and Move Silently<br/>\nVirtue: Now increases HP by 3<br/>\nWall of Fire: Allows no save, damage is now 2d6+1/2 levels<br/>\nWeird: Damage on a successful fortitude save increased to 4d6+1/level, causes fear for 1d3+2 rounds on a failed will save<br/>\nWord of Faith: Allows a will save<br/>\n<br/>\nOther:<br/>\n<br/>\nExpertise and Imp. Expertise both work while running around, casting spells, using skills, it persists through rest (a bit different from other PWs, I know) so that would totally be useful for magery. It stays turned on til you actually click or hotkey it again to turn it off, or until you enter another mode.<br/>\n<br/>\nParry is weird on WoT, too. Every 5 ranks you get +1 AC while in parry mode but the down-side is you lose -2 APR unless you have Imp. Parry, then it's only -1 APR.<br/>\n<br/>\nAlso.. Ranger as a class allow you to track creatures, players, various npcs, etc. I was thinking I might take a level of Ranger to utilize that cool feature? Perhaps grab some trapping skills as well?<br/>\n<br/>\nOH YEAH! Most importantly the level cap is 25.<br/>\n<br/>\nPS: If anyone suggests Shadowdancer for a possible Wiz build: one must have 4 levels of SD to gain HiPS.<br/>\n<br/>\nI'm mainly just not sure on starting stats and such. But if someone would like to suggest a whole wiz build for 25 that's cool too</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:15 PM - May 01, 2014",
      "content": "<div>Every PW that i read it's rules pretty much has it's own changes to the original game's spells, some of them are good and some of them are bad but there are things that just you can't comprehend. 30 hp's heals are ridiculous by any measure.<br/>\n<br/>\nAs for your mage concept i don't see any \"fixes\" to the almighty necromancy school, so good old Finger of Death, Wail of the Banshee, Fear and the rest are what you should get if you want a mighty spellcaster, or else you will struggle to kill even a lowly bandit with those maximized IGMS that do 30 damage... Even better (or worse) Torr made those more powerful as i can see here that you can Energy Drain  =&gt; FoD your opponents with an effectively increased DC. Heck, Daze is better than IGMS now.<br/>\n<br/>\nThe changes to IE are welcome, even more for a mage! Max your parry too since you dont care about APR. I don't know if someone else noticed but i smell some fine cheddar here...</div>"
    },
    {
      "author": "C1QP0X",
      "avatar": "no_avatar.png",
      "timestamp": "4:06 PM - May 01, 2014",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong>I don't know if someone else noticed but i smell some fine cheddar here...</div></blockquote>\n\nThat's that fart I let Val.</div>"
    },
    {
      "author": "C1QP0X",
      "avatar": "no_avatar.png",
      "timestamp": "6:30 PM - May 01, 2014",
      "content": "<div>Btw dudes (all jokes aside lol) I did put a URL in the \"Persistent World\" section of these forums in my World of Torr thread.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:06 PM - May 01, 2014",
      "content": "<div>I am sorry that i don't understand your vulgar attempts of humor lad, but point is taken. I will refrain from responding again in your questions since it seems that isn't what you are looking for.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:48 PM - May 01, 2014",
      "content": "<div><blockquote><div><strong>C1QP0X wrote:</strong>How do I Gandalf?</div></blockquote>\nWhat exactly do you want your Gandalf to do?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "C1QP0X",
      "avatar": "no_avatar.png",
      "timestamp": "2:38 AM - May 02, 2014",
      "content": "<div><blockquote><div><strong>Valerfor wrote:</strong>I am sorry that i don't understand your vulgar attempts of humor lad, but point is taken. I will refrain from responding again in your questions since it seems that isn't what you are looking for.</div></blockquote>\n\nAh yeah.. I probably should've responded to the rest of what you said but once I saw that last part I couldn't resist lol no worries man<br/>\n<blockquote><div><strong>Mick Dagger wrote:</strong><blockquote><div><strong>C1QP0X wrote:</strong>How do I Gandalf?</div></blockquote>\nWhat exactly do you want your Gandalf to do?</div></blockquote>\n\nMan, I was thinking I would do some type of PK build and I might throw in a Ranger level for the tracking feature they have on Torr, unless there are other multi-classing opportunities that are far superior to a crummy Ranger level.</div>"
    }
  ]
}