{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "015",
  "name": "How To Play A Wizard?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/how-to-play-a-wizard-t2355456.html",
  "author": "CZero",
  "avatar": "10759266_1585974228.jpg",
  "replies": "7",
  "views": "2.2K",
  "posts": [
    {
      "author": "CZero",
      "avatar": "10759266_1585974228.jpg",
      "timestamp": "7:56 AM - Apr 28, 2020",
      "content": "<div>This is probably a really silly question, but for whatever reason I struggle when it comes to wizards in this game.<br/>\nI'm not confident in spells choices when leveling and what to use when.<br/>\nAre there resources out there I can read up on to get me up to speed? The idea is very appealing to me, but every time I play one I just get dumpstered!<br/>\nI'm still learning as I go, as I'm sure everyone has had to, but would like to get pointers from those who already know if possible.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:03 AM - Apr 28, 2020",
      "content": "<div>This may be helpful : <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/melee-mage-wizard-40-t2354625.html\" rel=\"noreferrer\" target=\"_blank\">melee-mage-wizard-40-t2354625.html</a></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:51 AM - Apr 28, 2020",
      "content": "<div>The Wizard<br/>\n<br/>\nI personally like Wizards above all things NWN.  Even when they are nerfed, I still like them.<br/>\n<br/>\nWhy is this?<br/>\n<br/>\nThe Wizard has almost every ability available to it - in the name of spells, abilities, etc.  This makes it very, very versatile and for me, fun to play.<br/>\n<br/>\nThe downside to playing a Wizard is, well, it starts out very squishy.  So you want to keep it from taking damage.  One does this with a sturdy familiar (with DR) and Summons, and giving the Wizard a ranged weapon (xbow).  In the beginning levels, Wizards mostly rely on protection spells like Mage Armor, Shield, and Protection from Evil/Good, where it can.  They won't last all that long yet, but that will change later.<br/>\n<br/>\nAs a Wizard grows in levels, it grows in power - both due to more spells, but also because it gets more abilities.  Being able to Scribe scrolls, and Craft Wands (must take the feat and it can even Craft Potions by taking a feat) helps keep the lower spells in bulk.  A Wizard will tend to rely on the meta-magic feats to help extend and improve his spell book and amount of spells.  Note that a Wizard can learn a spell from a scroll - one of the best abilities that a Wizard has.<br/>\n<br/>\nPersonally, I would suggest that one read up on all the spells that a Wizard can cast, to get to know them.  Spells are to Wizards what weapons are to Fighters : their bread and butter.  I will tell you now, not all spells are created equal - there are those that shine above the rest, and definitely should be in one's inventory.  I would also suggest getting and learning as many spells as possible (if that means all of them, by all means!).<br/>\n<br/>\nFor the most part, self-applied spells and direct damage spells will be prioritized over more specialized spells like Domination, Charming, and the like.  The reason being that although in some situations a specialized spell is exactly what one needs, generally speaking protecting oneself from damage and damaging the enemy is preferrable.  Also, apart from the Pen and Paper roots, NWN's versions of Domination, Charm, etc is pretty meh.<br/>\n<br/>\nSome of the non-damaging spells, however, are invaluable.  The Bigby spells, in particular.  Being able to immobilize enemies can be of immense value and use, particularly nasty melee-ers. Mordenkainen's Disjunction will be invaluable in not only reducing an enemy(ies) Spell Resistence, but also in stripping enemies of their magical spell protections!  In this sense, the entire Breach line of spells are very useful, and Lesser Breach can be put on a Wand, making it a nice way to always have a load of spell erasure at your disposal.<br/>\n<br/>\nFrom your direct damage spells, you will find that Magic Missle (which never misses and has no save), Isaac's Lesser Missile Storm (also never misses and has no save) and Isaac's Greater Missile Storm (never misses and has no save) are among the best and definitely belong in your spellbook.  By using meta-magic feats, one can double or even triple the amounts of these that one can cast before having to rest.<br/>\n<br/>\nFor the most part, I would suggest sticking with these types of spells when starting out as a beginning Wizard, because it will makes things much easier.  After one starts to get a feel for the Wizard Class, one can start experimenting with all the other spells that a Wizard has access to.<br/>\n<br/>\nFor defensive spells, there is Mage Armor, Shield, and Protection from Evil/Good, spells that will remain useful even at high levels.  For beginning protection, they are invaluable, but as one rises in level, one gets access to even more useful spells, such as Ghostly Visage.  This type of defensive spell will not be useful for all that long, but for the time that it is, it yields amazing results (depending on the environment one plays in) because it can absorb damage without being depleted.<br/>\n<br/>\nThen one comes to the Improved Invisibility spell.  This is doubly useful, as it makes one invisible, but also gives one 50% displacement, which is a great way to reduce getting hit.<br/>\n<br/>\nAlong the way, one will gain access to Stoneskin.  This useful defensive spell will absorb certain amounts and types of damage up to a certain amount dependingly.  It's big brother, Greater Stoneskin, is an improved version of this.<br/>\n<br/>\nThen there is the whole line of energy shieldings, from the Elemental Resistence line to the more powerful Energy Buffer.  Always good to have active.<br/>\n<br/>\nFrom there, the defensive spell Shadow Shield and Premonition.  These spells fill out the defensive measures that a Wizard can bring to bear, before relying on Epic style stuff.<br/>\n<br/>\nSo what is a typical Wizard show of force?<br/>\n<br/>\nWell, most Wizards rely on having their long term buffs active, first of all.  Various spells last hours per level, and should be active all the time.  As the Wizard surveys the opponent from safety (invis, improved invis, or Greater Sanctuary, dependingly), from there a selection of attack spells will be decided upon.  <br/>\n<br/>\nIf it is a single opponent, then there is no need for mass Area of Effect spells to control the masses (like fireball, or Firebrand, Cone of Cold, etc).  Here one can normally rely on all your magical missile line of spells to concentrate damage on the enemy.  Of course, most enemies will not like this - so one needs a way to keep the enemy from one's person.<br/>\n<br/>\nHere Summons can be a help, distracting the enemy.  Also, immobilizing it (Bigby) can be immensely effective.  Some like to use area of effect spells that apply status effects and/or damage to keep the enemy away (or slow advance).  One may be able to get by with just remaining unseen and letting the summons take care of the threat.<br/>\n<br/>\nFor masses of enemies, Wizards have the necessary tools to take care of business.  Here is where one can utilize such spells as Firebrand, Cone of Cold, Ice Storm, Prismatic Spray, etc.  One should try to apply a spell that will have maximum effect.  This will rely on experience, knowledge, and in most cases, meta-knowledge of the environment.  For example, if it is a group of Fire Giants, don't hit them with Firebrand (of which they will be mostly immune).  Instead, hit them with their weakness - Cold.  And so on.<br/>\n<br/>\nNow, one may think that with all this power, there has to be a catch.  And there are.<br/>\n<br/>\nWithout Haste (or Quicken, as the case may be), you can only cast 1 spell a round.  This can get you in trouble, fast, if your enemy can close the distance between you before one can complete the spell, or range you and cause you to drop your spell due to concentration failure (and damage!).  Being Haste (especially either perma-haste or extended Haste) before casting, will allow you to cast 2 spells in a round, meaning that you will at least get the first one off (and if selected wisely, then the second because the enemy(ies) will no longer be able to close in).<br/>\n<br/>\nAlso, as you only have a certain amount of spells before having to rest to regain them, it is easy to go hog wild and blast everyone and everything with all the spells in your repertoire.  Which will leave you without spells that you might need later.  So learn how to conserve your spell use by selecting and using your spells wisely (one example was with the Fire Giants above).  It is better to have spells left over after an encounter, than it is to have used them all up and not have any more for the next encounter (especially in an environment that controls resting).<br/>\n<br/>\nNote that a Wizard is not just all spells.  As the Wizard has the main stat Int, it naturally has a lot of skill points.  Use these to make your Wizard more effective.<br/>\n<br/>\nI hope these little tips are helpful.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "9:44 AM - Apr 29, 2020",
      "content": "<div>Hi CZero<br/>\nI can add a few screenshots that will add to what Web has written.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202004/10759084_85cf19ee2d1aa2de29fb895c60f0defb_t.jpg\"/><br/>\nThis is Bigby's 6 (Forceful Hand) which is on WebShaman's recommended spell list on his <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/melee-mage-wizard-40-t2354625.html\" rel=\"noreferrer\" target=\"_blank\">Melee Mage</a>. <br/>\nThis attempts to knock down the opponent for 1 round / level depending on a strength check. <br/>\nPharmon is an exceptionally powerful mage opponent, he killed two of our party of 6, but I got my Bigby's off, his strength is not that high, being a mage, and he is as good as dead to the meleers (Ddad, Zelcandra, Yrkoon) in my party. <br/>\nIf I was solo, I would be using wands of ILMS and a summon to do damage to Pharmon, but in a party I can save my wands and spells until they are needed.<br/>\nOpponents who are knockdown immune cannot have Bigby's 6 applied to them. <br/>\nI like this spell a lot against enemy spellcasters.<br/>\n<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202004/10759084_9465e65b4be6a7c9d029ced7bf82d422_t.jpg\"/><br/>\nThis is a screenshot of Aquarius and Franz having Bigby's 7 (Grasping Hand) applied to them by Drow Wizards (who have now died), this spell is also on WebShaman's spell list. <br/>\nThe duration is quite long so we are waiting for it to wear off. I say some encouraging words to my party in the meantime, they have done really well to protect my cleric archer.<br/>\nI am not aware of any immunity to the grasping effect. The grasping effect means they cannot move. As they are melee characters this can limit their effectiveness. <br/>\nThere is also a stun effect as well. They can however, fight when they are grasped provided they are not stunned by the Bigby's 7. (so mind immunity helps)<br/>\nBecause opponents with Bigby's 7 can fight back, I prefer Bigby's 6 if they are susceptible to it. <br/>\n<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202004/10759084_26e8a09c1c5fbd4943731fbb9e3da52a_t.jpg\"/><br/>\nThis is Grom and myself spamming our wands of Issac's Lesser Missile Storm (ILMS) against a tough archer in a castle we cannot get into melee range of with terrain in the way<br/>\nI believe Grom also used a wand of Evards Black Tentacles as well on that archer<br/>\nBoth ILMS and Evards do not have saving throws so the full damage is applied here. <br/>\nIf I used a wand of flame arrow as a comparison, if the archer had evasion he could theoretically avoid all my damage by passing a few reflex saves. In the environment I play in, this happens often when using such wands.<br/>\nLevel 4 have an enormous number of great spells to put on wands, with so many usages / day they help preserve your memorized spells like Firebrand, IGMS for tougher fights.<br/>\nIn a rest restricted environment these are essential, especially for buffs too.<br/>\nYou can see both Ananie (myself) and Milo (Grom) are buffed with Premonition (+5/30-), Mind Blank (mind immunity), Protection against Spells (+8 to saves) and Improved Invisibility (50% concealment)<br/>\n<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202004/10759084_7b3a0067df8f385a74cff921e6c5a42e_t.jpg\"/><br/>\nThis is the damage shield strategy that Grizzled_Dwarflord taught me <br/>\nAll these melee warriors are killing themselves against extended Mestil's Acid Sheath, extended Elemental Shield and extended Death Armor, very rapidly, <br/>\nI clear out my action queue to make myself \"flat footed\" (by standing still, doing nothing) and lose all my dex, tumble and dodge AC, so they hit me more often and kill themselves even faster.<br/>\nI trigger attacks of opportunity by drinking cure potions intermittently, or moving around without tumble skilled.<br/>\n<br/>\nA normal arcane caster (ie non-pale master) will have such low AC that multiple critical hits will occur and survival will not be long without spells such as epic warding or premonition<br/>\nIn this situation I have used Shapechange -&gt; Iron Golem to make myself critical hit immune and ensure I survive. <br/>\nThis polymorph method has significant downsides for wizards including being unable to use any items except potions, losing spell casting, having horrific AB, and losing memorised spells as magical Int bonuses from equipped items do not transfer when polymorphed in this way. <br/>\nKnight of Limbo describes this strategy as the \"Iron Golem of Doom\" in his sorcerer guide.<br/>\n<br/>\nGDL uses Palemaster to obtain crit immunity in his Mestil's Pale Juggernaut and Emissary builds, meaning his builds can cast spells during combat so they are not a one-trick ponies in this situation with the damage shields up and have other arcane spells and strategies to use as well. A nice Firebrand or Wail of the Banshee looks very attractive to me in this situation whilst dealing a pile of damage with the shields up.<br/>\n<br/>\nTheres a few more resources that might help: <br/>\nThere's an thread on wizard/sorc summons <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/wizard-and-sorcerer-spellcasting-strategies-t2355313.html#p18613\" rel=\"noreferrer\" target=\"_blank\">here</a>. Summons are essential to master if you play an arcane caster solo.<br/>\nKnight_ofLimbo wrote a guide to sorcs and spell casting strategies <a class=\"postlink\" href=\"https://web.archive.org/web/20100417103320/http://nwn.bioware.com/forums/viewtopic.html?topic=487784&amp;forum=42&amp;sp=0\" rel=\"noreferrer\" target=\"_blank\">here</a>. <br/>\n<br/>\nHope that helps</div>"
    },
    {
      "author": "Ten Pura",
      "avatar": "10759105_1562697297.png",
      "timestamp": "7:23 PM - Apr 29, 2020",
      "content": "<div>Hail Czero!<br/>\nThe early levels are quite hard as a wizard. You don't have enough spells to burning hands everything in front of you, ranged as slow progress, and melee is usually deadly. Here's a short guide to the first several levels:<br/>\n<br/>\nAt level 1, the best spell is Sleep. However, it falls off at level 2 and quickly becomes useless. This is a trap; don't prepare Sleep unless you know who/what you're going to use it on in advance. Instead, prepare Summon Monster I, and as many Mage Armors as you have in the party (Summon, Familiar, Henchman, Self). In standard NWN, imp is probably your best familiar at level 1 due to DR. If your familiar will be out and engaged in melee, he/she/it is the first priority for Mage Armor. After that, it's usually henchman, then Summon. If you have enough slots, Mage Armor yourself. Stay out of melee and use line of sight to protect yourself from ranged. Send in your henchman and Summon to deal with ranged until the target switches to melee, then step out and pelt them with bolts, arrows, stones or darts. Daze is a powerful cantrip at this level. Prepare it. If you have leftover spell slots, prepare Magic Weapon and use it on your hardest hitter.<br/>\n<br/>\nAt level 2, if you'd like to dip into anything except rogue, this is a great level to do it at.  Same strategy as before, but now you buff, then put on the best armor your encumbrance can afford. As an aside, if you want to dip into rogue, 1st level is the place to do it for the additional 24 skill points.<br/>\n<br/>\nOtherwise at level 2, you should now have enough level 1 slots to Mage Armor the party.<br/>\n<br/>\nAt level 3, get Summon Monster II and Bull's Strength. If these are available on scrolls, buy them (if you don't have any laying about) and learn something you can't get easily during level up. There's lots of good spells at this level (except Blindness/Deafness), so it's tough to go wrong.<br/>\n<br/>\n4th level, continue to buff everyone, wear any armor you can, and stay out of danger. Consider swapping that imp familiar for Faerie Dragon, Faerie, or Panther.<br/>\n<br/>\n5th level Summon Monster III, Fireball, Stinking Cloud and Slow are favorites of mine. If you need more defense at this point, include some Protection from Evil, but I find that I don't get much milage out of it in many environments (because I'm fighting bears and wolves or the module creator didn't set the creature alignment to evil). For tough fights, buffing your summoned dire wolf with Bull's Strength and Flame Weapon will wreck things.<br/>\n<br/>\nLevel 6, Greater Magic Weapon (GMW) replaces the level 1 spell Magic Weapon. Use it on your Summon and henchman. Fill the freed up slots with something offensive: Magic Missile, Grease, and Color Spray are good choices.<br/>\n<br/>\nLevel 7 Summon Monster IV and Stoneskin are a must. Others to aim for are Ice Storm, Evard's Black Tentacles, Improved Invisibility, and Lesser Spell Breach. Isaac's Lesser Missile Storm will be important later, but less important at level 7.<br/>\n<br/>\nMore to come when I get some more time.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "7:31 PM - Apr 29, 2020",
      "content": "<div><blockquote><div><cite>Ten Pura wrote: <div class=\"responsive-hide\">Apr 29, 2020</div></cite>, imp is probably your best familiar at level 1 due to DR. </div></blockquote>\nThe fire and ice mephits also have DR, and they do elemental damage as well.  The imp is  poison damage which may or may not be effective.  Wont bother undead at all, but against the living it might be ok.    Hell hound also does a burning hands style cone of fire in front of itself, and its bite also does fire damage.<br/>\n<br/>\nThe Bat can be quite fun as well as it has a fear effect, which once again wont affect the undead, but it will a lot of other things.<br/>\n<br/>\nFaerie Dragon can cast improved Invis.<br/>\n<br/>\nSo while DR is nice, it can also be helpful to tailor the familiar to the environment.  And don't forget...  if you are power gaming, you can always change familiar at every level.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "7:36 PM - Apr 29, 2020",
      "content": "<div>And I've posted this before, but at low level it can be even more important.   Don't forget that you dont have to have trap skills to use trap components.   Tanglefoot bags are grenade like missiles that can slow.  Caltrops do 1 point of damage at a time... 20 points max.   Acid Flask does acid splash damage, etc.    You can always use those to your advantage to slow/damage/kill things before they get to you.  Or to just give yourself a bit of breathing room while aiming that next spell.<br/>\n<br/>\nAnd a wand of coldfinger?!?!   yes please... thats 20-50 charges of 1d4 damage.... that kills a lot of goblins...</div>"
    },
    {
      "author": "The Flying Rodent",
      "avatar": "no_avatar.png",
      "timestamp": "5:45 AM - Apr 30, 2020",
      "content": "<div>Hey CZero!<br/>\n<br/>\nThere are a lot of ways to build and play Wizards (having plenty of skills and feats available grants a lot of flexibility), and it looks like there's already a lot of information in this thread already about how to specifically pilot Wizards.<br/>\n<br/>\nPre-20 is where 90% of a Wizard 'kit' is fleshed out, so I guess if you were after some sort of 'General Guide' to building/playing one:<br/>\n<br/>\n<strong>1. Decide what sort of Wizard you want to be.</strong><br/>\n<br/>\nThis is applicable of any character (hence why Character Build forums exist, derr), but it's very important for Wizards. Do you want to focus on Spell DC's for particular school/s ? Do you want to be tanky? Do you want to entertain the idea of hitting things? Decide on what sort of build/playstyle you want to aim for, and head towards that from the get go. If you're willing to sacrifice an entire spell school for 1 more spell slot per level, then taking an appropriate Specialised Spell School can be a good idea.<br/>\n<strong><br/>\n2. In the Early Levels, from a Damage perspective, Melee mostly trumps Ranged.</strong><br/>\n<br/>\nBecause of the way damage scaling works in NWN, melee is preferable to ranged the majority of the time ... and the same is true for Wizards. Flame Weapon, Strength boosting spells/items, and Greater Magic Weapon can allow a low-level Wizard to potentially pump out more DPS with a Quarterstaff than they can by launching spells, and 'swinging at stuff' never runs out of charges per rest. <br/>\n<br/>\nWhat this also means is that: If Wizards get into melee range unprepared they can get flattened, and that Wizards should utilise DR/AC buffs and as many Melee minions as possible in early levels. Summons absolutely rock. Familiars perhaps less so in the melee department, but they can provide utility in other ways (e.g. Faerie Dragons have Improved Invisibility available from level 1, and can be possessed to cast it on the player). <br/>\n<br/>\nIf you are planning on making a Spellsword-type Wizard that picks up Armour Proficiency early, remember that Darkness and True Strike can be cast in armour with no penalty. Which are both really really silly for a buffed up melee character.<br/>\n<br/>\n<strong>3. The unique advantages that spells provide: Buffs, Summons and Crowd Control.</strong><br/>\n<br/>\nWhilst the Damage realm mostly belongs to melee, spells have flexibility in other areas. Sleep at level 1 can put an entire horde of goblins out of action for long enough for you and your pets to Coup-De-Grace them all. Wizards can boost their AC very highly at early levels, and combined with Armour proficiency this can convert them into veritable tanks. Evard's Black Tentacles and Bigby Hands are ostensibly disgusting spells. The list goes on. <br/>\n<br/>\n<strong>4. Try to know what you're going up against.<br/>\n<br/>\n</strong>Wizards have incredible flexibility, BEFORE they head into battle. But what they don't have is much flexibility IN THE MIDDLE of a battle (that domain belongs to Sorcerers, with their illiterate 'on-the-fly' nature of doing things). If you know your enemy ahead of time, you can plan accordingly. If not, you can always have a 'general spellbook' that caters to different scenarios, but it won't be as efficient. <br/>\n<br/>\n<strong>5. General Spellbook Profile: Buffs/Utility Level 1-5, Damage/DC spells/Bigby Hands levels 6-8, Situational Level 9.</strong><br/>\n<br/>\nThis is of course overly generalising, but you should be aiming for this most of the time. Early damage spells do not really scale levels 1-5 (with some exceptions, e.g. Flame Arrow and Ice Storm), most of the 'Metamagic-able' Damage spells come in at level 5-8. Meanwhile Level 9 has 'the big guns' which accomplish different things, and thus selected to suit the scenario.<br/>\n<br/>\n<strong>6. An example of an interesting Wizard build.<br/>\n<br/>\n</strong>Pretty much the reason that I came to these forums in the first place, was to post this build (which ended up morphing into 2 varieties: One for the Original Campaign and one for the Expansions).<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/bearded-battlemage-oc-wizard-15-fighter-2-monk-1-t2354619.html\" rel=\"noreferrer\" target=\"_blank\">bearded-battlemage-oc-wizard-15-fighter ... 54619.html</a><br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/bearded-battlewitch-sou-hotu-wizard-23-fighter-4-a-t2354620.html\" rel=\"noreferrer\" target=\"_blank\">bearded-battlewitch-sou-hotu-wizard-23- ... 54620.html</a><br/>\n<br/>\nIt's basically a Wizard build, designed to be amongst 'the most efficient' characters for the Vanilla Single Player Campaigns. Of course, when I posted them here, the immediate reaction was 'Oh that's a Melee Wizard' followed by links to the build outlined earlier in this thread, but I can assure you that I arrived at the idea of this build independently ... because it just works.<br/>\n<br/>\nIt's incredibly versatile, and strong from level 1 onwards... but also loses potency past around the late 20's (i.e. when HoTU ends), so it's not something typically found in a level 40 online environment. <br/>\n<br/>\nRegardless, the \"Bearded Battlemage/Battlewitch\" build posts contain a wealth of information about how to play out the Campaign settings, which has a lot of crossover into Wizard play in general (the HOTU/Battlewitch link is probably more useful for level 40 play). So I recommend checking them out!</div>"
    }
  ]
}