{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "026",
  "name": "Original (Plague) Campaign: All Topics",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/original-plague-campaign-all-topics-t2354586.html",
  "author": "HipRedux",
  "avatar": "10577588_1510287072.jpg",
  "replies": "0",
  "views": "1.1K",
  "posts": [
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:56 AM - Sep 02, 2016",
      "content": "<div>TOPIC: Henchman Solutions<br/>\n<br/>\n The following is a reprint of various contributors from the legacy Bioware boards and BSN OC subforum regarding issues involving henchmen used in the Original (Plague) Campaign. It contains significant spoiler information so reader beware.\n<blockquote><div>\n (Recompiled &amp; edited from bioware.com OC forum sticky, topic originator: Ashnara, 2004)<br/>\n<br/>\n Note: Some of the issues described herein were addressed and corrected in the final (v1.69) Bioware patch.<br/>\n<br/>\n CONTENTS<br/>\n<span style=\"color:#FF8C00\"><strong>Debugging with Alternate Console Interface<br/>\n The Rehiring Problem<br/>\n Incomplete Henchman Stories<br/>\n Missing Henchman Quest Items and Contract Artifacts<br/>\n Lost/misplaced Henchman Quest Reward<br/>\n Henchman Quest Reward: Requirements<br/>\n Henchman Quest Reward: Spoilers<br/>\n Henchman Quest Reward: Description<br/>\n Vanishing Henchman<br/>\n Stuck Henchman Remedy<br/>\n Henchman Not Switching Between Melee and Range Attack<br/>\n Henchman In-game Preferences Resetting<br/>\n Tomi Stays in Stealth Mode<br/>\n Tomi Refuses to Disable/unlock or Remains Unresponsive<br/>\n DM Client with Multiplayer in OC<br/>\n Override Effects on Henchman with LINUX &amp; MAC (as of v1.6.1)</strong></span><br/>\n ----------------------------------------------------------------<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Debugging with Alternate Console Interface</strong></span><br/>\n<br/>\n Some of you may have trouble using the ~/` key or maybe it doesn't even appear on your keyboard. If this is the case then you can use the chat window to type in your console commands. It is the small window next to the word talk at the bottom of your screen.<br/>\n<br/>\n To use DebugMode with the chat window you put ## in front of your console command. The following is an example of how to spawn in an item using the chat window:<br/>\n<br/>\n To access DebugMode using this window, click in the window and then type:<br/>\n<br/>\n ##DebugMode 1 (this opens DebugMode)<br/>\n<br/>\n ##dm_spawnitem XXXXXXX (Replace X's with tag or blueprint resref, which will depend on the item you are spawning. With most items, you will be able to use the tag, but with some you will have to use the blueprint resref.)<br/>\n<br/>\n At this point the item will appear under your cursor, so be sure it is over a spot where you can pick the item up. Always be sure to close DebugMode when you are finished by clicking in the chat window and typing:<br/>\n<br/>\n ##DebugMode 0 (DebugMode is now closed)<br/>\n<br/>\n Here is a quick example of how to use the chat window to spawn in Daelan's chapter 2 quest item which you get when you kill Gorkan in Mutamin's Challenge.<br/>\n<br/>\n ##DebugMode 1<br/>\n<br/>\n ##dm_spawnitem NW_HEN_DAE2QT<br/>\n<br/>\n ##DebugMode 0<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>The Rehiring Problem</strong></span><br/>\n<br/>\n A number of people are having trouble rehiring henchmen after they have dismissed them. The majority of the time this is caused by dismissing the henchmen by way of the radial menu or by hiring another one and dropping the current henchman. The henchmen are scripted to be dismissed by the conversation dialogue. When they are not dismissed through conversation, it can cause problems. Example: they give you the line that they are working for someone else. This can be fixed by using DebugMode to reset their NW_L_HENHIRED variable.<br/>\n<br/>\n What you need to do:<br/>\n<br/>\n Before doing anything else, be sure to make a backup save (new save, not a quicksave). This will give you a save to go back to if something goes wrong. The next thing you need to do is drop the contract they gave you (the item they gave you when you hired them). You will get a new one when you rehire them. Make sure you type the following carefully. It is case sensitive. To enter DebugMode type:<br/>\n<br/>\n ~ or ` (depends on keyboard, key next to the 1 key)<br/>\n<br/>\n DebugMode 1<br/>\n<br/>\n You should see the word Success in the upper left corner of your screen. Next type:<br/>\n<br/>\n ~ or ` (whichever worked before)<br/>\n<br/>\n dm_setvarint NW_L_HENHIRED FALSE<br/>\n<br/>\n Your cursor will change to target mode, so click on the henchman you need to reset. The reason for this is because the variable is stored on the henchman. Some people have gotten 0 to work in place of FALSE here, but most of the time I have had to use FALSE. Then before doing anything else, be sure to close DebugMode by typing:<br/>\n<br/>\n ~ or ` (again whichever worked)<br/>\n<br/>\n DebugMode  0<br/>\n<br/>\n You should now be able to rehire the henchman and go on with the game. Under some circumstances relating to their quests, you may have to reset a henchman completely.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Incomplete Henchman Stories</strong></span><br/>\n<br/>\n If you have a henchman who refuses to complete their story for you or if you did not have their reward item on you when you first talked to them in chapter 2 or 3, then the following should help you solve the problem.<br/>\n<br/>\n You may need the henchmen tags so here they are:<br/>\n<br/>\n Tomi - NW_HEN_GAL<br/>\n Linu - NW_HEN_LIN<br/>\n Sharwyn - NW_HEN_SHA<br/>\n Daelan - NW_HEN_DAE<br/>\n Grimgnaw - NW_HEN_GRI<br/>\n Boddyknock - NW_HEN_BOD<br/>\n<br/>\n Before doing anything else, be sure to make a backup save (new save, not a quicksave). This will give you a save to go back to if something goes wrong. The next thing to do is to drop the contract they gave you when you hired them. Then make sure you have their reward item on you from the previous chapter. After doing all of this, you are ready to enter DebugMode. Be sure to type carefully. It is case sensitive. To enter DebugMode type:<br/>\n<br/>\n ~ or ` (depends on keyboard, key next to the 1 key)<br/>\n<br/>\n DebugMode 1<br/>\n<br/>\n You should see Success in the upper left corner of your screen. Next type:<br/>\n<br/>\n ~ or ` (whichever worked before)<br/>\n<br/>\n dm_setvarint NW_L_HENHIRED FALSE<br/>\n<br/>\n Your cursor will change to target mode so click on the henchman you are resetting. Remember this variable is stored on the henchman, and tells the henchman whether you have ever hired him or not. Next type:<br/>\n<br/>\n ~ or ` (again whichever worked)<br/>\n<br/>\n dm_setvarint NW_L_HENNW_HEN_XXX0 FALSE (replace the X's with the 3 initials from the henchman's tag that you are resetting, and replace the 0 with the chapter number you are in 1, 2, 3, or 4)<br/>\n<br/>\n Your cursor will change to target mode, so click on your character. This variable is stored on the PC, and keeps track of whether you have talked to the henchman before.<br/>\n<br/>\n ~ or ` (whichever worked)<br/>\n<br/>\n dm_setvarint NW_L_HENSTORYCX 0 (replace the X with the chapter number)<br/>\n<br/>\n Your cursor will change to target mode, so click on the henchman you are resetting. This variable is stored on the henchman and tracks how much of his story the henchman has told you. Then be sure to close DebugMode by typing:<br/>\n<br/>\n ~ or ` (whichever worked)<br/>\n<br/>\n DebugMode 0<br/>\n<br/>\n By resetting some or all of these variables, you should be able to get the henchman to complete his story and give you his quest.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Missing Henchman Quest Items and Contract Artifacts</strong></span><br/>\n<br/>\n (Information added to legacy thread, 8/19/2010, HipMaestro)<br/>\n<br/>\n All of the retrievable items for the henchman quests and their respective contract artifacts (obtained in Chapter 1 by paying a mercenary fee) are PLOT items and cannot be sold (unless noted otherwise below):<br/>\n<br/>\n Henchman Contract Artifacts<br/>\n Tomi: Contract - NW_HEN_GALPERS<br/>\n Daelen: Feather - NW_HEN_DAEPERS<br/>\n Sharwyn: Contract - NW_HEN_SHAPERS<br/>\n Grimgnaw: Gem - NW_HEN_GRIPERS<br/>\n Boddyknock: Gem - NW_HEN_BODPERS<br/>\n Linu: Flower- NW_HEN_LINPERS<br/>\n<br/>\n Chapter 1 Quest Items and Codes<br/>\n Tomi: Official Document - NW_HEN_GAL1QT<br/>\n Daelen: Brooch - NW_HEN_DAE1QT  (Warning!: Item can be sold due to a non-plot status error set in the item parameters.)<br/>\n Sharwyn: Celestial Elixir - NW_HEN_SHA1QT<br/>\n Grimgnaw: Silver Ring - NW_HEN_GRI1QT<br/>\n Boddyknock: Leaven Bread Recipe - NW_HEN_BOD1QT<br/>\n Linu: Silver Chalice of Moonbow - NW_HEN_LIN1QT<br/>\n<br/>\n Chapter 2 Quest Items and Codes<br/>\n Tomi:  Star of Calimshan - NW_HEN_GAL2QT<br/>\n Daelen: Great Axe - NW_HEN_DAE2QT<br/>\n Sharwyn: Lock of Nymph's Hair - NW_HEN_SHA2QT<br/>\n Grimgnaw: Corpse Hand - NW_HEN_GRI2QT<br/>\n Boddyknock: Prism Blossom Seed - NW_HEN_BOD2QT<br/>\n Linu: Journal of Synth La'neral - NW_HEN_LIN2QT<br/>\n<br/>\n Chapter 3 Quest Items and Codes<br/>\n Tomi: Ashes of Running Wolf - NW_HEN_GAL3QT<br/>\n Daelen: Uthgardt Ceremonial Spear - NW_HEN_DAE3QT<br/>\n Sharwyn: Tamorlyn's Song - NW_HEN_SHA3QT<br/>\n Grimgnaw: Dagger - NW_HEN_GRI3QT<br/>\n Boddyknock: Dragon Scale - NW_HEN_BOD3QT<br/>\n Linu: Volcanis Oak Seed - NW_HEN_LIN3QT<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Lost/misplaced Henchman Quest Reward</strong></span><br/>\n<br/>\n Check the Divining Pool first.  Each chapter has a pool.  Note: OC quest rewards cannot be sold.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Henchman Quest Reward: Requirements</strong></span><br/>\n<br/>\n A listing of the reward items from chapter 1 that you will need to start henchman quests in chapter two.<br/>\n<br/>\n Grimgnaw ---&gt; Amulet of the Long Death +1 ===&gt;NW_HEN_GRI1RW<br/>\n Daelen ---&gt; Amulet of the Red Tiger Tribe +1 ===&gt;NW_HEN_DAE1RW<br/>\n Sharwyn ---&gt; Belt of the Performer +1 ===&gt;NW_HEN_SHA1RW<br/>\n Boddyknock ---&gt; Lantanese Ring +1 ===&gt; NW_HEN_BOD1RW<br/>\n Linu ---&gt; Pendant of the Elf +1 ===&gt; NW_HEN_LIN1RW<br/>\n Tomi ---&gt; Ring of the Rogue +1 ===&gt; NW_HEN_GAL1RW<br/>\n<br/>\n The last capitalized part is the tag you need for the dm_spawnitem command Ashnara explained above.<br/>\n<br/>\n If you need chapter 2 or chapter 3 items, just replace the \"1\" in the tag with 2 or 3.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Henchman Quest Reward: Spoilers</strong></span><br/>\n<br/>\n Each of the henchmen have a quest for you if you want to do them. They are all searching for a specific item. If you do their quest and return the item to them they will reward you with a magical item. This item will be upgraded by them if you also do their chapter 2 and chapter 3 quests. The following are the items that they are looking for in each chapter (table format: chapter - item, location):<br/>\n<br/>\n Tomi<br/>\n Ch 1 - official documents, Wheelwright's Wagon Repair (Beggar's Nest)<br/>\n Ch 2 - Star of Calimshan, Wanev’s Tower (South Road)<br/>\n Ch 3 - ashes of Running Wolf, urn in Uthgardt fort (Homestead area)<br/>\n<br/>\n Daelan<br/>\n Ch 1 - mother's brooch, chest on boat (Docks District)<br/>\n Ch 2 - notched great axe, dwarf Gorkan's corpse (Mutamin’s Challenge, Green Griffon Inn)<br/>\n Ch 3 - Uthgardt Ceremonial Spear, Zokan Thunderer (Elk Tribe headquarters)<br/>\n<br/>\n Sharwyn<br/>\n Ch 1 - Celestial Elixir, Tanglebrook Estate (Peninsula District)<br/>\n Ch 2 - lock of nymph’s hair, Nymph’s House (Neverwinter Woods)<br/>\n Ch 3 - Tamorlyn's Song, present time Creator Race Ruins (south of Fort Ilkard)<br/>\n<br/>\n Linu<br/>\n Ch 1 - Silver Chalice of Moonbow, Meldanen's sanctum (Blacklake District)<br/>\n Ch 2 - journal of Synth La’neral, corpse (Troll Caves, level 1)<br/>\n Ch 3 - volcanic oak seed, stone pile (outside Creator Ruins)<br/>\n<br/>\n Grimgnaw<br/>\n Ch 1 - silver ring, desk in house (No Man's Land)<br/>\n Ch 2 - mummified hand, chest in Arcane’s Brotherhood Tomb (Green Griffon Inn area)<br/>\n Ch 3 - dagger, chest in Vaath's camp (Coldwood)<br/>\n<br/>\n Boddyknock<br/>\n Ch 1 - leaven bread recipe, Siril's Bakery (Beggar's Nest)<br/>\n Ch 2 - prism blossom seeds, crate in the Creator Ruins level 1 (archaeological area east of Port Llast)<br/>\n Ch 3 - dragon scale, rubble pile in cave (Spine of the World)<br/>\n<br/>\n The henchmen will tell you their story in parts as you level up, but you have to be a specific level before they will give you their quest reward (level 6 in chapter 1, level 10 in chapter 2, and level 15 in chapter 3). In order to do their quest in chapter 2 you must have done the corresponding one in chapter 1. The same goes for chapter 3, to complete their chapter 3 quest you must have done both previous quests (chapters 1 &amp; 2).<br/>\n<br/>\n You do not have to travel with a henchmen in order to do their quests. If your PC meets level requirements you only have to hire them, get their story, give them the item they want, and then dismiss them by way of the conversation dialogue (not the radial menu or just by dropping them when hiring another). The catch to this and the way a lot of people mess up the quests is that in chapter 2 and 3, you must have the reward item in your inventory when you first speak to the henchman.  If you don't then they will tell you their story, but never give you the quest for that chapter.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Henchman Quest Reward: Description</strong></span><br/>\n<br/>\n Tomi<br/>\n Ch 1 - Ring of the Rogue +1 - Dexterity +1, Disable Traps +1, Open Locks +1<br/>\n Ch 2 - Ring of the Rogue +3 - Dexterity +3, Disable Traps +2, Open Locks +2<br/>\n Ch 3 - Ring of the Rogue +4 - Dexterity +4, Disable Traps +2, Hide +2, Move Silently +2,<br/>\n              Open Locks +2, Pick Pocket +2<br/>\n<br/>\n Linu<br/>\n Ch 1 - Pendant of the Elf +1 - Dexterity +1, Darkvision<br/>\n Ch 2 - Pendant of the Elf +3 - Dexterity +3, Darkvision<br/>\n Ch 3 - Pendant of the Elf +4 - Dexterity +4, Immunity to Mind Affecting Spells (replaces Darkvision)<br/>\n<br/>\n Daelan<br/>\n Ch 1 - Amulet of the Red Tiger Tribe +1 - Strength +1, Immunity to Fear<br/>\n Ch 2 - Amulet of the Red Tiger Tribe +3 - Strength +3, Immunity to Fear<br/>\n Ch 3 - Amulet of the Uthgard +4 - Strength +4, Immunity to Fear, Spell Resistance (12)<br/>\n<br/>\n Grimgnaw<br/>\n Ch 1 - Amulet of the Long Death +1 - Constitution +1, Spell Resistance (10)<br/>\n Ch 2 - Amulet of the Long Death +3 - Constitution +3, Spell Resistance (10)<br/>\n Ch 3 - Amulet of the Silent Lord +4 - Constitution +4, Immunity to Level/Ability Drain, Spell Resistance (10)<br/>\n<br/>\n Boddyknock<br/>\n Ch 1 - Lantanese Ring +1 - Charisma +1, Regeneration +1<br/>\n Ch 2 - Lantanese Ring +3 - Charisma +3, Regeneration +1<br/>\n Ch 3 - Prophyro's Ring +4 - Charisma +4, Regeneration +1<br/>\n<br/>\n Sharwyn<br/>\n Ch 1 - Belt of the Performer +1 - Charisma +1, Perform +1, Persuade +1<br/>\n Ch 2 - Belt of the Performer +3 - Charisma +3, Perform +2, Persuade +2<br/>\n Ch 3 - Belt of the Performer +5 - Charisma +5, Perform +4, Persuade +4<br/>\n<br/>\n Note: There are no henchmen quests (or rewards) for chapter 4.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Vanishing Henchman</strong></span><br/>\n<br/>\n Here is the info I have about spawning in a henchman that has completely disappeared from the game.<br/>\n<br/>\n Warning: Be sure the henchman is not lost somewhere in the chapter before doing this. I do not know what the<br/>\n results will be if you spawn in another one and he/she is still in the game.<br/>\n<br/>\n Be sure to make a backup save before ever trying this.<br/>\n<br/>\n You will be using the DM Client to search for the lost henchman and to spawn him in if he has disappeared completely. Again please make a backup save before doing any of this.<br/>\n<br/>\n From the very first screen choose the DM Client. Next screen choose Multiplayer. Then on the next screen login with your Bioware user name and password. On the next screen choose Load Internet/Lan Game.<br/>\n<br/>\n The next screen you see should let you choose your saved game. Before doing so though, click the Advanced Options button in the lower right corner, and make sure Post Game to Internet is NOT selected. The rest doesn't matter so click OK to go back to previous screen. Now you are ready to select the saved game you want to check and possibly respawn a henchman in, so choose that save and click Load. You should then see a screen telling that it is loading the saved game.<br/>\n<br/>\n From the next screen choose the DM character and click Play. This will load you as the DM into your saved game.<br/>\n<br/>\n Once you are into your saved game if you look at the top of your screen you will see the word Chooser. Click this. It will display a list of all of the areas in the chapter. If you click on an area you will see the word Creatures. Clicking on or expanding Creatures will allow you to see a list of all the creatures in the area including your henchman if he is there. What you need to do is go through the list of areas carefully making sure that your henchman is not in the Creature list of any area. If he is listed in the Creature list then you will know where to find him when you restart your game. If you want the exact location, click on his name and then click the GoTo icon at the top. As the DM will be transported to where he is. Now that you know where to go to find him, just escape out, save nothing, and restart in single player and go pick him up.<br/>\n<br/>\n If he is not listed under Creatures in any area, he has disappeared from the chapter and you can try to recreate him. To do this, select the area where you think he should be in your saved game from the list in the Chooser window. (Example: Trade of Blades, City Core Hall of Justice, wherever you think he should be). Then from the icons at the top click the GoTo icon and you will be transported there. Once you are there close the Chooser window and open the Creator window.<br/>\n<br/>\n From the Creator window choose Creatures/Standard/NPCs/Other. Under this you will find a list of the henchmen at different levels. From this list you will have to find your henchman of the approximate level he was at when he disappeared. To create your henchman again, select the one you think might be him, click the Create button at the top of the window and then click the spot on the floor where you want to create him.<br/>\n<br/>\n Once he has been created you will need to find out if he is the one you want, so right click him and from the radial menu pick the More options icon, then the eye icon at the top, and the view character sheet. This should let you determine whether he is the one you want or not. If he is the wrong one, down at the bottom of the window are several icons. Click the one that says kill and click on the henchman you created to get rid of him. Then try another one.<br/>\n<br/>\n When you have the correct one created, you will need to save the game (new save) and quit NWN. No need to save your DM character when asked. After quitting NWN go back and load the game (the new save) in single player mode. This time you will be given the option to select a pre-made character. You should find the character from your saved game as a blank portrait in the list of characters. Select it and finish loading. Then go talk to your henchman and seewhat happens.<br/>\n<br/>\n Important note: The henchman-replacement procedure will only work in modules where henchmen are able to be hired.  In the Luskan and Chapter 4 modules, although a henchman can be created as described, it cannot be hired due to the design features of those two modules.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Stuck Henchman Remedy</strong></span><br/>\n<br/>\n 1) Use: Save and Reload -or-<br/>\n<br/>\n 2) Use: Stone of Recall.  Usually, the return via portal will correct the positioning bug.  Otherwise, walk back to offending area.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Henchman Not Switching Between Melee and Range Attack</strong></span><br/>\n<br/>\n Progbear, 2005:<br/>\n I have found that every time my henchman levels up, they immediately revert to their melee weapons regardless of what they were using before. And if you open up a dialogue with them it will say, “Stop using your ranged weapons. Only use your melee weapons.” This was frustrating the heck out of me for the longest time.<br/>\n<br/>\n The solution I’ve found is to just select “Stop using your ranged weapons...” and close the dialogue. Then start a new dialogue and then tell them to only use ranged weapons. The next time a fight starts, they’ll pull out their bow/crossbow/whatever.<br/>\n<br/>\n Note: It usually takes a few combat encounters before the desired weapon switch actually takes place.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Henchman In-game Preferences Resetting</strong></span><br/>\n<br/>\n Any commands issued to a henchman regarding your preference for following distance, trap/lock handling, weapon type, etc. must be re-issued after each level-up and when each new module (chapter) is loaded.  The only exception is where your personal preferences happen to match the default AI settings.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Tomi Stays in Stealth Mode</strong></span><br/>\n<br/>\n BadJohn:<br/>\n I have lost Tomi in Chapter 2.<br/>\n I'm back at the adventurer's guild and he's not there. When<br/>\n I load as the DM as suggested above he is there!<br/>\n I suspect he may be invisible or in hide mode. Maybe I dropped him that way.<br/>\n Can anyone suggest the best way to get him back. I'm a level 11 druid and have no remove invisibility spells; if that is really the problem.<br/>\n Unless he is meant to disappear because of something I've done. Does anyone know of this?<br/>\n<br/>\n Ashnara:<br/>\n Go back into the DM Client exactly like you did before. As the DM go to some place like outside the building. Then from the chooser menu find Tomi, click on his name and then from the icons at the top click Jump. This should jump Tomi to you (the DM). Once he is there, save the game and exit. This will leave Tomi standing outside the building. Then load the game you just saved as a single player game and pick you char from the list of pre-made characters (should be blank pic) and finish loading. Wherever you are, go back to where you jumped Tomi to as the DM and see if he is there.<br/>\n<br/>\n BadJohn:<br/>\n I tried what you said and on reload found that Tomi was there for a split second before disappearing again. If I went inside and then out again I had just enough time to select him to start a conversation before<br/>\n he disappeared.<br/>\n<br/>\n I then got Tomi to join me and sure enough he was in stealth mode! I then asked him to toggle stealth and voila he is visible again. He's not going to get much mercenary work if he hides in the shadows all the time is<br/>\n he?<br/>\n<br/>\n I then reloaded my original game and paused the game just outside the guild then entered in pause mode. I could then select Tomi for a conversation, unpause, and I walked up to him and started a conversation even<br/>\n though he is invisible. Now my game is back on track.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Tomi Refuses to Disable/unlock or Remains Unresponsive</strong></span><br/>\n<br/>\n Skill level is probably too low.  Key rogue skills are Search, Disable Trap and Open Lock.<br/>\n<br/>\n Tomi must succeed in a Search check even if your own character has spotted it with its own check.  <br/>\n Get him to move closer to the trap to avoid the Search check distance penalty.<br/>\n<br/>\n Try buffing with Fox's Cunning (for Disable Trap, Search) or Cat's Grace (for Open Lock).  <br/>\n Repeat buff as needed to reach maximum ability modifier (+2 or +3 for full buff), if necessary to succeed check.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>DM Client with Multiplayer in OC</strong></span><br/>\n<br/>\n Only DM commands which the HOST issues will correct flags and reset variables.<br/>\n<br/>\n<span style=\"color:#FF8C00\"><strong>Override Effects on Henchman with LINUX &amp; MAC (as of v1.6.1)</strong></span><br/>\n<br/>\n Andrew Gardner, 2002:<br/>\n If you have those files (i.e. .ncs type) in your override directory at 1.61 on any platform, you will have this problem. In Windows, the updater would have automatically removed the files. In Linux, the update instructions explicitly tell the user to clear out their override before applying the next update (if you are experiencing this problem, you may have omitted this step). On the Mac, our instructions had not told the user to remove any files from override because users would only have gotten files there by unsupported means.\n</div></blockquote>\n  </div>"
    }
  ]
}