{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Persistent Worlds",
  "forum_id": "002",
  "id": "013",
  "name": "Sword Coast Adventures",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/sword-coast-adventures-t2321447.html",
  "author": "Yelpir",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "1.8K",
  "posts": [
    {
      "author": "Yelpir",
      "avatar": "no_avatar.png",
      "timestamp": "10:08 PM - Feb 21, 2013",
      "content": "<div>I have been playing on Sword Coast Adventures for a year now. Before that I did a LOT of server surfing, looking for a world that I could call home. Let me tell you a bit about SCA:<br/>\nSCA was built over the old Legion of Rhun module but virtually all the old areas have been replaced and many of the scripts have been improved and streamlined. <br/>\nSCA is a vast world with very many areas. It can accommodate almost any play style from roleplay to power building. About the only thing that is not popular is PvP. PvP is not banned or discouraged but requires the explicit agreement of all participants.<br/>\nThe only hak required is CEP2.2c.<br/>\nThe module has a wide range of quests, each with xp, gp and nice item rewards. There are challenging, enjoyable quests for every character level. It is an excellent world for testing character builds because the encounters can be very challenging (Everything from rats to epic dragons and denizens from the depths of hell).<br/>\nAll class combinations, feats, skills and spells are supported. Many subraces (undead, drow, monsters, etc) are supported. There is an extensive underdark. The world remains dynamic and is still growing.<br/>\nIt can be relatively quick to gain level 40 if you know what you're doing but the main quest really only begins at that level (as do many others). Thereafter there is epic, custom equipment available to carry you through extremely tough encounters. As at the present time, only 5 players have completed the main quest.<br/>\nI can only scratch the surface of the world here. There is so much more to recommend it. Why not give it a try?<br/>\nThe IP address is: 108.39.71.137:5121<br/>\nThe URL for the forums is: <br/>\n<a class=\"postlink\" href=\"http://legionofrhun.freeforums.org/index.php?sid=00dfd55f8c6d0bc32cdc179b4acafc26\" rel=\"noreferrer\" target=\"_blank\">http://legionofrhun.freeforums.org/inde ... 9b4acafc26</a></div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "12:17 AM - Feb 27, 2013",
      "content": "<div>As one of the 5 people to make it through the main quest, I can tell you it's a large world with a ton of well made quests (there are probably 50-60 or so smaller quests to do [although some take a couple of hours] and some of the rewards are different depending on how you play it and that's just the \"surfacer\" quests; if you play an undead or drow you have some additional quest options as well).  I played exclusively on this from April 2012-Jan of this year and it was very enjoyable.  I now split my time between SCA (high magic +10 environment, lots of scrolls) and Kharlindale (low magic +5/6 environment) depending what type of environment I want.<br/>\n<br/>\nFrom a build perspective, it's high magic: +10 environment, although they use ILR, so passing your +10 weapon with 8d12 and 12d8 worth of damage bonus down to your starting character won't do you much good, which you won't be able to equip it until 40.  This keeps characters roughly in the same gear power class at the same level, although vets can buy more scrolls and potions and consumables, but there's not a super gap compared to newbies, so the quests don't get out of balance like many servers (i.e. you know those places where low level quests have to be doable by newbs with gear they've acquired in two levels and it doesn't present any challenge to a vet's new PC that's loaded with hand-me down forged gear).  The epic gear requires specific main quest items given later to be able to equip them, so again, you can't just pass them to newly leveled 40 PCs (though you can with regular non-epic gear).<br/>\n<br/>\nThere are almost all scrolls available up to level 9, so UMD is good for that (at least until you hit enemies with Mords/Dispel), although for items, most items you'd want to wear out of class/race/alignment after 40, even max'd UMD might not make it wearable.  Wand and Scroll crafting is available.<br/>\n<br/>\nWhen you get to 40 and beyond (and reaching 40 is really just the start of great adventure there), the dragonslayer gear can easily cap most/all of your stats with the right mix of items, but before that, it can be challenging to mix and match to get what you need (i.e. you can guy bracers of dex from +1 through +10, but for strength you'll need to find gear through belts, gloves, and ioun stones) if you can't self-buff.  Also, at 40+, there is a lot of immunity gear, so immunity buffs/spells lose value later in your career but are life-savers along the way before then.<br/>\n<br/>\nAlmost all of the damage spells have been ramped up to account for tougher enemies (see forum for details), although all enemies tend to have increased saves (enemies for quests geared for mid30s and early 40 tend to have saves in the 30s and 40s), so I'm not sure if the arcane damage dealing is equal/balanced with melee yet, but melee is my natural style so I don't gravitate to spell slinging.  For PCs, many 30+ items have +2,+5, or +10 to saves, so you'd have to work hard NOT to reach the +20 saving throw cap for a lvl40 that's done a fair amount of the quests just from items.  From a build perspective, it makes things like Spellcraft not typically chosen except for epic spell pre-requisites and takes away a major bonus from Champions of Torm.<br/>\n<br/>\nNone of the feats are disabled or class requirements changed, but with the higher saves, dev crit isn't particularly useful after mid 30s.<br/>\n<br/>\nMany of the classes considered underpowered at SCA have higher level class items that can help (e.g. Palemaster armor that gives a GREAT summon at PM30, regular and epic armor for druids/rangers, elemental staffs for druids, etc) as well as general class specific items in the epic shop.<br/>\n<br/>\nIn terms of the classes who have made it all the way through the main quest, you have<br/>\n<br/>\n1x Blood and Faith (me    )<br/>\n2 x Ftr X  DD20-something WM7<br/>\n1 Ftr28 bard 2 rdd10<br/>\n1 ftr 12 wm 25 rog3<br/>\n1 ftr/weapon master something? (Yelp what was Athena?)<br/>\n1 pal29/sorc1/rdd 10<br/>\n<br/>\nIt took me from April through early December to finish the \"primary\" main quest (Time of Dragons), definitely need a second in the harder areas, maybe even a third party member depending on your build.  (In the final battle I actually strategically died so i could rest and regain spells in the respawn area and then rejoin the party)<br/>\n<br/>\nIn terms of enemies, good mix of melee vs sneaks vs casters.  In the last couple months the caster AIs improved (e.g. they actually use Mords and Greater Dispel when appropriate) and the enhanced damage spells works for them to (e.g. getting hit by 4x greater ruin that was enhanced from 35d6 to 60d10 from 4 Duergar Mages is going to really hurt/kill you now).  Not that high enough magic that enemies Bigbys spells didn't knock a few of my dex PCs into oblivion.  <br/>\n<br/>\nIn terms of XP, for level appropriate enemies, it ranges from 75-750XP, although in parties there's a killer bonus of roughly 20% (a 750xp enemy will give 900xp to the killer in a party).  If you find a sweet spot for your level where you're getting 500-750xp per enemy you can go through levels fast if you want, although if you want to explore around and do all the quests (which I did with my first several characters), the pace will be more leisurely.  If you play an undead or drow, you start in a completely different area (e.g. different parts o the underdark instead of Neverwinter) with a different set of lower level quests to be done.    <br/>\n<br/>\nIn summary:<br/>\n<br/>\n- big world, lots of populated areas<br/>\n- tons of quests, in addition to a sweeping, long main quest (and a second main quest involving drow houses with both a surfacer and drow path is ~50% complete)<br/>\n- high magic (+10, lots of damage bonuses, immunities, DR, etc)<br/>\n- friendly players<br/>\n- little to no PvP<br/>\n- a couple dozen subraces available<br/>\n- start from level 1, 2, or 3 if you're the kind of person who likes starting with more than 6 hp.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:22 AM - Apr 27, 2013",
      "content": "<div>It sounds like a fun world, but you can see it heavily favors melee-oriented toons, from your list of people who have completed the main quest. Blood &amp; Faith is the exception, being technically a self-buffer meleer, but it's just SOOOOO powerful that it will do well anywhere. When I get a better connection, I might give it a try. I have a feeling my Pally / WM build will do very well there with a couple of tweaks (it can reach 71 AB on a +10 world without factoring in Taunt and can crit on 16-20 x 4 with a Battleaxe).<br/>\n<br/>\nTake it EZ!</div>"
    },
    {
      "author": "Dante2377",
      "avatar": "no_avatar.png",
      "timestamp": "3:41 AM - Jul 03, 2013",
      "content": "<div>FYI to Max's point, most of the useful spells have been bumped up to make casters effective - both in terms of damage output and DCs for necro spells.</div>"
    },
    {
      "author": "Redmane",
      "avatar": "no_avatar.png",
      "timestamp": "3:04 PM - Jan 06, 2019",
      "content": "<div>I've been playing on this server for a couple of weeks now and I'm having a blast.  I have come across several really well done quests so far and a labyrinth(minotaurs made an appearance just to rub it in a bit I think) that bordered on the torturous.  I'm at level 35 on what will end up being a dexterity focused kukri wielding cleric/ranger.  I am really looking forward to trying some of the level 40 quests and trying a more pure caster build.</div>"
    },
    {
      "author": "Asturonethoriusaline",
      "avatar": "no_avatar.png",
      "timestamp": "8:17 AM - Jan 13, 2019",
      "content": "<div>Can you play a Monk/Bard?<br/>\n<br/>\nI would like to play a Monk/Bard/RDD or Monk/Bard/PM or Monk/Bard/AA, or Monk/Bard/SD, or Monk/Bard/Assassin<br/>\n<br/>\nHow would a Monk/Bard/X if legal, play on your PW?</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:40 AM - Jan 14, 2019",
      "content": "<div>By default, Bards are forbidden to be lawful while Monks are required to be lawful. I have heard of a PW that allows lawful Bards, but I dion't know if this server also allows that.</div>",
      "author-color": "#00AA00"
    }
  ]
}