{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "020",
  "name": "Elemental summons question.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/elemental-summons-question-t2355166.html",
  "author": "grom56",
  "avatar": "10745842_1510287074.jpg",
  "replies": 10,
  "posts": [
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "12:25 AM - Sep 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Here's a question for ya all:   Just what is an Elemental Prince or Princess??   Folks over at WoG keep touting them as must have in Boss fights, and I have to admit, in all my time playing WoG, I've never seen one I could summon.   I checked the Wiki and there is no mention there I could find (but I get lost there easy enough) So what level summons is a Prince???   Is it some hidden Epic Spell???   Something added to WoG???<br/>\n<br/>\nThanks guys for any answers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:37 AM - Sep 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Only Druids &amp; Clerics with the animal domain can have elemental princes/princesses &amp; they are exclusive to World of Greyhawk. <br/>\nThese are more powerful <strong>custom-made</strong> summons &amp; that is why you won't find them in the Neverwinter Nights Wiki. <br/>\nAnd yes, they are worth every penny. <br/>\nFrom what I remember of my Druid, I could level-up to epic levels basically only by the elemental princes alone &amp; a few buffs. <br/>\nFinally, they are a level-nine summon.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:51 AM - Sep 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So, in essence, they're either really horrid - if you meet them - or really handy, if they're yours.<br/>\n<br/>\nStuff 'em - play like a <em>real</em> hero! (It's been a while since I growled at sorcerous activities).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "1:53 AM - Sep 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">They are pretty awesome. I've played a couple builds where I take only 1 or 2 levels of cleric or druid JUST to have access to enhanced summons, specifically the elemental royalty. Though some people seem to indicate that they lose their effectiveness eventually...but when I buff mine, they've been helpful even fighting drow...and when I SEE an elemental royalty on the enemy side, I take careful consideration.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "3:36 AM - Sep 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The Elemental Prince/Princess spells I got from Summon Creature IX made it much easier for me to get to mid epic levels as a Druid in my first character on WoG.<br/>\n<br/>\nThey actually pack quite a punch (I think they are level 26?), and they are knockdown immune, crit immune, stun/paralysis immune, mind immune, petrify immune etc....<br/>\n<br/>\nI would usually cast my Grease/Stonehold/SoV combo and let this dude go to work<br/>\n<br/>\nDruid has this Elemental Swarm spell as well, which is also a level 9 spell, which I never used...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "12:19 PM - Sep 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah, that explains so much.   Never gotten a Druid to 9th level spells and my Cleric with animal is still only 7th level.   Thanks for the info guys.  I do have a question for gkorjax now though:  If it's a 9th level spell, how are you getting it by only taking 1 or 2 levels of Cleric or Druid???  Is that a master Builders trick??<br/>\n<br/>\nAnd now I feel a rant coming on for those 40 in 40 guys over on WoG!  <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:34 PM - Sep 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's not a master builders trick, its more a WoG trick :)<br/>\n<br/>\nAnd I'm not going to spill the beans, I'm going to let gkorjax reply to this one :)<br/>\n<br/>\ngkorjax has taught me quite a bit!<br/>\n<br/>\nGreat to see you around the ECB Grom!<br/>\n<br/>\nPS: we could use some advice adding banners to our signature, if you have some time :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:14 PM - Sep 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Btw, I think but I'm not 100% sure, that these elemental princes are a tribute/throwback to the AD&amp;D-BG II elemental lords,<br/>\nStag might remember better than me, but these are all Good elemental princes.<br/>\n<em>Elemental Prince of Air , Chan</em><br/>\n<em>Elemental Prince of Earth, Sunnis</em><br/>\n<em>Elemental Prince of Fire, Zaaman Rul</em><br/>\n<em>Elemental Prince of  Water, Ben-Hadar</em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:50 PM - Sep 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think you're right Valerfor - except for Zaaman Rul, who I seem to remember having to overcome (note, \"overcome\", not \"fight\") in, if memory serves, the Windspear Hills dungeon while on the way to confront that nasty red dragon. But it might be somewhere else...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "3:16 PM - Sep 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">On WoG, the animal domain gains summons one level higher than standard. This is normal activity for NWN, just that WoG made something beyond the dead end. That is, a ninth level spell gives a more powerful summon, the aforementioned Elemental Royalty as I call them.<br/>\nThe boosted summons occur from any summon monster spell that the character casts, be it from scroll,staff, or device. It does not work on the Elemental Swarm spell. Thus someone with the animal domain, whether it is from a druid level or cleric with the proper deity, can get the elemental royalty by using say, a summon monster IX scroll.<br/>\nNow, using this \"trick\" does have a downside, beyond the use of the third class for such things. It cannot choose what the summon will be using the Book of Summons available on WoG. Let me explain. A druid with many druid levels would be able to use the book of summons and pick what summon they get at every level, and change it at will. They can also choose what they get when they cast Summon Monster IX...Do they want the Elemental Prince of Earth to be summoned at the casting of the spell, until they change it? So be it.<br/>\n<br/>\nWith my trick, I'd have the enhanced summons, but would only have the ability to choose the result for the corresponding spell that I'd actually HAVE in my spell book, and the Elemental Royalty would be randomly determined when I cast the Summon Monster IX spell.<br/>\n<br/>\nNote that this enhanced behavior is similar to what one gets with the Healing domain, that is every Cure spell cast by the character is boosted to 150% effectiveness, whether it be from a potion/scroll/etc.<br/>\n<br/>\nSort of confusing with the summons, and not something I do all the time, but when I am in my caster phase, I do love to do a \"Merlin\" blend, that is with a lot of wiz levels, 1 or 2 druid, and rogue for dumps.  When Dominate Monster was working more effectively on WoG, it was a true test of my micromanaging abilities to be controlling a familiar, summoned monster, and a Dominated enemy.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "7:21 PM - Sep 18, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ah, got it, thanks for the reply gkorjax.  I knew all of that except the 1st level Cleric or Druid using a summon monster IX scroll.  that bit slid by me.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}