{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "024",
  "name": "Tournament of Champions!",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/tournament-of-champions-t2354740.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": "6",
  "views": "497",
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:31 PM - Sep 18, 2017",
      "content": "<div>Time for a module that doesn't have a spectacular story. One that isn't big or epic in scope (although you do fight epic opponents). No marvelous graphics, extra content, or complicated scripts. This is a very old module that i played back in the golden days of Neverwinter Nights, had fun with it and lost it again for a time, until a recent random search in the new Nwn Vault uncover it. And i played it again and yes, i did have fun for a second time as well! <br/>\n<br/>\nThe story is simple, a magician mets your hero in the way back home after some supposed grandiose adventure and teleports you (without you having a choice) to his inner sanctum where 7 other adventurers like yourself are presented with the same baffled look on their faces, and then he begin to explain the rules of his little game...You are invited to a death match between yourselves and the winner is going to take a grand price! To each of you a unique area is assigned and some appropriate guardians for that place that are to help you in the battles to come. From your area you can purchase some simple items (mainly potions &amp; ammunition) and then either rest and wait your attackers or assault another characters base if you feel particularly confident. When you assault someone's base you do not get to take your guardians with you so the defender always has some tactical advantage this way. If you win your opponent there is a chance that he/she will instead surrender to you and forge an alliance where both of you take upon  the other members! There is a persuade check involved of course just to enrich the RP side of the thing but the check must have not been a very high one...Still it is there and wise adventurers take advantages wherever they find them.<br/>\n<br/>\nNow all this wouldn't have been anything special except from the fact that your opponents aren't some simple monsters or random adventurers but the elite of the elite the famous Epic Character Builds of the old Bioware Hall of Fame page!! Say hello to the \"Dwarven Wall\", \"Undead Lord\", \"Divine Warrior\", \"Reliable Archer\", \"Dark Stalker\", \"Combat Medic\" and the dreaded \"Kukri Master\" themselves!! Properly armed and with a custom A.I they are ready to face you in combat and prove themselves once more as they did in the past before they became legends. And if you beat them all and think you are the best of the best, then think again for something more sinister awaits you in the end...<br/>\n<br/>\nAlright, time to talk about the negatives now. The module is simple and old and it shows. Apart from that there are some things i wish they could have improved in the in-between versions of the module. Like for example the complete absence of armour &amp; weapons to purchase from your base's merchant, or for example the lack of some very distinguished builds from the hall of fame, like the \"Exalted Sorceres\" or the \"Wrathful Berserker\". And if you lose the ending is dissapointing because your only option is to load your last save or quit the game, many times the \"Master of Games\" won't even initiate dialogue with your character, propably a bug that were not squashed-out during the development of the module. You will also notice the heavy reliance of that time's builds to the most well-known feat in Neverwinter Nights, the \"Devastating Critical\". The builds could be as bad as they wanted but as long as a high critical weapon was selected and \"Devastating Critical\" was in their arsenal of feats the fight could be decided by a lucky roll, many times instantly &amp; before you realize what happened.<br/>\n<br/>\nAll being said &amp; done, if you want something simple and want to blow-out some steam, there is nothing more direct than this. And for this it gets my vote as a fun module to play. I find it especially rewarding when i load it and take a character with me that isn't immune to \"Devastating Critical\" and prevail, it feels very rewarding this way but you have to think tactically and select your alliances carefully to succeed.<br/>\n<br/>\nThe link for the module is here =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/tournament-champions\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... -champions</a><br/>\n<br/>\nHave fun!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:20 PM - Sep 18, 2017",
      "content": "<div>Sounds like a good test of a build's versatility as well as improving play-style for those of us not yet fully competent.<br/>\n<br/>\nAs ever, I have a few questions, sorry!<br/>\n<br/>\nI had a look on the link you helpfully provided, and it indicates that it's for a PC between levels 30 and 40, so, first off do you level in-game, or would it be best to go for a higher level character straight away? Related to this, and noting that you say your own merchant doesn't sell armour or weapons, would it be best to import a character from a previous adventure - including all their gear - or do you have to start from scratch? And if you can import gear, is that restricted to that available from the OC and expansions? (I'm going to assume that if you kill an opponent you can steal their gear in any case - although it would be annoying to think they got lots of kewl stuff and you didn't.)<br/>\n<br/>\nOh, and also, are the classic builds you cite recreated as their original architects intended or have they been modified?<br/>\n<br/>\nI know I'm a nuisance, but I'd hate to load up (for example) a level 36 PC from Aielund and find them naked with no weapons in an environment like this (and it might not be that smart anyway in a DevCrit enabled mod).<br/>\n<br/>\nCheers!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:58 PM - Sep 18, 2017",
      "content": "<div>Do NOT bring a character from Aielund or another CEP module intto this one without first purge him/her of their CEP items! Or else you are going to have missing stuff in your inventory or even a missing face if you selected one from the CEP ones. This is as vanilla as it goes, and your best bet are characters that have been advanced through HoTU with all their equipment at that time. You can load-up a leveler module such as \"The Halls of Advanced Training\" and complete there your character up to level forty. Now, if you had HoTU equipment already on your character do not go and buy something even more powerful because the builds themselves in this module stay well within limits of HoTU equipment and they even avoid using immunity items themselves, most being attribute enhancing items or greater enhancement weapons.<br/>\n<br/>\nWhen you beat your opponent you do NOT get to loot it's corpse and it's gear, but if you manage to beat them and then forge an alliance with them, then and only then you can effectively use them as henchmen and you will have access to their inventory where you can \"borrow\" their stuff. When my Paladin beat the \"Divine Warrior\" for example she got her hands on the unique weapon of her that it was much better than her holy avenger bu well-within the item limit of HoTU still. There is nothing as powerful as Rizolvir's weapon upgrades for the builds for example but they have some unique items which are interesting by themselves.<br/>\n<br/>\nYour best bet is to take your character straight out of HoTU and then level him up to a module such as the following. Make him/her level 40 and buy some useful HoTU level equipment that you want and is reasonable and then import him/her into the Tournament of Champions.<br/>\n<br/>\nLink to one of the best leveler modules (non-cep) =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/halls-advanced-training-deluxe-hotusou-edition\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... ou-edition</a></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:37 PM - Sep 18, 2017",
      "content": "<div>That's brilliant, thanks as ever Valerfor.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:07 PM - Sep 19, 2017",
      "content": "<div>Very interesting that you can confront the epic legacy builds like that!<br/>\nAre they all at a fixed level, or do they scale up according to your character's level?<br/>\n<br/>\nWhat would be even more interesting is if you can toolkit the mod and replace the legacy builds with some of our own level 40 builds from ECB.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:46 PM - Sep 19, 2017",
      "content": "<div><blockquote><div><cite>Mick Dagger wrote:</cite>\nAre they all at a fixed level, or do they scale up according to your character's level?<br/>\n<br/>\nWhat would be even more interesting is if you can toolkit the mod and replace the legacy builds with some of our own level 40 builds from ECB.\n</div></blockquote>\n\nThat i do not know, since i always take with me lvl 40 characters, but the text file inside the mod says the mod is for lvl 30-40 characters.<br/>\nBased on that &amp; the age of the mod, i presume that the HoF builds are always lvl 40 and you can challenge yourself accordingly to your lvl.<br/>\n<br/>\nFor the second part, i think that since all the rest are laid-out already then simply modify the builds would be an easy matter. <br/>\nIn fact what i did in the past was to modify not the builds but the equipment of them in order to give a better fighting chance to the weaker of the bunch (such as the Divine Warrior).<br/>\nAnd that was very easy to do, requiring zero scripting or anything else, i saved a new copy of the module (with the original intact) and i played my version afterwards, which i felt was better balanced &amp; more challenging.<br/>\nIt is also worth noting that even though the A.I of the builds is sufficient (barely) to do the task, putting in, \"Tony's 1.08\" will made them all much-much more powerful! So, i warned you...</div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "8:07 AM - Apr 16, 2018",
      "content": "<div>Checked with the toolset.<br/>\nLooks like the levels are fixed, as there are only two blueprints for each NPC (one for when they are henchies, one for when they are not) both at level 40. To make the level flexible you either would need a blueprint for each level (like with the henchies in the OC, the easier way) or complex scripting (due to equipment, as that should scale, too) plus pre-defined custom packages so that the level-upper applies the feats and skills you want.<br/>\n<br/>\nOf course you can fiddle with each single NPC and apply the classes and levels, feats and skills you want them to have, according to your own, fancy build! This can be done without scripting. You also can change their names, put the title in the subrace slot and choose a more appropriate name for their home zones. As long as you leave the tags and resrefs as they are, it will still work. Note that there is an instance of each character, including the Final Boss, stored in a zone inaccessible for the player. You should make sure that they undergo the same changes as the blueprints.<br/>\n<br/>\nIf you want the absolute challenge, you can try to set the level of the Final Boss up to 60... or replace him by something even meaner... or both.<br/>\n<br/>\nVery nice idea, by the way, to let your most powerful custom builds appear as opponents.<br/>\n<br/>\nOne day I might get back into modding. While I am not an expert at scripting (couldn't script a good monster or henchman AI to save my life, also still have trouble with libraries and fancy cutscenes) or how to keep things \"balanced\" (or deliberately not-so-balanced), I love fiddling with the toolset. One day, maybe, I will try something similar. Something that starts  relatively simple (modding-wise), but can be expanded easily.</div>"
    }
  ]
}