{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Persistent Worlds",
  "forum_id": "002",
  "id": "016",
  "name": "Legend of Deathlands Brotherhood",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/legend-of-deathlands-brotherhood-t2354500.html",
  "author": "HipRedux",
  "avatar": "10577588_1510287072.jpg",
  "replies": 4,
  "posts": [
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:51 AM - Feb 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Since I've been helping test out this server for a friend from across the pond, I figured a brief intro wouldn't hurt, so here goes...<br/>\n<br/>\n LoD requires only vanilla resources (NWN/SoU/HotU) to play it. This is a resurrected iteration of a PW from many years ago, one focused primarily on party combat but with a few puzzles that may test the most fastidious of us. It is somewhat linear, though, when I compare it to many \"open\" venues (like WoG, Thain, HG, 3T and their ilk) with unbridled adventuring.  Your toon won't be able to access some areas without finishing the goals in the previous sections.  That's not always the case, but at least for the primary questline it does apply.<br/>\n<br/>\n Being a combat-intensive environment it can be a great testing ground for ECB builds.  Yes, Level 40 is reachable, but there is a downside to high-level... there are areas of scripted damage based on character level, so the higher the level, the more damage proportionately is received... so 200-300 HP damage per round (often negative or divine damage) is not uncommon for a high-level toon to encounter when venturing through those areas without even encountering a hostile. <br/>\n<br/>\n This server is designed for party play but can be soloed once the features and mechanics have been thoroughly investigated and perfected.  Expect to die A LOT (a server name with \"Deathlands\" in it should infer that much).  Familiarity with the environment will mimimize this quite a bit but any level toon can roll a 1 at any time, right?<br/>\n<br/>\n It is an unusual magic environment, though, difficult to categorize as mid-magic or high-magic though it has elements of both.  I'll give a few examples to illustrate: <ul><li>Offensive and defensive enhancements are capped at +5.  This would infer a mid-magic environment, right?  But read on...</li> <li>Lots of resistances and immunities available on items.  Most of these items are available in shops or as quest rewards and are quite powerful.  Among the enhancements are immunity to: critical hits, sneak attacks, all spells of level X and below, certain spell schools, KD, disease, poison... well, you get the idea.  The gear is more like what you might find in a high-magic atmosphere. No ridiculous OnHit weapon properties, fortunately.</li> <li>Access to magical stones that can buff elemental damage on weapons and all abilities up to the cap.  The effects will last until the toon: 1) rests, 2) is dispelled, 3) dies or 4) server reset.  Some stones are cheap enough for beginning characters to afford while others can be extremely expensive.  This has a direct impact on how you play the server and your class choices.</li> <li>Summonable companions.  There are three categories:  those that can be summoned an infinite number of times per day, those that can only be created using a recipe of components (with several \"sets\" of components and enough gold, fresh versions can be created during the same day) and those that are limited to once per rest period.  The weakest of these summons is stronger than most summons (including the undead ones) and the strongest are incredibly tough tanks.</li> </ul>\nPreferred class(es)<br/>\n<br/>\n Any class, vanilla standard or prestige is allowed.  Spellcasting classes are challenged the most severely with enhanced creature skins and HDs.  Any class that relies on \"uses per day\" like bards or users of divine might/shield (for example) are locked into resting which is somewhat restrictive when item-buffed damage is figured in.<br/>\n<br/>\n I'm finding that tankish melee &amp; ranged attacker to be the dominate classes with the highest priority to BAB/AB to be able hit the most challenging bosses who will most certainly be hitting you often and hard, with some nasty special abilities thrown in to round out the challenge even further.  AC is important, as well, so Dexers do quite well, though bosses tend to possess extremely high attack ratings and special abilities that will negate all but the most elevated AC levels.<br/>\n<br/>\nOther features<br/>\n<br/>\n There is a teleport mechanism (cannot be used while engaged in combat since initiated by convo).  I really like this gizmo.  The part of any environment I like least is forced-traversing areas just to accomplish a single task unrelated to that task except for being a vast tileset that must be mouse-clicked through to gain access to the targeted area.  Some of my favorite servers are so intent to maintain some sort of self-proclaimed realism that they forget that the players have real lives that may not permit extended periods for gaming involved around tedium.  The LoD server is not one of those ;)<br/>\n<br/>\n Perma-haste property available.  Haste effect can be found on many different kinds of gear.  It is generally accepted that the Haste property will accompany any toon (eventually) and creatures have been scaled accordingly with increased movespeed, higher AB, high-DC slow spells, web, etc.  Combined with the teleport system, makes it painless to revisit areas where key events may have been accidentally missed.<br/>\n<br/>\n Scaled monster spawns.  It is not uncommon for say, a Level 20 toon to revisit an area where 1 or 2 dragons spawned when it was Level 10 to find 6 or 8 dropping out of the sky directly above them.  Spawns are determined by the level of the highest member of the party, not an average.  There are an impressive number of spawned creatures in LoD!<br/>\n - - - - - - -<br/>\n Okay, that's a glimpse without revealing too much... I hope.  I've been trying out different build combos, trying to avoid death as much as I can.  My party play has been much more fun than soling, though.  The group I play with set up an audio server for in-game chat which I love.  My typing leaves much to be desired in-game so I appreciate the voice chat shortcut.<br/>\n<br/>\n If you decide to try it out:<br/>\n<br/>\n<strong>Server name:</strong>              BeerfishTV NWN Server <br/>\n<strong>Server Location</strong>:         Netherlands<br/>\n<strong>Module name:</strong>             deathlands7<br/>\n<strong>Current connection: </strong><strong>  [89.98.160.77:5121]  </strong><em>Note: currently unavailable due to technical problems.  No estimate on restoration of service has been furnished. (8/7/2016)</em><br/>\n<br/>\n Let's die together!  <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" />  Hope to see some of you there!<br/>\n<br/>\n P.S. BeerfishTV has loaded some tutorials about LoD on YouTube and streams on Twitch from time to time.  You may want to check them out to see firsthand the kinds of activities to expect there.  Note:  All these are still available for public viewing (8/7/2016)<br/>\n<br/>\n<em>edit:  Revised server status (8/7/2016)</em><br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:05 AM - Aug 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for this, Hip. As you may recall, I'm currently looking for a PW for my first venture into online gaming, and I'm torn between this one, Sword Coast Adventures and the seemingly ubiquitous WoG. I know this is asking for a lot, but which would you recommend for a relative newbie to the game with the sort of playing preferences I've littered about the Guild (non-casting melee-er - though I'm still trying to grasp Cleric - with a Monkish penchant)?<br/>\n<br/>\n Thanks<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:53 AM - Aug 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually, I've been waiting for Beerfish to resurrect this module again.  A few months ago, his server hardware took a permanent holiday and has yet to get this thing up and running.  I would have loved to romp around this module with you.  It's VERY hard.  Spellcasters are just about worthless because most of the creatures have too high SR and immunities galore.  But any melee or ranged attacker does well.  High-end equipment pretty much balances out the difficulty.  Encounters are scaled for party size so really, all you gain with large parties (we usually play with 4 or 5) is many players who can res you when you die, which is a pretty common occurance.  I really miss playing here because there were so many cooperative players on when I had an hour or two open to play.  Let's keep our fingers crossed that Beerfish will succumb to fan pressure and get a connection. <br/>\n<br/>\n That's the bad news.<br/>\n<br/>\n The good news, WoG seems to be up and running.  I used to play WoG quite a bit but it became hard to schedule party sessions for me.  It was either right in the middle of the afternoon or well into the vampire hours that the guys were hanging out.  Since I really have little pleasure soloing a server, I've become a faint shadow.  Perhaps after the seasons change and I am indoors more, I'll get back to WoG again.  WoG has all kinds of difficulty, some moderate, some challenging, some almost suicidal, but nothing is really easy, at least not until you get a few levels higher than the start.  It's a well-made, vast, map that takes a long time to cross huge areas and easy to get lost in the woods at times. There are many sidequests that you don't even realize exist until revisiting areas a few times.  Follow-up visits with merchants and random <strong>NPCs</strong> sometime trigger those quests so it pays to socialize among the NPCs whenever you can.  I'm sure you'd like it but I highly recommend at least taking a friend and, even better, perhaps someone to help you get oriented.  Join <strong><a class=\"postlink\" href=\"http://worldofgreyhawk.fr.yuku.com/\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#0000FF\">their forum</span></a></strong> and try to connect there, if you can.  There's been some higher activity lately since the return of one of the admins so things may begin to pick up again.  PWs. in general, are seasonal.  Summer it usually slows down and then picks up again when the kids are back in school (guess their not being home to drive mom and dad nuts on a full-time basis provides some more opportunity for the parents to indulge their hobbies).<br/>\n<br/>\n Sorry, never tried Sword Coast Adventures.  What have you heard about it?  Is there a website and/or forum?  I'm always on the lookout for any server that has at least a little activity all throughout the day rather than focused heavy into brief slots.  Just not into heavy-duty RP or high-magic is all.  But should you decide to try this one, be sure to lodge a thread about your first impressions.  Players tend to forget their initial orientation quickly and it is information like this that can really entice or warn other potential players best.<br/>\n<br/>\n One issue I should warn you about, though.  Being in Europe tends to limit you to servers in the same relative area.  At least, that's been my impression.  U.S. West Coast servers cause horrible latency for Europeans so they eventually quit trying to play there.  It's just not fun getting dropped or lagged to a standstill in the middle of an important encounter. Now, I don't know if this issue has an effect on your particular location or not, but am just shooting up a flare to encourage you to select wisely.   East Coast U.S.?  Dunno.  Maybe those are not so bad for you.  It's a tough nut downloading big haks and installing them to play a server, just to find out the lag monster is waiting for you.  But that's how it can work sometimes depending on your ping.<br/>\n<br/>\n<em>edit: random \"NPCs\", not \"PCs\"... a HUGE difference!</em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:53 AM - Aug 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>Actually, I've been waiting for Beerfish to resurrect this module again.  A few months ago, his server hardware took a permanent holiday and has yet to get this thing up and running.  I would have loved to romp around this module with you.  It's VERY hard.  Spellcasters are just about worthless because most of the creatures have too high SR and immunities galore.  But any melee or ranged attacker does well.  High-end equipment pretty much balances out the difficulty.  Encounters are scaled for party size so really, all you gain with large parties (we usually play with 4 or 5) is many players who can res you when you die, which is a pretty common occurance.  I really miss playing here because there were so many cooperative players on when I had an hour or two open to play.  Let's keep our fingers crossed that Beerfish will succumb to fan pressure and get a connection. <br/>\n<br/>\n That's the bad news.<br/>\n<br/>\n The good news, WoG seems to be up and running.  I used to play WoG quite a bit but it became hard to schedule party sessions for me.  It was either right in the middle of the afternoon or well into the vampire hours that the guys were hanging out.  Since I really have little pleasure soloing a server, I've become a faint shadow.  Perhaps after the seasons change and I am indoors more, I'll get back to WoG again.  WoG has all kinds of difficulty, some moderate, some challenging, some almost suicidal, but nothing is really easy, at least not until you get a few levels higher than the start.  It's a well-made, vast, map that takes a long time to cross huge areas and easy to get lost in the woods at times. There are many sidequests that you don't even realize exist until revisiting areas a few times.  Follow-up visits with merchants and random PCs sometime trigger those quests so it pays to socialize among the NPCs whenever you can.  I'm sure you'd like it but I highly recommend at least taking a friend and, even better, perhaps someone to help you get oriented.  Join <strong><a class=\"postlink\" href=\"http://worldofgreyhawk.fr.yuku.com/\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#0000FF\">their forum</span></a></strong> and try to connect there, if you can.  There's been some higher activity lately since the return of one of the admins so things may begin to pick up again.  PWs. in general, are seasonal.  Summer it usually slows down and then picks up again when the kids are back in school (guess their not being home to drive mom and dad nuts on a full-time basis provides some more opportunity for the parents to indulge their hobbies).<br/>\n<br/>\n Sorry, never tried Sword Coast Adventures.  What have you heard about it?  Is there a website and/or forum?  I'm always on the lookout for any server that has at least a little activity all throughout the day rather than focused heavy into brief slots.  Just not into heavy-duty RP or high-magic is all.  But should you decide to try this one, be sure to lodge a thread about your first impressions.  Players tend to forget their initial orientation quickly and it is information like this that can really entice or warn other potential players best.<br/>\n<br/>\n One issue I should warn you about, though.  Being in Europe tends to limit you to servers in the same relative area.  At least, that's been my impression.  U.S. West Coast servers cause horrible latency for Europeans so they eventually quit trying to play there.  It's just not fun getting dropped or lagged to a standstill in the middle of an important encounter. Now, I don't know if this issue has an effect on your particular location or not, but am just shooting up a flare to encourage you to select wisely.   East Coast U.S.?  Dunno.  Maybe those are not so bad for you.  It's a tough nut downloading big haks and installing them to play a server, just to find out the lag monster is waiting for you.  But that's how it can work sometimes depending on your ping.</div></blockquote>\n<div align=\"left\">Many thanks, Hip. A shame about Legend of Deathlands, but I'm sure you'll let us know as and when it's up and running again.<br/>\n<br/>\n I'll be sure to check out the WoG forum and see what's going on there.<br/>\n<br/>\n As for Sword Coast Adventures, all I've read is on another thread in this Persistent World forum (entitled, imaginatively enough, Sword Coast Adventures). Yelpir and Dante seem to rate it highly, and there's a link to the site in the thread.<br/>\n<br/>\n You make a fair point about servers. It's something I'll be aware of when searching around.<br/>\n<br/>\n Cheers</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:50 PM - Dec 18, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Beerfish has resurrected the LoDB server once again (12/15/2016 or thereabouts).  The current connection is: <span style=\"font-family:MONOSPACE\">185.56.147.183:5121</span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}