{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "028",
  "name": "Saleron's Gabit Saga",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/saleron-s-gabit-saga-t2354347.html",
  "author": "Valerfor",
  "avatar": "10235447_1565972826.jpg",
  "replies": 0,
  "posts": [
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:48 AM - Dec 05, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">~ The Saleron's Gambit Saga, is a tale of heroic fantasy that consists of five interlinked parts and takes place in Faerun and Planescape. It tells us the story of an orphan boy that lives with his abusive uncle and knows nothing about his true parents or his own past. One day a mysterious mage comes to the little village that he lives in and offers him the opportunity to escape that miserable life along with clues to his true past. It is up to you to snatch this opportunity and become the hero the tales tell about and forge your own legend!<br/>\n<br/>\n This is a very different kind of module than anything you have probably played until now, but it is certainly one worth trying. our It is a low magic - low treasure action module with mystery elements and a plot that rivals best-selling novels. Tiberius is a master story-teller and his descriptions and attention to detail is one of the best i have seen in any module, it certainly \"feels\" in all accounts as a professional work. Your journey will take you to all kind of places, from the fabled Sylverymoon to the capital of Amn - Athkatla (a homage to Baldur's Gate) and beyond to a mysterious island covered by jungles and swamps to eventually the otherworldly - Planescape. Saleron's Gambit is unique in more than one ways though, and this is not only due to the many different places that you will visit in your journeys, it is perhaps the one module that will make you feel like you \"earn\" everything that you own. There is no starting gold to begin with and neither you own a suit of plate mail or a sword or anything for that matter, you are no hero to begin with, and you will have to earn every single piece of equipment during your journeys. Because of that, everything that you accomplish feels so good, so rewarding that i cannot describe it with words. It also helps that the author is quite honest with you- the player and you will never feel cheated by the game, for example something that i appreciated much was the fact that all monsters in the module drop their equipment when they die, no exceptions. Saleron's Gambit has a span of about 10-11 levels but it feels nothing like that proving that great things can happen without the necessity of epic levels, it's all about quality- not quantity here. All kinds of builds can play this module, it has a good balance between role-play and combat and provided that you have patience for the few first levels, playing as a caster is a very rewarding experiance and will indeed make you feel unique.<br/>\n<br/>\n Saleron's Gambit features many elements from CEP and additional tilesets that are wonderfully done (especially Sylverymoon and Planescape), custom music, advanced monster a.i, wandering monsters like the good old days of Baldur's Gate and a user-selectable rest system that it may seem to some harsh but fits nicely with the nature of the module. If you are looking for something different than the usual hack and slash modules than give this a try, it is no coincidence that Tiberious both modules (Saleron's Gambit for NwN 1 and Maimed God's Saga for NwN 2) were hall of famers of the highest degree.<br/>\n<br/>\n<br/>\n Saleron's Gambit --&gt; <a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/module/salerons-gambit-chapter-1-5\" rel=\"noreferrer\" target=\"_blank\">http://neverwintervault.org/project/nwn ... hapter-1-5</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}