{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "009",
  "name": "Aribeth's Redemption",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/aribeth-s-redemption-t2354666.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "28",
  "views": "6.5K",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:34 PM - Feb 18, 2017",
      "content": "<div><strong><span style=\"text-decoration:underline\">Aribeth's Redemption</span></strong><br/>\n<br/>\n<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/aribeths-redemption-chapter-one\" rel=\"noreferrer\" target=\"_blank\">Chapter One</a><br/>\n<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/aribeths-redemption-chapter-two\" rel=\"noreferrer\" target=\"_blank\">Chapter Two</a><br/>\n<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/aribeths-redemption-chapter-three\" rel=\"noreferrer\" target=\"_blank\">Chapter Three</a><br/>\n<br/>\nTo be honest, one and all, I'm not entirely sure the question I have about this module should have its own topic, but I can't think where else to ask it, thus...<br/>\n<br/>\n However, it may be that others are unaware of it, or might fancy giving it a whirl, so I'll give it some introduction, together with what it encompasses. As with the hijacking of the Aielund Thread, I do not not propose to make a walkthrough - such things may be found elsewhere, on other fora.<br/>\n<br/>\n Aribeth's Redemption is a 3-part module (available from the NwN Vault) that takes your character directly from the end of the Original Campaign back into the city of Neverwinter. It is only a viable set of modules if: i) you didn't kill Aribeth during the OC, ii) you are a good-aligned character (ideally LG. NG is fine, and CG can get away with it) of elven, human, or half-elf races, and iii) male (hey, them's the rules). Someone told me recently that this has changed as far as races are concerned, but I have no evidence to support that, sorry.<br/>\n<br/>\n In essence, it is a pursuit of your character's romance with Aribeth hinted at in her cell (assuming the 3 points above) before you enter the Source Stone. You arrive back in Neverwinter after your defeat of Morag, to learn that Aribeth is to be put on trial - following some clearing up of what remains of the bad dudes.<br/>\n<br/>\n Assuming all goes well at the trial, Aribeth will have to perform 3 tasks to bring her back to the church's favour, and 5 to that of the Lords' Alliance. If you don't want to end this immediately, you'll probably want to go into exile with her.<br/>\n<br/>\n<em>[I might as well ask my question now. When Aribeth is finally reconciled with the church (end of part 2/start of part 3), you get to choose which church she will join. Her choices are to become a priest of Helm, an Ilmateri monk, a champion of Torm, or a paladin of Tyr once again. I have only played this through twice, and have reinstated her in Tyr's grace both times, but I wonder what the results are should a different path be chosen. Does anyone know?]</em><br/>\n<br/>\n The mods are fairly linear (very much so in the first 2) and very wordy - lots of theological/moral/ethical debates with few options to stray from a single response. The third - and by far the biggest module - does give more leeway, but is still somewhat frustrating in its directional qualities. Nevertheless, the story is strong and logical in its movement, and the combat improves greatly as you progress. It also combines combat with other challenges very well, and I have no hesitancy in commending it to those who felt the OC left several stones unturned.<br/>\n<br/>\n An unexpected bonus awaits for those who have played Baldur's Gate, and particularly Baldur's Gate II through to the end, as well as those wondering about what happened to some \"lesser\" characters in the OC. The creator's attention to detail (sorry, forgotten his name) is marvellous here.<br/>\n<br/>\n Anyway, there's your starter for ten. Hope this helps make it a worthwhile topic. <img class=\"img-emoji\" src=\"emoji/11.gif\"/><br/>\n<br/>\n<em><strong>EDIT:</strong></em> Apologies, meant to let you know a few more details, but was distracted by a phone-moron. You should start this at level 17/18 (fairly obviously) and finish the whole shebang at around level 28 (essentially, much as if you'd played SoU and HotU), thus allowing a nice progression into, for example, Sands of Fate. You also carry your equipment forward from the OC, and there are several times it becomes upgradeable, as well as various stores. Iirc, max enhancement is +12, so we're looking at high magic here. It is also a Dev Crit viable environment, fyi.<br/>\n<br/>\n<em>edit:  20170219 per Hip; added Vault links to lead</em></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:12 PM - Feb 18, 2017",
      "content": "<div>So what happens if my OC toon performed a merciful Kevorkian on the betrayer in the OC but decided to \"fake it\" through the Redemption?  Is there a variable that got set on the local character related to the Ch4 confrontation that precludes a switch in roleplay for the Redemption series?  I mean, if I prebuilt a Level 17-18 char that meets all the racial and alignment prereqs, what's to prevent that toon from following the series through?<br/>\n<br/>\nI've read about the \"recommended\" status but assumed it was more for storyline consistency than an actual variable check on start-up.  Come clean, Stagmeister!  Wassup?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:38 AM - Feb 19, 2017",
      "content": "<div>Oh, bloody hell, where's Empyre when I need him?<br/>\n<br/>\n I'm not sure how much help this will be, but I'll try...<br/>\n<br/>\n First off, while I've heard the name Kevorkian, I can only assume it's the mercy-killing doctor we're referencing here (I'm in trouble if not), and no, that won't work with these mods. You need Aribeth with you. Quite apart from anything else, the quests you undertake are hers, not yours (except for one or two which are either not counted for early xp, or are undertaken while she is re-training in whichever churchly area you consign her - and these only go towards subsequent quests when the two of you are together again) - after all, you have no \"need\" for redemption, having saved everyone from lizardly death already. It's all about standing with your gal through thick and thin. She will receive 2 vials after her trial, and each quest undertaken will have them filled - a third at a time for the quests for the church and a fifth for each of the Alliance's. It may be worth noting that while you'll complete the religious quests by the end of the 2nd mod, you'll still have 4 to do for the Lords' Alliance in part 3.<br/>\n<br/>\n Thus, not a chance of the module working if Aribeth's already dead, however well-intentioned or merited it may have been.<br/>\n<br/>\n You're right, Hip, it is for storyline consistency, but at a more fundamental level than you may have thought.<br/>\n<br/>\n Hope this clarifies a bit!<br/>\n<br/>\n<strong><em>EDIT:</em></strong> A couple of things have just crossed my mind, though to be honest they scooted by pretty fast, so I might not recall both fully. If, rather than in my initial assumption, you were thinking that Aribeth could merely be found - much as encased within ice in HotU - I'm afraid I don't know: others might. The other thing is something of an oddity, given my earlier praise for continuity. An assumption is made that your character travelled with Sharwyn (the bard) during the OC. Don't be unduly worried though, there are reasons behind this, and it won't impact on the story.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:52 AM - Feb 19, 2017",
      "content": "<div>For me to play the series I would need to prebuild a pally since I've never played one (well, once I did in SoU just to get access to a pally-only area) and really have no interest in yet another run-through of the OC (How about a Blackguard who tries to romance Aribeth into turning to the darkside? <img class=\"img-emoji\" src=\"emoji/10.gif\"/> Nah.).  <br/>\n<br/>\nI am sensing, from the Vault description that it's only a matter of story consistency and a roleplay orientation but not one of a scripted status check of any quests or variables from the OC.  Typically, variables (like the one that sets which henchman \"follows\" you into the next chapter) are set on the module, not the character.  But I could be missing something here.<br/>\n<br/>\nNow we'll both wait for Empyre to reveal the truth of the matter.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:43 AM - Feb 19, 2017",
      "content": "<div>Absolutely no need for a Pally build, Hip. The first time I went through with an elven Fighter/Bard/RDD (CG) - can't give a reference 'cos it was my first ever build request and a mash-up from Empyre and Valerfor, and that was fine. The second was with Empyre's human Order of the Wyrm (unarmed version) Monk/Sorc/RDD (LG), which was also good fun. And a chap of your experience should be able to glide through the OC in a long weekend. Maybe try your own 2002 challenge with someone? Honestly, it's worth at least one play-through. Just be patient with the dialogue. You'll get to kill lots of good stuff, promise!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:32 AM - Feb 19, 2017",
      "content": "<div>It is funny that you act like I am all-knowing when it comes to this campaign. I have never killed Aribeth, so I don't know whether you can play this with a character who killed her. I think that is probable that it will assume you didn't kill her, and it will have no way of knowing otherwise. Any Good alignment should work, and maybe even Lawful Neutral.<br/>\n<br/>\n I'd say experiment with your existing character who killed Aribeth, and it won't take long to find out whether they act like you killed her.<br/>\n<br/>\n I believe that what church you choose for Aribeth doesn't affect the story at all, but only determines what build she uses. I experimented before, and the Paladin, Cleric, and Monk builds are all pure one-class builds, and the CoT build is Cleric / CoT.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:38 PM - Feb 19, 2017",
      "content": "<div>Well, Empyre, you may not be all-knowing, but you've certainly provided a line of clear sanity here! \"Try loading a character and see if it works\" seems eminently sensible to me.<br/>\n<br/>\n I've had to kill Aribeth twice  - once as a True Neutral character and once as a female, albeit Neutral Good one. I suspect, unless you have astronomic Persuade skills, it will hinge on whether you kept her ring from Port Llast, so if you weren't given that, death may well be the only option.<br/>\n<br/>\n My question about which church you choose for Aribeth was purely for information. I seem to have taken the coward's way so far: simply going with what I know. And I happen to be at that point in this, my third, run-through at the moment (using a Dev Crit version of my Aielund Sword Champion). It might be interesting to see how she behaves as an Ilmateri Monk (no sado-masochism jokes here, please), or a straight-up Cleric of Helm. It would seem a little redundant to play her as CoT, given that it's my main class in this build. Guess I'll just have to see.<br/>\n<br/>\n Thanks for the sage words, Empyre. Hope they're of use, Hip.<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:55 PM - Feb 19, 2017",
      "content": "<div><blockquote><div><strong>Stagmeister wrote:</strong><hr/>I suspect // it will hinge on whether you kept her ring from Port Llast, so if you weren't given that, death may well be the only option.<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">\n I wonder if the module checks for presence of her ring, since it is supposed to be a sequel to the OC?<br/>\n Btw, I have never played the mod.</div></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:23 PM - Feb 19, 2017",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong><hr/>It is funny that you act like I am all-knowing when it comes to this campaign. I have never killed Aribeth, so I don't know whether you can play this with a character who killed her. I think that is probable that it will assume you didn't kill her, and it will have no way of knowing otherwise. Any Good alignment should work, and maybe even Lawful Neutral.\n</div></blockquote>Compared to a none-knowing first timer, I'm afraid you have been dubbed All-Knowing-Master-of-the-Universe when it comes to the Redemption, Empyre. <img class=\"img-emoji\" src=\"emoji/7.gif\"/><br/>\n<br/>\nThe only two factors I can think of which may be checked \"somehow\" by the start of the Redemption is 1) Aribeth's Ring (in inventory from a Ch2 convo prior to her disappearing in Luskan) and 2) the love interest dialogue variable (NW_L_M4Q01ARIBETH_LOVE_TALK = 1).  Both these could be added to a pregenerated character just by starting the PC in the OC's Ch4 and adding them before resaving the toon.  But it may not be necessary at all (as you've already suggested).<br/>\n<br/>\nIn order to follow the theme designed into the series, I think some sort of pally (either pure or MC) is probably the most immersive choice. At least it places the PC and Aribeth within essentially the same frame of reference (\"birds-of-a-feather\").  Whether or not the designer takes advantage of that or not... well... that's an experience TBD.  I realize the series has some bridging value but that is not my intent.  Simply a desire to sample some new SP (well, new to me, anyway).<br/>\n<br/>\n@Stagmeister:  Except for trying to run the OC within 2002 limitations (am currently finishing up Ch2 with a wiz/rog and the added challenge is quite noticeable), I have zero interest in repeating yet another v1.69 session through it.  My fun time is a precious commodity that I cannot afford to treat frivolously.   The other factor you may not have considered is that building a toon for the Redemption series from a 2002 format will seriously nerf the post-Level 17-18 character, with the feat/class limitations being the most influential (skills can always be dumped during Redemption, I suppose).  <br/>\n<br/>\nOur LAN group used the OC as a launching point for our electronic venture away from PnP in 2005 just because it was easy and vanilla so we must have played through it 50 times or more, sometimes with some added bell-and-whistles provided by our tech-savvy scripters in the group and as DM'd sessions with different teams and party mixtures.  <br/>\n<br/>\nPlaying through content that has been thoroughly-memorized has no appeal (to which I am sure you can relate to).  Only the DM sessions kept it viable but those days are gone and we've migrated to content that reflects AD&amp;D 3.5 since that is the version our PnP group indulges.  It's the flexibility of NWN's toolset and NWScript that allows the designer team to adapt NWN perfectly to a NWN2 style without needing to muck about with their inconvenient Electron toolset. <br/>\n<br/>\n...and thats's all there is to <span style=\"text-decoration:underline\">that</span> backstory.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:53 PM - Feb 19, 2017",
      "content": "<div>Okay, as the instigator of all this malarkey, I thought I'd take Empyre's advice and see what happened when I loaded a character who hadn't let Aibeth live. In fact, I took it one stage further and loaded a level 17 saved character from Aielund, who hadn't even heard of the elven betrayer, let alone spared her life of knocked her into Cania. Admittedly it was a he, and Good-aligned, but he loaded seamlessly into the first module (granted, he was invisible other than his helm and cloak, but that's down to the different gear available in Aielund). It made getting out of the chambers beneath Castle Never  damned difficult, but when he did, there was Aribeth, sleeping like a babe, just as if the prescribed route had been followed. And I was recognised as a old friend to the city and its inhabitants - making me feel as if I'd simply taken a stiff blow to the head and would shake it off presently. Essentially, all was well.<br/>\n<br/>\n Thus, fretteth not. Neither ring nor romance are necessary to play the module.<br/>\n<br/>\n @HipRedux: A very fair point about the 2002 challenge, which I'd missed, sorry. Hopefully the news above will allow you to have a crack at the mod without too much pain. I still don't think Pally would necessarily be the best class (regardless of the author's stated preference) for your toon. At the end of the second mod/beginning of the third, you get to choose what Aribeth will become once reclaimed by the church - before that she's a single class fighter, so you've plenty of scope to come up with a character that she'll complement. And at different times you'll also have a Paladin of Sune as a companion for a while, and a half-dragon, and a dwarf member of the Order of the Radiant Heart, and a gnome (or halfling - can't remember atm) wizard, and a Drow thief/assassin, so the world's your lobster!<br/>\n<br/>\n Hope this helps <img class=\"img-emoji\" src=\"emoji/7.gif\"/></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:15 PM - Feb 24, 2017",
      "content": "<div>First off, many thanks to Hip for providing the links in the lead post here, which I'd not done - my bad.<br/>\n<br/>\n Secondly, and I was going to give all of these in one go, but am strapped for time, alas, so it'll be one per post, I've been answering my own initial question about what happens to Aribeth after you pick a church for her that isn't Tyr (thanks for the advice, Empyre). Thinking about it, it might be as well to give her stats should she return to Tyr's service as well, because you'll only have experienced her as a pure Fighter earlier on in the mods.<br/>\n<br/>\n Thus far, I've got the gen on her as an Ilmateri Monk - inheriting her at level 21. At that point, she's a straight level 21 monk (stats of STR 15, DEX 18, CON 11, WIS 18,INT 15, CHA 20 - enhanced by wedding band, much as your own is at that point). There are only 2 skill foci she has 0 points in - UMD and Concentration. Most of the rest are in single digits, but Discipline is in the teens, and Hide, Move Silently, Parry, Persuade and Listen are in the 20s. Her new/unexpected feats include (given that she was a full Fighter when the two of you began your attempt to redeem her): Called Shot, Disarm, Dodge, Mobility, Spring Attack and Toughness. These are alongside WF in Kama and Imp Crit in both Kama and Unarmed, together with Ambidexterity and 2-WFighting. She loses her bastard sword and armour, but these are replaced with Ilmateri Robes +7 (essentially the same as those yellow ones you get at monk creation - Order of the Deaf Rabbit or something) and 2 Ilmateri Kamas +5, which are both Holy Avengers and grant Haste.<br/>\n<br/>\n If anyone is choosing to play these mods, I hope this helps. I don't think it qualifies as a spoiler. I'll be back with the specs on Aribeth's other potential choices later...<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:11 AM - Feb 25, 2017",
      "content": "<div>Train cancelled, so able to do one more. Aribeth as Cleric of Helm.<br/>\n<br/>\n As before, all stats are given as at level 21. STR 15, DEX 15, CON 11, WIS 18, INT 17, CHA 20 (with ring). Air and Animal Domains. Skills over 20 in Concentration, Lore and Spellcraft, in double figures for Discipline and Listen, and a smattering in everything else bar UMD (although some are at negative values). Feats include: Combat Casting, Extra Turning, Spell Penetration, Toughness, Ambidexterity (for some reason) and WF: Light Flail. She is presented with armour that is pretty much the same as previously, just in Helm's colours, a Tower Shield of Sight - giving AC+3, Armour Bonus of +6 and True Seeing - and a Watchman's Flail - 1d8+5, Keen, Holy Avenger and immunity to mind-affecting spells.<br/>\n<br/>\n All right, off again now...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:01 AM - Feb 25, 2017",
      "content": "<div>All right. Train landed, and elderly relative now internet enabled (I take that as a major victory, btw), can now report on the version of Aribeth as a CoT. Actually, while I'm at it, I now have an 80 year-old with all sorts of NwN loaded on her pc - can anyone top that?<br/>\n<br/>\n Back to the plot. If you choose Torm as Aribeth's sponsoring church, when she comes back to you she will be (again at level 21): Paladin 10 / CoT 11. The stats are: STR 17, DEX 13, CON 10, WIS 16, INT 13, CHA 24 (with wedding ring - which, btw, is CHA+3, Regen+5 - sorry, forgot to mention that before). Skills in everything bar UMD. In the teens for Concentration and Persuade, and the 20s for Discipline and Heal. She keeps her own armour and sword (bastard, of that ilk) from before, and her feats now include Finesse and Great Cleave, together with bucketloads of WFs and Imp Crits: those being in BSwd, Light XBow, Rapier and SSwd; along with WF in GSwd and Imp Crit in LSwd (not sure why the split, but whatever...).<br/>\n<br/>\n Just Tyr's Pally left to do now. Hope I'm not boring folk too much.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:05 AM - Feb 25, 2017",
      "content": "<div>And here we are. Final lump. Aribeth back as Tyr's Paladin.<br/>\n<br/>\n When Fighter, she had WF in Katana, and that's gone now (as it has for whichever church you choose). However, to give the stats as before: STR 15, DEX 13, CON 10, WIS 16, INT 13, CHA 26 (with ring). This time, she has all skills except UMD (minuses in Parry and Move Silently). All are under 10 bar Concentration, Persuade and Intimidate, which are in the teens. Feats include GCleave and Imp Crit and WF in both BSwd and LSwd. Armour and weapon remain as is (unless you've had it modified, of course - in which case you shouldn't have let her keep it anyway).<br/>\n<br/>\n So there we go. All the Aribeths anyone could ever want (?). May they be of assistance to you...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:03 AM - Feb 25, 2017",
      "content": "<div>She's the \"Lady Lon Chaney of Neverwinter\"!  That should give some decent replay value to the modules.  Thanks for the effort, Stagmeister... and the thread to house it.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:02 AM - Jun 29, 2017",
      "content": "<div>Am currently in Part 3 of this series, and about to go underwater, but have recently noticed that since leaving the Sunite temple, and with Khurin alongside the happy couple, Aribeth is not entering combat. This is new to me. She's following just fine, and I've instructed her to \"attack nearest\" via the radial menu, and even had a chat where an option I hadn't seen before cropped up - \"I've noticed you're not dual-wielding properly\" - to which she responded: \"How embarrassing\", but still did nothing (despite not dual-wielding anyway). She's de-trapped a chest and bashed a lock, but seems melee-averse. Fortunately, all the bad dudes seem to regard her as being in sanctuary, so she isn't taking damage, but I don't know what's going on. I tried shifting her back up to being just below me in the right-hand cast list, but to no avail, and I did make her a CoT at the beginning of this mod, but I don't know what's going on. Fortunately, Khurin and myself are taking care of business just fine, but I'd still like to know what's happening.<br/>\n<br/>\n Any advice/tips would be appreciated, because I do think I'll need her later.<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:39 AM - Jun 30, 2017",
      "content": "<div>It's got weirder. Finished the undersea/erinyes quest fine with Aribeth as onlooker. Have now done the dragons/Sisslik 2 - the sequel, and Aribeth was quite happy with fighting the bronze, silver and gold dragons, but no one else - and this time she did take damage. Also, while I'm now close to level 24, she remains at level 21. It's all very odd. I've been lucky so far, in that both Khurin and Thamaxyl (and even Sharwyn) have proved their worth big time, but I could do with a bride who isn't simply obsessed with taking selfies!<br/>\n<br/>\n Anyone, please!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:49 PM - Jun 30, 2017",
      "content": "<div>At the risk of appearing obsessive, I now have a theory...<br/>\n<br/>\n Have just completed the Ostlers' quest and the same thing happened - Murgo was superb, btw. However, my thinking is that Aribeth only plays nice when it's just the two of you. She only levelled up when there were just the two of us, and she only gets stroppy with bad dudes when we're alone together - unless it's plot-necessary - so I'm wondering, is it just that she doesn't deal well with company? \"Oh, he's off playing with his new friends, I'll just sit over here and sulk.\"<br/>\n<br/>\n I'm probably wrong, but no one's come to my aid as yet, so I've had to come up with something on my lonesome...<img class=\"img-emoji\" src=\"emoji/2.gif\"/></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:21 AM - Jul 01, 2017",
      "content": "<div>Stag, did you try the simplest solution yet?<br/>\n I mean to load a previous save and try again from that point onwards.<br/>\n<br/>\n Aribeth was always such a pain to handle... (becomes a BG then turns to PAL again then betrays you in last combat yet again).<br/>\n Perhaps her mirror entity (from just before morag) would be a better choice for you ;-)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:16 PM - Jul 01, 2017",
      "content": "<div>Thanks Valerfor. Alas, I have tried loading from a previous save, but to no avail. It's only happened during this third module, so I'm wondering if something buggy happened from the point when I made her a CoT. I would try repeating the entire module, but this particular outing is merely to get me into Sands of Fate (I'm taking a bastardized version of Tyr Templar's <strong>Dragonborn Ranger</strong> - Rgr 26/ Bard 4/ RDD 10).<br/>\n<br/>\n On the positive side, because I've been playing Aielund almost exclusively, I'd forgotten just how sweet Dev Crit is - Balrog schmalrog!<br/>\n<br/>\n Thanks for the thought, though.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:30 PM - Jul 01, 2017",
      "content": "<div>Okay, now I'm really pissed off. Have just defeated the Necromancer - on my own (her ladyship was not helping) and 3 times, as it happens, because Mindhoza's ghost is nowhere to be found after the battle - and am unable to open the side door to collect the Drow device. Thus, I'm unable to complete the quest. Aargh!!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:54 PM - Jul 01, 2020",
      "content": "<div>I've been meaning to add something here for a while, and have been triggered to do so by Orion thinking of playing these mods.<br/>\n<br/>\nJust in case my last few posts have deterred others from playing Redemption, I have subsequently replayed all three parts (with my Firewing of Corellon - Bard 8/ RDD 10/ CoT 22 - but that's of no concern here) without the aforementioned hiccups. The only difference was that I kept Aribeth as a Paladin of Tyr, so maybe - for all that there are options - changing her to one of the other builds on offer is what led to her sulkiness. Perhaps there are only so many classes she could handle in one lifetime (\"Pally, Blackguard, Fighter - and now you want me to try something else?!\"). So my advice would be to stick with her as is/was. I only have empirical evidence, of course: it all could have been something else entirely.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "6:03 PM - Oct 06, 2021",
      "content": "<div>So I started playing these modules for the very first time ever (!) I first completed the OC with the character I use for the modules. And now I have played through the first two modules and just started the third where I have finished the dreams sequence. <br/>\nAfterwards I intend to play Sands of Fate.<br/>\nThe modules are straight forward linear with almost none dialogue options. The dialogues are very long and with an archaic language that I struggle to understand. If you read them during your first play through so you know what it's all about,  I think you can just skip them later by pressing 1 repeatedly. <br/>\nCombat is not too challenging with few exceptions. And your companion is able to handle things well, at least if you give her some basic equipment.<br/>\nThe quests work well with no bugs and are easy to follow. <br/>\nSome people are great fans of Aribeth and love playing the series for that reason. I am not one of them. I find her very annoying. She is an immature girl who sees everything in black and white: Good or evil, despair or hope, love or loathing and so on. She falls deeply in love with you, she claims. But she will not have an adult love relationship with you. <br/>\nAnd yes, I know that she has lost her dear Fenthick and feels betrayed. And I know that she has lived through a major crisis. But she is annoying nonetheless. <br/>\nI'll complete the series, the mods are OK despite Aribeth herself. And if nothing else I'll level up for SoF.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "7:00 AM - Oct 07, 2021",
      "content": "<div>Well, what do you expect from a Half-Elf?  <br/>\n<br/>\nDue to her lineage, she is already conflicted (see DL Tanis for more ;) ); add in some splash of Pally (and of Tyr, no less), then that maddening milksop Fenthick (who I hate more than any other creature on this planet for being absolutely pathetic, useless, naive, and...just kill it, KILL IT WITH FIRE!) and his demise (which, if you ask me, he had it coming!) and yeah, it is no wonder the woman is a mess!  Then Blackguard...yeah, she is conflicted alright!  <br/>\n<br/>\nDoes she really fall deeply in love?  Or does she just think she does?  I think more of the latter.<br/>\n<br/>\nAnyway, I feel that Aribeth sometimes gets a bad rap.  Besides, she has great armor!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:00 PM - Oct 07, 2021",
      "content": "<div>Well, I think you're both right, if that makes any sense.<br/>\n<br/>\nShe is certainly intensely irritating and shows an alarming capacity to change her entire  raison d'etre at the drop of a hat (which makes Paladin a particularly weird class for her, surely?) and unable to make her mind up - even during the Redemption, it's you not her who gets to choose which church she should join! And there's a point during the desert quest when I would cheerfully have lopped off her head if it was an option. She really doesn't help herself with all the passionate dithering.<br/>\n<br/>\nAnd yes, she has had a rough ride: dead family, near freezing to death, plague, dead boyfriend, lizards, threat of execution, banishment (or Cania if she is summarily dismissed), and so on. But she does bring an awful lot of it on herself - set yourself up as a hero and prepare for a fall, she oozes hubris.<br/>\n<br/>\nNow, that Paladin of Sune is a whole other matter...<br/>\n<br/>\nI'm glad you're going to finish the series, Mick. Unlike a lot of modules, the Redemption actually gets better as it progresses: the third part is far and away the best - and the least preachy (as well as being hugely longer than the other two combined).<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "11:01 PM - Mar 27, 2022",
      "content": "<div>Hi Stag<br/>\n<br/>\nJust checking at the beginning of Act III Aribeth disappears for a while and you are supposed to carry on for a bit without her? Is that correct?</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:46 AM - Mar 28, 2022",
      "content": "<div>Yes, she is training for whatever class you chose for her.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "11:16 AM - Dec 28, 2022",
      "content": "<div>Can anyone send me a spoiler for the lever puzzle in act 3. I can't figure it out at all even with the in game dialogue \"assistance\". Help please! <br/>\n<br/>\nSent from my I3312 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:58 PM - Dec 28, 2022",
      "content": "<div>Hi <em class=\"mention\">@Dingpot</em>, I hope I'm right in thinking we're talking about the \"rainbow\" room while heading for the Necromancer?<br/>\n<br/>\nAssuming we are, below are the notes I scribbled down that seemed to work...\n<details><summary>Spoiler</summary>Before starting, make sure you save, 'cos you need to get it all correct in one go or you'll be randomly shot around to different islands.\nFirst pull the single red lever, then the nearby double lever. This takes you to the first island, where you pull the yellow single lever and the red one (making orange), then the double lever. On the next island pull the single yellow lever, then the double one. On the third island pull the blue and yellow singles (making green), then the double. On the next, it's the single blue one then the double. And on the last it's the red and blue singles (for purple), then finally the double.\nOnce at the other side, you </details>\n\nHope this helps!</div>",
      "author-color": "#AA0000"
    }
  ],
  "author-color": "#AA0000"
}