{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "042",
  "name": "search function not functioning ?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/search-function-not-functioning-t2285325.html",
  "author": "MrZork",
  "avatar": "no_avatar.png",
  "replies": "1",
  "views": "481",
  "posts": [
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "5:38 PM - Sep 09, 2012",
      "content": "<div>I just tried a forum search several ways and each time got the message\n<blockquote><div>The following words in your search query were ignored because they are too common words: <strong>risen lord</strong>.<br/>\nYou must specify at least one word to search for. Each word must consist of at least 3 characters and must not contain more than 14 characters excluding wildcards.</div></blockquote>\nThe criteria specified for the search were clearly met, so I am not sure what the issue is. Fortunately, google is fine for this, but I thought I should mention it.</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "1:54 AM - Sep 27, 2012",
      "content": "<div>Unfortunately, IIRC, the forumer Search NEVER worked on these boards and has been a standing issue all this time, MrZ.<br/>\n<br/>\nAdditionally unfortunate is the fact that our fearless leader has been absent for an extended period... our one-and-only interface with the phpBB admins.  I suppose one of us could attempt to contact them for addressing the issue, but that may mean that THAT poor sacrificial lamb may be forced to assume Kail's position until he returns, if at all.  My own limitations prevent me from engaging on any serious administrative level and the few times I DID contact those folks about other issues, they were slow as molasses to respond and then never did resolve my problems anyway, even months later.<br/>\n<br/>\nNow, if someone were to volunteer to act as intermediary...   <br/>\n<br/>\nAny hands?</div>"
    }
  ]
}