{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Add ons",
  "forum_id": "003",
  "id": "010",
  "name": "NWShader",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/nwshader-t515379.html",
  "author": "KailPendragon",
  "avatar": "10235214_1540245864.jpg",
  "replies": 0,
  "posts": [
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "10:08 PM - Jul 25, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><a class=\"postlink\" href=\"http://nwvault.ign.com/View.php?view=Other.Detail&amp;id=1443\" rel=\"noreferrer\" target=\"_blank\">NWShader by pkpeachykeen</a><br/>\n<br/>\nNWShader is a framework for using modern Cg shaders and effects within NWN.<br/>\n<br/>\nIn simple terms, NWShader lets NWN do fancy modern graphics. As everyone has noticed, NWN's graphics are a bit old. There are a few projects to help with this, especially chico400's awesome NWNCQ and Project Q, but those only go so far. NWShader picks up with going under the game and turning on a bunch more features.<br/>\nThings like depth of field, bloom, and even Crysis-style SSAO are possible.<br/>\nNWShader supports fullscreen and material shaders. Fullscreen shaders are special effects added to the whole scene after the game draws it, and are used for color changes and lens effects. Materials apply to a particular texture and change how an object is drawn. Special effects such as skin, velvet, edge glow, normal maps, parallax and glow mapping are all possible.<br/>\n<br/>\nNWShader gives artists an unprecedented level of control over how their work is shown in the game. Using a simple, but powerful, XML-based material framework, artists can add material without ever touching shader code. Shader authors can control every step of the drawing process, from vertex location to texturing to lighting, and add custom methods for any object.<br/>\n<br/>\n<br/>\n<br/>\n<strong>******************************</strong><br/>\n<br/>\n<br/>\n<br/>\nIf your machine can handle it, you definitely want it. NWN old graphics get a huge facelift with this amazing add on. Wow.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}