{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "035",
  "name": "Titles",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/titles-t2354522.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "3",
  "views": "374",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:00 PM - Mar 31, 2016",
      "content": "<div>Hi All,<br/>\n<br/>\n A bit more dumb-assery from the Stagmeister. I have noticed, as I'm sure you all will have done, that once you max your alignment choices you get a title - \"Crusader\" for LG characters, \"Benefactor\" for NG, and so on (it'd be interesting to know what a CE character would become \"That Mad Bastard\", perhaps?). Is it just a titular thing, or is there some benefit to this? Particularly as you can lose the title as well, which makes me think there must be <em>some</em> point to it - I just don't know what it is.<br/>\n<br/>\n I ask merely for enlightenment!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:55 PM - Mar 31, 2016",
      "content": "<div>The titles don't have any effect. You can read about them here: <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Alignment\" rel=\"noreferrer\" target=\"_blank\">http://nwn.wikia.com/wiki/Alignment</a> There are a lot of things that you could look up in the wiki and get your answer faster than asking here.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "5:18 PM - Apr 08, 2016",
      "content": "<div>A lot of custom servers use these sort of titles to inform you when you have achieved a certain alignment needed to join guilds or access certain quests.  Sometimes, access may change depending on whether alignment shifts have been scripted or not (sometimes you are \"stuck\" at the created alignment because there are no scripted shifts.  Some severely-RPing servers may ban your toon from the server if you engage in activities that conflict with your chosen status instead of displaying a title change warning mechanism.)<br/>\n<br/>\n But generally, as Empyre has already stated, it is only used for RP considerations and whether the designer has scripted a consequence for achieving that level breakpoint in the module or PW realm.<br/>\n<br/>\n Funny you should ask about this though, because at times I have strived to maintain a particular breakpoint achievement even though it never affected the gameplay or questing, just for the fun of it.<br/>\n<br/>\n You do remember how the last Chapter and finale of HotU uses these aligment breakpoints to determine the Knower's responses and the ending credits, right?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:44 PM - Apr 09, 2016",
      "content": "<div>Thanks, Both.<br/>\n<br/>\n All interesting stuff. Unfortunately it raises more questions in me which probably can't be answered here, at least without the \"them's the rules\" response, so I'll leave it be (you'll be pleased to hear).<br/>\n<br/>\n @Hip: I'm glad I'm not the only one who's loath to discard a bestowed title! I knew, re HotU, that how you dealt with Mephisto determined the end credits, but not that alignment breakpoints had anything to do with it, nor that the Knower's responses were affected. To be fair, as stated elsewhere, I've never reached the end other than wearing a white hat (be it L, N or C). Thanks for the info.</div>",
      "author-color": "#AA0000"
    }
  ],
  "author-color": "#AA0000"
}