{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Persistent Worlds",
  "forum_id": "002",
  "id": "015",
  "name": "Arelith Server info.",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arelith-server-info-t515495.html",
  "author": "Templar",
  "avatar": "10235261_1528181864.jpg",
  "replies": 16,
  "posts": [
    {
      "author": "Templar",
      "avatar": "10235261_1528181864.jpg",
      "timestamp": "9:06 PM - Sep 24, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Arelith server Summery:<br/>\nPositives: Level 30 cap, no hak's required, a three server world of cordor, surface and underdark (There is a separate and a new fixed level(FL) server that we are trying out where you start at lvl 9 and stay there, \"leveling up\" through gear), custom language system, custom crafting system, Custom enchanting system, Low magic (+3 max unless you have a caster buff your weapon/armor/shield) Custom disguise system, extra races, unique buffing of spell focus's(some of these are very cool), etc, etc<br/>\n<br/>\nNegatives: role playing Rating set by DM's who watch you rp is required for a few races and classes but many of the fun ones are free to play. devastating crit disabled and other feats/skills/spells have been changed a bit. read the wiki for more info if you want or ask me questions.<br/>\nMore info here <a class=\"postlink\" href=\"http://wiki.arelith.com/Main_Page\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Main_Page</a><br/>\n<br/>\nA bit more detailed now:<br/>\n<br/>\nYou have to always take 3 consequent levels in a new class. When you take first level in a new class, then you will have to take 2 more levels in the same class afterwards. Therefore it is not possible to have:<br/>\nWizard 29 / Rogue 1 (3-levels-in-class rule must be fulfilled even on level 30)<br/>\nCleric 2 / Rogue 1 (you need to have 3 levels in each class before taking a new class or continuing to progress in different class)<br/>\nThis means one you have taken the required 3 in a row, you can go in any order because you did the FIRST three in order<br/>\n<br/>\nFeats Devastating Critical and Summon Mount are disallowed on Arelith. Some other changes can be found in <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_commands\" rel=\"noreferrer\" target=\"_blank\">Console commands</a>. Most noticeable is *detects evil*, possibility to disguise from others and *looks* command.<br/>\n<br/>\nThere are a few class changes = <a class=\"postlink\" href=\"http://wiki.arelith.com/Class\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/Class</a><br/>\nClasses with Changes<br/>\n    Barbarian<br/>\n    Bard<br/>\n    Cleric<br/>\n    Druid<br/>\n    Paladin<br/>\n    Ranger<br/>\n    Sorcerer<br/>\n    Wizard<br/>\n    Shadowdancer <br/>\nClasses with No Changes (Only <a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes\" rel=\"noreferrer\" target=\"_blank\">spell changes</a>, <a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes\" rel=\"noreferrer\" target=\"_blank\">skill and feat changes</a> affect these classes<img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n    Fighter<br/>\n    Monk<br/>\n    Rogue<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "9:59 PM - Sep 24, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">So... once you've fulfilled the 3-in-a-row per class deal, then you can dump to a single level whenever you like from that point forward?<br/>\n<br/>\nAlso, please detail any constraints for Prestige classes else builder suggestions will likely just treat them as vanilla, limited only by the 3-in-a-row rule.  I'm not referring to feat limitations (though that would be helpful as well) but mainly just leveling constraints.<br/>\n<br/>\nThanks for getting the ball rolling for the Arelith folks and welcome to the new ECB!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Templar",
      "avatar": "10235261_1528181864.jpg",
      "timestamp": "2:30 AM - Sep 25, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">yep once you hit your 3 in a row then any order going forward<br/>\n<br/>\nas far as prestige classes most are base nwn but you just need a dm quest to get the token that allows you to take the class but that is more on the player then the builder <br/>\n<br/>\nHumm... only a few other tid bits..<br/>\n<br/>\nOther changes that may effect builds:<br/>\nShadow dancer - Hide in Plain Sight feat (HiPS) has been disabled for this class. Their Shadow Evade now lasts 3 rounds per class level (much longer than the standard 5 rounds). A +1 bonus to Hide is given with each SD level taken. <br/>\n<br/>\nArcane Archer -  Ranger levels will count toward the arcane casting requirement(meaning the base 3 lvls of ranger will do it, you don't have to go until you get spells)<br/>\n<br/>\nOh ya! Shifter and RDD are almost impossible as they are only allowed IF you sacrifice an epic lvl character then make a 5% roll and only then can you have a shifter or RDD prestige levels.(this apparently is going to change soon but hasn't yet)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Atypical",
      "avatar": "no_avatar.png",
      "timestamp": "1:24 PM - Oct 16, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A few specific server details that may affect builds:<br/>\n<br/>\n- No stacking weapon-buff spells (GMW / Darkfire / etc replace the last-used one) with the exception of Bless Weapon.<br/>\n<br/>\n- Spell Focus: Abjuration gives +2 to dispel checks, to a max of +6 with Epic Spell Focus: Abjuration. So being level 24 only makes you un-dispellable from non-abjuration characters; it should be enough to make you undispellable from creatures.<br/>\n<br/>\nEDIT: From the wiki\n<blockquote><div>    Mordkainen's disjunction is capped at 20. (To remove an effect, the caster makes a dispel check of 1d20, +1 per caster level (to a maximum of +20) against a DC of 11 + the spell effect's caster level.) <br/>\n<br/>\n    \"A lv30 Caster has DC41, a Lv20+ ESF Abjuration caster using Disjunction has +26, so they need a 15+ on their roll to dispel each one.\" Calassus </div></blockquote>\n\n- With the above, all casters can take Spell Focus feats<br/>\n<br/>\n- Arcane Defense: Abjuration gives +2 to dispel resistance<br/>\n<br/>\n- Barbarians have a unique interaction with alcohol; getting drunk will give you huge buffs to strength at the cost of dexterity. According to the Arelith Wiki:<br/>\n<blockquote><div>\n    When sufficiently drunk (below 0% sobriety) the Barbarian gains a boost to his strength. <br/>\n<br/>\n1. At first you get a +8 STR bonus and a moderate DEX penalty (5-6 ish?). Upon a second tick, it goes to a +12 STR bonus and a large DEX penalty (-8-10 ish). How bad the DEX penalty is scales with how drunk you are.<br/>\n<br/>\n2. This DOES count towards the +12 Stat modifier. Meaning while your completely drunk, you won't gain any STR benefits from items, barbarian rage, potions, etc.<br/>\n<br/>\nOther bits of info... -Depending on how drunk you are, you'll also laugh, fall over, or otherwise flatfoot yourself in the middle of combat. It gets worse/more frequent as you get drunker, but it still happens VERY often even when mildly drunk.<br/>\n<br/>\n-Once you get into positive sobriety (ex: 0.06) you get another 6 minutes of being STR-boosted without a dex penalty.<br/>\n<br/>\n-Sitting will stop you from spamming the laugh/drunk emotes your forcing on everyone around you when drunk. \n</div></blockquote><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Atypical",
      "avatar": "no_avatar.png",
      "timestamp": "3:40 PM - Oct 16, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, one more small change regarding Spell Focus: Abjuration-- the basic spell focus feat allows your Shield spell to block Lesser Missile storms, and the greater spell focus feat allows your Shield spell to block Greater Missile storms!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "3:55 PM - Oct 17, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Atypical wrote:</strong>Oh, one more small change regarding Spell Focus: Abjuration-- the basic spell focus feat allows your Shield spell to block Lesser Missile storms, and the greater spell focus feat allows your Shield spell to block Greater Missile storms!</div></blockquote>\n\nThat is cool, not exactly balanced, but cool!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "johnbonmovi",
      "avatar": "no_avatar.png",
      "timestamp": "1:43 PM - Jan 31, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As an addendum so people get an idea for what kind of magic setting arelith is, endgame gear for say a sorcerer is generally something like, +1 cha +1 con, +2 discp +2spellcraft.   Now change the skills or stat bonuses and you get an idea of what everyone is rocking based on class.<br/>\n<br/>\nAlso the most powerful melee weapons (all weapon-types are craftable as this) is a +3 attack bonus +6 physical damage weapon, that can also have an additional +4 or +1d6 elemental damage added to it.  Clerics can cheat sort of and temporarily get +5 enchantment + 1d6 elemental damage.  Darkfire does not stack with GMW.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "DragonatorXII",
      "avatar": "no_avatar.png",
      "timestamp": "5:46 AM - Dec 06, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Arelith Fixed Level is the same setting as Arelith, just 100 years back. Appropriately named Arelith Prehistory. <br/>\n<br/>\n-On the server you only get 9 levels<br/>\n-You can purchase<strong> unlimitted</strong> feats<br/>\n- Purchased from NPC Trainers<br/>\n-Standard Arelith rules apply. As well as Feat Changes, Spell Changes, etc.<br/>\n<br/>\n<br/>\nPrestiege Class Reqs:<br/>\nArcane Archer: Elf/Half-Elf, BAB 3, Weapon Focus: Bow.<br/>\nAssassin: Hide 8, Move Silently 8, Evil.<br/>\nBlackguard: BAB 3, Evil.<br/>\nChampion of Torm: BAB 3, Non-Evil.<br/>\nRed Dragon Disciple: Sorcerer/Bard, Lore 8.<br/>\nDwarven Defender: Dwarf, BAB 3, Lawful.<br/>\nHarper Scout: Lore 4, Discipline 4, Non-Evil.<br/>\nPale Master: Spellcaster Level 3, Non-Good.<br/>\nShadowdancer: Hide 8, Move Silently 8, Tumble 5.<br/>\nShifter: Druid Level 3 Spells.<br/>\nWeapon Master: BAB 3, Dodge, Expertise, Weapon Focus.<br/>\n<br/>\nFeats Requirements:<br/>\n<br/>\n<br/>\nImproved Critical: AB 5.<br/>\nImproved Knockdown: AB 5.<br/>\nImproved Two-Weapon Fighting: AB 5.<br/>\nStunning Fist: AB 5.<br/>\nEvasion: All classes.<br/>\nUncanny Dodge I-VI: All classes.<br/>\nUncanny Reflex: Uncanny Dodge VI.<br/>\nImproved Evasion 18 Dexterity.<br/>\nArcane Defense Spellcraft Rank.<br/>\nRogue Feats: Rogue Level/SL 10.<br/>\nGain Skill Points: Any-Class.<br/>\nSpell Focus: Any-Class.<br/>\nWarlock Progression Feat: Warlock Level.<br/>\nBard Song Progression Feat: Bard Level.<br/>\nFavored Enemy: Ranger Level/Harper Scout Level.<br/>\nCreature Weapon Focus: Druid/Shifter Levels.<br/>\nWeapon Specialization: Fighter Level.<br/>\nBarbarian Rage IV-VII: Barbarian Level/SL 11/14/15/19.<br/>\nBarbarian DR I- IV: Barbarian Level/SL 10/13/16/19.<br/>\nWild Shape II-IV: Druid Level 5.<br/>\nElemental Shape I-III: Wild Shape IV, Druid Level/SL 15/16/18.<br/>\nDiamond Body: Monk Level/SL 10.<br/>\nDiamond Soul: Monk Level/SL 11.<br/>\nQuivering Palm: Monk Level/SL 14.<br/>\nPerfect Self: Monk Level/SL 19.<br/>\nQuicken Spell: Spell Circle 3.<br/>\nEpic Feats: SL 31.<br/>\nEpic Skill Focus: Skill Focus, SL 31.<br/>\nThundering Rage: 21 Strength, SL 31.<br/>\nOverwhelming Critical: 18 Strength, SL 31.<br/>\nPerfect Health: 20 Constitution, SL 31.<br/>\nGreater Smiting: 20 Charisma, SL 31.<br/>\nImproved Stunning Fist: 17 Strength, 17 Wisdom, SL 31.<br/>\nTerrifying Rage: Epic Skill Focus (Intimidate), SL 31.<br/>\nAutomatic Metamagic: Epic Skill Focus (Spellcraft), SL 31.<br/>\nSelf Concealment: 22 Dexterity, Epic Skill Focus (Hide), SL 31.<br/>\nLasting Inspiration: Epic Skill Focus (Perform), SL 31.<br/>\nEpic Fiendish Servant: Blackguard Level/SL 31.<br/>\nEpic Dodge: 23 Dexterity, Improved Evasion, Dodge, SL 31.<br/>\n<br/>\nElse: Buy Away.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "DragonatorXII",
      "avatar": "no_avatar.png",
      "timestamp": "5:50 AM - Dec 06, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>DM DM Lykaios of Arelith wrote:</strong><br/>\nFixed Level Player Guide<br/>\nContents<br/>\n1. Server Introduction<br/>\n2. Beta Stages<br/>\n3. System Changes and Updates<br/>\n4. Campaign Setting<br/>\n5. FL Death System<br/>\n6. Character Build System<br/>\n7. Character Progression System<br/>\n8. Character Treasure and Loot System<br/>\n9. Character Skill System<br/>\n10. FL Crafting System<br/>\n11. Armor System<br/>\n12. 5% Epic Sacrifice<br/>\n13. What's to Come<br/>\n<br/>\n<br/>\n1. Server Introduction<br/>\nArelith Fixed Level Server has been designed as a new role-playing adventure concept, a dangerous world where all characters have scale. Where even an inexperienced cutthroat can pose a threat. A world with risks that influences group role-play towards dangerous adventures, for either exploration or hidden discoveries, with rare and unique treasures to be found. Where the role-play of a guild, a settlement's diplomacy and a characters reputation would develop power rather than an epic characters build.<br/>\n<br/>\nThe goal is trying to achieve a world which removes system segregation from all the players. This allows every single player to be able to explore together, role-play together, to take part in events, and to engage players in story lines and have comparable ability to everyone else from the very beginning.<br/>\n<br/>\nThe server's fixed level has been set towards the end of the heroic tier (level 1-10) as level 9, This means that characters cannot progress further than level 9 using the NwN leveling system, however FL has its own unique progression system which has recently been introduced since August 12, see below for more details on system changes.<br/>\n<br/>\nThe level limit is designed to keep all players reasonably balanced within the same scale, so that they can all each individually pose a threat. The dangers of the environment can then also be catered towards that set scale offering you a more intense and challenging experience.<br/>\n<br/>\nThis guide has been developed for you to gain a detailed insight to what the server is about and what features it currently offers. This will be a live guide and will be updated accordingly with the server. All players should find this guide useful as a reference for character creation.<br/>\n<br/>\n<br/>\n2. Beta Stages<br/>\nArelith's Fixed Level Server is still currently in beta stages. It may experience drastic changes at any time with little to no notice. However, the focus throughout will be on creating a dynamic, RP intensive environment to adventure in.<br/>\n<br/>\nBe under no illusion as it is far from the finished product, which is why we need your help to test the server and give us constructive feed back in the forums. This is your chance to be a part of Arelith history as feedback is essential for any future progression.<br/>\n<br/>\n<br/>\n3. System Changes and Updates<br/>\nAugust 12 - Character Progression System implemented.<br/>\nAugust 12 - Paths and Gifts implemented.<br/>\nAugust 12 - System Database updated.<br/>\nAugust 12 - New Dungeon area implemented.<br/>\nAugust 12 - Skill values modified.<br/>\nAugust 12 - Trap and Chest Script implemented.<br/>\nAugust 12 - Minor Spawn changes and additions.<br/>\nSep 12 - Epic Feats implemented.<br/>\nSep 12 - Crafting Points implemented.<br/>\nSep 12 - Spell damage increased.<br/>\nSep 12 - Item creation costs modified.<br/>\nSep 12 - Warlock progression implemented.<br/>\nSep 12 - New items added to database.<br/>\nSep 12 - Fixed known training system bugs.<br/>\nSep 12 - System updated. (New fixtures and Poisons added.)<br/>\nSep 12 - Training System Updated.<br/>\nOct 12 - Server Shops Updated.<br/>\nOct 12 - Training System Updated.<br/>\nOct 12 - Crafting Points Updated.<br/>\nNov 12 - PRC Restrictions Applied.<br/>\nNov 12 - Bard progression implemented.<br/>\nNov 12 - Training System Updated.<br/>\nNov 12 - AA progression implemented.<br/>\nNov 12 - FL Death System implemented.<br/>\nNov 12 - Campaign Setting Updated.<br/>\nNov 12 - New Crafting System implemented.<br/>\n<br/>\n<br/>\n4. Campaign Setting<br/>\nThe campaign setting is set back on Arelith in past, when the land was cruel and savage, a hundred or so years before the original server. Fort Cordor has recently been established by the Cordor Family and is calling out for soldiers and adventurers to aid in the establishment of Arelith.<br/>\n<br/>\nThe civilized elves of Arelith are have been established in the sanctuary of Minmir valley, many years before the arrival of the chaotic human expansion, they are distant and elusive. Minir serves as an outpost off the western shore of Faerun. The outpost serves as a staging ground for travellers to and from Evermeet.<br/>\n<br/>\nArelith [FL] supports its own unique Underdark 'Udith Che' which is currently in the state of civil war as the noble houses battle for control. Almost all the nobles are drow, but not all. The city once used to be wholly Llothite but the temple of Ghaunaduar has established itself through conflict which has caused anarchy. But not all battles are won with the sword.<br/>\n<br/>\nArelith [FL] also caters the island of Siabyad a dangerous lawless desert island, players can travel to from the bitter coast by boat. Live in Sibayad and you'll learn to love or hate the desert, a very dangerous land to be sure, the dry heat will kill you if you don't have water but so will the creatures living there.<br/>\n<br/>\n<br/>\n5. FL Death System<br/>\nAll characters start with mandatory MoD. You get 10 PvP lives which means you can die as many times as you want PvE, but every PvP death you will loose a life. Death is serious on FL and characters will think twice before getting cut down by opponents blades, a very real danger that everyone dies eventually.<br/>\n<br/>\n<br/>\n6. Character Build System<br/>\nAll characters in the server start at level 9, and characters no longer need to take a minimum of 3 levels in each class as it offers more character customization due to the level 9 limit.<br/>\n<br/>\nYou no longer need to PRC tokens to take prestige classes, and the requirements of the prestige classes have been changed to allow full capabilities due to the level 9 limit.<br/>\n<br/>\nYou are to be reminded that this is a role-playing server, and you may need to justify a characters RP reasons and backgrounds as to why you believe they should be their chosen prestige build. If any players are caught abusing the prestige class system without an adequate role-playing reason you may be subject to DM authority.<br/>\n<br/>\nThere has been a slight adjustment to the standard PRC requirements to allow a flexible character build system due to the level 9 limit, the new requirements are listed below;<br/>\n<br/>\nArcane Archer: Elf/Half-Elf, BAB 3, Weapon Focus: Bow.<br/>\nAssassin: Hide 8, Move Silently 8, Evil.<br/>\nBlackguard: BAB 3, Evil.<br/>\nChampion of Torm: BAB 3, Non-Evil.<br/>\nRed Dragon Disciple: Sorcerer/Bard, Lore 8.<br/>\nDwarven Defender: Dwarf, BAB 3, Lawful.<br/>\nHarper Scout: Lore 4, Discipline 4, Non-Evil.<br/>\nPale Master: Spellcaster Level 3, Non-Good.<br/>\nShadowdancer: Hide 8, Move Silently 8, Tumble 5.<br/>\nShifter: Druid Level 3 Spells.<br/>\nWeapon Master: BAB 3, Dodge, Expertise, Weapon Focus.<br/>\n<br/>\n<br/>\n7. Character Progression System<br/>\nAll characters can now pay for 'training' with gold from the 'training npc' which will give you a selection of feats to pick from. Once you have selected the feat you wish, your system level will increase, after that every feat you buy it will cost more. This system also takes into account your ECL from any selected gifts.<br/>\n<br/>\nOnce your system level (SL) reaches 31 (epic standard) you will then be able to purchase epic feats, with the cost continuing to scale with your level. There is no limit to how many available feats you can buy and learn. Once you have purchased a feat from the 'training npc' you will also be granted an additional 1 crafting points. You can calculate your SL by reducing any ECL from Gifts taken at character creation from your total ECL, which is displayed when you speak to the NPC trainer.<br/>\n<br/>\nFeats that have been designed to stack can generally only be taken up to a maximum of four times. All feats still require their standard prerequisites except for the following adjustments;<br/>\n<br/>\nImproved Critical: AB 5.<br/>\nImproved Knockdown: AB 5.<br/>\nImproved Two-Weapon Fighting: AB 5.<br/>\nStunning Fist: AB 5.<br/>\nEvasion: All classes.<br/>\nUncanny Dodge I-VI: All classes.<br/>\nUncanny Reflex: Uncanny Dodge VI.<br/>\nImproved Evasion 18 Dexterity.<br/>\nArcane Defense Spellcraft Rank.<br/>\nRogue Feats: Rogue Level/SL 10.<br/>\nGain Skill Points: Any-Class.<br/>\nSpell Focus: Any-Class.<br/>\nWarlock Progression Feat: Warlock Level.<br/>\nBard Song Progression Feat: Bard Level.<br/>\nFavored Enemy: Ranger Level/Harper Scout Level.<br/>\nCreature Weapon Focus: Druid/Shifter Levels.<br/>\nWeapon Specialization: Fighter Level.<br/>\nBarbarian Rage IV-VII: Barbarian Level/SL 11/14/15/19.<br/>\nBarbarian DR I- IV: Barbarian Level/SL 10/13/16/19.<br/>\nWild Shape II-IV: Druid Level 5.<br/>\nElemental Shape I-III: Wild Shape IV, Druid Level/SL 15/16/18.<br/>\nDiamond Body: Monk Level/SL 10.<br/>\nDiamond Soul: Monk Level/SL 11.<br/>\nQuivering Palm: Monk Level/SL 14.<br/>\nPerfect Self: Monk Level/SL 19.<br/>\nQuicken Spell: Spell Circle 3.<br/>\nEpic Feats: SL 31.<br/>\nEpic Skill Focus: Skill Focus, SL 31.<br/>\nThundering Rage: 21 Strength, SL 31.<br/>\nOverwhelming Critical: 18 Strength, SL 31.<br/>\nPerfect Health: 20 Constitution, SL 31.<br/>\nGreater Smiting: 20 Charisma, SL 31.<br/>\nImproved Stunning Fist: 17 Strength, 17 Wisdom, SL 31.<br/>\nTerrifying Rage: Epic Skill Focus (Intimidate), SL 31.<br/>\nAutomatic Metamagic: Epic Skill Focus (Spellcraft), SL 31.<br/>\nSelf Concealment: 22 Dexterity, Epic Skill Focus (Hide), SL 31.<br/>\nLasting Inspiration: Epic Skill Focus (Perform), SL 31.<br/>\nEpic Fiendish Servant: Blackguard Level/SL 31.<br/>\nEpic Dodge: 23 Dexterity, Improved Evasion, Dodge, SL 31.<br/>\n<br/>\n<br/>\nPlayers are advised that this progression system has just been released and may still be missing feats, if you match the prerequisites and you cannot find the feat you desire, or the feat that you purchased does not work correctly, then you are to post feedback on the forum so this matter can be adjusted for all players.<br/>\n<br/>\n(Unconfirmed Feats or still in progress);<br/>\n<br/>\nBlinding Speed: ?<br/>\nPlanar Turning: ?<br/>\nImproved Combat Casting: ?<br/>\nImproved Whirlwind Attack: ?<br/>\nImproved Ki Strike 4: ?<br/>\nImproved Sneak Attack: ?<br/>\nMighty Rage: ?<br/>\nEpic Shadow Lord: ?<br/>\n<br/>\n<br/>\n8. Character Treasure and Loot System<br/>\nIn the Fixed Level Server we have implemented a new generous loot matrix with no level restrictions. Which means your level 9 character could wield the sword of a thousand truths if he desired, or just a simple damask blade.<br/>\n<br/>\nThe idea is that the system will implement rare unique items and equipment which wouldn't normally be available on the original server. This system brings a lot of potential to character development and progression.<br/>\n<br/>\nAllowing rare and unique discoveries to be made bringing another level of lore to the world. Trinkets to keep in your back pocket for emergencies, scrolls and tomes of magic which would normally be unavailable due to level restrictions and rare equipment with bonus feats and magical powers.<br/>\n<br/>\nThe trap and chest system has recently been adjusted and has had a new script added that randomly targets 25% of chests to be unlocked and a further 25% of chests will no longer require traps. Characters that do not have pick lock or disarm trap skills can now access an approximate 25% of chests without traps and locks. Equipment plays an important part of the progression system, it would be unfair to allow all 'scout' builds acquire all the rare and profitable equipment.<br/>\n<br/>\n<br/>\n9. Character Skill System<br/>\nIn the Fixed Level Server the use of skills points have been adjusted and increased, to promote the use of full build 'scout' classes such as rogues, assassins, and bards as they will now have a larger role to play beside 'warriors' and 'mages'.<br/>\n<br/>\nPersuade: Offers more gold which could increase the character development process.<br/>\nAppraise: Offers more gold which could increase the character development process.<br/>\nPick Pocket: Allows you to gain loot without having to fight, aids in character development.<br/>\nLock Pick: Chest DC's have been increased so that heavy rogue builds are essential for tough chests.<br/>\nSet Trap: Traps are stronger and useful due to the level limitations of the server.<br/>\n<br/>\n<br/>\n10. FL Crafting System<br/>\nCrafting skills<br/>\nOn FL, the crafting system has 5 skills.<br/>\n- Cooking - used for potions, kits and food. Potions will get a rework to make them actually worth crafting.<br/>\n- Forging - used for metal arms and armor (plus the odd fixture).<br/>\n- Tailoring - used for leather/cloth/hide armor, slings, belts/boots/cloaks etc<br/>\n- Handicrafting - used for anything made of wood or stone. Gems, longbows, staves etc.<br/>\n- Alchemy - used for rings and amulets, plus essence crafting.<br/>\n<br/>\nYour crafting skill is used both for making items of the types listed, and for improving them. An expert smith will find it easier (and cheaper) to improve swords, and will be able to improve them to be more powerful than a novice smith. An expert alchemist will be able to improve rings and amulets, and make essences to put on other weapons.<br/>\n<br/>\nMaterials<br/>\nEach piece of equipment now has a material property. The material determines three things.<br/>\n- Some (not all) materials offer a base bonus to items (e.g. iron armor has SR 10).<br/>\n- The material determines how easy it is to improve an item's physical properties.<br/>\n- The material determines how easy it is to improve an item's magical properties.<br/>\n<br/>\nSo for example, bronze is the basic metal for forging. A bronze sword has no base properties, and isn't particularly good for adding physical or magical properties. A silver sword has a base bonus vs shapechangers, is quite bad for adding mundane properties (it's a soft metal), but good for adding magical properties. Steel has no base properties, is very good for adding mundane properties (you can sharpen it well), but poor for adding magical properties (iron and steel are not friendly to magic). Mithril (spelt Mithral by the 1.69 patch writers, grr) makes the best equipment. Mithril items are lighter than normal, and take both mundane and magical improvements very well.<br/>\n<br/>\nItems with no Material property (i.e. everything in the current loot matrix) is treated as bronze/cotton, i.e. bad at taking both physical and magical improvements.<br/>\n<br/>\nImportant: How well a weapon/armor/accessory takes Magical enchantments also determines the chance of success when using an essence on them. The essence application will fail randomly on lower-grade items.<br/>\n<br/>\nProperties<br/>\nThe following properties are classed as 'mundane'. The difficulty of adding these to an item will be determined by how well the material takes mundane improvements.<br/>\n- AC bonus<br/>\n- Arcane spell failure<br/>\n- Attack bonus<br/>\n- Base item weight reduction<br/>\n- Enhancement bonus<br/>\n- Extra melee damage type<br/>\n- Extra ranged damage type<br/>\n- Keen<br/>\n- Massive Criticals<br/>\n- Mighty<br/>\n- Damage bonus (slashing/piercing/bludgeoning; other types are Magical)<br/>\n- Damage reduction (ditto)<br/>\n- Damage resistance (ditto)<br/>\n- Damage immunity (ditto)<br/>\n- AC vs damage type (ditto).<br/>\n<br/>\nNot all of these properties are available at present. All other properties (e.g. skill bonuses, damage bonus vs race/alignment, ability score bonuses) are classed as Magical properties.<br/>\n<br/>\nDifferent items take different properties. For example, only rings and amulets can add Ability Score bonuses.<br/>\n<br/>\nSpell focuses in Enchantment make it easier and cheaper to add Magical properties to items (i.e. they will not work on the list of mundane properties above but will work on all other properties).<br/>\n<br/>\nImproving items<br/>\nYou can improve items at any craft station, or at an enchantment basin (but enchantment basins will likely be removed in time). The Improve Item dialog is just like the old enchantment basin dialog, with one important difference - how costly it is to improve an item, how good an improvement you can make, and the chance of success all vary based on your craft skill (for the item type - so Tailoring for leather armor, Forging for metal armor etc etc), and the material and item property type (mundane vs magical).<br/>\n<br/>\nI hope that makes sense. It's a departure from what you're used to, but should help specialise characters a lot more - in particular there is no such thing as a pure enchanter now, but enchantment-focused PCs will be more effective at adding magical properties (especially useful for tailors and alchemists who work with accessory items).<br/>\n<br/>\nUsing Essences<br/>\nEssences now have a chance of failure upon being applied to a weapon or a armor dependent on the material you are attempting to apply it to.<br/>\n<br/>\nSuccess Rates:<br/>\nAnything without a material property, Wood, Cotton, Copper, Iron, Steel, Hide, Leather = 33%<br/>\nIronwood, Silver, Ankheg, Wool = 66%<br/>\nDuskwood, Gold, Mithril, Silk, Dragonhide = 100%<br/>\n<br/>\n<br/>\n11. Armor System<br/>\nArelith FL supports a new tactical melee system where warriors can wear heavy armor and gain large damage resistance bonuses for the exchange of AB. All armor in this new system will only grant the maximum base armor bonus of 3, (3 being the largest bonus you can get from light armor with a moderate dex limitation), this includes shields giving a maximum base shield bonus of 1.<br/>\n<br/>\nLight Armor<br/>\nClasses that wear light armor will receive small damage resistance bonuses from their armor, light users specialize in dodging and trying to avoid getting hit by using their dex bonus to improve their AC .. as opposed to heavy armor users that have large damage resistances and don't mind getting hit.<br/>\n<br/>\nMedium Armor<br/>\nClasses that wear medium armor will receive a moderate dex bonus to improve their AC and they will get better damage resistance than light armor, but their damage resistances will never be as good as heavy armor.<br/>\n<br/>\nHeavy Armor<br/>\nClasses that wear heavy armor receive a small dex bonus to improve their AC or nothing at all, but they receive very large damage resistances and are capable of withstanding damage over long periods of time. Full plated knights will be harder to damage than a rogue with leather armor.<br/>\n<br/>\nBlank Armor<br/>\nBlank armor without the universal resistances and AC penalty's can still be found within the module, these are items that may be carried by mobs, for the players that use heavy armor and would rather trade AC for damage resistances you can find blank items. Blank armor will never be considered greater than bronze for determining improvements in the crafting system, when improving it does not consider the existing damage resistant property on the item as opposed to a bronze item you have made.<br/>\n<br/>\n<br/>\nTactical Melee<br/>\nWe want to promote a real time tactical melee system giving melee that extra element in close combat, you will now have the opportunity to react to your opponents fighting style and try to exploit their weaknesses whether that's for offense or defense. In FL you can buy a vast array of feats without any limit so you can specialize in a large number of different weapons for all situations.<br/>\n<br/>\nLight Armor: 10% Slashing Resistant<br/>\nMedium Armor: 25% Slashing Resistant<br/>\nHeavy Armor: 50% Slashing Resistant<br/>\nHelmets: 25% Bludgeoning Resistant<br/>\nSmall Shields: 10% Piercing Resistant<br/>\nLarge Shields: 25% Piercing Resistant<br/>\nTower Shields: 50% Piercing Resistant<br/>\n<br/>\nHere's just a for examples for you; On your travels your turn around a corner and your confronted by archers raining arrows down upon you, you would want to grab your shield and run for cover or charge into battle. The archers are quick on their feet but don't wear heavy armor so you grab your swords and begin a whirlwind of slashes that would leave any opponent in pieces.<br/>\n<br/>\nYou notice your opponent rarely wears a helmet so you grab your hammer or heavy mace for maximum damage, or just punch them in the face with your fists, or you may get your sling and begin hailing bullets.<br/>\n<br/>\nYour opponent uses a two-handed weapon and no shield, so you grab your bow and begin raining arrows at a distance, you pull out your twin daggers or a spear and go in for maximum damage.<br/>\n<br/>\nYour opponent uses a shield so you know he would be slower on the offense, so you grab your two weapons and go in for a flurry of strikes to put them on your back foot. You may even decide to duel wield two different weapons with different damage types for different situations.<br/>\n<br/>\n<br/>\nArmor Universal Property<br/>\nThis is a list of universal property's for items you can expect to see. These are only the BASE properties which means if you use the crafting system you can add additional benefits to these items, including more AC.<br/>\n<br/>\nVestures - Max Base Armor 0, Max Dex Bonus 10, Slashing Resist 0<br/>\nPadded Armors - Max Base Armor 1, Max Dex Bonus 8, Slashing Resist 0<br/>\nLeather Armors - Max Base Armor 2, Max Dex Bonus 6, Slashing Resist 10%<br/>\nStudded Leather Armors - Max Base Armor 3, Max Dex Bonus 4, Slashing Resist 10%<br/>\nChain Mail (Bronze) - Max Base Armor 3, Max Dex Bonus 4, Slashing Resist 5%<br/>\nChain Mail (Iron) - Max Base Armor 3, Max Dex Bonus 4, Slashing Resist 10%<br/>\nChain Mail (Steel) - Max Base Armor 3, Max Dex Bonus 4, Slashing Resist 25%<br/>\nChain Mail (Silver) - Max Base Armor 3, Max Dex Bonus 4, Slashing Resist 10%<br/>\nChain Mail (Mithral) - Max Base Armor 3, Max Dex Bonus 4, Slashing Resist 25%<br/>\nHeavy Armor (Bronze) - Max Base Armor 3, Max Dex Bonus 1, Slashing Resist 10%<br/>\nHeavy Armor (Iron) - Max Base Armor 3, Max Dex Bonus 1, Slashing Resist 25%<br/>\nHeavy Armor (Steel) - Max Base Armor 3, Max Dex Bonus 1, Slashing Resist 50%<br/>\nHeavy Armor (Silver) - Max Base Armor 3, Max Dex Bonus 1, Slashing Resist 10%<br/>\nHeavy Armor(Mithral) - Max Base Armor 3, Max Dex Bonus 1, Slashing Resist 50%<br/>\nHelmets - Bludgeoning Resist 25%<br/>\nBracers - Bludgeoning Resist 10%<br/>\nSmall Shields - Max Base Armor 1, Piercing Resist 10%<br/>\nLarge Shields - Max Base Armor 1, Piercing Resist 25%<br/>\nTower Shields - Max Base Armor 1, Piercing Resist 50%<br/>\n<br/>\nAdditional Special Property<br/>\nIron Weapons - 1D8 vs. Fey, 1 Massive Critical<br/>\nIron Armor - 10 Spell Resistance<br/>\nSteel Weapons - 1D4 Massive Critical<br/>\nSilver Weapons - 1D8 vs. Shapechanger<br/>\nSilver Armor - 0% Arcane Spell Failure<br/>\nMithral Weapons - 1D4 Criticals, 10% Weight<br/>\nMithral Armor - 10% Weight<br/>\n<br/>\n<br/>\n12. 5% Epic Sacrifice<br/>\nFL Players can automatically enter the 5% Epic Sacrifice roll upon character deletion with chance to receive the standard rewards if you meet the following requirements. For more info see reference <a class=\"postlink\" href=\"http://wiki.arelith.com/5%25_roll\" rel=\"noreferrer\" target=\"_blank\">http://wiki.arelith.com/5%25_roll</a>.<br/>\n<br/>\nSystem Level 26-30 - 5% chance at a Minor award.<br/>\nSystem Level 31-35 - 5% chance at a Normal award and a 45% chance at a Minor award.<br/>\nSystem Level 36+ - 5% chance at a Major award, 45% Normal and 50% Minor.<br/>\n<br/>\n<br/>\n13. What's to come<br/>\n-Item matrix expansion<br/>\n-Cursed items.<br/>\n-Legendary items.<br/>\n<br/>\nLast Updated: 29 Nov 2012 \n</div></blockquote><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "SolidusMath",
      "avatar": "no_avatar.png",
      "timestamp": "5:47 AM - Dec 30, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for posting this.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "8:17 PM - Mar 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong><span style=\"font-size:150%;line-height:normal\"><span style=\"color:#FF0000\">Spell Changes:</span></span><br/>\n<br/>\n<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\">Groups of Spells</span></strong> <ul><li><strong>Death Armor, Elemental Shield</strong> and <strong>Acid Sheath</strong> do not stack; the last spell cast overrides the others.</li> <li>The spells <strong>Greater Magic Weapon, Magic Weapon, Holy Sword, Flame Weapon, Darkfire, and Keen weapon</strong> can not be stacked; the last spell cast overrides the other. Furthermore, these spells will not work on any weapon which has any magical properties at all (including weapons other than Bronze which have been created by <a class=\"postlink\" href=\"http://wiki.arelith.com/Crafting\" rel=\"noreferrer\" target=\"_blank\">crafting</a>). Note that <strong>Bless Weapon, Blackstaff and Blade Thirst</strong> may all be stacked with one another and any one of the above spells, and will work on any enchanted and/or crafted weapon, provided they fit the corresponding type (slashing, staff).</li> </ul><ul><li><strong>Darkfire</strong> and <strong>Flame weapon</strong> are capped so that the Caster Level cannot count as anything higher than 10.</li> </ul><ul><li><strong>Darkfire</strong> and <strong>Flame Weapon</strong> last turns/level. <strong>Greater Magic Weapon</strong> last hours/3 levels.</li> </ul><ul><li><strong>Bigby's Interposing Hand, Bigby's Forceful Hand, Bigby's Grasping Hand and Bigby's Crushing Hand</strong> all have a Reflex Save. Note that <strong>Bigby's Clenched Fist</strong> does not have a Reflex Save, since already has a Fortitude Save.</li> </ul><ul><li>All of the <strong>Planar Binding</strong> spells last 1 turn/caster level, except <strong>Lesser Planar Binding</strong>, which remains 1 hour/level.</li> </ul><ul><li><strong>Invisibility, Improved Invisibility and Invisibility Sphere</strong> last rounds/level. The Concealment element of <strong>Improved Invisibility</strong> remains unchanged.</li> </ul><ul><li><strong>Dismissal</strong> and <strong>Banishment</strong> block all summoning spells in the area where they were cast, for 30 and 60 seconds, respectively. Note that this excludes <strong>animated</strong> creatures.</li> </ul><ul><li>All spells casted from the <strong>Shadow Conjuration</strong> line will be considered illusion and use illusion focus for calculating the DC. The Summon Shadow details are <a class=\"postlink\" href=\"http://wiki.arelith.com/Summoning_Changes#Shadow_Conjuration\" rel=\"noreferrer\" target=\"_blank\">here</a>.</li> </ul><span style=\"font-size:120%;line-height:normal\">Persistent area spells</span>All persistent area spells, such as Cloud of Bewilderment and Stinking Cloud, do not stack with themselves. When the same spell is casted it will be replaced and refreshed. However: <ul><li>Different area spells may be stacked.</li> <li>Same spell by different caster stacks.</li> <li>The same spell may be casted away from 50% of the center of the AoE radius, allowing a section where they can overlap, and hit twice.</li> <li>Blade Barrier and Wall of Fire are not affected by these changes.</li> </ul> Fright, Fear and Fear AurasFear has branched in two different effects in Arelith. Some spells and abilities will apply the old vanilla effect (like <a class=\"postlink\" href=\"http://wiki.arelith.com/Barbarian\" rel=\"noreferrer\" target=\"_blank\">Barbarian</a>'s terrifying rage or the Fear spell), while others will incur some penalties on a failed save, here named Fright.Standard Fright Aura: <ul><li>-10 AB</li> <li>-10 Saving Throws</li> <li>-10 Skills</li> <li>-10 AC</li> <li>50% Spell Failure</li> </ul> Lesser Fright Aura: <ul><li>-1 AB per level difference</li> <li>-1 Saving Throws per level difference</li> <li>-1 Skill per level difference</li> <li>-1 AC per level difference</li> <li>5% Spell Failure per level difference</li> </ul> Usually coming from summons, the lesser auras act according to a level difference. The greater the difference, the greater the effect.Lesser Fright Aura penalties never exceed -10/50% (+10 levels and will never be below -2/10%).Fright cannot be self-removed by the same frightened character. Attempting to self-recover using spells like Remove Fear will not dispel the effect, but will leave the lingering increased save bonus against fear effects. Third-party characters using the spells will function as normal.<br/>\n<br/>\n<strong>Individual Spell Changes below organized by Class.</strong><br/>\n<span style=\"font-size:150%;line-height:normal\"> <br/>\n Mage (Wizard, Sorcerer)</span><br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Cantrips:</span><br/>\n<br/>\n<strong>Daze</strong>: Works against any creature with hit dice less than or equal to the caster's class level.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">First Circle:</span><br/>\n<strong>Grease</strong>: Affected by Persistent Area spells changes. Has no spell resistance check.<br/>\n<strong>Protection From alignment</strong>: Gives +5 Saving Throw Bonus vs Mind Affecting Spells and Spell Like Abilities, instead of full immunity.<br/>\n<strong>Magic Weapon</strong>: Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<strong>Shield</strong>: Protects against Lesser Missile Storm with Spell Focus: Abjuration, and Greater Missile Storm with Greater Spell Focus: Abjuration.<br/>\n<strong>Sleep</strong>: Works with any target with equal/lower level than caster's class level and affects (caster level + 1d4) hit dice worth of creatures. Empower Spell increases affected hit dice by 50%.<br/>\n<strong>Summon Creature I (to IX)</strong>: Will summon creature one tier higher with Greater Spell Focus: Conjuration.<br/>\n<br/>\n Second Circle:<br/>\n<strong>Cloud of Bewilderment</strong>: Affected by Persistent Area spell changes.<br/>\n<strong>Continual Flame</strong>: Lasts 24 hours.<br/>\n<strong>Darkness</strong>: Non-hostile spell (does not anger friendly NPCs).<br/>\n<strong>Death Armor</strong>: Replaces any other \"backlash\" armor spell.<br/>\n<strong>Flame Weapon</strong>: Lasts Turns/level. Damage caps at CL 10. Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<strong>Invisibility</strong>: Lasts Rounds/level.<br/>\n<strong>Knock</strong>: Cannot open doors, only containers.<br/>\n<strong>Lesser Dispel</strong>: Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Web</strong>: Affected by Persistent Area spell changes. No spell resistance check.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Third Circle:</span><br/>\n<strong>Dispel Magic</strong>: Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Find Traps</strong>: Reveals traps, does not disarm them.<br/>\n<strong>Greater Magic Weapon</strong>: Lasts Hours/3 levels. Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<strong>Gust of Winds</strong>: Opens doors.<br/>\n<strong>Invisibility Sphere</strong>: Lasts Rounds/level<br/>\n<strong>Keen Edge</strong>: Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<strong>Magic Circle Against Alignment</strong>: Grants +4 Deflection and +10 will against spells, against the chosen alignment.<br/>\n<strong>Stinking Cloud</strong>: Affected by Persistent Area spells changes. Has no spell resistance check.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Fourth Circle:</span><br/>\n<strong>Elemental Shield</strong>: Replaces any other \"backlash\" armor spell.<br/>\n<strong>Improved Invisibility</strong>: Invisibility lasts Rounds/level. Concealment effect is still Turns/level.<br/>\n<strong>Phantasmal Killer</strong>: Fears target for Rounds/level on failed will save. A target that fails their fortitude save still dies.<br/>\n<strong>Summon Shadow</strong>: Gains +1 AB, +1 AC, and +12 hit points per Illusion Focus.<br/>\n<strong>Shadow Conjuration: Mage armor</strong>: Does not stack with itself or other mage armors.<br/>\n<strong>Shadow Conjuration</strong>: Changed school to Illusion.<br/>\n<strong>Wall of Fire</strong>: Damage increased to 2d6 + 1 per caster level, with no saving throw. Deals double damage to undead.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Fifth Circle:</span><br/>\n<strong>Animate Dead</strong>: Is affected by the Undead Summoning changes.<br/>\n<strong>Bigby's Interposing Hand:</strong>: Has a reflex save.<br/>\n<strong>Cloudkill</strong>: Affected by Persistent Area spell changes. Has no spell resistance check. Deals 1d4+1 CON damage per round to all creatures in the area of effect (fortitude save for half).<br/>\n<strong>Dismissal</strong>: Also blocks all new summoning in the area for 30 seconds.<br/>\n<strong>Dominate Person</strong>: Duration changed to 2 Turns+Turns/3 levels. Additionally effects orcs, monstrous humanoid, goblinoid, and reptilian humanoids.<br/>\n<strong>Greater Shadow Conjuration</strong>: Changed School to Illusion.<br/>\n<strong>Lesser Planar Binding</strong>: Creatures are slightly stronger with each Conjuration Focus. Ignores Caster's Alignment.<br/>\n<strong>Mestil's Acid Sheath</strong>: Replaces any other \"backlash\" armor spell.<br/>\n<strong>Mind fog</strong>: Affected by Persistent Area spell changes. All creatures in the area of effect take a 2d6 will save penalty (will save for half) and are dazed for 1 round (will save negates).<br/>\n<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Sixth Circle:</span><br/>\n<strong>Acid Fog</strong>: Affected by Persistent Area spell changes. Applies a 75% movement speed penalty with no save and -2 to AB and damage rolls for all creatures within the area of effect. Has no spell resistance check.<br/>\n<strong>Bigby's Forceful Hand</strong>: Has a reflex save.<br/>\n<strong>Flesh to Stone</strong>: Duration changed to Turns/2 Levels.<br/>\n<strong>Greater Dispelling</strong>: Caps at level 20. Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Isaac's Greater Missile Storm</strong>: Cannot strike one target with more than ten missiles. This limits it to only producing ten missiles if only one viable target is present upon casting.<br/>\n<strong>Planar Binding</strong>: Creatures are slightly stronger with each Conjuration Focus. Ignores Caster's Alignment.<br/>\n<strong>Shades</strong>: Changed school to Illusion.<br/>\n<strong>True Seeing</strong>: Duration changed to Rounds/level.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Seventh Circle:</span><br/>\n<strong>Banishment</strong>: Also blocks all new summoning in the area for 60 seconds.<br/>\n<strong>Bigby's Grasping Hand</strong>: Has a reflex save.<br/>\n<strong>Mordenkainen's Sword</strong>: Duration increased to Turns/level.<br/>\n<strong>Prismatic Spray</strong>: Wild Mages roll twice for the effect table.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Eighth Circle:</span><br/>\n<strong>Blackstaff</strong>: Also works with magic staves and dire maces. Works with magic weapons and stacks with other weapon buff spells.<br/>\n<strong>Create Undead</strong>: Is affected by the Undead Summoning changes.<br/>\n<strong>Greater Planar Binding</strong>: Creatures are slightly stronger with each Conjuration Focus. Ignores Caster's Alignment.<br/>\n<strong>Greater Sanctuary</strong>: Lasts Rounds/4 levels and it has a cooldown timer of 240 seconds.<br/>\n<strong>Incendiary Cloud</strong>: Affected by Persistent Area spell changes. Damage increased to 4d6 + 1d6 per 2 levels (reflex save for half damage), and creatures within the area of effect are blinded (no save)<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Ninth Circle:</span><br/>\n<strong>Bigby's Crushing Hand</strong>: Has a reflex save.<br/>\n<strong>Black Blade of Disaster</strong>: Slightly rebalanced and empowered. Has permanent haste.<br/>\n<strong>Gate</strong>: May summon a Good, Neutral or Evil creature.<br/>\n<strong>Mordenkainen's Disjunction</strong>: Caps at level 20. Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Timestop</strong>: Only affects the area in which it is cast. Also has a cooldown timer 240 seconds.<br/>\n<strong>Weird</strong>: Fears targets for Rounds/level on a failed will save. Targets that fail their fortitude saves still die.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Epic Spells:</span><br/>\n<strong>Dragon knight</strong>: Power increases with each Conjuration foci. Duration is random between 30 to 70 turns. Good-aligned characters summon a silver dragon, neutral a prismatic, evil a red dragon. Characters with Palemaster levels summon a dracolich.<br/>\n<strong>Greater ruin</strong>: Power is increased with Epic Evocation Focus.<br/>\n<strong>Hellball</strong>: Power is increased with Epic Evocation Focus.<br/>\n<strong>Mummy dust</strong>: Enables last undead summoning tier. Works as any other undead summoning spell.<br/>\n<br/>\n<br/>\n  <br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Cleric</span><br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">First Circle:</span><br/>\n<strong>Bless</strong>: Changed to Rounds/level. For Healers it lasts Turns/level.<br/>\n<strong>Protection From alignment</strong>: Gives +5 Saving Throw Bonus vs Mind Affecting Spells and Spell Like Abilities, instead of full immunity.<br/>\n<strong>Magic Weapon</strong>: Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<strong>Summon Creature I (to IX)</strong>: Will summon creature one tier higher with Greater Spell Focus: Conjuration<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Second Circle:</span><br/>\n<strong>Darkness</strong>: Non-hostile spell (does not anger friendly NPCs).<br/>\n<strong>Find Traps</strong>: Reveals traps, does not disarm them.<br/>\n<strong>Lesser Dispel</strong>: Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Third Circle:</span><br/>\n<strong>Animate Dead</strong>: Is affected by the Undead Summoning changes.<br/>\n<strong>Continual Flame</strong>: Lasts 24 hours.<br/>\n<strong>Darkfire</strong>: Lasts Turns/level. Damage caps at CL 10. Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<strong>Dispel Magic</strong>: Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Magic Circle Against Alignment</strong>: Grants +4 Deflection and +10 will against spells, against the chosen alignment.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Fourth Circle:</span><br/>\n<strong>Dismissal</strong>: Also blocks all new summoning in the area for 30 seconds.<br/>\n<strong>Freedom of Movement</strong>: Doesn't protect from movement speed reduction effects, Slow and Web spells.<br/>\n<strong>Greater Magic Weapon</strong>: Lasts Hours/3 levels. Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Fifth Circle:</span><br/>\n<strong>Healing Circle</strong>: Level cap removed. Also, when casted it creates a stationary zone below the caster that heals all creatures within the area of effect each round for a period of three rounds, for a total of up to 3 * (1d8 + Caster Level) additional healing to all creatures that remain within the area of effect.<br/>\n<strong>Monstrous Regeneration</strong>: Duration changed to Turns/level. Does not stack with itself or Regenerate.<br/>\n<strong>True Seeing</strong>: Duration changed to Rounds/level.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Sixth Circle</span><br/>\n<strong>Banishment:</strong> Also blocks all new summoning in the area for 60 seconds.<br/>\n<strong>Create Undead</strong>: Is affected by the Undead Summoning changes.<br/>\n<strong>Greater Dispelling</strong>: Caps at level 20. Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Greater Sanctuary</strong>: Lasts Rounds/4 levels and it has a cooldown timer of 240 seconds.<br/>\n<strong>Harm</strong>: Deals 10 points of damage per caster level.<br/>\n<strong>Heal</strong>: Heals 100 + 5*CL. Capped at 200 at level 20.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Seventh Circle:</span><br/>\n<strong>Greater Restoration</strong>: Has 240 seconds of cooldown timer before it can be casted again.<br/>\n<strong>Regenerate</strong>: Duration changed to Turns/level. Does not stack with itself or Monstrous Regeneration.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Eighth Circle:</span><br/>\n<strong>Create Greater Undead</strong>: Is affected by the Undead Summoning changes.<br/>\n<strong>Mass Heal</strong>: Heals 150 + 5*CL . Capped at 300 at level 30.<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Ninth Circle:</span><br/>\n<strong>Gate</strong>: May summon a Good, Neutral or Evil creature.<br/>\n<br/>\n<br/>\n<strong><span style=\"color:#0000FF\">Continued in Next Post</span></strong><br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "8:42 PM - Mar 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><span style=\"font-size:120%;line-height:normal\"><span style=\"font-size:150%;line-height:normal\"><strong>Spell Changes Continued</strong></span></span><br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Druid</span><br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\">First Circle</span></strong><br/>\n<strong>Grease</strong>: Affected by Persistent Area spells changes. Has no spell resistance check.<br/>\n<strong>Entangle</strong>: Affected by Persistent Area spells changes.<br/>\n<strong>Sleep</strong>: Works with any target with equal/lower level than caster's class level and affects (caster level + 1d4) hit dice worth of creatures. Empower Spell increases affected hit dice by 50%.<br/>\n<strong>Summon Creature I (to IX)</strong>: Will summon creature one tier higher with Greater Spell Focus: Conjuration.<br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Second Circle</span></strong><br/>\n<br/>\n<strong>Lesser Dispel</strong>: Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Third Circle</span></strong><br/>\n<strong>Call Lightning</strong>: Damage dice are upgraded from d6s to d10s when the spell is cast outside during rain or thunderstorm.<br/>\n<strong>Greater Magic Fang</strong>: Continues to scale past level 14. (+6 6/+6 at 17, +7 7/+7 at 20...)<br/>\n<strong>Spike Growth</strong>: Affected by Persistent Area spells changes.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Fourth Circle</span></strong><br/>\n<strong>Dispel Magic</strong>: Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Freedom of Movement</strong>: Does not protect from movement speed reduction effects, Slow and Web spells.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Fifth Circle</span></strong><br/>\n<strong>Awaken</strong>: Also grants +1 deflection AC/3 levels.<br/>\n<strong>Monstrous Regeneration</strong>: Duration changed to Turns/level. Does not stack with itself or Regenerate.<br/>\n<strong>Vine Mine: Camouflage</strong>: Grants Hide in Plain Sight to all allies while they remain within the area of effect.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Sixth Circle</span></strong><br/>\n<strong>Greater Dispelling</strong>: Caps at level 20. Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Healing Circle</strong>: Level cap removed. Also, when casted it creates a stationary zone below the caster that heals all creatures within the area of effect each round for a period of three rounds, for a total of up to 3 * (1d8 + Caster Level) additional healing to all creatures that remain within the area of effect.<br/>\n<strong>Regenerate</strong>: Duration changed to Turns/level. Does not stack with itself or Monstrous Regeneration.<br/>\n<strong>Stonehold</strong>: Affected by Persistent Area spells changes.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Seventh Circle</span></strong><br/>\n<strong>Harm</strong>: Deals 10 points of damage per caster level.<br/>\n<strong>Heal</strong>: Heals 100 + 5*CL. Capped at 200 at level 20.<br/>\n<strong>True Seeing</strong>: Duration changed to Rounds/level.<br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\"><strong>Eighth Circle</strong></span><br/>\n<em><strong>No changes</strong></em><br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Ninth Circle</span></strong><br/>\n<strong>Mass Heal</strong>: Heals 150 + 5*CL . Capped at 300 at level 30.<br/>\n<br/>\n<br/>\n<strong><span style=\"font-size:150%;line-height:normal\">Bard</span><br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\">First Circle</span></strong><br/>\n<strong>Grease</strong>: Affected by Persistent Area spells changes. Has no spell resistance check.<br/>\n<strong>Lesser Dispel</strong>: Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Magic Weapon</strong>: Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<strong>Protection From alignment</strong>: Gives +5 Saving Throw Bonus vs Mind Affecting Spells and Spell Like Abilities, instead of full immunity.<br/>\n<strong>Sleep</strong>: Works with any target with equal/lower level than caster's class level and affects (caster level + 1d4) hit dice worth of creatures. Empower Spell increases affected hit dice by 50%.<br/>\n<strong>Summon Creature I (to VI)</strong>: Will summon creature one tier higher with Greater Spell Focus: Conjuration.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Second Circle</span></strong><br/>\n<strong>Cloud of Bewilderment</strong>: Affected by Persistent Area spell changes.<br/>\n<strong>Darkness</strong>: Non-hostile spell (does not anger friendly NPCs).<br/>\n<strong>Invisibility</strong>: Lasts Rounds/level.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Third Circle</span></strong><br/>\n<strong>Dispel Magic</strong>: Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Find Traps</strong>: Reveals traps, does not disarm them.<br/>\n<strong>Greater Magic Weapon</strong>: Lasts Hours/3 levels. Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<strong>Gust of Winds</strong>: Opens doors.<br/>\n<strong>Invisibility Sphere</strong>: Lasts Rounds/level<br/>\n<strong>Keen Edge</strong>: Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<strong>Magic Circle Against Alignment</strong>: Grants +4 Deflection and +10 will against spells, against the chosen alignment.<br/>\n<strong>Wounding Whispers</strong>: Replaces any other \"backlash\" armor spell.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Fourth Circle </span></strong><br/>\n<strong>Dismissal</strong>: Also blocks all new summoning in the area for 30 seconds.<br/>\n<strong>Dominate Person</strong>: Duration changed to 2 Turns+Turns/3 levels. Additionally effects orcs, monstrous humanoid, goblinoid, and reptilian humanoids.<br/>\n<strong>Improved Invisibility</strong>: Invisibility lasts Rounds/level. Concealment effect is still Turns/level.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Fifth Circle</span></strong><br/>\n<strong>Greater Dispelling</strong>: Caps at level 20. Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Healing Circle</strong>: Level cap removed. Also, when casted it creates a stationary zone below the caster that heals all creatures within the area of effect each round for a period of three rounds, for a total of up to 3 * (1d8 + Caster Level) additional healing to all creatures that remain within the area of effect.<br/>\n<strong>Mind fog</strong>: Affected by Persistent Area spell changes. All creatures in the area of effect take a 2d6 will save penalty (will save for half) and are dazed for 1 round (will save negates).<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Sixth Circle</span><br/>\n No changes<br/>\n<br/>\n<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Ranger </span><br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\">First Circle</span></strong><br/>\n<strong>Grease</strong>: Affected by Persistent Area spells changes. Has no spell resistance check.<br/>\n<strong>Entangle</strong>: Affected by Persistent Area spells changes.<br/>\n<strong>Summon Creature I (to IV)</strong>: Will summon creature one tier higher with Greater Spell Focus: Conjuration.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Second Circle</span></strong><br/>\n<strong>Sleep</strong>: Works with any target with equal/lower level than caster's class level and affects (caster level + 1d4) hit dice worth of creatures. Empower Spell increases affected hit dice by 50%<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Third Circle</span></strong><br/>\n<strong>Blade Thirst</strong>: Duration increased to 1 Turn / Level. Enhancement Bonus has been changed to 2 + 1 / 5 levels beyond the 11th (i.e. +2 at level 11, +3 at level 16, +4 at level 21, +5 at level 26). Additionally, the enchanted weapon gains an equivalent amount of Vampiric Regeneration. Can be applied to magic/enchanted weapons.<br/>\n<strong>Greater Magic Fang</strong>: Continues to scale past level 14. (+6 6/+6 at 17, +7 7/+7 at 20...)<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Fourth Circle</span></strong><br/>\n<strong>Freedom of Movement</strong>: Does not protect from movement speed reduction effects, Slow and Web spells<strong>.<br/>\n<br/>\n<br/>\n<br/>\n<span style=\"font-size:150%;line-height:normal\">Paladin</span><br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\">First Circle</span></strong><br/>\n<strong>Bless</strong>: Changed to Rounds/level.<br/>\n<strong>Bless Weapon</strong>: Can be applied to magic/enchanted weapons.<br/>\n<strong>Protection From alignment</strong>: Gives +5 Saving Throw Bonus vs Mind Affecting Spells and Spell Like Abilities, instead of full immunity.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Second Circle</span><br/>\n<br/>\n<span style=\"font-size:120%;line-height:normal\">Third Circle</span></strong><br/>\n<strong>Dispel Magic</strong>: Each Abjuration foci increases dispel's power by +2 over the cap.<br/>\n<strong>Greater Magic Weapon</strong>: Lasts Hours/3 levels. Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<strong>Magic Circle Against Alignment</strong>: Grants +4 Deflection and +10 will against spells, against the chosen alignment.<br/>\n<br/>\n<strong><span style=\"font-size:120%;line-height:normal\">Fourth Circle</span></strong><br/>\n<strong>Freedom of Movement</strong>: Does not protect from movement speed reduction effects, Slow and Web spells.<br/>\n<strong>Holy Sword</strong>: Replaces other weapon buff spells, does not work with enchanted weapons.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<span style=\"color:#FF0000\"><span style=\"font-size:150%;line-height:normal\"><strong>End of Spell changes by Class</strong></span></span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "9:31 PM - Mar 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><span style=\"color:#000000\">Kensai Path Available to Barb, Rogue, Fighter, Monk at character creation</span><br/>\n<br/>\n Positive effects <ul><li>A kensai has permanent Haste, meaning they have +4 AC, 50% bonus movement speed and one extra attack per round.</li> <li>Kensai have permanent Freedom of Movement - they are immune to movement-impairing effects.</li> <li>They receive +1 saves against spells each 5 character levels.</li> <li>The kensai receives +10 discipline. (counting towards the +50 skill cap)</li> </ul> Negative effects <ul><li>They are prevented from equipping any ranged weapons; however, they can use throwing weapons (darts, shurikens, throwing axes).</li> <li>They cannot use potions, nor read scrolls. Neither they can take levels in any class with a spellbook. This includes bard, cleric, druid, paladin, ranger, sorcerer and wizard.<ul><li>They can, however, be affected by other character's magic. So be it positively or negatively.</li> <li>They may use items flagged as \"<a class=\"postlink\" href=\"http://wiki.arelith.com/Misc_Changes#Mundane_Items\" rel=\"noreferrer\" target=\"_blank\">mundane</a>\". Some of these items are the Guaji Roots and the Powderkegs.</li> <li>They may use freely Raise Dead and Resurrection scrolls. Note that this is the only exception to magic.</li> <li>They may use any racial and spell-like ability feat, as the <a class=\"postlink\" href=\"http://wiki.arelith.com/Drow\" rel=\"noreferrer\" target=\"_blank\">drow</a> darkness, the <a class=\"postlink\" href=\"http://wiki.arelith.com/Gnoll\" rel=\"noreferrer\" target=\"_blank\">gnoll</a> warcry, or the <a class=\"postlink\" href=\"http://wiki.arelith.com/Blackguard\" rel=\"noreferrer\" target=\"_blank\">blackguard</a> bull's strength.</li> </ul></li></ul>\n<br/>\n<span style=\"color:#000000\"><strong>Arcane Archer</strong></span><br/>\n Ranger does not have to fulfill the NWN Requirement of arcane Spellcasting when multiclassing to Arcane Archer. Therefore any Ranger can take levels in the Arcane Archer class without taking any levels in the Wizard, Bard or Sorcerer classes. He must still fulfill all other requirements for the class.<br/>\n<br/>\n<br/>\n<span style=\"color:#000000\"><strong>Barbarian</strong></span><br/>\n Arelith Changes <ul><li>A barbarian has two paths possible to choose on character creation: Kensai and Tribesman.</li> <li>When sufficiently drunk (below 0% sobriety) the Barbarian gains a boost to his strength.</li> </ul> Barbarian Rage<br/>\n The Rage has the following changes: <ul><li>Gives the barbarian a -2 penalty to AC.</li> <li>Increases the barbarian's movement rate by 50%.</li> <li>Gives the barbarian a damage shield effect, hurting anyone who strikes the barbarian in melee. Damage is 3x rage level + con bonus.</li> <li>Applies damage to the barbarian's main hand weapon based on barbarian's rage level.</li> <li>Boosts will save by rage level + con bonus.</li> <li>Gives temp HP = 50% of maximum HP, scaled by barb levels / hit dice.</li> <li>Duration is changed to 2d4 + con mod rounds.</li> </ul> Rage level is equal to a character's barbarian level divided by four (rounded up), plus one. For instance, a level nine barbarian will have a rage level of three.Terrifying Rage, Thundering Rage, and Mighty Rage all increase Rage Level by one.Barbarians can Rage unlimited times per day, provided they do not attempt to Rage when the effects are still active. This includes the period after the benefits of Rage have ended and the negative effects (AC penalty) linger. The cooldown period lasts one turn after the rage ends.The damage bonus will only apply to melee weapons.<br/>\n<br/>\n The only exception for this are throwing axes, which will behave exactly as melee weapons.You are drunkThree kinds of beverages decreases your sobriety: ale, wine (different kinds but same effect) and spirits. Drinking these will decrease sobriety and rest meter. How much they decrease depends on the CON stat of the character. This covers all character and not only Barbarians <ul><li>When a character gets drunk their DEX is decreased. More drunk means larger decrease.</li> <li>getting a sobriety of -10,0% - 0,01 % means a DEX decrease of 2, is sobriety -20,0% - 10,1% the DEX decrease is 4 etc etc.</li> <li>For every tick in negative sobriety the Decrease stacks. for example having a sobriety at -15% for one tick would mean a DEX decrease of 8.</li> <li>Reaching -100 % sobriety means the character dies of alcohol poisoning.</li> </ul><strong>Only Barbarians get the following benefit:</strong> <ul><li>When reaching a negative sobriety, the barbarian gets a bonus of +2 to their STR. At next tick the bonus rises to +5</li> <li>The bonus is a soft bonus and counts toward the +12 cap</li> </ul> TIP: when a tick takes you from Drunk to Sober the barbarian drunk-benefit remains for the next tick but at a +3 (This happens wither your bonus was +2 or +5). This means a carefully drinking barbarian can keep themselves in a two tick routine where they have +2 and +5 to STR with only minor DEX penalties. Any change to any meter (rest, drink, rest) will remove bonus STR when the barbarian is sober.when drunk <ul><li>Character has chance of stopping current action and laugh - frequency seems to increase as Sobriety decreases. <strong>Laughing and falling will make you flatfooted</strong></li> <li>Very low sobriety means the character also start falling</li> <li>To stop the laughing emote the player can emote sitting and it should stop momentarily.</li> </ul> Tribesman<br/>\n<br/>\n Instead of the normal <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Barbarian_rage\" rel=\"noreferrer\" target=\"_blank\">barbarian rage ability</a> the tribesman gets the ability to summon a tribal warrior for each rage. Only two can be called upon at the same time. <ul><li>They act as henchmen, so a summoned creature can be conjured as well</li> <li>They share race, sex and armour design of the player character. The armour design is what the player character has equipped when using the rage ability.</li> <li>They share the Barbarian level (not character level) of the player character.</li> <li>They <strong>DON'T</strong> share racial abilities with the Player character and they <strong>DON'T</strong> share any enchantments the player character has on their armour.</li> </ul> The Tribal Warrior has the following Ability scores at level 1: 16 Strength, 15 Dexterity, 14 Constitution and 10 Intelligencce, Charisma and Wisdom. Level 1 feats are: Ambidexterity, All Armour proficiencies, Rage, Fast Movement, Improved Two-Weapon Fighting, Power Attack, Shield Proficiency, Two-Weapon Fighting, Uncanny Dodge 1, Weapon Focii: Battleaxe, Handaxe, weapon prof: Martial, Simple Weapon Spec: Battleaxe, Handaxe.<strong>Progression of Tribal Warriors</strong><br/>\n<br/>\n The Tribal Warrior receives +1 AC every even numbered level, +1 Str every fourth level, and a feat every third level, which changes in epic levels - in essence, it levels as a \"default\" Barbarian character, including several more peculiar feats. It receives Barbarian Damage Reduction and Uncanny Dodge feats as a default Barbarian.The Tribal Warrior receives Power Attack at level 3, Cleave at 6, Great Cleave at 9, Improved Critical Greataxe (possible oversight) at 12, Weapon Focus Greataxe (possible oversight) at 15, Dodge at 18, Toughness at 21, Epic Focus Greataxe &amp; Epic Toughness I at 24, Epic Toughness II at 27, Epic Toughness III at 28, and Overwhelming Critical Greataxe (possible oversight) at 30. <ul><li>It is unknown what kind of AC bonus it receives (though, it is not Armour AC bonus).</li> <li>The Tribal warrior seems to get all Barbarian feats as it progresses. It also increases the Discipline score.</li> <li>Will equip battleaxe and handaxe, no matter what race - there are no enchantments or other properties applied, it is for all intents and purposes a bronze battleaxe and handaxe.</li> <li>Through testing, a Tribal Warrior hit 510 HP at level 30, and included the full complement of Barbarian DR feats.</li> <li>Throughout testing, at least one in ten tribesmen were male and bodyless save for armour (despite being female), which is probably a bug associated with appearance copying. Also, a fat barbarian will summon thin tribesmen.</li> </ul>\n<span style=\"color:#000000\"><strong>Bard (Warlock, Optional Path)</strong></span><br/>\n Warlock Class AbilitiesA Warlock is similar to a Bard, with the following changes: <ul><li>Bard Song is disabled (note that Curse Song is useless without Bard Song)</li> <li>Bardic Knowledge is disabled</li> <li>Hit Die changed to d8 (8HP/lvl)</li> <li><a class=\"postlink\" href=\"http://wiki.arelith.com/Warlock#Warlock_Resilience\" rel=\"noreferrer\" target=\"_blank\">Warlock Resilience</a> (seen below)</li> <li>Arcane Spell Failure for Armor and Shields is reduced by 20%</li> <li>Warlocks may cast unlimited spells from a <a class=\"postlink\" href=\"http://wiki.arelith.com/Warlock#Warlock_Spell_List\" rel=\"noreferrer\" target=\"_blank\"> pre-selected list</a>, based on their pact (regardless of which spells are chosen at level up, only those from the Warlock spell list will be available)</li> <li>A Ranged Touch Attack must be made for any spell cast against a hostile opponent, and successful hits will inflict <a class=\"postlink\" href=\"http://wiki.arelith.com/Warlock#Eldritch_Blast\" rel=\"noreferrer\" target=\"_blank\"> Eldritch Blast</a> damage (Charm Person, Dominate Person, and Darkness will not inflict damage)</li> </ul> Warlock Eldritch Blast<br/>\n When a spell is cast directly on a hostile opponent, Eldritch Blast damage of (1d6 + 1) / 2 levels is dealt to the target, along with the spell effect. While an AoE spell may affect multiple opponents, Eldritch Blast damage is dealt only to the target of the spell. Spell Resistance checks are made separately for the base spell and Eldritch Blast damage, meaning that one may penetrate while the other is blocked.Using Eldritch Blast will cause the Warlock's eyes to glow. Spells may be cast on the ground to avoid making a Ranged Touch Attack and activating eye glow.The damage types listed below may be selected by using the -warlock console command.<table class=\"post_content_table\"><tbody><tr><td>1</td><td>Magic</td><td>Magic</td></tr><tr><td>4</td><td>Fire</td><td>Cold</td></tr><tr><td>8</td><td>Acid</td><td>Electrical</td></tr><tr><td>12</td><td>Negative</td><td>Positive</td></tr></tbody></table>Warlock Resilience<br/>\n As a Warlock advances in level, she or he becomes more resilient against attacks, gaining resistance to damage types which vary by pact.Warning: Elemental Damage Reduction from Warlock Resilience will not stack with Damage Reduction gained from the <a class=\"postlink\" href=\"http://wiki.arelith.com/Gifts#Gifts\" rel=\"noreferrer\" target=\"_blank\">Gift of Hardiness</a>.<table class=\"post_content_table\"><tbody><tr><td>10</td><td>Uncanny Dodge, 5/- DR vs Fire/Acid</td><td>Uncanny Dodge, 5/- DR vs Cold/Electrical</td></tr><tr><td>20</td><td>5/- DR vs Physical, 10/- DR vs Fire/Acid</td><td>5/- DR vs Physical, 10/- DR vs Cold/Electrical</td></tr><tr><td>30</td><td>10/- DR vs Physical, 15/- DR vs Fire/Acid</td><td>10/- DR vs Physical, 15/- DR vs Cold/Electrical</td></tr></tbody></table>\n Warlock Spell ListWarlocks may use the following spells with unlimited castings and no cooldown.<table class=\"post_content_table\"><tbody><tr><td>\n<br/>\n 1</td><td>Flare (0), Light (0)</td><td>Daze (0), Light (0)</td></tr><tr><td>2</td><td>Summon Creature (1), <a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Changes_to_Groups_of_spells\" rel=\"noreferrer\" target=\"_blank\">Lesser Dispel (1)</a></td><td>Sleep (1), Expeditious Retreat (1)</td></tr><tr><td>3</td><td>Balagarn's Iron Horn (1)</td><td>Mage Armor (1)</td></tr><tr><td>4</td><td>Bull's Strength (2)</td><td>Tasha's Hideous Laughter (2)</td></tr><tr><td>5</td><td>Resistance (0), Grease (1)</td><td>Cure Minor Wounds (0)</td></tr><tr><td>6</td><td>Protection from Alignment (1)</td><td>Charm Person (1)</td></tr><tr><td>7</td><td>Bestow Curse (3)</td><td>Displacement (3)</td></tr><tr><td>8</td><td>Summon Creature (2)</td><td>Hold Person (2)</td></tr><tr><td>9</td><td>Darkness (2)</td><td>Ghostly Visage (2)</td></tr><tr><td>10</td><td>Dismissal (4)</td><td>Hold Monster (4)</td></tr><tr><td>11</td><td>Ultravision (2), Gust of Wind (3)</td><td><a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Changes_to_Groups_of_spells\" rel=\"noreferrer\" target=\"_blank\">Invisibility (2)</a>, Cloud of Bewilderment (2)</td></tr><tr><td>12</td><td>Summon Creature (3)</td><td>Slow (3)</td></tr><tr><td>13</td><td>See Invisibility (2)</td><td>Mind Fog (5), Charm Monster (3)</td></tr><tr><td>14</td><td><a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Changes_to_Groups_of_spells\" rel=\"noreferrer\" target=\"_blank\">Dispel Magic (3)</a>, Eagles Splendor (2)</td><td><a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Changes_to_Groups_of_spells\" rel=\"noreferrer\" target=\"_blank\">Dispel Magic (3)</a>, Eagles Splendor (2)</td></tr><tr><td>15</td><td>Fear (3)</td><td>Haste (3)</td></tr><tr><td>16</td><td>Energy Buffer (6)</td><td>Energy Buffer (6)</td></tr><tr><td>17</td><td>Summon Creature (4)</td><td>Dominate Person (4)</td></tr><tr><td>18</td><td>Cat's Grace (2)</td><td><a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Changes_to_Groups_of_spells\" rel=\"noreferrer\" target=\"_blank\">Improved Invisibility (4)</a></td></tr><tr><td>19</td><td>War Cry (4)</td><td>Confusion (3)</td></tr><tr><td>20</td><td>Summon Creature (5)</td><td>Mass Haste (6)</td></tr><tr><td>22</td><td><a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Changes_to_Individual_Spells\" rel=\"noreferrer\" target=\"_blank\">Greater Dispelling (5)</a></td><td><a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Changes_to_Individual_Spells\" rel=\"noreferrer\" target=\"_blank\">Greater Dispelling (5)</a></td></tr><tr><td>25</td><td>Summon Creature (6)</td><td>Dirge (6)</td></tr><tr><td>28</td><td>Ice Storm (6)</td><td>Ethereal Visage (5)</td></tr></tbody></table>Fiendish/Abyssal Summons<strong> Final Summons Pit General Lord/ Balor Lord Respective.</strong><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>BlackGuard</strong><br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Summoning_Changes\" rel=\"noreferrer\" target=\"_blank\">Summoning Changes</a>: <ul><li>Summon Fiend:<ul><li>Infinite uses/day, but instead has a cooldown of 6 minutes starting the moment the fiend is slain or dismissed.</li> <li>Summon Fiend will <strong>conjure</strong> a demon for CE, a Yugoloth for NE, or a devil for LE.</li> <li>The summon starts at Tier 3. At level 7, increases to 4. At level 10, increases to 5. The feat Epic Fiendish Servant increases the tier to 6.</li> </ul></li><li>Create Undead<ul><li>Infinite uses/day, but instead has a cooldown of 6 minutes starting the moment the undead is slain or dismissed.</li> <li>The summon starts at Tier 1. At level 7, increases to 2. At level 11, increases to 3.</li> </ul></li></ul>\n<br/>\n<span style=\"color:#000000\"><strong>Cleric</strong></span><br/>\n Healer<br/>\n<br/>\n The Healer is an alternate path for clerics that can only be taken at character creation. Forgoing most of their gear options, these individuals excel at deifying death at every turn, ensuring the safety and survival of their allies against all odds. <ul><li>Healers lose all weapon and armor proficiencies, including racial proficienciies, but with the exception of Simple weapons. They <em>cannot</em> regain these lost proficiencies.</li> </ul><ul><li>The spell Bless lasts turns/level.</li> </ul><ul><li><em>Spontaneous Healing</em>: A Healer can cast Healing Circle, Heal, and Mass Heal spontaneously as if they were an innate caster (<a class=\"postlink\" href=\"http://wiki.arelith.com/Sorcerer\" rel=\"noreferrer\" target=\"_blank\">sorcerer</a>, <a class=\"postlink\" href=\"http://wiki.arelith.com/Bard\" rel=\"noreferrer\" target=\"_blank\">bard</a>). Consumes 5th level, 6th level, and 8th level spell slots respectively. These spells will appear under special abilities on the radial menu.</li> </ul><ul><li><em>Overhealing</em>: Healers convert excess healing into temporary hit points. The hit point bonus is limited to 5/ Healer level, and lasts for a period of three rounds. <em>A Healer level 13 can overheal for up to 65 points</em>. The duration is refreshed on further applications of Overhealing.</li> </ul><ul><li>Regenerate refreshes and stacks the overheal hit point bonus, while Monstrous Regeneration doesn't.</li> </ul><ul><li><em>Lifeline</em>: Healers can cast Raise Dead or Resurrection on a living target to apply a Lifeline to that target for the duration of 1 turn. If the affected creature reaches -10 hitpoints during the effect, they fall to the ground unconscious instead of dying, and are raised or resurrected a round later.<ul><li>Other creatures can only benefit from Lifeline once per rest. Note that this is the creature's rest, not the cleric's.</li> <li>Bear in mind that the Healers cannot use Lifeline on themselves.</li> <li>This ability only works with other PCs; not summons, companions, mobs or NPCs of any sort.</li> </ul></li></ul><ul><li><em>Expanded Healing</em>: The Healer's radius of area healing spells (Healing Circle, Mass Healing) grows slightly with their levels. A level 30 Healer will have the spell's area effectively doubled.</li> </ul><ul><li><em>Respite</em>: At level 28, a pure healers gains access to the epic <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-respite\" rel=\"noreferrer\" target=\"_blank\">-respite</a> spell. Respite creates a 4.0m area of effect on the ground that lasts for 9 seconds. All creatures (including enemies) within the area of effect become immune to all forms of crowd control (except Timestop) and cannot be reduced to less than one hit point. On expiration of the zone, all allies within the area of effect are healed for 150 hit points.</li> </ul> Note that these abilities will only work through casted spells; not spells from items.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<span style=\"color:#000000\"><strong>Druid<br/>\n Totem Druid</strong></span><br/>\n Wildshape stats for totem druidsNB: All uses of Wildshape (for any of the standard animals) will instead result in shifting into your totem form, with the following stats.<table class=\"post_content_table\"><tbody><tr><td><strong>Druid level</strong></td><td><strong>Str</strong></td><td><strong>Dex</strong></td><td><strong>Con</strong></td><td><strong>AC bonus</strong></td><td><strong>Temp HP</strong></td></tr><tr><td>5-7</td><td>18</td><td>18</td><td>18</td><td>2</td><td>10</td></tr><tr><td>8-9</td><td>20</td><td>20</td><td>20</td><td>4</td><td>20</td></tr><tr><td>10-11</td><td>22</td><td>22</td><td>22</td><td>6</td><td>30</td></tr><tr><td>12-13</td><td>24</td><td>24</td><td>24</td><td>8</td><td>40</td></tr><tr><td>14-15</td><td>26</td><td>26</td><td>26</td><td>10</td><td>50</td></tr><tr><td>16-17</td><td>28</td><td>28</td><td>28</td><td>12</td><td>60</td></tr><tr><td>18-19</td><td>30</td><td>30</td><td>30</td><td>14</td><td>70</td></tr><tr><td>20-21</td><td>32</td><td>32</td><td>32</td><td>16</td><td>?</td></tr><tr><td>22-23</td><td>34</td><td>34</td><td>34</td><td>18</td><td>?</td></tr><tr><td>24-25</td><td>36</td><td>36</td><td>36</td><td>20</td><td>?</td></tr><tr><td>26+</td><td>38</td><td>38</td><td>38</td><td>22</td><td>?</td></tr></tbody></table> <br/>\n Available totem animalsNB: All boons correct at time of writing. Boons may be changed at any time at the discretion of the development team. <ul><li>Wolf (predator): +2 str, +2 dex, +2 spot, +2 hide, +2 move silently</li> <li>Panther (sneak): +4 dex, +4 hide, +4 move silently</li> <li>Spider (cunning): +2 int, immunity: poison, immunity: paralysis</li> <li>Parrot (beauty): +4 cha, +8 bluff</li> <li>Eagle (nobility): +2 cha, +12 spot</li> <li>Bear (brawn): +4 str, +4 con</li> <li>Raven (lore): +2 int, +8 listen, +10 lore</li> <li>Bat (mystery): True Seeing</li> <li>Rat (creativity): +4 int, immunity: disease</li> <li>Snake (grace): +2 dex, +2 cha, immunity: disease, immunity: poison</li> </ul> While mental stat bonuses (wisdom, intelligence, charisma) are 'hard' bonuses, physical stat bonuses (strength, dexterity, constitution) are applied as 'soft' bonuses, which means <ul><li>they apply when wildshaped as well as in human/elf/etc form</li> <li>they count toward the +12 cap</li> <li>they do not count toward feat requirements.</li> </ul> Mechanical notes <ul><li>Using -polymorph will start a 90 seconds cooldown timer before being available again. Take note that the polymorph can be reverted normally without the need to use -polymorph to undo it.</li> <li>Due to the models used, polymorphed characters will move slightly slower than usual.</li> <li>A polymorphed character doesn't have a creature weapon; it attacks unarmed. This also means that they will benefit from all unarmed feats, such as Stunning Fist, and monk UBAB. While they are polymorphed, they gain the feat Improved Unarmed Attack, so this means they never cause Attacks of Opportunity when attacking at melee.</li> <li>The AC granted by the polymorph is Dodge. Dodge AC will not be retained if the character is caught flatfooted, and will cap at 20. The extra Dodge AC granted by a level 26+ form will not be used unless the Dodge AC of the character is lowered, by means such as Curse Song.</li> <li>A character that leaves the polymorph in a critical amount of health will not die by constitution reduction, but remain in 1 HP.</li> <li>You may still make use of active feats and talents while polymorphed, such as Taunt, Power Attack, Epic Spells, and spell-like abilities, such as Haste from Blinding Speed.</li> </ul>\n<br/>\n<span style=\"color:#000000\"><strong>Dwarven  Defender</strong></span><br/>\n<br/>\n A Dwarven Defender may use Defensive Stance up to 7 times per rest.<br/>\n<br/>\n<br/>\n<br/>\n<span style=\"color:#000000\"><strong>Fighter</strong></span><br/>\n<br/>\n Arelith Changes <ul><li>+1 Discipline each 3 levels.</li> <li>+1 <em>Strength</em> OR <em>Dexterity</em> each 10 levels.</li> </ul> The stat bonus is <em>Strength</em> unless the base <em>Dexterity</em> is larger than the other. <ul><li>Armor AC Bonus (+1 at 5, +2 at 25, +3 at 30)</li> <li>Shield AC Bonus (+1 at 10, +2 at 25, +3 at 30)</li> <li>Helmet AC Bonus (Deflection) (+1 at 15, +2 at 25, +3 at 30)</li> <li>Weapon Attack Bonus (+1 at 23, +2 at 25, +3 at 30)</li> <li>Weapon Damage Bonus (+1 at 23, +2 at 25, +3 at 30)</li> </ul> All the AC, Attack and Damage bonus <strong>stacks</strong> with equipment.This means, that a level 25 fighter (+2 AB) using a Masterly Damask weapon (+3) would have a total bonus of +5 AB, and thus pierce most damage reduction effects.See also: The <a class=\"postlink\" href=\"http://wiki.arelith.com/Forging#Weapons\" rel=\"noreferrer\" target=\"_blank\">Weapons Table</a> and the <a class=\"postlink\" href=\"http://wiki.arelith.com/Forging#Armour\" rel=\"noreferrer\" target=\"_blank\">Armors Table</a>.<table class=\"post_content_table\"><tbody><tr><td>5</td><td>+1</td><td>+0</td><td>+0</td><td>+0</td><td>+0</td><td>+1</td><td>+0</td></tr><tr><td>10</td><td>+1</td><td>+1</td><td>+0</td><td>+0</td><td>+0</td><td>+3</td><td>+1</td></tr><tr><td>15</td><td>+1</td><td>+1</td><td>+1</td><td>+0</td><td>+0</td><td>+5</td><td>+1</td></tr><tr><td>20</td><td>+1</td><td>+1</td><td>+1</td><td>+0</td><td>+0</td><td>+6</td><td>+2</td></tr><tr><td>25</td><td>+2</td><td>+2</td><td>+2</td><td>+2</td><td>+2</td><td>+8</td><td>+2</td></tr><tr><td>30</td><td>+3</td><td>+3</td><td>+3</td><td>+3</td><td>+3</td><td>+10</td><td>+3</td></tr></tbody></table>Mechanical Notes<br/>\n<br/>\n Characters no longer need Fighter levels to reduce the movement speed penalty; the penalty was completely removed from Arelith.<br/>\n<br/>\n The STR/DEX bonus is soft; it will count toward the +12 magical cap.Note that the AB/Damage/AC item stacking of the fighter is exclusive of the fighter's abilities, and there's no other way to stack them.<br/>\n<br/>\n A shield, helmet and armor/clothing must be equipped in order to receive the respective AC bonus, and a weapon for the AB and damage bonus - unarmed attacks will not benefit.<br/>\n<br/>\n The AC bonus for the helmet is Deflection, a source of AC that may also be found in rings and other even less common sources.<br/>\n<br/>\n The Fighter bonus AC will only stack with the helmet's AC; not rings or else. You will use whichever Deflection is higher; Helmet+Fighter Bonus <strong>or</strong> Ring/Weapon/Spells.<br/>\n<br/>\n<br/>\n<span style=\"color:#000000\"><strong>Harper Scout</strong></span><br/>\n Arelith Changes<br/>\n<br/>\n There are five sub-classes of Harper Scout. You can choose one of the non-basic ones by speaking with the secret Harper NPC trainer.Harper Scouts can vote in every election, even in places where they are not a citizen. The other Harper classes get this ability as well, but only with a full 5 levels in the class. However, no Harper (nobody with the Prestige Class permission token) may stand for election as a settlement leader. If the Harpers wish to rule directly, they will need an ally to stand in their place.Harpers examining characters will get feedback if the person they are looking at also carries a Harper Pin (the Prestige Class token)<br/>\n<br/>\n .Harper Scout<br/>\n This is the default Harper. Changes as follows. <ul><li><a class=\"postlink\" href=\"http://wiki.arelith.com/Console_commands#-track\" rel=\"noreferrer\" target=\"_blank\">Tracks</a> - By using the \"<a class=\"postlink\" href=\"http://wiki.arelith.com/Console_commands#-track\" rel=\"noreferrer\" target=\"_blank\">-tracks</a>\" command, a harper can detect enemies in the area, and assess the <a class=\"postlink\" href=\"http://wiki.arelith.com/Balance\" rel=\"noreferrer\" target=\"_blank\">balance</a> of a NPC population.</li> <li>No Tymora's Smile, Sleep or Invisibility</li> <li>Get +1 caster level (for all spells) at levels 1, 3 and 5.</li> <li>Gain Skill Focus: Bluff at level 2.</li> <li>Gain Lucky and Luck of Heroes at level 3.</li> <li>Gain Epic Skill Focus: Bluff at level 4.</li> <li>The Create Harper Item feat now gives you a Potion of Invisibility with the Cat's Grace potion, and a Potion of Attunement with the Eagle's Splendor potion.</li> </ul> Harper Mage<br/>\n<br/>\n The Harper Mage loses all Scout bonuses except for the bonus feats and Harper Knowledge at level 1. Instead: <ul><li>Harper Mages add their class level to their caster level for all arcane spellcasting.</li> <li>Skill Focus: Spellcraft at level 2.</li> <li>Auto Quicken Spell I at level 3.</li> <li>Eschew Materials at level 5. This means that the Harper Mage no longer needs spell components.</li> </ul> Harper Priest<br/>\n The Harper Priest loses all Scout bonuses except for the bonus feats and Harper Knowledge at level 1. Instead: <ul><li>Harper Priests add their class level to their caster level for all divine spellcasting, and for Turn Undead purposes.</li> <li>Additional +3 effective levels for Turn Undead purposes at level 2.</li> <li>Reduce armor speed penalties by 10% at level 3. This does not stack with the Fighter class bonus.</li> <li>At level 5, the Harper Priest gets all aspect boons (their deity counts as having all six Aspects for all purposes except participating in rituals).</li> </ul> Harper Paragon<br/>\n The Harper Paragon loses all Scout bonuses except for the bonus feats. Instead: <ul><li>Harper Paragons add their full Harper level to their caster level for all spellcasting.</li> <li>Can use Detect Evil from level 1.</li> <li>Divine Grace at level 3.</li> <li>Turn Undead and Divine Shield at level 4.</li> <li>Divine Might at level 5.</li> </ul> Master Harper<br/>\n The Master Harper loses all Scout bonuses except for the bonus feats and Harper Knowledge at level 1. Instead: <ul><li>Master Harpers add their full class level to their Bard level for determining the effect of Bardsong.</li> <li>At level 2, their (normal) bardsong acts as a cure for lycanthropy for all who are affected by their song.</li> <li>Skill Focus: Lore at level 3.</li> <li>Epic Skill Focus: Lore at level 4.</li> <li>Can use Bardsong (and curse song etc) unlimited times per day at level 5.</li> </ul>\n<span style=\"color:#000000\"><strong>Monk</strong></span> <ul><li>The <a class=\"postlink\" href=\"http://wiki.arelith.com/Misc_Changes#Weapon_Changes\" rel=\"noreferrer\" target=\"_blank\">Quarterstaff</a> and Shuriken benefit from Monk Unarmed Base Attack Bonus (Extra Attacks)</li> </ul> Note: The quarterstaff also benefits from <a class=\"postlink\" href=\"http://wiki.arelith.com/Feat_changes\" rel=\"noreferrer\" target=\"_blank\">Weapon Finesse</a><br/>\n<br/>\n<span style=\"color:#000000\"><strong>Paladin<br/>\n Gets a *detect Evil* command to detect evil alignment characters. ..Bout it save spell changes<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n Ranger</strong></span><br/>\n Below, a complete list of the class features. Text in <em>italic</em> are vanilla NWN abilities. The rest are Arelith's additions to the class. <ul><li>At level 1, <em>gain Dual-Wield feat, Trackless Steps feat, ranger bonus feat (favored enemy).</em></li> <li>At level 5, <em>ranger bonus feat (favored enemy).</em></li> <li>At level 6, <em>acquire Animal Companion,</em> and they gain +1 Dodge AC when they are dual wielding. Does not apply to double-sided weapons.</li> <li>At level 7, Woodland Stride feat.</li> <li>At level 9, <em>gain Improved Two-Weapon Fighting feat</em>, and gain Evasion feat.</li> <li>At level 10, <em>ranger bonus feat (favored enemy).</em></li> <li>At level 14, their dual-wield Dodge AC increases to +2.</li> <li>At level 15, <em>ranger bonus feat (favored enemy)</em></li> <li>At level 20, <em>ranger bonus feat (favored enemy)</em></li> <li>At level 21, they gain Hide in Plain Sight in \"natural\" areas.</li> <li>Skillpoints per level increased to 6.<ul><li>They gain the skillpoints <strong>after</strong> taking the level, so they get to actually use the extra 2 that they get the next level. This is due to a mechanical limitation of the engine.</li> </ul></li></ul><em>Epic rangers receive a bonus feat every 3 and 5 levels afterwards.</em> <ul><li>Rangers count toward one of the required classes to become <a class=\"postlink\" href=\"http://wiki.arelith.com/Arcane_archer\" rel=\"noreferrer\" target=\"_blank\">Arcane archers</a>. They still need to fill the other requirements (feats and race).</li> <li>Characters with at least 3/4 of their character levels as Ranger will turn animals into Companions when successfully using the Animal Empathy skill. This allows a Ranger to have up to three followers (2 Companions and 1 Summon/Empathy Animal). Companions will not be released upon rest, but normal Empathy animals still will be.</li> <li>Can also use the <a class=\"postlink\" href=\"http://wiki.arelith.com/Misc_Changes#Fire_and_Ice_Berries\" rel=\"noreferrer\" target=\"_blank\">Flame and Ice berries</a>.</li> <li><a class=\"postlink\" href=\"http://wiki.arelith.com/Console_commands#-track\" rel=\"noreferrer\" target=\"_blank\">Tracks</a> - By using the \"<a class=\"postlink\" href=\"http://wiki.arelith.com/Console_commands#-track\" rel=\"noreferrer\" target=\"_blank\">-tracks</a>\" command, a ranger can detect enemies in the area, and assess the <a class=\"postlink\" href=\"http://wiki.arelith.com/Balance\" rel=\"noreferrer\" target=\"_blank\">balance</a> of a NPC population.</li> <li>A ranger can also use tracks (footprints) near area transitions in natural areas to determine certain details about PCs who have recently traveled through.</li> <li><a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes\" rel=\"noreferrer\" target=\"_blank\">Spell changes</a>, or <a class=\"postlink\" href=\"http://wiki.arelith.com/Class_Spell_Changes#Ranger\" rel=\"noreferrer\" target=\"_blank\">Organized Spell Changes</a>.</li> <li>Must have natural deity to receive full access to their spells.</li> <li>Bonus <a class=\"postlink\" href=\"http://wiki.arelith.com/Languages\" rel=\"noreferrer\" target=\"_blank\">Language</a>: <a class=\"postlink\" href=\"http://wiki.arelith.com/Animal_language\" rel=\"noreferrer\" target=\"_blank\">Animal Language</a></li> </ul><strong>Animal Companion</strong> <ul><li>They have maximized hit points and skill ranks for all known skills</li> <li>Epic level animal companions now gain the Epic Skill Focus: Discipline feat</li> <li>Animal companions with the Weapon Finesse feat are now granted +1 dexterity each 3 levels and +1 damage each 6 levels</li> <li>Animal companions that do <strong>not</strong> have the Weapon Finesse feat are now granted +1 strength / 3 levels and +1 AC / 6 levels</li> </ul> Archer<br/>\n Rangers on Arelith can choose the Archer path. Such rangers lose the feats Dual-wield and Improved Two-Weapon Fighting, but can craft a bundle of iron arrows at ranger level 1, a bundle of steel arrows at ranger level 5, and a bundle of damask arrows at ranger level 10.Instead of the AC bonus at level 6, they gain +1 of damage to ranged attacks. At 14, they gain +3. This damage can not be reduced.<br/>\n<br/>\n Sniper<br/>\n<br/>\n The Sniper path is an alternate archer path for rangers.<br/>\n<br/>\n Snipers lose the dual wield feats but get point blank shot and rapid shot at level 1 and called shot at level 9.Instead of the AC bonus at level 6, they gain +1 of damage to ranged attacks. At 14, they gain +3. This damage can not be reduced.<br/>\n<br/>\n Totem Ranger<br/>\n While not strictly a path, rangers have their own version of the <a class=\"postlink\" href=\"http://wiki.arelith.com/Druid#Totem_animal\" rel=\"noreferrer\" target=\"_blank\">totem-pact of the druids</a>. Finding the same NPCs as the druids, they can take on a favored animal to bind themselves, but they will not receive any of the mechanical bonuses or penalties, nor will they be able to use the -polymorph command. The only change that they will experience is that (nearly) all their summons will take the form of their totem animal.A ranger that later multiclasses as druid will be able to <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-polymorph\" rel=\"noreferrer\" target=\"_blank\">-polymorph</a>, but will never receive any of the other bonuses or penalties. Also, the -polymorph will only use the druid levels for determining the power of the shape, ignoring the ranger levels.The bargain is permanent. Once taken, it cannot be undone or changed.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<span style=\"color:#000000\"><strong>Shadowdancer</strong></span><br/>\n<br/>\n Arelith Changes <ul><li>Their Shadow Evade now lasts 3 rounds per class level.</li> <li>A +1 bonus to Hide is given with each SD level taken.</li> <li>Hide in Plain Sight feat (HiPS) will be granted at SD level 5 instead of 1.<ul><li>After leaving stealth mode, HIPS will have 2 rounds of cooldown before it can be used again. Note that other ways of sneaking, such as corner-sneaking, still work while the cooldown is in effect.</li> </ul></li></ul><ul><li>Summon Shadow:<ul><li>Infinite uses/day, but instead has a cooldown of 3 minutes starting the moment the shadow is slain or dismissed.</li> <li>The Shadowdancer gains a d6 of improved sneak attack (feat) per three levels of the Shadow when standing near it.</li> <li>Can use the <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-associate_.2F_-a_.2F_-f\" rel=\"noreferrer\" target=\"_blank\">-a command</a> and the <a class=\"postlink\" href=\"http://wiki.arelith.com/Feat_changes#Player_Tool_1\" rel=\"noreferrer\" target=\"_blank\">Player Tool 1</a>.</li> <li>Shadows auto<a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-guard\" rel=\"noreferrer\" target=\"_blank\">-guard</a> the Shadowdancer. This behavior can be toggled by talking to the shadow.</li> <li>The shadow mirrors the Shadowdancer in several ways:<ul><li>They copy the <strong>final</strong> physical stats, not the base.</li> <li>They mirror the weapon, but theirs have the \"no damage\" property, and they cannot use shields or ranged weapons.</li> <li>If the Shadowdancer has the epic shadowlord feat, the shadows copies the names, description, portrait, and soundset of the shadowdancer.</li> <li>They copy Weapon Finesse and all Dual Wield feats, if the shadowdacer has them.</li> </ul></li><li>Shadows Feats: Blind Fight, Crippling Strike, Sneak Attack (+1d6).</li> <li>Shadows gain the Hide in Plain Sight feat if the master has at least 5 Shadowdancer levels.</li> <li>Shadow Skills: Discipline Hide, Move Silently, Listen, Spot.</li> <li>Shadow Properties: DR 5/+1, 55% Concealment + 1% / Shadowdancer Level, Undead Immunities.</li> <li>Shadows level up to 5 + Shadowdancer Class Level using the Outsider class</li> <li>The Epic Shadow Lord feat grants the Shadow +5% Concealment, +5 Hit Dice</li> </ul></li></ul>\n<span style=\"color:#000000\"><strong>Sorcerer</strong></span><br/>\n Path of the True Flame<br/>\n<br/>\n The Path of the True Flame can be chosen at character creation by sorcerers. Followers of the Path of the True Flame get unlimited spells per day, but can cast only evocation spells. This limitation includes spells cast from scrolls, wands, and items like potions; <a class=\"postlink\" href=\"http://wiki.arelith.com/Misc_Changes#Mundane_Items\" rel=\"noreferrer\" target=\"_blank\">Mundane items</a>, however, are the exception to the rule. Epic spells must also only be Evocation (this means Greater ruin and Hellball) however they can only be cast once per rest as per normal.List of available spells:<table class=\"post_content_table\"><tbody><tr><td>Cantrip</td><td>Electric Jolt<br/>\n Flare<br/>\n Light</td></tr><tr><td>1th circle</td><td>Horizikaul's Boom<br/>\n Ice Dagger<br/>\n Magic Missile<br/>\n Shelgarn's Persistent Blade</td></tr><tr><td>2nd circle</td><td>Cloud of Bewilderment<br/>\n Combust<br/>\n Darkness<br/>\n Flame Weapon<br/>\n Gedlee's Electric Loop<br/>\n Sound Burst</td></tr><tr><td>3rd circle</td><td>Fireball<br/>\n Gust of Wind<br/>\n Lightning Bolt<br/>\n Scintillating Sphere</td></tr><tr><td>4th circle</td><td>Elemental Shield<br/>\n Ice Storm<br/>\n Isaac's Lesser Missile Storm<br/>\n Wall of Fire</td></tr><tr><td>5th circle</td><td>Ball Lightning<br/>\n Bigby's Interposing Hand<br/>\n Cone of Cold<br/>\n Firebrand</td></tr><tr><td>6th circle</td><td>Bigby's Forceful Hand<br/>\n Chain Lightning<br/>\n Isaac's Greater Missile Storm</td></tr><tr><td>7th circle</td><td>Bigby's Grasping Hand<br/>\n Delayed Blast Fireball<br/>\n Great Thunderclap<br/>\n Prismatic Spray</td></tr><tr><td>8th circle</td><td>Bigby's Clenched Fist<br/>\n Incendiary Cloud<br/>\n Sunburst</td></tr><tr><td>9th circle</td><td>Bigby's Crushing Hand<br/>\n Meteor Swarm</td></tr><tr><td>Epic Spell</td><td>Hellball<br/>\n Greater Ruin</td></tr></tbody></table>\n<br/>\n<span style=\"color:#000000\"><strong>Wizard (Wild Mage Path, rather long.)</strong></span><br/>\n<br/>\n The wild mage is a wizard path. A character can become a wild mage at character creation, turning the wizard levels into wild mage levels, as long as they have no school specialization. A wizard may become a wild mage by finding the correct semi-secret NPC in the modules, but it will drop the character's level to below 6 (if above).Wild Mage class abilities <ul><li>(Same as wizard)</li> <li>Automatically gains Wild Magic passive.</li> <li>Automatically gains Chaotic Affinity passive.</li> <li>Automatically gains Wild Surge command.</li> <li>At level 9, gains Chaos Shield command.</li> <li>At level 21, gains Fatidical Manipulation command.</li> </ul> Wild Magic: Greater Wild SurgeWhenever a wild mage casts an <strong>arcane</strong> spell, there's a natural 5% that a Greater Wild Surge will trigger. Whenever this happens, both the spell and the surge will take place, and there's a chance that the spell will be replenished.To replenish a spell, a d100 is rolled against a DC defined by the WM's level and the spell's circle. The DC is lowered by 1 for each wild mage Level and an additional 3 for every 6th wild mage Level, so at level 30 the DC reduced by 45 with and 50% chance of replenishing a level 9 spell.Circle 1-4: Automatic successCircle 5 Spell DC: 35Circle 6 Spell DC: 50Circle 7 Spell DC: 65Circle 8 Spell DC: 80Circle 9 Spell DC: 95Epic: N/A <ul><li>If the spell is casted from any other spellbook, the spell will not be replenished.</li> </ul> Chaotic Affinity<br/>\n The Wild Surges from the wild mage will scale with the level, potentially becoming more effective, lasting and dangerous as the wild mage grows in power. Also, whenever the wild mage casts the spell Prismatic Spray, she will roll twice, affecting the target twice. <ul><li>Only the Wild Surges that occur through the wizard spellbook will scale in power.</li> </ul> Wild Surge<em>-Surge</em><br/>\n A wild mage can infuse the next spell with the chaotic energies of her Wild Magic, forcing a wild surge to trigger in the next casting. <ul><li>-Surge can only be used once per rest, with an additional use granted each 6 levels, receiving a total of 6 uses at level 30.</li> </ul> Chaos Shield<em>-Chaos</em><br/>\n At level 9, the wild mage's understanding of her strange magic grows to the point she can create a medium defensive aura around herself. For the duration of 1 round/Wild Mage levels, all enemies that enter the aura have 20% to receive a negative effect, and this chance will increase each time it fails, resetting back to 20% once it triggers. The effects can be negated with spell resistance, spell mantles and the <a class=\"postlink\" href=\"http://wiki.arelith.com/Cleric#Healer\" rel=\"noreferrer\" target=\"_blank\">Healer Path</a>'s crowd control. These effects are not identical to that of the Surge Table, and some do not scale, depending whether the target is a PC or NPC. <ul><li>-Chaos can only be used once per rest.</li> </ul> Fatidical Manipulation<em>-Fate [number]</em><br/>\n At level 21, a wild mage's power has entered the epic threshold, finally gaining a glimpse of true comprehension of the seemingly entirely chaotic forces of her wild magic, taking it in her hands to shape her powers and limit the possible outcomes in the next surge. Using the table of wild magic as reference guide, you can input -fate and the number to get any effect from the number selected to the next seven. In example; using -fate 60 at level 21 would make the next surge be any between 60 to 67. Each wild mage level after 21 will reduce the range by 1, resulting in a perfect surge at level 28, removing all random factor. <ul><li>-Fate can only be used once per rest.</li> <li>If the selected value goes above 100, it loops back to 1 and so on.</li> <li>Gems, gold and teleport surges may not be fated.</li> <li>Surges that are usually saveless will roll for a save when they are fated.</li> </ul> The Wild Surge table<table class=\"post_content_table\"><tbody><tr><td>1</td><td>Caster is struck with drunkenness.</td></tr><tr><td>2</td><td>Fireball on Caster.</td></tr><tr><td>3</td><td>Caster is Held for 3 rounds. No save.</td></tr><tr><td>4</td><td>Caster is Held for 3 rounds. No save.</td></tr><tr><td>5</td><td>Caster is polymorphed into a cow. No save.</td></tr><tr><td>6</td><td>Sunstrike on Caster.</td></tr><tr><td>7</td><td>Caster is set on fire!</td></tr><tr><td>8</td><td>A loud noise screams in the Caster's ears.</td></tr><tr><td>9</td><td>Caster is Held for 2 rounds. No save.</td></tr><tr><td>10</td><td>Target is Healed.</td></tr><tr><td>11</td><td>Target is Hasted.</td></tr><tr><td>12</td><td>Caster accidentally summons forth a demon.</td></tr><tr><td>13</td><td>Caster accidentally summons forth a Rift demon.</td></tr><tr><td>14</td><td>Caster is put to sleep.</td></tr><tr><td>15</td><td>Caster slips and falls.</td></tr><tr><td>16</td><td>Lightning strikes down on the Caster.</td></tr><tr><td>17</td><td>Thunderclap on the Caster.</td></tr><tr><td>18</td><td>Razor-sharp Spikes appear under the Caster's feet.</td></tr><tr><td>19</td><td>Mass Elemental Shield on Target.</td></tr><tr><td>20</td><td>Caster summons a rock. It's a nice rock.</td></tr><tr><td>21</td><td>Caster summons a stupid amount of heavy rocks on Target.</td></tr><tr><td>22</td><td>Target is sparkling.</td></tr><tr><td>23</td><td>Mass polymorph: Chicken on Caster.</td></tr><tr><td>24</td><td>Caster is Deafened. No save.</td></tr><tr><td>25</td><td>Caster is teleported to target location.</td></tr><tr><td>26</td><td>Imprisonment spell on Caster.</td></tr><tr><td>27</td><td>Caster is struck with hunger!</td></tr><tr><td>28</td><td>Caster is struck with thirst!</td></tr><tr><td>29</td><td>Random polymorph fog on Caster.</td></tr><tr><td>30</td><td>Half the Caster's gold is destroyed!</td></tr><tr><td>31</td><td>Caster summons forth a herd of while rothes!</td></tr><tr><td>32</td><td>Caster summons an exploding cow.</td></tr><tr><td>33</td><td>Target becomes invisible.</td></tr><tr><td>34</td><td>Caster sparkles. A lot!</td></tr><tr><td>35</td><td>Caster starts to glow.</td></tr><tr><td>36</td><td>Butterflies. Butterflies everywhere. Ah!</td></tr><tr><td>37</td><td>Target glows. Even more glow!</td></tr><tr><td>38</td><td>Caster summons a snow storm. But only if outside!</td></tr><tr><td>39</td><td>Caster is stuck by Mindfire disease.</td></tr><tr><td>40</td><td>Slow spell on Caster.</td></tr><tr><td>41</td><td>Caster summons an exploding cow herd!</td></tr><tr><td>42</td><td>Caster is put to sleep for 3 rounds. No save.</td></tr><tr><td>43</td><td>Caster is struck by panic!</td></tr><tr><td>44</td><td>Caster is cursed. No save.</td></tr><tr><td>45</td><td>Caster is silenced - mostly - for a random duration.</td></tr><tr><td>46</td><td>Caster temporarily forgets how to cast spells!</td></tr><tr><td>47</td><td>Caster starts to laugh. Laugh a lot.</td></tr><tr><td>48</td><td>Spell turning! The spell mirror backs to the Caster.</td></tr><tr><td>49</td><td>Strange noises echo.</td></tr><tr><td>50</td><td>Caster temporarily gets a random elemental immunity.</td></tr><tr><td>51</td><td>Fireball on Target. Caster Immune.</td></tr><tr><td>52</td><td>Slow on Target. Caster Immune.</td></tr><tr><td>53</td><td>Caster is polymorphed into a wolf!</td></tr><tr><td>54</td><td><a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Fright.2C_Fear_and_Fear_Auras\" rel=\"noreferrer\" target=\"_blank\">Fright</a> on Target. Caster Immune.</td></tr><tr><td>55</td><td>Hindsight! The Caster can see everything.</td></tr><tr><td>56</td><td>Super Improved Invisibility on Caster.</td></tr><tr><td>57</td><td>Gems! Caster makes gems rain!</td></tr><tr><td>58</td><td>Caster becomes a true fighter.</td></tr><tr><td>59</td><td>Caster is granted uber spell resistance.</td></tr><tr><td>60</td><td>Heal spell lands on Caster.</td></tr><tr><td>61</td><td>Target is turned into Stone.</td></tr><tr><td>62</td><td>Sunstrike on Target. Caster Immune.</td></tr><tr><td>63</td><td>Target is blinded!</td></tr><tr><td>64</td><td>Target is charmed!</td></tr><tr><td>65</td><td>Target is slowed! No save.</td></tr><tr><td>66</td><td>Target is polymorphed into a cow. No save.</td></tr><tr><td>67</td><td>Mass Daze on Target. Caster Immune.</td></tr><tr><td>68</td><td>Target is polymorphed into a zombie. No save.</td></tr><tr><td>69</td><td>Haste Spell on Caster.</td></tr><tr><td>70</td><td>Caster summons forth a Djinni (Make a wish!)</td></tr><tr><td>71</td><td>Gold rains on the Caster!</td></tr><tr><td>72</td><td>Mass Stun on Target. Caster Immune. No save.</td></tr><tr><td>73</td><td>Web on Target. Caster Immune.</td></tr><tr><td>74</td><td>Target is struck by Sleep. No save.</td></tr><tr><td>75</td><td>Lightning strikes down on Target.</td></tr><tr><td>76</td><td>Super Thunderclap Spell on Target.</td></tr><tr><td>77</td><td>Razor-sharp spikes appear under Target's feet!</td></tr><tr><td>78</td><td>Damage Shield on Caster.</td></tr><tr><td>79</td><td>Iceskin Spell on Caster.</td></tr><tr><td>80</td><td>Mass Polymorh: Chicken on Target! Caster immune.</td></tr><tr><td>81</td><td>Super Speed on Caster.</td></tr><tr><td>82</td><td>Super Mass Energy Buffer on Caster.</td></tr><tr><td>83</td><td>Caster is granted extra health!</td></tr><tr><td>84</td><td>Imprisonment spell on Target!</td></tr><tr><td>85</td><td>The nearest trap disarms itself!</td></tr><tr><td>86</td><td>Destroy half the Target's gold.</td></tr><tr><td>87</td><td>Lightning Storm spell!</td></tr><tr><td>88</td><td>Grease spell on Target. Caster Immune.</td></tr><tr><td>89</td><td>Harm spell on Target.</td></tr><tr><td>90</td><td>Caster summons forth a powerful <a class=\"postlink\" href=\"http://wiki.arelith.com/Summons#Elementals\" rel=\"noreferrer\" target=\"_blank\">Elemental Monolith!</a></td></tr><tr><td>91</td><td>Caster acquires phantomlike powers and form!</td></tr><tr><td>92</td><td>Caster summons forth a powerful <a class=\"postlink\" href=\"http://wiki.arelith.com/Summons#Elementals\" rel=\"noreferrer\" target=\"_blank\">Elemental Monolith!</a></td></tr><tr><td>93</td><td>Wrathful Castigation spell on Target!</td></tr><tr><td>94</td><td>Caster casts the same spell, again!<br/>\n Does not work with Epic Spells and IGMS.</td></tr><tr><td>95</td><td>Double Surge! Double Effect!</td></tr><tr><td>96</td><td>A tiny volcano erupts from the ground!</td></tr><tr><td>97</td><td>Burst of Glacial Wrath spell on Target!</td></tr><tr><td>98</td><td>Disintegrate spell on Target.</td></tr><tr><td>99</td><td>Blasphemy Spell on Target.</td></tr><tr><td>100</td><td>Avascular Mass spell on Target.</td></tr></tbody></table>Surge Vanished<br/>\n Sometimes, instead of getting the surge effect you will see \"Surge Vanished\". This happens for two reasons: Some surges have a failure chance coded into them, and the rest fail to cast due to the lack of the intended targetting. This means that some surges will only trigger when you are targetting a character, the floor, yourself, etc. There's no way to prevent this at the moment, and could be considered simply wild magic bad luck.<br/>\n<br/>\n<br/>\n<strong>Below is a chart of classes PRC means you must go through a DM to get access. Major means you must roll a character (past level 21) for a 5% change to get, Unavailable is unable to be played. No requirement classes can be picked freely! </strong><br/>\n<br/>\n Prestige Classes<table class=\"post_content_table\"><tbody><tr><td>No Requirements</td><td>Arcane Archer<br/>\n Blackguard<br/>\n Champion of Torm<br/>\n Dwarven Defender<br/>\n Shadowdancer<br/>\n Weapon Master</td></tr><tr><td>PrC Token</td><td>Assassin<br/>\n Harper Scout<br/>\n Pale Master<br/>\n Shifter</td></tr><tr><td>Major Award</td><td>Red Dragon Disciple*</td></tr><tr><td>Unavailable</td><td>Purple Dragon Knight</td></tr></tbody></table>\n  <br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "9:51 PM - Mar 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><strong>A new character can have one of the following backgrounds:</strong><table class=\"post_content_table\"><tbody><tr><td>Bully</td><td>+1 intimidate, +1 fortitude save, -1 bluff, -1 reflex save</td></tr><tr><td>Devout</td><td>+1 will save, +1 concentration, -1 fortitude save, -1 bluff</td></tr><tr><td>Farmer</td><td>+1 spot, +1 fortitude save, -1 appraise, -1 reflex save</td></tr><tr><td>Fearless</td><td>+4 save vs. fear, -2 reflex save</td></tr><tr><td>Fisherman</td><td>start with a fishin' pole (or fishin' pole jr. for small races)</td></tr><tr><td>Flirt</td><td>+1 listen, +1 persuade, -2 intimidate</td></tr><tr><td>Gypsy</td><td>+1 perform, +1 tumble, -1 concentration, -1 use magic device</td></tr><tr><td>Healer</td><td>+2 heal, +1 lore, -1 STR</td></tr><tr><td>Hunter</td><td>+1 move silently, +1 craft traps, -2 lore</td></tr><tr><td>Merchant</td><td>+2 appraise, -1 discipline, -1 taunt</td></tr><tr><td>Natural Leader</td><td>+1 CHA, -1 CON, -1 reflex save, -1 fortitude save</td></tr><tr><td>Noble</td><td>+1 art crafting, -2 concentration</td></tr><tr><td>Peasant</td><td>+1 <a class=\"postlink\" href=\"http://wiki.arelith.com/Tailoring\" rel=\"noreferrer\" target=\"_blank\">tailoring</a>, -1 discipline</td></tr><tr><td>Scholar</td><td>+1 lore, +1 concentration, -2 discipline</td></tr><tr><td>Slave</td><td>+1 fortitude saves, -1 will. Start in the Underdark city of Andunor branded with a collar(Requires human or half-orc, non-good alignment)</td></tr><tr><td>Soldier</td><td>+1 discipline, +1 <a class=\"postlink\" href=\"http://wiki.arelith.com/Forging\" rel=\"noreferrer\" target=\"_blank\">forging</a>, -1 will save</td></tr><tr><td>Tattle-tale</td><td>+1 lore, +1 bluff, -2 concentration</td></tr><tr><td>Tribal</td><td>+1 fortitude saves, +1 taunt, -1 discipline, -1 will</td></tr><tr><td>Troublemaker</td><td>+1 reflex save, +1 set traps, +1 pick pocket, -2 will save</td></tr><tr><td>Wanderer</td><td>+1 appraise, +1 bluff, -1 will save</td></tr><tr><td>Wild child</td><td>+1 tumble, +1 hide, +1 move silently, -2 bluff, -2 appraise</td></tr><tr><td>Wizard's apprentice</td><td>+1 spellcraft, +1 lore, +1 <a class=\"postlink\" href=\"http://wiki.arelith.com/Alchemy\" rel=\"noreferrer\" target=\"_blank\">alchemy</a> skill, -1 spot, -1 fortitude save</td></tr><tr><td>Politician</td><td>grants bonuses to social skills and penalties to combat skills (requires 11+ CHA)</td></tr><tr><td>Gladiator</td><td>Start in Arena and cannot leave it until they win their freedom. <strong><a class=\"postlink\" href=\"http://wiki.arelith.com/New_player_guide#What_is_Arelith.3F\" rel=\"noreferrer\" target=\"_blank\">FL server</a>.</strong>-1 will save, double XP bonus for winning in Cordor's arena. Normal start. <strong><a class=\"postlink\" href=\"http://wiki.arelith.com/New_player_guide\" rel=\"noreferrer\" target=\"_blank\">Regulith</a>. </strong></td></tr><tr><td>Dauntless</td><td>+5 HP (requires dwarf or half-orc)</td></tr><tr><td>Outcast</td><td>*See below</td></tr><tr><td>No background</td><td>No effect</td></tr></tbody></table>Outcasts<br/>\n<br/>\n The Outcast status affects moderately the character. Outcasts start in the city of Andunor in the Underdark and have free access to the main portal and they are fluent in <a class=\"postlink\" href=\"http://wiki.arelith.com/Undercommon\" rel=\"noreferrer\" target=\"_blank\">Undercommon</a>, however, they have two restrictions to consider: they cannot become citizens in any surface settlements, and thus they are unable to vote, and neither may they own any property (<a class=\"postlink\" href=\"http://wiki.arelith.com/Quarter\" rel=\"noreferrer\" target=\"_blank\">quarters</a>, guildhouses, shops, boats). They may, however, own quarters and any other form of property <strong>in the wilderness</strong>.Only non-good Humans and Half-Orcs may select the Outcast background at character creation.First up Backgrounds. You pick one of these upon character creation.<br/>\n<br/>\n<br/>\n<strong>Gifts up Next! They help slightly or can behon</strong><br/>\n<br/>\n<strong>What are Gifts?</strong><br/>\n The Gift system allows characters to be empowered beyond the usual traits of their sub-race.Upon character creation after one has entered the world of Arelith, you will be presented with a list of optional 'Gifts' to select. Each chosen will effect your new character in a subtle fashion. However, most gifts will cause a modification to your ECL 'Effective Character Level'<br/>\n<br/>\n The more Gifts you have and the more powerful they are, the higher your ECL will be, altering the amount of XP you acquire and thus the amount of time your character takes to level up. The number and power of gifts each character may take will depend on their subrace's base ECL.<br/>\n<br/>\n It is also recommended that you have a reason behind each of your choices. Players are discouraged from taking things for purely mechanical or power gaming reasons.How many Gifts can I have?The number of Gifts a character may take depends on its subrace's base ECL, with fewer allowed to those with higher ECL.A Minor Gift may be taken in place of a Major Gift, if desired.<table class=\"post_content_table\"><tbody><tr><td>+0</td><td>2</td><td>1</td></tr><tr><td>+1</td><td>1</td><td>1</td></tr><tr><td>+2</td><td>0</td><td>1</td></tr><tr><td>+3</td><td>0</td><td>0</td></tr></tbody></table>Example: <ul><li>A Drow, having a base ECL of +2, may take only one Minor Gift.</li> </ul><ul><li>A Human, having a base ECL of +0, may take as many as two Major Gifts and one Minor Gift.</li> </ul> Can I change my Gifts?<br/>\n<br/>\n Once chosen, gifts may never be lost nor may further gifts be taken later in a characters life. Be very certain before finalising your choices!<br/>\n<br/>\n Gifts<br/>\n Major Gifts are listed in <strong>bold</strong> text.<table class=\"post_content_table\"><tbody><tr><td><strong>Gift of Might</strong></td><td>STR +2</td><td>+1</td></tr><tr><td><strong>Gift of Grace</strong></td><td>DEX +2</td><td>+1</td></tr><tr><td><strong>Gift of Endurance</strong></td><td>CON +2</td><td>+1</td></tr><tr><td><strong>Gift of Learning</strong></td><td>INT +2</td><td>+1</td></tr><tr><td><strong>Gift of Insight</strong></td><td>WIS +2</td><td>+1</td></tr><tr><td><strong>Gift of Confidence</strong></td><td>CHA +2</td><td>+1</td></tr><tr><td><strong>Gift of Wealth</strong></td><td>+1,000 gold on start, and each in-game month the character is active</td><td>+0.5</td></tr><tr><td>Gift of Tongues</td><td>Able to learn 4 more <a class=\"postlink\" href=\"http://wiki.arelith.com/Languages\" rel=\"noreferrer\" target=\"_blank\">languages</a>, faster (as if natural intelligence was 8 points higher)</td><td>+1</td></tr><tr><td>Gift of Hardiness</td><td>5% dammage immunity to fire, cold, electric, acid</td><td>+0.5</td></tr><tr><td>Gift of Darkness</td><td>Darkness 1/day</td><td>+0.5</td></tr><tr><td>Gift of Hiding</td><td>Invisibility 1/day</td><td>+0.5</td></tr><tr><td>Gift of Light</td><td>Light 1/day</td><td>0</td></tr><tr><td>Gift of the Gab</td><td>Bluff +6</td><td>+0.5</td></tr><tr><td>Gift of the Hunter</td><td>Spot +6</td><td>+0.5</td></tr><tr><td>Gift of the Sneak</td><td>Hide +4, Move silently +4</td><td>+1</td></tr><tr><td><strong>Gift of Fortune</strong></td><td>All saves +2</td><td>+1</td></tr><tr><td>Gift of Stardom</td><td>Perform +6</td><td>+0.5</td></tr><tr><td>Gift of Craftsmanship</td><td><a class=\"postlink\" href=\"http://wiki.arelith.com/Crafting\" rel=\"noreferrer\" target=\"_blank\">Crafting Points</a> +10</td><td>+1</td></tr><tr><td>Gift of Humility</td><td>All abilities -2</td><td>-2</td></tr><tr><td>Gift of the (Un)Holy</td><td>Allows non-cleric to hold ceremonies and to consecrate/desecrate altars</td><td>+0.5</td></tr><tr><td>Gift of Unique Favor</td><td>Allows character to ignore deity race restrictions</td><td>+0.5</td></tr><tr><td>Gift of Greenfingers</td><td>Allows non-nature character to tend plants</td><td>+0.5</td></tr><tr><td>Gift of Melee-magthere</td><td>+2 CON, -2 CHA. Drow only</td><td>0</td></tr><tr><td>Gift of the Clergy</td><td>+2 WIS, -2 CON. Drow only</td><td>0</td></tr></tbody></table>ECL<em>Main article: <a class=\"postlink\" href=\"http://wiki.arelith.com/ECL\" rel=\"noreferrer\" target=\"_blank\">ECL</a></em><br/>\n<br/>\n ECL, or effective character level, is a mechanic that modifies the amount of experience that a character receives for killing NPCs. A character with ECL +1 is treated as having a level 1 higher than normal for the purposes of calculating XP received. This serves to balance out the benefits that a character receives for choosing gifts by causing them to level more slowly.ECL does not influence the maximum level achievable on Arelith. All characters can reach level 30.<br/>\n<br/>\n<br/>\n<strong>Feat Changes.</strong><br/>\n Disabled &amp; Obsolete Feats<br/>\n<br/>\n<strong>Devastating Critical</strong>: <em>\"In the judgement of the Dev Team it's unbalanced... You may not agree with the decision, but it's not going to change\"</em> <strong>-Mithreas</strong><br/>\n<br/>\n<strong>Summon Mount, Mounted Combat and Mounted Archery</strong>: These feats are normally disabled. Characters, however, can still ride horses if they use a <a class=\"postlink\" href=\"http://wiki.arelith.com/Epic_Sacrifice\" rel=\"noreferrer\" target=\"_blank\">Medium Reward</a> for that purpose.<br/>\n<br/>\n<strong>Skill Focus &amp; Epic Skill Focus in any <a class=\"postlink\" href=\"http://wiki.arelith.com/Skill_Changes#Disabled_.26_Obsolete_Skills\" rel=\"noreferrer\" target=\"_blank\">Disabled &amp; Obsolete Skills</a></strong>:<br/>\n<br/>\n For obvious reasons, there is no benefit to taking feats which specifically improve Skills that have no use on Arelith.<br/>\n<br/>\n<strong>Epic Spell: Epic Warding</strong>: This Feat is not <em>technically</em> disabled on Arelith. However, since PCs on Arelith are capped at Lv30, it is impossible to meet the prerequisites of the Feat with a PC.<br/>\n<br/>\n Note that some Epic Feats which can be taken multiple times suffer similar inhibitions with their later \"versions\" (Self Concealment V, for example, is unobtainable within 30 Levels).Modified Feats<br/>\n<br/>\n<strong>Arcane Defense: Abjuration</strong>: This Feat increases a spellcaster's effective Caster Level by +2 when trying to resist a dispel.<br/>\n<br/>\n<strong>Brew Potion</strong>: On Arelith, all spells (Wiz/Sorc, Ranger, Druid and Cleric spells) from Level 0 up to Level 3 are \"potionable\", even spells that are normally not potionable in the default Neverwinter Nights, like True Strike, Expeditious Retreat, Camouflage, Entropic Shield and so on.<em>Note the Bug with Cleric Domain Spells and Item Creation Feats listed below</em><br/>\n<br/>\n<strong>Craft Wand</strong>: On Arelith, all spells (Wiz/Sorc, Ranger, Druid and Cleric spells) from Level 0 up to Level 4 are \"wandable\", even spells that are normally not wandable in the default Neverwinter Nights, like True Strike, Expeditious Retreat, Camouflage, Entropic Shield and so on. Divine Power and Invisibility Purge can not be wanded, and this exception is intentional.<em>Note the Bug with Cleric Domain Spells and Item Creation Feats listed below</em><br/>\n<br/>\n<strong>Defensive Casting</strong>: Defensive casting and other combat modes <a class=\"postlink\" href=\"http://wiki.arelith.com/Feat_changes#Expertise.2FImproved_Expertise\" rel=\"noreferrer\" target=\"_blank\">Expertise/Improved Expertise</a> are not disabled when your character moves.<br/>\n<br/>\n<strong>Expertise/Improved Expertise</strong>: Expertise/Improved Expertise mode is automatically disabled when a spell is cast. Casters using this feat will need to re-enable it after every casting, and will not benefit from the bonus AC during casting.Expertise/Improved expertise and other combat modes (such as defensive casting) are not cancelled when you move.<br/>\n<br/>\n<strong>Hide in Plain Sight</strong>: <a class=\"postlink\" href=\"http://wiki.arelith.com/Shadowdancer\" rel=\"noreferrer\" target=\"_blank\">Shadowdancers</a> will get this feat at level 5 instead. After leaving stealth mode, HIPS will have 2 rounds of cooldown before it can be used again. Note that other ways of sneaking still work while the cooldown is in effect.<br/>\n<br/>\n<strong>Scribe Scroll</strong>: Certain Spells require an additional component to be scribed, which is consumed along with the Blank Scroll from your inventory. What components are needed for which spells is considered Find Out In Game information. Spells requiring a component are; <ul><li>Firestorm</li> <li>Greater Restoration</li> <li>Harm</li> <li>Storm of Vengeance</li> <li>Time Stop</li> <li>True Seeing</li> <li>Undeath to Death</li> </ul><em>Note the Bug with Cleric Domain Spells and Item Creation Feats and the Undeath to Death &amp; Remove Blindness/Deafness Scribing Bug listed below. Also, Greater Sanctuary is purposefully impossible to scribe.</em><br/>\n<br/>\n<strong>Epic Spell: Mummy Dust</strong>: Having this feat will grant access to the strongest variants of undead as per the <a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Necromancy_changes\" rel=\"noreferrer\" target=\"_blank\">undead summoning changes</a>, but the spell by itself only works as any other undead summoning spell (It does not summon the mummy warrior).<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Wizard\" rel=\"noreferrer\" target=\"_blank\">Wizards</a> and <a class=\"postlink\" href=\"http://wiki.arelith.com/Sorcerer\" rel=\"noreferrer\" target=\"_blank\">sorcerers</a> receive an additional effect with every Greater Spell Focus, detailed in their pages.<strong>Spell Focus: Abjuration</strong> <ul><li>Each Spell Focus in Abjuration grants a cumulative +2 to Dispelling Rolls, to a total of +6 with Epic Spell Focus: Abjuration. These are applied after the Level Cap imposed by individual spells (so an Epic Abjurer's Greater Dispelling caps at +26, not +20).</li> <li>With Spell Focus: Abjuration, the Shield spell protects against Isaac's Lesser Missile Storm as well as Magic Missile. With Greater Spell Focus, this protection extends also to Isaac's Greater Missile Storm.</li> <li>With Epic Spell Focus: Abjuration, the <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-ward\" rel=\"noreferrer\" target=\"_blank\">-ward</a> and <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-ward_teleport\" rel=\"noreferrer\" target=\"_blank\">-ward teleport</a> Commands become available. The character may use one or the other of these, once per rest. -ward creates a large visible symbol on the floor, which lasts for a long time and inflicts brief paralysis on enemies who fail a Will Save upon passing over it. -ward teleport, while it lasts, prevents any PC from teleporting out of the area in question through any means, and prevents them from being -yoinked elsewhere whilst the remain in the area. It also prevents travel to any <a class=\"postlink\" href=\"http://wiki.arelith.com/Portals\" rel=\"noreferrer\" target=\"_blank\">portals</a> within the area.</li> </ul><strong>Spell Focus: Conjuration</strong> <ul><li>Each Spell Focus in Conjuration grants a small bonus to the statistics of creatures summoned by the [Lesser/Greater] Planar Binding Spells, and Epic Spell: Dragon Knight.</li> <li>Greater Spell Focus: Conjuration causes a caster to summon a creature one \"level\" higher than normal when using the Summon Creature I-VIII spells, in the same way as the bonus provided by the Cleric's Animal <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Animal_domain%7CAnimal\" rel=\"noreferrer\" target=\"_blank\">Domain</a>. Note that Animal Domain and Greater Spell Focus: Conjuration <em><strong>do not</strong></em> stack in this respect. This feat will also grant <a class=\"postlink\" href=\"http://wiki.arelith.com/Warlock#Fiendish_Summons\" rel=\"noreferrer\" target=\"_blank\">Fiendish Warlocks</a> an empowered version of their final summon, and allows Summon Creature IX to summon a more powerful Ancient Elemental.</li> <li>Epic Spell Focus: Conjuration enables the <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-yoink\" rel=\"noreferrer\" target=\"_blank\">-yoink</a> command. Once per rest, a character may send -yoink as a tell to another PC, which will cause them to enter a dialogue telling them that your PC is attempting to summon them. If they accept, they are transported instantly to your location.</li> </ul><strong>Spell Focus: Divination</strong> <ul><li>Spell Focus: Divination allows a character see whether a character is \"attuned\" to Life, Death, Fire, Water, Earth, or Air along the usual information of the Right Click&gt;Examine. Through trial and error association, a player may learn much about another character's habits and abilities from their attunement. Also allows a character to use the mysterious Deck of Stars item.</li> <li>Greater Spell Focus: Divination allows further information using <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-investigate\" rel=\"noreferrer\" target=\"_blank\">-investigate</a>, <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-detectevil\" rel=\"noreferrer\" target=\"_blank\">Detect Evil</a>, and <em>other</em> things.</li> <li>With Epic Spell Focus: Divination, the <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-scry\" rel=\"noreferrer\" target=\"_blank\">-scry</a> command becomes available. Once per rest, with the Clairaudience/Clairvoyance spell active, the character may send -scry as a tell to another PC (or type -scry [START OF TARGET'S NAME]). This permits the character to spy on their target for roughly one minute. It is possible to protect against this, but means of doing so are considered Find Out In Game information.</li> </ul><strong>Spell Focus: Enchantment</strong> <ul><li>Each Spell Focus in Enchantment reduces the base cost of an enchantment when using the Enchantment Basin. This, in turn, means the chances of success with any given enchantment are increased, and that more valuable/powerful items can be created.</li> <li>The (non-cumulative) reduction in costs are 10% for Spell Focus, 20% for Greater Spell Focus, and 35% for Epic Spell Focus.</li> </ul><strong>Spell Focus: Evocation</strong> <ul><li>Epic Spell Focus: Evocation drastically improves both <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Greater_ruin\" rel=\"noreferrer\" target=\"_blank\">Epic Spell: Greater Ruin</a> and <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Hellball\" rel=\"noreferrer\" target=\"_blank\">Epic Spell: Hellball</a>, to several times their normal effectiveness. Without this focus, their power is equivalent to Vanilla NWN.</li> </ul><strong>Spell Focus: Illusion</strong> <ul><li>Epic Spell Focus: Illusion enables the <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-project_image\" rel=\"noreferrer\" target=\"_blank\">-project_image</a> command. Once per rest, the character may send -project_image as a tell to another PC or type -project_image [Character Name], after that the game will ask you to input your message, and the next sentence that you write will be hooked as your message.</li> </ul><ul><li>Your character's avatar, with the appropriate <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-emote\" rel=\"noreferrer\" target=\"_blank\">-conjure or -cast visual</a> and/or polymorph state, will appear like a Speedy Messenger beside the target and relate your message. If you are targeting a PC on a different server, they will instead see only a \"Mysterious Ball of Light\".</li> </ul><ul><li>On addition to this, if no target is specified, it will create a copy of yourself with your current gear. The copy can fight, but it cannot cast spells. The copy will last 1 hour/caster level or until you rest. On top of this, you can speak through the copy using the <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-associate_.2F_-a\" rel=\"noreferrer\" target=\"_blank\">-a</a> command, and anything it hears will be relayed to you through the combat log.</li> </ul><strong>Spell Focus: Necromancy</strong> <ul><li>Greater Spell Focus: Necromancy turns Summoned Undead (from any Spell, Class Ability or Feat) into Henchmen. Your character may therefore have two undead minions at the same time. Note that the undeads <strong>must</strong> be summoned from different sources; casting two times Create Undead will not result in two minions.</li> <li>Epic Spell Focus: Necromancy will allow the caster to have three summoned undead at the same time.</li> </ul> For more information, read the <a class=\"postlink\" href=\"http://wiki.arelith.com/Spell_changes#Necromancy_changes\" rel=\"noreferrer\" target=\"_blank\">Necromancy changes</a> article.<br/>\n<br/>\n<strong>Spell Focus: Transmutation</strong> <ul><li>Greater Spell Focus: Transmutation allows a character, by travelling to the correct place (the location of which is Find Out In Game information), to activate Golems from their constituent parts so long as the character is Level 15 or over.</li> <li>Epic Spell Focus: Transmutation enables the <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_command#-teleport\" rel=\"noreferrer\" target=\"_blank\">-teleport</a> command. This allows the character to open the same dialogue from a <a class=\"postlink\" href=\"http://wiki.arelith.com/Portals\" rel=\"noreferrer\" target=\"_blank\">portal</a> anywhere and travel to any known portal node. Usable once per rest, as long as the transmuter is not in a no-portal area, like the ones created by the epic abjurer.</li> </ul><strong>Weapon Finesse</strong> <ul><li>Works with Quarterstaff and Katana.</li> </ul><strong>Skill Changes</strong><br/>\n Disabled &amp; Obsolete Skills<br/>\n<strong>Ride</strong>: Ride is not needed to ride horses (this requires only a <a class=\"postlink\" href=\"http://wiki.arelith.com/Epic_Sacrifice\" rel=\"noreferrer\" target=\"_blank\">Normal Awards</a>), but is used in the wyvern riding fast travel system in the Underdark (details of this system are FOIG).<br/>\n<br/>\n Modified Skills<br/>\n<strong>Animal Empathy</strong>: Characters with 75% or more of their levels as ranger levels can turn animals into henchmen, allowing them to use Animal Empathy on more than one animal at one time.<br/>\n<br/>\n<strong>Appraise</strong>: Only base Appraise and INT modifications improve a character's ability to barter. Skill bonuses on items will not do so (although items which increase your Intelligence Score, and thus Intelligence Modifier, can do so indirectly). In addition, in contrast to the <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Appraise\" rel=\"noreferrer\" target=\"_blank\">default NWN version</a>, your opposed role to barter with a merchant is recalculated after every server reset.<br/>\n<br/>\n<strong>Bluff</strong>: Affects the strength of a character's disguise. A full explanation is given <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_commands#-disguise\" rel=\"noreferrer\" target=\"_blank\">here</a>.<br/>\n<br/>\n<strong>Craft Armor, Craft Weapon</strong>: Arelith uses its own system for <a class=\"postlink\" href=\"http://wiki.arelith.com/Crafting\" rel=\"noreferrer\" target=\"_blank\">crafting</a>. Each two ranks in Craft Armor and Craft Weapon add +1 crafting point to use per day. Only base ranks and feats add to the crafting points.<br/>\n<br/>\n<strong>Discipline</strong>: Characteristics of a PC, including their sense of martial discipline, can be revealed Inspecting a character. Other characters can roleplay according to it.<br/>\n<br/>\n<strong>Intimidate</strong>: Characteristics of a PC, including their ability to intimidate, can be revealed Inspecting a character. Other characters can roleplay according to it.<br/>\n<br/>\n<strong>Lore</strong>: Lore can be used for understanding languages, and is also used alongside Search in investigating bloodstains and interrogating NPCs. Full explanations are given on <a class=\"postlink\" href=\"http://wiki.arelith.com/Languages#Understanding_languages\" rel=\"noreferrer\" target=\"_blank\">this page</a> and <a class=\"postlink\" href=\"http://wiki.arelith.com/Look#-investigate\" rel=\"noreferrer\" target=\"_blank\">this page</a>, respectively.<br/>\n<br/>\n<strong>Parry</strong>:Parried attacks have +5 AB and damage bonus equal to half the parry skill up to 20 ranks, and 1/4 beyond 20 ranks. Skill bonus from items count. Parry is a toggled mode, like the modified <a class=\"postlink\" href=\"http://wiki.arelith.com/Feat_changes#Modified_Feats\" rel=\"noreferrer\" target=\"_blank\">(Improved) Expertise</a>.<br/>\n<br/>\n<strong>Perform</strong>: Affects the strength of a character's disguise. A full explanation is given <a class=\"postlink\" href=\"http://wiki.arelith.com/Disguise\" rel=\"noreferrer\" target=\"_blank\">here</a>.<br/>\n<br/>\n<strong>Persuade</strong>: Characteristics of a PC, including their ability to persuade, can be revealed Inspecting a character. Other characters can roleplay according to it. Additionally, it allows characters to receive slightly more gold when turning in bounties.<br/>\n<br/>\n<strong>Pickpocketing</strong>: Specific rules about Theft apply to Pickpocketing. These are explained in separate article about <a class=\"postlink\" href=\"http://wiki.arelith.com/Pickpocketing\" rel=\"noreferrer\" target=\"_blank\">pickpocketing</a>. Also; pickpocketing hostile mobs will reward a percentage of the mob's experience.<strong>Search</strong>: Search is used alongside Lore in investigating bloodstains. A full explanation is given <a class=\"postlink\" href=\"http://wiki.arelith.com/Look#-investigate\" rel=\"noreferrer\" target=\"_blank\">here</a>.<br/>\n<br/>\n<strong>Spot</strong>: In addition to standard detection of Hide and <a class=\"postlink\" href=\"http://wiki.arelith.com/Pickpocketing\" rel=\"noreferrer\" target=\"_blank\">pickpocketing</a> attempts, Spot is used for Inspecting and recognition of <a class=\"postlink\" href=\"http://wiki.arelith.com/Disguise\" rel=\"noreferrer\" target=\"_blank\">disguised</a> characters.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<strong>Decided to add Race benefits in this list as well instead of making a new post.</strong><br/>\n<br/>\n Humans<table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>None<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Any</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Quick to Master: 1 extra feat at 1st level<br/>\n Skilled: 4 extra skill points at 1st level, plus 1 additional skill point at each following level</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or Andunor with Outcast or Slave background</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table>Dwarves<br/>\n<br/>\n Dwarf<table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Con +2, Cha -2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Fighter</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Stonecunning: +2 racial bonus on Search checks made in subterranean areas<br/>\n Darkvision: Dwarves are able to see in the dark<br/>\n Hardiness vs. Poisons: +2 racial bonus on saving throws against poisons<br/>\n Hardiness vs. Spells: +2 racial bonus on saving throws against spells<br/>\n Offensive Training vs. Orcs: +1 racial bonus on attack rolls against orcs<br/>\n Offensive Training vs. Goblinoids: +1 racial bonus on attack rolls against goblinoids (goblins, hobgoblins, and bugbears)<br/>\n Defensive Training vs. Giants: +4 dodge bonus to AC against giants<br/>\n Skill Affinity (Lore): +2 racial bonus to lore checks</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or Brogendenstein with RPR 10</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Shield_Dwarf\" rel=\"noreferrer\" target=\"_blank\">Shield Dwarf</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Con +2, Cha -2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Fighter</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Receives all other default Dwarf special abilities</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or Brogendenstein with RPR 10</td></tr><tr><td><strong>Notes:</strong></td><td>Default Dwarven race</td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Gold_Dwarf\" rel=\"noreferrer\" target=\"_blank\">Gold Dwarf</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Con +2, Dex -2<br/>\n (Dex -2, Cha +2)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Fighter</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Attack +1 vs. Aberrations<br/>\n<br/>\n Receives all other default Dwarf special abilities</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or Brogendenstein with RPR 10</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Duergar\" rel=\"noreferrer\" target=\"_blank\">Duergar</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Con +2, Cha -4<br/>\n (Cha -2)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Fighter</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Listen +1<br/>\n Move Silently +4<br/>\n Spot +1<br/>\n Darkvision<br/>\n Immunity: Paralysis<br/>\n Immunity: Poison<br/>\n Spell-Like Abilities: 1/day Invisibility<br/>\n Receives all other default Dwarf special abilities<br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/ECL\" rel=\"noreferrer\" target=\"_blank\">ECL</a> +1</td></tr><tr><td><strong>Starting Location:</strong></td><td>Andunor</td></tr><tr><td><strong>Notes:</strong></td><td>Requires non-good alignment</td></tr></tbody></table>Elves<br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Elf\" rel=\"noreferrer\" target=\"_blank\">Elf</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Dex +2, Con -2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Wizard</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Sleeplessness: Immune to spells and effects of the 'Sleep' subtype<br/>\n Hardiness vs. Enchantments: +2 racial bonus on saving throws against mind-affecting spells<br/>\n Bonus Proficiencies (Longsword, Rapier, Shortbow, Longbow)<br/>\n Skill Affinity (Listen): +2 racial bonus to listen checks<br/>\n Skill Affinity (Search): +2 racial bonus to Search checks<br/>\n Skill Affinity (Spot): +2 racial bonus to Spot checks<br/>\n Keen Senses: Elves make active Search checks automatically and with no movement penalties<br/>\n Low-light Vision: Allows them to see better than normal in the dark</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table> <br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Moon_Elf\" rel=\"noreferrer\" target=\"_blank\">Moon Elf</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Dex +2, Con -2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Wizard</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Receives all default Elf special abilities</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor</td></tr><tr><td><strong>Notes:</strong></td><td>Default Elven race</td></tr></tbody></table> <br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Sun_Elf\" rel=\"noreferrer\" target=\"_blank\">Sun Elf</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Int +2, Con -2<br/>\n (Dex -2, Int +2)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Wizard</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Receives all default Elf special abilities</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Wild_Elf\" rel=\"noreferrer\" target=\"_blank\">Wild Elf</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Dex +2, Int -2<br/>\n (Int -2, Con +2)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Sorcerer</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Receives all default Elf special abilities</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table> <br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Wood_Elf\" rel=\"noreferrer\" target=\"_blank\">Wood Elf</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Str +2, Dex +2, Con -2, Int -2, Cha -2<br/>\n (Str +2, Int -2, Cha -2)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Ranger</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Receives all default Elf special abilities</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table> <br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Drow\" rel=\"noreferrer\" target=\"_blank\">Drow</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Dex +2, Con -2, Int +2, Cha +2<br/>\n (Int +2, Cha +2)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Cleric (Female)<br/>\n Wizard (Male)</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Darkvision<br/>\n Spell Resistance: 11+level (capped at 32)<br/>\n Spell-Like Ability: Darkness 1/day<br/>\n Receives all default Elf special abilities<br/>\n<br/>\n ECL +2</td></tr><tr><td><strong>Starting Location:</strong></td><td>Andunor</td></tr><tr><td><strong>Notes:</strong></td><td>Requires non-good alignment<br/>\n Good alignment requires <a class=\"postlink\" href=\"http://wiki.arelith.com/Epic_Sacrifice\" rel=\"noreferrer\" target=\"_blank\">Normal Award</a><br/>\n Required Reading: <a class=\"postlink\" href=\"http://wiki.arelith.com/Playing_any_UD_race#The_Definitive_Drow_Policy.2C_and_why\" rel=\"noreferrer\" target=\"_blank\"> The Definitive Drow Policy</a></td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Gnome\" rel=\"noreferrer\" target=\"_blank\">Gnomes</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Con +2, Str -2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Wizard</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Small Stature<br/>\n +1 size modifier to attack rolls<br/>\n +1 size modifier to AC<br/>\n +4 size bonus to hide checks<br/>\n Hardiness vs. Illusions: +2 racial bonus on saving throws against mind-affecting spells<br/>\n Offensive Training vs. Reptilians: +1 racial bonus on attack rolls against reptilian humanoids<br/>\n Offensive Training vs. Goblinoids: +1 racial bonus on attack rolls against goblinoids (goblins, hobgoblins, and bugbears)<br/>\n Defensive Training vs. Giants: +4 dodge bonus to AC against giants<br/>\n Skill Affinity (Listen): +2 racial bonus to listen checks<br/>\n Skill Affinity (Concentration): +2 racial bonus to concentration checks<br/>\n Spell Focus (Illusion): Gnomes add +2 difficulty class to any Illusion spells they cast (This counts as the feat so characters are able to select Greater Spell Focus (Illusion) at first level)<br/>\n Low-light Vision: Allows them to see better than normal in the dark</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or Brogendenstein with RPR 10</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table>\n\n  <a class=\"postlink\" href=\"http://wiki.arelith.com/Rock_Gnome\" rel=\"noreferrer\" target=\"_blank\">Rock Gnome</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Con +2, Str -2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Wizard</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Receives default Gnome special abilities</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or Brogendenstein with RPR 10</td></tr><tr><td><strong>Notes:</strong></td><td>Default Gnome race</td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Svirfneblin\" rel=\"noreferrer\" target=\"_blank\">Svirfneblin</a> (Deep Gnome)<table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Str -2, Dex +2, Wis +2, Cha -4<br/>\n (Dex +2, Con -2, Wis +2, Cha -4)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Wizard</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Hide +2<br/>\n Saving Throw Bonus (Universal) +2<br/>\n AC +4 vs. creatures except Giants<br/>\n Darkvision<br/>\n Spell-Like Abilities: 1/day Invisibility<br/>\n Receives default Gnome special abilities<br/>\n<br/>\n ECL +3</td></tr><tr><td><strong>Starting Location:</strong></td><td>The Great Grotto</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Forest_Gnome\" rel=\"noreferrer\" target=\"_blank\">Forest Gnome</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Con +2, Str -2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Bard</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Bonus Language: Animal<br/>\n Will not leave tracks<br/>\n Can Use Ranger <a class=\"postlink\" href=\"http://wiki.arelith.com/Console_commands#-track\" rel=\"noreferrer\" target=\"_blank\">-track</a> Command<br/>\n Receives default Gnome special abilities</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or The Great Grotto with RPR 10</td></tr><tr><td><strong>Notes:</strong></td><td>Requires <a class=\"postlink\" href=\"http://wiki.arelith.com/Epic_Sacrifice\" rel=\"noreferrer\" target=\"_blank\">Minor Award</a></td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Halfling\" rel=\"noreferrer\" target=\"_blank\">Halflings</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Dex +2, Str -2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Rogue</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Small stature<br/>\n +1 size modifier to attack rolls<br/>\n +1 size modifier to AC<br/>\n +4 size bonus to hide checks<br/>\n Skill affinity (move silently): +2 racial bonus to move silently checks<br/>\n Skill affinity (listen): +2 racial bonus to listen checks<br/>\n Lucky: +1 luck bonus to all saving throws<br/>\n Fearless: +2 morale bonus to saving throws against spells and effects of the fear subtype<br/>\n Good aim: +1 racial bonus to attack rolls made with throwing weapons</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or Brogendenstein with RPR 10</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table>\n\n  <a class=\"postlink\" href=\"http://wiki.arelith.com/Lightfoot_Halfling\" rel=\"noreferrer\" target=\"_blank\">Lightfoot Halfling</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Dex +2, Str -2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Rogue</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Receives default Halfling special abilities</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or Brogendenstein with RPR 10</td></tr><tr><td><strong>Notes:</strong></td><td>Default Halfling race</td></tr></tbody></table> <br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Ghostwise_Halfling\" rel=\"noreferrer\" target=\"_blank\">Ghostwise Halfling</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Dex +2, Str -2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Barbarian</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Receives default Halfling special abilities</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or Brogendenstein with RPR 10</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Strongheart_Halfling\" rel=\"noreferrer\" target=\"_blank\">Strongheart Halfling</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Dex +2, Str -2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Rogue</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Bonus Feat: Alertness<br/>\n<br/>\n Receives default Halfling special abilities</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or Brogendenstein with RPR 10</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Half-Elf\" rel=\"noreferrer\" target=\"_blank\">Half-Elf</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>N/A<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Any</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Sleeplessness: Immune to spells and effects of the 'Sleep' subtype<br/>\n Hardiness vs. Enchantments: +2 racial bonus on saving throws against mind-affecting spells<br/>\n Partial Skill Affinity (Listen): +1 racial bonus to listen checks<br/>\n Partial Skill Affinity (Search): +1 racial bonus to Search checks<br/>\n Partial Skill Affinity (Spot): +1 racial bonus to Spot checks<br/>\n Low-light Vision: Allows them to see better than normal in the dark</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table>\n\n  <a class=\"postlink\" href=\"http://wiki.arelith.com/Half-Orc\" rel=\"noreferrer\" target=\"_blank\">Half-Orc</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>+2 Str, -2 Int, -2 Cha<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Barbarian</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Darkvision: Half-orcs are able to see in the dark</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor, or Andunor with Slave or Outcast background</td></tr><tr><td><strong>Notes:</strong></td><td>None</td></tr></tbody></table>\n\n Monster RacesMore useful and important information are listed in article <a class=\"postlink\" href=\"http://wiki.arelith.com/Playing_any_UD_race\" rel=\"noreferrer\" target=\"_blank\">playing any UD race</a>. <a class=\"postlink\" href=\"http://wiki.arelith.com/Goblin\" rel=\"noreferrer\" target=\"_blank\">Goblin</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Str -2, Dex +2, Cha -2<br/>\n (Cha -2)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Rogue</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Listen +2<br/>\n Move Silently +4<br/>\n Spot +2<br/>\n Darkvision<br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/ECL\" rel=\"noreferrer\" target=\"_blank\">ECL</a> -1</td></tr><tr><td><strong>Starting Location:</strong></td><td>Andunor</td></tr><tr><td><strong>Notes:</strong></td><td>Base Race: <a class=\"postlink\" href=\"http://wiki.arelith.com/Halfling\" rel=\"noreferrer\" target=\"_blank\">Halfling</a></td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Kobold\" rel=\"noreferrer\" target=\"_blank\">Kobold</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Str -2, Dex +2<br/>\n (N/A)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Sorcerer</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Craft Trap +2<br/>\n Listen +2<br/>\n Spot +2<br/>\n Darkvision</td></tr><tr><td><strong>Starting Location:</strong></td><td>Andunor</td></tr><tr><td><strong>Notes:</strong></td><td>Base Race: <a class=\"postlink\" href=\"http://wiki.arelith.com/Halfling\" rel=\"noreferrer\" target=\"_blank\">Halfling</a></td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Gnoll\" rel=\"noreferrer\" target=\"_blank\">Gnoll</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Str +2, Con +2, Int -2, Cha -2<br/>\n (Con +2)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Ranger</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Listen +2<br/>\n Spot +2<br/>\n Darkvision<br/>\n Innate Ability: War Cry 1/Day per 8 Levels (DC Based on Con Modifier)<br/>\n Bonus Language: Undercommon<br/>\n Bonus Language: Animal<br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/ECL\" rel=\"noreferrer\" target=\"_blank\">ECL</a> +1</td></tr><tr><td><strong>Starting Location:</strong></td><td>Andunor</td></tr><tr><td><strong>Notes:</strong></td><td>Base Race: <a class=\"postlink\" href=\"http://wiki.arelith.com/Half-Orc\" rel=\"noreferrer\" target=\"_blank\">Half-Orc</a></td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Orog\" rel=\"noreferrer\" target=\"_blank\">Orog</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Str +4, Dex -2, Wis -2, Cha +2<br/>\n (Str +2, Dex -2, int +2, Wis -2, Cha +4)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Fighter</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Darkvision<br/>\n 10% Cold Immunity<br/>\n 10% Fire Immunity<br/>\n +1 Natural Armor<br/>\n +1 <a class=\"postlink\" href=\"http://wiki.arelith.com/Forging\" rel=\"noreferrer\" target=\"_blank\">Forging</a><br/>\n<br/>\n +2 <a class=\"postlink\" href=\"http://wiki.arelith.com/ECL\" rel=\"noreferrer\" target=\"_blank\">ECL</a></td></tr><tr><td><strong>Starting Location:</strong></td><td>Andunor</td></tr><tr><td><strong>Notes:</strong></td><td>Base Race: <a class=\"postlink\" href=\"http://wiki.arelith.com/Half-Orc\" rel=\"noreferrer\" target=\"_blank\">Half-Orc</a></td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/w/index.php?title=Hobgoblin&amp;action=edit&amp;redlink=1\" rel=\"noreferrer\" target=\"_blank\">Hobgoblin</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Dex +2, Con +2<br/>\n (Con +4)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Fighter</td></tr><tr><td><strong>Special Abilities:</strong></td><td>+4 Move Silently<br/>\n Bonus Language: Undercommon<br/>\n Bonus Language: Goblin<br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/ECL\" rel=\"noreferrer\" target=\"_blank\">ECL</a> +1</td></tr><tr><td><strong>Starting Location:</strong></td><td>Andunor</td></tr><tr><td><strong>Notes:</strong></td><td>Requires Evil Alignment<br/>\n Requires Minor Award<br/>\n Base Race: <a class=\"postlink\" href=\"http://wiki.arelith.com/Half-Elf\" rel=\"noreferrer\" target=\"_blank\">Half-Elf</a></td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/w/index.php?title=Ogre&amp;action=edit&amp;redlink=1\" rel=\"noreferrer\" target=\"_blank\">Ogre</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Str +6, Dex -2, Con +2, Int -4, Cha -4<br/>\n (Str +4, Dex -2, Con +2, Int -2, Cha -2)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Barbarian</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Darkvision<br/>\n +2 Natural Armor<br/>\n -4 Hide<br/>\n Bonus Language: Undercommon<br/>\n Bonus Language: Jotun<br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/ECL\" rel=\"noreferrer\" target=\"_blank\">ECL</a> +2</td></tr><tr><td><strong>Starting Location:</strong></td><td>Andunor</td></tr><tr><td><strong>Notes:</strong></td><td>Requires Evil Alignment<br/>\n Cannot use tiny weapons<br/>\n Large-sized<br/>\n Requires Greater Award<br/>\n Base Race: <a class=\"postlink\" href=\"http://wiki.arelith.com/Half-Orc\" rel=\"noreferrer\" target=\"_blank\">Half-Orc</a></td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Imp\" rel=\"noreferrer\" target=\"_blank\">Imp</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Str -4, Dex +2, Cha +4<br/>\n (Str -2, Cha +4)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Rogue</td></tr><tr><td><strong>Special Abilities:</strong></td><td>+2 Regeneration<br/>\n Darkvision<br/>\n Invisibility (Level 3) 1/Day<br/>\n Polymorph Self 2/Day<br/>\n Bonus Language: Undercommon<br/>\n Bonus Language: Infernal<br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/ECL\" rel=\"noreferrer\" target=\"_blank\">ECL</a> +3</td></tr><tr><td><strong>Starting Location:</strong></td><td>Andunor</td></tr><tr><td><strong>Notes:</strong></td><td>Requires Evil Alignment<br/>\n Can only use tiny weapons<br/>\n Requires Medium Award<br/>\n Base Race: <a class=\"postlink\" href=\"http://wiki.arelith.com/Halfling\" rel=\"noreferrer\" target=\"_blank\">Halfling</a></td></tr></tbody></table>\n\n Uncommon Races<br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Fey\" rel=\"noreferrer\" target=\"_blank\">Fey</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Str -4, Dex +4, Cha +4<br/>\n (Str -2, Dex +2, Cha +4)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Druid</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Hide +4<br/>\n Move Silently +4<br/>\n Spell Resistance 16, does not increase through levels<br/>\n ECL +2</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor</td></tr><tr><td><strong>Notes:</strong></td><td>Requires 30 <a class=\"postlink\" href=\"http://wiki.arelith.com/Role_Play_Bonus\" rel=\"noreferrer\" target=\"_blank\">RPR</a><br/>\n Requires Neutral Good or True Neutral alignment<br/>\n Base Race: <a class=\"postlink\" href=\"http://wiki.arelith.com/Halfling\" rel=\"noreferrer\" target=\"_blank\">Halfling</a></td></tr></tbody></table>\n<br/>\n<br/>\n<br/>\n<br/>\n Planetouched<br/>\n Planetouched are a type of mortal creatures whose ancestors were extraplanar creatures such as celestials, fiends or elementals. They are considered outsiders. More information about various<br/>\n<br/>\n<br/>\n<br/>\n Planetouched races can be found on <a class=\"postlink\" href=\"http://forgottenrealms.wikia.com/wiki/Planetouched\" rel=\"noreferrer\" target=\"_blank\">FRwiki</a>.The following Planetouched races may selected on-creation by any Human, Half-Elf, Elf, Half-Orc or Dwarf, and require a Greater Award:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Aasimar\" rel=\"noreferrer\" target=\"_blank\">Aasimar</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Wis +2, Cha +2<br/>\n (Wis +2, Cha +2)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Paladin</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Listen +2<br/>\n Spot +2<br/>\n Acid/Cold/Electric Resistance 5<br/>\n Darkvision<br/>\n Spell Like Ability: Light 1/day<br/>\n Bonus Language: Celestial<br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/ECL\" rel=\"noreferrer\" target=\"_blank\">ECL</a> +2</td></tr><tr><td><strong>Starting Location:</strong></td><td>Cordor</td></tr><tr><td><strong>Notes:</strong></td><td>Requires non-evil alignment<br/>\n Requires Greater Award</td></tr></tbody></table>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/Tiefling\" rel=\"noreferrer\" target=\"_blank\">Tiefling</a><table class=\"post_content_table\"><tbody><tr><td><strong>Statistic Modifiers:</strong><br/>\n<strong>Changes On Selection:</strong></td><td>Dex +2, Int +2, Cha -2<br/>\n (Dex +2, Int +2, Cha -2)</td></tr><tr><td><strong>Favored Class:</strong></td><td>Rogue</td></tr><tr><td><strong>Special Abilities:</strong></td><td>Bluff +2<br/>\n Hide +2<br/>\n Cold/Electric/Fire Resistance 5<br/>\n Spell Like Ability: Darkness 1/day<br/>\n Bonus Language: Infernal (if Lawful)<br/>\n Bonus Language: Abyssal (ff Chaotic)<br/>\n<br/>\n<a class=\"postlink\" href=\"http://wiki.arelith.com/ECL\" rel=\"noreferrer\" target=\"_blank\">ECL</a> +2</td></tr><tr><td><strong>Starting Location:</strong></td><td>Andunor???</td></tr><tr><td><strong>Notes:</strong></td><td>Requires Non-good alignment<br/>\n Requires Greater Award</td></tr></tbody></table>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:20 PM - Mar 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's a very comprehensive list of changes, Rua.  Kudos!  There is a way to link to individual posts here on Forumer by clicking on the #[url] link in the upper RH corner of each one and then selecting the appropriate URL to navigate to just the pertinent portion.<br/>\n<br/>\nI still haven't found where katana is considered a light weapon, though.  Is there a reason they chose not to disclose that fact?  <em>Finessable</em> does not mean <em>light</em> as far a dual-wielding is concerned.   A rapier is also finessable, but is not a light weapon so would incure additional DW penalties when placed in the offhand slot.  The only way a katana would become<em> light</em> is to change it from a medium weapon to a small weapon, basically become  part of the dagger class, in which case a halfling or gnome could use it with a shield.  Is that also true?  If that's what they did, have they still maintained the original 1d10 19-20x2 attack properties?  None of this really makes much sense to conceal. <br/>\n<br/>\nThe old PRC had a prestige class that was able to use finesse with the standard medium weapon katana but had to endure the offhand penalties because it did not qualify as a light weapon.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Rua Blackmist",
      "avatar": "10423421_1510287071.jpg",
      "timestamp": "11:49 PM - Mar 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>That's a very comprehensive list of changes, Rua.  Kudos!  There is a way to link to individual posts here on Forumer by clicking on the # link in the upper RH corner of each one and then selecting the appropriate URL to navigate to just the pertinent portion.<br/>\n<br/>\n I still haven't found where katana is considered a light weapon, though.  Is there a reason they chose not to disclose that fact?  Finessable does not mean light as far a dual-wielding is concerned.   A rapier is also finessable, but is not a light weapon so would incure additional DW penalties when placed in the offhand slot.  The only way a katana would become light is to change it from a medium weapon to a small weapon, basically become  part of the dagger class, in which case a halfling or gnome could use it with a shield.  Is that also true?  If that's what they did, have they still maintained the original 1d10 19-20x2 attack properties?  None of this really makes much sense to conceal.<br/>\n<br/>\n The old PRC had a prestige class that was able to use finesse with the standard medium weapon katana but had to endure the offhand penalties because it did not qualify as a light weapon.</div></blockquote>\n  <div align=\"left\">Yes, I forgot to put it up in the original posts here<br/>\n<br/>\n Weapon Changes<br/>\n<br/>\n All the below-mentioned changes are in effect; if you classify to wield a weapon in one hand, you will not be able two use it as a two-handed even if you forego the use of a shield. The same way that the quarterstaff will always be considered a two-sided weapon, and will always attack as a two-sided weapon.<strong>All double-sided and weapons held as two-handed by the character will grant an additional +2 AB</strong>.<br/>\n<strong>Katana</strong>: <ul><li>Can be <em>finessed</em>.</li> <li>Size changed from medium to small (thus smaller races can dual-wield them or use them with shield).</li> <li>Weigh changed from 10 lbs to 6 lbs.</li> </ul><strong>Quarterstaff</strong>: <ul><li>Is now a double-sided weapon, like the double-axe and the two-bladed sword.<ul><li>The offhand damage is based on your base unarmed damage score (default is 1d3, or 1d4 and above for monks).</li> <li>Like other double-sided weapons, its STR damage bonus is 1.0x for the main hand and 0.5 for the offhand attacks.</li> </ul></li><li>Can be <em>finessed</em></li> <li>Benefits from monk's UBAB progression.<ul><li>Cannot be used with Flurry of Blows.</li> </ul></li></ul><strong>Shuriken</strong>: <ul><li>Will benefit from the monk's UBAB progression.</li> </ul><strong>Spear</strong>: <ul><li>Damage lowered from 1d8/x3 to 1d6/x3</li> <li>Size changed from large to Medium, thus they can be wielded with a shield. Smaller characters, such as halfings and kobolds may use them as two-handed weapons.</li> </ul> Note that due to a bug, a spear with shield may not be quickslotted. There's a file to fix this available at <a class=\"postlink\" href=\"https://drive.google.com/file/d/0B5pQO_nzoHexZFZwQThkRlRqYmc/view\" rel=\"noreferrer\" target=\"_blank\">Google Drive</a>, just download and install in the Override folder.<strong>Throwing Axes</strong>: <ul><li>Will work along with Arelith's <a class=\"postlink\" href=\"http://wiki.arelith.com/Barbarian\" rel=\"noreferrer\" target=\"_blank\">Barbarian</a> Rage.</li> </ul><strong>Trident</strong>: <ul><li>Dice changed from 1d8/x2 to 2d6/x3. They are still large weapons, and thus they cannot be wielded with shield.</li> <li>Due to a bug, Weapon Focus feat will not work for tridents.</li> </ul>\n\n As to why it wasn't listed originally. I remembered seeing it, but its in a very obscure part of their wiki. (Not easily found, despite being semi-important.)<br/>\n<br/>\n<br/>\n Feel free to edit it in, I'm afraid to touch it since it sometimes goes empty on me xD<br/>\n<br/>\n Double apologies for the multi posts of information. But, you now have the majority of important build information on three to four posts, instead of having to search 13+ pages to get the same info (all in a neat orderly package. xD)<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:23 PM - Mar 08, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ahhh... very, very good and tyvm.  Dunno how I could have missed it.  I'm such an authority on Arelith! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nSo the katana is a finessable, small weapon with all the properties of the normal weapon, eh?  Quite an exploit IMO.  It's like wielding 2 bastard swords. Just nasty.<br/>\n<br/>\nI do believe Exotic Prof would be the feat of choice in all DEX builds on Arelith in that case.  The quarterstaff also looks interesting for a monk build to bludgeon with both hands.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}