{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Persistent Worlds",
  "forum_id": "002",
  "id": "011",
  "name": "Antiworld",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/antiworld-t2293700.html",
  "author": "Nemusator",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "1.1K",
  "posts": [
    {
      "author": "Nemusator",
      "avatar": "no_avatar.png",
      "timestamp": "7:28 PM - Oct 20, 2012",
      "content": "<div>How to properly start on this topic? I would like to be able to pass the feeling about this world to you. The exact emotion which makes this place so special to me. I guess that we all have our special places and that we feel the same about them.<br/>\n<br/>\nSo, about Antiworld. It is a capture the flag team PVP. You start as level 1, with enough XP to level yourself to lvl 10, and enough gold to buy some basic gear. There is a range rule, so that almighty 40's can't be living it up on weakly 10's. It is very simple in fact. You are allowed to fight only opponents -5, +5 levels from your levels, and you have a player tool which enables you to always see your enemies in range. You are allowed to attack anyone who has your flag. Flag itself gives most xp/gold, but it also gives harsh penalties, like 20% penalty to skills, ab, ac, etc...This can enable a low level to kill a high level, but not so easily if his team guards his back. They are not allowed to attack you unless you are in range, but they can try to bump into you, make a wall or apply similar tactics to protect their flager.  There are lots of maps which are voted by players, players are assigned to either Evil or Good team, basically the concept of ''Red and Blue'' team. There are no alignment restrictions, so you can go paladin/BG f.e. at any time. It is really interesting, because teaming up is the key to the victory. I have seen scores like 400 to 100 and the team who really plays like a team has the upper hand.  There are lots of rules as well. They exist to ensure fair play and a chance for everyone. Here are some basic rules and insights:<br/>\n<br/>\nYou can level up and gain points by killing your enemies or capturing the flag.<br/>\n<br/>\nHit&amp;run rule = If you attack your enemy you are obligatory to stay one round, or 6 seconds in combat before fleeing. You can move towards the enemy or stay foot. So a monk level 40 can't grief you with constant hit and running. If you are a caster, you can cast 2 spells and than run. And yes, I know you can cast ice storm than invis in less than one round if you are really skillful.<br/>\n<br/>\n18 seconds rule = This rule applies to any feat/spell which does more than just physical damage, and it also applies to some powerful feats like smite or death spells and alike.  F.e. anything that can mess up your movement speed like knockdown, balagarn's iron horn, daze, stun, paralyze, taunt,... You are obligatory to wait 18 seconds after the effect wears of to use your ability again. Even with failed attempt you still have to wait 18 secs to reuse, but you can use it again instantly in cases of concentration check failure or if target escapes the radius of effect and doesn't make the check. <br/>\n<br/>\nThere are also some behavioral rules on our server, and I'm sure on plenty of other NWN servers and they make NWN a better place. First of all you are not allowed to swear, taunt, grief or insult anyone. Even arguing is forbidden in shout channel, but players are free to settle their disputes in tell channel if this doesn't disturb the game. By logging into Antiworld you have bounded yourself to play by the rules of the server. If you start breaking rules, players and GM's ( if any of them are online ) will first try to talk to you politely and explain you what are you doing wrong. We try to be as tolerant as possible towards our players. You will get all the help you need form the senior players and the stuff, so don't let this stuff scare you.<br/>\n<br/>\nYou start of in welcome area, a no PVP area, where you have sellers, Antiworld NPC character and an Archivist. You can talk to these two, buy some gear, chill with other players or enter the duel arena behind you where you can duel other players or fight mighty dragons for their spoil...<br/>\n<br/>\nIn front of you a castle will appear, and after you level yourself to 10, you can enter. You will be assigned to one of the teams, and switching to unbalance or a deliberate switch to the winning team is forbidden. On the other hand, it's cool if you are switching to balance. In the castles, there are King of Evil ( Evil castle ), and Queen of Good ( Good castle ). By talking to them you can vote for maps, take your reward if you finish as the first player on the scoreboard. Round begins at hour 12, and ends at hour 5, so it is 17h per round. Now, the MVM's here are really fun. There is a stripper spell which strips away every buff the enemy has and buffs you instead! There is a ring of speed, making you immune to any movement speed decrease while giving you + 4 to ab and maximum number of attacks per round... Immunity ring is my favorite. It gives you epic DR and tons of immunities. Oh, yeah... Only platinum angel and wings are permanent MVM's.<br/>\n<br/>\nWhen you log in, everything you need to know is in your journal and on the boards around you. There are also a lot of languages to chose from. You can level up and gain points by killing your enemies or capturing the flag.<br/>\n<br/>\nThere are no restricted classes.<br/>\n<br/>\nThere has been some class changes. Harper's change is mentioned in my ED MR barbarian thread, and as for PDK's final stand works this way: On click it fully heals you. This effect lasts very shortly, but when the effect wears off, you are back to HP you had before using the feat. Bg and Assassin are allowed to use .2da files which give them some extra abilities. Also, I will add up changes in time. <br/>\n<br/>\nPale Master's AC bonus is halved! ^_^<br/>\n<br/>\nRight now, you don't need more than 10 points in UMD skill. 10 points enable you to use anything which requires UMD.  <br/>\n<br/>\nAll weapons can get maximum of +5 enchantment bonus, ( You use craft in special menu to enchant weapons and ammo ) and all gear maximum +5 bonus to ac, or any ability, with the exception of Hair Horse Helmet ( +6 to wisdom ) and depending of the type of the weapon, +1d8, +1d10,... and so on elemental damage. <br/>\n<br/>\nAlso, it is important to say that in fight, you can't help your ally in any way, if you don't have someone in your range fighting him. <br/>\n<br/>\nThere are some special modules:<br/>\n<br/>\nSudden Death&gt; ( Needed 4 votes from players to go on, or a GM to log it ) All players get teleported to a really nice wilderness scenery, where no range exist anymore, but all other rules still apply... Oh, and no team anymore, this module is all about one player left standing.<br/>\n<br/>\nThe Hunt&gt; ( Only Gm can log this module ) You are ported to an epic jungle where you choose to become a berserker, shaman or an archer. ( These are not standard NWN characters, everything is enhanced ). There are no flags, but the team with more kills wins! After you transform, you have few portals leading you to the jungle... The goal of this game is to stick constantly to your teammates, and find glowing statues in the jungel, which transforms you into epic monsters ( incredible HP, ab, damage, abilities... ) If the enemy team has all monsters, or at least 2, you can transform into the Legend, a specialized monster killer instead of going berserker, shaman or archer. Also, you shouldn't use any feats not given by the creature you got morphed into, and they are located in the cast spell menu. Archers get rapid shot feat.<br/>\n<br/>\n<br/>\nThere are also lots of mods, like Valentine's day, where players pick their valentine, and the most efficient couple gets a valentine's ring each ( + 5 to regeneration ).<br/>\n                                                 Halloween mode, totally different spooky maps are uploaded, and players can chose the appearances of monsters like zombies, werewolves and alike...<br/>\n<br/>\nEveryone is permanently hasted!<br/>\n<br/>\n<br/>\n<br/>\n<a class=\"postlink\" href=\"http://www.antiworld.biz/\" rel=\"noreferrer\" target=\"_blank\">http://www.antiworld.biz/</a> Here, you can find everything you need, join the forum and have some fun.<br/>\n<br/>\nNow for some personal impressions. I found most players of Antiworld to have great sense of humor and that they are very sociable so I had some real fun there... I know I did my best to be an exemplary player, and will never forget moments when I received my titles mentioned in my signature.  Also, <a class=\"postlink\" href=\"http://www.antiworld.biz/antiworld/viewtopic.php?f=1&amp;t=10497\" rel=\"noreferrer\" target=\"_blank\">http://www.antiworld.biz/antiworld/view ... =1&amp;t=10497</a> all ECB members shall receive an instant level 40 with gold needed to buy proper items on the great finale day on 28th October!</div>"
    },
    {
      "author": "TyrTemplar",
      "avatar": "no_avatar.png",
      "timestamp": "10:15 AM - Oct 22, 2012",
      "content": "<div>Thanks for posting and can also see why you enjoy the RDD/AA, heh, heh. Rather enjoy team PvP myself! Sounds like you guys put a lot of thought into Antiworld and gotta say, the \"hunt\" among other things you mention also sound very interesting (an uber shifter? No doubt some here are going to absolutely love that!). Cool concept, and just in time for Halloween! I look forward to reading more about it. In the meantime have just a couple of quick questions for you. See Antiworld's giving away instant experience and gold for all of us here at the ECB which is most kind of you (thank you), and was just wondering whether or not that comes with the 100 Tumble Stone?!!! (I want one of those!!!   <br/>\n<br/>\nAs to Smite, well, that IS what the Pally is all about in the game of \"good vs. evil\" but, yes, does present a bit of a problem for the BG who didn't quite get their proper spell book NWN, I think. Extra abilities you say?  I'll check it out. See the cool-down also applies to IKD, along with the \"hit-and-run\" rule, which I'm assuming likewise applies to things like HiPs as well? Thanks again for posting, and sounds like a fun and interesting place. <br/>\n<br/>\nCheers</div>"
    },
    {
      "author": "Nemusator",
      "avatar": "no_avatar.png",
      "timestamp": "1:32 PM - Oct 22, 2012",
      "content": "<div>When you add one point in tumble skill on any Antiworld character, you automatically receive + 50 bonus to tumble skill to avoid aoo's which can cause much trouble. There is a script to ensure that all of the players play fair and don't molest people out of range. So, f.e., if a level 40 kills a level 10 he automatically gets transformed into a penguin who stays in knockdown for 3 rounds... If level 10 kills a level 40 he becomes a chicken, and if you kill your teammate, you are transformed into a cow. Of course, you get points and gold for killing a flager of any level. You are allowed to kill any higher level enemy or enemy in range who is polymorphed this way. It is important to say that all of these shapes significantly nerf the character's overall statuses. The higher the level killed is, you receive more points and gold, ofc. + 50 bonus to tumble really minimizes the risk of players getting penalized for something which isn't his fault in the first place. Also, every character receives a free spring attack feat, which further diminishes the risk of auto attack and enables casters to cast their spells with less disturbances. The effects of this feat apply, but you still need to take this feat if you are going WM, or if you need that feat as a prerequisite for something... However, ranged enemies will sometimes auto attack random target once their enemy is dead, and if you run by a casting-shooting-fighting enemy, there is a big chance to provoke an aoo. Also, yes, once you exit your stealth mode, you have to wait at least 3 rounds or 18 seconds to reuse the feat. You can use stealth and invisibility instantly though. Although we prefer to have no scripts which block certain actions at all, and enhance a sense of fair play and free will, some scripts were really necessary... F.e., you have 0 points of regeneration per round, so you can easily monitor the duration of one round.</div>"
    },
    {
      "author": "jem",
      "avatar": "no_avatar.png",
      "timestamp": "5:20 AM - Nov 30, 2017",
      "content": "<div>HI my name is jem, some know my old name as bonecrusher, i use to play ctf all the time, neverwinter has now come out with EE and the server could get big ive noticed more activity and im sure when NwNEE fully releases more people will play. At least think about it A guy named Dalamar was trying to email the owners, because if you dont want to host it he was going to ask if he could have the rights to. Please help us!</div>"
    },
    {
      "author": "Grimnir",
      "avatar": "10235237_1517392314.jpg",
      "timestamp": "8:08 PM - Aug 01, 2018",
      "content": "<div>I'll come back and kill you all again.<br/>\n<br/>\nSent fra min SM-G950F via Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "VXer",
      "avatar": "10758931_1531210879.png",
      "timestamp": "11:55 AM - Mar 06, 2019",
      "content": "<div>Maybe they'll open the doors for me again ;)</div>"
    },
    {
      "author": "Luck_Dragon",
      "avatar": "no_avatar.png",
      "timestamp": "5:24 PM - Mar 07, 2019",
      "content": "<div>As a side note if you are looking for a capture the flag type of server - check out Neversummer Realm. nsrealm.com for information.</div>"
    }
  ]
}