{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Persistent Worlds",
  "forum_id": "002",
  "id": "021",
  "name": "Gemstone (Based on the Gemstone IV MUD)",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/gemstone-based-on-the-gemstone-iv-mud-t2293260.html",
  "author": "k1ngk0ngwl",
  "avatar": "10235240_1510287070.jpg",
  "replies": 2,
  "posts": [
    {
      "author": "k1ngk0ngwl",
      "avatar": "no_avatar.png",
      "timestamp": "8:18 AM - Oct 18, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">84.12.13.154:5121<br/>\n<br/>\nLow magic. Been around 10 years.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "1:17 PM - Oct 18, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have never heard of this Gemstone IV MUD you speak of. What is it? Also, is it an action server, RP or what kind? Is PvP allowed, common or exclusive? Do you PvP from the start or only at 40 if at all?<br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "1:40 PM - Oct 19, 2012",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">from wikipedia...<br/>\n\"A MUD ( /ˈmʌd/; originally Multi-User Dungeon, with later variants Multi-User Dimension and Multi-User Domain),[1][2] is a multiplayer real-time virtual world, usually text-based. MUDs combine elements of role-playing games, hack and slash, player versus player, interactive fiction, and online chat. Players can read or view descriptions of rooms, objects, other players, non-player characters, and actions performed in the virtual world. Players typically interact with each other and the world by typing commands that resemble a natural language.<br/>\nTraditional MUDs implement a role-playing video game set in a fantasy world populated by fictional races and monsters, with players choosing classes in order to gain specific skills or powers. The object of this sort of game is to slay monsters, explore a fantasy world, complete quests, go on adventures, create a story by roleplaying, and advance the created character. Many MUDs were fashioned around the dice-rolling rules of the Dungeons &amp; Dragons series of games.\"<br/>\n<br/>\n<br/>\nSo if this world is based on a mud, then someone took a text based world and recreated it in NWN.<br/>\n<br/>\nMost of the mud's i've played on would be difficult to translate over to NWN as the magic systems were totally different.  <br/>\n<br/>\nMight be worth a peek some night i'm bored...<br/>\n<br/>\n<br/>\nConlaoch<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}