{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "024",
  "name": "NWN:EE & DLC Sale",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/nwn-ee-dlc-sale-t2354955.html",
  "author": "Shia_Luck",
  "avatar": "10758897_1524612892.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Shia_Luck",
      "avatar": "10758897_1524612892.jpg",
      "timestamp": "5:50 PM - Nov 22, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Just a heads up for those of you who don’t spend much time on steam and might have missed NWN:EE on sale recently.<br/>\n<br/>\nIt’s on sale again! The best one yet (that I have seen anyway). The base game is at 66% off (£5.26) while the DLCs are 66-75% off. If you buy everything as a bundle then there’s a further 10% off (but be aware the bundle contains some, (expensive to my mind), soundtracks.)<br/>\n<br/>\nSteam<br/>\nNWN:EE  (-66%) £5.26<br/>\nWyvern (-75%) £0.52<br/>\nPirates (-75%) £0.52<br/>\nDarkness over Daggerford:EE (-66%) £2.44<br/>\n<br/>\nN.B. DoD has been finished and enhanced by Ossian and is reportedly a serious step up from the unfinished version they released free to the vault all those years ago when it got cancelled.<br/>\n<br/>\n<br/>\nAt Beamdog.com, the base game is also 66% off (and because I am not logged in I can give you prices in $ tho I haven’t a clue if these are US or Canadian dollars)<br/>\n<br/>\nBeamdog<br/>\nNWN:EE (-66%) $6.79<br/>\nWyvern (-75%) $0.75<br/>\nPirates (-75%) $0.75<br/>\nDoD:EE (-66%) $3.39<br/>\n<br/>\nI believe if you buy from Beamdog you get free steam keys (or you can use their client) but that’s something you’d best double check.<br/>\n<br/>\nLatest updates to EE include NWNSync, so when joining a PW all necessary haks, tlks etc will be auto downloaded (so long as the PW owner has set it up). It’s in it’s infancy atm, but forum posts seem to be positive with no real horror stories so that’s looking good. (Coming soon&gt;&gt;) If you buy the game for Android devices too, then NWNSync will sync your playthroughs and saves across the platforms so you should be able to swicth between devices at will. The Android game is still in Beta atm (and it’s a seperate purchase). I haven’t bought that so don’t have any more info. Check out the forums at Beamdog or their weekly livestreams for more info. (I’d give you a link but the latest windows update seems to have made CTRL+C extremely buggy for me, but it’s an easy search.)<br/>\nHave fun <img class=\"post-image\" loading=\"lazy\" src=\"https://forum.neverwintervault.org/images/emoji/twitter/slight_smile.png?v=6\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:24 PM - Nov 22, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for all that, Shia - much appreciated! I've been umming and ahhing about whether to get EE or not, but given that I think my discs are corrupted I'm thinking maybe I should.<br/>\n<br/>\nJust a couple of questions from a Thick Jack Clot...What's steam (and if the answer is anything to do with kettles I shall frown heavily)? And what's DLC?<br/>\n<br/>\nOh, and on a rough and ready analysis, I think those are American dollars - assuming the exchange rate hasn't soared/plummeted. Making the price the same from Beamdog as from steam.<br/>\n<br/>\nThanks again.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Shia_Luck",
      "avatar": "10758897_1524612892.jpg",
      "timestamp": "8:51 PM - Nov 22, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Stagmeister :)<br/>\n<br/>\nSteam is a digital platform/shop for games. (You might have played Dragon Age and had to use Origin to play it? Steam was the first, Origin is EA's copy). Basically you can buy the vast majority of games on steam. Other online stores sometimes sell steam keys for a game so you'd just enter the key you bought and the game will be downloaded or you but it direct on steam. So, no more discs. Change computer and you just log into your steam account and download the ones you own again. It's a lot easier at the end of the day unless you are on a very slow net connection or a metered one or the internet dies and the world ends, but you'll probably be a bit busy that day to play games ;) (you don't need an active internet to play, only to download). The Beamdog store is a similar platform, but only for Beamdog games, like Origin is only for EA games.  <br/>\n<br/>\nDLC (DownLoadable Content) = expansions/add ons/(anything they can think of selling you in some cases!) for a game. SoU and HotU were expansions originally (but they are now included with the main game in EE, like the Diamond edition did.) The new Darkness over Daggerford:EE DLC sounds very good and isn't always discounted with the rest (and the usual sale price is 50% off, not 66%, so this looks like a good time to buy. (I must remember to get DoD myself when I finish my work). <br/>\n<br/>\nI'll take your word on it about the dollars. Since the Brexit referendum I stopped keeping track of exchange rates cos it is just so depressing now I get paid in £ and not Euros! I think Beamdog is a Canadian company tho, in fact I am sure of it. It's based in Edmonton near Bioware. Trent Oster, the main guy at Beamdog worked on the Bioware games including NWN so at least it seems to be in safe hands. They talk good talk in the main anyway. <br/>\n<br/>\nIf you (or anyone from here) decides to go for it on steam, feel free to send me a friend request. :)<br/>\n<br/>\nHave fun :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KidMiracleman",
      "avatar": "no_avatar.png",
      "timestamp": "2:48 PM - Dec 10, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I bought the EE Deluxe when it first became available.  A bit disappointed since they did not implement any of my suggested improvements.  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}