{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "012",
  "name": "Enhanced Edition for 5$. Should I upgrade to EE if I already own the gold edition from way back then?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/enhanced-edition-for-5usd-should-i-upgrade-to-ee-i-t2355504.html",
  "author": "Mrwrym",
  "avatar": "10759189_1575459447.jpg",
  "replies": "4",
  "views": "301",
  "posts": [
    {
      "author": "Mrwrym",
      "avatar": "10759189_1575459447.jpg",
      "timestamp": "12:17 AM - Jun 29, 2020",
      "content": "<div>I'm a little new to the server as I've never posted before but still love going back to NWN every so often. I'm curious about whether I should get the enhanced edition for 5$ on Steam per the summer sale, but I already own the gold edition from way back in the day on CD. What would be the reason to get the Enhanced Edition for PC, or would I just be wasting money?</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "7:10 AM - Jun 29, 2020",
      "content": "<div>Greetings and hello MrWyrm!<br/>\n<br/>\nEE has higher resolution, keyholing and better network server support, a lot of persistent worlds run on EE only now. <br/>\n<br/>\nFor a casual player wanting to run some of the original campaigns or old custom modules on the NWN Vault, I think the old v1.69 diamond edition would do fine. If you want to log into a persistent world i would recommend EE. <br/>\n<br/>\nThe diamond edition is the product of choice for non EE, however, gold edition - according to Wikipedia says it doesn't include HoTU. Therefore I would recommend getting this for the ability to play characters and load custom modules that require HoTU, therefore in your case it wouldn't be just a waste as you would get something extra to your gold NWN.<br/>\n<br/>\nA little extra too...<br/>\n<br/>\nBeamdog also has a sale at the same time. They write it also provides a steam key, however i cannot see any details of this on their site.<br/>\n<br/>\n<iframe allowfullscreen=\"\" data-s9e-mediaembed=\"reddit\" onload=\"var c=new MessageChannel;c.port1.onmessage=function(e){style.height=e.data+'px'};contentWindow.postMessage('s9e:init','https://s9e.github.io',[c.port2])\" scrolling=\"no\" src=\"https://s9e.github.io/iframe/2/reddit.min.html#neverwinternights/comments/hfszx8\" style=\"border:0;height:165px;max-width:800px;width:100%\"></iframe><br/>\n<br/>\nMight be over soon though. Hope that helps!</div>"
    },
    {
      "author": "Mrwrym",
      "avatar": "10759189_1575459447.jpg",
      "timestamp": "10:04 AM - Jun 29, 2020",
      "content": "<div>Thanks for the response Orion! I'm glad to hear that there are still servers running online for multiplayer! <br/>\n<br/>\nI forgot to mention in the original post that I actually had the Gold edition with HOTU as a separate disc add on. So I totally have most of the content for the game (minus the other modules from platinum). <br/>\n<br/>\nI'm thinking at this point of time (due to quarantine putting me on money saving mode) I might pass on EE for now, and keep an eye out for it in the future. I haven't played the multiplayer in quite a while and am probably far too rusty to enjoy it at my own pace. I appreciate the response and the details towards all of the new content however!</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "11:39 AM - Jun 29, 2020",
      "content": "<div>Great, glad I could help! <br/>\nIf you got Gold + HoTU then that sounds pretty close to diamond so that should be heaps of NWN content plus custom modules in the NWN vault :)<br/>\nUrgh this pandemic!</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "11:48 AM - Jul 01, 2020",
      "content": "<div>Gold isn’t quite Diamond. But both will still require thr critical rebuild. EE for $5?  Seems like a no-brainer. EE requires a bit more muscle under the hood, so if you are banging around on old machine without a dedicated graphics card, then you may need to reconsider. </div>"
    }
  ]
}