{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "009",
  "name": "Thinking about buying EE for my iPad",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/thinking-about-buying-ee-for-my-ipad-t2355635.html",
  "author": "Theophilus Fist",
  "avatar": "10759116_1563898639.jpg",
  "replies": 8,
  "posts": [
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "1:40 AM - Dec 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">New to Mac and never played EE - strictly DE on GOG.  <br/>\n<br/>\n1 - Is anyone here playing the game on iPad?<br/>\n<br/>\n2 - What are the key differences between EE and Diamond Edition?<br/>\n<br/>\nPutting it on my iPad will allow me to play while travelling on airplanes (which I won't be doing until COVID-19 is under control, but in normal times I'd travel frequently for business).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "2:14 AM - Dec 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Theo!<br/>\n<br/>\nThis section is destined for General character-building related discussions (that's why it's in the Character Building section). If you don't mind, I'll move the topic to the General section of the NWN World forums.<br/>\n<br/>\nSo many generals it can get confusing sometimes, I know!<br/>\n<br/>\nAbout your question, I know there are a few differences between EE and Diamond NWN. The ones I know off the top of my head are:<br/>\n<br/>\n1- Assassins no longer fire Death Attacks on all attacks in the first flurry. Only 1 paralysis attempt will be made on the first attack.<br/>\n<br/>\n2- The Dispel magic formula has been fixed, so now you need 25 Caster Levels to be immune to Greater Dispelling.<br/>\n<br/>\n3- They un-hardcoded CEP weapons, which allowed some servers / PWs to add Weapon Focus feats for CEP weapons. This is not available for Single Player AFAIK.<br/>\n<br/>\n4- Graphics are KILLER LOL<br/>\n<br/>\nAbout the Ipad, I really have no idea. I know Asturo played from his phone, so I presume it's doable.<br/>\n<br/>\nCheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "2:18 AM - Dec 15, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "7:41 PM - Dec 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Don't forget that you can't Maximise Rak Icestorms anymore either !<br/>\n<br/>\nThat said quite a few people on the server I frequent atm play on either ipad or phone.<br/>\n<br/>\nFrom my understanding the biggest difference is that you cant mouseover things to look at them, you have to click, which is all well and good until things get hectic.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MentalDekay",
      "avatar": "10759116_1563898639.jpg",
      "timestamp": "8:39 PM - Dec 16, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I almost exclusively play on a ~6\" display on a LG V40, mostly out of convenience (and because my 6y.o. stole my laptop for Among Us). There are plenty of little things that are annoying about it like...<br/>\n- you can't hover over something to see what it is, <br/>\n- moving is \"point there, go there\" unless the pathfinding fails or companions block you (there's an invisible floating Dpad on the left side of the screen that can help a bit)<br/>\n- talking to other players in PWs is hard with the keyboard popping up ruining, to name a few. <br/>\n- Plus it seems to be a major battery hog once you've installed CEP and other large mods/haks thereby consuming much of your device's memory (I've had sporadic luck installing onto an external SD. It worked but it's a PITA getting the mods, haks, erf, bifs, movs to the right folders)<br/>\n- When the last major update (8193?) finally came to Android, it wiped everything including numerous save games.<br/>\n- Expect to be ~6 months behind PC updates (loosing access to any PWs that update)<br/>\n- Sales exclude the additional \"offical\" content like Moonsea, Daggerdale, etc as they are in-app content without price reductions<br/>\n- I've played on my kids' Samsung Tab A (2019). It's not a powerhouse and the performance shows. But maybe Apple does better with older iPads?<br/>\n- Yes, the tiny print on the phone screen has probably aged my eyes more rapidly than necessary <br/>\n<br/>\nBut !!!<br/>\n- the portability is <span style=\"font-size:175%;line-height:normal\"><strong>AWESOME!!!!!!</strong></span> (I can't stress this enough and more than makes up for the price of admission, especially when it goes on sale for $5)<br/>\n- playing PWs is possible<br/>\n- mods work<br/>\n- did I say it was awesome? Because it is so fracking AWESOME to play it anywhere you take your phone/tablet. Car rides? Check. Morning constitutionals? Check. During work meetings (much better when they're on Zoom :P)? Check.<br/>\n<br/>\nPlenty of little nits, but man oh man is it worth it.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:49 AM - Dec 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the post, MD!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:44 PM - Dec 17, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">On a non-technical level, it might be worth noting that Stunning Fist duration has been reduced to 1 round (from 3). Also, for Monk, you can only use it once per day per Monk level, regardless of whether other classes might have added more uses.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Theophilus Fist",
      "avatar": "no_avatar.png",
      "timestamp": "5:10 AM - Dec 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks - I put it on my (high end) iPad.  Haven't  tried to d/l CEP, etc.  MentalDekay was spot on in their observations.  It's a different feel moving and functioning - I'll probably have to stop playing on my laptop and do the iPad exclusively to get comfortable with it. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "MentalDekay",
      "avatar": "10759116_1563898639.jpg",
      "timestamp": "2:54 PM - Dec 23, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Having never been an Apple person, I don't know how they do their folder structures. (Is it a straight up Linux? Or more like an obfuscated Android-Linux?) <br/>\nLet us know how it goes when you do get to installing mods and haks. Where the go, etc<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}