{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "027",
  "name": "Hordes of the Underdark: All Topics",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/hordes-of-the-underdark-all-topics-t2354585.html",
  "author": "HipRedux",
  "avatar": "10577588_1510287072.jpg",
  "replies": "0",
  "views": "749",
  "posts": [
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "12:42 AM - Sep 02, 2016",
      "content": "<div>TOPIC: Chapter 2, Illithid Arena Wagering Fix<br/>\n<br/>\n The following is a reprint of a post by ZFR on May 23, 2011 from the BSN HotU subforum, slightly reformatted, which addresses an issue some have encountered trying to get the Illithid arena fights to work in Chapter 2:\n<blockquote><div>Below is the solution for problems with the arena pit fights in Zorvak'mur, the Illithid city.<br/>\n (Special thanks to The_Krit from the old Bioware forums for helping with his suggestion!)<br/>\n<br/>\nProblem symptoms <ul><li>You keep getting the message \"there is no fight going on, talk to the Pit Boss\" even after placing a bet on the fights.</li> <li>You get stack underflow with the act_q2d2pit_1 script when talking with the pit boss.</li> <li>You get \"UNRECOGNIZED TOKEN\" error when talking to the pit boss.</li> </ul>The solution is as follows: <ul><li>In the nwm folder of your install directory, make a back-up copy of XP2_Chapter2.nwm (so if anything goes wrong you can revert to it).</li> <li>Open toolset. If you can't open chapter 2, simply drag the XP2_Chapter2.nwm into the toolset to open it.</li> <li>Go to the Build menu, and select \"Build Module\".</li> <li>You want \"Unused\" and \"Missing Resources\" to be unchecked, and \"Compile\" to be checked. Before you hit the \"Build\" button, check \"Advanced Controls\" then uncheck \"Creature CR\", \"Encounters\", and \"Palettes\"; you're only interested in compiling scripts. Hit the \"Build\" button.</li> <li>When the build is done, hit the \"Done\" button.</li> <li>Select \"Save\" from the File menu and save the file.</li> <li>Enjoy betting on the fights in the pit.</li> </ul> (Although tested and appears to work perfectly, please don't hold ZFR responsible if anything goes wrong. Remember to make a back-up of the XP2_Chapter2.nwm just in case)<br/>\n  </div></blockquote></div>"
    }
  ]
}