{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "004",
  "name": "NWN 2- any good?",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/nwn-2-any-good-t2355892.html",
  "author": "Dingpot",
  "avatar": "10759398_1682113117.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "10:18 AM - Jan 22, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">I see that nwn2 is 50% off on GOG at the moment. Has anyone got any experience of this game they would care to share?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "11:11 AM - Jan 22, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sure!<br/>\n<br/>\nAdventure good, game engine crap.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:06 PM - Jan 22, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I know that was the quick and dirty, but it is basically true.<br/>\n<br/>\nThe adventure parts of NWN2 (and MotB, SoZ) are good, for the most part.  It's something that Obs tends to do well.  But the rest is a rushed, buggy mess of things.<br/>\n<br/>\nAlso, it is D&amp;D 3.5 based - so that should also be mentioned.<br/>\n<br/>\nIt gives you a 4th Class choice (NWN has three) BUT then goes and limits you to level 30 (WTF Obs!).  And this about sums up NWN2 - it gives you things, but then does idiotic things that makes them \"meh\".  What NWN2 should have done, is INCREASE levels to 50 (or 60!).  Legendary levels.  That would have been GREAT!<br/>\n<br/>\nThen with 4 Classes, things would have been really interesting!<br/>\n<br/>\nSame goes for the Race selection - an expanded on racial selection screen.  But then...oh, the character graphics!  YIKES!  Those Drow faces....NOOOOOO!  And so on.  At least some of the Genasi stuff is ok.<br/>\n<br/>\nThen one has some extra Classes as well (Warlock is pretty good!).  <br/>\n<br/>\nExpanded on Party play.  This is a pretty good feature...until one experiences the AI.  It'll make you pull out your toenails.  With your teeth.  I hope you practice Yoga.  And it was a lot worse before the AI patch (I believe they used Tony K's AI).<br/>\n<br/>\nIs it worth it?<br/>\n<br/>\nAs a stand alone, I'd say yes, the adventure(s) alone are worth it.  But don't expect too much more than that, really.  There are a few DLable adventures (Balder's Gate is good, IWD - though if one has played them in the EE versions, well...yeah) as well as some Stone or other one.  But that is about it.  The Online function is crippled - I hear there might still be some PWs running, but I have no idea how connection to them goes these days.<br/>\n<br/>\nAs for the Toolset, DM Client...meh.  The Toolset is powerful, but the learning curve is YIKES!  The DM Client was, is, and will stay meh.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:07 PM - Jan 22, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It is a mixed feeling, Dingpot, but here are some facts.<br/>\n<br/>\nThe main adventure is meh, but Mask of the Betrayer (the epic part) is good. There is no time stop &amp; no devastating critical, but you'll be able to empower your spells for 1 level only, making empowered horrid wilting as a 9th-level spell through a prestige class. There is an emphasis on many attacks, you can get as many as 17 attacks/round with kamas &amp; perfect two-weapon fighting. There are additional spells like enlarge &amp; mirror image that everyone uses &amp; combined with the lack of TS, favors spell-swords a lot. Barbarians are better than NWN1 &amp; they also have a prestige class named frenzy berserker that <strong>quintuples </strong>their power attack damage. You can set your PA or IE and they <strong>stay</strong> that way until you de-activate them yourself (a nice quality-of-life improvement). <br/>\n<br/>\nThere are some good epic spells like vampiric feast &amp; mass fowl and many more interesting feats that you can select but there are fewer levels to fit them into. Haste does not make you cast two spells/round, you will have to take the epic feats for that, but it is an epic-waste because it only quickens up to 3rd-level spells. So, mages are a lot slower to counter with spells, which favors, once-again, spell-swords that can do anything. The combat animations are weird...some good, some not so good. There are a lot of prestige classes to take &amp; they are interesting but you cannot extend them to epic levels... Heal/harm is up to 150 hit points (thankfully). Knockdown is nerfed but disarm is boosted. You can have up to four classes but only up to thirty levels to fit them in. All levels count as BAB, even epic ones. The basic, average Joe fighter is a fine build (proven in battlegrounds) to take. There are sub-races too and the graphics and music are nice-ish, at least the character models have more polygons, I guess. <br/>\n<br/>\nThere are some good modules to play on NWN2 but nothing in the scale of Aielund, I'm afraid. Still a lot of good, free content though. <br/>\nShould you buy it? I mean, no matter the changes, there are still 100's of hours of gameplay to be had in the game...for $10-15, sure!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}