{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "000",
  "name": "Swordflight",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/swordflight-t2354549.html",
  "author": "Vecho",
  "avatar": "10759398_1682113117.jpg",
  "replies": 86,
  "posts": [
    {
      "author": "Vecho",
      "avatar": "no_avatar.png",
      "timestamp": "2:48 AM - Jun 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hello, i am pretty new here. I don’t know if every one here has played this series, but the series is so good that i can’t resist the urge to post a recommendation for it.For more detail about the mod please refer to the link below, which covers the series quite informatively.  <a class=\"postlink\" href=\"http://lilura1.blogspot.com/2015/02/swordflight-series-part-i.html\" rel=\"noreferrer\" target=\"_blank\">http://lilura1.blogspot.com/2015/02/swo ... art-i.html</a> PS: I am not the author of this blog.   A quote from the coverage above, to give you a quick rundown of what Swordflight is all about.Realmslore, reactivity, resource management, rest restrictions, replayability, quest density, non-linearity, meat-grinder dungeons, TOUGH AS NAILS COMBAT.This is Swordflight - and it's peerless.   For me, Swordflight is hard and satisfying in the same time. I finished the Chapter II two months ago and was informed by the author that Chapter III would come out soon.The series is quite new compared to the Aielund Saga and for that reason bears many merit in design which i appreciate a lot. I recommend everyone give it a try and you will not regret your time spend, especially when you reach the Chapter II.  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:13 AM - Jun 11, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Finally... your official <span style=\"font-size:150%;line-height:normal\"><strong><span style=\"color:#008000\">Welcome </span>to the <span style=\"color:#FF8C00\">ECB Guil</span><span style=\"color:#FFA500\">d</span></strong></span>, Vecho!  ...and apologies for taking so long.  Been busy.<br/>\n<br/>\n You are spot on about this work. This is a good set of modules to highlight.<br/>\n<br/>\n Back in 2010-2011 I was helping rogueknight test out Chapter 1.  He claimed that it was designed for fighter types but I showed how many other classes can have fun and even dominate.  Don't know if my feedback evolved into altering the original design or not (he was trying to make it really tough for non-fighters) but it's an all-around notable piece of work everyone should try out.  He won an AME award back in 2009 for RP value of Chapter One and the fact that it used only vanilla resources (In Chapter Two, he used some fancier tilesets but you still don't need CEP to play it and the story, as usual, is great.).<br/>\n<br/>\n Here are the Vault links:<br/>\n<strong><a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/module/swordflight-chapter-one\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#0000FF\">Swordflight Chapter One</span></a></strong><br/>\n<strong><a class=\"postlink\" href=\"http://neverwintervault.org/project/nwn1/module/swordflight-chapter-two\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#0000FF\">Swordflight Chapter Two</span></a></strong><br/>\n<br/>\n Check the date on Lilura's Blog closer, though: Feb 2015 with no recent comments.  But am trying to stay positive because I'd love to play more of rogueknight's work and this summer would be a perfect time for me.  I choose to believe you got some hot insider information, Mate! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Vecho",
      "avatar": "no_avatar.png",
      "timestamp": "11:06 AM - Jun 16, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">According to the comment by the author in the vault,\" I am hoping to have Ch. 3 out in a month or two, if all goes well.\"<br/>\n Let's just pray.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:42 PM - Aug 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Because I've not got much going on at the moment in NwN (2 running in Aielund and trying to come to terms with an entirely new build - for me - in Shadowlords), I thought I needed to diversify my portfolio. Have thus just downloaded parts 1 and 2 of Swordflight, which seems to have rave reviews everywhere, so thanks for the recommendation, Vecho! Think I'll go with a STR-based Monk - I need something familiar to play with (titters from the cheap seats) while attempting both Cleric and Barbarian for the first time<br/>\n<br/>\n Most noteworthy, however, was that I managed a successful download, first time, without coming to the ECB Guild wringing my hands and pleading for help!<br/>\n<br/>\n I also checked Lilura's blog, and, as at the end of July (this year!) Rogueknight was planning on unleashing Part 3 by the end of August (again, this year!), and Lilura suggests there may be up to 6 parts in total.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Vecho",
      "avatar": "no_avatar.png",
      "timestamp": "1:07 PM - Aug 06, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">lol.<br/>\n I can wait for the sixth part, as long as the author keeps his promise.<br/>\n There is a Chinese wishful way of saying about this though: I wish i can get my hand on the sixth chapter before my death.<br/>\n This saying hints that it will take a very long time before the final chapter come out and i will wait for it until my death.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Lilura",
      "avatar": "10678288_1510287073.jpg",
      "timestamp": "6:19 AM - Aug 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi guys! Great forum you got here. I like the quality of the posting and the clean look of the template.<br/>\n<br/>\n I recently updated my Swordflight blog post to inform readers that I playtested beta version of Swordflight Chapter Three for about a month. Of course, I can't reveal anything other than to say it's gonna be worth the wait!<br/>\n<br/>\n We're probably looking at a late-August release but that is ofc subject to revision by Rogueknight 333 at any time.<br/>\n<br/>\n Upon its release I shall do my best to build a bit of hype for it, but it would be nice if I'm not the only one!<br/>\n<br/>\n Cheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:12 PM - Aug 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Lilura - glad you found us! I believe I commended the Guild to you back in January, when posting my thanks for your Duffers' Guide to Loading Aielund (under my real name, shh, tell no one), and I've since been fairly obsessive about that saga. Thus, am currently taking on Adam Miller's Campaign and Swordflight as a sort of detox.<br/>\n<br/>\n Hope you'll keep dropping in to see us! <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:25 PM - Aug 07, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Lilura wrote:</strong><hr/>Hi guys! Great forum you got here. I like the quality of the posting and the clean look of the template.<br/>\n<br/>\n I recently updated my Swordflight blog post to inform readers that I playtested beta version of Swordflight Chapter Three for about a month. Of course, I can't reveal anything other than to say it's gonna be worth the wait!<br/>\n<br/>\n We're probably looking at a late-August release but that is ofc subject to revision by Rogueknight 333 at any time.<br/>\n<br/>\n Upon its release I shall do my best to build a bit of hype for it, but it would be nice if I'm not the only one!<br/>\n<br/>\n Cheers!<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Hey, Lilura!  We are honored that you decided to join our merry band of obsessed vagabonds and I am personally pleased to hear that the sequel is not just an idle rumor.<br/>\n<br/>\n I've been trying to entice our membership to begin accepting the Neverwinter Vault as a surrogate NWN information bank and discussion venue once the news of the BSN closing had been announced and assure you that we will do all we can to let the community know when the next installment of Swordflight is available for download. Now you have your own thread for status reports away from the hussle-bussle of tech problem solvers.<br/>\n<br/>\n Rogueknight may not remember anymore, but I was one of the responders on the old IGN Vault project page for the first module.  He claimed it was designed for fighter types which I took as a challenge and ended up testing all sorts of classes successfully, reporting my experiences on that old forum thread.  We had a lot of fun exploring aspects of the design (I dabble a bit myself in the design department).  I can't help but wonder if any of our discussions affected the subsequent offerings. At any rate, I am looking forward to the next chapter with bated breath.<br/>\n<br/>\n Don't be a stranger!  There are cookies at stake. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /></div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Lilura",
      "avatar": "10678288_1510287073.jpg",
      "timestamp": "1:59 AM - Aug 08, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the warm welcome, guys! Yay, another NWN hangout. One can never have enough of them!<br/>\n<br/>\n I'm glad to hear that you gave lots of feedback on the original Swordflight, HipRedux. That series (and Snow Hunt) are expertly balanced for (and reactive to) many builds, which I think is quite an accomplishment!<br/>\n<br/>\n Thanks to Vecho for starting this thread, btw.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Lilura",
      "avatar": "10678288_1510287073.jpg",
      "timestamp": "4:24 PM - Aug 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Swordflight Chapter Three has been released, guys. Hope you enjoy it as much as I did!<br/>\n<br/>\n<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/swordflight-chapter-three\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... pter-three</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:42 PM - Sep 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Rude of us to have ignored your post for this long, Lilura. Many thanks for the link and update <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:08 PM - Sep 05, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Your announcement slipped right by me, Lilura.  Except for Stagmeister's reply, I would have needed to wait until the next Vault visit to be informed.  Really great news! <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Lilura",
      "avatar": "10678288_1510287073.jpg",
      "timestamp": "5:34 AM - Mar 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Chapters 2 and 3 have been recently patched, so be sure to redownload them before playing (just the modules themselves).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:35 AM - Mar 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Lilura wrote:</strong><hr/>Chapters 2 and 3 have been recently patched, so be sure to redownload them before playing (just the modules themselves).</div></blockquote>Now <span style=\"text-decoration:underline\">that's</span> what I call service!  Much obliged, Lilura. <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /><br/>\n<br/>\nHave you any idea what the patches addressed?  I never noticed anything unusual in Ch2 and haven't gotten far enough in the latest chapter to be able to encounter much yet.  Do you recommend I start Ch3 over?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Lilura",
      "avatar": "10678288_1510287073.jpg",
      "timestamp": "5:07 AM - Mar 08, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi Hip!<br/>\n<br/>\n Chapter Three:<br/>\n<br/>\n Version 1.02 (March 4, 2017)<br/>\n<br/>\n 1) Added additional dialogue with Zarala (new dialogue becomes available after encounters with assassins, and can be accessed by selecting the \"Let's stop and talk a moment\" conversational option).<br/>\n 2) Tweaked the stats and feats of various creatures to fine-tune combat balance.<br/>\n 3) Increased the gold available to most merchants for purchasing loot.<br/>\n 4) Slightly increased the bonus ammunition appearing in loot to PCs with feats indicating a preference for ranged weapons, and slightly reduced the prices charged by the dwarven merchants selling ammunition and ranged weapons<br/>\n 5) Slightly increased the probabability of map segments being found as loot in the \"Mercenaries and Monsters\" sidequest, somewhat reducing the amount of grinding that will probably be necessary to locate the bonus area.<br/>\n 6) Corrected typos and similiar miscellaneous minor errors.<br/>\n<br/>\n Chapter Two:<br/>\n<br/>\n version 1.06 (August 24, 2016) &lt;- guess this isn't so recent afterall. Time, how it flies..!<br/>\n<br/>\n 1) Fixed a bug allowing one in some conversational paths to see Kalomas Zekar as part of Hamad's quests, before doing the quest involving him assigned by Zarala, potentially introducing some bugs.<br/>\n 2) Fixed a bug that sometimes resulted in Kelem/Chelys being in Stealth and thus very difficult to find when met for a second time in the Desert Dragon Tavern.<br/>\n 3) Fixed a conversational option of the friendly ogre in the Marching Mountains cave which had the wrong conditional script and did not always appear on the correct occasions.<br/>\n 4) Tweaked the alterations to the Gate spell slightly.<br/>\n 5) Miscellaneous minor tweaks and fixes, such as correcting typos.<br/>\n<br/>\n If you're not far into the third chapter then I would probably just start over, yeah.<br/>\n<br/>\n Cheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "10:42 AM - Jun 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi.<br/>\n<br/>\n I'm about to give this series a shot and got a couple questions for those of you who have played it.<br/>\n<br/>\n Are the craft armor/weapon skills really useful? I'm just a couple of hours in and noticed there's tons of crafting components laying around?<br/>\n<br/>\n Is there any \"special\" weapon in the game? I would hate to take a weapon focus and find out 6 levels in that the best weapon in the game is not the one I took weapon focus on.<br/>\n<br/>\n Many thanks.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Lilura",
      "avatar": "10678288_1510287073.jpg",
      "timestamp": "6:59 PM - Jun 21, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">According to Rogueknight (the author), crafting skills are supported, though rather than \"really useful\" it's more accurate to say they're \"not useless.\" The skills themselves may open up dialogue/quest options, too (but nothing major).<br/>\n<br/>\n As for weapons, they are all itemized in Swordflight (and Snow Hunt); both unenchanted and powerful magical versions are included for all weapon types, though some types may be found sooner than others. You can gain foreknowledge by consulting the walkthroughs, I suppose.<br/>\n<br/>\n Btw, it's best to ask these sorts of questions on the Swordflight neverwintervault.org entries (<a class=\"postlink\" href=\"https://neverwintervault.org/tags/swordflight\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/tags/swordflight</a>) in order to get a response from Rogueknight himself, who I don't think is registered here.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Pelagius",
      "avatar": "10753075_1529052830.jpg",
      "timestamp": "12:21 AM - Jun 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks!<br/>\n<br/>\n No need to ask rogueknight himself, since you already gave me the answers I was looking for. I was trying to sort that out wihout getting spoilers, you see.<br/>\n<br/>\n Will pass the crafting skills and focus on longswords, since they're probably the most common weapons anyway.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "alordofchaos",
      "avatar": "no_avatar.png",
      "timestamp": "8:52 PM - Aug 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Pelagius wrote:</cite>Will pass the crafting skills and focus on longswords, since they're probably the most common weapons anyway.</div></blockquote>\nI know this is an older post, but in case anyone runs across this - I'm a goodly way through Chapt 2.  Did weapon focus/weapon spec in longsword.  So far, (slight spoiler ahead, in white font, so select the next line to read - white text follows),<br/>\n<span style=\"color:#ffffff\">there </span><span style=\"color:#ffffff\">were no magic longswords in Chapt 1, and I bought a magic longsword +1 in Chapt 2; have not seen nor found another magic lonsgword since.  There are some +2 weapons with extra elemental damage, but none of them are longswords.  No bastard swords yet, one great sword, Vermin Bane</span>.  <span style=\"color:#ffffff\">A couple of +2 scimitars, a +2 shortsword with d4 neg energy damage, and another special short sword purchasable at an orcish merchant deep in the sewers that can later be upgraded with a gem.  there are also two good rapiers so far, but one is restricted by  alignment, I think it was, and my UMD is not high enough </span><br/>\n<span style=\"color:#ffffff\"><span style=\"color:#000000\">End spoilers.  Currently Ftr 9/ Rog 4/SD 1, I think, not positive on Rogue levels</span></span><br/>\n<span style=\"color:#ffffff\"><span style=\"color:#000000\">Not a lot of purchasable magic yet (just finished killing the lead goblins in the forest castle, haven't done the desert ones yet)</span></span><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:27 AM - Jan 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just came to my attention that Swordflight ch. 4 has been released (a month ago, in fact).<br/>\nIt offers over 30 hours of gameplay and advances the player from about 25th to 33rd level.<br/>\nIt takes place in Underdark. <br/>\n<br/>\nHere's the link =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/swordflight-chapter-four\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... apter-four</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:16 PM - Jan 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good news! I really must get round to playing this one (I've only done the first part to date) - it has rave reviews and would seem to suit my \"Hulk bash, Hulk smash!\" nature. Thanks, Valerfor!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "1:16 AM - Jun 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just read Lilura's review of this series and can't wait to get stuck in to it. I've got lots of other modules to nail first though. I remember in 2008 I went back to my persistent world after a couple years away and it was nearly deserted. It was depressing to see my favourite game disappearing before my eyes. But now, with high quality modules still being produced over a decade later, I'm confident the game will go on and on. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "8:24 AM - Jun 24, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ok, after my previous, exuberant post, the beginning of this is the most frustratingly difficult module I've ever played. Sooooo tough. Playing a rogue.<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:29 PM - Jun 24, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">You like it hard eh?<br/>\n<br/>\nYou do know that this is one of the toughest modules in Neverwinter Nights &amp; yet you elect to go with a rogue despite Lilura clearly showing a Scyther in his review. <br/>\n<br/>\nExpect Rogueknight to not show any mercy towards you but if you survive...That's brag rights in my book eltalstro ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "1:40 AM - Jun 25, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>You like it hard eh?<br/>\n<br/>\nYou do know that this is one of the toughest modules in Neverwinter Nights &amp; yet you elect to go with a rogue despite Lilura clearly showing a Scyther in his review. <br/>\n<br/>\nExpect Rogueknight to not show any mercy towards you but if you survive...That's brag rights in my book eltalstro ;)</div></blockquote>Yeah, those are rights I will never gain, Valerfor. I've played a lot of modules on \"Very Difficult\" but this is next level even on D&amp;D hardcore. Apart from being insanely hard, I quite like it so far.<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:01 AM - Jun 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's fine eltalstro, whatever doesn't kill you, makes you stronger (and a better player)!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "1:29 AM - Jun 26, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah started again with a barbarian who will be barbarian, rogue, ranger. Going a lot better.<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:26 PM - Jun 27, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good, keep us updated eltalstro.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "10:11 PM - Jun 27, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ok,<br/>\n<br/>\nDay 2: Worst henchman ever! The don't disable traps command has no effect and the combat option to move to range and stay out of the melee isn't available. I hate her.<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:29 AM - Jun 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, RogueKnight talked about that on Lilura's site &amp; basically told him that he wanted to be that way, basically, you, micro-manage them (henchmen) &amp; keeping them alive was an added challenge.<br/>\n<br/>\nI will say that I am not fond of this, but it is what it is.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "3:42 AM - Jun 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah it is super frustrating when she comes right up to the melee even with no PBS and then gets nailed with AOO everytime she attacks. Kind of ruins what is otherwise a very good module. When compared to Aielund it is much more annoying which isn't a virtue. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:37 AM - Jun 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I know...I can't stand idiotic NPCs at all, especially when I play on high-level action.<br/>\n<br/>\nOn the other hand, Aielund spoiled us all, long time ago...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:57 AM - Jun 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Please correct me if I'm wrong here, but isn't she supposed to start off rubbish then she learns from your interactions and how she's treated, 'cause she's ultra-important to the plot?<br/>\n<br/>\nI may be wrong, 'cos it's been a while...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "9:06 AM - Jun 28, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>Please correct me if I'm wrong here, but isn't she supposed to start off rubbish then she learns from your interactions and how she's treated, 'cause she's ultra-important to the plot?<br/>\n<br/>\nI may be wrong, 'cos it's been a while...</div></blockquote>That's what I surmise, Stag. I get that she's supposed to be green but it's still quite infuriating. Reminds me of coaching kids sport. \"No don't go there! Why would you do that? No! Don't do that now! Arrrrgh! What? Why?\" I just hope it doesn't stay like that as far as NPC AI goes. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:01 PM - Jul 05, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Any updates from Swordflight eltalstro?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "12:12 AM - Jul 06, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote:</cite>Any updates from Swordflight eltalstro?</div></blockquote>It's the best module I've ever played. I'm now playing a half-orc, barbarian, ranger, rogue and he seems to be holding up pretty well. The initial henchman issue was actually an interesting touch but I just ended up letting her die over and over otherwise it would have been way too much of a drain on resources. The only other things I would quibble about so far are (spoiler alert) the alignment shifts toward evil for things that are not really evil like stealing which I would rate more as chaotic depending on what is stolen, who it is stolen from and the manner in which it is stolen. I also thought it was a bit jarring seeing a 7 foot tall gnoll (with a halberd dripping acid onto the floor) just casually standing in the middle of a tavern while no one bat's an eyelid but hey, some strange stuff happens in Faerun.<br/>\n<br/>\nWhat I really like is that it's set in Faerun, it's bloody challenging, it's huge in its scale, it is non linear and you can easily end up somewhere that you have to RUN AWAY from. I've had a few times where I've gotten so engrossed that I've forgotten to save, wandered into a really difficult fight and died. It definitely keeps you on your toes. <br/>\n<br/>\nI'm considering putting points into intimidate due to the frequency of dialogue choices between persuade, intimidate and bluff. Incidentally, It has always annoyed me that intimidate is based solely on charisma. I think STR is more appropriate or a combination of STR and CHA and possibly INT or WIS for bluff. It has always seemed odd that all of the conversation skills are based solely on CHA. I guess it's for balance but I find it odd. <br/>\n<br/>\nAnyway, I'll need to figure out what skills to sacrifice somewhat. It's very difficult because the module is demanding, making it a real challenge to deal with the opportunity cost. Plus, I'm starting with a -2  modifier for CHA. But I feel pretty strongly that the game would open up significantly with a strong intimidate check. Any suggestions about how many points to sink into it?<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:06 AM - Jul 07, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Nice, eltalstro, do keep us updated please.<br/>\n<br/>\nIt's the Dark soul's phenomenon eh? You're addicted to the harder gameplay &amp; trying to overcome it, cool.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "2:16 AM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was being a bit of a sissy before about the difficulty of the Sifting Sands intro. (spoilers ahead) Have played through the rat quest and sewers a number of times now with a rogue with little trouble. It's as the readme says, you need to use all resources at your disposal. I think I was also getting some terrible rolls. <br/>\n<br/>\nSpeaking of which I started a playthrough with the half orc of doom build but have really struggled in the spider caves. With no spot and no heal it really is a chore. Antidote potions are prohibitively expensive and even with a supplemented fort save of 9 at level 3 against a DC of 18 you're going to get poisoned on 40% of a spider's poison attacks. I didn't have this issue with my rogue fighter who had 6 heal skill points at the same stage. I expect the same thing will happen with disease in the crypts. Besides doing the smart thing and not venturing into a cave full of giant venomous spiders and undead what's a good solution here? <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:29 AM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What level are you?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "2:55 AM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Level 3. And I should have said on 40% of a spider's poison attacks which hit. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:11 AM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Somewhat off-topic, but just thought I'd I'd wish your boys all the best for the cricket later today, eltalstro (I seem to remember you're a kiwi). I<em><strong> thought</strong></em> I would...but I can't bring myself to do it, sorry!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "4:27 AM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote:</cite>\nSomewhat off-topic, but just thought I'd I'd wish your boys all the best for the cricket later today, eltalstro (I seem to remember you're a kiwi). I<em><strong> thought</strong></em> I would...but I can't bring myself to do it, sorry!<br/>\n<br/>\nCheers\n</div></blockquote>\nHaha! Likewise, Stagmeister. I haven't watched a single delivery during this world cup but I'm going to watch the final at my mate \"Pommy\" Dave's place. Starts at 9 PM and finishes around 5 AM. I have a feeling Monday will be a low productivity day all across NZ. K1W1! <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "6:02 AM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Actually, disregard this latest winge. Ironguts and endurance potions lower the poisoning risk to 20% on each hitting poison attack. Rage on top lowers the risk to 15% which I can live with. Again, the readme advice of using all available resources in order to survive is a mantra for Swordflight. It is obvious Rogueknight put a tremendous amount of thought into these modules.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:24 AM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ironguts pot...I have to use this thing since...well never. Damn, just get a huge Half-Orc fighter with 20 strength &amp; a Greatsword the size of a tree &amp; great cleave those bastards left &amp; right! Sometimes, offence IS the best defence.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "6:33 AM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Tried to go PA then Cleave then Heavy Armour prof instead of taking HAP first. I generally like to take Cleave ASAP but at level 3 I changed my mind. About time for some better armour.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:44 PM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I was thinking of adding Swordflight to my to-play list, with this build that gave me my easiest play-though yet in SoU, HotU, and Sands of Fate:\n<details><summary>Spoiler</summary>\nEmpyre's Devastator 2b (Rogue 7 / Fighter 8 / Weapon Master 25)\nPlayable 1 - 40, PvM\nAbilities:\nDEX: 13\nWIS: 8\nCHA: 8\nLeveling Guide:\n01: Rogue(1): Dodge, Mobility\n03: Fighter(2): Expertise, Blind Fight\n05: Fighter(4): Weapon Specialization: Scimitar\n07: Rogue(2): {Evasion}\n09: Weapon Master(1): Improved Critical: Scimitar, Weapon of Choice: Scimitar\n11: Weapon Master(3)\n13: Weapon Master(4)\n15: Weapon Master(6): Cleave\n17: Rogue(4)\n19: Weapon Master(9)\n21: Weapon Master(11): Great Strength I, (STR=23)\n23: Weapon Master(13): Overwhelming Critical: Scimitar\n25: Weapon Master(15)\n27: Rogue(5): Great Strength III, (STR=26)\n29: Weapon Master(18)\n31: Fighter(7)\n33: Weapon Master(20): Great Strength V, (STR=30)\n35: Weapon Master(22): Armor Skin\n37: Rogue(6)\n39: Weapon Master(25): Great Strength VII, Epic Prowess, (STR=33)\n\nHitpoints: 452\nSaving Throws (Fortitude/Will/Reflex): 21/15/24\nBAB: 29\nAC (naked/mundane armor/shield only): 21/32\nAlignment Changes: 0\nSkills:\n\n02: Discipline(5), Lore(1), Save(15)\n04: Discipline(1), Lore(1), Save(21)\n06: Discipline(1), Lore(1), Save(27)\n08: Discipline(2), Lore(1), Save(9)\n10: Discipline(1), Lore(1), Spot(1), Save(12)\n12: Disable Trap(5), Lore(1), Search(5), Spot(1), Tumble(5), UMD(5), Save(3)\n14: Discipline(1), Spot(1), Save(8)\n16: Discipline(1), Spot(1), Save(14)\n18: Discipline(2), Spot(1), Save(6)\n20: Discipline(1), Spot(1), Save(12)\n22: Discipline(1), Spot(1), Save(18)\n24: Discipline(1), Spot(1), Save(24)\n26: Discipline(1), Spot(1), Save(30)\n28: Discipline(2), Spot(1), Save(2)\n30: Discipline(1), Spot(1), Save(8)\n32: Discipline(1), Save(16)\n34: Discipline(1), Spot(1), Save(20)\n36: Discipline(1), Spot(1), Save(26)\n38: Discipline(2), Lore(2), Spot(1)\n40: Disable Trap(3), Lore(4), Search(3), Spot(1)</details><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:19 PM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I really like the look of this one, Empyre. My only question would be whether Mobility or Expertise would be better at level 1 (remembering the ignominy of being killed by rats there - like I was when I first played Aielund as well) - and I simply don't know. It's a pretty unforgiving module with strict resting restrictions (including the risk of on-rest enemy spawns, which ain't what you need), and even you, I suspect, will need to use more pots (and with that will save, clarity pots will be a must) and such than usual. It's probably closer to WoG than any other modules around. I'm no expert, though. I just remember it hurts.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:35 PM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Maybe I should take the skill point loss of taking Rogue 1 at level 2, so I could have 2 higher AB at level 1 (1 from BAB and 1 from Weapon Focus), as well as swapping Expertise and Mobility.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "11:01 PM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote:</cite>Maybe I should take the skill point loss of taking Rogue 1 at level 2, so I could have 2 higher AB at level 1 (1 from BAB and 1 from Weapon Focus), as well as swapping Expertise and Mobility.</div></blockquote>You could definitely do it as planned above, Empyre. The lowish DEX will hamper you a bit at L1 but just use every resource available to boost AC and you should be fine.<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:44 PM - Jul 14, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">eltalstro, my friend, what a match that was today!<br/>\n<br/>\nI truly believe the victory should be shared - and that's always been one of the wonderful things about cricket, it's not always about the winning. Not true in rugby, obviously, but definitely in cricket. Am currently raising a glass to the Black Caps - take great pride in Kane Williamson and the boys - great sportsmen all.<br/>\n<br/>\n(I know this has zero to do with the thread, but I first raised it, so feel justified - sorry, everyone else)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "12:08 AM - Jul 15, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I went to sleep at 4 AM and the required run rate was around 5.5 while the avg was 3.something. I thought we had it in the bag. Natural ones and twenties were being rolled with some consistency at the end it seems. Full credit to England <img class=\"emoji-placeholder\" src=\"emoji/dummy.png\" /> though on a great victory in what is being hailed as the greatest ODI in history!<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:55 AM - Jul 15, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I would say, give it a go as it is Empyre, this is one of your best builds, hands-down. <br/>\n<br/>\nAlso, mobility will help a lot versus attacks of opportunity as you move around.<br/>\n<br/>\nOr simply learn to shift-click in combat to walk &amp; avoid them entirely.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:39 PM - Aug 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have just finshed part 1 and 2. The story is great and the Calimshan setting is done very well. The modules are hard, and unusually well balanced for melee characters. Rest restrictions will make it hard for casters, but there are ways to circumvent that. It was a bit unusual that thievery gave an evil alignment change, and not the chaotic that we are used to, so be careful if you want to play a good aligned rogue. The death and respawn system is a bit unusual, but is in line with the story, and offers a \"pocket plane\" where you can recover before reentering the story where you left. Death has an xp and gold penalty though.<br/>\nThe first module was short, ending at lvl 5. I started out with a level 1 dex based ranger (yes, I do love the challenge). And that was an uphill battle all the way, always wanting better weapons and equipment, always wondering if I had enough potions to survive, and enough trap components to be able to deliver some punch in the next tough encounter. It added to the challenge that I had to baby-sit a hench-woman essential to the plot.<br/>\nThe second module is gigantic and offers a lot of free roaming. It has many optional quests and even class specific quests, but becomes more plot-driven after a while. The city has layers upon layers of of areas to explore. The final part on the other hand is far more linear. The module has several henchmen to choose between, but for the most part they are not forced upon you. The equipment gets far better in the late part. I think my character ended at level 16. <br/>\nPart 2 is one of the best modules I have ever played. It is challenging and rewarding, the plot line has the drive and depth of a good novel, and there are dialogue options that makes it natural to play all alignments.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:54 PM - Aug 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yes, I have also read the best comments, for the 2nd module in the series.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "7:45 PM - Aug 02, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In my opinion, the second chapter is above all others for story and depth. Third and fourth chapters still greatly deserve many playthroughs, not only one, even if they are much more geared to combat.<br/>\nI like the fact that in Chapter 2 the babysitting activity is very limited or nil (loved Snajagh, the cleric gnoll with an halberd with acid damage!), for subsequent chapters it will be an heavy activity...but, if you see the glass half-full, you have a level 16 bard song that is always welcome (even if she spams it, don't matter which enemy you face)  ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "i300",
      "avatar": "no_avatar.png",
      "timestamp": "7:18 AM - Oct 15, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">As far as challenge/game balance, Swordflight is hands down the most satisfying singleplayer NWN gameplay experience I've seen so far. It kind of spoiled me for all other modules, even Aielund, because they all feel watered down/too easy/too generous in comparison.  And the story/RP aspect is very solid, though parts  of ch4 start to feel a bit grindy with day after day of slogging through tough Underdark encounters - but at least they're well designed encounters.<br/>\nMain downside is the wonky companion ai. If Rogueknight someday implements the new henchmen control system that updated Aielund uses, it'd be a dream come true.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "4:57 PM - Dec 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Greetings all<br/>\n<br/>\nJust came across this thread and have downloaded all 4 chapters, always like to be ambitious. Empyre's devastator looks an awesome build for first timing through any module. Is that build in the epic build forum anywhere, I couldn't immediately find it. <br/>\n<br/>\nWas there a consensus on taking rogue 1 at lvl 2 and taking the skill point hit? Also is expertise deemed better than mobility at lvl1?<br/>\n<br/>\nI saw in the readme that an evil character will have more options than a good one, but sounds a tough module to try my first Blackguard play experience, I was about to try GDL's infernal mistress there.<br/>\n<br/>\nAny thoughts from the experts? <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:25 PM - Dec 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It is not in he epic build forum, but there must surely be several almost exactly the same, which would make it inappropriate for me to add yet another.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "5:29 PM - Dec 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Valerfor wrote: <a data-post-id=\"13565\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=13565&amp;sid=8d603193bee9932ff85033bcbe2cfcbb#p13565\">↑</a><div class=\"responsive-hide\">Jan 05, 2019</div></cite>Just came to my attention that Swordflight ch. 4 has been released (a month ago, in fact).<br/>\nIt offers over 30 hours of gameplay and advances the player from about 25th to 33rd level.<br/>\nIt takes place in Underdark. <br/>\n<br/>\nHere's the link =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/swordflight-chapter-fourI\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... pter-fourI</a> sy</div></blockquote>\nIs this just for EE or for 1.69 as well?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:53 PM - Dec 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Maximillian_Kane wrote: <a data-post-id=\"23305\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=23305&amp;sid=8d603193bee9932ff85033bcbe2cfcbb#p23305\">↑</a><div class=\"responsive-hide\">Dec 28, 2020</div></cite><blockquote><div><cite>Valerfor wrote: <a data-post-id=\"13565\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=13565&amp;sid=8d603193bee9932ff85033bcbe2cfcbb#p13565\">↑</a><div class=\"responsive-hide\">Jan 05, 2019</div></cite>Just came to my attention that Swordflight ch. 4 has been released (a month ago, in fact).<br/>\nIt offers over 30 hours of gameplay and advances the player from about 25th to 33rd level.<br/>\nIt takes place in Underdark. <br/>\n<br/>\nHere's the link =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/swordflight-chapter-fourI\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... pter-fourI</a> sy</div></blockquote>\nIs this just for EE or for 1.69 as well?</div></blockquote>\nFrom what I can gather, Max, all 4 current chapters were certainly available for both EE and 1.69 as at February 2020 (and EE was a bit buggy still). Afraid I don't know any more...<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "6:02 PM - Dec 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I only have 1.69 not EE and it downloaded OK along with the underdark hak, obviously not tried to play  it yet. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "6:06 PM - Dec 28, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Empyre65 wrote: <a data-post-id=\"23304\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=23304&amp;sid=464898ac260aa8f55962c7038fb8df73#p23304\">↑</a><div class=\"responsive-hide\">Dec 28, 2020</div></cite>It is not in he epic build forum, but there must surely be several almost exactly the same, which would make it inappropriate for me to add yet another.</div></blockquote>\nOddly enough I could only find one on the old Greyhawk epic character search engine with the exact same level split which was Stalwart Warrior by Cinnabar Din and that focused on CON rather than STR.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "3:32 PM - Dec 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey guys, I was trying to download these modules, but I couldn't find the CTP files I'm supposed to download. Can anyone help me?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "4:09 PM - Dec 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The link from Swordflight chapter 2 works fine for me, leads to the Community Tileset Project: <br/>\n<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/hakpak/tileset/community-tileset-project\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... et-project</a><br/>\n<br/>\nWhen you scroll down you find links to other CTP stuff, like CTP Babylon, CTP Generic Doors, ...<br/>\n<br/>\nThe only link that doesn't seem to work is the one to \"CTP Release One Complete Documentation\", but I don't think that is needed for Swordflight.<br/>\n<br/>\nOr is it something else you can't find?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "4:43 PM - Dec 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Freaky Grandma wrote: <a data-post-id=\"23314\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=23314&amp;sid=464898ac260aa8f55962c7038fb8df73#p23314\">↑</a><div class=\"responsive-hide\">Dec 30, 2020</div></cite>The link from Swordflight chapter 2 works fine for me, leads to the Community Tileset Project: <br/>\n<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/hakpak/tileset/community-tileset-project\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... et-project</a><br/>\n<br/>\nWhen you scroll down you find links to other CTP stuff, like CTP Babylon, CTP Generic Doors, ...<br/>\n<br/>\nThe only link that doesn't seem to work is the one to \"CTP Release One Complete Documentation\", but I don't think that is needed for Swordflight.<br/>\n<br/>\nOr is it something else you can't find?</div></blockquote>\nThanks, FG! I found it, do I need to download everything or just the files listed in the Readme?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "4:45 PM - Dec 30, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I never tried Swordflight, but you probably only need the files listed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "11:17 PM - Dec 31, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey guys!! I started a run through the 1st module, and so far it's AMAZING! I'm still in the desert ruins, but the story and feel are off the charts! It's a little on the easy side given how little damage the enemies do, but less so than other Single Player modules. What makes it harder are the fact you need to fight many enemies at once, and there's a severe lack of safe resting spots, which for melee toons isn't a problem, but for casters might be a nightmare. I'm using Yoshimo (STR version) on this playthrough, and he's doing great! It's really low magic, so spending all your gold on consumables is absolutely essential! The only thing I don't like about it so far is the fact that you NEED Rogue skills so much, but being a sible player module, you can't rely on party members, and that henchwoman is, well, horrible LOL. I think that playing any non-rogue seems undoable without missing out on a lot of things from what I've seen so far.<br/>\n<br/>\nStill, I'm very happy with the way the story is developing! Let's see where it leads!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "8:51 PM - Jan 01, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Easy is relative to playing skill Max. I went through about 20 deaths before level 2! Currently level 3 and still very tricky for me. It's good through.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "9:43 PM - Jan 01, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Try Max's guide to playing better, Ding Pot. I found some good tips in there. The important thing about SF imo is dealing with enemies in small numbers (Those rats!) Trying to lure them away is a good ploy. The readme has a lot of good tips too as far as I remember.<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?t=2354384\" rel=\"noreferrer\" target=\"_blank\">viewtopic.php?t=2354384</a><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "1:25 AM - Jan 02, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Dingpot wrote: <a data-post-id=\"23339\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=23339&amp;sid=464898ac260aa8f55962c7038fb8df73#p23339\">↑</a><div class=\"responsive-hide\">Jan 01, 2021</div></cite>Easy is relative to playing skill Max. I went through about 20 deaths before level 2! Currently level 3 and still very tricky for me. It's good through.</div></blockquote>\nThat's why I tell youthat Expertise / Taunt at level 1 makes a world of difference. How high do you think a rat's Concentration is? Even if your Taunt is low, all you need is to get lucky with your roll and you can attack the rats without penatlies. I'd also suggest spending all your gold on Barkskin Potions in chapter one. Trust me, they'll be invaluable!<br/>\n<br/>\nGood luck! I've already started Chapter 2 and it's even better than the first!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "6:37 PM - Jan 02, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">My respect to anyone who figured out the statue puzzle without using the walkthough. I would have been there until next Christmas! Even when i cheated I had to read it about 10 times before it made sense!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "gkorjax",
      "avatar": "no_avatar.png",
      "timestamp": "7:25 PM - Jan 02, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">One can actually try to taunt without any points in the skill..it's sort of basically a contest of d20s with many monsters at low levels, and with expertise, there really isn't a downside to trying...<br/>\n<br/>\nSent from my Pixel 3 using Tapatalk<br/>\n<br/>\n<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Skeleton Pope",
      "avatar": "no_avatar.png",
      "timestamp": "7:40 PM - May 07, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Just started a playthrough of this excellent module with a modified Lord of Terror Shifter build.<br/>\n<br/>\nThe writing is top notch and the roleplay is amazing, Im playing my guy as neutral evil psychopath who was born physically weak in a tribe of barbarians, so he seeks to transcend his fraility through nature magic.<br/>\n<br/>\nChapter 1 was made easy with good consumable usage and lots of minor holy traps, so anyone struggling on some encounters remember that 7 skill points and less than 50 gold solve alot of problems. I can't imagine doing swordflight chapter 1 without some rogue skills. I also highly recommend atleast 1 conversation skill as you miss out on tons of fun dialogue, extra rewards, and XP without them.<br/>\n<br/>\nCurrently just started Chapter 2, A flame berried, bulls strengthed, cats graced, barkskinned, awakened (from a rod), dire wolf is easily chewing through encounters with my main character tanking and taunting or shooting his +1 short bow with negative damage arrows. I also have found a lot of good conversational uses for animal empathy and quite a few strong animals to dominate so I recommend that skill for chapter 2.<br/>\n<br/>\nMy only annoyance is the build will end up with uneven dex, but from my scouting it seems I can only reasonably hit +9 dex bonus with shifter limitations in swordflights lootpool so I opted for the extra con and strength for an easier early game.<br/>\n<br/>\nAnother note: DO NOT play my build without serious shifter experience, the ac will only be equivalent to a strength based sword and shield character, so mediocre and the ab is also lackluster. The strengths are Druid scrolls, great druid gear available, combat useful social skills, a pile of immunitys and a strong weapon for a low magic module. Swordflight also has a massive amount of consumables of all types that don't require UMD, haste gear, and customizable gear which greatly benefit shifters.<br/>\n<br/>\nHeres my build for those curious:<br/>\n<br/>\nJarrok Grimgor, Uthgardt Outcast<br/>\nHuman<br/>\nNeutral Evil<br/>\nBarbarian 16/Druid 7/Shifter11<br/>\n <br/>\nStr 11<br/>\nDex 17(25)<br/>\nCon 10<br/>\nInt 14<br/>\nWis 13<br/>\nCha 8<br/>\n <br/>\n1 Barbarian1: Weapon Proficiency Exotic, Toughness<br/>\n2 Druid1<br/>\n3 Druid2: Expertise<br/>\n4 Barbarian2<br/>\n5 Druid3<br/>\n6 Druid4: Blindfight<br/>\n7 Barbarian3<br/>\n8 Druid5<br/>\n9 Barbarian4: Alertness<br/>\n10 Barbarian5<br/>\n11 Shifter1<br/>\n12 Shifter2: Weapon Focus: Greataxe<br/>\n13 Shifter3<br/>\n14 Shifter4<br/>\n15 Barbarian6 Weapon Focus: Scythe<br/>\n16 Shifter5<br/>\n17 Shifter6<br/>\n18 Shifter7: Improved Critical: Scythe<br/>\n19 Barbarian7<br/>\n20 Druid6<br/>\n <br/>\nEPIC<br/>\n21 Shifter8: Armorskin<br/>\n22 Shifter9<br/>\n23 Shifter10<br/>\n24 Shifter11: Undead Shape<br/>\n25 Barbarian8<br/>\n26 Barbarian9<br/>\n27 Barbarian10: Epic Weapon Focus: Scythe<br/>\n28 Barbarian11<br/>\n29 Barbarian12<br/>\n30 Druid7: Epic Prowess<br/>\n31 Barbarian13<br/>\n32 Barbarian14<br/>\n33 Barbarian15: Terrifying Rage<br/>\n34 Barbarian16<br/>\n <br/>\nSkill Points: 259<br/>\nAnimal Empathy 23(22), Craft Trap 19(21), Disable Trap 1(3), Discipline 37(37), Intimidate 37(36), Listen 37(41), Open Lock 1(8), <br/>\nSet Trap 1(8), Spellcraft 33(35), Taunt 37(36), Tumble 15(22)<br/>\n <br/>\nSkill Point Leveling Order:<br/>\n1 Craft Trap(2), Disable Trap (2), Discipline(4), Intimidate(4), Listen(4), Open Lock(2), Set Trap (2), Taunt(4), Tumble(4)<br/>\n2 Animal Empathy(3), Craft Trap(1), Spellcraft(3)<br/>\n3 Animal Empathy(3), Spellcraft(2), Tumble(2)<br/>\n4 Discipline(2), Intimidate(2), Listen(1), Taunt(2), <br/>\n5 Spellcraft(3), Tumble(2), Save(2)<br/>\n6 Save(9)<br/>\n7 Discipline(4), Intimidate(4), Listen(2), Taunt(4), Tumble(2)<br/>\n8 Animal Empathy(4), Save(3)<br/>\n9 Discipline(2), Listen(4), Taunt(2), Tumble(2)<br/>\n10 Discipline(1), Intimidate(3), Listen(2), Taunt(1)<br/>\n11 Animal Empathy(4), Listen(1), Tumble(2)<br/>\n12 Animal Empathy(1), Craft Trap(6)<br/>\n13 Animal Empathy(1), Craft Trap(3), Tumble(2), Save(1)<br/>\n14 Animal Empathy(1), Save(7)<br/>\n15 Discipline(5), Intimidate(2), Taunt(5), Tumble(2)<br/>\n16 Craft Trap(7)<br/>\n17 Animal Empathy(1), Tumble(2), Save(4)<br/>\n18 Save(11)<br/>\n19 Discipline(4), Taunt(4), Tumble(2), Save(8)<br/>\n20 Spellcraft(15)<br/>\n21 Animal Empathy(5), Tumble(2)<br/>\n22 Listen(7)<br/>\n23 Listen(5), Tumble(2)<br/>\n24 Save(7)<br/>\n25 Discipline(6), Taunt(6), Tumble(2)<br/>\n26 Discipline(1), Intimidate(2), Listen(3), Taunt(1)<br/>\n27 Discipline(1), Intimidate(2), Listen(1), Taunt(1), Tumble(2)<br/>\n28 Discipline(1), Intimidate(4), Listen(1), Taunt(1), Save(1)<br/>\n29 Discipline(1), Intimidate(1), Listen(1), Taunt(1), Save(4)<br/>\n30 Spellcraft(10), Save(1)<br/>\n31 Discipline(2), Intimidate(3), Taunt(2)<br/>\n32 Discipline(1), Intimidate(5), Taunt(1)<br/>\n33 Discipline(1), Intimidate(4), Listen(1), Taunt(1)<br/>\n34 Discipline(1), Intimidate(1), Listen(4), Taunt(1)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mathaenya",
      "avatar": "no_avatar.png",
      "timestamp": "2:20 PM - May 10, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Are you taking that Weapon Focus: Greataxe feat at Level 12 or is that a typo?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:09 PM - May 10, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mathaenya wrote: <a data-post-id=\"24349\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24349&amp;sid=bb5c0778b87948cab0e3edcd5cc4b7e5#p24349\">↑</a><div class=\"responsive-hide\">May 10, 2021</div></cite>Are you taking that Weapon Focus: Greataxe feat at Level 12 or is that a typo?</div></blockquote>\nI suspect it's for use in Minotaur shape, which Shifter attracts, while the scythe is for Undead shape. It's always useful having a shape to fall back on that Clerics can't obliterate with Heal spells!<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:21 PM - May 10, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Btw, <em><em class=\"mention\">@Skeleton Pope</em></em> , I don't know whether you've seen my recent <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/shudder-druid-shifter-barb-bard-rdd-other-now-barb-t2355661.html\" rel=\"noreferrer\" target=\"_blank\">Shudder</a> build or not? It's not dissimilar to yours, but designed for the full 40 levels.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Skeleton Pope",
      "avatar": "no_avatar.png",
      "timestamp": "12:17 AM - May 12, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Mathaenya wrote: <a data-post-id=\"24349\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=24349&amp;sid=bb5c0778b87948cab0e3edcd5cc4b7e5#p24349\">↑</a><div class=\"responsive-hide\">May 10, 2021</div></cite>Are you taking that Weapon Focus: Greataxe feat at Level 12 or is that a typo?</div></blockquote>\nEpic Minotaur is my secondary shape and gives me knockdown utility (it gets knockdown for free and is large sized) so I took it for a little AB bump. I really wish the regular minotaur form had a greataxe as well...<br/>\n<br/>\n<em class=\"mention\">@Stagmeister</em> <br/>\n<br/>\nI have indeed seen your shudder build and I think its probably the best level 40 version of the Dex primary Druid/Shifter/Barb combo I've seen posted.<br/>\n<br/>\nPersonally, I believe a Dwarf or Half-Orc Barbarian/Shifter/Druid with Epic Damage Reduction and Mighty Rage is the strongest version of the level 40 build but its a late bloomer and requires good access to Damage resist Slash/pierce/bludgeoning gear making it a poor choice for swordflight which only hits early epics and very weak and limited amounts of damage resist gear.<br/>\n<br/>\nI'm planning to post a rough draft of that build once I am finished leveling it on World of Greyhawk once I've finished my playtest, but at level 32 its a monster.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:37 AM - May 12, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yep, I can confirm that it is a monster!  I have a level 40 version on WoG.<br/>\n<br/>\nJust hate Clerics.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KainenMorden",
      "avatar": "no_avatar.png",
      "timestamp": "8:56 PM - Nov 26, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Any SF players still here?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KainenMorden",
      "avatar": "no_avatar.png",
      "timestamp": "3:07 AM - Nov 27, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If anyone played a spell caster in SF, let me know what strategies you used and how far you got. I'm just starting Ch.4 now, lvl 19 sorc/1 cleric/3 pal<br/>\n<br/>\nI have a youtube channel where I recorded virtually all of the significant encounters in ch.3 and will do so for ch.4 although I'm told there are far fewer \"boss\" type encounters there. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:30 PM - Dec 21, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This was a pleasant surprise, to see Ch. 5 of Swordflight being released by Rogue Knight. That almost brings you to level 40 (Level 38 to be exact). I admit, I was almost ready to reinstall Neverwinter Nights but then I remembered the pain of doing this (multiple CEP patches, custom portraits, mods)...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "KainenMorden",
      "avatar": "no_avatar.png",
      "timestamp": "1:57 AM - Dec 22, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm playing Ch.5 now, its great! Can't recommend it enough!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "2:04 AM - Feb 18, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey everyone,<br/>\n<br/>\nJust started a playthrough with a rogue wizard build. First level being rogue. So basically a rogue with wizard stats….<br/>\n<br/>\nNo way past the wererat lol. Can’t kill. Cant get any of the dialogue options. Probly gonna have to reroll with some points in persuade or something :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "4:27 PM - Feb 19, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I managed to finish all the quests in the inn. Got level 2. But the bard and caravan merchant are still not giving me their quests. I think the tome quest bugged when I accepted the bribe. When I go see the quest giver i can only answer « I’m working on it.. »<br/>\n<br/>\nAnyone ever have this ? Kind of annoying was happy to have progressed ! :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "1:49 AM - Feb 20, 2024",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ok i’m noob. There is an actual walkthrough and I somehow missed a quest. Problem solved …. Lol<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "6:50 PM - Feb 09, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Anyone else encountered issues with enhanced edition. In chapter 3 I have 2 toons now who can't go through the Thorl estate portal, the game just crashes whenever I try. it does seem this is something of a side quest but I'm loath to keep doing all the other quests if I end up getting stuck because I can't do this one. All input appreciated. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Dingpot",
      "avatar": "10759398_1682113117.jpg",
      "timestamp": "5:09 PM - Apr 08, 2025",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Update - There are multiple areas in Chapter 3 I cannot access on EE, may have to start again on my Diamond installation, which is annoying<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}