{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "011",
  "name": "Tyrants of The Moonsea",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/tyrants-of-the-moonsea-t2355180.html",
  "author": "eltalstro",
  "avatar": "10758878_1582351977.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "3:53 AM - Oct 01, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Some might consider the following to include spoilers, some might not. If you're highly spoiler averse, probably just buy the game and play it. I've just started playing this with an Eye of Gruumsh build; I'm enjoying it a lot so far. There are some new monsters with fantastic rendering. The challenge ratings seem pretty conservative to me and there are plenty of hard fights that require strategy; soloing is no walk in the park.<br/>\n<br/>\nThe game makes you think in order to move the story along and doesn't hold your hand, which I like. There is a BG style world map system which is a nice touch. One shortcoming in the plot is that ToTMS doesn't provide a compelling reason for your PC to become involved in the plot, other than adventure, so it can be difficult to reconcile this for a selfish/evil character. If you are into RP in your own adventures, this might be slightly jarring, but not as jarring as when your EE version of NWN crashes again (which it just did!). Oh well, it hadn't happened in a week or two before this and Beamdog actually responded to me when I logged previous crashes. <br/>\n<br/>\nThe lore and general Forgotten Realmsishness is cool. Apparently, there are 5 henchmen available, but I haven't bumped into a half-orc one yet which would be ideal for my PC. The voice acting is pretty solid and there are quite a few cut scenes involving this aspect. I'd say overall the immersive quality is at least as good as DOD or WCoC. So far I'd give it 4/5 but I tend towards seeing the good in all things NWN. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "10:44 AM - Mar 24, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have just started playing the premium module, Tyrants of the Moonsea. At Hillsfar: Vault of Swords, you may enchant a melee weapon with up to three upgrades: a general enhancement bonus of up to +5, an enhancement bonus of up to +7 against a specific enemy type, and additional elemental damage of 1d8 . Out of curiosity, I have some questions:<br/>\n <br/>\n1. Is there another part in the same module where I will be able to enchant a weapon or any item? Please, I like spoilers.<br/>\n<br/>\n2. What other official modules have weapon (or any item) enchantment as a feature? And what are the upgrades? (The only other module I know is HotU, The blacksmith Rizolvir can add Haste, Keen, Regeneration +2, Spell Resistance 20, True Seeing and enhancement bonus of up to +10 to melee weapons. He can add Mighty up to +10 and unlimited ammunition up to +5 to ranged weapons. However, he will not cause any item to have more than eight magical properties.)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "CorianderCastor",
      "avatar": "10759549_1649616341.png",
      "timestamp": "8:47 PM - Apr 10, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I know Pirates of the Sword Coast has item enchanting. It's basically the same as HotU, but less powerful due to it being a mid-level module. Only up to +5 on weapons, and +1 unlimited ammo, for example. The reference guide has more details.<br/>\n<br/>\nThat conditional +7 can be very useful much later in Tyrants, is all I'm going to say. But I don't recall any other enchanting in the module.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "12:45 AM - Apr 12, 2022",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">ToMS was immersive and immensely enjoyable. I had a lot of fun. Highly recommended. <br/>\n<br/>\n<br/>\nSent from my iPhone using Tapatalk<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}