{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "020",
  "name": "Original Campaign 2002 Revisited",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/original-campaign-2002-revisited-t2354660.html",
  "author": "HipRedux",
  "avatar": "10577588_1510287072.jpg",
  "replies": 47,
  "posts": [
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:47 AM - Jan 25, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Original Campaign 2002<br/>\n<br/>\nIt's a lost era.  Or perhaps, a \"replaced era\" would be more accurate. The Original Campaign (or the \"Plague Campaign\") was only playable as intended for a short period, one year, before the first expansion, Shadows of Undrentide, was released the following June and changed the core game. <br/>\n<br/>\nJoin me as we travel back 15 years to play the OC as players did when Neverwinter Nights was first unveiled to eager gamers around the world.<br/>\n<br/>\nTHE SIMULATION: Play the OC as it was intended to be played.<br/>\n<br/>\nListed here are the ruleset elements to play very nearly as those who opened the box to install the 3 CDs.  The instructional booklet would have contained exactly what you see listed below (except for the comments). <br/>\n<br/>\nThough some of the scripting was also modified in later releases, a player can mimic a similar challenge level by avoiding the boosts added in subsequent modifications to the core game.<br/>\n<br/>\nThese features are:<br/>\n<br/>\nCLASSES<br/>\n<br/>\nLimited to:<br/>\n<br/>\nBarbarian, bard, cleric, druid, fighter, monk, paladin, ranger, rogue, sorcerer, wizard; no prestige available until SoU released; pure or multiclass are equally valid in all releases.<br/>\n<br/>\nRACES - The original 7 races have remained unaltered from the original game.<br/>\n<br/>\nWEAPONS <br/>\n<br/>\nLimited to:<br/>\n<br/>\nSimple - club, dagger, mace, sickle, spear, morningstar, quarterstaff, light/heavy crossbow, dart, sling<br/>\n<br/>\nMartial - battleaxe, greataxe, greatsword, halberd, handaxe, heavy flail, light flail, light hammer, longbow, longsword, rapier, scimitar, shortsword, shortbow, throwing axe, warhammer<br/>\n<br/>\nExotic - bastard sword, dire mace, double axe, kama, katana, kukri, scythe, shuriken, two-bladed sword (weighed 4.4 lbs in 2002)<br/>\n<br/>\nSKILLS<br/>\n<br/>\nThe following 8 were added with expansions so they do not apply to the OC:<br/>\n<br/>\nAppraise (no dice rolls used for trade in the first shops)<br/>\nBluff<br/>\nCraft armor<br/>\nCraft trap<br/>\nCraft weapon<br/>\nIntimidate<br/>\nRide<br/>\nTumble<br/>\n<br/>\nFEATS<br/>\n<br/>\nRacial feats: remained unaltered throughout all releases.<br/>\n<br/>\nClass feats: remained unaltered throughout all releases.<br/>\n<br/>\nEpic feats (general and bonus):  none applicable to the OC. <br/>\n<br/>\nInstant feats: none applicable to the OC.<br/>\n<br/>\nGeneral feats not applicable to the OC are:<br/>\n<br/>\nArtist<br/>\nBlind fight<br/>\nBlooded<br/>\nBrew potion<br/>\nBullheaded<br/>\nCircle kick<br/>\nCourteous magocracy<br/>\nCraft wand<br/>\nCurse song<br/>\nDirty fighting<br/>\nDivine might<br/>\nDivine shield<br/>\nExpertise<br/>\nExtra music<br/>\nExtra stunning attacks<br/>\nGreat cleave<br/>\nGreater spell focus<br/>\nGreater spell penetration<br/>\nImproved expertise<br/>\nImproved initiative<br/>\nLingering song<br/>\nLuck of heroes<br/>\nMount actions<br/>\nMounted archery<br/>\nMounted combat<br/>\nRapid reload<br/>\nResist disease<br/>\nResist energy<br/>\nResist poison<br/>\nScribe scroll (wizards did not get for free at Level 1)<br/>\nSilver palm<br/>\nSnake blood<br/>\nSpring attack<br/>\nStealthy<br/>\nStrong soul<br/>\nThug<br/>\nWhirlwind attack<br/>\nZen archery<br/>\n<br/>\nSummoning Feats (changes)<br/>\n<br/>\nSummon Familiar:  Limited to bat, fire mephit, hell hound, ice mephit, imp, panther, pixie, raven (eyeball, faerie dragon, pseudodragon... added later).<br/>\nAnimal Companion:  Limited to badger, wolf, brown bear, boar, hawk, panther, giant spider, dire wolf (dire rat... added later).<br/>\n<br/>\nSPELLS (refrain from using any on this list for the OC)<br/>\n<br/>\nBARD<br/>\n<br/>\n0 - Flare<br/>\n1 - Amplify, Balagarn's iron horn, Expeditious retreat, Magic weapon <br/>\n2 - Cloud of bewilderment, Tasha's hideous laughter   <br/>\n3 - Displacement, Greater magic weapon, Gust of wind, Keen edge, Wounding whispers<br/>\n4 - (no spells added with expansions)<br/>\n5 - (no spells added with expansions)<br/>\n6 - Dirge<br/>\n<br/>\nCLERIC<br/>\n<br/>\n0 - Inflict minor wounds<br/>\n1 - Bane, Divine favor, Entropic shield, Inflict light wounds, Magic weapon, Shield of faith<br/>\n2 - Inflict moderate wounds, Stone bones<br/>\n3 - Continual flame, Darkfire, Glyph of warding, Inflict serious wounds, Magic vestment<br/>\n4 - Inflict critical wounds, Greater magic weapon<br/>\n5 - Battletide, Circle of doom, Monstrous regeneration<br/>\n6 - Banishment, Greater sanctuary, Planar ally, Undeath to death<br/>\n7 - (no spells added with expansions)<br/>\n8 - Earthquake<br/>\n9 - Undeath's eternal foe<br/>\n<br/>\nDomain Spells - remained unaltered throughout all releases.<br/>\n<br/>\nDRUID<br/>\n<br/>\n0 - Flare<br/>\n1 - Camouflage, Magic fang<br/>\n2 - Blood frenzy, One with the land<br/>\n3 - Greater magic fang, Healing sting, Infestation of maggots, Quillfire, Spike growth<br/>\n4 - Mass camouflage<br/>\n5 - Inferno, Monstrous regeneration, Owl's insight, Vine mine<br/>\n6 - Crumble, Drown, Stonehold<br/>\n7 - (no spells added with expansions)<br/>\n8 - Bombardment, Sunburst<br/>\n9 - Earthquake<br/>\n<br/>\nPALADIN<br/>\n<br/>\n1 - Bless weapon, Deafening clang, Divine favor, Magic weapon<br/>\n2 - Aura of glory<br/>\n3 - Greater magic weapon<br/>\n4 - Holy sword<br/>\n<br/>\nRANGER<br/>\n<br/>\n1 - Camouflage, Magic fang<br/>\n2 - One with the land<br/>\n3 - Blade thirst, Greater magic fang<br/>\n4 - Mass camouflage<br/>\n<br/>\nSORCERER/WIZARD<br/>\n<br/>\n0 - Acid splash, Electric jolt, Flare<br/>\n<br/>\n1 - Expeditious retreat, Horizikaul's boom, Ice dagger, Ironguts, Magic weapon, Shelgarn's persistent blade, Shield, True strike<br/>\n<br/>\n2 - Balagarn's iron horn, Cloud of bewilderment, Combust, Continual flame, Death armor, Flame weapon, Gedlee's electric loop, Stone bones, Tasha's hideous laughter<br/>\n<br/>\n3 - Displacement, Greater magic weapon, Gust of wind, Keen edge, Mestil's acid breath, Scintillating sphere<br/>\n<br/>\n4 - Isaac's lesser missile storm<br/>\n<br/>\n5 - Ball lightning, Bigby's interposing hand, Firebrand, Mestil's acid sheath<br/>\n<br/>\n6 - Bigby's forceful hand, Flesh to stone, Isaac's greater missile storm, Stone to flesh, Undeath to death<br/>\n<br/>\n7 - Banishment, Bigby's grasping hand, Great thunderclap<br/>\n<br/>\n8 - Bigby's clenched fist, Blackstaff, Greater sanctuary, Sunburst<br/>\n<br/>\n9 - Bigby's crushing hand, Black blade of disaster<br/>\n<br/>\n<em> edit: 20170208 - added Summoning Feat changes.   </em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:38 PM - Jan 25, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">...And suddenly the OC is considerably less of a cakewalk!<br/>\n<br/>\n Speaking as a predominantly non-spellchucking melee-ist, the glaring differences are no Tumble, no Blind Fight, no Expertise (even though I tend not to make full use of that one) and no Prestige Classes. All of which throws a lump hammer in the machinery.<br/>\n<br/>\n I think I'll give it a whirl - challenge accepted!<br/>\n<br/>\n Thanks for this, Hip - it'll keep me occupied while I'm reinstalling other stuff.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "2:21 PM - Feb 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I started a half-orc ranger in OC about two weeks ago, and until now the only expansion related thing was a couple uses of the magic fang spell. And untrained appraise checks of course, but it is unavoidable I think. However the new spells are too tempting, especially the ranger spells... I will use them anyway.<br/>\n<br/>\n I should make an OC2002-friendly version of my unarmed barb with the rogue and fighter levels, and start this challenge with it after I beat Morag with the ranger.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:49 PM - Feb 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>hunearo wrote:</strong><hr/>I started a half-orc ranger in OC about two weeks ago, and until now the only expansion related thing was a couple uses of the magic fang spell. And untrained appraise checks of course, but it is unavoidable I think. However the new spells are too tempting, especially the ranger spells... I will use them anyway.<br/>\n<br/>\n I should make an OC2002-friendly version of my unarmed barb with the rogue and fighter levels, and start this challenge with it after I beat Morag with the ranger.</div></blockquote>\nThere nothing that can be done about Appraise checks since they were added a year later.  Originally, the Buy/Sell percentages were flat rates though they had different levels at different merchants so figured you'd be shopping around for the best value.<br/>\n<br/>\nWhat you've described is exactly the reason I posted this: Reluctance for players to voluntarily adhere to a set of rules that reflects the intended challenge level especially when they'd need to do the research to figure out the specifics.  They'd much prefer the vicarious thrill of artificial omnipotence conferred by modifications that were never rebalanced in the series.  It's just human nature to migrate towards the path of least resistance. <br/>\n<br/>\nThe result: a series of modules that are ridiculously easy today and that do not encourage efficient character building habits (the worst designs will always succeed in the v1.69 version).  C'est la vie!  NWN is a world based on free choice and having fun in whatever way the player sees fit.   <br/>\n<br/>\n....No cross-classing Tumble, BTW.  It doesn't exist yet! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:31 PM - Feb 08, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In a not at all surprising reversion to type, I've decided on a Monk as my main class - probably with some Rogue thrown in for good measure. However, I'm going for a DEX and WIS build rather than STR (very non-me), and am tossing a speculative coin between Hin (heads) and Dwarf (tails). I'll also be doing Kamas - hey, it wasn't cliched in those days!<br/>\n<br/>\n I appreciate that cleric or druid builds stand a better chance of shining in this scenario, but as a knuckle-runner, that seems like too much hard work for me - a short-arse with attitude is much closer to the mark.<br/>\n<br/>\n If I come up with anything halfway respectable, I'll drop it on this thread rather than anywhere else - hope that's ok.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "10:07 PM - Feb 08, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It's good I decided to play a mage 2002-style.  I forgot about familiar additions from SoU and HotU.  Lead post has been editted accordingly.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "10:46 PM - Feb 08, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm pretty sure Dire Rats also came with the expansion.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:32 PM - Feb 08, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>hunearo wrote:</strong><hr/>I'm pretty sure Dire Rats also came with the expansion.</div></blockquote>Quite right. List amended... and tyvm, hunearo!<img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:43 AM - Mar 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I can see where the folks playing NWN wizards in 2002 may have been challenged.  Only the fact that I've played the OC many, many times resulted in a fairly easy play-through.  Only 1 death was registered and that was death-by-dice on a 1 roll vs. a bodak gaze in Helm's Hold when Luke Whorm got just a little too close (seemed the guy was out of range of that cone but apparently not).<br/>\n<br/>\nI had to possess my familiar a lot more than ever before.  Normally, I'd use the fairie dragon until Lvl 5 wiz, but no such luck in 2002. Still, the pixie did great and I \"stole\" its free ImpInvis right through the final battle to free up a slot for an extra Ice Storm or Empowered Melf arrow.  That one level 4 slot really does help early on, believe it or not.<br/>\n<br/>\nLow AC was a factor without either Shield spell or Tumble dumps.  Eventually, it mattered less once Shadow Shield became available.  Empowered Cat Grace was a staple.  Barkskin buffs persisted until level 15, right about the time Luskan was finished.<br/>\n<br/>\nNo GMW meant the pixie dagger could never pierce Stoneskin and its ilk. And no Flame Weapon nerfed its damage even further.  Boohoo.  <br/>\n<br/>\nThe other nerf was not having Blind Fight for the Tenser attack which meant most of the shadow battles were via Melf arrows and MM, constantly kiting them into a field of Holy traps, usually just average ones.  Actually, the high skels were also tough with their SR foiling most MM and Melf arrow attempts.<br/>\n<br/>\nBut the biggest difference was trying to steer clear of those Corrupt Dragons without GS.  After trying to tie them up with a summon and the pixie so I could lay down some deadlies, I gave up (Grimgnaw was worthless, feared the moment he entered their aura cuz I forgot to drop a Clarity pot on him).  The combat icon won't stop while any of the party is fighting and the set DC is too high to set them without explosion.  Take20 makes a world of difference. Ended up just muscling through both wyrms with a fully-buffed Tenser which was easier than I had anticipated.<br/>\n<br/>\nI ended up using Chain Lightning and Horrid Wilting alot, mostly via scrolls.  It's really important to start collecting scrolls early because the arcane library doesn't append like in HotU.  Each chapter has its own list, always scrolls of higher level than the preceding chapter.<br/>\n<br/>\nBless and Aid pots were also staples for the Tenser.  The +2 AB really does make fewer misses when it matters most, especially in the last 2 chapters where creatures' AC is up there and hit a whole lot harder.<br/>\n<br/>\nThe Ch4 siege golems could be killed with a combo of deadly electric/deadly holy and Delayed FB placed right about where the trap stack was.  Their regen is very high so you can't dawdle with the damage.  Without magic or traps, they are invulnerable but worth lots of XP.<br/>\n<br/>\nMorag was a walk in the park.  Just keep dropping Horrid Wilting scrolls on the protectors and delay your slotted buffing because she'll just dispel it.  Her two hands drop to traps set in the hallway extremely fast but I can never seem to be able to coax her into the trap field.  No worries. After all the protectors are destroyed, Tenser can have its way with her.  Even Grimgnaw couldn't reach her in time for a single punch, she died so fast. <br/>\n<br/>\nI think the hardest fight was against those blasted Chosen Lizards because I always have a hard time killing that cleric while being pounded by the minions.  If they follow into the hallway, a trap field is waiting, but the cleric always res's them the moment they die so it just wastes traps.  They always clog the doorway making it hard to get back into the room with the cleric who NEVER EVER walks into the trap field.  But with lots of scrolls of CL and Wilting, eventually the healer gets too close to his res targets and runs out of self-heals. <br/>\n<br/>\n<em>edit:</em>  Almost forgot... that halberd-wielding Skrogg boss enroute to Klauth disarmed Tenser's sword just before dying.  I was wondering why all-of-a-sudden the elf's damage dropped down to very little and it turned out he was punching the Hell Hound to death and doing a fairly good job of it.  Unfortunately, the sword didn't go flying like my Risen Lord's scythe did when the Weapon Spirit in the Maker's realm stole it (back in HotU Land), so could not redeem it for mucho gold afterwards.  The very first time any of my Tensers have EVER been disarmed!   Lack of Discipline is not to be taken lightly.<br/>\n<br/>\nGenerally, the 2002 nerfs were noticeable but far from unmanageable for me. It just seemed to take longer with all the kiting and all the preemptive attacks with a possessed pixie.  I still soloed all the way, using Grimgnaw in Helm's Hold only and his presence against the Source Stone dragons, as meaningless as it turned out.  I did have him kill the last chosen lizardman because he was sulking, but that's about all he contributed.  I ended up about 4K XP short of level 19 and have no doubt that the small bit of XP sharing at the very end would have made no difference.<br/>\n<br/>\nPlaying under the 2002 limitations is a good idea for aspiring magicians because it teaches resourcefulness better than being able to reach down and essentially use cheat spells to resolve problem encounters.  But, TBH, I would have needed to buy triple the scrolls without traps at hand.  It really makes a difference and eliminates a lot of the tedium.  Besides, planning a trap field is FUN!<br/>\n<br/>\nHere's the build with some of the final stats: <br/>\n<br/>\n<strong>Luke Whorm</strong><br/>\nSpoiler [+]<br/>\n<br/>\n2002 OC: Wizard 16/ Rogue 2, Any alignment Gnome  (I chose LG for the Ch3 trial)<br/>\n<br/>\nSTR: 10<br/>\nDEX: 14<br/>\nCON: 18<br/>\nWIS: 8<br/>\nINT: 16 (20)<br/>\nCHA: 8<br/>\n<br/>\n01 - Wiz(1): Toughness<br/>\n02 - Wiz(2)<br/>\n03 - Wiz(3): Extend Spell<br/>\n04 - Wiz(4): INT+1 (17)<br/>\n05 - Wiz(5): Empower Spell<br/>\n06 - Wiz(6): Dodge<br/>\n07 - Wiz(7)<br/>\n08 - Rog(1): INT+1 (18)<br/>\n09 - Wiz(8): Mobility (&lt;--- replaces Tumble)<br/>\n10 - Wiz(9)<br/>\n11 - Wiz(10): Spell Pen<br/>\n12 - Wiz(11): INT+1 (19), Grt Fort<br/>\n13 - Rog(2): {Class: Evasion}<br/>\n14 - Wiz(12)<br/>\n15 - Wiz(13): Lightning Reflex<br/>\n16 - Wiz(14): INT+1 (20)<br/>\n17 - Wiz(15): SF Evocation<br/>\n18 - Wiz(16): AD Evocation<br/>\n<br/>\nHP max: 166<br/>\nSaves F/W/R (vs spells): 11/10/12 (16/15/17)<br/>\nAdd'l saves: Mind Effects +2<br/>\nBAB: 9<br/>\nAB (max, naked): 10 (melee), 12 (ranged)<br/>\nAC (naked/mundane armor/shield only): 13/16<br/>\n<br/>\nSkills: 131 - Concentration 21(27), Disable Trap 14(21), Lore 20(25) [note: I use scrolls of restoration instead of heal kits most of the time], Open Lock 13(15), Search 16(21), Set Trap 11(15), Spellcraft 20(25), UMD 16(15)<br/>\n<br/>\n01: Conc(3), Spcr(3), S - 14<br/>\n02: Conc(1), Spcr(1), S - 17<br/>\n03: Conc(1), Spcr(1), S - 20<br/>\n04: Conc(1), Spcr(1), S - 23<br/>\n05: Conc(1), Spcr(1), S - 26<br/>\n06: Spcr(1), S - 30<br/>\n07: Spcr(1), S - 34<br/>\n08: DTrap(11), Locks(4), Srch(9), STrap(11), UMD(11)<br/>\n09: Conc(5), Spcr(1)<br/>\n10: Conc(1), Spcr(1), S - 4<br/>\n11: Conc(1), Spcr(1), S - 8<br/>\n12: Conc(1), Spcr(1), S - 12<br/>\n13: DTrap(3), Locks(9), Srch(7), UMD(5)<br/>\n14: Conc(3), Spcr(3)<br/>\n15: Conc(1), Lore(4), Spcr(1)<br/>\n16: Conc(1), Lore(5), Spcr(1)<br/>\n17: Conc(1), Lore(5), Spcr(1)<br/>\n18: Conc(1), Lore(6)<br/>\n<br/>\n<strong>Final Spell list</strong><br/>\n<br/>\n0 - Res x4<br/>\n1 - Ext Res, Mage Armor, Prot from Evil, MM x4<br/>\n2 - Darkness x2, Ext Grease x2, Melf arrow x3<br/>\n3 - Prot from Elements, Emp MM x5, NEB x2<br/>\n4 - Emp Endur, Emp Cat, Emp Bull, Emp Fox, Ext Haste, Emp Melf arrow x2<br/>\n5 - Ext Element shld, Emp FA x3, Emp NEB x3<br/>\n6 - Grtr SS, Ext nrg buffer, Tru seeing, Emp Icestorm x2<br/>\n7 - Shadow shld, Ext Ether Vis, Ext Globe, Ext Tenser, Delayed FB<br/>\n8 - Premonition, Ext Mantle, Ext Prot from Spells<br/>\n<br/>\nPixie - ImpInvis x3<br/>\n<strong><br/>\nStats w/gear @Lvl 18</strong><br/>\n<br/>\nNo buff: Str 10/Dex 20/Con 18/Int 32/Wis 8/Cha 8, AC 28, AB +10/+5/+10, HP 165<br/>\nFull buff: Str 17/Dex 26/Con 25/Int 32/Wis 8/Cha 8, AC 37, AB +15/+10/+15, HP 219<br/>\nTenser: Str 27/Dex 29/Con 25/Int 27/Wis 8/Cha 8, AC 35, AB +30/+25/+30/+25, HP 273<br/>\n<br/>\n<strong>Final Gear</strong><br/>\n<br/>\nWhite Robe - +5 armor AC, +1 saves<br/>\nStaff of Command - Immunity to mind effects<br/>\nThayvian Circlet - +2 Int, +1 saves, +1 conc<br/>\nCloak of Fort - +3 defl AC, +3 saves<br/>\nBracers of Dex +4<br/>\nBelt of Agility - +2 Dex, Freedom<br/>\nRing of Clear Thought +5 Int (x2)<br/>\nAmmy of Power - add 1 ea lvl 3, 4, 5 slot<br/>\nBoots of Speed - Haste effect<br/>\n<br/>\n<br/>\n<br/>\n<em>edit: loads of typos, as usual</em><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "12:19 PM - Mar 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Since my super-intelligent-but-always-drunk half-orc ranger regularly buffs herself with camo and one with the land, and his panther with gmf, she fell out from the challenge (its really a shame, because I didn't plan to get any of the new feats and skills, and she could survive without those buffs, so I'm sure she could do it).<br/>\n<br/>\n There are three melee builds in my mind for the challenge, and I can't decide between them... a pure unarmed monk with some rogue skills, a fighter/rogue (possibly dw-ing a two-bladed sword) and a pure 20str-6int taunt barb smashing everyone and everything with his greataxe. I would love to play that dumb half-orc, but I fear I can't do it without Tomi, and I'm a bit bored about him... but I have some time to make a decision because I'm only at ch2 finale with the ranger.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:28 PM - Mar 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>hunearo wrote:</strong><hr/>Since my super-intelligent-but-always-drunk half-orc ranger regularly buffs herself with camo and one with the land, and his panther with gmf, she fell out from the challenge (its really a shame, because I didn't plan to get any of the new feats and skills, and she could survive without those buffs, so I'm sure she could do it).<br/>\n<br/>\n There are three melee builds in my mind for the challenge, and I can't decide between them... a pure unarmed monk with some rogue skills, a fighter/rogue (possibly dw-ing a two-bladed sword) and a pure 20str-6int taunt barb smashing everyone and everything with his greataxe. I would love to play that dumb half-orc, but I fear I can't do it without Tomi, and I'm a bit bored about him... but I have some time to make a decision because I'm only at ch2 finale with the ranger.\n</div></blockquote>UMD turns out to be a near-godly skill in terms of 2002 gameplay.  It only takes a couple dump levels of rogue (assassin prohibited, of course) to vastly alter any warrior's potential.  The lack of Tumble is noticeable but not nearly as important as access to all those scrumptious scrolls, wonderful wands and magical monk gear.<br/>\n<br/>\nYour ranger can just buy traps rather than trying to recover them.  You only need a handful of skill points (15 for most deadly traps) to set control fields.  If she truly is super-intelligent  (i.e. not just being facetious about her INT), xclass at least 5 points to Disable for the synergy.  Combined with amulet of the master, Tomi's quest reward and one of those +INT rings, you should be able to handle traps fairly well.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:16 PM - Mar 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi there. Thanks for the analysis, breakdown and vitals of Luke Whorm, Hip (btw, appreciate the name, dude!).<br/>\n<br/>\n I'll confess I've been somewhat tardy in taking this forward, but am on my way now. As I mentioned elsewhere, I'm trying to finalize 2 or 3 builds I have loitering in the Build Requests forum. One of these is a hin Monk 21 / Rogue 13 / CoT 6 (Arvoreen's Silent Sting), who's currently going through SoU/HotU/SoF - alas, I've yet to successfully reload Aielund. Anyway, an adaptation of her seemed like it might work here, so that's what I'm doing. Delaine Misthand is a Dexer, kama-wielding Monk (11) Rogue (7). I know this is sacrilege here, but I'm tweaking her as I go on (to the extent that I'm not yet sure whether she'll be a dual-wielder or not), and am presently at level 7 (M3/R4).<br/>\n<br/>\n Interestingly, I'm very surprised she's currently <em>at</em> level 7. All I've done so far is the prison, the zoo, no-man's-land, two of Ophala's art thefts, and the top floor of Meldanen's estate (I tend to go Peninsula, Blacklake, Beggar's Nest, Docks - which might not be everyone's preferred order, but I want to get the two I don't like much out of the way first). I'm travelling solo. I did contemplate bringing Daelan along for muscle, but have avoided doing so thus far. The thing is, I would normally expect to be at around level 5 - 6 at a pinch - at this point, so I'm wondering what's going on? I'm still getting 23xp for fire beetles (or at least I was: I've only just gone up to L7), which are normally 7s by now. My only thought is that the xp earned is based on BAB, rather than level, but have no idea whether that's the case or not. Don't get me wrong, I'm not complaining, just puzzled.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "8:01 PM - Mar 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Isn't it because of effective class level? (or something like that)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:15 PM - Mar 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sounds sensible, hunearo - but how is \"effective\" measured? That was kind of my point. Is it the BAB, overall class level, dominant class, preferred class? Or is it the quality/difficulty of your opposition? I suspect many folk are used to being at this level at this time, but I'm not, so I can't help but wonder why...<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:52 PM - Mar 06, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well, the xp continues to be a mystery. I'm about to enter Helm's Hold through the back door, and have just levelled-up to 10 (M6/R4). If things continue at this rate, it might become necessary to start building for overall level 19 or 20 when ploughing the OC!<br/>\n<br/>\n A knock-on effect from this stage of levelling is the gear I'm finding. Before leaving Neverwinter I garnered both Hideo's Kama and Peasant Dynasty - neither of which I foresaw coming up. Actually, given that this was a Dex-based D-W Kama build, it was almost annoying to also find Gloves of the Yellow Rose +5 (twice!). So they're what I'm wearing - because even with WF in Kama and a +2 and +1 weapon at my disposal, they give me a better AB atm. Things will change after I take Ambidexterity at level 12 and start D-Wielding (and even there, I also opened a chest that gifted me the Braces of Locking Grip - granting Ambi and Disc+8, but am currently resisting the allure).<br/>\n<br/>\n One thing that has come in very handy in the absence of Tumble is the acquisition of the Robes of the Old Order. Until I learned better, I used to wear these a lot, combined with speedy boots at later levels, but hadn't done so for some time. For a Monk/Rogue with stealth skills, you're very vulnerable in AC terms in Chapter 1, but that little beauty soaks 5/+1 damage - and hardly anyone is attacking you with enhanced weapons at that point, so yea!<br/>\n<br/>\n All in all, it's going far too well. It's either a really good build or fate is dropping the lead into the boxing gloves about now. I know where I'd put my money...<br/>\n<br/>\n Cheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "7:14 PM - Mar 06, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Effective_character_level\" rel=\"noreferrer\" target=\"_blank\">Effective character level</a><br/>\n Sorry, somehow I didn't noticed that you replied.<br/>\n This is why you can end the prelude at lvl4 with a wizard or sorc, but never be able to do that with a fighter.<br/>\n Monks also get better xp, but from class lvl 4 to 6 and rogues from 2 to 7.<br/>\n<br/>\n My ranger was at the end of lvl 12 when she got to ch3... but I almost always have three companions around, Tomi, my panther and a summon, and I often utilize animal empathy to have one more meatshield between me and the enemy. I'm a bit afraid that I wil not reach 15 before the end of the chapter and I will not get the henchmen items... :S<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:30 PM - Mar 06, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's great, hunearo - much appreciated. Particularly the PnP comparison from the wiki - 'cos I only really understand things in those terms! It makes sense now, anyway.<br/>\n<br/>\n I think my monk/rogue would have a blast with your drunken ranger - better than that cocky little twerp Tomi, at any rate!<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "8:17 PM - Mar 06, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm sure about that, poor Tomi dies more times than Kenny from south park :D and his trap-handling skill is flawed, it stuck around 15 for a few levels now, so he cannot disarm traps with a higher DC than 35. Pretty lame, the greatest tresures are always behind a deadly fire or electrical trap wich have a DC one or two points above that... surely I could give him a fox pot to raise his int, but I usually just order my summon to handle that trap for me... which always ends in a swift death for them.<br/>\n<br/>\n A short story about my drunken ranger: I found the perfect item for roleplaying the always drunken state, the spirit poison in ch2. It is an alcohol, and if you drink it, it doesn't disappear as any other potion would. I suppose it's because it is flagged as plot, but a much better explanation is that it just refills itself magically. Sadly the poison disappears when you enter Luskan... that would be one of the stories of my ranger if she would be a henchman, and that spirit poison would be a quest item for her :)<br/>\n<br/>\n<br/>\n Edit: oops, I totally forgot Rolkid's head-hunting quest, and I already let Vaath run... I should quit drinking :S<br/>\n Edit2: okay, auto save saved me this time... the last one was upon entering coldwood, so not a big deal, only three mid-sized areas had to be replayed (coldwood, coldwood-east and the wizard dungeon). However I let Vaath run again, but this time he gave me an other dead orc's head :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "11:49 AM - Mar 10, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A little update about the andventures of my ranger in OC :)<br/>\n Poor Aarin, he is in love with my 6 charisma half-orc :D I only started a female character to see what is the reward of the Aarin romance. He gives you an amulet in ch2 after you listened his story, even if you are a male character. This amulet doesn't do much, it can cast a light one time a day and that's all. However if your character is a female, you can continue the story from ch2 in ch3, and after you find the second word of power he gives you an upgraded version of that amulet, wich is probably the best item in the game (no, not really). It cast cast a lvl 5 light unlimited times! Oh yes, thank you Aarin, this really saves my ass when I fight with dragons and balors and alike.<br/>\n<br/>\n Else: there are three riddles in the creator ruins, and the smoke riddle is strange. The easel near gives you a hint that the Old Ones believed in the power of certain gems and that malachite was the least of them, amethyst highly prized and emeralds the most revered, and you shoul mix the powders to give the descending order of these gems. As far as I know either emerald and malachite are green, so I started the mix with green, but nothing happened - orange was the first. It was not clear to me that they thought about orange colored emeralds... they are pictured green everywhere. Luckily, there aren't any ill effects if you mix the powders incorrectly.<br/>\n<br/>\n Aaand... the fight with the white dragon in the globe was a little easier than I expected. I was just lvl13, so I set 3 deadly fire traps for him - I miscalculated the average damage, I believed that they will kill him easily, but they just took him to badly injured. However it wasn't a big deal to shoot him dead with a bow.<br/>\n Same goes for the balor lord in the ruins, while my three companions tanked him I pinned him with mundane arrows, and he was dead a few seconds later.<br/>\n<br/>\n Okay, I'm cheating... I use the expansion spells, the GMF helps the most, but the build could stand without it, you just need to be a bit more careful with your pet in the bossfights. You should cast a stoneskin on her somehow (multiclass for umd or get a gargoyle boots or something), so she can pierce dr and that's it.<br/>\n<br/>\n I'm still a bit afraid that I will not reach lvl15 until ch4... I cleared two from the three areas, only moonwood left, and I need 10-12000 xp. I hope the dragons will give me a healthy amount of xp, I'm planning to kill all three of them after I completed their quests.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:43 PM - Mar 10, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I figured out the easel puzzle by process of elimination, hunearo.  Emeralds are green, amethysts purple... so what's left?  Orange.  It <span style=\"text-decoration:underline\">has</span> to be malachite even though the NWN version must not follow conventional gem wisdom.<br/>\n<br/>\nI am impressed you've been able to progress as well as you have with such a severe party drain keeping your level so low.  But ranger has good HD so that's a big help.  And with all those meat shields, can plunck away in relative safety.  The main problem should be vs. dragons, though.  They will instantly fear all your animals which will scatter in all directions.  You can drop a Clarity on each but the effect is short-lived.  IIRC, if they get inside the aura without getting feared, they can stay there unaffected because the effect is only supposed to trigger on entry rather than OnHeartbeat.  At least, I <span style=\"text-decoration:underline\">think</span> that's the way it works.<br/>\n<br/>\nOne tip about selecting traps against all those elemental resistances.... go with Deadly Negative.  They cannot be resisted except by undead.  I kill those Golem Wardens <span style=\"text-decoration:underline\">twice</span> in the ruins.  Once before having the caretakers in the Past design a weakness and again after returning.  Just leave the keys lay on the ground the first time.<br/>\n<br/>\nThe siege golems in Ch4 are a different matter, though.  <br/>\n<br/>\nNegative damage <span style=\"text-decoration:underline\">will</span> have an effect on their HP but with Fort so tremendously high will avoid many triggers so needs some magic added in parallel... IIRC over Level 4 spells scrolls will do the trick when combined with the trap damage.  Alas, your ranger is not a UMD user so am guessing will not be able to reap the extra 1200 XP for killing the pair.  They regen like crazy so it must be fatal damage or they heal right back up. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:51 PM - Mar 10, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Stagmeister, that ECL advantage will disappear starting around level 8.  That's <span style=\"text-decoration:underline\">class</span> level 8 so if you stagger the class levels, keep both below that level as long as possible,  you can more-or-less stretch out the period where you are getting maximum XP from kills.<br/>\n<br/>\nOnly bards get a campaign-long advantage in that regard.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:47 PM - Mar 10, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>Stagmeister, that ECL advantage will disappear starting around level 8.  That's class level 8 so if you stagger the class levels, keep both below that level as long as possible,  you can more-or-less stretch out the period where you are getting maximum XP from kills.<br/>\n<br/>\n Only bards get a campaign-long advantage in that regard.</div></blockquote>\n<div align=\"left\">That's a happy coincidence, Hip - without the 4 levels of CoT that were going to be in the build from 15-18, Monk 8 will now kick in at 15 and Rogue 8 at 18, so that bodes well. Thanks for the info!<br/>\n<br/>\n I confess that I've been trying the \"true\" build out in SoU/HotU rather more than in this (albeit fascinating) sideline atm, but will be getting back to her soon (she's currently about to hit the South Road in Port Llast, having finished the Dergiab/Ganon quest, and at level 11 - Monk 6 / Rogue 5). And I've actually done some trap-setting!</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:31 PM - Mar 10, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>I confess that I've been trying the \"true\" build out in SoU/HotU rather more than in this (albeit fascinating) sideline atm, but will be getting back to her soon (she's currently about to hit the South Road in Port Llast, having finished the Dergiab/Ganon quest, and at level 11 - Monk 6 / Rogue 5). And I've actually done some trap-setting!</div></blockquote>It's fun isn't?  I always figured \"Why should the designers have all the fun placing those blasted things?  Why not turn the tables to take full advantage of their \"generosity\"?\"  At minimum, it's a source of extra income in a gold-stingy campaign like SoU.<br/>\n<br/>\nBut you've inadvertantly brought up an interesting side-issue...  <br/>\n<br/>\nWhat would SoU have been like <span style=\"text-decoration:underline\">before</span> the HotU features were added?  I'm going to have to think about this.  SoU always seemed the most challenging of the 3 campaigns to me.  Hard to get off to a good start and very similar to PnP with the low-magic situation (That <em>Rumgut</em> was always tough for me with any class at low level.).  Still, it might be interesting to play as first time SoU players did back in the day when it was the only expansion sold.  I'll have to check the patch notes closer to figure out what the exact environment was. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:28 PM - Mar 10, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n<blockquote><div>Stagmeister wrote:I confess that I've been trying the \"true\" build out in SoU/HotU rather more than in this (albeit fascinating) sideline atm, but will be getting back to her soon (she's currently about to hit the South Road in Port Llast, having finished the Dergiab/Ganon quest, and at level 11 - Monk 6 / Rogue 5). And I've actually done some trap-setting!</div></blockquote>\n It's fun isn't?  I always figured \"Why should the designers have all the fun placing those blasted things?  Why not turn the tables to take full advantage of their \"generosity\"?\"  At minimum, it's a source of extra income in a gold-stingy campaign like SoU.<br/>\n<br/>\n But you've inadvertantly brought up an interesting side-issue... <br/>\n<br/>\n What would SoU have been like before the HotU features were added?  I'm going to have to think about this.  SoU always seemed the most challenging of the 3 campaigns to me.  Hard to get off to a good start and very similar to PnP with the low-magic situation (That Rumgut was always tough for me with any class at low level.).  Still, it might be interesting to play as first time SoU players did back in the day when it was the only expansion sold.  I'll have to check the patch notes closer to figure out what the exact environment was. </div></blockquote>\n<div align=\"left\">It is, indeed, fun. It's all very well being stealthy, but rolling on one's back giggling while odd bits of Slaadi rain down is hardly conducive to being unobserved!<br/>\n<br/>\n I confess, of the 3 original campaigns, HotU has always been my favourite - until going to Cania, where I do so loathe the transforming ring/grasping hand swapping about claptrap - but that's probably more about the plot than the challenge. I certainly agree that SoU is the more challenging, though I must confess, Rumgut's never been a problem - in that area it's finding the damned white hart that I miss out on as often as not. In the first chapter as a whole - and I suspect this might be the type of build I usually play (applies to the white hart, too) - where I've really struggled is the approach to J'Nah, with that elemental stuff.<br/>\n<br/>\n While we're being tangental, just thought I'd mention that the reason I've been (relatively) quiet on the unfinalized builds currently doing the rounds is that, spookily, they reflect, to a greater or lesser extent, two of the builds I'm trying actually <em>get</em> finalized through testing - the Silent Sting, and the re-working of GDL's Hearth Guard, and I didn't want to colour either what I'm doing or what others are.<br/>\n<br/>\n Digression over...</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "7:41 PM - Mar 16, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>I figured out the easel puzzle by process of elimination, hunearo.  Emeralds are green, amethysts purple... so what's left?  Orange.  It has to be malachite even though the NWN version must not follow conventional gem wisdom.<br/>\n<br/>\n I am impressed you've been able to progress as well as you have with such a severe party drain keeping your level so low.  But ranger has good HD so that's a big help.  And with all those meat shields, can plunck away in relative safety.  The main problem should be vs. dragons, though.  They will instantly fear all your animals which will scatter in all directions.  You can drop a Clarity on each but the effect is short-lived.  IIRC, if they get inside the aura without getting feared, they can stay there unaffected because the effect is only supposed to trigger on entry rather than OnHeartbeat.  At least, I think that's the way it works.<br/>\n<br/>\n One tip about selecting traps against all those elemental resistances.... go with Deadly Negative.  They cannot be resisted except by undead.  I kill those Golem Wardens twice in the ruins.  Once before having the caretakers in the Past design a weakness and again after returning.  Just leave the keys lay on the ground the first time.<br/>\n<br/>\n The siege golems in Ch4 are a different matter, though. <br/>\n<br/>\n Negative damage will have an effect on their HP but with Fort so tremendously high will avoid many triggers so needs some magic added in parallel... IIRC over Level 4 spells scrolls will do the trick when combined with the trap damage.  Alas, your ranger is not a UMD user so am guessing will not be able to reap the extra 1200 XP for killing the pair.  They regen like crazy so it must be fatal damage or they heal right back up. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /></div></blockquote>\n<div align=\"left\">So here I am at the end of chapter three, and I just reached lvl15 after killing the fire giant king :)<br/>\n The dragons were not a problem at all, since none of them are hostile initially, so I could set my traps for them. I used acid blobs to kill the blue (fix 18d6 acid damage, cannot be halved), and electricals to kill Gorgotha and Klauth (30d6 damage is enormous, and even if they make their save 15d6 is impressive, since they don't have evasion).<br/>\n The two corrupted dragons in the source stone will be an entirely another matter... I don't have GS, and my companions will fall quickly, that will be an interesting fight :)<br/>\n From now on I will not pursue every chance to get max xp, I have no real interest in reaching lvl16, so I will just skip the siege golems while they are invulnerable. I shouldn't even had to kill Gorgotha in this chapter, the loot wasn't that great, and it shifted my alignment towards evil by five points (unlike Akulatraxas).<br/>\n<br/>\n I will post the build when I finish off Morag, but I tell you in advance, it is very far from a power build... I took some of the feats and skill because of RP and concept reasons :) If I wanted to build a power ranger (pun intended) I'd mix it with 2-3 rogue levels, go with human instead of half-orc, and I would be much careful with skill and feat selection... but someone told somewhere that even the epic scholar could complete the OC, so we don't need any power builds here.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "6:49 PM - Mar 18, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Okay, so I killed Morag, and even reached lvl 16.<br/>\n The main bosses in the last chapter were pretty easy (Aribeth, Maugrim, the two dragons, Morag).<br/>\n Okay, Aribeth killed me once, then I reloaded, changed my tactics, and she couldn't deal any damage to me or any of my companions. Seriously, all four of us were still uninjured when she surrendered.<br/>\n I also had to fight Morag twice, on first try all of my companions were killed by the blade barrier, and suddenly one of Morag's Hands (the one with the Greataxe) appeared out of nowhere, critted me, and I was dead... On second try I watched my companions, so only Tomi killed himself when the statue was destroyed but the barrier remained there for a few more seconds... I thought it will disappear instantly.<br/>\n The dragons... I instantly ran towards the left corner, and luckily only one of the dragons followed me there. After that it wasn't a big deal, the spider draw the dragons attention fo a short time, which was just enough to set some traps. This way I could preapare for the second dragon in peace.<br/>\n<br/>\n To summarize things: the meatshield tactics works pretty well in OC, you send your companions into the heat of the battle, so you can knock your arrows in peace. It happens pretty often in harder battles that everyone but you dies, but usually you have to deal with only one or two badly injured foes there. However I'm pretty sure that in harder modules I should be more careful, but this is OC, and I never played anything else, so...<br/>\n<br/>\n So here's the build, Gragor Kiburd, the hero of Neverwinter (bingo, the name was generated automatically by the game ;) )<br/>\nSpoiler [+]<br/>\n<br/>\n Ranger(16), Half-Orc<br/>\n Alignment: any (started as true neutral, ended as neutral good - benefactor)<br/>\n<br/>\n STR: 16<br/>\n DEX: 14 (18)<br/>\n CON: 10<br/>\n WIS: 14<br/>\n INT: 14<br/>\n CHA: 6<br/>\n<br/>\n Half-Orc: (Darkvision)<br/>\n 01: Ranger(1): Weapon Proficiency Exotic, Favored Enemy: Undeads, {Dual Wield}<br/>\n 02: Ranger(2)<br/>\n 03: Ranger(3): Point Blank Shot<br/>\n 04: Ranger(4): DEX+1, (DEX=15)<br/>\n 05: Ranger(5): Favored Enemy: Constructs<br/>\n 06: Ranger(6): Rapid Shot<br/>\n 07: Ranger(7)<br/>\n 08: Ranger(8): DEX+1, (DEX=16)<br/>\n 09: Ranger(9): Called Shot, {Improved Two-Weapon Fighting}<br/>\n 10: Ranger(10): Favored Enemy: Reptilian Humanoids<br/>\n 11: Ranger(11)<br/>\n 12: Ranger(12): DEX+1, Skill Focus: Taunt, (DEX=17)<br/>\n 13: Ranger(13)<br/>\n 14: Ranger(14)<br/>\n 15: Ranger(15): Improved Critical: Longbow, Favored Enemy: Dragons<br/>\n 16: Ranger(16): DEX+1, (DEX=18)<br/>\n<br/>\n Hitpoints: 127 (max 160)<br/>\n Saving Throws (Fortitude/Will/Reflex): 10/7/9<br/>\n<br/>\n BAB: 16<br/>\n AB (max, naked): 19 (melee), 20 (ranged)<br/>\n AC (naked/mundane armor/shield only): 14/21<br/>\n Spell Casting: Ranger(4)<br/>\n<br/>\n<br/>\n<br/>\n Skills:<br/>\nSpoiler [+]<br/>\n<br/>\n Skillpoints: 114<br/>\n Animal Empathy 19(17), Disable Trap 1cc(5), Heal 10(12), Hide 9(16), Listen 9(11), Move Silently 19(26), Set Trap 19(26), Spot 9(11), Taunt 9cc(10)<br/>\n<br/>\n 01: Animal Empathy(4), Disable Trap(1), Heal(4), Listen(1), Move Silently(4), Set Trap(4), Spot(1), Taunt(2), <br/>\n 02: Animal Empathy(1), Heal(1), Listen(1), Move Silently(1), Set Trap(1), Spot(1), <br/>\n 03: Animal Empathy(1), Heal(1), Move Silently(1), Set Trap(1), Taunt(1), <br/>\n 04: Animal Empathy(1), Heal(1), Listen(1), Move Silently(1), Set Trap(1), Spot(1), <br/>\n 05: Animal Empathy(1), Heal(1), Move Silently(1), Set Trap(1), Taunt(1), <br/>\n 06: Animal Empathy(1), Heal(1), Listen(1), Move Silently(1), Set Trap(1), Spot(1), <br/>\n 07: Animal Empathy(1), Heal(1), Move Silently(1), Set Trap(1), Taunt(1), <br/>\n 08: Animal Empathy(1), Hide(1), Listen(1), Move Silently(1), Set Trap(1), Spot(1), <br/>\n 09: Animal Empathy(1), Hide(1), Move Silently(1), Set Trap(1), Taunt(1), <br/>\n 10: Animal Empathy(1), Hide(1), Listen(1), Move Silently(1), Set Trap(1), Spot(1), <br/>\n 11: Animal Empathy(1), Hide(1), Move Silently(1), Set Trap(1), Taunt(1), <br/>\n 12: Animal Empathy(1), Hide(1), Listen(1), Move Silently(1), Set Trap(1), Spot(1), <br/>\n 13: Animal Empathy(1), Hide(1), Move Silently(1), Set Trap(1), Taunt(1), <br/>\n 14: Animal Empathy(1), Hide(1), Listen(1), Move Silently(1), Set Trap(1), Spot(1), <br/>\n 15: Animal Empathy(1), Hide(1), Move Silently(1), Set Trap(1), Taunt(1), <br/>\n 16: Animal Empathy(1), Hide(1), Listen(1), Move Silently(1), Set Trap(1), Spot(1)<br/>\n<br/>\n<br/>\n<br/>\n Equipment:<br/>\nSpoiler [+]<br/>\n<br/>\n Weapons:<br/>\n - for ranged combat I used the Elven Court Bow (Longbow, Attack Bonus +3, Mighty +3) obtained in ch1 finale from the Helm spirit for a long time. Then I bought a Composite Longbow +3 (Attack bonus +3, Mighty +5) from Husher Clay in ch3, and that was my weapon of choice in the final combat with Morag.<br/>\n - for melee combat first I used a mundane Double Axe, and I wanted to use a double axe till the end... then I realized that Blade Thirst only lasts 1 round per level, and it is an expansion spell, so I switched to Drone +1 / Ice Reaver +1, then in ch3 upgraded to Drone +4 (Morningstar, 1d6 sonic bonus damage, On Hit: Slow DC=14 50% / 2 Rounds) / Ice Reaver +3 (Hand Axe, 1 cold bonus damage, Cold Resist 15 / -)<br/>\n<br/>\n Armor for combat:<br/>\n - Helmet: Golden Circlet (+1 Will save, spell resist 10, +1 concentration, immune to mind-affecting spells)<br/>\n - Body: Shadow Legion Armor (Base: Leather Armor, +4 Armor AC, +5 to Hide)<br/>\n - Cloak: Cloak of Fortification +3 (+3 Deflection AC, +3 all saves)<br/>\n - Belt: Belt of Hill Giant Strength (+3 STR)<br/>\n - Gloves/Bracers: Bracers of Dexterity +5 (+5 DEX)<br/>\n - Boots: Boots of Speed (Haste)<br/>\n - Amulet: in the final battle I wore Asheera's Amulet (+3 Natural AC vs. Reptilians, +25% immunity to electricity and fire, spell resist 14), but mainly I wore the Pendant of the Elf (+4 DEX, immune to mind-affecting spells)<br/>\n - Ring1: Ring of the Rogue +4 (+4 DEX, +2 to Hide, Move Silently, Open Lock, Disable Trap, Pick Pocket)<br/>\n - Ring2: Ring of Power (15 / - Cold, Electrical, Fire resist, Freedom, Regen +1)<br/>\n<br/>\n Armor for Aarin ;)<br/>\n I bought CHA and persuation enhancing items to persuade :) Prophyro's Ring +4, Belt of the Performer +5, Nymph Cloak +3, Greater Mask of Persuation. With the aid of these items I was able to convince Aribeth to give up herself on fist try. I don't know if I was just lucky, or it isn't that hard to persuade her... but I was a little surprised about that.<br/>\n<br/>\n I also carried a periapt of wisdom +3, and in the last chapter a +5 version to gain some extra spell slots for buffing.<br/>\n<br/>\n<br/>\n<br/>\n Spells:<br/>\nSpoiler [+]<br/>\n<br/>\n Level1: Camouflage, Ultravision, Cure Light Wounds<br/>\n Level2: One with the Land, Protection from Elements, Cat's Grace<br/>\n Level3: Greater Magic Fang, Invisibility Purge<br/>\n Level4: Summon Creature IV, Cure Serious Wounds<br/>\n<br/>\n As you see I cheated the challenge's rules here as I used forbidden spells. The greatest help was obviously the GMF, but Camo and One with the Land also aided my rarely used stealth skills undoubtedly.<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n EDIT: ooh and I almost forgot... the theme under the ending credits, the original main theme... :)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:36 PM - Mar 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks very much for this, hunearo <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />!<br/>\n<br/>\n You mention that you haven't played any modules other than the OC (presumably including SoU and HotU in that). If you fancy challenging yourself a little more, you might want to try Aielund (there's a thread - admittedly a very long one - also in the Modules sub-forum here to help you along, though it's not a walkthrough). I heartily recommend it. It has the benefit of taking your toon up to level 36 or 37 within its four chapters (downloadable from the Vault: there's a link in the aforementioned thread), geat characters and plotline, and will test you significantly more than the OC. Have a look and see what you think.<br/>\n<br/>\n Cheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:46 PM - Mar 22, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I'm glad that Stagmeister woke this thread back up because I also missed your adventure, hunearo.<br/>\n<br/>\nTBH, it's very impressive even with the slight infractions spell-wise.  Half-orc is at an immediate disadvantage as far as a skill set, both because the INT penalty and loss of human's Skilled racial bonus.  To consider a 2-level deficit seems a serious handicap to me.  <br/>\n<br/>\nI like the way the intrinsic STR was set for mighty property on creation.  A half-orc bowyer is a true oddity so kudos for pulling it off.  Never woulda thunk of such a concept. <img class=\"post-image\" loading=\"lazy\" src=\"http://static.yuku.com/domainskins/bypass/img/smileys/eek.gif\" />  I also like the drone morningstar since sonic is rarely resisted in the OC.<br/>\n<br/>\nI have just one question about your trevails (well, 2 parts actually, both about skills):  How effective was your xclass Taunt and heavy investment in Empathy?  Since I tend to only use possessed familiar in the OC, I've never had occasion for much summoning or dominating, but am interested how well it served your journey.  <br/>\n<br/>\nMost of the vanilla OC creatures have either no Concentration ranks or just a token amount to oppose a taunt.  Can you give a feel on how successful (how much AC penalty) the effect was as you progressed from module to module?   It's interesting enough of an idea that it entices me to try a dedicated taunter myself.<br/>\n<br/>\nI always control those Hands the same way... with traps stacked in the hallway (yes, every toon I've ever played in the OC can set traps), my hench on Stand Ground far back behind the field and pull them both into the field of death. Any ranged attack on the statue will destroy the blade-barrier in safety, then the spear protector and whatever protector your hench needs neutralized... and the rest should be easy as pie once she no longer has total immunity.<br/>\n<br/>\nIn any event, thanks for taking the trouble to time travel back to the OC's roots and giving us a thorough report. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\nP.S.  I <span style=\"text-decoration:underline\">always</span> kill Gorgotha and eat the rep change.  A dragon by any color is still a dragon... and people are too bite-sized to take the chance her or her offspring will remain friendly.  She may have second thoughts on the prize she handed over and decide to pay me a visit whilst asleep.  I was disappointed that I could not retrieve her golden hide, though.  It would have been worth a fortune!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "11:41 AM - Mar 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n How effective was your xclass Taunt and heavy investment in Empathy?<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n The heavy investment in Empathy was necessary to use the skill in combat where you can't take 20. There are some mini-boss animals in OC with improved health, and it is also fun to steal the casters' summons, so they fight against them :) The DC for empathy is 15+HD, wich is 27 for dire bears, so that 17 in the end is only 55% success against them. On early levels, like in ch1 prison, it was hard to dominate even a single guard dog, but they served me well until their death (I had a lesser gloves of animal handling to negate the -2 CHA penaly). The mini-bosses (ancient dire bear with 300 hp and pack leader with 250) were so tough, that usually I had to redominate them at least once. I had three methods for this: 1. the domination ended unexpectedly, I ordered my companions to stand ground, and played tag with the animal until I was successful, 2. the forced redominate - save, pause, release, dominate, then unpause if successful, reload if not :D 3. order the animal to stand ground, and go somewhere in the same area where eyesight is lost with the animal, then release and rest. After that go back to the animal in stealth, then cancel stealth, and dominate the animal with a 20 roll (it may be an exploit or bug, as somehow I always rolled 20 this way).<br/>\n I had many failed attempts in ch1 and ch2, but from ch3 usually I were succesful on first or second try.\n<blockquote><div><strong>HipRedux wrote:</strong><hr/>\n Can you give a feel on how successful (how much AC penalty) the effect was as you progressed from module to module?<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n I can't tell you much about taunt, as it was only part of the concept, so I used it maybe two or three times in ch1 (maybe against Drawl and a gang leader and the guard at Meldanen's estate... I can't remember exactly), but never after that. The reason is that I was mainly a ranged fighter, while taunt is a melee skill, or at least you have to move in melee range to use it, and you are flat-footed while you taunt... since a ranger does not have uncanny dodge, my not so high AC would drop by 10 points (6 from DEX and 4 dodge ac from haste). I can tell you that on early levels with cc taunt and a heavy cha penalty the chance is only around 50% for a minor success, and even worse if you want a better result than a -1-2 AC. I can also replay the very last part of ch4 with taunt to see how it works (I will have a bonus there against those reptilians from fav enemy), but I don't have saves from ch2 and ch3. Anyway I'm planning to play a taunt barb with some bard multiclass, I will use more taunt with that.<br/>\n<br/>\n<br/>\n Well, I have a ranger question for everyone about fav enemies... what races would you choose in OC? The undead was obviously a good choice (there are many undead-heavy areas, and you can't crit them, so the extra damage is handy), but the construct and dragon does not seem to be that good (there aren't that many constructs in OC, and I killed the dragons with traps, not with weapons). The reptilian humanoids could be a fairly good choice on lvl 15 for the grand finale, but not on 10. So what would you choose on 5 and 10? I thought about elementals, outsiders, maybe giants or some PC races, but none of them seems to be that good as the undead. So what then?<br/>\n<br/>\n About the alignment change and Gorgotha: I regret to kill her :( as I said it wasn't necessary, since I was already at lvl 15, and the loot wasn't even that good to worth it.<br/>\n There are some parts in ch2 where you can gain an alighment shift towards evil, with some not-that-evil acts. Two of these links to the bounty hunt quest and one to the werewolf quest. The fist is Wyvern's case if you let him run. His and Zor's case is undersantdable I think. Okay, Wyvern killed those soldiers, but he was driven by revenge, as they brutally murdered his family. I think this is more like a lawful-chaotic act, not a good-evil. The second is Yesgar's case if you kill him. He kidnapped and raped that poor girl Shaldrissa, you don't even know why they put him into prison, and you are evil if you kill him... ridiculous. The third is Sir Kharatis if you threaten him to take the silver charm. If you do the same with the other three boys you don't gain evil points IIRC, only with Sir Karathis... strange.<br/>\n<br/>\n P.S. Stag, Gragor is 'she', not 'he' ;)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:18 PM - Mar 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey, hunearo!<br/>\n<br/>\nI've never realized summons qualified for domination.  That's an interesting exploit of the AI (highly unlikely the summoner will try to redominate the summon, right?).<br/>\n<br/>\nI've played ranger sparingly in the OC and can't recall how \"pure\" the build was.  IIRC I selected undead, humans, outsiders (slaads are such a pain!) and perhaps dwarves.  Animals would be another good one IMO.  FE damage crits, assuming the race is not immune.  The Elk tribe has some heavy hitters that can mob a dedicated archer so a few more damage can help quite a bit.  Dwarves are also scattered profusely.  Basically I use races that mob the most and have the greatest likelihood of flanking an archer (I rely on PBS and displacing rather than weapon finesse/shield switch.) and neutralizing DEX AC.  Like you, I usually control the big, bad nasties with traps.<br/>\n<br/>\nI <span style=\"text-decoration:underline\">did</span> use empathy in SoU (mainly because there were some scripted benefits furnished), but never in the OC, so appreciate your exposition.<br/>\n<br/>\nFigured you'd have taunted when switched to melee.  It's not a good idea for an archer unless mano y mano.  Too much AC to lose which defeats taunt's purpose.\n<hr/>I've always found it hard to suspend common sense enough to roleplay vanilla OC and here's the reason(s):  claiming one's actions to be lawful or good in an environment where your character is essentially a hired killer ruffling through a corpse's remains and looting private goods of innocent civilians suffering from their own hardships, justifying actions in the name of the \"quest\", seems fairly ridiculous exept as anything but a macabre mercenary, so I play it that way.  I don't go out of the way to attack neutrals or the chaste of heart, but it doesn't drive my goal either way if they happen to get in the way of fulfilling my mercenary contract.  For this reason, I always use Grimgnaw because his characterization (basically, his convo) seems to match the environment best and the easiest to control with the vanilla AI.  Since I'll at least xclass trap skills for all classes, I never need Tomi's skills (and he can't recover traps anyway).  Golgotha's death is the only serious shift (-10 Good, IIRC) that could threaten future plans so if I fell into prior evil shifts accidently, I may skip dealing with her.  But I love the combat challenge fighting her.  She happens to be one of the toughest encounters in that chapter, even with traps (Klauth can be \"drained\" with an artifact and ends up very easy).   I'm not trying to convince anyone to play this way.  Just stating my own perspective, justifiable or not.<br/>\n<br/>\nThe end result is a primarily solo experience with very few exceptions: hench in Helm's Hold and hench in the Source Stone Sanctum (after the corrupt duo is done).  <br/>\n<br/>\nBut not so playing the OC as multiplayer LAN.  <span style=\"text-decoration:underline\"><br/>\n<br/>\nThat</span> experience is heavy roleplay because it's party-based with lots of intergroup banter.  We usually play a party of 4 and designate a black-hearted scrounger specialist to do the unpleasant and despicable.  Someone <span style=\"text-decoration:underline\">must</span> take the chance of getting inflected with the plague rummaging around those corpses, so a healer is integral to pursuing the goal (our developing crew has modified the vanilla modules to use dynamics like this and fortified encounters to more realistically-reflect the environment and NPC interactions).   I should have stated \"was\" instead of \"is\" because our LAN has moved onto AD&amp;D 3.5 rules and the OC has been in the rearview for a long time.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "4:54 PM - Mar 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>I've never realized summons qualified for domination.  That's an interesting exploit of the AI (highly unlikely the summoner will try to redominate the summon, right?).</div></blockquote>\n As far as I can tell they will not try to redominate them, but I don't know if this is because of the AI, or they would try it, but can't do it. However if they have more summon spells prepared, they will summon another ally. It might be also interesting that the new summon does not cancel the old one, but both summon is unsummoned upon the caster's death.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "6:46 PM - Mar 23, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What's it mean to be <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Dominated\" rel=\"noreferrer\" target=\"_blank\">dominated</a>?  It depends whether it's a PC or NPC.<br/>\n<br/>\nThe summon disappears from the summoner's list making a new summon possible.  It would need to be either a Dru 5+, a Wis 17+ or a Src 18+ with a domination spell already prepared or selected as a known spell for an NPC to redominate a \"stolen\" ally.  In all my experiences playing the game, I've never once seen an NPC druid or ranger use empathy on my animal pets or summons, not that the AI couldn't be scripted to do it, it's just not something one sees, if it's been implemented at all.  But there are many custom PWs out there I've avoided which may have done exactly this sort of thing.<br/>\n<br/>\nApparently, the original summoner's ownership persists through the domination even after death.  I guess it makes sense.  I never considered summons as actual corporeal beings, though... more like magically-spawned apparitions that have certain racial characteristics in common with their worldly counterparts.  The fact that they have a limited duration (i.e. lifespan) and produce no corpse upon destruction seems to confirm that perspective.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "1:22 AM - Feb 25, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hello again!<br/>\nFew weeks ago I decided to play a dumb and ugly brute in OC with the restrictions described it this topic. I just killed Morag, so here's the build:\n<details><summary>Spoiler</summary>\nBarbarian(17)\nAlignment: any non-lawful (I played chaotic good here)\nAbilities:\nDEX: 14\nWIS: 8\nCHA: 6\nHalf-Orc: (Darkvision)\n02: Barbarian(2): {Uncanny Dodge I}\n04: Barbarian(4): STR+1, (STR=21)\n06: Barbarian(6): Weapon Focus: Greataxe\n08: Barbarian(8): STR+1, (STR=22)\n10: Barbarian(10)\n12: Barbarian(12): STR+1, Knockdown, (STR=23)\n14: Barbarian(14)\n16: Barbarian(16): STR+1, (STR=24)\n\nSkillpoints: 40\nSaving Throw bonuses: Traps: +4\nAB (max, naked): 25 (melee), 19 (ranged)\nSpell Casting: none\n\n\n01: Discipline(4), Taunt(4), \n03: Discipline(1), Taunt(1), \n05: Discipline(1), Taunt(1), \n07: Discipline(1), Taunt(1), \n09: Discipline(1), Taunt(1), \n11: Discipline(1), Taunt(1), \n13: Discipline(1), Taunt(1), \n15: Discipline(1), Taunt(1), \n17: Discipline(1), Taunt(1), </details>\nAnd here's the equipment:\n<details><summary>Spoiler</summary>\n<br/><span style=\"text-decoration:underline\">Armor:</span>\n<br/><em>(Immunity to mind-affecting spells, +1 will save, spell resistance:10, +1 to concentration)</em> Gauntlets of Ogre Power <span style=\"text-decoration:underline\">Cloak:</span>\n<br/><em>(freedom, regeneration +1, 15/- resist against cold, fire and electric)</em> Ring of Yusam <span style=\"text-decoration:underline\">Amulet:</span></details>\nMy experiences about the build:<br/>\nWith this much str and full attack progression I have never had any problems hitting my enemies, even in PA mode switched on.<br/>\nTaunt was an interesting skill. On early levels success wasn't guaranteed, on mid levels it worked well, and on later levels I just smashed everything instead of taunting them. At the end I tried to use it against the toughest foes (balors, dragons), but they had high levels of concentration, so it was useless.<br/>\nAC is a bit low, but the tremendous amount of HP compensates it very well.<br/>\nFort save is very strong, but even if I fail it against a poison or disease, Grimgnaws amulet protects me from most effects.<br/>\nReflex is good against traps, and on a fail I take only half damage, thanks to the ring obtained from Yusam.<br/>\nWill is very weak, but the helmet gives me immunity against most effects that trigger a will save.<br/>\nI used rage rarely, not because I forget it or something, it just wasn't necessary in most fights. On early levels it was a good boost, but as I progressed it became a bit useless.<br/>\n<br/>\nEDIT:<br/>\nOh, did you know that you can't take the \"Rolgan's trial\" quest in ch3 with this low intelligence? I had to drink a fox's cunning potion there.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:07 PM - Mar 14, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good job hunearo and clever use of fox's cunning potion there ;)<br/>\n<br/>\nEdit: Did you have any trouble with the dmg reduction of the Balor in act (four?) or you simply changed your Axe with a (+3) one when you got there? <br/>\n<br/>\nI really liked the simplicity of your build and how nicely it worked, although I would have taken cross-class tumble (+2 AC) instead of taunt for exactly the same reasons as you stated.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "7:14 PM - Mar 14, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Tumble is \"forbidden\" here, so it was an easy decision for me :)<br/>\n<br/>\nYeah, the dmg reduction of the Balors were a bit high even for this brute, but 1. I rip them apart with crits, and 2. Tomi dealt great damage to them with sneaks.<br/>\n(Maybe I forgot to mention that Tomi accompanied me through the whole campaign. First he started as a melee sneaker, but he died too much, so I ordered him to use his bow somewhere in the middle of ch2. After that he survived the fights much easier.)<br/>\n<br/>\n<br/>\nAnother interesting thing, that you may or may not know. In ch2 finale and ch3 you cannot open the thief stores unless you have some points in roguish skill. To be exact you have to spend at least one point on one of the following skills: set trap, disable trap, open lock or pick pocket.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "1:20 AM - Dec 16, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey guys!<br/>\nThis years OC2002 style half-orc playtrough is... a pure paladin.<br/>\nHere's the build:<br/>\n<details><summary>Spoiler</summary>\n</details>\n<details><summary>Spoiler</summary>\nWeapon: blessing of the daystar - the true paladin sword, however I couldn't use its +5 ench against undead, because I got it so late there were no undead enemies left nowhere... its +3 regular ench is still good, and the +1d6 fire damage against evil is a good evil detector, so I don't waste my smites. Until the point I found this I used astral blade +1 and +2 from Marrok and Barun.\nArmor: balduran's armor - +2 AC half-plate, but its +3 charisma is more important. +1 regen is also a nice bonus.\nRing1: ring of power - some elemental resist, freedom and +1 regen... its really a powerful ring.\nAmulet: amu of the uthgardt - +4 str yeah, spell resist 12 meh, immun: fear... lol, pallys are already immune.\nBracers: bracers of dex +4 - +4 dex, it aids the AC and the reflex saves a bit... its better than the ogre power gauntlets, because I can cast bulls, but I cant cast cats. I highly considered a bracers of armor +5 in ch4, but I stayed with the dex bracers for -1 AC but +2 reflex save (there are a lot of nasty traps in the source stone that tommy can't disarm).\nHelmet: greater mask of persuasion - obviously that +2 charisma was the main reason here, but that bonus to persuade was also handy.\n</details>\n<br/>\nMy experiences about the build:<br/>\n16 str for a pure warrior class is enough in every part of the game. If you buff your str with the best items you can find, and maybe spells, you will not have any serious problem hitting enemies. Well... maybe dragons could take a bit longer to defeat.<br/>\nSmite is a fairly good ability, and extra smite is very handy when you fight against the toughest evil foes. Charisma was a bit low on lower levels, but AB was still enough to hit.<br/>\nTurning is a bit useless in my opinion. There were a very few situations where I could use it effectively. Usually zombies are the best targets for turning, and skeletons are the worst. I couldnt turn a single skeleton warrior or chieftain ever because of their so high turn resistance.<br/>\nTaunt was good. Even the toughest foes (dragons, balors, aribeth, maugrim, morag, etc) couldnt resist my taunts. It worked well throughout the whole game.<br/>\nPersuade was also a godly skill. I could persuade almost everyone in the game for more info, higher rewards, lower prices, etc. There were only a few situations where I failed, but I think there were no option to succeed there (for example the leader of the eagle tribe in moonwood seemed to be impossible to persuade for a better reward).<br/>\nSaves: they were so high because of divine grace, that in the end I usually saved against the stongest traps. Will and fort was rarely a problem also.<br/>\nLay on hands comes pretty handy if you have a high charisma. It can save your or your henchmans life in tight situations. Usually its better than a potion, because it does not provoke an AoO.<br/>\n<br/>\nSpells:<br/>\nI used the few old buffs that the OC2002 rules does not forbid. Bulls, eagles, endure/resist elements, bless, prayer, death ward. They are not gamechanging spells, but they helped a bit in the toughest fights.<br/>\n<br/>\nI used Tommy as a hench because of his trap disarming and lockpicking skills, and his sneaks also helped me a lot. I ordered him to use his bow, this way I was really a tank, and he picked the enemies from distance. Sometimes you have to micromanage him to come closer to sneak range, but its nothing you cant handle.<br/>\n<br/>\nWell... thats it for now. If you have questions feel free to ask them.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:06 PM - Jan 03, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hi hunearo - it's been a while! Good to see you're still giving it max commitment to half-orc!<br/>\n<br/>\nNot having played a pally in NwN, but many in Baldur's, I was hopeful their Turn Undead would have improved, but it would appear not. Shame. Iirc, in the OC the major undead encounters are the Beggars' Nest and Helm's Hold in Ch1, Charwood and Brother Torias' tomb in Ch2, in and around Layenne's tomb and the Old Ones' temple in Ch3, and nada in Ch4. Maybe it comes into its own as the build matures further, but you can't do that with the 2002 OC.<br/>\n<br/>\nWill you stop taking Tommy with you! He's an arse! You said yourself that he can't disarm the best/worst traps and that you can stand the punishment from them. And putting some flame on any weapon enables chest/door bashing. If you must take company, Linu is at least nice and Sharwyn is foxy - though it might be interesting to see a pally teaming up with Grimgnaw.<br/>\n<br/>\nMy memory is failing me - I don't recall Prophyro's ring: is it a purchase or a drop? And while the Grtr Mask of Persuasion is understandable, I still think it's hard to ignore the Golden Circlet (protection vs mind spells).<br/>\n<br/>\nAnyway, sorry it's taken a while to respond, but good to see you again, my friend!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:21 AM - Jan 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"18183\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18183&amp;sid=51fe6207fdfc9befcdaa5961c879ed5c#p18183\">↑</a><div class=\"responsive-hide\">Jan 03, 2020</div></cite>My memory is failing me - I don't recall Prophyro's ring: is it a purchase or a drop? </div></blockquote>\nYou get it from the gnome sorcerer henchman (Boddyknock Glinkle?) for doing his quests.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:09 AM - Jan 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Empyre - I've never travelled with Bodyknock, so it least it wasn't a memory problem for once!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:40 PM - Jan 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have never traveled with him either, but I always do all of the henchmen quests before I end each chapter.  Right before you end the chapter, you hire each henchman, talk to them several times to hear their whole story, and give them their desired quest item, then fire them and move on to the next one.  They each give you a magical item that gets more powerful each time you do another chapter's henchman quests.  You also get some experience points for each one.  Whenever you see something that appears to be worthless causing you to wonder why it is even there in the game, it is probably a henchman quest item, with the sole exception of a spear that does appear valuable.  Some examles are a leaven bread recipe, a mummified hand, a non-magical axe with a notch on the blade, and a silver ring that looks different from any other silver ring in the game.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:56 PM - Jan 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Well...there *IS* a wooden toy-top.<br/>\n<br/>\nNo one has ever found out why it is in the game!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:18 PM - Jan 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>webshaman1 wrote: <a data-post-id=\"18201\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18201&amp;sid=d7178e63c7e5c403f8e8486d509d2af4#p18201\">↑</a><div class=\"responsive-hide\">Jan 04, 2020</div></cite>Well...there *IS* a wooden toy-top.<br/>\n<br/>\nNo one has ever found out why it is in the game!</div></blockquote>\n...and a rag doll.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:31 PM - Jan 04, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">They're both mine - give them back, you rotten bullies! I haven't *<em>twitch</em>* slept in *<em>twitch</em>* 18 years!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:50 AM - Jan 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"18208\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18208&amp;sid=d7178e63c7e5c403f8e8486d509d2af4#p18208\">↑</a><div class=\"responsive-hide\">Jan 04, 2020</div></cite>They're both mine - give them back, you rotten bullies! I haven't *<em>twitch</em>* slept in *<em>twitch</em>* 18 years!</div></blockquote>\nNow *THAT* is some serious sleep deprivation, folks!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:54 AM - Jan 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><span class=\"inline-attachment\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202001/10759110_e8db5acd38ff148c65aa97803233b54b.jpg\" />\n</dl>\n</span>After 18 years of no sleep...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:07 AM - Jan 05, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">See, large forehead, and PERFECTLY NORMAL EARS! (Though maybe a little...toothy?)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "5:55 PM - Jan 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><cite>Stagmeister wrote: <a data-post-id=\"18183\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?p=18183&amp;sid=d7178e63c7e5c403f8e8486d509d2af4#p18183\">↑</a><div class=\"responsive-hide\">Jan 03, 2020</div></cite>Hi hunearo - it's been a while! Good to see you're still giving it max commitment to half-orc!<br/>\n<br/>\nNot having played a pally in NwN, but many in Baldur's, I was hopeful their Turn Undead would have improved, but it would appear not. Shame. Iirc, in the OC the major undead encounters are the Beggars' Nest and Helm's Hold in Ch1, Charwood and Brother Torias' tomb in Ch2, in and around Layenne's tomb and the Old Ones' temple in Ch3, and nada in Ch4. Maybe it comes into its own as the build matures further, but you can't do that with the 2002 OC.<br/>\n<br/>\nWill you stop taking Tommy with you! He's an arse! You said yourself that he can't disarm the best/worst traps and that you can stand the punishment from them. And putting some flame on any weapon enables chest/door bashing. If you must take company, Linu is at least nice and Sharwyn is foxy - though it might be interesting to see a pally teaming up with Grimgnaw.<br/>\n<br/>\nMy memory is failing me - I don't recall Prophyro's ring: is it a purchase or a drop? And while the Grtr Mask of Persuasion is understandable, I still think it's hard to ignore the Golden Circlet (protection vs mind spells).<br/>\n<br/>\nAnyway, sorry it's taken a while to respond, but good to see you again, my friend!</div></blockquote>\nHi Stag, and hi everyone :)<br/>\n<br/>\nWell, let's see ym experiences about turning with a pally. The only areas where it was really effective are those where the weaker types of zombies appear in large numbers. My favourite was the first level of the Ruins of Illusk in ch2 finale. Zombies and weak zombies everywhere, I could destroy pretty large group of them with each turning attempt. There are a few other undead which are affected, like skeletons and skeleton mages (but not the warriors and the chieftains), mummies (though they are just scared away, not destroyed instantly), and iirc some of the cursts and vampires maybe. The rest are unaffected however because of their turn resistance.<br/>\nIt would be interesting to see if a cleric focused on turning (pure cleric, sun domain, heavy charisma investment) could break the resistance of the stronger undead.<br/>\n<br/>\nAbout Tommy :D I'm really sorry, it's some sort of habit to take Tommy with me if I don't have any oppurtunities to open locks and disarm traps. Well, any other than bashing the locked doors and chests and walk right into the traps. However I promise my next half-orc will have some tools to do these him/herself. Probably I will take Boddyknock with me, because I heard he is completely useless with the vanilla AI ;)<br/>\n<br/>\nEmpyre was right, that ring is the reward for completing the quests for Boddyknock, and just like Empyre, I'm also doing those quests for every henchmen. Even if the items are useless for the build, I still get the XP, and some of them have really interesting stories if you have the patience to read the whole conversation :)<br/>\nI agree that the golden circlet's mind immunity is powerful, but I didn't have any serious problem with mind spells at the time when that helmet was easily accessible. The pally has an innate immunity to fear, and the most common attack against mind is the fear effect (you know, fear auras everywhere), and also the clarity potion is always there if I'm unsure what is ahead.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:10 PM - Jan 06, 2020",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ha! Hunearo, indulging in some further self-gimping by going with the Glinkle - admire your style (if not your state of mind)!<br/>\n<br/>\nAnd I'd forgotten about Illusk - my bad. Nice to see the tables turned on those mummified bastards. Still my favourite Turn Undead was in Baldur's 2: Throne of Bhaal. With a fully buffed and pumped Aerie the <span style=\"text-decoration:line-through\">faerie</span> Avariel cleric/mage they're going off like party-poppers outside that temple on the way to (or back from) the fire giants. Meanwhile, if Viconia (drow cleric) is also in party, those who don't explode attack their fellows, and Keldorn (the pally) runs around like a chicken with his head cut off. Priceless.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}