{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "013",
  "name": "A Hunt Through the Dark",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/a-hunt-through-the-dark-t2355696.html",
  "author": "eltalstro",
  "avatar": "10758878_1582351977.jpg",
  "replies": 5,
  "posts": [
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "8:13 AM - Mar 26, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><span style=\"color:#ff0000\">Warning minor spoilers</span><br/>\n<br/>\nWhat's better than capturing weakling denizens of the Underdark and forcing them into bondage for profit? Finding out it's only a cover for a much more nefarious plot! If you have ever wanted to play an evil-aligned drow character, traversing a cutthroat world drenched in lore and full of intrigue and skulduggery, <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/hunt-through-dark-xp-edition\" rel=\"noreferrer\" target=\"_blank\">A Hunt Through the Dark</a> is the module for you. <br/>\n<br/>\nYou start out as a scout that has been recruited to a slaver gang in the Underdark led by a ruthless cleric of Lolth. I won't go further into the plot, as there are twists and turns that shouldn't be revealed, but I will say that it moves along at a rip-snorting pace with a mood of desperation and displacement as well as all of the hubris so typical of the drow. It's a 6 part series that will take you to somewhere around level 20 (not sure as I haven't finished yet). There are some hard parts (especially at the start), but if you play a highly optimised build, you'll find the combat gets a bit easy. I'd recommend \"very difficult\" setting to make it a real challenge. I've been playing a Ba, BG, RDD (very similar to Mick Dagger's <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/paragon-of-pain-bard-8-rdd-10-blackguard-22-t2354371.html\" rel=\"noreferrer\" target=\"_blank\">Paragon of Pain</a>) which has been coping easily but I have played on D&amp;D Hardcore.<br/>\n<br/>\nIt can be a bit messy planning a character for this module because you get +2 to both intelligence and charisma but these are not allocated during character creation. As a result, you need to calculate the skill points that you miss out on at character creation or you may be short of points at dump levels. You <strong>MUST </strong>type \"Drow\" into the subrace field at character creation to get the racial bonuses. You could easily play as a non-evil-aligned character such as a cleric of Eilistraee, and there are some interesting moral choices that must be made.<br/>\n<br/>\nAHTtD is absolutely a Monty Haul campaign, and for much of the story, merchants are hard to come by. This results in a lot of inventory management. If you can come by containers of any sort, they are a necessity. This also makes a high-strength character a wise choice. There are some quite major grammatical issues in the dialogue, as it has most certainly been created by someone for whom English is a second language; this is worse in some of the modules than others. Despite this, I think the storytelling is as good as any module I've played, and the atmosphere is outstanding. Well worth a playthrough.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:17 PM - Mar 26, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">A nice teaser, eltalstro!<br/>\n<br/>\nYou will not be surprised to hear that I have a question or two...<br/>\n<br/>\nIf your character finishes in early epic levels, would it be transferable to a higher level module? I'd initially thought not, but if the INT and CHA bonuses come as \"add-ons\", so don't impact on \"true\" skill point allocation, maybe all that would happen in a transfer elsewhere would be a loss of them without unduly affecting the build.<br/>\n<br/>\nAre there any changes to a standard Elf favoured class? Traditionally, female Drow have Cleric as their favoured class, rather than Wizard (can't remember if males have Wizard or Fighter - or even Thief, sorry).<br/>\n<br/>\nWould I be correct in assuming Drow is the only race available to you at character creation?<br/>\n<br/>\nAre any of the classes and/or feats altered in the modules?<br/>\n<br/>\nI know you said you haven't finished it yet, and it would appear that in at least one of the modules you reach the surface, so do you know if the old deal that Drow weapons and armour disintegrate in sunlight still holds true?<br/>\n<br/>\nThat'll do for now. Nosy bugger, ain't I?<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "11:58 PM - Mar 26, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Hey Stag,<br/>\n<br/>\nThanks for reading.<br/>\n<blockquote><div>If your character finishes in early epic levels, would it be transferable to a higher level module? I'd initially thought not, but if the INT and CHA bonuses come as \"add-ons\", so don't impact on \"true\" skill point allocation, maybe all that would happen in a transfer elsewhere would be a loss of them without unduly affecting the build.</div></blockquote>\nI think the Int and Cha bonuses are from an item that gets placed in your inventory which is probably module-specific. They appear on-screen as a permanent buff and in green on the ability scores table so I'd agree with your guess. Any plans to transfer a character should probably bank on a lower Int and Cha score.<br/>\nIf your character finishes in early epic levels, would it be transferable to a higher level module? I'd initially thought not, but if the INT and CHA bonuses come as \"add-ons\", so don't impact on \"true\" skill point allocation, maybe all that would happen in a transfer elsewhere would be a loss of them without unduly affecting the build.<br/>\n<blockquote><div>Are there any changes to a standard Elf favoured class? Traditionally, female Drow have Cleric as their favoured class, rather than Wizard (can't remember if males have Wizard or Fighter - or even Thief, sorry).</div></blockquote>\nNot that I am aware of although that would be really cool.<br/>\n<blockquote><div>Would I be correct in assuming Drow is the only race available to you at character creation?</div></blockquote>\nI think you can play other races but you'd miss out on the bonuses and it would be a bit incongruous.<br/>\n<br/>\n<blockquote><div>Are any of the classes and/or feats altered in the modules?</div></blockquote>\nNot that I know of although that would also be cool.<br/>\n<blockquote><div>I know you said you haven't finished it yet, and it would appear that in at least one of the modules you reach the surface, so do you know if the old deal that Drow weapons and armour disintegrate in sunlight still holds true?</div></blockquote>\nDefinitely not, but that would be awesome. <br/>\n<br/>\nI honestly would love to edit the grammar mistakes in the dialogue for this adventure. It was made by A German named Markus \"Wayne\" Schlegel who has done an absolutely amazing job but there are a number of improvements that could be made. Some, like the ones you mention above, may have been too hard basket stuff or simply not considered.<br/>\n<br/>\nThere is also an <span style=\"text-decoration:underline\"><a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn2/module/hunt-through-dark-remastered\" rel=\"noreferrer\" target=\"_blank\">AHTtD Remastered</a></span> on NWN2 that has a sequel called <span style=\"text-decoration:underline\">Lolthanchwi</span>. I might have to bust out NWN2 for a playthrough. <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:50 AM - Mar 27, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, my friend - asked and answered.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Iwan",
      "avatar": "10759046_1549435113.jpg",
      "timestamp": "9:33 AM - Mar 28, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I am currently playing last chapter. Great module. Love beeing drow <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\nAs long as my opinion is concerned, I would recommend choosing male character because of storytelling. It is good to take few levels of rogue or ranger for traps and locks. You can have a henchmen for most part of the adventure, but while playing solo for some time it was difficult for me without those skills. Cheers.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Ketsu",
      "avatar": "10759038_1548721289.jpg",
      "timestamp": "10:30 PM - Apr 03, 2021",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">It is so good to be ḛ̰̟̘͓̦̭̞͢v̡̞̣̯̟͖͎͈̟͓͙̟̣̯̟͖͎͈̟͓͙̟i̡͍̠̮͙͇l͙̮͖̠̦̫̯͕̰͓͚͜.<br/>\n<br/>\nI already saw your build for this campaign sir eltalstro and he is quite strong!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}