{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "000",
  "name": "The Good, The Bad And The Ugly - Screenshots",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-good-the-bad-and-the-ugly-screenshots-t2354511.html",
  "author": "Stagmeister",
  "avatar": "10404082_1510287071.jpg",
  "replies": "230",
  "views": "12.3K",
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:21 PM - Mar 11, 2016",
      "content": "<div>Hello All,<br/>\n<br/>\n About a year ago, on my first ever thread, several of us shared screenshots of our various creations - sometimes elegantly posed, sometimes action shots, some glamour (though, to be fair, not much evidence of glamour). This gave some some substance to our virtual creations, showed their development, and gave an idea of where they were playing (if you get what I mean), but more importantly, it was fun (\"Behold my surging prowess, weakling!\", \"Be staggered at her mighty tusks!\" sort of thing).<br/>\n<br/>\n Maybe it's something others would be interested in?<br/>\n<br/>\n I am now confronted with two challenges: i) Establish a link to that thread, so you can see what I mean (feel free to ignore the first few pages, where I merely blather on about the actual build request). I'll try that shortly. And ii) Find where the hell the screenshot button is on my new keyboard, 'cos it sure ain't where it used to be.<br/>\n<br/>\n For the uninitiated in these things (and me, who's only done two, and those a year ago), here's the sequence for posting a screenshot:<br/>\n<br/>\n 1. Press the Print Screen button - normally near F12 on the keyboard (ooh, just found mine!). You create a bmp screenshot at the same name's folder in the NWN1 folder.<br/>\n<br/>\n 2. Upload to a free web-hosting site - Photobucket or IMGUR (I remember using IMGUR, which was surprisingly easy for an old Luddite).<br/>\n<br/>\n 3. Copy the Direct Link of your pic there and paste on the thread.<br/>\n<br/>\n I also wrote another note, which reads: \"TGA viewer - Fast Stone Image Viewer - change them to png format, which imgur supports.\" Unfortunately, I have no recollection of what that means, or does. Sorry.<br/>\n<br/>\n Right, let's try that link... <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354345/Nonshooty-nonmagicky-elves-you-know-youre-out-there#.VuMvM0DOEqg\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... uMvM0DOEqg</a><br/>\n<br/>\n<strong><em>EDIT:</em></strong> Bugger me, the link works! It does, however, seem ludicrously long. Is there a way of shortcutting these things?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:16 PM - Mar 11, 2016",
      "content": "<div>For a more attractive link, you do something like this, but with square brackets instead of curly ones:<pre>{url=&lt;a href=\"<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354345/Nonshooty-nonmagicky-elves-you-know-youre-out-there#.VuMvM0DOEqg%22%3Ehttp://nwnecbguild.forumer.com/topic/2354345/Nonshooty-nonmagicky-elves-you-know-youre-out-there#.VuMvM0DOEqg%7DLink%3C/a\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... qg}Link&lt;/a</a>&gt; to previous thread{/url}\n\n</pre>\n Which will look like this:<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2354345/Nonshooty-nonmagicky-elves-you-know-youre-out-there#.VuMvM0DOEqg\" rel=\"noreferrer\" target=\"_blank\">Link to previous thread</a></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:56 PM - Mar 11, 2016",
      "content": "<div>Thanks, Empyre - good to know how the more savvy do it! Now all that remains is for me to attempt to upload a shot to show folk what I mean. Gulp.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:51 PM - Mar 12, 2016",
      "content": "<div><img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/79iYatb.png\"/><br/>\n<br/>\n Tried with an old image and, hoorah, it works! (This is the final battle from HoTU involving my original non-shooty, non-magicky elf.)<br/>\n<br/>\n I worked out what the TGA viewer thingy was - you need to change your screenshots from a .tga file to a .png one, and that can be done by downloading Faststone Image Viewer.<br/>\n<br/>\n I'll try a newer image later, all things being well.<br/>\n<br/>\n Cheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Thought I might as well try it now. This one's from part 2 of Aielund, and features one of Empyre's builds - Order of the Wyrm (unarmed version). Might be worth noting that resting has changed in part 2 - maybe because it's v2.0 (as opposed to 2.01, which the first part was), but it's now 4 hours (8 minutes).<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/jmwK3xQ.png\"/></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:29 PM - Mar 12, 2016",
      "content": "<div><img class=\"post-image\" loading=\"lazy\" src=\"http://i1132.photobucket.com/albums/m573/HipMaestro/cagematch.jpg\"/><br/>\n<br/>\n Forumer won't digest tga's but jpg's are fine (as evidenced by the above) and probably gif's and bmp's as well.<br/>\n<br/>\n This was the only one I could find left unposted on my photobucket library.  Notice why a wiz/trapper is so powerful.  The combination of BBoD and Skill Mastery makes an encounter like this child's play even for a naked rogue.<br/>\n<br/>\n BTW... should you ever want to mimic effects contained in other member's posts like reference links, tables, images, etc... Quote the post which contains the effect in a reply, then click the <strong>Source</strong> icon in the middle of the 2nd row of icons in the editor. (You may need to stretch the window to make the code more readable.) Copy the code that interests you into notepad, make your personal edits, then paste into a new topic. Make sure to close the quoted reply (meaning: Don't save it!).  The mysteries of BB code are only temporary, I assure you.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:46 AM - Apr 03, 2016",
      "content": "<div>For the past several months, I have been playing and mapping for Doom, but now I have released the latest version of my maps and I have returned to playing NWN. I have finished Saleron's Gambit, which I started so many months ago. It is really good and I recommend it.<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/dC3oL93.png\"/><br/>\n<br/>\n<br/>\n<br/>\n Next, I'll play the Aielund Saga with an unarmed version of my Order of the Wyrm.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:01 PM - Apr 04, 2016",
      "content": "<div>@ Empyre: Congrats on finishing Saleron's Gambit, must try it sometime. Would I be right in assuming from your screenshot that this wasn't the finale, as your cleric seems to be at L9, or is it designed for low level play?<br/>\n<br/>\n The second of my screenshots (above) features your Order of the Wyrm (unarmed version) build, who performs wonderfully through the first 3 parts of Aielund. At least, he did until I screwed something up in Trinity, and now the king won't talk to me. Still haven't figured out why, but doesn't stop the build being great (merely the player).<br/>\n<br/>\n Hope you've had a good time with Doom. I'll have to find out what it is sometime!<br/>\n<br/>\n Cheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:27 PM - Apr 08, 2016",
      "content": "<div>I just finished chapter 1 of the Aielund Saga. Here I am just after finishing the final battle:<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/YDUP7KZ.png\"/><br/>\n<br/>\n<br/>\n<br/>\n At the bottom of the image, you can see the version number (1.24) and how many hours the resing is set at (5 hours(10 minutes)).</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:14 AM - Apr 22, 2016",
      "content": "<div>This is me in the midst of Aielund Saga Chapter 4 Part 2:<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/COTWw69.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:37 PM - Apr 22, 2016",
      "content": "<div>...And this is me also in Order of the Wyrm persona in the midst of Aielund Part 3 - Return of the Ironlord, having just completed the desert fortress...<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/WFc7aRx.png\"/><br/>\n<br/>\n Oh, and that's an RDD-only helm, not an actual half-dragon, in case anyone was wondering...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:53 AM - Apr 28, 2016",
      "content": "<div>I've finished the Aielund Saga. Here I am ready to leave Assumption (Heaven). I leveled up twice more before finishing the game.<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/24jfTnm.png\"/><br/>\n<br/>\n<br/>\n<br/>\n Next will be my second-ever play-through of the Eye of the Beholder with an STR-based Rogue 26 / Fighter 4 / CoT 10 build I call the Rough-and-Ready Rogue.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:16 AM - May 02, 2016",
      "content": "<div>Here I am exploring a secret ancient dungeon in Eye of the Beholder:<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/l62u15t.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:27 AM - May 07, 2016",
      "content": "<div>Here I am in the Dwarven Mines in Eye of the Beholder.<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/IX6c6oN.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:48 AM - May 09, 2016",
      "content": "<div>I finished Eye of the Beholder at level 22 (Last time it was level 23.); Here I am about to confront the titular beholder.<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/uXdAUVR.png\"/><br/>\n<br/>\n<br/>\n<br/>\n Next is a Fighter / Bard / WM in the OC and Aribeth's Redemption.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:09 PM - May 09, 2016",
      "content": "<div>@ Empyre: I've a couple of (probably not very) techy questions to help me post more info in my screenshots, if you don't mind?<br/>\n<br/>\n First, how does one show both the character information sheet and the journal at the same time? (Btw, I'd never thought of putting the build info into the journal before - seems so sensible now. I'd previously just had a piece of paper under the ashtray next to my pc.)<br/>\n<br/>\n Second, how does one effectively 'shrink' the on-screen display? You seem to be able to display considerably more information than I can.<br/>\n<br/>\n Thanks.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:32 PM - May 09, 2016",
      "content": "<div>Stag, i think (just an estimate) you might be playing in a low resolution (800x600/ 1024/768?). Propably a limitation of your monitor.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:11 PM - May 09, 2016",
      "content": "<div>Thanks, Val. Unfortunately, I suspect not. According to the monitor, it's 1920x1080 (which seems weird to me, but it's certainly not the measurements of the thing). It also tells me it's ACR 10000:1 and full HD, but it might as well tell me it's flang vis wudna and havra e'enal boight. (Oh crap, I hope I haven't just sworn eternal holy war in some language I don't know.)<br/>\n<br/>\n Besides which, surely that wouldn't impact on what I could display, only its quality?<br/>\n<br/>\n Hope is well with you <img class=\"img-emoji\" src=\"emoji/11.gif\"/></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:55 PM - May 09, 2016",
      "content": "<div>Hmm, okay it's a good thing that you have a full HD capable monitor (1920x1080) but do you actually play in that resolution as well?<br/>\n<br/>\n Your next step is to go to options -&gt; video options -&gt; set resolution, and check if you play in 1920x1080, anything less is less \"real estate\" as well.<br/>\n<br/>\n All is well my friend, i actually enjoy playing <strong>Pillars of Eternity</strong> now ;)<br/>\n<br/>\n ~ Swords not words!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:11 PM - May 13, 2016",
      "content": "<div>Here I am in the Docks District in Chapter 1 of the OC:<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/TkxrrJf.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:57 PM - May 14, 2016",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong><hr/>Here I am in the Docks District in Chapter 1 of the OC:<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Tomi is looking at you like he thinks you are crazy.  Exactly what have you been asking him to do for you lately? <img class=\"img-emoji\" src=\"emoji/8.gif\"/> <br/>\n<br/>\n Hey, Empyre... do you use Tony K's AI for the OC?</div></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:33 PM - May 14, 2016",
      "content": "<div>I've heard that Tony K's AI improves the enemy AI as well, making the game harder, not easier. I play it unmodded, except for weapon models in the override folder.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:50 PM - May 14, 2016",
      "content": "<div>You should try it out on the OC just for giggles if nothing else.  You can offset the advantage of hireling inventory-management by adjusting the monster AI as you mentioned.  I like them to equip one of those crafted weapons but leave all the other equipment \"as is\" just to add a little more interest in finding the reagents and weapons.  That really doesn't change their attack potential very much so it doesn't take much twiddling with the AI to compensate but some of enhancements makes their image look kinda kewl.  I've also wanted to try to get some use out of Boddyknock and Tony's AI makes that possible which is otherwise just an annoying nightmare of micromanagement.  Same for the casters in SoU and HotU.  It really helps.<br/>\n<br/>\n TBH, out of all the community resources available, I only use CEP 2.3 and Tony's AI.  I'll temporarily add any haks required to play CC, but always copy down the new list of files and delete them when finished.  Call me neurotic but I've had conflicts that screwed up my gaming experience so take measures now.  I also make copies of all the 2das that new CC overwrites and reinstall the originals after my latest venture into custom content.  It may seem like a lot of work or overcompensation but I have never had to hunt down offending haks/overrides ever since adopting this procedure.<br/>\n<br/>\n Tony K's AI works independently from the game resources so has always been \"safe\".<br/>\n<br/>\n @Stagmeister: Max always thought me silly to be playing on WoG with my hardcopy of the build on the desk while he loaded his into his journal.  Problem was: I take lots of notes on my copy, highlight certain choices, make on-the-fly skill allotment changes, jot down what level I begin to face certain monster races, etc. OFTEN so the journal version really adds nothing for me.  Even after explaining all this to him, he still thinks I handle storing build information like a noob... hehehe... Whatever floats your boat, eh?  My boats floats on a sea of beautiful hilite colors, red-penned heiroglyphics and black arrows.  His sea is black with white printing.  <img class=\"img-emoji\" src=\"emoji/10.gif\"/>  But Max kills fewer trees so gets resource conservation points.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:51 PM - May 15, 2016",
      "content": "<div><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n @Stagmeister: Max always thought me silly to be playing on WoG with my hardcopy of the build on the desk while he loaded his into his journal.  Problem was: I take lots of notes on my copy, highlight certain choices, make on-the-fly skill allotment changes, jot down what level I begin to face certain monster races, etc. OFTEN so the journal version really adds nothing for me.  Even after explaining all this to him, he still thinks I handle storing build information like a noob... hehehe... Whatever floats your boat, eh?  My boats floats on a sea of beautiful hilite colors, red-penned heiroglyphics and black arrows.  His sea is black with white printing.  <img class=\"img-emoji\" src=\"emoji/10.gif\"/>  But Max kills fewer trees so gets resource conservation points.<br/>\n  </div></blockquote>\n<div align=\"left\">I know lots of people use \"lol\" figuratively, but I really did howl with mirth at this, and for some time - huge thanks (Or men in white coats needed)! <img class=\"img-emoji\" src=\"emoji/13.gif\"/><br/>\n<br/>\n PS, Hip, re the rest of your post. You boys sometimes work way too hard in order to enjoy yourselves!</div></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "10:27 PM - May 18, 2016",
      "content": "<div>Got a few moments to begin testing an oldie-but-goodie.  Seems nasty so far, but waiting for the dragons to appear.  This little guy won't make even a full mouthful for a wyrm.<img class=\"img-emoji\" src=\"emoji/8.gif\"/><br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i1132.photobucket.com/albums/m573/HipMaestro/NewBorne_Darkling_zpslufbdevj.jpg\"/><br/>\n<br/>\n<br/>\n  </div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:48 AM - May 20, 2016",
      "content": "<div>Here I am ready to enter Luskan.<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/yx0WqsF.png\"/><br/>\n<br/>\n<br/>\n<br/>\n<strong>EDIT:</strong> Looking at the build in the picture, I realized that because I am not guaranteed to reach level 28 in Aribeth's Redemption, those WM level beyond 7 are not doing me any good. So, I am going to make a change on the fly, taking Bard at level 22 and changing all the rest of the WM levels to Fighter, getting Epic Prowess and Armor Skin at levels 24 and 26, and Epic Toughness for all those Fighter feats that I will never see in-game (5 of them by level 40).</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:07 AM - May 25, 2016",
      "content": "<div>Here I am early in Chapter 3 in Coldwood. The modified build mentioned above is showing, and I am showing that I can have a third window open when using 1920 x 1080 resolution.<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/3Q8Yeal.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:50 PM - May 31, 2016",
      "content": "<div>Here I am ready to enter the Source Stone. I made a subtle change in the build, taking Bard at level 17 instead of level 18 for an earlier skill dump. The Bard level was at level 18 so I could take Lingering Song, and I hadn't switched it back when I changed my mind and took Improved Knockdown instead.<br/>\n Also, I switched henchman because Tomi was failing to disable traps too often and dying too often. Now it is Linu who is dying too often. Maybe I would be better off soloing like I usually do.<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/zdi2oK8.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:04 AM - Jun 01, 2016",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong><hr/>Also, I switched henchman because Tomi was failing to disable traps too often and dying too often. Now it is Linu who is dying too often. Maybe I would be better off soloing like I usually do.<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Well, hench really add very little to the experience itself beyond just more meat to attack unlike in HotU where there are convo triggers set all over the 3 modules that are both interesting and funny. <br/>\n<br/>\n The best way I've found to get some support from the OC hench is to always place it on Stand Ground, melee weapon or ranged, no difference. Then my toon will begin controlling the situation, maybe splitting or immobilizing a few of the mob.  After it appears the main body is managed, switch the hench to attack nearest.  Tomi usually gets a few easy sneaks in on those I've tied up.   I've yet to lose a single OC hench that way.  But without Tony's AI, Boddyknock is still more of a liability than a valuable companion.  In my experience, Grimgnaw, once permahasted with cold attack and all his monk goodies seems to dominate most encounters.<br/>\n<br/>\n Oh, and keep dropping Fox pots on Tomi until you get him to at least +2 to disable/search.  I don't recall your final build atm (I seem to remember you using bard mainly as a dump class?), but with Empower and Bard 10+, improving INT skills is even easier.  You may be surprised how many times Tomi is just a point or 2 away from disarming those \"problem\" traps, typically electrical or fire.</div></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:51 AM - Jun 01, 2016",
      "content": "<div>My build is in the screenshot. I did give Tomi Fox pots when he sad that he can't disable a trap, but near the end of chapter 3, it wasn't enough.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:54 AM - Jun 05, 2016",
      "content": "<div>Here we are just arriving in the Underdark at the beginning of Chapter 2 of Aribeth's Redemption:<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/zSGVz0F.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:01 AM - Jul 09, 2016",
      "content": "<div>I have neglected this thread for a while. Here are Dorna and I about to face that oasis-draining lich in SoU:<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/qUe9ZCs.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:03 PM - Jul 13, 2016",
      "content": "<div>Here we are about to finish Aielund for the first time...Not the best pic I've ever taken, but things were a tad intense!<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.img.com/A1KGwXI.png\"/><img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/A1KGwXI.png\"/></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:47 PM - Sep 07, 2016",
      "content": "<div>I took another break from NWN because the Doom mapping bug bit me again. I resumed last week and finally finished SoU. Here is a shot of Deekin and I about to descend to level 2 of Undermountain.<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/UOcXtyl.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:59 PM - Sep 09, 2016",
      "content": "<div>Thanks, Empyre - good to know that, from the looks of things, when I'm melee-ing HotU I'm wearing/equipping the right gear!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:50 PM - Mar 23, 2017",
      "content": "<div>I have neglected this for too long. I finally finished Sands of Fate last night. Here I am at level 40:<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/ctsURNF.png\"/><br/>\n<br/>\n<br/>\n<br/>\n<br/>\n I have taken the plunge and updated my Aielund Saga, after making a copy of the old one first, of course. Here is my elf just starting his adventure:<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/xeaz93O.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "2:11 AM - Mar 24, 2017",
      "content": "<div>The new elf looks to be a rogue/AA in the making but text is very hard to discern, Empyre.  Have you tried different formats to see if the resolution is better? (I see this one is a png.)  BMP is usually the most detailed but biggest file size.  I may try to fool around myself to figure the best format. On YouTube I need to use HD resolution to see text on the NWN videos.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:23 AM - Mar 24, 2017",
      "content": "<div>PNG uses lossless compression, unlike JPG's lossy compression, so no detail is lost. The forum software shrinks the image to fit the frame, so if your resolution is smaller than mine, it will be shrunk more.<br/>\n<br/>\n If I right-click the image and select View Image, I see the image full-size (1920x1080). Unless that is a Firefox-only feature and you are not using Firefox, it should work for you, too. It's worth a try. It shows the image sized to fill the browser window with the magnifying glass cursor, so you can make it the true 1920x1080 size by clicking on it, and then you can scroll through the image.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:46 PM - Mar 24, 2017",
      "content": "<div><blockquote><div><strong>Empyre65 wrote:</strong><hr/>I have neglected this for too long. I finally finished Sands of Fate last night. Here I am at level 40:<br/>\n<br/>\n I have taken the plunge and updated my Aielund Saga, after making a copy of the old one first, of course. Here is my elf just starting his adventure:<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/xeaz93O.png\"/><br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Well resurrected, Empyre - I'd all but forgotten about this thread. Hope the updated version of Aielund doesn't disappoint. Oh, and would this be the first outing for your Persuasive Archer?</div></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:50 PM - Mar 24, 2017",
      "content": "<div>Yes indeed. I have only had 1 opportunity to persuade so far, and failed to persuade the guard at Highmarch to let me in without him first seeing the document I was carrying, so no real consequence.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "3:40 AM - Mar 25, 2017",
      "content": "<div>Thanks for the tip, Empyre. <img class=\"img-emoji\" src=\"emoji/11.gif\"/>  At full screen the text looks much better and yes, I browse with Firefox like you.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:13 AM - Apr 02, 2017",
      "content": "<div>Here I am in Fairloch, early chapter 2.<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/6E8Ts61.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:18 AM - Apr 03, 2017",
      "content": "<div>Good job on that 90 AC! Dwarf Empyre,<br/>\n I remember when i was playing Sands of Fate with my pure Barbarian and his sub-par 50 AC he heh...</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:29 AM - Apr 20, 2017",
      "content": "<div>Here we are in early Chapter 3 of the Aielund Saga, after helping the Dwarves:<br/>\nSpoiler [+]<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"http://i.imgur.com/dpaZp6S.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:36 AM - Nov 10, 2017",
      "content": "<div>Here I am in chapter 2 of Saleron's Gambit:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/gCkBz7X.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:01 AM - Nov 10, 2017",
      "content": "<div>What lvl did you finish Saleron's before?</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:45 AM - Nov 10, 2017",
      "content": "<div>The only other time I played Saleron's Gambit (so far), I ended it as a level 9 pure Cleric in June last year.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:23 AM - Nov 11, 2017",
      "content": "<div>That is a bit low, i remember i fnished at either lvl 10 or 11 the last time i played it, but i did every quest that i found, so it might be that.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:36 PM - Dec 02, 2017",
      "content": "<div>A couple of shots for you - both from Aielund. The first one is my good friend Ren, and is entitled \"When are you going to get this tidied up?\" It's from the battle for Culdeny at the end of Chapter 1. Poor Dante's waiting to be resurrected over in the bottom left.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/rOHIlgt.png\"/><br/>\n<br/>\nAnd this next one's from earlier in the year with my Monk/AA. It's on the Isle of the Dead, and entitled, \"See, told you dieting was bad for you\".<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/hct3ZYK.png\"/></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:12 AM - Jan 15, 2018",
      "content": "<div>Here I am finally getting started in the OC with Valerfor's Green Knight of Ehlonna. At that time, I was about to enter the prison. I have played more since I took that screenshot. I am now level 5 in the Beggar's Nest with a +1 scimitar and the Benefactor alignment title.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/cKhfkvB.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:21 PM - Jan 16, 2018",
      "content": "<div>Ready to enter Meldanen's estate.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/jq1Fisg.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:44 PM - Jan 16, 2018",
      "content": "<div>Given that, like me, you're mostly a meleer Empyre (leaving your Persuasive Archer to one side for now), how are you finding it so far with a predominantly caster build - albeit essentially a buffer and/or summoner, rather than one of those frock wearing weaklings?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:21 PM - Jan 16, 2018",
      "content": "<div>So far, I am playing mostly like a fighter, with just a little bit of buffing for the tougher fights, similar to how I play Clerics. I am hesitant to summon my animal companion because she takes away some of my experience when we get kills. On the other hand, I wonder if more enemies would appear when she is there, to compensate.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:28 PM - Jan 17, 2018",
      "content": "<div>Ready to go face the rival pirate leaders.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/2MMXJoR.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:43 AM - Jan 19, 2018",
      "content": "<div>Just arrived in Port Llast.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/oJCjOPY.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "4:23 PM - Jan 22, 2018",
      "content": "<div><blockquote><div><cite>Empyre65 wrote:</cite>\nSo far, I am playing mostly like a fighter, with just a little bit of buffing for the tougher fights, similar to how I play Clerics. I am hesitant to summon my animal companion because she takes away some of my experience when we get kills. On the other hand, I wonder if more enemies would appear when she is there, to compensate.\n</div></blockquote>\n\nMaybe this helps a bit... I played a pure ranger (who do not get any <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/ECL\" rel=\"noreferrer\" target=\"_blank\">ECL</a> bonus, unlike a druid) in OC with all my possible companions and summons present most of the time. This means a henchman, an animal companion, a summon, and a dominated animal. I killed Morag at level 16. The <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Encounter\" rel=\"noreferrer\" target=\"_blank\">encounter system</a> compensates the <a class=\"postlink\" href=\"http://nwn.wikia.com/wiki/Party_size_penalty\" rel=\"noreferrer\" target=\"_blank\">party size penalty</a> very well, I think you will get roughly the same xp if you keep your whole army beside you all the time. <em>(Or you can exploit the encounter system... spawn the enemies with your full party, then unsummon everyone and get the extra xp for killing more enemies alone.)</em> Of course you get less xp for the fix creatures, like bosses and minibosses, which weren't spawned by an encounter if you kill them with your full party present.<br/>\n<br/>\nEDIT: by the way, where did you get that golden circlet in chapter one? :O<br/>\nEDIT2: nevermind, the last picture was made in Port Llast</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:46 PM - Jan 23, 2018",
      "content": "<div>Here I am in the troll caves:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/dBedYbV.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:16 PM - Jan 23, 2018",
      "content": "<div>Blimey - you're brave! I generally leave the troll caves until I'm level 11 or 12 (and it's down there that I generally find the golden circlet - unless I can afford one from Eltoora beforehand).</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:48 AM - Jan 24, 2018",
      "content": "<div>I think I got the golden circlet from the guardian in Helm's Hold. Either that, or a lucky random drop.<br/>\n<br/>\nI have now killed all the trolls, and I am in the middle of the ruins. They didn't give me much trouble, but Tomi got hit a lot.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:03 PM - Jan 25, 2018",
      "content": "<div>Getting ready to enter the graveyard outside Luskan:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/eOSpSoS.png\"/><br/>\nI have shown my build in the journal, and a page of my inventory, so here's my spell book.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:55 AM - Feb 14, 2018",
      "content": "<div>I ditched Tomi because he kept dying. He is safe in the temple of Tyr. Here I am ready to enter the Host Tower.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/QfchWwh.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "9:04 PM - Feb 14, 2018",
      "content": "<div><blockquote><div><cite>Empyre65 wrote:</cite>\nI ditched Tomi because he kept dying. He is safe in the temple of Tyr. Here I am ready to enter the Host Tower.\n</div></blockquote>\n\nTomi isn't that bad if you micromanage him a bit. Currently I'm also playing the plague campaign with a barb, and using Tomi as henchman. I ordered him to use his bow, and in battles I try to draw all the enemies on me (I have over 200 hp at lvl 14, so I can take the hits). If he is out of sneak range, I just order him to follow, and when he is close enough I order him to attack. He can do 20-30 dmg with sneaks at this level. This way Tomi can use his sneak in safety, and I have a lock/trap specialist. Well to be honest I don't really need him now, because the traps cant kill me, and I can smash all the crates and doors with my axe... but the sneak damage is impressive, so I stick with him.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:25 PM - Feb 14, 2018",
      "content": "<div>Nah, stuff him. It's odd, really, coming into NwN from Baldur's Gate/ Icewind Dale, I felt bereft by the lack of companions. However, I quickly noticed how crappy the AI was in the OC and SoU/HotU: effectively making life harder rather than easier. Thus, despite Daelan's honourable and life-affirming stance and Linu's muddling yet cuddly nature, let alone the brilliantly loyal and sarcastic Deekin in the expansions, I leave them alone now. Solo is best in the official stuff. That said, I wouldn't dream of going it alone in Aielund, for example, because not only is the AI so much better, but the NPCs actually seem to be real characters.<br/>\n<br/>\nAnyway, I'm currently in the ruins of Illusk with the Revised Dwarven Wall, so am trying to catch up with Empyre and post my own shot on the bridge to the Host Tower, so best get to it...</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:19 PM - Feb 15, 2018",
      "content": "<div>I have done everything there is to do in town and to the North. Here I am with Tomi the archer and a photo-bombing deer, ready to go West, and showing what spells I have prepared:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/OctAQnX.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:02 PM - Feb 15, 2018",
      "content": "<div>Here's my (well, Valerfor's) revised Dwarven Wall heading for the Host Tower. The eagle-eyed among you might notice that I'm one level lower than Empyre's Green Knight at the same time in the plot: it's not because I've forgetten stuff to do, just that I'm on a full AB run, so it balances.<br/>\n<br/>\nAnyway, here it is...<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/Ru2xv3V.png\"/></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:35 PM - Feb 20, 2018",
      "content": "<div>Have shifted away from where Empyre's Green Knight is heading and gone into Mines of Twin Summit. Here's an action shot of why not all monks should carry kamas (I took zero damage from this encounter).<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/fEGKH3w.png\"/></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:09 PM - Feb 20, 2018",
      "content": "<div>It's funny to see the \"0\" above your character's head, give him the moss cloak and this will become quickly frustrating for your opponents.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:36 AM - Feb 21, 2018",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nIt's funny to see the \"0\" above your character's head, give him the moss cloak and this will become quickly frustrating for your opponents.\n</div></blockquote>\n\nAfter playing nicely with my kinfolk (as much to get access to their shop as anything), I decided to go for Khor first - after all, I'm still in my Red Dragon armour, so fire ain't no big deal, and I kept a Copper Dragon suit as well, for acid protection. Therefore, no moss cloak yet. But I remember asking you about warhammers in MTS, and I came up with a couple from Khor's Quartermaster en route to his lair. One is the Hammer of Destruction: AB+4, +1d8 acid, dispel magic on hit (DC 14); the other is the Hammer of Creation: AB+4, +1d8 electricity, haste. Thought you might like to know for your records!<br/>\n<br/>\nOff to Zael now. Dwarven Wall/Panzer doing v nicely so far (a bit crappy against the Rakshasa mobs, though - wasn't killing 'em fast enough to stop the enormous amounts of magic flooding my way, even with a deep HP pool. But we got there in the end).</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "hunearo",
      "avatar": "10572442_1552585393.jpg",
      "timestamp": "12:12 AM - Feb 25, 2018",
      "content": "<div>The hero of Neverwinter (sorry for his name) and his loyal companion Tomi, moments after defeating Morag and entering the astral pocket created by Haedraline.<br/>\nThree things missing from the character sheet: immune to level drain, immune to ability drain, and regenerating.<br/>\nI will post the build in the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/original-campaign-2002-revisited-t2354660.html\" rel=\"noreferrer\" target=\"_blank\">OC 2002 revisited</a> topic soon, because I didn't use any skills or feats from the expansions.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/fJm2jmK.png\"/></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:44 PM - Feb 25, 2018",
      "content": "<div>Now this is just taking the piss...<br/>\n<br/>\nI'm in the final part of Mines of Twin Summit and currently at level 37 (Fighter 8/ CoT 2/ DwD 27). I've been petrified by these Magma Elementals, but have 100% fire immunity and am soaking 27/- damage as well as regenerating 12 hps per round and being crit immune. But the icing on the cake is that the armour I'm wearing inflicts electricity damage on a loop to anything hitting me. Thus (and there were 4 of these when I got petrified), all I did was stand still and they all killed themselves while I took precisely 0 damage by the time I unfroze. That's one hell of a defence!<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/PzdtEt8.png\"/><br/>\n<br/>\n<strong><em>EDIT:</em></strong> It just got sillier. All the underwater dudes (Kua Toa and so on) have a decreased resistance to electricity, so as an experiment I ran up into the midst of them and just stood there - no offensive action whatsoever (I stopped it when AI kicked in) - surrounded by 15 of them. I took no damage at all, but every time one of them touched me all of them took up to 24 electrical damage each. All dead, while I was considering buying a goldfish. It's all very wrong, but it amused me.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:29 AM - Feb 28, 2018",
      "content": "<div>After being distracted by Doom modding again for a couple weeks, I finally finished the OC. Here are Tomi and I ready to face Morag:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/27M9Y30.png\"/><br/>\nI am still not convinced that I want to take this character into Aribeth's Redemption. I think I'll start it, and quit if it doesn't feel right.<br/>\n<br/>\nAfter I play Aribeth's redemption, or after I decide not to, I will play Twin Summit, but not with this character. I'll use the dual-kama char that you might remember from the previous screenshots thread who went through the OC, Aribeth's Redemption, and a failed attempt at A Hunt for a Necromancer. I'll start Twin Summits with him as he was at the end of the OC.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:16 AM - May 31, 2018",
      "content": "<div>I am playing Eye of the Beholder again. I figured out a trick that makes things more convenient. I used a recall potion in the shop near the beginning. Now, the portals in the areas of the game take me to where I last used a recall potion, the shop, so I can unload loot. This is great because it is a long time before I encounter another merchant. The only downside is I have to hoof it all the way from the shop back to where I was. Here I am in the ancient dungeon.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/hi22l1e.png\"/><br/>\nI am wearing a robe intended for sorcerers, but it is not class-limited and it gives 2 AC, 1 better than the Monk robe I had, and with no penalty to Listen skill. I feel silly wearing that garish robe, but function over form.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:07 AM - Jun 02, 2018",
      "content": "<div>Have you played the second part empyre?</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:20 AM - Jun 02, 2018",
      "content": "<div>I have tried Eye of the Beholder 2 twice, and got stuck both times (at different places). I have no plans for a third attempt.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:21 AM - Jun 14, 2018",
      "content": "<div>Here we are way down in level 10:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/28TtSVA.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:31 AM - Jun 14, 2018",
      "content": "<div>What I love about EotB is the good use of custom tilesets &amp; CEP armour/weaponry.<br/>\n<br/>\nGood job empyre, take a screenshot from the final fight if you can.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:11 PM - Jun 14, 2018",
      "content": "<div>A minor downside is the weapons look like they were made by somebody who doesn't understand how the weapon properties work. Many of the weapons have both attack bonus and enhancement bonus, and I don't think they stack. Several weapons have extra damage type with the same type of damage the weapon already does. Also, I have seen some bows with an elemental damage type on them, which should go on the arrows instead of the bow. I think I remember seeing some of these same things in MTS.<br/>\n<br/>\nIn a room near where that screenshot was taken, the Drow spy from the opening cutscene appears, and he is reenacting the cutscene.<br/>\n<br/>\nI enjoy it, though. This is my third play-through.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "10:16 PM - Jun 17, 2018",
      "content": "<div>Lot's of old modules have those problems, I seem to recall some weapons that were intended to be \"plus four\" &amp; instead they went like this,<br/>\n<br/>\nattack bonus +1<br/>\nattack bonus +1<br/>\nattack bonus +1<br/>\nattack bonus +1<br/>\n...</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:45 PM - Jun 17, 2018",
      "content": "<div>That's right about MTS btw. Having just got the hang of Halls of Advanced Training and PGCC I thought I'd pop in with my Dagger of Chaos and bump it to level 3 enhancement to see what happened. And yes, it gave me +3AB, but no additional damage.<br/>\n<br/>\nSo, yes, it's slipping from what should be happening, but on the other hand (at least within MTS), those +AB weapons that don't have full enhancement are now more appealing. I'm going for the sunny side here.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:39 PM - Jun 18, 2018",
      "content": "<div>I finished Eye of the Beholder. I'm sorry, but the last battle was so intense that the idea of taking a screenshot was unable to form in my mind at the time.<br/>\n<br/>\nWhen I am killed, I usually choose the load the last save rather than respawning, but I respawned several times in that battle. I m not exaggerating when I say that I had about 90 Heal potions, but often, I was unable to drink them fast enough to not die. Once, I died <strong><em>while</em></strong> being healed by a Heal potion. Fortunately, the end boss was ignoring my henchmen, which allowed them to kill him while he was busy killing me over and over. In a way, it was also lucky that he petrified me, making me immune to most of his attacks, so I was alive when the others killed him.<br/>\n<br/>\nI hit level 22 after the last battle, so that was useless.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "7:12 PM - Jun 18, 2018",
      "content": "<div>Indeed, that beholder is a nasty business, I believe that for this module a ftr/rog/cot (with heavy on cot) would fare much better.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:58 PM - Jun 27, 2018",
      "content": "<div>I have started my first Halfling. Here are Dorna and I outside the gnoll caves.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/paxWgV0.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:55 AM - Jul 06, 2018",
      "content": "<div>Haven't posted here in a while. Here are Deekin and I about to descend to level 2 of Undermountain.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/RBMpBXZ.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:03 AM - Jul 13, 2018",
      "content": "<div>Here we are at Risolvr's forge in Chapter 3, preparing to leave The City of lost Souls:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/M3swVI4.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:56 AM - Jul 13, 2018",
      "content": "<div>Looking good, Empyre! Just as an incidental, have you kept Deekin as both a Bard and RDD, or is he specializing in one or the other? And I've never traveled with Valen before - is he good value?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:35 PM - Jul 13, 2018",
      "content": "<div>I let Deekin level with his default settings. Valen is deadly, a Fighter / Weapon Master. The interactions between Deekin and Valen are funny. Also, if you play a female PC, you can develop a romance with Valen and turn him good. A male PC could have a romance with either Nasthyra (probably spelled wrong) or Aribeth. That time I played evil, I had a romance with evil Aribeth. That was fun.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:14 PM - Jul 13, 2018",
      "content": "<div>Thanks man! I'll remember all that for my my next SoU/HotU trip.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "10:30 AM - Jul 14, 2018",
      "content": "<div>My Paladin RDD getting to know the Flesh Clan.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:47 PM - Jul 14, 2018",
      "content": "<div>Looks like you're very popular with them, eltalstro - making new friends everywhere, eh?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "12:52 PM - Jul 14, 2018",
      "content": "<div>And my Paladin 2 Cleric 7 having passed judgement upon the damned.</div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "1:10 PM - Jul 14, 2018",
      "content": "<div>I take ale with me everywhere I go which might have a bit to do with it, Stagmeister.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:58 PM - Jul 14, 2018",
      "content": "<div>Some nice action shots you have there man, good job!</div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "10:40 PM - Jul 20, 2018",
      "content": "<div>Here it is...the big bad half-orc paladin! <span class=\"text-emoji\">😀</span><br/>\nI have slaughtered the big spider and the saqqarin commander: I really enjoyed my second playthrough. It was weird to see Criosa loving my half-orc!<br/>\n<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201807/10714033_f28b8dea949a1f88751e7927f731b49c_t.png\"/><br/>\n<br/>\nThe greatsword of the Ironlord was huge....seems like a laser sword!<br/>\n<br/>\nNow onwards to WoG: I will continue playing the new version 2.65, as it is waiting for me!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:00 PM - Jul 24, 2018",
      "content": "<div>Nice one, Aquarius! Can't remember what build you were using? Though I do like the idea of a half-orc pally.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "10:51 PM - Jul 24, 2018",
      "content": "<div>I have played this <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/viewtopic.php?f=11&amp;t=2354825&amp;p=11382&amp;hilit=half+orc+paladin#p11382\" rel=\"noreferrer\" target=\"_blank\">build.</a><br/>\nNever ever played an half-orc, such an amusement to make a mess into battlefields!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:24 AM - Jul 26, 2018",
      "content": "<div>Here we are ready to leave Aqualis:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/Fb1A7jt.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:13 PM - Jul 26, 2018",
      "content": "<div>Nothing like a half-orc with a big two-hander cleaving monsters in half!<br/>\n<br/>\nEmpyre, nice shot. Are you still in the first part of SoF?</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:25 AM - Jul 27, 2018",
      "content": "<div>You know how in the OC Chapter 2 when you enter Luskan you can't get back to Port Llast? It is similar here: I am about to be teleported from the city of Aqualis to The Gem Tower in SoF Chapter 2.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:22 AM - Aug 01, 2018",
      "content": "<div>In the 3rd level of the living quarters of the Ancient Pyramid (SoF Chapter 3), I just reached level 40.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/yGj1eKt.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "8:07 AM - Aug 01, 2018",
      "content": "<div>Wow! What module is that Empyre65?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:57 PM - Aug 01, 2018",
      "content": "<div>Not wishing to steal Empyre's thunder, but it's Sands of Fate (hence SoF). You can get it from the Vault. It's one of only two single player modules that I know of that gets you all the way to level 40, the other being Mines of Twin Summit (Aielund is close, reaching about level 36/37). You need to be around level 27/28 to start, so a couple of decent routes are the OC followed by Aribeth's Redemption (though you need to be Good, male and Elf, Half-Elf, or Human for the Aribeth modules), or SoU and HotU. Both of these should get you to the necessary level before starting SoF.<br/>\n<br/>\nEmpyre may well have more to add.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:56 PM - Aug 01, 2018",
      "content": "<div>Sands of Fate and Mines of Twin Summits are both 3-module campaigns.<br/>\nMines of Twin Summits is a great follow-up for the OC, and it <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/new-full-epic-series-of-modules-t2354745.html\" rel=\"noreferrer\" target=\"_blank\">has its own thread here</a>.<br/>\nThe Aielund Saga starts at level 1, and <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-aielund-saga-t515487.html\" rel=\"noreferrer\" target=\"_blank\">it has a thread, too</a>.<br/>\nI have enjoyed all of these lots of time, and I recommend them all, including Aribeth's Redemption that Stag mentioned.<br/>\n<br/>\nHmm, maybe Sands of Fate needs a thread.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:34 PM - Aug 01, 2018",
      "content": "<div><blockquote><div><cite>Empyre65 wrote:</cite>\nHmm, maybe Sands of Fate needs a thread.\n</div></blockquote>\n\nIt's already got one, Empyre - in the modules sub-forum. I started it ages ago, but struggled to get my version of SoF working properly, so it kind of drifted. I've since reloaded the modules and am headed for them as soon as I finish HotU with iteration 1 of my Farmer build, 'cause it's about time I completed SoF. Anything you want to put on the thread would be more than appreciated!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:29 PM - Aug 01, 2018",
      "content": "<div>Aha! I forgot about that. <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/sands-of-fate-t2354705.html\" rel=\"noreferrer\" target=\"_blank\">Here is the thread for Sands of Fate</a>.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "1:13 PM - Aug 02, 2018",
      "content": "<div>Sweet! I have to finish LoT first, then if my Paladin/Sorc/RDD is at 27 I'll try him out on SoF. It really doesn't seem like he'll get that high in this module as I've just entered Hell at level 17. He's going really well through LoT soloing on 'very difficult'. Here he is pictured with his seventh cousin Viperflame in what seems to be turning into quite an awkward family visit. As a RDD, of course, you couldn't <em>not</em> go and get a look at a red dragon when the opportunity presents itself but nor could you go lopping its head off for no good reason other than to claim its substantial horde of treasure (and xp) could you?</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:30 PM - Aug 02, 2018",
      "content": "<div><blockquote><div><cite>eltalstro wrote:</cite>\nHere he is pictured with his seventh cousin Viperflame in what seems to be turning into quite an awkward family visit. As a RDD, of course, you couldn't <em>not</em> go and get a look at a red dragon when the opportunity presents itself but nor could you go lopping its head off for no good reason other than to claim its substantial horde of treasure (and xp) could you?\n</div></blockquote>\n\nWell, you're a pally, aren't you? That means you get to be all judgemental on its ass if it's been naughty, so problem solved!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:21 PM - Aug 02, 2018",
      "content": "<div>Your in-game character looks almost like the art in the upper left corner, well-done eltastro.</div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "12:04 AM - Aug 03, 2018",
      "content": "<div><blockquote><div><cite>Valerfor wrote:</cite>\nYour in-game character looks almost like the art in the upper left corner, well-done eltastro.\n</div></blockquote>\n\nThanks Valerfor, <br/>\n<br/>\nIt's a bit of an obsession of mine.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:11 AM - Aug 05, 2018",
      "content": "<div>Now that I have finished Sands of Fate, I have started the OC, with Mines of Twin Summits planned afterwards. Here we are ready to enter the Beggars' Nest:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/tP97WQd.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:13 AM - Aug 10, 2018",
      "content": "<div>Here we are in the troll caves in Chapter 2:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/4Iuljdj.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "7:20 PM - Aug 15, 2018",
      "content": "<div>I am in prison. In the OC, I mean, not in RL. Experimenting with a character. Wanted to test how posting screenshots here works.<br/>\n<br/>\nGotta love these fancy spell effects...<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201808/10758890_b0fa7266c0a389c6a84abc3da26c8e56.jpg\"/><br/>\nIn this run, I only will hire henchmen when I cannot avoid it. I also will wait with looting containers and claiming rewards as long as possible. Which is why I am still using what I found in the Prelude and as remains of slain enemies.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:46 PM - Aug 15, 2018",
      "content": "<div>Hi there, FG! You seem to have mastered how posting shots works pretty damn well! For anyone less well-versed, the original couple of posts of this thread deal with the technicalities and - almost unbelievably - they're from me!<br/>\n<br/>\nAs to the OC, I can't think of any point where you'd <em>need</em> a henchie, but you might take one for colour and gifts. Tomi's useful as a lock-opener and de-trapper in your early days, and Linu's handy for healing stuff. Daelan's good if you're made of glass and don't do front line stuff. But no one's necessary, particularly as their AI is abominable. I don't know what your main weapon is (unless it really is sling), but if you can grab either a scimitar or greatsword +1 and add some adamantium (iirc) at Marok's forge, that'll give you fire damage, so locks will no longer present a problem. There are only 2 lumps of the stuff lying around - one in No-Man's Land on the way to Blacklake, and the other in Blacklake while undertaking a bit of art theft (so you can use the 2nd to upgrade further in chapter 3). I confess that I tend to do the prison/peninsula first, then No-Man's and Blacklake, because they're my least favourites, so I get the upgrades nice and early. Then I head for the Beggars' Nest and finally the Docks 'cause they're both fun.<br/>\n<br/>\nYou probably know all this already, but I'm bored, so thought I'd share!<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "10:21 PM - Aug 15, 2018",
      "content": "<div>Hi Stag,<br/>\n<br/>\nyeah, figured it out. Good thing I have irfan view with which I can convert files.<br/>\n<br/>\nMain weapon is not sling, this is just for ranged support for my bear companion until I can shift into a bear or panther myself. Won't hit a thing in human form, with STR 8...Trying a Druid-Bard-Shifter combo, so main weapon will be unarmed, then greataxe. Scythe from level 21, but the OC won't get me there. Which weapon I actually carry won't matter, as long as I have the profiency (will get WP Exotic soon).<br/>\nCurrently clearing the cult house (that Sword Coast Boy in the warehouse has a nasty damage resistance), will get me to level 6. After the graveyard (zombies, Orsino eats them for breakfast, wish they would sell popcorn in town...) I will return to the warehouse I think, then go to Gulnan's lair.<br/>\nIf I am in dire need of magical items, instead of looting chests just yet, I also could try and clear the docks exterior, then get items from the auction with smuggler's coins and sell what I really do not want or need.<br/>\n<br/>\nThe henchies I will hire for the quests, of course. I want the XP. And the items, of course, especially the Regen ring.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:56 AM - Aug 17, 2018",
      "content": "<div>I usually start soloing when I get to Luskan. I was bringing Tomi along to handle locks and traps, and I got tired of hearing him say \"Er, no can do!\". Here I am ready to enter the Host Tower:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/jhEnsV5.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "12:19 PM - Aug 17, 2018",
      "content": "<div>Nice, Empyre. Yeah, some traps early on can be very nasty without Tomi. I got fed up with dragging henchies along ages ago, because the AI, well... had to keep them from committing suicide half of the time, and they rarely ever were a real help. Modified AI caused the problem that animals turned into cowards (not helpful when you use your animal companion as tank in the early levels), and the NPCs in the Peninsula went suicidal and stole too many kills, so I don't use that either. Depending on my class, I try to solo as early as possible, with my animal companion (or familiar, should I play a wizard) as my tank until I get a feat or spell that enables me to handle most things on my own.<br/>\n<br/>\nOne of the reasons why I would recommend trying a Druid or Shifter once, at least, I show here:<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201808/10758890_fd197beb51641ab76a9ca95c4f1e0ec6.jpg\"/><br/>\nThis is just for the funny looks, my DEX is higher in human form.<br/>\nLooks even funnier when a brown bear is doing this. Can't wait to see other shapes trying to disarm a trap or open a lock.</div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "11:50 PM - Aug 18, 2018",
      "content": "<div>In the Ritual Chamber, roasting a False Helmite.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201808/10758890_6ae6531ef92117953c70bbe0302d41ba.jpg\"/></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "10:47 PM - Aug 24, 2018",
      "content": "<div>Finally arrived in Luskan. The weapon I am actually carrying is the scimitar from Marok, just appears as a battleaxe when I am in Mino form.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201808/10758890_7483c95a1d94aa38545c9bf8ca348f82.jpg\"/><br/>\nJust smashing containers goes faster, but unlocking them looks funnier.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201808/10758890_21f5382ae41c640bbad2a3877f5a0e22.jpg\"/>O</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:03 AM - Aug 25, 2018",
      "content": "<div>Nice couple of shots FG! The streets of Luskan can get very annoying, but at least all those respawns give reasonable xp. And it's a shame about the axe thing, it would be cool to see a minotaur being all menacing wielding a toothpick.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "10:16 AM - Aug 27, 2018",
      "content": "<div>Would look funny to see a Mino wielding a Scimi (or even a dagger) indeed. Would give an  Rakshasa Eye to see that! Just that shifting doesn't work that way. At least most of my items merge in for the Mino shape so that I get the benefits from my weapons, rings, boots of speed...<br/>\nStill kinda annoying that I cannot use anything but potions while shifted. At least, Bard songs still work. Curse song is a nice one.<br/>\nEvery time I return to human form to use the Stone of Recall, then sell and buy stuff, my toon complains that he is encumbered, lol... still worth a try to play a shifter, so much fun to look at the different shapes! (Had a lot of fun already with Hip's \"Lord of Terror\" in EN6).<br/>\nToo bad I won't reach level 21 in the OC, I would love to see a Risen Lord, buffed with both Druid and Bard spells plus Bard Songs wreaking havoc, lol...</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:26 PM - Aug 27, 2018",
      "content": "<div><blockquote><div><cite>Freaky Grandma wrote:</cite>\nToo bad I won't reach level 21 in the OC, I would love to see a Risen Lord, buffed with both Druid and Bard spells plus Bard Songs wreaking havoc, lol...\n</div></blockquote>\n\nWell, you could always pop into HotU, or possibly Aribeth's Redemption, both of which should get you to about level 28. You could then go into Sands of Fate to get all the way to 40. Or, alternatively, you could go straight from the OC into Mines of Twin Summit, which will also get you all the way to 40.<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:10 AM - Aug 28, 2018",
      "content": "<div>And here we are, the intrepid trio, crossing the recently vacated bridge to Culdney...<br/>\n<br/>\nRight, imgur is failing me now. It would appear that things have changed. I have a perfectly lovely png file file ready to plop here, but I can't seem to find the \"direct link\" button any more. And I'm less than happy. Anyone know what's going on?<br/>\n<br/>\nThanks</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:35 AM - Aug 28, 2018",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>\nAnd here we are, the intrepid trio, crossing the recently vacated bridge to Culdney...<br/>\n<br/>\nRight, imgur is failing me now. It would appear that things have changed. I have a perfectly lovely png file file ready to plop here, but I can't seem to find the \"direct link\" button any more. And I'm less than happy. Anyone know what's going on?<br/>\n<br/>\nThanks\n</div></blockquote>\nClick on your name in the top right corner of Imgur. Click Images. Click on the image you uploaded. There will be several links provided. Click on the Copy button next to the BBCode link, and paste that in your comment here.<br/>\n<br/>\nShould I be posting all screenshots here, or in the thread for the module I am playing (if it has one)?</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:16 AM - Aug 28, 2018",
      "content": "<div>Thanks Empyre, thou art a diamond as ever. I shall try that tomorrow - about to hit the hay now.<br/>\n<br/>\nAs to where to post screenshots, it ain't my call. Alas, in Hip's absence, I don't know whose it would be. In the meantime, I'd probably go for OC/SoU/HotU ones here, and the others seem to give some flavour to the individual threads concerned (if, as you say, they have one). I'm more than happy to be flexible, though.<br/>\n<br/>\nThanks again</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:59 PM - Aug 29, 2018",
      "content": "<div>Right, let's try again, shall we...<br/>\n<br/>\n(And yes, I know what I said in my previous post, but it seems sensible to put this one here.)<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/4xVDpNd.png\"/><br/>\n<br/>\nHoorah - it worked. Cheers, Empyre</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "4:55 PM - Aug 30, 2018",
      "content": "<div>Which module is that, Stag? Aielund? Definitely something that uses the CEP, that much is visible. Nice shot, by the way. And great it works for you again!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:07 PM - Aug 30, 2018",
      "content": "<div><blockquote><div><cite>Freaky Grandma wrote:</cite>\nWhich module is that, Stag? Aielund? Definitely something that uses the CEP, that much is visible. Nice shot, by the way. And great it works for you again!\n</div></blockquote>\n\nIndeed, it is Aielund. I've missed the place - it's my favourite by a country mile. Great plot with bucket-loads of twists and turns, lots of action, excellent companions (the AI is SO much better), and gets you from level 1 to at least 36 (though 37 is certainly do-able, and Mick's recently been showing off about hitting level 38, but he soloed it, so missed out on some flavour, to my mind). There are a few changes from vanilla (all detailed on page 13 - I think - of the Aielund thread), including no Dev-Crit, but nothing radical. I can't recommend it highly enough. You won't ever regret playing it.<br/>\n<br/>\nCheers!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:44 AM - Sep 07, 2018",
      "content": "<div>Haven't had much playtime, alas, but here we are heading into the Tomb of the Exiled Knight in Aielund at level 7.<br/>\n<br/>\nTo quote my mentor: \"Full plate and packing steel.\"<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/I6TfDF7.png\"/><br/>\n<br/>\nAnd Dante's comment is great.<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Oh, and it would seem that I'm more of a \"do as I say, not as I do,\" sort of fellow when it comes to where to post screenshots. Sorry!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:16 AM - Sep 09, 2018",
      "content": "<div>Here I am in MTS Chapter 2, ready to go to Vistelle:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/unM1Mep.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:44 AM - Sep 17, 2018",
      "content": "<div>... and so ends this run through MTS:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/Bxetifc.png\"/><br/>\nThis one was a lot of fun. Now, I'm going to take a break from playing NWN to do some Doom modding. I will still drop by here every day, so not much will change. I do have a lot of builds planned to play.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:42 PM - Sep 17, 2018",
      "content": "<div>Nice combat shot Empyre!<br/>\n<br/>\nI really wish Beamdog finally gives us a chance to get character faces without the helmets, or at least open-faced ones.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:51 PM - Sep 17, 2018",
      "content": "<div>Just for interest, I had a look at my final stats when taking the unarmed Order of the Wyrm through MTS. I ended up with the same Str and Cha as you, but the rest differed slightly: I had 2 more Dex and 8 more Int, while you had 2 more Con and Wis. Your AC of 90 dwarfed my 78 and you had 47 more hps. My saves were 10 higher across the piece. And we both had the same AB. I'm guessing much of these had to do with what gear we equipped.<br/>\n<br/>\nStill a great build to play, Empyre - thanks for it!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:28 PM - Sep 17, 2018",
      "content": "<div> I have a long time to post any screenshots myself here and since I have some time now...<br/>\n<br/>\nThis screenshot is from \"The Arena of Champions\", a well-known module with amazing scripts that sadly never got to its final release...The amount of work done by its author is nothing but staggering. I am still planning to do a full review of this at some point.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/SDfpkOF.jpg\"/><br/>\nYou can get some nice rewards besides artifacts of power in this module, this is one of them.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/3F0RMgM.jpg\"/><br/>\nAnd if you manage to finally beat it, then a long cinematic with your coronation awaits you...Now do it again from the evil side and it's totally different! <br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/0JrPgut.jpg\"/><br/>\nBack to the \"Tournament of Champions\" and the kukri master is as dangerous as ever. Even a Paladin with perfect saves can-and-will roll a \"1\".<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/7Bsojg7.jpg\"/><br/>\nAnd here is \"Siege of the Heavens\" and that is an enormous and very dangerous spider...<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/HW4KEZv.jpg\"/><br/>\nBack to low-levels and the Rangers meet the Revenant in \"SnowHunt\". A top-class module albeit a bit short. <br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/B2x68uc.jpg\"/><br/>\nValerfor has had enough with the monks, but who can blame him, right?<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/sNyNsag.jpg\"/><br/>\nThis is bonus pick No 1, a battle-ready Jaheira from Deviant Art<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/VCNQfar.jpg\"/><br/>\nBonus pick No 2, Valerfor, Maximilian Kane and Black Cobra outside the walls of Greyhawk discussing their next mission. That goes back in time...maybe half-a-decade ago. <br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/Gu3OCwK.jpg\"/><br/>\nAnd that's it, I hope you like them :)</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:36 PM - Sep 17, 2018",
      "content": "<div>Here are the links to the modules mentioned in the above post, for anyone interested.<br/>\n<br/>\nThe Arena of Champions =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/arena-champions-buildmaster\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... uildmaster</a><br/>\nSiege of the Heavens =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/siege-heavens\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... ge-heavens</a><br/>\nSnow Hunt =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/snow-hunt\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... /snow-hunt</a><br/>\nTournament of Champions =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/tournament-champions\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... -champions</a><br/>\nRaine's World of Greyhawk =&gt; <a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/raines-world-greyhawk\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... d-greyhawk</a></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:46 PM - Sep 17, 2018",
      "content": "<div>Thanks for these, Valerfor - and the links. I can't help but wonder who was who in your second bonus pic? If I were to guess, I'd say that was Max's Drow Fencer in the centre, I don't know Black Cobra I'm afraid, but I'll go for him being the dude with the bow, which leaves you as the big shiny one.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:57 PM - Sep 17, 2018",
      "content": "<div>Haha! You were almost correct Stag :)<br/>\n<br/>\nMyself is in the centre playing Max's Drow Fencer indeed!<br/>\nMax is the big intimidating guy with the Crown on his head (which is an artifact, that he had to roll a willpower check or die instantly, to pick it up)<br/>\nBlack Cobra is, correctly again, the Dwarf with the bow!</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:56 PM - Sep 18, 2018",
      "content": "<div>Ah - sneaky, that, playing someone else's build who's also in the party!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:00 AM - Sep 23, 2018",
      "content": "<div>I couldn't stay away for long. Here I am in the third level of the cathedral in The Lord of Terror.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/uHxtHLW.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "11:11 AM - Oct 04, 2018",
      "content": "<div>I just defeated Diablo! I found several things this time that I never found before, but I did not find where to go to fix the poisoned water supply.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/BeM2EKY.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:38 AM - Oct 08, 2018",
      "content": "<div>Now, I've started the Adam Miller campaign. Here I am in Shadowlords 2:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/c4kGEz2.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:37 AM - Oct 19, 2018",
      "content": "<div>Here we are continuing the Adam Miller campaign n Dreamcatcher 1:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/SEZCvGP.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Shia_Luck",
      "avatar": "10758897_1524612892.jpg",
      "timestamp": "3:52 AM - Oct 19, 2018",
      "content": "<div>Oh , A screenie thread!<br/>\n<br/>\nCan i post pics from my remale of Good vs Evil3 by John Bye? <br/>\n<br/>\n(Tho who could stop me if we have no admin ? *cheeky grin* )<br/>\n<br/>\nFirst up.. some pics from my perpetual work in progress (aka not done anything in years) expanding John Bye's Good vs Evil RTS game into something prettier (and more suited to epic levels.. This is just the hang out area pre battle.. there's bars, a temple (to the holy rat) , duelling, portrait painters, shops, beaches and a bunch of secrets to discover.<div class=\"collage cl-af\"><div class=\"b\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201810/10758897_f867f5cc25042cf6dacac87ad7644d3b_t.png\"/>\n</dl>\n</div><div class=\"b\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201810/10758897_5ddd64934be0b7933f917b8a98e1e7b8_t.png\"/>\n</dl>\n</div><div class=\"b\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201810/10758897_a7129cb589da05fa5f61227fd0397c2d_t.png\"/>\n</dl>\n</div><div class=\"b\">\n<dl class=\"fileimage display\">\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/201810/10758897_c1dfdec9c6164da0297950385131ce8b_t.png\"/>\n</dl>\n<div class=\"has-more\">+1</div></div>\n</div>Have fun :)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:07 PM - Oct 19, 2018",
      "content": "<div>Nice, Shia - and in Cinemascope, too. Afraid I'm ignorant of Good vs Evil (the game, not the eternal struggle). Any more info you could impart?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Shia_Luck",
      "avatar": "10758897_1524612892.jpg",
      "timestamp": "8:53 PM - Oct 29, 2018",
      "content": "<div>Oops, missed this. Apologies for a late reply.<br/>\n<br/>\n\"Lead an army in an epic battle between good and evil, with up to a hundred soldiers on either side!<br/>\n<br/>\nGive orders to your troops, summon reinforcements, and deploy artillery to support them, as your army strives to capture the enemy's shrines, smash down the gates of their fortress and destroy their altar.<br/>\n<br/>\nWage war against the computer, or take the battle online and fight alongside (or against!) your friends. Join either side, as a General or a Hero, with six armies to lead, and eight battlefields to fight over.\"  (Vault blurb)<br/>\n<br/>\nSo, it's not an adventure with a story, but a Real Time Strategy game. You have an Altar that must survive and the enemy has one you must destroy. You both have a number of shrines which generate mana, and mana is spent spawning your army, buying seige weapons and casting a limited number of healing spells. You can let the AI run your army or you can be the General, deciding which troops to spawn, giving them orders to attack a target, guard your shrines or strategic choke points, or simply come with you as you lead an attack force. <br/>\n<br/>\nIf you aren't a PW player it's a great way to keep your characters alive after their module finishes and even at lvl40 (Tho it does become a case of can you survive dev crit @ lvl40 (so fortification on items is a good idea), and I used it a lot as a place to create a character I had built in excel as I got into learning how (and lurking here for ages ofc ;) ). When you build a character with an impressive spell or special ability DC, you want to use it a lot, no? Bard song and mass buffs from casters come into their own when you're able to influence so many troops. With the exception of the social skills, everything can be useful. I even have an effective Harper Scout there. <br/>\n<br/>\nThe author, John 'Gestalt' Bye, actively encourages modding it and provides a step by step guide to building your own maps etc. I wanted to make it less about dev crit and make it even more about your character and what they can do at high levels so started modding the armies and abilities and making new maps etc, and ended up making all sorts of changes. So the screenies I posted are from my version. I'll take some when in a battle and post them. <br/>\n<br/>\n<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/good-vs-evil-iii\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... s-evil-iii</a><br/>\n<br/>\nHave fun :)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:35 PM - Oct 29, 2018",
      "content": "<div>Thanks, Shia. So, a cross between a god-game (like Civilizations) and d&amp;d. Could be fun. Will give it a whirl once my pc stops treating NwN like cat-sick.<br/>\n<br/>\nAnd kudos on your own modding!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Shia_Luck",
      "avatar": "10758897_1524612892.jpg",
      "timestamp": "3:03 AM - Oct 30, 2018",
      "content": "<div>I was about to say, no, not the CIV games, but there are some god elements you can utilise. (But it's a play on words, so, no. *grin*.) I guess you didnt play online PvP game modes in other games like king of the Hill or Capture The Flag?  (This is exactly like Unreal Tiurnament 2004 Onslaught mode on the off chance?)  Or maybe you did and I just dont like the god element of Civ in your reply?  It is essentially about controlling territory like civ but none of the research, faith etc.. that's the DnD character build bit. <br/>\n<br/>\nThing is, the difference with NWN and DnD is that you generally dont get 4-6 ish people playing together as the original DnD was conceived, (even in PWs IME, (Once we got 8 of us in a quest party and ofc there were DM events where lots would meet up, but playing GvE with friends was the only other time I got 8 people playing together.)  (tho I never tried slow levelling, full RP, no OOC chat servers. Not my thing. Maybe it works there.) Anyway, a healer build, for example, is a weak choice in a party of you and a henchie or a couple of friends .. but in the context of an army at war, you can make a significant difference. Many RP builds are weak choices, yet can be incredible in that war context (If you go where you are needed to support, attack, defend etc). <br/>\n<br/>\nIn fact, it could be a great place to experiment with a caster build.. you know, if you were an out and out meleer and wanted a nice environment to learn how to fight with one *Cheeky grin* (Sorry, but as a caster, how can I not join in the 'get Stag to play a caster' campaign? *grin*) <br/>\n<br/>\nHave fun :)<br/>\n<br/>\nEDIT: Modding things only breaks other things, lol. The economy in mine is a joke, some troops spawn naked and OMG trying to rename everything to make an easy hak download compatible with CEP drove me so insane I burnt out. (At least part of the reason I am only now returning to NWN after years away). </div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "4:35 AM - Oct 30, 2018",
      "content": "<div>I felt compelled to share some screenshots of my Dwarven weapon master carving up the Fire Clan.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:10 PM - Oct 30, 2018",
      "content": "<div>Cool, eltalstro (well, it looks very hot, but you know what I mean). I see you've also gone for a more, shall we say...dynamic avatar as well - no more strumming and songs by the campfire!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "4:28 AM - Oct 31, 2018",
      "content": "<div>Awesome action-pics eltalstro!</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:11 PM - Jul 09, 2019",
      "content": "<div>I recently played MTS with a character that I had played in the OC years ago.  Before starting, I re-leveled him in PGCC, switching the scimitar feats to longsword, and I forged up longswords with the exact same enchantments as the scimitars he had in his inventory.  Here he is confronting the final boss of MTS3:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/ZCtBu5x.png\"/><br/>\n<br/>\nNow, I am in the middle of Eye of the Beholder.  Like I have been doing lately, she is named after one of my many cousins, and the last name is because she is a small fry.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/JboK7J6.png\"/><br/>\nShe is glowing because the cursor is on her, otherwise, she has these awful shadows on her face in this setting.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "8:28 PM - Jul 09, 2019",
      "content": "<div><blockquote><div><cite>Empyre65 wrote:</cite>\nI recently played MTS with a character that I had played in the OC years ago.  Before starting, I re-leveled him in PGCC, switching the scimitar feats to longsword, and I forged up longswords with the exact same enchantments as the scimitars he had in his inventory.  Here he is confronting the final boss of MTS3:<br/>\n<br/>\nNow, I am in the middle of Eye of the Beholder.  Like I have been doing lately, she is named after one of my many cousins, and the last name is because she is a small fry.<br/>\n<br/>\nShe is glowing because the cursor is on her, otherwise, she has these awful shadows on her face in this setting.\n</div></blockquote>\nI like the fact you put your build order in the journal! I never thought of that! :)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:40 PM - Jul 09, 2019",
      "content": "<div>You seem to have really taken to the small folk in the past year or so, Empyre! Now you're more used to them, how about a Hin RDD build? (Gods, I hope you haven't already done one that I've missed...)<br/>\n<br/>\n<strong><em>EDIT: </em></strong>Damn it, I've just seen your recent post in the WoG thread, and what do I find? A halfling RDD, of course!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:46 PM - Jul 09, 2019",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>\nhow about a Hin RDD build? (Gods, I hope you haven't already done one that I've missed...)\n</div></blockquote>\nIt's funny you mentioned that, given what I just posted in the WoG thread. ;)<br/>\n<br/>\nLOL, ninja'd by an edit.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:53 PM - Jul 09, 2019",
      "content": "<div>Now what we want is a gnome RDD with DR III and Dev crit with a two-hander Scimitar. <span class=\"text-emoji\">😎</span></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:07 PM - Jul 09, 2019",
      "content": "<div>Well this is the closest I could find at short notice, Mick - a possible variation on Max's build?<br/>\n<br/>\n<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/deekin-scalesinger-bard-20-fighter-10-rdd-10-t2269106.html\" rel=\"noreferrer\" target=\"_blank\">Deekin</a></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:00 AM - Jul 10, 2019",
      "content": "<div>If you want a Challenger 2 (adjusted Tank preferences for Britain), then you should have a look at this build by Demos (Firefly's also below). Not for shorties but can be adjusted easily as the build's layout is solid &amp; welcomes modifications to taste. <br/>\nThe usual good AC of the rdd's, strong Dev. Crit DC, solid saving-throws, \"expertise\" feat, 600 hit-points &amp; EDR III.<br/>\n<br/>\n<strong>Dreadnought </strong>=&gt; <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/dreadnought-fighter-24-bard-6-red-dragon-disciple--t515496.html#p177\" rel=\"noreferrer\" target=\"_blank\">dreadnought-fighter-24-bard-6-red-drago ... .html#p177</a></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:02 AM - Jul 10, 2019",
      "content": "<div>Ah, nice. I can't remember your exact quote, Valerfor, but it was on the lines of \"any good fighter that can be a dwarf,<strong><em> is</em></strong> a dwarf\". A code to live by.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:15 AM - Jul 10, 2019",
      "content": "<div>Yeah &amp; you've said something about \"bairdiness\" in another post, so, you know dwarves, beards, good warriors, these things have something in common apparently, at least in 3E.<br/>\n<br/>\nBack in the days of 2nd Edition, at least Elves were a serious contender, with their extra AB with bows &amp; arrows &amp; supreme detection/surprise abilities but the vanilla 3E Elf is lucking in comparison.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:46 PM - Jul 31, 2019",
      "content": "<div>I just finished Eye of the Beholder:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/Thq0Tqo.png\"/><br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://i.imgur.com/IsWzO7L.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "6:32 AM - Aug 01, 2019",
      "content": "<div>How difficult was it, Empyre? <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:28 AM - Aug 01, 2019",
      "content": "<div>The final boss fight took a few tries, but most of it was pretty easy with a strong build and good gear, and fun (except the rust monsters).  I recommend Eye of the Beholder.  I ended at level 22: Rogue 10 / Fighter 4 / CoT 8.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:36 AM - Aug 01, 2019",
      "content": "<div>I have also played it with a Fighter / Bard / RDD, a STR-based Rogue / Fighter / CoT (unlike the DEX-based one I just played), and a Monk / Sorcerer / RDD.<br/>\n<br/>\nTip: Use a potion of Recall next to the first merchant, and never use one again.  That way, you can use any recall portal to return to him to sell loot.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "2:48 PM - Aug 02, 2019",
      "content": "<div>Congrats Empyre &amp; thank you for the screenshots too, I know Xanathar is a tough opponent.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:50 PM - Sep 11, 2019",
      "content": "<div>Alright, I'm pinning this thread now. That's not out of arrogance 'cause I started it, or anything like that, but things are getting a little convoluted all over the place, and it might help to remind people that we have somewhere to post our screenshots - unless they have particular value to the thread in question. (Ooh, get me - coming over all masterful!)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "12:15 PM - Sep 12, 2019",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>Alright, I'm pinning this thread now. That's not out of arrogance 'cause I started it, or anything like that, but things are getting a little convoluted all over the place, and it might help to remind people that we have somewhere to post our screenshots - unless they have particular value to the thread in question. (Ooh, get me - coming over all masterful!)</div></blockquote>I'm imagining you saying it like one of the bad voice acted cut scenes. Maybe in the voice of Sodalis. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "grom56",
      "avatar": "10745842_1510287074.jpg",
      "timestamp": "12:21 AM - Sep 18, 2019",
      "content": "<div>So here's a screenshot, I don't get many fighting shots, as I'm normally dead or dying.....<br/>\nBut here Lessa pulls a fast one on a Knight guarding a door.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "12:38 AM - Sep 18, 2019",
      "content": "<div>Not bad at all, that's a tough persuade check Grom.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:02 AM - Sep 18, 2019",
      "content": "<div>And that's a particularly fetching tartan cloak you're wearing - it brings out your eyes (yes, I know, we can't see them, but roll with it will you...)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "8:01 AM - Sep 29, 2019",
      "content": "<div>I shudder to think how much time I've put into NWN over the years.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "8:35 AM - Sep 29, 2019",
      "content": "<div>1300h for enhanced edition only?<br/>\nNot bad  <span class=\"text-emoji\">😉</span></div>"
    },
    {
      "author": "Aquarius 233",
      "avatar": "10714033_1519247364.jpg",
      "timestamp": "12:01 PM - Sep 29, 2019",
      "content": "<div>You've tested it thoroughly! ;)<br/>\nTalk about liking a game....</div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "9:50 AM - Oct 01, 2019",
      "content": "<div>Lol! Not quite that dedicated. Those aren't stacking totals. I'm up to 450 on EE now though. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "11:07 AM - Oct 20, 2019",
      "content": "<div>Playing A Hunt Through Darkness with a \"Drow\" rogue/fighter/BG. It's quite fun and has some really good points but also some downsides. Might do a review in the modules section. Loving the evilness.</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "12:10 PM - Oct 20, 2019",
      "content": "<div>That is a great screenshot and great portrait choice :)</div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "12:58 PM - Oct 20, 2019",
      "content": "<div>Thanks, Orion. PC matching with portrait is a bit of an obsession for me. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Orion",
      "avatar": "10759084_1591431150.jpg",
      "timestamp": "1:26 PM - Oct 20, 2019",
      "content": "<div>I find it the hardest part of character creation! Especially when you have like 4-5 portrait packs installed :)</div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "8:06 PM - Oct 20, 2019",
      "content": "<div>I like to think of a build, find a portrait that captures what I'm going for and then use the ConvertPortrait command. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:59 PM - Oct 18, 2020",
      "content": "<div>I have started The Lord of Terror with a variant of my Order of the Wyrm, and I intend  to follow it with Sands of Fate.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202010/10235276_af36de952165b50b9777244d61c936e2_t.png\"/><br/>\nHere's the build\n<details><summary>Spoiler</summary>\nOrder of the Wyrm 23 (Monk 25 / Sorcerer 1 / Red Dragon Disciple 14)\nPlayable 1 - 40\n\nSTR: 16 (38)\nCON: 14 (16)\nINT: 12 (14)\n\nHuman: (Quick to Master)\n02: Monk(2): {Deflect Arrows}\n04: Monk(4): STR+1, (STR=17)\n06: Monk(6): Blind Fight, {Knockdown, Improved Knockdown}\n08: Monk(8): STR+1, (STR=18)\n10: Monk(10)\n12: Monk(12): STR+1, Improved Critical: Unarmed, (STR=19)\n14: Monk(14)\n16: Monk(16): STR+1, (STR=20)\n18: Monk(18): Toughness\n20: Monk(20): STR+1, (STR=21)\n22: Red Dragon Disciple(1)\n24: Red Dragon Disciple(3): STR+1, Overwhelming Critical: Unarmed, (STR=24)\n26: Red Dragon Disciple(5)\n28: Red Dragon Disciple(7): STR+1, (STR=27), (CON=16)\n30: Red Dragon Disciple(9): Great Strength I, (STR=28), (INT=14)\n32: Monk(21): STR+1, (STR=33)\n34: Monk(22)\n36: Monk(23): STR+1, Great Strength III, (STR=36)\n38: Red Dragon Disciple(13)\n40: Red Dragon Disciple(14): STR+1, Epic Prowess, (STR=38)\nStats:\nSkillpoints: 238\nSaving Throw bonuses: Spells: +5, Mind Effects: +2\nAB (max, naked): 43 (melee), 28 (ranged)\nSpell Casting: \n\nBluff 2(2), Discipline 43(57), Lore 41(43), Search 43(45), Spellcraft 24(26), Spot 43(44), Tumble 40(42)\n01: Discipline(4), Lore(4), Tumble(4), Save(12)\n03: Discipline(1), Lore(1), Tumble(1), Save(18)\n05: Discipline(1), Lore(1), Tumble(1), Save(24)\n07: Discipline(1), Lore(1), Tumble(1), Save(30)\n09: Discipline(1), Lore(1), Tumble(1), Save(36)\n11: Discipline(1), Lore(1), Tumble(1), Save(42)\n13: Discipline(1), Lore(1), Tumble(1), Save(48)\n15: Discipline(1), Lore(1), Tumble(1), Save(54)\n17: Discipline(1), Lore(1), Tumble(1), Save(60)\n19: Discipline(1), Lore(1), Tumble(1), Save(66)\n21: Lore(1), Spellcraft(24), Save(48)\n23: Discipline(1), Search(1), Spot(1), Save(1)\n25: Discipline(1), Search(1), Spot(1), Save(1)\n27: Discipline(1), Search(1), Spot(1), Save(1)\n29: Discipline(1), Search(1), Spot(1), Save(3)\n31: Discipline(1), Search(1), Spot(1), Save(6)\n33: Discipline(1), Search(2), Spot(2)\n35: Discipline(1), Search(2), Spot(2)\n37: Discipline(1), Tumble(4), Save(2)\n39: Discipline(1), Lore(6)\n</details>\nI don't remember why I took 2 ranks of Bluff in early epic levels.  Does anybody know why that would be useful?</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:14 PM - Oct 18, 2020",
      "content": "<div>Good stuff, Empyre! Apart from anything else, it's been a year since we used this thread, believe it or not!<br/>\n<br/>\nAfraid I've never played LoT, so don't know if a mite of Bluff is useful or not, sorry.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:29 PM - Oct 18, 2020",
      "content": "<div>Hair needs moar silver - platinum blonde in the portrait.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:19 PM - Oct 18, 2020",
      "content": "<div><blockquote><div><cite>webshaman1 wrote: <div class=\"responsive-hide\">Oct 18, 2020</div></cite>Hair needs moar silver - platinum blonde in the portrait.</div></blockquote>\nOoh, get you, Vidal Sassoon!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "6:20 PM - Oct 18, 2020",
      "content": "<div>Silky, beautiful silver strands!</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "8:20 PM - Oct 18, 2020",
      "content": "<div>OK<br/>\nI actually played it, (but it's been a while).<br/>\nNever took any ranks in bluff and never regretted it.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:20 AM - Oct 19, 2020",
      "content": "<div>It was 2 years ago that I made the build with the intent of playing it in LoT and SoF, so I don't remember what I was thinking then.  Maybe I'll switch those points to Appraise, which would be of some use in SoF.<br/>\n<br/>\nI tried to match the hair color, but the selection was sparse, and I couldn't see the portrait while selecting the color.  This is close enough, especially considering that for most of the character's lifetime, she will have her head covered.<br/>\n<br/>\nStag, you do need to add Lord of Terror to your to-play list, with a Lawful character.  It will take you from level 1 to about level 28.  It is like Mines of Twin Summit, but with more polish.  I never played Diablo, but this is supposedly a good reproduction of that game in NWN.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:44 AM - Oct 19, 2020",
      "content": "<div><blockquote><div><cite>Empyre65 wrote: <div class=\"responsive-hide\">Oct 19, 2020</div></cite>\nStag, you do need to add Lord of Terror to your to-play list, with a Lawful character.  It will take you from level 1 to about level 28.  It is like Mines of Twin Summit, but with more polish.  I never played Diablo, but this is supposedly a good reproduction of that game in NWN.</div></blockquote>\nI've enjoyed your other recommendations, so will do, thanks!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "11:54 AM - Oct 19, 2020",
      "content": "<div><blockquote><div><cite>Empyre65 wrote:</cite>It was 2 years ago that I made the build with the intent of playing it in LoT and SoF, so I don't remember what I was thinking then.  Maybe I'll switch those points to Appraise, which would be of some use in SoF.<br/>\n<br/>\nI tried to match the hair color, but the selection was sparse, and I couldn't see the portrait while selecting the color.  This is close enough, especially considering that for most of the character's lifetime, she will have her head covered.<br/>\n<br/>\nStag, you do need to add Lord of Terror to your to-play list, with a Lawful character.  It will take you from level 1 to about level 28.  It is like Mines of Twin Summit, but with more polish.  I never played Diablo, but this is supposedly a good reproduction of that game in NWN.</div></blockquote>I concur. LOT is a favourite. Gets pretty difficult in places. Big mobs. Lots of fun. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:29 AM - Oct 21, 2020",
      "content": "<div>I have leveled up a couple times and I have better gear.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202010/10235276_0e46b8810afacd67a5ff8743388a5873_t.png\"/>I went back up to level 2 and fought the tough boss there, and now I am about to go the the lair of another tough boss.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:40 AM - Oct 28, 2020",
      "content": "<div>Here I am about to descend to the third level of the Catacombs, having just explored everything in the forests to the North, except for two areas that are sealed.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202010/10235276_2bf64927a77395be3673782130b6bbbf_t.png\"/><br/>\nBTW, I am soloing this with no henchman.  I am doing fine so far.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "5:50 AM - Oct 28, 2020",
      "content": "<div><br/>\n<blockquote><div><cite>Empyre65 wrote:</cite>\nBTW, I am soloing this with no henchman.  I am doing fine so far.</div></blockquote>\n\nRight idea. I've found the henchmen in this module are more of a hindrance than a help. <br/>\n<br/>\n<br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "6:02 AM - Oct 28, 2020",
      "content": "<div>A moment of triumph over Robert Black. </div>"
    },
    {
      "author": "MentalDekay",
      "avatar": "10759116_1563898639.jpg",
      "timestamp": "4:11 PM - Oct 29, 2020",
      "content": "<div><blockquote><div><cite>eltalstro wrote: <div class=\"responsive-hide\">Oct 28, 2020</div></cite>A moment of triumph over Robert Black. </div></blockquote>\nThat jerk. Good riddance, I hope ;)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:36 PM - Oct 29, 2020",
      "content": "<div><blockquote><div><cite>eltalstro wrote: <div class=\"responsive-hide\">Oct 28, 2020</div></cite>A moment of triumph over Robert Black. </div></blockquote>\nIf you want to see the contrast between \"old\" Aielund and the new shiny version (whether it's EE or Aielund's own EE, or both), I posted a shot of the same scene (from a different PoV) back on page 5 of this thread.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:23 AM - Nov 15, 2020",
      "content": "<div>Here I am about to enter the Archbishop's Inner Sanctum:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202011/10235276_eefa967e2ca07b2df61f450e5ccd4d94_t.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:37 PM - Nov 15, 2020",
      "content": "<div>How far from the end (roughly) is that, Empyre?<br/>\n<br/>\nShe's looking kewl, btw!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "10:49 PM - Nov 15, 2020",
      "content": "<div>That was a tough fight from what I can remember. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:10 AM - Nov 16, 2020",
      "content": "<div>LoT ends at about the same level as HotU, so at level 24, I am sort of close to the end.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "12:27 PM - Nov 16, 2020",
      "content": "<div>They obviously didn't make this guy 'Gang Leader' for no reason.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:54 PM - Nov 16, 2020",
      "content": "<div>Ah - back in the OC, I see (or should that be IC?)</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "1:12 PM - Nov 16, 2020",
      "content": "<div><blockquote><div><cite>Stagmeister wrote:</cite>Ah - back in the OC, I see (or should that be IC?)</div></blockquote>Yeah, I decided to go through it and then Aribeth's Redemption. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:26 PM - Nov 16, 2020",
      "content": "<div><blockquote><div><cite>eltalstro wrote: <div class=\"responsive-hide\">Nov 16, 2020</div></cite><blockquote><div><cite>Stagmeister wrote:</cite>Ah - back in the OC, I see (or should that be IC?)</div></blockquote>\nYeah, I decided to go through it and then Aribeth's Redemption. <br/>\n<br/>\nSent from my G3125 using Tapatalk</div></blockquote>\nI don't know if you've done the Redemption before, but don't let the inordinate amount of speechifying in the first part put you off - things do improve! You can also check out the <a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/aribeth-s-redemption-t2354666.html\" rel=\"noreferrer\" target=\"_blank\">Aribeth's Redemption</a> thread in the Modules forum if you like (I don't think there are any spoilers)<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "1:37 PM - Nov 16, 2020",
      "content": "<div>I did give it a crack with my drum major build (which went well in the OC) but found the first major enemy to be unbeatable. Ridiculously so. <br/>\n<br/>\nSent from my G3125 using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "5:17 AM - Nov 18, 2020",
      "content": "<div>Diablo is defeated!<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202011/10235276_cefc887a6a0334eea138393ecfe0cabd_t.png\"/><br/>\nSands of Fate is next.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:00 AM - Nov 18, 2020",
      "content": "<div>Excellent stuff, Empyre!<br/>\n<br/>\nWill your gear be transferable to SoF like it is from HotU (dependent on the difficulty rating)?</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "6:10 AM - Nov 18, 2020",
      "content": "<div>Yes.  I play on Normal difficulty, because that seems like the normal thing to do, so all my gear transfers.  It even keeps the CEP appearance because SoF uses CEP, too.  I just saved the game in the Realm Between Realms at the beginning because I don't have any more time to play NWN tonight.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:58 PM - Nov 18, 2020",
      "content": "<div><blockquote><div><cite>Empyre65 wrote: <div class=\"responsive-hide\">Nov 18, 2020</div></cite>Diablo is defeated!</div></blockquote>\nCareful with that soulstone!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:35 AM - Dec 02, 2020",
      "content": "<div>Here I am having just arrived in Aqualis.<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202012/10235276_f70191277144a362ca37695feb048d13_t.png\"/><br/>\nI need to explain what I did to the gloves.  I imported the character from the end of LoT into Pretty Good Char Creator and edited the Hellmouth gloves, which has Deflection AC +3, Attack Bonus +8, 15 Fire Damage, 50% Fire Immunity, and Vorpal DC 14.  I removed the AC bonus and the fire immunity, and downgraded the 15 Fire Damage to 2d10 Acid Damage, and then added Haste and +3 Regeneration, and upgraded the Attack Bonus to +10, leaving the Vorpal DC 14 property as-is.  The PGCC says that this is a level 25 item and i was level 27, so it is level-appropriate.<br/>\n<br/>\nBoth Lord of Terror and Sands of Fate use CEP, but PGCC does not, so I lost my gem pouches and whatever was in them, so here is how I fixed that.  I started a new game in SoF with the character with the edited gloves, dropped the gloves, and saved the game.  Then I started a multiplayer session, loaded the saved game, imported the character from the end of LoT, picked up the gloves and saved the game again.  When I loaded the game in single-player, I had both the edited gloves and the gem pouches.<br/>\n<br/>\nThe additional damage you see is from the nice upgrade you get near the beginning of SoF chapter 2 to your weapon, or in this case, Monk gloves, which is honestly the main reason I wanted to play an unarmed character in SoF.</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:40 AM - Dec 26, 2020",
      "content": "<div>I have reached the Pyramid of the Ancients in Sands of Fate Chapter 3.<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202012/10235276_b0ac8536bbbc394f9476d2132a94bfd4_t.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "1:14 PM - Dec 29, 2020",
      "content": "<div>My PC (sword raised) fighting her doppelganger:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://funkyimg.com/i/39Guz.jpg\"/></div>"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "3:27 AM - Dec 30, 2020",
      "content": "<div>Pavel simping <span class=\"text-emoji\">🙂</span><br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://funkyimg.com/i/39HkG.jpg\"/><br/>\n<br/>\nLight and darkness:<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://funkyimg.com/i/39HnJ.jpg\"/></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "6:09 PM - Dec 30, 2020",
      "content": "<div>I love the (first) action screenshot!</div>"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "12:29 AM - Jan 03, 2021",
      "content": "<div>The Fall of Aribeth<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://funkyimg.com/i/39NdN.jpg\"/></div>"
    },
    {
      "author": "Maximillian_Kane",
      "avatar": "10758866_1605883460.jpg",
      "timestamp": "1:12 PM - Jan 04, 2021",
      "content": "<div><blockquote><div><cite>darktooth wrote: <div class=\"responsive-hide\">Jan 03, 2021</div></cite>The Fall of Aribeth<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://funkyimg.com/i/39NdN.jpg\"/></div></blockquote>\nWhat module is this?</div>",
      "author-color": "#00AA00"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "11:41 PM - Jan 04, 2021",
      "content": "<div><blockquote><div><cite>Maximillian_Kane wrote:</cite>What module is this?</div></blockquote>\nIt is the original campaign, meeting Aribeth for the first time at the Graduation Chamber. Visual effects are applied using CCOH.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:23 AM - Jan 05, 2021",
      "content": "<div>What is CCOH?</div>"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "3:03 AM - Jan 05, 2021",
      "content": "<div>Customize Character Override Hak. In my opinion, it is better than PGCC because it has more customization options. You can even change the character height, and make helmets invisible.</div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "11:42 PM - Jan 05, 2021",
      "content": "<div>Preach it, man, you just drop it in your override folder &amp; then your characters are never the same again.</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:24 AM - Jan 08, 2021",
      "content": "<div>i have reached level 40.  I have also reached the catacombs under the pyramid.<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202101/10235276_2affb3dc8c4749f8a2ad33b3accee48e_t.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:29 AM - Jan 08, 2021",
      "content": "<div>Nice one Empyre! Oh, and are those actual gloves I see her wearing? From some mod or other?<br/>\n<br/>\nCheers</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:53 PM - Jan 08, 2021",
      "content": "<div>The gloves are part of the Rogue's Delight \"robe\" that she is wearing.<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202101/10235276_bfbee797893ff00c6749fb67e2338673_t.png\"/></div>",
      "author-color": "#00AA00"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:37 PM - Jan 08, 2021",
      "content": "<div>Well, it's certainly a kewl look!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "2:31 PM - Jan 09, 2021",
      "content": "<div>Fighting fire with fire<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://funkyimg.com/i/39WSD.jpg\"/></div>"
    },
    {
      "author": "darktooth",
      "avatar": "10759000_1542893921.jpg",
      "timestamp": "11:49 PM - Jan 09, 2021",
      "content": "<div>Surprise appearance<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://funkyimg.com/i/39XsQ.jpg\"/><br/>\n<br/>\nIncensed, they attack!<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://funkyimg.com/i/39XsR.jpg\"/></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "9:14 PM - Jan 10, 2021",
      "content": "<div>Quite an artistic approach, Darktooth, I appreciate that.</div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "9:11 PM - Jan 23, 2021",
      "content": "<div>A battle mage and her faithful mummy thrull make their way across the broken landscape of Avernus.<br/>\n<br/>\n<img class=\"post-image\" loading=\"lazy\" src=\"https://attachment.tapatalk-cdn.com/2742/202101/10758933_34ebecea249e18823b83808b816a99ee_t.png\"/></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:35 AM - Jan 24, 2021",
      "content": "<div>Now that's a landscape! Admittedly if you're keen on the hells and such, but nonetheless.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "eltalstro",
      "avatar": "10758878_1582351977.jpg",
      "timestamp": "4:47 AM - Jan 24, 2021",
      "content": "<div><blockquote><div><cite>grizzled_dwarflord wrote: <div class=\"responsive-hide\">Jan 23, 2021</div></cite>A battle mage and her faithful mummy thrull make their way across the broken landscape of Avernus.<br/>\n<br/>\nScreenshot (133).png</div></blockquote>\nIs this a PW or a Module? Looks great.</div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "4:48 AM - Jan 24, 2021",
      "content": "<div>It's WoG - a Server PW.<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "kfor85",
      "avatar": "10759362_1598639921.jpg",
      "timestamp": "11:26 AM - Jan 24, 2021",
      "content": "<div><blockquote><div><cite>grizzled_dwarflord wrote: <div class=\"responsive-hide\">Jan 23, 2021</div></cite>A battle mage and her faithful mummy thrull make their way across the broken landscape of Avernus.<br/>\n<br/>\nScreenshot (133).png</div></blockquote>\nGuilty pleasure times devcriting those devils eh? <span class=\"text-emoji\">😈</span><span class=\"text-emoji\">😁</span></div>"
    },
    {
      "author": "grizzled_dwarflord",
      "avatar": "10758933_1548854436.jpg",
      "timestamp": "3:09 PM - Jan 24, 2021",
      "content": "<div>Sometimes. Though not that guilty ‘cause there’s a few of them that dev crit back. </div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "5:16 PM - Jan 24, 2021",
      "content": "<div>Yeah, it's literally Hell!<br/>\n<br/>\nSent from my SM-G955F using Tapatalk<br/>\n<br/>\n</div>"
    },
    {
      "author": "kfor85",
      "avatar": "10759362_1598639921.jpg",
      "timestamp": "6:24 PM - Jan 24, 2021",
      "content": "<div>Yeah, both me and Web have been on the receiving end if those crits :D</div>"
    },
    {
      "author": "wanderei",
      "avatar": "no_avatar.png",
      "timestamp": "3:43 PM - Mar 28, 2024",
      "content": "<div><blockquote><div><cite>Empyre65 wrote: <div class=\"responsive-hide\">Jun 18, 2018</div></cite>I finished Eye of the Beholder. I'm sorry, but the last battle was so intense that the idea of taking a screenshot was unable to form in my mind at the time.<br/>\n<br/>\nWhen I am killed, I usually choose the load the last save rather than respawning, but I respawned several times in that battle. I m not exaggerating when I say that I had about 90 Heal potions, but often, I was unable to drink them fast enough to not die. Once, I died <strong><em>while</em></strong> being healed by a Heal potion. Fortunately, the end boss was ignoring my henchmen, which allowed them to kill him while he was busy killing me over and over. In a way, it was also lucky that he petrified me, making me immune to most of his attacks, so I was alive when the others killed him.<br/>\n<br/>\nI hit level 22 after the last battle, so that was useless.</div></blockquote>\nIn my version of the game petrification from Xanathar did perma death on me. I figured out quickly that you shouldn't suppose to fight him. Instead I used improved invisibility so he wont target me, and proceeded to push him into wall trap with Wand of Silvias (reward from Dwarven King from rescueing Prince).</div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "4:12 AM - Mar 29, 2024",
      "content": "<div>You must have been playing on Hardcore or harder.  I always play on Normal, because that seems like the normal thing to do.  Easier than that feels like cheating, while harder than that feels like making things harder just to make things harder.  However, you should play on whatever skill level feels right to you.</div>",
      "author-color": "#00AA00"
    }
  ],
  "author-color": "#AA0000"
}