{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "036",
  "name": "Multiple Installations",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/multiple-installations-t2354340.html",
  "author": "Kalistez",
  "avatar": "no_avatar.png",
  "replies": "1",
  "views": "577",
  "posts": [
    {
      "author": "Kalistez",
      "avatar": "no_avatar.png",
      "timestamp": "10:12 AM - Nov 19, 2014",
      "content": "<div>Hi,<br/>\n<br/>\n Does anyone know if there is a way to have multiple installations of NWN on one machine ?<br/>\n<br/>\n The install process wont let you choose an install path, it only gives you the option to uninstall.<br/>\n<br/>\n I was hoping to have separate installs for each PW I play on to avoid conflicts with HAK's ect.<br/>\n<br/>\n Thanks</div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:52 PM - Dec 05, 2015",
      "content": "<div>I always choose to install NWN directly off the main drive rather than among the default x86 program files folder.  Not sure why you aren't getting a location prompt.  You should.<br/>\n<br/>\n Theoretically, you could partition your drive and use something like Boot Camp to run different OS's on a single hard-drive (or iterations, this case).  Many Linux and Mac users use this. Essentially, you would boot into whichever partition you had the game version needed.  How the registry would keep track of this, I couldn't venture a guess.  You would be the one needing to remember which boot for which server.  Also, unless you installed multiple versions of web browsers and other commonly-used software on each partition, you'd need to keep rebooting to do simple tasks like checking email, streaming content or doing some office work.<br/>\n<br/>\n Seems an awfully convoluted strategy IMO.  It would probably be more efficient to just rename folders containing the custom resources specific to a particular server and toggle them back and forth (assuming your haks have been conflicting somehow).  But you would need to manually rename them yourself or write some script to toggle the versions on execution. </div>"
    }
  ]
}