{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "038",
  "name": "UMD scroll use, particularly for non-arcane casters",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/umd-scroll-use-particularly-for-non-arcane-casters-t2344857.html",
  "author": "MrZork",
  "avatar": "no_avatar.png",
  "replies": "0",
  "views": "1.2K",
  "posts": [
    {
      "author": "MrZork",
      "avatar": "no_avatar.png",
      "timestamp": "9:21 AM - Oct 31, 2013",
      "content": "<div>I just want to make a few notes on UMD, since it has come up a couple times in recent threads. (And, because the last issue is a peeve of mine.) <strong>Summary at the bottom.</strong><br/>\n<br/>\nFirst, unless the module is pretty high magic, UMD levels over 30 are rarely needed outside of scroll use and one may wish to minimize skill points put into UMD and make use of those skill points elsewhere. For scroll use, an adjusted UMD skill level of 33 is sufficient to cast all class-restricted scrolls with innate level 9 spells without chance of failure. At least in the standard Bioware scheme for hardcore or higher difficulty settings, where the UMD DC for scroll use is 25 + spell innate level. That also means that an adjusted UMD of 5 will always fail the UMD scroll check, even for level 1 spells.<br/>\n<br/>\nSecond, the standard Bioware system gives a free pass on the UMD scroll use check to toons with at least one level of bard, sorcerer, or wizard. The UMD score has to be high enough that the toon can \"use\" the item (meaning the scroll isn't highlighted red in his inventory). But, the hardcore check is skipped for such toons. So, one point of UMD is enough for such a toon to bypass the class restriction on any scroll that isn't red to him. That may be a build consideration if the primary reason for UMD in a build is to enable scroll use, since 1 point is enough for most level 4 spell scrolls (e.g. Improved Invisibility) and 10 points is enough that no standard scroll will be red.<br/>\n<br/>\nWhich brings me to the third point, which is relevant to the many cool builds featuring a divine caster with rogue (or assassin) levels. Make sure you know what UMD scroll use scheme your PW is using, because many PWs have modified Bioware's system. And well they should! There is a not-especially-rare class/skill combo that causes trouble for certain scroll users. The Bioware UMD check breaks scroll use for many divine casters with UMD. The BW UMD check forces a toon with a rank in UMD who doesn't have arcane caster levels to pass a UMD check even to cast divine scrolls that he could cast perfectly well before taking UMD. <br/>\n<br/>\nFor example, if a cleric toon takes a rogue level at level 17 (say for a tumble dump) and picks up UMD 20 (adjusted), he will then have to pass a UMD check to cast from a scroll, even a cleric scroll. That means he won't even be able to reliably cast Cure Light Wounds from a scroll, much less Greater Sanctuary, Mass Heal, or other higher level spells that are handy to keep on hand as scrolls. A non-arcane caster who takes UMD early (say gaining 5 skill levels at an early rogue level in order to use Boots of the Sun Soul +2 or a Wand of Missiles) will find that he is failing the UMD check on every class-restricted (even restricted to the divine class he has) scroll he tries to use.<br/>\n<br/>\nObviously, there is something odd at play when a toon could reliably cast all cleric spells from scrolls at one level and then have scroll casts start failing on him at the next level. But, Bioware never acknowledged this as a bug (though they knew about it) because they were concerned that making the scripted UMD scroll check work properly might cause lag on \"minimum specification\" PCs (this was a decade ago). In the meanwhile, several community programmers worked out UMD check systems for scroll use that work as one might expect (that is, without nerfing divine caster scroll use) without causing lag.<br/>\n<br/>\nJust to be clear: The issue is with divine casters who have ranks in UMD and who do not have levels in wizard, sorcerer, or bard. In that case, the toon will have to pass a UMD check in order to use any class-restricted scroll, 1) even scrolls normally usable by a class that he has, and 2) even scrolls for spells that he could already cast just fine from his own spellbook but doesn't have memorized at the moment.<br/>\n<br/>\nMy point here is that I know of several PWs that use those fixed UMD scroll check systems instead of the Bioware one (maybe most do). It is a change of consequence for divine casters with UMD, particularly those who take their rogue or assassin levels earlier in the build, when it is impossible to take enough of the skill to make scroll use reliable. In addition, PWs can (and sometimes do) change the UMD DC for scroll use, to make it more even. For example, I often play on World of Greyhawk and, in addition to fixing the issue for divine casters, WoG uses a DC = 5 + 3*(innate level) for UMD scroll use. Because of that, even lower level UMD toons have a chance to use lower level spells reliably. Many also modify the free ride that arcane casters get with UMD.<br/>\n<br/>\nAnyway, it can be important to know what UMD scroll casting system a module is using when a build is taking UMD. It would be a shame to plan a build that takes UMD early only to find that taking it then will effectively make scroll use a risky proposition until the toon has a chance to \"top off\" UMD somewhere in the mid-epics. And, it would be advantageous to know that, for instance, a module uses a DC = 5 + 3*IL for scroll use and that a toon might be able to count on using Improved Invisibility scrolls from the mid-teens or so instead of the mid-epics.<br/>\n<br/>\n<strong>TL;DR (Summary)</strong><br/>\n1) A modified UMD score of 33 is enough to cast all class-restricted spell scrolls using the normal scroll check.<br/>\n2) A UMD user (even just one rank) with bard, sorcerer, wizard levels can cast from class-restricted scrolls without a UMD check.<br/>\n3) An oddity in the standard Bioware UMD check means that the module you are playing may use a custom system and it's worth knowing whether it does and how that system works.</div>"
    }
  ]
}