{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "008",
  "name": "The Prophet series",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/the-prophet-series-t2356185.html",
  "author": "Vinleboiteux",
  "avatar": "10759636_1701929568.jpeg",
  "replies": "30",
  "views": "1.1K",
  "posts": [
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "7:36 AM - Dec 07, 2023",
      "content": "<div>Hey everyone !<br/>\n<br/>\nI’m not sure where exactly this thread will be heading. But I couldn’t find anything posted for this series of modules. I have not played them till the end yet and I’m creating this thread to discuss various aspect of the module totally for my own benefit. But maybe other people will find the information usefull. I would like to specify that I am pretty noob and i suffer from severe Builditis. I am always trying different builds in different modules. <br/>\n<br/>\nWhen I was searching for good modules to try out this series kept coming up as one of the best stories. Some people comparing it to Planescape Torment.<br/>\n<br/>\nThe modules start with a prologue here :<br/>\n<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/prophet-prologue-it-cannot-be-denied\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... -be-denied</a><br/>\n<br/>\nThere is a text file with detailed information about the world and a walkthrough.<br/>\n<br/>\nSo without spoiling anything major. I wanted to talk about builds for this module. Hopefully a couple of you have played them.<br/>\n<br/>\nSo initally i started a playthrough with Valerfor’s  shadowknight build (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/the-shadow-knight-fighter-6-rogue-4-blackguard-10-t2351793.html\" rel=\"noreferrer\" target=\"_blank\">the-shadow-knight-fighter-6-rogue-4-bla ... 51793.html</a>). Only changing the weapon feats. Then I somehow managed to missclick Hide points or something and I couldnt take BG at the right level and that turned me off from continuing that game. <br/>\n<br/>\nNow I am thinking of going in with something along the lines of this dual purpose warrior from mick again (<a class=\"postlink\" href=\"https://www.tapatalk.com/groups/nwnecbguild/dual-purpose-warrior-fighter-8-bard-3-aa-9-t2349714.html?sid=c49654346e848b4dc4cb09a171eb2f08\" rel=\"noreferrer\" target=\"_blank\">dual-purpose-warrior-fighter-8-bard-3-a ... a171eb2f08</a>). <br/>\n<br/>\nWould anyone have any type of builds to suggest for this module ? It seems to have alot of focus on ranger type gear but I allready got two ranger builds going in other modules.<br/>\n<br/>\nI finished ch1 on my bg playthrough. And I did not see any good warhammers. Was wondering if anyone remembers that type of 1h weapons they saw. I would probly go longsword but I’m not sure anymore if i even saw any.<br/>\n<br/>\nFinally, pretty early we come up an enemy that is not plot essential and marked as impossible to kill. I tried several times to no avail. Is there a way to kill it that I havent figured out ? ( dont tell me how if the answer is yes).<br/>\n<br/>\nDont know if this is an appropriate module thread but let me know if it is not :)<br/>\n<br/>\nThanks for your input !</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:35 AM - Dec 07, 2023",
      "content": "<div>I have not played the Prophet series, so I have nothing to contribute with there.<br/>\nI just want to add that the Shadow Knight is not mine, it is one of Valerfor's builds.<br/>\nIf you decide to use the Dual Purpose Warrior build, please let me know how it fares, either here or in a PM.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:31 PM - Dec 07, 2023",
      "content": "<div>Always good to see a new addition to our module coverage!<br/>\n<br/>\nReading through the stuff on the Vault, it looks like your PC should be finishing the final module (part 3) somewhere between level 14 and 17, so we might want to start thinking of some suitable builds (the blurb suggests that while any characters can be played, Good or Neutral ones are preferred). Who knows, we might even add a few new builds into our \"Free Level\" forum!<br/>\n<br/>\nThanks, <em class=\"mention\">@Vinleboiteux</em> !<br/>\n<br/>\nEDIT: Reading a little more about the series (a prologue and 3 parts), it looks as if you can import your PC from the end of Honor Among Thieves (HAT - and I know Mick's played that!) into Prophet, as it's set in the same world and also made by Baldercan, and we know his stuff's good (iirc, he was involved in Rogue Knight's Swordflight series), or even go Cave of Songs, HAT, Prophet with the same PC.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "3:51 PM - Dec 07, 2023",
      "content": "<div>Oh my bad about the shadowknight build. Fixed it. <br/>\n<br/>\nYes thats what I read about cave of songs and honor amongst thieves also. But both those modules favor stealthy roguy builds that im not sure I wanna play right now :)<br/>\n<br/>\nThe end level of 12-15 is why I was looking at the level 20 builds thinking that alot of them must try to get the most out of their first 13 levels. I’m also too much of a noob to make my own build. For just 13 levels I would probably just go pure something.<br/>\n<br/>\nPretty inclined to try out the dual purpose warrior. Sounds like not alot of people have actually played the modules so I will keep you posted :)</div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "1:38 AM - Dec 09, 2023",
      "content": "<div>Just finished the prologue. Went with the Dual Purpose Warrior with longsword instead of warhammer just cuz its more elfy in my head.<br/>\n<br/>\nWe start at level 5. Am now level 6. I do feel my sword game is much stronger than my bow game. Especially on hardcore with AOO when using ranged weapons. This will probably balance out once I get AA levels. Maybe I will allready see a difference with level 6 and WS longbow and Point blank shot. Apart from that I am enjoying running around in heavy armor and switching between both weapons. Its pretty smooth and feels flexible enough.<br/>\n<br/>\nThe module has some really cool dream sequences with funky visuals ( a giant floating mouth for one..). The areas feel full of life and textured. I think they are quite well done but I havent really played alot of modules yet to compare. There is an eerie immersive feeling to the whole module enhanced by the music and audio. The dialogues are quite good and unique. I actually read most of it fully and not skim through them. Trying not to spoil anything. Will be updating more as i go :)</div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "4:57 PM - Dec 11, 2023",
      "content": "<div>Hey everyone,<br/>\n<br/>\nSo I am now level 8 with my first AA level. My archery game really picked up. Switching to sword and board when i get meleed, when I wanna knockdown someone or when creatures are resistant to pierce dmg. Enjoying the build. Not having any issues yet on D&amp;d Hardcore.<br/>\n<br/>\nI really like the story in this module. It feels different. Im going to go into a but more details but it will be slightly spoilery.<br/>\n<details><summary>Spoiler</summary>Basically you are presented with two paths. I finished both. Heading towards the next destination. Had to wade through a very frustrating Marsh. I do not know if this was intentional but navigating in the marsh is horrible. Some water areas you can walk through, orhers you can’t. They don’t appear differently on your map. So it was really slow and annoying. Kind of like a real marsh I guess. Had one really cool encounter where I got cursed and to lift the curse I had to eat a guy’s heart to travel into to slay his rage demons and eventually chop down a tree…. Funky stuff\n</details></div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "2:15 AM - Dec 12, 2023",
      "content": "<div>So looks like no one active on these forums  played these but I will ask anyways just in case...<br/>\n<br/>\nIts not too much of a spoiler to say that early on you go to a place where you kill lots of spiders. In that place there is an optional boss thats impossible to kill. I have tried several times. In different ways. Am i missing something ? Or is it one of those things I have to accept and move on ? :)</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:23 AM - Dec 12, 2023",
      "content": "<div>What's the problem? Is it DR, phenomenal AC, +x weapon enhancement required to hit, something else? What ways have you tried? Even if we don't know the specific module, we can usually find a way to kill something! Can't remember who said it, but iirc the quote is \"There is nothing in this world that can't be killed\".</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "3:51 AM - Dec 12, 2023",
      "content": "<div>I think the quote is \"If it bleeds, we can kill it\" - <br/>\n<span data-s9e-mediaembed=\"youtube\" style=\"display:inline-block;width:100%;max-width:640px\"><span style=\"display:block;overflow:hidden;position:relative;padding-bottom:56.25%\"><iframe allowfullscreen=\"\" scrolling=\"no\" src=\"https://www.youtube.com/embed/u0-q15Di9uE\" style=\"background:url(https://i.ytimg.com/vi/u0-q15Di9uE/hqdefault.jpg) 50% 50% / cover;border:0;height:100%;left:0;position:absolute;width:100%\"></iframe></span></span></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:44 AM - Dec 12, 2023",
      "content": "<div>Funny, if you play BG and have Shar Teel in your party, when you select her, she sometimes says: If it bleeds, I can kill it!</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:55 AM - Dec 12, 2023",
      "content": "<div>When you build a module, you have the option to tag creatures as invulnerable or immortal. If immortal, you can wear them down to a single hitpoint, but not further.<br/>\nBut any normal creature can be killed, you just have to find a way to do it.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "8:25 AM - Dec 12, 2023",
      "content": "<div>Actually, I can open the module in the Toolset, remove that check for immortal, compile, save, and then whack it apart...<br/>\n<br/>\nSo anything is, indeed, killable.<br/>\n<br/>\nThe real question is, if it is marked as immortal, why?  There should be a very good reason for this.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:15 AM - Dec 12, 2023",
      "content": "<div>They have something like this in Aielund when you first encounter the Iron Lord in Trinity. I spent bloody ages trying to kill him then, thinking I'd somehow screwed something up, but it's impossible to slay him until the conclusion of the Battle of Highmarch. So maybe this dude will be encountered again later?<br/>\n<br/>\nEDIT: I may have the answer from the walkthrough - up to you whether you read it!\n<details><summary>Spoiler</summary>If we're talking about Sylaldur, he can't be killed unless you've destroyed all the \"glowing spheres\" first (whatever they might be)\n</details></div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "2:31 AM - Dec 13, 2023",
      "content": "<div>Hey,<br/>\n<br/>\nNo it wasn’t that dude. Figured that one out after he respawned like 5 times. I eventually did look at the walkthrough and the boss does not appear in there. The author does mention that you should bit be able to kill everything everytime so maybe that just it.<br/>\n<details><summary>Spoiler</summary>The boss is a hive mother that basically two shots everyone. I tried with all the buffs and potions I could get my hands on. Figured maybe there was an item to help out. Tried a couple nothing worked. You find a bunch of eggs in the lair and it says the mother would be really angry if she finds you with them. Maybe it has to do with that but I don’t know how. Maybe hive mothers are common enemies in some modules and you all know the correct strat and i am just noob too :)\n</details></div>"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "2:46 AM - Dec 13, 2023",
      "content": "<div>Well, I don't know what the stats of that Hive Mother are in that Module, but here is how they normally look :<br/>\n<br/>\n<strong>Race:</strong> vermin<br/>\n<strong>Alignment:</strong> true neutral<br/>\n<strong>Armor class:</strong> 16 <br/>\n<strong>Hit points:</strong> 262<br/>\n<strong>Attack bonus:</strong> +14/+9<br/>\n<strong>Damage:</strong> 4d6+6 slashing damage (creature weapon)<br/>\n<br/>\nThe attacks do alot of damage when they hit.</div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "3:30 AM - Dec 13, 2023",
      "content": "<div>Maybe I just need some levels and gear. I will try to come back and kill it.</div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "11:51 PM - Dec 14, 2023",
      "content": "<div>So I’m lazy and I will just spoiler tag everything. It should be very light spoilage for anyone who cares.<br/>\n<details><summary>Spoiler</summary> I’m level 8 very close to 9. Met an elf in a city in the trees. Was well done. Now I’m climbing a mountain. If I get too close to the edge I can fall off and lose my weapon ! Also had to take shelter in a cave at some point because there was a storm outside and I could not advance further without being blown off the ledge. Nice design elements. Rumors of a dragon so I loaded up on a bunch of resist items of different kinds. We will see how it goes. </details></div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "4:36 PM - Dec 15, 2023",
      "content": "<div>Just had this cool armor made. But it has an integratde cloak. Which looks great. Except when I actually put on a cloak then they both look dumb. There doesn’t seem to be a way to disable cloaks though :(<br/>\n<br/>\nAlso had a shield made. And its just plain grey. Disappointed. Its pretty good though.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:38 PM - Dec 15, 2023",
      "content": "<div>If you want to remove the cloak that is part of the armour, then change the neck of the armour. There is an option to change every part of your gear on the radial menu under crafting.<br/>\nIf you want to make your cloak invisible, that is an option when you want to change how the cloak looks.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:18 PM - Dec 15, 2023",
      "content": "<div>I, for one, have also suffered from \"crappy cloak syndrome\" (as well as hat), so that's all handy info - and yes, I know you can change things with assorted clever modification add-ons.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "webshaman1",
      "avatar": "10759110_1577099721.jpg",
      "timestamp": "9:30 PM - Dec 15, 2023",
      "content": "<div>How does someone crap in their cloak?<br/>\n<br/>\nScratch that, I don't want to know.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:40 PM - Dec 15, 2023",
      "content": "<div>It's a little-known skill known as Poo-Cape. Strangely, cloaks tend to look a bit brown after its application...<br/>\n<br/>\nAnd smell.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "5:12 AM - Dec 16, 2023",
      "content": "<div>Ok so I found how to modify the armor to make the cloak part disappear like you said Mick. I havent found how to make the actual cloak invisible ?</div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "5:16 AM - Dec 16, 2023",
      "content": "<div>Oh and you actually need crafting skills. Lol.</div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:35 AM - Dec 16, 2023",
      "content": "<div>With EE you should be able to do it without crafting skills, unless it is overwritten in the mod.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "5:29 AM - Dec 17, 2023",
      "content": "<div>Had a DC check of 13 and i got 12. So not sure.</div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "10:47 AM - Dec 18, 2023",
      "content": "<div>Mick mentionned that making my cloak invis is an option when I wanna modifiy jts appearance. But how do I modifiy its appearance in the first place ? <br/>\n<br/>\nPretty sure I need crafting skill points to modify the armor neck. Tried a couple times and just lose the gold and never make it higher than the DC. Maybe because its an old module. Before EE I think.</div>"
    },
    {
      "author": "conlaoch",
      "avatar": "10235240_1510287070.jpg",
      "timestamp": "5:09 PM - Dec 18, 2023",
      "content": "<div><blockquote><div><cite>Stagmeister wrote: <div class=\"responsive-hide\">Dec 15, 2023</div></cite>I, for one, have also suffered from \"crappy cloak syndrome\" (as well as hat), so that's all handy info - and yes, I know you can change things with assorted clever modification add-ons.</div></blockquote>\nI usually suffer from CRS   \"Can't Remember Shi*\"</div>"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "5:18 PM - Dec 20, 2023",
      "content": "<div>Ok the story so far with alot of spoilers be warned. Also I’m still running around with the stupid double cloak.<br/>\n<br/>\nStarted chapter 2 around level 10. Can’t remember if I got it at the end of ch1 or beginning of ch2. For anyone looking into the module here are armor and weapons that I can remember so far:<br/>\n<details><summary>Spoiler</summary>\nArmor:\nSome caster robes. At least 1 caster heavy armor.\n\nSome cool longbows. About the only nice ranged weapons so far.\nLots of shortswords ! The blacksmith also crafts shortswords out of the dragon teeth. And both your companions in ch1 have good short swords.\nNo two handers at all except one great flail only useable by half orc and orc.\nThats about it.\n</details>\n\nThe build is working out well. Haven’t really had an impossible fight since the one I mentionned a bit earlier in the thread.<br/>\n<br/>\nI love the module. Kind of guessed the plot twist of ch1 but I don’t think it was supposed to be that hard to guess. But the story is very interesting so far. Ch2 brings you to a desert type setting. Which reminds me of SoU. Which is a bit annoying but thats just me.<br/>\n<br/>\n Cool stuff that happened (MAJOR SPOILERS :\n<details><summary>Spoiler</summary> \nHenchmen are freaking out over your role.\nMonkeys.</details>\n\nSo I’m not sure what other modules are like but these elements really make me like this one :) Apart from the double cloak thing which sucks.</div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "11:46 PM - Dec 20, 2023",
      "content": "<div>Glad you're enjoying it!<br/>\n<br/>\nThere are loads of other modules for you to try out after you've finished this one. Two of the favourites are Aielund and Swordflight, both of which are huge in scope and potential, but there are many other highly commended ones as well.</div>",
      "author-color": "#AA0000"
    },
    {
      "author": "Vinleboiteux",
      "avatar": "10759636_1701929568.jpeg",
      "timestamp": "12:10 AM - Dec 21, 2023",
      "content": "<div>Yes !<br/>\n<br/>\nI currently have 2 different builds going in SoU<br/>\n1 in the OC<br/>\nAnd 2 in aielund.<br/>\n<br/>\nI have Builditis.</div>"
    }
  ]
}