{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "022",
  "name": "Shadowlords, Dreamcatcher & Demon - Adam Miller's Campaign",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/shadowlords-dreamcatcher-demon-adam-miller-s-campa-t2354563.html",
  "author": "Noctem",
  "avatar": "10404082_1510287071.jpg",
  "replies": 69,
  "posts": [
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:53 PM - Jul 24, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hi All,<br/>\n<br/>\n Unlike most, if not all, threads in this section, I'm not here to recommend the campaign - yet, anyway. I have but recently downloaded these modules, and have some questions. Hopefully, others in the Guild will be able to help furnish answers. That way, if the campaign's any good, those of us uninitiated in SDD (acceptable shorthand?) will be able to travel together through it with a mentor or two in tow - not in a walkthrough kind of way, but more one of issues, cries for help, etc.<br/>\n<br/>\n Discussions around the campaign started <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/reply/20853149/Intelligent-HalfOrc-Possibilities#reply-20853149\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#0000FF\"><strong>here.</strong></span></a><br/>\n<br/>\n Do please ignore the first blatherings thereon, they have naught to do with this. I start annoying people with questions about this campaign at about contribution #10. My current outstanding question (not a quality judgement) being whether SDD is Dev Crit enabled or not? I'll be assuming normal (OC) NwN1 rules, classes, etc apply in un-nerfed fashion unless told otherwise. I just don't really want to spend time building something that I'll have to change once I've hit epic levels and realise some of the feats I've chosen are redundant (yes, Great Cleave, I'm looking at you).<br/>\n<br/>\n In any event, I hope the Empyres, Valerfors and such luminaries (I discounted Hip, as a mostly PW or PnP player, though any input from him would, of course, be welcome) will occasionally cast their eyes this way. Or, it could all go to the Abyss... <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n<strong><span style=\"color:#0000FF\">edit</span></strong>: per Hip, furnished jump-over link to Neverwinter Vault project and onwards; 20160724<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:48 PM - Jul 24, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This campaign ends at about the same level as the OC, so Dev Crit is not possible. I just looked to confirm that I remember correctly, and my last saved game in my only play-through so far in Demon is at level 16. I don't remember anything being nerfed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:46 PM - Jul 24, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Empyre - that's both helpful and annoying. Helpful because it fully answers my question. Annoying because for some reason I'd got it in my head that the full campaign took you into the 30s. That said, presumably on completion one's build can then be carried across elsewhere. But if that doesn't float your boat, one need only design a character to max-out between levels 16 and 18, which actually might be very useful for fledgling builders - particularly given the campaign's reputed low-med magic environment, so it ain't all about the gear.<br/>\n<br/>\n Also thanks to Hip for tidying up my first post - much purtier, and appreciated!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "4:06 PM - Jul 25, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I think I've settled on my first toon to blaze a trail in this unexplored territory. I reckon my building skills still need some work, so I'll go with something tried and tested first, just to get a feel for the place. And lo, there was Mick Dagger's Brawler Champion snoozing in the Level 20 section of the Guild! As one given more to the un-arcane arts, a Fighter 8/Monk 2/CoT 10 build looks ideal: good saves, decent AC and AB, lovely. Thanks Mick! Just going to fire it up now. This does mean I'll be playing two different Aielund campaigns and this one simultaneously, but variety's the spice of life, right? <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n I should have got the hang of making my links succinct and elegant by now, but I haven't, so this is it: <a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2350552/Brawler-champion-Fighter-8-Monk-2-CoT10#.V5YUixJnEqg\" rel=\"noreferrer\" target=\"_blank\">http://nwnecbguild.forumer.com/topic/23 ... 5YUixJnEqg</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:33 PM - Jul 25, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Okay, have got my first quest (hard to avoid it, really) and my first question. Henchmen/companions: worthwhile? And if so, how many can/should you take, and what's the AI like? I'm not asking <em>who</em> to take with me, 'cause I guess that's a judgement call, depending on one's own build, play-style and alignment. I've already got Nooble, but may have to drop him - he too is a meleer, and has a ridiculous name to boot - depending on any answers to the questions above, because I've just met a Rogue (albeit a crap one - she got caught and wants me to pay her fine) and they're always handy to have around. As a predominantly melee player, I'm always on the lookout for someone who can either stop me from exploding or kiss it better when I do!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:09 AM - Jul 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I have played this campaign and Saleron's Gambit only once each, and I'm afraid my memories of the two are getting intermingled. I do remember that Demon assumes that the PC and the hench of the opposite sex have become a couple, but I seem to recall a female Cleric, not a Rogue. Maybe you meet her in a later chapter? I think you are allowed only one hench. I'm sorry that my memory of this is so hazy.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "1:42 AM - Jul 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sorry for being late to the party...<br/>\n<br/>\n a) There are both there, both are female, one is a rogue the other is a \"celestial being\" but a cleric non-the-less. Both are romantic options for a player character. Both will bestow some small \"gifts\" to your character and they also have some small power-ups intertwined to the story for them. And if you dont have Tony's AI both of them are going to suck big time but at least if i remember correctly default Linu's is better than default Tommu's but whatever, It is ultimately an RP choice. And there is always Noober ;)<br/>\n<br/>\n b) There are only two campaigns that will take you to the high thirtie's lvl. Sands of Fate and Aielund. Unless you want to enter a random dungeon generator module (i don't remember the name but Mick was used to play one if i recall correctly). And there was an arena-type module (very old) that pitted the HoF builds Vs your PC. All the other choices will bring you up to high twentie's - thirty lvl maximum. That is why in old times there was a thread that specified a path that your hero could take with the same character and take them to high lvls, but still not forty. It was named \"The Heroe's Path\" you can google it and find out more about it. It basically linked similar modules for your character to take that made sense.<br/>\n<br/>\n c) These small campaigns that finish before twenty lvl or slightly above it, and are of low to medium magic, are perfect opportunities for you to play somethiing that isn't a straight melee build. Try playing a wizard or bard in those module paths is also a very good choice because the power  lvl of your magic will be stronger, far stronger than the items sold in there. Most people who played Saleron's Gambit for example said (comments from the old nwnVault) that playing a wizard/ bard there, was a superb experience compared to a fighter. I guess Adam Miller's campaign will be similar in that regard.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:40 AM - Jul 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, both - and grand to see Valerfor peering over the fence (\"Are you going to throw rocks at me now?\" - Noober)<br/>\n<br/>\n A few things...bugger me for a pound of marmalade, but the first time I've taken a female PC into a new campaign is the exact one where I'm presented with only female romance options. Brilliant. Secondly, given the likelihood of only one companion, it'll either be the rogue or the healer, given my proclivities. And yes, I know I really should practice taking some arcane classes, but not on my first run-through, eh? Sometimes I think you're just trying to improve me, and that would never do <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />. I haven't met the \"celestial being\" yet (Valerfor, are you sure you're not thinking of Nellise in Aielund?), I've only just appeared on the streets of Scornubel. Poor old Nooble, shortest henchman career ever (ie, simply walking out of the door).<br/>\n<br/>\n \"What about now?\"<br/>\n \"What about now?\"<br/>\n \"What about now?\"...ad infinitum<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:37 AM - Jul 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">He still has his personal website up, so here is a handy link for ya. The first three are the possible companions of course. You haven't found Anera yet because she is available once you are outside town if i remember correctly. If you haven't gone far, you could always re-start with a male PC.<br/>\n<br/>\n<a class=\"postlink\" href=\"http://www.adamandjamie.com/nwn/Characters.asp\" rel=\"noreferrer\" target=\"_blank\">http://www.adamandjamie.com/nwn/Characters.asp</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:55 AM - Jul 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Cheers for that, Valerfor! Re-work with a bloke it is. I look forward to meeting Anera - Tiera just looks a bit...Renaissance. Is that just me being shallow? Yep. But I'll keep her with me until I leave the city. Of course, if you don't remember correctly, ain't no big thing - old age and infirmity happens to us all eventually <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:27 AM - Jul 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">\"<em>Tiera just looks a bit...Renaissance.</em>\"<br/>\n<br/>\n Funny you mention this, these words were what i actually thought when i first met her as well, ha! She is still preferable to the ice-block Anera is though. Well, some like it \"on the rocks\" however ;)<br/>\n<br/>\n \"<em>old age and infirmity happens to us all eventually</em>\"<br/>\n<br/>\n Haha...It happens when we play a game for more than a dozen years huh?<br/>\n<br/>\n Good luck in your adventures and as always, keep us informed!<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "9:04 AM - Jul 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If your PC is female, Nooble is your love interest. My female PC had developed quite a friendship with Anera, but then when Demon started, I was suddenly switched to Nooble as if he had always been my hench.<br/>\n<br/>\n A melee Cleric would do well in the Adam Miller campaign. In fact I have already played one in Saleron's Gambit, and I have one planned for Adam miller's campaign, too. You buff up before a fight and then fight as if you were a regular melee type. Just make sure not to wait until the fight has already begun before you buff, and if you have buffs to spare, buff your hench too.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:04 PM - Jul 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>\n A melee Cleric would do well in the Adam Miller campaign. You buff up before a fight and then fight as if you were a regular melee type. Just make sure not to wait until the fight has already begun before you buff, and if you have buffs to spare, buff your hench too.<br/>\n  </div></blockquote>\n<div align=\"left\">From all I've read, Battle Clerics are pretty awesome anywhere, and I will try one out soon, just not in my first run-through. Apart from anything else, you need to know roughly <em>when</em> a fight's coming (although \"pretty much always\" might be a reasonable response to that), and to that end the Brawler Champion is my sacrificial lamb.<br/>\n<br/>\n Cheers</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:55 PM - Jul 26, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/><div align=\"left\">From all I've read, Battle Clerics are pretty awesome anywhere, and I will try one out soon, just not in my first run-through.</div>\n</div></blockquote>\n<div align=\"left\">Don't be a weeny, Stagmeister.  Play your first serious self-buffer.  Not only will you broaden your experience before the fated aneurysm occurs, but you will learn first-hand what you will face with your head-basher vs. a fully-fledged priest. Go for the gusto, dammit! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n The best experience (IMHO) is playing new content in total darkness.  Pure adventure. That's what the designer intended with all his hard labor, to test your competence and ingenuity.  Tips are vastly over-rated for the true AD&amp;D fan.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:27 AM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n<blockquote><div><strong>Stagmeister wrote:</strong><hr/><div align=\"left\">From all I've read, Battle Clerics are pretty awesome anywhere, and I will try one out soon, just not in my first run-through.</div>\n</div></blockquote>\n<div align=\"left\">Don't be a weeny, Stagmeister.  Play your first serious self-buffer.  Not only will you broaden your experience before the fated aneurysm occurs, but you will learn first-hand what you will face with your head-basher vs. a fully-fledged priest. Go for the gusto, dammit! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /></div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "1:03 AM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>\n Fair enough, Hip. Here's the deal, then. I do this campaign with a battle cleric, you do Aielund <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /> Never know what sort of gear will be around and clerics can make a silk purse out of sow's ear better than anyone.  Let's see how long it takes for me to get stuck on some blasted puzzle.  Where's that bottle of Johnnie Black been keepin' itself? *rummages through the file drawer*</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:01 AM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/><div align=\"left\">Divine bookends.  Fine.  Guess I shouldn't admit that I always play a cleric when trying out new content.  Where's that bottle of Johnnie Black been keepin' itself? *rummages through the file drawer*</div>\n</div></blockquote>\n<div align=\"left\">Hip, you are top banana <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />! I can't promise Johnnie Black, but I've a smooth Macallan Gold scotch itching for a sipping...Cigar - or should we wait for completion?<br/>\n<br/>\n While I'm sure you'll be creating your own build, I'm relying on my faith in the Guild: and lo, there was the Sainted Michael of Stabby Things (again), who seems to have pulled another one out of the hat. It's his Priest of Shadows, and can be found here. Gods, I hope this works now I've had the tutorial...<br/>\n<br/>\n Cobblers, it didn't. The Ctrl-p merely gave me printer options. Sorry. Will try again next time</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "10:42 AM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Here's the build I have planned for this campaign later. It's pretty simple, but it should be very effective.<br/>\nSpoiler [+]<br/>\n<br/>\n Level 20 Melee Cleric 3 (Cleric 17 / Fighter 3)<br/>\n Human, Any Alignment<br/>\n Playable 1 - 20<br/>\n<br/>\n Abilities:<br/>\n STR: 16 (18)<br/>\n DEX: 8<br/>\n CON: 12<br/>\n WIS: 16 (19)<br/>\n INT: 14<br/>\n CHA: 8<br/>\n<br/>\n Leveling Guide:<br/>\n Human: (Quick to Master)<br/>\n 01: Cleric(1): Power Attack, Cleave, Domain Magic, Domain Trickery<br/>\n 02: Fighter(1): Weapon Focus: Longsword<br/>\n 03: Cleric(2): Extend Spell<br/>\n 04: Cleric(3): STR+1, (STR=17)<br/>\n 05: Cleric(4)<br/>\n 06: Cleric(5): Blind Fight<br/>\n 07: Cleric(6)<br/>\n 08: Cleric(7): STR+1, (STR=18)<br/>\n 09: Cleric(8): Knockdown<br/>\n 10: Cleric(9)<br/>\n 11: Cleric(10)<br/>\n 12: Cleric(11): WIS+1, Toughness, (WIS=17)<br/>\n 13: Fighter(2): Improved Critical: Longsword<br/>\n 14: Cleric(12)<br/>\n 15: Cleric(13): Empower Spell<br/>\n 16: Cleric(14): WIS+1, (WIS=18)<br/>\n 17: Cleric(15)<br/>\n 18: Cleric(16): Improved Knockdown<br/>\n 19: Fighter(3)<br/>\n 20: Cleric(17): WIS+1, (WIS=19)<br/>\n<br/>\n Stats:<br/>\n Hitpoints: 206<br/>\n Skillpoints: 115<br/>\n Saving Throws (Fortitude/Will/Reflex): 14/15/5<br/>\n Saving Throw bonuses: Spells: +5<br/>\n BAB: 15<br/>\n AB (max, naked): 20 (melee), 14 (ranged)<br/>\n AC (naked/mundane armor/shield only): 11/22<br/>\n Spell Casting: Cleric(9)<br/>\n Alignment Changes: 0<br/>\n<br/>\n Skills:<br/>\n Concentration 23(24), Discipline 22(26), Heal 23(27), Lore 4(6), Spellcraft 23(25), Tumble 10(9)<br/>\n<br/>\n 01: Concentration(4), Heal(4), Lore(4), Spellcraft(3), Tumble(1), Save(3)<br/>\n 02: Concentration(1), Discipline(5), Heal(1), Save(1)<br/>\n 03: Concentration(1), Heal(1), Tumble(2)<br/>\n 04: Concentration(1), Heal(1), Spellcraft(3)<br/>\n 05: Concentration(1), Heal(1), Spellcraft(2), Save(1)<br/>\n 06: Concentration(1), Heal(1), Spellcraft(1), Tumble(1), Save(1)<br/>\n 07: Concentration(1), Heal(1), Spellcraft(1), Tumble(1), Save(1)<br/>\n 08: Concentration(1), Heal(1), Spellcraft(1), Save(3)<br/>\n 09: Concentration(1), Heal(1), Spellcraft(1), Tumble(1), Save(3)<br/>\n 10: Concentration(1), Heal(1), Spellcraft(1), Save(5)<br/>\n 11: Concentration(1), Heal(1), Spellcraft(1), Tumble(1), Save(5)<br/>\n 12: Concentration(1), Heal(1), Save(8)<br/>\n 13: Concentration(1), Discipline(11), Heal(1)<br/>\n 14: Concentration(1), Heal(1), Spellcraft(1), Tumble(1)<br/>\n 15: Concentration(1), Heal(1), Spellcraft(3)<br/>\n 16: Concentration(1), Heal(1), Spellcraft(1), Tumble(1)<br/>\n 17: Concentration(1), Heal(1), Spellcraft(1), Tumble(1)<br/>\n 18: Concentration(1), Heal(1), Save(3)<br/>\n 19: Concentration(1), Discipline(6), Heal(1)<br/>\n 20: Concentration(1), Heal(1), Spellcraft(3)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:52 PM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ooh, I like that one, Empyre - I'll borrow him/her, with your blessing. It was going to be enough of a challenge as it was, but Mick's build (Cleric 17/ Monk 1/ Shadowdancer 2) was a DEXer as well (I know, shouldn't make any difference with buffs). Simple suits me just fine!<br/>\n<br/>\n Right, I'm off to re-read the Guide to Clerics - and take notes.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:30 PM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>Here's the build I have planned for this campaign later. It's pretty simple, but it should be very effective.<br/>\nSpoiler [+]<br/>\n<br/>\n Level 20 Melee Cleric 3 (Cleric 17 / Fighter 3)<br/>\n Human, Any Alignment<br/>\n Playable 1 - 20<br/>\n<br/>\n Abilities:<br/>\n STR: 16 (18)<br/>\n DEX: 8<br/>\n CON: 12<br/>\n WIS: 16 (19)<br/>\n INT: 14<br/>\n CHA: 8<br/>\n<br/>\n Leveling Guide:<br/>\n Human: (Quick to Master)<br/>\n 01: Cleric(1): Power Attack, Cleave, Domain Magic, Domain Trickery<br/>\n 02: Fighter(1): Weapon Focus: Longsword<br/>\n 03: Cleric(2): Extend Spell<br/>\n 04: Cleric(3): STR+1, (STR=17)<br/>\n 05: Cleric(4)<br/>\n 06: Cleric(5): Blind Fight<br/>\n 07: Cleric(6)<br/>\n 08: Cleric(7): STR+1, (STR=18)<br/>\n 09: Cleric(8): Knockdown<br/>\n 10: Cleric(9)<br/>\n 11: Cleric(10)<br/>\n 12: Cleric(11): WIS+1, Toughness, (WIS=17)<br/>\n 13: Fighter(2): Improved Critical: Longsword<br/>\n 14: Cleric(12)<br/>\n 15: Cleric(13): Empower Spell<br/>\n 16: Cleric(14): WIS+1, (WIS=18)<br/>\n 17: Cleric(15)<br/>\n 18: Cleric(16): Improved Knockdown<br/>\n 19: Fighter(3)<br/>\n 20: Cleric(17): WIS+1, (WIS=19)<br/>\n<br/>\n Stats:<br/>\n Hitpoints: 206<br/>\n Skillpoints: 115<br/>\n Saving Throws (Fortitude/Will/Reflex): 14/15/5<br/>\n Saving Throw bonuses: Spells: +5<br/>\n BAB: 15<br/>\n AB (max, naked): 20 (melee), 14 (ranged)<br/>\n AC (naked/mundane armor/shield only): 11/22<br/>\n Spell Casting: Cleric(9)<br/>\n Alignment Changes: 0<br/>\n<br/>\n Skills:<br/>\n Concentration 23(24), Discipline 22(26), Heal 23(27), Lore 4(6), Spellcraft 23(25), Tumble 10(9)<br/>\n<br/>\n 01: Concentration(4), Heal(4), Lore(4), Spellcraft(3), Tumble(1), Save(3)<br/>\n 02: Concentration(1), Discipline(5), Heal(1), Save(1)<br/>\n 03: Concentration(1), Heal(1), Tumble(2)<br/>\n 04: Concentration(1), Heal(1), Spellcraft(3)<br/>\n 05: Concentration(1), Heal(1), Spellcraft(2), Save(1)<br/>\n 06: Concentration(1), Heal(1), Spellcraft(1), Tumble(1), Save(1)<br/>\n 07: Concentration(1), Heal(1), Spellcraft(1), Tumble(1), Save(1)<br/>\n 08: Concentration(1), Heal(1), Spellcraft(1), Save(3)<br/>\n 09: Concentration(1), Heal(1), Spellcraft(1), Tumble(1), Save(3)<br/>\n 10: Concentration(1), Heal(1), Spellcraft(1), Save(5)<br/>\n 11: Concentration(1), Heal(1), Spellcraft(1), Tumble(1), Save(5)<br/>\n 12: Concentration(1), Heal(1), Save(8)<br/>\n 13: Concentration(1), Discipline(11), Heal(1)<br/>\n 14: Concentration(1), Heal(1), Spellcraft(1), Tumble(1)<br/>\n 15: Concentration(1), Heal(1), Spellcraft(3)<br/>\n 16: Concentration(1), Heal(1), Spellcraft(1), Tumble(1)<br/>\n 17: Concentration(1), Heal(1), Spellcraft(1), Tumble(1)<br/>\n 18: Concentration(1), Heal(1), Save(3)<br/>\n 19: Concentration(1), Discipline(6), Heal(1)<br/>\n 20: Concentration(1), Heal(1), Spellcraft(3)<br/>\n<br/>\n</div></blockquote>\n<div align=\"left\">I like the way you grabbed both Cleave and IKD in 20 levels with so few Ftr, Empyre. Very efficient and solid skill set.  DP exploitation.  A full Monty of spells.  What more could you want? <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n The only changes I would make would be a juggling of feats.  I like to have empowered abilities ready to go as soon as the slots open up at Clc 7,  yet not delay KD too long.  Lvl 6 Empower; Lvl 12 Blind Fight, Lvl 15 IKD... with those extra 18 HPs delayed until Lvl 18 if they really matter. I would have gone with Lightning Reflexes plus Empowered Cat's/AoV (Yah,  I recommend War swap for Magic) will bring those reflexes up to a more respectable level.  AoV is handy to have when allied.  You get nice party boosts without needing to buff them separately.  Battle Mastery will replace the lost DR spell from Magic.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "5:09 PM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Blimey.<br/>\n<br/>\n Have just finished Max's Guide, along with Avado's (and the ensuing clash of the titans), and I think I'm almost ready to rock 'n' roll - though I fear the scotch might have to wait a while: there's a LOT to take in! Must pay a visit to the Wiki first: try to get my head round this \"Domain\" malarkey.<br/>\n<br/>\n You lot really are rotten scoundrels, stirring me from my comfort zone: it's called \"comfort\" for a reason <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /> - I now want to try my hand with a full-blooded L40 Cleric/Monk/summat else somewhere! * Patience, Grasshopper, patience. The mountain is not crossed in a single day. *<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "5:15 PM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong>\n<hr/>\n ... the Sainted Michael of Stabby Things ...<br/>\n  </div></blockquote>\n<img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "7:13 PM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Ha! Cheers, Mick, glad you liked!<br/>\n<br/>\n Maintaining a light-hearted motif, during my research into all things Clerical I stumbled onto a young Hip build in his Fabulous Contrapulator (as I shall continue to refer to it) - the Abbot of the Seven Winds (revised version) from 2011. I liked it, even if Max had some issues. I know the Guild is always looking for optimization, but sometimes playability and enjoyability trump it, to my mind. So, big hurrah for ickle-Hip! I'd thought of trying it out on a full play-through (either Aielund or SoU/HotU/SoF), but I then saw the legendary Mith's Blood and Faith, and I can't let that one go without a proper try.<br/>\n<br/>\n Thus, I'll be playing this campaign with Empyre's aforementioned build (soz, Mick, despite the flirtatiousness <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "8:03 PM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>Maintaining a light-hearted motif, during my research into all things Clerical I stumbled onto a young Hip build in his Fabulous Contrapulator (as I shall continue to refer to it) - the Abbot of the Seven Winds (revised version) from 2011. I liked it, even if Max had some issues. I know the Guild is always looking for optimization, but sometimes playability and enjoyability trump it, to my mind. So, big hurrah for ickle-Hip!<br/>\n  </div></blockquote>\n<div align=\"left\">Actually, that could have been built better, though not for all of the reasons mentioned.  DP, except for the HP boost, becomes worthless in a STR build over BAB 15. That build, though played through well into epic on a medium magic server, was more theme-based than it was optimized for combat.  About the only early buffs that will help unarmed attacks are Div Favor and Empowered Bull STR and (with all due respect to Mr. Dagger), screw those blasted kamas! I mean, that was the main impetus of building a fister in the first place.  IMO, kamas should either be DW'd or ignored and there are plenty of dual kama battle priest builds out there to chose from, both damage adepts and DevCrit variants. Prayer and Battletide afford the same attack/dmg/save benefits regardless of caster level, with fists or kama.<br/>\n<br/>\n Unarmed monks can be tough to compete when glove enhancements are limited or because the fists just can't penetrate DR without GMW even though the bludgeoning has some perks vs. skels.  But the stun factor is VERY nice, prebuffed with Empowered Owl... as is the immunity to disarm.  This build was contrived mainly for those wanting to reap many of the monk goodies and sick of always building a predictable and typecast monk attack.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:24 PM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/><div align=\"left\">\n Actually, that could have been built better, though not for all of the reasons mentioned.  DP, except for the HP boost, becomes worthless in a STR build over BAB 15. That build, though played through well into epic on a medium magic server, was more theme-based than it was optimized for combat.  About the only early buffs that will help unarmed attacks are Div Favor and Empowered Bull STR and (with all due respect to Mr. Dagger), screw those blasted kamas! I mean, that was the main impetus of building a fister in the first place.  IMO, kamas should either be DW'd or ignored and there are plenty of dual kama battle priest builds out there to chose from, both damage adepts and DevCrit variants. Prayer and Battletide afford the same attack/dmg/save benefits regardless of caster level, with fists or kama.<br/>\n<br/>\n Unarmed monks can be tough to compete when glove enhancements are limited or because the fists just can't penetrate DR without GMW even though the bludgeoning has some perks vs. skels.  But the stun factor is VERY nice, prebuffed with Empowered Owl... as is the immunity to disarm.  This build was contrived mainly for those wanting to reap many of the monk goodies and sick of always building a predictable and typecast monk attack.</div>\n</div></blockquote>\n<div align=\"left\">Don't put yourself down, Hip - that's my thing <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />. My point was about enjoying the play, and I don't see why the Abbot wouldn't be fun, plus, I like the idea of an empowered owl. Sorry, you were being an earnest soul, and facetious is my forte.<br/>\n<br/>\n I do get the no/limited gloves issue (though I <em>really</em> don't like \"fister\" as a monicker). I suppose I was looking for a STR-based Monk/Cleric because, as you know, I lurve Monks and tend towards STR builds (so, yes, by and large kamas can blow it out my hairy white...).<br/>\n<br/>\n Also, I do seem to have problems with Max's builds, generally. Don't get me wrong, it's <em>my</em> issue, the builds themselves are stupendous, and I can see that and have a deep respect for them, but, oh, I really do have to work at playing them. I guess that everyone achieves some sort of synergy with varying builds and playing styles, and Max's just don't seem to gel with mine, where a lot of Empyre's and Valerfor's do (notwithstanding that, if I'm going for a DEXer, or want to try an Evil build, my first thought would be \"find Mick\"). Thus, in an alien environment, with an alien character, I didn't know where to look, so thought...Hip! And he brought a nice back-story to dinner with him, which was considerate.<br/>\n<br/>\n Regardless, Blood and Faith seems to have everything I could want in/from a Cleric build (Cleric 26/ Bard 4/ RDD 10). I know you're all aware of it, and it has it's place in the pantheon guaranteed, but I'm looking forward to playing it. I hope I don't let it down.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "11:51 PM - Jul 27, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What you need to grasp from examining Max's builds is that they are all about sheer power (hence the term \"power-build\").   He doesn't mind wading into the fray, as overwhelming as it might appear, and then depending on his intrinsic build characteristics to dominate any encounter to the best his design has to offer.  In other words, he doesn't mind dying occasionally if he is getting a buzz from the build's inherent strengths.  That's why you don't see him playing archers or sneakers (well, at least I never have) or building them.  Just too tactical and time-consuming for his style.  After all, there are many more builds for him to devise and play, eh?<br/>\n<br/>\n I, on the other hand, am all about strategy and controlling the environment.  I am a huge proponent of recon and will scout unfamiliar areas under invisibility or GS (or via possessed familiar, as applicable) until I am satisfied that as many variables as possible have been identified.  Death is never part of the equation for me and never accepted.  That comes from playing several permadeath PWs that I thoroughly enjoyed.  In SP, you can always reload but on-line play is a whole other ball of wax.  Additionally, if my toon serves as a support member, I take it personally if my actions (or inactions) contribute to any other members suffering a fate that could well have been avoided with some more prudent preparation.  But server play is like SP on steroids.  It moves VERY fast because your partymates are always displacing in directions unanticipated and generally in a hurry to reach the goal.  That's in some degree due to the limited amount of time players can arrange to play in a single session.<br/>\n<br/>\n I've used several of Max's contrivances but never \"as is\".  That's what you will need to refine.  Recognize your own playstyle, what is comfortable, then make alterations to well-established builds to better suit your biases.  Early on, you will be guessing at what might work for you. Eventually, you will follow a regimen closer to my own where one simply builds complete from scratch and then starts examining similar builds using the search engine.  9 times out of 10 I will discover a nuance in other builds, certain feat selections, a different ability spread, a racial variant, et al. that I may have glossed over and which would improve on my own ideas.  The real gems are all the input in the discussion where players elaborate on their own experience using varying techniques of each build's forte.  Essentially, it's the difference between theory and application.  One looks good on paper but the other involves interaction with the specific environment.<br/>\n<br/>\n And yes... Mick is EVIL by nature! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:01 AM - Jul 28, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>What you need to grasp from examining Max's builds is that they are all about sheer power (hence the term \"power-build\").   He doesn't mind wading into the fray, as overwhelming as it might appear, and then depending on his intrinsic build characteristics to dominate any encounter to the best his design has to offer.  In other words, he doesn't mind dying occasionally if he is getting a buzz from the build's inherent strengths.  That's why you don't see him playing archers or sneakers (well, at least I never have) or building them.  Just too tactical and time-consuming for his style.  After all, there are many more builds for him to devise and play, eh?<br/>\n<br/>\n And yes... Mick is EVIL by nature! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /> (Hip swims with the fishes...)</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "9:43 AM - Jul 28, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>And yes... Mick is EVIL by nature! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /></div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:07 AM - Jul 28, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>\n Regardless, Blood and Faith seems to have everything I could want in/from a Cleric build<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">This is a powerhouse, a classic!<br/>\n And it is fairly strong, even without the cleric buffs, so it is hard to go wrong here.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "9:48 PM - Jul 28, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Mick Dagger wrote:</strong><hr/>\n<blockquote><div><strong>HipRedux wrote:</strong><hr/>And yes... Mick is EVIL by nature! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /></div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:03 AM - Jul 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/><div align=\"left\">It's that <strong><a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/2350273/\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#0000FF\">Divine Bomber</span></a></strong> that proves it.  //  join the dark side.  Possibilities will open up beyond anything you've ever experienced before.  I'm quite certain I've never seen an ability spread or class split like that anywhere.  Not even close.</div>\n</div></blockquote>\n That reeks of evil.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "12:08 AM - Jul 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>I noticed the onion eater built an epic version of this with better fort (i.e. Wicked Rain).  Then Mith and GDL each proffered another. Count 'em: <span style=\"font-size:200%;line-height:normal\">3!</span>  Looks like you have some rarified company joining your evil deeds, Mick. <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /></div></blockquote>\n<div align=\"left\">It is an honour to be listed up along with those three.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:00 PM - Jul 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Good - we've got all snuggly and nice.<br/>\n<br/>\n Meanwhile, back in the game...<br/>\n<br/>\n A couple of things. First: I'm making a complete dog's breakfast of it as a Cleric so far. It's a huge difference in playing style for me. Admittedly, I've not gone far, but regardless, I should be performing better. I'm going to do some minor cheating by trying to get it right in the OC first (I guess I've started treating that as my training programme).<br/>\n<br/>\n And second: is it right that I'm getting no xp from killing things? Quests and so on, fine, but nowt at all?<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "10:38 PM - Jul 31, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>A couple of things. First: I'm making a complete dog's breakfast of it as a Cleric so far. It's a huge difference in playing style for me. Admittedly, I've not gone far, but regardless, I should be performing better. I'm going to do some minor cheating by trying to get it right in the OC first (I guess I've started treating that as my training programme).<br/>\n<br/>\n<br/>\n  </div></blockquote>\n Nah. The tougher it is, the faster you'll learn. All the OC does is show a new player how to use the game interface. Combat situations are pitifully pedestrian and actually encourage bad habits.  Stick with it. Be resourceful.<br/>\n<br/>\n First off, what toon level?  I'm assuming a cleric 1 with at least 16 WIS.  You should be slotting Magic Weapon, Shield of Faith and either Bless or Div Favor.  If they have them and can afford them, use Bless/Aid pots and slot DF instead of Bless.  By cleric 2, Bless duration will be double Div Favor but you'll have the extra slot.  If you are really struggling, slot a summon.  If there are skels/zombies, try turning them before moving into melee.  Worse case scenario, slot all 3 summons to tank, pick up an xbow and snipe until your cleric gains some more prowess and HP. So what build did you finally settle on so we can follow in our playbooks?<br/>\n<br/>\n A key module question:  What are the rest restrictions, if any?<br/>\n<br/>\n 2nd question: What domains did you select?\n<blockquote><div>And second: is it right that I'm getting no xp from killing things? Quests and so on, fine, but nowt at all?<br/>\n  </div></blockquote>\n<div align=\"left\">Didn't know if this series used that system, too.  Almraiven is pretty much played this way, with most all XP coming from quest's completion (and there are piles of those) with the combat relegated to just an obstacle to survive.  If the module has respawning encounters, it prevents players from farming cheap XP and leveling with little effort.  Not sure if that's the case here, but it is a quite common way to control challenge.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:24 AM - Aug 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Yeah, you get experience from quests, not from combat. It takes some getting used to, for sure, but it works.<br/>\n Make a series of saved games like 1 2 3 and 4, or whatever you want to name them, and save every time there might be some combat soon (for example, before opening a door), cycling through those 4 saves. If combat does indeed happen and doesn't go well, load that save and buff up before proceeding. For more significant events, make a \"named\" save like you usually do. Also, rest more often to restore those used spells. As you level up and get more buffs, you will become more and more powerful.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:22 PM - Aug 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n<blockquote><div><strong>Stagmeister wrote:</strong><hr/>A couple of things. First: I'm making a complete dog's breakfast of it as a Cleric so far. It's a huge difference in playing style for me. Admittedly, I've not gone far, but regardless, I should be performing better. I'm going to do some minor cheating by trying to get it right in the OC first (I guess I've started treating that as my training programme).<br/>\n<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n 1. Nah. The tougher it is, the faster you'll learn. All the OC does is show a new player how to use the game interface. Combat situations are pitifully pedestrian and actually encourage bad habits.  Stick with it. Be resourceful.<br/>\n<br/>\n 2. First off, what toon level?  I'm assuming a cleric 1 with at least 16 WIS.  You should be slotting Magic Weapon, Shield of Faith and either Bless or Div Favor.  If they have them and can afford them, use Bless/Aid pots and slot DF instead of Bless.  By cleric 2, Bless duration will be double Div Favor but you'll have the extra slot.  If you are really struggling, slot a summon.  If there are skels/zombies, try turning them before moving into melee.  Worse case scenario, slot all 3 summons to tank, pick up an xbow and snipe until your cleric gains some more prowess and HP. So what build did you finally settle on so we can follow in our playbooks?<br/>\n<br/>\n 3. A key module question:  What are the rest restrictions, if any?<br/>\n<br/>\n 4. 2nd question: What domains did you select?\n<blockquote><div>And second: is it right that I'm getting no xp from killing things? Quests and so on, fine, but nowt at all?<br/>\n  </div></blockquote>\n<div align=\"left\">5. Didn't know if this series used that system, too.  Almraiven is pretty much played this way, with most all XP coming from quest's completion (and there are piles of those) with the combat relegated to just an obstacle to survive.  If the module has respawning encounters, it prevents players from farming cheap XP and leveling with little effort.  Not sure if that's the case here, but it is a quite common way to control challenge.</div>\n</div></blockquote>\n<div align=\"left\">Many thanks for this, Hip. I've numbered your paras for ease of reference.<br/>\n<br/>\n 1. Fair enough. In for a penny, in for a pounding! I'm not sure \"the tougher it is, the faster you'll learn\" is always true, though: \"Great, you can count to 10, now here's the Principia Mathematica.\"<br/>\n<br/>\n 2. Aye, Cleric 1, with 16 WIS. I'm using Empyre's build as cited above - Level 20 Melee Cleric (C17/ F3) - it's post #17 on p2 of this thread. As for the slots (and it took me an embarrassingly long time to find where they were, that's my level of unfamiliarity with casters!), I'd looked at Max's guide and slotted 2xDiv Favours and 1xShield of Faith. Max agrees that Bless is a non-vital, along with Prot from Alignment, Mage Armour and Endure Elephants (<img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />), but doesn't mention Magic Weapon at all, so I didn't think of it.  I'm loath to use summons if I can avoid it. I always have been, in Baldur's and Icewind as well (my only other two RPGs), and normally tell any caster companion not to cast them. Don't know why, guess it's just me. I decided to leave Blood and Faith for either SoU/HotU/Sands of Fate or, more likely, Aielund, where it can stretch its legs properly.<br/>\n<br/>\n 3. Er, don't know. Will find out.<br/>\n<br/>\n 4. Magic and Trickery, as per Empyre's build (was tempted by War, but didn't want to bugger around with a build on my first go!).<br/>\n<br/>\n 5. Alright then. I'm sure I'll get used to it, and Shadowlords is not billed as being combat-heavy in any case, so whatevs.<br/>\n<br/>\n Cheers - or (to nick Kail's line, via Tennyson) To seek, and not to yield<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, just read your reply to Empyre's build, Hip (post #19), and with his permission, I'll amend accordingly (assuming I understand it properly, of course!)</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "2:33 PM - Aug 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>Yeah, you get experience from quests, not from combat. It takes some getting used to, for sure, but it works.<br/>\n Make a series of saved games like 1 2 3 and 4, or whatever you want to name them, and save every time there might be some combat soon (for example, before opening a door), cycling through those 4 saves. If combat does indeed happen and doesn't go well, load that save and buff up before proceeding. For more significant events, make a \"named\" save like you usually do. Also, rest more often to restore those used spells. As you level up and get more buffs, you will become more and more powerful.</div></blockquote>\n<div align=\"left\">Thanks Empyre. I would have replied in the post above, but multiple quotes scare me (even though, yes, I have made a note of how to do it).<br/>\n<br/>\n I'll go out on a limb, and guess that alignment, and <em>how</em> one completes quests, must play a greater part in this campaign, if xp is only gleaned from them.<br/>\n<br/>\n Great tip for making saves: I'll be using it.<br/>\n<br/>\n You mention resting more often: do you happen to know whether there are restrictions in place (as per Hip's question, above)?<br/>\n<br/>\n Cheers<br/>\n<br/>\n<em><strong>EDIT:</strong></em> Sorry, would it be okay with you if I take Hip's modifications to your build on board?</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:12 PM - Aug 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>\n<div align=\"left\">Many thanks for this, Hip. I've numbered your paras for ease of reference.<br/>\n<br/>\n 1. Fair enough. In for a penny, in for a pounding! I'm not sure \"the tougher it is, the faster you'll learn\" is always true, though: \"Great, you can count to 10, now here's the Principia Mathematica.\"<br/>\n  </div>\n</div></blockquote>\n Look at it like this.  You're washed ashore on an island where a keen knowledge of mathematics will prove the difference between life and death then stumble upon that text.  Trust me.  You'll either get resourceful as heck quick or die a slow death.  Pressure:  What makes men evolve.  Leisure:  What makes men think of more ways to find more opportunities for leisure.\n<blockquote><div>\n 2. Aye, Cleric 1, with 16 WIS. I'm using Empyre's build as cited above - Level 20 Melee Cleric (C17/ F3) - it's post #17 on p2 of this thread. As for the slots (and it took me an embarrassingly long time to find where they were, that's my level of unfamiliarity with casters!), I'd looked at Max's guide and slotted 2xDiv Favours and 1xShield of Faith. Max agrees that Bless is a non-vital, along with Prot from Alignment, Mage Armour and Endure Elephants (<img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" />), but doesn't mention Magic Weapon at all, so I didn't think of it.  I'm loath to use summons if I can avoid it. I always have been, in Baldur's and Icewind as well (my only other two RPGs), and normally tell any caster companion not to cast them. Don't know why, guess it's just me. I decided to leave Blood and Faith for either SoU/HotU/Sands of Fate or, more likely, Aielund, where it can stretch its legs properly.<br/>\n  </div></blockquote>\n That's for the road map back.  Didn't know if you used that, some modification or another altogether.  Magic is fine.  But unless there is either permahaste items or a dpendable stock of speed pots, you are handicapping your toon.  But I did assert that pressure breeds resourcefulness and invention, right?  So go for it.<br/>\n<br/>\n Max's advice is wrong.  After Cleric 1, the duration of DF's AB boost is increasingly short in comparison.  Once you have access to an extended DF version, THAT's the time to fill up your spell level 2 slots with them.  The +1 divine damage is nice but your first goal is to hit as often as possible as long as possible so that damage has a chance to occur.  If you don't believe me, do some testing in a trainer.  Unless your foes are all dispatched in a single turn, that loss of AB will come back to haunt you.  Bless, Aid, DivFavor, Prayer, Battletide.  These are all \"vital\" AB buffs for a cleric.  Bless and Aid just happen, together, to raise your AB +2 for 10 times the duration of Prayer/Battletide and at least double the duration of DF after Cleric 1.  Spend fewer rounds rebuffing.  Each of those \"time out\" rounds your toon will be receiving damage and loosing out on oh-so-precious attack opportunities.<br/>\n<br/>\n As soon as you pick up your +1 weapon will be the last time you will slot MW.<br/>\n<br/>\n I had a similar bias towards casting summons.  But all that bias dissipated when I began engaging in encounters that could not be survived without at least a temporary postponement of being focused on by the entire attacking hoard.  Since this campaign just happens to be content where combat XP is not a factor, and especially if you are struggling to solo... summon the help available.  It's part of your divine discipline.  Actually, those skels (i.e. Animate Dead, cleric 6+) are much better helpers because 1) they cannot be critted, feared or dominated and 2) you can buff their weapon (ala MW &amp; darkfire).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:39 PM - Aug 01, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>HipRedux wrote:</strong><hr/>\n 1. Pressure:  What makes men evolve.  Leisure:  What makes men think of more ways to find more opportunities for leisure.<br/>\n<br/>\n 2. Max's advice is wrong.  After Cleric 1, the duration of DF's AB boost is increasingly short in comparison.  Once you have access to an extended DF version, THAT's the time to fill up your spell level 2 slots with them.  The +1 divine damage is nice but your first goal is to hit as often as possible as long as possible so that damage has a chance to occur.  If you don't believe me, do some testing in a trainer.  Unless your foes are all dispatched in a single turn, that loss of AB will come back to haunt you.  Bless, Aid, DivFavor, Prayer, Battletide.  These are all \"vital\" AB buffs for a cleric.  Bless and Aid just happen, together, to raise your AB +2 for 10 times the duration of Prayer/Battletide and at least double the duration of DF after Cleric 1.  Spend fewer rounds rebuffing.  Each of those \"time out\" rounds your toon will be receiving damage and loosing out on oh-so-precious attack opportunities.<br/>\n<br/>\n 3. Since this campaign just happens to be content where combat XP is not a factor, and especially if you are struggling to solo... summon the help available.<br/>\n  </div></blockquote>\n<div align=\"left\">1. Or implode. As to leisure: what's the problem? Something wrong with leisure? <em>That's</em> where progress lies - finding ways to have more leisure time. Transport, communications, pretty much all technology, all designed to give more leisure time. Granted, it never, ever works, (although I do feel for Einstein and Oppenheimer) but the principle is there. Anyhow, we could discuss this forever, but NwN is currently taking up all my leisure time <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n 2. Really good to know. And of course I believe you!<br/>\n<br/>\n 3. Oddly, I just reloaded from the beginning, and I got 16 xp for each of the fire beetles I splatted this time (?!).<br/>\n<br/>\n Yours sincerely, Baffled of Sheffield</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:26 AM - Aug 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">In the beginning, when you don't have magic armor, a magic shield, or an amulet that boosts AC, the Mage Armor spell gives you +4 AC, which is one of the reasons I like the Magic domain (the other is Stoneskin). Later, when you have those magic items, Mage Armor only gives you 1 Dodge AC which stacks, and the others don't stack, so that is when to stop using Mage Armor. I just looked at my save game from the end of Demon, and I have gauntlets of Haste, so taking Travel for Haste is not needed.<br/>\n<br/>\n You do not need my permission to change my build when you play it. If you want to make changes to fit your playstyle, feel free, but you risk weakening the build. On the other hand, if you make changes following the advice of someone like Hip, there is not much risk.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:20 AM - Aug 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Empyre65 wrote:</strong><hr/>In the beginning, when you don't have magic armor, a magic shield, or an amulet that boosts AC, the Mage Armor spell gives you +4 AC, which is one of the reasons I like the Magic domain (the other is Stoneskin). Later, when you have those magic items, Mage Armor only gives you 1 Dodge AC which stacks, and the others don't stack, so that is when to stop using Mage Armor.</div></blockquote>\n Actually, it's only +3 since Shield of Faith furnishes +2 deflection at Cleric 1.  Most environments offer Barkskin pots at a nature store, which further reduces it to +2 bonus.  Then at Cleric 5, Magic Vestment furnishes the armor (and shield) enhancement so then you are left with just the dodge benefit (or +2 w/o Barkskin), all without any special gear.  But, yes, the Stoneskin is a very nice adjunct.\n<blockquote><div>I just looked at my save game from the end of Demon, and I have gauntlets of Haste, so taking Travel for Haste is not needed.<br/>\n  </div></blockquote>\n<div align=\"left\">Hmmm... permahaste.  That is indeed worth noting.  A non-dispellable haste enhancement. Priceless.  And since this cleric 15 will never be needing to haste his Iron Golem polymorph, Travel would be redundant.<br/>\n<br/>\n Stagmeister and I will act surprised and shocked when we find them like the birthday boy who noticed the shiny, new bicycle with a bow on it semi-concealed in the backyard before blowing out the candles.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "3:56 PM - Aug 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks, Both! Am progressing a little better, though I've just thrown my back out trying to pick up a cartwheel which I hadn't noticed before. Ooh, I've got a cantrip for that! <img class=\"emoji-placeholder\" src=\"/emoji/dummy.png\" /><br/>\n<br/>\n Not game specific, but I'll chance my arm: is there any benefit/peril in choosing a deity in character creation? Does it work like schools of magic, or is that all covered in domain choices? I didn't bother with this build, but will do next time if it would be helpful.<br/>\n<br/>\n Cheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "4:17 PM - Aug 02, 2016",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>Not game specific, but I'll chance my arm: is there any benefit/peril in choosing a deity in character creation? Does it work like schools of magic, or is that all covered in domain choices? I didn't bother with this build, but will do next time if it would be helpful.<br/>\n<br/>\n<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Deities have been provided by BioWare because <strong><a class=\"postlink\" href=\"http://dungeons.wikia.com/wiki/DnDWiki:List_of_deities\" rel=\"noreferrer\" target=\"_blank\"><span style=\"color:#0000FF\">WotC rules</span></a></strong> list them so they built them in.  Only if the environment specifically controls the influence of deities by custom scripting does it matter at all.  I remember one occasion in HotU, I think it was in the lower dungeon of the Beholder Caves, that OnEnter they scripted some sort of bonus when your cleric prayed to its deity.  I suspect this was intended to involve the influence of a deity more specifically but was never really developed further.<br/>\n<br/>\n For example, on WoG, a deity can limit the acceptable race, alignment, domain combination and even provides bonuses for certain weapon types and all clerics MUST declare one before leveling as cleric or at creation else just get stuck at that level.   I doubt the Adam Miller suite involves deities otherwise Empyre or Valerfor (or somebody else who's played the campaign as a cleric) would have already mentioned it.<br/>\n<br/>\n Short answer, I guess, is \"No\".<br/>\n<br/>\n edit: found link to deity rules</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "6:15 PM - Mar 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Alright, folks! This topic has been dormant forever, but I'd like to comment on a few things, seeing as my name was mentioned a couple of times.<br/>\n<br/>\n 1- Stag, I build for level 40 power. That's my style, and I rely on my experience as a NWN player to overcome the challenge. You may need to learn a few of my \"signature moves\" to level my builds less painstaikingly, such as the Taunt / Expertise combo, which AFAIK I'm the only player who knows how to utilize properly (and automatically). As for my Cleric builds, I would recommend that you stick to the leveling strategy portrayed in the guide if you wish to level them up. Clerics are NOT self-buffers until level 7, maybe even level 9, and they NEED you to adopt a different playstyle to succeed. You basically need more long-duration strategies to gain more levels. The Animate Dead / Inflict Wounds strategy (to heal your undead summons) or even Healing Kits (which somehow heal skeletons LOL) are my preferred weapons. If you are playing Cleric as a self-buffer from level 1, you're doing it wrong! Do you think I'd be able to survive with my 8-STR Cleric / Monks if I went toe to toe with the enemy early on? Remember the guide: Embrio Stage is the hardest phase for a Cleric. Don't overestimate your power in the first levels. You're a weakling and should intelligently recognize that and act accordingly :D.<br/>\n<br/>\n 2- Hip, I'm NOT wrong. Bless is absolutely a non-vital buff. You, like Stag above, are playing your Cleric as a level 1 self-buffer, when you could be summoning instead. There's no reason to suffer unnecessarily trying to melee with a level 1-6 Cleric (whose buffs are all at +1 or +2 tops and have insignificant durations) when you can have much stronger beasts doing your bidding for you. After level 7, you'll have A COUPLE of instances of \"god mode\" per rest with DP / DF, or maybe even just 1, but a Skeleton Warrior buffed with Bull's Strength and Darkfire will still do most of the killing for you. In fact, you can even tank for it with Expertise and lower enemy AC with Taunt while it clears the screen of monsters, Alternatively, you can do the same with a henchman instead of the skelly. The most powerful buffs in the Cleric arsenal are the low-duration ones, and those will only become significant after level 9 (which is also when you get Extended Divine Power). However, you're most likely going to be summoning all the way to level 12 if you play correctly, since you won't be having enough instances of each spell to last you through the day. Of course, if you're playing with no rest restrictions, and you can rest after each encounter, then you might play it that way after level 9. I have tried to play Clerics as self-buffers from the getgo in the past, and that experience has taught me that it's much harder than just summoning and watching things die, especially since you get Animate Dead as a level 3 spell.<br/>\n<br/>\n 3- Low magic settings are where Clerics should shine, however, if this module only goes up to level 11, you won't even get to the best part of playing them which is about level 15 and over. So, if that's the case, then perhaps this module is better played with another type of toon.<br/>\n<br/>\n Cheers!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "HipRedux",
      "avatar": "10577588_1510287072.jpg",
      "timestamp": "7:54 PM - Mar 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">\"Wrong\" was not the most appropriate term, I suppose, Max.  \"Near-sighted\" would have been more accurate.  In any case, play style differences not withstanding, there is no single best way to play any class and this is not the topic to debate your guide so I'll refrain from further rebuttal of your points. Perhaps, when I have the time I'll revisit your cleric guide in more detail now that you've returned from your self-imposed sabatical.  Until then, let's just agree to disagree.  A guide is simply a guide, a nudge towards a productive path.  It's not the Holy Grail.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:03 PM - Mar 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Maximillian Kane wrote:</strong><hr/>Alright, folks! This topic has been dormant forever, but I'd like to comment on a few things, seeing as my name was mentioned a couple of times.<br/>\n<br/>\n 1- Stag, I build for level 40 power. That's my style, and I rely on my experience as a NWN player to overcome the challenge. You may need to learn a few of my \"signature moves\" to level my builds less painstaikingly, such as the Taunt / Expertise combo, which AFAIK I'm the only player who knows how to utilize properly (and automatically). As for my Cleric builds, I would recommend that you stick to the leveling strategy portrayed in the guide if you wish to level them up. Clerics are NOT self-buffers until level 7, maybe even level 9, and they NEED you to adopt a different playstyle to succeed. You basically need more long-duration strategies to gain more levels. The Animate Dead / Inflict Wounds strategy (to heal your undead summons) or even Healing Kits (which somehow heal skeletons LOL) are my preferred weapons. If you are playing Cleric as a self-buffer from level 1, you're doing it wrong! Do you think I'd be able to survive with my 8-STR Cleric / Monks if I went toe to toe with the enemy early on? Remember the guide: Embrio Stage is the hardest phase for a Cleric. Don't overestimate your power in the first levels. You're a weakling and should intelligently recognize that and act accordingly :D.<br/>\n<br/>\n<br/>\n Cheers!<br/>\n  </div></blockquote>\n<div align=\"left\">Ah - that's where we divide in our styles! I've been kicking myself for a long time about why I struggled with some of your (admittedly excellent) builds, when I, too, am an up-front and personal type of player by inclination. It's that you build for the destination, while I love the journey. I'm sure a lot of that is down to the fact that you've been playing since god was little (and are thus more capable than I in overcoming obstacles that seem insurmountable), while I'm only just potty-trained, and that I've never actually reached level 40 as yet - level 37 on Aielund is the closest I've been.<br/>\n<br/>\n Still, I'm better than I was, and am learning constantly, and with different types of build and style. Discussions such as this help hugely.<br/>\n<br/>\n Cheers</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "11:40 PM - Mar 03, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">What Max tells us about playing low level Clerics is very close to how I play my mages, and especially my low level sorcerers before they get enough spellpower. Taking good care of the familiar and the highest available summoned creature by buffing them and let them tank for you is the way to solo the early stages.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:21 AM - Mar 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Stagmeister wrote:</strong><hr/>\n<blockquote><div><strong>Maximillian Kane wrote:</strong><hr/>Alright, folks! This topic has been dormant forever, but I'd like to comment on a few things, seeing as my name was mentioned a couple of times.<br/>\n<br/>\n 1- Stag, I build for level 40 power. That's my style, and I rely on my experience as a NWN player to overcome the challenge. You may need to learn a few of my \"signature moves\" to level my builds less painstaikingly, such as the Taunt / Expertise combo, which AFAIK I'm the only player who knows how to utilize properly (and automatically). As for my Cleric builds, I would recommend that you stick to the leveling strategy portrayed in the guide if you wish to level them up. Clerics are NOT self-buffers until level 7, maybe even level 9, and they NEED you to adopt a different playstyle to succeed. You basically need more long-duration strategies to gain more levels. The Animate Dead / Inflict Wounds strategy (to heal your undead summons) or even Healing Kits (which somehow heal skeletons LOL) are my preferred weapons. If you are playing Cleric as a self-buffer from level 1, you're doing it wrong! Do you think I'd be able to survive with my 8-STR Cleric / Monks if I went toe to toe with the enemy early on? Remember the guide: Embrio Stage is the hardest phase for a Cleric. Don't overestimate your power in the first levels. You're a weakling and should intelligently recognize that and act accordingly :D.<br/>\n<br/>\n<br/>\n Cheers!<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Ah - that's where we divide in our styles! I've been kicking myself for a long time about why I struggled with some of your (admittedly excellent) builds, when I, too, am an up-front and personal type of player by inclination. It's that you build for the destination, while I love the journey. I'm sure a lot of that is down to the fact that you've been playing since god was little (and are thus more capable than I in overcoming obstacles that seem insurmountable), while I'm only just potty-trained, and that I've never actually reached level 40 as yet - level 37 on Aielund is the closest I've been.<br/>\n<br/>\n Still, I'm better than I was, and am learning constantly, and with different types of build and style. Discussions such as this help hugely.<br/>\n<br/>\n Cheers</div>\n</div></blockquote>\n<div align=\"left\">Potty Trained LOL!<br/>\n<br/>\n Stag, don't sell yourself short, brother! You might be getting closer to teenage years now. There's still a long way to go, but the most important thing is that you're moving in the right direction. But let me elaborate on this a bit further, since you like the discussions.<br/>\n<br/>\n Suppose you encounter a hurdle, right? Well, there are two basic ways to overcome that hurdle. You can:<br/>\n - Change your build<br/>\n - Change your in-game approach.<br/>\n<br/>\n So, if your hurdle is to not be able to open a lock, you can add a few points in Open Lock or you can buy a scroll of Knock and use it. Both get the job done. I have found that trying to compensate the \"gimpedness\" of a build with intelligent in-game decision making will make you a better player overall. You'll learn new ways to use your toons and that will add to your \"repertoire\" of moves. Let me give you a practical example:<br/>\n<br/>\n I was playing Nathyrra on WoG a while back and the Drow were just such a big PITA that I was literally getting annihilated over and over again. Then I switched a couple of spells I had memorized (Invisibility for Darkness) and I began to dominate them like never before. My problem was that, as an Assassin, I would attack the first mage and then the priestesses or secondary mages would have time to cast Time Stop, buff up and kick my ass. But If I cast Darkness just before engaging, the secondary ones wouldn't see me inside the darkness and I'd kill the first Wizard, then stealth again and kill off the rest, going back into the AoE of Darkness every time I needed to re-stealth.<br/>\n<br/>\n I could, of course, have tried to solve that problem by changing her build. Specifically this one might've been hard to do, but maybe adding SD for HiPS or something similar so I would avoid Dispel.<br/>\n<br/>\n Same resoning goes to any other problems you can encounter with many different builds. Switching an item could make an unwinnable fight doable (like putting on a death-immunity belt against a necromancer). Most problems you struggle with in-game can be solved in-game. To me, after having played for so long, that's what keeps it challenging and fun.<br/>\n<br/>\n My strongest builds are tough to play nowadays, because with my improved playstyle, I just trample everything now.<br/>\n<br/>\n Anyway, I hope this info is useful to you. I was reading my Playing Better guide and remembering what it was like to play the game before knowing what I know now. Have you read it? Maybe in the first part when I describe my journey, you can see part of yours too.<br/>\n<br/>\n Cheers!<br/>\n  </div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "8:49 AM - Jul 05, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I just started Shadowlords with this build:<br/>\nSpoiler [+]<br/>\n<br/>\n Adam's Dragon (Fighter 8 / Bard 4 / Red Dragon Disciple 8)<br/>\n Human, Non-Lawful<br/>\n Playable 1 - 20<br/>\n<br/>\n Abilities:<br/>\n STR: 16 (25)<br/>\n DEX: 14<br/>\n CON: 14 (16)<br/>\n WIS: 8<br/>\n INT: 14<br/>\n CHA: 10<br/>\n<br/>\n Leveling Guide:<br/>\n Human: (Quick to Master)<br/>\n 01: Fighter(1): Power Attack, Cleave, Weapon Focus: Longsword<br/>\n 02: Bard(1)<br/>\n 03: Fighter(2): Toughness, Knockdown<br/>\n 04: Fighter(3): STR+1, (STR=17)<br/>\n 05: Fighter(4): Weapon Specialization: Longsword<br/>\n 06: Red Dragon Disciple(1): Blind Fight<br/>\n 07: Red Dragon Disciple(2): (STR=19)<br/>\n 08: Red Dragon Disciple(3): STR+1, (STR=20)<br/>\n 09: Red Dragon Disciple(4): Improved Knockdown, (STR=22)<br/>\n 10: Bard(2)<br/>\n 11: Fighter(5)<br/>\n 12: Bard(3): STR+1, Lingering Song, (STR=23)<br/>\n 13: Fighter(6): Improved Critical: Longsword<br/>\n 14: Red Dragon Disciple(5)<br/>\n 15: Red Dragon Disciple(6): Lightning Reflexes<br/>\n 16: Red Dragon Disciple(7): STR+1, (STR=24), (CON=16)<br/>\n 17: Bard(4)<br/>\n 18: Fighter(7): Iron Will<br/>\n 19: Fighter(8): Great Cleave<br/>\n 20: Red Dragon Disciple(8): STR+1, (STR=25)<br/>\n<br/>\n Stats:<br/>\n Hitpoints: 248<br/>\n Skillpoints: 123<br/>\n Saving Throws (Fortitude/Will/Reflex): 16/13/12<br/>\n Saving Throw bonuses: Spells: +4<br/>\n BAB: 17<br/>\n AB (max, naked): 25 (melee), 19 (ranged)<br/>\n AC (naked/mundane armor/shield only): 19/29<br/>\n Spell Casting: Bard(0)<br/>\n Alignment Changes: 0<br/>\n<br/>\n Skills:<br/>\n Discipline 23(30), Listen 23(22), Lore 10(16), Perform 9(9), Spellcraft 18(20), Tumble 20(22), UMD 20(20)<br/>\n<br/>\n 01: Discipline(4), Lore(4), Save(12)<br/>\n 02: Listen(5), Lore(1), Perform(3), Tumble(5), UMD(5)<br/>\n 03: Discipline(2), Lore(1), Save(2)<br/>\n 04: Discipline(1), Lore(1), Save(5)<br/>\n 05: Discipline(1), Lore(1), Save(8)<br/>\n 06: Discipline(1), Listen(4), Lore(1), Spellcraft(3), Save(4)<br/>\n 07: Discipline(1), Listen(1), Save(7)<br/>\n 08: Discipline(1), Listen(1), Save(10)<br/>\n 09: Discipline(1), Listen(1), Save(13)<br/>\n 10: Discipline(1), Listen(1), Perform(5), Tumble(5), UMD(8)<br/>\n 11: Discipline(1), Save(4)<br/>\n 12: Discipline(1), Listen(2), Perform(1), Tumble(5), UMD(2)<br/>\n 13: Discipline(1), Lore(1), Save(3)<br/>\n 14: Discipline(1), Listen(2), Spellcraft(5)<br/>\n 15: Discipline(1), Listen(1), Spellcraft(1), Save(2)<br/>\n 16: Discipline(1), Listen(1), Save(5)<br/>\n 17: Discipline(1), Listen(1), Tumble(5), UMD(5)<br/>\n 18: Discipline(1), Save(4)<br/>\n 19: Discipline(1), Save(8)<br/>\n 20: Discipline(1), Listen(3), Spellcraft(9)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "5:55 PM - Jul 05, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Guys, do not forget that Adam Miller's little Campaign goes up to 17th lvl and not 12th.<br/>\n Empyre man, i really would like to see another type of build from you, Ftr/Bard/Rdd is really good but don't you feel you need to spice up things a little bit?<br/>\n  <i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "8:52 PM - Jul 05, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Valerfor wrote:</strong><hr/>Guys, do not forget that Adam Miller's little Campaign goes up to 17th lvl and not 12th.<br/>\n Empyre man, i really would like to see another type of build from you, Ftr/Bard/Rdd is really good but don't you feel you need to spice up things a little bit?<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Ah, Valerfor, this is the price you pay for absence - you and your Pillars of Destiny! You probably won't have caught Empyre's excellent <strong>Persuasive Archer </strong>(elf Rogue 17/ Wiz 1/ AA 22) build for Aielund - its on page 7 of the Aielund thread, but I reckon it should be in the Full Epic sub-forum - I've referred others to it several times ('cause I know soooo much).<br/>\n<br/>\n<em>~ Magic is impressive, but now Minsc leads - swords for everyone! ~</em></div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:36 AM - Jul 06, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">This is my second time playing this campaign. The first time was a Rogue 15 / Fighter 4 / CoT 1 (actually the first part of a Rogue 26 / Fighter 4 / CoT 10 because I didn't know how far the campaign went). I have a Cleric 17 / Fighter 3 planned for a future run. Fighter / Bard / RDD is a favorite of mine, but it is not all I play.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Valerfor",
      "avatar": "10235447_1565972826.jpg",
      "timestamp": "3:02 AM - Jul 06, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks for the update Stag ;-)<br/>\n And a nice archer it is, wasn't expecting that!<br/>\n<br/>\n Empyre, just checking on you man, as long as you have fun it's all good.<br/>\n It's not your fault that Ftr/Bard/RDD combo's are so ridiculously effective eh?<br/>\n<br/>\n As for mini-campaigns like that, you will want to search for <em><strong>Bastard of Kosigan</strong></em> guys, very nice trio of modules but i have lost their traces after the old Vault gone. You know, the biggest loss from that is that the old Vault had pages upon pages with comments from all players, that had played each game so you could understand what's going on and get a good picture before you even play it. Slowly but steadily the new one starts to accumulate these things too.<br/>\n<br/>\n ** Ah, it seems i found it! Check it out in the link below,<br/>\n<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/bastard-kosigan-english-version\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... sh-version</a><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:44 PM - Jul 06, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Valerfor wrote:</strong><hr/>\n As for mini-campaigns like that, you will want to search for <em><strong>Bastard of Kosigan</strong></em> guys, very nice trio of modules but i have lost their traces after the old Vault gone. You know, the biggest loss from that is that the old Vault had pages upon pages with comments from all players, that had played each game so you could understand what's going on and get a good picture before you even play it. Slowly but steadily the new one starts to accumulate these things too.<br/>\n<br/>\n  </div></blockquote>\n<div align=\"left\">Excellent, Valerfor - and that's what I'm hoping for from some of the threads I've started here. Learning and discussion. For me, it goes back to my first ever build request (the Non-Shooty, Non-Magicky Elf one), where everyone was pitching in with good stuff - way beyond the build itself. I feel others (as well as my own continuing journey) should be able to benefit from the wealth of experience out there. I know this is primarily a character building site, but no knowledge gained is wasted.</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "6:22 PM - Jul 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\"><blockquote><div><strong>Valerfor wrote:</strong><hr/>\n As for mini-campaigns like that, you will want to search for <em><strong>Bastard of Kosigan</strong></em> guys, very nice trio of modules but i have lost their traces after the old Vault gone.<br/>\n<br/>\n ** Ah, it seems i found it! Check it out in the link below,<br/>\n<a class=\"postlink\" href=\"https://neverwintervault.org/project/nwn1/module/bastard-kosigan-english-version\" rel=\"noreferrer\" target=\"_blank\">https://neverwintervault.org/project/nw ... sh-version</a><br/>\n  </div></blockquote>\n<div align=\"left\">Quick update: I've just checked out Bastard of Kosigan - looks good - but I think it's now five modules, which should get you to around level 20/21 - and you're automatically levelled up to 8 at the beginning of the first part (Exile of the West). I digress, sorry. Back to Mr Miller's campaign...</div><i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "10:26 PM - Sep 07, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Right, it's been a while, but I'm giving this campaign a proper go now. Admittedly, I've only just started upon it - lost children, rings, fire beetles, noodles, retrieving necklaces and healing the old - but as a male PC, is there any way of resolving the \"Love Potion No.9\" quest? If not, and being too weak and feeble to lift a cartwheel, should I now be heading out with Thistle? There are still plenty of named NPCs who aren't currently inclined to talk with me, so will I be back in Scornubel any time soon?<br/>\n<br/>\nI just don't want to miss out on stuff, is all...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "1:35 AM - Sep 09, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">The NPCs who wont talk to you never will. They are just there to make the town look lived in. As for those other two \"quests\", if you don't have the right gender or strength, there's nothing you can do, as far as I know.<br/>\n<br/>\nI am well into Dreamcatcher right now, and haven't returned to the starting town yet.<br/>\n<br/>\nI am like you, wanting to get maximum experience points.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:31 PM - Sep 09, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Empyre, that saves me from further pointless wandering! I suppose I could invest in a Bull's pot for the cartwheel, but at this stage that's quite some expense for what I'd imagine to be a small xp reward.<br/>\n<br/>\nBtw, despite all the cleric talk earlier on in this thread, I've gone for your Fighter 8 / Bard 4 / RDD 8 build cited previously. It's been a long time since I've played an RDD, so am looking forward to it.<br/>\n<br/>\nCheers<br/>\n<br/>\n<strong><em>EDIT:</em></strong> Sorry, just been playing, so have another question or two. Would I be right in assuming that there is no way to access henchmen's inventories? It's not that I want to steal stuff from them, but I can't carry the full load of loot, so wanted to share it out a bit with Anera. Maybe Aielund pampered me too much with its hench interaction/AI. As it is, I've just met Preth and the Red Guards and had to drop a couple of cases of loot near his camp (hopefully for later retrieval). I'm now searching for a suspect scout, but still at level 2. As far as I can tell, I cleared Eureka of all its nasties (although that ghostly voice in the brothel still hasn't gone away). Does that sound about right? Don't get me wrong, my PC is still performing perfectly adequately, it's just that I have no terms of reference.<br/>\n<br/>\nThanks<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "2:06 AM - Sep 10, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If you're playing the same build as me, then you shouldn't have had trouble with that wheel. I didn't. These modules were made way back before the expansion packs, so you can't access the henchman's inventory just like the OC. That map has a merchant (at least somebody you can trade with), so you'll just have to walk there very slowly, once you find him (or as it a her? I honestly forget).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "9:41 PM - Sep 10, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sorry, but the wheel beat me (STR 16) 4 times. Odd. The trader is indeed a she, and a very welcome sight.<br/>\n<br/>\nNow, and I'm embarrassed to 'fess up to this one, I'm in the Fist of the Future temple in Hills' Edge and those damned levers are confounding me. I had initially thought that the Rook/King pieces would be useful, but of course I can't give one to Anera as you state above, so I can't location swap. The only other thought I have left is that the Puzzle Ring I've hung on to from the first part might be beneficial here. Otherwise I'm stuck. Help, please - even if in 'spoiler' form! (That said the old spoiler trick doesn't seem to work in our new home)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "10:32 PM - Sep 10, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">If I remember correctly...<br/>\nPut one chess piece in the barrel next to the door you want to open. Then use the lever,  and then your remaining chess piece.<br/>\nIf I remember correctly that is.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "12:36 AM - Sep 11, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That puzzle had me stymied the first time I played this campaign. It didn't occur to me to think of a barrel as a person who could possess a chess piece.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "12:54 AM - Sep 11, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Oh, you are good people - thank you! At least my first thought about the chess pieces wasn't totally wrong - just who/what I gave them to! Was going to do a bit of work now, but instead I'm back to the game - hoorah!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:50 PM - Sep 11, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I finished Dreamcatcher last night and killing the final boss leveled me to level 13.<br/>\n<br/>\nWhen I reached level 12, I decided not to take Lingering Song because I thought it was a bit silly to waste a feat on such a weak Bard song. I sat for a long time trying to come up with a better feat to take, and I finally wound up taking Dodge (+1 AC against one opponent). I had considered Weapon Focus: Longbow or Resist Energy (but what kind?) or Skill Focus (but which skill?).<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Stagmeister",
      "avatar": "10404082_1510287071.jpg",
      "timestamp": "1:05 AM - Sep 12, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">That's good info, Empyre - thanks. I've just entered Stonemeet and picked up a couple of quests - and have recently gone up to level 6 and taken my first RDD level. I confess, I swapped taking Blind Fighting for Knockdown (levels 3 and 6), and it proved useful when exiting Skull Gorge. Anyway, back on track now. I've had Anera as my hench/love interest, have you taken her or one of Tiera and Nooble? I just preferred a Cleric over a Rogue, and another front-liner seemed superfluous.<br/>\n<br/>\nOh, and I picked up the Half Orc (Og-Hruth?) in Skull Gorge, but he sadly shuffled off this mortal coil when facing the Orc Chieftain. Alas, there was no resurrection option for him, but I noticed that, contrary to previous information, this time I am getting xp for killing stuff, and it does alter according to the number of henchies you're travelling with.<br/>\n<br/>\nI suspect I've read more into Shadowlords (the first part of the triology) than I should - too much Aielund play, probably - but it's an interesting module, and I'm led to believe that Dramcatcher (the second part) is of significantly higher order.<br/>\n<br/>\nCheers<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "3:35 AM - Sep 12, 2017",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I chose Anera again this time. Next time I play this campaign, I plan to be a male cleric, and I'll choose Tiera.<br/>\n<br/>\nThe no-experience-points-for-killing doesn't begin until Dreamcatcher.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Noctem",
      "avatar": "10759073_1554507612.jpg",
      "timestamp": "6:33 PM - Sep 22, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">N-n-n-necro! <br/>\nTop o' the mornin' to ya, ECBers! So, I'm trying to play through this mod for Shytes and Gyggles (and because task-avoidance is high on my list of priorities when it comes to IRL deadlines and responsibilities) but I'm stuck in the Ancient Temple. Does anyone know of a walkthrough or other helpful advice? So as not to spoil anything: \n<details><summary>Spoiler</summary>I'm stuck in the lower level of the ancient temple. I've already turned into a faerie and gotten the boots, I've already figured out the chess piece trick using barrels, and I've picked up a few notes lying around but nothing has changed in my journal. Now I'm just stuck. What do I do next? I've explored the entire map of this level and I don't see any way out of this level other than back up the way I came. Am I just missing something obvious?\n</details>\n\nThanks in advance!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Empyre65",
      "avatar": "10235276_1510287070.gif",
      "timestamp": "7:10 PM - Sep 22, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I don't remember all of the details of that temple, but if you have explored all of that level, then maybe something you have done there will give you access to somewhere that was blocked for you before on another level.<br/>\n<br/>\nAlso, it turns out that Tiera is a nice companion to have.  She grants you some nice magical bonuses as the story progreses.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Noctem",
      "avatar": "10759073_1554507612.jpg",
      "timestamp": "7:25 PM - Sep 22, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Thanks Empyre, I'll head back upstairs and retrace my steps. I seriously hope this isn't boffoed, because I don't have any old saves prior to hitting this level of the temple. Granted, I'm not <em>that </em>far into the story, but 'twould suck nonetheless to have to start over from scratch. <br/>\n<br/>\nAlso, I'm running with Tiera as my companion. I'm playing a CN toon and didn't think it made much sense to be gallivanting around with a celestial. I'm intrigued to progress farther and learn about her future magical bonuses...<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Noctem",
      "avatar": "10759073_1554507612.jpg",
      "timestamp": "10:35 PM - Sep 22, 2019",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">zOMFG, /facepalm. Turns out there's a whole other dungeon down there that I skipped because I'm used to the NWN convention of exit doors on the left and right leading to the same place. Well, turns out Mr. Miller broke from convention, and even though both doors lead down, they lead down to entirely different dungeon complexes. Well played, sir; well played indeed.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}