{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Modules",
  "forum_id": "001",
  "id": "025",
  "name": "Endless Nights VI CEP 2.0",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/endless-nights-vi-cep-2-0-t522772.html",
  "author": "Merctime",
  "avatar": "10758890_1523693739.jpg",
  "replies": 3,
  "posts": [
    {
      "author": "Merctime",
      "avatar": "no_avatar.png",
      "timestamp": "11:42 AM - Nov 09, 2011",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\">Hey there everyone.  Thought I'd toss this out there, as I think it's great for some fun time-wasting and the ability to test out builds, etc.  As far as modules are concerned, this one has the lightest storyline possible.  It is basically a hack and slasher that uses random quests and dungeon types.  basically, in each area there is one or two NPC's that can be found that give 'quests', and you should only have one quest in your journal at a time.  The quests are almost always \"I have heard there is a (insert monster name here) over in (insert area name here).  Will you kill it for me?\" type.  The idea is to gain levels and XP by a mix of free killing at random, and doing these quests.  As I say there is next to no storyline content, picture this as NWN but 'arcade game' style.  You don't rescue princesses, meet interesting NPC's, etc...  You just run around and kill things and hope they drop something cool.  If it sounds boring, well it may be to you... but it's actually pretty fun to me.  This particular version, version 6, uses the CEP 2.0 and is very, very magic light.  Some of the other versions by the same author (\"Havlen\") are NOT... I think I read in version four, finding +18-19-20 items is  very typical.  In this version, which I prefer, It takes a while to find +1, +2, and +3 items, and kind of hard to find many of them at all.  Most seem to be armor, weapons, and a robe or two, with only a few merchants to be found that sell items in other inventory slots.  In my opinion, a very neat place to try out builds, as you must rely on your build to do well.  <br/>\n<br/>\nHere it is:  <a class=\"postlink\" href=\"http://nwvault.ign.com/View.php?view=modules.detail&amp;id=5034\" rel=\"noreferrer\" target=\"_blank\">http://nwvault.ign.com/View.php?view=mo ... il&amp;id=5034</a>   To find the other versions, just search the vault for 'endless nights' or 'havlen'.<br/>\n<br/>\nSome things to consider:   Death is final in this mod.  The way it is set up is kinda arcade game style;  when you die, it's all over and no respawn, and you can't log into the module with that character again, but you do get this 'score' about how well you did this time around.  Because of this, the first few levels can be MADDENING, because a lucky roll or two can kill you and finish your try with that specific character in the first fight, ever.  There is a way around this though, if it seems like it's not something you like.... Just save and load the game.  I must have restarted like 5 times before I realized this.  That way, you can keep playing the same character indefinitely.  <br/>\n<br/>\nYou must start at level one with this mod.  And, you will start out with randomized class specific stuff.  With a rogue start, I have had leather armor every time, and sometimes a handaxe, shortsword, dagger, or rapier as my initial weapon, and 50 gold to buy stuff.  If you import previous characters into this module, they will be reset to zero experience and have their equipment taken and replaced like the example above.<br/>\n<br/>\nThe arcade style of play is pretty unlike your standard NWN game from the ground up.  You will not need any social skills whatsoever, spend them on combat enhancers totally.<br/>\n<br/>\nEquipment is hard to come by in this, the version 6 of this mod.  Read the documentation on how to get stuff.  Basically plan to be using normal items for like the first 6 levels, give or take.<br/>\n<br/>\nThis version has a few different 'creature sets' that will be the main ones encountered.  Each time you load up this mod, it will set up a different 'final boss' guy.  That final boss determines the majority of the creatures that the quest giving NPC's will want you to kill, on a game-per-game basis.  If it's undead, your build's that focus on critical damage will suffer accordingly... Just a heads up about this.<br/>\n<br/>\nAll in all, I think it's very fun and worth a download, however I'm betting either you're going to love it or hate it, seems to be no real in-between here.  Give it a try though, and watch your builds grow the way you planned them to, just without the gear you were hoping for probably hehe.  It's pretty fun, I think.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "11:25 PM - Apr 24, 2013",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">There's one question about this: What's the level cap? What level are you when you go kill the \"final boss\" thing? If it caps at 40, it can be quite interesting. Thanks for posting it. <br/>\n<br/>\nTake it EZ!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Mick Dagger",
      "avatar": "10235235_1549015559.jpg",
      "timestamp": "1:41 PM - Apr 23, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">I played through this mod with a weaponmaster character and finished the final boss at level 39, very close to 40.<br/>\nIt is like Merctime says, mostly pure hack'n slash. There is almost no story and you move in a linear fashion from area to area and get new quests and face new encounters of increasing level.  <br/>\nIt is very limited what you can buy from merchants.The magic level in the shops is low, mundane for the most part and +1-2 in some shops and maybe +3 or +4 on exceptional items in the city. There is a selection of healing potions and little else. Healing kits and potions of Clarity, Expeditious retreat and Death ward were easy to find. I found no magical bags.<br/>\nMost of the items you keep come from boss kills/chests, so you cannot plan on a specific equipment set-up. The magical level of these drops scale to some extent with the character level, and I saw a couple of +8/+9 items towards the end. After a while many, but not all weapon drops corresponded well with the weapon focus of my character. UMD is worthless. There were almost no traps to disarm and locks to pick. The quests were just a means to get new creatures to kill. But there is one exception: There is a city where you get goodwill after completing certain quests and can upgrade equipment accordingly.<br/>\nAll in all a straight hack'n slash mod where you can test your builds vs different creatures and at all levels.<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    },
    {
      "author": "Freaky Grandma",
      "avatar": "10758890_1523693739.jpg",
      "timestamp": "10:27 PM - Apr 15, 2018",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"commentText\">Sounds like a good testing ground for different builds. Save and reload is fine, would reload anyway if I die to avoid the respawn penalty. Nice touch that you get your first henchman for just 10 GP and can choose their race and class.<br/>\nWas looking for something like that to try some builds I found on this page. Roleplay-heavy modules will come later.<br/>\n<br/>\nEdit: Finished it two days ago with Hip's \"Lord of Terror\" build. Was more fun than I had thought. Killed the Final Boss at level 39 which got me to 40. From 1 to 40 in a single module, that is rare indeed!<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}