{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Persistent Worlds",
  "forum_id": "002",
  "id": "018",
  "name": "World of Torr",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/world-of-torr-t2353756.html",
  "author": "C1QP0X",
  "avatar": "no_avatar.png",
  "replies": 0,
  "posts": [
    {
      "author": "C1QP0X",
      "avatar": "no_avatar.png",
      "timestamp": "5:44 AM - Apr 30, 2014",
      "content": "<div class=\"content noskim\" data-tag=\"post_body_start\" itemprop=\"articleBody\"><a class=\"postlink\" href=\"http://torrcommunity.prophpbb.com/topic243.html\" rel=\"noreferrer\" target=\"_blank\">World of Torr, Forums: \"Getting Started [READ THIS FIRST]\" thread</a><br/>\n<br/>\nHere's a PW with some cool, yet seemingly common features that are unique in their own merits, in ways I've never seen in my 12 years of Neverwinter Nights. I won't list all the changes and their forums do them no justice, at all. But, for example: a Monk gains full BAB and flurry with quarterstaves, shurikens and spears as well as the usual unarmed and kama boni. Each class features something new and interesting and then some changes reflect on all character builds. They've made shitty spells more useful and toned down some of the more OP spells in the game. One can finesse any \"medium\" one-handed weapon, such as a longsword for instance, so long as you are not holding anything in your off-hand. Spears and quarterstaves are now finessable. The level cap is 25 w/ a custom EXP table that starts out easy, allowing one to get to the \"fun levels\" but then one must work their ass off to get to the higher levels. The server features a unique crafting system (no bullshit, it really is unique lol) and a \"secondary skill\" system. In a sense, the server features \"mana\" through a system of \"spell exhaustion\" but IDK how that really works yet. Lore actually has a cool use that makes you wanna put points in it for once. Custom custom custom custom blah-blah-blah. You get the idea!<br/>\n<br/>\nAnyways, it's a cool place to hang, low playerbase, GMs always in IRC but AFK a lot at times if you have questions. There's a link up top for a starter topic on their forums with hak information and how to direct connect. <br/>\n<br/>\nA cool, very immersive ship system will be implemented soon (I think, don't quote me on that, but I heard about it and it just sounded like a complete delight)<i class=\"hide\" data-tag=\"post_body_end\"></i></div>"
    }
  ]
}