{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Add ons",
  "forum_id": "003",
  "id": "008",
  "name": "Henchman Inventory & Battle AI",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/henchman-inventory-battle-ai-t515382.html",
  "author": "KailPendragon",
  "avatar": "10235214_1540245864.jpg",
  "replies": "0",
  "views": "1.3K",
  "posts": [
    {
      "author": "KailPendragon",
      "avatar": "10235214_1540245864.jpg",
      "timestamp": "10:23 PM - Jul 25, 2011",
      "content": "<div><a class=\"postlink\" href=\"http://nwvault.ign.com/View.php?view=Hakpaks.Detail&amp;id=4510\" rel=\"noreferrer\" target=\"_blank\">Henchman Inventory &amp; Battle AI mod v1.08 by Tony K</a><br/>\n<br/>\nThis highly configurable modification of NWN improves the intelligence of friends and foes, both inside and outside battle. Since its original release in July 2002, it has been tested by hundreds of people in the BioWare community. The mod works with or without the expansions. You can use it to play the Official, SoU, and HotU campaigns, as well as compatible fan-made modules. Prominent features are: 1) Improved battle tactics for all NPCs, especially with regard to weapon switching and spell casting; 2) Random roaming capability for monsters in the module; 3) Access to the inventory of familiars and animal companions; 4) Improved yet still legal feats and spell selection for the six standard OC henchmen; 5) More useful behavior (buffing, item-gathering) for henchmen outside battle. Most features can be turned on or off during installation.<br/>\n<br/>\nNew for v1.06: The mod now requires NWN v1.67 or later for all installs. Fix for inventory stackable hak due to changed baseitems.2da in NWN 1.67. Fixes and adjustments for spells and weapon. Fix for good familiar summons, barbarian rage removal using heal, and haste being cast multiple times in pre battle buffing.<br/>\n<br/>\n<br/>\n<br/>\n<strong>******************************</strong><br/>\n<br/>\n<br/>\n<br/>\nA must have if you want the extra challenge of an improved AI. It's not perfect but it's way better than BW's standard one.</div>"
    }
  ]
}