{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "General",
  "forum_id": "000",
  "id": "039",
  "name": "Arcane/Divine caster and best spellblade",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/arcane-divine-caster-and-best-spellblade-t2343529.html",
  "author": "babaGAReeb",
  "avatar": "no_avatar.png",
  "replies": "6",
  "views": "1.3K",
  "posts": [
    {
      "author": "babaGAReeb",
      "avatar": "no_avatar.png",
      "timestamp": "4:10 PM - Oct 08, 2013",
      "content": "<div>Can someone tell me what is the best spellblade build in NWN? gotta be human or half-elf<br/>\n<br/>\n<br/>\nAlso can anyone show me a good build who can cast both divine and arcane spells?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "11:05 PM - Oct 08, 2013",
      "content": "<div><blockquote><div><strong>babaGAReeb wrote:</strong>Can someone tell me what is the best spellblade build in NWN? gotta be human or half-elf\n</div></blockquote>\nBefore I hazard any suggestion, where are you planning on playing this toon?  A specific server name is best, but otherwise low-magic, mid-magic or high-magic would help narrow it down.\n<blockquote><div><strong>babaGAReeb wrote:</strong><br/>\nAlso can anyone show me a good build who can cast both divine and arcane spells?</div></blockquote>\n<a class=\"postlink\" href=\"http://home.comcast.net/~worldofgreyhawk/builds/data/build249788.html\" rel=\"noreferrer\" target=\"_blank\">Thax's</a> is the first one that caught my eye but there are a few other Mystic Theurge-type builds available thru the WoG search engine.  This is just one that I like quite a bit.<br/>\n<br/>\nBTW, you are new here so I recommend you read the <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/build-request-guidelines-t515448.html\" rel=\"noreferrer\" target=\"_blank\">guild's build request guidelines</a>.  They will help you to organize your contributions (and requests) better and get you build information faster by avoiding the 20-questions anomaly.  This (the General forum) is intended for basic questions.  I suggest you repost your inquiry <a class=\"postlink\" href=\"http://nwnecbguild.44.forumer.com/build-request-unfinalized-builds-f60563.html\" rel=\"noreferrer\" target=\"_blank\">in this area</a> as soon as you can and then add a reply here, linking to that new post (if you need help doing that I will help you provide that).  It's just easier for other members (and non-members) who are seeking  information similar to your request to find it in the section where it should be found.<br/>\n<br/>\nAnd...<br/>\n<br/>\nWelcome to the New ECB! We are glad you stopped by.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "12:05 AM - Oct 09, 2013",
      "content": "<div>Hey Hip, have you forgotten about my Magical Master?<br/>\n<br/>\n IMO it's the best build of its kind. It is an Elf, which is out of the OP's scope, but race there is absolutely not vital. You can change race if you want.<br/>\n<br/>\n Here is the link:<br/>\n<br/>\n<a class=\"postlink\" href=\"http://nwnecbguild.forumer.com/topic/515401/The-Magical-Master-Cleric-15Wizard-23Monk-2#.VOh4y-Z0zmQ\" rel=\"noreferrer\" target=\"_blank\">The Magical Master</a><br/>\n<br/>\n It's the best toon I have ever played. If used correctly, he's a MONSTER!!<br/>\n<br/>\n Have fun and welcome!<br/>\n<br/>\n P.S.: Hip is right, you should post this in the Build Request forum.<br/>\n<br/>\n Take it EZ!</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "2:47 AM - Oct 09, 2013",
      "content": "<div><blockquote><div><strong>Maximillian Kane wrote:</strong>Hey Hip, have you forgotten about my Magical Master?\n</div></blockquote>\nI've forgotten a lot, Max.  Probably the fact that you posted a zillion builds on the ECB doesn't help to boost my memory at all either.  We seriously need a search engine devoted to the new ECB builds.  It's on my \"to-do\" list.   <br/>\n<br/>\nActually your build has a lot in common with Thax's.  I like both of them.  Monk helps the cleric portion a lot.  It just depends on how high of a magic world it is intended for whether the offensive spell casting will be worth much.  At least you have the self-buffing aspect to fall back on if the creatures are too resistant.  The proof is, as usual, in the playing.</div>"
    },
    {
      "author": "babaGAReeb",
      "avatar": "no_avatar.png",
      "timestamp": "2:51 PM - Oct 10, 2013",
      "content": "<div>I don't play a server, never have only play modules fanmade or original.<br/>\nill go to the build request forum now thanks<br/>\nill try the magical master as human and that thax thing<br/>\nthe prob i got with magical master is it uses raipers and i dont like them cause thats not how you fight with a rapier! the animation for it is wrang are there other weapon alternatives?</div>"
    },
    {
      "author": "HipMaestro",
      "avatar": "10235222_1510287070.jpg",
      "timestamp": "5:22 PM - Oct 10, 2013",
      "content": "<div><blockquote><div><strong>babaGAReeb wrote:</strong>I don't play a server, never have only play modules fanmade or original.</div></blockquote>\nThen, in your request, state that fact up front.  A level 40 build may not be the best for you unless you expect to reach that level.  Many, if not most Level 40 builds are optimized AT Level 40 which are really builds that should be used on servers where you will be able to play it for a long time at Level 40.  Some epic (Level 40) builds can be adopted for fewer final levels, but that is the exception more than the rule.  The best is to design a build to match as close to the highest level you are likely to take that character.  Some content is spread over a series so only the last chapter needs to be considered for target character level.<br/>\n<br/>\nUsually, a module author will furnish beginning and ending character level targets.  Using that, build a character that is as optimized as possible throughout the entire leveling.\n<blockquote><div><strong>babaGAReeb wrote:</strong><br/>\nthe prob i got with magical master is it uses raipers and i dont like them cause thats not how you fight with a rapier! the animation for it is wrang are there other weapon alternatives?</div></blockquote>\nThe combat attack potential is DEX-based so needs to use a weapon that can be finessed (i.e. feat: Weapon Finesse).  The weapon must be one size smaller than the race and be finesse-able.  Those are dagger, handaxe, kama, kukri, light hammer, mace, rapier, shortsword, sickle, whip, and unarmed strike.  Plus rapier (the exception) for medium races (small races must use it two-handed so cannot be finessed for halfling or gnome).  The rapier and kukri (exotic) have the widest BASE crit range (18-20), followed by dagger &amp; shortsword (19-20).  All the others crit only on 20 (if my memory is having a good day).<br/>\n<br/>\nThose are your choices in any DEX build.  Any build that can self-buff extensively (like cleric) can gain a huge advantage by going the DEX route as long as there are no STR-based feats planned, like DevCrit for example.<br/>\n<br/>\nI hope this helps, but include your preferred weapon in your request as well as the other important guidelines so that the guild membership doesn't need to suggest builds that you won't enjoy playing.</div>"
    },
    {
      "author": "Maximillian Kane",
      "avatar": "10235244_1510287070.jpg",
      "timestamp": "5:36 PM - Oct 11, 2013",
      "content": "<div>Just correcting a bit of wrong information you may have gotten. The Magical Master is built to use kamas, not rapiers. You start with a Rapier because it's the best finesseable weapon for one that doesn't dual-wield. That is for the first 15 levels. You can use a mace, or any of the other weapons mentioned by Hip, as long as they are adequate for Finesse. However, if you forego Kamas, you won't have Monk custom attack schedule, which is one of the strengths of the build.<br/>\n<br/>\nHip is right, though, about using a build that will suit the place you're playing. This particular build reaches its full potential quite close to the end, which means that if you play a mod that takes you from 1-20, you probably won't see it flourish. It's not gonna be weak, no Cleric/Monk is, but it's definitely not going to show its \"true colors\". You start getting some serious firepower after level 31, so you're going to be a bit disappointed if you finish a certain campaign around level 25.<br/>\n<br/>\nTake it EZ!</div>"
    }
  ]
}