{
  "category_name": "NWN World",
  "category_id": "001",
  "forum_name": "Persistent Worlds",
  "forum_id": "002",
  "id": "019",
  "name": "LOTR Gondorvsmordor",
  "link": "https://www.tapatalk.com/groups/nwnecbguild/lotr-gondorvsmordor-t2321147.html",
  "author": "Chaozrulez",
  "avatar": "no_avatar.png",
  "replies": "2",
  "views": "2.0K",
  "posts": [
    {
      "author": "Chaozrulez",
      "avatar": "no_avatar.png",
      "timestamp": "11:55 AM - Feb 19, 2013",
      "content": "<div>Hello all,<br/>\nThis is my first post on the forum, I am playing for the last 3 years on <a class=\"postlink\" href=\"http://www.gondorvsmordor.com/gvm1/\" rel=\"noreferrer\" target=\"_blank\">http://www.gondorvsmordor.com/gvm1/</a><br/>\nIt's a great server with a lot of custom content like classes/spells etc like other servers and it has a great Middle-Earth setting with lots of maps.<br/>\nYou can go to lvl40 with up to 3 classes, lots of custom items in the game from 50 unique bosses taken from the Tolkien books so you can have indefinite build options.<br/>\nPlay as either Gond or Mord for PvP or join in a raid to burn Barad-Dur or pillage Rivendel!<br/>\nSince Gamespy is down please use +24.57.220.229:5121 for direct connect.<br/>\nCheers and kind regards!<br/>\nChaoz</div>"
    },
    {
      "author": "Chaozrulez",
      "avatar": "no_avatar.png",
      "timestamp": "4:40 PM - Jun 13, 2013",
      "content": "<div>Server IP has been changed, please use C:\\NWN\\nwmain.exe +connect 24.57.207.95:5121<br/>\nor check <a class=\"postlink\" href=\"http://www.gondorvsmordor.com/gvm2/forum/index.php?topic=3130.0\" rel=\"noreferrer\" target=\"_blank\">http://www.gondorvsmordor.com/gvm2/foru ... pic=3130.0</a></div>"
    },
    {
      "author": "10235326",
      "avatar": "no_avatar.png",
      "timestamp": "1:02 AM - Dec 03, 2013",
      "content": "<div>Over the past decade (yes, that's right I've been playing NWN for damn near a decade now   ), I've periodically gone through stages where I will get very into NWN and play it heavily...followed by periods of not touching it for multiple months. Throughout these oscillations I will say that there is one, and only one, PW Action server I have consistently returned to. <br/>\n<br/>\nGondor vs Mordor is an excellent action server. Whether you are into the Middle Earth setting or not (which they pull off really well actually), I highly recommend this server. Over many years (off and on) I have had several characters and none have actually ever attained level 40. That is to point out that the module is challenging, but not to say it is impossible. There are many level 40's, and I myself have attained a high of 36 before. It really is a server that caters well to those with skills at building great characters, much like many of you here!<br/>\n<br/>\nUnfortunately the GvM server took a crap over the summer and thus it was down for quite a few months, especially when many veterans wanted to come back. Luckily many of those wishing to continue playing have worked hard and even donated money to get a new server up and running. While it is currently a \"test server,\" the mod seems to be running as good as ever. This makes it a great time to jump in and explore GvM, as everyone is pretty close to a fresh start! (Some have already power leveled their Dragon Shifters to 40, but meh). The link below will take you to the GvM forum post that contains the current direct connect address. I'd love to have more people to build and play with.   <br/>\n<a class=\"postlink\" href=\"http://www.gondorvsmordor.com/gvm2/forum/index.php?topic=3152.0\" rel=\"noreferrer\" target=\"_blank\">http://www.gondorvsmordor.com/gvm2/foru ... pic=3152.0</a></div>"
    }
  ]
}